{
  "source": "https://www.techradar.com/reviews/hp-omen-25i",
  "title": "HP Omen 25i review",
  "category": "computing",
  "updated": "2021-07-13T16:37:40Z",
  "author": "mark-knapp",
  "summary": "An upgrade that doesn’t cut it",
  "verdict": "The HP Omen 25i brings fast and bright visuals with few faults to a price point that pits it against even faster monitors that are just as stunning. It could have been good if there was room for it.",
  "pros": [
    "Fast pixel response",
    "Easy visibility",
    "G-Sync Compatible"
  ],
  "cons": [
    "Better displays for the price",
    "Basic stand"
  ],
  "article": [
    "The HP Omen 25i, launching July 2021, is designed as an upgrade to the similarly named HP Omen 25. This new gaming monitor drops the old TN panel and upgrades it to an IPS panel with a few other upgrades, but it also comes with a price hike. The HP Omen 25i comes in at $349 (about £250, AU$450). Though the price makes sense when compared just to the predecessor, it brings it into a market that’s loaded with gaming monitors that don’t give it much room to stand out.",
    "We’ll get into the HP Omen 25i’s specifics shortly, but it’s simply not keeping up with the competition when there are similarly priced and even cheap monitors that are matching it on almost all specs and then going beyond it, like the $339 (about £240, AU$440) Pixio PX279 Prime with its 27-inch, 240Hz display or the Alienware 25 AW2521HF Gaming Monitor which also brings a 240Hz refresh rate to the table below $300. It’s also not hard to go for more resolution instead with the Gigabyte G34WQC or Monoprice Dark Matter 34 also in a similar ballpark but bringing a much bigger screen and still competitively fast refresh rate.",
    "This isn’t to say the HP Omen 25i is bad. It has some redeeming qualities. The design is simple, and the monitor sits on a stand that’s overly basic (vertical tilt only) for the price when looking at the competition, but HP did include a high-speed USB hub in the rear and cleverly made the stand double as a headphone holder. HP also built-in easy controls for navigating the monitor’s menu with a four-way joystick. But, that’s really all the credit it’s getting for the design.",
    "The display is a plus. HP has used a decent IPS panel. It offers a strong brightness level that earns it a DisplayHDR 400 certification. And, it can run at a speedy 165Hz refresh rate with the full backing of FreeSync Premium Pro and even official Nvidia G-Sync Compatible certification for a 60-165Hz variable refresh rate.",
    "While it’s cruising, the display does a solid job offering pleasing colors and contrast while managing to avoid any noticeable pixel overshoot issues that can come with cheaper panels running at high speeds. We don’t notice coronas or anything of the sort, even with the monitor’s response time set at its lowest setting. Really, the only shortcoming that catches our eyes is lack of deep black levels, which is something of an issue for almost any IPS panel.",
    "HP tries to get the display to rise above its specs with a few features, like Shadow Vision to boost shadows and Edge Precision to improve sharp edges (which only made jaggies stand out more in our experience). Most interesting was the Game Remaster Mode which proposes to improve the graphics of lower-res, classic games. Playing The Binding of Isaac: Rebirth with 1080p and 720p full screen outputs, this setting makes no noticeable changes to the pixelated graphics of the game.",
    "So, our conclusion is simply that the HP Omen 25i is fine in its own right, but HP hasn’t kept pace with the competition, which are offering even faster IPS panels or bigger VA panels (often on stands with a lot more flexibility) all for prices that makes this monitor a pass from us unless you find it heavily discounted."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Don’t buy it if…"
  },
  "links": {
    "gaming monitor": "https://www.techradar.com/news/best-gaming-monitor",
    "Monoprice Dark Matter 34": "https://www.techradar.com/reviews/monoprice-dark-matter-34"
  }
}