{
  "source": "https://www.techradar.com/reviews/snom-d1-3-7-series",
  "title": "Snom D1, 3, 7 series review",
  "category": "computing",
  "updated": "2021-08-03T09:12:01Z",
  "author": "barclay-ballard",
  "summary": "We've assessed three of Snom's most popular VoIP ranges",
  "verdict": "A wide variety of models on offer - many of which support more SIP accounts than their competitors.",
  "pros": [
    "Impressive number of SIP accounts supported",
    "Competitive price points"
  ],
  "cons": [
    "Sound quality on some models could be better"
  ],
  "article": [
    "Geman company Snom has been manufacturing VoIP handsets since 1999. In the years that have followed, the company has won more than its fair share of awards for its business phones, including “Best of Show\" at CeBIT, Germany for its Snom 100 device. The company wasted little time expanding beyond its national boundaries, establishing a sales partner in the US in 2001, before subsequently establishing subsidiaries in France, Italy, and the UK. Snom now has more than 4 million endpoint installations around the world, and offers desk phones, conferencing solutions, headsets, and software-as-a-service (SaaS) tools.",
    "Although the previous 12 months have presented difficulties for most businesses as a result of the COVID-19 pandemic, organizations offering communications products and services have actually performed pretty well. The global mobile VoIP market is predicted to reach $183.7 billion by 2027 - a figure that should come as no surprise given how much businesses have relied on communication tools over the past year.",
    "Snom CEO Gernot Sagl recently issued a press release looking back at what has been a challenging year for all companies. Fortunately, Snom had already launched a number of innovative telephony accessories that helped increase mobility for both home and office workers, which should mean that the transition to a hybrid working model is a little more straightforward.",
    "Snom has also been celebrating a number of strategic partnerships of late, including a collaboration with Swedish telecommunications firm Telia and unified communications provider Sipwise. Overall, the company has plenty of reasons to be optimistic as it looks ahead - particularly in the VoIP handset market.",
    "Snom has been receiving rave reviews for its VoIP phones for a number of years now, which are available in three distinct offerings: the D1, D3, and D7 ranges. Within these distinct series of phones, there are a wide range of models for businesses to choose from, depending on whether they need color screens, more advanced telephony features, or if an entry-level budget option will be sufficient. Whatever choice your company makes, Snom’s handsets represent a relaible, competitively priced option.",
    "The sole device within Snom’s D1 series of VoIP handsets is the D120. Firmly aimed at an entry-level market, the D120 would be well suited to industries where a large installation of phones is required, such as the hospitality or healthcare sectors. The handset’s low purchase price, low energy consumption, and high level of reliability mean that they are ideal for organizations where flashy features are not required.",
    "The Snom D120 boasts a clean simple design, decent audio quality, and all the features that businesses might expect from a VoIP handset at this price point. The D120’s firmware is designed with simplicity in mind. The display is small but clear and the inclusion of four context-sensitive keys, as well as five pre-assigned function keys, means that businesses can quickly access essential VoIP features like call holding.",
    "The D120 also scores highly in terms of user-friendliness. Its backlit display makes it easy to see all essential information regarding incoming calls, voicemails, etc. In addition, a 360-degree call indicator also means that incoming calls, calls in progress, and waiting messages can all be seen at a distance from the device.",
    "The fact that this particular handset only comes with the option of three languages (English, French, and Spanish) is slightly disappointing - and may be offputting for businesses that engage with a large number of international markets. The phone does come with two SIP identifiers, however, which is highly unusual for handsets within this price range, so that’s certainly one reason why companies may want to choose the D120 over other budget VoIP options.",
    "When the Snom D120 arrives at your home or office, users will be met by a fairly nondescript package. The D120 comes in a standard cardboard box, which does make shipping pretty straightforward for bulk purchasers. Inside the box, D120 owners will find the telephone set, a quick start guide, a stand, a category 5E Ethernet cable, a handset and twisted cord, and a warranty card valid for three years. In many ways, the simplicity of the phone’s packaging is mirrored by the phone itself, which is compact and clean, meaning it does not take up much desk real estate at all.",
    "Overall, the D120 is not going to blow anyone away - but that’s not really its aim. This is a good, budget VoIP device that businesses will struggle to beat in tems of affordability. It’s true that some users have complained of the sound quality being a little disappointing, however, particularly in terms of clarity for higher frequencies. If sound quality is a deal-breaker for your organization, you might want to explore other options.",
    "Although there is currently only one choice within the Snom D1 series, the D3 range has plenty more variety. The D305 handset is the most basic option but still comes with a professional, high-resolution screen that represents good value for money. Like the D120, the D305, is particularly impressive in terms of the number of SIP accounts it offers. The device boasts four, which is above the usual one or two you normally get within this price range. The D305 also comes with a built-in address book capable of holding 1000 numbers.",
    "From the outside, the D315 looks identical to the D305. but there are some subtle differences in terms of its hardware and firmware. The D315 has a gigabit switch instead of a hundred megabit switch, and it also comes with a USB port, which will be hugely useful if businesses want to add extension modules, conferencing tools, or headsets. The D315 also boasts VPN technology, giving it an added level of security when compared with the D305.",
    "The most notable difference with the D335 is its high-resolution thin-film-transistor (TFT) display, which immediately makes it stand out from more affordable Snom models. Even so, the D335 mostly sticks with the form factor of other handsets in the D3 range. The D335 comes with eight physical, freely programmable function keys and a smart proximity sensor, which activates the display automatically when the user’s hand approaches it or the function keys.",
    "The D345 phone supports an impressive 12 SIP identities but has opted against a color display. The handset does come with a second screen, however, which supports four virtual pages, each with 12 programmable keys and multicolored LEDs. A high-speed USB port is also included to facilitate the addition of various accessories",
    "Moving on to the D375, this handset does come with a high-resolution 4.3-inch color display but it is not as slick as some of the other examples on the market. Clearly, this device is not aimed at high-flying executives for whom money is no object but rather, an aspirational executive that still values reliability above all else in their VoIP phone.",
    "With its larger screen, the Snom D375 has increased space for call lists, address books, and menus. In addition, the inclusion of 12 freely programmable dual-color function keys gives users the freedom to configure and customize their device to suit their needs. Built-in Bluetooth support and a high-speed USB port also mean that it’s straightforward to add a number of accessories like wireless headsets and Wi-Fi sticks. Plus, the D375 supports the simultaneous use of multiple audio devices so users can use the headset and loudspeaker at the same time.",
    "The flagship device within the D3 range is the D385, boasting a 4.3-inch TFT color display, multicolored LED keys, and a total of 48 entries for users across four pages. Despite its minimal aesthetic, the D385 boasts an impressive feature list, concurrent support for up to 12 calls, and integrated Bluetooth and USB connectivity.",
    "The most affordable model within the D7 range is the D712 device, which still packs enough features, including four SIP identities and five programmable keys, to make it suitable for both small or large-scale deployments. The D712 comes with a four-line display, alongside four function buttons and a traditional four-way navigation “joystick” with two buttons on the sides: “confirmation” and “cancel”.",
    "As with all the D7 models, the D712 is equipped with a large quick-release stand, which means the phone can be installed in one of two positions - at an angle of either 46-degrees or 28-degrees. Where the D712 really stands out is in terms of convenience, with all the phone keys being large and offering clear feedback.",
    "The D735 is more cutting-edge and was actually the first phone within the Snom catalog to support the sensor technology that gives it the same responsible user interface found within the D335. This model comes with a 2.7-inch color display, eight multicolor function keys, and HD audio quality.",
    "However, the phone designed to really impress VoIP aficionados is the D785, which comes in either a black or white design, and combines a high-resolution color display with a convenient second screen. Supporting up to 12 SIP accounts, an XML browser, call lists for dialed, received or missed calls, as well as a local directory with up to 1,000 entries, the D785 manages to combine an elegant design with good sound quality and an intuitive user interface.",
    "If only the best will do, then it’s likely you’ll want to consider the Snom D785 model. This VoIP phone is Snom’s latest generation offering and comes in two color options: black and white. One of the first things you’ll notice about the phone is its attractive design. It’s got a sleek, understated look, complete with a 4.3-inch TFT-color display that would grace any executive’s desk. The phone is compact but also adaptable, coming with an adjustable footstand that allows you to tweak the viewing angle at your convenience.",
    "Although it may not be quite as glamorous as the larger, color display, the fact that the D785 comes with a smaller second screen for dynamic contact management is a great addition and can really help boost productivity. Its other functionality benefits include six configurable self-labeling multicolor LED keys, a USB port, and Bluetooth connectivity. It also supports up to 12 SIP accounts, an XML browser, and is compatible with all major IP PBX platforms.",
    "The D785 also performs extremely well in terms of audio quality. The phone’s Digital Signal Processor ensures crystal clear communication whether you are talking to someone on a landline or mobile phone. The phone is also compatible with several first-party headsets and has a built-in speakerphone - both of which also produce excellent audio performance.",
    "One slight disappointment comes from the fact that the D785 does not come with a power unit included, so if your office doesn’t support power over ethernet, you’ll need to purchase an adapter before you can set up the phone. Apart from that minor issue, however, the D785 combines aesthetic and functional qualities in a way that few VoIP phones can match.",
    "The sound quality offered by some of the aforementioned Snom handsets may not match up to some of its competitors but will be more than adequate for most use cases. When businesses also consider the appealing price points for many of these models (and the number of SIP accounts that are supported), they may well decide that a Snom device is right for their telephony needs."
  ],
  "headers": {
    "26": "Our overall verdict"
  },
  "links": {
    "software-as-a-service": "https://www.techradar.com/news/what-is-saas",
    "$183.7 billion": "http://www.globenewswire.com/news-release/2020/08/07/2075116/0/en/183-Billion-Worldwide-Mobile-VoIP-Industry-to-2027-Impact-of-COVID-19-on-the-Market.html",
    "press release": "https://www.snom.com/press/2020-herausfordernd-aber-nicht-verloren/",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Telia": "https://www.snom.com/press/telia-eesti-entscheidet-sich-fur-snom/",
    "unified communications": "https://www.techradar.com/best/best-ucaas",
    "Sipwise": "https://www.snom.com/press/snom-und-sipwise-strategischer-partnerschaft/",
    "VPN technology": "https://www.techradar.com/vpn/best-vpn"
  }
}