{
  "source": "https://www.techradar.com/reviews/quieton-3",
  "title": "QuietOn 3 review",
  "category": "fitness",
  "updated": "2021-11-03T16:03:51Z",
  "author": "cat-ellis",
  "summary": "Earplugs that actively cancel low-frequency noise for a better night's sleep",
  "verdict": "The QuietOn 3 sleep earplugs use a combination of soft foam and active noise cancelling to block out the type of annoying background sound that can prevent you getting to sleep and staying there. Whether it's traffic, snoring, or a neighbor's TV, these small and lightweight earplugs will eliminate it. Higher frequencies will still get through, so you can hold a conversation and hear your alarm in the morning. Unlike the Bose Sleepbuds II there are no ambient noises to soothe you; the QuietOn 3 sleep earplugs are all about the sound of silence, and they're very effective.",
  "pros": [
    "Block low-frequency sound",
    "Let you hear your alarm clock",
    "Lightweight and small",
    "Well designed charging case",
    "Impressive battery life"
  ],
  "cons": [
    "Relatively expensive",
    "Have to be inserted perfectly"
  ],
  "article": [
    "Loud noises keeping you awake at night? The QuietOn 3 could be the perfect solution. A successor to the original QuietOn Sleep, the QuietOn 3 sleep earplugs use the same noise-cancelling tech you'd find in a pair of true wireless headphones to mask the annoying ambient sounds that can stop you falling (and staying) asleep.",
    "They don't stream music or podcasts from your phone, and unlike the Bose Sleepbuds II or Amazfit Zenbuds, there are no relaxing sounds to help you drift off at night. The QuietOn 3 sleep earplugs are simply about blocking out unwanted noises so you can fall asleep naturally.",
    "So why invest in these rather than simply picking up a pair of regular foam or silicone earplugs? The answer isn't just what the QuietOn 3 block, but also what they allow through. The active noise cancelling masks low-frequency sound (such as your partner snoring or nearby traffic), but allows you to hear higher frequency sounds. That means you can still hold a conversation, and you'll be able to hear your alarm clock in the morning.",
    "They're certainly not cheap, though. If you have trouble getting to sleep at night and are on a tighter budget, it's worth checking out a white noise machine like the Homedics Deep Sleep Mini instead. It doesn't work in the same way, and may not be quite as effective, but costs about a quarter of the price.",
    "The QuietOn 3 sleep earplugs began shipping in May 2021 following a successful crowdfunding design on IndieGoGo. They cost $269 / £229 (about AU$370) direct from QuietOn. That's much more than a typical pair of silicone or foam earplugs, but they're durable and should last much longer. It's almost exactly the same price as the Bose Sleepbuds 2, and if they don't work out for you, there's a 14-day money-back guarantee",
    "If you and your partner both struggle to sleep, there's also a couples pack with two sets of earplugs available for $439 / £379 (about AU$600).",
    "At the time of writing, QuietOn estimates that it'll take between four and six weeks for your earplugs to be delivered due to demand and a global silicon shortage.",
    "The QuietOn 3 sleep earplugs look similar to a pair of true wireless earbuds, but are much smaller and lighter due to the absence of the typical speaker components and Bluetooth transmitter. Each one weighs just 1.8g, and is made from hard white plastic, with four pairs of soft polyurethane foam tips in different sizes.",
    "This is important, because the earplugs only work effectively when they fully seal your ear canal. You might be able to get away with an imperfect fit when using earbuds, but it pays to spend time experimenting with the different tip sizes here to ensure you get a complete seal.",
    "The earplugs are supplied with a white plastic charging case, which has a smart brushed stainless steel finish inside and holds the plugs in place magnetically. A set of lights on the front to the case indicate the earplugs' current charge level, and it comes with a USB-C charging cable.",
    "Our review sample also came with a padded sleep mask, which blocks out light without putting pressure on your eyes, though this doesn't seem to be available to buy through QuietOn's website at the time of writing.",
    "Choosing the best mattress is a great start to getting a better night's rest, but if your problem is a snoring partner or loud neighbor, the QuietOn 3 sleep earplugs could be what you really need. They work in two ways: firstly the foam tip dulls noise passively, then the active noise cancelling tech cancels out the remaining noise.",
    "Whereas most noise-cancelling headphones have smooth silicone tips, the QuietOn 3's are made from a type of durable foam. You need to make sure you get the left and right plugs the right way round, compress the foam between your thumb and forefinger, then insert the earplug and allow it to expand to fill your ear canal.",
    "QuietOn advises gently pulling your ear back to make this easier. If you try to force the earplug in without squashing the foam you'll get a poor seal and the earplugs won't work correctly.",
    "At first you may be uncertain that the active noise cancellation is working, but you can confirm it by bringing the case close to your ear, then drawing it away slowly. If you hear a faint 'snap' sound, everything is working as it should. The noise is very quiet, so you'll need to pay careful attention.",
    "We found that the earplugs lasted around four nights between charges, returning them to the case each morning. This tallies with the company's estimated 48-hour battery life.",
    "The effect is distinctly different to a pair of standard earplugs. Annoying ambient sounds such as snoring, the rumble of traffic, or the turning of a washing machine are effectively muted, but higher frequency sounds like your alarm clock come through quite clearly. It's a good balance, and eliminates the worry that you'll accidentally oversleep.",
    "In our tests, the earplugs blocked out all the standard noises of living in an apartment, including neighbors' footsteps, the sound of other people's TVs, and passing cars. They also muted a partner's snoring, though we were still able to wish them a good night without removing them.",
    "Unlike the original QuietOn Sleep, there's no optional conversation mode. This is actually a benefit, as we found this setting fiddly to activate when testing the first-generation earplugs. Instead, conversation mode is effectively active all the time, so you can have a chat without removing them.",
    "They stayed firmly in place overnight, unlike standard earplugs, which have a tendency to fall out when you sleep on your side. It's worth bearing in mind, however, that the hard plastic of the QuietOn 3 sleep earplugs can be uncomfortable for side-sleepers if they're not fitted perfectly before you settle down for the night.",
    "First reviewed October 2021",
    "This article is part of TechRadar's Sleep Week 2021 (running from Sunday 31 October to Sunday 7 November), our in-depth look at sleep and how to snooze better. We've teamed up with experts in their field to bring you sleep techniques and tips to help you drift off easier, and have rounded-up the best sleep kit to transform your bedroom into a den of zen."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Price and release date",
    "7": "Design",
    "11": "Performance",
    "21": "Don't buy them if"
  },
  "links": {
    "QuietOn Sleep": "https://www.techradar.com/reviews/quieton-sleep",
    "sleep earplugs": "https://www.techradar.com/best/the-best-sleep-earplugs",
    "true wireless headphones": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Bose Sleepbuds II": "https://www.techradar.com/reviews/bose-sleepbuds-ii-review",
    "white noise machine": "https://www.techradar.com/best/white-noise-machine",
    "Homedics Deep Sleep Mini": "https://www.techradar.com/reviews/homedics-deep-sleep-mini",
    "IndieGoGo": "https://www.indiegogo.com/projects/quieton-3-the-smallest-anc-earbuds-for-sleeping/#/",
    "direct from QuietOn": "https://quieton.com/shop/quieton-3-sleep-earbuds/",
    "Bose Sleepbuds 2": "https://www.techradar.com/reviews/bose-sleepbuds-ii-review",
    "best mattress": "https://www.techradar.com/best/best-mattress",
    "TechRadar's Sleep Week 2021": "https://www.techradar.com/news/welcome-to-techradars-sleep-week"
  }
}