{
  "source": "https://www.techradar.com/reviews/facebook-portal-go",
  "title": "Facebook Portal Go review",
  "category": "smart-home",
  "updated": "2021-10-19T14:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "A smart display that you can take on the go",
  "verdict": "The Facebook Portal go is a simple-to-use smart display that excels for video calling. It’s lightweight, battery-powered and has an integrated handle, making it easy to take with you. However, you’re not able to access some popular video services, and it’s not as capable as some other smart displays if you’re using it in the kitchen to follow a recipe.",
  "pros": [
    "Camera ensures you’re alway in the center of the frame",
    "Battery-powered with built-in handle",
    "Choice of Alexa or Facebook’s own voice assistant"
  ],
  "cons": [
    "Facebook’s voice assistant isn’t as capable as Alexa",
    "No support for Netflix",
    "Can’t issue audible recipe instructions"
  ],
  "article": [
    "Video-calling has seen a boom in popularity during the global pandemic, and with good reason - it’s much easier to engage with, and feel a connection to, someone on the other end of a call, whether it’s a relative, friend or work colleague, if you can both see and hear them.",
    "While phones and tablets remain the most popular devices for video-calling, some of the best smart displays have built-in cameras and, can provide the same experience without the arm ache. However, smart displays lack the portability smartphones and tablets offer – until now that is.",
    "The Facebook Portal Go is the latest smart display from the social media giant, and features a 10-inch screen – and, in a first for the market, it’s battery-powered, and according to Facebook will last for up to five hours of video calling before it needs recharging. It also has a handle built into the back, making it easy to carry it from room to room during a call, or take outdoors, internet connection permitting.",
    "The 12MP built-in camera offers a slightly lower resolution than the mains-powered Facebook Portal, although we didn’t find that this greatly affected the clarity of video calls. It’s got the same 125-degree field of view as the Portal, and like the camera in Amazon’s Echo Show 10, it will automatically pan and zoom as you move around to ensure that you’re always in the center of the frame during a video call.",
    "As well as enabling you to make calls to your Facebook Messenger contact, the Portal Pro also allows you to make Zoom and WhatsApp calls. Even better, there are a range of filters and Augmented Reality (AR) effects such as animal faces characters including Harry Potter that you can use to liven up video calls.",
    "As with any device designed for the home that has a built-in camera, the Facebook Portal Pro brings with it issues around privacy. Facebook has endeavored to address these by including a physical cover for the camera, that automatically disconnects the power to the microphone too.",
    "Support for Spotify, Deezer and Tidal means you can listen to your favorite music, and while catching up on the latest episode of a TV service you’re invested in, is possible, because its done via the web browser rather than a built-in app, it’s not the slickest experience ever. It also means some services such as Netflix can’t be watched from the smart display at all.",
    "The Portal Go can also be used as a digital photo frame and display snaps from your Facebook or Instagram account.",
    "It comes with two voice assistants built-in: Alexa as well as Facebook’s own ‘Hey Portal’ offering, which has limited capabilities. Amazon’s voice assistant behaves in much the same way as it does on the brand’s own smart speakers and displays, enabling you to control music playback, search the web and control smart home devices, providing these are set up in the Alexa app.",
    "At $199 / £199 / AU$279, the Facebook Portal Go is an expensive smart display, especially when you consider that it lacks some of the features found on the similarly-priced Amazon Echo Show 10 or the Google Nest Hub Max, However, if you want a smart display primarily for video calling, or you have kids that will enjoy the AR-related features, it’s worth the investment.",
    "The Facebook Portal Go will set you back $199 / £199 / AU$279 and is available to buy now direct from Facebook. This means that in the US and UK it's the most expensive 10-inch Facebook Portal device on the market, as the mains-powered Facebook Portal is priced at $169 / £169 , while in Australia both smart displays cost AU$279.",
    "However, it’s slightly more affordable than the Amazon Echo Show 10, which costs $249.99 / £239.99 / AU$399.99, while the larger Facebook Portal+, which has a 14-inch display, is even more expensive at $349 / £349 / AU$519.",
    "Measuring 10.1 x 6.84 x 3.1 inches / 25.7 x 17.4 x 7.87cm (w x h x d) the Facebook Portal Go is a relatively compact smart display. It features a wedged-shaped design that’s wrapped in grey fabric, ensuring it’ll complement most home decor setups.",
    "As we’ve mentioned, the Facebook Portal Go is battery-powered, and Facebook claims the battery will last up to five hours before it needs recharging. On the bottom of the display, is an insert for the charging dock, which ensures the device remains stable when it's being charged. There’s an integrated handle on the back of the smart display that makes it easy to pick up and take with you, and portability is aided by the fact the device weighs just 3lb / 1.4kg",
    "The 10.1-inch HD screen takes up most of the front of the device, and has a resolution of 1280 x 800. There are also two 5W full-range speakers and one 20W woofer built into the device, along with a four-mic array that ensures your voice is picked up clearly when you're on a call.",
    "The smart display also comes equipped with a 12MP camera for video calls, which has a 125-degree field of view. On the top of the device are physical controls for volume, as well as a button to the mute the microphone and cut the power to the camera; there’s also a physical privacy shield for the camera, which can be manually slid across if the button doesn’t offer enough reassurance.",
    "The Portal Go has both Wi-Fi and Bluetooth connectivity, so as well as playing music over a streaming service through the smart display, you can also listen to music stored on your smartphone through its speakers.",
    "The Facebook Portal Go is designed for keeping in touch, and as well as enabling you to make both video and audio calls to your Facebook Messenger or WhatsApp contacts, it also supports other video-calling apps including Zoom, Go-To meeting and Webex, along with Workplace (a business communication tool that offers more than just video-calling), meaning it can be used for business are well as for pleasure.",
    "The original Facebook Portal was the first smart display with a camera that could automatically pan and zoom to ensure you’re always in the center of the frame during video calls, a feature since adopted by the Echo Show 10 and even the Apple iPad Pro (2021) Facebook has retained this feature in the Portal Go, and we found that when making WhatsApp and Facebook Messenger calls during testing, the motion of the camera was smooth and natural, rather than jerky.",
    "We were also impressed that the camera adjusted the framing when we got up and moved around, but not when we simply shifted in our seat during a call. We did find the 125-degree field of view gave a slight fish-eye effect to the footage, but it wasn’t enough to detract from the video call itself.",
    "As we’ve mentioned, you can also apply a range of AR effects during Facebook Messenger calls and WhatsApp calls, something both children and young-at-heart adults will enjoy (although unless the WhatsApp call is received on another Facebook Portal device, the recipient won’t be able to apply effects to their video). There’s also a Photo Booth feature that lets you take still images with these filters applied, without having to make a video call, and Story Time offers the ability to read well-loved tales on screen, such as Little Red Riding Hood, complete with music and animations to create a more interactive experience. Some stories also include filters that put your face into the action.",
    "The Facebook Portal Go can also be connected to Google or Outlook calendars to give you reminders of upcoming events, and can be used as a digital photo frame to display your favorite snaps from Facebook and Instagram. However, unlike the mains-powered Facebook Portal, you can only use the device in portrait orientation – there’s no option to switch to portrait.",
    "A web browser is also installed on the smart display, along with recipe app SideChef, but while recipes steps and ingredients are displayed on the Facebook Portal Go’s screen, you can’t opt to have the speaker offer audible instructions, as you can with Amazon’s smart displays.",
    "Multiple Facebook accounts can be added to the device, so it can be used by different members of a household. Even better, it's possible to restrict which apps and contacts the different Facebook profiles can access with a pin code, removing the risk of the kids accidentally starting a work meeting on Zoom.",
    "Unlike the mains-powered Facebook Portal, which can be positioned in portrait or landscape orientation, automatically rotating the image on the display to suit and comes in particularly useful when the device is being used as a digital photo frame, the Facebook Portal Go doesn’t offer this feature.",
    "Thanks to its built-in speakers and rechargeable battery, the Facebook Portal Go also doubles as a portable speaker, and you can listen to popular music streaming services including Spotify, Deezer and Tidal, as well as Pandora and iHeartRadio in the US.",
    "The speakers have been improved over those on the original Facebook Portal and offer a room-filling sound, while the 20W woofer ensures you can pick out the bass frequencies, they're not particularly powerful. This certainly won’t be your go-to speaker when you want to enjoy your favorite tracks in all their audio glory, but it will suffice if you just want to play background music or listen to podcasts while you’re cooking or doing chores.",
    "You can also connect the smart display to your smartphone or tablet over Bluetooth to play music stored on that device, but there’s no 3.5mm socket, so you can’t use headphones for private listening.",
    "There are only a handful of video streaming apps available on the Facebook Portal Go right now. Unsurprisingly these include Facebook Watch and Facebook Live, as well as Food Network in the US, with ESPN coming soon. It is possible to access other streaming services, such as Prime Video and YouTube, but this has to be done via the built-in browser, which certainly doesn’t provide the slickest experience, and isn’t supported by all streaming services - Netflix being the notable one.",
    "As is the case with audio, if you just want videos running in the background the experience is fine, but the Portal Pro is never going to be your main screen. However, we were impressed by how the screen brightness is automatically adjusted to suit your surroundings so it’s always easy to see.",
    "The Facebook Portal Go has two voice assistants; Amazon’s Alexa or the social media giant’s own offering, which can be activated by saying “Hey Portal” or in the US, the phrase “Hey Facebook” will also work.",
    "Alexa works in the same way as on any other smart device, enabling you to control music playback, turn smart home devices on or off, and provide you with information. The Alexa app on the Facebook Portal Go also lets you view a live feed from any compatible home security cameras or video doorbells in your home.",
    "Facebook’s own voice assistant has limited capabilities compared to Alexa; while it was able to give us a weather report and set a timer, it can’t control music playback or switch smart home devices on or off. You can also use Facebook’s voice assistant to tweak the brightness of the smart display’s screen, and apply some of the camera’s AR effects.",
    "We also found that Facebook’s voice assistant struggled far more than Alexa with background noise – if there was too much sound from other sources, or were using the Bluetooth connection to play music and just paused it rather than completely disconnected, the voice assistant would simply fail to process our request.",
    "According to Facebook, the Portal Go will last for up to five hours of video calling between charges, while if you’re just listening to music the battery life is extended to 14 hours. We can’t confirm these ‘typical use’ figures, since our testing involved heavy use of the smart display over a short period of time.",
    "The Portal Go ships with a charging dock, and thanks to the design of the bottom of the smart display, it sits flush when connected to the charger, so remains stable on any surface. It takes around three hours to fully recharge the battery.",
    "First reviewed: October 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Facebook Portal Go price and availability",
    "12": "Design",
    "17": "Performance",
    "25": "Music and video",
    "30": "Voice assistant smarts",
    "34": "Battery life",
    "36": "Don't buy it if..."
  },
  "links": {
    "best smart displays": "https://www.techradar.com/best/best-smart-displays",
    "Amazon’s Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Google Nest Hub Max": "https://www.techradar.com/reviews/google-nest-hub-max"
  }
}