{
  "source": "https://www.techradar.com/reviews/peoplefinders",
  "title": "PeopleFinders review",
  "category": "computing",
  "updated": "2021-03-09T10:02:49Z",
  "author": "michael-graw",
  "summary": "Find people wherever they are in the world",
  "verdict": "PeopleFinders is easy to use, reasonably priced, and comes with excellent mobile apps. However, we wished that search reports included social media handles and email addresses.",
  "pros": [
    "Purchase single reports",
    "Excellent mobile apps"
  ],
  "cons": [
    "No social media lookup",
    "Limited report data"
  ],
  "article": [
    "PeopleFinders is a straightforward online tool for finding out more about someone using public records. This people search finder scours public databases to help you identify someone based on just their name, phone number, email, or address. You can buy a single report or get unlimited access to run as many searches as you want.",
    "PeopleFinders offers several different pricing options. For a single individual, there are two reports: a search report that includes basic contact information and a background report that includes criminal, property, and court records.",
    "A search report for a single individual costs $1.95, while a background report costs $9.95. You can also access unlimited reports with a monthly subscription. PeopleFinders charges $24.95 per month for unlimited search reports or $29.95 for unlimited background reports.",
    "PeopleFinders offers several ways to search for someone. You can enter their name and city, phone number, email, or a known address. For name searches with multiple potential matches, PeopleFinders presents you with a list of possible results along with age and known family members to help you narrow down your search. That’s critical, since many similar search tools present you with a paywall before you even know if there are results for your search.",
    "Reports generated by PeopleFinders provide a broad overview of an individual. You get their name, history of addresses, phone numbers, and relatives with a search report. If you purchase a background report, you also get court and arrest records, property and bankruptcy records, and a check of the national sex offender registry. Notably, PeopleFinders doesn’t include email addresses or social media handles in its report, nor does it provide information about whether an individual owns a gun or holds a gun license.",
    "It’s important to note that all of the data that PeopleFinders uses is scraped from public databases. The main advantage for paying for a report as opposed to running your own searches is that PeopleFinders pulls in data from a wide variety of sources in just a few minutes.",
    "Using PeopleFinders is fast and easy. You can select what type of search you want to run on the platform’s website and then just enter the information you have. A database search typically takes under one minute for a reverse phone lookup, but it can take up to several minutes if you search for a common name in a populated city. Helpfully, the service has an advanced search function that lets you further constrain name searches by adding a middle name and age range.",
    "We were also happy to find that PeopleFinders gives you at least a preview of what information is included in its report on an individual before you pay for it. The service indicates whether the person’s current address, phone, and background information are available or not, which can influence whether you want to continue with your purchase.",
    "PeopleFinders also offers mobile apps for iOS and Android, which include a surprising number of features that aren’t available through the web interface. For example, the PeopleFinders app will automatically scan incoming phone numbers and run a quick reverse phone lookup on them. If the phone number matches PeopleFinders’ proprietary list of spam callers, it will automatically block the call for you. The mobile apps also offer report sharing, which isn’t readily available through the PeopleFinders web interface.",
    "You can get in touch with the PeopleFinders support team by phone and email. Support is available from 7 am to 6 pm Pacific Monday to Friday, and from 7 am to 3:30 pm Saturday and Sunday. The company’s website also has a helpful knowledgebase that answers most basic billing and interface questions.",
    "PeopleFinders uses standard SSL encryption to keep your account information and searches secure. When you search for someone with this tool, there’s no way for the person you searched to know that you pulled a report.",
    "If you want, you can opt out of PeopleFinders so that your information doesn’t appear in searches. You’ll need to search yourself and copy the URL of your report page in order to request removal from the site.",
    "PeopleFinders competes directly with several people search finders owned by Intelius, including US Search, Instant Checkmate, and BeenVerified. One of the big advantages to PeopleFinders over those services is that it enables you to purchase a single report, whereas the others force you into a monthly subscription. We also much prefer PeopleFinders’ mobile apps since it makes it easy to share reports and automatically runs a search on any unknown number that calls your phone.",
    "PeopleFinders is a reasonably priced and easy to use tool for looking up a long lost friend, screening a new acquaintance, or checking on who’s calling. We liked that you can purchase individual reports rather than sign up for an unlimited subscription. The advantage of the monthly subscription is that it comes with PeopleFinders’ mobile apps, which offer automatic reverse phone lookup and spam blocking when an unknown number calls your phone."
  ],
  "headers": {
    "1": "Plans and pricing",
    "3": "Features",
    "6": "Interface and in use",
    "9": "Support",
    "10": "Security",
    "12": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "PeopleFinders": "https://www.peoplefinder.com/",
    "people search finder": "https://www.techradar.com/best/background-check-services-sites-online",
    "US Search": "https://www.techradar.com/reviews/us-search",
    "Instant Checkmate": "https://www.techradar.com/reviews/instant-checkmate",
    "BeenVerified": "https://www.techradar.com/reviews/beenverified"
  }
}