{
  "source": "https://www.techradar.com/reviews/nexvoo-nexbar-n110",
  "title": "Nexvoo NexBar N110 review",
  "category": "cameras",
  "updated": "2021-04-14T09:40:02Z",
  "author": "mark-pickavance",
  "summary": "4K conferencing camera with AI",
  "verdict": "A much better conferencing camera than Nexvoo NexPod N109, the NexBar N110 has superior video, more microphones, a Bluetooth remote, and it can be wall-mounted. But the increased price puts it up against some branded alternatives and cheaper options.",
  "pros": [
    "Driverless design",
    "Beamforming microphone array",
    "4K video sensor",
    "Bluetooth remote"
  ],
  "cons": [
    "No remote management",
    "Slightly pricey"
  ],
  "article": [
    "Following our review of the Nexvoo NexPod N109, we’ve also been experiencing Nexvoo’s Nexbar N110, a related design.",
    "The consecutive numbering convention suggests that this would be very similar, but this soundbar styled conferencing camera has more in common with the Nexvoo NexPod N149 since it sports a 4K camera.",
    "It also more than three times the cost of the N109, making it a greater investment for those who want a dedicated solution in each meeting room.",
    "Where the N109 competed with high-quality webcams, the N110 takes on branded solutions meant for corporate customers and their permanent installations.",
    "Is the NexBar N110 ready to take on Logitech, Jabra, Trust and Owl?",
    "The Nexvoo NEXBAR™ N110, costs $799 directly from the makers here.",
    "At this time, Nexvoo only has this NexBar in this series, making it the only choice of NexBar.",
    "As with other Nexvoo devices, it is only available direct from the makers, and therefore the quoted price is fixed.",
    "This N110 design differs markedly from the NexPod N109 conference camera in several significant ways.",
    "Firstly, this is shaped like a soundbar and therefore is designed to sit at the end of a table but not obscure a TV, should there be a screen placed behind it.",
    "While it is elegantly styled in shades of black, this is essentially a 503 x 78 x 53mm plastic box with a centrally mounted camera and side positioned speakers and microphones. It sits on a large metallic foot connected by a hinge that allows for a wide range of tilt angles.",
    "In the box with the N110 is the 5m long USB cable needed to connect to a PC, a dedicated block PSU with a selection of socket adapters (no UK three-pin), a remote control and a small paper User Guide.",
    "Nexvoo also included a wall mounting bracket that the foot can connect to when folded back at about 90 degrees.",
    "Like the N109, the N110 is a driverless design aimed at working with any conferencing application that can define the source of video, microphone audio and speaker output.",
    "Therefore getting it operational is merely a matter of connecting USB and making sure that Zoom, or whatever app you like, is set to Nexvoo Camera and Nexvoo Audio devices.",
    "The N109 would work when only powered only by USB, but the N110 requires that the power supply is connected to function, presumably because of the greater demands of the 4K camera and speakers.",
    "On the rear of the N100 are the inlets for the USB-C cable and power, an on/off button and a Type-A USB port.",
    "That last feature was unexpected, and it provides a simple means to replace the USB port used on the computer to connect the N110. A feature of the foot is a security slot enabling the N110 to be chained to the table or wall if this is deemed a necessary theft prevention requirement.",
    "It didn’t take much use to determine that the N110 has a vastly superior camera when directly compared to that in the N109.",
    "The 4K sensor provides much sharper and clearer images with fewer artefacts, and the fish-eye lens that covers it provides a wider 120 degrees perspective on events. It’s still fixed focus, but the f/1.8 aperture camera is better suited to standard meeting rooms where lighting conditions are never optimal.",
    "There aren’t any HDR options, but other than that point, the results when using this camera were generally good. For the best results, we’d recommend that the camera is more than a metre away from the nearest person, or the wide field of view tends to look distorted.",
    "According to Nexvoo, the N110 is compatible with, but not limited to, Microsoft Skype for Business, Microsoft Skype, Microsoft Teams, Zoom, GoToMeeting, BlueJeans Network, Google Hangouts, Amazon Chime, Cisco Webex and VidyoDesktop.",
    "We tried a number of these solutions with the N110, and it is generally remarkably easy to operate with all of them.",
    "It uses the same AI technology we experienced on the N109, where the video and audio inputs are continuously monitored by the hardware that can then focus on the speaker or bracket those having a conversation.",
    "The technology to track and focus on those speaking works well enough to be useful but is hardly infallible, and you can disable it using the remote. Once AI is disabled, the remote can zoom and move the viewpoint around, although this is purely a software tweak since the camera doesn’t physically move.",
    "The movement zooming in and out is in very large steps, as these are standard resolution multipliers, and highlights the limitations of digital zooming over optical mechanisms.",
    "To a degree, the clunkiness of zooming makes some sense, but why the left and right movement is in such large jumps makes none. Surely it should be possible to pan around the image smoothly once it is zoomed in? This posibility evaded the software engineer who wrote the control routine, it appears.",
    "For those that like to direct the presentation, the remote also has a couple of preset buttons that can be programmed to move to pre-defined views quickly. To define these specific levels of zoom and angle, you simply move the viewpoint to a required place and then hold the preset button down until LEDs on the remote flash to tell you it is now stored on that button.",
    "We mention this feature partly because nowhere in the User Guide is it referenced, and we discovered how it worked purely through experimentation.",
    "What is outlined in this document is how the LEDs above the camera lens reveal if the camera is on or off by being green or red. And, that if the red LED flashes slowly, that also indicates that the unit is audio muted. These LEDs are also used in manual Bluetooth pairing, but if the remote has batteries, it will pair automatically when the unit powers up.",
    "Not sure why they didn’t have three LEDs, one each for video, audio and Bluetooth, but they went with two and made reading the status more complicated than it needed to be.",
    "Overall, the N110 is easy to get working and functions well enough most of the time. If the AI decides to not follow the attendees correctly, it can be disabled.",
    "What it doesn’t offer, because of the software-free installation, is any means for those viewing the stream remotely to take control of the camera.",
    "At nearly $800, the Nexvoo Nexbar N110 is up against some serious competition, not least the excellent Trust Iris (€799) in Europe that we recently reviewed. The Iris isn’t available in the USA, but some other alternatives are.",
    "These include the Jabra PanaCast Panoramic 4K Video Conferencing Camera ($695/£582.18), a design with a 180-degree field of view and three 13mp cameras.",
    "The N110 is cheaper than the Logitech Meetup ($889.99/£794.58), but that design has a motorised pan and tilt camera that expands the field of view from 120 to 170 degrees.",
    "And, it also undercut the $999 Meeting Owl Pro, and that design is only 1080p.",
    "When compared to the Jabra PanaCast and Logitech Meetup, the N110 looks more expensive than it should be for these features and specification.",
    "We liked the NexBar N110 much more than the NexPod N109. The 4K sensor made digital zooming a much less jarring experience, and we suspect that the SoC that drives the camera and AI is more powerful, making the movements more responsive and dynamic.",
    "Along with the enhanced camera and better AI experience, being able to control the viewpoint using the remote was a significant improvement over just disabling the AI on the NexPod N109. On that other design with only a 1080p camera, zooming and panning would not have worked effectively. But with the 4K resolution of the N110, the blockiness of digital zooming is much less apparent.",
    "However, it could be improved in several subtle ways purely with better internal software.",
    "Why it doesn’t have more elegant panning controls is a mystery? And, with this camera sensor, HDR mode could have been included with minimal effort.",
    "The biggest issue for the N110 is undoubtedly the price, which is more than we’d anticipated from a lesser-known brand and more than the better specified Jabra PanaCast.",
    "If this had been $500, we might have been more impressed with this package. But at this price point, it's competing with brands that will enhance the functionality of products over their lifespan through extra software and firmware updates.",
    "Maybe the N110 will see this level of attention, but given the lack of support information for Nexvoo products in general, that seems unlikely."
  ],
  "headers": {
    "5": "Price and availability",
    "8": "Design",
    "18": "In use",
    "33": "Competition",
    "38": "Final verdict"
  },
  "links": {
    "here": "https://nexvootech.com/nexbar-n110/"
  }
}