{
  "source": "https://www.techradar.com/reviews/apex-bike",
  "title": "Apex Bike review",
  "category": "fitness",
  "updated": "2021-09-02T15:48:59Z",
  "author": "suzanne-baum",
  "summary": "A sleek, super quiet spin bike, but its classes would benefit from a built-in screen",
  "verdict": "There’s a lot to like about the Apex Bike – in particular its sleek design. It's also very good value for money, and is an excellent alternative to the Peloton brand if you're a keen spinner but don’t want to fork out an extortionate amount of money. The design of the bike is very modern and stylish, blending in nicely as a piece of furniture rather than an ugly piece of fitness equipment. The bike offers a great variety of classes and teachers, too. The only drawback is it only works with Apple devices and doesn’t come with a screen, so you need to connect it to an iPad, iPhone or TV; not great if you're used to machines with immersive technology built in.",
  "pros": [
    "Sleek design",
    "Reasonably priced",
    "Easy to set up"
  ],
  "cons": [
    "Only works with Apple devices",
    "Resistance dial doesn't always turn smoothly",
    "Saddle could be more comfortable"
  ],
  "article": [
    "Indoor biking at home has never been more popular, and the Apex Bike offers an excellent middle-of-the-range product when it comes to pricing. Apex has designed a bold and aesthetically pleasing bike that does not stick out like a sore thumb if used in a home living space.",
    "The riding experience is extremely smooth and straightforward once you've adjusted the handlebars and saddle. You also have the option of either attaching spinning shoes to the pedals, or using ordinary running shoes that easily slide into the buckle strap.",
    "What the bike lacks is an interactive screen so before you begin you need to download the Apex Rides app onto your phone or tablet to access the rides.",
    "The classes – delivered by Boom Cycle – are excellent. If, like us, you find the over-enthusiastic Peloton trainers grating on the nerves, you’ll find the Apex ones a lot more enjoyable. In fact, the broad range of energetic and fun teachers is very refreshing, as are the classes, which are some of the best we've ever done.",
    "With no built in display, however, the Apex lacks the immersive fitness experience of other high-end brands, and doesn't perform too well using on your phone. Our advice is to either connect it to a tablet, or attach to your TV to provide a better user experience. Either way, you still get the output, stats and resistance level figures available to see.",
    "We also found the flywheel at the back of the bike provided the perfect resistance training. From rapid spinning at the lowest level to being unable to turn the pedals with the resistance dialled right up to the max, it provides the perfect balance. It's very quiet too, even when spinning at full speed.",
    "There are hundreds of classes to choose from, depending on your level of expertise. We weren't disappointed by a single class, and the production levels are so high, you feel as though your trainer is sitting right in front of you. They do a good job of explaining what you need to do during the classes and providing the necessary motivation.",
    "We wouldn’t normally comment on a water bottle holder, but we loved the Apex Bike's design so much – even the way it integrates the drinks stand and phone holder is clever. The addition of a wireless charging cradle for your mobile devices is impressive.",
    "The Apex Bike was launched in July 2020 and is available to buy from Apex Rides for £1,200 (about $1,700 / AU$2,200).",
    "The Apex is the sleekest spinning bike on the market, without a doubt. It's far less bulky than others we've used and has been designed to look attractive even when not in use.",
    "Although it's quite heavy (its solid frame weighs just over 41kg) we found the Apex easy to move around thanks to a pair of wheels mounted at the front. Measuring 120 x 160 x 117cm, it's compact enough for even small homes, and the built-in tray at the front (to balance your iPad), water bottle holder and phone charging cradle make the best possible use of space.",
    "The bike's stand-out feature is by far its minimal and streamlined design. Unlike other smart bikes, there is nothing bulky or brash about the Apex, whose engineers wanted the design and look of the bike to blend in and complement furnishings inside a modern home They have certainly achieved this, and the fact it comes in four colors (black, white navy and sand) means you can choose a shade that blends into your decor.",
    "The Apex Bike has a smooth, ergonomic shape with the flywheel placed at the back rather than the front, as on standard spin bikes. It also has a dumbbell holder at the back. These aren't included with the bike, but there's a range of Apex-branded accessories available online, including dumbbells for £25 (about $35 / AU$45) a pair, and resistance bands at £18 (about $25 / AU$35) for a pack of five.",
    "Before you can take your first ride, you have to download the Apex bike app. The company has partnered up with Boom Cycle to deliver an excellent variety of classes led by professional instructors.",
    "For £30 (about $40 / AU$55) a month you can log into live and 24 hour on-demand classes from the studio’s instructors – and just like in a live class, you can ride alongside your friends as the app features real-time metrics and a leaderboard. The price includes unlimited access for up to six people per household.",
    "The downside? The app only works with Apple devices, so once you've downloaded the app this is where you access them from.",
    "During all the classes we tried, we were taken through a five minute warm up before the main class, which then followed a cool down. As for the speed you go at, depending on your class level, the instructor recommends the best resistance and cadence to match each song you are spinning too. It works just as well as if you were at a real-life spin studio.",
    "As for the type of class you choose, the filter allows you to opt for a duration of time; with classes ranging from 15 minutes to an hour. You can also opt for a bike-only ride, or one that incorporates weights.",
    "Once you start a class, you can see the stats from your connected bike on your screen. Again, this is where using a phone lets you down, as its size makes it difficult to focus. The larger the screen, the better.",
    "During the class, you can also be motivated by a leader board on the side of the screen which shows how you rank compared with other people who have completed it.",
    "As with many training apps, you need to find the right instructor for you and we didn’t have a problem with this as the majority were brilliant, explaining not only the exercises we were following but the importance of everything from our posture to water breaks.",
    "The bike felt secure and steady at all times. Our only complaint is that it took a bit of time to get used to the saddle, which is not the most comfy of seats. As we were sharing the bike with my family members, it was interesting to see athletic teenagers put it through its paces at the highest speed possible without any issues.",
    "The missing piece of the overall experience is without a doubt the screen. Doing classes on an iPad is doable but if you are used to large screens such as the Peloton bike displays you will be disappointed. However, that is where the price point is reflected. This is a very worthy alternative spinning bike that doesn’t cost the earth, but doesn’t skimp on quality and features either."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and release date",
    "9": "Design",
    "13": "Performance",
    "23": "Don't buy it if"
  },
  "links": {
    "Apex Bike": "https://apexrides.com/products/bike",
    "running shoes": "https://www.techradar.com/best/best-running-shoes",
    "Apex Rides": "https://apexrides.com/products/bike"
  }
}