{
  "source": "https://www.techradar.com/reviews/woocommerce",
  "title": "WooCommerce ecommerce platform review",
  "category": "computing",
  "updated": "2021-07-09T17:28:05.388Z",
  "author": "mike-williams",
  "summary": "Add an online store to your WordPress blog",
  "verdict": "A good, highly versatile WordPress plugin which will allow you to quickly and easily set up an online store within your existing site. Completely customisable and expandable thanks to a vast number of extensions to help you create a unique experience for your customers and yourself.",
  "pros": [
    "Versatile",
    "Easy to use",
    "Integrated within WordPress",
    "Free (to start with at least)"
  ],
  "cons": [
    "Tethered to WordPress",
    "Can’t be used with free version of WordPress"
  ],
  "article": [
    "Building an online store can feel daunting. Thankfully there are many services out there which aim to facilitate the process, and one of the most well known is WooCommerce.",
    "WooCommerce is a free WordPress open source plugin, meaning if won’t cost you anything to use, but there are a few strings attached to that price. The most obvious one is, just like any other plugin, you won’t be able to use it with the free version of WordPress. You either need to upgrade to an annual plan, or install it yourself on a domain name you already own and host yourself. Both options have their advantages and disadvantages, but we find the latter to be much more flexible.",
    "Once installed and activated, WooCommerce guides you through the setup process. It asks you to supply it with an address, and wants to know what kind of industry you’re in, the sort of products you intent to sell, etc.",
    "It’s great to see that WooCommerce caters for pretty much everything, from physical products (obviously), to digital downloads, bookings, memberships and subscriptions - although everything but the first two are chargeable extras.",
    "During this initial process, you’re offered additional free extensions which show the breadth of this plugin. You can choose to enable support for credit card payment, sales tax calculation, Facebook and Google Listings connections, Mailchimp and Creative Mail integration, amongst others.",
    "Finally, you’re offered to select a theme for your store. You do have the choice of sticking with your current one, buy one of the many themes on display, or select Storefront, a free theme which is a great place to start if you’re new to selling your wares online.",
    "The process of adding products to your store is quite simple, with the interface actually guiding you through the process. You have multiple options, such as using a template, adding items manually, and importing them via a CSV file (ideal if you deal with a lot of goods).",
    "If you’re migrating from a different service, WooCommerce do recommend you use a dedicated migration service, and they even suggest Cart2Cart.",
    "When it comes to adding products individually, WooCommerce strongly suggests the Template option. It’s further divided into three categories, one each for physical, digital and variable products (like an item that comes in multiple colours or sizes for instance).",
    "If you’re familiar with WordPress, you’ll feel right at home as you fill in the required info: a product page looks and feels exactly like a WordPress blog post, with a few additional fields thrown in.",
    "Looking at digital downloads for instance, you can add multiple files to a single purchase, allow (or not) multiple downloads from the same purchase, set an expiry date for the link you’re providing, pretty much everything you’d expect.",
    "You’re also able to set sale prices, and choose ahead of time when the sale will start and end, so you don’t have to worry about changing everything on the day.",
    "As it stands, WooCommerce is a great plugin which would allow you to start a store on your existing (non-free) WordPress blog with little effort, and if this was all it offered, it would actually be pretty good.",
    "However, being a plugin, WooCommerce also allows for extensions, and this is where the extreme customisability of this service comes into play… and where the costs can start soaring. As of this writing, 100 extensions are available, 32 of which are free, and include the ability to link up to Google Analytics, connect to Stripe to accept credit card payments, or PayPal, AmazonPay and a host of others. There’s a plugin to allow you to accept accommodation payments, another to customise the look of your store with WordPress Gutenberg blocks, there are marketing extensions, shipping options, store managements, etc. With them, you can create a truly bespoke store with a unique look, specific offerings, means of payments, and analytics.",
    "This could feel a little daunting for newcomers, but the great thing about extensions is you can ignore them all until you’re confident enough to move your digital emporium to the next level.",
    "As long as you can get past the initial WordPress restrictions, WooCommerce is a very easy yet powerful and versatile plugin to use, set up, monitor and grow your online business. It’s free to start with, and there are numerous extensions available to refine and customise your store, many of which come at a price. If you already have a WordPress site and wish to venture into retail, this is actually a great way to start."
  ],
  "headers": {
    "2": "Getting started",
    "6": "Adding products",
    "12": "More available",
    "15": "Final verdict"
  },
  "links": {
    "online store": "https://www.techradar.com/how-to/start-an-online-store-from-scratch-and-drive-sales",
    "WooCommerce": "https://woocommerce.com/",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "credit card payment": "https://www.techradar.com/best/best-credit-card-processing-service",
    "Mailchimp": "https://www.techradar.com/reviews/mailchimp",
    "WordPress blog": "https://www.techradar.com/news/best-wordpress-themes-for-blogs",
    "Google Analytics": "https://www.techradar.com/reviews/google-seo-tools"
  }
}