{
  "source": "https://www.techradar.com/reviews/bird-one-electric-scooter-review",
  "title": "Bird One electric scooter review",
  "category": "fitness",
  "updated": "2021-05-07T11:43:36Z",
  "author": "tom-bedford",
  "summary": "One to avoid",
  "verdict": "The Bird One has a range of issues, from minor ones like the fact you can't fold it, or its spotty app, to absolute deal-breakers, like a big assembly problem or the fact it goes faster than legally allowed in some countries yet you can’t see your own speed. A few neat aspects, like the great range or the fact you can buy it in various colors, don’t do enough to avoid a thumbs down from us.",
  "pros": [
    "Comes in several colors",
    "Pretty good range",
    "Balanced acceleration"
  ],
  "cons": [
    "Hard to assemble",
    "No speed controls or display",
    "Use is dependant on temperamental app"
  ],
  "article": [
    "Bird is one of the big-name scooter brands, mainly for ride hiring - in plenty of cities across the globe you can use your smartphone to rent such a vehicle and hit the streets. You can buy one of the brand’s electric scooters to own privately too, and the Bird One is one such model.",
    "Well, you can buy a Bird One, but to get here you’ve already scrolled through our star rating, our verdict and our ‘cons’ list, so you know that we don’t think you should buy the scooter. The reasons why are hard to condense to a two-minute review, so read the longer article for our full review, but we’ll highlight some key points here.",
    "Firstly, the Bird One is way too expensive - you can buy a good electric scooter for half its price, and it doesn’t do enough to justify its premium price tag.",
    "Secondly, using the Bird One is dependant on the Bird app which you use to unlock it, turn on the lights, and other such functions. This app is temperamental at best, and it frequently disconnected from the scooter or returned incorrect battery stats.",
    "Unlike the vast majority of electric scooters, the Bird One doesn’t have a display to tell you your current speed or battery status, and there are no riding modes that control your speed. This would be annoying anyway, but given the Bird One’s max speed is above speed limits in several countries, it’s an injury or fine waiting to happen.",
    "You have to set up the Bird One yourself, as with most electric scooters, but we found it much harder than with any other vehicles we tested. As a result, we ended up with a wobbly handlebar - and given that our most seasoned scooter-testers couldn’t set it up properly, we imagine that’ll reflect the experience of most other people too.",
    "The Bird One doesn't fold down to become more portable either, so if you would need to carry it up or down stairs, you're going to have a problem.",
    "These are just the bigger issues we faced with the Bird One - each is enough to deduct a few stars from our score, but together they’re a recipe for disaster. Even if you can look past one or two problems, there are enough more that it doesn't matter. Riding the Bird One was a stressful experience, one we were nervous to embark on every time we took the thing for a journey.",
    "Lots of our issues don't apply if you're just renting the Bird One too, so if you're just checking out how they ride, scroll down to our 'Riding' section.",
    "In the interest of fairness, we should say the Bird One has one or two redeeming qualities. Its range is one of the best of any electric scooter we’ve tested, so it’ll suit people with longer commutes, and its acceleration speed was perfect for comfortable starts.",
    "However these features don’t do much to improve the experience. If an electric scooter should be anything, it’s ‘safe to ride’, and we felt profoundly unsafe when testing the Bird One. As a result it’s hard to recommend the thing.",
    "The Bird One electric scooter is the same model you’ll find if you use Bird’s scooter rental app available in many cities - this is just a retail version of that same vehicle.",
    "You can buy your own Bird One electric scooter for $1,299 / £999 - that’s fairly expensive as scooters go, because you can buy great equivalents for less than half that price - but there are vehicles on the market that are pricier than that too.",
    "At a high price like that you’d expect plenty of features and tools, but at the risk of spoiling the rest of this review, we’re not sure the Bird One provides that.",
    "If the Bird One was a bird, it’d be a pigeon, because it’s pretty average in terms of design. Its base measures 118 x 46cm, and the handlebars bring the height up to 118cm. It weighs in at 17.5kg - that’s on the high side of average, but not by too much. The maximum rider weight is 100kg - just remember, that includes any backpack you’re carrying as well as your own weight.",
    "The scooter doesn’t fold down, unlike most its rivals, which we’ll explore more in the ‘Portability’ section.",
    "The rubber handlebars are slightly tapered to make them easier to hold, and while they aren’t the comfiest in the world, we’ve used worse too. Plus, they seem more durable than most.",
    "Central between the handlebars, at the top of the scooter’s stem, is a large plastic box - on most scooters, this would house a display to tell you your speed, remaining battery, and which riding mode you were in - the Bird One just has two LEDs that tell you if the scooter is charging or not. That means when you’re riding it’s impossible to know how fast you’re going, or how much charge you have left.",
    "The handlebars also house a bell and the brake on the left side, a light in the central box, and the accelerator and QR code on the right. The latter is used for initially scanning the scooter, after which its purpose is to make your scooter look more like a rental one than a personal one. The presence of a front-facing light is mirrored by a red rear one, which flashes when in use.",
    "The front and back wheels are 22.8cm or 9 inches across, and both feel super study. The scooter as a whole is IP34 rated, meaning its internals are protected from solids over 2.5mm, and water splashed from all directions. Bird advises against riding the thing in heavy rain, but puddles and light rainy spells are fine.",
    "Like most electric scooters, when you first buy the Bird One you have to attach the handlebar stem to the board yourself with an allen key provided. Despite this process usually being easy, we found it incredibly difficult with the Bird One, as no matter how much we tightened the bolts, the handlebars still rattled worryingly in use.",
    "We deconstructed and reconstructed the thing multiple times, but could never get the stem feeling safe and rigid. Since we’re used to assembling scooters, and even we had trouble putting the thing together, we’ve got to imagine most will have an issue with this same thing. This is a massive issue for the Bird One, as shaking handlebars makes the thing feel supremely unsafe, as we’ll explore more in our ‘Riding’ section.",
    "The Bird One doesn’t fold down, so good luck carrying it upstairs to a flat, or bringing it onto public transport. We live in a fifth-floor flat, and bringing the beast up those stairs in its unfolded form was a nightmare.",
    "It seems that the Bird One is designed to be left on the pavement outside your home instead, as the scooter has a built-in tamper alarm so that, when it’s locked, so much as touching it sets off a wailing alarm.",
    "The alarm goes off with the slightest provocation - we weren’t joking about touching it, and it started screeching when we hung our helmet on the handlebars before a journey. You’re supposed to unlock the scooter before a journey, but we’ll get onto the issues with that in the ‘App’ section of this review.",
    "When locked, you can’t ride the Bird One scooter, so at least potential thieves won’t be able to ignore the alarms and scoot off into the distance with it. Well, they could pick it up and walk away with it though - the ideal of lock-less pavement scooter security remains just a dream for now, and the Bird One doesn’t make it a reality.",
    "According to Bird, the One electric scooter has a range of about 25 miles or 40km. This is a fairly good range for such a vehicle, and to the credit of the scooter, it felt fairly accurate in our testing. We drove 5 miles and finished with 75% charge left.",
    "What’s more impressive is that usually, electric scooter makers quote the distance you’ll get on the less-power-intensive slower modes. In this way, while the figures are technically true, they often don’t reflect the real experience of riding a scooter. The Bird One doesn’t have different modes though - we got our distance when traveling at the scooter’s top speed, so the range feels doubly correct.",
    "The Bird One electric scooter takes six hours of charging to get from full to empty - that’s fairly average for this kind of vehicle, as four to eight hours tends to be what we see in most. You charge the vehicle by plugging a cable from mains into the base of the scooter, and a charging light on the handlebars lets you know something’s happening.",
    "Now we come to the elephant in the room. That’s likely what we resembled when riding the Bird One, as we flailed and crashed about the place trying not to cause damage.",
    "Riding the Bird One feels unsafe. That’s largely down to the construction issue we mentioned before, so the handlebars wobble and jolt about when you’re riding. As a result, when scooting over uneven surfaces, you’re constantly terrified of the scooter bucking in one direction or another, and falling over or throwing you off.",
    "We got past this issue by gripping the handlebars tight and pushing them forward or pulling them towards us, to use our strength to stop the shaking, but this is a tiring and stressful way of riding. It’s better than the constant fear of falling off into traffic, though.",
    "This construction issue is a deal-breaker, and we can’t recommend the scooter as a result. The only exception we’ll provide is if you can get a pre-constructed one, either from Bird itself or a regional seller.",
    "This assembly issue won’t plague people who are using Bird’s rental scooters, instead of their private ones. So construction and handlebar problems aside, how does the Bird One ride? Well, it’s okay, but nothing to write home about.",
    "We found the break wasn’t sensitive enough - squeeze it a little, and you don’t lose much speed, squeeze it harder and you stop too quickly. Trying to stop gently became a distant dream. The turning arc of the scooter was too wide too, and we often had to give turns a wide berth to successfully make them.",
    "The absence of riding modes, as most scooters have, and the fact you can’t see your speed, gives you much less control over your riding habits than you should have. While on other scooters you can drop into a lower speed mode to cruise through residential areas, or ride in an ‘eco’ mode to preserve battery, the Bird One doesn’t present those important options. It can be harder to guesstimate your speed than you may think.",
    "Depending on where you live, the lack of a speed indicator can be a nuisance, or much, much worse. We say this because the Bird One’s maximum speed is 18mph or 29kmph - that’s quite a way over the UK’s 15.5mph or 25kmph electric scooter speed limit, so with this scooter you could break the law and never even know. It’s worth pointing out that the US speed limit is higher, so you won’t break it with the Bird One.",
    "If there was something we did like, it was the acceleration speed, as it sat in the perfect goldilocks zone. If the acceleration of a scooter is too fast, you have little control when starting and can often zoom straight into traffic; if it’s too slow, after starting at a light you can get in the way of other motorists and cyclists. The Bird One was just right.",
    "Thanks to having a 350w motor, the Bird One takes hills pretty well, so we could power up them without losing much speed. The lights felt powerful too, and we always felt sufficiently ‘seen’ at night.",
    "The Bird One scooter uses Bird’s scooter rental app, and we had quite a few issues with the thing.",
    "Firstly, initially connecting the scooter is a pain. The option to do so is well hidden, and we spent a lot of time Googling and searching before we figured out the solution - there’s no unique way to register a personal vehicle, you just scan your own scooter as though it’s a rental one. This could be a lot clearer.",
    "The Bird app has connectivity issues, and given you use the app to turn on the scooter, deactivate the tamper alarm, see your scooter’s battery and toggle the lights, that’s a huge problem. We frequently found the app seemed convinced it was connected to the scooter when it wasn’t.",
    "Several times we unlocked the scooter - or thought we did - only to be accosted by the tamper alarm when we tried to use it. This can be pretty terrifying in public, where people could think you’ve stolen the vehicle. Frequently the app failed to toggle the lights when we wanted it to, it often told us totally inaccurate battery readings, and occasionally our total ride distance was reset.",
    "A good electric scooter app should be a way of eking out extra usefulness from your personal vehicle - it shouldn’t be necessary to use the thing, and it shouldn’t be this buggy either.",
    "First reviewed December 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Bird One price and availability",
    "14": "Design",
    "22": "Portability",
    "26": "Battery",
    "29": "Riding",
    "39": "App",
    "44": "Don't buy it if..."
  },
  "links": {
    "electric scooters": "https://www.techradar.com/best/best-electric-scooters"
  }
}