{
  "source": "https://www.techradar.com/reviews/clover-pos-point-of-sale-review",
  "title": "Clover point of sale (POS) review",
  "category": "computing",
  "updated": "2021-07-30T13:10:13.157Z",
  "author": "rob-clymo",
  "summary": "The Clover POS system is a comprehensive payment solution that could help excel your business.",
  "verdict": "There are numerous options to choose from if you’re looking at a POS to meet the needs of your business, with Clover having a chunky range of hardware options, plus a solid user experience to back it all up.",
  "pros": [
    "Great integrated solution",
    "Easy to master",
    "Apps boost appeal",
    "Options to suite a variety of outlets"
  ],
  "cons": [
    "Cumulative costs"
  ],
  "article": [
    "Get a quote for a POS system today.",
    "Clover's stylish POS systems are plentiful in their offering of business-ready features and fast, secure payments. We'd suggest Clover POS as great solution if you’re looking to streamline your in-house services and want to replace old kit such as cash registers, payment terminals or other hardware.",
    "A Clover point of sale solution lets you do away with all of that and replace it with a more integrated POS system, with modern products that can keep your business running much more efficiently.",
    "Clover POS has a range of options to choose from and gets consistently praised for offering simple to use but powerful hardware that just works.",
    "You can subsequently mate the kit with either a Clover merchant account or use one from a merchant services provider. Clover is also sold by the likes of Bank of America, BBVA, Citi, PNC, and SunTrust.",
    "Other options in the POS marketplace include Sage Pay, PaySimple, Authorize.net, Worldpay, PayPal, Helcim and Stripe. If you want to weigh up Clover against a leading competitor, read our Square POS vs. Clover POS system review.",
    "To get the most accurate pricing, always contact Clover POS directly.",
    "Signing up for a merchant account with the company starts from $9.95 per month, with payments taken virtually or entered by hand being charged at 3.5% + 10¢ per transaction.",
    "If you use a Clover device to take payments, the rate drops to 2.7% + 10¢. You’ll first need to decide if the Register Lite or the regular Register Plan suits your business, depending on its size.",
    "From there, Clover has an extensive range of products and services that seem to cover all bases. Mobile payments package Shop Flex, for example, is $499 while Shop Go is just $69, which allows you to accept swipe, dip and payments from your phone.",
    "A more sophisticated package like the Station Pro one, meanwhile, costs $1649 and delivers a point of sale hardware bundle that serves both employees and customers with a dual screen setup.",
    "Looking for a compact package? Shop Mini is a smaller offering, at $749, while there are also full-service POS options for restaurants including the Shop Station at $1349 and smaller Shop Mini at $749.",
    "The Clover point of sale hardware range has been designed to cover all bases, with the taking and processing of payments and orders obviously being the main considerations.",
    "However, the hardware and software combination also allows you to organize your inventory and cultivate new customers too.",
    "Clover POS is cloud-based, so it can be administered from anywhere and there is also no per-employee charge, which means it is easily scaled for use by an entire team.",
    "Additional devices can be added as you grow and Clover’s options of using additional apps and devices means it’s certainly flexible.",
    "Along with the hardware options listed in the pricing section above, Clover POS systems can be augmented with accessories, such as kitchen printers and displays, along with a lockable cash drawer.",
    "Even in its most basic guise, a Clover POS system arrives with all of the core ingredients to get up and running.",
    "Therefore, it should require minimal effort to subsequently adapt to your business, with the added benefit of multi-layered security on a PCI-certified system adding to the overall performance appeal.",
    "And, the fact that Clover POS is cloud-based also means it’s resilient if you suffer connectivity issues, allowing you to continue processing payments and ensuring successful transactions if if your internet is down.",
    "When it comes back up again Clover POS pushes through all of your stored and encrypted data.",
    "Clover has been nicely designed and works whether or not you’re the main administrator or an employee who needs to dip in and out of the interface to get your daily duties done.",
    "What’s more, the cloud-based platform it’s run on means that all of your important data is stored remotely, which also means its safeguarded against anyone inadvertently doing the wrong thing.",
    "That could pay dividends in something like a retail arena where you might have several employees also using the Clover system.",
    "When it comes to support options if you’re running a Clover POS then there are numerous routes for getting assistance. This includes phone, chat and email 24/7 according to Clover.",
    "A dedicated help center covers a lot of bases with its exhaustive selection of topics that cover basic troubleshooting, working with the Clover web dashboard, getting to grips with the apps as well as staying on top of updates, security and managing your account.",
    "However, it’s worth also bearing in mind that if you have a merchant services provider alongside your Clover account then support for that will likely come direct from that source.",
    "Software and hardware from Clover on the other hand, will be provided by parent company Fiserv.",
    "There are multiple options for Clover POS and that makes it hugely appealing for a very wide selection of businesses.",
    "While its use is mainly suited from small to mid-size ventures, Clover POS is also scalable for retail and restaurant use, which means that you can build it up as your business expands by moving up to the next suitable package.",
    "One of the main areas of attraction here is the ease of use that comes with this range of POS solutions, allowing it to be mastered by multiple members of staff.",
    "Adding to that appeal is the range of supplementary apps that boost its credentials with one-touch launch convenience. These range from offering staff-assistance tools and customer offer benefits through to delivering reports and managing inventory. Overall, there is lots to like here."
  ],
  "headers": {
    "6": "Clover POS pricing",
    "12": "Clover POS features",
    "17": "Clover POS performance",
    "21": "Clover POS ease of use",
    "24": "Clover POS support",
    "28": "Clover POS: final verdict"
  },
  "links": {
    "Get a quote for a POS system today.": "https://www.techradar.com/news/get-a-quote-for-a-pos-system-today",
    "point of sale solution": "https://www.techradar.com/news/the-best-pos-system",
    "Sage Pay": "https://www.techradar.com/reviews/sage-pay-credit-card-processing",
    "PaySimple": "https://www.techradar.com/reviews/paysimple-credit-card-processing",
    "Authorize.net": "https://www.techradar.com/reviews/authorizenet",
    "Worldpay": "https://www.techradar.com/reviews/worldpay",
    "PayPal": "https://www.techradar.com/reviews/paypal-credit-card-processing",
    "Helcim": "https://www.techradar.com/reviews/helcim-credit-card-processing",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "Square POS vs. Clover POS system review": "https://www.techradar.com/news/square-pos-vs-clover-pos-system-whats-the-difference-and-which-is-best-for-my-business",
    "merchant account": "https://www.clover.com/pos-systems/clover-account",
    "Shop Flex": "https://www.clover.com/shop/clover-flex-a?mboxSession=9502fe70723449ce9bda1064a410032a&adobe_mc_sdid=SDID%3D71E13C72381D82C7-7ECB56D1307A9D23%7CMCORGID%3D93071CFE533058D80A490D45%40AdobeOrg%7CTS%3D1586603329&adobe_mc_ref=https%3A%2F%2Fwww.clover.com%2Fshop",
    "Shop Go": "https://www.clover.com/shop/clover-go?0%5BbackgroundSize%5D=contain&0%5BbackgroundColor%5D=%23e5f9f8&0%5BbackgroundPosition%5D=right%20bottom&1%5BbackgroundSize%5D=auto%2085%25&1%5BbackgroundColor%5D=%23e5f9f8&1%5BbackgroundPosition%5D=right%20bottom",
    "Station Pro": "https://www.clover.com/pos-systems/clover-station-pro",
    "Shop Mini": "https://www.clover.com/shop/product/mini-table-service/lte",
    "Shop Station": "https://www.clover.com/shop/clover-station",
    "Clover POS": "https://www.clover.com",
    "POS solutions": "https://www.techradar.com/news/the-best-pos-system"
  }
}