{
  "source": "https://www.techradar.com/reviews/oculus-rift-s-review",
  "title": "Oculus Rift S review",
  "category": "gaming",
  "updated": "2021-03-11T13:04:06Z",
  "author": "gerald-lynch",
  "summary": "More Oculus Rift 1.5 than a true successor",
  "verdict": "The Oculus Rift S is certainly a more approachable entry point into PC-based VR. But its concessions for accessibility haven’t improved the overall experience of entering into virtual worlds.",
  "pros": [
    "No external tracking stations",
    "Improved visuals",
    "Backwards compatible"
  ],
  "cons": [
    "Reduced refresh rate",
    "Wired",
    "Prone to crashing"
  ],
  "article": [
    "If you're looking for one of the best VR headsets, consider the Oculus Rift S.",
    "Virtual reality has come a huge way since Oculus founder (and controversial VR poster boy) Palmer Luckey first introduced the world to the Oculus Rift way back in 2012.",
    "Now owned by Facebook, the Oculus Rift S should represent the next leap forward for the company’s high-end, PC-based virtual reality experiences. But in practice, this is more of a baby-step in terms of upgrades and added features on the original Oculus Rift. What we’re saying is the Oculus Rift S is not a true “Oculus Rift 2” successor. But is definitely a valid contender when it comes to the best VR headsets available to buy in 2021.",
    "If you follow along with technology, the name Oculus Rift S should ring a few bells. That’s because both Apple and Microsoft add an ‘S’ to their products in order to denote an iterative improvement (look at the Xbox One S and iPhone XS for examples), as well as to indicate that the product is backwards compatible and will, in time, replace the original. All of these things are true for the Oculus Rift S.",
    "And so we have a virtual reality headset that, in many respects, particularly pertaining to accessibility, is superior to its predecessor, the original Oculus Rift. However, this VR headset isn’t the generational leap forward many were expecting. In fact, the Rift S makes some trade-offs that actually feel like a step backwards. In summary, the Rift S is good – but not ‘next-gen’ good.",
    "The Oculus Rift S is available now, and costs $299 / £299 / AU$499. That’s considerably cheaper than the price that the original Oculus Rift entered the market at – though you’re now able to pick up that headset for around the $349 mark, which would be worth considering given what we’ve seen from the Rift S.",
    "It’s also significantly cheaper than the HTC Vive, Vive Pro and forthcoming Valve Index, its closest competitors, which all require external tracking sensors to work. However, though we’ve yet to conduct a final review of the Valve Index, its money-no-object approach to quality is making it look like the most fully realised VR experience to date.",
    "The Oculus Rift S, like the Oculus Rift VR headset which came before it (you'll sometimes see that one referred to as the 'original' Oculus Rift), works in tandem with a PC to deliver virtual reality experiences.",
    "It connects to your PC over a USB 3.0 port and a DisplayPort connection, and is tethered to the machine by a lengthy cable that’s more than enough to accommodate the ‘room-scale’ experiences that Rift S is capable of delivering. It’s more limiting in terms of free movement than the superb wireless Oculus Quest and the more recent Oculus Quest 2 (both of which are standalone headsets with absolutely no wires), but the trade-off here is that, by being powered by your PC, it’s capable of putting you inside more advanced and ambitious VR worlds.",
    "Like other VR headsets, the Rift S places two goggle-like lenses in front of your eyes, which give you a stereoscopic 3D view of a world you’re placed inside. A combination of sensors then calculate your real-world movements and translate them into in-game movements. For example, you turn your head left, and the digital world moves with it, crouch, and the in-game floor draws closer, in real-time. It remains a wondrous, almost sci-fi like experience, especially if the interactive world around you proves to be an interesting one.",
    "But once you go past the general “wear it on your head” similarities, the Rift S’s industrial design is significantly different to its predecessor, that's the original Oculus Rift. Sure that won't be an issue for anyone new to VR, but is worth pointing out if you have an Oculus Rift and you were considering an upgrade.",
    "First, the fit. Have you used or seen a PlayStation VR headset? Then you’ll have a good idea of how Rift S is worn compared to its predecessor. Whereas the Rift (and the Quest) used a thin rubbery strap that went over your crown (tightened here by a velcro strap) and around the back of your head to two firmer points over your ears, the Rift S adds a plastic curved mould (liberally padded with cushioning) where your forehead and base of the skull are. There’s still a velcro strap for positioning the headset, but it’s now primarily tightened by a dial on the back headrest.",
    "It’s comfortable enough, though, like all VR headsets, it doesn’t fully mitigate the fact you’ve got a weight hanging off your face. The Rift S is no different, and it in fact feels heavier than the original Rift in terms of its frontal weight distribution.",
    "There’s a good reason for this though – the Rift S does away with external motion tracking sensors, which previously required you to use up USB ports on your PC and trail cables around your room and desk, in favor of outward-facing cameras. These are used to track your position in the room and the movements of the superb Oculus controllers in your hands (an included part of the package here). While this leads to a less visually-attractive external design for the Oculus Rift S, what with its two forward-facing, two side facing and one upwards pointing camera on its plasticky shell, this ‘Insight’ system is a far more efficient way of tracking a player and easing the set-up process.",
    "A pair of touch controllers ship with the Oculus Rift S, and these are slightly different to their predecessors. In play, you won't notice any difference against their older stablemates – they’re comfortable with face buttons for your thumbs to use, thumbsticks to push (with very sensitive touch areas on their faces to mimic resting your thumbs against your fingers), a trigger button for your index finger and a button in their handle to mimic a gripping, fist-making motion. They’re light and intuitive, and use a single AA battery each, rather than being rechargeable. The only difference is that their tracking ring sits on the top, instead of the bottom with the original Rift, but it does mean the two generations of controllers are no longer compatible with each other. As they’re included here, that’s not too big of an issue.",
    "However, not all the changes are necessarily for the better. Firstly, the Rift S has ditched the Rift’s over-ear earphones in favor of directional speakers in the headband. On the one hand, they offer a reasonable sense of directional audio in relation to what’s happening in the scene in front of you, while also letting your unobstructed ears listen out for what’s happening in the real world. After all, with your senses obscured by the VR world, it’s handy to be able to have an ear out for what’s happening around you. However, they leak an incredible amount of sound, which could be annoying for anyone sharing the same space as you, and they lack any sense of bass, which can lead to a VR game’s more bombastic scenes feeling weak. You can plug in your own headphones to a 3.5mm port on the side of the headset, but the fewer cables you have to contend with when it comes to VR, the better.",
    "Also, while you can now slide the headset forwards and backwards (like the PSVR) off and on to your face thanks to a release button on the underside, it feels a little tighter round the front overall, making it difficult to fit my glasses in. In addition, the IPD (interpupillary distance) slider from the original Rift is gone. This used to shift the lenses to compensate for those with broader or narrower distances between their eyes, but is now replaced by a software fix instead, as there’s only a single screen in use here compared to one for each eye on the first Rift. While we personally had no issue with the default position, it’s hard to imagine a software fix having the same effect as a physical lens shift without degrading the overall sharpness of the image in front of you. Lenovo is a manufacturing partner for the Rift S, and we’re not convinced its influence here has all been positive.",
    "Internally there are changes too. Again, on paper they seem improvements, but it’s less clear cut in practice. The Rift S swaps out the first Rift’s dual OLED screens for a single LCD upping the resolution to 2560 x 1440 for what should be a sharper image.",
    "But it also reduces the refresh rate from 90Hz to 80Hz. This is intended so as to keep the price down as well as keeping the minimum specs for the device the same as that of the Oculus Rift, letting more people get onboard without having to upgrade their PC gear. But it also runs the risk of aggravating those that suffer from VR-induced motion sickness, with the screens not updating at a rate your brain perceives to be natural.",
    "Mileage, and the ability to identify the difference here, will vary. But as I’ll detail later, the Rift S is the first VR headset I’ve worn that resulted in my being physically sick. Whether that’s the result of the hardware changes, or the software I was using, it’s difficult to tell. But it proves that the form has still yet to be perfected either way, and to my eyes the trade up in resolution was barely perceptible anyway.",
    "What’s inarguable though is the improved ease of use of the headset as a result of the addition of those cameras. That’s a trade off we’re happy to make, as it’s now exceptionally easy to get started with the Rift S. Whereas the Rift would have you struggling to position external sensors to track you and the playspace you were standing in, especially if you were attempting to play a roomscale game that required a sensor be placed behind you, plug the Rift S in and you’re up and running in minutes.",
    "The aforementioned camera-powered Insight system is elegantly simple. Once your computer has installed the necessary Oculus software and you’ve plugged the headset in, put the batteries in the controllers and put the headset on, the Rift S then shows you a black and white image of the real world around you, as seen by the cameras. All you then need to do is use the controllers to point at the ground and draw out an obstacle free play space, and you’re ready to go in as little as five or so minutes.",
    "This safe play space is then represented around you like a Tron-style cage – it only becomes visible as you approach it or wave your controller-wielding hands through it, letting you know that you’re approaching the boundaries of your designated play area. If you need to check what’s going on in the real world but don’t want to take off your carefully adjusted headset, you just poke your head through the VR boundary and you’re again presented with the real world. It’s useful and intelligent.",
    "Remember when we said Oculus doesn't want you to call the Rift S the Oculus Rift 2? It's because there's some definite fear around a second-gen product that could confuse and frustrate its existing dedicated player base.",
    "To reduce this frustration, Oculus is making the Rift S completely backwards compatible with the original Rift titles, and making the Rift forward compatible with the vast majority of games released for the Rift S and Oculus Quest with some minor exceptions.",
    "That said, while you'll definitely see the same games in each of the stores, buying one on the Oculus Rift S or Oculus Rift doesn't automatically score you a version on the Oculus Quest– it might, but according to Jason Rubin, VP of Games at Oculus, that's a decision they're going to leave up to developers.",
    "As for the quality and quantity of games coming to the store in 2019, we were told that Oculus has already invested $250 million of its own money in developers and would invest another $250 million in the coming years. So far that money has brought us over 50 Oculus Studios titles, with more coming down the pipeline.",
    "Oculus’s own content library is now robust and worthy of attention, with games like Robo Recall, Lone Echo and From Other Suns exceptional games that simply wouldn’t be anywhere near as engrossing outside of VR. The forthcoming Asgard’s Wrath looks huge too – the sort of full-on, full length experience that some gamers fear can’t be found on VR. They can on the Oculus Store, and now not in insignificant numbers. The same goes for interactive movies, social VR hangout spaces and creative design software. It’s taken its time, but there’s now enough top-notch VR software out there that you’re unlikely to get bored with the Rift S any time soon.",
    "But it’s not all created equally – the Oculus-funded titles tend to be the most impressive, both visually and in terms of comfort. There’s a lot of filler on the Oculus Store, and some of it doesn’t adhere to design standards that make VR comfortable to navigate. Thankfully, Oculus has a liberal returns policy, and its store ranks sorts experiences by comfort level.",
    "Despite its ease of set-up, the Oculus Rift S did still suffer from some stability issues. Using a machine that greatly surpassed the system’s recommended minimum specs, we’d often find that Oculus would fail to respond when booting up its software, with its screen remaining black. Likewise, this would sometimes occur when waking the headset from sleep (which should spring into life when it recognises it’s been placed back on your head after it’s been idle for a while). Sometimes this wouldn’t even be fixed with a computer restart, but only by unplugging the headset altogether.",
    "It’s an issue that appeared to be exacerbated by the use of Steam VR. Though it’s a rival game front, Steam owners Valve have worked to make Rift hardware compatible with Steam VR software. This is excellent, as it vastly increases the number of games that can be played on the Oculus Rift, such as Steam VR PC-exclusives The Elder Scrolls V: Skyrim VR, and Fallout 4 VR. But running both the necessary Oculus Home app and the Steam VR platform simultaneously would regularly make the screen crash out, or the controllers to become confused.",
    "In addition, the Rift S would occasionally slow my PC boot up speed to an absolute, five-or-more minutes crawl, despite having an SSD drive, unless the headset was unplugged completely.",
    "Though this may not affect everyone the same way as virtual reality’s effect on an individual can vary so wildly, I’m going to lapse into a personal anecdote here regarding Rift S and nausea, as I feel it’s potentially pertinent to some of the hardware changes, and to highlight the difficulty of truly critiquing a piece of equipment like this.",
    "The Oculus Rift S is the first VR headset that, having been using it, has lead to me being physically sick. Is that the Oculus Rift S’s fault though? That’s a really tough question. Stay with me here…",
    "I was playing Fallout 4 VR using the Oculus Rift S headset. It’s not officially part of the Oculus Rift ecosystem, as it’s distributed through Steam VR. However, efforts have been made to make it work with Oculus Rift – the in-game controllers, when played with the Rift S headset, appear like the Rift’s touch controllers, rather than the HTC Vive wands that the game was natively developed for. Still, Fallout 4 VR is a big-name game within the VR world, so it felt like testing it would be a fair real-world use case to put the Rift S up against.",
    "But it wasn’t long into the game before I had to pull the headset off, rush to the toilet and throw up. Now, I’m a VR veteran, having extensively used the original Rift, the PlayStation VR, Oculus Go, a bit of Vive, a bit of Quest and several lesser-known headsets. I know my limits, and while no headset has ever produced this response, all to some degree have after a time made me feel a bit queasy. But this nauseating experience made me feel rough so quickly that it caught me by surprise.",
    "So what’s to blame? It’s here where the chain of commercial players in the VR space makes identifying the problem so difficult. You’ve the Oculus headset, running its own background software, which is being tapped into by the Steam VR SDK, with its own way of interpreting the data you’re sending it. Then you’ve the game, Fallout 4 VR, which is developed by another team, Bethesda Softworks, with its own approach to VR. Fallout 4 VR itself is a port of a standard console and PC game, reworked for virtual reality. Then there’s the fact that I tweaked some of the comfort settings to make movement slightly smoother and faster in game, as the default settings simply weren’t fun. On top of that, the new Oculus hardware has reduced the refresh rate to 80Hz, down from 90Hz, which is known to potentially have nauseating effects in some instances.",
    "Would I have had a better experience if Fallout 4 VR was natively supported by Oculus? Or if I’d been playing the game on a HTC Vive Pro or Valve Index? Or even the faster-refreshing Rift? Or if I hadn’t edited the comfort settings? Is it down to my own lack of VR stamina, or was it even down to something I ate?",
    "The variables are near endless, and herein lies a fundamental issue with VR. It requires the careful manipulation of so many of your physiological features and senses, by so many different parties, that your experience could vary wildly from mine. Even as devices like the Rift S lower the barrier for entry, there’s still no way of knowing whether your body will reject or embrace it without giving it a try. And that’s still a gigantic hurdle for the VR industry as a whole to conquer.",
    "Outside of that one harrowing experience however, I’ve had many enjoyable hours with the Oculus Rift. Games like Moss and Beat Saber show the immersive potential of VR, when all the elements come together harmoniously. When VR works well, it’s quite unlike any other tech-fuelled experience you can have. The curious should still explore what it has to offer.",
    "And so the Oculus Rift S in an incredibly complex beast. In many key respects, it betters the original Oculus Rift. It’s easier to set up, potentially more comfortable to wear, has a much more robust games library than it did at launch, and an improved resolution.",
    "But it’s had to sacrifice greater audio and refresh rate to do that, and does very little to appeal to those that have already invested in the Oculus ecosystem. On top of that, the actual experience of wearing a VR headset has, for better or worse, remained more or less unchanged – whether that’s something you’ll find fascinating and comfortable, or isolating and nauseating, or otherwise.",
    "Which makes the decision to not jump in with two feet and push the limits of VR even further forward tough to extrapolate. Who is this for? If the original Rift didn’t coax the casual users, I’m not certain that an improved set-up experience will shift the dial for those still on the fence. And so not to cater to the dedicated hardcore VR fan leads us to believe that Oculus runs the risk of letting its most loyal fans begin to eye-up the Valve Index instead.",
    "Some have suggested the Rift S is really aimed at developers setting out to work on the Quest, given that their feature set is so similar, with the added grunt of the Rift S giving it the potential to mimic even the next-gen Quest that remains wire-free but with a few years of improvements letting it get a performance bump of its own.",
    "That would make sense, whereas the Rift S, as it stands now, really doesn’t. At this juncture, the future of Oculus VR, if it is ever to have mainstream appeal from a consumer perspective, looks to sit then with the Oculus Quest, whose freedom of movement does stand the chance of being truly transformational, given the right software. The Rift S, by comparison to its stablemate and its forthcoming competition, seems a step behind the pack right out of the gate.",
    "All image credits: TechRadar",
    "Additional reporting by Nick Pino"
  ],
  "headers": {
    "5": "Price and availability",
    "7": "What is the Oculus Rift S? And what’s VR?",
    "11": "Oculus Rift S: Design, fit and comfort",
    "17": "Oculus Rift S: Screen specs",
    "20": "Set up and Insight",
    "23": "Oculus Rift S: Game library",
    "29": "Performance",
    "32": "A one-off nauseating experience?",
    "40": "Final verdict"
  },
  "links": {
    "best VR headsets": "https://www.techradar.com/news/the-best-vr-headset",
    "Oculus Rift": "https://www.techradar.com/reviews/gaming/gaming-accessories/oculus-rift-1123963/review",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "Vive Pro": "https://www.techradar.com/reviews/htc-vive-pro",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "PlayStation VR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "The Elder Scrolls V: Skyrim VR": "https://www.techradar.com/pro/software",
    "Fallout 4 VR": "https://www.techradar.com/news/fallout-4-and-doom-in-vr-arrive-later-this-year",
    "Moss": "https://www.techradar.com/news/top-playstation-vr-game-moss-launches-for-oculus-rift-htc-vive-and-steamvr",
    "the next-gen Quest": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs"
  }
}