{
  "source": "https://www.techradar.com/reviews/sony-xh90-kd-75xh9005-4k-tv",
  "title": "Sony X900H/XH90 4K HDR TV review",
  "category": "televisions",
  "updated": "2021-12-03T11:28:26Z",
  "author": "simon-lucas",
  "summary": "All the TV you’ll ever need (or will have room for)",
  "verdict": "Vibrant picture performance, cracking upscaling and the promise of HDM1 2.1 makes the XH9005/X900H an all-rounder it’s impossible to ignore.",
  "pros": [
    "Dynamic, convincing 4K HDR",
    "Impressive upscaling",
    "Full-bodied sound"
  ],
  "cons": [
    "No HDR10+",
    "No HDMI 2.1",
    "Brash Android interface"
  ],
  "article": [
    "The Sony X900H/XH90 4K HDR TV might be second in the Sony's TV range in terms of 4K LCD TVs, but it's the first in our hearts.",
    "It’s meant to be good etiquette, when choosing wine in a nice restaurant, to order the second-least expensive bottle on the list. And there’s an argument that says it’s equally sensible, when searching for a new television, to look at a company’s line-up and pay particular attention to the range directly beneath the ‘flagship’ models. The theory says this is where the true value for money lies, and where the ‘performance-per-pound’ ratio is strongest.",
    "Sony’s series of 4K LCD TVs consists of six ranges, and the XH90 (called the X900H in America) has only the Sony XH95/X950H above it in the pecking order. Despite starting at an eminently reasonable £1,299/$999 for the smallest (55-inch) version, the series is equipped with some very well-regarded picture processing, full-array local dimming and some fiercely complicated upscaling algorithms. The attention-grabbing Dolby picture and sound standards, Vision and Atmos, are catered for too.",
    "We’re testing the 75-inch version here, in a range that runs from 55-inch to 85-inch variants. No matter which particular screen-size suits your needs, though, does the XH90 deliver? Or is it going to make you wish you’d looked a little longer at the menu?",
    "The Sony XH90/X900H retails for $2,499 / £2,199 (around AU$3,600) for a 75-inch size, and is currently available in the US and UK.",
    "Its smallest 55-inch size retails for $999 / £1,299, while the 65-inch will set you back $1,399 / £1,499, and the 85-inch will cost you $2,799 / £3,299.",
    "The XH90/X900H is a fraction cheaper than the XH95/X950H, which starts at $999 / £1,199 for an even smaller 49-inch size, so it may be worth an upgrade if you have a little bit more cash to spare too.",
    "Sony has few lessons to learn where the industrial design of a great big television is concerned, and sure enough the XH90/X900H wears its considerable size lightly.",
    "The bezels enclosing that huge expanse of screen are slender and discreet, and the feet on which it stands are a similarly skinny flattened V-shape. It seems unlikely that a TV this big will be anything other than wall-mounted (even taking its significant 33kg weight into account), but should an owner be in possession of a surface wide enough to stand it on, there’s more than enough space below the bottom of the screen for a substantial soundbar.",
    "Depth of a touch more than 7cm means the Sony is not exactly skinny, but then its full array local dimming arrangement is bound to add more than a millimetre or two.",
    "The panel itself is a VA-type LCD, which in broad terms has to be considered an upgrade on the IPS edge-lit panel Sony deployed on last year’s equivalent model. The higher brightness, greater colour volume and improved screen uniformity promised by a full array VA panel ought to more than make up for the rather more restricted viewing angle when compared to IPS – and it’s worth bearing in mind the XH90/X900H doesn’t feature the X-Wide viewing angle technology Sony’s flagship XH95/X950H range is toting. Prospective customers should be sure every viewer will be able to sit more-or-less directly in front of their new TV.",
    "TV control is via an unremarkable remote handset. It’s longer than it needs to be, given the number of buttons it’s home to, and it’s far from a paradigm of common sense or legibility (apart from the huge ‘Google Play’ and ‘Netflix’ buttons, naturally). At least the ‘mic’ button is front and centre, and Google Assistant proves as responsive here as in any other application.",
    "Connectivity runs to four HDMI inputs at HDCP2.3, a pair of USB inputs, an Ethernet socket, aerial posts for one terrestrial and two satellite TV tuners, and a composite video input. Wireless connections amount to Bluetooth 4.2, Apple AirPlay, wi-fi and Chromecast. As far as outputs go, there’s a headphone socket and a digital optical output.",
    "As regards the HDMI inputs, all four are at 2.0 standard and one is ARC-enabled – although this seems to have changed since our initial review. In October, this Sony set received an over-the-air update that upgraded these HDMI inputs to HDMI 2.1, adding in support for 4K/120Hz passthrough, Variable Refresh Rate and Auto Low Latency Mode, ostensibly to prepare for the mid-November launch of the Sony PS5.",
    "HDMI 2.1 enables a number of key features for gaming, including Variable Refresh Rate, which reduces image stutter and smooths motion by more fluidly changing the frame rate during gameplay. It also enables Auto Low Latency Mode, which reduces lag for more responsive play.",
    "Design TL;DR: No bulkier than might reasonably be expected, and a full suite of connections, with updates promised to make an even more compelling package. As long as you don’t sit wildly off-axis, the VA panel type is most welcome too.",
    "Like almost every Sony TV these days, the operating system and smart TV interface is a combination of Android (9.0 in this instance) and YouView (in order to get UK TV catch-up services on board). And like every Sony TV that’s running Android, it’s a combination of the really quite useful and the downright irritating.",
    "On the ‘really quite useful’ side, there’s some of the more straightforward and sensible set-up menus you’ll find in the TV market, a nice wide selection of apps – including Disney Plus and Amazon Prime Video, as well as Tidal and its new selection of Dolby Atmos material – and Google Assistant, Google Chromecast and Google Play.",
    "‘Downright irritating’, meanwhile, is covered by the usual Android instance on hogging the entire screen whilst browsing, and the indecent number of hoops one must jump through simply to turn off the button-press ‘chirp’ when navigating the onscreen menus.",
    "Apple TV Plus wasn't available when this TV first released, either, though support for the Apple TV app has since been added.",
    "Smart TV TL;DR: It’s Android TV, with all of the good and bad that implies.",
    "Sony has put a lot of effort into improving the ability of its 4K TVs to upscale sub-4K content. By combining the prodigious power of its X1 4K HDR picture processing chip with an ever-expanding database of 4K-relevant images, it intends to offer greater detail, texture and, well, 4K-ness to 1080p material. And to a very great extent, that proves to be the case.",
    "A 1080p Blu-ray disc of the Coen Brothers’ The Big Lebowski demonstrates the XH90’s upscaling prowess admirably. Detail levels are high, contrasts are strong, and the vivid West Coast colour palette looks natural and convincing. Motion is smooth and assured in all but the most trying circumstances, and textures (of the pivotal rug and elsewhere) are stable and well-defined.",
    "There are limits, though. In very dark scenes you’re offered a straight choice between black depth and black detail, but the XH90's backlighting arrangement at least allows properly impressive screen uniformity. A black sky with bright stars (or equally bright bowling pins) exhibits no smearing or clouding – instead there’s straight-edged differentiation.",
    "Picture noise is low, too, and edge definition is equally impressive. The most complex patterns (that rug again) can provoke the XH90 into betraying just how hard it’s working, though. Your choice of picture mode can mitigate this, but there are trade-offs.",
    "While Cinema can calm the edginess the XH90 exhibits in extremis, there’s a softening to the overall image and a slight, but definite, drop-off in detail levels. But a workable balance is easy to come by, and the results are – broadly speaking – very positive. It has to be said, though, that the Netflix Calibrated mode doesn’t so much throw a spanner in the works as throw a blanket over the picture. If you like it dim and indistinct, you’ll love Netflix Calibrated. Don’t use it.",
    "1080p gaming follows the same broad pattern, and is generally just as successful. The Sony does fine work with lighting, motion-tracking proves rock-solid and if the game has detail within its images, the XH9005 will reveal it. And should the promised update to HDMI 2.1 come, with its next-gen console-friendly 4K at 120Hz compatibility, the already decent sub 20ms response time should get quite a lot quicker.",
    "HD/SDR performance TL;DR: Powerfully efficient upscaling, great backlight control and impressive detail levels in particular make for an optimal sub-4K experience.",
    "Every one of the positives concerning the Sony’s HD/SDR performance is amplified and improved by the switch to native 4K content, especially if there’s an HDR element involved too.",
    "Like every Sony 4K HDR TV, the KD-75XH9005 eschews HDR10+ dynamic metadata – because Sony, like many other TV brands, can’t quite bring itself to acknowledge when a rival has had a good idea. So the XH90 scrapes by with HLG, HDR10 and Dolby Vision HDR compatibility – which is more than sufficient to enjoy the extended colour gamut promised by HDR material from any number of sources.",
    "We put this to the test with a 4K UHD disc of the Dolby Vision-assisted The Joker. Where sharpness and detail are concerned, the KD-XH9005 absolutely nails it: images are crisp and packed with information, but with none of the restlessness of edges, graininess or picture noise that can sometimes accompany this level of insight. Skin-tones and -textures are completely convincing, whether the actor in possession of them is wearing pancake makeup or not. And once you’ve delved into the settings, just a little finessing of the Sony’s Motionflow positioning can result in utterly natural and coherent movement-tracking.",
    "(It’s worth noting that, when the XH90 detects an incoming Dolby Vision signal, it offers just three picture presets: Dolby Vision Bright, Dolby Vision Dark, or Vivid. This last is for those who don’t feel like they’re getting their money’s-worth unless they’re being shouted at.)",
    "Contrasts are strong throughout, even when the XH9005 is asked to balance deep blacks against bright whites, and the uniformity of the backlighting once again is commendable. It’s even possible to put further distance between ‘dark’ and ‘bright’ using the Sony’s ‘X-tended Dynamic Range’ feature (on anything but its most vigorous setting) without pictures looking forced or unnatural.",
    "Even content that’s not quite at the cutting edge of technology – a Netflix UHD stream of the execrable That’s My Boy – cannot help but look dynamic, vibrant and well-judged when dealt with by the XH90. There’s intensity to the colour palette, though it never looks overdriven, and refinement in the way edges are drawn and motion described. The XH90 is nigh-on impossible to fluster, and as a consequence is an absorbing and involving watch.",
    "4K/HDR performance TL;DR: Tremendously balanced and convincing images, with real expertise where contrast and detail are concerned, which makes the lack of HDR10+ dynamic metadata compatibility even more galling.",
    "All but the 55-inch model in the XH90 range feature Sony’s grand-sounding Acoustic Multi Audio system. In practice, this equates to 20 watts powering two full-range drivers, and a couple of tweeters positioned near the top of the back of the screen’s chassis, one on either side. The idea is to offer a degree of sonic tracking to the on-screen motion – it’s a feature both LG and Samsung have, in their own ways, being trying out with some of their more expensive TVs too.",
    "In practice, the XH90 sounds surprisingly full-bodied and assertive when turning out the Dolby Atmos soundtrack to Da 5 Bloods. The suggestion that there’s any meaningful correlation between the movement of objects on the screen and the sound the Sony makes is fanciful, but in terms of punch, attack and muscle the XH90 is pretty successful. It goes respectably loud without getting shouty or edgy, and is capable of serving up significant low-level detail.",
    "No sensible person ought to be spending in excess of two thousand pounds on a great big TV without having budgeted to bring audio performance into line, but the XH90 is a convincing enough listen to make a new soundbar less of an immediate necessity.",
    "Sound TL;DR: Better than many a comparably sized and priced TV, and something of a halfway house to an authentic audio system.",
    "Want to trade Dolby Vision for HDR10+? Want a smart TV interface that doesn’t think it’s the most important thing about your television? Want great 1080p upscaling and corking native 4K performance? Best check out Samsung’s Q80T QLED range.",
    "Like this Sony TV, it’s available in a whopping 75-inch screen size. Like this Sony, it tries its best to have its sound track the on-screen action. Unlike this Sony TV, though, its HDMI sockets are at 2.1-standard already. It’s a chunk more expensive than the Sony, though.",
    "Samsung’s QLED technology has plenty to recommend it where colours, contrasts and the dynamism thereof are concerned, and it’s not all that far when the talk turns to detail levels and motion-handling. And where the Sony XH90/X900H is respectably fast for gaming, the Samsung Q80T is lightning-quick.",
    "Sony's XH90/X900H series does everything it sets out to do, and in some style. Its picture quality is quite startling in the right circumstances, its sound is more than adequate by prevailing standards, it’s simple to use and it doesn’t turn its nose up at content of inferior resolution.",
    "In short, there’s more than enough going on here to make you overlook the lack of HDR10+ and forgive Android TV its overconfidence. If you’ve this sort of money to spend on a TV of this sort of size, you absolutely have to audition it."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design",
    "16": "Smart TV (Android 9.0)",
    "21": "HD/SDR Performance",
    "28": "4K/HDR performance",
    "35": "Sound",
    "39": "Other TVs to consider",
    "42": "Final verdict"
  },
  "links": {
    "TV range": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "Sony XH95/X950H": "https://www.techradar.com/reviews/sony-bravia-x950hxh95-4k-led-lcd-tv",
    "55-inch": "https://www.techradar.com/best/55-inch-4k-tv",
    "Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "75-inch": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "ARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "Sony PS5": "https://www.techradar.com/reviews/ps5",
    "every Sony TV": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Google Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Netflix Calibrated": "https://www.techradar.com/news/sonys-new-tv-range-has-a-dedicated-netflix-viewing-mode",
    "response time": "https://www.techradar.com/news/input-lag-response-time",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "Acoustic Multi Audio": "https://www.techradar.com/news/samsungs-new-qleds-nail-built-in-audio-and-other-tv-brands-should-take-note",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Samsung’s Q80T QLED": "https://www.techradar.com/reviews/samsung-q80t-qled-tv"
  }
}