{
  "source": "https://www.techradar.com/reviews/cenava-w81h-rugged-windows-tablet",
  "title": "Hands on: Cenava W81H rugged Windows tablet review",
  "category": "computing",
  "updated": "2021-09-20T18:28:25Z",
  "author": "desire-athow",
  "summary": "A durable Windows tablet with a difference but will a slow processor ruin the experience?",
  "verdict": "All in all, the W81H is a solidly built Windows tablet that appears durable enough for most outdoor tasks. It has an impressive array of ports and connectors but its low storage capacity, lack of after sales support and weak processor make it a risky purchase for most businesses.",
  "pros": [
    "Very well built",
    "Option for accessories",
    "GPS and WWAN connectivity",
    "Very affordable for what it offers"
  ],
  "cons": [
    "High screen reflectivity and low brightness",
    "Poor overall performance",
    "64GB storage simply not enough",
    "Absence of after sales support",
    "Screen is a fingerprint magnet"
  ],
  "article": [
    "The Ceaeva W81H is a product that warrants its own category. Windows tablets are not a rarity per se but rugged versions with 4G connectivity area and a surprisingly low price tag definitely are. We decided to do a hands-on review rather than a standard review to highlight the differences between this tablet and the rest of the market and try to explain some of the decisions taken by the Cenava team.",
    "The W81H rugged tablet is available from online Chinese retailer Banggood for a mere $379.99 (about £, AU$). Note that the price doesn’t include shipping and courier fees. Note that an Android version of the device - the A81G - is available for a slightly higher price and comes with a Snapdragon 625 CPU and Android 9.0 OS.",
    "There’s not a thousand ways of designing a tablet if you want it to be rugged, relatively portable and affordable. Cenava couldn’t afford magnesium aluminum alloy as the DT Research DT301T for example, instead relying on what it calls “industrial grade” rubber.",
    "At 714g, the W81H is actually quite light for an 8-inch Windows tablet. The 2014 Dell Venue 8 Pro - which also had an 8-inch display - weighed in at 395g. Speaking of the screen, it is a 16:10, 1280 x 800 pixel display with a Corning Gorilla Glass layer which unfortunately doesn’t have an oleophobic treatment.",
    "As such, it will be rapidly covered with fingerprints if you don’t use gloves. This is made worse by the highly reflective display and its low brightness (which also makes it hard to read outside).",
    "Don’t worry about handling it though. It should withstand drops from a reasonable height (1m) with ease thanks to raised borders that protect the screen and some of the thickest corner protections - and bezels - we’ve seen on a tablet this size. Its IP67 (but not MIL-STD-810G) rating means that it can take a rough tumble or two.",
    "Speaking of size, the W81H is 22mm thick, 146mm wide and 223mm long; its footprint is a tad bigger than an A5 sheet. The top edge houses two screw holes (possibly for antennae), function, power and volume rocker buttons.",
    "On the left of the Cenava tablet are three flaps: the first one hides a 3.5mm audio port and a mini-HDMI connector. Behind the second one are two USB ports (a microUSB and a Type-A USB 3.0) while the third one protects a barrel-type proprietary power connector.",
    "Behind the lonely flap found on the right handside is a microSD card slot and a SIM card reader. There’s no fingerprint sensor or smart card reader.",
    "At the rear, you can also find a rear camera sensor (but no flash), a speaker grill and IMEI details with a 12-pin POGO connector located at the bottom that can connect the device to an optional car bracket or a charging base.",
    "Let’s get rid of the elephant in the room. One of the reasons the W81H is so cheap is because it uses an Intel Atom Z5-X8350 processor, a quad-core CPU that was launched nearly six years ago as an entry level part. When it comes to performance, it is easily one of the slowest products in Intel’s expansive processor lineup.",
    "Why would Cenava choose such a weak CPU? The most likely reason would be lack of supply. Cenava is not exactly a household name (they don’t actually have a website) and would struggle to get the latest parts from Intel.",
    "Still, the X8350 is a perfectly capable processor for lightweight tasks. The W81H targets field workers and outdoor operators, not hardcore gamers or creative professionals. Cenava’s rugged tablet would be a good match for data entry in harsh environments for example.",
    "Other core components include 4GB LPDDR3 memory and 64GB Sandisk da4064 eMMC storage while connectivity includes Bluetooth 4.2 and Wi-Fi 5 courtesy of an Intel Wireless-AC 8265 network card. There’s also what looks like a 4G Quectel USB modem plus a u-blox 7 GPS/GNSS location sensor.",
    "The rest of the hardware include a Kionix KXCJ9 3-axis accelerometer, NXP ProximityBased smartcard reader, a 6Ah lithium battery, two Omnivision camera sensors (a 2-megapixel Ov2680 and a 5-megapixel Ov5648) and a TPM 2.0 chip which means that - in theory - the tablet will be compatible with Windows 11.",
    "Other than the 15W (5W,3A) power supply, our test sample came with a strap that attaches to the back of the device. Some intriguing features such as NFC and a 1D/2D barcode scanner are available as options.",
    "The Cenava W81H is not your usual tablet. It is packed with features that you would usually find on products costing three or four times more so from that perspective, it is an absolute bargain. On the other hand though, there’s the problematic lack of support.",
    "That said, despite our obvious liking for such an innovative product, it will remain a hard sell. There’s not enough storage memory, something that will make Windows updates very tricky long term. And one of its biggest selling points, the ability to add more accessories, is hampered by the fact there’s no sign that these accessories will ever be available.",
    "We’d love to have a much faster processor, adequate after sales support and at least 128GB of non-eMMC storage in the next iteration."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "10": "Hardware",
    "16": "Final verdict"
  },
  "links": {
    "Windows tablets": "https://www.techradar.com/news/mobile-computing/tablets/windows-8-tablets-release-date-specs-and-prices-916134",
    "rugged tablet": "https://www.techradar.com/news/the-best-rugged-tablets",
    "Chinese retailer Banggood for a mere $379.99": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-8381399771708593000&ulp=https%3A%2F%2Fwww.banggood.com%2FCENAVA-W81H-IP67-Intel-Cherry-Trail-Z8350-4GB-RAM-64GB-ROM-8-Inch-Windows-10-Rugged-Tablet-p-1855059.html%3Frmmds%3Ddetail-left-hotproducts%26cur_warehouse%3DCN",
    "DT Research DT301T": "https://www.techradar.com/reviews/dt-research-dt301t",
    "Dell Venue 8 Pro": "https://www.techradar.com/reviews/pc-mac/tablets/dell-venue-8-pro-1180784/review/2",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro"
  }
}