{
  "source": "https://www.techradar.com/reviews/verizon-voip",
  "title": "Verizon VoIP review",
  "category": "computing",
  "updated": "2021-11-09T16:37:03Z",
  "author": "barclay-ballard",
  "summary": "In our Verizon VoIP review we explore how this provider works and explain why Verizon is a reasonable VoIP solution let down by a couple of clear failings.",
  "verdict": "Not a bad VoIP offering, certainly for larger firms, but smaller businesses may find the poor customer support frustrating.",
  "pros": [
    "Good range of features",
    "Easy to use"
  ],
  "cons": [
    "Bundle pricing plans may not be a big draw for everyone",
    "Customer support found wanting"
  ],
  "article": [
    "With $128.3 billion in annual revenue and 129,000 employees spread across more than 150 global locations, Verizon is one of the world’s largest communication companies. It figures, then, that the Verizon VoIP service is well-worth reviewing, especially if you're in search of the best VoIP services and VoIP phones available today.",
    "Business history: Verizon",
    "The firm has an interesting back-story, emerging from the aftermath of the Department of Justice’s enforced break up of the Bell System company into seven regional entities. One of the entities went on to become Verizon, taking its name from a portmanteau of the latin word for truth, “veritas”, and the word “horizon”.",
    "In the 20 years or so that have passed since Verizon was formally established, the company has offered customers a wide range of telecommunications services. Verizon has always been keen to embrace new technologies, completing its first live 3G wireless data call all the way back in 2000.",
    "Two years later, Verizon launched the first 3G network in the US, and has also played a role in pioneering picture messaging, cellular coverage in rural areas, and hyperlocal news.",
    "Of course, Verizon also offers VoIP services. Its VoIP Business Digital Voice offering is a professional communications solution that comes with a multitude of features that make it a good choice for businesses large and small.",
    "The fact that Verizon offers so many other communication solutions means that there is an opportunity for businesses to secure bundles, which could work our cheaper than signing up to the VoIP solution on its own.",
    "Unfortunately, Verizon’s main failing comes in the area of customer support. There have been numerous reports of businesses encountering issues when transferring their phone lines over from traditional PBX lines to Verizon’s VoIP offering and the customer support that is available is inadequate.",
    "This is a real shame because by most other metrics, Verizon’s VoIP Business Digital Voice solution represents a more than acceptable VoIP solution.",
    "Overall, the pricing for Verizon’s VoIP Business Digital Voice platform is quite reasonable. When purchased as a standalone offering, it will set business back $35 per month for each line that they need, and up to five lines can be added within the standard plan. If businesses need more than five lines, this will cost an additional $30 a month, per line, up to a maximum of 20 lines. Additional lines after this are charged at $25 a month, per line. The discounted rate available to larger businesses could provide substantial savings for enterprise customers.",
    "Regardless of your company size, however, everyone has to pay a $100 activation fee and a $200 wireless router. Alternatively, the router can be rented for $10 a month but if you expect to use Verizon’s VoIP platform for a substantial length of time, it’s probably worth purchasing one outright. Once all of those costs have been added up, the price of Verizon’s VoIP platform does start to look a little more pricey.",
    "One of the interesting aspects of getting your VoIP services from Verizon is the potential of reducing costs by purchasing telecommunication bundles. Specifically, Verizon offers businesses the opportunity of combining its Fios servuce, which combines Internet access, telephone, and television services, with its VoIP platform.",
    "There are three main bundles on offer, with availability dependent on your location. For example, for $94 a month, plus taxes, fees and equipment charges, businesses will gain access to internet speeds of 100Mbps, and be offered a saving of $85 on their first IP phone. Looking further up the payscale, for $139 a month, businesses get speeds of 300Mbps and a $400 Visa Prepaid card for online orders. Customers of this plan also avoid the activation fee. And finally, the $249 per month plan provides a gigabit connection with speeds of 940Mbps and comes with a $500 Visa Prepaid card for online orders.",
    "Of course, all of these plans only include one VoIP line but additional lines can be purchased a slightly discounted rate. However, while these bundles do enable businesses to save small amounts on their VoIP solutions, they do pressure them to go with Verizon as their internet provider. For companies that are quite happy with their current internet provider, the bundles are unlikely to be welcomed.",
    "The fact that Verizon’s VoIP solution comes with 45 features means that most of the core functionality that businesses have come to expect from VoIP platforms is included here. For example, there is an Announcements on Hold option that allows employees to record their own message, or play advertisements or music, for customers on hold. For businesses where it’s simply not possible to answer every call, such as in a call center, having the option of giving customers something interesting to listen to is a nice touch.",
    "There also the option of using an auto-attendant to help customers self-select the individual that they are trying to talk to. In addition, a visual voicemail feature lets individuals see who has left a voicemail and when they called, either using your computer or smartphone. Call park/retrieve, meanwhile, lets users park incoming calls until the first available rep can pick up and help the customer, while the hunt group feature automatically transfers customers from line to line until someone at your business answers.",
    "Collectively, there are certainly plenty of features to ensure that calls aren’t unnecessarily missed and this is enhanced further through the call history option that allows businesses to gain an overview of incoming, outgoing and missed calls, as well as analyze the effectiveness of their advertising. Another intersting offering with Verizon’s VoIP solution helps businesses enact a robust business continuity plan. By automatically forwarding calls to a preset number in the event of a power outage, organizations can maintain some level of service and ensure customers aren’t left in the dark.",
    "Another great thing about the features on offer with the Verizon VoIP solution, is how much autonomy they provide the end user. The administrator web portal, for example, lets individuals manage features through the My Account section, for both the entire business and individual users. Similarly, the end user web portal lets users manage their call history, voicemail and other important features through the My Phone site.",
    "And if individuals were worried about the extended periods of time when they are away from their desks, then Verizon has them covered. In an era where remote working is becoming increasingly common, the majority of VoIP platforms can be accessed from smartphone apps - including Verizon VoIP Digital Business Voice. Verizon’s VoIP app boasts an in-progress calls feature to seamlessly transfer calls between your desk and mobile phone, as well as an outbound call feature that lets you make and receive business calls using your mobile phone, while ensuring that your caller ID appears as your office phone number.",
    "Other features that come included with Verizon VoIP Digital Business Voice are three-way calling, anonymous call rejection, speed dial, an instant messaging service, and much more besides. All in all, users can’t complain that Verizon’s VoIP platform shortchanges them regarding the number of features of offer.",
    "Unfortunately, if there is one area where Verizon VoIP Digital Business Voice falls down, it’s in terms of customer support.",
    "Although Verizon does have several options for customers looking to get in touch with one of their support personnel, including by telephone, email and online portal, the success rate resulting from these interactions could be better.",
    "Verizon’s service level agreements (SLAs) for availability and voice quality are competitive so hopefully you won’t need to contact support particualrly often but unfortunately there is always a chance that something will go wrong - no matter how reliable your VoIP provider is. This is when good cutomer support becomes particularly important.",
    "Looking across a host of online reviews, it becomes clear that customer support is the main area where Verizon is struggling. Broken promises, long waiting times, and a lack of personalization all sound like the ingredients of a relationship gone wrong, and is likely why there are common customer complaints.",
    "Although things are slightly better when customers are able to talk to a technician directly over the phone, this service is not available 24/7, leaving individuals to rely on email or web chat platforms, where it is much easier for conversations to be misunderstood.",
    "Incredibly, it appears that the customer service problems are particularly pronounced for larger firms. Businesses that have issues with multiple handsets, for example, have reported being unable to group them together on a single customer support ticket.",
    "This has left them with no option but to issue multiple tickets, with each respective respondent remaining unaware of the larger issue at play. Overall, this points to a customer suport service that is in need of a significant overhaul.",
    "Verizon VoIP Digital Business Voice is an excellent VoIP platform when things are going well. It offers an abundance of features, good call quality, and a number of pricing plans.",
    "The ability to team the VoIP solution with ultra-fast broadband is particularly likely to appeal to bigger firms that have more substandital budgets to play with. Unfortunately, one thing that will certainly not appeal to organizations, regardless of their size, is the customer support on offer. This is in need of rapid improvement."
  ],
  "headers": {
    "27": "Final verdict"
  },
  "links": {
    "best VoIP services": "https://www.techradar.com/news/best-voip-service",
    "VoIP phones": "https://www.techradar.com/best/best-ip-phones"
  }
}