{
  "source": "https://www.techradar.com/reviews/lupe-pure-cordless-vacuum-cleaner-review",
  "title": "Lupe Pure Cordless Vacuum Cleaner review",
  "category": "appliances",
  "updated": "2021-04-05T09:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Ex-Dyson engineers have created a vacuum with suction to rival their former employer’s cleaners",
  "verdict": "The Lupe Pure Cordless Vacuum Cleaner is a powerful cordless upright cleaner with a lift-out body that makes it lighter and more maneuverable when cleaning stairs or up high. It sucks up everything in its path from fine dust to cereal, and you can get up to 60 minutes of cleaning on a full charge, but it’s very expensive.",
  "pros": [
    "Can be used as a stick vacuum or handheld cleaner",
    "Large 0.2 gallon/1-liter dust canister means fewer interruptions to cleaning",
    "Swappable batteries let you keep cleaning for longer"
  ],
  "cons": [
    "Not the most stylish of designs",
    "Bulky compared to other cordless vacuums",
    "Handheld mode requires two hands"
  ],
  "article": [
    "A relative newcomer to the floorcare market, Lupe Technology was founded by two former Dyson engineers, and is now squaring up to that company, and other premium brands such as Miele, with its first cordless vacuum, which it claims gives those rivals’ machines a run for their money when it comes to suction power.",
    "The Pure Cordless Vacuum Cleaner has a 400W motor, and according to the British brand offers better suction than its rivals thanks to its “patented suction intensifier”. The vacuum also has a 3-in-1 design, so it can be used either as an upright cordless vacuum, or in hose mode, with a one-meter extension hose for cleaning hard-to-reach nooks and crannies, or in handheld mode, with the main body detaching from the main tube and floor head assembly to offer a lighter and more easily portable device for cleaning stairs or up-high.",
    "There’s no floor-sensing cleaner head, as you’ll find on some rival models, but the Lupe Pure Cordless does offer three levels of suction power, although you’ll have to manually switch between them. It’s also possible to switch the rotating brush bar on and off – it’s recommended that you switch it off when cleaning deep pile carpets and rugs to ensure that the cleaner moves smoothly across the floor.",
    "Lupe says the battery will last up to 60 minutes between charges, and it’s removable – the company plans to offer additional batteries for sale from mid-April. The Lupe Pure Cordless vacuum is expensive, priced at $799 / £599 / AU$1,092, so can it really rival Dyson when it comes to cleaning power? We put it to the test to find out.",
    "The Lupe Pure Cordless Vacuum Cleaner is priced at $799 / £599 / AU$1,092, and is available worldwide from Lupe’s website; it’s also available through Amazon in the UK.",
    "As mentioned, the Lupe Pure cordless vacuum has a removable battery, and Lupe says additional batteries will be available by mid-April and will cost $200 / £149.99 / AU$235. The company also plans to offer the vacuum cleaner bundled with two batteries for $1,066 / £699 / AU$1,267, although it hasn’t confirmed when this package will be available.",
    "Like other cordless vacuums on the market, the Lupe Pure Cordless can be converted into a handheld vacuum cleaner, although as it’s not a stick cleaner, the main unit with hose is removed from the floor cleaning head and tube assembly entirely, rather than being disconnected from the lower tube and floor head",
    "In upright mode it works like a regular upright vacuum, while you can also use it in hose mode – when you attach either of the two bundled tools to the 3.9ft (1.2m) hose, the vacuum will direct the suction away from the cleaner head and to the hose – handy if you want to clean under furniture, or in tight corners that the cleaning head can’t reach.",
    "The vacuum cleaner offers three levels of suction power, which you can switch between using the buttons on the front of the main unit. As we’ve mentioned, the removable battery lasts up to 60 minutes when used on the lowest power setting; that drops to around 30 minutes on medium power, and 15 minutes on full power.",
    "That 0.2 gallon / 1-liter dust canister is one of the biggest on the market, so you won’t need to interrupt your cleaning sessions with regular trips to the bin. The vacuum also comes with two accessories: a crevice tool and an upholstery tool, as well as a storage clip to hold them, which can be attached to the main wand.",
    "The Lupe Pure Cordless Vacuum Cleaner weighs 10.1lb (4.6kg), making it one of the heaviest vacuums we've tested, although the lift-out main unit weighs 1.1lb (0.5kg) in handheld mode, which is manageable. However, it is bulky compared to other cordless vacuums on the market and it’s all-white plastic design won’t win any awards for style.",
    "The Lupe Pure Cordless Vacuum Cleaner can certainly hold its own when it comes to suction power. On the most powerful setting, fine dust, biscuit crumbs, cereal and the like were sucked up in seconds, although the suction was so strong on this setting that the vacuum became a little more difficult to manovre on hard floors, even though the powered brush bar was turned on. It glided more smoothly when used on the lower power settings, both when used as a cordless vacuum and in hose mode.",
    "There was a clear difference in suction on the lower power settings, with several sweeps required to suck up all of the large debris. While the vacuum was pleasingly quiet when used on lower power settings, averaging around 72db, when we switched to the most power setting, our decibel meter hit 84db, which is similar to a diesel truck travelling down the road at 40mph. The sound was also high-pitched, which we found quite irritating.",
    "The buttons on the front of the vacuum makes it simple to boost or reduce the suction power, although the only indicator as to which power setting you’re using is a small LED on the button, and we found that we had to glance down any time we wanted to check; there’s also no way of gauging how much runtime is left in the battery.",
    "On the whole, we found that converting the vacuum between the different modes was simple and fuss-free, thanks to the click-in design of the different components. We did find that we needed both hands to use the cleaner in handheld mode – one to hold the unit, and one to direct the hose, whereas most other cordless vacuums can be used one-handed in handheld mode.",
    "You can neatly stow the two accessories when you’re not using them by clipping them to the mount that attaches to the main tube, but the design wasn’t particularly secure, and we did end up knocking the tools off on occasion. We also found the dust canister was fiddly to empty – once you’ve removed it from the main unit, you need to press the button at the bottom and remove the cover yourself; it’s not automated, as it is on rival cleaners from Dyson.",
    "As mentioned, Lupe claims the battery will last up to 60 minutes on the lowest power setting, and on test we managed 58 minutes before the vacuum needed recharging. The swappable batteries will mean that if one charge isn’t enough for you to clean your whole home, you can purchase an additional battery if you want to keep cleaning without interruption.",
    "It took around 3.5 hours to fully recharge the battery using the bundled battery charger."
  ],
  "headers": {
    "4": "Lupe Pure Cordless Vacuum cleaner price and availability",
    "6": "Design",
    "11": "Performance",
    "16": "Battery life",
    "18": "Don't buy it if..."
  },
  "links": {}
}