{
  "source": "https://www.techradar.com/reviews/flywheel",
  "title": "Flywheel review",
  "category": "computing",
  "updated": "2021-03-22T02:46:04Z",
  "author": "mirza-bahic",
  "summary": "Managed WordPress hosting with a unique twist",
  "verdict": "Flywheel managed to raise WordPress hosting to another level, creating an easy-to-use interface with a wide variety of useful features. Although it isn’t one of the most affordable options on the market, it represents extremely good value for money.",
  "pros": [
    "Excellent 24/7 live chat support",
    "SSL is included in each and every plan",
    "One-click installs",
    "User-friendly interface"
  ],
  "cons": [
    "Limited hosting options",
    "No free domain",
    "Relatively expensive",
    "No email"
  ],
  "article": [
    "Flywheel is a managed WordPress hosting provider, which means that it focuses on hosting sites that use the popular WordPress content management system. Also, as a managed solution, Flywheel takes on many of the daily duties of running a website, so you can focus on your business.",
    "Flywheel was founded in 2012 and was purchased by another industry giant, WP Engine, in 2019. It has several features that are aimed specifically at freelance web development companies and agencies.",
    "In this Flywheel review, we look at what makes this service different and whether it can be considered one of the best website builders for small businesses today.",
    "You can get started with Flywheel for free, as there’s a two-week free trial. Some features, like WordPress plugins and performance insights, aren’t available during the trial, but you can use at least it to test the speed of the service and try out the unique tools, such as Local, Flywheel’s local WordPress development environment.",
    "Managed WordPress hosting can be paid for monthly or annually, with two months free each year if you choose to pay annually.",
    "The cheapest plan for one site costs $13/month but is limited to 5,000 monthly visits, 5GB of disk space, and 20GB of bandwidth. For $25/month, you can get 25,000 monthly visits, 10GB of disk space, and 50GB of bandwidth.",
    "These single-site plans include all the features of the larger plans except for phone support, a dedicated account manager, and a migration dashboard used to monitor the progress of your site migrations.",
    "A Freelance plan offers up to 10 sites for $96/month, and an Agency plan costs $242/month for up to 30 sites. Some tools, like revenue insights, cost extra.",
    "Overall, Flywheel is an expensive host, even when stacked up against other managed WordPress hosting providers.",
    "Flywheel has all the usual features that you’d expect from a managed WordPress web host, including managed plugin updates, StudioPress themes, SSL certificates, CDN support, SFTP, and SSH. But there are a few features that make it stand out.",
    "Flywheel’s most interesting feature is Local, a local development environment for WordPress. After installing it, you can develop your WordPress website offline on your local network before putting it live on your Flywheel hosting.",
    "Being able to work locally on a WordPress website using tools like Dreamweaver can be a gamechanger for some website developers, as they can spin up a new WordPress installation in seconds and develop it using their favorite software.",
    "Flywheel has a sizable list of features designed to improve development workflow, particularly for freelance website companies and agencies.",
    "Using Blueprints, you can save the configuration of themes and plugins and re-use them on other projects. A team management system, Organizations, has real-time activity feeds that sync up with Slack. Collaborators can be given secure access to certain parts of the site.",
    "Flywheel also offers staging sites, nightly backups, and site cloning. Put together, these features make for a formidable WordPress development environment for teams.",
    "Another feature aimed at agencies is the ability to transfer the billing of hosting to a third party. Web development companies can choose to delegate the responsibility for paying for the hosting to the customer, who will get an invitation to a secure payment form.",
    "For development companies that build sites and hand them off to the clients when complete, this client billing system makes for smooth transfers of ownership.",
    "Flywheel has one of the best onboarding experiences that we’ve used. The user interface is slick, and it takes just a few seconds to get your first site up and running. During the setup process, you can choose from seven data centers around the world to give your typical user the best speeds. You can opt to install a demo site or start from scratch.",
    "That said, its online forums are full of customers complaining that the setup of Flywheel didn’t go smoothly for them. The migration of WordPress websites to Flywheel took days in some cases. Since there’s a two-week free trial, it’s easy to test out the service for yourself at no risk.",
    "On all plans, Flywheel offers 24/7/265 chat and ticket support from its “happiness engineers.” Phone support is available from 9 am to 5 pm CST, Monday to Friday, but only for customers paying $250/month or more. There is a small knowledge base with around 300 articles on the services available.",
    "In our testing, we found the support staff to be courteous, fast, and knowledgeable. However, there is a significant number of reports online from customers dissatisfied with Flywheel’s support, saying that it barely helped with their issues.",
    "Bluehost is a website hosting provider that offers managed WordPress hosting from $14.95/month (rising to $29.99/month after the initial term). This isn’t much cheaper than Flywheel’s basic plans, but it includes over double the storage space and traffic, more than 200 available servers worldwide, and a suite of marketing tools.",
    "For a cheaper managed WordPress hosting solution, consider SiteGround. A single site starts at $6.99/month and includes free email, something that Flywheel doesn’t offer at all.",
    "Flywheel is undoubtedly a slick managed WordPress hosting solution. It’s easy to get started with it, and the interface is top notch.",
    "However, the features on offer make it more relevant to freelance website companies and agencies than end-users. The local development environment, workflow tools, and smart billing options are all tailor-made for working on multiple websites.",
    "Overall, the features that Flywheel offers to its particular audience are some of the best in the business."
  ],
  "headers": {
    "3": "Plans and pricing",
    "9": "Features",
    "17": "Interface and in use",
    "19": "Support",
    "21": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "Flywheel": "https://getflywheel.com/",
    "managed WordPress hosting": "https://www.techradar.com/news/best-managed-wordpress-hosting",
    "best website builders": "https://www.techradar.com/news/the-best-website-builder",
    "Freelance plan": "https://getflywheel.com/pricing/",
    "SSL certificates": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "Dreamweaver": "https://www.techradar.com/reviews/adobe-dreamweaver-cc-2020",
    "themes": "https://www.techradar.com/news/best-wordpress-theme",
    "plugins": "https://www.techradar.com/best/best-wordpress-plugins",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "SiteGround": "https://www.techradar.com/reviews/siteground"
  }
}