{
  "source": "https://www.techradar.com/reviews/salter-mibody-digital-analyser-bathroom-scales",
  "title": "Salter Mibody Digital Analyser Bathroom Scales review",
  "category": "fitness",
  "updated": "2021-02-24T12:01:31Z",
  "author": "cat-ellis",
  "summary": "An awkward app lets down this otherwise excellent smart scale",
  "verdict": "This is an excellent smart scale – well designed and built, with accessibility in mind – and its body composition measurements are in line with those from professional weighing equipment. Unfortunately it relies on an app that looks outdated, and is awkward to use. If the app received an overhaul then recommending it would be easy, but as it stands, there are just a few too many inconveniences.",
  "pros": [
    "Large non-slip platform",
    "Big, bright display",
    "Consistent measurements"
  ],
  "cons": [
    "Only supports four users",
    "Outdated app",
    "Have to sync data manually"
  ],
  "article": [
    "The Mibody Digital Analyser Bathroom Scale measures not only weight, but also body composition (including fat, muscle, bone and water mass) using bioelectrical impedance. This data is then synced with Salter's smartphone app via Bluetooth, provided your phone is within range.",
    "In our tests, the smart scale’s measurements were consistent, and composition and heart rate scores were in line with those recorded by professional gym scales.",
    "The scale is also well designed, and would be a good option for anyone who finds bathroom scales tricky to use due to balance or vision difficulties. The non-slip platform is larger than average, and the display is bright and legible. The scale is easy to carry as well, and surprisingly light for a smart scale.",
    "Sadly, Salter’s app doesn’t do justice to its hardware, and is sorely in need of an update to bring it into line with modern expectations. Data doesn’t sync automatically, many metrics are hidden away by default, and the overall look is unappealing.",
    "A future software update would vastly improve the experience, and if Salter overhauls the app then this scale would become easy to recommend, but as things stand it doesn’t do justice to the hardware.",
    "The Salter Mibody Digital Analyser Bathroom scale was released in March 2016 and costs £59.99 / AU$119.95 (about $80).",
    "Like most smart scales, the Salter Mibody Digital Analyser has a glass platform that provides a tough, non-slip surface. A pair of metal strips provide reliable contact between you and the scale’s sensors.",
    "The scale is clearly designed with accessibility in mind. Its platform is quite large, measuring 30 x 30cm, which makes balance easier to anyone who’s a little unsteady on their feet. It also has a bigger than normal display (76 x 51 mm), which is easily read when standing upright. It takes three AAA batteries, which are supplied.",
    "Unfortunately, the design isn’t completely hands-free. You can quickly check your weight without using the scale’s three buttons, but in order to take body composition readings and have them sent to the Salter app on your phone, you’ll need to tap the central button and then use the left and right arrows to select your user number.",
    "It's a minor inconvenience, but if you're pressed for time then it's one that you'd probably prefer to avoid.",
    "Underneath, non-slip rubberized feet provide good grip and prevent the scale scratching your bathroom floor. Non-slip rubberized feet to prevent scratching your tiles, laminate or linoleum. The box also includes hard feet for use on carpets, but carpet pile tends to impair the accuracy of electric scales, so we’d be inclined to stick to hard floors wherever possible.",
    "Setting up the Salter Mibody Digital Analyser is a straightforward process. Simply install the Salter app (available for iOS and Android) and tap the menu icon at the top right of the app to get started. Select ‘Add device’, then power on the scale, select ‘Add device’, and hold the central button for five seconds to pair the two via Bluetooth.",
    "Up to four users can use the same scale, which will be fine for many households, but is a little disappointing since many similar scales can store data for six or even eight different people. It’s not possible to assign names to different users, which is slightly annoying. Instead, everyone will have to memorize a number, and select it each time they weigh in.",
    "To measure your weight and body composition, tap the center of the scale and wait for it to display zero, then use the buttons to select your user number and step on. After a moment your weight will be displayed on the screen, followed by your composition stats.",
    "The screen is easier to read than that of the Body Curve scale; it uses a conventional rather than reverse LCD display, with plenty of contrast and large digits. You can choose to switch between units using the scale’s three buttons, which is convenient.",
    "The scale has a dedicated athlete mode, but there’s no separate pregnancy setting for monitoring the growth of your child. For that, you’ll need to opt for a scale like the Withings Body+.",
    "Sadly, like the Salter Curve Bluetooth Smart Analyser Bathroom Scale, the Mibody Digital Analyser is a well designed piece of hardware that’s let down by a dated app that’s trickier to use than those from Withings, Garmin and Fitbit.",
    "In order to get the most out of your new Salter scale, you’ll need to spend time configuring the app’s homescreen. This shows your vital stats in a series of round bubbles, which you can tap to reveal a graph of your progress over time. However, only a few of these bubbles are visible by default, meaning lots of the interesting information gathered by the scale is hidden away. In order to see detailed stats on your body composition, it’s necessary to tap the menu icon on the top right, then select Add Icon > Analyser Scale and check all the available options.",
    "Syncing data with the app is also tricker than we’d like. Whereas most other scales sync data automatically when a Bluetooth connection is available, Salter’s app requires you to initiate the process manually by tapping the menu button and selecting Add Data. It’s extra steps like this that make this scale a tough sell; the extra time all adds up, particularly when you’re in a hurry first thing in the morning.",
    "The charts aren’t ideal either. If all your readings for weight, fat or muscle are within the ‘Normal’ zone, they won’t show you how close you are to being under or over the recommended levels.",
    "We do, however, appreciate the trend line presented on the various charts, which helps you see past everyday fluctuations in weight caused by things like water weight. It’s a small touch, but a helpful one if you’re aiming to improve your fitness in a steady, healthy way.",
    "First reviewed February 2020"
  ],
  "headers": {
    "5": "Price and release date",
    "6": "Design",
    "11": "User experience",
    "16": "Companion app",
    "22": "Don't buy it if"
  },
  "links": {
    "smart scale": "https://www.techradar.com/best/best-smart-scales"
  }
}