{
  "source": "https://www.techradar.com/reviews/turtle-beach-stealth-700-gen-2-review",
  "title": "Turtle Beach Stealth 700 Gen 2 Review review",
  "category": "gaming",
  "updated": "2021-07-30T13:44:03.726Z",
  "author": "dom-peppiatt",
  "summary": "Turtle Beach Stealth 700 Gen 2 is a new generation and a new high point for brand",
  "verdict": "The Turtle Beach Stealth 700 Gen 2 is a new benchmark for quality for the veteran headset manufacturer. Managing to provide excellent value, robust design, a fantastic sound stage and look stylish and understated all the while, this headset is as effortless to wear as it is to pair with your tech. Sure, the audio quality might not be the very top end of what you’d expect from a modern headset, but with something this packed full of features and creature comforts, you can forgive its foibles in this one area.",
  "pros": [
    "Long-lasting battery life and comfort",
    "Great connectivity",
    "Reassuringly easy to use"
  ],
  "cons": [
    "Occasionally muddy sound"
  ],
  "article": [
    "We cannot recommend the Turtle Beach Stealth 700 Gen 2 headset enough to anyone looking for a premium, long-lasting, comfortable headset: it ticks every box we look for when searching for decent tech. And, in a world where pairing headsets to Bluetooth dongles and wrestling with buttons and flaps and dials is the norm, the simplicity and ease-of-use on the Stealth 700 Gen 2 stands out a mile. It is, by some margin, one of the best PS4 headsets and best Xbox One headsets on the market at this price point.",
    "Stylish, sophisticated, and well-made for such a modest barrier to entry (at least compared to some of the more expensive headsets out there), this headset can deal with music listening parties, solo game sessions or raids with deft ease. A crystal clear mic that’s – unfortunately – indiscriminate about what it picks up may you give you pause, if you live in a noisy area or household, though.",
    "The only price you’ll pay for this robust, jack-of-all-trades set-up is some slight muddiness in particularly bright mixes and games. But when you’re yelling down the mic about an unfair guard break in Guilty Gear Strive or holding your breath as your clan mate saves you from a wipe in a raid, you’ll barely notice the headset's fondness for bass and mids, anyway.",
    "The Turtle Beach Stealth 700 Gen 2 headset is available from $150 / £120 / AU$249 and it is available now. It fits into the mid-to-upper price range for a wireless headset, and its closest competition would likely be the SteelSeries Arctis 9X, the Corsair Virtuoso RGB Wireless XT, or the Asus ROG Strix Fusion 700. Notably, these headsets are far more expensive than the Stealth 700 Gen 2, however.",
    "As such is compatible with PS4, PS5, Xbox Series X, Xbox Series S, Xbox One, Nintendo Switch, and PC – though the headset is largely directed towards Xbox platforms.",
    "In a world of garish colors, RGB light strips, and ostensibly ‘gamer’ design, the understated cool black of the Turtle Beach Stealth 700 Gen 2 is a breath of stylish, fresh air. Black and silver is always going to look smart – and pairs wonderfully with the Xbox Series X and its related accessories – and the big, soft ear cushions bring in some soft textures that tie the whole thing together. These frankly unbelievable leatherette cushions filled with cooling gel-infused memory foam fit to your ears with deft ease, and you can wear this thing through a whole night of banging your head against a Destiny 2 raid and not want to take it off. We take our figurative hats off to the ergonomics testers at Turtle Beach for this one.",
    "The headset’s newly-added metal-reinforced headband and glasses-friendly design mean even players with big heads and glasses frames aren’t going to be made to feel uncomfortable during marathon sessions. We have very minor complaints about the quality of the hinges and joints that allow the cups to move and the headband to adjust, but through some quite intense testing (over a period of months!) the headset has held up and is as good as new now, some 100+ days into our review period.",
    "Pairing with the headset’s comfortable setup is a battery life that puts older wireless models to shame. The Stealth 700 Gen 2 should last through 20 hours on a single charge – though we’ve managed to get more out of the headset on occasion (when playing without voice chat, for example). This doubles the first Gen headset battery life, and it charges via USB-C, making it fit with most modern accessories, too.",
    "The Stealth 700 Gen 2 houses 50mm nano clear neodymium drivers, so the headset is at its best in complex, more bass-focused environments and games. As such, FPS enthusiasts and shooter gluttons will find the most enjoyment in the more low-end focused sound stage. If things start getting really hectic – we’re looking at you MMO players – the headset can struggle to layer things through in a way that’s easy to parse, and in hectic environments, you might notice the headset’s usual clarity gets a bit muddy.",
    "Pro players, you’ll enjoy the ability to toggle various settings to bring up different types of sound – one setting (Superhuman Hearing) prioritizes footsteps and incidental sounds, making it easier to pick out directions opponents are approaching in FPS titles. That’s saved our hide in Warzone more times than we’d be willing to admit. Just be aware that this seems to also boost all audio levels, so you might need to alter volume settings console-side to offset that.",
    "The microphone is incredibly accurate and clear and allows you to speak at a resting volume with no interruptions or distortion on the listening end. The flip-to-mute feature – making a welcome reappearance from other Turtle Beach hardware – is as intuitive and easy to use as ever, and will help prevent drunken gaffes (if you’re so prone to them) or unwanted munching noises as you chow down on some snacks in between bouts in Tekken or something.",
    "Interestingly, the mic really isn’t discriminatory in what it picks up. This reviewer lives in a place with a fair amount of overhead traffic, located not too far away from an ambulance depot (it’s a real joy). Multiple players on the other end of the chat picked up both ambient rain noise and distant sirens via the mic – that’s not an issue in and of itself (if anything, it speaks to the mic’s quality), but you may want to be aware of that if you live in a busy and loud urban area."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "RIG 500 PRO HX Gen 2 headset price and release date",
    "5": "Design",
    "8": "Audio performance",
    "10": "Microphone quality and wireless connectivity",
    "12": "Don't buy it if..."
  },
  "links": {
    "best PS4 headsets": "https://www.techradar.com/news/best-ps4-headsets",
    "best Xbox One headsets": "https://www.techradar.com/news/best-xbox-one-headsets",
    "SteelSeries Arctis 9X": "https://www.techradar.com/reviews/steelseries-arctis-9x",
    "Corsair Virtuoso RGB Wireless XT": "https://www.techradar.com/reviews/corsair-virtuoso-rgb-wireless-xt",
    "Asus ROG Strix Fusion 700": "https://www.techradar.com/reviews/asus-rog-strix-fusion-700",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "FPS": "https://www.techradar.com/news/best-fps-games",
    "MMO": "https://www.techradar.com/best/best-mmo-games",
    "Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone"
  }
}