{
  "source": "https://www.techradar.com/reviews/host-europe",
  "title": "Host Europe web hosting review",
  "category": "computing",
  "updated": "2021-11-18T06:14:10Z",
  "author": "mike-williams",
  "summary": "Made in Germany and aimed primarily at German users",
  "verdict": "Host Europe is a strong, stable, and feature-packed web hosting provider geared towards German-speaking customers. If you fall into this category, don’t hesitate to give them a chance.",
  "pros": [
    "One-click installs",
    "Free website builder",
    "Easy upgrade or downgrade",
    "Feature-rich hosting plans",
    "A fine range of hosting services"
  ],
  "cons": [
    "FAQ section isn’t translated to English",
    "No data centers outside Germany and France",
    "One-off setup fees with monthly plans"
  ],
  "article": [
    "Established in 1997 in Germany, Host Europe has become and remained rather successful since, continuing to offer web hosting solutions for individuals, small and medium-sized businesses. They say that their primary objective is to provide their customers with internet and server hosting with the highest quality possible. This rings true if we consider that they’ve collected more than a couple of rewards throughout the years.",
    "In the Readers' Choice Host Europe was voted as the best service provider of 2019, the second-best in 2020, and a second-best in the cloud hosting category. They were also awarded gold three times at the Hosting & Service Provider Summits and received other awards by HOSTtest.de and from the test portal CHIP for best-in-class accessibility.",
    "Host Europe was one among the brands of HEG (Host Europe Group), a web hosting, email, and domain name registrar giant founded in 1997, same as its subsidiary. In December 2016, HEG was acquired by GoDaddy, and its name is slowly being phased out if the news holds true. However, this shouldn’t impact Host Europe in any significant way.",
    "Host Europe is headquartered in Cologne and has two “energy-saving and secure” data centers in Cologne and Strasbourg. If you wish to find out more about these two, the “Technology” section on their website provides plenty of information on the matter.",
    "The official site of Host Europe looks and feels old-fashioned, although not necessarily in a bad way since it makes finding your way around rather simple. The site is available in German and English language and it features a good-looking blog, which, unfortunately, isn’t translated into English.",
    "You can find Host Europe on Facebook (which is in English although the articles linked there are often in German), and Twitter (which is openly exclusive to its German-speaking followers).",
    "Host Europe's solutions include shared hosting, WordPress hosting, ecommerce hosting, VPS, reseller hosting, and dedicated server hosting, as well as domain name registration, SSL certificates, backup storage, site security, Microsoft 365 tools, professional email, and a website builder.",
    "Although Host Europe's hosting plans are affordable in general, which of them you get to choose from depends on whether you want to pay on a monthly or an annual basis. The price is identical but if you want to commit for one month only you’ll also have to pay a €14.99 ($17.30) one-off setup fee.",
    "Regardless of the billing cycle, for €4.99 ($5.75) per month, the “Basic” plan will supply you with one annual domain, SSL, 50GB of storage space, two MySQL databases, one automated mailbox migration (included in the first 30 days), and Kaspersky virus protection. More expensive plans won’t add further features but increase the amount of storage space, the number of databases, and the number of antivirus software solutions.",
    "While Host Europe doesn’t offer a money-back guarantee, you can cancel your contract with them within four weeks.",
    "As for payment methods, Host Europe accepts all major credit cards, PayPal, and SEPA direct debit.",
    "To create an account with Host Europe you’ll have to provide your full name, phone number, email, and physical address, and think up a strong password. Here, you can choose whether you want to be contacted via email, phone, or both. Depending on your choice, you’ll receive an order confirmation via message or email together, containing extremely detailed explanations of the features you can expect to receive, the cancellation policy, and the General Terms & Conditions and Privacy Policy.",
    "After adding your payment details and making a purchase, you’ll be transferred to Host Europe’s dashboard, which (unfortunately for non-German users) suffers from an incomplete translation to English. To be fair, most important information is fully translated to English, but there are still parts in German, including the FAQ section accessible through the dashboard.",
    "Since Host Europe is not the swiftest of providers, you may have to hang around for a while before finding out whether your order was accepted or not. If yes, you’ll still have to provide additional information about your order before you can start using the product you've purchased. As of late, Host Europe provides user-friendly cPanel with its Linux-based products, and Plesk is available with the Windows hosting packages - the two most popular control panels in the industry.",
    "As for website building, in addition to a whole variety of CMS options (WordPress, Drupal, Joomla, and so on), ecommerce apps (Magento, Blestan, OpenCart, and more), community building tools (phpBB, Booked, Dada Mail, and so forth) and other useful apps you can easily install via Installatron, you’ll also get a bare-bones version of a beginner-friendly website builder. To get more of everything (sites, webspace per site, templates, email accounts, and so forth) you’ll have to purchase one of the bigger website builder plans as an add-on.",
    "After putting Host Europe’s official site to the GTmetrix speed test, we got average results altogether. The time it took for the site to fully load was an amazing 1.3 seconds but all other vital speed measuring metrics (largest contentful paint, total blocking time, and cumulative layout shift) got trapped in the abyss of averageness pulling the final score down to B (74%).",
    "When it comes to uptime, Host Europe guarantees an availability of its data centers at 99.95% as a monthly mean, with the exclusion of scheduled (and unscheduled) maintenance windows. This can be translated into 4.5 hours of downtime annually, or about 10 minutes for two weeks.",
    "After monitoring the uptime of Host Europe's official site via UptimeRobot for two weeks, we recorded a worrying 55 minutes of downtime which dragged the total uptime to 99.76%, meaning that we should be getting some sweet credit as compensation.",
    "If you find yourself in need of a helping hand, you can try reaching Host Europe's team via email, fax, live chat, and, if you’re in a rush, around-the-clock telephone number. The toll-free numbers are available for users from Germany, Austria, and Switzerland, as well as the “order hotline” which is reachable Monday to Friday, from 9 AM to 5 PM. There is even Host Europe's postal address if you feel like writing them an old-fashioned letter and recalling the “old days”.",
    "Alternatively, you can browse their “Forms and documents” section for questions related to terms of service, and it is available both in English and German. There is also a well-equipped FAQ section (it’s closer to a knowledge base), but it still isn’t translated into English, which means all users who don’t understand German are left to fend for themselves. Unfortunately, there is no community forum as a final resort before reaching the support personnel.",
    "If you want a well-rounded host that will give you more than enough time to decide whether you want to stay with them or part your ways, HostGator may be worth a look. Besides offering an ample 45-day money-back guarantee, it is also geared towards English-speaking users making itself more attractive to an international market than Host Europe.",
    "Another US-based alternative to Host Europe is Bluehost, a host that is known for its pocket-friendly pricing and not particularly pocket-friendly price spike after the promotional period. Although with Host Europe there is a one-off setup fee with all monthly plans, at least you won’t have to worry about any sudden price spikes.",
    "If you are looking for a simple solution from Germany aimed at personal sites or small businesses, a Berlin-based Strato might be worth a try. Although their scope of hosting solution seems somewhat limited, all their plans support multiple-domain hosting, come with a free domain, a free SSL certificate, plenty of one-click installs, a website builder, and a 30-day “no quibble” money-back guarantee. Unlike Host Europe, Strato doesn’t offer a monthly billing option, although the one you get with Host Europe will set you back with a one-off setup fee.",
    "Hostinger is one of the most popular hosts from Europe. It offers its users an access to its servers which are found all around the world including the Americas, Europe, and Asia. Thanks to its 14-day “observation” period you can try out everything for yourselves without a need to worry about your budget. Unfortunately, you will not get such a chance with Host Europe.",
    "Host Europe is an award-winning veteran from Germany trusted by over 250.000 customers as we write, and the number keeps on growing. If you can come to terms with data centers in Germany and France (kind of), self-help options being in German only, somewhat sluggish sign-up procedure, and considerable one-off setup fees (with monthly plans), be sure to give Host Europe a chance. If not, HostGator or Bluehost might be a better choice."
  ],
  "headers": {
    "6": "Pricing",
    "11": "Ease of use",
    "15": "Speed and experience",
    "18": "Support",
    "20": "The competition",
    "24": "Final verdict"
  },
  "links": {
    "Host Europe": "https://www.awin1.com/awclick.php?awinmid=9324&awinaffid=103504&clickref=trd-us-1080018333388574500&p=https%3A%2F%2Fwww.hosteurope.de%2Fen%2F",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "domain name registrar": "https://www.techradar.com/news/best-domain-registrars",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "ecommerce hosting": "https://www.techradar.com/news/best-ecommerce-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "SSL certificates": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Basic": "https://www.awin1.com/awclick.php?awinmid=9324&awinaffid=103504&clickref=trd-us-1184628692246622000&p=https%3A%2F%2Fwww.hosteurope.de%2Fen%2FWeb-Hosting%2F",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "CMS": "https://www.techradar.com/best/cms",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Strato": "https://www.techradar.com/reviews/strato",
    "Hostinger": "https://www.techradar.com/reviews/hostinger"
  }
}