{
  "source": "https://www.techradar.com/reviews/easy-virtual-security-vpn",
  "title": "Easy Virtual Security VPN review",
  "category": "computing",
  "updated": "2021-07-09T20:41:51Z",
  "author": "sead-fadilpasic",
  "summary": "A tiny VPN service purchased via eBay",
  "verdict": "Easy Virtual Security is basic when compared to the competition. There are no fancy apps, complex features, or even a website - and there’s only one server available. However, it's extremely cheap and you don’t even need to purchase a long subscription, making it an excellent little VPN solution for emergencies.",
  "pros": [
    "Very cheap",
    "Lightweight",
    "Helpful and communicative seller"
  ],
  "cons": [
    "No website",
    "Only one server location",
    "No apps or special features",
    "No free trial or money-back guarantee"
  ],
  "article": [
    "Easy Virtual Security is a basic VPN service that doesn’t have its own website but is instead sold on eBay. This isn’t something we see every day but it seems to work, at least if you don’t have any heavy duty requirements.",
    "This provider doesn’t bother with multiple subscription packages, pricing plans, discounts and the like. Instead, it simply sells its product via eBay at $2/month. This will get you a VPN service for two devices at the same time.",
    "That said, after purchasing the product, we later discovered there were other Easy Virtual Security instances on eBay (from the same seller) with slightly different prices, ranging from $1.21 to $3.64, but with descriptions in German.",
    "As is the usual eBay policy, you can pay for the product using PayPal or credit/debit cards.",
    "The product page states that the seller doesn’t accept returns, so this means you can’t get your money back if the product doesn’t work, at least not through the provider. You could, however, ask eBay to step in, or even PayPal.",
    "While lightweight and practical, Easy Virtual Security is no match for the far more capable alternatives, such as ExpressVPN, NordVPN, Surfshark, or CyberGhost.",
    "These services are more expensive, but you’ll get access to thousands of servers, blazing speeds, and user-friendly apps for different devices, all equipped with advanced VPN features like split tunneling.",
    "You’ll also get 24/7 customer service via live chat, detailed online libraries with tutorials and explanations of the tiniest details, a choice between multiple connection protocols and much more - none of which Easy Virtual Security is able to offer.",
    "Easy Virtual Security only offers one VPN location, in Macedonia, so it cannot be used to unblock US or British libraries on Netflix, Hulu, HBO Go or BBC iPlayer.",
    "The eBay seller behind Easy Virtual Security lists Germany as its location (although the item location says Macedonia). There’s no website to visit other than the seller’s eBay page.",
    "There isn’t much information available about the VPN’s technical abilities, except that it supports OpenVPN and IPSec connection protocols. According to the seller, Easy Virtual Security VPN is perfectly safe and suitable for use when torrenting.",
    "The product page suggests this VPN can be used across macOS, Windows 10, Linux, Android and more.",
    "That said, there are no apps for these devices, just a simple file you receive from the seller via email to be used alongside a third-party VPN app. So don’t expect any special features, settings or options, other than those offered by the OpenVPN software.",
    "Other than the eBay product description and one short video on YouTube, you shouldn’t hope for any tutorials, knowledge bases, or FAQs, which is why this VPN may be more suitable for someone who already has some experience using VPNs.",
    "That said, the product description says you can “schedule a virtual meeting to give you the best possible support”. This is far less practical than a browsable knowledge base on a website or live chat, but maybe it can get the job done.",
    "We did discover, however, that the seller is very quick and helpful in email communication, and has even sent us follow-up emails to check on how we manage.",
    "Our experience with Easy Virtual Security wasn’t as simple as with the alternatives offered by the big companies, but we have little to complain about otherwise. We paid for the service on eBay and then received a message from the seller asking for our email address.",
    "The seller then sent the .ovpn file, which we downloaded and used together with OpenVPN Connect for Windows. However, since no explanations or tutorials are provided (except a video for Android), a beginner might find themselves baffled about what to do.",
    "The connection was established immediately. There was only one VPN location available, in Macedonia, and it gave us a download speed of 11.54Mbps. Our testing connection at the time was 51.36Mbps. Considering that our physical location is close to Macedonia, this seems a bit low.",
    "Easy Virtual Security is a small VPN that is good enough for an emergency, but it comes nowhere near the well-known players on the market. However, for a low price, you’ll get a basic connection to one server, which might be enough for some users."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "10": "Privacy and encryption",
    "11": "Support",
    "16": "Speed and experience",
    "19": "Verdict"
  },
  "links": {
    "Easy Virtual Security": "https://www.ebay.com/sch/easy.virtual.security/m.html?item=393154417015&rt=nc&_trksid=p2047675.l2562&mkevt=1&mkcid=1&mkrid=711-53200-19255-0&campid=5337827784&customid=trd-us-4261225557663292400",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "video": "https://www.youtube.com/watch?v=RmuuviY1YQQ"
  }
}