{
  "source": "https://www.techradar.com/reviews/vax-platinum-smartwash-carpet-cleaner",
  "title": "Vax Platinum SmartWash Carpet Cleaner review",
  "category": "appliances",
  "updated": "2021-06-23T14:03:38Z",
  "author": "emily-peck",
  "summary": "Refresh carpets and upholstery, and give rooms a new lease of life with this clever device",
  "verdict": "The Vax Platinum SmartWash does an excellent job of removing both fresh and embedded stains from carpets. It’s easy to use, and while it’s an expensive cleaner, it can save you money in the long term by prolonging the life of your carpets and upholstery.",
  "pros": [
    "Remove fresh and stubborn stains",
    "Can wash and dry",
    "Easy to clean"
  ],
  "cons": [
    "Bulky and heavy",
    "Expensive"
  ],
  "article": [
    "With over 40 years of experience, Vax is a well-respected floorcare brand selling some of the best vacuums. As well as offering a wide range of cylinder, upright and cordless vacuum cleaners, Vax also has a selection of carpet and upholstery washers.",
    "The Vax Platinum SmartWash carpet cleaner is claimed to be its most effective carpet washer to date, with Vax promising that it kills over 99% of bacteria trapped in carpet fibres as well as outperforming the UK’s leading rental carpet cleaners when it comes to removing stains.",
    "Price-wise it’s a step up from existing Vax washers such as the Vax Platinum Power Max Carpet Cleaner, which costs £249, which the company claims removes up to 93% of bacteria. For smaller spills and targeted stains, there’s also the Vax ONEPWR SpotlessGo Spot Washer, which costs £149.99 and is also claimed to kill over 99% of bacteria. While you may find a cheaper carpet washer in the Vax lineup, the Vax Platinum SmartWash Carpet Cleaner boasts the best features, and an ergonomic design, and promises excellent results.",
    "It may not be the cheapest carpet washer you can find on the market, with its next-generation motion sense technology and intuitive design, it has all you need to keep floors and upholstery in tip-top condition yourself without having to pay for a professional.",
    "The Vax Platinum SmartWash Carpet Cleaner will set you back £299.99 and is available at the Vax website, or at Amazon.",
    "Weighing 7.4kg and measuring 107cm high, the Vax Platinum Smartwash Carpet Cleaner can feel a little bulky when you first use it. It’s shaped like an upright vacuum cleaner but is a little more awkward to manoeuvre around your home. Once we got used to the feel of it, however, we found it easy to use. There’s a handle on the front of the body, which made lifting it up the stairs relatively easy.",
    "Setting up the machine is relatively simple. You simply fill the 3.5-litre water tank, connect the 2.5m hose and add Vax’s Platinum Antibacterial solution, which comes in the box. The main brush head built into the body is around 32.5cm wide, which means you can cover an ample amount of carpet in one glide.",
    "The machine also comes with useful tools included for targeting smaller stains and spills – simply connect the hose and add your desired tool. These include the 2-in-1 antimicrobial tool for both multi-purpose cleaning and mess such as pet spills. The angular shape of this 2-in-1 tool means it can reach into crevices easily, which makes it useful for getting right into the sides of the sofa or on stairs, for example. We found this tool worked particularly well when we were trying to scrub out an old stain on the carpet. The kit also comes with a SpinScrub hand tool, which is designed more for targeting stains and stubborn marks on rugs and carpets.",
    "We actually found that the multi-purpose Antimicrobial Tool was just as efficient for rugs and carpets, but it’s nice to have the option of a secondary solution. There’s also a 250ml pre-treatment solution included in the box, designed for tougher stains, and a handy accessory bag to keep all the tools, hose, and cleaning heads compactly stored when not in use.",
    "After use, the parts were easy to clean as the solution and water containers simply unclip from the body of the cleaner, and the brushbars lift out for rinsing under the tap to get rid of any debris.",
    "The USP of the VAX Platinum SmartWash’s design is that it’s the UK’s first carpet washer with Motion Sense technology and no trigger. This means that it can automatically wash and dispense clean water and antibacterial solution as you push forward, and dry the area when you pull back. We wanted to see how effective the Vax Platinum Smartwash Carpet Cleaner, how easy it is to transport around the house and how well it created an overall fresh feel after use.",
    "To do this, for our first test we asked one very willing six-year-old to pour a berry smoothie all over the test carpet. Before we began cleaning the stain, we wiped off the excess smoothie with kitchen roll, then sprayed on a little pre-treatment solution. Then we pressed the release button with our foot and pulled the handle back to recline and slowly pushed the machine forwards while it automatically dispensed solution and water – indicated by the ‘Wash’ button on the side of the machine.",
    "We then slowly pulled the machine backwards as it switched to ‘Dry’ mode to pick up the solution. We found the combination of the solution and the power of the machine meant the stain was removed very effectively. The machine also measured 86 decibels on our Decibel Meter app during use, which didn’t feel too noisy. Our only concern was how wet the carpet felt after use. To fix this, we used the device on Dry mode for a little longer to suck up the last of the excess water and speed up the drying process. Afterwards, the area looked clean and fresh and you’d never have thought that a child had run riot with a berry smoothie 20 minutes earlier.",
    "Our second test was to attempt to remove a dreaded old red-wine stain from the stair carpet. To do this we attached the 2-in-1 Antimicrobial Tool to the hose and worked it back and forth to dislodge the stain. It took a little while before we could see it start to lift, and you do have to aim the tool hose head in the right direction to ensure that the solution is delivered to the right spot, but we were eventually able to remove the stain, leaving the area looking clean. After use, the fibres of the carpet also looked invigorated and refreshed.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Vax Platinum SmartWash Carpet Cleaner price and availability",
    "5": "Design",
    "10": "Performance",
    "14": "Don't buy it if..."
  },
  "links": {
    "best vacuums": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}