{
  "source": "https://www.techradar.com/reviews/cosori-pro-le-air-fryer-l501",
  "title": "Cosori Pro LE Air Fryer L501 review",
  "category": "appliances",
  "updated": "2021-09-06T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "A sleek, stylish air fryer that's great for fries",
  "verdict": "The Cosori Pro LE Air Fryer L501 is a sleek air fryer that cooks crisp fries and crunchy but succulent chicken wings. Simple to use, we did need to experiment with cooking times to achieve an evenly browned finish – but the L501 is compact and easy to use, making it worthy of consideration.",
  "pros": [
    "Produces crisp fries and chicken wings",
    "5-quart / 4.7-liter capacity",
    "Stylish design"
  ],
  "cons": [
    "Struggles with frozen foods",
    "Requires some experimentation to achieve evenly browned results"
  ],
  "article": [
    "Cosori isn’t as well known in the air fryer space as big names Instant, Ninja and Philips, but it certainly isn’t any less capable. As well as offering a number of food dehydrators, kettles and bread makers, the brand also offers an array of air fryers.",
    "Like many of the best air fryers, the Cosori Pro LE Air Fryer L501 uses hot air to crisp foods that are placed in its frying basket. According to Cosori, cooking requires 85% less oil than deep-frying foods, providing a healthier way to enjoy indulgent treats such as fries and chicken wings.",
    "The Cosori Pro LE Air Fryer L501 is a basket-style air fryer with a 5-quart / 4.7-liter capacity, which the company states should be sufficient for four people.",
    "The air fryer features seven presets with predefined temperature and cooking durations for different foods such as chicken, bacon, and vegetables. These can be activated by pressing the touch controls on the top of the air fryer, which also allows you to adjust the temperature and cooking time so foods are cooked to your liking.",
    "Also included is a pre-heat function and a keep warm feature, which will maintain the temperature of your dishes for up to 30 minutes. Both the basket and the crisper plate can be cleaned in the dishwasher.",
    "For those looking for a healthier way to enjoy fries, chicken wings and other indulgent foods, and wanting a compact, streamlined device, the Cosori Pro LE Air Fryer L501 is well worth considering.",
    "The Cosori Pro LE Air Fryer L501 is priced at £99.99 (around $140). Currently available from Amazon in the UK, Cosori does have plans to launch the air fryer in the US, too, although it is yet to confirm an exact release date.",
    "The brand also offers the larger-capacity Cosori CS-158AF, which can hold up to 5.8 quarts / 5.4 liters of food and comes with Wi-Fi connectivity, and costs $119.99 / £119.99. Meanwhile, the CP-137AF is a smaller 3.7-quart / 3.5-liter air fryer costing $99.99 / £79.99.",
    "The Cosori Pro LE Air Fryer L501 is a compact kitchen appliance, sporting a sleek matte black finish and measuring 10.6 x 10.6 x 11.8 inches / 27 x 27 x 30cm (w x d x h). Unlike any of the air fryers we’ve tested previously, the LED and touch control panel is located on the glossy top of this kitchen gadget. It’s a basket-style air fryer, and both the basket itself and the crisper plate are dishwasher-safe, which makes for easy cleaning.",
    "The Cosori Pro LE Air Fryer L501 offers seven presets for cooking french fries, chicken, and frozen food, as well as steak, seafood, and vegetables, alongside a pre-heat function and a keep warm setting that maintains the temperature of food for up to 30 minutes. You can also manually adjust the temperature and cooking duration, if you’d prefer.",
    "The air fryer has a 5-quart / 4.7-liter capacity, which Cosori says is enough for up to four people, and the air fryer can cook for up to one hour at a time. It reaches a maximum temperature of 446ºF / 230ºC.",
    "A recipe book with more than 30 dishes is included with the Cosori Pro LE Air Fryer L501, and the VeSync app – which is available for iOS and Android – offers hundreds more.",
    "The Cosori Pro LE Air Fryer L501 does a sterling job of creating a crunchy exterior on everything from fries to chicken wings.",
    "We used the air fryer to cook homemade fries, which were crisp on the outside with soft, fluffy potato on the inside, but they weren’t evenly browned. Cosori recommends pre-heating the air fryer, although, unlike the Instant Vortex Plus 6-in-1 Air Fryer, this doesn’t happen automatically. As such, you’ll need to activate the preset first, adding food items once the preheat is complete. Even with the preheat, the suggested cooking time of 25 minutes didn’t achieve the level of browning preferred, so we cooked them for a further five minutes.",
    "For cooking chicken wings, the recipe book suggests using a spray oil on the skin of the meat. We gave each wing two sprays, which resulted in crisp, crunchy skin and succulent meat.",
    "However, we were left disappointed when using the air fryer to cook frozen steak-cut fries. Following the preheat function, we used the frozen food preset, which has a duration of 10 minutes. Unfortunately, this wasn’t long enough to ensure the fries had a crunchy exterior and were fully cooked inside. In fact, we cooked them for a further 10 minutes, shaking and checking them half way through – and even then, while some were perfectly cooked, others were soft with undercooked centers.",
    "On a positive note, the Cosori Pro LE Air Fryer L501 comes with a couple of handy safety features. The controls can’t be activated unless the air fryer basket is fully inserted into the air fryer. In addition, there’s a button on the basket that needs to be pressed before it can be removed from the air fryer – although we frequently forgot about this feature and struggled to remove the basket.",
    "Like many air fryers, the Cosori Pro LE Air Fryer L501 offers a reminder to shake feature, since rotating food during the cooking process will ensure that hot air reaches every inch of the surface of items. However, you’ll need to select this option when you’re choosing the preset, or setting the time and cooking duration you want.",
    "During cooking, the Cosori Pro LE Air Fryer L501 registered 55.7db for noise on our decibel meter, which is equivalent to the gentle hum of a refrigerator, making it one of the quietest air fryers we’ve tested.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Cosori Pro LE Air Fryer L501 price and availability",
    "8": "Design",
    "12": "Performance",
    "19": "Don't buy it if..."
  },
  "links": {
    "best air fryers": "https://www.techradar.com/news/best-air-fryer",
    "CP-137AF": "https://www.techradar.com/reviews/cosori-cp137-af"
  }
}