{
  "source": "https://www.techradar.com/reviews/epos-now-pos",
  "title": "Epos Now point of sale (POS) review",
  "category": "computing",
  "updated": "2021-08-05T15:23:52Z",
  "author": "anthony-spadafora",
  "summary": "An ideal cloud-based POS system for retail and hospitality from Epos Now.",
  "verdict": "Epos Now makes things easy for employees and business owners by providing a fast training process. The company’s POS system also boasts a wide range of features and its capabilities can be extended further by adding apps.",
  "pros": [
    "Built-in CRM",
    "App store",
    "Free 30-day trial",
    "Hosting outsourced to AWS for improved security"
  ],
  "cons": [
    "No knowledgebase",
    "No kiosk option",
    "Paid customer support"
  ],
  "article": [
    "Necessity is the mother of invention, or at least that was the case when Epos Now’s founder and CEO Jacyn Heavens identified a gap in the market for an affordable POS system while managing a bar.",
    "He searched for a POS system that would be suitable for his business, and when he couldn’t find one, he started building his own software to suit business owners like himself.",
    "Today, Epos Now is used by 30,000 businesses in 103 countries, and the company even has quite a few big-name clients such as Disney Pictures, Universal and Yankee Candle.",
    "Epos Now's point of sale offerings continue to grow, with the launch of their multi-purpose Epos Now Order & Pay POS system launched in November 2020.",
    "So let’s take a closer look at this UK-based POS outfit to see how it stacks up against the competition, and find out whether it’s the right fit for your business.",
    "Epos Now is a subscription-based service and businesses can choose to pay either $39 a month or $349 annually. Keep in mind that this is just the price of the software and does not include the hardware you’ll need to run the company’s POS system.",
    "Prices do vary by region, so see the table below for more details.",
    "While other POS systems charge differently depending on the industry they serve, it was a nice surprise to find out that both the retail and hospitality variants of Epos Now cost the same. The company even offers a free 30-day trial so that new users can test the system out for themselves.",
    "If you sign up for a monthly plan with Epos Now, there is no contract, so you can cancel at any time without incurring an early cancellation fee.",
    "Epos Now prides itself on being the “world’s easiest POS system” and according to the company “staff can be fully operational in just 15 minutes”. Ease of use is always appreciated and the company’s POS system stands out for its clean and simple user interface.",
    "Epos Now is a cloud-based system that can run on any device that supports either Google Chrome or Safari. If you have existing POS hardware from another vendor, you may be able to use it with the company’s software, but you’ll have to check with the firm first.",
    "On its site, Epos Now sells a number of POS system bundles that cater to retail and hospitality businesses. However, there are also bundles for specific business types such as the Nightclub & Bar POS System, Cafe POS System, Restaurant POS System, Fashion POS System and Beauty & Tanning Salon POS system. This is likely to make things easier for customers looking for a specific solution, but either the Retail or Hospitality bundle should suffice.",
    "Each POS system bundle contains one of the company’s own terminals, its POS software, a receipt printer and a cash drawer. Thankfully, installation, configuration and training are included with the price of Epos Now’s hardware bundles, which all cost $1,799 regardless of which configuration you choose.",
    "As we mentioned earlier, the features available in Epos Now will depend on whether you choose the Retail or Hospitality package, so let’s take a look at some of the best features from the two.",
    "The company’s POS system is cloud-based which means that you can access your reports and back-office tools from any browser, even when you’re away from your store or business. With Epos Now, you also don’t have to set up a local server even if you’re running multiple devices from your business.",
    "When it comes to reporting, the software’s dashboard provides you with a real-time overview of your sales data, and you can even customize it to show the information that’s most important to your business.",
    "Epos Now allows you to view both your best and worst performing products, as well as view the brands or products with the highest profit margins. You can also track the performance of your staff with the software’s employee reports. All of the reports made in Epos Now can be exported to Excel, QuickBooks, Xero and Sage.",
    "The company’s software has a built-in customer management system which you can use to collect information from your customers, and then use this data to analyze customer behavior. Customers can provide feedback on your business directly from receipts you’ve emailed them.",
    "As we touched on before, a loyalty module is available for an additional fee, and any other integrations or apps you wish to add to your POS system can be implemented through Epos Now’s own app store.",
    "The retail version of Epos Now includes inventory management tools that support up to 60,000 items, and can be used to track products across your physical and online stores.",
    "The restaurant variant of the software can track inventory to an ingredient level, and it even has the capability to tell you how many dishes you can prepare with your remaining ingredients. Low stock alerts can also be set in the system to alert you when supplies are about to run out, and Epos Now can be configured to automatically generate purchase orders when your supplies are low.",
    "Lastly, Epos Now will allow your business to accept payments via card, chip, tap and even Apple Pay. More payment options are a good thing as they will give your customers more flexibility, and perhaps even satisfaction when they realize they can pay with just their Apple Watch at your business.",
    "While Epos Now offers a wide variety of features and integrations, it might not be the right choice for your business. Here are a couple of alternatives worth considering.",
    "If you run a restaurant, then Toast POS may be worth considering as this POS system was designed specifically with a focus on food service. The company’s well-designed hardware was built to withstand the rigors of any restaurant environment, and you can even pay a bit extra to have it professionally installed, which could be quite beneficial to businesses that are expanding rapidly.",
    "If you have existing POS hardware or just want more choices in how your system is set up, then Talech POS could be right for you, as the company’s POS system is compatible with a number of third-party devices. This means that you can pick and choose exactly how you want to configure your registers.",
    "Epos Now gets a lot of things right from the get-go. By making its POS system easy enough to use so employees can be trained on it in just 15 minutes, the company is ensuring that both business owners and the employees themselves will not become frustrated.",
    "Adding an app store to Epos Now was another wise decision that provides businesses with the software they’re familiar with, while simultaneously courting developers to write software for the system. The addition of new payment methods such as Apple Pay can also help business owners draw in new customers and in turn generate more sales.",
    "To top it off, Epos Now comes with a 30-day free trial, so there is no reason not to test this POS system out for yourself."
  ],
  "headers": {
    "5": "Epos Now POS: pricing",
    "9": "Epos Now POS: setup",
    "13": "Epos Now POS: features",
    "22": "Epos Now POS: competition",
    "25": "Epos Now POS: final verdict",
    "28": "Further reading"
  },
  "links": {
    "POS system": "https://www.techradar.com/news/the-best-pos-system",
    "Epos Now Order & Pay POS system": "https://www.techradar.com/reviews/epos-now-order-and-pay-review",
    "launched in November 2020": "https://www.eposnow.com/uk/resources/epos-now-launches-multi-purpose-order-and-pay-solution/",
    "POS system bundles": "https://www.eposnow.com/us/store?limit=36",
    "Toast POS": "https://www.techradar.com/reviews/toast-pos-point-of-sale",
    "Talech POS": "https://www.techradar.com/reviews/talech-point-of-sale-pos-review"
  }
}