{
  "source": "https://www.techradar.com/reviews/peak-design-everyday-backpack-v2",
  "title": "Peak Design Everyday Backpack V2 review",
  "category": "cameras",
  "updated": "2021-11-04T06:09:15Z",
  "author": "sharmishta-sarkar",
  "summary": "A premium camera bag with magnetic appeal",
  "verdict": "Peak Design’s Everyday Backpack wins on design and versatility – every aspect of the bag has been well thought out. There’s different ways you can organize your camera gear, and access them all from either side, plus the minimalist exterior makes quite a statement while hiding a whole load of functionality. However, it takes a while to familiarize yourself with this bag – it won’t be ready to roll straight out of the box.",
  "pros": [
    "Great design",
    "Very versatile",
    "Excellent build quality",
    "Side access and handles"
  ],
  "cons": [
    "Limited interior padding",
    "Limited exterior pockets",
    "Complicated organizational design"
  ],
  "article": [
    "Peak Design’s original Everyday Backpack was a crowdfunded project from back in 2015. It was available to buy in 2016 and very quickly became so popular that it was only going to be a matter of time before the US-based company decided to give it a refresh – enter the Everyday Backpack V2. It’s available in two sizes – 20L and 30L – and comes in a handful of earthy colors that are pleasing and neutral. We were sent the 20L option, which is described in further detail below.",
    "The Peak Design Everyday Backpack is available to buy directly from the company or from select retailers around the world. The 20L option will set you back $260 / £192 / AU$355, while the 30L backpack costs $290 / £215 / AU$395. You can occasionally find pre-owned options on the Peak Design website itself for a little less, or you could wait for a big sale like Black Friday, when there’s a significant discount on most Peak Design bags.",
    "We’ve been fans of Peak Design from the get go, having tested the Everyday Messenger 13 V2 a few years ago, followed by the Peak Design Travel Tripod. Despite the high price, we loved them both. Everything Peak Design does is carefully considered, including the Everyday Backpack, and we must admit there’s a lot to unpack with this amazing bag.",
    "As we’ve just mentioned, there’s a lot going on with the backpack and practically everything you see – and don’t see – serves a purpose. A lot of thought has gone into designing this bag and its minimalist look hides a lot of nuances that could make this your go-to camera bag.",
    "To start with, there are so many loops and straps, which are mostly hidden away, that it will take you a while (probably a few days) to discover them all and figure out how best to put them to use. For example, there are a total of 14 loops distributed around the bag; these can be used to secure either the short straps – tucked into the side compartments and great for securing a tripod – or the longer ones residing in an almost-hidden front compartment that opens downward. These straps can be secured in any permutation or combination with the loops, even to create extra hanging loops for small items you want easy access to.",
    "Speaking of the side pockets, they’re both deep and can be shut magnetically (as can the hidden front compartment), although small openings will expose the interior to water. That said, each side pocket has a permeable nylon piece that adds some stretch and can drain water away.",
    "The top flap encloses the main compartment via a ‘Maglatch’ magnetic clasp. The Maglatch is far more secure than the older version and yet still allows the bag to be opened or closed easily. There are four rungs on the front to secure the clasp – the lowest compresses the bag to a 20L capacity while the topmost adds 3L more. The only issue with filling the bag all the way to its max 30L capacity is that the top flap doesn’t fully cover the compartment, leaving small gaps on the sides from where water can enter if you’re walking around in the rain.",
    "Hold on, there are more magnets that we need to mention… in the shoulder straps. When not in use, both stick to the rear panel of the bag, giving the bag a clean look. You can even cross the shoulder straps and they’d still magnetically stick to the rear – another nice touch that seems unnecessary but becomes important when you need a low profile to shove the bag under an airline seat to stow away.",
    "The interesting thing about the straps is that they have swivel points that make the bag easy to swing around to the front to grab gear without worrying about how much tension there is at the point of attachment. The shoulder straps themselves are well padded and comfortable.",
    "A sternum strap is also available, and it’s entirely removable and adjustable, with three points of attachment on the shoulder straps to suit your height and build – just hook the aluminum buckles into corresponding slots on each shoulder strap, then pull the tabs to tighten if necessary. Tightening the shoulder straps is also the same – just pull – and they all move as smooth as silk.",
    "There’s even a luggage pass-through – which is also magnetized – to secure the bag through an extended suitcase handle while traveling. There are handles on either side of the bag as well, making it really easy to quickly grab and go. Little details on the bag that appear purely cosmetic can also serve a purpose. For example, the nubuck leather details on the shoulder straps are in fact loops that can be used as attachment points for carabiners. Even the zipper tabs can be tucked away for security, and you’ll also get a laptop compartment (the 20L fits a 15-inch laptop) that has a tablet pocket as well.",
    "The entire bag is made from 100% recycled 400D nylon that has a weatherproof DWR coating. It looks like canvas but is tough as nails and entirely water-resistant. We were sent the Midnight Blue version of the backpack and found that it picks up dust and scuff marks very easily indeed, although a damp cloth quickly takes care of that if it bothers you.",
    "It’s a bit simpler on the inside, at least from a design standpoint. The single large compartment is divided into smaller units by Peak Design’s origami-inspired ‘shelves’. Called FlexFold dividers, three come in the 20L bag (more can be purchased separately if necessary) and they can be folded a few different ways to create custom sections to suit different items. The side flaps of each divider have two layers – you fold the top one to add an additional ‘shelf’ for small lenses, for example. They can be laid flat or used to create up to three small compartments.",
    "Peak Design also makes a whole bunch of additional pouches, clips and straps that you can purchase separately to customize the Everyday Backpack.",
    "In addition to the dividers, there’s an interior pocket along the rear panel that can fit small items like your phone and credit card, as well pockets along the sides – including two that close… wait for it… magnetically.",
    "So, what do all those straps, loops, magnets, shelves and everything else in between feel like when you’re carrying the Everyday Backpack around? Quite comfortable, as long as the load isn’t too heavy. While the bag feels well balanced for your back when stuffed full, the shoulder pads can start to feel uncomfortable, particularly if you’re going to be doing a lot of walking or hiking. An optional hip strap is available to purchase from Peak Design, if you’re willing to spend more, while the sternum strap can also offer a little more support, although it’s quite minimal if you’ve got a full load.",
    "Having side access on both sides means the bag will suit everyone – left or right handed. In fact, we found that using the side openings were the best way to access the entire main compartment, irrespective of where and how the dividers are placed. The top flap only gives you access to the top section after all, with the dividers blocking the lower sections.",
    "The internal organization of the Peak Design Everyday Backpack is perhaps the best we’ve come across, but it’s not quite perfect. For one, it takes a while to figure out how best to set up all the ‘shelves’. That might sound like nitpicking, but you could spend a few days just figuring out the ins and outs of the bag.",
    "Moreover, each cubby formed by the folded dividers is a fixed size. This is fine for drones, longer lenses or DSLR/full-frame bodies, but if you happen to use a Micro Four Thirds system, or smaller prime lenses, these can roll around – albeit just laterally – with not a lot of padding available. So if you’ve packed a lens close to the outer edge, then you ought to be careful when opening the bag from the side.",
    "We also found that with a laptop inside, there’s not a lot of room in the interior pocket that sits along the rear panel. Throw in a tablet along with the laptop and it truly becomes impossible to add even a phone to that pocket. It’s a similar situation with the internal side pockets as well. If you have a water bottle stuffed into an external side pouch, it reduces the volume in the small pockets under the flap.",
    "These few issues aside, the Peak Design Everyday Backpack is perhaps the most innovative camera bag we’ve tested.",
    "[First reviewed November 2021]"
  ],
  "headers": {
    "3": "Design",
    "15": "In use",
    "21": "Don't buy it if..."
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Everyday Messenger 13 V2": "https://www.techradar.com/reviews/peak-design-everyday-messenger-13-v2",
    "Peak Design Travel Tripod": "https://www.techradar.com/reviews/peak-design-travel-tripod"
  }
}