{
  "source": "https://www.techradar.com/reviews/sennheiser-ie-900",
  "title": "Sennheiser IE 900 review",
  "category": "audio-visual",
  "updated": "2021-09-20T16:23:39Z",
  "author": "olivia-tambini",
  "summary": "In-ear headphones that sound incredible",
  "verdict": "If you're an over-ear headphones aficionado, the Sennheiser IE 900 are the best in-ear headphones for trying out the smaller form actor - if you can afford them, that is. These pricey audiophile earbuds deliver an incredible audio performance that's testament to their great design. It's a shame there's no in-line remote on any of the cables, but that's a small bugbear.",
  "pros": [
    "Incredible audio performance",
    "Choice of cables",
    "Great build quality"
  ],
  "cons": [
    "No inline remote",
    "Expensive compared to rivals"
  ],
  "article": [
    "If you’re looking for a pair of audiophile earbuds that can compete with the best over-ear headphones, look no further than the Sennheiser IE 900.",
    "They’re super-expensive for a pair of wired earbuds, but they’re capable of eking out every last drop of detail from your music, especially if you use them with a good DAC or external amp.",
    "The Sennheiser IE 900 blow pretty much every set of wireless earbuds out of the water for audio performance, and that’s as good a reason as any to forgo the convenience of being cable-free. Incidentally, you get three different cables with these buds, each ending in a different-sized jack, so you’re spoilt for choice when it comes to connectivity.",
    "It’s a shame there’s no inline control considering the price, but this is a minor quibble. Much attention to detail has gone into making of these buds, from the aluminum housings to the microfibre cleaning cloth included in the box.",
    "The Sennheiser IE 900 are comfortable to wear for long periods of time – and, trust us, you’ll certainly want to use them for extended listening sessions. In fact, they sound so good, you’ll struggle to tear yourself away. If you have the money, they’re a brilliant investment.",
    "The Sennheiser IE 900 are available to buy now for $1,299.95 / £1,099 / AU$2,099, which makes them very pricey indeed. Aimed squarely at the audiophile market, these are wired earbuds for the most discerning of ears, with the price reflecting that.",
    "By way of comparison, our favorite wired earbuds, the 1MORE Triple Driver In-Ear Headphones, were priced around $100 / £100 / AU$150 at launch, and can currently be found discounted much lower than that.",
    "That’s not to say we believe the Sennheiser buds are overpriced. You get what you pay for with these earbuds, which is the kind of build quality you’d expect from a pair of luxury in-ears.",
    "The Sennheiser IE 900 look and feel as premium as their high price suggests. They arrive with a selection of silicone and memory foam eartips in the box and three gold-plated cables – one ending in a 3.5mm jack, plus two balanced 2.5mm and 4.5mm versions. Those looking for flexibility when it comes to hooking up the earbuds to your phone, portable DAC, or headphone amp, won’t be disappointed by the Sennheiser IE 900.",
    "Also included in the package is a neat carrying case that zips up to keep the earbuds safe when they’re not in use, as well as a cleaning tool, microfibre cloth, and a small clip to secure the cable to your shirt or jacket. It’s a shame none of the cables come with an inline remote, and as such, you’ll have to dig out your device to change the volume and skip tracks. At this price you’d probably expect such quality of life features to be included, but it isn’t a dealbreaker.",
    "The earbuds themselves are designed to sit against your ear canal, with the cable looping around the back of your ear. This can be a little fiddly to position at first, but they feel very comfortable once in place.",
    "With housings made from a single block of aluminum, the earbuds feature a triple-chamber absorber system, which uses three chambers and an acoustic vortex milled into the nozzle. In other words, this design should stop high-frequency sounds being concealed by lower-frequency ones, allowing for more detail to be heard in your music.",
    "The Sennheiser IE 900 are single-driver earbuds, which the company says deliver “greater fidelity” for listeners, with 7mm transducers giving a frequency response of 5-48,000kHz and designed to prevent distortion.",
    "These days, lots of earbud manufacturers promote dual-driver systems as the best way to achieve a strong low-end and clear trebles, so it’s interesting to see Sennheiser go down this route. Saying that, using one driver has allowed the company to keep the earbuds compact and light, and the IE 900 are so well-tuned and balanced that we don’t miss having a separate woofer and tweeter inside.",
    "The Sennheiser IE 900 are easily among the best-sounding in-ear headphones we’ve ever tested. While we’d recommend using these earbuds with an external DAC (we used the iFi hip-dac), they performed brilliantly plugged right into our laptop’s 3.5mm aux port as well.",
    "Listening to Secure the Galactic Perimeter from the Frank (2014) soundtrack, the earbuds handle the frenetic timing changes and wild dynamic and tonal extremes with finesse. As Michael Fassbender’s voice pans left and right, the earbuds demonstrate just how good their imaging is.",
    "Wailing and wobbling synths cut through distorted guitar drones, while percussion sounds detailed and well timed.",
    "They perform equally well with less timbrally complex tracks as well. Schubert’s Minuet in A Major (D. 334) sounds rich and warm, with a sweetness that comes from earbuds that sympathetically handle the contrast between soft and loud."
  ],
  "headers": {
    "5": "Sennheiser IE 900 price and availability",
    "8": "Design",
    "14": "Audio performance",
    "18": "Don't buy them if..."
  },
  "links": {
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "best over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "1MORE Triple Driver In-Ear Headphones": "https://www.techradar.com/reviews/1more-triple-driver-in-ear-headphone",
    "portable DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "best-sounding in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "iFi hip-dac": "https://www.techradar.com/reviews/ifi-hip-dac"
  }
}