{
  "source": "https://www.techradar.com/reviews/honor-50-review",
  "title": "Honor 50 review",
  "category": "phones",
  "updated": "2021-11-16T14:27:29Z",
  "author": "tom-bedford",
  "summary": "A capable phone, but not particularly competitive",
  "verdict": "The Honor 50 is a well-rounded phone: its screen, front-facing camera and battery life all impress, and we didn’t find any major issues while using the device. However, the mid-range phone market is competitive, and we struggled to find a particular area where the device excelled.",
  "pros": [
    "Versatile selfie camera",
    "Bright display",
    "Long-lasting battery life"
  ],
  "cons": [
    "Redundant rear cameras",
    "Temperamental always-on display",
    "No headphone jack"
  ],
  "article": [
    "The Honor 50 is the first major globally-launched phone by the Honor company since it released the Honor 20 in 2019. At that time, Honor was a Huawei sub-brand, and subject to a company-wide ban that prevented Huawei products from utilizing Google apps. Honor regained access to these apps in January 2021, when Huawei sold the sub-brand to a conglomerate of Chinese companies.",
    "Unfortunately, Honor isn’t exactly bursting back onto the global stage with gusto. While the Honor 50 is a perfectly capable smartphone, it’s far from being a showstopper.",
    "The company’s first stumble was a confusing launch in the summer of 2021. Honor unveiled the Honor 50 in July and the Honor Magic 3 in August, but neither phone has been available to buy until now with the 50’s re-launch. This leaves us wondering, haven’t we already seen this device?",
    "Indeed, we have. Besides the Honor 50’s initial summer unveiling, the phone is a doppelganger of the Huawei Nova 9, identical in design and specs save for the main camera, which was globally released in September of 2021. Furthermore, the Honor 50 doesn’t exactly reinvent the Android phone – you might even call it ‘generic’.",
    "Not all phones need to reinvent the wheel though, and the Honor 50 certainly doesn’t, but sometimes it’s enough just to be a pretty good wheel.",
    "The Honor 50 has a screen with good contrast and punchy colors, two really useful cameras (the 108MP main and 32MP selfie snappers), and an impressively long-lasting battery. It also feels comfortable in the hand, has a well-optimized user interface, and proved powerful enough for most of our gaming needs.",
    "Indeed, we found little wrong with the phone in our time testing it, other than its temperamental always-on display, which sometimes just didn’t work, two unnecessary rear cameras, and the absence of a headphone jack.",
    "This review feels lukewarm, but it certainly isn’t a negative one: this is a good Android phone that won’t disappoint you. But with so many rivals at the same price point, is that enough?",
    "The real issue with the Honor 50 – a flaw that’s certainly not exclusive to this device – is that it doesn’t do enough to distinguish itself from the crowd. With so many competitive mid-range mobiles on the market nowadays, the phone doesn’t have any unique selling points or strengths that make it easy to recommend. It’s a jack of all trades, but a master of none.",
    "After an initial unveiling in mid-July, the Honor 50 was officially launched for the global market in late October, and went on sale on November 12.",
    "The handset comes in two variants: the 6GB RAM and 128GB storage version costs £449 (roughly $620, AU$820) but you can also get 8GB RAM and 258GB storage for £529 ($710, AU$960) – that’s a big price difference, so unless you absolutely need the extra storage space or RAM, we’d recommend sticking with the less expensive model.",
    "That price puts the phone in the more affordable end of the mid-range market, but squarely among similarly-priced rivals with competitive selling points, like the Realme GT or OnePlus Nord 2, that received very high review scores from us.",
    "The Honor 50 is curiously similar in terms of design to the Huawei Nova 9, right down to the dimensions, weight and rear camera design. The companies may have divorced, but it’s apparent they’re not quite over each other just yet.",
    "The device measures 160 x 73.8 x 7.8mm and is quite light, weighing in at just 175g. The curved screen makes the device comfortable to hold in the hand, but the subtle angling at the sides of this phone minimizes accidental touches on the edge of the display. The easy-to-reach power button on the right edge is an added bonus.",
    "The phone has a USB-C port, used for charging as well as data transfers, but no 3.5mm headphone jack. Sorry, fans of wired audio – you’ll have to use wireless headphones, or get a USB-C adaptor.",
    "You can buy the phone in black, silver and green versions, though the latter looks gray under certain lighting. There’s also a special pearlescent version with the letters from Honor’s name plastered over the back – this model might be a bit of an acquired taste.",
    "The back of the phone has the camera bump, which consists of two circles – the top one houses the main camera lens and the lower one contains the three other lenses as well as the flash module. These bumps aren’t too obtrusive, but they stick out enough to make the phone wobble if laid flat on a surface.",
    "The mobile doesn’t have an IP rating, and on the FAQ section of its website, Honor states “the Honor 50 does not support water or dust resistance”, so it’s best to avoid dropping the phone in water, and put it in a case to protect it from dirt or dust.",
    "We’re fans of the Honor 50 display. It’s a 6.57-inch OLED panel with a FHD+ resolution, 120Hz refresh rate and 300Hz touch input rate. The display curves at the edges and is broken up by a cut-out for the front camera at the center of the top edge.",
    "Those are some average specs for a phone of this price, but when the average display is so good-looking, that’s no bad thing. The display is punchy, with bold colors and a commendable max brightness, and it made games and streamed videos look good.",
    "Some people love high refresh rates and others aren’t as impressed; we’d recommend the latter group test the Honor 50, because motion seemed even smoother on the phone than on other 120Hz displays. It seems the software animation in the user interface was designed to complement this high rate.",
    "One display issue we encountered was with the always-on display, a feature that didn’t always work. We couldn’t fathom why it would work sometimes and not at other times – phones with AODs customarily turn it off when the device is face down, since you wouldn’t be able to see it, but that wasn’t our experience with the Honor 50.",
    "We mentioned this issue in our initial hands-on review of the Honor 50, but after several more weeks testing the phone, we still have no clear understanding of what is going on.",
    "The Honor 50 might have four rear cameras, but while the main camera is pretty good, elsewhere it’s a case of quality over quantity.",
    "The main snapper has a 108MP sensor, and takes photos using 9-to-1 pixel binning, which means the camera combines every nine pixels into one giant one. This enables the sensor to ‘see’ lots of light, and produces final images that are 12MP.",
    "We found that photos taken with this main camera looked bold and bright, even in low-light settings, which isn’t something we can say about all 108MP camera phones. Autofocus is quick, and the natural-looking depth effect makes close-up pictures look even better.",
    "As mentioned, the main camera performs pretty well in low-light conditions, and we took some good snaps of fires and fireworks that weren’t as blown-out or obscured as similar images have been on other phones we’ve used.",
    "This isn’t the cheapest 108MP phone – not with the Realme 8 Pro and Xiaomi’s Redmi Note 10 Pro on the market – but Honor’s scene optimization AI means the Honor 50 could be one of the best with a high-res sensor.",
    "But now onto the lesser lenses, the 8MP ultra-wide, 2MP depth-sensing and 2MP macro snappers. The former is useful for taking snaps with a wide field of view, but pictures aren’t quite as colorful or high-res as those produced by the main snapper.",
    "The 2MP cameras are the real weak links though, and there’s a trend of phone companies including low-res auxiliary cameras like this that don’t add much. We found macro pictures to be grainy and pixelated, and the depth sensor didn’t seem to add anything that wasn’t already present in the standard lens view.",
    "The lack of a competitive edge is particularly noticeable in the Honor 50’s camera options – if its 2MP duo were replaced by a Xiaomi-style bespoke macro camera, or even a telephoto snapper, the phone would be far easier to recommend for its photographic abilities.",
    "If there’s one thing about the Honor 50’s camera capabilities we’re excited to talk about, it’s the 32MP selfie snapper. Subjects look bold with boosted highlights and shadows, and natural-looking depth effects make photos look great.",
    "Selfies look good even in low-light conditions, and we particularly like how the Portrait mode’s tweaks don't ruin the natural look of skin and hair, as they often do on other phones.",
    "Video recording goes up to 4K at 30fps or 1080p at 60fps – that’s basically the same as on every other Snapdragon 778G phone. You probably don’t need better performance, unless you’re a professional videographer.",
    "Some of the other modes worth pointing out are multi-video, which lets you record simultaneously from a combination of the front and back cameras; aperture, which is a spin on the ‘Portrait’-style mode but designed for objects (as it lets you manually change the aperture to control the depth of field); and story, which lets you shoot multiple short video snippets and then edit them together with music.",
    "Lots of these modes are worth playing around with, but we didn’t find ourselves using them for our day-to-day videography or photography.",
    "The Honor 50 boasts a Snapdragon 778G chipset, which is one of the more powerful mid-range processors you’ll find in a smartphone. Still, this chipset can’t hold a candle to processors from the Snapdragon 800 series.",
    "You can choose 6GB, 8GB or 12GB RAM – we tested the 6GB – and either 128GB or 256GB storage.",
    "This is a 5G phone, and while it’s certainly not the cheapest mobile available with this next-gen connectivity, it’s still relatively affordable and could prove a good option for those looking for low-cost 5G.",
    "We found the Honor 50 felt snappy, and in day-to-day use, we couldn’t tell the difference between this phone and one with a top-end chipset. Basic tasks like navigating the user interface, checking social media and downloading apps all feel smooth and quick.",
    "Jumping into high-end games, we could sometimes tell we weren’t playing on a top-end chipset. Now and then the phone displayed stutters or lags, particularly in busy moments, like when the phone had to simultaneously load multiple moving parts. Still, we found this problem occurred infrequently. It cropped up now and then in intensive firefights in Call of Duty: Mobile, but depending on what you play, you might not have any issues. We won’t mark the phone down for it, since the overall gaming performance was decent.",
    "The Honor 50’s speakers are… okay. They sound a bit average for phone speakers, getting a bit tinny when turned to high volumes, but they’re suitable for phone calls and the like.",
    "The software here is Android 11 with Honor’s Magic UI laid over the top – and yes, rest assured, Google apps are available on the mobile, including Maps, Pay and the Play Store.",
    "Compared to stock Android, and in fact many other user interfaces phone makers incorporate, Magic UI looks rather cartoonish – the colors in icons and menus are punchy and bright, and the icons are big. We suspect users will either really like or strongly dislike the way the mobile looks.",
    "But looks are one thing, and performance is another. There’s something a little bit… well, magic, about Magic UI.",
    "As detailed in other sections, the software works hard to optimize the performance of this phone. We were dazzled by the animation complementing the 120Hz display. Additionally, we could actively prolong the phone’s battery life by attending to notifications warning us about power-intensive apps.",
    "If there’s one major issue with Magic UI, it’s that it lacks some of the extras found in other competitor devices. These days, different mobiles allow you to customize features like your always-on display, screen hue, and audio settings. In comparison, Magic UI feels a little restrictive in its options.",
    "One of our favorite aspects of the Honor 50 is its battery life. We were easily able to get through a day without a charge, whether we were just checking the ‘Gram now and then, playing loads of games, or streaming hours of music or Netflix.",
    "We’d estimate that the device has a day-and-a-half of battery life, which is impressive, because on paper, its 4,300mAh power pack isn’t huge. There are likely some software optimizations behind the scenes that economize the juice – with standard daily usage, we would only go through about 65-70% of charge in a day.",
    "Charging is done at 66W, which is fairly fast for a mid-range phone, though certainly not the speediest. At that speed it took roughly 40 minutes to power up the device to full.",
    "There’s no wireless powering here, which is one big difference between the Honor 50 and the Huawei Nova 9, but at this price point, cabled powering is all you’d really expect."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Honor 50 price and availability",
    "12": "Design",
    "18": "Display",
    "23": "Cameras",
    "36": "Performance and specs",
    "42": "Software",
    "47": "Battery life",
    "51": "Don't buy it if..."
  },
  "links": {
    "Honor 20": "https://www.techradar.com/reviews/honor-20-review",
    "company-wide ban": "https://www.techradar.com/news/huawei-ban",
    "Honor Magic 3": "https://www.techradar.com/news/honor-magic-3-is-basically-a-huawei-phone-but-with-google-apps",
    "Huawei Nova 9": "https://www.techradar.com/news/huawei-nova-9-announced-as-a-pixel-6-rival-with-two-big-issues",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "Realme 8 Pro": "https://www.techradar.com/reviews/realme-8-pro",
    "Xiaomi’s Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro"
  }
}