{
  "source": "https://www.techradar.com/reviews/moto-g-pure",
  "title": "Moto G Pure review",
  "category": "phones",
  "updated": "2021-11-01T13:42:43Z",
  "author": "mark-knapp",
  "summary": "Pure doesn’t mean power or perfection",
  "verdict": "The Moto G Pure is a phone very few should consider getting. It may be cheap, but it comes with such a performance penalty that it’s hard to use, and that’s a tough spot to be in when just a little more money can make for a major improvement in capabilities.",
  "pros": [
    "Cheap as they come",
    "Spacious screen",
    "Long-lasting battery"
  ],
  "cons": [
    "Generally bad performance",
    "Tiny storage",
    "Camera lag"
  ],
  "article": [
    "The Moto G Pure has an incredibly enticing price tag. At $159 (around £115 / AU$210), it’s coming at about as low a price as you’ll find a mainstream smartphone from a well-known brand. But in spite of Motorola’s prowess for making high-value smartphones that come in at a low price, the Moto G Pure is a dud.",
    "The phone has a neat-looking design that actually makes it easy to get over its plastic construction. It feels and looks good in the hand. The display is big, but it’s of a pretty low caliber with visibility easily impacted just by slightly changing the viewing angle.",
    "Beyond the big screen, all the phone has to offer is a big battery. That helps it last when you’re away from a charger, and can last multiple days if your uses of the phone are particularly light. That said, you may find yourself spending more time using the phone than you’d expect because of its slow performance.",
    "Regular tasks on the Moto G Pure are punctuated by extended delays, slow responsiveness, and just general hiccups. There’s just not a lot of muscle inside this phone.",
    "That weakness unfortunately holds back what could have otherwise been a decent enough camera for the price. While the Moto G Pure’s main camera can snap a pretty photo, it’s exceedingly tricky to do since there’s an unavoidable lag between pressing the shutter and the camera actually capturing a photo.",
    "There may not be a lot of other new phones that’ll undercut this one on price, but we’d hands-down opt to go with the $199 Moto G Fast (2020), Moto G9 Play or a refurbished Moto G Power (2020) for about $187 and benefit from the extra performance and cameras those phones can deliver. A small bump up can also land something even more worthy, like the TCL 20S, a $250 (around £180 / AU$345) phone that easily justifies that extra expensive with a bigger, better screen, a ton more storage, more speed, more memory, a bigger battery, and a better design, though the TCL 10L might also do the trick. All the better if you can snag an even higher-end phone second-hand or refurbished.",
    "The Moto G Pure is available in the US as of October 7 for $159 (around £115 / AU$210). It’s on sale in the US from carriers, Best Buy, Walmart, B&H, Amazon, and directly from Motorola, and there are no plans to sell it outside the US.",
    "The Moto G Pure has a design far better than expected for its price point. An elegant, wavy texture on the back makes it easy to ignore its plastic construction because it just feels pleasant in the hand. And the hard frame of the phone doesn’t feel cheap either. It has a modern look to it right down to the vertical camera stack.",
    "Motorola even works in a large display, but it's when the display lights up that the budget nature of the device shows. It has narrow bezels on the sides, but the chin bezel is monstrous for 2021, and the teardrop camera cutout has had some serious staying power on Motorola’s phones.",
    "The phone’s large size does require some juggling to use, but it’s not too heavy or wide for comfortable use. Motorola could have put the rear fingerprint scanner a bit lower or used a side-mounted one to make it easier to unlock and go straight into using it, though.",
    "Motorola conveniently includes a microSD slot to boost the phone’s paltry 32GB of built-in storage, and you can still use this phone with wired headphones thanks to its 3.5mm jack. Motorola even went as far as to get this phone a proper IP52 rating to withstand splashes, spills, and rain — no submersion, though — instead of just calling it water-repellant and leaving us to wonder just what that actually specifies.",
    "The LCD screen is really the only regrettable part of the design. It’s large, at 6.5 inches, and its 1600 x 720 resolution may not be the sharpest but isn’t so overly stretched that it's easy to pick out pixels. The problem stems from the quality of the panel, which doesn’t look as appealing when viewed at even a slight angle, losing considerable brightness.",
    "The Moto G Pure’s camera system doesn’t have a lot going for it. It may present itself like a three-camera system, but one of those slots is just a flash, and the second camera on the rear is a depth sensor that doesn’t offer the same versatility of an ultra-wide or telephoto camera.",
    "The 13MP main camera manages a decent amount of clarity in each shot. The color in photos is a bit subdued, but not bland. And, as long as there’s plenty of light, it can actually take pleasant-looking photos. The phone’s struggle to actually take a picture when the shutter button is pressed presents serious challenges, though.",
    "The selfie camera is also reasonably sharp. Surprisingly, it even pulls out some finer detail in shots, such as individual hairs — something that can often turn into something of a blur.",
    "The dynamic range the phone’s cameras are capable of is limited though. There’s no magic on board to make a backlit subject show up clearly without blowing out the background.",
    "Where the Moto G Pure really falters is in performance. It is simply hamstrung by one of the weakest performing chipsets we’ve seen recently.",
    "Our GeekBench 5 results see the MediaTek Helio G25 chip inside the Moto G Pure earn a dismal 496 points, which trails well behind a ton of other budget phones. And, while benchmarks don’t always translate into real-world performance, they do in this case.",
    "The phone has consistent delays in responsiveness and is slow to launch apps. The fact it comes running Android 11 could have been a boon (many budget phones still haven’t gotten the upgrade) if the phone wasn’t too slow to reliably run it. This makes regular use tedious.",
    "While it can still perform the tasks of sending texts, making calls, and browsing the web, it doesn’t make them a breeze. We even experienced some apps simply crashing at launch instead of loading — not exactly behavior we want from a brand-new phone when we’re simply trying to open up Google Maps.",
    "The worst of the performance rears its head doing one of the more demanding yet mundane things we all do with our phones: using the cameras. The Moto G Pure takes a solid 3-4 seconds to launch the camera app — so much for reacting to the moment. Worse still, after we press the shutter button, the phone invariably waits a full second before capturing. Subjects move, moments pass, and the camera fails to get them. We feel like we have to be wizards to snag anything but stationary objects.",
    "In our battery test, the phone managed to only drain 7% over the course of a 90-minute video playback at 50% brightness, so you’ll easily get a full day out of this phone even if you’re interspersing a few episodes of your favorite shows.",
    "You can even stretch to couple of days if you’re mostly just responding to the occasional call or text. It’s one of the few performance areas that holds up.",
    "Your needs are very basic Texting and calling on the Moto G Pure isn’t going to run into the same issues as more extensive use, and you won’t find a smartphone much cheaper than this.",
    "You need the extra screen The larger screen will let you see more and have a larger user interface, which can be helpful if you have bigger hands or more difficulty seeing small fonts and interface elements.",
    "You don’t get around to charging often The battery on the Moto G Pure can hold up for a good while, especially if you’re not using the phone frequently — helpful whether you’re on the go or just forgetful.",
    "You’re a photography fiend The cameras can take an OK picture, but they have a really hard time keeping up, with delays in opening the app and taking photos. That sluggishness makes them a pain to use and liable to miss the best moments.",
    "You want a modern device The phone may look nice, but it’s screen is dated, it doesn’t have access to 5G networks, and even its Wi-Fi 5 connection is behind the times.",
    "You can get a good second-hand phone Buying used and refurbished isn’t always enticing, but you should be able to get a dramatically better phone for a similar price by going with one that’s a generation or two older.",
    "First reviewed: October 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Moto G Pure release date and price",
    "7": "Design and display",
    "12": "Cameras",
    "16": "Performance and battery life",
    "23": "Buy it if...",
    "26": "Don't buy it if..."
  },
  "links": {
    "Moto G9 Play": "https://www.techradar.com/reviews/moto-g9-play",
    "TCL 20S": "https://www.techradar.com/reviews/tcl-20s"
  }
}