{
  "source": "https://www.techradar.com/reviews/wemo-wifi-smart-plug",
  "title": "Wemo WiFi smart plug review",
  "category": "smart-home",
  "updated": "2021-07-05T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "A HomeKit-compatible smart plug that’s compact in size and easy to use",
  "verdict": "The Wemo WiFi smart plug is an affordable HomeKit-compatible smart plug that offers additional voice-integration support in the US. It’s simple to set up and comes with handy features such as schedules and an Away mode, but it lacks energy monitoring.",
  "pros": [
    "Compact smart plug",
    "Easy to use",
    "HomeKit integration"
  ],
  "cons": [
    "No energy monitoring",
    "Integration with voice assistants differs per territory"
  ],
  "article": [
    "Belkin is a name more familiar with smartphone and computing peripherals, even though it’s been manufacturing some of the best smart home devices under the Wemo brand since 2012. The Wemo WiFi smart plug is the brand’s latest launch in the smart home space, and has recently been extended to the UK and Europe, after initially only being available in the US. The Wemo WiFi smart plug is a single socket that can be plugged into a power outlet and controlled using Wemo’s own app, Apple’s Home app or Siri – although those in the US also benefit from Alexa and Google Assistant support.",
    "As well as switching the socket on and off from the app, you can set schedules so it turns on or off automatically, or engage the Away mode – which randomizes the times at which the smart plug switches on and off – to simulate occupancy.",
    "It can also be used in home automations that see several smart home devices controlled at once, although in the UK – or in the US, if you’re using HomeKit – to control the smart plug when you’re not at home, you’ll need a HomePod Mini or Apple TV 4K to act as a smart home hub.",
    "For those deeply tied into Apple’s ecosystem, or starting to use HomeKit to power their smart home, the Wemo WiFi is the most affordable smart plug on the market right now.",
    "The Wemo WiFi smart plug is priced at $24.99 / £24.99 and is available in the US and UK from Belkin. In the UK, you can also pick it up from the Apple Store. In the US, it’s available from Amazon.",
    "The Wemo WiFi smart plug is similar to the majority of smart plugs on the market looks-wise: it sports a simple, inoffensive all-white design. In the US, the smart plug has a horizontal design that measures 1.81 x 2.05 x 1.34 inches / 3 x 5.2 x 3.4cm, while the UK variant is a compact square shape, measuring 2.4 x 2.4 x 2.8 inches / 6 x 6 x 7cm.",
    "The front of the smart plug has a single socket, with a manual power button and an LED that illuminates white when the plug is switched on, or alternates between white and orange when the plug is in set-up mode.",
    "The Wemo WiFi smart plug is easy to set up, whether through HomeKit or Wemo’s own app – although scanning the QR code to set up the device using the former is slightly quicker than using Wemo’s own app.",
    "Once the smart plug is connected to a Wi-Fi network, it can be assigned to a particular room or group of devices. On test, we found the plug switched on and off instantly through the app or Siri, sounding a reassuring click in the process.",
    "However, if you’re using the smart plug with HomeKit, as mentioned already, you’ll need an Apple TV 4K or HomePod Mini in order to instruct the smart plug while you’re out.",
    "Both Apple’s Home app and Wemo’s app are easy to use, which makes controlling the smart home plug a doddle, no matter the app you choose.",
    "As soon as you launch the Wemo app, you’ll be presented with a list of Wemo devices installed in your home. These devices can instantly be switched on or off using the Power button icon on the right. However, in Apple’s Home app, if you assign the smart plug to a particular room, it will be displayed on this tab. Otherwise, you’ll find it on the main home screen – again, you simply tap to turn it on or off.",
    "The Wemo app has a Rules tab where you can set a schedule or activate Away mode, while the Apple Home app has an Automations tab where you can set schedules – but, unfortunately, you can’t activate the Away mode.",
    "In the US, the smart plug also integrates with Amazon Alexa and Google Assistant.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Wemo WiFi smart plug price and availability",
    "5": "Design",
    "7": "Performance",
    "10": "App",
    "14": "Don't buy it if..."
  },
  "links": {
    "best smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "smart plug": "https://www.techradar.com/news/best-smart-plugs-and-switches"
  }
}