{
  "source": "https://www.techradar.com/reviews/intel-core-i9-11900k",
  "title": "Intel Core i9-11900K review",
  "category": "computing",
  "updated": "2021-10-22T20:09:23Z",
  "author": "jackie-thomas",
  "summary": "Is this Intel’s return to form?",
  "verdict": "The Intel Core i9-11900K is a fine processor, but with so many amazing chips on the market right now, there’s simply no reason to go with this processor, when you can get better performance for less cash elsewhere.",
  "pros": [
    "Great gaming performance",
    "PCIe 4.0 support"
  ],
  "cons": [
    "Lackluster multi-threaded performance",
    "Expensive",
    "Gets hot",
    "High power consumption"
  ],
  "article": [
    "It’s disappointing that the Intel Core i9-11900K isn’t a bigger update. It, along with the rest of the 11th-gen CPUs, seem like minor refreshes to hold us over until something special comes along. That’s not to say that it isn’t a powerful desktop chip. It is and it can handle just about anything you want it to. With that said, it’s not a product that’s going to keep Intel relevant in an increasingly competitive market, especially with such impressive processors like the AMD Ryzen 9 5900X available.",
    "It’s no wonder considering that the Intel Core i9-11900K takes 10nm Ice Lake architecture and backports it to a 14nm process, for a more limited 8-core, 16-thread design. While it does have exceptional single-core performance, it just can’t keep up with the competition when multi-core processes enter the picture. That means this CPU is in a strange position in the market, as it’s not worth the price for anyone except gamers. Particularly, with Intel’s 12th-generation Alder Lake-S processors supposedly around the corner, rumored to arrive as soon as November 2021 with promises to crush AMD’s best in new leaked benchmarks.",
    "There’s just not a lot to be excited about with the 11900K compared to other CPUs, especially since plenty of other processors can do better.",
    "The Intel Core i9-11900K will be available March 30, with a suggested retail price of $539 (about £390, AU$710). That price positions this processor as a direct replacement for the Intel Core i9-10900K and a competitor to the AMD Ryzen 9 5900X.",
    "Intel’s processors have seemed to elude the recent availability problems faced by graphics cards and AMD processors recently, so we’re not sure if the prices will go up much higher.",
    "However, when prices do get back to normal across the industry, the Intel Core i9-11900K doesn’t look particularly great when put up against the AMD Ryzen 9 5900X, or even the much cheaper $449 (£419, AU$799) AMD Ryzen 7 5800X. Intel does rack up some wins in some single-threaded applications and games. But when you’re willing to spend nearly a thousand bucks on just your CPU and motherboard, it’s unlikely that you’ll just be using your computer to play some Overwatch.",
    "For folks that are looking to get in on some creative applications without jumping to an HEDT (high end desktop) platform, you’re probably going to want to look elsewhere.",
    "Like every other desktop platform launched since Skylake back in 2015, the Intel Core i9-11900K is based on the Rocket Lake-S architecture – which is manufactured on a 14nm process. However, unlike Comet Lake, Kaby Lake and Coffee Lake before it, this isn’t just another iteration of Skylake itself.",
    "Rather, Intel took the core design of its 10nm Ice Lake processors, which are primarily found in laptops, and backported it to the 14nm manufacturing process. Intel claims that this lets it push clock speeds higher than its 10nm process would allow, which is important for gaming. However, when combined with the Intel Xe graphics present on the die, there is less room on the chip for CPU cores, which means that the Intel Core i9-11900K has just 8 CPU cores, down from the 10-core design of the Intel Core i9-10900K.",
    "That sounds bad, but this new Cypress Cove core does allow Intel to not only push clock speeds slightly higher – up to 5.3GHz on a single core – but also allows for a pretty substantial 19% boost in Instructions Per Cycle (IPC) performance.",
    "However, it looks like a pretty big part of the improvement that comes with Cypress Cove results in higher power consumption and, with it, higher temperatures.",
    "During heavy workloads, particularly those like Blender, the Intel Core i9-11900K can reach up to a whopping 203W of power consumption, and that’s with disabling the Multi-Core enhancement that the Asus ROG Maximus XIII Hero enabled by default. Having that option enabled pushed power consumption all the way up to around 230W, which is more than a lot of modern graphics cards will use.",
    "With power consumption this high, temperatures can also jump up considerably. With all stock settings, the Intel Core i9-11900K can reach up to 82°C, a pretty considerable jump over the 76°C that the Intel Core i9-10900K reaches under the same conditions. We’re not using a lightweight CPU cooler either – this is with a 360mm AIO cooler, so if you’re thinking about grabbing this processor, consider grabbing a robust cooler as well.",
    "It doesn’t look too good, either, that the Intel Core i9-11900K arrives just weeks after Team Blue discontinued its CPU overclocking warranty. We typically don’t cover overclocking in our reviews, as it still voids your warranty, but with these processors consuming more power and spitting out more heat than ever before, overclocking is going to be even more difficult.",
    "If you’ve been lucky enough to get your hands on a power-hungry graphics card, like the RTX 3090 and you were hoping to pair it with this processor, it’s probably a good idea to make sure you have a power supply that can handle the load.",
    "It’s not all bad, though. With the Intel Core i9-11900K, Intel has finally worked in PCIe 4.0 support, which means you will be able to use the best SSDs on the market. Even some Z490 boards will be able to use this functionality, but you’re going to want to check your motherboard’s manufacturer’s website to see if it’s supported.",
    "Don’t get us wrong, the Intel Core i9-11900K is a fine processor. No matter what test we threw at the little chunk of silicon, it was able handle it quickly and efficiently. Gaming, content creation and even just messing around on the desktop are all extremely quick, but it’s essentially the same experience you’ll get anywhere these days. We’re lucky enough to be living in a time where pretty much any desktop processor will be more than enough for what most people are going to need. The differences, then, lie in how quickly things get done.",
    "And when you’re going to be spending this much on a processor, you’re likely going to be using it for a multitude of different things, and when it comes to creative workloads, the Intel Core i9-11900K starts to seriously fall behind its main competition, the AMD Ryzen 9 5900X.",
    "In Blender, the 12-core AMD Ryzen 9 5900X is a whopping 58% faster than the Intel Core i9-11900K, while costing just 2% more. Likewise, in the Puget Adobe Premiere benchmark, the Core i9-11900K was 13% slower. Which means that both with 3D modeling and video editing, the Intel Core i9-11900K is significantly slower than the competition.",
    "Things look a little better when we start to look at gaming benchmarks, which is where Intel is focusing all of its marketing this time around. In the 3DMark Time Spy test, the Intel Core i9-11900K managed a CPU score of 13,301 over the Ryzen 9 5900X’s 12,163, a 9% boost.",
    "When we look at actual games, though, it’s pretty much a wash. We tested Total War: Three Kingdoms and Metro Exodus, both at 1080p low settings and paired with an Nvidia GeForce RTX 3090, so that as much of the workload is pushed to the processor as possible. And, well, the Intel Core i9-11900K and the Ryzen 9 5900X are nearly identical in these tests.",
    "There is a more noticeable difference over older processors, though. For instance, the Intel Core i9-11900K was about 7% faster than the Intel Core i9-10900K in Total War. That’s probably not enough to convince anyone to upgrade from the 10900K, but it is movement in the right direction.",
    "But even that isn’t the case across the board. The 11900K’s loss of two cores means that in heavily threaded applications like Blender or Adobe Premiere, 2020’s Intel Core i9-10900K is noticeably faster than the brand new chip.",
    "Even more damning is that the Intel core i9-11900K is significantly slower than the AMD Ryzen 7 5800X, a processor that costs nearly a hundred bucks less. AMD’s 8 core champion topples the 11900K in both gaming and content creation, only losing to team blue in purely synthetic single-core benchmarks.",
    "While AMD continues to release significantly faster processors year after year, the Intel Core i9-11900K shows just how far behind Intel is, and feels like a desperate attempt to hold on to relevance while the company works on its true next step. We just wish Intel skipped this generation and came back to deliver something truly valuable with its 12th-generation processors. Hopefully we don’t have to wait long to see what it has to offer.",
    "Originally published in March 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and availability",
    "7": "Chipset and features",
    "16": "Benchmarks and performance",
    "25": "Don’t buy it if…"
  },
  "links": {
    "processors": "https://www.techradar.com/news/best-processors",
    "AMD Ryzen 9 5900X": "https://www.techradar.com/reviews/amd-ryzen-9-5900x",
    "arrive as soon as November 2021": "https://www.techradar.com/news/intel-alder-lake-cpus-could-go-on-sale-november-19",
    "crush AMD’s best in new leaked benchmarks": "https://www.techradar.com/news/intel-core-i9-12900k-crushes-amds-best-in-new-leaked-benchmarks",
    "CPU overclocking warranty": "https://www.techradar.com/news/intel-scraps-insurance-plans-for-cpu-overclockers-and-the-reason-might-surprise-you",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "best SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds"
  }
}