{
  "source": "https://www.techradar.com/reviews/netgear-meural-wi-fi-photo-frame",
  "title": "Netgear Meural Wi-Fi Photo Frame review",
  "category": "cameras",
  "updated": "2021-11-18T22:09:33Z",
  "author": "andrew-williams",
  "summary": "A large, matt-finish photo frame for photographs and art",
  "verdict": "A photo frame that can also turn into a miniature art gallery, although the pickier among you may wish it had a higher resolution display and deeper color reproduction.",
  "pros": [
    "Large display area",
    "Matte screen great for photos",
    "Useful optional art subscription"
  ],
  "cons": [
    "16:9 aspect ratio",
    "Average color depth",
    "Some pixellation if you look closely",
    "Awkward control gestures"
  ],
  "article": [
    "The Netgear Meural is a 15.6-inch photo frame with two sides to its personality. For most of us it’s, well, a digital photo frame. You use the companion app to send your holiday and family photos to the display.",
    "However, if you want to impress friends and dates with your cultural clout you can use the Netgear Meural as a miniature art gallery. While any photo frame can display JPEG files of famous works of art, the Netgear app has a huge selection of well-known pieces.",
    "You can try out around 100 for free or get access to around 30,000 with a Netflix-like $8.95 / £8.99 a month subscription. Other pieces are only available as paid downloads, at a substantial cost given you’re paying to stream a 1080p image to your screen, but we doubt too many Meural owners will dig into this side too much.",
    "The key success of the Netgear Meural is that it makes photos look more paper-like than they would appear on, for example, a tablet. It has a matte screen surface, a wide viewing angle and the display brightness changes automatically to suit the conditions in the room.",
    "However, the screen part itself could be better considering the fairly high cost of the display. The resolution is only 1080p, which doesn’t hold up that well if you want to look at photos or art works up close, and its color reproduction is a little limited, leading to slightly sallow-looking deep reds.",
    "These minor image issues don’t matter too much if you’re going to treat the Netgear Meural like a casual piece of techy living room furniture, though, and the display is certainly large.",
    "One of the key jobs of a dedicated photo frame is to differentiate itself from one of the many smart displays you can buy today. Like most frames, the Netgear Meural starts this effort off by not going down the usual tech route of slimming down the screen border.",
    "It’s a 'frame', so the frame part stays. The Netgear Meural’s screen border is a raised chunk of grey plastic, while some wood effect panelling sits around its sides.",
    "Don’t mistake this for real wood, though. It’s a printed wood effect, which you can see when you get up close to it.",
    "The stand is perhaps the most striking part of the Netgear Meural. It’s a thick loop of metal that lets the photo frame sit either in landscape or portrait orientation. There’s no tweaking of the angle beyond this, though, and you’ll need a decent amount of clearance behind the frame itself as it extends back by around 16cm, for stability.",
    "This is a large photo frame, but that’s kinda obvious. It has a 15.6-inch screen, not one the equivalent of a 6x4-inch print.",
    "The screen itself is good in most respects, but not all. It has a matte surface, which is the key to making images appear more paper-like than the reproduction you’d see in a tablet or smart display.",
    "You can choose the brightness level manually, or have it automatically shift to suit the light in the room. Use the latter and the Netgear Meural can be set to go to 'sleep' when the lights are off. Like this you could leave it on all the time, and not drain too much power.",
    "Netgear says the Meural uses an average of 19 watts, but our power meter says it’s actually significantly lower than that. Using auto brightness in a conventionally-lit room it draws between 4-6 watts, rising to around 8 watts at maximum brightness. Left on for 16 hours a day it’ll consume around 46kWh in a year, equivalent to around $6 a year based on current average electricity costs in the US.",
    "The average owner’s use will probably be significantly less.",
    "We were not initially bowled over by the Meural’s screen, though. While we prefer it to a conventional smart display for photos or artworks, its color reproduction isn’t as rich as that of the Aura Mason Luxe we reviewed recently. Deep reds can take on a pastel, pinkish or orange tone because the panel can’t quite reach those super-saturated reds.",
    "The average resolution is actually more noticeable, though. Look remotely close and you’ll see evidence of pixellation, because the pixels in a 15.6-inch 1080p screen are actually quite large. This is perhaps more obvious in paintings rather than photos, the sharp lines of a Kandinsky painting revealing the Meural’s limits quite well. But the aliasing effect in photos of overhead power lines was clear too.",
    "This frame is a good way to show off your photos, but does it reproduce them in all their glory? Not quite. It’s also the wrong shape, a 16:9 widescreen aspect, if you shoot with a DSLR or mirrorless camera rather than a phone.",
    "Here’s how the photo frame works behind the scenes. The Netgear Meural uses the Meural app to get photos. There are 'Discover' and 'Browse' tabs for Netgear’s library of art works and, the one we’re more interested in, an 'Upload' tab that lets you send your photos to the frame.",
    "The Meural has 4GB of internal storage for images, and if you get the art membership it includes an extra 16GB of cloud storage. And beyond that point you’re looking at a photo library so big you’ll barely ever see some of the images.",
    "That said, photos can be split into playlists – albums, basically – so you’re not left with one massive endlessly rotating stack of images. You can choose how long photos stay on-screen, and set schedules. You’re most likely to use these to tell the Meural to sleep or wake at certain times of the day, but they can also make it play a specific album/playlist, or a random one.",
    "The Netgear Meural works best when left to do its thing, because the on-frame controls are a little wonky. It uses 'gesture' sensors on the top and sides rather than a touchscreen, and these don’t react to touch but by waving your hand just above the frame. They work most of the time, but feel clunky for doing anything more than flicking to the next photo in the current series.",
    "Annoying? Sure. But it was always going to be easier to control the Meural with your phone anyway."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Design and power consumption",
    "18": "Software and how it works",
    "23": "Don't buy it if..."
  },
  "links": {}
}