{
  "source": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
  "title": "Google Pixel 6 Pro review",
  "category": "phones",
  "updated": "2021-11-05T14:20:03Z",
  "author": "james-peckham",
  "summary": "The first top-tier Google Pixel phone",
  "verdict": "The Google Pixel 6 Pro is an exciting challenger to some of the very best smartphones on the market, and it’s the first genuinely top-tier handset from the company. If you want to experience Android software in its purest form, this is the handset to buy right now. Plus, it has a beautiful screen and a superb camera – and it all comes for a price that’s a touch lower than its main competition.",
  "pros": [
    "Multitalented camera",
    "Big and beautiful screen",
    "Comes running Android 12"
  ],
  "cons": [
    "Contentious design",
    "Limited storage",
    "Average battery life"
  ],
  "article": [
    "The Google Pixel 6 Pro is the company’s first serious attempt at a top-end device that can take on the very best smartphones currently on the market, such as the Samsung Galaxy S21 Ultra, OnePlus 9 Pro and iPhone 13 Pro Max.",
    "Launched alongside the standard – and considerably cheaper – Google Pixel 6, this new Pro variant is designed to be the very best from the company, packing its new Tensor chipset and other high-end internals, a great camera setup, and a variety of other improvements.",
    "It’s also designed to be the perfect to showcase Android 12 and its future variants, and it’s safe to say that Google has nailed it with this iteration of its smartphone.",
    "The design of the Google Pixel 6 Pro is strikingly different – although it’s not unique, as it shares it with the Google Pixel 6 – with a camera band that spans the entire width of the phone and houses its powerful new camera array.",
    "It’s a look you’ll either love or hate, and Google has paired the design with some bold color choices for those who are bored of smartphones that look like small gray rectangles.",
    "Google’s display technology here is particularly impressive, and we guarantee that this will be one of the best smartphone displays you’ve ever used. It offers great picture quality, the brightness levels are consistently impressive, and it’s huge at 6.7 inches.",
    "The new Tensor chipset inside the Pixel 6 Pro is another standout feature. We’ve yet to see it deliver any significant improvements over phones that use more traditional chipsets, but it’s still easily powerful enough to boot up your favorite apps and games, and that’s what really matters.",
    "The Pixel 6 Pro’s camera setup is another highlight; it’s a versatile array that enables you to capture a wide variety of subjects in a few different ways.. The main camera’s sensor is a step up from what we’ve seen from Google before, and new software upgrades only heighten the experience.",
    "The Pixel 6 Pro’s battery life is passable – it’ll see you through a full day of typical use, but not much more. It comes with fast-charging and wireless charging technology, but neither of these are particularly impressive either.",
    "While the Pixel 6 Pro isn’t the best smartphone money can buy right now, it comes pretty close. Google has stepped up its smartphone game in the last year, and this next-gen Android headliner is its crowning achievement.",
    "A particularly strong camera, a fantastic screen and a great software experience all add up to a genuinely top-tier package. It doesn’t sport the best battery life or power, but those minor shortcomings aside, the Pixel 6 Pro finally sees Google take its place at the smartphone industry’s top table.",
    "The Google Pixel 6 Pro was officially launched on October 19 after more than a month of teasers and reveals from the company. The Pixel 6 Pro release date was for October 28 in the US, UK and Australia.",
    "The Pixel 6 Pro price starts at $899 / £849 / AU$1,299 for the model with 128GB of storage. There are other storage variants, but these are limited to certain colors and that will depend on the market you're buying the phone in.",
    "The 256GB model costs $999 / £949 / AU$1,449 while the 512GB model costs $1,099 / AU$1,599. The 512GB model isn't available in the UK, and we don't currently expect the company to bring it out at a later date.",
    "That’s a good bit more expensive than the Google Pixel 6, announced alongside the Pro, which starts at $599 / £599 / $999; but it’s remarkably cheaper than other top-end handsets, like the Samsung Galaxy S21 Ultra or the iPhone 13 Pro Max, which cost in excess of $1,100 / £1500 or AU$1,800.",
    "The Pixel 6 Pro is a relatively affordable phone compared to other top-end handsets, but it’s still one of the more expensive smartphones you can buy. You may want to look elsewhere if your budget is tighter.",
    "The Google Pixel 6 handsets look strikingly different to most current phones , with the horizontal camera strip taking up a large portion of their rears. It’s the most remarkable element of the design, and it’s an acquired taste, and something that’s certain to divide opinion.",
    "The strip juts out from the rear of the phone by some way, which is likely to put some people off – although it undeniably gives the handset a unique look. It means your phone won’t sit flat on a desk, as it’ll sit at a slight incline, although you don’t get the rocking motion that you do with phones that feature camera bumps on one side of the device.",
    "The handset is large, so you may want to opt for the standard Google Pixel 6 if you’re looking for a smaller device. It features a glass rear that’s protected by Corning Gorilla Glass Victus technology, which should ensure it’s not easily scratched.",
    "It’s also IP68 water and dust resistant, so should be able to easily survive the odd dip in water, but we wouldn’t encourage fully submerging your phone for an extended period of time.",
    "Its curved edges ensure the phone sits comfortably in your hand, although some may find it a touch slippery to hold – we found that a case mitigated that issue.",
    "On the bottom edge of the handset is the USB-C port, flanked on either side by the speakers. On the right-hand edge of the phone are the power button and the volume buttons.",
    "The color options for the Pixel 6 Pro are Sorta Sunny (yellow and gold), Cloudy White (white and gray) and Stormy Black (black and gray), although while you’ll be able to buy the 128GB variant in all three colors, the 256GB / 512GB versions are limited to certain colors.",
    "Our review model was Stormy Black, which is undeniably the least interesting finish. We particularly like the Sorta Sunny design, which makes for one of the most eye-catching smartphones you can buy in 2021.",
    "We like the design of the Google Pixel 6 Pro, and you’ll get a good idea of whether or not you’re going to like it from the photos you can see above alone.",
    "The Pixel 6 Pro has a 6.7-inch QHD+ display, which is suitably large and offers crisp picture quality – the resolution of 1440 x 3120 is a remarkable step up compared to 2020’s Pixel 5 and its 1080 x 2340 screen.",
    "We found it to be one of the sharpest-looking displays we’ve seen on a smartphone in 2021. Its 512 pixels per inch is a rarity on smartphones with QHD displays, and we’ve only seen it beaten by handsets like the Sony Xperia 1 III with its 4K screen.",
    "The screen is capable of impressive brightness levels, and we didn’t struggle to see the phone’s screen in bright sunlight. You will likely want to adjust the brightness manually on some occasions, but we found auto brightness often worked well.",
    "The display has a 120Hz refresh rate, which means the picture on the screen will refresh twice as quickly as on handsets with a ‘standard’ 60Hz screen for a smoother experience when gaming or scrolling social media feeds.",
    "This isn’t a must-have feature for many, but we enjoyed it, and it complements the impressive display quality, and you’ll notice a difference if you’re swapping from a phone with a 60Hz refresh rate.",
    "The screen also features Google’s first in-screen fingerprint scanner, although in our testing we found it a little difficult to use. The positioning is fine, but on some occasions we’d have to make several stabs with our digit before we were able to unlock the phone.",
    "After a while we got used to the placement, and where exactly we needed to put our finger, but we’d recommend setting up multiple digits, or enabling face unlock to ensure you can access your phone quickly.",
    "Google's smartphones are built around the company's camera technology, and on paper the camera setup in the Pixel 6 Pro looks like the best from the company yet, with a 50MP wide camera, a 12MP ultrawide camera and a 48MP telephoto shooter.",
    "The good news is that the company has created another powerful camera setup here, and we’ve found it to be far more versatile than on previous Pixel phones, with more options to play around with.",
    "We’ll start by talking about the camera tech, but the software here is another highlight, and something you won’t experience on any other current phones – although we might see Google roll some of these features out to older Pixel phones, while we might see other brands imitate them on future devices.",
    "The 50MP main shooter, which has an f/1.9 aperture and 1.2µm pixels is the camera you’ll likely be using the most. We found it was able to take high-res photos with good detail and true-to-life colors.",
    "It’s an impressive point-and-shoot camera, and we found that it delivered great results in a variety of scenarios.",
    "Night Sight, which enables you to get good pictures in darker settings, returns here. This is similar to the Google Pixel 5’s ability to brighten dark scenes, but you’ll need to keep the camera still for this to fully work.",
    "The telephoto camera is capable of up to 4x optical zoom, and in testing we found that it produced detailed images of distant subjects. Again you’ll need to keep the phone still for the best results, but that’s the case with all telephoto modes.",
    "If you need greater zoom range there’s also 20x digital zoom, but image quality dips pretty quickly when you use this, and noticeably so. The phone’s zoom features aren’t as high spec as far as some other top-end smartphones, but we found the Pixel 6 Pro’s zoom features were suitable for most tasks you’ll want the rear camera for.",
    "The ultrawide camera gives you a 114-degree field of view, for when you want to get more people, or more of a sweeping vista, into the frame. We found this camera also produced good results, but as expected the image quality isn’t as strong as it is with the main camera.",
    "Unless you want a particularly wide shot, you’ll be better off sticking with using the main camera here.",
    "On the front of the phone you’ll find an 11.1MP selfie camera with an f/2.2 aperture. In our testing we found that this gave us nice-looking portrait shots, good picture quality for video calls, and natural skin tones in our selfies.",
    "There’s up to 4K video recording on the selfie camera, and we think you’ll find this suitable for shots you’ll want to upload to social media and more.",
    "Camera software is a big element of the Google Pixel 6 Pro. Within the standard camera app you’ll find Night Sigh, Portrait, Panorama, Camera (the standard mode), and Video modes, plus some interesting additional options such as Motion, Photo Sphere and Lens.",
    "That Motion mode is the new element here, and that’s designed for taking long exposure shots such as creatively blurred images of moving subjects. We’ve not yet tested this much, but it’s an interesting addition that you’ll find useful in some specific scenarios.",
    "One notable software development here is called Real Tone, which is a default element of the camera, and which Google says enables the cameras to capture more natural-looking skin tones in photos of people of color. Google has worked with a number of photographers to find ways of rendering darker skin tones more accurately.",
    "Magic Eraser is another big new software upgrade, which you access through the gallery element of the app. It’s designed to let you remove subjects that you don’t want to be included in your photos – for example, photo bombers.",
    "This is all done manually (or you can tap on individual subjects yourself). Here’s an example of what we were able to do:",
    "It isn’t perfect, so don’t expect this to be able to remove all subjects that you don’t want included. But it’s useful for when you want to clean up a photo a little. It sometimes leaves some digital artifacts, so this won’t be useful for every type of photo you want to take.",
    "These software tweaks are interesting new additions for the Pixel 6 Pro, and alongside the manufacturer’s already impressive camera app and hardware, they make for the best photography experience yet on a Pixel phone.",
    "The Pixel 6 Pro is the first phone from the company to run on Google’s own silicon rather than Qualcomm’s Snapdragon chipsets. The chipset here is called Google Tensor. The thinking behind Tensor is that a processor designed and built by Google itself can be better optimized to work with the company’s phone hardware and software for a better all-round experience - and that good news is that the chip is plenty powerful, if not the most powerful on the market.",
    "In benchmarking, the Pixel 6 Pro returned an average multi-core score in Geekbench 5 of 2760. That’s some way behind the Samsung Galaxy S21 Ultra’s 3440, the OnePlus 9 Pro’s 3685 and the iPhone 13 Pro Max’s 4549.",
    "Benchmarking isn’t necessarily reflective of real-world use though, and we found the phone was capable of running all the apps and games we wanted it to. The whole experience was smooth, and it always felt like the phone had enough grunt behind it.",
    "Don’t let those benchmarking scores put you off; the Google Pixel 6 Pro is still a powerful phone, and the Tensor chipset isn’t a poor choice.",
    "The Pixel 6 Pro is disappointingly only available in 128GB or 256GB variants in the UK (a 512GB model is available elsewhere, such as the US and Australia). Considering that this is the brand’s first real attempt at a top-tier phone, with plenty of high-end specs elsewhere, we would have liked to see the option of 512GB more widely available, or even 1TB of storage for true power users.",
    "There’s also no microSD support here, which isn’t a surprise, but would have mitigated the storage issue.",
    "The Pixel 6 Pro is 5G-ready, so you’ll be able to connect to next-gen networks with this smartphone, coverage and your plan permitting. Things are a little complicated if you live in the US, but around the rest of the world any version of the Pixel 6 Pro will be ready to go straight away.",
    "If you live in the US, the 5G coverage available to you will depend on where you purchase your handset. For example, at Google’s own store you can only buy a handset that has Sub-6 5G technology.",
    "At the time of writing, buying from AT&T or Verizon will get you a version that comes with mmWave technology built-in. This is something worth investigating before you buy your handset, mmWave technology is now more prevalent in the US.",
    "Android 12 is ready and waiting for you on this handset, and it looks fantastic. If you want to experience the latest and greatest version of Google’s software, this is it in its purest form.",
    "Unlike on previous Pixel devices, this update is particularly noticeable here. With its gorgeous display, the Pixel 6 Pro is the perfect showcase for Android 12’s new Material You feature, and it's one of the true highlights of this smartphone.",
    "Material You allows you to pick your wallpaper for the device, and the colors of that wallpaper will then accent the menus around your phone. For example, your Quick Settings at the top of the phone will take on a yellow shade that’s in your wallpaper.",
    "It’s a touch gimmicky, but it’s the sort of upgrade that enables you to customize your smartphone in a distinct way for a more personalized experience.",
    "Android 12 runs well on the Pixel 6 Pro, as you’d expect. Google has also confirmed that the phone will receive three full software updates, so you should expect this handset to continue being supported through the Android 13, Android 14 and Android 15 upgrades.",
    "It will also get a minimum of five years of security updates, so expect this to be a secure smartphone experience all the way through to the end of 2026 at the very least.",
    "Battery life is one of the weaker elements of the Pixel 6 Pro, although not to the extent that it should put you off buying this smartphone. We found the battery would last for a full day of typical usage, but you may struggle to make it to the end of the day if you’re pushing your phone harder.",
    "For example, we found the phone had around 10% leftover at the end of the day when we went to charge it. This isn’t the sort of phone that is going to last you multiple days, unless you’re a particularly light user.",
    "If you’re pushing your phone harder, for example using GPS features, or shooting lots of video, you may find you need to top it up before the end of the day.",
    "The battery capacity is 4,905mAh, which seems suitable for a smartphone of this size. Google also says you’re able to eke out 48 hours of usage using its Extreme Battery Saver mode. We’ve yet to test that, and we don’t think you’ll be able to do a great deal with the smartphone in that mode, but it’ll likely come in handy in an emergency.",
    "There’s fast-charging here, although it’s not as fast as you’ll get with some other Android phones. It tops out at 30W, with the phone able to charge from zero to 50% in around 30 minutes. In our testing, we found a 30W charger was able to take the phone from zero to 20% in 15 minutes, and to 40% in 30 minutes.",
    "That’s using a charger rated for 30W, so if you want those speeds you’ll want to invest in one. There’s no charger of any description in the box, so you’ll need to use an existing USB-C charger, buy one separately, or stick to wireless charging.",
    "Wireless charging is supported up to 23W, and while we weren’t able to hit that speed during our testing, if you’ve got a compatible charging pad you should expect to be able to fully charge your phone in around an hour and a half.",
    "First reviewed: October 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Google Pixel 6 Pro release date and price",
    "16": "Design",
    "25": "Display",
    "32": "Cameras",
    "51": "Performance and specs",
    "60": "Software",
    "66": "Battery life",
    "73": "Don’t buy it if…"
  },
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Tensor chipset": "https://www.techradar.com/news/what-is-the-google-tensor-chipset",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Google Tensor": "https://www.techradar.com/news/what-is-the-google-tensor-chipset"
  }
}