{
  "source": "https://www.techradar.com/reviews/identity-guard",
  "title": "Identity Guard review",
  "category": "computing",
  "updated": "2021-03-21T09:27:43Z",
  "author": "john-brandon",
  "summary": "Identity theft protection with a free credit report, but lacking some instructional info",
  "verdict": "Identity Guard offers some unique features that go beyond what you will find with other apps. While Norton LifeLock monitors and analyzes your credit reports and alerts you about problems, Identity Guard goes the extra step of providing a monthly credit report. Unusual features like a phishing scam blocker and alerts about a tax refund are also nice. However, the website is quite slim on details and instructions, so it may be hard to know what the product actually does.",
  "pros": [
    "Includes a credit report",
    "Extra alerts are helpful"
  ],
  "cons": [
    "Slim website details"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "The more you know about your own online identity the better. It means you can monitor your credit effectively, inspect bank accounts, and become more aware of dangers. With good information, we can react to and even thwart identity theft; without good information, we might feel helpless as though there are hidden adversaries impersonating us and performing criminal acts without our knowledge. The entire field of identity theft protection depends on the information available to you and the steps required to resolve problems.",
    "Identity Guard is an app that addresses one half of the identity theft protection equation. The app includes a wide array of powerful features, including the ability to consult with an expert that can help you recover your identity. The glaring issue is that Identity Guard tends to be lighter on providing more details about how the app can help you and what it does. This starts with a website that is not extensive enough - it almost feels like it was created by a marketing company as an online brochure. In the app itself, the lack of details makes an app like Norton LifeLock much more impressive in terms of relaying what is actually happening when these tools try to protect you, assist you, and resolve identity theft problems.",
    "Unlike Norton LifeLock, the pricing plans are clearly delineated. (LifeLock has so many plans and tiers for which features you gain access to at various pricing levels that it’s like playing a poorly designed role-playing game.) Identity Guard has two main plans for individuals or families. There are three main tiers. The Value plan does not include an actual credit score - which is one of the most unique features offered here. (Some identity theft protection apps will monitor your credit but won’t actually provide the full credit score.) For the credit score, you have to upgrade to the Total plan or Premier plan. One gripe is that the website explains these features with the most expensive plan in the middle of the tiers, even though it’s costlier. It’s more common to put the most expensive plans to the far right of the tier structure.",
    "Value costs $7.50 per month and offers basic features for monitoring the Dark Web, blocking phishing scams, and alerting you about unsafe sites. Unfortunately, this is not that different from using a free blocker like the one from TunnelBear that runs in Chrome as an extension. With the Total plan, you gain access to address monitoring (someone impersonating where you live), alerts for tax refund, and credit bureau monitoring in addition to a credit score. Identity Guard includes monitoring for three credit bureaus - with similar apps such as IdentityForce, the more basic plans include monitoring for only one credit bureau. At the Premier level, you gain access to a full credit score report and social media monitoring features.",
    "Identity Guard is not the app for you if you want extensive descriptions of every feature explained in detail and an obvious dashboard that walks you through every feature. Once again, it seems like the marketing department was involved. There are notices on the website about IBM Watson and a big logo on the dashboard as a further reminder - although the paying customer might not realize that a super-intelligent mainframe is working on your behalf. IBM Watson is likely correlating some of the identity tracking information and alerting you to problems, but for the customer, what matters is that it works - not why it works.",
    "The app also emphasizes credit scores and credit monitoring, and that’s valuable in terms of identity protection. Still, there isn’t as much information about criminal activity or fraud, banking issues or credit card problems, or actual identity theft apart from the information reported through a credit agency. And, the interface doesn’t include enough tips and instructional material to guide you through the process and understand the dangers.",
    "With Identity Guard, you’re gaining access to a fairly standard set of monitoring and tracking tools, most of them geared to those who care about their credit. The one major exception to this is that the two upper level tiers include an actual credit score check, which can help you determine whether there is suspicious activity and then follow-up on it.",
    "In terms of the more basic features, the app does alert you about activity related to your bank account and other personal info. For example, if there was suspicious activity by phone where someone tried to use your bank account. The app provides consultations with experts who can guide you through any recovery or fraud remediation steps. Identity Guard doesn’t note whether these are licensed private investigators, which is the staple feature of IdentityForce.",
    "Identity Guard doesn’t provide the extensive background material of Norton LifeLock from within the app or use a dashboard that shows the progress you’ve made in protecting your online identity. Other apps like IdentityForce also do a better job of explaining features (although IdentityForce has its own set of problems in that some explanations are hard to find). The one main call-out here, though, is the actual credit score, which can be attractive to those who want to focus on the credit check aspects of identity protection - say, if you are about to purchase a home or a new car. It’s lacking some of the monitoring for criminal activity conducted in your name or when a sex offender tries to impersonate you to secure a loan.",
    "The main website for Identity Guard is the point of entry for this app, and it feels a bit rushed. The landing page (which comes up when you do a search) doesn’t even include any navigation or a way to learn about the app more. (It’s only after you delete the landing page URL that you can even access the homepage.) These glitches mean it’s hard to evaluate the features in the app or learn about them, which means you might not know how to use it or make the most of those features. While there is power within the app, especially to see your credit score, the customer is left feeling a bit in the dark about their identity protection."
  ],
  "headers": {
    "3": "Plans and pricing",
    "5": "Interface",
    "7": "Features",
    "9": "The competition",
    "10": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "Identity Guard": "https://identityguard.pxf.io/c/221109/497370/8563?subId1=trd-us-1074565678242706000&sharedId=trd-us&u=https%3A%2F%2Fwww.identityguard.com%2F",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "Value plan": "https://identityguard.pxf.io/c/221109/497370/8563?subId1=trd-us-2763125615498755600&sharedId=trd-us&u=https%3A%2F%2Fwww.identityguard.com%2F",
    "Total plan": "https://identityguard.pxf.io/c/221109/497370/8563?subId1=trd-us-4224157596577072600&sharedId=trd-us&u=https%3A%2F%2Fwww.identityguard.com%2F",
    "Premier plan": "https://identityguard.pxf.io/c/221109/497370/8563?subId1=trd-us-6110084967218543000&sharedId=trd-us&u=https%3A%2F%2Fwww.identityguard.com%2F",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn",
    "IBM Watson": "https://www.techradar.com/news/ibm-watson-can-answer-all-your-coronavirus-questions",
    "IdentityForce": "https://www.techradar.com/reviews/identityforce"
  }
}