{
  "source": "https://www.techradar.com/reviews/microsoft-teams-phone-system-review",
  "title": "Microsoft Teams Phone System review",
  "category": "computing",
  "updated": "2021-08-25T16:22:28Z",
  "author": "danielle-jones",
  "summary": "The addition of VoIP takes Microsoft Teams to a truly unified communications platform",
  "verdict": "Microsoft Teams Phone System is a robust platform that enables an easy transition from PBX telephony to VoIP and consolidates communication into a single hub.",
  "pros": [
    "Easy setup",
    "No ongoing upgrade cost"
  ],
  "cons": [
    "Lack of 24/7 support",
    "Limitations for more complex business requirements"
  ],
  "article": [
    "If a business relies on receiving incoming customer phone calls or maintaining team communication between different locations, then ensuring that you have a reliable phone infrastructure in place is imperative.",
    "As many businesses make the switchover from private branch exchange (PBX) to voice over internet protocol (VoIP), it can often seem like a daunting prospect to migrate an entire business’s telephony system.",
    "In our Microsoft Teams review, we take you through the functionality and features of Microsoft’s IP telephony offering to see if it is one of the best VoIP services for your business.",
    "To use Microsoft Teams as a phone system, your business needs to have one of the three Office 365 enterprise plans (named E1, E3, and E5)",
    "With E1 ($8/month per user) and E3 ($20/month per user), businesses will need to purchase additional licenses to use Teams as a phone system at $8/month per user. However, for users of the E5 plan, this is all included in the cost of $35/month per user.",
    "In addition to these plans, businesses will also need to pay either an additional cost for direct routing through a third party or by purchasing call plans from Microsoft.",
    "A domestic calling plan consisting of 3000 domestic minutes is $12/month per user. Meanwhile, a domestic and international calling plan of 3000 domestic minutes and 600 international minutes costs $24/month per user. Each user must have a call plan, although unused minutes can be pooled if there are differing levels of usage between colleagues.",
    "If your business has several meeting rooms with conference phones, then these will require a separate license of $15/month per device.",
    "Microsoft Teams Phone System enables businesses to access features such as call queues, call forwarding, voicemail, transferring, auto attendants that can be configured for office hours, out of office hours and holidays, call parking, call blocking, group call pickups, and call delegation.",
    "One of Microsoft Teams’ core features is Presence. Presence shows an individual user’s real-time availability, allowing users to have a quick visual indicator before parking and transferring calls through to colleagues.",
    "One feature that the system is lacking is functionality for complex calling requirements such as those that may be required by a call center. It is not possible to set up more complex hunter groups or ring settings further than the three default call distribution configurations.",
    "There is no native call recording functionality, and while there are workarounds available, there are no third-party apps currently available to do this.",
    "For businesses that use a customer relationship management system (CRM), there is currently no integration between the phone system and any CRM platforms. This means that it is unable to automatically log incoming or outgoing calls on any platform, including Microsoft’s own CRM software, Dynamics.",
    "While there is reporting available within Microsoft 365, this is mostly focused on call quality and allowing businesses to troubleshoot any issues with devices on the system. Users are unable to drill down into many granular details that are used as key performance indicators, for example, ring times.",
    "The Microsoft Teams interface is available on all platforms and is incredibly easy to navigate, particularly for businesses that already use Teams as standard.",
    "For those who are new to Teams, a degree of planning is required to ensure that new users can get off to a good start. Auditing your company’s staff and the various departments, roles, and teams before installation will allow for ease when setting up user groups. For example, by sorting individual sales employees into a group, an administrator will be able to set up a telephone hunter group to ring all sales lines if a sales agent’s phone isn’t picked up within a certain amount of rings.",
    "While there are apps for Microsoft Teams for iOS and Android, if call forwarding is enabled on the system there are no requirements for users to download the Microsoft Teams app to their phone.",
    "The system uses Microsoft’s Global Delivery Network, allowing for it to be rolled out to a business of any size, with the ability to scale up to with minimal disruption. Additionally, as Microsoft updates its features regularly, users will always have access to the latest version and releases without any additional upgrade costs.",
    "The Microsoft 365 website has a feature-rich support section that contains videos, blogs, and documents to help users make the most of the platform.",
    "Microsoft does not have 24/7 live support. For any problems that arise, a ticket needs to be logged, and contact times can take up to a few hours. The quality of the support can vary as well, with some issues being fixed quickly, while others may take multiple tickets to be resolved.",
    "If your business uses the E3 and E5 plans, additional security features come as a standard, including Microsoft Advanced Threat Analytics. This incorporates advanced security, compliance, and analytical capabilities.",
    "All data that is stored by Microsoft is SSL encrypted both at rest and in transit, and any audio and video that operates through Teams are run through SRTP.",
    "There have been concerns over the security of Microsoft Teams after a number of vulnerabilities were discovered during 2020. Also, Microsoft security can be complicated, with many different licenses and add-ons required to ensure compliance in some industries.",
    "There are many alternatives to Microsoft Teams Phone System on the market, offering cloud-based VoIP systems that are worth considering. RingCentral Office is equal in price per user and has much stronger call center features: automatic call recording, CRM integration for major platforms such as Zendesk and Salesforce, and 24/7 live support. In addition, it can integrate with Microsoft Teams.",
    "Another option is GoToConnect, which offers similar features to Microsoft Teams Phone System but has a much more simplified, per user pricing structure. Along with cost, it has much of the same functionality as Microsoft Teams but includes SMS services and geolocation forwarding. It can also be integrated with the Microsoft Teams platform.",
    "For those who already use Microsoft Teams, the ease of moving over to the VoIP offering is a big plus. It’s also ideal for businesses that are looking to scale up in the future, as purchasing additional user licenses can be completed in minutes.",
    "The system does come with its flaws, though, and is not a good fit for businesses that require more complex phone configurations. In addition, the cost of purchasing the licenses and call plans can quickly add up if your business has heavy telephone usage. The lack of 24/7 support from Microsoft is also a concern when it comes to troubleshooting and potential downtime. Businesses that want 24/7 support with the system can however get this through a third-party supplier."
  ],
  "headers": {
    "3": "Microsoft Teams Phone System: Plans and pricing",
    "8": "Microsoft Teams Phone System: Features",
    "14": "Microsoft Teams Phone System: Interface and in use",
    "18": "Microsoft Teams Phone System: Support",
    "20": "Microsoft Teams Phone System: Security",
    "23": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "Microsoft Teams": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4653169856644279000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Fmicrosoft-teams%2Fgroup-chat-software",
    "best VoIP services": "https://www.techradar.com/news/best-voip-service"
  }
}