{
  "source": "https://www.techradar.com/reviews/bose-frames-tempo-tenor-and-soprano",
  "title": "Bose Frames (Tempo, Tenor and Soprano) review",
  "category": "wearables",
  "updated": "2021-02-08T05:12:55Z",
  "author": "sharmishta-sarkar",
  "summary": "Pitch imperfect",
  "verdict": "While the second-generation Bose Frames do improve upon a few things such as finally adding volume control and better sound quality, their overall fit and niche appeal make them hard to recommend. For lying on the beach or poolside they might be just the trick, but for busy spaces and public transport they miss the mark.",
  "pros": [
    "Excellent for phone calls",
    "Acceptable sound quality",
    "Decent battery life"
  ],
  "cons": [
    "Slightly uncomfortable fit",
    "Tenor and Soprano require proprietary charger"
  ],
  "article": [
    "The original Bose Frames were certainly an interesting piece of tech, and while they were well-designed, we weren’t impressed by the fairly short battery life, lack of volume control, and slightly cheap materials. So Bose has taken another crack at its audio sunglasses and produced three new styles to join the existing Rondo and Alto – these are the sporty Tempo, and the everyday-use Tenor and Soprano.",
    "Like their predecessors, the three new Frames are great if you want to lie by the beach or pool and listen to music, or enjoy your tunes while on a walk, run or hike. While Bose has done a lot to improve sound quality, the new Frames don't quite cut it in louder environments like train stations or public transport.",
    "That said, they aren’t designed to replace standard earphones, but are more for people who want to be aware of their surroundings while also listening to some background music. If you’re keen to pay the price for them, the new Bose Frames (Tempo, Tenor and Soprano) are certainly still interesting to flaunt, especially since they look more premium than their slightly plasticky predecessors.",
    "While the Tenor and Soprano are essentially the same, differing only in style, the Tempo takes things up a notch to keep you entertained while you're running, cycling, hiking or doing something else equally athletic. The Tempo has larger speakers and better battery life to keep you moving, and they're definitely louder and bassier than the Tenor and Soprano. But the build feels less premium than the two everyday sunnies and the arms are so thick, they don't quite fit everyone.",
    "In the meantime, the Tenor and Soprano not only look good, but sound better than the older Rondo and Alto and offer decent battery life, with touch controls working more smoothly than on the Tempo.",
    "The one great thing about all three designs of the Bose Frames is that you can fit prescription lenses quite easily. While only select optometrists in the US offered lens options for the Rondo and Alto, any good optometrist should be able to swap out the original lenses in the Tempo, Tenor and Soprano. We got prescription lenses for the Soprano fitted in Australia and have had no complaints.",
    "The second generation of Bose Frames were launched in September 2020 and are available to buy either directly from Bose or from select retailers for $249.95 / £239.95 / AU$399.95. That's a fair chunk pricier than the original Rondo and Alto ($199.95 / £199.95 / AU$299.95), but then you are getting better audio and a more premium set of sunglasses for the higher price tag.",
    "Keep in mind that this isn't a product to replace a standard pair of headphones, and that’s fine – that isn’t what Bose set out to do. If you need things like noise-cancellation or just a regular pair of headphones, then there are plenty of other ones on offer from Bose.",
    "To the naked eye, the Frames look just like a normal pair of sunglasses, and that’s a good thing. The last thing you want to do with a wearable is draw unnecessary attention to it, so we’re thankful that the design doesn’t give away the tech that’s hiding away here.",
    "One thing you’ll immediately notice about the Frames, however, is just how thick the arms are, but there's no way around that issue. It’s where the battery, drivers and touch controls are housed, so it adds a bit of heft to the design. If you’re a fan of thinner arms on your sunglasses, then sadly these won’t be the ones for you.",
    "There’s only one physical button on the Frames – located on the right arm – which is what you use to turn them on as well as to answer calls or control music. Bose has shifted the button much further back as compared to the older models, which prevents accidental presses when you’re taking them off. The button is now black and blends seamlessly into the design, as opposed to the gold accents on the older Rondo and Alto models.",
    "Touch controls are available for volume adjustment – again, on the right arm – with swipes forward and backward allowing you to decrease and increase volume respectively. This feature was not available in the previous generation of Bose Frames and is a welcome addition this time round. However, we found that volume controls work really well in the Tenor and Soprano, but aren't as smooth on the Tempo, presumably because of the different materials used – the former two have premium, smooth plastic, while the latter uses a matte finish.",
    "Double taps will bring up your preferred digital assistant (Siri or Google Assistant, depending on your paired phone's platform), while laying the Frames upside down anywhere will turn them off – another great feature that makes them user-friendly as it's a natural thing to do when removing any pair of sunglasses.",
    "You'll find the speaker grilles in the middle of the arms on the Frames, positioned just before they slim down to tuck in behind the ear. This places them right above the ear, ensuring your music, podcast or audiobook is for you and you alone. Design-wise, the speakers are discreetly blended into the arms, so even when you place the Frames on a table, they continue to look like regular sunglasses.",
    "You can easily pair them with your smartphone using the accompanying Bose Music app, but you won’t be able to adjust EQ levels in any way.",
    "The Frames comes in two polarized lens styles (the more colourful of which is sold as an optional extra) that are fairly easy to pop out and swap around should you desire. Prescription lenses are also an option with participating retailers, though this will vary by availability in each country. In Australia, we got the Soprano lenses swapped out for polarized prescription ones by just going to Specsavers.",
    "Wearing any of the new Frames models is an interesting experience – despite their large appearance, they’re fairly light and don’t weigh down on your nose. However for users that have a slightly larger head, these are going to be quite uncomfortable.",
    "We'd expect these to loosen up over time and use but when a colleague tried out the Frames Tempo, the arms were pressing down on his temples too tightly to assume they'd get better with use. When this reviewer used the Tempo, though, they were loose.",
    "Designed for athletes, the Tempo also comes with different sized nose clamps to adjust fit, but we found that none of the provided options helped. On the other hand, this reviewer found the Soprano to be a great fit, but others found it too tight. Moral of the story – try these on first before you decide to buy a pair.",
    "The Bose Frames Tempo also benefit from IPX4 rating, making them water- and sweat-resistant, while the Tenor and Soprano only have an IPX2 rating.",
    "One thing we’re disappointed to find with the Frames Tenor and Soprano is the use of a proprietary charging port on the right arm. This means keeping track of yet another charging cable instead of using a USB-C cable, which oddly you can find on the Frames Tempo.",
    "The burning question, of course, is how these things actually sound. It seems that Bose listened to customer feedback from their first iteration, and have definitely improved upon the sound quality. The Frames no longer sound like someone’s playing a song on their phone speaker two rooms away, and we were surprised by both the clarity and quality of the sound playing. It’s certainly something that takes a while to get used to – having audio streamed into your ears while still being able to hear the outside world is a real multitasking feat.",
    "All three of the new Frames models have an improved mic system for clearer voice calls, with a dual-beam-forming array replacing the previous single mic.",
    "There's a major difference in sound quality and loudness between the Tempo and the two everyday sunnies. Again, given the Tempo has been designed for athletes, they benefit from 22mm drivers in each arm and the sound is surprisingly bassy. Mind you, it's not like listening to music on dedicated headphones or earphones, but it's still quite impressive.",
    "On the other hand, the Tenor and Soprano have 16mm drivers, and the sound is still quite enjoyable. These two models aren't quite as loud as the Tempo – at 50% volume, the Tempo was more than sufficient on a riverside walk with squawking birds and chatting strollers, while we needed to up the volume on the Soprano to about 65% to enjoy our tunes.",
    "That said, it’s important we remain realistic with our expectations of the Frames. They are certainly not designed to isolate the outside world, or even replace standard headphones. So they’re not the best mix for noisy environments – you’ll want to keep to regular noise cancelling cans instead. On public transport they produce mixed results – we could hear announcements being made, but we couldn’t listen to our normal podcast over the chatter in the carriage. Even in a relatively empty bus, the sound of the engine was enough to drown out the Soprano at full volume.",
    "There’s also considerable audio leakage at volume levels higher than 60%, so if you’re sitting near someone, they’ll be able to hear tinny sounds emanating from your sunglasses and, unfortunately, you'll need them at full volume to enjoy them over the sounds of public transport.",
    "Where we did genuinely enjoy using the Frames Tenor was poolside. It’s great to be able to have music chiming in your ears while wearing sunglasses and not having to balance headphones as well. Mind you, the Frames Tenor and Soprano are only rated as IPX2 water resistant, so while they’ll survive a light splash, don’t let them fall into water.",
    "Call quality is surprisingly excellent, with callers coming through clearly and our voices being picked up even with lots of background noise. Yes, it’s weird for people to watch you speaking into thin air while walking, but it’s something we’ll take in our stride. The only thing we’ll keep in mind is that these aren’t meant to be worn when the weather isn’t sunny, or if you’re indoors – that’s just plain silly.",
    "Battery life has gotten a boost as well. Depending on which model you prefer, you can get up to 8 hours of playback from a single charge. In fact, in our tests, we pushed the boundaries a little and got more than what Bose advertises.",
    "You'll get the best battery life from the Tempo, with a promise of the aforementioned 8 hours of playback, but we squeezed out over 8.5 hours in our test. On the other hand, the Tenor and Soprano have smaller batteries promising up to 5.5 hours of playback but, again, we ended up with almost 6 hours while testing the Soprano, and that included a 30-minute call as well.",
    "Considering these aren't dedicated audio devices, this is reasonable – we don’t expect to wear sunglasses for extended periods of time, so with intermittent use you can make them last for quite a while. Moreover, if you're expecting better battery life than this, keep in mind they'll need to fit into an arm of the Frames and there's only so much you can get in there without making them bigger/thicker than they already are."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and availability",
    "8": "Design",
    "21": "Audio performance",
    "29": "Battery life",
    "32": "Don’t buy it if…"
  },
  "links": {
    "original Bose Frames": "https://www.techradar.com/reviews/bose-frames-review",
    "other ones on offer": "https://www.techradar.com/news/best-bose-headphones"
  }
}