{
  "source": "https://www.techradar.com/reviews/huawei-matebook-13",
  "title": "Huawei MateBook 13 review",
  "category": "computing",
  "updated": "2021-07-15T14:33:30Z",
  "author": "joe-osborne",
  "summary": "The most value-packed flagship laptop to date",
  "verdict": "Having clearly watched from the sidelines for years, Huawei latest has exactly the kind of sensibility we’ve wanted from a luxury laptop. The Huawei MateBook 13 does what any flagship laptop can do – and more – for the same price or even less. For that, the Huawei MateBook 13 is our Best in Class laptop in 2019.",
  "pros": [
    "Full Intel Core processing",
    "Discrete Nvidia graphics",
    "Webcam now on top",
    "Excellent value"
  ],
  "cons": [
    "Relatively low memory",
    "No Thunderbolt 3"
  ],
  "article": [
    "The Huawei MateBook 13 is another excellent release from Huawei, providing performance on par or better than many laptops in its class and at a lower price. In addition, it looks and feels at least as good as a 2018 MacBook Air.",
    "If that sounds familiar, that’s because we said a similar thing in the MateBook X Pro review. Even though the Huawei MateBook X Pro was an almost perfect device, Huawei managed to improve upon it with this portable. And it managed to do it at a cheaper price.",
    "That price, unfortunately, means some corners have been cut. Most noticeably, there’s no Thunderbolt 3 here. And, that’s one of the most crucial ports for professional users on the road, especially those who need fast data transfer speeds. It would be nice to have more RAM capacity as well.",
    "The Huawei MateBook 13 is still a worthy successor to the MateBook X Pro and carries that torch as one of the best value flagship laptops available. Additionally, it comes with some seriously impressive battery life, letting you get a full day’s worth of work done without needing a charge.",
    "Simply put, you’re getting more power and versatility from inside a laptop that’s just as attractive as – if not more so than – the competition.",
    "Huawei has clearly watched the laptop space from the sidelines for years, swooping in with exactly the kind of sensibility we’ve been looking for from a luxury laptop. The Huawei MateBook 13 does what every other flagship laptop can do – and more – often for less money than most.",
    "Huawei is selling two configurations of the MateBook 13 laptop, an entry-grade version and a high-end version, but both contain the same 13-inch, 2,560 x 1,440 (220 pixels per inch) touchscreen in a 3:2 aspect ratio and 8GB of LPDDR3 memory as well as a fingerprint reader embedded into the power button.",
    "Otherwise, the more approachable model includes an 8th-generation Intel Core i5 processor with integrated graphics and 256GB of solid-state storage (SSD) for $999 (about £785, AU$1,403) to start. Meanwhile, a $1,299 (about £1,020, AU$1,825) model with an Intel Core i7 processor and Nvidia MX150 discrete graphics chip inside as well as a 512GB SSD is available.",
    "Both models also include a helpful USB-C dock in the box as well as one free year of Microsoft Office 365 Personal. This pricing smartly undercuts Apple’s latest MacBook Air by 100 bucks, and remains quite competitive with other competing Ultrabooks, namely the Dell XPS 13.",
    "It all comes down to how the MateBook 13 part configurations compare, largely offering the same or more power than either option for less. Namely, neither the XPS 13 nor the MacBook Air offer discrete graphics. As low-power as the Nvidia MX 150 might be, it gives this laptop a clear competitive advantage in video rendering and gaming.",
    "Both models are available on Amazon and Newegg in the US at the time of writing, with wider retail availability come February. Huawei has not yet disclosed exact UK and Australian pricing or international availability.",
    "You wouldn’t be wrong to think of the MateBook 13 as a further refinement of Huawei’s best-in-class MateBook X Pro of 2018, but the company intends to sell both separately. You see, the MateBook 13 looks nearly identical to the X Pro, only slightly smaller.",
    "This laptop is fitted into the same aluminum body as before in your choice of a Space Gray or Mystic Silver color option. Open the laptop, however, and you’ll notice one key difference: the webcam has moved – again.",
    "While the webcam was cleverly hidden beneath the keyboard in the X Pro, Huawei has done this MateBook right with a webcam resting above the display. However, it’s rated for a mere 0.9-megapixels at 720p resolution, so it’s not going to make you look amazing online.",
    "Measuring just 0.59 inches (14.9mm) thin and weighing a mere 2.87 pounds (1.3kg), the MateBook 13 is narrowly heavier and actually – just by a hair – thinner than the latest MacBook Air. That’s mighty impressive for a laptop that contains a full-fat Intel mobile processor as well as a dedicated graphics chip.",
    "Equally as impressive is the keyboard and touchpad on offer here, with plenty of key travel at 1.2mm and the punchy, forceful feedback that we need to type fast. Likewise, the Microsoft Precision touchpad is also a delight to use as well as wide and spacious, though it’s notably missing a smooth glass coating.",
    "Now, if you enjoyed the touchscreen display on the X Pro, you’ll love it all over again on the MateBook 13. While a touch smaller now at a straight 13 inches on the diagonal, the screen still puts out a 1440p picture at 100% of the sRGB color gamut – and its touch digitizer is as snappy as ever.",
    "Couple that with a 1,000:1 contrast ratio and up to 300 nits of brightness, and you have the makings of a once-again excellent display. However, the 3:2 aspect ratio allows for more content to fit on the screen vertically, but that means thicker bars above and below your full-screen videos.",
    "While this is essentially the same design as last year’s flagship Huawei laptop, we can’t help but appreciate the refinements that the company has made to that design at almost every level.",
    "The Huawei MateBook 13 looks like the usual iterative update to its predecessor both on paper and in practice. However, Huawei managed to eke even more graphical power out of the same processor this year with improved thermals and 25% faster fans inside, allowing the graphics chip to use 25 watts of the laptop’s overall power draw – most laptops equipped with the Nvidia MX150 run a 15W, lower-spec version of the chip. These fans also help keep the laptop surprisingly cool under load compared to similarly thin and light models.",
    "So, not only is this laptop much better at graphics and moderately better than its predecessor at general computing, it is that much better than key competitors that have not made similar moves. All the while, this is a laptop that will tear through general use and will be ready to bat on more difficult tasks, too.",
    "So as not to belabor the point with too many numbers, let’s look at one simple benchmarks to demonstrate the MateBook 13’s lead over key competitors: Geekbench 4. This processor simulation benchmark tests for almost every use case.",
    "The MateBook 13 scored more than 17,000 points in the multi-core test, which is just 500 points more than the previous model and 400 points more than the Dell XPS 13. Meanwhile, the 2018 MacBook Air didn’t come within 10,000 points of the MateBook 13’s score. Why is this?",
    "It’s more than likely Huawei’s thermal work that’s to thank for its advantages over the previous Huawei and Dell models, considering the Dell and Huawei MateBook 13 were tested on the very same processor. A processor with more headroom will perform better to a point, after all.",
    "However, the massive discrepancy between Huawei and Apple’s laptops is because the latter uses a fanless, Y-series Intel processor with a lower frequency and two fewer processing cores. After all of Apple’s compromises, the MateBook 13 ends up thinner anyway – go figure.",
    "Now, while the Huawei MateBook 13 includes discrete graphics – that are, again, more powerful compared to last year’s flagship model – don’t expect to do much more than casual to light mainstream gaming on this machine (this isn't a full-power gaming laptop). Shadow of the Tomb Raider wouldn’t even run on the laptop, and Total War: Warhammer 2 couldn’t get past 30 frames per second on average at the lowest settings.",
    "That said, for the odd Hearthstone session between the presentation slide decks you’re working on, this laptop will do just fine.",
    "As for longevity, Huawei promises up to 9.6 hours of local 1080p video playback from the MateBook 13, and that’s the only figure it provides. Luckily for Huawei, our 1080p video playback test reported an impressively close 8 hours and 18 minutes, narrowly outlasting a Dell XPS 13 with a 4K display.",
    "Of course, the MacBook Air remains battery king at a whopping 10 hours and 30 minutes of playback time, but this is nevertheless impressive for a 2019 flagship laptop. The MateBook 13 has enough juice to last on most trips without having to charge, and that’s what matters.",
    "That said, we’ve recorded a PCMark 8 battery test number that’s well below Huawei’s promise and well below the average for a laptop of this class. This could be due to a number of factors, namely a sizable reduction in battery capacity compared to the MateBook X Pro up against graphics running at a higher frequency than that model and competitors.",
    "Ultimately, we’re confident in the MateBook 13’s ability to last for several hours on a charge in either scenario. Throw in USB-C fast charging that can give you 2.5 hours of use in 15 minutes, and you’re looking at an excellent laptop for people constantly traveling.",
    "Huawei is generally minimalistic about the amount of bloatware on its machines, and the MateBook 13 isn’t any different. This laptop contains a single additional app: Huawei PC Manager. This app scans your computer’s hardware for any issues or possible driver updates that Windows 10 has missed. You can then install those updates with one button press.",
    "Beyond software, the only true hardware feature to speak of is the fingerprint reader. Integrated into the laptop’s power button, this is an incredibly speedy and convenient method of biometric login via Windows Hello. You won’t wait for longer than a second after powering on your laptop before you’re looking at your Windows 10 desktop – that’s fast."
  ],
  "headers": {},
  "links": {
    "MacBook Air": "https://www.techradar.com/reviews/macbook-air-review",
    "Huawei MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro",
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471"
  }
}