{
  "source": "https://www.techradar.com/reviews/brooks-ghost-14",
  "title": "Brooks Ghost 14 review",
  "category": "fitness",
  "updated": "2021-08-29T13:00:00.684Z",
  "author": "michael-sawh",
  "summary": "A comfortable, dependable neutral shoe that’s carbon neutral too",
  "verdict": "The Brooks Ghost 14 is a solid daily trainer that works well for short, easy paced runs and offers plenty of cushioning to handle that longer time on your feet too. It’s not the snappiest shoe you can find at this price, but if you want a good mix of comfort and something that feels stable to run in, then the Ghost 14 ticks the important boxes.",
  "pros": [
    "Comfortable upper",
    "Nicely cushioned ride",
    "Good for easy, steady paced runs"
  ],
  "cons": [
    "Not a very exciting looking shoe",
    "Could be a bit lighter"
  ],
  "article": [
    "The Brooks Ghost 14 is the latest addition to one of the company's most popular running shoe ranges. This neutral option is probably best defined as a workhorse in the same way as something like Nike’s Pegasus 38 or the New Balance 1080v11. It’s built for eating up a lot of miles.",
    "It might not be the most exciting shoe to look at or run in, but it’s reliable, offering plenty of comfort and cushioning. It can deliver a little snap at quicker paces, but it’s really about being solid, durable and dependable.",
    "There are a bunch of changes from the 13, with the headline one being that Brooks has now placed its DNA Loft cushioning in the entirety of the midsole just like it does on its Glycerin shoe to offer a softer, smoother ride.",
    "The mesh upper is still designed to offer plenty of comfort and support, with Brooks using a 3D print fit that’s designed to adjust to the foot and feel secure. Brooks has also boosted things around the heel collar for a more snug feel at the back of the shoe.",
    "Underfoot, there’s a thick rubber outsole to deliver plenty of grip on roads and even slightly uneven terrain with flexible Omega Flex grooves to support when swiftly changing direction.",
    "It’s a shoe that offers a solid overall running experience. It’s not the most exciting to run in, but the upper is comfortable and supportive and it’s a nicely cushioned, responsive ride. It’s a bit chunkier looking than some other daily runners, but it ticks all of the right boxes to make it a really strong option for beginner runners for those casual runs or for someone that wants a shoe for long training sessions where comfort and durability are the main priorities.",
    "The Brooks Ghost 14 was launched on July 1 2021, and is available from select retailers and the Brooks website for $130 / £120 / AU$229.95.",
    "Brooks has made a big deal about the fact this is its first carbon neutral running shoe, so how exactly does that play out on the Ghost 14?",
    "The carbon footprint of the 14 is apparently 10.34kg, and its carbon impact is covered for the full life of the shoe. That includes materials, assembling and packaging. Brooks says you can expect to see the same approach taken with the Brooks 15 and 16 shoes. On the shoe, that’s represented by using materials in the upper containing a minimum of 30% recycled polyester.",
    "Aside from those carbon neutral credentials, this is a running shoe with a very traditional running shoe look. It’s a bit on the bulky and unattractive side and is around the same weight as the 13, weighing in at 281g for the men’s shoe and 255g for the women’s model. It’s got the same 12mm drop as the Ghost 13, so still a higher drop than some other daily trainer shoes in this price range, but does mean it should offer a similar feel to its predecessor.",
    "Brooks is using an engineered mesh upper that’s thinner than what featured on the 13 and uses its 3D Print technology that’s designed to offer some flexibility with the fit without sacrificing that for an upper that’s comfortable as well. It’s a spacious upper, which makes it a particularly strong fit for those with wider feet and it didn’t feel too roomy for our narrow feet. That space extends to the toe box, with that stretchy upper offering a nice snug fit.",
    "The headline change here is the introduction of Brooks’ DNA Loft foam in the midsole that now runs the full length of the shoe, joining Brook’s Glycerin shoe in offering something that promises softer cushioning that’s more responsive and along with a segmented crash pad, delivers smoother transitions.",
    "Below that DNA Loft foam is a heavy spread of blown rubber on the outsole that’s well distributed at the heel up to the forefoot to make sure it’s a stable ride and there’s plenty here to pound the pavement. It’s also thick enough to handle some sight off-road terrain as well.",
    "The best way to describe what it’s like to run in the Ghost 14 is that it just feels like a very reliable shoe. That doesn’t sound like the biggest compliment, but it offers pretty much what you want from a daily trainer workhorse. It’s not tremendously snappy at quicker paces and isn’t going to make speed sessions particularly fun, but when it comes to putting in easy or steady paced miles, it more than fits the bill.",
    "The full stretch of DNA Loft cushioning in the midsole offers just enough pep in your step, but there’s still a touch of firmness about it and certainly doesn’t feel as soft as New Balance’s FreshFoam cushioning or what you’ll get packed into something like Nike’s Pegasus 38.",
    "What it does give you is something that's very consistent with every stride and gives you the scope to slightly kick the pace up too. Don’t expect huge energy returns here, though it’s the kind of cushioning that’s still well suited to long training runs.",
    "The mesh upper hugs the foot in the right places and offers a good locked down fit. The padded tongue and thick heel collar also keep things comfortable, particularly when upping the mileage.",
    "The outsole on the Ghost 14 is typically solid and feels like something that’s built to last. It was pleasingly grippy and stable on roads and held up well when we wandered onto park paths and canal paths. With over 50km of running in them, there are no worrying signs of wear either.",
    "No, it’s not the most exciting shoe to run in, and it’s a slight shame Brooks didn’t pack it with its more enjoyable DNA Loft V3 midsole foam used on its space age Brooks Aurora-BL shoe. What you do get in abundance is something that you can slip on, get out the door and get a reliable, nicely cushioned, stable shoe that should hold up for a lot of running time."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and release date",
    "7": "Design",
    "13": "Performance",
    "19": "Don't buy it if"
  },
  "links": {
    "Brooks Ghost 14": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1133794951717951600&xs=1&url=https%3A%2F%2Fwww.brooksrunning.com%2Fen_us%2Fbrooks-ghost-running-shoes%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbrooks-ghost-14",
    "running shoe": "https://www.techradar.com/best/best-running-shoes",
    "the Brooks website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4226521377234740000&xs=1&url=https%3A%2F%2Fwww.brooksrunning.com%2Fen_us%2Fbrooks-ghost-running-shoes%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbrooks-ghost-14",
    "Brooks Aurora-BL": "https://www.techradar.com/reviews/brooks-aurora-bl"
  }
}