{
  "source": "https://www.techradar.com/reviews/benq-tk700sti-4k-gaming-projector",
  "title": "BenQ TK700STi 4K gaming projector review",
  "category": "audio-visual",
  "updated": "2021-06-18T17:00:49.726Z",
  "author": "shaun-prescott",
  "summary": "High framerate HDR gaming on your wall",
  "verdict": "While its refresh rate and response time positions it as a gamer's projector, the BenQ TK700STi is a great option for anyone if native 4K content is the goal. It's a great product at a phenomenal price point, with just a few small user-experience hitches.",
  "pros": [
    "Gorgeous and bright picture",
    "4K at 60Hz, with HDR",
    "Very impressive response rate"
  ],
  "cons": [
    "No Netflix",
    "Fiddly onboard buttons",
    "Weird Android TV integration"
  ],
  "article": [
    "If you’re looking to lay a big load of cash on a projector, you can’t go wrong with the BenQ TK700STi. If you’re buying it for gaming, then that endorsement is even stronger. This unit supports 4K at 60Hz with an unsurpassed 16ms response time at that resolution, which is as low as response times get in a native 4K projector. If you want up to 120 inches of bright, crystal-clear game on your wall or screen, this sets a new benchmark.",
    "What do those numbers mean in practice? It means a crisp 100 inch image with a smooth frame rate and utterly negligible input lag. With a 3,000 lumens brightness and HDR support – as well as a couple of purpose-suited game modes – the display absolutely sings. With the PS5 and Xbox Series X out in the wild now (albeit, still hard to find), this projector can actually take advantage of the new console generation’s performance advantages.",
    "While 60Hz at 4K is impressive, the TK700STi will also support 120Hz so long as you’re happy to compromise on a 1080p output, and with three modes in the form of FPS, SPG and RPG, the display can be optimized according to the type of action happening on screen.",
    "What does that mean for watching TV content? Not a great deal: you’re getting a brilliant image at 4K, though naturally the 120Hz capabilities, not to mention the low response time, aren’t going to make a big difference. This is a projector for someone who wants the best of both worlds, though if you’re never going to use it for gaming, and 4K isn’t a big deal to you, you can probably settle for something less expensive.",
    "Not to mention that the bundled Android TV dongle – which needs to be installed manually, albeit easily – has a glaring omission in a dedicated Netflix app. Still, if you’re a console gamer, Netflix is available on everything except Nintendo Switch, and this model packs a lot of performance for the price.",
    "The BenQ TK700STi projector is available for $1,899 in the US, £1,299 in the UK, and AU$2,599 in Australia.",
    "While other companies might be tempted to make their gaming projectors look like sci-fi obelisks, BenQ takes a minimalist approach to the TK700STi’s design – nothing about it screams 'gamer'. It’s a discreet white box with a black front, and it boasts a far more conservative design than its sibling model, the X1300i.",
    "Analog zoom and focus dials are readily accessible at the top of the unit, as is the rest of the projector’s user interface: the power button, a directional pad for navigating the system’s menus, and a few quick access buttons for choosing display modes or triggering the Eco Blank functionality.",
    "As for those zoom and focus dials, they allow for a lot of precision and stop very firmly in the desired location. There are also three thick bolts at the base which can be unscrewed in order to elevate the device slightly. This model comes with a remote control, which is highly recommended, as the buttons on the unit itself are unpleasant to use and require very firm presses to activate.",
    "As for connectivity, you’ve got two HDMI 2.0 ports (with ARC on the second port), an RS-232, audio out for 3.5mm and a sole USB port. The device comes packaged with a BenQ Android TV dongle which you’ll need to install yourself: this involves removing one screw from a protrusion on the back of the unit, and connecting the dongle to a hidden USB port inside. It’s a slightly inelegant solution – why not bake this functionality in? – but it’s a one-and-done annoyance.",
    "Elsewhere, you’ve air vents along the entire right hand side of the unit, as well as a fraction of the left, and a little at the front. The whole thing measures at 31x11x25cm, and it has a 5W speaker included, though very few people are probably going to use it: you can either use the 3.5mm jack or attach a sound system or soundbar via ARC.",
    "That said, if you’re traveling and want to use it away from your home entertainment audio gear, it’ll get you through.",
    "This short-throw projector requires at least two metres between the projector and the wall to reach the 100-inch mark, and while the TK700STi advertises a 100-inch maximum, we found that it could retain a perfectly viewable picture at 120-inches on the wall. In concert with its 3,000 lumens brightness – which is about as bright as you’ll want to get in a home environment – the 4K display is remarkably crisp and vibrant, thanks to its HDR10 support.",
    "Still – and this probably goes without saying – you’re going to want a very dark room. In some ways HDR can be a drawback in environments with just a little bit of sun leakage: playing Housemarque’s dark and gloomy PS5 game Returnal with the blinds futilely drawn was not an enjoyable experience, and wasn’t conducive to winning. That effect is exacerbated with a projector, and worth keeping in mind as more and more next-gen games embrace deeper blacks and more blinding brights.",
    "Aside from that point, the 4K image is bright and invigorating and, in some ways, quite jaw dropping. The 60Hz refresh rate may not impress by the standards of modern gaming monitors, but it’s hugely impressive in a native 4K projector. With the appropriate lighting (or lack thereof) the TK700STi’s display shines like a portal on your wall, though like its X1300i stablemate, you do tend to see blooming around any bright-on-dark areas of the display.",
    "Meanwhile, if you’re planning to use the TK700STi for movies and streaming you won’t be disappointed: color and clarity is admirable, though of course, you’re probably going to want to use a better sound source.",
    "While the gaming monitor market likes to promote the advantages of 1ms response rates, you’re getting nowhere near that with the TK700STi: in 4K it has a 16ms response time, while it can hit 8ms in 1080p.",
    "It can’t be stressed enough, though, that these response times on a projector are very novel indeed, and given this is a projector with native 4K you’re not going to find better than this performance at the moment. All but a small number of inveterate competitive gamers (or dyed in the wool pedants) are going to notice any input lag. Basically, you’re probably not going to get better performance than this.",
    "Still, given the emphasis Sony and Microsoft are placing on both 4K resolution and 120Hz refresh rates, it’s a question that will arise, and the TK700STi’s 60Hz refresh rate at 4K – impressive only 5 years ago – might seem inadequate on paper.",
    "Sure, if you’ve been gaming on a 240Hz monitor you may notice a difference in fluidity, but 60 frames-per second is a bar that consoles have only just gotten around to making (unofficially) standard: the likelihood of more than a handful of blockbuster games with 120Hz support coming out during the console generation seems low, as developers focus on the wow-factor of ray tracing, detail and resolution.",
    "Of course, if you’re rocking this projector with a gaming PC those platform-oriented limitations are immaterial to you, and if a high-refresh rate is more important than resolution, then you probably aren’t seriously in the market for a projector.",
    "For our money, playing through a selection of games on both the Xbox Series X and PS5 including Dirt 5, Returnal, Assassin’s Creed Valhalla, Forza Horizon 4 and Outriders, 100 inches of 60 frames-per-second next-gen goodness is undeniably impressive, offering a level of immersion no halfway affordable TV is likely to produce. Note that 4K offers a maximum 60Hz refresh rate, while 120Hz maxes out at 1080p."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Price and availability",
    "6": "Design and features",
    "12": "Picture quality",
    "16": "Sound and gaming",
    "22": "Don't buy it if"
  },
  "links": {
    "4K projector": "https://www.techradar.com/best/4k-projector",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "X1300i": "https://www.techradar.com/reviews/benq-x1300i-4k-gaming-projector",
    "ARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Assassin’s Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review"
  }
}