{
  "source": "https://www.techradar.com/reviews/sony-srs-xb13-bluetooth-speaker",
  "title": "Sony SRS-XB13 Bluetooth Speaker review",
  "category": "audio-visual",
  "updated": "2021-05-25T22:23:11.562Z",
  "author": "nick-pino",
  "summary": "A budget portable speaker that's handily outclassed by Sony's other speakers",
  "verdict": "The SRS-XB13 is Sony's cheap portable speaker that's built for people on a budget, but the sound quality, low max volume, poor call quality and long charging time are discouraging. If you can spend a bit more, you’re better off buying a Sony SRS-XB23 speaker or, if you want something with a similar design, the UE Wonderboom 2.",
  "pros": [
    "Relatively affordable",
    "Diffused sound",
    "Balanced sound quality",
    "16-hour battery life"
  ],
  "cons": [
    "No stereo separation",
    "Low max volume",
    "Four-hour charge time",
    "Awful microphone"
  ],
  "article": [
    "For years, the Sony SRS-XB12 was Sony’s go-to budget Bluetooth speaker. For $39.99 (£39, AU$48), it was an affordable entry point into portable audio with performance that was surprising for its size – but now that torch will now be carried by its successor, the all-new Sony SRS-XB13.",
    "It’s slightly more expensive at $59 (around £40, AU$80), however with better sound dispersion, Sony designed the speaker to offer 360-degree audio so that everyone at the party, beach or bonfire can hear the music wherever they sit. For outdoor enthusiasts, it’s got an IP67 rating that makes it water and dust-resistant. Plus, Sony claims it’s improved the internal microphone for phone calls as well… though, we wouldn’t recommend using it for that purpose.",
    "Having put Sony SRS-XB13 through its paces, we think it's a fine ultra-budget option if you can’t possibly stretch your budget any further than $60, but the sound quality, low max volume, poor call quality and long charging time are all major pain points.",
    "Unfortunately, it doesn't exist in a vacuum and it’s worth spending a bit more to get the genuinely great Sony SRS-XB23 from last year instead – it’s typically just $79.99 on sale and the sound quality is significantly better. However, if you’re in love with the form factor, we recommend the waterproof UE Wonderboom 2, too.",
    "The Sony SRS-XB13 will replace the XB12 starting in June 2021 with some retailers already beginning to make the swap. In terms of price, the SRS-XB13 starts at $59 (around £40, AU$80) but that price may drop when the speaker goes on sale later this year during events like Black Friday 2021.",
    "For a Bluetooth speaker, that price is actually pretty reasonable – it’s not the cheapest price we’ve seen on a Bluetooth speaker but it’s a lot cheaper than the competition that regularly sells for around $100 (£80, AU$150).",
    "That said, we do feel like you’re making some compromises to get a speaker this cheap: the single driver on top of the speaker doesn’t offer the clearest or loudest sound in its class, and you’ll need to pick up a second speaker to get true stereo sound.",
    "While the Sony SRS-XB13 price is very compelling, most folks go after Sony’s smaller speakers because they’re lightweight, compact and easy to carry around. This year you can also add on their IP67 rating that makes them dust-proof and waterproof, too.",
    "The shape is essentially a portly soda can – it’s a bit wide, round and short. It can probably fit in a cup holder in your car, but thanks to the strap it can definitely hang off your backpack.",
    "At the top of the speaker is a grille that guards a standard 1.5-inch driver while on the underside you’ve got a passive radiator for better bass response. Controls are located along the side and that’s where you’ll find the hidden USB-C port that charges the speaker.",
    "At the bottom of the speaker is a rubber bass and small gaps in the plastic base to allow sound to pass through – a design feature Sony’s taken directly from its 2020 speaker lineup.",
    "That said, if the Sony SRS-XB13 looks like a speaker you’ve seen before, you might be thinking of the UE Wonderboom and UE Wonderboom 2. In fact, the design is pretty similar, but the Wonderboom moves the controls to the top and adds both a second driver and a second bass radiator. As you’d expect, the Wonderboom is a bit louder and clearer than the Sony and is the better all-around speaker from our experience testing both.",
    "That being said, we do have to give some credit to the new Sound Diffusion Processor that Sony put inside the XB13 – it really does help the speaker fill a 360-degree radius of sound, but we’ll talk more about that in just a moment.",
    "The last two design features worth mentioning are the ability to pair two XB13s together by pressing and holding the Bluetooth pairing button and the quick pairing feature with Android devices. The former will set the speaker into a left-right channel configuration for stereo sound that can really alleviate some of the sound issues the speaker has, while the latter makes it so that it’s incredibly fast and intuitive to pair with any new Android phone or tablet.",
    "In terms of sound quality, the SRS-XB13 is far better balanced than it was in years past. There’s a focus on the mid-range that makes vocals very easy to hear, and a decent wallop of bass for a speaker of its size.",
    "In an interview with us ahead of launch, Sony told us one of the big focuses for the development team this year was a flatter sound quality, and that definitely feels like the case.",
    "Unfortunately, it’s still a single-driver system with a passive radiator on the bottom. That means there’s absolutely no stereo separation and a limited sound stage. Songs that typically have a distinctive left and right channel like Jimi Hendrix’s All Along the Watchtower just sound flat on the SRS-XB13 if you don’t pair two of them together.",
    "The new balanced sound quality makes most genres of music sound significantly better, especially rock and alternative, but does make pop and EDM sound a little worse. The driving bass line in BED by Joel Corry and David Guetta gets lost in the mix, as do the harmonies. You should be able to tweak this some using your phone’s built-in EQ or the Sony Music Center app, but don’t expect a miracle there.",
    "Admittedly, the new Sound Diffusion Processor does help distribute the sound in a 360-degree radius, but you won’t get a lot of clarity or presence anywhere you sit – nor is the audio all that loud. It’s enough to fill a small room or entertain people around a little campfire, but it certainly doesn’t fill large rooms and or carry very far. We could only get about 20 feet from the speaker before it started losing its vibrancy. If you’re looking for room-filling sound, you’ll have to upgrade to one of Sony’s new party speakers.",
    "Because the speaker isn’t much bigger than a soda can and drives the majority of the sound from a single 1.5-inch driver, there’s only so much the speaker can do with its sound quality. This might be one of the best-sounding ultra-portable speakers, but as far as sound quality is concerned, that’s a pretty low bar to clear.",
    "The single worst aspect of the speaker, though, is the built-in microphone. Sony has improved it, but friends and family we spoke to said that we sounded incredibly distant and hardly audible, despite standing a few feet from the speaker. If you plan on using a portable speaker for this purpose, we’d definitely recommend picking up another speaker instead of this one.",
    "Out of the box, be prepared to charge the Sony SRS-XB13 for four hours straight to get it up to full charge. In the box you’ll find a USB-C cable for charging, which is nice, and it plugs into the back of the speaker underneath a removable rubber flap.",
    "It’s a long wait time, admittedly, but thankfully the speaker can play for around 16 hours per charge. Of course, if you need to crank the volume up higher to fill a larger space, that total battery life might be closer to 12 or 13 hours, but it’s still more than enough for a day outside.",
    "Outside of long battery life, though, there’s nothing else special about the speaker - it can’t charge your phone, for example, nor does it charge wirelessly so you’ll have to keep a USB-C cable handy."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Sony SRS-XB13 price and release date",
    "7": "Design",
    "14": "Performance",
    "21": "Battery life",
    "24": "Don't buy it if..."
  },
  "links": {
    "Sony SRS-XB23": "https://www.techradar.com/reviews/sony-srs-xb23-portable-bluetooth-speaker",
    "UE Wonderboom 2": "https://www.techradar.com/reviews/ultimate-ears-wonderboom-2",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}