{
  "source": "https://www.techradar.com/reviews/eufy-robovac-15c-max",
  "title": "Eufy RoboVac 15C Max review",
  "category": "appliances",
  "updated": "2021-09-07T13:58:35Z",
  "author": "rachel-ogden",
  "summary": "An app-controlled affordable robot vacuum",
  "verdict": "Eufy’s RoboVac 15C Max proves that you don’t have to spend thousands on a robot vacuum for good functionality and a pretty good clean that’s not too noisy. While we found that the app was better for tweaking settings and the remote control handy for everyday use or when you’re at home, having the choice means you’ve got the best of both worlds. At this price point, it’s hard to find fault, although more powerful suction would be a plus.",
  "pros": [
    "Good value",
    "Convenient remote control",
    "Compact design"
  ],
  "cons": [
    "No floor mapping",
    "Advanced features only on the app",
    "Not compatible with 5GHz Wi-Fi"
  ],
  "article": [
    "Eufy may be more well-known for some of the best video doorbells and home security cameras, the brand also offers a range of robot vacuums, which while it isn’t vast, does offer something to suit everyone.",
    "For the technophobe, there’s the app-free RoboVac 11S, while for those that want a time-saving device; there's the G30 Hybrid that can vacuum and mop. And for those who love the RoboVac 11S’s size but not its lack of connectivity or voice control, there’s the RoboVac 15C Max.",
    "It may look identical to the RoboVac 11s, with the same 2.8 inches / 7.25 cm slimline design that can easily maneuver under furniture, but under the hood of the Eufy RoboVac 15C Max you’ll find better suction, Wi-Fi connectivity, which means you can use an app on your smartphone to control the robovac rather than just the remote control, and compatibility with Alexa and Google Assistant compatible.",
    "Crucially, the Eufy RoboVac 15C Max is affordable too. Ever so slightly pricier than the RoboVac 11S, the app means you can easily set cleaning schedules, locate your robot should it get lost under the bed, check its battery life, and control it via a voice assistant, making it good value for money. Although, the regularly used features such as adjusting the suction level and cleaning modes can also be tweaked through the remote control too, which is useful for those who like to have a digital detox.",
    "The Eufy RoboVac 15C Max has the same 0.15-gallon / 0.6-litre dust box on board as the RoboVac 11S, along with the Boost IQ mode that switches the suction level automatically when moving between carpets and hard floors. You also get the same runtime of 100 minutes in Standard mode, dropping down to 40 minutes in Max mode.",
    "The Eufy RoboVac 15C Max is perfect for busy households and families who want more flexibility over their cleaning.",
    "The Eufy RoboVac 15C Max is priced at $259.99 / £269.99 and available in the US and the UK from Eufy’s website, as well as Amazon. It’s currently not available in Australia.",
    "For a connected robot vacuum, it’s pretty reasonably priced, and only $40 / £80 more expensive than the similar but less powerful Eufy RoboVac 11S. With the option of remote, app or voice control, it offers a good amount of functionality but lacks the room mapping and more advanced controls you’ll find on pricier robot vacuums.",
    "If the thought of a chunky robot vacuum has been a barrier to buying, the Eufy RoboVac 15C Max will solve that problem. It’s only 2.85 inches / 7.25cm tall, meaning it can clean under beds and furniture with low clearance.",
    "It’s also light enough to carry it upstairs if you don’t have two, at just 5.95lb / 2.7kg and 12.6 inches / 32cm in diameter. The charging station is far more minimal than some models at 6.5 inches / 16.5cm wide and even offers storage for the cable at the rear, which means that it should be easy to find a convenient place for it, even in a small home.",
    "Like many of Eufy’s RoboVacs, the overall design is simple – a single button on top starts it cleaning in Auto mode or wakes it up, while above this is a WiFi indicator to show when it’s connected. Sensors help it steer clear of obstacles, although on test we found it often collided with objects, there’s also a bumper around it to prevent any damage.",
    "It cleans using twin side brushes and a 14.5 cm rolling brush, and has a 0.15-gallon / 0.6-litre dust box, which lives at the back of the robot vacuum, taking up almost half of its size. Rather frustratingly, the app doesn’t tell you when to empty it or when it’s full, so it’s something you’ll just need to get into the habit of doing or watch out for when it isn’t picking up sufficiently. We found it best to empty the robovac after each clean, as when the dust box is full, it can become messier to empty.",
    "There are three power levels that can be switched between using the app or the remote – Standard, BoostIQ, which alternates between Standard and Max when moving from hard floors to carpet, and Max.",
    "These are complemented by five cleaning modes – Auto, which switches between modes until it deems that cleaning is complete, Spot cleaning for specific areas, Edge that vacuums the perimeter of a room, Quick, which is a 30-minute clean that’s ideal for small rooms and Manual that allows you to steer its path using the directional buttons on the remote or the app.",
    "Schedules can only be set using the app, but unlike more basic models, you can set a whole week’s worth of cleaning times.",
    "Cleaning hard floors presented zero problems for the Eufy RoboVac 15C Max – both fine dust in the form of flour and cookie crumbs, and larger debris of oats were picked up quickly and easily on the Standard power setting.",
    "Our medium-pile carpet presented it with more of a challenge, however. While all the larger particles were picked up by the Standard setting, dust was more difficult and required the Max setting to finish the job. Even then, some fine dust was visible deeper in the carpet fibers, suggesting that it might be best to use one of the best vacuum cleaners every few weeks or so if you’re trying to keep dust at bay.",
    "The RoboVac 15C uses Bounce Navigation technology when navigating around the home. This means the cleaning pattern doesn’t always look logical – sometimes it’ll go in straight lines, sometimes seek out the edges of a room, sometimes it’ll want to travel in circles – but it does result in the entire room being cleaned, even if it can take some time.",
    "The side brushes are prone to becoming bent during cleaning though, so it’s a good idea to check their condition on a regular basis. We found emptying the dust box was simple – it slides out with a click and flips open. Dirt can clump over time, but fortunately, there’s a cleaning tool included that’s perfect for the job of getting dust out of corners.",
    "The robovac is quiet in use too - measuring a maximum of 56db on our decibel meter on Standard cleaning mode, and rising just to 63.5db when used on Max. This is the same level of noise as generated by a normal conversation in an office, which is a more than acceptable level.",
    "There’s no mapping available for the RoboVac 15C Max in the app, meaning that like other Eufy models it uses a combination of cleaning methods when in Auto mode that aim to cover the entire room. This does mean it can sometimes miss a patch but generally gets the room clean as it progresses.",
    "The lack of mapping also means that you’re unable to define specific areas, relying on the Spot cleaning mode to handle the job, and needing to physically ‘fence off’ areas where you don’t want it to go. We found during testing that moving around low objects, such as pet food bowls and piano pedals, posed a particular problem for it.",
    "Compared to other robot vacuum apps, Eufy Home, the app for controlling the RoboVac 15C Max is incredibly straightforward. We had difficulty getting connected, with multiple failed attempts, but once working, most of the options and information you need are on one screen. Plus, the icons for mode and power match the ones on the remote. However, the directional buttons on the app are less responsive than the remote, and we found that the vacuum didn’t move as smoothly when using them.",
    "The app is great for checking battery life and the vacuum’s status (ie if it’s cleaning or charging) but frustratingly, there’s no alert to let you know when the dust box is full. You’re able to schedule cleaning times over a week though, which is a huge improvement on Eufy’s non-connected RoboVacs, which can only schedule a daily cleaning time.",
    "Voice control is another handy aspect of the app and it offers Google Assistant and Alexa support so you can use your voice to set the robovac cleaning.",
    "As mentioned, Eufy says the battery will last 100 minutes on the Standard cleaning mode on hard floors. During our testing, on both hard and soft floors, from a full charge, it lasted 75 minutes before its blue button turned to orange and it stopped cleaning.",
    "It may have had some cleaning power left in it though, as it took just under four hours to recharge back to full, less than the manufacturer’s stated 5-6 hours.",
    "However, we were disappointed there’s no physical battery level indicator that offers more detailed stats about just how much charge remains - you’ll need to pick up your smartphone and open the app for this information.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Eufy RoboVac 15C Max price and availability",
    "8": "Design",
    "15": "Performance",
    "22": "App",
    "25": "Battery life",
    "28": "Don't buy it if.."
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "vacuum": "https://www.techradar.com/news/best-vacuum-cleaners",
    "RoboVac 11s": "https://www.techradar.com/reviews/eufy-robovac-11s"
  }
}