{
  "source": "https://www.techradar.com/reviews/north-st-belmont",
  "title": "North St. Belmont review",
  "category": "computing",
  "updated": "2021-11-05T17:30:12Z",
  "author": "john-loeffler",
  "summary": "The North St. Belmont has style, comfort, and solid protection",
  "verdict": "The North St. Belmont is the perfect all-purpose backpack for commuting and light-duty traveling, thanks to its excellent weatherproofing, high-quality construction, comfortable design, and surprisingly large capacity. It comes in a wide assortment of colors so it can match nearly every style, but it isn't the cheapest backpack out there and extra inside pockets will cost extra.",
  "pros": [
    "Excellent selection of colors",
    "High-quality construction",
    "Large capacity",
    "Comfortable straps"
  ],
  "cons": [
    "Expensive",
    "Interior pockets cost extra"
  ],
  "article": [
    "The North St. Belmont is easily the best backpack we've used recently for day-to-day use. Between its large capacity, comfortable straps, and wide array of customization options, the Belmont is both a stylish backpack and a very useful one for carrying around tech like laptops, tablets, and more.",
    "The backpacks themselves are all handmade in a factory in Portland, Oregon, using locally sourced materials, and the quality of the construction reflects this. From the stitching to the weatherproof lining, nothing here feels cheaply made or assembled.",
    "If you've been looking for that good ol' Made-in-the-USA backpack you've always heard your parents and grandparents talking about wistfully, the Belmont is the kind of backpack they meant.",
    "This does means that it will take more time for it to get to you than other backpacks, though they do have premade items as well that ship faster. If you're looking for a backpack that is unique to you, though, the Belmont is better than just about any backpack out there.",
    "All of this does add to the price of the bag, however, with the base backpack costing $170 (about £125 / AU$230) and North St. ships internationally, including to the UK, Australia, and many others.",
    "We say base backpack because there are additional add-ons for the backpack that you can purchase. A waist belt will cost an additional $15, and one of three different Velcro-attachable pockets will run you an additional $25 each.",
    "The North St. Belmont has a capacity of 22L, which is more than enough for school or work use, with a laptop sleeve that fits up to a 15-inch laptop. The main compartment capacity is enough to fit several textbooks and some notebooks, so students will find this backpack to be very familiar to the ones they've been using for their entire academic career, just better.",
    "We carry around a lot of tech for a living, and we found that the Belmont could hold two or three laptops with their power adapters, a Nikon DSLR camera in a carrying case, and a couple of smaller trinkets and baubles on a 40-minute commute. The straps comfortably distributed the weight, but there is definitely a limit to what it can effectively carry.",
    "With its relative lack of pockets (at least without paying extra for pocket inserts) this isn't going to be the best backpack for travel beyond being your basic personal item on a flight or train. But for basic everyday use and commuting, the North St. Belmont is absolutely one of the best backpacks you're going to find."
  ],
  "headers": {
    "0": "North St. Belmont two minute review",
    "9": "Don't buy if..."
  },
  "links": {
    "best backpack": "https://www.techradar.com/news/best-backpack"
  }
}