{
  "source": "https://www.techradar.com/reviews/bang-and-olufsen-beoplay-eq",
  "title": "Bang & Olufsen Beoplay EQ review",
  "category": "audio-visual",
  "updated": "2021-10-13T09:44:52Z",
  "author": "simon-lucas",
  "summary": "Small is beautiful – which is by no means a given for Bang & Olufsen",
  "verdict": "Since there isn’t the space for Bang & Olufsen to indulge its design fantasies here, the EQ are perhaps a slightly less individual but better focused product than the brand would otherwise have delivered. This means, for better and for worse, they compete on a more level playing field than the majority of B&O products.",
  "pros": [
    "Luxurious and tactile standard of materials, build and finish",
    "Expansive, detailed sound",
    "Great technical specification"
  ],
  "cons": [
    "Can sound slightly ‘safe’ in absolute terms",
    "No voice-control",
    "Lots of very capable alternatives"
  ],
  "article": [
    "In instances there’s no opportunity to go to town design-wise, Bang & Olufsen appears to have a more difficult job differentiating its products.",
    "But with the EQ true wireless earbuds, the company has knuckled down and concentrated on making such a product competitive in terms of performance – and the result is a diverting alternative to the established market-leaders.",
    "The EQ are specified to compete, constructed to withstand a detonation, and voiced to sound open, revealing, and rather self-consciously ‘grown-up’.",
    "The lack of voice-control is an oddity, and the earbuds themselves aren’t the most elegant you’re likely to have seen (or pushed into your ears) – but they absolutely nail the fundamentals. If you want to experience the finer details and the sheer scale of your favourite recordings, the Bang & Olufsen Beoplay EQ are nigh-on ideal.",
    "The Bang & Olufsen Beoplay EQ active noise-cancelling wireless earbuds are on sale now, and they'll set you back a not-inconsiderable $399 / £349 / AU$649.",
    "It goes without saying that the competition in this category of products is pretty stiff at any price point, but at this money, rivals are significant. The same outlay buys a pair of Bowers & Wilkins’ flawed-yet-high-performing PI7, while Sony will sell you a pair of its exhaustively specified, great-sounding and universally acclaimed WF-1000XM4 buds for $279.99 / £250 / AU$449.95. As far as competition goes, it couldn’t be much tougher.",
    "In some ways, true wireless in-ear headphones are the last product category Bang & Olufsen should be involving itself in. After all, the company has built an enviable reputation on a catalogue of products that combine very acceptable sonic characteristics with a unique design. And what’s the last thing any customer wants when considering a piece of equipment that will fit in their ears? Form dictates function with in-ear headphones, and the scope for Bang & Olufsen to differentiate itself from its competitors for design is non-existent.",
    "Still, if you can’t make them look individual then you can at least make them look big – and that’s what Bang & Olufsen has done. The Beoplay EQ are chunky earbuds: their 24 x 27 x 22mm (w x d x h) dimensions mean that they won’t go unnoticed. An 8g weight per earbud is also heavier than other true wireless models.",
    "The Beoplay EQ are beautifully built and finished, however. As well as polymer and silicone, the EQ are built from aluminum – but, because this is Bang & Olufsen, you won’t be staggered to learn it’s ‘spacecraft grade’ aluminum. In addition, tactility, alongside the quality of finish, is well up to the standard you’d expect at this price.",
    "On the inside, the EQ use a pair of electrodynamic 6.8mm full-range drivers. Wireless connectivity is via Bluetooth 5.2 (which is about as good as it currently gets), with coverage for SBC, AAC and aptX Adaptive codecs, ensuring audio/video synchronisation isn’t an issue. There are a total of six mics across the pair of earbuds, which deal with call quality and active noise-cancellation, but not voice-control – because Bang & Olufsen hasn’t included that particular facility.",
    "Control is available via the exemplary B&O Sound control app, as well as by touch using the big, responsive capacitive surface on each earbud. Using touch, you can deal with most of the obvious functions: play/pause, answer/end/reject call, and volume up/down, but not – mildly weirdly – skip forwards/backwards. The app allows volume and playback control, too, and you can use it to switch ‘adaptive’ noise-cancellation on or off. And here’s where you can make EQ alterations to your EQ earbuds, using the endlessly satisfying Beosonic graphic adjuster.",
    "Battery life is an ‘okay but nothing special’ six hours in the earbuds (more like seven, if you switch the ANC off), with another couple of charges stored in the beautifully built, beautifully finished and beautifully tactile 40 x 77 x 26mm charging case. Charging is via any Qi-certified pad or the USB-C socket on the rear of the case, with 20 minutes for another two hours or so of playback.",
    "Our most recent brush with Bang & Olufsen headphones, the noise-cancelling HX over-ears, led us to believe that B&O’s mojo is intact where its headphones are concerned. And the Beoplay EQ only reinforce that opinion.",
    "With a 16-bit/44.1kHz file of John Grant’s Disappointing playing, the Beoplay EQ are a spacious, well-defined listen that conjure a decent-sized soundstage and explain it well. Individual elements and strands of a recording are properly located, secure in their own little pocket, but not estranged from the rest of the action. The Beoplay EQ unify this quite complex recording pretty well.",
    "The low frequencies are deep, nicely shaped and textured, and carry plenty of reasonably fine detail; the low-level harmonic dynamics of a grimy analogue bass keyboard (of which this recording has plenty) are explained rather than just alluded to. Attack and decay is managed well – and, as a consequence, the low-end moves along at a respectable clip rather than hanging around and dragging at tempos.",
    "The opposite end of the frequency range is equally well-realised. There could conceivably be a touch more bite and attack to treble sounds – this tune is crying out for them, really – but they’re certainly not dull or unassertive. And they integrate well into the rest of the frequency range, which is just as it should be in a single-driver design such as this, but is by no means a given.",
    "The all-important mid-range is clean and detailed, too, with a lot of pertinent observations to make about a singer’s technique and overall character. Detail levels are high, and tonality is confidently and believably judged.",
    "Switch to a Tidal Masters file of Express Yourself by Charles Wright & the Watts 103rd Street Rhythm Band, and the rhythmic sinuousness of the recording is given adequate rather than outstanding expression. The EQ aren’t in the ‘two left feet’ category occupied by some nominal rivals, but neither are they the hip-shaking dance-floor monsters that some rivals are. Listeners who enjoy a lot of dance, or funk, or simply rhythm-driven music, might possibly find the EQ a little pedestrian.",
    "Dynamically, too, the Beoplay EQ are just slightly inhibited. They simply don’t have the headroom available to put significant distance between ‘very quiet’ and ‘BLOODY LOUD’ (as is essential when listening to Nirvana’s In Bloom, for example). So, inevitably, the Bang & Olufsen aren’t quite as visceral a listen as some of their more dynamically gifted rivals.",
    "Noise cancellation also comes under the heading of ‘good’ rather than ‘great’. The EQ do a job on external sound, of course – but it isn’t as complete a job as the almost supernaturally quiet Bose QuietComfort Earbuds. There’s also a tiny hint of counter-signal revealed during the silence between songs – it’s hardly the end of the world, of course, but it’s something not every alternative design indulges in."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Bang & Olufsen Beoplay EQ price and release date",
    "6": "Design and features",
    "12": "Audio performance",
    "20": "Don't buy them if..."
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "noise-cancelling wireless earbuds": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "PI7": "https://www.techradar.com/reviews/bowers-and-wilkins-pi7",
    "WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "HX over-ears": "https://www.techradar.com/reviews/bang-and-olufsen-beoplay-hx",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds"
  }
}