{
  "source": "https://www.techradar.com/reviews/kaspersky-password-manager",
  "title": "Kaspersky Password Manager review",
  "category": "computing",
  "updated": "2021-03-22T17:45:30Z",
  "author": "michael-graw",
  "summary": "Barebones security",
  "verdict": "Kaspersky Password Manager covers the basics well, including password auto-fill and cross-device syncing. But we found ourselves wishing for more flexibility and options for sharing passwords securely.",
  "pros": [
    "Affordable annual pricing",
    "Automatic syncing across devices"
  ],
  "cons": [
    "Data entry fields aren’t customizable",
    "No way to securely share passwords"
  ],
  "article": [
    "In search of the best password manager for securely storing your login credentials? Then it’s worth taking a close look at Kaspersky Password Manager. This software doesn’t offer much in the way of bells and whistles, but it’s fairly affordable. For basic tasks, most users will find it’s plenty capable.",
    "So, is this the right software for you? We’ll help you decide in our Kaspersky Password Manager review.",
    "Instead of adding a diversity of tools into the software, Kasperksy focused on enhancing the usability of its password manager’s core features.",
    "What stands out most about this platform is that it comes with browser extensions for Chrome, Firefox, and Edge. These enable Kaspersky Password Manager to auto-fill credentials for sites you already have accounts at. In addition, the browser extensions will automatically generate a new password when you sign up for a new account and add the data as a record in your database.",
    "The password manager also works seamlessly across devices thanks to Kaspersky’s own dedicated cloud. While the company never keeps a copy of your master password—and so can’t de-encrypt your data—it automatically syncs your database between your desktop and mobile devices. Note, however, that this syncing can’t be coordinated through another cloud storage service like Dropbox.",
    "Kaspersky Password Manager only offers individual licenses and there are no password sharing features. So it’s only suitable for individual users, not families or teams.",
    "Getting started with Kaspersky Password Manager is fast and easy. As with other password managers, you’ll start out by creating a master password for your account. If you want to use the software across multiple devices, you’ll also need to register and confirm an email account.",
    "The first time you start the platform, it will prompt you to install a set of browser extensions to enable auto-filling. You can also download any stored credentials from your browsers to add them to your database. Helpfully, Kaspersky Password Manager supports importing entries from other popular password managers as well as CSV files.",
    "Kaspersky’s app interface will look familiar to anyone who has used another password manager, but there are some important differences. The first is that there are fewer data categories. Kaspersky Password Manager has six, whereas competitors like mSecure have more than 20. Unfortunately, this can be quite limiting since you don’t have any options to add custom fields or change the default category templates.",
    "In addition, we didn’t love the way that Kaspersky Password Manager organizes information. You can create groups of entries, but there are no tags. The folder view is also a little bit harder to navigate than the simple list view that many other password managers use.",
    "The password generator in Kaspersky Password Manager is relatively standard. You can choose which special characters are allowed in a password, if any, but there’s no option to force it to create human-readable words.",
    "Kaspersky Password Manager does a good job at securing your data. The most important facet of the platform’s security procedures is that Kaspersky never stores your master password. That makes syncing across devices much more secure, in that even if your database is stolen from Kaspersky’s servers the data cannot be de-encrypted.",
    "That said, Kaspersky Password Manager doesn’t have a self-destruct feature to prevent brute forcing your password. There also isn’t an option for multi-factor authentication, which could at least alert you to a potential intrusion. For a password manager designed by a cybersecurity company, these seem like pretty significant gaps.",
    "Kaspersky offers phone and live chat support seven days a week from 9 AM to 10 PM Eastern. You can also try the virtual assistant on the company’s website, which serves as something of a smart search bar. There’s a dedicated knowledgebase for Kaspersky Password Manager, which offers a fair amount of information about how to install and troubleshoot the software.",
    "Kaspersky Password Manager has a free version that unlocks all features and works across devices. But, it’s limited to storing just 15 entries, which isn’t enough for most users. The paid version costs $14.99 per year and enables you to create an unlimited number of records. (Although this is noted as the price for new customers only, there is no price increase after the first year.)",
    "If you’re looking for a more flexible password manager, we’d recommend mSecure. This platform costs $19.99 for a lifetime subscription, so it’s actually cheaper than Kaspersky Password Manager after one year. mSecure comes with fully customizable data categories and enables you to create as many custom fields as you want. The software also matches Kaspersky Password Manager’s cross-device sync using the purpose-built mSecure cloud.",
    "Kaspersky Password Manager is an affordable software that covers the basics well, but it does leave a lot to be desired. The platform doesn’t enable you to add customized fields to your data entries, nor can you share login credentials with family or coworkers. We liked the browser extensions, but the ability to auto-fill passwords is far from unique to Kaspersky Password Manager."
  ],
  "headers": {
    "2": "Features and utilities",
    "6": "Setup",
    "8": "Interface and performance",
    "11": "Security",
    "13": "Support",
    "14": "Plans and pricing",
    "15": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "best password manager": "https://www.techradar.com/best/password-manager",
    "Kaspersky Password Manager": "https://kaspersky.sjv.io/c/221109/830031/11660?subId1=trd-us-5908908917421135000&sharedId=trd-us&u=https%3A%2F%2Fusa.kaspersky.com%2Fpassword-manager",
    "database": "https://www.techradar.com/best/best-database-software",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "email account": "https://www.techradar.com/news/best-email-provider",
    "mSecure": "https://www.techradar.com/reviews/msecure"
  }
}