{
  "source": "https://www.techradar.com/reviews/q-acoustics-q-active-200",
  "title": "Q Acoustics Q Active 200 review",
  "category": "audio-visual",
  "updated": "2021-02-05T14:58:35Z",
  "author": "olivia-tambini",
  "summary": "Wireless stereo speakers with a simple setup",
  "verdict": "The Q Acoustics Q Active 200 stereo speakers excel in terms of design, setup, and connectivity, but their lackluster audio performance sees them fall short of their biggest rival, the KEF LS50 Wireless II.",
  "pros": [
    "Hi-Res Audio support",
    "Easy to set up",
    "Lots of connectivity options"
  ],
  "cons": [
    "Lackluster audio performance",
    "Bass sounds recessed",
    "Fairly expensive"
  ],
  "article": [
    "The Q Acoustics Q Active 200 are the first active stereo speakers from the 15-year-old hi-fi specialist, eschewing the need for an external amplifier to offer fans of the brand a less complicated audio setup.",
    "Priced at $1,999 / £1,499 (about AU$2,800), the Q Active 200 wireless speakers aren't cheap. However, their excellent build quality gives the impression of a premium product, despite their innovative, distortion-busting floor stands not being included in the price.",
    "Factor in the lack of floor stands and the Q Active 200 still come in cheaper than the KEF LS50 Wireless II, which are probably their biggest competitor. And while they stand up to KEF’s phenomenal stereo speakers in terms of design and build quality, they don’t quite hit the mark for audio performance.",
    "That’s not to say that the Q Active 200 sound bad – they offer a well-balanced, natural soundstage that sounds decent, no matter where they're placed in a room. However, a lack of dynamism, rhythmic dexterity, and subdued bass means that these speakers make for a rather dull listening experience.",
    "That’s a shame, because in many other ways the Q Active 200 excel. They come with a plethora of wired and wireless connectivity options, making them among the most versatile speakers we’ve tested.",
    "Google Assistant or Amazon Alexa support (your choice) is available with the supplied Control Hub. This makes it easy to add the speakers to existing groups, assign them to a specific room in your home, as well as control them using your voice via the assistant on your smartphone or smart speaker.",
    "We tested the Google-compatible version of the speakers, finding that this integration, along with the lack of wires, made the Q Active 200 incredibly simple to set up.",
    "If you’re worried about a loss of audio quality when using wireless speakers, you’ll be pleased to learn that incoming signals are converted to 24-bit/96kHz Hi-Res Audio by the Control Hub.",
    "This converted audio is sent to both speakers simultaneously, rather than to the main speaker to pass the other audio channel to the secondary speaker, avoiding a lag between the two.",
    "Of course, the capability to present high-quality audio is only half of the job. That audio should also be conveyed sympathetically, with dynamism and energy. For all their connectivity options and high-quality wireless transmission, this is where the Q Acoustics Q Active 200 fall down – and depending on your tastes, it could prove a deal-breaker.",
    "The Q Active 200 were released in October 2020, and will set you back $1,999 / £1,499 (about AU$2,800). A pair of optional floor stands come in at $499 / £349 (about AU$550).",
    "With or without the stands, this is cheaper than the KEF LS50 Wireless II, which are probably the Q Active 200’s biggest competitor – although neither of these stereo speaker models come particularly cheap.",
    "The Q Active 200 are available in matte white or black finishes, with a minimal design that will happily fit into any space.",
    "They extend quite far out at the back, but their narrow build means that they don’t appear bulky; they're further enhanced by the elegant Tensegrity stands. The stands feature metal legs that are supported by the tension of the cables attached to them, creating a small footprint and a futuristic setting for the speakers.",
    "As well as looking rather cool, these stands are designed to minimize resonance from the floor to the speaker cabinet.",
    "On the front of each speaker is a rectangular grille, behind which are two 58mm BMR (balanced mode radiator) drive units.",
    "Rather than separating the treble, mid, and bass speakers, these drive units pack all three into one package, allowing for smaller speakers that can deliver a wider frequency range.",
    "BMR drive units also allow for almost 180 degrees of sound dispersion, which means the speakers should sound good no matter where they're placed in a room; sound is distributed evenly, both horizontally and vertically.",
    "This is further helped by a switch at the speaker's rear that allows you to designate left and right channels, as well as indicate to the speakers their position in a room – close to a wall, in a corner, or out in free space.",
    "According to Q Acoustics, this allows the speakers to fine-tune their low-frequency response. So, for example, if you have them up against a wall, the bass emanating from the rear-firing 4.5-inch long-throw subwoofers shouldn't sound overpowering as it bounces against the hard surface.",
    "The Q Active 200 come with a Control Hub configured either for Google Chromecast built-in or Amazon Works with Alexa. Its wireless design means it can be placed pretty much wherever you like, whether that’s on a bookshelf, on a rack, or in a cupboard – and it comes with a remote control, too.",
    "The Q Active 200 stereo speakers sound good, but not great – which is a little disappointing, given their price.",
    "There aren’t any glaring issues with the audio performance – they offer a well-balanced, natural soundstage, and good levels of clarity across the different frequencies – but they lack 'soul'.",
    "What we mean here is that the Q Active 200 don’t make for a particularly exciting or emotive listening experience. It’s difficult to put our finger on the reasons for this, but we believe a little more rhythmic agility and a lot more oomph in the bass frequencies would go some way to resolving the issue.",
    "Listening to Fleet Foxes’ Mykonos, we were impressed by the warm guitar tones – from strummed chords to cascading finger-picked melodies.",
    "The bass felt tightly controlled; since we had the speakers set up against a wall, this means the switches on the rear of Q Active 200 were doing their job. If anything, the bass sounded too subdued, and this was a problem we encountered with all of the tracks we played through these speakers.",
    "Something about the rhythmic handling of the tracks feels lackluster, too. The Q Active 200 just don’t have the agility or impeccable timing of the KEF LS50 Wireless II, which made music feel a little flat.",
    "It was the same story with Passion Pit’s Sleepyhead. Everything sounded well-balanced and clear, but there was a distinct lack of energy from this usually bombastic track – highlighting the difference between a good pair of speakers such as the Q Active 200, and a phenomenal pair of speakers such as the KEF LS50 Wireless II.",
    "Saying that, the Q Active 200 displayed a decent amount of detail in the upper-mid and treble frequencies, which made pop tracks sound sparkly and nimble. The pulsing synths and driving percussion in Little Dragon’s Shuffle A Dream fared particularly well in this regard, while vocals sounded smooth and prominent.",
    "All in all, the Q Active 200 offer a well-balanced sound performance, if not a particularly interesting one.",
    "All the connectivity options for the Q Active 200 come courtesy of the Control Hub, which links the speakers wirelessly and converts audio to 24-bit/96kHz Hi-Res Audio. This converted audio is sent to both speakers simultaneously, rather than to the main speaker to pass the other audio channel to the secondary speaker, avoiding a lag between the two.",
    "You can connect the Control Hub to the internet using an Ethernet cable or via your Wi-Fi network, and you can also connect to wireless sources via Bluetooth, Spotify Connect, AirPlay 2, and Roon.",
    "Support for streaming services is comprehensive, with the ability to play music directly from Spotify, Apple Music, Tidal, and more. Plus, if you have a large digital library on your computer, the Q Active 200 double up as a UPnP media player.",
    "Wired connectivity is thorough, too. The Control Hub comes with an HDMI ARC input, analogue input, optical input, and a subwoofer output, as well as a built-in phono stage, so you can hook the speakers up to your turntable.",
    "As we mentioned, the Control Hub is compatible with either Google Assistant or Alexa. We tested it with Google Home, which allows you to control the speakers via voice commands to Google Assistant through your smartphone or smart speaker. You can also cast audio to the speakers via Chromecast, and add them to your existing Google speaker setup.",
    "We found this worked really well; in fact, Google integration made the speakers super-easy to set up via the Google Home app."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Q Acoustics Q Active 200 price and release date",
    "12": "Design",
    "21": "Audio performance",
    "30": "Connectivity",
    "36": "Don't buy them if..."
  },
  "links": {
    "stereo speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "KEF LS50 Wireless II": "https://www.techradar.com/reviews/kef-ls50-wireless-ii",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "turntable": "https://www.techradar.com/news/best-turntables"
  }
}