{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
  "title": "Samsung Galaxy Buds 2 review",
  "category": "audio-visual",
  "updated": "2021-08-27T13:19:14Z",
  "author": "nick-pino",
  "summary": "The second-generation Samsung Galaxy Buds 2 are a huge improvement",
  "verdict": "The Samsung Galaxy Buds 2 are a huge improvement over the originals, offering active noise cancellation, better sound quality, and a great fit. While they’re not the best true wireless earbuds out there, they’re easily one of the best for Samsung smartphone owners who want perfect synchronicity with their Galaxy gear.",
  "pros": [
    "Active noise-cancellation",
    "Balanced sound",
    "Improved call quality",
    "Galaxy Wearable app is useful"
  ],
  "cons": [
    "ANC could be stronger",
    "No sub-bass response",
    "No always-listening Assistant",
    "Only IPX2 rating"
  ],
  "article": [
    "Samsung has a reputation for launching new true wireless earbuds in quick succession, and the Samsung Galaxy Buds 2 are the company's latest.",
    "As a follow-up to the original Samsung Galaxy Buds that were released in 2019, the Buds 2 offer a vast number of improvements, from sound quality and fit to active noise cancellation.",
    "It’s these myriad improvements that make them an easy recommendation for owners of the original Galaxy Buds looking for a newer set of true wireless earbuds, and a competent competitor for the likes of the Apple AirPods. To that end, you’ll get more features on Android –and specifically Samsung – smartphones than any other kind of device, but they are compatible with both iOS and Android.",
    "While we really liked the two-driver design of the earbuds and their well-balanced soundstage, the Buds 2 do have their weak points. Their noise cancellation isn’t class-leading, and the frequency range only really starts at around 80Hz, meaning you won’t hear (or feel) any of that thumping bass. There’s no always-listening assistant at launch, either.",
    "None of the above are deal-breakers by any means, but they do make the Samsung Galaxy Buds 2 a bit weaker in terms of audio and ANC performance than some of the other true wireless earbuds we’ve seen this year, like the Sony WF-1000XM4 and Beats Studio Buds.",
    "Whether these are the earbuds for you will depend on which smartphone you use, the level of noise cancellation you feel like you need, and your preferred style of music – but we think everyone will appreciate the feature set, performance, and price, even if there are still a few better earbuds out there on the market right now.",
    "The Samsung Galaxy Buds 2 were unveiled at Samsung’s online Unpacked 2021 event alongside the new Galaxy Z Fold 3, and are available to buy for $149.99 / £139.99 / AU$219.",
    "They cost as much as the original Samsung Galaxy Buds did when they launched back in 2019 (except for in Australia, where they're cheaper) and line up exactly with Apple’s new Beats Studio Buds, which share many of the same features. We like them just as much as the Studio Buds, and found them even better than Apple’s most popular earbuds, the Apple AirPods.",
    "That said, these aren’t the only earbuds Samsung’s made over the years and their predecessors – the Samsung Galaxy Buds, Samsung Galaxy Buds Live, and Galaxy Buds Plus – can make it a bit confusing when shopping around for a new pair of true wireless earbuds, especially considering there’s only about a small difference in price between them.",
    "One way of telling the Galaxy Buds 2 apart from its siblings is by its design. If the Samsung Galaxy Buds Live most closely resemble beans, the Samsung Galaxy Buds 2’s closest comparison are pebbles; they’re small, mostly round, and are super smooth. They fit into a rounded plastic case that slides easily into a pocket, too.",
    "Once you open the case, you’ll see the Buds themselves in one of four colors: Lavender, Olive, White, and Graphite. However, it’s worth noting that the Buds themselves and the inside of the case will have a distinctive color but the outside of the case won’t – it will always be white.",
    "According to Samsung, the new Galaxy Buds 2 are 15% smaller and 20% lighter than the Samsung Galaxy Buds Plus, and that makes them easier to wear for long periods of time. The downside of them being a bit smaller is that they’re a little harder to handle and can slip out of their case and your ears more easily.",
    "Thankfully, because the Buds are magnetized to hook onto the metal charging pins in the case it won’t happen frequently, but we’d definitely advise being careful with them when pulling them out or putting them back in their case, lest they accidentally fall out and bounce somewhere where you can’t reach them.",
    "One weak spot of the Galaxy Buds 2’s design is that they’re only IPX2 water-resistant, which means they’re only good for workouts that don't involve a lot of sweating. Take them outside when it’s pouring, snowing, or with you to the beach and, well, that could be the end of them.",
    "To control the Galaxy Buds you can use their built-in touch controls or your smartphone. They’re fairly intuitive (play / pause with one tap, skip forward with two taps and three to rewind), and a recent firmware update has improved the buds even further in this regard, adding the ability to double-tap the edge of the earbuds to turn the volume up or down.",
    "Inside the box, you’ll find two extra silicone eartips and a USB-C charging cable for the Buds. The silicone tips aren’t necessarily more comfortable than some foam eartips you might’ve tried in the past, but they offer a decent seal that you can test with the Galaxy Wearable app on Android, and should be cheap to replace if you lose them.",
    "So, what else has changed since the originals? The latest Galaxy Buds 2 have a dual-driver design that use a single mid-range driver and a separate tweeter for the upper registers – like the Galaxy Buds Pro. Both inside and outside the earbuds are microphones – three of them to be exact – that the Buds use to cancel noise and improve call quality.",
    "Of course, when you talk about the new Galaxy Buds 2, you have to talk about the noise cancellation – something that was missing from the original Galaxy Buds.",
    "Noise cancellation is turned on by holding either earbud’s touchpad. You can customize that function through the Galaxy Wearable app to something else – like summoning your virtual assistant – but we recommend keeping at least one of the controls set for noise cancellation. A recent firmware update has also added the ability to activate ANC even when you’re using just one earbud.",
    "Speaking of assistants, we’re kind of disappointed that Samsung didn’t build an always-listening assistant into the Galaxy Buds 2, and it might mean that they’re less compelling for folks who don’t want to have to tap a button to summon their voice assistant.",
    "Press the noise cancellation button again and you'll switch to the ambient mode, which pipes outside audio into the Buds. That may sound like the exact opposite of what you’d want, but it’s surprisingly helpful if you want to have a conversation without taking out the Buds or when you’re listening for your flight number to be called. The aforementioned firmware update has added the ability to activate ambient mode during calls, too, so you can listen to things around you even when on the phone.",
    "That said, the control settings aren't the only things you can change inside the Galaxy Wearable app – you’ll also see options to change the EQ, as well as being able to see how much battery life the case and earbuds have left. That’s also where you’ll find the Earbud Fit Test and the Find My Buds option – though the latter does require you to sign in with a Samsung account.",
    "The only disappointing part is the fact that many of these features are only available on the Android version of the app. The iOS version hasn’t been updated yet and that means customization is impossible until it receives an update.",
    "To end on a high note, in terms of codec support you’ve got both the mainstay SBC and AAC codecs, but also Samsung’s proprietary Scalable Codec if you’re connected to a Samsung device. The latter enables noticeably improved audio quality over the basic SBC codec and makes the Buds a solid pick for Galaxy phone owners.",
    "You have to hand it to Samsung and AKG: each generation of the Galaxy Buds moves closer and closer to that sonic sweet spot, and the Galaxy Buds 2 are no exception.",
    "What we love most about their sound is that they have a wonderful sound curve that amps up the bass, mids and highs, only missing out on the sub-bass (below 80hz) and the upper-most registers (11,000Hz and above), which can get a bit harsh at higher volumes.",
    "Most of the time, however, what you’re treated to is surprisingly clear audio that has a decent uptick in the bass when listening to EDM and rap, and a crisp mid-range for rock and R&B. With good stereo separation, you can hear great sweeping effects in songs like Baba O'Riley by The Who, and while the soundstage isn’t absolutely massive, it’s much wider than we heard on the first-generation Galaxy Buds.",
    "Despite those very, very minor quibbles though, these are great-sounding earbuds.",
    "Where the Samsung Galaxy Buds 2 still have a lot of room for improvement is in their active noise cancellation. Look, we’re happy that it’s finally in the entry-level Galaxy Buds line, but it’s still lacking compared to market leaders like the Bose QuietComfort Buds and Sony WF-1000XM4.",
    "With music playing and ANC turned on, you probably won’t be able to hear someone talking to you in the same room, but you’d hear any loud noise coming from outside your home. Overall, they’re good enough for routine office work, but we wouldn’t recommend them for long flights or particularly busy job sites.",
    "While ANC still has room to improve, Samsung has found some success upgrading the call quality on its earbuds. The Galaxy Buds 2 use machine learning to eliminate background noise during phone calls and friends we spoke with said we sounded noticeably clearer compared to using a regular smartphone for the call.",
    "Although we had a few issues with crackling on our end, they still performed significantly better than other earbuds we’ve tested in the past, and should be good office companions if you make a lot of phone calls.",
    "If you were to use them non-stop, the Samsung Galaxy Buds 2 should last you about five hours with active noise cancelling turned on, and a little longer if you turn that off. Inside the case are at least another three charges for a total of 20 hours with ANC on, or 29 hours if you leave it off.",
    "Of course, battery life is dependent on how you use the earbuds. The above battery life is for listening time, if you use them for conversations you’re looking at only 3.5 hours with ANC on, and 13 hours with the case or 3.5 hours and 14 hours with ANC turned off.",
    "Helping to optimize the battery life is the addition of a proximity sensor on the inside of the buds that will automatically pause the music when it senses that the earbuds are outside your ear canal. By pausing music automatically like that, you’ll save some juice and therefore won’t need to charge them as frequently.",
    "Also new for this generation is support for wireless charging with a compatible Qi charger. That’s a nice perk if you’re using a phone with wireless charging and you already have a charging pad, but it’s not a deal-breaker if you need to use the regular ol’ USB-C port on the back of the case.",
    "The only thing that’s missing here is fast-charging – though you’ll still get decent charging speeds. In our tests, we were able to reach a 12% charge in the case after 10 minutes on the charger, which would be over an hour of listening. That might not be the speed of other fast-charging earbuds that can reach a 25% or 50% charge in 15 minutes, but it’s not bad."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Samsung Galaxy Buds 2 price and release date",
    "9": "Design",
    "17": "Features",
    "24": "Audio performance and noise cancellation",
    "32": "Battery life",
    "37": "Don't buy them if..."
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "smartphones": "https://www.techradar.com/news/best-phone",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Beats Studio Buds": "https://www.techradar.com/reviews/beats-studio-buds-review",
    "Unpacked 2021": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "Bose QuietComfort Buds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds"
  }
}