{
  "source": "https://www.techradar.com/reviews/ninja-foodi-max-15-in-1-smartlid-multi-cooker",
  "title": "Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker review",
  "category": "appliances",
  "updated": "2021-11-23T11:00:45Z",
  "author": "helen-mccue",
  "summary": "A large-capacity smart multi-cooker that can do everything",
  "verdict": "The Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker is the latest and greatest innovative multi-cooker from Ninja. From pressure cooking to air frying, sautéing to steaming and lots more in between, there’s no shortage of foods that can be cooked in this multicooker. All cooking functions use the same lid and it’s easy to operate with lots of cooking charts to give time and temperature guidance. It’s an excellent bit of kit but the high price will be hard to justify for some.",
  "pros": [
    "Large capacity",
    "Built in thermometer for perfect meats",
    "Offers lots of cooking methods"
  ],
  "cons": [
    "Expensive",
    "Bulky",
    "No food presets"
  ],
  "article": [
    "Ninja offers some of the best Instant Pot alternatives on the market, and despite having only launched its first multicooker with air frying capabilities in 2018, Ninja has continued to innovate and now come up with a whole new design that’s more convenient than ever.",
    "The Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker is known as the Ninja Foodi 14-in-1 8-qt. Smart XL Pressure Cooker Steam Fryer with SmartLid in the US. The UK and US versions differ slightly in terms of the functions on offer but for the most part, they’re the same.",
    "One of the biggest new features that stands out is the SmartLid, which comes with a built-in thermometer so you can monitor the temperature of meats and fish and adjust it to automatically produce anything from rare to well-done results.",
    "The UK model has 15 functions while the US model has 14, and both models offer the typical culinary options such as pressure cook, slow cook, and steam as well as air fry and bake. However, for the first time, there’s also an option to combine steam and browning for crisp foods that stay juicy on the inside.",
    "With all these features, this new Ninja multi-cooker offers far more than even the most premium model available from Instant Pot. It’s a top-performing multi-cooker that excelled in our tests. The large capacity makes it perfect for bigger households, but everyone should be able to cook up a storm in this innovative appliance.",
    "The Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker, which as we've already mentioned is known as the Ninja Foodi 14-in-1 8-qt. Smart XL Pressure Cooker Steam Fryer with SmartLid in the US, is priced at List price: £299.99 / $349.99. It’s available from the Ninja Kitchen website in both the US and the UK.",
    "It’s the most expensive multicooker we’ve reviewed to date but it’s also the most advanced and innovative model, not only from Ninja but across the board. It’s worth noting that there are a couple of smaller models in this range that are less expensive, check out our review of the Ninja Foodi 11-in-1 SmartLid Multi-Cooker (known as the Ninja Foodi 14-in-1 6.5qt. Pressure Cooker Steam Fryer with SmartLid in the US) which lacks some of the features seen in this model but still has some and is less expensive.",
    "There are plenty of things to love about the Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker but the size and weight isn’t one of them. It measures 36 x 35 x 36cm / 14.25 x 14.21 x 15.39 inches (h x w x d) although this chunky size can be forgiven somewhat due to the large cooking capacity. The 7.5 litre / 8-quart cooking pot allows plenty of space for large recipes and batch cooking. At 11.7kg / 25.8 lb you won’t want to move it too regularly, so it’s best if you can find a permanent space for it on the countertop.",
    "In addition to the main cooking pot, it comes with a two-tier reversible cooking rack and a crisping basket, all of which are dishwasher safe. The cooking pot is non-stick which makes it easy to clean even if you don’t have a dishwasher. There’s a digital cooking probe stored in a little compartment on the side, ready to be put to use when needed. Once the probe is plugged into the lid you can choose either the beef, pork, lamb, fish, or chicken preset and then also choose from nine levels of cooking which range from rare up to well done, allowing the cooker to create the perfect results for you. But if you prefer a more hands-on approach, there’s a manual setting that allows you to choose your target temperature.",
    "It’s super easy to use thanks to three automatic steam release settings when pressure cooking. This makes the steam release process completely hands-free which is a dream if you’re nervous about this part of pressure cooking or just don’t want to have to think about it.",
    "The lid has a slider to switch between the pressure function, combi-steam, and air fry/ hob plus all other functions. It doesn’t allow you to select a function unless the slider is in the correct position. This ensures the lid is correctly sealed for each cooking method.",
    "The UK model has 15 different cooking functions, which are: pressure, air fry, grill, bake, dehydrate, prove, sear/ sauté, steam, slow cook, yogurt, steam meals, steam air fry, steam roast, steam bake, and steam bread as well as a keep-warm function. The US model doesn’t offer the steam meals, steam roast or steam bread functions, but does have a sous vide function instead.",
    "Aside from the probe presets mentioned above, there are no other presets for different meals and foods, but it does come with a recipe book that includes lots of cooking charts for common foods, providing a really useful starting point.",
    "This multicooker is easy to use and we found the cooking timetables that come in the box proved helpful and accurate.",
    "First up we steamed some broccoli using the steam function and the reversible rack. We followed the instructions for the amount of water and set it to steam for eight minutes. The broccoli florets were big enough to fit on the rack, but smaller vegetables might fall through. It took seven minutes to preheat, so the total time was 15 minutes. The cooked broccoli was the perfect al dente texture. During cooking there is some noise from the fan and quite a lot of steam is ejected out of a vent at the back. So it’s worth thinking about where you place it, because if it’s under a shelf or cupboard, you might get condensation forming.",
    "For pressure-cooked brown basmati rice, we followed the weight and time detailed in the cooking chart. The cook time was seven minutes with a nine-minute preheat and then an automatic delayed pressure release which took 10 minutes. So the total cook time was 26 minutes which is only a few minutes longer than it usually takes on the stove. The finished rice was perfectly cooked and with the automatic pressure release, it was very hands-off and far more convenient than watching it as it boils in a pot.",
    "We made a slow-cooked beef chili which we cooked on the slow cooker setting for six hours on high, making use of the sauté function to brown the beef and vegetables before slow cooking. The only frustrating part was that the cooking pot isn’t completely flat, it’s higher in the middle so the oil naturally falls to the edges of the pot while sautéing, otherwise, it works well. The beef chili thickened much more in this multicooker than when we’ve made it in others and the result was a flavorsome meal with soft meat and a rich thick sauce. The finished temperature was 89 C / 192 F",
    "Again, we used the recommendations in the cooking chart when making thick-cut fries using the air fry function. The fries were cooked to perfection with fluffy insides and crisp outsides in just 22 minutes at 200 C / 390 F. We cooked them in the air fry basket and stirred twice for more even results.",
    "To try out the meat thermometer, we air-fried a sirloin steak. Once the thermometer is in place, it’s just a matter of selecting your preference, in this case medium rare, and then the Ninja does the rest. It monitors the temperature in the center of the steak until it’s cooked to perfection. Our medium-rare steak cooked exactly as we hoped. The fat on the side had rendered well and had a deliciously crisp texture. If you struggle to cook the perfect steak, you’ll love this feature.",
    "Before pressure cooking a Thai red curry, we browned chicken legs using the sauté function on the highest of the five heat settings. There’s no preheat time when sautéing, although it does take a few minutes to start sizzling. Once all the ingredients were in the pot, we set it to pressure cook on high for 20 minutes and selected auto quick pressure release.",
    "The preheat took 10 minutes and at the end, the automatic pressure release took a further four. So in just 34 minutes, we had a delicious Thai curry with moist tender chicken that was falling off the bone. The pressure release registered 81dB on our sound meter which was the loudest of all the cooking modes we tried. This is similar to a truck travelling down the road at 40mph, but as it’s only for a short time it didn’t really bother us.",
    "Lastly, we had a go with one of the new innovative combi-steam functions, steam air fry. It steams food at the same time as browning it so that it doesn’t dry out. We placed two skin-on chicken breasts on the reversible rack, followed the cooking chart for times and amount of water in the pot, and set it going for 20 minutes.",
    "There was a six-and-a-half-minute preheat before it started counting down the 20 minutes on the timer, and as with steaming, a lot of steam is vented out of the back during cooking. But we were impressed with the finished chicken. The skin was super crisped while the meat underneath remained succulent and very moist and it was thoroughly cooked through. The metal part of the lid reached 55 C / 131 F during cooking which was the hottest temperature we measured on the outside of this multicooker during any of the tests. Most of the time the exterior was comfortable to touch regardless of the cooking function we were using."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker price and availability",
    "7": "Design",
    "13": "Performance",
    "23": "Don't buy it if..."
  },
  "links": {
    "best Instant Pot": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers"
  }
}