{
  "source": "https://www.techradar.com/reviews/surface-laptop-4",
  "title": "Surface Laptop 4 review",
  "category": "computing",
  "updated": "2021-11-25T20:37:17Z",
  "author": "jackie-thomas",
  "summary": "The ultimate Surface Laptop",
  "verdict": "The Surface Laptop 4 might just be one of the best laptops for writers, with one of the best keyboards we've ever used. It could use a few more ports, but it's an easy laptop to recommend to anyone that is going to be typing a lot.",
  "pros": [
    "Comfortable keyboard",
    "Beautiful screen",
    "Lightweight and affordable"
  ],
  "cons": [
    "Not enough ports",
    "Alcantara might get gross over time"
  ],
  "article": [
    "The Microsoft Surface Laptop 4 has arrived at kind of a weird time when many people have found themselves working from home due to a global pandemic. Ultrabooks like it have traditionally shined in the commuting world, which means that they’ve lost a bit of their gleam.",
    "Lucky for the Surface Laptop 4, lockdowns don’t last forever. Many will surely adopt a more hybrid work model, splitting the work week between their home and the office. So, having something that’s light and portable – as well as powerful and long-lasting – will be key. And, that’s when the thin and powerful Surface Laptop 4 will truly shine.",
    "This Surface Laptop is thin and portable yet powerful enough to see you through most everyday workloads and a pleasure to use thanks to the gorgeous PixelSense display and one of the most comfortable keyboards we've ever typed on. It’s exactly the laptop we see ourselves taking to the office once that's a possibility again. Even in the shadow of the upcoming Surface Laptop Studio that was announced in the Microsoft Sept 22 event.",
    "The best part is that it's pretty reasonably priced for what it is. At the ground level, you're paying $999 (£999, AU$1,599), and that will get you the 13-inch Surface Laptop 4 with a Ryzen 5 processor, 8GB of RAM and a 256GB SSD.",
    "That might not be the cheapest, but it's about the same as you'd pay for a similarly spec'd Dell XPS 13 - and that one doesn't have the Ryzen processor. And, because the Surface Laptop 4 is such a dream to work on, the specs are almost secondary, especially if the bulk of your work is word processing and email.",
    "That's what our workload looks like, and it's a big reason why this is one of our favorite laptops right now.",
    "The Surface Laptop 4 starts at $999 (£999, AU$1,599). That price will get you the starting 13.5-inch configuration with an AMD Ryzen 5 processor, 8GB of RAM and a 256GB SSD.",
    "If you want to go up to a 15-inch model, you're looking at a Surface Laptop 4 price of $1,299 (£1,299, AU$2,199). That starting configuration gets you an AMD Ryzen 7 processor, 8GB of RAM and a 256GB SSD.",
    "That means the biggest difference between the 15- and 13-inch Surface Laptop 4, at the entry level is the CPU. The AMD Ryzen 5 4680U is a 6-core, 12-thread part, where the Ryzen 7 4980U is 8-core, 16-thread. So, the 15-inch is going to be a bit better at heavily multi-threaded workloads like video editing. Everything else is basically the same.",
    "The 15-inch laptop does technically have a higher resolution, but it's the same pixel density. It's 201 PPI on either laptop, so there's not going to be a noticeable difference either way you go. Still, a bigger laptop screen is a bigger laptop screen.",
    "You can also upgrade the rest of the laptop's hardware if you need a bit more power. And, oddly, the higher configurations feature Intel hardware instead of AMD. The most powerful Surface Laptop you can get is the 15-inch model with an 11th-gen Intel Core i7 processor, 32GB of RAM and a 1TB SSD for $2,399 (£2,399, AU$3,999).",
    "It's definitely an odd configuration, given that the workloads that would need the most RAM are the same workloads that would need the extra processor power that the Ryzen 7 4980U would bring to the table. Hopefully, Microsoft adds that configuration at a later date, we're sure there's some traveling video editor somewhere that would appreciate it.",
    "The Surface Laptop has always been a gorgeous piece of hardware, and the Surface Laptop 4 is definitely no exception. The model we got in for review is the 13.5-inch Surface Laptop 4, and it is one of the most lightweight and thin laptops we've ever used that doesn't totally suck to type on.",
    "It comes in four color options, and we got the Platinum option. It's beautiful. The lid of the Platinum Surface Laptop 4 is, well, platinum-colored, with the only marking being a chrome Microsoft logo square in the middle of the laptop. The bottom of the laptop looks similar, but the keyboard tray has a slightly darker color.",
    "The laptop is just 0.57 inches thick and weighs just 2.79 pounds (1.3 kg), which makes it a breeze to carry around in your bag while commuting around. But even with the Surface Laptop 4 being so thin, it still feels incredibly robust.",
    "The lid is made of aluminum and has absolutely no flex to it. And, unlike a lot of other touchscreen laptops out there, when you poke that the display the hinge is so solid that you don't have to readjust your screen afterwards or brace it with your other hand. This in and of itself makes using the touchscreen way more convenient and makes it feel like less of a gimmick – something other laptop manufacturers can definitely learn from.",
    "But as solid as the top of the laptop is, the story of the keyboard deck is all about comfort. As is now traditional with the Surface Laptop, the keyboard and trackpad are surrounded by an Alcantara material that is nice and soft (it's a suede-like microfibre pile). It makes typing so much more comfortable right out of the gate, because instead of this hard metal like you get with most comparable laptops, it's nice and soft.",
    "But there's a downside to it. If you spill something on this material, or you get crumbs on it during a lunchbreak, we get the feeling that it will get dirty and would be a bit harder to clean than it otherwise would be. But if you're conscious of hygiene and don't find yourself stuffing your face while also trying to get the project that's due in the morning out the door, it should be perfect.",
    "One of the biggest casualties of the thin size, however, is the lack of ports. All you get here is the Surface Connect port on the right, one USB-C, one USB-A and a headphone jack. We do appreciate that the laptop still has a USB-A port, something that's far from guaranteed these days, but it doesn't leave much room for expansion for anyone that doesn't want to shell out the extra cash for a Surface Dock.",
    "The Surface Laptop 4 display is also genuinely gorgeous. The 13.5-inch model we have is a 3:2 PixelSense display with a resolution of 2,256 x 1,504, which is about perfect for the display size. This does make watching movies and videos on this laptop a bit weird, as you get two black bars when viewing 16:9 content. But when we're working on this thing, we love the extra vertical space - especially when writing.",
    "Speaking of writing, the Surface Laptop 4 has what is hands down the best laptop keyboard we have ever used. Writing on this laptop is completely effortless, and it somehow has plenty of travel despite the super-thin chassis. Even the MacBook Pro's keyboard doesn't compare, and that was our favorite laptop keyboard before we tried this one out.",
    "The deep travel of the keyboard is even more surprising when you realize that the speakers are under there. It's part of Microsoft's design policy that there shouldn't be any visible holes (that aren't ports, at least). And, the speakers are fine. This isn't a media consumption device by any means, but these speakers will play music fine. Even bass-heavy tracks like Dorian Electra's Flamboyant sound great, even if there's a little left to be desired.",
    "What keeps the design of the laptop for being perfect, however, are the large bezels. They look like they're from a laptop from five or six years ago. The bezels don't destroy the experience or anything, but if you look at this laptop next to, say, the Dell XPS 13, it may look a little out of date.",
    "The Surface Laptop 4 we reviewed here is equipped with an Intel Core i7-1185G7 and 16GB of RAM, which means it has no problem with anything we threw at it. Even when we loaded this laptop up with literally dozens of Chrome tabs, while listening to music through YouTube and chatting on both Slack and Discord, the Surface Laptop 4 doesn't show any sign of slowing down.",
    "That's something that most laptops these days should be able to do, but what makes the Surface Laptop 4 so impressive is that it is able to do all of that without slowdown, while we are on battery power.",
    "We're able to just chill on our couch while working, without worrying about either the laptop locking up or tripping our roommates with the power cable.",
    "And, when plugged in, the laptops speak for the performance of this laptop. In Cinebench R23, the Surface Laptop 4 was able to get a solid 4,998 points, which is about what we would expect out of this processor.",
    "Similarly in Geekbench 5, the Surface Laptop 4 got a single-core score of 1,356 points and 4,918 in multi-core. If you're after a super-portable laptop that can get some work done, the Surface Laptop 4 can certainly get the job done.",
    "Also while the Surface Laptop 4 definitely isn't built for gaming, it was able to get a pretty respectable 5,151 points in 3DMark Fire Strike, which means it should be able to handle some of the best indie games. Just don't go thinking you can run Cyberpunk 2077 at max settings or anything.",
    "Microsoft claims that the Surface Laptop 4 gets up to 19 hours of battery life, which would be huge if it actually did. Unfortunately, we found that the number was closer to 11-13 hours. That's still nothing to shake a stick at.",
    "In the PCMark 10 Home Office battery test, which simulates a variety of workloads from video chatting to word processing, the Surface Laptop 4 lasts 13 hours and 20 minutes. Sure, that's not quite the 19 hours that Microsoft promises, but it's still more than enough to get you through all but the longest international flights.",
    "The Surface Laptop 4 struggles a bit more in our video playback test, where it lasts 11 hours and 2 minutes. That's still not bad, though, and means that the Surface Laptop 4 should see you through a pretty long Netflix binge.",
    "When you consider that the Surface Laptop 3 only lasted 6 hours and 28 minutes in the PCMark 8 battery test, the Surface Laptop 4 marks a huge generational improvement. Hell, the Surface Laptop 4 even outlasts the Dell XPS 13 by two whole hours.",
    "The best thing about any Surface device, including the Surface Laptop 4, is that you're getting a pristine installation of Windows 10.",
    "There is not a trace of bloatware present, which means that the laptop boots up nice and quick every single time, and you don't have to spend your first hour with the laptop disabling startup programs or uninstalling things. Honestly, that's almost enough for us to recommend this laptop right off the bat.",
    "And unlike the first Surface Laptop, it's a full Windows 10 installation, too - no S-Mode here - so this clean slate means that you can easily make the Surface Laptop 4 yours.",
    "The Surface Laptop 4 does come with a free Windows 11 upgrade. However, we have not managed to test with the new operating system, having done our review prior to its release."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Surface Laptop 4 price and availability",
    "12": "Design",
    "23": "Performance",
    "29": "Battery Life",
    "33": "Software and features",
    "37": "Don't buy it if..."
  },
  "links": {
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Surface Laptop": "https://www.techradar.com/reviews/microsoft-surface-laptop-review",
    "Surface Laptop Studio": "https://www.techradar.com/reviews/microsoft-surface-laptop-studio",
    "Microsoft Sept 22 event": "https://www.techradar.com/news/microsoft-announces-surface-go-3-surface-laptop-studio-surface-pro-8-and-more-ahead-of-windows-11-launch",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "15-inch laptop": "https://www.techradar.com/news/best-15-inch-laptop",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}