{
  "source": "https://www.techradar.com/reviews/acer-swift-3x",
  "title": "Acer Swift 3X review",
  "category": "computing",
  "updated": "2021-08-09T13:26:26Z",
  "author": "hamish-hector",
  "summary": "A laptop for the fast lane",
  "verdict": "The Acer Swift 3X is a brilliant laptop, packaging Intel’s latest tech into an incredibly light package. With its incredible battery life and generally impressive performance, this laptop is great for those who want to be able to do their work from just about anywhere and don’t mind working on a smaller device.",
  "pros": [
    "Superb battery life",
    "Small and lightweight",
    "Great screen"
  ],
  "cons": [
    "Not the cheapest",
    "Few ports",
    "Smaller screen"
  ],
  "article": [
    "We were very impressed with the Acer Swift 3X. It’s a brilliant laptop that manages to deliver a lot despite its size and weight. This very well could be the best Acer laptop – if not the best laptop – for someone who works on the go.",
    "At just 3.1lbs (1.4kg) the Swift 3X is incredibly light, and measuring only 12.7 x 8.4 x 0.7-inches (17.95 x 322.8 x 212.2 mm) you shouldn’t have any trouble carrying this laptop with you on your commute.",
    "The model we were sent was packaged with an Intel Core i5-1135G7 processor, 8GB RAM, a 512GB SSD and an integrated Iris Xe Max graphics chip. The Acer Swift 3X had more than enough power to handle a typical workload in most jobs - and it’ll have school and college work covered too.",
    "An upgraded version of the Swift 3X with an Intel i7 CPU alongside 16GB RAM and 1TB SSB will likely be overkill for most people, but if your work needs the power boost it’ll be worth it.",
    "The only downside of the hardware is the screen. The display itself looks good, but 14-inches can be noticeably small. If you’re used to a larger monitor, it takes a little adjusting to.",
    "However, you can’t complain about the battery. This thing lasts for a surprisingly long time, so as long as it’s fully charged up when you leave, you should be able to get away with leaving your laptop charging cable at home.",
    "In the worst-case scenario, if you carry a USB-C phone charger around you should be able to keep your device alive for a while longer.",
    "All of this is packaged in a reasonably priced, mid-range laptop that is well worth the $899.99 / £899.99 / AU$1,199 price tag it comes with. If you're looking for your next work laptop, the Acer Swift 3X is definitely one to consider.",
    "The Acer Swift 3X is available starting at $899.99 / £899.99 / AU$1,199. At that price you’ll get an Intel Core i5-1135G7 processor, 8GB RAM, a 512GB SSD and a 14-inch full-HD screen. You’ll also get Intel’s integrated Iris Xe Max graphics.",
    "That’s the model we tested, and we’d safely say that for what you’re paying, you’re more than getting your money’s worth out of this laptop.",
    "For $1,199 / £1,199.99 / AU$1,599.99 you can grab a version of the Acer Swift 3X with an Intel Core i7-1165G7 processor, 16GB RAM and 1TB SSB. The cheaper version offers more than enough power for regular use, but if you’re looking to spend a bit more for a laptop that packs a stronger punch you’d again be hard pressed to find something better.",
    "As for availability, it seems like the Swift 3X is a popular laptop as it was a little difficult to find when we searched for it online. It can take a little bit of looking across the UK, Australia and the US to find the exact model you’re after — something that isn’t helped by the similarly named Swift 3.",
    "However, the Acer Swift 3X is well worth looking for, as it should be able to pull off almost everything you could need. It’s not going to be suited to heavy duty tasks like 4K video editing or high-end gaming, but for regular work — and more casual photo or video editing — we found this laptop can more than handle what you throw at it.",
    "What you get with the Acer Swift 3X is a fairly standard, yet clean, laptop design. It won’t blow you away, but we still like the look and feel of it. Our only worry is that the screen seems a little thin, as it feels like it wouldn’t take much to break it — though thankfully we didn’t find out during our review.",
    "Apart from that, the HD display is good. Acer’s Swift 3X comes with a 14-inch (35.6 cm) LCD screen that looks great and uses ComfyView (anti-glare) technology. A slightly larger display would be nice, but that’s our only complaint on this front.",
    "We’re also fans of the fingerprint scanner. It was as easy to set up as on any smartphone, and we found it reliable too. However, it was placed off to the side in a slightly weird position below the keyboard, rather than being incorporated into the trackpad or power button. If you find it awkward to use, you can always opt for a more traditional password or pin instead.",
    "Weighing in at 3.1lbs (1.4kg) this laptop is incredibly lightweight and can easily be picked up with one hand. Measuring only 12.7 x 8.4 x 0.7-inches (17.95 x 322.8 x 212.2 mm) it will fit in most bags too, so you shouldn’t have any trouble carrying it around wherever you go.",
    "However, the small size does come at a cost, as ports-wise the Swift 3X is a little lacking. On the left side, there are USB-A 3.2, HDMI and USB-C 3.2 ports. The USB-C slot doubles as an alternative laptop charging port too if you’re looking to reduce the number of cables you carry with you.",
    "Over on the right, you’ll find another USB-A 3.2 port as well as an Aux port for headsets. Overall it’s not awful, but a few extra ports could have been nice — perhaps another USB-C port or two to keep the laptop’s smaller form but not sacrifice on utility. There’s also no SD or microSD slot on the Acer Swift 3X, but that’s by no means the end of the world.",
    "The keyboard is one thing that doesn't suffer from the Swift 3X’s size, however. The keys are well laid out and are more than large enough. An inbuilt backlight can be toggled on or off if you want to make them glow in lower light conditions — just don’t expect anything too fancy as your only color option is white.",
    "The Acer Swift 3x (2021) is a pretty powerful laptop - boasting one of Intel’s 11th generation mobile processors and integrated Intel Iris Xe Max graphics. The model we reviewed came with an Intel Core i5-1135G7 processor, 8GB RAM, a 512GB SSD and a 14-inch full-HD screen.",
    "The 16:9, 14-inch FHD display put the Iris graphics to good use, offering us a great image, and thanks to the anti-glare technology — or ComfyView tech as Acer calls it — bright sunlight shouldn’t get in the way of you seeing what’s on screen while you work.",
    "On top of this, the Acer Swift 3X’s specs meant that it performed impressively when running Windows 10, booting up quickly and performing regular day-to day tasks — like document creation and browsing the internet — with ease.",
    "The speakers are a little lacklustre, but unless they are vital to the work you do, they’ll be more than good enough. A pair of headphones can also solve any problems you might have.",
    "For those looking to stop working from home when you can, this should be a more than powerful enough laptop that you can easily carry with you on the days where you need to head into the office — or into school or college. For any Zoom meetings, the webcam and microphone are more than passable as well.",
    "However, more difficult tasks like high-end gaming and 4K video editing will be a little outside of this computer’s abilities. But if you’re okay settling for a more casual experience in these areas, you shouldn’t find too many problems at all.",
    "When it comes to general use though, the Acer Swift 3X packs a lot into its relatively low price tag, making this an excellent mid-range choice.",
    "When it comes to battery, the Acer Swift 3X excels - we were blown away by how well the laptop ran in our benchmarking tests. If you need a laptop that can go the distance, the Acer Swift 3X might be the one you need.",
    "PC Mark’s battery test is designed to see how long the device can last while the program mimics intensive workloads while at 50% screen brightness. At 10 hours and 43 minutes, the Acer Swift 3X showed that it’s more than capable of handling whatever you’d need to throw at it in a typical nine-to-five day job - and it’d still have more to give on a single charge.",
    "In our movie test, where we ran a 1080p video on loop at 50% brightness, the Swift 3X managed to last for a whopping 16 hours 39 minutes. With the times it’s putting out you could happily leave your laptop charger at home, as long as you remembered to charge it up the night before.",
    "If you are caught in need of power, you can always use the USB-C port to charge up the Acer Swift 3X with your phone charger. The fast charging should recharge your laptop quickly or, if your phone charger can’t muster up enough power, it should let you coast on whatever battery life is left.",
    "The Acer Swift 3X runs on the Windows 10 operating system, which it comes with pre-installed. Otherwise, the laptop doesn’t have too many applications already loaded onto it - much to the relief of ‘bloatware’ haters everywhere.",
    "While some could be useful - there’s easy links to access Express VPN and the Firefox browser - others are ones you’ll want to remove to free up space. In our testing there weren’t any that stood out as ones that are particularly worth keeping, so feel free to delete any programs you don’t want.",
    "Thankfully, though, even with all the programs you aren’t sent many unwanted notifications. We got warnings about the pre-installed Norton antivirus trial ending soon, but only just after start up, and we otherwise didn’t have any problems."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and Availability",
    "13": "Design",
    "20": "Performance",
    "27": "Battery Life",
    "31": "Software",
    "34": "Don’t buy it if..."
  },
  "links": {
    "best Acer laptop": "https://www.techradar.com/news/the-best-acer-laptops",
    "best laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "antivirus": "https://www.techradar.com/best/best-antivirus"
  }
}