{
  "source": "https://www.techradar.com/reviews/corsair-one-a200",
  "title": "Corsair One a200 review",
  "category": "computing",
  "updated": "2021-06-15T23:41:42.491Z",
  "author": "bill-thomas",
  "summary": "A tiny PC that goes \"vroom\"",
  "verdict": "The Corsair One A200 is a gorgeous little computer, and it packs quite a punch, thanks to its Ryzen 9 processor and RTX 3080. However, the super high price of entry will keep most people from buying this gaming PC over any other.",
  "pros": [
    "Excellent performance",
    "Gorgeous chassis",
    "Nice RGB lighting"
  ],
  "cons": [
    "Very expensive",
    "Might be hard to upgrade"
  ],
  "article": [
    "The Corsair One has always been one of the most unique gaming PCs on the market, delivering a super high-end power profile in a chassis that isn't much larger than the Xbox Series X or the PS5. The new Corsair One a200 is no different: it's a powerhouse gaming PC with an Nvidia GeForce RTX 3080, 32GB of RAM and an AMD Ryzen 9 5900X in a chassis that's just 14.96 inches tall and 7.87 inches deep.",
    "This does come with a pretty high price tag, of course. The Corsair One a200 starts at a gut-punching $3,799 with the specs we've listed to the right, and can go all the way up to $4,199 if you want to upgrade the specs to a Ryzen 9 5950X, 64GB of RAM and a 2TB SSD. Both configurations come with an RTX 3080, so at least you won't have to compromise where it really counts.",
    "That makes it much more expensive than other PCs. For instance the MSI Trident X with a 10th-generation Intel Core i7, 32GB of RAM and an Nvidia GeForce RTX 3080 will set you back about $2,599. And, sure, the Intel Core i7-10700K is a quite a bit slower than the AMD Ryzen 9 5900X, but that jump in performance definitely is not worth the extra $1,200.",
    "What you're really paying for is the form factor. Because while the MSI Trident X is small at 16 inches tall and 15.61 inches deep, that's quite a bit larger than the Corsair One a200. Instead, this little Corsair machine resembles the old cylindrical Mac Pro, but a bit larger. And, of course, it has some tasteful RGB lighting.",
    "But don't let the size fool you, as this is still a desktop PC, and it has all the ports you're ever going to need. On the bottom of the front side of the PC, you get two USB-A ports, a USB-C and a combo 3.5mm audio jack. Around back, you get another USB-C port, 5 more USB-A, an Ethernet and a full array of dedicated audio jacks. You even get antenna ports for built-in Wi-Fi.",
    "The RTX 3080, located on the bottom of the case, right next to the power supply, also has three DisplayPort 1.4 and one HDMI 2.1 port, just like any other graphics card you'll find today.",
    "There are plenty of gaming PCs out there that have more ports available, but most of those are more than twice the size of the Corsair One, so we'll take the slightly limited port selection. Plus, unlike a lot of other prebuilt PCs out there, the back of the PC is gorgeous, and you don't get the gaudy I/O guard that a less premium gaming PC may offer.",
    "Just like previous versions of the Corsair One, getting into it is initially pretty easy. Just above the I/O on the back of the PC is a little button which you can press in to release the top of the case. After that pops out, you can pull it off to look at the frankly amazing build that Corsair pulls off with these PCs again and again.",
    "But, while it's easy enough to open it, actually getting down to any of the components to upgrade is going to be a nightmare, and honestly we wouldn't recommend anyone but the most experienced PC builders even try it – though it is totally upgradable if you're willing to deal with the hassle. Luckily the level of components that come with the Corsair One A200, even at the lowest configuration, means you probably won't need to upgrade it any time soon.",
    "Thanks to the Nvidia GeForce RTX 3080, the Corsair One is an absolute beast when it comes to playing the best PC games. Putting this thing in our living room – where it's honestly a perfect fit – we have no problem maxing out Days Gone and playing it on our 4K TV without a frame drop to be seen.",
    "Even in heavy-hitting games like Metro Exodus, this PC has no problem delivering the goods. At 1080p with ultra settings, we're getting 118 fps in Metro, which means we get to see all the beauty of the Russian wasteland while also getting silky smooth gameplay.",
    "The Corsair One A200 even knocks it out of the park in synthetic workloads like 3DMark, where it was able to get an amazing 16,074 points in Time Spy. With performance like this, you should never run into a game that you can't run at the highest settings, even at 4K.",
    "The CPU is no slouch either, though. Scoring 20,161 points in Cinebench R23 and 11,762 points in GeekBench, the Corsair One A200 will also tear through creative workloads like Photoshop and Premiere, especially once the RTX 3080 joins the fray, thanks to CUDA acceleration.",
    "The corsair One A200 is an expensive computer, and there's just no getting around it, but we think that's mostly fine. Obviously we can't recommend that everyone go out and buy this computer, but this lineup has always been a luxury item. If you have the budget for it, and you just want an elegant machine that won't take up much space but can still game and create with the best of them, you could do a lot worse than the Corsair One A200."
  ],
  "headers": {
    "0": "Two minute review",
    "14": "Don't buy it if..."
  },
  "links": {}
}