{
  "source": "https://www.techradar.com/reviews/sandisk-professional-g-drive-rugged-external-2tb-ssd",
  "title": "Sandisk Professional G-Drive rugged external 2TB SSD review",
  "category": "computing",
  "updated": "2021-07-05T16:33:25Z",
  "author": "desire-athow",
  "summary": "A premium product that combines top-of-the-range durability with high speed transfers",
  "verdict": "The G-Drive by Sandisk Professional is not the fastest external drive around but it is definitely one of the sturdiest we’ve come across lately. If you need your data to be physically secure 100% of the time, then this drive should be on your shortlist.",
  "pros": [
    "Five year warranty",
    "Good performance"
  ],
  "cons": [
    "Expensive",
    "No protective flap for USB port",
    "Bulkier than expected",
    "No bundled software or services"
  ],
  "article": [
    "Despite the recent woes associated with chip shortage and shipment disruptions, the solid state drive (SSD) market has seen a downward trend in pricing while performance and capacities have shot up. Portable SSD are not immune to this trend and the launch of new products has gone unabated.",
    "The Sandisk Professional G-Drive SSD is a prime example of that; this rugged, external storage device still carries a premium on external hard drives but that is shrinking rapidly while other inherent features of SSD technology - speed, reliability, power consumption and size - have been improved.",
    "The 2TB Sandisk Professional G-Drive (SDPS11A-002T-GBANB )is available direct from Western Digital’s online shop for $400 at the time of writing.",
    "Western Digital adopted the same industrial-focused design for all its professional products. A mixture of soft rubber - to cushion drops - and metal (aluminum) to reinforce the core and act as a heat dissipation conduit. Its size and weight (95 x 50 x 15mm, 90g) means that it is small enough to be slipped into a jean’s pocket.",
    "Other than a Type-C connector (3.2 Gen 2) and a status LED, there’s hardly anything worth noting design wise. You don’t get any software bundled with it although you can download software for password-enabled 256-bit AES-XTS hardware encryption.",
    "Note that you do get two USB-C cables, one of which has a Type-A connector for backward compatibility. The drive does offer IP67 water and dust resistance as well as - according to Western Digital - up to 3-meter drop protection and crush resistance of up to 900Kg.",
    "The G-Drive has a SuperSpeed USB 10Gbps (USB 3.2 Gen 2) which offers a maximum theoretical speed of 1.25GBps. Once you account for overheads, speeds of 1GBps should be expected with WD stating that transfer speeds can be up to 1.05GBps.",
    "That’s about twice what you’d get from a SATA-based device, making it great for quickly editing and saving large source files, be it image (RAW photos) or video (4K footage), and a potential complement to cloud backup as part of a 3-2-1 backup strategy.",
    "The SSD controller and the NAND Flash memory used are unknown; however, we’d assume that it shares some DNA with the SN530, Western Digital’s entry level NVMe platform.",
    "Given that the drive is HFS+ formatted out of the box, you will have to reformat the G-Drive to use it with Windows 10, which implies a detour via Computer Management to launch Disk Management and create the partition. Once that was done, we managed to reach a real life performance (moving a single 10GB file using Windows Explorer) of just under 400MBps while various benchmarks (AJA, CDM, ATTO and AS SSD) show that the write speeds ranged between 947 and 1041MBps while the read speeds reached up to 1064. Not bad at all.",
    "You do get a five year warranty with it but you will have to send the defective drive to Sandisk at your own expense. It is worth noting that if you use a data recovery service, you will not void an otherwise valid limited warranty as long as you get a written verification from the service provider.",
    "We’re looking for 2TB superfast, extremely rugged, IP67+ rated external solid state drives. That disqualifies the likes of the popular Samsung T7 Touch which is not waterproof.",
    "First off is the LaCie 1TB rugged USB 3.2 Gen 2 Type C external SSD which matches the Sandisk Professional G-Drive when it comes to the warranty and performance but costs more ($500 at Provantage) and is bulkier (and the orange color may not be to everyone’s taste). Does it justify the extra premium through the inclusion of Seagate’s bundled Rescue Data Recovery services? The jury’s out.",
    "If absolute data protection is your priority then the iStorage DiskAshur M2 rugged external SSD has to be one of the favourites. It uses a PIN system to decrypt the data stored and is - on paper at least - far more rugged than the G-Drive. As for the LaCie drive though it is more expensive and, to make things worse, far slower as well. A classic case of ease of use vs. security.",
    "If value for money is your primary concern, then the Teamgroup PD1000 ($260 at Amazon) deserves your attention. It comes with “only” 3-year warranty but matches the rest of the specifications of the Sandisk Professional but a much lower price tag. Make sure you get some cloud storage to safeguard your data, just in case.",
    "The Sandisk Professional G-Drive is not your bog standard external drive. Not only is it rugged, it also comes with a five-year warranty but fails to match Seagate’s Rescue Data Recovery Service which is now bundled for free, with quite a few mainstream external SSD (like the recently reviewed Seagate OneTouch 1TB external SSD).",
    "Overall though, if you discard the far cheaper alternatives from lesser known vendors, there’s little incentive for Sandisk to drop the price of the G-Drive further. That is particularly true given the presence of the speedier and far more expensive G-Drive Pro SSD which carries a 50% premium and a near-200% improvement in speed thanks to its Thunderbolt 3 interface.",
    "A footnote about the branding. G-Tech (from which G-Drive is derived) started life as part of HGST, which was acquired by Western Digital. G-Tech survived as a rival to Seagate’s LaCie, supplying rugged, external, reliable storage devices and accessories to outdoor enthusiasts, prosumers and professionals. With the recent launch of Sandisk Professional, it is likely that G-Tech and G-Drive will be sunsetted in the near future."
  ],
  "headers": {
    "2": "Pricing and availability",
    "3": "Design",
    "6": "Performance and in use",
    "11": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "Portable SSD": "https://www.techradar.com/news/best-portable-ssd",
    "external hard drives": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "Western Digital’s online shop": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1231438516065876000/https://shop.westerndigital.com/products/portable-drives/sandisk-pro-g-drive-usb-3-2-ssd#SDPS11A-001T-GBANB",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "Samsung T7 Touch": "https://www.techradar.com/reviews/samsung-t7-touch-external-ssd",
    "$500 at Provantage": "https://www.provantage.com/lacie-sthr2000800~7SEG91LE.htm",
    "iStorage DiskAshur M2": "https://www.techradar.com/reviews/istorage-diskashur-m-review",
    "$260 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FTEAMGROUP-PD1000-Waterproof-Shockproof-T8FED6001T0C108%2Fdp%2FB087R7CFCP%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3431844932784053000-20",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Data Recovery Service": "https://www.techradar.com/best/best-data-recovery-software",
    "Seagate OneTouch 1TB external SSD": "https://www.techradar.com/reviews/seagate-onetouch-1tb-external-ssd-2021",
    ")": "https://www.techradar.com/reviews/seagate-onetouch-1tb-external-ssd-2021"
  }
}