{
  "source": "https://www.techradar.com/reviews/samsung-sero-tv-review",
  "title": "Samsung Sero TV review",
  "category": "televisions",
  "updated": "2021-07-21T10:46:00Z",
  "author": "henry-st-leger",
  "summary": "A rotating TV no-one asked for – though it has some neat tricks",
  "verdict": "Aimed at heavy social media users, this rotating TV is able to present both landscape and portrait content, meaning you can be watching Netflix one minute and scrolling through Twitter or TikTok the next. It isn't perfect, but Samsung deserves credit for bringing it to market at all.",
  "pros": [
    "Only one like it",
    "60W speakers",
    "The screen rotates!"
  ],
  "cons": [
    "No Ethernet",
    "Input issues",
    "Worse for iOS"
  ],
  "article": [
    "It's hard to deny the uniqueness of the Samsung Sero TV – and if you’re in its extremely niche target demographic, it might just be the perfect television. For anyone else, though, it’s likely to be just a hassle.",
    "We got our first sneak peek of the Sero TV at IFA 2019, where it caught our attention with its rotating functionality and eye-catching design. The Sero is unlike any other new Samsung TV, and it’s to Samsung’s credit that they brought the concept to market at all.",
    "The Sero is aimed at heavy social media users, and this rotating TV is able to present both landscape and portrait content, meaning you can be watching a Netflix movie one minute and scrolling through Twitter or TikTok the next.",
    "At the press of a button it will turn 90 degrees, and only takes 2-3 seconds to do so. If you want a TV for social media, it’s a bold – if imperfect – realization of that dream, and isn’t like anything else on the market.",
    "60W speakers ensure you’re not craning to hear voices or soundtracks, too, and all in all it’s certainly an upgrade over the audio-visual output on a standard smartphone. You’re also getting Samsung’s excellent Tizen smart TV platform to boot.",
    "That said, using the Sero as a smartphone monitor has its problems. Social media apps aren’t natively supported on Tizen, meaning you’re having to switch your gaze between the TV and the phone you’re casting from, and there’s no way to use the TV remote to navigate your scrolling feeds and timelines.",
    "The Sero feels like a solution in search of a problem, and basically unnecessary whether you’re big on social media (a flagship smartphone might be better), or not (in which case you don’t need the Sero at all).",
    "Some issues rotating with AirPlay 2, too, means this is a set best suited to Android (particularly Samsung) smartphone owners, rather than anyone with an iPhone.",
    "The Samsung Sero retails for $1,599 / £1,599 / AU$1,995, putting it in the same ballpark as the 55-inch Samsung The Frame TV, though the Sero only comes in a 43-inch size. It’s currently on sale.",
    "The Samsung Sero is an eye-catching television, especially because you’ll generally be using it in portrait. It looks like a massive mounted smartphone, which is suitable given it was designed for casting from smartphone apps.",
    "The screen comes with a rather hefty bezel, and is mounted on a skateboard-shaped kickstand, with a fabric-covered speaker sitting underneath the display. The whole kit is colored in a rather fetching navy / midnight blue, too. As a statement television, it could prove an eyesore or a revelation, depending on the decor around it, but it’s a TV that’s difficult to ignore when it’s in the room.",
    "The set itself is around four feet tall, and it’s quite heavy at 33.3kg, though it’s better suited to placing on the floor rather than an elevated counter – given the speaker stand already places the screen around eye level height.",
    "Because of this, the ports can be hard to access, and we resorted to lying on the floor to reach around the back and plug in our HDMI cables. You’ll find three HDMI 2.0 ports, two USB ports, and support for CI, terrestrial, and eARC (for connecting a soundbar). There’s no ethernet port, oddly, meaning you’re forced to connect over Wi-Fi – much like you would with a smartphone, we guess?",
    "You can throw in a set of wheels for just $49 / £69 / AU$70 to make it easier to move around the room, which feels like a smart decision if you don’t want it taking up floor space the entire time. Again, though, this means it isn’t the best choice for tethering permanently to gaming consoles or AV receiver setups. There’s no OneConnect box, either, and cabling can quickly get messy if the TV is placed on the floor.",
    "As ever with Samsung’s fancier QLED screens, you’ll get a pair of remotes: one standard button-full affair, and another slimmed-down version with a minimum number of inputs.",
    "Unlike other Samsung TV remotes, though, this one comes with a ‘rotate’ button on the upper-right, which promptly switches the TV between portrait and landscape – and is a good half-second faster than controlling it through the Samsung SmartThings app.",
    "It’s worth noting that the Sero defaults to portrait (vertical) whenever you turn it off. That’s handy if you’re mainly using it for Instagram, but it’s a real pain when resuming regular television. Thankfully, you can amend this by heading to Settings > General > System Manager, which ensures it stays locked in landscape when powered down.",
    "The Samsung Sero TV uses the same Tizen smart TV platform as the best Samsung TVs, with a well-designed overlay to access and organize streaming apps and the like.",
    "The main difference is the inclusion of a Portrait Mode icon on the far left of the screen, though it generally makes more sense using the remote, for speed. You’ll also get access to Ambient Mode, which has a host of screensavers and images for enhancing the vibe of your living room – naturally with vertical options – and it’s ripe for putting up your latest selfie if you like, too.",
    "The icons on the home screen overlay are a lot harder to read in Portrait Mode, and we would have appreciated a zoomed-in view to adjust for this.",
    "In terms of apps, you’ll get access to the likes of Netflix, Disney Plus, Amazon Prime Video, Apple TV Plus, Rakuten TV, YouTube, iPlayer, Britbox, All4, My 5, and more – you won’t fall shot of apps to keep you busy. Not every app will auto-rotate the TV when selected, so while Netflix and Amazon can do this for you, Disney Plus leaves you to rotate it yourself.",
    "Scrolling down on the home screen shows you Samsung TV Plus, which feels less well curated, but does include plenty of free content, from Top Gear and Taskmaster to classic sitcoms like Red Dwarf, as well as kids TV and esports videos.",
    "You’ll find built-in support for both Alexa and Bixby, with compatibility with Google Assistant speakers as well. Alexa will prove a more reliable AI servant than Samsung’s in-house Bixby, but the latter will also suffice if you’d rather stay out of the Amazon ecosystem.",
    "You are, however, forced to use the Samsung SmartThings app to make the most of the Sero’s smart features, and there are a couple of irritating features. The Sero was optimized for Samsung phones in particular, and while you can cast painlessly from an Android mobile device, you can’t cast to the TV in portrait mode over AirPlay 2 (only in landscape). iPhone owners can still use the TV as intended through the SmartThings app, but it’s significantly more of a hassle to get going.",
    "Galaxy devices “running Android 8.1 or higher” will also be able to make use of Tap View, to cast by tapping the phone against the TV – while turning a Samsung Galaxy Note 10 smartphone (and successive flagships) 90 degrees will rotate the TV automatically too.",
    "Considering the design-first focus of many designer Samsung TVs, the picture is surprisingly impressive here – even if it comes with a few caveats.",
    "Samsung is market-leading at upscaling from low-res video sources. That’s especially apparent on its 8K screens, like the Q800T or Q950TS, but even on the 4K Sero you can see that HD content still looks crisp and detailed.",
    "Watching BlacKkKlansman on Netflix in HD/SDR, we were impressed by the color recreation, which looked rich and nuanced despite the lack of a wider dynamic range. The 70s era jackets and shirts, down to individual threads, came across as highly detailed, with a sense of texture and physicality beyond what we might have expected.",
    "There was an element of black crushing, with black and near-black tones being collapsed into uniformity, but keeping the Sero on a Standard picture setting, rather than the dimmer Movie preset, seemed to help. We do advise against Filmmaker Mode on the Sero, too, given how much it drops the brightness in order to avoid washing out the colors ‘as intended’ by content creators.",
    "As an edge-lit set, you’re not getting market-leading brightness here, either. While the brightness is consistent, without the light banding that can plague cheaper 4K TVs, we did see evidence of backlight flickering, especially when the set was trying to illuminate bright light sources – when watching Halt and Catch Fire on Amazon Prime Video, we found fluorescent bulbs in office scenes would flicker incessantly, and sometimes this even extended to lighter icons simply when browsing the Prime Video library.",
    "This was especially apparent when turning off Intelligent Mode – which, among other things, auto-calibrates brightness depending on your room lighting conditions – and we recommend leaving it on for the best output on this particular set, given it largely keeps brightness at a high enough level that the flicker isn’t noticeable.",
    "As a smartphone-minded television, the Sero needs to be able to cope with daytime levels of light outside of evening TV watching – and it largely does, as long as you’re not using light-restrictive picture settings like Filmmaker Mode. You’ll get the best viewing experience in a dim room, certainly, but some midday casting from your smartphone won’t ruin the image you’re trying to look at on a larger screen.",
    "But this is a 4K HDR screen, and you’re getting most of the HDR formats desirable these days: HDR10, HDR10+, and HLG being among them. You don’t get Dolby Vision, though – which, like HDR10+, offers scene-by-scene metadata to enhance the HDR output of select films and shows.",
    "The Sero features the Quantum Processor 4K found on most new Samsung TVs these days, and it’s fully able to handle fast motion – something we saw in action with Netflix’s The Old Guard. There was no screen judder around the film’s slick fight choreography, and it’s hard to find many visual flaws here at all. HDR isn’t a revelation here, though, which we expect is due at least partially to the edge-lighting – and we didn’t see a huge uptick in color intensity over SDR. The Sero does support HDR10+, thankfully, but as usual on Samsung TVs, Dolby Vision is nowhere to be found.",
    "It is worth noting that the screen isn’t quite symmetrically-placed in landscape mode, meaning it hangs a little further on the right side, but only a centimeter or two. The 16:9 aspect ratio also means you’re still watching most TV and movies in its intended format, though it does mean Portrait Mode tends to crop some of the smartphone screen you’re casting from.",
    "We’ve written about the capable speakers of the Sero before, and it’s notable you’re getting a full 60W output instead of the standard 10-20W found in most new 4K TVs.",
    "The Sero features a 4.1 channel output, rather than 5.1, but it’s still a good sight better than we’d have expected for this set. The ‘1’ refers to the woofer at the rear of the speaker stand, with four tweeters coming out of the front. It’s only halfway to a truly decent audio setup, but certainly a massive upgrade over your phone’s tinny speakers.",
    "The optional ‘amplify’ sound mode will emphasize voices and dialogue, which could be useful both for your weekly soaps and ensuring clarity in all those TikTok videos, and works in tandem with Samsung’s ‘dialog enhancement’ technology.",
    "It’s also very simple to connect to the Samsung Sero over Bluetooth, and we naturally found ourselves using it as a Bluetooth speaker throughout the day. The soft synths and delicate vocals of Taylor Swift’s album folklore are aptly carried, and there’s a hefty amount of bass for audio that needs it.",
    "When watching Netflix’s The Old Guard, too, the Sero is more than capable of separating the sounds of rattling military vehicles and chirping cicadas, with the excellent Frank Ocean-featuring soundtrack coming across with plenty of impact.",
    "There’s no Dolby Atmos support here, though, so don’t expect a full surround sound effect.",
    "Of course, the main angle of the Sero is social media – and the question of whether to buy it comes down to its ability to display smartphone apps well. For Twitter, TikTok, or Instagram, the Sero is pretty unique in being suited to scrolling mindlessly through your timeline, or watching longer IGTV videos without squinting down at your handset.",
    "It’s certainly a great way to increase the size of smartphone content, and we can see its use in casting content for several people, without having to crowd around the phone. The capable picture and audio means that even jazzy TikTok dances will look their best here, too.",
    "The Sero does, however, have an input problem. When casting from your phone, you’re having to swipe and select on your phone screen, which means you inevitably end up looking back and forth between them to navigate your chosen app. The remote isn’t able to navigate for you, either.",
    "Most smartphones these days have a longer aspect ratio than 16:9, too, meaning that you won’t be able to see quite as much of your timeline at once as on a standard iPhone, even if you do get to see most of it on a significantly larger screen – which, it’s worth noting, will mean you take longer to take in a single tweet or photo, making ‘doomscrolling’ through your timeline possibly even more arduous an activity.",
    "This input issue extends to mobile games, too. Our best gaming experience on the Sero was actually casting Monument Valley from our mobile. The Sero’s high-contrast screen gave me a new appreciation for the vivid visuals of the 3D puzzle game Monument Valley, but controlling the game was far more difficult when technically having to use two screens."
  ],
  "headers": {
    "0": "Two minute review",
    "8": "Price and availability",
    "9": "Design",
    "17": "Smart TV (Tizen)",
    "25": "Picture quality",
    "35": "Audio performance",
    "41": "Social media and gaming",
    "46": "Don’t buy it if…"
  },
  "links": {
    "IFA 2019": "https://www.techradar.com/news/ifa-2019-news",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Netflix movie": "https://www.techradar.com/best/best-netflix-movies",
    "smart TV platform": "https://www.techradar.com/news/best-tv",
    "AirPlay 2": "https://www.techradar.com/news/airplay-2-speakers",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "55-inch": "https://www.techradar.com/best/55-inch-4k-tv",
    "Samsung The Frame TV": "https://www.techradar.com/reviews/samsung-the-frame-tv-2020",
    "43-inch": "https://www.techradar.com/news/best-40-inch-tv",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "AV receiver": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy",
    "OneConnect box": "https://www.techradar.com/news/samsung-oneconnect-box-is-still-a-marvel-so-why-do-so-few-samsung-tvs-get-it",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Rakuten TV": "https://www.techradar.com/reviews/rakuten-tv-review",
    "Britbox": "https://www.techradar.com/news/britbox-the-one-stop-streaming-service-for-classic-british-tv",
    "Samsung TV Plus": "https://www.techradar.com/news/samsung-tv-plus-the-free-tv-streaming-service-explained",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Bixby": "https://www.techradar.com/how-to/what-is-bixby-our-guide-to-samsungs-voice-assistant",
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones",
    "Samsung Galaxy Note 10": "https://www.techradar.com/reviews/samsung-galaxy-note-10-review-and-specs",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Q800T": "https://www.techradar.com/reviews/samsung-q800t-8k-qled-tv",
    "Q950TS": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Filmmaker Mode": "https://www.techradar.com/news/filmmaker-mode-to-show-films-as-intended-on-lg-and-panasonic-tvs",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "The Old Guard": "https://www.techradar.com/news/the-old-guard-netflix-review",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "mobile games": "https://www.techradar.com/best/best-android-games"
  }
}