{
  "source": "https://www.techradar.com/reviews/dyson-v12-detect-slim",
  "title": "Dyson V12 Detect Slim review",
  "category": "appliances",
  "updated": "2021-09-07T13:46:37Z",
  "author": "sharmishta-sarkar",
  "summary": "The underrated yet powerful Dyson V15 Detect sibling",
  "verdict": "It’s very tempting to give the Dyson V12 Detect Slim top marks, but its dustbin is small – too small – when compared to its other V-series siblings. Other than that, and despite having comparatively lesser suction power than the V15 Detect, the V12 is still pretty powerful, capable of matching the V10’s performance. It also comes with all the best features of the V15 without costing as much. So for anyone looking for a new Dyson without having to pay top dollar, then the V12 Detect Slim is a good alternative.",
  "pros": [
    "Cheaper than V15 Detect",
    "Lighter than V15 Detect",
    "Good suction"
  ],
  "cons": [
    "Small bin",
    "Expensive for some",
    "Limited availability"
  ],
  "article": [
    "The Dyson V12 Detect Slim was only mentioned in passing during the official launch of the V15 Detect – it was almost as though Dyson didn’t really want much to do with the V12 because it wasn’t a flagship. But we’ve just spent a few weeks with both new Dyson handsticks and we’re pretty impressed with what the V12 Detect Slim can do… at a slightly lower price than the V15 Detect.",
    "Compared side by side, the V15 flagship is the clear winner in terms of performance, with far superior suction, but given the V12 Detect Slim comes with the headline-making features like the Laser Slim Fluffy cleaning head and the piezo sensor that ‘listens’ to what’s getting sucked up, but in a slightly cheaper package, there’s not much to complain about here.",
    "It has a small bin, yes, the same one used in the Dyson Omni-Glide, but it’s also what makes the V12 lighter, and thus easier to maneuver, than the V15 Detect. But, because the sides of the bin are so close to the inner cyclone, we found that clumps of hair and fibre don’t fall out as easily as they do with the 0.76L bins on the other V-series models. We had to use our fingers to get the dirt and debris out almost each time we vacuumed a carpet – not as hygienic as we hoped it would be.",
    "If you’re not too fussed about that, though, the V12 Detect Slim can match the V10 Cyclone for power (which is a darn good vacuum in its own right) and do so reactively. That means that if the V12 detects more dirt in a particular spot, it automatically increases suction power – the change is slight but effective. However, unlike the V15 Detect when used with the High Torque cleaning head, the V12 doesn’t reactively adjust suction when moving from hard floor to carpet.",
    "There’s hardly any other compromises with the V12 Detect Slim. It ships with its own version of the amazing new Hair Screw Tool – a masterpiece of engineering capable of sucking hair and fur (even slim cables if you’re not too careful) of any length without tangles – and you get the digital display of everything that’s being sucked up thanks to the piezo sensor. However, it costs almost as much as a Dyson V11, and if you can manage without the laser-lit Slim Fluffy tool and “scientific proof” of what you’re cleaning, then we’d lean towards getting the older model only because of the bin capacity.",
    "While the Dyson V15 Detect and the Dyson Omni-Glide were the highlights of the company’s May 2021 launch announcement, a third vacuum cleaner was also mentioned. The V12 Detect Slim comes in as the cheaper sibling to the V15 Detect, but only for select markets. So far, it’s available in Australia, New Zealand and Japan, but in several other countries, Dyson has introduced the ultra-lightweight Micro 1.5kg instead – an even lighter model with a maximum runtime of just 20 minutes.",
    "The V12 Detect Slim offers almost as much as the V15 Detect and costs AU$1,199 in Australia (about $895 / £645 – conversions likely higher than actual RRP), which is as much as a V11 model in Australia.",
    "At the time of writing, there was no official word on whether the V12 models would be available in the US or UK, but we’ll update this review as soon as we know more.",
    "On a side note: Dyson told us that the company decided to jump a couple of generations when it comes to naming its vacuum cleaners because the numbers 13 and 14 are considering unlucky in some cultures.",
    "Dyson hasn’t veered from its design aesthetic in… forever, so the V12 Detect Slim looks very much like the rest. Except for a large red button on the barrel of the handheld unit. This is the power button that replaces the trigger we’ve seen in all the other V-series handsticks. For those who’ve used any other Dyson stick vacuum, you’ll know that the trigger needs to be constantly pressed when using the appliance and can cause wrist fatigue or pain, particularly when trying to maneuver the vacuum in different directions.",
    "This power button, in our opinion, is a wonderful change as it removes the issue of wrist/hand pain – press once to turn on, press again to turn off. That said, it needs your free hand to press each time, so this V-series model isn’t meant for one-handed use as its other siblings.",
    "The only other major difference between the V12 and the V15 is the bin capacity. As mentioned earlier, the V12 comes with a 0.35L bin – the same one used in the Omni-Glide – and is just enough for a one-bedroom apartment. If you happen to live in a larger home, especially one with wall-to-wall carpeting, then you’ll find yourself emptying the bin often.",
    "The mechanism to empty the canister is the same as in the V11 and V15 models, but here it’s not as hygienic, as we found you need to stick your fingers in to pull out hair, fur and fluff. If you’re not too fussed about that, then pretty much everything else about the V12 is like the V15, including the attachments that ship with it. That said, the Hair Screw Tool that comes with the V12 is slightly different from that of the V15 and they aren’t interchangeable.",
    "Look real closely, though, and you’ll find the flower-like arrangement of the radial cyclones is also slimmer than the V11 or the V15. Where these two models have 14 radial cyclones, the V12 Detect Slim only has 11. That means lesser suction as compared to the V11 or the V15, but even on the lowest mode, there’s plenty here to do a pretty good job.",
    "The smaller bin and lesser number of radial cyclones inside means the V12 is lighter than the V11 or V15. It weighs just 2.2kg (as compared to over 3kg for the other two) with a cleaning head attached, and also happens to be 3cm shorter than the V15. The lighter weight makes it a lot easier to hold the handheld unit aloft for getting at ceiling corners as compared to the V15, and also makes it easier to move across a floor.",
    "Despite the lower price tag, you still get the digital display with the graphical representation of particle size and number displayed, along with the remaining runtime on each power mode. The suction level selection button is elongated, though, as compared to the silver circle on the V11 and V15 models.",
    "The clip-on battery pack from the V11 has also made its way here, so if you think 60 minutes of max runtime isn’t going to do it for you, you can always consider buying an extra one to swap out when necessary. The slightly uneven weight distribution we found on the V15 because of the clip-on battery is thankfully not an issue here.",
    "The Laser Slim Fluffy that’s the headline act of the V15 has made its way into the V12 box as well. In both cases, we found that the casters used on the Laser Slim Fluffy tool aren’t great when trying to move the handstick at an angle or backwards, making the High Torque cleaning head our favorite attachment for general use.",
    "There’s no denying the V15 Detect is the most powerful Dyson handstick yet, but if you happen to live in a home with mostly hard floors and you’re lusting after the Laser Slim Fluffy cleaning head, you won’t regret getting the V12 Detect Slim. When it comes to suction power, even the lowest setting – called Eco – is more than enough for general cleaning. There are two more higher power settings available, but you will be eating into the limited 60-minute battery life, especially when using the motorized cleaning heads.",
    "During our testing we found that the Eco mode did a good job on carpets, although if it’s a particularly ‘hairy’ task, it takes a few back-and-fro movements to get it all off. On hard floors, though, no job is too hard as both the Laser Slim Fluffy or the High Torque attachments suck up anything in their path easily enough on the lowest suction mode.",
    "The lower suction power is because the V12 has a lesser number of radial cyclones than the V11 or V15 – three less to be precise. But consider this to be a better version of the V10 – which isn’t a slouch in its own right – and you realise how capable the V12 Detect Slim is.",
    "If you need proof of how well it can clean, all you need to do is use the Laser Slim Fluffy (designed specifically for hard floors) and watch as the illuminated dust and dirt get sucked up. Or you can keep an eye on the display and watch as the graph changes – although after a few uses we found ourselves barely looking at the display except to keep an eye on the remaining runtime.",
    "Be careful when using the Hair Screw Tool though. While it’s absolutely brilliant at sucking up hair and fur without tangling anywhere, it does also gobble up slim charging cables with ease. It’s best used on furniture or pet beds, but you can (theoretically) also use it on a floor. However, as with the V15 Detect, the attachment’s small footprint means it will take a long time to go over every inch of the floor space.",
    "And because of the slightly unwieldy nature of the Laser Slim Fluffy casters, we found ourselves using the High Torque cleaning head the most, on both carpets and hard floors.",
    "There are no compromises when it comes to battery life. Dyson seems to have used the same battery capacity on the V12 as it has on the V11 and V15 models, with a maximum runtime of 60 minutes, and it’s fade-free. So if the appliance has run out of juice, it just stops, with no change in suction whatsoever.",
    "However, you get the full 60 minutes only when using the Eco mode with a non-motorized attachment. With the High Torque cleaning head, for example, we got about 46 minutes of power on the Eco mode, but the full hour when the Combination tool was attached.",
    "On the Auto mode, we got a maximum of 40 minutes of fade-free power, while the Boost mode gave us no more than 20 minutes with the Laser Slim Fluffy. And that’s pretty much the same as what the V15 Detect offers as well.",
    "If you think you may need more than 60 minutes, you do have the option of purchasing a second battery pack to swap out when necessary.",
    "[First reviewed July 2021]"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Dyson V12 Detect Slim: price and availability",
    "9": "Dyson V12 Detect Slim: design",
    "18": "Dyson V12 Detect Slim: performance",
    "24": "Dyson V12 Detect Slim: battery life",
    "28": "Don't buy it if..."
  },
  "links": {
    "V15 Detect": "https://www.techradar.com/reviews/dyson-v15-detect-absolute",
    "V10 Cyclone": "https://www.techradar.com/reviews/dyson-cyclone-v10",
    "vacuum": "https://www.techradar.com/news/best-vacuum-cleaners",
    "Dyson V11": "https://www.techradar.com/reviews/dyson-v11",
    "Dyson Omni-Glide": "https://www.techradar.com/reviews/dyson-omni-glide-review",
    "Micro 1.5kg": "https://www.techradar.com/reviews/dyson-micro-15kg"
  }
}