{
  "source": "https://www.techradar.com/reviews/ring-spotlight-cam",
  "title": "Ring Spotlight Cam review",
  "category": "smart-home",
  "updated": "2021-06-18T07:24:33Z",
  "author": "chris-price",
  "summary": "This outdoor camera features a powerful built-in light and siren to help deter intruders",
  "verdict": "The Ring Spotlight Cam is a great option if you want to deter intruders but don’t have power nearby to hook up a mains-operated security camera? As soon as motion is detected, it will automatically record footage in full HD video and activate both bright lights and a loud siren should you choose. Simple to use, you will need to subscribe to Ring Protect for $3 / £2.50 / AU$4 per month to view the footage after it's been recorded, and the camera is bulky and slightly tricky to install.",
  "pros": [
    "Bright lights and loud siren",
    "Excellent, easy to use app",
    "Can view footage on the web"
  ],
  "cons": [
    "Need to subscribe to watch recorded footage",
    "Bulky design",
    "Requires some DIY skill"
  ],
  "article": [
    "Ring is a name that most people will now be familiar with thanks to its range of some of the best video doorbells. However, it also produces a range of indoor and outdoor home security cameras that let you keep an eye on your home when you’re not around.",
    "First launched in 2017, the Spotlight Cam is an outdoor security camera is designed for mounting above a front door or on an outbuilding, and as well as alerting your smartphone when the camera detects motion, it’ll also illuminate the bright lights on either side and below the camera lens. Also on board is an extremely loud siren, which when coupled with the lights is ideal for scaring off unwanted intruders.",
    "It comes in both black and white and is available in two variants – one that uses mains power and one that is powered by a rechargeable 6000mAH battery. On top of that you can even purchase a solar panel as an optional extra for the battery-powered variant.",
    "The Spotlight Cam offers a 140-degree horizontal viewing angle and 78-degree vertical angle which certainly isn’t the widest viewing angle around but should be more than enough to capture footage of anyone coming to your property.",
    "Like all Ring devices, if you want to review the footage recorded by the home security camera after it’s happened, you will need to subscribe to Ring Protect to ensure the videos are stored online for up to 30 days. It’ll cost you $3 / £2.50 / AU$4 per month or $30 / £24.99 / AU$40 for a year, but also offers a host of other features to reduce unwanted notifications.",
    "These include ‘customizable motion zones’ so you can, for example, tailor the areas where you want the Spotlight Cam to detect movement and ‘people only’ mode so it doesn’t capture unwanted footage of birds flying across the sky or squirrels climbing the fence. It’s also possible to use the Spotlight Cam as part of a network of Ring devices which can all be controlled via the app.",
    "The Spotlight Cam is a versatile outdoor camera ideal for monitoring your property, and while it is a few years old now, the device’s software has been updated considerably to give you all the options you need to use as part of a comprehensive home security setup. It’s just a shame that Ring ties you into a monthly subscription to watch the footage from your camera, rather than allowing you to store it locally as you can with some devices such as the Yale Front Door WiFi Camera Light and Siren.",
    "The Ring Spotlight Cam will set you back $199 / £179.99 / AU$329, and is available from Ring’s website, as well as Amazon and other electrical retailers. It’s available in two versions; Battery, which is of course powered by a rechargeable battery, and Wired that requires mains power - both are priced the same. A solar panel for the battery version is priced at $49 / £49 / AU$79.",
    "As we’ve already mentioned, if you want to review video after the camera has recorded it, you’ll need to subscribe to Ring Protect. The camera comes with a free 30-day trial, after this it’ll cost from $3 / £2.50 / AU$4 per month or $30 / £24.99 / AU$40 for a year.",
    "A chunky, rectangular-shaped outdoor camera, measuring 4.96 x 2.72 x 2.99 inches / 12.6 x 6.91 x 7.59 cm ( h x w x) and available in black or white, it’s fair to say the Ring Spotlight Cam is not a thing of beauty. However, what it lacks in looks it makes up for in terms of versatility, with a large two-way speaker underneath the main lens and two bright spotlights either side and one below.",
    "On the back of the unit is a mounting plate that can be turned around depending on how you want to install the security camera. Ring also provides a drill bit and raw plugs for drilling screws into the brick wall, as well as a double-headed screwdriver for attaching the bracket to the wall. Ring recommends placing the device around 10 ft / 3 m off the ground.",
    "However, you will need to make sure that you use the right side of the screwdriver as the bracket the security camera connects to has an unusual Torx screw head rather than the more standard Phillips screw head used for the wall mount. Ring claims installation time is around five minutes but, in reality, it took us closer to an hour once it was angled properly.",
    "Open up the space underneath the camera where the sensor sits and you’ll find space for two batteries. The camera will work with only one battery installed - in fact only one is included in the box, you’ll need to purchase additional batteries if you want to prolong the time between charges. The batteries can easily be clipped into place or removed when they need charging.",
    "When it comes to performance, we certainly didn’t have any complaints with the Spotlight Cam. During the day, the full HD footage was clear and detailed, although after dark the images weren’t the clearest we’ve seen.",
    "However, the two-way audio was very loud and clear (the Spotlight Cam has one of the best speakers we’ve seen on a security camera) and the lights powerful enough to illuminate the entire garden. What’s really good about the device is that it’s possible to switch the lights on manually, as well as automatically, so when you’re conversing with anyone in the field of view, you can clearly see whoever is there.",
    "As previously mentioned, when the camera detects motion you can either view a live feed from the camera or review the footage it stores at a later date. By default, 30 seconds of video is recorded when motion is detected, although this can be increased to up to 120 seconds, but this will deplete the battery quicker. It’s also easy to share them via text, social media or download to your devices too.",
    "Where Ring certainly beats most of the opposition is with the smartphone app. It is quite simply the best we’ve ever seen on a security camera. Perhaps it’s the influence of Amazon, which bought Ring in 2018, but the user interface is extremely intuitive with clear options you can toggle on and off.",
    "As with most home security devices, the easiest way to set up the app is to scan the QR code inside the battery compartment. This brings up the model name within the app and, after inputting your address details and WiFi code, you should be ready to get started. Usefully, there are several options available, from viewing your event history (neatly divided into different sections such as Live Views and Motion Detection) to setting motion schedules so the camera only records at certain times of the day and light. You can also set the device’s lights to come on at specific times, such as overnight.",
    "Other useful options include power setting so you can see how much charge your battery has before it needs recharging and a new geofencing feature. This will automatically switch alerts off when you come home and switch them back on when you leave the house.",
    "Ring claims a single battery in the Spotlight Cam will last for between three and six months, while dual batteries will prolong the life by a further six months, although this will depend upon how often motion is detected, how many times the spotlights are illuminated and the frequency of the live feed being viewed from the app. Due to our making heavy use of the camera for this review we’re not able to give figures for ‘typical’ use. We found it took several hours to recharge the battery using the bundled USB cable.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Ring Spotlight Cam price and availability",
    "9": "Design",
    "13": "Performance",
    "16": "App",
    "19": "Battery life",
    "20": "Don't buy it if..."
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Yale Front Door WiFi Camera Light and Siren": "https://www.techradar.com/reviews/yale-front-door-wifi-camera-light-and-siren"
  }
}