{
  "source": "https://www.techradar.com/reviews/square-reader",
  "title": "Square Reader review",
  "category": "computing",
  "updated": "2021-07-15T09:09:08Z",
  "author": "rob-clymo",
  "summary": "Square Reader lets you accept mobile credit card payments anywhere",
  "verdict": "Square’s hugely practical card reader can be used on its own or to supplement your static business by allowing the processing of mobile card or contactless payments on the go.",
  "pros": [
    "Versatile",
    "Compact design",
    "Accepts most cards",
    "Solid support"
  ],
  "cons": [
    "You’ll need to register with Square",
    "More compact US version not available in UK"
  ],
  "article": [
    "Square is a long-established provider of card payment services, including a raft of point of sale units, that allows business of all kinds and sizes too, to boost their turnover. Square has since gone on to introduce a range of mobile services, with its mobile card reader proving to be hugely popular with business owners on both sides of the Atlantic, especially during the coronavirus crisis.",
    "You’ll need to sign up for an account with them, but once you’ve got that and one of their card readers you’ll be able to process transactions from all over the place, and for a reasonably small transaction fee too.",
    "Similar products include the likes of SumUp, QuickBooks Payments, Shopify, PayAnywhere and Zettle.",
    "Square has a mobile card reader to suit business owners on both sides of the pond, with an American edition that is currently free when you sign up for the service. And, as Square points out, that comes with the benefit of clear pricing and fast transfers, with 2.6%+ 10¢ charged per swipe for Visa, Mastercard, Discover and American Express payments.",
    "If you want a Square card reader for contactless and chip cards and for Apple and Google Pay, you’ll need the $49 version however. You’ll then receive the processed payments as fast as the next business day.",
    "Meanwhile, you can currently get the Square reader for £19 in the UK, which once you have it configured will carry out payment processing for chip and PIN cards, plus contactless too with a fixed flat rate fee of £1.75%.",
    "In the States the Square reader comes in two editions, one with a headset jack and the other with a Lightning connector, which means it’ll work with iOS or Android and can also be connected to an Apple computer or Chromebook. There’s no battery to worry about either, making it even more useful.",
    "The UK’s Square reader is a simple but effective hardware device that features a lightweight, compact and unobtrusive design that arrives complete with a microUSB cable for charging purposes. It’s compatible with Apple devices running iOS 10.0 or greater, though won't work with the iPad 2 or 3. It is compatible, however, with Android 5.0 devices and upwards.",
    "The Square reader will process payment types including chip and PIN or EMV cards, contactless or NFC cards, magnetic stripe cards and will also process Apple Pay, Google Pay and Samsung Pay transactions. Connectivity is done via wireless and it’s pretty straightforward to configure.",
    "As pointed out in the previous paragraph, Square’s card reader is a well-designed piece of hardware that has a proven track record. There’s not an awful lot to it, and so theoretically not much to go wrong either.",
    "Considering its small size the Square reader is still pretty versatile, with in the larger edition a slot for chip and PIN cards to be inserted into the card reader for a physical transaction. At the same time it works ell enough for contactless transactions too, with customers only needing to hold their card close to the unit in order to process a payment.",
    "The same can be said for the likes of Apple Pay, Google Pay and other contactless payment options that are available for smartphones and smart watches.",
    "Square is one of the simpler to use card readers and is also very intuitive, once you’ve got yourself registered with the company that is. You might already have an account with Square if you run a business that uses its products and services in a more permanent location.",
    "However, the bonus of mobile card readers as opposed to fixed location point of sale machines, is that they deliver additional freedom. Being able to turn up at things like events, markets or pop-up fairs means that you instantly gain the ability to boost your business. And, once you're there, this device accepts all major cards, plus there’s the appeal of that fixed transaction charge. It’s a doddle basically.",
    "Square has been running for long enough now to know how to handle customers successfully. Therefore, starting with its website, you’ll find plenty of assistance should you need it when using the Square card reader. First time users should find getting set up relatively uneventful, but there are plenty of online options to use should you have basic questions.",
    "Boosting the support angle is the way you can also get in touch with Square representatives in order to deal with more complicated issues. In addition, once you’re signed up with Square and have logged in you’ll receive expedited support, which should get to the bottom of your queries sooner rather than later.",
    "Whichever version you select, Square Reader is a natty little unit that does exactly what it says on the tin. It’s a nicely put together device that boasts a decent size battery (on the larger unit), which subsequently allows you to use it all day long before a recharge.",
    "Alongside its practical styling and performance we’re also smitten with its one price chip and PIN or contactless price of £1.75% per transaction in the UK or 2.6%+ 10¢ in the USA.",
    "Add on the convenience of Apple Pay, Google Pay and other contactless options and you’ve got a fully featured gadget that has the capacity to boost your business. If you’re already with Square then it’s the ideal compliment to any static POS units you might possess, delivering portability whenever, and indeed, wherever you might happen to be."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "9": "Performance",
    "12": "Ease of use",
    "14": "Support",
    "16": "Final verdict"
  },
  "links": {
    "Square": "https://squareecom.yaub.net/c/221109/619387/10061?subId1=trd-us-1143621443520197100&sharedId=trd-us&u=https%3A%2F%2Fsquareup.com%2Fgb%2Fen%2Fhardware%2Freader%3Fgclid%3DCj0KCQiApt_xBRDxARIsAAMUMu_cpjS_HcXpX-TGtroo_fuVe4UETYhXLDEXQsdxIgmLdnDptUcW3BYaAg19EALw_wcB%26pcrid%3D410444291218%26pkw%3Dsquare%26pmt%3De",
    "card payment": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "point of sale": "https://www.techradar.com/news/the-evolution-of-pos-point-of-sale-systems",
    "card readers": "https://www.techradar.com/how-to/how-to-take-card-payments-contactless-or-pin-based",
    "SumUp": "https://www.techradar.com/reviews/sumup-pos",
    "QuickBooks Payments": "https://www.techradar.com/reviews/quickbooks-gopayment",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "PayAnywhere": "https://www.techradar.com/reviews/payanywhere",
    "Zettle": "https://www.techradar.com/reviews/izettle-2",
    "American edition": "https://squareecom.yaub.net/c/221109/619387/10061?subId1=trd-us-3048027867125594000&sharedId=trd-us&u=https%3A%2F%2Fsquareup.com%2Fus%2Fen%2Fpricing%3Fsolution%3Dpricing-in-person-payments",
    "$49 version": "https://squareecom.yaub.net/c/221109/619387/10061?subId1=trd-us-8453810449817053000&sharedId=trd-us&u=https%3A%2F%2Fsquareup.com%2Fshop%2Fhardware%2Fus%2Fen%2Fproducts%2Fchip-credit-card-reader-with-nfc",
    "£19 in the UK": "https://squareecom.yaub.net/c/221109/619387/10061?subId1=trd-us-8825115640776278000&sharedId=trd-us&u=https%3A%2F%2Fsquareup.com%2Fgb%2Fen%2Fhardware%2Freader",
    "Square Reader": "https://squareecom.yaub.net/c/221109/619387/10061?subId1=trd-us-5923225732596847000&sharedId=trd-us&u=https%3A%2F%2Fsquareup.com%2Fgb%2Fen%2Fhardware%2Freader%3Fgclid%3DCj0KCQiApt_xBRDxARIsAAMUMu_cpjS_HcXpX-TGtroo_fuVe4UETYhXLDEXQsdxIgmLdnDptUcW3BYaAg19EALw_wcB%26pcrid%3D410444291218%26pkw%3Dsquare%26pmt%3De",
    "Apple Pay": "https://www.techradar.com/reviews/phones/mobile-phone-accessories/apple-pay-1264966/review",
    "Google Pay": "https://www.techradar.com/how-to/how-to-use-google-pay",
    "contactless options": "https://www.techradar.com/how-to/how-to-run-a-cashless-business",
    "POS": "https://www.techradar.com/news/the-best-pos-system"
  }
}