{
  "source": "https://www.techradar.com/reviews/biktrix-juggernaut-classic",
  "title": "Biktrix Juggernaut Classic review",
  "category": "fitness",
  "updated": "2021-04-05T15:20:31Z",
  "author": "rob-clymo",
  "summary": "The Biktrix Juggernaut Classic is an e-bike for on or off-road duties.",
  "verdict": "Bold styling makes the Biktrix Juggernaut Classic stand out from the crowd. Its chunky rubber tyres and a plentiful supply of power from the sizeable battery pack delivers a comfortable ride and provides sprightly performance in equal measure too. The design and build also means the Juggernaut is well suited to larger cyclists, although considering its robust construction this is an e-bike that’s also highly manouverable. A rock-solid all-rounder.",
  "pros": [
    "Rugged looks",
    "Great for on and off-road",
    "Plenty of e-bike zest"
  ],
  "cons": [
    "Quite bulky",
    "Online manuals"
  ],
  "article": [
    "The Biktrix Juggernaut Classic delivers plenty of electric bike performance, all wrapped up in a design that combines off-road durability with lashings of on-road capability. While it’s not the lightest e-bike you’ll ever ride it’s certainly comfortable and packs a decent specification into that eye-popping frame design and zingy colour scheme.",
    "If you’re new to e-bikes, the Juggernaut Classic will provide the perfect introduction with an easy-to-use set of controls that lets you handle the power while still being able to enjoy conventional cycling with the aid of an eight-speed derailleur arrangement. The 750W electric motor delivers more than enough punch for most riders, while the 48W battery ensures you can make light work of longer journeys without fear of running out of juice.",
    "Biktrix offers the added benefit of letting you mix and match components, so you can effectively build your own bike. It’s a great way to keep costs down if you’re looking for the basics. Alternatively, splurge and customize your Biktrix Juggernaut Classic so that it arrives with all of the toys, right out of the box.",
    "Biktrix Juggernaut Classic was released in November 2020. The bike tested costs £1,745 / $2,399.00 / AU$3,151 direct from Biktrix.",
    "Biktrix has a whole range of e-bikes in its portfolio and builds them in Saskatoon, Canada. While designs follow a similar theme all models are decidedly different. The Biktrix Juggernaut Classic combines the best of both worlds, with a style that’s equal parts road ripper and off-road mud hound.",
    "Our model was made all the more distinctive as it featured big, beefy 4in tires in the style of a classic ‘fat bike’. However, you can order the bike with less bulbous 3in cycle tires. Indeed, it’s possible to tweak your bike to suit your needs when you order it from Biktrix and they can add or subtract parts as required.",
    "There are a few distinctive elements of the Juggernaut Classic, including its dramatic frame that boasts some funky angles, most noticeably the top tube. Our model was resplendent in a rich metallic red, with wild graphics.",
    "Elsewhere, the 750W mid-drive electric motor is housed on top of the bottom bracket and between the pedals. It’s perhaps the least pleasing visual aspect of the whole bike actually. Meanwhile, the 48V battery sits on top of the front downtube in a rather boxy black plastic housing, with a rubber power button on the top along with a USB port and a charging port at the bottom, covered with a small rubber plug. The battery can be charged on or off the bike.",
    "The hydraulic front forks are finished in contrasting black and provide 80mm of travel while 160mm discs provide the stopping power front and rear. Gears come courtesy of a Sunrace eight-speed.",
    "There’s a practical chain card on the chainring too. Both wheels are covered by chunky black mudguards that can fend off rain and mud with ease, while there’s a cargo rack over the back wheel that can handle up to 25kg.",
    "Topping it off is a Velo Plush Narrow saddle and comfy handlebars that contain key controls including on the right gear up/down levers along with a push button module on the left side for controlling the motor. This control pad lets you turn the bike on and off and adjust settings, while an additional thumb throttle lets you engage the power as and when you need it.",
    "There’s a centrally-mounted LCD display too, which lets you keep track of speed, battery life, range and the pedal assist level, as well as recording trip distances on the built-in odometer.",
    "The Biktrix Juggernaut Classic looks and feels like a chunky proposition and, adding fuel to that, is its actual weight, which is 28.7kg/63.3lb and that’s without the battery, That’s good news for anyone who wants an e-bike that is going to be robust enough for their needs and is on the larger side. In fact, the bike we tried is available for anyone between 5’ 9” and 6’ 5”.",
    "Better still, the Juggernaut will support riders up to 149kg/330lbs, so it’s well suited to all types of customer. If you feel vulnerable on smaller e-bikes then the Juggernaut will certainly reassure you. Sit on the bike, use the quick release lever to make final adjustments to the saddle height before heading off down the road and the Biktrix Juggernaut Classic is a bit of a pleasant surprise too.",
    "The bike feels quite hefty when you’re stationary, particularly at the front, but this feeling subsides as you blip the thumb throttle for the first time. And, although that design doesn’t appear to suggest it’ll fly along, the beefy motor and battery combo deliver excellent performance.",
    "Working the controls using the module and the thumb throttle proves to be a doddle, while we were also impressed by the stopping power of those discs too. The ride quality is another bonus, with those fat tyres really soaking up lumps and bumps in the road. Combined with the really comfortable saddle it’s easy to munch your way through a few miles without feeling any fatigue.",
    "In fact, the Biktrix Juggernaut Classic feels ideally suited to longer journeys and there’s a built-in headlight that’ll cover you if you’re not back home before dark. Our review unit also came with an additional rear light, which we needed to fit as it’s one of those added extras.",
    "Of course, it's also possible to ride the Juggernaut without the power on, although you do feel the difference. The weight of the bike, the battery and motor plus those hefty tyres is noticeable, so while it’ll get on down the road well enough, especially with the aid of those eight gears, the bike functions best when you’re using a combination of pedal and electric power. We were enamored with the gear shifting too, which was satisfyingly consistent.",
    "Meanwhile, the handlebar module allows you to change assistance levels by pressing the plus or minus symbols, so there’s nothing too surprising on the power control front. It’s all by-numbers e-bike stuff and all the better for that. There’s definitely plenty of power on offer with this bike, with lots of torque on hand that makes it easy to get up steep inclines.",
    "As with most electric bikes, the best bit about this is that you can call on the power assistance as much or as little as you want. That means the Juggernaut e-bike experience can still offer a workout, as well as helping you out when you most need it. In terms of range then it depends on which battery pack you pick when speccing your bike, but Biktrix reckons the 48V 17.5Ah lasts for about 40+ miles, the 48V 21.5Ah is good for about 50+ miles while the 52V 17.5Ah range is about 45+ miles per charge, with 10% more power on tap. The supplied 2A charger pack took around 4 hours to replenish the battery from nearly empty to full.",
    "First reviewed March 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and release date",
    "4": "Design",
    "12": "Performance",
    "21": "Don't buy it if"
  },
  "links": {
    "Biktrix Juggernaut Classic": "https://www.biktrix.com/pages/juggernaut-classic-details",
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "direct from Biktrix": "https://www.biktrix.com/pages/juggernaut-classic-details"
  }
}