{
  "source": "https://www.techradar.com/reviews/moto-g60s",
  "title": "Moto G60S review",
  "category": "phones",
  "updated": "2021-10-22T19:00:11Z",
  "author": "andrew-williams",
  "summary": "A solid phone hampered by dated connectivity",
  "verdict": "The Moto G60S is a solid choice if you value a big screen and very fast charging. You get plenty of storage and clean-looking software too. However, it doesn’t have 5G, and some 4G-only phones around this sort of price have more consistent cameras.",
  "pros": [
    "Very fast charging",
    "Solid battery life",
    "A big, decent screen"
  ],
  "cons": [
    "Feels a little cheap",
    "Poor low-light photos",
    "No 5G"
  ],
  "article": [
    "The Moto G60S is an affordable Android phone with a big screen and 4G mobile internet. If you want 5G, move on. However, at the time of release you tend to have to put up with compromises elsewhere if you want 5G on a budget. The Moto G60S avoids most of these.",
    "It has a very large, sharp screen, a capable chipset and lots of storage, at 128GB. We are also big fans of its charger, which gets you to 76% in a half-hour and is pretty much the only charger you need for your mobile devices, as it has both USB-A and USB-C slots.",
    "The Motorola Moto G60S is very much a generalist, though, and is perhaps not the most exciting Android you can buy for around its cost of $290 / £219 / AU$329.",
    "Its gaming performance is solid, but certainly not the best you can get at this level. Similarly, while the Moto G60S's camera can produce good results, its slightly lazy HDR processing often leaves you with dull-looking images.",
    "These can usually be fixed or at least improved with a quick edit, but we don’t think you should be left with that responsibility.",
    "The Moto G60S is outclassed by the Xiaomi Redmi Note 10 Pro in the ‘4G generalist’ phone bracket. Its camera is better, the screen a higher-contrast OLED and its back is glass - a much higher-end style than the plastic used in this Moto.",
    "Still, the key appeals of the Moto G series are here. The software is clean and clear, general performance is good, and battery life is long enough to avoid charge anxiety. This is also one of the fastest-charging Androids you can get when spending this much.",
    "The Motorola Moto G60S was originally released in August 2021. At the time of launch it was Motorola’s top-end 4G Android.",
    "It costs $290 / £219 / AU$329. This means it costs a little more than the Moto G50, which is a 5G phone but has a lower-resolution display.",
    "With this kind of money to spend you might also look at the Samsung Galaxy A32 5G or Xiaomi Redmi Note 10 5G. Or the Redmi Note 10 Pro if you catch it during a sale season, or are willing to spend a little more.",
    "Motorola boxes up the Moto G60S with a silicone case attached. It does the same with several of its phones these days.",
    "This is one of the few that really seems designed for use with the case attached, though, because the rear plastic feels cheap. Unlike the majority of phones in this class, the Moto G60S has a finely textured rear finish that looks a bit like fibrous metal, rather than the more common ‘fake’ glass.",
    "We’ve spent 99% of our time with this phone using the case. Remove it and its plasticky-ness becomes very apparent. This doesn’t necessarily matter, though. The slightly smoky silicone of the case softens the sharp highlights generated when the metallic plastic panel catches the light, and looks really rather good in person.",
    "Upper entry-level Motorola phones like this are, for the most part, extremely practical. The company has just taken it to the next level here. How often does a phone look better with a case attached?",
    "There is one slight durability question, though. While the Moto G series was notable in the way it brought tough Gorilla Glass to budget buyers years ago, Motorola has since stopped using it in the lower-end models.",
    "The Moto G100 uses Gorilla Glass 3, the Moto G60S an unspecified form of toughened glass. No doubt Motorola has calculated the cost savings are worth it for the hardness this glass offers, but we’d like to see a screen protector attached in the factory. Xiaomi rivals offer this, and it just seems at odds with the way the case is bunged on from its birth.",
    "Screen scratches are far more annoying than bodywork scuffs. However, while the Moto series’ glass protection has decreased, the Moto G60S does come with a water/dust resistance rating.",
    "It’s IP52, which refers to great dustproofing (the ‘5’) and very basic water resistance (the ‘2’). The Moto G60S can handle ‘dripping water’ thanks to some additional internal seals. In other words, you don’t have to worry too much about light rain, but don’t wash it under a tap.",
    "What else do we get? The Moto G60S has a headphone jack, a fairly swift rear fingerprint pad and a single speaker on the bottom edge. While a stereo pair would be nice, this one does not sound thin, and puts out decent volume.",
    "You can listen to a podcast while in the shower using it, no problem. There’s a Google Assistant button above the volume rocker, which you will probably press accidentally all the time. But that comes with the territory.",
    "The main thing to bear in mind is the Moto G60S is a fairly large phone. It has a 6.8-inch screen. There’s no such thing as a small phone with a screen that big.",
    "A large screen is one of the main draws of the Motorola Moto G60S. It’s 6.8 inches across and, unlike the Moto G 5G Plus, it has a roughly 20:9 aspect ratio rather than a 21:9 one. That means it’s slightly less tall, giving you more useful space when watching YouTube videos and other widescreen content.",
    "This is a great affordable phone display for Netflix, gaming and other forms of content binging.",
    "However, you may be drawn more to the 120Hz refresh rate. This means the image refreshes up to 120 times a second rather than the usual 60.",
    "It makes the Moto G60S’s app drawer and home screens scroll much more smoothly. However, the benefits are not always that evident elsewhere. Some apps will still run at 60Hz, and the slightest bit of judder ruins the effect. You’ll see this a lot in apps like Chrome, and it isn’t helped by the phone’s entry-level MediaTek chipset.",
    "Is that something to get too upset about in an affordable phone? Absolutely not.",
    "There are two display color modes, Natural and Saturated. You won’t see the radical difference in saturation of some OLED phones’ color modes, because this is an LCD with a narrower range of colors, but Natural looks pretty good to our eyes. Saturated has a cooler temperature, designed to make the screen ‘pop’ a bit more.",
    "Sharpness is good too. The Moto G60S has a 1080p display, which looks crisp even at this scale.",
    "It’s a nice, big, solid screen. However, it’s not really remarkable at this price. Even Samsung, not famed for its ultra-high-value entry level phones, offers a 1080p OLED at this price in the 4G version of the Samsung Galaxy A32. The Moto G60S would be notable if it had 5G with this screen, at this price, but it doesn’t.",
    "In darker rooms you’ll also notice some LCD glow, an effect of the display’s backlight. Some of you will prefer the Moto G60S’s punch-hole front camera to the little semi-circle notch of the Samsung phone. But Xiaomi’s Redmi Note 10 Pro shows how it’s done, with a much smaller punch-hole.",
    "If this screen part of the review reads as a back and forth where we haven’t come to much of a conclusion, that’s about right. The Motorola Moto G60S's screen sets no standards at the price, but it is big, and it does look sharp. There’s no major cause for complaint.",
    "The Moto G60S has four rear cameras in a familiar arrangement. We get a higher-spec main camera with a 64MP sensor and three additional ones using relatively cheap components.",
    "These are an 8MP ultra-wide, a 2MP depth sensor and a 5MP macro.",
    "The Moto G60S’s primary camera is capable of taking some great photos during the day, but you often have to do a bit of additional work to get to them.",
    "There is some shutter/capture lag, which means there’s a slight delay between the moment you tap the shutter button and the phone spitting out the photo. It varies, suggesting it’s more to do with the processing on the back end than classic shutter lag.",
    "The Moto G60S’s HDR is also under-active when dealing with lots of types of scenes. Darker parts of the image end up looking too dark. While you can retrieve a lot of that detail by bringing up the shadows in an image editing program, we just don’t think too many people are going to do that.",
    "Still, we’re moderately impressed by the amount of detail that is actually in those shadowy parts. Doing some excavation in Photoshop, lots of our photos benefit from bringing up the shadows by 20-30%: that’s a lot.",
    "The Moto G60S’s main camera uses an OmniVision sensor with tiny 0.7-micron sensor pixels. This usually isn’t good news for a phone’s dynamic range. But here the dynamic range is often limited more by the software than the hardware.",
    "Low-end, high pixel density sensors like this can result in sludgy-looking shadows, meaning you can’t do much in the edit. The Moto G60S’s fine detail can look dithered in the shadows, but that’s far better than it reverting to wallpaper paste.",
    "Night scenes show how far the camera lags behind something like the Google Pixel 4a, though. You can’t take good low-light images with the Moto G60S, unless you use the manual mode and a long exposure (which requires a tripod or something to keep the phone ultra-still).",
    "Photos of people shot in dim rooms look undersaturated, soft and murky. Street photography at night is low on detail, excessively soft, and color is poor. The Moto G60S does have a Night Vision mode, which improves the brightness of images a bit, but the results are still bad compared to those of a Pixel 4a.",
    "The Moto G60S’s ultra-wide camera is typical fare for an upper-entry-level phone. Its 8MP sensor offers lesser detail and dynamic range than the main one. So while you can do a fair bit with the primary camera’s images after shooting, you’re not going to be able to improve these ones too much other than altering the color tone a bit.",
    "However, as long as you don’t zoom into them or approach them too critically, they look fine enough. Clouds are often blown out, the blues in skies become unrealistically bright, and browns can turn purple, but it’s typical stuff for a secondary camera. We’re glad it’s here.",
    "The Moto G60S’s macro camera is, well, better than some. We’ve used a lot of 2MP cameras in phones at $150-300, and they're all dreadful. The Moto’s 5MP macro camera is far better, but only occasionally flirts with the idea of producing usable images.",
    "You also need to get very close to your subject to get anything approaching macro-like detail too. The Xiaomi Redmi Note 10 Pro’s macro camera is much better, despite the 5MP sensor, because its lens has a more ‘zoomed in’ view.",
    "Finally, while the 2MP depth sensor sounds like a total throwaway, here just to make up the numbers, it does have an important role. It lets you take background blur shots of anything, not just people.",
    "It’s quite flexible too, happy to have a crack at subjects near or far. The object outlining can be a bit spotty, but it’s an easy route to a more dramatic-looking photo.",
    "The Moto G60S’s video modes are slightly limited, with the typical limitations of a cheaper Android phone. You can shoot at up to 4K resolution, at 30 frames per second. But in this high-res mode you lose software stabilization. 4K handheld footage looks jerky, although does pack in a good amount of detail when shooting in good lighting.",
    "Care about selfies? The Moto G60S has a 16MP camera up front, another OmniVision sensor, and it does a decent job. Dynamic range enhancement stops bright backgrounds from blowing out too much, and facial detail rendering is solid but not exceptional.",
    "Motorola’s approach to Android is always a draw in its entry-level phones. The software feels clean and clear. It’s a vanilla front-end, even if it is actually quite different to what you’ll find in Google’s Pixel phones.",
    "You have two options for navigation. The gesture mode makes you swipe from the edge of the screen to do things like going ‘back’. This mode has its fans, but we went back to the old on-screen soft key style, as nav gestures can compete with apps when, for example, you want to crop an image.",
    "The Moto G60S’s Android 11 interface doesn’t give you as many obvious opportunities for customization as some of its rivals. However, the most important parts are already done. For example, there are five columns of icons instead of the standard four.",
    "Four columns would feel like a waste of space on a phone with a 6.8-inch screen. If you’re looking at this model because you find it hard to make out stuff on your phone’s display, there is an option to increase the size of fonts and icons in the Moto G60S’s accessibility menu.",
    "And, for a phone made deliberately to seem simple and clean, you do still have a good amount of control over some parts of the appearance. In the Moto G60S’s Styles section you can change the color and shape of icons, and the fonts used in the front end.",
    "Motorola’s signature additions are the same as usual. You get shortcut gestures, like being able to turn the torch on with a double karate chop. And there’s the recognizable Moto lock screen, which shows you the time and icons to denote recent notifications in a stylish way.",
    "The Moto G60S is a middle of the pack performer. Android 11 feels good. Your movements between apps and around the system don’t feel obviously slowed down by a lack of CPU power or RAM.",
    "It’s not flawlessly smooth, and tiny little stutters do take away some of the impact of the 120Hz display. But there’s nothing to annoy here.",
    "The situation gets a bit more interesting when we look at the Moto G60S in the context of its 4G competition. You can get some seriously powerful phones at around this price.",
    "The Moto G60S has the MediaTek Helio G95 chipset, used in the Realme 8 and Xiaomi Redmi Note 10S. It’s more powerful than the Helio G80 of the Samsung Galaxy A32, which is an important win.",
    "However, the Xiaomi Poco X3 Pro is far more powerful.",
    "In Geekbench 5, the Moto G60S scores 1,653 points, to the Poco’s roughly 2,800. It also falls slightly behind the Redmi Note 10 Pro’s Snapdragon 732G. But only slightly.",
    "Fortnite runs fairly well, but if you max out the resolution slider there are fairly frequent frame rate drops you can’t fail to notice. Some, but not all, of these are smoothed out if you use the default 75% resolution scaling, but this makes the game look noticeably worse.",
    "ARK: Survival Evolved does not run particularly well at its maximum setting, with a consistently sub-optimal frame rate. All games run well, but not necessarily at their top graphical settings.",
    "This kind of performance is just what we expect from a phone at the Moto G60S’s level. But Xiaomi’s Poco X3 Pro disrupted that, providing far greater power for similar cash.",
    "You get 128GB of storage with a Moto G60S, so there are no complaints there. It’s a lot of space. Storage speed is good too, with read speeds of 375MB/s, and writes of 211MB/s.",
    "Good battery life is something you almost always get in Motorola’s more affordable G-series phones. The Moto G60S has a 5,000mAh battery, like most in this series.",
    "Despite the large screen, this capacity is enough to see you through a fairly heavy day of use without having to worry about the charge level.",
    "We have used the Moto G60S quite intensively during testing, and while we have managed to get close to draining it down to empty in the space of a day, most people should find they have a solid 30% charge left by the time they come to plug it in.",
    "Anecdotally, we did find the Moto G50 seems to last significantly longer between charges. But that makes sense. It has a smaller, lower-resolution screen, and its Snapdragon chipset may be a little easier on the juice than the Moto G60S’s MediaTek one.",
    "As in so many other parts of the Motorola Moto G60S, we’re happy but not blown away.",
    "However, it does see Motorola massively level-up its charging speed. The Moto G60S comes with one of the best chargers shipped with a budget phone. It’s a 50W adapter with both USB-C and USB-A ports on its top. You can therefore use it for everything - even some laptops.",
    "Charging speed is excellent. It gets you from totally flat to 43% in just 15 minutes, and reaches 76% in 30 minutes. The charge system doesn’t seem to be quite as advanced as, say, OnePlus’s, though.",
    "By the 15-minute mark the Moto G60S’s adapter was drawing 40W rather than the roughly 48W of its peak. And it was drawing 24W by 30 minutes. Some charge systems actually use two batteries to increase charging efficiency, and, to the best of our knowledge, the Moto system does not. Still, we’re not going to complain about a budget phone with decent battery life that gets to 76% in a half-hour.",
    "First reviewed: October 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Moto G60S release date and price",
    "10": "Design",
    "21": "Display",
    "31": "Cameras",
    "49": "Software",
    "55": "Specs and performance",
    "65": "Battery life",
    "73": "Don't buy it if..."
  },
  "links": {
    "Xiaomi Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "Moto G50": "https://www.techradar.com/reviews/moto-g50",
    "Samsung Galaxy A32 5G": "https://www.techradar.com/news/samsung-galaxy-a32-5g-release-date-price-specs-and-5g-vs-4g-lte",
    "Xiaomi Redmi Note 10 5G": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-5g",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Moto G 5G Plus": "https://www.techradar.com/reviews/moto-g-5g-plus-review",
    "Samsung Galaxy A32": "https://www.techradar.com/news/samsung-galaxy-a32-4g-announced-and-it-might-be-better-than-the-5g-version",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Realme 8": "https://www.techradar.com/reviews/realme-8-review",
    "Xiaomi Poco X3 Pro": "https://www.techradar.com/reviews/xiaomi-poco-x3-pro"
  }
}