{
  "source": "https://www.techradar.com/reviews/moto-e7i-power-review",
  "title": "Moto E7i Power review",
  "category": "phones",
  "updated": "2021-07-27T16:25:48Z",
  "author": "david-nield",
  "summary": "Really, really cheap – and tailored to suit",
  "verdict": "The main selling point of the Moto E7i Power is its price – and everything else is built around that. It's by no means a great phone, but it does offer a decent value for money proposition if you're on a tight budget and want as much bang for your buck as possible.",
  "pros": [
    "It's very cheap",
    "Clean version of Android",
    "Lots of battery life"
  ],
  "cons": [
    "It's a bit slow",
    "No 5G connectivity",
    "Average camera"
  ],
  "article": [
    "Once upon a time, shopping at the budget end of the smartphone market meant taking a risk as to whether or not your phone would actually work properly. These days, even the cheapest handsets handle the basics well enough, and there are a host of ultra-affordable models out there, from the likes of Nokia, Xiaomi, Realme, OnePlus and others.",
    "The Lenovo-owned Motorola brand still stands out though, when it comes to value for money: Moto devices have been offering plenty of bang for not many bucks for years and years now, and most of the time they can be relied upon to produce something that at least matches what you would expect for the price.",
    "That brings us to the Moto E7i Power, which with a retail price of just £79.99 in the UK (about $110 or AU$150) is just about the cheapest smartphone you're going to find at the moment. As you might expect for the price, that's just about the only real selling point here: everything else is a trade-off to hit that very low figure.",
    "All smartphones make certain compromises so that they can go on sale for a certain price, and it's really a case of personal preference (and personal finances) as to how many compromises you're willing to make. What we can tell you is the value for money that the Moto E7i Power offers, and here it actually scores very highly.",
    "So: it's a slow phone, the camera is only okay, the screen is large enough but could be better in every other department, and you don't get nice extras such as 5G and waterproofing. But for £79.99? Well, it's actually a rather good deal. You can see how a smartphone can be a two-star or a five-star model depending on what's actually important to you as the buyer.",
    "As the Power name suggests, battery life is the other standout feature besides the price – you'll get plenty of time between charges with the 5,000mAh battery. Otherwise, this is exactly what it looks like: a very cheap phone with all the compromises you would expect.",
    "You get a lot in return for how much you're spending, but there are plenty of good budget phones on the market right now, so think about whether it would be worth your while to spend a little bit extra before deciding on this.",
    "Yes, you read that right: you can pick up the Moto E7i Power for just £79.99 (around $110 or AU$150) in the UK at the moment – we're not aware of a new smartphone that you can get cheaper at the moment. For now, the phone isn't on sale in the US or Australia, and we haven't had any indications yet that it ever will be.",
    "You can pick up the Moto E7i Power direct from Lenovo (which owns Motorola), as well as from a variety of third-party sources, including Tesco Mobile, Argos, Amazon and Clove.",
    "The Moto E7i Power doesn't look as cheap as it actually is, which is to its credit: it's not the most stylish, the lightest, or the thinnest budget phone that you're going to come across this year, but it's perfectly respectable as far as its appearance and build quality goes. Of course there's a lot of plastic here, as you would expect, but the handset feels solid and well put together when you pick it up.",
    "In terms of buttons, everything is down the right-hand side as you look at it, with the power and volume buttons just below a Google Assistant button. Not many handsets have a dedicated button for the Google Assistant, but it's something we like – it saves you having to dig through menus or shout \"hey Google\" at your handset.",
    "There are a few more design choices on the Moto E7i Power that we're fans of. The fingerprint scanner is on the back rather than under the screen (which can be awkward to use) or embedded in the power button (which can be even more awkward), and the data connection uses USB-C – let's hope the era of micro USB is gone forever. You also get a 3.5mm headphone jack at the top, which is appreciated.",
    "The camera bump design is simple but fine, and while it means the phone wobbles a bit when placed face up on a hard surface, we can't complain too much about that considering most other handsets are the same. There's a single speaker, which is actually on the back, and pumps out music and other audio with reasonable clarity.",
    "As you would expect when it comes to a phone that's this affordable, you don't get full water or dust resistance on the Moto E7i Power, so you'll have to be more careful than normal with it (or invest in a case) – Motorola says it's \"water repellent\", which we assume means it can take a few drops of rain and not much more. It's one of the trade-offs that you usually have to make if you're shopping at this price point.",
    "Your colour choices are Tahiti Blue (like our review unit) or Coral Red, so the smartphone does at least stand out from the mass of grey and black handsets on the market. Overall, it's an impressive design for the price, and we've got no problems with it.",
    "Motorola is never shy about putting big screens on its smartphones, and the Moto E7i Power doesn't disappoint in this department – you've got a 6.51-inch screen here, and that large canvas comes in handy for watching movies and viewing photos. The resolution is only 720 x 1600 pixels though, so you don't get a huge amount on screen at once when it comes to webpages, documents and so on.",
    "This is a good LCD display for most uses and most apps, even if it lacks the brightness and vividness of top-end panels, and doesn't have extras such as HDR support (which balances out the darker and lighter areas of images and videos), or anything above the standard 60Hz refresh rate.",
    "We watched Netflix, played a few games, browsed through photos and the screen on the Moto E7i Power held up very well.",
    "You probably will need to ramp the brightness right up most of the time though, especially in the daylight outdoors if you want to be able to see what's on the display.",
    "You could say the screen is much like the rest of the package you get here – not bad for the price. There's an obvious step up in screen quality to mid-range phones like the OnePlus Nord 2, but then again there's a big step up in price too.",
    "The bezel thickness around the display is okay, and something most users will probably be able to live with, though the thicker chin is another indication that this is a budget phone. Up at the top there's a teardrop notch which houses the selfie camera, but otherwise the large display is uninterrupted. On the whole, it's a display that we like, and it certainly does the job for all the basics.",
    "It's often the cameras that bear the brunt of the cost-cutting when it comes to budget phones, and the Moto E7i Power comes with a rather unspectacular dual-lens 13MP wide and 2MP macro camera setup – there's no ultra-wide lens here and no optical zoom. Video recording tops out at 1080p resolution at 30 frames per second. On the front you get a single-lens 5MP camera.",
    "The good news is that smartphone camera tech in general has progressed to the stage where even the cheapest modules can take decent pictures (yes, we do remember the earliest smartphones with cameras and the results were... not great).",
    "On sunny days, if you hold the phone steady, the Moto E7i Power can take shots that aren't going to embarrass you on social media – and may even gain a few likes at the same time.",
    "However, details are often blurry and indistinct, colors aren't the sharpest or most accurate, and the HDR processing isn't the most capable we've ever seen – dark and light areas often lose details even with HDR turned on. There is a macro mode here, but it doesn't seem to be much use, and the rear camera can struggle when you're trying to get up close to something. You can get good photos, but not every time.",
    "When the light goes, the phone often struggles to take any sort of picture at all. There is a night mode that seems to just ramp up the brightness of the captured image and little else – it can help in certain situations (and to its credit it works very quickly), but you're going to get a lot of noise along the way. We did get some low light shots that were okay, but it's hit and miss, and even the best ones don't look great.",
    "On the plus side, the shutter speed is nice and fast, with pictures captured in a snap. For quick and easy photos of daily life, the Moto E7i Power's cameras do the job, as long as you don't want to record anything in the evenings – but if you need a camera that you can rely on for the most important moments in your life, we're not sure this is a reliable setup.",
    "Considering the camera quality and the cost of the phone, this is perhaps a handset to get for the kids when they're old enough.",
    "This isn't just a cheap phone – it's just about the cheapest phone on the UK market at the moment – and so blistering performance isn't something you're going to be after if this is on your shopping list. It works, and that's just about good enough. In fact, it works pretty well: there is some brief lag when switching between apps and menus, but the Moto E7i Power is perfectly usable.",
    "Inside this phone there's a Unisoc SC9863A chipset, a mere 2GB of RAM, and just 32GB of internal storage, which can be expanded with a microSD card if needed. Those specs are more or less scraping the barrel for what Android can actually run on, and having seen the specs in advance we thought we might see more performance problems than we did.",
    "In a nod to how relatively underpowered the phone is, Motorola has installed some of the Go versions of the familiar Google apps – these versions are more lightweight and are often used in developing nations on cheaper hardware. The Google app, Gallery app and Assistant app are all Go versions, and the pre-installed Facebook app is the Lite version too. This is a phone where managing system resources is necessary.",
    "You might find yourself limited in terms of gaming – Asphalt 8 runs well enough, but Asphalt 9 won't even show up on the Google Play Store (presumably as the phone won't run it). We played a few rounds of Alto's Adventure without noticing any skipping or lag, while Call of Duty: Mobile ran fine as well (even if it does take up a tenth of the phone's entire storage). There's no doubt that a faster phone will get you smoother performance and faster frame rates though.",
    "That 2GB of RAM means the Moto E7i Power occasionally comes to a halt when switching between apps that are using a lot of memory (games or video editors for example). Some careful management of open apps and a little bit of patience is required to use the phone, but if you're only ever going to be using social media and doing some email checking then we don't think you're going to run into too many problems.",
    "You only get Android 10 here rather than the latest Android 11 (with Android 12 coming later this year), but the good news is that Motorola phones are among the best for keeping bloatware down to a minimum – there is a Motorola Notifications app here, and an FM Radio app, but otherwise you're left with the clean and unfussy basics of stock Android (which we like).",
    "At this price you're going to have to do without 5G, no surprises there. At this stage in its rollout, 5G is something that's nice to have rather than a necessity, and 4G speeds aren't too shabby after all – we wouldn't really knock points of the Moto E7i Power or not having 5G, though you don't have to spend a huge amount to get it these days.",
    "The Moto E7i offers really good battery life, especially if you're not using it much (kind of obvious, but bear with us). The built-in battery has a bigger-than-average capacity of 5,000mAh, and thanks to the low resolution screen and the less-than-cutting-edge internal components, it lasts and lasts.",
    "Motorola reckons you can get 40 hours between charges, and we can believe that – though you'll probably have to dim the screen and ease off the gaming to get that kind of figure.",
    "For video watching with the display brightness ramped right up, we have been getting around 10 hours of battery life; for more intensive tasks like gaming, it's a little less than that.",
    "When you're not using the phone at all (when it's stuck in a drawer for example, as it was for certain times during our test period), the battery life only drops by about 10% a day, so it takes a long while to drain.",
    "Your usage is likely to be somewhere between non-stop video watching and leaving the phone untouched, and with standard, everyday use and not too much in the way of GPS usage we'd say you can probably stretch the battery life out to two days a lot of the time. For a phone that doesn't offer too many stellar features, this is a definite plus point.",
    "As is the norm for ultra-budget phones, there's no sign of wireless charging or fast charging here: you're going to have to use a cable, and you'll be limited to 10W charging (while top-end phones are rumored to be hitting 200W next year). If you're charging overnight that's fine, and again it's a trade-off that a lot of people won't mind considering just how cheap the handset is.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Moto E7i Power release date and price",
    "9": "Design",
    "15": "Display",
    "21": "Camera",
    "28": "Specs and performance",
    "35": "Battery life",
    "41": "Don't buy it if..."
  },
  "links": {
    "good budget phones": "https://www.techradar.com/best/best-cheap-phones",
    "Lenovo": "https://lenovo.7eer.net/c/221109/216346/3766?subId1=trd-us-5531710380059891000&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fgb%2Fen%2Fphones%2Fmoto%2Fmoto-e-series%2Fmoto-e7i-power%2Fp%2FPMIPMDN28MZ",
    "Tesco Mobile": "https://www.awin1.com/awclick.php?awinmid=7093&awinaffid=103504&clickref=trd-us-9171654750165793000&p=https%3A%2F%2Fwww.tescomobile.com%2Fshop%2Fmotorola%2Fmoto-e7i-power",
    "Argos": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2778598106140829700/https://www.argos.co.uk/product/9394762",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FMotorola-E7i-Power-Satin-Red%2Fdp%2FB08X4GJ3B9%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-4088319514940463000-21",
    "Clove": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1274738021150008800&xs=1&url=https%3A%2F%2Fwww.clove.co.uk%2Fproducts%2Fmoto-e7i-power%3Fvariant%3D39340629721131&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmoto-e7i-power-review",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "rumored to be hitting 200W": "https://www.techradar.com/news/xiaomi-mi-12-ultra-could-be-the-first-phone-with-200w-charging"
  }
}