{
  "source": "https://www.techradar.com/reviews/acer-swift-3-2021",
  "title": "Acer Swift 3 (2021) review",
  "category": "computing",
  "updated": "2021-11-09T16:59:11Z",
  "author": "mark-knapp",
  "summary": "For the utilitarians in the crowd",
  "verdict": "The Acer Swift 3 (2021) makes capable performance more accessible than a lot of its ultrabook competitors. It’s a speedy Windows machine and has a reliable display and battery. But, it’s packaged in an unfortunate design that looks bad, feels worse, and might be the most liquid-vulnerable we’ve seen.",
  "pros": [
    "Capable performance",
    "Extensive battery life",
    "Easy-to-see screen",
    "Low cost relative to specs"
  ],
  "cons": [
    "Design doesn’t match price",
    "Unlovable keyboard and trackpad",
    "Dubious exhaust vent"
  ],
  "article": [
    "Acer has updated its more affordable Ultrabook line, the Acer Swift 3 (2021), and brought it in line with the Intel Evo platform. This means some considerable under-the-hood upgrades, especially where battery life is concerned.",
    "The laptop doesn’t quite fall into the same budget price range that previous Swift 3’s did, though, and that sees it face more competition from models from HP’s Envy line, like the far more elegant Envy x360 15 (2021). It even butts up against the likes of the M1 MacBook Air and the Dell XPS 13. That’s a fiercely competitive space to enter, and the Acer Swift 3 actually has a few ways it can stand out, even if it doesn’t ultimately come out ahead.",
    "The Acer Swift 3 (2021) is available now in the US in several configurations ranging from an Intel Core i5-1135G7 model equipped with 8GB of memory and 512GB of storage for $799 (about £585, AU$1,095) to an Intel Core i7-1165G7 model with 16GB of memory and 512GB of storage for $999 (about £735, AU$1,370). These new models have yet to hit the UK market.",
    "Acer has also divided the Swift 3 lineup, offering alternative models with a 13.5-inch display using a 3:2 aspect ratio or a 16.1-inch display and 16:9 aspect ratio.",
    "The Acer Swift 3 (2021) is almost painfully utilitarian in its design. It’s cased in aluminum and a magnesium-aluminum alloy, though coming in a not-very-exciting gray colorway. Acer offers a few jazzier options with a blue or orange-ish colorway, but those colorways are only for specific configurations.",
    "The frame of the Acer Swift 3 doesn’t offer much to get excited about. Though it’s thin, it falls shy of the impressive thinness of other Ultrabooks. At 2.65 pounds (1.2kg), it’s also a bit heavier than some of its competition. Of course, this is a 14-inch model, so a little extra weight over something like the Dell XPS 13 or Asus Zenbook 13 is within reason.",
    "There’s not a lot of wiggle or wobble to worry about from the construction of the Swift 3. It’s almost painfully rigid, giving our palms a bit of tenderness after only an hour of use. We’re happy to at least see very little deck flex from the keyboard area.",
    "We’d feel a little better about the durability and integrity of the device, though, if it had different placement for its exhaust vent. The vent sits at the top right corner of the keyboard, porting directly toward the display and worryingly exposed. On any given day, there are plenty of threats to a laptop, but having a wide vent leading directly into the system’s internals makes working outdoors with even a 10% chance of rain in the forecast a dicey proposition. We hear the fan kick in even when the laptop isn’t under an absurd load though, so the boosted cooling of a wide vent like that may be important for the Acer Swift 3.",
    "Acer’s hardware interface is regrettable. The keyboard leaves a lot to be desired. The keys can be a little mushy, not offering a satisfying pop. And despite having a good amount of space, Acer has opted for a cramped cluster for the arrow keys, Page Up, and Page Down buttons, while tacking Home and End as alternate functions there. It makes navigating documents and selecting text a nuisance that asks for too much precision. The trackpad is also uninspired. Acer uses a hinge (an unsightly one at that) that tilts the laptop when it’s on a desk or table, but that ergonomic addition doesn’t rescue the design. At least the keyboard backlighting gets the main symbols as well as secondary symbols.",
    "The display may be the Acer Swift 3 (2021)’s one saving grace. It’s a reasonably bright display and the anti-glare finish makes it delightfully easy to see. We’ve used it extensively outdoors in bright conditions, and we never really struggle to see what we’re doing like we do with dimmer or glossy displays. The bottom-firing speakers are actually among the best we’ve heard in a laptop, and gets loud enough without getting grating or tinny.",
    "A pair of USB-A ports (one on each side) are nice to see, and the USB-C port on the left that can double as Thunderbolt 4 and support power delivery opens the door for some serious connectivity. Having the option to use a barrel adapter or USB-C for power is also a plus. A full-size HDMI port also isn’t always a given on a thin-and-light laptop but Acer includes one.",
    "We’d forgive a bit of the plainness of the Acer Swift 3 if it were a true mid-range laptop, but Acer has priced it closer to the HP Envy x360, Asus Zenbook 13, and Dell XPS 13 because of its powerful internals and failed to make a corresponding improvement to the exterior.",
    "The Acer Swift 3 (2021) may be making up for its looks with its performance. That upward-facing exhaust vent that we find unsightly may be the very thing that helps it come out ahead of similarly specced Ultrabooks that go for a more impressive build, like the Dell XPS 13 (Late 2020). In fact, the Acer Swift 3 beat that laptop in every single one of our performance benchmarks while both were running on the same processor.",
    "The Acer Swift 3 shows solid numbers in our tests. Single-core performance is strong for a laptop, and multi-core performance is no slouch, though we’ve seen the Ryzen 7 5700U offer improved multi-core performance thanks to its extra cores. The fans do kick in a bit when the Acer Swift 3 is flexing its muscles, but the noise is far from the wailing that gaming laptops put out of their cooling systems.",
    "However, the story of 2020 and 2021 continues as the Acer Swift 3 (2021) is yet another Windows 10 Ultrabook that falls behind the M1 MacBook Air in performance, and that device has considerably more impressive looks, though isn’t quite up to snuff on port variety.",
    "The benchmarks aren’t the whole story, though. Performance on battery can vary a bit. We’re using the Acer Swift 3 extensively, and often find it stalling and feeling unresponsive, occasionally failing to load a program right away and then popping up multiple instances of it several seconds later. It’s not a dramatic fault, and not something that happens every minute, but it’s a consistent lack of responsiveness that we haven’t experienced on some laptops that actually showed worse performance in benchmarks.",
    "The Acer Swift 3 (2021) is certainly living up to its Intel Evo certification. It's a monster in our battery life benchmarks, lasting 14 hours and 31 minutes in our PCMark 10 Battery Life test and just passing the 9-hour mark in our video playback test. The disparity between the two scores does leave us scratching our heads a bit, as usually we see the two tests lineup more closely if not seeing the movie playback even come out ahead.",
    "We can brush the worries aside, though, as our own use of the Acer Swift 3 has put the battery to test in real life, and it holds up quite well. Thanks to the anti-glare display, it’s easy to keep running the Acer Swift 3 without needing to crank the brightness to 100% at all times, helping conserve battery some. And, even spending a whole day writing, editing, reviewing, and YouTubing on Chrome with way too many tabs open, the laptop doesn’t leave us looking for a power outlet at midday.",
    "There aren’t a lot of extras to get excited about with the Acer Swift 3 (2021). Pretty much the only way it goes beyond the basics is with a thin fingerprint scanner that we get to work about one in ten times we use it — not so unusual in our experience with laptop fingerprint scanners. The webcam is as basic as they come as well.",
    "Acer does go a bit beyond the brief with its software, but not in a good way. We get some officious software, Acer Jumpstart, popping up notifications here and there. If they were notifications for ways it can improve the system performance, maybe we shrug it off. But, when it’s a large promo for Forge of Empires, we’re inclined to uninstall the software on the spot.",
    "The system comes running the reliable Windows 10 operating system, but for those looking ahead to the future, you can take comfort knowing that the Acer Swift 3 is eligible for a free upgrade to Windows 11."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design and display",
    "12": "Performance",
    "16": "Battery life",
    "18": "Software and features",
    "21": "Don’t buy it if…"
  },
  "links": {
    "Ultrabook": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Envy x360 15 (2021)": "https://www.techradar.com/reviews/hp-envy-x360-15-2021",
    "M1 MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-2020",
    "Asus Zenbook 13": "https://www.techradar.com/reviews/asus-zenbook-13-2021",
    "Dell XPS 13 (Late 2020)": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro"
  }
}