{
  "source": "https://www.techradar.com/reviews/xiaomi-redmi-note-9t-review",
  "title": "Xiaomi Redmi Note 9T review",
  "category": "phones",
  "updated": "2021-02-24T14:39:09Z",
  "author": "tom-bedford",
  "summary": "The first 5G Redmi phone",
  "verdict": "The Xiaomi Redmi Note 9T is a decent phone for the price. It’s fairly snappy in use, it has a nice design that fits snugly in the hand, and you’re getting 5G compatibility on a budget. It’s not perfect – the display isn’t as bright as it could be, and camera performance is uninspiring – but such limitations come with the price tag. It’s hard to recommend, though, with the Xiaomi Mi 10T Lite offering better specs for the same price.",
  "pros": [
    "Relatively fast to use",
    "Affordable 5G",
    "Feels good in the hand"
  ],
  "cons": [
    "Cameras are only ‘okay’",
    "Lots of bloatware",
    "Mi 10T Lite is the same price but has better specs"
  ],
  "article": [
    "Xiaomi is one of the most prolific producers of mid-range and affordable phones, so much so that its biggest competitor is often itself. In terms of features and specs, the Redmi Note 9T competes more with other handsets from the brand, like the Xiaomi Mi 10T Lite and Poco X3 NFC, than with phones from Motorola, Nokia or Oppo.",
    "The Redmi Note 9T is part of Xiaomi’s Redmi line of affordable phones – although as mentioned it also releases affordable handsets under both the Xiaomi Mi and Poco brands. It’s one of Redmi’s generation-nine phones, launched in early 2021 alongside the Redmi 9T.",
    "It’s ostensibly a successor to the Xiaomi Redmi Note 8T from late 2019, but the two phones have little in common save for their price category and name. It perhaps makes more sense to view the Xiaomi Redmi Note 9T as a contemporary to the aforementioned Poco X3 NFC and Xiaomi Mi 10T Lite, which sit at a similar price point and offer comparable specs. The Redmi phone’s advantage over the former is its 5G connectivity and slightly lower price, and over the latter a battery that’s a sliver bigger… and not much else.",
    "Indeed, the Redmi Note 9T’s biggest issue is the very existence of the Mi 10T Lite. The handsets cost the same in the regions in which they’re available, at least for their low-storage options, but the Mi 10T Lite has better cameras, a faster chipset, a more premium build material, and faster charging. The Redmi Note 9T is only preferable if you need 128GB of built-in storage rather than 64GB, as you have to pay a good chunk more for the higher-capacity version of the Mi 10T Lite.",
    "So how does this phone perform? We were fairly impressed by its processing speeds – the MediaTek chipset in the handset performs well, and when playing games or flicking between apps and menus you wouldn’t be able to tell that this was an affordable handset.",
    "We’ve also got to compliment the design of the phone, though this of course is a rather subjective point. The plastic rear of the device has a textured finish that’s not dissimilar to leather to touch, and it’s easy to grip. The side-mounted fingerprint scanner is responsive and easy to reach – at least it was for us, though this will depend on hand size.",
    "The phone’s not perfect – it has fewer cameras than its predecessor, and its two auxiliary snappers feel somewhat redundant. If you need a great camera phone at this price point, there are better devices. We also found the screen a little dim when we relied on automatic brightness, and even at full brightness it wasn’t exactly blinding.",
    "Most annoyingly, Xiaomi’s bloatware problem rears its ugly head once again, with plenty of pre-installed apps that you’ll find yourself quickly deleting. Xiaomi isn’t the only brand with this problem of course, but some of the phones it released towards the end of 2020 were relatively free of junk apps. Apparently, old habits die hard.",
    "So in many respects, this is a fairly average mid-range phone, but if you want affordable 5G it’s a good choice, if not the best choice – at least while the Xiaomi Mi 10T Lite is on the market.",
    "The Xiaomi Redmi Note 9T costs £229 / AU$399 (around $310) with 64GB storage, and £249 / AU$449 (roughly $340) for the 128GB version – that’s a modest price increase for double the storage, so we’d recommend opting for the latter size phone.",
    "A US release is unlikely, as Xiaomi tends not to market its phones there, but most Redmi phones eventually get an Australian launch, and all the other Redmi Note 9 devices have appeared there, so the Note 9T will likely join those before too long.",
    "The price of the 64GB phone matches that of the 64GB Xiaomi Mi 10T Lite, which held (but, thanks to the Note 9T, now shares) the crown for ‘cheapest 5G phone’ in regions where it’s sold. However the 128GB Mi 10T Lite phone costs £299 (roughly $400 / AU$540), which is a big price increase, so if you need more storage you may want to opt for the Note 9T.",
    "The Xiaomi Redmi Note 9T isn’t the smallest phone, with dimensions of 161.2 x 77.3 x 9.1mm and a weight of 199g, but it’s certainly not the biggest we’ve seen in this price range either, and unless you’ve got small hands it’s fairly comfortable to use.",
    "On the right edge of the phone is a fingerprint scanner mounted in the power button – we found this easy to reach and activate, making the phone convenient to unlock. Above this is a volume rocker, and the phone also has a USB-C port, 3.5mm headphone jack and an infrared blaster.",
    "The latter tool lets your phone send off infrared signals, mainly employed by the Mi Remote app in letting you use your smartphone as a TV, projector, camera or AC remote.",
    "Most phones at this price point have a plastic back, which while being durable and generally giving good grip can make even an ‘affordable’ phone feel a bit too ‘cheap’. However, the plastic rear of the Redmi Note 9T has a bumpy texture that makes it feel surprisingly leather-like, and is pleasant to hold – we even found it offered better grip than ‘regular’ plastic.",
    "The camera lenses are housed in a bump that’s almost circular, but which has a squared-off top and bottom, set in a circular housing – both the Poco X3 NFC and Mi 10T Lite used this design too. This bump doesn’t protrude too far, though it does stop the phone from sitting flat when placed face-up on hard surfaces.",
    "The Redmi Note 9T is available in black, as pictured throughout this review, or purple. Whichever color you opt for, you’ll find white text on the back of the phone saying ‘Redmi’ and ‘5G’, but also manufacturing boilerplate, and certification and recycling logos, which we found marred the otherwise attractive finish.",
    "The display size of the Xiaomi Redmi Note 9T is 6.53 inches, a touch bigger than the 6.3-inch display of the Note 8T, but matching the Note 9 and smaller than the Note 9 Pro’s 6.67-inch screen. Like all those devices, and indeed the vast majority of smartphones, it has a Full HD+ resolution.",
    "It’s an LCD screen, so colors aren’t usually as vibrant as we’d like, and darks don’t look as ‘dark’ as on OLEDs either - overall the contrast was lacking. We found the default color profile of the display was quite warm, which you can change in the settings menu, though people used to the cool tones of OLED might find the results still too warm.",
    "Unlike on most previous Redmi phones you’re getting a 90Hz display here, so the on-screen image gets refreshed 90 times per second instead of 60 times on a ‘standard’ smartphone. This makes motion look smoother, and some people really appreciate higher refresh rates – although those people might prefer the Poco X3 NFC, which can hit 120Hz.",
    "The screen was generally fine, but we did find it a little dim. The max brightness of 450 nits isn’t exactly blinding, but our main issue was with auto-brightness, as this rarely made the display as bright as it should have – we found ourselves disabling the feature and manually adjusting the brightness instead.",
    "One other small issue we found was that occasionally the screen didn’t pick up touches near its edges, so we’d have to tap a button or link a few times for it to register. This didn’t happen too often, and we’re not making a big deal of it, but it’s something to bear in mind.",
    "The Xiaomi Redmi Note 9T inherits three of its predecessor’s rear cameras – 48MP f/1.8 main, 2MP f/2.4 macro and 2MP f/2.4 depth sensor – but misses out on the ultra-wide snapper that phone had. You won’t be taking breathtaking photos with the Note 9T, but if your smartphone photography is purely utilitarian, you won’t mind what’s on offer here.",
    "Photos didn’t have too much dynamic range, so colors seemed to look a little more similar than they should, and this was more noticeable with close-up subjects than wide shots. Images looked reasonably bright though.",
    "We did notice when taking photos that the autofocus could be a touch jittery, sometimes having trouble working out what we were trying to take a picture of (for each picture in our Camera Samples section below, we accidentally took another where the subject is blurred and the background is in focus). If you look at the camera samples closely you’ll also see the depth of field was sometimes a little too shallow, blurring parts of the subject we wanted to capture.",
    "The macro camera should enable you to get decent close-up shots, while the whole point of a depth-sensing camera is to improve background blur effects, so it’s not clear what either of the 2MP cameras are bringing to the party. It seems that in the Note 9T, as in most phones with 2MP auxiliary snappers, these extras are more for fleshing out a specs list than bringing extra functionality.",
    "We’ve complained about issues that arise when taking close-up shots, but wider landscapes didn’t suffer as much. With sufficient lighting our scenic snaps looked fine, and even shots taken at dusk or on gloomy days looked okay.",
    "Video recording is available on the Redmi Note 9T up to 4K 30fps, with additional letterboxing and grid-line modes for people who want them. There’s also a macro video mode, but this is only available at 720p 30fps.",
    "In our testing the phone didn’t handle 4K recording well, however. After we pressed the record button the device froze for a few seconds, so the beginning of the resulting video is still, and throughout the shoot it was laggy – this was obvious to see in the footage. When we tried to end the recording the phone froze again, for about 10 seconds, although this didn’t seem to have an impact on the end of the video.",
    "The Note 9T has a few camera and video modes that we’ve seen on previous Xiaomi phones, including VLOG (where you take short video snippets and the phone automatically edits them together), timelapse, slow motion, and portrait and night photography.",
    "One highlight of the Xiaomi Redmi Note 9T photography-wise is its selfie camera. We were pleased with how well this 13MP f/2.3 snapper performed, with pictures appearing bright and detailed, and in Portrait mode the artificial background blur was fairly accurate, so backgrounds were blurred but our facial features remained in focus.",
    "Inside the Xiaomi Redmi Note 9T is a MediaTek Dimensity 800U chipset, and while it’s very much a budget-phone processor, it provides a pretty impressive amount of processing power.",
    "In a benchmark test, the Note 9T returned a multi-core score of 1,799, which is high for a handset of its price. It beats the Motorola Edge and Google Pixel 5, both of which cost considerably more than the Note 9T, though the Mi 10T Lite, which as we’ve mentioned costs a similar amount, did score 1,931.",
    "Those numbers translate to impressive real-world performance, with the Redmi Note 9T handles gaming well – PUBG played at top graphics with only a few stutters, and other large games loaded quickly. The handset was also pretty quick to navigate, and launched and closed apps with little delay.",
    "The MediaTek Dimensity 800U has a 5G modem, so this phone supports next-gen connectivity – it’s the first Redmi phone to do so, although it’s certainly not Xiaomi’s first affordable 5G phone. Your mileage with 5G speeds will vary depending on your location and provider, but we found the Note 9T ran on our chosen network just fine.",
    "There are stereo speakers on the Redmi Note 9T, but we’d recommend using the 3.5mm audio jack for your music – tunes played through the speakers sounded rather distorted and lacked bass.",
    "The Xiaomi Redmi Note 9T runs Android 10, with Xiaomi’s MIUI laid over the top. This is a useful user interface, with plenty of customization options and a nice-looking design, but it’s got one big problem: bloatware. Xiaomi’s not the only company with this issue, but it’s arguably the worst offender.",
    "When you turn on the phone for the first time you’ll find lots of pre-installed apps, most of which you’ll probably end up deleting. These include Amazon Shopping, TikTok, eBay, LinkedIn, AliExpress, Agoda, WPS Office and six games, as well as plenty of Xiaomi’s own apps. Xiaomi phones have suffered from this issue for some time, and while it appeared to reduce the amount of bloatware on phones released towards the end of 2020, it’s up to its old tricks again here.",
    "If you can look past this annoying software situation (or following a period of intensive app-deleting), you’ll find your ‘standard’ Android fork, with three-button navigation enabled by default and no app drawer, although you can enable the latter in the settings.",
    "One of MIUI’s most notable features is that it scans apps before you install them, so you can check they’re free of malware – the confirmation notification for this does take up the whole screen and minimizes anything you’re doing, though.",
    "Android 10, which MIUI 12 is based on, includes features like a system-wide dark mode and digital wellbeing tools – this is also one of the first Xiaomi phones to have a screen recorder that you can enable from the Quick Settings menu.",
    "With a 5,000mAh battery we found that the Xiaomi Redmi Note 9T easily lasted through a day of use, whether we were just occasionally messaging and catching up with the news, or engaging in more intensive bouts of gaming and music streaming.",
    "We’d guess the battery life will only stretch into a second day if you’re very economical with your use, at least based on our testing. Because of this we can’t quite call this ‘two-day battery life’, but you should generally be able to make it into a second day.",
    "The Redmi Note 9T charges at 18W, which isn’t exactly snappy, especially given the battery’s large size, and it took well over an hour to fully charge the handset from empty – don’t expect to be able to power up this phone during your morning shower and have it run for the full day."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Xiaomi Redmi Note 9T price and availability",
    "12": "Design",
    "18": "Display",
    "23": "Cameras",
    "32": "Performance and specs",
    "37": "Software",
    "42": "Battery life",
    "45": "Don't buy it if..."
  },
  "links": {
    "Xiaomi Mi 10T Lite": "https://www.techradar.com/reviews/xiaomi-mi-10t-lite",
    "Poco X3 NFC": "https://www.techradar.com/reviews/xiaomi-poco-x3-nfc",
    "Xiaomi Redmi Note 8T": "https://www.techradar.com/reviews/xiaomi-redmi-note-8t-review",
    "Note 9": "https://www.techradar.com/reviews/xiaomi-redmi-note-9-review",
    "Note 9 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-9s",
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5"
  }
}