{
  "source": "https://www.techradar.com/reviews/anydo-calendar-app",
  "title": "Any.do calendar app review",
  "category": "computing",
  "updated": "2021-10-12T16:30:27Z",
  "author": "stefan-ionescu",
  "summary": "Could this calendar app be the solution to getting your busy life sorted?",
  "verdict": "Any.do’s calendar is a great competitor to some of the more popular apps on this market. Its core feature set matches that of Google Calendar and Outlook for the most part, and the app receives regular updates. Customization options can be improved, but Any.do should still work fine for most people’s needs.",
  "pros": [
    "Sleek, fast interface",
    "Good for personal and professional use",
    "Wide range of supported devices"
  ],
  "cons": [
    "Premium subscription needed for full experience",
    "Occasionally unreliable customer service"
  ],
  "article": [
    "Calendar apps have evolved beyond the small set of features they were initially known for. Modern calendar apps can facilitate complex scheduling, integration with other platforms (including social media), and planning on an organizational level. At the same time, the traditional use case of the everyday user who just needs a simple calendar app has not been ignored either.",
    "Any.do is one of the better-known names on the app for productivity tools. The company has been around for a decade at this point, and they’ve gone through several major iterations of their portfolio. They originally offered their calendar as a standalone app, Cal, but have discontinued it as of 2014, integrating its features into their main platform.",
    "Any.do is free by default, and that includes the calendar portion of the app. Some features are locked behind the premium subscription, including ones that users might normally be used to getting for free. Still, the free tier of Any.do should be more than enough for the needs of the average user.",
    "Some of the more notable benefits of purchasing a premium subscription include recurring reminders, interface customization, color tagging, location reminders, and integration with specific apps, like WhatsApp. Some of these features should not be critical for most users, though those coming from other apps might be annoyed by the lack of tagging and recurring reminders by default.",
    "Working with Any.do revolves around creating and organizing tasks, and the calendar integrates into that workflow seamlessly. You can create tasks and sub-tasks, and configure them with a traditional set of options, including a reminder, deadline, linked tasks, labels, and more. Advanced labeling (in the form of colored tags) requires a premium subscription.",
    "The app is available on a multitude of platforms, including smart home devices like Alexa. Given its focus on enabling users to make sense of a large number of events and relationships, this should come in handy for those with more hectic lives. Planning on the go is very simple thanks to the intuitively structured task lists and views.",
    "The free version of Any.do’s calendar definitely leaves a lot to be desired unless you’re planning to integrate it with another platform, like Google Calendar. The app is not the best when it comes to long-term planning, and is more suited to resolving day-to-day scheduling issues. This applies to both individuals and organizations.",
    "Any.do boasts a smooth interface that works as expected, even if it may be a bit bare in some aspects. Switching between different tasks and views is simple, as is editing events. Certain editing options are not very intuitive however, such as editing the deadline on a recurring task. Some of those issues are resolved in the premium version, further adding to a somewhat negative impression of the app in terms of the balance between its free and paid features.",
    "The app can be used in a browser and has a native version for iOS and Android. All versions are actively supported and generally uniform in their features and interface. Switching from the mobile version to using the app in the browser is seamless and works exactly as expected. Some features are noticeably easier to use on mobile, however, such as advanced task editing options.",
    "Initial setup and registration is fast and with no unnecessary interruptions. The app doesn’t obnoxiously try to push its premium subscription on you at every step like some of its competitors – though the lack of certain features in the free version accomplishes the same goal.",
    "Customer support is one area where Any.do could use a major improvement. Even for paying users, response times are often slow and the responses themselves occasionally don’t address the original issue fully. If you’re facing any problems with the app, arm yourself with some patience before contacting their customer support.",
    "User reports indicate that the company has been putting effort into improving this aspect of their operations for some time, but they are still not quite there. We recommend giving the app’s free version a try for some time before committing to its premium subscription, to ensure that you are not missing any critical functionality that might require you to regularly interact with customer support.",
    "Any.do faces serious competition in the face of Google Calendar, Outlook, and other popular apps which offer a much larger set of features for free. On the other hand, the app’s premium plan is one of the most affordable on the market right now, so those looking to invest in a quality calendar/organizer app will likely find it worth their money.",
    "The app compensates for some of its missing features by offering easy integration with other platforms. However, given the fact that a premium subscription is required to take full advantage of that, it might not matter much to those frustrated with the default, free feature set.",
    "If you don’t have too many advanced preferences towards your calendar apps, Any.do is a great choice that provides a lot of functionality. The free version should do fine for most people’s needs, and the reasonable pricing of the premium plan can make it easy to fill the gaps of missing features. If you want to try a more advanced approach to organizing your daily life, this is a great place to start."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "4": "Features",
    "7": "Interface and in use",
    "10": "Support",
    "12": "The competition",
    "14": "Final verdict"
  },
  "links": {
    "Calendar apps": "https://www.techradar.com/best/best-calendar-apps",
    "Any.do": "https://www.any.do/calendar/",
    "productivity tools": "https://www.techradar.com/best/best-productivity-apps",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook"
  }
}