{
  "source": "https://www.techradar.com/reviews/ooma-office-review",
  "title": "Ooma Office VoIP service review",
  "category": "computing",
  "updated": "2021-11-15T15:11:07Z",
  "author": "michael-graw",
  "summary": "Oooma Office is one of the most easy-to-use VoIP system for for small to medium businesses. We explore why in our review.",
  "verdict": "Ooma Office is an easy-to-use VoIP service that can work well for many small businesses. However, many key features require an upgrade, and it leaves out reporting features and integrations.",
  "pros": [
    "Video calling enabled",
    "Flexible ring groups",
    "Virtual receptionist",
    "Easily block spam calls",
    "Setup is simple",
    "Call routing",
    "Extension management is easy",
    "Flexible, helpful customer service"
  ],
  "cons": [
    "Desktop app requires upgrade",
    "No software integrations",
    "E-fax feature tricky to use",
    "Not enough SMS options"
  ],
  "article": [
    "Ooma Office VoIP for businesses was designed for smaller companies with just a few employees. It’s extremely easy to use, which is a major plus if you’re using a VoIP phone service for the first time.",
    "On the other hand, Ooma Office doesn’t have all of the advanced features you might expect as your business scales up. So, it may not be the best VoIP service if you plan to grow your staff over the coming year.",
    "In our Ooma Office review, we’ll cover everything you need to know to decide if this VoIP service is right for your business.",
    "Ooma Office starts at $19.95 per user per month. For that price, you get a wide variety of VoIP features, including call routing, digital voicemail, multi-device ringing, and more. However, the basic plan doesn’t include the Ooma Office desktop app, call recording, or voicemail transcription.",
    "For those features, you’ll need the Ooma Office Pro plan, which costs $24.95 per user per month. This plan also adds video conferencing via the desktop app and enhanced robocall blocking.",
    "You can bring your own desktop phones to Ooma, or you can buy preconfigured phones from the company. Basic models start at $69.99, but conference room phones can be as much as $399.99 each.",
    "All users get access to the Ooma Office phone service through an Ooma-enabled desktop phone. You can also place and receive calls using your smartphone with the Ooma Office mobile app. The service also supports SMS text messages.",
    "One of the key features within Ooma Office is the ability to create ring groups. These come in handy if you have multiple employees who could answer a specific call. For example, your sales team and your customer service team could each have their own ring group.",
    "When someone calls a number associated with a ring group, all phones in the group can ring simultaneously, so that anyone can answer right away. Alternatively, you can set up the ring group so that one phone rings first, and then the call switches to ringing another phone if no one picks up.",
    "Ooma Office’s virtual receptionist dovetails nicely with ring groups. With the virtual receptionist, you can play a recorded message for customers when they call your business and present options for different extensions to dial.",
    "The virtual receptionist enables customers to dial a specific extension if they’re familiar with your company and want to bypass a ring group. Helpfully, you can have different messages play depending on whether a call comes in during or after business hours.",
    "Unfortunately, some features that many small businesses would consider essential are restricted to Pro users. For instance, you cannot place calls from your computer without the desktop app, which is only available with a Pro subscription. You also need a Pro subscription to record calls or to read transcripts of your voicemail messages.",
    "Ooma Office falls severely short of the mark when it comes to reporting and integration. This VoIP service doesn’t have a dedicated administration dashboard, and there is no way to track call volume or duration. In fact, you can’t easily see how many calls have been placed to a specific employee or ring group.",
    "The platform also doesn’t have any integrations with popular office software like Microsoft Office 365, Google Workspace, Slack, or Salesforce.",
    "The thing we liked best about Ooma Office is that it’s incredibly easy to use. You can configure your account settings online, and it only takes a few minutes to add all of your business's users and extensions. Setting up more complex options like ring groups and the virtual receptionist is fast and easy, too.",
    "We found that most settings within Ooma Office could be customized. For example, when setting up ring groups, you can choose how long one phone should ring before the call moves on to the next extension in the group. You can also create an unlimited number of custom recordings for the virtual receptionist.",
    "Ooma Office Pro users will be very happy with the desktop app. It supports a centralized company directory, and you can launch an audio or video conference with coworkers in just a few clicks. There’s also an option to host a company-wide speed dial, although this gets less useful as the number of people in your company grows.",
    "Ooma offers 24/7 support for business users by phone, email, and live chat.",
    "The company also has a very thorough online support center. You’ll find detailed tutorials for how to set up your phone network, as well as videos walking you through how to use key features like ring groups and the virtual receptionist.",
    "All calls between two devices using Ooma Office are fully encrypted. The service also encrypts video calls.",
    "Still, we think Ooma Office could do more to keep your account and communications secure. The platform doesn’t offer two-factor authentication, so there’s very little to protect your phone network if your password is stolen. In addition, you can password-protect video meetings, but you cannot lock a meeting room so that new users can’t enter without being approved first.",
    "At $24.95 per month, per user Ooma Office Pro isn’t cheap, and has a lot of competition. We think there are many more robust VoIP services for small businesses.",
    "For example, the Nextiva Essential package for SMB teams of 5 — 19 is much less at $21.95 per user, per month. Of course, it comes with less service features than the Nextiva Professional package which is $25.95 per 5 — 19 users, per month.",
    "But price isn't everything. Another competitor known for their quality service is, GoToConnect which also costs a smidge more at $25.95 per user per month if you have at least five users.",
    "GoToConnect offers call recording, video conferencing, an incredibly flexible call routing system, and integrations for enterprise-scale software like Salesforce. In addition, administrators can access detailed reports about the call volume your business is getting and where those calls are coming from.",
    "Ooma Office is a straightforward VoIP service that can be good for small businesses with just a handful of employees. It offers a virtual receptionist for incoming calls, supports video conferencing, and is very easy to use.",
    "However, given that Ooma Office isn’t a budget VoIP service, we were disappointed with what it doesn’t offer. The administrative and reporting tools are minimal, and integrations with popular office applications are nonexistent.",
    "Overall, we think that competing VoIP services offer more value for growing small businesses than Ooma Office."
  ],
  "headers": {
    "3": "Ooma Office VoIP: plans and pricing",
    "6": "Ooma Office VoIP: features",
    "14": "Ooma Office VoIP: interface and in use",
    "17": "Ooma Office VoIP: support",
    "19": "Ooma Office VoIP: security",
    "21": "Ooma Office VoIP: the competition",
    "25": "Ooma Office VoIP: final verdict"
  },
  "links": {
    "Ooma Office": "https://ooma.sjv.io/c/221109/512639/8762?subId1=trd-us-1095822671620385200&u=https%3A%2F%2Fwww.ooma.com%2Foffice%2Fbusiness-phone-products%2F",
    "best VoIP service": "https://www.techradar.com/news/best-voip-service",
    "Ooma Office Pro plan": "https://ooma.sjv.io/c/221109/512639/8762?subId1=trd-us-2145595475035857200&sharedId=trd-us&u=https%3A%2F%2Fsupport.ooma.com%2Foffice%2Fooma-office-pricing-chart%2F",
    "Nextiva Essential package": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2642228646295625000&xs=1&url=https%3A%2F%2Fwww.nextiva.com%2Fnextiva-pricing.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fooma-office-review",
    "GoToConnect": "https://www.techradar.com/reviews/gotoconnect"
  }
}