{
  "source": "https://www.techradar.com/reviews/unihertz-atom-xl-rugged-smartphone",
  "title": "Unihertz Atom XL rugged smartphone review",
  "category": "phones",
  "updated": "2021-01-26T11:18:05Z",
  "author": "desire-athow",
  "summary": "The world’s smallest rugged smartphone has a big brother",
  "verdict": "The Unihertz Atom XL is a very enticing proposition indeed. Its mainstream performance shouldn’t distract from the fact that it is a well-rounded rugged smartphone, especially with its DMR feature.",
  "pros": [
    "Oleophobic screen",
    "48-megapixel camera",
    "Great price",
    "Solidly built",
    "DMR functionality on a budget"
  ],
  "cons": [
    "Old CPU",
    "No cover for USB or audio connector"
  ],
  "article": [
    "Unihertz has made a name for itself with a series of extreme devices. Previously, it delivered the world’s smallest rugged smartphone (the Atom) and an Android smartphone with a keyboard (the Titan), which could have passed for a BlackBerry.",
    "Now is the turn of the Atom XL, which is billed as the smallest DMR walkie-talkie rugged smartphone. DMR stands for Digital Mobile Radio and is “limited open digital mobile radio standard” pioneered by the European Telecommunications Standards Institute (ETSI)”.",
    "As for the other two aforementioned devices, you can only back the device for now on Kickstarter with a preorder date estimated for June 2020. Given the current global situation at the time of writing, this timeline can and probably will change, so bear this in mind if you intend to invest in it.",
    "Given that Unihertz has successfully financed the previous two smartphones, it is more than likely that the Atom XL will also be delivered as promised and the fact that we’re one of a few publications to have an actual working unit bodes well for them. As it stands, they raised nearly $550,000 or 11x their original goal with six days to go.",
    "There are two versions of the Unihertz; the L and the XL; the only difference between the two is that the former doesn’t include the DMR feature and, at $209, costs $50 less.",
    "Most rugged smartphones follow the same design pattern and the Atom XL is no stranger to that. There’s the familiar rounded corners, metal sides, rubberized frame and patterned back. A couple of surprises though; there’s an IR port and an audio connector.",
    "Neither the latter nor the Type-C connector found at the bottom of the device are protected from water or dust by a flap. That shouldn’t, in theory, be an issue as the device is both MIL-STD-810G and IP68 certified. The top edge of the phone also contains the connector for the antenna.",
    "As for the front of the device, there’s a fingerprint scanner located between two capacitive buttons, the 4-inch display with a Gorilla Glass cover and an oleophobic layer. On one side of the Atom XL is located a dedicated push-to-talk (PTT) button underneath a SIM tray that can hold two SIM cards or one SIM card and one microSD card; on the other is a volume rocker and the power button.",
    "The rear houses a camera sensor and a powerful LED flashlight. All in all, it feels extremely sturdy and its thickness (17.5mm) reinforces that impression; bear in mind though that it is still about 225g and has a footprint of 135x65mm.",
    "The Atom XL has reused the Mediatek P60 CPU found in the Titan along with the same amount of memory (6GB) and onboard storage (128GB). While there is nothing wrong with that (economies of scale, better knowledge of the hardware platform), we’re slightly disappointed as we were expecting better hardware, albeit at a higher price point.",
    "The rest of the specification is reassuringly predictable: Type-C connector, Bluetooth/802.11ac Wi-Fi, a 4-inch display with a non-traditional 1136 x 640 pixel resolution, an 8-megapixel front facing snapper and a rear 48-megapixel camera sensor. The whole device is powered by a 4300mAh battery.",
    "As for the digital mobile radio part of the equation, the Atom XL offers up to 2W power on 400/800MHz bands which translates into an operational range of up to 8Km (line of sight).",
    "Given that the amount of pixels that the device will push is lower than usual, the gaming performance is better than when using a comparable P60 device. That said, don’t expect it to be a gaming platform as the screen is not only too small but also glossy because of the oleophobic coating. This impacts its visual performance when used in bright outdoors negatively.",
    "The storage subsystem delivered some surprisingly good numbers, amongst the best we’ve recorded on a Mediatek platform, hitting almost 516/197MBps in read/write under AndroBench. All in all, it makes for a nippy device with some solid, if unexciting, performance.",
    "As expected with a Mediatek-powered device, there’s a number of bundled applications and features. Duraspeed - which limits the impact of applications running in the background - is one of the more useful ones. There’s also a Wireless Emergency Alerts one, an SOS one and the ubiquitous toolbox (that contains a number of useful features like a compass or heart rate monitor).",
    "The 70mm antenna screws on top of the device, allowing the DMR functionality to be accessed via an Intercom app. By default, you have access to eight digital channels and eight analog ones.",
    "Rivals to the Unihertz Atom XL need to fulfill three requirements; be small, have a DMR and a fairly midrange configuration, all for about $300. Truth be said, we scoured AliExpress and Gearbest and couldn’t find anything that even approaches the Atom XL.",
    "Scrap that, there’s only one competitor that remotely comes close to Unihertz annual flagship and it is the Ulefone Armor 3WT. It is not as portable (because of a much bigger display), is slightly more expensive, runs an older version of Android, has half the onboard storage and an inferior camera sensor. But on the flip side, it has a more powerful CPU and a much bigger battery. Like the Atom XL, it comes with DMR and 6GB of memory.",
    "You can’t buy the Atom XL right now and given the global circumstances surrounding the pandemic and its impact on the supply chain, one can only assume that it will land in the second half of the year. All in all though, if you can wait a few more months, the Atom XL is definitely worth it.",
    "We like the pricing, the design, the display, the 48-megapixel camera, the fact that it has an IR sensor (which means that you can use it as a remote control) and even an FM radio with an audio port. Running Android 10 feels like the icing on the cake. Where the Atom XL leaves us wanting is the Mediatek P60 CPU which is a bit long in the tooth."
  ],
  "headers": {
    "2": "Where to buy",
    "5": "Design",
    "9": "Hardware",
    "12": "Performance and in use",
    "16": "Competitors",
    "18": "Final verdict"
  },
  "links": {
    "Atom": "https://www.techradar.com/reviews/unihertz-atom",
    "Titan": "https://www.techradar.com/reviews/unihertz-titan-ruggedised-smartphone",
    "BlackBerry": "https://www.techradar.com/reviews/blackberry-key-2-review",
    "Kickstarter with a preorder date estimated for June 2020": "https://www.kickstarter.com/projects/jellyphone/atom-xl-the-upgraded-atom-with-48mp-camera-and-4-screen",
    "Ulefone Armor 3WT": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-5435716046360277000&p=https%3A%2F%2Fwww.gearbest.com%2Fcell-phones%2Fpp_009739968108.html%3Fwid%3D1349303"
  }
}