{
  "source": "https://www.techradar.com/reviews/kyvol-af600-air-fryer",
  "title": "Kyvol AF600 air fryer review",
  "category": "appliances",
  "updated": "2021-08-04T10:47:36Z",
  "author": "carrie-ann-skinner",
  "summary": "Can this relatively new air fryer brand rival behemoths, Instant and Ninja?",
  "verdict": "The Kyvol AF600 air fryer is a versatile kitchen appliance that can turn out healthy but still crisp fries and chicken wings every time. It’s expensive, but as well as air fry it can also roast, reheat and dehydrate – and it features a handy viewing window so you can keep an eye on your meals, too.",
  "pros": [
    "Crisp, evenly browned results",
    "Easy to clean",
    "Viewing window to check on food"
  ],
  "cons": [
    "No reminder to turn food",
    "Bulky design",
    "Relatively expensive"
  ],
  "article": [
    "Kyvol may not be a name that you’ve heard before, but it has set its sights on the home appliance market. As well as offering a range of robot vacuums that it hopes will rival the likes of Roomba and Neato, this relatively unknown brand is also planning an assault on cooking appliance brands Instant and Ninja with a new air fryer.",
    "Like many of the best air fryers, the Kyvol AF600 uses hot air to crisp foods that are placed in its frying basket. As a result, it requires substantially less oil to cook items. Kyvol claims that oil requirements are as much as 85% less than when deep-frying foods, providing a healthier way to enjoy indulgent foods such as fries and chicken wings.",
    "As well as air frying, the Kyvol AF600 can also roast, bake, grill, reheat and dehydrate. There are 10 presets that activate set temperature and cooking durations for different foods, although you can adjust these settings using the dial to the right of the 1.5 inch / 3.8 cm LCD screen. There’s a pre-heat function, too.",
    "The Kyvol AF600 can also connect to your home Wi-Fi network so that, using the app, you can remotely switch the air fryer on and off, adjust the temperature and cooking time, choose a preset, and even delay the start of cooking by up to six hours (although, of course, you’ll need to have left the food in the cooking basket ready to go).",
    "For anyone looking for a healthier way to enjoy fries, chicken wings and other indulgent foods, who wants the ability to control their air fryer from their phone, the Kyvol AF600 is well worth considering.",
    "The Kyvol AF600 air fryer is priced at $129.99 / £129.99 and is available from Kyvol and Amazon. Until recently, the Kyvol AF600 has been available in the UK but it's now out of stock. We expect more stocks to become available soon, however.",
    "It’s the successor to Kyvol’s previous model, the AF60, which isn’t as powerful as the AF600 and lacks Wi-Fi connectivity and is priced at $109.99, but is only available in the US.",
    "The Kyvol AF600 will certainly take up a fair amount of space on your countertop, measuring 11.8 x 13.8 x 13 inches / 30 x 35 x 33cm (w x h x d). It comes with a frying basket and crisper plate, both of which are dishwasher safe. It has a capacity of 6 quarts / 5.7 liters, which Kyvol says is big enough to hold a whole chicken or 3.3lb / 1.5kg of fries. Unlike most air fryers we’ve reviewed, the crisper basket also comes with a 9.2 x 4-inch / 23.3 x 10.1cm plastic viewing window on its front, so you can keep a check on how cooking is progressing.",
    "As well as air fry, we’ve already mentioned the AF600 can roast, bake, grill, reheat and even dehydrate, making it as versatile as many of the best air fryers we’ve tested.",
    "The AF600 has a 1.5-inch / 3.8cm LCD screen that displays the cooking temperature and duration, below which you’ll find 10 presets. These are for set dishes including fries, chicken, shrimp and even toast, and each has a default temperature and cooking time – although this can be manually adjusted using the dial to the right.",
    "As well as a preheat function, there’s also a handy recipe function that can transfer the temperature and cooking duration from over 100 recipes in the Kyvol app to the recipe preset button, so it can be activated with a single tap. The crisper basket and crisper plate are dishwasher-safe, while the sleek black plastic exterior can be easily wiped clean with a damp cloth.",
    "The air fryer is able to cook for up to an hour at a time, and reaches a maximum temperature of 392 degrees F / 200 degrees C. There’s no recipe booklet in the box; instead, as mentioned, the Kyvol app offers more than 100 different recipes with suggested timings, cooking temperatures and oil quantities.",
    "We were impressed with the Kyvol AF600 air fryer when it comes to crisping foods – everything we cooked including fries, frozen steak-cut chips and chicken wings had a satisfying crunch. The chicken wings remained succulent and juicy, while both the home-made fries and the frozen steak-cut chips had a crisp exterior with soft fluffy potato inside.",
    "The air fryer was also great from a health perspective: chicken wings and frozen fries required no oil to cook at all, while the app recommended 1tbsp for 1.1 lb / 500g of potato when making homemade fries. We found the viewing window handy to check on our food, while the warm orange glow given off by the internal light made the dishes look very appetizing during cooking. However, after putting the crisper basket through the dishwasher, we found water marks left on the viewing window, which slightly ruined the classy look.",
    "Following the time and temperature suggestions in the instruction booklet, we didn’t need to tweak either setting – the results were just right. Unlike many of the air fryer’s we’ve tested, the AF600 doesn’t have a frozen food setting. We had to use the french fry setting instead, and while many of the frozen fries were evenly browned, others weren’t completely cooked through. However, this could have been easily rectified by the inclusion of a reminder to turn or shake the food part-way through cooking, to ensure that items are evenly browned.",
    "The Kyvol AF600 is the only air fryer we’ve tested to date that has a dedicated toast program. However, the results weren’t great – we found the default duration of eight minutes was far too long, creating more of a melba toast effect rather than the breakfast slice we were expecting. In addition, the hot air being circulated inside the air fryer was also so powerful that it constantly blew our slice of white bread around the frying basket.",
    "Wi-Fi connectivity allows this air fryer to be controlled via your smartphone. Also rather handy is that you’ll receive a notification on your smartphone when your food is ready, in case you miss the audible alert the air fryer emits.",
    "During cooking, the AF600 registered 55dB for noise on our decibel meter, which is equivalent to the gentle hum of a refrigerator. This makes it one of the quietest air fryers we’ve tested to date. Beware, though: while most of the exterior casing of the Kyvol AF600 remained cool to the touch throughout cooking, the viewing window reached 50ºC, so we’d advise you to avoid touching it where possible.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Kyvol AF600 air fryer price and availability",
    "7": "Design",
    "12": "Performance",
    "18": "Don't buy it if..."
  },
  "links": {
    "best air fryers": "https://www.techradar.com/news/best-air-fryer",
    "Kyvol": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9999394032690977000&xs=1&url=https%3A%2F%2Fkyvol.com%2Fproducts%2Faf600-air-fryer&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fkyvol-af600-air-fryer"
  }
}