{
  "source": "https://www.techradar.com/reviews/shinjiru",
  "title": "Shinjiru review",
  "category": "computing",
  "updated": "2021-06-29T03:11:04.770Z",
  "author": "mirza-bahic",
  "summary": "Malaysia-based offshore web hosting provider with a variety of options",
  "verdict": "Shinjiru offers a myriad of hosting options and all the bells and whistles one can ask for, but most of them come with a price tag to match. Although the lack of data centers in the USA might put off some users, if you are not one of them, be sure to give them a look.",
  "pros": [
    "30-day money-back guarantee with all shared hosting plans",
    "Anonymous hosting is available",
    "Full range of hosting products",
    "You can pay with Bitcoin and Ethereum"
  ],
  "cons": [
    "No DDoS protection with the cheapest plan",
    "Not many beginner-friendly features"
  ],
  "article": [
    "Set in motion during 2000, the story of Shinjiru began with the idea to create a company that would distinguish itself among numerous offshore web hosting providers by offering a wide range of options to an even wider range of customers. Headquartered in Kuala Lumpur (Malaysia), Shinjiru has spent two decades providing everything from domain registration and simple shared hosting solutions to VPS and dedicated servers, to businesses that call for a high level of security. At this moment they claim to serve more than 40,000 customers, individuals and corporations alike.",
    "Shinjiru utilizes eight data centers which are located in: Malaysia (naturally), Singapore, Hong Kong, Russia, Luxemburg, Lithuania, the Netherlands and Bulgaria. Although this represents a decent global network, it excludes both North and South America, which could be discouraging for potential customers from the Western hemisphere.",
    "Shinjiru’s main website is nicely done and feels easy-to-use, yet it doesn’t feature an official blog. This discovery left us wondering how, after 20 years in the business, they failed to appreciate the idea of a blog since most of their competitors provide some type of platform for news, announcements and updates about their products at the very least.",
    "As for their social media channels, Shinjiru has a constant presence on several of them, including Facebook, Twitter, LinkedIn, Instagram and YouTube. There, you’ll find countless reasons why to choose Shinjiru as your host (at least, according to them), but won’t discover any tutorials, guides nor support.",
    "Shinjiru definitely isn’t lacking when it comes to choice, since its hosting products range from being simple-to-use and budget-friendly to enterprise-level ones with a price to match. Their budget offshore shared hosting packages are (as one might expect) quite affordable, starting at mere $3.95, but (again, as one might expect) only if you decide to subscribe for three years, which is quite a decision.",
    "The billing cycle is pleasantly flexible and you can opt for almost anything from one month to a three year period. The cheapest shared hosting plan is precisely labeled as “Bulgaria LinuxBasic Plan'' and it includes 100GB of web space (which is pretty generous), up to 10 email accounts, 1GB of memory, ability to have a single website, unmetered bandwidth and a (very much appreciated) cPanel as your control panel. However, you won’t be getting any protection against DDoS attacks.",
    "Share hosting plans come with a 30-day money-back guarantee and all of Shinjiru‘s plans (shared, WordPress-optimized, VPS and dedicated server hosting ones) can be purchased via credit/debit cards, wire transfer, PayPal, Perfect Money, Bitcoin and Ethereum, which is an impressive number of options.",
    "One thing that sets Shinjiru apart from other similar providers is a possibility for their customers to keep their anonymity while staying smart on security at the same time. This is evident from available payment methods as well, which include (in addition to all that is expected) Bitcoin and Ethereum. Since they provide domain registration services as well, you can get a domain name and take advantage of their private data protection feature.",
    "Another welcome bonus is a charge-free website migration feature, so if you already have a website, Shinjiru’s technical team will take care of everything for you.",
    "Going for a plan with Shinjiru should have you break no sweat since all of them are put forward in a clear manner with all the key features listed below. You’ll have to select a data center, then a billing cycle and click on “Order Now”. The first step deals with the question of domain, where you can decide to register a new one, transfer an old one or use it as it is. Either way, the next step is checking out several add-ons. After this, you’ll be asked to fill out a form with your personal information and billing details, create a password, pick out a security question (don’t let it be the one about your favorite color), and decide if you want to join Shinjiru’s mailing list and (after pretending you’ve read the terms of service through and through) complete your order.",
    "Shinjiru’s dashboard is pretty convenient to use and since they offer a variety of control panels (Plesk, cPanel and WHM included) your user experience will be intuitive to the degree to which you are accustomed to a management tool of your choosing. Keep in mind that none of these are offered free-of-charge but for an additional monthly fee, which will considerably drive up the total charge. As an alternative, you are free to purchase Shinjiru’s easy-to-use website builder that provides 354 professional templates, more than 40 widgets and built-in mobile optimization.",
    "didn’t get our hopes too high when it came to the speed performance. After putting it to the test by using GTmetrix as our tool of choice, we got the results we pretty much expected. The load time was just below the average, with a result of 7.9 seconds in comparison with the average of 8.1. At the same time, the number of required requests was above the average (105 in comparison to 89) as well as the majority of the core web vitals, which was concluded when GTmetrix graded the website’s overall performance with a modest C (75%). However, since there are no data centers in the Americas, users from there should expect less promising speed than this.",
    "Shinjiru gives its word to provide “highest SLA of 99.999% uptime” as well as simply “the best network uptime, the lowest latency and packet drop”, so we had to check if they would keep their word. According to UptimeRobot, a tool that monitored the uptime of their main site for a month, they did and they probably will continue to do so. Although the report shows several instances of downtime, none lasted long enough to spoil a result revealing a 100% of uptime.",
    "Shinjiru’s support staff consists of over 50 employees that “don’t sleep” and are there “24/7/365 to hold your hand and walk you through your IT dilemmas”. Alright, we reckon Shinjiru’s employees get to have some sleep from time to time, but there is someone to lend you a hand round-the-clock. In any case, they are reachable through live chat, telephone, e-mail, support ticket and Skype, on top of everything.",
    "For those who would rather rely on themselves, Shinjiru provides a truly extensive knowledgebase featuring more than (we kid you not) 800 articles on various subjects. At this moment, all of them are sorted into 39 categories, some of which are shared hosting, security, cPanel, billing, web server, video guides and so on. The articles themselves are mostly brief (sometimes overly simplistic) and go straight to the heart of the problem, which has its pros and cons.",
    "Together with Shinjiru, Hostinger is one of the most popular offshore hosting options, yet the one with a focus on European market. Apart from anonymity, Hostinger can provide you with everything Shinjiru can, and you will get the “next generation” of DDoS protection with all of its plans, which is not the case with Shinjiru.",
    "AbeloHost is another offshore web hosting provider enjoying a rise in popularity, although this one is based in the Netherlands. Much like Shinjiru, they promise to provide data anonymity, first-rate security and reliability to all of their customers. However, if you are looking for a host for your first website, we would advise going with AbeloHost, since they offer more beginner-friendly features such as free SSL certificate and backups.",
    "HostGator is one of best known hosts out here, although an onshore one with all of the data centers located in the USA. In contrast, Shinjiru provides several data centers in Europe and Asia, but none in the US, so the decision which host to pick out might depend on just that.",
    "When it comes to server locations, Bluehost is much like HostGator and therefore more convenient for the customers from the USA, while Shinjiru might appeal more to those from Europe and Asia. However, in terms of hosting options, features and price, Bluehost comes off as a winner and seems more geared towards newcomers and tech-savvy users alike.",
    "Shinjiru is a robust offshore host that provides superb services at competitive prices, but the lack of some beginner-friendly features might discourage new users from giving them a try. Another point of concern is the absence of data centers in the Americas, which means slower speed for users from these meridians. If either of these factors might be an obstacle for you, don’t forget to check out the hosts such as Bluehost and HostGator, since both are US-based and have more than a fair share of features aimed at newbies in particular."
  ],
  "headers": {
    "4": "Plans and pricing",
    "7": "Ease of use",
    "11": "Performance",
    "13": "Support",
    "15": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Shinjiru": "https://www.shinjiru.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "domain registration": "https://www.techradar.com/news/best-domain-registrars",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "Bulgaria LinuxBasic Plan'": "https://www.shinjiru.com/offshore-web-hosting/budget-offshore-hosting/",
    "DDoS attacks": "https://www.techradar.com/news/best-ddos-protection",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Hostinger": "https://www.techradar.com/reviews/hostinger",
    "AbeloHost": "https://www.techradar.com/reviews/abelohost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}