{
  "source": "https://www.techradar.com/reviews/hisense-u9dg-dual-cell-android-tv-75u9dg",
  "title": "Hisense U9DG Dual Cell Android TV (75U9DG) review",
  "category": "televisions",
  "updated": "2021-12-03T00:48:34Z",
  "author": "nick-pino",
  "summary": "Hisense’s flagship TV is big and beefy, but a little oversaturated",
  "verdict": "The Hisense U9DG is the company’s flagship 4K ULED TV for 2021 and while it delivers brightness in spades and exceptional contrast thanks to its Dual Cell design, it’s not the be-all, end-all OLED competitor we had hoped it’d be. Issues with motion processing and color oversaturation are apparent which, at this price, just don’t befit a flagship TV.",
  "pros": [
    "Excellent contrast and brightness",
    "Two full-spec HDMI 2.1 ports",
    "Ultra-powerful speakers"
  ],
  "cons": [
    "Colors are oversaturated",
    "Motion processing is problematic",
    "Only one size and price point"
  ],
  "article": [
    "On paper, the Hisense U9DG holds a lot of promise - its Dual Cell design allows the flagship TV to have a grayscale layer hiding behind the front LCD to improve contrast while still keeping colors and brightness high.",
    "The result, one would expect, should be an almost QLED experience of bright and punchy visuals and the contrast of an OLED TV. Unfortunately, while it comes close to achieving that - tantalizingly so in fact - it’s the other issues that really hold Hisense’s 75-inch supersized TV from greatness.",
    "One of those primary culprits is the heavy oversaturation of colors in most picture modes and the poor motion control that can leave motion artifacts behind fast-moving objects. We’d also like to have seen Google TV instead of Android TV as the latter can be a little harder to find great new content and more prone to issues, though that wasn’t a deal-breaker for us.",
    "While it doesn’t make the pantheon of the best TVs of the year, with a little refinement to the formula and better motion-processing capabilities Hisense could find it competing with the likes of Samsung, LG and Sony in the premium tier of televisions in the very near future.",
    "The U9DG is part of the Hisense 2021 TV lineup and is the most well-equipped TV with 4K from the manufacturer.",
    "Originally it was priced at $3,500, putting it in tough competition with the most premium TVs from Samsung, Sony and LG, all of which feel like they have the upper hand here. That said, it's now possible to find the U9DG for around $2,000 instead, and that does help soften the blow a bit.",
    "One issue folks might find with the Hisense U9DG is that it's currently only available in a single size and price point. There’s a chance that could change in the future as TV makers sometimes release smaller versions of the same TV one year later, but as of right now there’s only one massive size to pick from.",
    "Although it requires a colossal entertainment center to hold it or a vast amount of wall space should you choose to wall-mount it, the Hisense U9DG is a really sharp looking TV. Friends and family who saw the TV on our entertainment center over the last few weeks have all commented both on the sheer size of the screen and the chic aesthetic.",
    "That said, it's heavy – at over 90lbs, you're going to need some help lifting it.",
    "Should you choose not to wall-mount it, the large 75-inch screen sits on two triangular legs that extend towards the outer edge of the screen. They help give the TV a lower center of gravity and excellent stability, but they do require a large piece of furniture to sit on.",
    "Above the legs is a long silver bezel, a focal point for the front of the screen. On top of providing a nice accent for the screen, the silver bar houses the front-facing speakers that are, well, really quite powerful. There’s really no need for a soundbar here unless you want laser-focused Dolby Atmos spatial audio.",
    "On the back of the TV is where you’ll find all the inputs and outputs and you’ll see that the Hisense U9DG is fairly well-equipped for anything you want to throw at it. Sporting two HDMI 2.1 ports for 4K/120, we were able to attach both our PS5 and Xbox Series X and get the highest resolution and framerate in games like Forza Horizon 5, while still having two extra HDMI ports for an additional streaming device and a 4K Blu-ray player.",
    "Additional ports here include Ethernet, two USB ports, coaxial for an antenna, RCA composite video input, a digital optical audio port and a 3.5mm audio jack.",
    "The last part of the design worth covering is the remote. It’s not the best remote we’ve ever received with a TV, but it’s not the worst either. Its large size makes it easy to find and feels great in the hand. It has a built-in microphone that you can use for voice search or communicating with Google Assistant, plus you’ve got some quick access buttons for the main streaming services like YouTube, Netflix and Amazon Prime Video.",
    "While some Android TV models have already converted to the newer Google TV smart platform, Hisense’s 4K flagship has not. For now, you’re stuck with Android TV.",
    "That’s not necessarily such a bad thing as Android TV does come with some perks like Chromecast Built-in and Google Assistant support. The former will allow you to cast content from your smartphone or tablet quickly and easily, while the latter can answer questions and search for your favorite shows and movies.",
    "Outside of those two advantages, however, there’s not much else to say about Android TV. Its row-based user interface isn’t cluttered but remains hard to find the content you’re looking for and, while it has more apps than nearly any other platform thanks to its Google Play Store integration, few of them feel specifically tailored to Android TV.",
    "Ultimately, it’s a fine smart platform but far from the most intuitive or immersive out there.",
    "The expectation for the U9DG was that it could have the inky black levels of OLED while retaining the peak brightness levels of a high-end LED-LCD screen. And you know what? It almost, almost pulls it off.",
    "What we mean there is that the black levels never quite hit the same jet-black levels that an OLED hits, although it has some 2,000,000 contrast control zones on the case. Scenes of perfect darkness do actually get pretty dark, but you can still see some light in there. And while there are no egregious examples of blooming, pixels do bleed together some.",
    "Speaking of brightness, however, we do have to tip our caps to the U9DG - it can get excruciatingly bright, especially in a light-controlled room. During the day, the extra brightness allows you to see all the details in movies, TV shows and games without needing to close the blinds, and at night you can really see the full effects of HDR.",
    "That extra touch of brightness, likely, is the root cause of the oversaturated colors. Rather than colors coming off as natural in the default picture mode, they come off as unrealistically vibrant, like someone intentionally went into the settings and cranked the saturation setting. You can of course tweak the colors to be a little less intense, but it’s a longer process than getting a TV with better out-of-the-box settings and it does require some knowhow.",
    "What really can’t be fixed (as much as we tried) is the motion processing is a lot worse than on rival flagship screens. Behind the scenes, Hisense is using the Hi-View Engine (4K) to do all the heavy lifting. Without knowing key specs it’s hard to pinpoint the problem, but we suspect that either the motion processing algorithm isn’t as finely tuned as Sony or LG, or the processor needs slightly more power to do the job.",
    "The result is a screen that has a lot of wow factor thanks to its intense brightness and better-than-average black levels, but lacks the refinement needed to compete with the LG G1 OLED, Sony A90J OLED and Samsung QN90A QLED TV.",
    "The Hisense U9DG is easily one of the loudest TVs we’ve tested in the last year. Thanks to its forward- and backward-firing speakers located at the bottom and top of the TV, the U9DG creates a literal wall of sound that, even at low levels, fills the entire room.",
    "The way Hisense tuned the TV out of the box focuses mostly on the mid and upper registers that create a lot of vocal clarity, but not a lot of bass slam. That can be tweaked in the sound settings on Android TV, but know that the default isn’t completely balanced.",
    "Where we have to give the U9DG some credit is by placing speakers and woofers all over the back and bottom of the screen. It’s helpful to give a faux-surround sound experience using just the built-in speakers and could easily generate enough sound for folks who may be reluctant to buy a separate soundbar.",
    "While the sound could be a bit more balanced and extra attention could’ve been given to the lower registers, this is still an incredibly loud TV that should help even the hardest of hearing among us to understand what characters are saying on the screen.",
    "You’re after a unique ULED TV with better black levels than a traditional LED-LCD TV While it doesn’t quite achieve OLED levels of performance, with 2,000,000 contrast control zones, the U9DG does get exceptionally dark compared to a traditional LED-LCD screen.",
    "You need a 75-inch TV to fill some wall space Although its single size and price point make it less versatile than other TV series, the U9DG could be a perfect fit for folks who just want something large and in charge for their living room.",
    "You’re looking for a TV that doesn’t need a soundbar Sometimes you don’t have the space for a soundbar due to certain circumstances. If you fall into that category, you’re going to love the sound quality of the U9DG that rivals - and even surpasses - some of the soundbars on the market right now.",
    "Precise color accuracy or motion processing are important to you Due to issues with the processor and penchant for brightness, colors can look oversaturated and unrealistic, while motion processing can leave artifacts behind fast-moving images.",
    "Android TV feels a little dated to you Android TV isn’t a deal breaker for the U9DG, but is a disappointment considering that other screens from Sony are getting the upgrade to Google TV. Google TV feels a little more modern thanks to its content-first approach and large tiles while Android TV feels a bit dated with its rows and difficult UI.",
    "You feel like your money could be better spent elsewhere We often advocate for some very expensive technology here, but the U9DG just feels far too expensive for what you’re getting in terms of performance. You can buy a decently sized OLED for the same price or save the money for an ultra-premium 8K TV that has even more features for just a little more."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "7": "Design",
    "14": "Smart TV (Android TV)",
    "18": "Picture quality",
    "24": "Sound performance",
    "28": "Buy it if...",
    "31": "Don't buy it if..."
  },
  "links": {
    "best TVs": "https://www.techradar.com/news/best-tv",
    "Hisense 2021 TV lineup": "https://www.techradar.com/news/new-hisense-tv-2021",
    "LG G1 OLED": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "Sony A90J OLED": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "Samsung QN90A QLED TV": "https://www.techradar.com/reviews/samsung-qn90a-neo-qled-tv"
  }
}