{
  "source": "https://www.techradar.com/reviews/vizio-p-series-quantum-x-2021",
  "title": "Vizio P-Series Quantum X (2021) review",
  "category": "televisions",
  "updated": "2021-07-14T14:02:10.434Z",
  "author": "nick-pino",
  "summary": "An ultra-bright flagship 4K TV to rival Samsung's top QLED TVs",
  "verdict": "The Vizio P-Series Quantum X (2021) will consistently impress you with its picture performance, especially if you’re coming from an older first-gen 4K TV. It's bright, it's colorful, and thanks to some improvements to the full array local dimming system, it's contrast-rich, too. SmartCast is still problematic, there’s a bit of blooming - and the sound quality is lackluster - but all things considered it's still one of the better LED-LCD TVs under $2,000.",
  "pros": [
    "Super bright (2,000+ nits)",
    "Improved contrast and color",
    "Dolby Vision and HDR10+ support"
  ],
  "cons": [
    "Poor upscaling and slight blooming",
    "SmartCast can get hung up",
    "Lackluster sound quality"
  ],
  "article": [
    "The Vizio P-Series Quantum X is a consistently impressive LED-LCD TV that combines the brightness of a QLED alongside some of the best black levels this side of an OLED. Offering over 2,000 nits of peak brightness, it lights up any home cinema and cuts through ambient lighting to become one of the best TVs for brightly lit living rooms.",
    "Thanks to a recent firmware update, it's now a great match-up for the Xbox Series X and PS5 and, given the TV's auto-low latency mode, it's also solidly responsive with just a 13ms lag time with 4K/60 games.",
    "That said, you've seen the score above, and the Quantum X isn't without faults. TVs this bright have unfortunately unavoidable blooming, which can be noticed when you’ve got white text on a black background, and its upscaling - while an improvement over previous years - still isn’t up to scratch with LG, Samsung or Sony TVs. SmartCast is a lot better than it’s been in past years thanks to the addition of Apple TV Plus, Disney Plus and Peacock apps, but it’s still frustratingly slow at times.",
    "If you can overlook these negative elements and focus on the benefits of an extremely bright panel, though, the Vizio P-Series Quantum X can consistently impress and won’t cost you nearly as much as a flagship FALD LED-LCD from big players like Samsung, Sony or LG.",
    "The Vizio P-Series Quantum X (2021) is a carryover from last year and will be on sale for the better part of 2021 until next year’s models are announced.",
    "It’s available in three sizes: the 65-inch P65QX-H1, the 75-inch P75QX-H1 and the absolutely massive, 85-inch P85QX-H1, though you probably won’t see that one out on the store shelves very often.",
    "In terms of pricing, the 65-inch version comes in at $1,529 while the 75-inch will set you back $1,999, though both are often on sale for around $1,000 and $1,800, respectively. If you opt for the largest screen size, you’re looking at $3,099, and you probably won’t find nearly as many sales as you would for the more commonly available 65- and 75-inch variations.",
    "To put that price in perspective, the Vizio P-Series Quantum X is significantly cheaper than the new Vizio OLED 4K TV that was released last year and, when it’s on sale, cheaper than every OLED currently available.",
    "Compared to the competition, they're cheaper than the FALD QLED TVs from Samsung, the Samsung Q80T QLED and Samsung Q90T and put out close to the same performance… minus, of course, the slower interface and lackluster upscaling.",
    "The Vizio P-Series Quantum X is a mixed bag in terms of design - it’s not exactly slim because of its full array local dimming lighting, but it has a sleek and simple front bezel. The all-metal front legs stand on both sides of the screen, making it feel relatively stable, but its wide stance could be problematic for folks who have smaller home entertainment furniture.",
    "Viewing it from the side and you’ll see that the P-Series Quantum X isn’t exactly super slim. It’s got a bit of girth to it and isn’t nearly as slim as an OLED, or an edge-lit LED-LCD... not that we’d take the trade-off in performance of the latter for the slimness of the former.",
    "The more pressing issue here, however, is that there’s no real cable management system (unlike the Vizio OLED that has removable back panels to hide cords) which means it can get pretty messy if you plan on using every one of the four HDMI ports.",
    "Speaking of ports, the Vizio P-Series Quantum X has four HDMI ports, two of which are full-bandwidth HDMI 2.1 with 48Gbps passthrough for 4K/120. That means this is one of the few TVs from from last year that can keep pace with the Xbox Series X and PS5, though it did require a little help from a recent firmware update to get there.",
    "The only other key part of the design that’s a bit problematic is the remote - it’s definitely a relic of the pre-smart assistant days and therefore doesn’t come with a built-in microphone. That makes searching for content the slightest bit more difficult than it needs to be, and is an easy area for Vizio to fix with its 2021/2022 models when they’re inevitably unveiled.",
    "The Vizio P-Series Quantum X uses SmartCast – Vizio’s proprietary smart platform that combines the Chromecast built-in system with AirPlay and a content-rich interface that shows curated content as well as recommended shows and movies.",
    "What you’ll probably spend most of your time looking at is the center row of apps that includes most of the big hitters including Netflix, Amazon Prime Video, Hulu, Vudu, Apple TV, YouTube, YouTube TV, Xumo, Peacock, CBS All-Access, Fandango and a few music streaming apps like Pandora, Tidal and iHeartRadio. It’s a pretty solid lineup, with the only major omission being HBO Max, which has yet to make its way to SmartCast.",
    "For cord-cutters and cord-nevers, there’s also Vizio’s own WatchFree app that provides a smattering of content from various big-name networks like AMC and MTV, but the selection of content isn’t vast or star-studded – but hey, it’s all free to watch with ads.",
    "Last but not least, for smart home enthusiasts, SmartCast integrates with both Amazon Alexa and Google Assistant smart speakers, allowing you to control the TV with your favorite AI. It’s not something we really use – and it’s certainly not as handy as having a built-in assistant – but again, it’s better than not having any smart home integration at all.",
    "Our biggest issues with SmartCast – well besides the few we’ve already mentioned above – are that it’s not as responsive as Tizen on Samsung smart TVs or WebOS on LG TVs. Both of those hop easily from one app to another and respond to commands milliseconds after startup. SmartCast TVs? Unfortunately they’re not so quick on their feet and really start to feel their age after two or three years.",
    "If you can overlook those flaws and slower performance speeds, SmartCast is a better alternative to some 4K streaming media players, but not the top of its class.",
    "Despite its middle-of-the-road price, the Vizio P-Series Quantum X competes with the top performers in image quality. It delivers brightness in spades and, with nearly 100% coverage of the DCI-P3 color space and 90% coverage of Rec. 2020, it has a color range that puts most other 4K TVs to shame.",
    "Its overwhelming brightness is a huge boon if you have a lot of ambient light in your living room - even in its standard ‘Bright’ picture settings it has enough light output to not look desaturated, but that’s doubly so if you use the ‘Vivid’ picture setting.",
    "The problem, however, with both the Bright and Vivid settings is that without proper calibration they can skew a bit red, making flesh tones look slightly unnatural and you’re more likely to run into blooming. Speaking of, how much blooming you see will depend on if you use subtitles (white text on a black background is killer for all LED-LCD TVs) and how bright you push the TV - the lower the brightness, the less of it you’re going to see.",
    "Your best bet to reduce all the issues, outside of getting the TV properly calibrated, is to use the Quantum X’s built-in Calibrated and Calibrated Dark modes. The former retains some of the P-Series Quantum X’s huge light output but tones down the colors, while the latter cuts the brightness for better contrast - which is the way to go if you put the TV in a dark room.",
    "The other issue you’ll run into with the Quantum X is that, while it does an exceptional job with 4K/HDR movies and TV shows, it’s not quite the best at upscaling content from below 1080p. This really wouldn’t be our pick of TVs for folks who have yet to cut the cord and still watch most of their favorite shows in sub-HD quality on an older cable box.",
    "If, however, you’re a cable-cutter or a cable-never and you mostly watch 4K/HDR content or play games in 4K/HDR, the Quantum X is a killer screen. With support for both major types of HDR formats (Dolby Vision and HDR10+) as well as a 13ms lag time with 4K/60 games, this is easily one of the best TVs to pair with a PS5 or Xbox Series X now that it’s gotten the latest firmware patch.",
    "In terms of off-axis viewing, we found the P-Series Quantum X to be somewhat middling. It’s not a 4K TV that looks absolutely awful when you sit too far to one side, but there’s definitely some loss in color saturation that’s distracting. If you can, try to sit close and centered, or far away and just slightly off the mark or else the otherwise decent color saturation takes a hit.",
    "For audio output, the Vizio P-Series Quantum X uses two 15-watt, back-firing speakers. That’s a small step-up from most budget 4K TVs that use two 10-watt speakers, but not nearly as good as some of the class-leading LED-LCD TVs, like the Samsung Q950TS that are using a combination of tweeters and mid-range drivers for a 4.2.2-channel sound.",
    "In spite of that, however, for most small-to-medium-sized rooms, the Vizio P-Series Quantum X has a fine sound quality with good presence in the mids and highs. In fact, thanks to the way the TV implements DTS Virtual:X, it even has a wide soundstage, too.",
    "That said, if you put it in a larger room - or one with irregular walls and/or ambient noise - you’ll start to have some problems with the sound performance. In those circumstances, your options are either to turn off the Virtual:X audio or you’ll have to crank the TV’s volume to well above 50%. Neither option is great, but both get the job done in those circumstances.",
    "The bright spot to the Vizio P-Series Quantum X’s audio performance is that it does support Dolby Atmos via eARC, allowing you to connect an object-based surround sound soundbar like the Vizio Elevate to boost sound quality. It’s an added expense, and one you might not be willing to make, but it’s nice to have the option."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Price and release date",
    "9": "Design",
    "14": "Smart TV (SmartCast)",
    "20": "Picture quality",
    "27": "Audio",
    "31": "Don’t buy it if..."
  },
  "links": {
    "best TVs": "https://www.techradar.com/news/best-tv",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Peacock": "https://www.techradar.com/reviews/peacock-tv",
    "Vizio OLED 4K TV": "https://www.techradar.com/reviews/vizio-oled-4k-tv",
    "Samsung Q80T QLED": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
    "Samsung Q90T": "https://www.techradar.com/reviews/samsung-q90t-qled-tv"
  }
}