{
  "source": "https://www.techradar.com/reviews/simply-hosting-and-servers",
  "title": "Simply Hosting & Servers review",
  "category": "computing",
  "updated": "2021-02-23T20:30:57.055Z",
  "author": "mirza-bahic",
  "summary": "Premium hosting services made simple with this host from the UK",
  "verdict": "Simply Hosting & Servers is high-end web hosting provided from the UK and a part of the Register Group, which is an international leader in hosting-related services aimed at professionals and small to medium-sized enterprises. Like its parent, Simply Hosting & Servers offers a lot to growing businesses, but fails to provide some of the simpler services.",
  "pros": [
    "24/7 customer support",
    "Cloud and VPS solutions are reasonably priced",
    "Custom hosting solutions are available",
    "Worldwide network of tier 3+ data centers"
  ],
  "cons": [
    "No shared hosting plans",
    "Not fit for newcomers",
    "Live chat is not an option",
    "Some concerning customer reviews",
    "There is no money-back guarantee"
  ],
  "article": [
    "The idea of Simply Hosting & Servers was set in motion in 2001 as a part of the Register Group, which provides home to more than 540,000 websites around the world. Their motto is to make even the most complex IT simple, as the company's name would suggest. Since the early days, they have specialized themselves in providing premium cloud hosting, VPS (with SSD storages as of late), WordPress-optimized VPS and dedicated servers capable of covering all sizes of businesses. The company is registered in England and Wales, with their main office in Bristol (the UK) and their data centers found in the UK, Ireland, Italy, Spain, Portugal and the Netherlands.",
    "If not for the hosting alone, Simply Hosting (we shall use that name for the sake of convenience) has made the story about itself rather simple. The About section on the main website consists of a few simple sentences and a link to an article on HostingAdvice.com which provides a bit more information about the company. Among other reasons to choose them as a home for your website, Simply Hosting points out their “magic technology” which we decided to interpret as an art of practicing wizardry, which is (obviously) beyond awesome.",
    "Here is another interesting piece of trivia. The original name of the company was PoundHost, but since customers kept confusing the brand name with the equivalent of a one pound store expecting to get dirt cheap services, the managers at Namesco (UK-based company which owns former PoundHost) decided to rebrand the company to Simply Hosting & Servers.",
    "As far as we could see, Simply Hosting doesn’t have an official blog, but has presence on several social networks including Facebook, Twitter, LinkedIn and YouTube. All accounts seem relatively active except for the one on YouTube, which features (oddly enough) only one video and a promotional one to boot.",
    "If you decided not to skip the introduction above, you might have guessed the reason why Simply Hosting didn’t want to be misinterpreted as a bargain-basement company. That is to say, their services wouldn’t exactly be described as budget-friendly, although there are some pretty affordable cloud hosting plans. These are somewhat flexible options and you can pick out how much vCPUs, GB of RAM, GB of storage and TB of bandwidth you want to use. In addition, you can choose what operating system and software you want, and a billing cycle in which you can select to be billed on a monthly or annual basis.",
    "These hosting packages can be purchased via credit/debit cards and bank transfer (BACs only), and if you happen to have a change of heart after the purchase, you’re on your own, because Simply Hosting doesn’t think you will ever do that.",
    "With Simply Hosting you will not find some of the features you may expect to see with other popular web hosting companies geared towards beginners. Since this is (before everything else) a provider of premium hosting-related services, Simply Hosting presumes you already have a registered domain, some experience in this field and a website you want to update with a cloud server, VPS or dedicated server solution. However, email hosting is still available as one of more basic services.",
    "To opt for a plan, you need to know what you exactly want from the start, since a simple shared hosting entry-level plan is not an option. A pretty safe bet would be SSD VPS (the newest addition to the collection) which starts at £4.99 ($6.82) and comes with an ability to be customized in every sense (server, type of processor, amount of memory, storage and bandwidth). Both Linux and Windows are available (with all except with the cheapest plan) and you can choose between several control panels, cPanel and Plesk included.",
    "After picking out a plan and deciding on the details, you’ll be required to give a conventional amount of personal information. There, you’ll have to choose a security question (which is a practice we didn’t see in a while) with most of them being related to memories of youth and your female parent, which seems oddly discriminative towards fathers (alright, it isn’t really, since a father seldom has a maiden name). The only things left are to enter a VAT number (if you are in the EU), decide what white lie to use as a response to the question of where you heard about the company, select a payment method and leave additional notes (which is voluntary, of course).",
    "After getting access to your website, you can fire it up using whichever control panel you go for and if you have any prior experience in this area, you will feel right at home. If you haven’t, creating content and managing all aspects of your new website might feel overly complicated, although far from impossible.",
    "After putting speed of Simply Hosting’s main website to the test (provided by GTmetrix) we were faced with quite unexpected results, and we repeated the test to make sure what we’re seeing is real. According to GTmetrix, most of the web vitals of Simply Hosting’s website were either around average results or below it. This leads to the conclusive E (46%), which doesn’t send a particularly positive message. However, since there is always a possibility (not a probable one, though) they’re not using their own servers to host their main website, we will give them the benefit of the doubt.",
    "An uptime test performed on Simply Hosting’s main website presented us with, fortunately, a whole different story. After the monitoring period of one month, UptimeRobot failed to catch any downtime whatsoever, promising a presentable performance.",
    "If you are wondering what kind of customer support you’ll be getting with Simply Hosting, wonder no more, for you will have an option to choose between e-mail, ticket and telephone. Some sort of support should be available around-the clock and they promise they will respond “ASAP”, which doesn’t say much. However, on another page and as a part of the “Key Features” segment, they promise” to respond to support tickets within 10 minutes and to any telephone call within 1 minute. Additionally, if you have questions related to sales, the corresponding team is available via telephone and ticket from 9AM to 5:30PM, Monday to Friday.",
    "Simply Hosting’s main site contains a fairly decent FAQ section with some of the key questions answered in a short and straight-to-the-point manner. Besides this, there is a knowledgebase marked as “Help and Knowledge” featuring several how-to guides that cover major issues, although a number of them leaves a lot to be desired.",
    "One concern we had concerning the Simply Hosting’s support team was brought on by the reviews written by a couple of displeased users on Trustpilot, as well as by the one beneath their own one-and-only YouTube video. Although this doesn’t seem to be a major issue, it is something we would consider before making a decision to join Simply Hosting.",
    "Globat and Simply Hosting share a motivation to make web hosting as simple as it gets. However, they are geared toward entirely different types of users. While Globat tries to attract newcomers with shared hosting packages that come with free domain registration, cost-free website builder, unlimited features and a money-back guarantee, Simply Hosting addresses already experienced users who are ready to scale up their websites to a whole new level.",
    "HostGator is one of the best known hosts out there, not to mention a strong competitor to Simply Hosting. Both provide good value for money (although Simply Hosting’s solutions are on the high-end side), good performance and a myriad of options, features and available apps. That being said, HostGator covers users with simpler needs as well, and with a generous 45-day money back guarantee, you will have enough time to try them out.",
    "Bluehost is yet another big name in the business and not without good reasons. In addition to cloud, VPS and dedicated server solutions (which Simply Hosting offers), Bluehost adds basic shared hosting as well as WordPress, managed and unmanaged, to the mix. Therefore, if you are looking for some of those, better check out Bluehost. However, if you are searching for an affordable yet top-quality VPS plan, give Simply Hosting a chance.",
    "Leaseweb, much like Simply Hosting, is a competent host best suited for fast growing and rather demanding businesses. Both of them offer a full-range of hosting related services (that is, if we ignore the fact that Simply Hosting doesn’t offer a simple shared hosting) and a global network of data centers to choose from. Both are bold enough to exclude a money-back guarantee and aren’t too friendly to complete newbies. That being said, Leaseweb at least tries to be beginner-friendly, providing a modern website with a lot of information about everything, comprehensive knowledgebase and live chat among the support options.",
    "We can’t dispute the quality of services that Simply Hosting provides, as some of their more unique selling points include highly flexible hosting solutions, a global network of tier 3+ data centers, SSD storages and so on. It is obvious that first-time users and those with basic needs are more likely to find what they are looking for with companies that provide a wider range of hosting services (such as HostGator, Bluehost or Hostinger). However, if you are here looking for a reasonably priced cloud or VPS solution to upgrade your website, give Simply Hosting a go."
  ],
  "headers": {
    "4": "Plans and pricing",
    "6": "Ease of use",
    "10": "Speed and experience",
    "12": "Support",
    "15": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Simply Hosting & Servers": "https://www.simplyhosting.com/",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "Globat": "https://www.globat.com/",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Leaseweb": "https://www.techradar.com/reviews/leaseweb-hosting"
  }
}