{
  "source": "https://www.techradar.com/reviews/corsair-k65-mini-keyboard",
  "title": "Corsair K65 Mini Keyboard review",
  "category": "computing",
  "updated": "2021-04-23T21:01:18Z",
  "author": "ural-garrett",
  "summary": "Hard to ignore performance in a compact design",
  "verdict": "Corsair enters the 60% mechanical keyboard market with something that delivers fantastic performance in a compact yet quality design. Be mindful that the price of entry is fairly high and lack of any elevation options.",
  "pros": [
    "Beautiful yet sturdy design",
    "Hyper responsive keystrokes with up to 8,000Hz polling rate",
    "Individually lit RGB keys that’s are also customizable"
  ],
  "cons": [
    "Function key operation could be better",
    "No way to change elevation",
    "Expensive"
  ],
  "article": [
    "60% mechanical keyboards like the Corsair K65 Mini have become a niche product of both PC gaming markets for several reasons. Losing things like function keys, number pads and individual media controls delivers a compact peripheral with no frills.",
    "Though manufacturers like HyperX and Razer have already had success with their takes on the small form factors, Corsair is next to bat. From the premium build to keystroke performance, there’s much to appreciate here – just be mindful that it’s expensive and lacks any elevation latches if you need them.",
    "Out of the box the Corsair K65 Mini feels great in-hand. Weighing a little under two pounds, the keyboard should easily survive rustling inside a backpack or even some sheer drops. And to add to the portability and longevity, it even features a removable USB-C cable. Utilizing a black matte plastic makes the RGB lighting really pop.",
    "Unfortunately, the angular design leaves out elevation latches that can definitely be uncomfortable if you’re not used to that. The keys themselves feel loose enough for fast-paced gaming or general typing sessions while being tightly locked and secured. PBT double-shot keycaps adds to durability claims: Corsair claims the K65 Mini will last through 100 million keystrokes. Included in the K65 Mini packaging is a Corsair logo ESC key and spacebar replacement. However, the default spacebar does have a comfortable texture to it.",
    "The Corsair K65 Mini uses CHERRY MX SPEED Silver key switches, which is as good as it gets outside of Razer’s optical keyswitches. Alongside the 1.2mm actuation distance and Axon hyper-processing technology, gaming or general typing feels amazing. Full N-Key Rollover also provides the keyboard 100% Anti-Ghosting which means key registration remains highly responsive.",
    "There was never a moment where keystrokes didn’t register correctly - something competitive gamers (and aspiring ones) will most definitely value. Google docs or rapid WASD movement in Doom Eternal, the K65 Mini can keep up. Response times were great regardless of games played such as first-person-shooters or real-time-strategy. Though wrists may feel some strain over prolonged use, finger positioning feels solid.",
    "Similar to other 60% keyboards, trying to use function keys is pretty cumbersome until it finally clicks. The learning curve can be a serious issue for those who regularly use full sized gaming keyboards.",
    "Thankfully, the slew of customization options available for the K65 Mini through iCue does help in alleviating those issues. RGB, key macros and function key settings all can be saved on the 8MB of memory for up to 200 profiles. The process of making those customizations is fairly intuitive especially in the lighting department. Firmware updates and polling rate adjustments can be made from the iCue software, too.",
    "At $109 (£94, AU$169), the K65 Mini is expensive. To be fair, pricing is in line with other similar featured 60% keyboards from rivals like the Razor's Huntsman Mini at $129 (about £100, AU$190). The Huntsman Mini also features elevation latches.",
    "Anyone interested in this kind of keyboard from major hardware manufacturers should consider the Corsair K65 Mini. For Corsair’s first crack at the 60% keyboard, it mostly knocked the K65 Mini out the park."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Don’t buy it if..."
  },
  "links": {
    "HyperX": "https://www.hyperxgaming.com/unitedstates/us/keyboards/alloy-origins-60-mechanical-gaming-keyboard",
    "Razer": "https://www.techradar.com/reviews/razer-huntsman-mini",
    "keyboard": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011"
  }
}