{
  "source": "https://www.techradar.com/reviews/ringcentral-office",
  "title": "RingCentral Office VoIP service review",
  "category": "computing",
  "updated": "2021-11-02T16:23:44Z",
  "author": "gabe-carey",
  "summary": "RingCentral Office as a VoIP service and VoIP provider offer a premium, enduring remote business and customer communications VoIP solution for everyday use.",
  "verdict": "RingCentral Office is a strong solution for organizing all your business communications, from voice calls to team chat. Though not the cheapest option, it has a wide range of software integration and strong security.",
  "pros": [
    "Easy app for all communications",
    "Wide range of software integration",
    "Advanced AI functionality",
    "Impressive security processes",
    "Contact center"
  ],
  "cons": [
    "Limited basic plan",
    "Not the cheapest option"
  ],
  "article": [
    "As modern businesses are increasingly relying on the internet for most communications, many companies have started to offer all-in-one web-based communications packages, taking in Voice over Internet Protocol (VoIP) technology—that is, calls made over the internet rather than traditional phone lines. But with so many providers available, it can be difficult to choose the best VoIP service for your business.",
    "In our RingCentral Office review, we look at the popular provider and assess its pricing, features, interface, support, and security to see how it fares against the competition. Read next: Nextiva vs RingCentral VoIP review.",
    "There are four main pricing options to suit varying sizes of businesses.",
    "The cheapest is the Essentials package, which costs $19.99 per user per month. This includes one dedicated phone number per user, which can be used via the included mobile app or on separately purchased hardware, with 100 toll-free minutes. The plan allows unlimited calls to the US and Canada, unlimited SMS messages, and team messaging. However, there is a maximum of 20 users allowed on this plan.",
    "For businesses with more than 20 employees, the most affordable option is the Standard plan, at $24.99 per user per month. This has no user limit and includes 1,000 toll-free minutes. There’s unlimited audio conferencing, video conferences with up to 100 participants, internet-based fax, and integrations with various apps, such as Microsoft 365, G Suite, and Slack.",
    "The next plan up is Premium, which costs $34.99 per user per month. This includes 2,500 toll-free minutes, video conferences with up to 200 participants, advanced analytics, call handling options like whisper and barge, and a developer platform. A greater range of integrations is also possible, including Salesforce, Zendesk, and industry-specific applications like Canvas and Smarsh.",
    "Finally, there’s the Ultimate plan for $49.99 per user per month, which includes everything in the Premium plan and 10,000 toll-free minutes, device status monitoring, and unlimited storage.",
    "For most small and medium businesses, the Essentials package may be a little too basic, so the Standard and Premium options will be the ideal choices. You can try out RingCentral with a 15-day free trial, which is limited to a maximum of five users.",
    "A separate app that comes integrated with RingCentral Office, Glip is a way for teams to connect and work collaboratively. Text messaging and video meetings are collected in one platform, which can be accessed via mobile app or desktop, and it’s possible to create dedicated threads for projects and topics.",
    "RingCentral accounts for the fact that meetings are increasingly being held over video rather than in person. From the Standard plan up, it’s possible to hold video meetings for teams or conferences of up to 100 people (200 in the Premium plan). The video is in HD, and meetings are password-protected for security.",
    "RingCentral has started building AI capabilities into its platform using technology developed by a start-up called XSELL. By using machine learning, this technology monitors sales agents’ discussions with customers, both over text chat and calls, and can recommend strategies. It can also monitor employee performance to help management identify and reward employees following best practices.",
    "It’s quite easy to set up your company on RingCentral. In a few basic steps, you select a phone number to use with the account, set how many users you want, and then put in your personal and payment details. After that, you can use the main dashboard to go further into the specifics.",
    "The main interface from a user perspective is the RingCentral app, which works on both mobile and desktop devices, and access is also available from a web browser. The app is simple and easy to navigate and has all the needed functions. Phone calls and text messaging are both accessed from this interface, and RingCentral Video is also integrated, so conference calls can be joined from here.",
    "The RingCentral website hosts a knowledge base and a community forum on which you can find solutions to a large number of problems. There’s also a live chat option, though this is an AI that directs you to relevant posts in the knowledge base, so it’s not much more than a search engine.",
    "If you have a problem that you need to get in touch with tech support about, your options are calling them or raising a support case online. If you’re on the Standard plan or above, the phone lines are available 24/7. The online ticket system takes a bit longer to get through, but the responses are generally useful and knowledgeable.",
    "It’s crucial to know if your communications systems are secure, especially if your business deals with confidential information. Fortunately, RingCentral is open about what security processes it has in place and regularly has independent verifications of these processes, which seem to be quite substantial.",
    "All communications are encrypted using both Transport Layer Security and Secure Real-Time Transport Protocol to prevent interception. Also, firewalls are installed on the network, administrative functions require multiple levels of authentication, and the data centers are securely protected by electronic systems and on-site specialists.",
    "One popular rival is 8x8 All-in-One Communications. This is a cheaper option, with plans starting at $12 per user per month, and the basic plan is more comprehensive than RingCentral’s, with video conferencing and unlimited domestic calls.",
    "Another option is Dialpad. Its basic plan costs $15 per user per month, which is a little cheaper than RingCentral, although with the standard option, this goes up to $25. It’s another all-round good service, though there’s no video conferencing feature.",
    "There’s much to like about RingCentral Office. It has a useful app interface from which employees can easily access voice calls, team chat, video conferences, and more. It can also be integrated with a wide range of software, including impressive AI technology.",
    "It isn’t the cheapest option available and the Essentials plan is quite limited, but from the Standard plan upward, RingCentral Office proves to be a worthwhile investment for many small and medium businesses. It’s also reassuring that its security systems are among the best on the market."
  ],
  "headers": {
    "2": "Plans and pricing",
    "8": "Features",
    "11": "Interface and in use",
    "13": "Support",
    "15": "Security",
    "17": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "best VoIP service": "https://www.techradar.com/news/best-voip-service",
    "Nextiva vs RingCentral VoIP review": "https://www.techradar.com/news/nextiva-vs-ringcentral",
    "Essentials package": "https://prf.hn/click/camref:1011l4qw5/pubref:trd-us-5006819527863206000/adref:AFF_TECHRADAR_OFF/destination:https%3A%2F%2Fwww.ringcentral.com%2Faff%2Foffice.html%3FBMID%3DAFF_TECHRADAR_OFF",
    "Standard plan": "https://prf.hn/click/camref:1011l4qw5/pubref:trd-us-5006819527863206000/adref:AFF_TECHRADAR_OFF/destination:https%3A%2F%2Fwww.ringcentral.com%2Faff%2Foffice.html%3FBMID%3DAFF_TECHRADAR_OFF",
    "Premium": "https://prf.hn/click/camref:1011l4qw5/pubref:trd-us-5006819527863206000/adref:AFF_TECHRADAR_OFF/destination:https%3A%2F%2Fwww.ringcentral.com%2Faff%2Foffice.html%3FBMID%3DAFF_TECHRADAR_OFF",
    "Ultimate plan": "https://prf.hn/click/camref:1011l4qw5/pubref:trd-us-5006819527863206000/adref:AFF_TECHRADAR_OFF/destination:https%3A%2F%2Fwww.ringcentral.com%2Faff%2Foffice.html%3FBMID%3DAFF_TECHRADAR_OFF",
    "8x8 All-in-One Communications": "https://www.techradar.com/reviews/8x8-x-series",
    "Dialpad": "https://www.techradar.com/reviews/dialpad",
    "RingCentral Office": "https://prf.hn/click/camref:1011l4qw5/pubref:trd-us-5006819527863206000/adref:AFF_TECHRADAR_OFF/destination:https%3A%2F%2Fwww.ringcentral.com%2Faff%2Foffice.html%3FBMID%3DAFF_TECHRADAR_OFF"
  }
}