{
  "source": "https://www.techradar.com/reviews/dell-xps-15-oled-2021",
  "title": "Dell XPS 15 OLED (2021) review",
  "category": "computing",
  "updated": "2021-10-27T17:34:29Z",
  "author": "michelle-rae-uy",
  "summary": "Even more of a stunner",
  "verdict": "Its beefier specs aren’t the only compelling reasons to invest in this admittedly expensive laptop. The glorious 3.5K OLED screen is an even more compelling one. The Dell XPS 15 OLED (2021) is proof that Dell never fails to keep up with the times.",
  "pros": [
    "The 3.5K OLED is an absolute dream",
    "Snappy CPU",
    "Great keyboard and trackpad",
    "Lighter than its predecessor",
    "SD card reader is a nice touch"
  ],
  "cons": [
    "RTX 3050/3050 Ti are underwhelming",
    "Expensive",
    "Battery life is surprisingly short"
  ],
  "article": [
    "This year, the Dell XPS 15 is now rocking an RTX 3000 GPU, a much-needed update to a well-deserving laptop. Oh, and it comes with an OLED display option as well. That’s right. The new Dell XPS 15 OLED (2021) is one of the early adopters of OLED technology in laptops. And, what a glorious adaptation it is.",
    "It’s a match made in heaven – the Dell XPS line and organic LED technology – and the Dell XPS 15 OLED (2021) is proof. In fact, it might just be the perfect notebook to convince people to jump on the OLED bandwagon: its beautiful thin aluminum chassis is just the ideal vessel for a vibrant 3,456 x 2,160 OLED display with Dolby Vision support.",
    "And, it makes the rest of the updates – the Tiger Lake-H chips, RTX 3050/3050 Ti graphics, lighter design – look like mere cherries on an already delicious sundae.",
    "Not that there are many options at the moment, but even if there were, the Dell XPS 15 OLED (2021) is among the best ways to get into this new OLED laptop trend, even if it’s a bit more expensive. The minimum OLED display configuration, which comes with an 11th-gen Core i7, RTX 3050 Ti and 16GB RAM, will set you back a whopping $1,959 (£2,098, AU$4,098). Meanwhile, the top-end configuration with an 11th-gen Core i9 and 64GB of RAM will cost you $4,507 in the US and £3,223/AU$5,538 in the UK and Australia. The only difference is that the highest US configuration gets you 8TB of storage while those in the UK and Australia limit you to 2TB.",
    "No matter the configuration, those are pretty steep prices for regular users, and if you’re not willing to spend as much, you’ll be pleased to know that there are non-OLED options on hand. This means that you can still get the new Dell XPS 15 OLED (2021) for as low as $1,273 / £1,499 / $2,998. You might not be able to take advantage of that touch OLED display, but the 15.6-inch 1920 x 1200 InfinityEdge display with 500 nits of brightness is fabulous in its own right.",
    "If you do go for an OLED model, know that you’re mostly paying that steep price for the OLED panel, seeing as more powerful rivals sit around the same price point. The MacBook Pro 14-inch (2021), for one, whose base configuration sits at $1,999 (£1,899, AU$2,999) for the more powerful M1 Pro with an 8-Core CPU and a 14-Core GPU and Apple’s legendary Liquid Retina XDR display.",
    "The Razer Blade 15 is even better value, asking $1,799 (£1,699, AU$3,249) for a similar configuration as the Dell XPS 15 OLED (2021), only with a more powerful RTX 3060 and no OLED display. Although, if you want its OLED model, it’ll set you back an eye-watering $3,399 (£3,199, AU$6,199).",
    "The Dell XPS 15 OLED (2021) comes in the same CNC-machined, scratch-resistant aluminum chassis with a carbon fiber or glass fiber interior as its predecessor, and it’s just as thin and relatively portable at 13.57 x 9.06 x 0.71 inches. It’s also just as beautiful, coming in the usual black on platinum silver and arctic white on frost colors, as well as with that neatly woven palm rests that give it that extra splash of class.",
    "It’s a bit lighter than the 2021 model, however, with the OLED model sitting at 4.31 pounds (1.96 kg) and the non-touch starting at 3.99 pounds (1.81 kg). It isn’t going to be as easy to lug around as the Dell XPS 13, but that slight drop in weight still matters.",
    "Naturally, both the infrared camera and the fingerprint reader for Windows Hello and fingerprint logins are on hand. As are the ports from its predecessor – two Thunderbolt ports with PD and DP Alt Mode, one USB-C also with PD and DP Alt Mode, a wedge-shaped lock slot, a 3.5mm headphone/mic jack, and for creative users, a full-sized SD card reader. Those Thunderbolt ports have been upgraded from Thunderbolt 3 to 4, however, which means that each can support two 4K displays or one 8K display.",
    "The keyboard and trackpad are on point as always, though they might feel a bit too wide for those who are used to smaller laptops. The backlit keys are satisfying to type on, with maybe a bit more resistance compared to scissor switches, but not enough to affect accuracy and responsiveness. The trackpad feels luxurious to touch and just as responsive. It’s also massive, so there’s plenty of space to work with when you’re creating content. The only issue is that it’s so big it will take a while for some to remember to get their pinky and ring fingers off it. Otherwise, it could result in accidental presses.",
    "There are two 2.5W woofers and two 1.5W tweeters, all upward firing, giving this laptop some hefty stereo power. This laptop gets loud – we’re able to hear Midnight Mass clearly from the bedroom as it's playing on the laptop in the living room, which is pretty impressive for a laptop. The sound quality is great as well, clean and clear, bright with plenty of bass. Twin Shadow songs sound great on it - it is a bit thin in the mid-range, but the highs are very present. And, while it does get a bit distorted at higher volumes, it’s not too bad.",
    "Saving the best for last, that 3456 x 2160 OLED screen is an absolute stunner, touting 400 nits of brightness, a 100,000:1 contrast ratio, and 100% DCI-P3 color coverage, which makes it fantastic for photographers and video editors. This being an OLED screen, you’re not just getting deep and vibrant colors here, but also deeper blacks, which truly shows.",
    "If that isn’t enough, there’s support for Dolby Vision as well, which truly expands the dynamic range for Dolby Vision content like Enola Holmes, Squid Game, and Midnight Mass, keeping the colors rich while getting a lot more detail in very bright and dark scenes. We don’t think we’ve ever experienced such viewing pleasure on a laptop as we have on the Dell XPS 15 OLED.",
    "And, of course, the touchscreen functionality is as responsive and as intuitive as ever.",
    "Boasting an Intel Core i7-11800H CPU and Nvidia GeForce RTX 3050 Ti GPU, along with 16GB of memory, the Dell XPS 15 OLED (2021) is designed with more demanding users in mind. It’s certainly a nice upgrade from the Dell XPS 15 (2020)’s GTX 1650 Ti, but is it enough for creative professionals?",
    "The Dell XPS 15 OLED (2021) certainly breezes through some demanding tasks, like when you’ve got over 20 browser tabs – a couple of them streaming shows, Spotify, and Microsoft Outlook open at the same time. It’s snappy while staying cool under pressure.",
    "Next to the more powerful Dell XPS 17 (2021), it holds it own and doesn’t get left behind in the dust, scoring 1,541 points in single-core on GeekBench 5 and 9,642 points on Cinebench R23 next to the 17-inch’s 1,574 and 9,923 scores, respectively.",
    "However, even the RTX 3050 Ti is no match for the RTX 3060 in the XPS 17. It has scored much better than its predecessors, but much lower than its larger counterpart. This shouldn’t be too surprising, though. It performs smoothly in Adobe Photoshop, but isn’t as snappy (or quiet for that matter) handling 10 or more high-resolution images in Adobe Lightroom. In fact, it feels ever so slightly sluggish – about on par with our 2019 MacBook Pro 13-inch, which only has Intel Iris Plus graphics inside.",
    "If you’re looking for a laptop for graphics-intensive workloads, you’re better off with the bigger model. However, if you just want something for general productivity, multi-tasking, and a ton of media consumption, this is the laptop to get – especially with the gorgeous OLED display.",
    "While Dell claims that the 1080p configuration of the XPS 15 will last more than 13 hours, the OLED model is only rated at up to 9 hours and 13 minutes. And, unsurprisingly, it rates even lower in our battery tests.",
    "It gets only 7 hours and 11 minutes in the PCMark 10 battery test that simulates various real-world applications, and 6 hours and 37 minutes on our looped video playback test. This being an OLED laptop, you might be able to squeeze a bit more juice out of it with the Windows Dark Mode turned on. However, it’s still not going to be anything to get excited about.",
    "With the M1 Pro/Max-powered MacBook Pro 16-inch (2021) promising up to 21 hours, the Dell XPS 15 (2021) is definitely getting left behind. Although, obviously, it’s only as power-efficient as its internals, which means Intel and Nvidia have some work to do.",
    "If you plan on attending a lot of virtual meetings, the microphone and webcam are as important as anything else on this laptop. And, the XPS 15 delivers fairly well.",
    "The dual-array microphones do a good job of picking up voices. You could walk across the room and the person on the other end of your Zoom meeting will still be able to hear you. There also seems to be some background rejection going on. We’re able to play Bon Iver at full volume on our phone from across the room without the mics picking it up. Yet, when we speak from this same spot, we come out loud and clear.",
    "Its 720p camera is, sadly, not the best. You’ll come out clear to those you’re on a voice call with, especially during the daytime when there’s plenty of natural light to work with. However, in lower or artificial lighting, expect a lot of noise and lost details in dark and bright areas. If you need top-notch visuals for your business meetings or streaming content, you might want to invest in a dedicated webcam with a higher resolution and better dynamic range."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design and features",
    "15": "Performance",
    "20": "Battery life",
    "23": "Camera and microphone",
    "26": "Don’t buy it if..."
  },
  "links": {
    "RTX 3000": "https://www.techradar.com/news/nvidia-ampere",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Tiger Lake-H": "https://www.techradar.com/news/intel-tiger-lake",
    "MacBook Pro 14-inch (2021)": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "Razer Blade 15": "https://www.techradar.com/reviews/razer-blade-15-2021",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Dell XPS 17 (2021)": "https://www.techradar.com/reviews/dell-xps-17-2021",
    "MacBook Pro 16-inch (2021)": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "dedicated webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972"
  }
}