{
  "source": "https://www.techradar.com/reviews/acer-predator-triton-500-se",
  "title": "Acer Predator Triton 500 SE review",
  "category": "computing",
  "updated": "2021-10-15T22:04:29Z",
  "author": "ural-garrett",
  "summary": "When the bark doesn’t match the bite",
  "verdict": "The Acer Predator Triton 500 SE has the look of a top tier gaming laptop from its aggressively styled build, beautiful WQXGA display and respectable specs. But behind those attractive specs is a hollow device that offers below average gaming performance, low storage and weak speakers.",
  "pros": [
    "Premium build quality",
    "Esports ready display that’s also gorgeous",
    "Respectable battery life",
    "Solid productivity performance"
  ],
  "cons": [
    "Gaming performance isn’t competitive compared to rivals",
    "Bigger SSD storage would be nice",
    "No USB-C Thunderbolt charging",
    "Speakers are pretty weak",
    "Some may find the Turbo button useless"
  ],
  "article": [
    "The Acer Predator Triton 500 SE is Acer’s flagship gaming laptop, featuring intel Core i7 processor, an Nvidia GeForce RTX 3060 GPU, 16 GB RAM and a 512 GB SSD. It seems impressive on the surface, especially with a 165Hz 16-inch display – the Predator Triton 500 SE has the makings of a top-tier laptop.",
    "But once you look past the attractive aesthetic and admirable specs, the Predator Triton 500 SE doesn’t offer substantive gaming performance. Even with an extra Turbo button to keep fans running at maximum speed, the gains aren't significant despite a slightly higher framerate Meanwhile, the 512GB SSD is a problem as the best PC games keep getting bigger.",
    "The Predator Triton 500 SE does provide some reasonable productivity performance for the Adobe Suite creative crowd that’s mode better by the beautiful display besides general application usage. Those looking for something that leans into better all-around gaming may want to look elsewhere.",
    "The Predator Triton 500 SE starts at $1,749 for the base model which is the configuration listed to the right, but the laptop is available in four configurations. Each config has the same 16 inch WQXGA display with a 165Hz refresh rate alongside other feature sets like port layout, Turbo button and keyboard layout.",
    "For $250 (£215.55, AU$337.08) extra, the $1,999 configuration comes with both 1TB of SSD storage and NVidia RTX 3070 with 8GB VRAM. The $2,399 (£2068.42, AU$3234.61) configuration features the same 1TB upgrade and Nvidia GeForce RTX 3080. If you’re looking to max out the Predator Triton 500 SE, it’ll set you back $2,699 (£2327.08, AU$3639.43) but you’ll get the latter configurations storage and GPU upgrades but with an Intel Core i9 processor and 32 GB of RAM.",
    "Though there is a product page for the Predator Triton 500 SE on Acer’s UK and Australia sites, purchasing options aren’t currently available. As of right now, all of the variants excluding the highest $2,699 (£2327.08, AU$3639.43) trim are exclusive to Best Buy.",
    "The price pits the Acer Predator Triton 500 SE against rivals like the $1,699 (£1464.88, AU$2290.99) MSI Stealth 15M and $1,799 (£1,551.10, AU$2,425.56) priced Asus ROG Zephyrus G15. Leaving the generally inferior MSI Stealth 15 behind, the Predator Triton 500 SE doesn’t hold much of a candle to Asus offerings. For the same price, you can get more storage and better performance elsewhere.",
    "Everything great about the Predator Triton 500 SE is in its aesthetic. Open or closed, this is definitely one of the best looking gaming laptops available. The aggressive angular chassis doesn’t go overboard with the hypercar look many other gaming laptops employ and is sleek where it counts.",
    "The display hinge doesn’t protrude or anything when closed, which gives the laptop a more uniform look. When opened, the display can also nearly fold flat on its back which is impressive. Regardless of watching a movie, playing games, editing media or just getting work done, the 16 inch WQXGA screen is a site to behold. Besides the advantage of having a higher refresh rate, colors pop and blacks are deep when needed.",
    "At the top of the display is also a standard 720p camera. The camera resolution is good enough for video conferencing and the likes but serious streamers will probably need to get an external webcam. Though it would be nice to have the included fingerprint scanner in another location, the touchpad is buttery smooth and feels great to use in general. Clicking, scrolling, zooming, right-clicking and more are simple and work every time.",
    "The keyboard is also great – keystrokes are tactile and bouncy, while the layout of buttons is exemplary. Function key placement is responsible, including a dedicated button to access the Predator Sense software packed in. Through that app, users can customize the three-zone RGB lighting features offered on the keyboard among other options that’ll be touched on later in the review.",
    "Port placement is adequate too. The right side features the standard Kensington laptop lock, SD Card slot, USB-A port, USB-C port with Thunderbolt 4 and an HDMI port. On the opposite side sits an A/C power jack, ethernet port, 3.5 mm headphone jack, USB-A port and another USB-C port with Thunderbolt 4. The set-up should be good enough for everything from media creation to streaming.",
    "Sitting at the top of the lower half of the gaming laptop are DTS:X Ultra Speakers that sound generally weak. They sound even worse when utilizing the nearby Turbo button that kicks all the fans into high gear. Headphones are totally recommended.",
    "The Acer Predator Triton 500 SE is great for productivity and creative workloads like photo and video editing. And while that’s great, this is a gaming laptop. When it comes to general gaming performance, the laptop is simply disappointing where it matters most.",
    "There’s something unimpressive about a gaming laptop in 2021 that can’t manage a locked in 60 in older games on Ultra settings at 1080p resolution. This is what happens during benchmark tests of Total War: Three Kingdoms and Metro Exodus. Both couldn’t make it past the low 50s on average. It’s more disappointing, considering the Asus ROG Zephyrus G15 can pump out between 65 - 70 fps on the same titles on the exact same video settings with similar specs.",
    "Other visually demanding games like Dirt 5 and Deathloop can’t run over 60fps without turning down video settings, either. Even the additional Turbo button doesn’t help much beyond a small frame rate boost and a cooler lap but at the cost of an intrusive audio experience. Be mindful that the Turbo button won’t work if the laptop isn’t plugged into a power source with the battery above 40%. It’s also a good idea to stay away from ray-tracing, as that’s going to further diminish frame rates.",
    "For a gaming laptop offering a 1,600p resolution, what’s really the point of using it for gaming if it can barely run top tier titles at high frame rates? If anything, the Acer Predator Triton 500 SE is better suited to esports like Fortnite, PlayerUnknown Battlegrounds and Rocket League. It handles those games without breaking a sweat and the added 165Hz refresh rate lends a competitive edge.",
    "For a gaming laptop, the battery life on the Predator Triton 500 SE isn’t the best but still respectable. During the PCMark 10 battery life test, the laptop shuts down just short of seven hours. The video loop test has the laptop giving up at 6 hours and 30 minutes.",
    "Gaming at high settings without the A/C port plugged-in will lend itself to around two hours, which is fairly average. Bicoastal travellers shouldn’t have much to worry about during flights. But it still pales in comparison to the nearly 9 hours that the Asus ROG Zephyrus G15 can achieve. Charging to max battery life is about two hours, though we wish we could charge the Predator Triton 500 SE through the available USB-C ports considering they both have Thunderbolt 4.",
    "The core of the Predator Triton 500 SE software suite that comes packed in with the laptop is the Predator Sense. With it, you can check up on several customization options. This includes everything from fan control and CPU/GPU power management to RGB lighting controls for the keyboard, as mentioned previously. Predator Sense also offers custom game settings controls through Game Sync beyond being a portal to other software suites like Killer Control Center, DTS:X for audio and Care Center to monitor general laptop health.",
    "Making up for the lackluster built-in speakers is the excellent DTS:X software. Here, users can customize various audio and EQ settings that work well with headphones. There are also personalization options for users who want different settings for various tasks including music listening, movie watching and gaming.",
    "Like many Acer gaming laptops, there’s also the ability to use Planet9, which works as a communication hub for esports gamers. It’s designed to help gamers find teammates with similar skill levels. Aspiring esports gamers looking to connect and head down that road should find it useful."
  ],
  "headers": {
    "3": "Price & availability",
    "7": "Design",
    "13": "Performance",
    "17": "Battery life",
    "19": "Software and features",
    "22": "Don’t buy it if..."
  },
  "links": {
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "MSI Stealth 15M": "https://www.techradar.com/reviews/msi-stealth-15m",
    "Asus ROG Zephyrus G15": "https://www.techradar.com/reviews/asus-rog-zephyrus-g15",
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972"
  }
}