{
  "source": "https://www.techradar.com/reviews/roccat-vulcan-tkl-pro-gaming-keyboard",
  "title": "Roccat Vulcan TKL Pro gaming keyboard review",
  "category": "computing",
  "updated": "2021-04-20T19:27:24Z",
  "author": "michelle-rae-uy",
  "summary": "Compact gaming keyboard that’s first in its class",
  "verdict": "Roccat’s legendary Vulkan is back, but in a compact form this time. A tenkeyless gaming keyboard, it boasts the brand’s Titan optical switch that’s both impressive in performance and quiet in operation. It’s a beaut as well, with a classy brushed gunmetal finish and floating keys that showcase its customizable RGB lighting brilliantly.",
  "pros": [
    "Fast and accurate performance",
    "Compact form factor",
    "Satisfying yet quiet operation",
    "Stunning RGB lighting",
    "Robust build"
  ],
  "cons": [
    "Pricey",
    "Roccat Swarm software finicky",
    "Lots of shortcuts"
  ],
  "article": [
    "The new addition to the Vulcan line, the Roccat Vulcan TKL Pro, doesn’t exactly go full compact, like the host of mini gaming keyboards that have recently hit the streets. This one just sacrifices the numeric keypad, only chopping a few inches off its original’s form factor so that it fits small setups better, without completely abandoning the necessary bits like arrow keys.",
    "This strategy isn’t exactly new. Gaming keyboards like the Razer Huntsman Tournament Edition and Corsair K63 Wireless have done it years prior. However, Roccat adds its own spin to the Roccat Vulcan TKL Pro, giving it the floating keys design that’s an absolute stunner and those Titan optical switches that are just a pleasure to use.",
    "With a compact form factor, a gorgeous design, and extremely satisfying tactile feedback, the Roccat Vulcan TKL Pro already has a lot to offer. But does it perform good enough for the price?",
    "At $159 (£149, AU$239), it isn’t exactly the most affordable gaming keyboard of the lot. Though that price is also on par with some of the best gaming keyboards right now, full-size and otherwise. It’s only about $50/£40/AU$60 pricier than the Corsair K63 Wireless and $30/£20/AU$20 more than the Razer Huntsman Tournament Edition, and about just slightly cheaper than the full-sized gaming keyboards that have made it on the list.",
    "The Roccat Vulkan TKL’s performance, design, and features should justify that price to serious gamers willing to invest money on gear. At the same time, it’ll turn off others.",
    "For those folks, there are more affordable options, including the Roccat Vulcan TKL, the mechanical version of the Pro that costs a little less at $129/£119/AU$209. It boasts mostly the same design and features, only it has mechanical switches instead of optical – with a deeper actuation of 1.8mm (as opposed to the optical’s 1.4mm). If we’re being honest, however, it doesn’t feel any better or worse when it comes to performance – or at least not enough that most people will notice.",
    "The only apparent differences are the feedback and the noise level. While both are comfortable and excellent to type on, the Pro has a bit more resistance and feels bouncier – not too much that it affects your overall typing experience, but enough to be noticeable. It’s also a lot quieter. Both of these could be good or bad, depending on your personal preference.",
    "We appreciate the Roccat Vulcan TKL Pro’s quiet operation, and it also gives it a classier sort-of feel over the Vulcan TKL. Though we have to say that its overall design pretty much has that covered all on its own. There’s no arguing that this is among the most appealing and elegant-looking gaming keyboards we’ve ever tested.",
    "Those smooth and thin floating keys really allow the keyboard’s customizable RGB lighting to take center stage so that it really lights up even in the daytime. Folks who feel like that brushed gunmetal finish has been overused might feel differently when they see it on the Vulcan TKL Pro, as Roccat has done such a marvelous job. The size of the keyboard helps as well. At 13.3 x 36.0 x 3.4 cm, it helps make your setup look cleaner and more minimal.",
    "Despite its size, there’s also a lot of heft here. Roccat says that it’s reinforced by a layer of aircraft-grade aluminum to make it stronger and more durable. Adding to the are the optical switches themselves, which are typically longer-lasting than mechanical switches.",
    "Roccat’s Titan optical switches are rated at 100 million keystrokes. That means that if you’re averaging at 8,000 keystrokes per hour and on your computer for 8 hours a day, this keyboard in theory should last you a little over four years – but that’s when you’re doing a whole lot of gaming and typing.",
    "Design extras include a media control section in the top right corner of the keyboard. There’s not much here – only a dial and a button that controls the volume and set it to mute respectively. However, they are plenty useful as having quick access to volume like that makes things convenient.",
    "Being a compact gaming keyboard, the Roccat Vulcan TKL Pro comes with a host of shortcuts. You’ll find yourself using that FN button a lot, for better or worse, whether it’s for media controls, toggling settings, or adjusting RGB lighting. Some gamers might find this a bit disruptive, but it does allow the Vulcan TKL Pro to still have full-sized keyboard capabilities. And it’s something that you’ll get used to in no time, especially if you do a lot of remapping and program a lot of macros for gaming.",
    "Speaking of which, you can do so on this keyboard via the Roccat Swarm software. It’s a decently extensive one, touting three tabs that group customizations to General Features (for the keyboard’s general settings), Key Assignment (for remapping and macros), and Key Illumination (for RGB lighting).",
    "On it, there’s a lot you can do to truly personalize the keyboard and make it your own, from setting keypress sound feedback to per-key and pre-set zone RGB lighting customizations. Though these aren’t as involved as the Key Assignment section where you can set remaps and program macros to your heart’s content – or at least a whole bunch of macros to fill five onboard profiles. If you’re feeling a little lazy, you can also put off creating macros to a later time, and use Roccat’s catalog of 27 pre-set game macros.",
    "The Swarm is not the most extensive customization software out there, but there’s definitely a lot you can do here to maximize the Roccat Vulcan TKL Pro. Our only complaint is that it is a little finicky. We have found ourselves needing to use the Recover Tool as it refused to save any of the macros we set onto the keyboard at one point.",
    "The Roccat Vulcan TKL Pro’s performance is impeccable. It’s easy for new users to mistake that feeling of extra resistance as a sign that those keys require harder and deeper pressing. But, with a 1.4mm actuation, there’s certainly no need for such finger workouts. The keyboard is responsive and speedy enough to register any light intentional presses.",
    "For a gaming keyboard this pricey, some might expect a bit more than just the standard 1,000Hz polling rate. After all, there are some compact keyboards out there with higher polling rates – namely, Corsair’s K65 RGB Mini, which delivers a speedier 4,000Hz. However, most gamers won’t notice a difference in performance.",
    "Testing the Roccat Vulkan TKL on games like Sayonara Wild Hearts and Rocket League where you’re expected to react quickly and accurately, it has proven itself a dream to use. Gamers with light fingers will appreciate the fact that they don’t have to press all the way down for the keys to register.",
    "Come to think of it, all gamers will. It reduces the force your fingers need to exert, minimizing fatigue, and it helps ensure that every key is registered in the most intense moments. Button mashers need not worry either, as it’s also built to last.",
    "The Roccat Vulcan TKL Pro’s performance is beautifully consistent as well. No matter whether we’re playing something more laidback like Firewatch or something more intense like Doom: Eternal and Cyberpunk 2077, response times are fast and accurate with no missed presses or glaring latency.",
    "And, while this is a gaming keyboard, typing up documents and emails on it is also a great experience, thanks to that extra bit of bounce and quiet operation."
  ],
  "headers": {
    "0": "Two-minute review",
    "22": "Don’t buy it if…"
  },
  "links": {
    "Vulcan line": "https://www.techradar.com/reviews/roccat-vulcan-120-aimo",
    "gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "Razer Huntsman Tournament Edition": "https://www.techradar.com/reviews/razer-huntsman-tournament-edition",
    "Corsair K63 Wireless": "https://www.techradar.com/reviews/corsair-k63-wireless",
    "best gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703"
  }
}