{
  "source": "https://www.techradar.com/reviews/udemy",
  "title": "Udemy learning platform review",
  "category": "computing",
  "updated": "2021-09-15T03:26:27Z",
  "author": "jonas-p-demuro",
  "summary": "Sharing knowledge with the world",
  "verdict": "Udemy is a business oriented video streaming education platform, with thousands of videos for professional development. While the content is expansive, the purchasing process can be frustrating, and many courses need to be purchased individually.",
  "pros": [
    "Large course catalog",
    "Well organized content",
    "Smartphone apps",
    "Generally favorable reviews"
  ],
  "cons": [
    "Limited support options",
    "Pricing less than transparent",
    "Short trial",
    "Frustrating plans"
  ],
  "article": [
    "Unlike some of the smaller online learning companies, Udemy is a major player in this space. It claims that as of May 2021, a staggering 155k courses are taught by 56k instructors in over 65 languages. Enjoying this over 115 million minutes of video, are 40 millions learners enrolled in 480 million courses.",
    "Pushing this company to the top no doubt are the over 7,000 enterprise customers as well, with household names of Netflix, Apple, Volkswagen and Kaiser Permanente counted among the customers.",
    "Udemy has a large and expansive course catalog, which is clearly one of its strengths. Content is focused in the business realm, with courses on Web Development, Amazon Web Services, Management and JavaScript abounding. Those looking for more casual content may be disappointed, as we did not find courses such as a cooking class, art appreciation or other more entertaining type of lectures.",
    "Content is also neatly organized into logical categories that includes Development, Business and Finance & Accounting among the thirteen choices, and then each one branches into various subcategories. For example, in the Photography & Video category, there are subcategories for Digital Photography, Portrait Photography, and Video Design. In the Digital Photography subsection, we found varied content, such as “Beginner Nikon Digital SLR (DSLR) Photography,” “Digital Photography for Beginners with DSLR cameras,” and the “Photography Composition & Portrait Photography Masterclass.”",
    "Each class has a short video preview of the class, similar to a movie trailer. We found this useful to assess the class’ content, and to decide if it suited our needs prior to a purchase. Also stated is the last time the course was updated, and while many are recently done in the last year or two, we easily found that not all are, such as one from almost a decade back from 2013 so caveat emptor.",
    "Courses get a numerical ranking by the students, along with comments. Also, the courses have additional content beyond the video streaming, such as articles and downloadable resources. There is also a certificate of completion available to add credibility to taking the course.",
    "The length of courses we looked at varied. Some are as short as an hour like at a traditional college, while others are a more comprehensive treatment of the subject at over eleven hours. Udemy indicates that new content is added monthly, keeping things fresh.",
    "For those frustrated professors out there, Udemy also offers the opportunity to share knowledge, and become a lecturer. The stated benefits include to be able to lecture in the method that you prefer, to be able to share your acquired knowledge, an additional opportunity for professional networking, and to earn money on each enrollment. It is not indicated how the pricing is set, nor what the split of the enrollment fees are.",
    "The pricing for Udemy is confusing, and less than upfront. We searched the Udemy website to get a price, and without an account came up empty handed (we did proceed to create an account).",
    "Basically, the pricing fits into three categories. Some courses are purchased on an individual basis. This can be an attractive option if you only need a single course, and lifetime access is granted to the course content as long as Udemy still has access to the course. The courses we looked at are between $10 to $20. There is a 30-day money back guarantee.",
    "Then there are two plans. The first is the Udemy Personal Plan, which offers access content in over 1,700 content areas, across 5,000 courses. The problem is that even with an account, the pricing on this is hard to find, and we could not find it to purchase.",
    "Then there is the Udemy Pro Plan, which offers a free trial of 7 days. After that, the cost is $19.99 monthly. This is designed for IT certification, as it offers 23 IT courses, and 98 practice exams. The topics are taught by expert instructors with real world experience, and the topics cover Microsoft Azure with a six course sequence, and Amazon Web Services with a 20+ hour course on “AWS Certified DevOps Engineer Professional.”",
    "Support for Udemy is limited with only a few options to get some help. The most common method is an extensive FAQ, with many links to additional information. While this works for some, unfortunately when the answer is not in the predone content, it can be a challenge to directly interact. Topics include “How to solve payment issues,” “How to change or reset your password,” and “Disable push notifications on iOS” among the extensive list.",
    "The only method we could find for a more direct interaction is the chat box. A shortcoming is that we could not find a direct phone number, a contact portal, a direct email, a fax, nor a postal address.",
    "Udemy has a favorable rating for its smartphone apps. This includes the Udemy Online Video Course app on the Apple store which gets 4.8/5 stars. While that score is quite high, some user comments indicate issues with the offline video and downloads, along with some bugs, and a lack of an option to turn the auto play feature for videos off.",
    "At the Google Play Store, the Udemy app has a slightly lower rating of 4.4/5. Some users report issues with video playback, including getting videos to play and with casting a video to a TV.",
    "Udemy is a larger player in the online video education market. We like the available smartphone apps, the expansive catalog, the support materials for the course to complement the video, and the transparent student reviews. Alternatively, we would prefer to see less business only content, less buggy apps, and a better subscription as for example the only plan we could find to purchase would not include the majority of the catalog. All in all, for those looking for business development content, the Udemy catalog is well worth going over."
  ],
  "headers": {
    "2": "Features",
    "8": "Plans",
    "12": "Support",
    "14": "User reviews",
    "16": "Final verdict"
  },
  "links": {
    "online learning": "https://www.techradar.com/best/best-online-learning-platforms",
    "Udemy": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=39197&u1=trd-us-1414143087119148500&murl=https%3A%2F%2Fwww.udemy.com%2F",
    "Udemy Personal Plan": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=39197&u1=trd-us-1454206298182801200&murl=https%3A%2F%2Fsupport.udemy.com%2Fhc%2Fen-us%2Fsections%2F1500000478402-Subscriptions",
    "Udemy Pro Plan": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=39197&u1=trd-us-7544831215823538000&murl=https%3A%2F%2Fsupport.udemy.com%2Fhc%2Fen-us%2Fsections%2F1500000478402-Subscriptions"
  }
}