{
  "source": "https://www.techradar.com/reviews/razer-viper-8k-review",
  "title": "Razer Viper 8K review",
  "category": "computing",
  "updated": "2021-01-28T16:00:00Z",
  "author": "john-loeffler",
  "summary": "What a difference 8K makes",
  "verdict": "The Razer Viper 8K gaming mouse is one of the fastest, most responsive gaming mice we've ever seen thanks to a lightning fast 8,000Hz polling rate. It also sticks with the simple, comfortable, and ambidextrous form factor of its predecessor and offers some decent customization options. You'll need a speedy monitor to get the full benefit from the Viper 8K though, so a cheaper mouse might be more appropriate for some potential buyers.",
  "pros": [
    "8,000Hz polling rate",
    "Ambidextrous design",
    "Comfortable ergonomics",
    "20,000DPI optical sensor"
  ],
  "cons": [
    "No wireless options",
    "Somewhat expensive",
    "Needs a fast monitor"
  ],
  "article": [
    "The new Razer Viper 8K asks a simple question: how much of a difference does an extra 7,000Hz make? When it comes to the polling rate of a mouse, quite a lot actually - especially if you're a serious esports player.",
    "The polling rate of a peripheral is the number of times it reports its state to the computer every second, including its position, if buttons are pressed, if the mouse wheel clicked over, etc.",
    "The industry standard polling rate is once every millisecond, or 1,000Hz. The Razer Viper 8K, meanwhile, has a polling rate of 8,000Hz, so 8,000 reports a second, or once every 0.125 milliseconds.",
    "This gives the Razer Viper 8K an incredible level of responsiveness, such as smoother precision aiming, with button presses registering significantly faster. Add in optical switches and the Viper 8K virtually eliminates the latency between clicks and actions on the screen.",
    "On the outside, the Viper 8K has the same overall design as the last Razer Viper gaming mouse (though a bit slimmer and a bit heavier), but it's definitely more of an if-it-ain't-broke-don't-fix-it kind of situation. It has some programmable buttons and an RGB Razer logo, but beyond that, the Viper 8K really emphasizes the important bits and trims the excess.",
    "The simple, ambidextrous form factor, along with its ridiculously light weight and superb ergonomics, make the Viper 8K a pleasure to use. It is a wired mouse, so you'll have to look elsewhere if that's a deal breaker, but fortunately we can help you find the best wireless mouse if that's the way you want to go.",
    "We also need to point out that even the best gaming mouse is only one part of the competitive gamer's arsenal. It can't suddenly make you a crack shot in Overwatch or Counter Strike: Global Offensive on its own. For that, you'll need a lot of practice and the best gaming monitor available with a refresh rate that can keep up with the Viper 8K.",
    "If you've got a quick monitor, though, the Viper 8K is about as good a competitive gaming mouse as you're going to find. It definitely knows what it's here to do and it does it well, without any unnecessary distractions. If esports is your jam, you do a lot of fine creative or graphic design work, or you just want a seriously responsive, lightweight, and well-designed gaming mouse, the Razer Viper 8K is definitely the way to go.",
    "The Razer Viper 8K is available now at Razer's website for $79 / £79 / AU$134 and will be available at other online retailers in the coming weeks. This is the same price as the previous Viper model, so you're definitely getting a lot more for your money with the Viper 8K.",
    "The new Razer Viper 8K keeps the same basic design as the previous Razer Viper, but is slightly thinner and a touch heavier. Weighing just 71g - 4g more than the previous Viper - the Viper 8K is lightweight and quick to move.",
    "At just 4.99 x 2.27 x 1.49 inches (L x W x H) - or 126.73 x 57.6 x 37.81 millimeters - the Razer Viper 8K is not quite compact, but is a good deal smaller than a lot of other premium mice out there.",
    "The two primary mouse buttons feel so comfortable that it's like they were carved out of the Viper 8K's body from years of use rather than molded from plastic. The injection-molded rubber sides are subtle enough to not be distracting, but provide just the right amount of grip for excellent control. The palm rest follows a very natural curve and sports a RGB LED Razer logo whose color and pattern you can control through Razer's Synapse software.",
    "On the underside, high-quality 100% PTFE mouse feet keep it gliding smoothly with little effort, and a button near the bottom allows quick access to different user profiles for the mouse, up to five in all.",
    "The six-foot-long, braided USB Type-A cable is pretty flexible for a USB cable, so you don't need to worry about the cable bending strangely and getting in the way of the mouse movement.",
    "The two additional buttons on each side of the mouse are programmable, giving you plenty of options for macros and shortcut mapping. The mousewheel doesn't offer any tilt button support, but is itself clickable as a middle mouse button. Most of the buttons can be reassigned through the Synapse software, which also lets you specify the handedness of the mouse, swapping the primary mouse buttons accordingly.",
    "While other PC gamers are tweaking their rigs to get the highest fps in 1440p and even 4K gaming, esports is much less about how good something looks than it is about how fast you see it - and how quickly you can react to what you see.",
    "That's where refresh rates and response times come in. For most people, 1,000Hz polling rate is pretty dang fast and, for most human endeavors, that's faster than anyone would really need.",
    "In esports though, especially ranked FPS matches, sometimes the only shot at a win you're going to get is a flash of different-colored pixels seen through a crack in the door, and how fast your trigger finger translates into taking that shot in game is the difference between victory and defeat.",
    "With that in mind, we put the Razer Viper 8K through a number of competitive FPS multiplayer matches to see how we fared. We're not going to lie, we are not the best competitive gamers out there. We didn't do well, generally speaking.",
    "Still, we did see a noticeable improvement in our game. In Destiny 2's Crucible playlist, we saw a statistically significant uptick in our kill-to-death ratio over the course of a few hours after switching from a regular mouse to the Viper 8K. In the hands of actual competitive gamers, the Viper 8K can definitely make a big difference."
  ],
  "headers": {
    "0": "Two minute review",
    "8": "Price and availability",
    "9": "Design",
    "15": "Performance",
    "20": "Don't buy it if..."
  },
  "links": {
    "Razer Viper": "https://www.techradar.com/reviews/razer-viper",
    "best wireless mouse": "https://www.techradar.com/news/best-wireless-mouse",
    "best gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "best gaming monitor": "https://www.techradar.com/news/best-gaming-monitor",
    "Razer's website": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-1994280963429697300&sharedId=trd-us&u=http%3A%2F%2Fwww.razer.com%2Fgaming-mice%2Frazer-viper-8khz%2F"
  }
}