{
  "source": "https://www.techradar.com/reviews/eassos-diskgenius",
  "title": "Eassos DiskGenius review",
  "category": "computing",
  "updated": "2021-06-18T06:07:40Z",
  "author": "christian-cawley",
  "summary": "Is this all-in-one-tool the best way to recover your files?",
  "verdict": "While the user interface is lacking and leads to some confusion, the functionality on offer in Eassos DiskGenius is considerable. Pricing is sensible, matching competitors while offering a little more, but most importantly, the free version of DiskGenius is largely unrestricted, making it ideal for home users and small businesses.",
  "pros": [
    "Free version does more than many competitors",
    "Backup and restore tool, partition manager, and disk utility software also included"
  ],
  "cons": [
    "User interface is more functional than attractive",
    "\"Copy To\" command is a little confusing for individual file recovery"
  ],
  "article": [
    "How would you prefer to recover your data – with a dedicated tool or with a utility that is part of a larger suite? Or would you prefer software that just recovers what you need, regardless of the details?",
    "Many data recovery software publishers offer their software as individual tools. Eassos has released DiskGenius as a suite of disk utilities, which features the Eassos Recovery tool alongside a backup and restore tool and partition manager",
    "Formerly known as PartitionGuru, DiskGenius is published by Chinese company EASSOS Technology Co., Ltd, (established in 2010).",
    "DiskGenius is available in three flavours: Disk Genius free, DiskGenius Standard, and Disk Genius Pro.",
    "The free version is comparatively limited, offering features for managing disks and partitions and recovering lost files. It's suitable for home and commercial users but can't recover large amounts of data. It also has a restricted list of files that can be recovered and is unsuitable for non-Windows file systems and USB flash devices. However, these limitations won't affect most users – if you're using Windows, this is essentially a free data recovery tool without any of the restrictions you find with other similar software.",
    "DiskGenius Standard is $69.90 (£50) and comes with a free 30-day trial. This can recover more partitions and file systems, as well as recovering over 200 different types of file.",
    "Finally, DiskGenius Pro is $99.90 (£72) with a free 30-day trial and has no restrictions. This version can also handle virtual machines in VMDK, VHD, VHDX, and VDI formats, increasing your recovery options.",
    "DiskGenius Pro features a free partition manager and data recovery tools for Windows backup and lost data restore tasks.",
    "The free partition manager offers an all-in-one solution for data recovery, reliable and versatile partition management and Windows backup & restore. Deleted data can potentially be recovered from reformatted and lost partitions, and missing files found, whether using a standard hard disk drive, a removable drive, RAID, or even virtual disk. Optical disks and USB devices can also be recovered.",
    "Backup and clone features also aid data recovery and security, ensuring reliable, safe data.",
    "To assess DiskGenius's recovery tools, we connected a previously unmountable 16GB SanDisk Cruzer Blade USB thumb drive to a Dell 5505 laptop running Windows 10. This is one of the key methods to establish whether the software can meet its claims of recovery. As a rule, modern, expensive software should be able to detect the drive.",
    "Soon, the drive had been successfully scanned using the Recover Lost Files menu command. At this stage, all recoverable files are listed. Those found within a directory tree are displayed as such, while orphaned data is listed separately.",
    "Recovery is a case of right-clicking a file and choosing Copy To command. There is also a Preview option for you to gauge the completeness (or otherwise) of a file that you want to recover.",
    "Scanning of the 16GB drive completed in under 10 minutes, which is usual for such a device on a modern computer. The list of data displayed was good, although it wasn't easy to distinguish between complete and incomplete data.",
    "The recovery process is efficient, although the Copy To command is slightly jarring. It seems like a slight mistranslation – anyone with experience of file recovery software would be looking for a command such as \"recover file(s).\"",
    "This aside, the tool operates well. Disk partition and file deletion tools are also included in Eassos DiskGenius, extending its usefulness. There is also an OS migration feature, for cloning the system partition to a new location.",
    "Eassos claims 45 million global users, so it is no surprise that it offers some useful support options.",
    "The website is a gateway to 24-hour support, where you will find a good list of frequently asked questions, mostly aimed at potential customers. Meanwhile, detailed instructions are provided in the How To section, intended to guide the reader through successful use of Disk Genius. For recovery purposes, this covers every data loss issue you can imagine.",
    "As an extension to this feature, Eassos also offers detailed step-by-step guides for several problems. This is a knowledge base approach that works well, although you won't find yourself talking to anyone. If it is human intervention that you crave and if nothing else works, you can contact Eassos by email through your inbox or raise a support ticket on the website.",
    "With so many disk recovery tools on the market, you might mistake Eassos DiskGenius (formerly Partition Guru) as another tool geared primarily toward corporations and pro recovery experts. But that's only part of the story. Offering competitive pricing and a complete collection of recovery features, DiskGenius finds and recovers data on almost any data you can think of. If the data can be recovered, this tool can find it and copy it to a new, reliable location. With disk management, RAID support, and operating system cloning, there is little to find fault in.",
    "Slightly confusing user interface aside, the most striking thing about Eassos DiskGenius isn't the recovery speed or the feature set. This tool, to all intents and purposes, is free. While some advanced features for unusual media and Ext file tables require the premium tool, the main features are free and uncapped."
  ],
  "headers": {
    "3": "Free vs other options",
    "7": "Key recovery features",
    "10": "Finding files using DiskGenius",
    "13": "Recovery performance",
    "16": "Support",
    "19": "Final verdict"
  },
  "links": {
    "data recovery software": "https://www.techradar.com/best/best-data-recovery-software",
    "DiskGenius": "https://www.diskgenius.com/",
    "free version": "https://www.diskgenius.com/editions.php",
    "DiskGenius Standard": "https://www.diskgenius.com/editions.php",
    "DiskGenius Pro": "https://www.diskgenius.com/editions.php",
    "backup & restore": "https://www.techradar.com/best/best-backup-software"
  }
}