{
  "source": "https://www.techradar.com/reviews/ecoflow-delta-pro-portable-power-station",
  "title": "EcoFlow Delta Pro portable power station review",
  "category": "computing",
  "updated": "2021-09-09T16:48:29Z",
  "author": "jack-laurent",
  "summary": "A powerful energy storage solution that paves the way for a new wave of use cases",
  "verdict": "The EcoFlow Delta Pro is certain to make any home better thanks to a massive battery and huge inverter output power while innovating in terms of expandability. This is the generator you were waiting for.",
  "pros": [
    "Huge battery and inverter capacity",
    "WiFi and Bluetooth connectivity",
    "Expandable with battery and electrical panel"
  ],
  "cons": [
    "Very heavy",
    "Reduced charging efficiency with second battery"
  ],
  "article": [
    "We are currently experiencing the golden age of portable power stations thanks to the constant evolution of battery technologies. Governments around the world are trying to address the effects of climate change by promoting greener technologies as well. This combination has allowed power station companies such as EcoFlow to push innovation to the limit with a new class of portable power station.",
    "Think about powering a small bungalow with a battery-based generator. This is the idea that the new EcoFlow Delta Pro brings to the table. At the heart of their technology is the ability to combine several units to boost the output power. EcoFlow also brings their know-how of high-speed charging on a bigger scale while remaining true to their origin by providing a slew of AC and DC output ports. To add to this already impressive list of innovations, their latest generator can be controlled through Wi-Fi with a companion app.",
    "EcoFlow is running a Kickstarter funding campaign right now which is already turning out to be an immense success. The best perk is the EcoFlow Delta Pro which is available for a cool $2699 after a 25% discount and gets you a 3.6kW class generator. This is relatively pricier than the competition but factor in the expandability and features and it becomes a very sound investment.",
    "The device is currently on preorder on Kickstarter where more than 2800 backers have pledged more than $10 million. The campaign ends in less than three days with prices starting from $2699 plus shipping (from $60 for the US to a staggering $1,485 in South American countries). Bear in mind that other costs (e.g. value added taxes and levies) are not included.",
    "The Delta Pro is shipped to the user in a heavy-duty box. The unit is protected by high-density foams ensuring its delivery is in good condition. Once unpacked, the generator presents itself as a small luggage. Two wheels located at the back along with a retractable handle let the owner pull the unit around and at 45kg, it is one of the heaviest types available on the market. It also possesses two handles on the top which are shrouded in leather making carrying the heavy case more bearable. The black plastic enclosure measures 63.5cm x 28.5cm x 41.7cm and has four large fans located on each side to provide adequate airflow to the charging and inverter circuits.",
    "The unit features a large multi-segment LCD on the front that shows statistics such as recharging time, input and output power, activated sections, and various working states of the battery system. It is turned on by pressing the main power button for a few seconds. The display then lights up, the brightness of which is automatically adjusted thanks to an ambient light detector.",
    "Electrical outlets located on the front panel include four 20A and a single 30A AC sockets which are enabled by a small button. The AC inverter can provide a maximum of 3600W continuously but can also achieve twice this value using the Xboost technology, albeit under some restrictions. Six USB sockets in the form of four USB-A and two Type-C are also available on the front and give a hefty 260W combined. The right side of the generator reveals ports for Anderson and Infinity inputs, a 12V car outlet, and two 12V DC5521 sockets activated with a 12V DC power button.",
    "The right side also hosts a remote control port, standby, and IOT/Pairing buttons. The latter allows the setup of a Wi-Fi link to the EcoFlow application. The back of the unit consists of input power sockets for charging and the possibility to add two extra batteries. All sockets except the one on the front have plastic covers to protect against dust.",
    "The Delta Pro is based on the newer LFP battery technology and is guaranteed to provide at least 3500 charge cycles before the capacity is reduced by 20%. This technology also allows up to one year of shelf life while keeping a full charge. The battery monitoring system or BMS will continuously monitor the charging and discharging of the unit and guard against any malfunction while the X-Stream technology built-in this EcoFlow product enables charging the unit at 1800W through a single port. A maximum of 6500W can be achieved when multiple ports are used to charge the battery.",
    "Much importance has been given by EcoFlow to have a range of products that forms part of an ecosystem. As such, the Delta Pro capability can be expanded with the addition of 3600Wh battery units.",
    "Another part of the ecosystem is a Smart Home Panel that connects up to two EcoFlow generators to a home electrical distribution, providing uninterrupted power to a maximum of 10 home circuits. The switchover from main to secondary power is done in less than 20ms and will prevent the loss of data on many appliances.",
    "Using the Delta Pro is straightforward. First, it is advised to do a complete charge before any serious use of the generator. A full charge at the maximum rate of 1800W through a wall outlet will take about two hours to complete. This setting is the default when shipped and can be sufficient to trip a circuit breaker. To avoid this, the input power can be reduced by flipping a switch at the back of the unit, reducing the input power to 400W. This also gives the EcoFlow App control over the setting, allowing full customization of the input power.",
    "The EcoFlow App is a must to fully enjoy all features of the generator. It can be downloaded using a QR link given in the user manual. The Delta Pro is then added to the App by following on-screen instructions. The unit is initialized by pressing the IoT button until the Wi-Fi icon starts to blink. This creates a new 2.4GHz WiFi access point that is used by the App. Finally, the user completes the setup by selecting an internet-ready access point which is then programmed in the generator.",
    "Once the Delta Pro is installed, the first thing that the user should do is to check for any available firmware update. This process can take up to 10 minutes to complete and should not be interrupted. The intuitive application provides the same information shown on the unit display in addition to several features such as the activation of X-Boost or adjusting the input power rate. Connecting accessories such as an extra battery to the Delta Pro will also appear seamlessly in the EcoFlow mobile application.",
    "The Infinity port is another great addition to the unit, allowing the fastest charging mode on the Delta Pro. At a scorching rate of 3400W, going from 0 to 100% capacity is done in less than two hours. What’s more, the Infinity port is compatible with level-2 Electric Vehicle charging stations worldwide. All in all, the Delta Pro supports more ways of charging than any other home battery systems.",
    "There are very few generators on the market capable of matching the Delta Pro for inverter and battery capacity let alone its numerous features. Let's take a look at each one of them and see who is the closest match.",
    "The high-current charging mode of the Delta Pro is rivaled only by recently released products and all have the power adapter built-in. Here the Zendure SuperBase Pro 2000 is very similar to the Delta Pro offering 1800W of charging power. But unlike the Delta Pro, the battery and inverter specifications are 2000W instead of 3000W.",
    "Being always connected to the internet is becoming a must for newer generators. Again here the SuperBase offers similar connectivity but it lacks the Bluetooth option. The Delta Pro also gains points by having more charging options when compared to the competition. In fact, no other portable home battery supports charging from EV stations.",
    "Pricewise, EcoFlow’s products are not the cheapest but the Delta Pro still pulls close to other competing products by having a relatively low Watt per dollar ratio of 1.3W/$ compared to 1.2W/$ for the Bluetti AC200.",
    "EcoFlow’s Delta Pro redefines what a modern portable power generator should be. It is a product that screams high-quality while its developers have spare no expense when it comes to features or battery technology. EcoFlow is selling the concept of an autonomous home that can confidently disconnect from the power grid at any time and under any circumstance. It remains to be seen if the general public will embrace such an idea but we are betting heavily that in the near future, many homes will be equipped with something similar to a Delta Pro."
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "11": "In use",
    "15": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Kickstarter": "https://www.kickstarter.com/projects/ecoflow/ecoflow-delta-pro",
    "Zendure SuperBase Pro 2000": "https://www.indiegogo.com/projects/superbase-pro-fastest-recharge-iot-power-station#/",
    "Bluetti AC200": "https://www.techradar.com/reviews/bluetti-ac200p-ac-power-generator"
  }
}