{
  "source": "https://www.techradar.com/reviews/oneplus-9-pro-review",
  "title": "OnePlus 9 Pro review",
  "category": "phones",
  "updated": "2021-06-30T09:50:02Z",
  "author": "james-peckham",
  "summary": "One small step, or one giant leap?",
  "verdict": "The OnePlus 9 Pro offers phenomenal performance, a vastly superior camera to the brand’s previous smartphones, and a variety of top-end features that make this a serious contender for anyone who’s in the market for a premium Android handset. It won’t be for everyone though as the price is high for this smartphone.",
  "pros": [
    "The best OnePlus camera phone",
    "Great power",
    "Premium design"
  ],
  "cons": [
    "High price",
    "No microSD support",
    "Middling battery life"
  ],
  "article": [
    "The OnePlus 9 Pro is a culmination of the company’s efforts over the past couple of years, and it’s the first time a smartphone from the company has felt like the complete package.",
    "It offers top-end power, a great camera experience and all the bells and whistles you’d expect from a flagship smartphone right now. This is a handset that can genuinely compete with the very best phones from the biggest brands.",
    "However, it also comes with a high-end price tag, and there’s no denying that the OnePlus 9 Pro is an expensive choice for your next phone.",
    "There’s very little missing here, with the lack of microSD support being one of the few features this smartphone doesn’t offer when compared to other handsets.",
    "The OnePlus 9 Pro has a premium design, with a handsome 6.7-inch QHD display that delivers strong brightness levels and top-notch detail, while a super-smooth 120Hz refresh rate adds to the top-tier feel.",
    "The handset itself may be too big for some, but the design feels worth the money, with a glass rear and the choice of three colors to ensure that your new OnePlus matches your style – we think the Morning Mist shade pictured throughout this review is particularly good-looking.",
    "The OnePlus 9 Pro’s biggest upgrade is in the camera department. The company is putting a strong emphasis on photography here, which includes partnering with legendary camera brand Hasselblad to improve how colors are processed.",
    "We were impressed by the cameras throughout our time with the OnePlus 9 Pro – the versatile setup delivers great results in auto mode, and can produce some stunning images to rival those from the very best camera phones.",
    "Photography-wise it may not be the absolute best choice for everyone, but OnePlus has made notable improvements and it’s now an option that can compete with the likes of the iPhone 12 or Samsung Galaxy S21.",
    "The OnePlus 9 Pro is powered by a Qualcomm Snapdragon 888 chipset, and the phone is well capable of doing everything you need it to. Battery life isn’t the absolute best we’ve seen on a smartphone, but it’ll mostly last you a full day, and there are a couple of fast-charging options.",
    "The OnePlus 9 Pro is the best smartphone the brand has ever made, and while it’s an expensive handset, it can comfortably compete with other high-end options, such as the Galaxy S21 Ultra or the iPhone 12 Pro Max, to justify that price.",
    "The OnePlus 9 Pro was revealed on March 23, 2021 in a virtual event from the company, and preorders went live immediately after the event finished. The phone is now available in the UK and the US.",
    "We don’t expect the OnePlus 9 Pro to be on sale in Australia as the company doesn't often sell its phones there. In the US, you'll only be able to buy the higher storage variant of the OnePlus 9 Pro while both variants are available in the UK.",
    "The OnePlus 9 Pro price isn’t as low as some might have hoped, and if you want the 8GB of RAM with 128GB of storage variant you’ll be spending £829 (about $969, AU$1,250).",
    "Want more storage and extra RAM? There’s also a 12GB / 256GB model of the OnePlus 9 Pro, which costs $1,069 / £929 (about AU$1,400). If those prices sound a bit steep, there’s also the OnePlus 9, which was unveiled alongside the 9 Pro and which starts at $729 / £629 (about AU$950).",
    "US carrier T-Mobile sells the phone, while it will be supported on Verizon (LTE and 5G, including mmWave) and AT&T (LTE only so far). If you're in the UK, you'll find the phone is on sale through Three.",
    "The OnePlus 9 Pro isn’t a big departure from the company’s last few handsets, and if you’ve owned a phone from the company since the OnePlus 7 you won’t be particularly surprised by the design here.",
    "It looks premium, and when you handle the device it feels premium. The OnePlus 9 Pro has a glass rear, and you’ve got the choice of three colors: Morning Mist (the silver shade pictured throughout this review), Forest Green and Stellar Black. You may be restricted to certain colors depending on where you are, so don’t set your heart on one particular color until you’ve seen what’s available.",
    "The phone has metal edges. On the right edge is the power button, and above this is a silence slider that enables you to quickly mute your phone when you want to. The volume rocker is on the left edge.",
    "The bottom edge of the phone is home to the USB-C charging slot, along with the SIM card drawer and a speaker grille.",
    "OnePlus has trimmed down the camera bump on the OnePlus 9 Pro compared to its previous handsets, but it still juts out from the rear of the phone. You’ll find the Hasselblad logo emblazoned on the camera alongside four shooters (you’ll learn more about the cameras, and about the Hasselblad connection, in the Cameras section of this review).",
    "The rear of the phone curves gently at the edges, and we found that helped the handset to sit nicely in our hands. Note, though, that this isn’t a small phone by any means: it measures 163.2 x 73.6 x 8.7mm, and weighs 197 grams which is about typical for a phone of this kind.",
    "Overall, the OnePlus 9 Pro has a premium look and feel that can rival any other top-end phone you’ll find on the market right now. Not much has changed here compared to previous OnePlus Pro phones, and that’s just fine with us.",
    "The OnePlus 9 Pro comes with a large and high-resolution display befitting its Pro status. It’s 6.7 inches from corner to corner, with a QHD resolution of 1440 x 3216 – that equals 525 pixels per inch. That resolution on this AMOLED display is noticeable from the moment you first turn on the display with images jumping out of the screen and text appearing razor-sharp.",
    "Brightness is good, although the auto brightness mode can sometimes struggle to go bright enough in some scenarios. If you’re in direct sunlight, you’ll likely want to play around with the brightness features to ensure you can see the screen.",
    "As on 2020’s OnePlus 8 Pro, the display has a 120Hz refresh rate, which is starting to become the norm on top-end Android phones. This means the display refreshes 120 times a second, rather than 60 times on older smartphones and some current flagships, like the iPhone 12, which have a 60Hz refresh rate.",
    "Essentially means that you’ll enjoy a smoother on-screen image, whether you’re playing games – it’s particularly welcome when you’re playing fast-paced action games such as Call of Duty: Mobile – or scrolling your social media feeds.",
    "The refresh rate is adaptive so certain apps, such as an eBook, will offer a 1Hz refresh rate while others run at up to 120Hz, which saves battery. We found the adaptive setting worked well, adjusting the display seamlessly, and we didn’t notice when the screen was running at a lower refresh rate.",
    "There's also a fingerprint scanner in the screen, and we found this technology to work similarly fast to most other flagship phones that feature this tech in 2021.",
    "OnePlus smartphones have always struggled to keep up with other top-end Android phones in the camera department, but the OnePlus 9 Pro has the best camera we’ve seen on a handset from the company.",
    "OnePlus has stepped up its game here by including new sensors with at least one of them made in combination with Sony, and by teaming up with famed camera maker Hasselblad to improve color calibration, so that the colors you see are reproduced as accurately as possible.",
    "The main camera is a 48MP rear shooter, and it uses a Sony IMX789 sensor that was made in collaboration with Sony. There are three other cameras on the rear, including a 50MP ultra-wide camera that uses a Sony IMX766 sensor.",
    "There’s also an 8MP telephoto shooter that can shoot at up to 3x optical zoom, while the final element is a 2MP monochrome shooter that essentially allows you to get higher quality black and white imagery.",
    "The main sensor on the OnePlus 9 Pro is a cut above what OnePlus has made before, and we found that it could take fantastic images, with great-looking colors and masses of detail.",
    "If you compare images to those taken with previous OnePlus phones, you’ll find that colors look far more natural, which we presume is the result of the aforementioned collaboration with Hasselblad. The image quality here is more like what you get from Apple’s iPhones, rather than what you’d see from a Samsung phone, for example.",
    "We’ve also been impressed with how the OnePlus 9 Pro can produce great results even when you’re using its automatic mode, when you want to just point and shoot with the minimum of fuss.",
    "You can switch to the ultra-wide camera with a quick tap of a virtual button, and the results here are similarly good, with a new distortion-correction technology working behind the scenes to minimize the ‘barrel’ distortion that typically appears at the edges of ultra-wide shots.",
    "We found this to work well within our shooting, but it's not the type of feature that will impress you unless you're looking out for it.",
    "The telephoto zoom camera on the OnePlus 9 Pro is capable of shooting at up to 3x optical zoom, beyond which it’ll switch to a digital zoom for anything up to 30x zoom.",
    "Images taken using the optical zoom looked good, and are usable for sending to your friends on messaging apps or posting to social media accounts. As you’d likely expect, things get worse as you zoom in further, with images looking dramatically inferior to those from the outstanding telephoto camera on the Samsung Galaxy S21 Ultra.",
    "For video, you’re able to record in 8K at up to 30 frames per second, which is one of the highest resolution/frame rate combinations we’ve seen on a smartphone. This quality is largely unnecessary if this is a video you’ll be watching back on the phone, however, and note too that shooting at this top setting will eat up a lot of storage.",
    "Other video options include 4K at 30, 60 or even 120 frames per second for slow-motion footage, and there are also slow-mo options for 720p at 480fps or Full HD at 240fps. We found all of these to work well, and these settings are comparable to other Android phones you’d find on the market right now.",
    "The main camera has both optical and electronic image stabilization to ensure that footage is shake-free and overall you’ll likely be happy with the quality of video shot on the OnePlus 9 Pro",
    "On the front of the phone is a selfie shooter with a 16MP Sony IMX741 sensor and an aperture of f/2.4. This isn’t the highest-end selfie camera we’ve seen on a smartphone, but we were happy enough with the photos and video it captured.",
    "The OnePlus 9 Pro is powered by the latest Qualcomm Snapdragon 888 chipset, and as has been the case with other Android phones using this chip, we’ve been impressed with the top-end performance it enables, with the phone loading apps almost instantaneously.",
    "You get either 8GB or 12GB of RAM depending on which variant of the phone you opt for, and while an extra 4GB won’t make a huge difference to most users, it’s worth noting that the amount of RAM you choose dictates how much storage you get.",
    "The 8GB model of the OnePlus 9 Pro comes with 128GB of storage, while if you opt for the 12GB phone you get 256GB. Those in the US are currently only able to buy the 12GB of RAM option, while those in the UK have the choice of these two variants.",
    "As with other OnePlus devices there’s no microSD support here, so you’ll be restricted to the built-in storage of whichever variant you buy. If you think you’ll be using your phone for a good few years, we’d recommend opting for the larger-capacity option.",
    "We’ve reviewed the 12GB version of the OnePlus 9 Pro, and we found its benchmark scores to be particularly strong. We haven’t seen any reason to doubt that the 8GB variant is also a strong performer, although we’ve yet to test that phone.",
    "We found the 12GB of RAM variant had an average Geekbench 5 multi-core score of 3630. That's just behind the Asus ROG Phone 5, and beats results we've seen on other top-end phones like the Samsung Galaxy S21.",
    "The OnePlus 9 Pro is also a 5G-ready handset, so you’ll be equipped to take advantage of next-gen internet connectivity even if you don’t expect to be using it in the near future.",
    "The phone comes running Android 11 right out of the box, with OnePlus’s own OxygenOS look over the top, which brings with it a variety of features such as an always-on display and the brand’s own unique look and feel.",
    "We found the phone did suffer from some Bluetooth connectivity issues, but we're hoping these will be solved in a final software update from the company. We'll update this review when we hear more.",
    "There isn’t much bloatware on the OnePlus 9 Pro, and those who like OnePlus’s signature look will enjoy the way the software works on the handset.",
    "The OnePlus 9 Pro isn’t going to offer game-changing battery life, but it’ll reliably see you through a full day on a full charge with typical use. Only on one or two occasions during our testing time did we need to give OnePlus 9 Pro a top-up at around 10pm.",
    "The 4,500mAh battery is large, and the OnePlus 9 Pro can hold its own against most of our best smartphones right now in this department, but it won’t last you two days if you’re using the phone regularly.",
    "With particularly intensive use we found the phone wouldn’t make it through a full day, but helpfully there’s some impressive fast-charging tech here to enable you to top up your handset quickly when you need to.",
    "There’s 65-watt wired charging, and, perhaps more impressively, the OnePlus 9 Pro supports 50 watt wireless charging, which is some of the highest spec we’ve seen for this technology, and which is particularly impressive given that OnePlus didn’t embrace wireless charging until 2020’s OnePlus 8 series.",
    "Unlike competing phones from Apple, Samsung and a handful of other Android manufacturers, the OnePlus 9 Pro comes with a new charger in the box. Several manufacturers have removed chargers from the box, citing the need to cut down on e-waste, but OnePlus has seen fit to include one here.",
    "First reviewed: March 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "OnePlus 9 Pro release date and price",
    "16": "Design",
    "23": "Display",
    "29": "Camera",
    "44": "Specs and performance",
    "54": "Battery life",
    "59": "Don’t buy it if..."
  },
  "links": {
    "best phones": "https://www.techradar.com/news/best-phone",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "Asus ROG Phone 5": "https://www.techradar.com/reviews/asus-rog-phone-5"
  }
}