{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-book-pro-360",
  "title": "Samsung Galaxy Book Pro 360 review",
  "category": "computing",
  "updated": "2021-06-11T13:56:54Z",
  "author": "johan-winsborn",
  "summary": "A thin and stylish 2-in-1 from Samsung",
  "verdict": "The Galaxy Book Pro 360 is a compact, light and premium 2-in-1 which impresses on a number of fronts. It doesn't quite match some rivals in terms of performance, but Samsung does a lot right with this long-awaited laptop.",
  "pros": [
    "Good screen",
    "Really good sound",
    "Fantastic keyboard"
  ],
  "cons": [
    "Mediocre webcam"
  ],
  "article": [
    "Samsung's Galaxy Book Pro 360 is one of the first products that is a collaboration between Samsung and Intel which aims to create the same kind of relationship between laptops and mobile phones that you get with Apple's ecosystem.",
    "To get the most out of the notebook and phone here, you need a Galaxy smartphone. The Your Phone app also works with other Android phones and iPhones, but the latter was not a great experience. However, if you already have a Galaxy phone, Galaxy Buds Pro and a Galaxy Tab, then the Samsung Galaxy Book Pro 360 is a great call for your next laptop.",
    "Samsung's Galaxy Book Pro 360 is a compact, light and premium machine. The screen can be folded all the way around so it's flat to the back of the keyboard, turning the hardware into a tablet-like device. We still think that a dedicated tablet is better than this, but as an occasional tablet, the device works well enough, and is also much thinner than rival devices that attempt the 360-degree hinge trick.",
    "The Galaxy Book Pro 360 offers a Thunderbolt 4 port, a pair of USB-C connectors, a traditional headphone socket and a microSD slot. Also included is an S-Pen stylus. The pen is black and plastic, and does not feel particularly premium, but it works really well to write and draw with, even if the palm rejection support of Windows could be much better.",
    "What could also be improved is the mediocre webcam, which is a modest 720p effort. The AMOLED display with a Full HD resolution, on the other hand, offers excellent color reproduction and contrast. It's a really nice screen overall, although it doesn't cope so well in full sunlight. The keyboard is also phenomenally good, being large and responsive, plus the speakers sound very impressive, too.",
    "Battery life is sufficient for everyday use, and performance is similarly sufficient, even if not at the same level as the HP Spectre x360 (2021) (or indeed the M1-powered MacBook Air). The Pro 360 is certainly a relatively fast laptop which unlocks and fires up immediately. Even if the device is completely turned off, it only takes 8 seconds for the boot and login process, which is nothing short of excellent.",
    "In short, the Galaxy Book Pro 360 is a premium and high-quality 2-in-1 device. If you are sold on Samsung and the Galaxy series, it is a great purchase.",
    "Samsung's Galaxy Book Pro 360 is available in several different configurations and prices. The entry-level model comes with an Intel Core i5-1135G7 processor, 8GB RAM and a 512GB SSD, and starts at $1,599.99 (around £1,130, or AU$2,070).",
    "There's an option to beef up the CPU to an Intel Core i7-1165G7, and it's also possible to up the screen size to 15.6-inches rather than 13.3-inches.",
    "Perhaps the most obvious alternative to the Galaxy Book Pro 360 is the HP Spectre x360 (2021), which is a 2-in-1 with a 360-degree hinge plus touchscreen and similar performance on paper, with prices starting from $1,349 / £1,199 / AU$3,339.",
    "The Galaxy Book Pro 360 will also come in a model with built-in support for 5G (and a SIM card slot), but this version will not be released until later this year.",
    "The first thing that struck us when we unpacked our Galaxy Book Pro 360 review machine is how small and neat - and how fantastically good-looking - it is. The form factor and color ('Mystic Silver') is immediately reminiscent of the MacBook Air, but the Samsung Galaxy Book Pro 360 is a bit smaller and almost 300 grams lighter. This is a portable in the truest sense of the word.",
    "The Galaxy Book Pro 360 comes with a brushed metal chassis in silver if you choose the 13-inch model, and a navy blue color if you step up to the 15-inch model. As with the HP Spectre x360 (2021), the screen can be folded all the way around so it's flat to the keyboard, turning the notebook into a tablet-like device.",
    "In terms of connectivity, the Samsung Galaxy Book Pro 360 offers a Thunderbolt 4 port, a pair of USB-C ports, a traditional headphone socket and a microSD slot. Compared to the MacBook Air (M1, 2020), you get slightly better connectivity options, but not the full-size USB port that the HP Spectre x360 (2021) offers, which means that you may still need a dongle for one or two accessories at home.",
    "In addition to the travel adapter and USB-C cable, an S-Pen is also included in the box. The pen is black and plastic, sadly not having the same premium build or feel as the laptop itself. The S-Pen is magnetic and attaches to the notebook, but only on the top, which feels a bit odd. We would rather have seen another solution, or a storage slot the pen could be kept in. The placement of the Apple Pencil on the side of the iPad Pro is much more elegant.",
    "Upon opening the Samsung Galaxy Book Pro 360, you are greeted with a bright and colorful screen. The bezels, however, are large and noticeable, particularly the bottom bezel, and especially when using the device as a tablet in portrait mode, when the black frame on the page is downright ugly. But the overall impression of the laptop is still very modern and contemporary.",
    "The keyboard is comfortable and responsive, and the keys are large and backlit. It is a full-size keyboard with a fantastic feel, despite the very shallow keys. The power button doubles as a fingerprint reader and is also responsive, as is the large trackpad.",
    "Apart from the bezels mentioned above, the Samsung Galaxy Book Pro 360 looks very stylish indeed, and is also fantastically comfortable to use. If you fold the screen all the way around and use the device as a tablet, the large touchscreen works well. But despite the seriously slim nature of the Galaxy Book, the overall feeling in this scenario still doesn't compare to using a real tablet, and the Samsung device is a bit heavier and more bulky. That said, compared to other 360-degree hinge 2-in-1 devices, it is definitely in a class of its own for tablet usage.",
    "Despite that less than ideal bottom bezel, the Samsung Galaxy Book Pro 360 is without doubt one of the most stylish, lightest and premium feeling laptops on the market right now.",
    "Samsung's Galaxy Book Pro 360 (and its sibling Galaxy Book Pro, which lacks the 360-degree folding screen) are the first products that are a collaboration between Samsung and Intel, aiming to create a much tighter relationship between laptops and mobile phones. In other words, this is Samsung's attempt at the equivalent of the almost seamless connection that you get with Apple's ecosystem and the experience of using an iPhone and a MacBook.",
    "And the Galaxy Book Pro models are also very much aimed at those who want a laptop that in many ways gives users the same experience they get from their phone.",
    "The Samsung Galaxy Book Pro 360 has a lot in common with a smartphone in terms of unlocking and starting immediately, being always connected online, and having a smart battery that optimizes performance - not to mention being as portable as possible.",
    "And you really get this feeling with the Galaxy Book Pro 360. Even if the laptop is completely turned off, it only takes 8 seconds to start the computer and log in. That's nothing short of phenomenal.",
    "In addition to the fast start-up, the fingerprint reader makes logging in extremely quick. That said, if using the Galaxy Book in tablet mode, the fingerprint login is clunkier, and in this case it would have been nice to be able to unlock the portable with face recognition; but unfortunately that's not possible.",
    "Samsung has of course put extra effort into maximizing the experience if you have a Galaxy smartphone, and provides several ways to work with both devices together.",
    "Your Galaxy phone has the 'Link to Windows' feature and the Samsung Galaxy Book Pro 360 has the Your Phone app, which hooks up with your smartphone so you can send and receive text messages, make calls, browse the photo gallery and even use (up to five of) the phone's apps on the desktop.",
    "The Your Phone app also works with other Android phones and iPhones, but the latter isn't a great experience. The software needed for the iPhone is not yet available in our country, and the solution offered instead is solely focused on being able to send web pages you read in Edge on the phone to the laptop.",
    "In other words, if you want to get the most out of this phone-laptop synergy, you need to have a Samsung Galaxy phone, and it feels like this is the primary target audience for the Galaxy Book Pro 360. And if you have not just a Galaxy phone, but Galaxy Buds Pro and a Galaxy Tab, well, the Samsung Galaxy Book Pro 360 is a fantastic potential fit as your next laptop.",
    "That said, the features for the seamless experience between phone and computer are not yet quite on the same level as that of iOS and macOS. Going forward, we can see that Samsung, Intel and Microsoft will be working hard to create a fully unified experience reminiscent of the one that Apple users have now - but there's still a way to go.",
    "For everyday use, the Samsung Galaxy Book Pro 360 does well in the performance stakes. There was no noticeable slowdown when running several applications simultaneously, despite the relatively modest 8GB of system RAM. And for everyday computing like web surfing, emailing and using office software (including the increasingly common videoconferencing), the Galaxy Book delivers a really solid experience in an extremely portable form.",
    "The Full HD AMOLED screen offers excellent color reproduction and contrast. In direct sunlight, however, it falls short, with the screen producing a lot of reflections and suffering a noticeable blue hue. But most laptop screens have similar problems, and the display on the Samsung Galaxy Book Pro 360 is really good overall. It is a pleasure to watch a movie on it. And that's not just a reflection of how good the screen is, either: the speakers are also really, really good.",
    "We were actually amazed at how good the sound of this compact laptop is. It's not quite in the same class as a full-sized MacBook Pro, but for a smaller portable like this, the sound is phenomenally good.",
    "The S-Pen works really well to write and draw with (even if it feels a bit plasticky), but the support in Windows for palm rejection when using the stylus could be much better. It is possible to play with the settings to get better results, but not perfect ones, sadly.",
    "The keyboard is large for such a small laptop, and even though the key height is very low, the keyboard feels fantastically good to type on. The trackpad is also comfortable and responsive. Apart from the plastic S-Pen, the only thing that detracts from the premium feel here is the mediocre webcam at a modest 720p resolution.",
    "Overall, the Samsung Galaxy Book Pro 360 is a premium and high-quality 2-in-1 device, but so is the HP Spectre x360 (2021). However, if you are sold on the Samsung and Galaxy series, and can make the most of that ecosystem synergy with multiple Galaxy devices, then that elevates the Pro 360 to another level.",
    "Samsung's Galaxy Book Pro 360 does well in the battery life department, providing a fast charger that gives you 9 hours of juice with only 30 minutes of charging. Samsung claims that a fully charged battery lasts up to 21 hours on a single charge. After using the laptop for a whole morning we had 86% battery left when we had lunch.",
    "In the TechRadar battery test, where a 1080p video is looped with the display at 50% brightness, the Samsung Galaxy Book Pro 360 lasted 8 hours and 13 minutes.",
    "Compare that with the MacBook Air (M1) which lasted 11 hours and 15 minutes, and the HP Spectre x360 (2021) which managed 11 hours and 22 minutes. These rivals are better, then, in our benchmarking, but the question is does this really matter in terms of daily usage?",
    "The long and short of it is that we managed a whole day's work (and more) without having to charge the Galaxy Book Pro 360, and we can't really expect more from such a compact and svelte portable. The battery will, of course, run out faster if you engage in heavier and more demanding tasks."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "11": "Design",
    "19": "Performance",
    "35": "Battery life",
    "39": "Don't buy it if..."
  },
  "links": {
    "Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Galaxy Tab": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-review",
    "HP Spectre x360 (2021)": "https://www.techradar.com/reviews/hp-spectre-x360-2021",
    "M1-powered MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Galaxy smartphone": "https://www.techradar.com/news/best-samsung-phones"
  }
}