{
  "source": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
  "title": "Apple MacBook Pro 14-inch (2021) review",
  "category": "computing",
  "updated": "2021-12-02T15:04:01Z",
  "author": "matt-hanson",
  "summary": "A mightily impressive creative laptop from Apple",
  "verdict": "The MacBook Pro 14-inch (2021) is the best laptop for creative professionals you can buy right now. It offers amazing performance, even on battery, and comes with the best screen you’ll find on a laptop anywhere. For day-to-day use, this won’t be the laptop for you, but for video editors, programmers, music producers and photographers, you won’t get a better laptop.",
  "pros": [
    "Brilliant performance",
    "Best screen on a laptop",
    "Long battery life",
    "Plenty of ports"
  ],
  "cons": [
    "Screen may be a bit small for some",
    "Overkill for regular users"
  ],
  "article": [
    "The MacBook Pro 14-inch (2021), the smaller of the two new MacBook Pros that Apple recently unveiled, is officially out in the world, and its big debut hasn’t disappointed. Powered by a choice of the M1 Pro and M1 Max, Apple’s most impressive chips so far, this is hands-down the best laptop for creative professionals we’ve ever tested, combining the best form and power that Apple can muster in a portable shell.",
    "In the past, Apple has, against its users’ wishes, put design over functionality, which has led to previous MacBooks coming with a paltry amount of ports for the sake of staying thin and light. This time around, Apple has not only listened (finally) to its customers, but it’s embraced their feedback.",
    "So, now we have the MacBook Pro 14-inch (2021), a still relatively compact laptop with a great selection of ports – offering three Thunderbolt 4 ports, one HDMI port, an SDXC card slot, and a MagSafe 3 port for charging – and lots of power inside. By aiming the MacBook Pro 14-inch squarely at professionals looking for a true mobile workstation, and leaving the thin, light and svelte design to the more mainstream MacBook Air, Apple has made a device that is arguably more niche, but far more successful.",
    "If you’ve gotten tired of having to rely on dongles and hubs to plug in your peripherals, you’ll appreciate this upgrade.",
    "This isn’t going to be the laptop for most people. It offers a level of power that most people will never need, and with a starting price of $1,999 / £1,899 / AU$2,999, it will likely be too expensive for most as well.",
    "However, if you do need this kind of firepower, for editing 8K footage, arranging elaborate music scores, or compiling and testing complex code, then you simply won’t find a better laptop.",
    "Not only have the internals had an upgrade thanks to the new M1 Pro and M1 Max chips, but the screen has been overhauled as well. It’s now larger than the 13-inch model, and is now a Liquid Retina XDR display featuring mini-LED technology. The mini-LED technology is the same found in the new iPad Pro, and it’s just as impressive here, offering a huge 1,000,000:1 contrast ratio. If you’re working on photos and HDR videos, your content is never going to have looked so good. ProMotion technology is also included, which offers refresh rates of up to 120Hz, which can be adapted depending on the motion of the content on the screen. Not only does this make videos looks great, but even scrolling through websites benefit from this tech, as it now feels smooth and responsive. As with previous MacBook Pro screens, it also supports the P3 wide color gamut.",
    "Battery life has also been drastically lengthened, and can now hit 17 hours, which is remarkable for a workstation laptop of this calibre. Not only that, but the MacBook Pro 14-inch continues to churn through complex tasks even when on battery power, rather than throttling performance as with other laptops to preserve battery life.",
    "This is where Apple’s control over both the hardware, with its own M1 Pro or M1 Max silicon, and software, with macOS Monterey, really pays off, as it’s allowed the company to fine tune performance and power consumption to end up with a powerful laptop that can outlast – and outperform – the competition.",
    "A boosted 1080p webcam and studio-quality speakers round out the improvements Apple has added here. These are particularly important in this day and age when a lot of us are working remotely, and it all adds up to a truly impressive professional laptop. If you’re a creative professional looking for a new laptop to work on, then the MacBook Pro 14-inch (2021) is the best laptop you can buy right now.",
    "The new MacBook Pro 14-inch (2021) is an incredibly ambitious laptop both in terms of hardware and design, and it’s aimed at creative professionals who need powerful mobile hardware, and that means this is an expensive laptop. A very expensive laptop.",
    "The MacBook Pro 14-inch (2021) with an 8-Core CPU, 14-Core GPU M1 Pro with 16GB unified memory and 512GB SSD storage starts at $1,999 / £1,899 / AU$2,999, ($1,899 for education), and the more powerful 10-Core CPU, 16-Core GPU M1 Pro with 16GB Unified Memory and 1TB SSD storage will set you back a hefty $2,499 / £2,399 / AU$3,749.",
    "You can configure the MacBook Pro 14-inch with more RAM and storage space, with either 16GB, 32GB and 64GB unified memory, and up to 8TB SSD storage, which of course also adds to the price.",
    "You can also upgrade from the M1 Pro chip to the much more powerful M1 Max chip. This brings faster memory (and up to 64GB of the stuff), and double the graphics performance. Adding the M1 Max with 10-core CPU and 24-core GPU will add a hefty $500 / £500 / AU$750 onto the asking price, while the highest-end M1 Max with a 10-core CPU and 32-core GPU will add an extra $700 / £700 / AU$1,050.",
    "The maximum configuration of the 10-core CPU and 32-core GPU M1 Max processor, 64GB of RAM and 8TB of SSD storage costs a whopping $5,899 / £5,799 / AU$8,849.",
    "This is a huge amount of money for anyone, so you’ll want to really consider if you need the kind of power that the new MacBook Pro 14-inch offers. If you don’t, but still want a modern MacBook for doing video editing and other creative work on, then there’s always the MacBook Pro 13-inch (M1, 2020). It comes with the less powerful M1 chip, but in our tests was still an impressive performer, even when editing videos in 8K, and with a price tag starting at $1,299 / £1,299 / AU$1,999 for the 256GB SSD/8GB RAM model, with an M1 chip with an 8-core CPU and 8-core GPU.",
    "For many people, that will be a more realistic model to go for, offering the power you need but without such a high price tag. For people who need more, however, the MacBook Pro 14-inch offers that step up.",
    "Many of us have been asking for a MacBook Pro redesign for years, and with the MacBook Pro 14-inch (2021) we finally get it. This is the biggest overhaul the lineup has had in years, and it feels like Apple is once again passionate and excited about the MacBook Pro – and that excitement is infectious.",
    "The most noticeable design change is the new 14.2-inch screen size, an almost one inch increase on the 13.3-inch display that comes with the MacBook Pro 13-inch. This extra screen real estate is well used, offering you a much larger area to work on than the 13-inch model, without increasing the overall size of the laptop too much. If the 16-inch MacBook Pro feels too big, and the 13-inch MacBook Pro to small, then the 14-inch could be the perfect compromise.",
    "As well as an increase in screen size, the resolution has also been upped from 2,560 x 1,600 on the 13-inch to 3,024 x 1,964, which boosts the pixel density from 227 pixels per inch (PPI) to 254 PPI. Not only is this a larger screen, but it’s sharper as well.",
    "The bezels around the screen have also been slimmed down. The thick surrounds of previous MacBooks was one of our biggest bugbears. They made the laptops look bulky and outdated, while rivals like Dell were bringing out laptops with ever thinner bezels around the screen.",
    "So, the thinner bezels on the 14-inch MacBook Pro are extremely welcome. Not only does it make the laptop look more modern, and lets your full attention fall on that gorgeous screen, but it means that Apple has managed to fit in a larger screen without making the actual body of the MacBook Pro any larger.",
    "The dimensions are 12.31 x 8.71 0.61 inches (31.26 x 22.12 x 1.55 cm), which isn’t much bigger than the 11.97 x 8.36 x 0.61 inches (30.41 x 21.24 x 1.56cm) dimensions of the 13-inch MacBook Pro. Considering the bump in screen size, this is pretty remarkable.",
    "The slimmed down bezels come at a cost, however, as Apple has introduced one of its most controversial design decisions in recent memory – a ‘notch’ that surrounds the webcam.",
    "Unlike the notch of the iPhone camera, which caused its own share of controversy when it was introduced, the notch in the MacBook Pro 14-inch (and the new 16-inch MacBook Pro, which also has it) is flat.",
    "It’s certainly noticeable, as the notch extends down into the menu bar that runs along the top of the screen. However, macOS Monterey, which comes preinstalled on the MacBook Pro 14-inch (2021), is designed to deal with it. The menu bar of apps adapts to the notch, so if there are numerous menu entries that run along the menu bar, they are rearranged so they appear either side of the notch. The mouse cursor, meanwhile, moves beneath the notch.",
    "It’s not the most elegant of solutions, and Apple hasn’t been clear about why the notch is needed. While the webcam has been improved with a 1080p resolution and larger sensor, and many other laptops have 1080p cameras and thin bezels without needing a similar notch. Unlike with the iPhone, the new MacBook Pros don’t support Face ID, which allows you to log in by scanning your face.",
    "However, it’s not the deal breaker many people are making it out to be. It actually allows for more screen space, as the menu bar itself is now higher up (thanks to the reduced bezels). This allows the application to then take up even more screen space below it, resulting in more desktop real estate for working on.",
    "Also, when using apps in full screen mode, or watching videos, you won’t notice the notch, as that part of the screen gets blacked out.",
    "When you open up the MacBook Pro 14-inch, another major redesign reveals itself: there’s no longer a Touch Bar that runs along the top of keyboard. This thin display was included in various MacBook Pro models from 2016 onwards, replacing the physical function keys. Instead, it showed interactive buttons that were context sensitive and would change depending on the application you were using.",
    "The Touch Bar proved to be unpopular among some users who found it gimmicky, and third-party app makers didn’t really use it to its full potential.",
    "With the new MacBook Pros, the Touch Bar is gone, replaced by the return of physical keys. There’s still a Touch ID button, for logging in using just your fingerprint, and that continues to work well. If you didn’t like the Touch Bar, then you’ll be pleased to see the back of it, but its absence will disappoint anyone who actually liked the feature.",
    "The rest of the keyboard is the same Magic Keyboard found in recent MacBooks. This is not a bad thing at all, as it’s responsive and feels great to type on. It’s also reliable – which is crucial after Apple’s issues with the old Butterfly keyboards in older MacBooks, which were prone to breaking if crumbs or dust got anywhere near it.",
    "The other major design change is when it comes to ports, with the MacBook Pro 14-inch (2021) featuring three Thunderbolt 4 ports, one HDMI port, an SDXC card slot, and a MagSafe 3 port.",
    "With all those ports at your disposal, you can connect up to three Pro Display XDRs and a 4K TV with M1 Max, or two Pro Display XDRs if you opt for the M1 Pro.",
    "This increase in ports is extremely welcome, as we’ve been complaining in the past that MacBook Pros don’t come with enough of them. These are laptops aimed at professionals, so while only having a few USB-C ports on a consumer laptop like the MacBook Air is fine, when it comes to professional laptops, you need more ports, as you’re likely to be plugging in more equipment.",
    "It seems Apple has been listening to its customers, and has drastically upped the port selection. The memory card slot will be welcomed by photographers who want to quickly transfer their photos to the MacBook Pro to edit them, and the full-size HDMI port means you can plug this laptop into a TV or monitor without needing an adapter.",
    "It’s great to see Apple respond to its customers like this, and it addresses one of our biggest complaints we had with previous models.",
    "These new ports do mean the MacBook Pro 14-inch is chunkier than previous models, and it feels almost retro to see a full size HDMI port on a laptop, but this is a serious workstation laptop for professionals, and the hit to its looks is more than worth it. Of course, if you want a slim and light laptop that puts more emphasis on being stylish than functional, then there’s always the MacBook Air (M1, 2020), which remains our pick as the best laptop you can buy right now.",
    "You may have also noticed that there’s a MagSafe 3 port. This is a proprietary charging power that has a magnetic element. This allows you to quickly and easily connect the power supply, and if the cable gets accidentally tugged, the charging cable will come away from the MacBook Pro 14-inch easily without any damage. It’s a welcome addition, especially as you can also still charge the MacBook Pro via USB-C, so older MacBook Pro adapters (or chargers for other laptop brands that use USB-C) can still be used, though the battery won’t charge as quickly. It’s all about options, however, and the MacBook Pro 14-inch gives you plenty of them.",
    "Overall, the new design of the MacBook Pro 14-inch is a hit. Apple’s added features that we’ve been crying out for, including thinner bezels and more ports, while adding a stunning larger screen as well. It comes in two colors, Silver and Space Gray, which may disappoint anyone hoping for a colorful reimagining like the iMac, but they retain that classy and iconic MacBook look.",
    "While the new design of the MacBook Pro 14-inch (2021) is one of the most exciting things about this product, the tweaks Apple made to the hardware beneath the chassis are even more exciting. Apple blew us away with its M1 chip when it debuted in the 13-inch MacBook Pro last year. For a first attempt at its own laptop silicon, after previously using Intel components, it was an assured and successful showing, giving the MacBook Pro 13-inch (M1, 2020) and MacBook Air (M1, 2020) enough power to edit 8K videos, while also boasting excellent battery life.",
    "So, when Apple announced not one, but two new chips at the MacBook Pro 14-inch’s launch event, we sat up and took notice. The M1 Pro and M1 Max are both available in the MacBook Pro 14-inch, and offer performance that far exceeds the M1.",
    "Regardless of what processor you choose, both the M1 Pro and M1 Max are big leaps over the existing M1 chip, and the M1 chip was no slouch to begin with.",
    "The M1 Pro (which is in our review device) has a dual-chip architecture that supports up to 32GB of unified memory, with a bandwidth of 200GB/s, which is almost three times the bandwidth of the M1.",
    "The CPU has eight high-performance cores and two high-efficiency cores, and the M1 Pro will switch between these to optimize performance to whatever tasks you're running. For graphics, the M1 Pro comes with a 16-core GPU with 2,048 execution units, and a performance of 5.2 teraflops, which Apple promises is two times faster graphics performance compared to the M1.",
    "There is also a version of the M1 Pro with eight cores in total. This appears to be six performance and two efficiency cores, and a 14-core GPU, and is available in the cheaper model of the MacBook Pro 14-inch.",
    "If you have money burning a hole in your pocket, or some really demanding applications to run, then you can opt for the M1 Max instead. This flagship chip supports up to twice the amount of memory as the M1 Pro, and is also made up of 57 billion transistors, almost twice that of the M1.",
    "It's important to note that the M1 Max comes with the same 10-core processor as the M1 Pro, but you're certainly getting some other benefits. For graphical performance, the M1 Max comes with 32 cores, double that of the M1 Pro.",
    "The GPU also comes with 4,096 execution units, twice as many as the M1 Pro, as well as twice the maximum concurrent threads (98,304 vs 49,512).",
    "The model we had in for review comes with the 10-core M1 Pro, 32GB of memory and 512GB SSD, and in our time with it, we found it worked exceptionally well.",
    "For day to day use, macOS Monterey is incredibly fast and responsive, and when just browsing the internet, the MacBook Pro 14-inch’s ProMotion display, which has up to a 120Hz refresh rate, means scrolling up and down webpages (or documents) is incredibly smooth.",
    "Of course, you want a laptop of this calibre to do more than just web browsing, and when it comes to heavy duty professional-grade creative work, the MacBook Pro 14-inch really shines.",
    "The evident power behind the M1 Pro chip meant we were able to create and edit complex 3D scenes in Cinema 4D quickly and smoothy, with the unified memory allowing for some seriously intensive workloads to be handled extremely well. This literally offers workstation-level performance in a portable laptop. We also fired up Final Cut Pro to edit 8K video, and the process was impressively seamless. We could scrub through the timeline back and forth, and the ultra high definition footage didn’t even pause – and we were even able to add four 8K streams to a scene and play them simultaneously. Seriously impressive stuff.",
    "While working on these projects we weren’t just impressed with the raw performance the 14-inch MacBook Pro offered, but how good they looked as well.",
    "This is thanks to the new screen, which is a Liquid Retina XDR display featuring mini-LED technology, which can deliver up to 1,000 nits of sustained, full-screen brightness, 1,600 nits of peak brightness, and a 1,000,000:1 contrast ratio and P3 wide color gamut.",
    "This resulted in truly impressive image quality when working on videos and photos. The footage we were editing in 8K was also in HDR, and the screen of the MacBook Pro 14-inch showed it off in all its glory. The only way it would have looked better is if it had been in native 8K, but that’s asking a bit much.",
    "Still, it’s one of the most impressive displays we’ve seen in a laptop. At one point we were editing a 3D scene in Cinema 4D, and moved the lighting around, which momentarily dazzled us. It was an excellent example of how bright and vibrant this screen is. For the past few years, Apple’s MacBooks were no longer home to the best laptop screens you could find. Ultra high definition OLED offerings from the likes of Dell and Gigabyte blew past Apple’s MacBooks. No longer: Apple once again has the best screen you can get on a laptop with the MacBook Pro 14-inch (2021) and the MacBook Pro 16-inch (2021).",
    "MacBooks aren’t just popular with video editors and photographers, but musicians and music producers often use them, and the good news is that the 14-inch MacBook Pro does a great job here as well. We played around with a hugely complex project in Logic Pro, with an orchestral score that has over 1,500 separate tracks. This project was provided to us by Apple (we’re not talented enough to do anything remotely as complex), and it was a great example of what the MacBook Pro 14-inch, and its M1 Pro chip, can handle. Loading up the project was impressively quick, and we could skip around the track without any hitch, while editing and tweaking tracks on the fly.",
    "The MacBook Pro 14-inch kept up admirably, and it also sounded great thanks to the six-speaker setup.",
    "What was perhaps most impressive about all of this, was that even when the MacBook Pro 14-inch was running on battery, there was no perceptible dip in performance. This is pretty remarkable, as laptops usually throttle some of their most demanding components when using battery to help preserve battery life, which means a downtick in performance. This is usually considered an inevitable compromise, with many people just accepting that if you want to do heavy duty tasks with your laptop, you’ll need it to be plugged in, but that means you can use it for other things when on battery.",
    "Fair play to Apple, then, for basically scrapping this. Thanks to the work it's done with the M1 Pro and M1 Max chips, it’s allowed the MacBook Pro 14-inch to keep on working with complex tasks on battery – without an impact in performance, nor a drastic cut to battery life. Being able to render complex 3D scenes, or compile and test code, all on battery is an incredible feeling, and along with the excellent screen, speakers and plenty of ports, means this is a truly portable workstation that doesn’t need to be plugged into anything. It gives you an incredible degree of freedom when working with this laptop.",
    "We’re aware that we’ve used the word ‘incredible’ quite a bit in this review, but it sums up what Apple has done with the 14-inch MacBook Pro, and if you’re a creative professional looking for a powerful workstation you can use anywhere, this is the laptop for you, without a doubt.",
    "During our tests we also didn’t hear the fans kick in, which is certainly impressive. Apple has paid a lot of attention to the thermal design of the new MacBook Pro 14-inch, and that appears to have paid off, as we were performing tasks that would cause the fans to get very loud very quickly with other laptops.",
    "The screen is definitely a highlight, and even when you’re not creating, but kicking back and watching movies, you get an absolutely fantastic experience. As you’d imagine, Apple TV+ and its original content, which support Dolby Vision, looks (and sounds) especially impressive with the MacBook Pro 14-inch. We even played a few games on it as well.",
    "Apple has never made a gaming laptop, but the new MacBook Pro 14-inch and 16-inch are the closest it's got thanks to the powerful M1 Pro and M1 Max chips, alongside a high refresh rate screen. We played a spot of Metro Exodus on the MacBook Pro 14-inch and were impressed with how well it handled it at ultra settings. There were a few hitches where frame rates dropped for a few seconds, but Metro Exodus, like most other games, has not been built for Apple Silicon, so it is running via Apple's Rosetta 2 compatibility layer. With a bit of tweaking to the graphical settings, and improved M1 support in the future, these new MacBooks could be formidable gaming machines, especially the M1 Max editions. That's not something we'd ever thought we'd say about a MacBook.",
    "It's worth pointing out that if you want the absolute top performance from a MacBook, you'll need to get the MacBook Pro 16-inch (2021) M1 Max version, as that comes with an exclusive 'High Power Mode' which is designed to eke out even more performance. It's a bit of a shame that mode isn't available even with the M1 Max version of the MacBook Pro 14-inch.",
    "The webcam and microphone in a laptop is now incredibly important since many of us are making more video calls to friends, family, clients and co-workers due to working remotely, so it’s great to see Apple make improvements here as well. We finally have a 1080p webcam on a MacBook, which is a serious upgrade from the 720p hardware that Apple used to include. Not only that, this webcam uses a lens with a wider aperture that lets in more light which should help to prevent any background noise (that weird, static-like fuzz).",
    "Together with a larger image sensor that has more efficient pixels, the camera delivers two times better low‑light performance, so you won't need any fancy lighting to look your best. In our time with the MacBook Pro 14-inch, we were certainly impressed with the quality of the webcam in video calls. It would have been nice to have Face ID features so we could log in by looking at the webcam (like we can with modern iPhones, or by using Windows Hello-compatible webcams with Windows 10 and Windows 11 devices).",
    "When it comes to recording audio, Apple has included what it calls are ‘studio-quality’ microphones. These are an improvement on the microphones included in the MacBook Pro 16-inch (2019) model, which were already very impressive. It’s a three mic array with boosted signal-to-noise ratio, and the clarity is excellent.",
    "For video calls and meetings, it does the job brilliantly, and at a push it’ll also work well for recording vocals and instruments for podcasts and impromptu jam sessions if you don’t have an external microphone with you. It’s yet another thing, then, that you don’t have to plug in to this laptop.",
    "When Apple launched the MacBook Pro 13-inch (M1, 2020), it boasted that it had the longest battery life ever in a MacBook, and our tests confirmed that, so when Apple revealed that the 14-inch could beat the 13-inch by whopping seven hours, we couldn’t wait to try it out for ourselves.",
    "Apple claims that the MacBook Pro 14-inch can hit up to 17 hours when playing fullscreen videos, and 11 hours of wireless web browsing. In our own battery benchmark tests, where we played a looped 1080p video until the battery ran out, we found it lasted a very impressive 15 hours and 58 minutes, not too far off Apple’s 17 hour claims. The MacBook Pro 13-inch (M1, 2020) lasted 13 hours and 22 minutes in the same test.",
    "This jump in battery life is fantastic, especially when you consider how much more powerful the laptop is. Apple has obviously worked hard to improve the efficiency of its M1 Pro and M1 Max chips, and it means this is a powerful workstation laptop you can work on for a full work day and still have battery life left. As we mentioned earlier, the fact that the impact to performance is minimal when unplugged means for the first time you have a laptop that you can do some seriously intensive workloads on while running off the battery. Even the best Windows laptops can’t compete with that.",
    "The new power adapter that’s included with the MacBook Pro 14-inch (2021) can charge the battery to 50% in just 30 minutes. It meant that when we were using the new MacBooks, on the few times the battery did drop enough for us to charge it up, we didn’t have to wait long at all for it to reach 100%."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Price and availability",
    "17": "Design",
    "41": "Performance",
    "67": "Webcam and microphone",
    "71": "Battery life",
    "75": "Don't buy it if..."
  },
  "links": {
    "M1 Pro and M1 Max": "https://www.techradar.com/news/m1-pro-vs-m1-max",
    "best laptop for creative professionals": "https://www.techradar.com/news/best-laptops-for-graphic-design",
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "best laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "MacBook Pro 13-inch (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Touch Bar proved to be unpopular among some users": "https://www.techradar.com/news/the-touchbar-was-a-missed-opportunity-for-the-macbook",
    "macOS Monterey": "https://www.techradar.com/news/macos-12",
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "MacBook Pro 16-inch (2019)": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review"
  }
}