{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-note-10-review-and-specs",
  "title": "Samsung Galaxy Note 10 review",
  "category": "phones",
  "updated": "2021-02-05T12:06:45Z",
  "author": "james-peckham",
  "summary": "Samsung’s smaller, handier Note 10 flagship",
  "verdict": "The Galaxy Note 10 is Samsung’s easiest to use S Pen-toting phone yet, and while there may not be any game-changing features to make this a must-buy handset, it’s a solid addition to the Note range. If you’re looking for Samsung’s ultimate top-end device you’ll want to opt for the Note 10 Plus, but if you want to save a bit of money, or you’re after a smaller phone with a stylus, this is the Note to go for.",
  "pros": [
    "Easier to hold than previous Notes",
    "Beautiful design",
    "Great video recording"
  ],
  "cons": [
    "Only a Full HD display",
    "Mediocre battery life",
    "Lost the 3.5mm headphone jack"
  ],
  "article": [
    "The Samsung Galaxy Note 10 range of phablets from Samsung were the brand's most premium non-folding phones from 2019, and you heard us right - it’s a range of phablets rather than just one phone, as it’s joined by the bigger Samsung Galaxy Note 10 Plus.",
    "These aren't the newest Note phones from Samsung - the Note 20, and Note 20 Ultra, take that spot, and if you're looking for a new Samsung Galaxy Note phone we'd recommend you check those handsets out as well as this one. If the S Pen is what you want, the Samsung Galaxy S21 Ultra is also compatible with various types of styli.",
    "The Samsung Galaxy Note 10 and Note 10 Plus are the first handsets in the Note line to feature an all-screen display, although it looks slightly different to the Galaxy S10 or Galaxy S10 Plus.",
    "Its edge-to-edge display technology is still called Infinity-O, but here the cut-out for the front-facing camera is aligned in the center at the top of the phone’s screen, rather than pushed to the top right.",
    "This placement of the single circular lens creates a distinctly cyclops-like look – an eye gazing out at you like HAL in 2001: A Space Odyssey. This central punch-hole is also adorning the more recently unveiled Samsung Galaxy S20, Samsung Galaxy S20 Plus and Galaxy S20 Ultra too.",
    "Unsurprisingly, the Note 10 Plus has a noticeably larger display, and it comes with a few upgrades under the hood and in the camera department compared to the standard model.",
    "Below we’ll be talking you through our experience with the Galaxy Note 10, but be sure to consider the larger (and therefore more expensive) handset if you’re looking for the top spec offered by Samsung - though that crown will likely be taken by",
    "Samsung announced the Galaxy Note 10 in August 2019, and it was available soon after, alongside the Galaxy Note 10 Plus. That means you can now buy the phone in the US, UK and Australia as well as a variety of other countries around the world.",
    "If you're buying the phone outright, the Galaxy Note 10 price tag is set at $949 / £869 / AU$1,499. Unlike some other handsets you won’t end up spending more than that as it only comes in one storage size and therefore one price.",
    "That price has gone down slightly over the year since its release. Now the Samsung Galaxy Note 20 starts for £949 / $999 / AU$1,649, and the Note 20 Ultra starts at $1,299 / £1,179 / AU$1,849 so it's probably your most affordable choice if you want a recent Note phone.",
    "First and foremost, the introduction of a Plus handset in the Galaxy Note 10 range has ensured the normal handset doesn’t feel as gargantuan as it has done in previous iterations.",
    "The Note 10 fits much more comfortably in the hand than the Galaxy Note 9 or Galaxy Note 10 Plus, but it’s still a difficult phone to hold for those with smaller hands.",
    "The Note 10 isn’t just smaller than the Note 9, it’s also lighter and thinner. It measures 72 x 151 x 7.9mm, and at 168g it’s one of the lighter flagship Samsung phones.",
    "Again, this is still a big phone and those with smaller hands will likely struggle to use it one-handed – don’t expect it to be as easy to use as handsets like the iPhone SE or Sony’s Compact line of Xperia phones.",
    "The biggest design change compared to other Samsung phones is the introduction of a full-screen display with a punch-hole cut-out for the front-facing camera at the top-center of the screen – the Galaxy S10 and S10 Plus both have the selfie camera tech at the top right.",
    "The Note 10 has a 6.3-inch AMOLED display with a Full HD resolution, coming in at 2280 x 1080 pixels, with 401 pixels per inch. It includes HDR10+ technology, and considering that Samsung hasn’t opted for a QHD display here we’re impressed with how the display looks.",
    "We hardly noticed the lack of a QHD display in general use, but if you’re used to a phone with a higher resolution than Full HD you may be able to spot the slightly lower resolution on this handset.",
    "We found the display to be bright and easy to read, but often we found ourselves using the display on a high brightness rather than using automatic brightness.",
    "Some may not be fans of the central placement of the camera sensor, but it’s arguably a lot less intrusive than the notches you get on other popular phones, like the iPhone XS or iPhone 11. And given that the Samsung Galaxy S20 line has a similar central punch-hole, the Note 10 won't look dated for awhile.",
    "As on the S10 and S10 Plus, Samsung has embedded the fingerprint scanner under the screen here, and it’s slightly higher than under-display scanners on some other Android phones.",
    "This feels like a more comfortable place to put it, as your thumb naturally falls on this area when you’re using the Note 10. We found ourselves immediately unlocking the phone without a second thought, and it proved to be fast and accurate.",
    "On the bottom edge of the Galaxy Note 10 you’ll find the USB-C connector in the center, with a speaker and the S-Pen slot sitting to the right of it. The top edge of the phone is uninterrupted apart from the SIM tray.",
    "The left-hand edge of the phone is home to the volume rocker, and the power button is below this. Samsung has opted to kill the Bixby button that has appeared on a lot of recent Samsung flagships – to activate that feature you now just hold down the power button for a few seconds, which is a far more efficient solution.",
    "The frame of the phone is a premium metal, while the back is made of glass. Your color options are Aura Glow (a combination of blue and white), Aura Black and Aura Pink, but it’s currently unclear which markets will get which colors.",
    "We particularly liked the Aura Glow variant, the color of which changes depending on the light you’re using the phone under. The phone is also IP68 water and dust resistant, so you'll be able to get this phone wet without worrying about it breaking."
  ],
  "headers": {
    "7": "Samsung Galaxy Note 10 release date and price",
    "10": "Design and display"
  },
  "links": {
    "Samsung Galaxy Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs",
    "Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Bixby": "https://www.techradar.com/how-to/what-is-bixby-our-guide-to-samsungs-voice-assistant"
  }
}