{
  "source": "https://www.techradar.com/reviews/aaxa-m7-pico-projector",
  "title": "Aaxa M7 Pico Projector review",
  "category": "audio-visual",
  "updated": "2021-10-04T15:04:49Z",
  "author": "mark-pickavance",
  "summary": "A practical portable projector",
  "verdict": "It might lack streaming and app installation, but the core functionality of the M7 is good. For a portable projector, it is surprisingly bright and offers a useable battery life.",
  "pros": [
    "Affordable",
    "Works on battery for up to 3 hours",
    "Bright for being battery powered"
  ],
  "cons": [
    "No WiFi or streaming content",
    "Heavy for a Pico design",
    "Limited video file formats supported"
  ],
  "article": [
    "When we hear the phrase ‘Pico projector’ it tends to translate into another word, compromise.",
    "Expecting all the functionality of a mains power projector in another that uses battery power and is easily portable isn’t that realistic. To project in daylight requires high brightness levels, increasing the power consumption and adding cooling issues. These demands all conspire to make projectors heavier, something all portable devices want to avoid.",
    "Typically, makes of Pico projectors tend to lower the brightness substantially, or the battery running time, and usually both, to make their products function at all.",
    "That begs the question, is the Aaxa M7 Pico another one of those limited devices, or does it manage to deliver a portable projector that isn’t massively compromised?",
    "The intended MSRP of the M7 was $600, but they’re offering it currently to US-based customers for $488 directly from the Aaxa Technologies store.",
    "We were able to find the M7 for that price on Amazon.com, but it wasn’t yet available through Amazon’s European outlets. But we’d expect that to change since Aaxa’s projector range can be easily found from European online retailers.",
    "The first thing we noted about the M7 was that as ‘Pico’ projectors go, it isn’t that small.",
    "Measuring nearly 19cm wide, 16cm deep, and weighing in at 1.36kg, it’s at the bigger end of the portable projector spectrum.",
    "Instead of going for anything radical, Aaxa went with a simple rectangular enclosure with a single fan vent at the back, inputs on the sides, and the LED projector optics mounted off-centre on the front right (looking at it).",
    "The top sports the ubiquitous touch controls, with electronic focus controls on the right side and a power on/off/charge switch on the back.",
    "In the box, along with the M7, you get a user manual, a 19V 4.8A laptop-style power supply and associated US bayonet power cable, a small remote control, and phono Composite A/V to 3.5mm jack converter to enable classic hardware like the Super-Nintendo to utilise the M7 projection.",
    "You don’t get an HDMI cable or any needed to connect a mobile phone directly. But, Aaxa has phone cables (iOS and Android) as extra accessories, along with a ceiling mounting kit and replacements for the PSU and remote.",
    "These items are all relatively inexpensive, like the M7.",
    "The design of the M7 was clearly driven by a need to make it as straightforward as possible, presumably to reduce costs and lessen the potential for returns. There isn’t even a foot underneath to angle the projector for table-top use.",
    "That said, some of the things missing may be largely superfluous, since we used it on a table with no issues, and the keystone functionality worked flawlessly.",
    "Overall, the thinking behind the Aaxa M7 is refreshing, as it doesn’t aim to please every possible requirement in portable projection.",
    "Often in this section of a projector review, we’d talk about the ARM processor that was used and how it might compare with that in a modern mobile phone.",
    "Except, we’ve no idea what CPU is inside the M7, and it doesn’t run a version of Android with installable apps or anything like that.",
    "We can surmise that the basic functionality is Linux based, and the CPU is undoubtedly ARM-based, but how much RAM and storage it has isn’t apparent or important.",
    "Where the M7 diverges from all the recent Pico designs that we’ve seen is that there is no attempt to embrace the streaming age here.",
    "Therefore, you can connect a mobile phone or tablet for screen mirroring or access files on a MicroSD card or USB memory stick, but there is no wireless networking and access to browsers and streaming apps.",
    "Its technology is where conventional projectors existed around five years ago. The emphasis here is on adding external devices to address those limitations, leaving the M7 to focus on the projection experience.",
    "Where it is ahead of its competition is that this is a proper 1080p native DLP, and it can take 4K files and scale them for output. With mains power available and ‘boost’ enabled, the M7 can generate 1200 lumens of brightness, a level that many cheaper 1080p mains-only solutions can’t match. On battery power that drops to 650 lumens, if you are prepared to accept a running time of only 2.1 hours.",
    "Eco mode is much less bright, only suitable for light-controlled spaces though using it increases the running time to three hours.",
    "One curiosity is that while the LED bulb can’t be replaced when its 30,000 hours lifespan ends, the internal battery of the M7 can be accessed and presumably swapped.",
    "Once we got over our initial disappointment that you can’t hook the M7 up to a network and use streaming services, we soon began to wonder if this was a choice that Aaxa made the right choice with this device.",
    "Because by not embracing Android in the fashion we saw it in the XDO Pico Projector and Asus ZenBeam Latte L1, the M7 is better focused (pun 100% intended) on delivering the critical projecting job.",
    "The simple interface gets the owner to the features they’re most likely to want, and there aren’t any distracting apps that need updating or passwords to keep entering.",
    "If you want wireless streaming, then simply buy a $30 streaming stick, Chromecast or Amazon Fire TV, and connect it via HDMI. Alternatively, connect your phone/tablet, and mirror that output through the M7.",
    "Using a phone or tablet reduces the power demands on the projector, allowing it to show a full-length movie at a high level of brightness purely on battery.",
    "The projection is sharp, the contrast is excellent, and the colour saturation is strong. Being only 1080p, it doesn’t support HDR, but from well encoded 1080p files or services, the results are detailed and highly watchable.",
    "One feature that needs some work is Dynamic projection mode that boosts the contrast higher but, in our testing, created some slightly odd colour casts with some content. We found standard or even mild modes were superior for most uses, and even with the reduced brightness of mild, the colours appeared more natural.",
    "If this unit has a weakness, it is the limited supported file formats, especially those provided for video decoding.",
    "While it will play most H264 content, what it doesn’t support is AC3 audio, and often the video will play nicely, but the audio is silent. What the decoding engine also didn’t care for, surprisingly, was LPCM audio on some files, maybe due to the fidelity of the encoding.",
    "But our biggest decoding disappointment was that a standard MP4 packaged H264 in 4K we captured using the DJI Mini 2 drone wouldn’t play and came up as an ‘unsupported file type’.",
    "Oddly, the manual doesn’t list either MP4 or MKV as supported files, though with got the latter to work to a degree, and both types of files appear in the interface. What it won’t show is H265 encoded video, irrespective of how it is packaged.",
    "At this time, Aaxa hasn’t released any firmware updates for the M7, but hopefully, some of these limitations can be addressed, though we’d be surprised if AC3 was added.",
    "And, if you are running VLC on your phone or tablet and playing through that, none of these limitations will stop you from viewing and hearing the content.",
    "The Aaxa M7 Pico projector was full of surprises. The designers of this hardware aren’t heading in the same direction as many portable projector creators, and because of that, the whole design feels distinctly less ‘me too’.",
    "However, the direction taken here means that without a supporting phone or tablet, its potential uses are much more limited. The number of file types and codecs it supports needs to be expanded, even if they don’t support licenced audio codecs like AC3 and Dolby.",
    "Where it is most flexible is mirroring a mobile device or using a streaming dongle. We’d recommend anyone buying this to purchase a Google Chromecast, Roku or Amazon Fire TV stick to use alongside it.",
    "Once you’ve connected one of those or use your phone directly, you can enjoy the excellent projected image that this small device can generate. Aaxa claims it can produce a 200-inch projection, and while that might be technically possible, 100-inches from this design is significantly brighter and sharper.",
    "It easily outperforms many of Pico scale projectors that we’ve seen so far and elegantly avoids the Android-without-the-play-store pitfalls that have mired some competitor devices.",
    "We only hope that Aaxa improves the firmware to make this highly affordable portable projector even better than it already is.",
    "Note: Since our review was written, Asus has released a firmware update for the Latte L1 that they assure us has addressed the interface issues that we detailed. Anyone buying this product today should receive one that has this improved firmware."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "16": "Hardware",
    "25": "In Use",
    "38": "Final verdict"
  },
  "links": {
    "XDO Pico Projector": "https://www.techradar.com/reviews/xdo-pico-projector",
    "Asus ZenBeam Latte L1": "https://www.techradar.com/reviews/asus-zenbeam-latte-l1-portable-led-projector"
  }
}