{
  "source": "https://www.techradar.com/reviews/silence-encrypted-messaging",
  "title": "Silence encrypted messaging review",
  "category": "computing",
  "updated": "2021-08-03T03:22:54Z",
  "author": "daniel-blechynden",
  "summary": "Encrypted SMS solutions, but are they too simple?",
  "verdict": "It’s not the most advanced encrypted messaging app on the market, but Silence does offer viable secure SMS solutions for Android users.",
  "pros": [
    "Offers secure SMS solutions",
    "Absolutely free for all users"
  ],
  "cons": [
    "Only available for Android devices",
    "No live customer support"
  ],
  "article": [
    "Encrypted messaging apps are becoming increasingly popular across the world. They are designed to help increase the privacy and security of users by ensuring that malicious third parties can’t access messages and other personal data.",
    "In our Silence review, we take a close look at the popular encrypted SMS messaging app. On the surface, it appears to be a powerful option for those looking for increased privacy and anonymity. We aim to help you decide whether it’s as good as it seems.",
    "Like many encrypted messaging apps, Silence is completely free to download and use. There’s no need for a subscription or a premium license, making it a good option for those looking for a free private messaging solution.",
    "However, it is possible to donate to the Silent project if you would like to contribute to ongoing running and development costs. At the time of writing, donations are only accepted in Bitcoin, which could be a little difficult for those who aren’t familiar with the cryptocurrency world.",
    "Although it’s quite a simple encrypted messaging app, Silence still offers a selection of features worth noting. For starters, it’s designed to replace your default SMS app, offering increased security and privacy for users. It’s based on open-source, freely available code, and it can be used without an internet connection.",
    "In addition, you can import all existing contacts that you have saved on your phone. There’s a neat setup guide to help you get started, and the entire app is easy to use.",
    "Also, you can message anyone, not just other Silence users. One important thing to note here, though, is that end-to-end encryption is only available between you and others using the Silence app. Other SMS messages aren’t encrypted when in transit.",
    "Silence is only available on Android devices, which makes it a little restricted compared to other encrypted messaging apps that are available across various mobile and desktop operating systems.",
    "To get started, you can either download the app from the Google Play Store or from F-Droid, an open-source Android app repository. You will usually find a more updated version on F-Droid, as updates can take some time to arrive in the Play Store.",
    "Once you’ve downloaded the app, simply open it and follow the prompts to get started. You can use it to message anyone, regardless of whether they’re using Silence. Various security and privacy settings can be configured to ensure that your chats are always protected, and you can import contacts directly from your SIM card.",
    "One thing worth noting is that Silence sends messages via SMS/MMS, rather than via the mobile internet network. This means that you could be faced with fees from your phone carrier if you don’t have unlimited messages included with your plan.",
    "Unfortunately, Silence offers no live support services to speak of. This isn’t too much of a surprise, though, as it’s absolutely free. It’s also quite simple and easy to use, so you shouldn’t have any major issues that require live support.",
    "On the self-help front, there’s a short list of basic FAQs that outline things that you might like to know about the platform. There are also Twitter and Medium accounts linked to the Silence team, although these aren’t often updated.",
    "As an encrypted text messaging app, Silence naturally offers a decent selection of security features. For starters, all messages stored on your phone are fully encrypted, reducing the risk of them being accessed without your knowledge. Do note, though, that you will have to set up a passphrase to enable at-rest encryption.",
    "On top of this, messages between two Silence users are backed by full end-to-end encryption, increasing privacy and preventing them from being intercepted while being sent. There’s also an incognito keyboard that won’t remember your typing history, along with a screen security option that prevents you from taking screenshots while the app is open.",
    "If you’re looking for an encrypted messaging app that’s available on iOS, desktop operating systems, and Android, you might like to use WhatsApp. This is a popular option that like Silence, is absolutely free for all users.",
    "If security is your number-one priority, it could be worth considering Telegram. This app has long been a leader in the encrypted messaging space, and it was designed with privacy and data integrity as the main development priorities.",
    "All things considered, Silence is a decent encrypted messaging app that doesn’t stand out from the crowd. It’s designed to offer more secure SMS than your device's standard SMS client, although end-to-end encryption is only available when messaging other Silence users.",
    "On top of this, Silence is only available on Android operating systems, which effectively makes it useless for iOS and other users. Customer support is limited, but the tidy user interface and focus on privacy are nice to see.",
    "The bottom line is that there’s nothing wrong with using Silence, but it’s far from the most advanced or most popular encrypted messaging app available."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "7": "Interface and in use",
    "11": "Support",
    "13": "Security",
    "15": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Encrypted messaging apps": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "Silence": "https://silence.im/",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Android devices": "https://www.techradar.com/best/best-android-phones",
    "WhatsApp": "https://www.techradar.com/how-to/use-whatsapp",
    "Telegram": "https://www.techradar.com/news/telegram-is-looking-more-and-more-like-a-business-app"
  }
}