{
  "source": "https://www.techradar.com/reviews/hisense-h9g-quantum-hdr-tv-55h9g-65h9g",
  "title": "Hisense H9G Quantum HDR TV (55H9G, 65H9G) review",
  "category": "televisions",
  "updated": "2021-11-12T16:18:19Z",
  "author": "christian-de-looper",
  "summary": "The Hisense H9G takes an already solid TV and makes it even better",
  "verdict": "The Hisense H9G excels where it counts. It doesn’t offer great audio or a flashy design, but it has an excellent image quality, a generally responsive Android TV, and some other helpful smart features. In fact, this is arguably one of the best TVs under $1,000.",
  "pros": [
    "Excellent picture quality",
    "Built-in microphone",
    "Good port selection"
  ],
  "cons": [
    "Audio quality isn’t great",
    "Design is a bit chunky"
  ],
  "article": [
    "Hisense has been building some of the best sub-$1,000 TVs for a few years now, and now the company is back with a follow-up to last year's Hisense H9F.",
    "On paper, the Hisense H9G doesn’t represent a massive upgrade over the H9F, but in use it’s a huge upgrade. Android TV is faster, the TV has a microphone built in for Google Assistant even when the TV is off, and it supports HDR10+.",
    "Generally speaking, this TV offers among the best picture quality on a TV under $1,000. Colors are vivid, black levels are deep, and so on. The audio quality leaves a little to be desired, but paired with a soundbar or a pair of speakers, and you’ve got a viewing experience that punches well above its weight class.",
    "New for 2020, the Hisense H9G is available in two sizes: 55 inches, and 65 inches. Both of those models are now available from most big box retailers, with the 55-inch model coming at $700, and the 65-inch model coming at $1,000 - though some retailers will discount the TV, especially around Black Friday 2020. (At the time of this writing, Best Buy was selling the TV for $50 off.)",
    "For comparison, the current-generation Vizio M-Series Quantum comes at $550 for the 55-inch model and $650 for the 65-inch model. The TCL 6-Series (R635) is also a great option in this price range, and it comes at $650 for the 55-inch model and $1,000 for the 65-inch model.",
    "The Hisense H9G offers a very similar design to last year’s H9F, and while it’s not necessarily all that flashy, it still offers a few modern touches that keep the company ahead of the curve in this price range. We’re reviewing the 65-inch model, which measures in at 4.1 inches thick at its thickest - which is a bit chunky, but not as bad as the old \"flatscreens\" of yesteryear.",
    "That said, there are a few things that give the TV a modern look: For starters, there’s the relatively thin bezels around the display, which are only around a quarter of an inch thick. They’re not quite as thin as they look in some press images, but it’s still a good look. The legs also help give the TV a unique look, thanks to the fact that they start in the center and spread out. It’s the same as last year’s model, and it does result in a relatively deep leg footprint, but we like it.",
    "One major difference between the design of this TV and the H9F is the fact that this one has a microphone mute switch right on the front of the TV. While those who want to use Google Assistant and voice search will want to keep the microphone on, it’s nice that the privacy-aware can mute the microphone with a hardware switch.",
    "Around the back, you’ll get a solid selection of ports. There are four HDMI ports, including one with ARC, and two USB ports, which can be used to apply power and to access local media. Other ports include an Ethernet port, a headphone jack, and a composite video input.",
    "The remote that comes with the TV looks fine, but in a world of ultra-simple remotes like the Apple TV 4K remote and the Nvidia Shield TV remote, it is a little complex. You’ll get input and channel controls at the top, under which there are software controls, and quick-access buttons for Netflix, Prime Video, YouTube, and Google Play. Thankfully, the TV supports HDMI CEC, so if you want to connect a device like an Apple TV and control the TV with that instead, you can.",
    "While some Hisense TVs come with Roku built-in, the H9G comes with Android TV, and that means that it supports all your favorite streaming services... well, all of them except for Apple TV+.",
    "Android TV is generally pretty well-designed. You get a row of tiles for apps at the top, then rows of content for your favorite apps below that. It’s a lot to take in all at once, but you’ll get used to it, and it’s nice to be able to access all of that content straight from the home screen. Because of the massive ecosystem that is the Google Play Store, you’ll also get access to a huge range of other apps and services, including games, VPNs, and so on.",
    "One of the main issues with Android TV on budget TVs is usually that they don’t come with processors fast enough to deliver a fast experience. While there were plenty of times that the software seemed a bit slow, for the most part, it actually wasn’t bad on the H9G.",
    "Google Assistant gets a major improvement on the H9G too. As mentioned, the TV has a microphone built into it, and that means that even when off, the TV can act like a Google Assistant smart speaker. You can use it to control smart home devices, play music, and more - all using only your voice. Assistant reacted quickly to my commands, and easily turned lights off, locked a smart lock, and so on. The remote has a microphone built into it too, though weirdly you have to pair the remote as a Bluetooth device to use it. By default, the remote controls the TV just through infrared, but it should really be paired to the TV through Bluetooth out of the box.",
    "Once you pair the remote, you can push the button to trigger Assistant instead of always using the “Hey, Google” wake word. You can use the button when the TV is off too, but the lights that indicate Google is listening weirdly don’t turn on when you do that.",
    "The best thing about the Hisense H9G has nothing to do with the design or the smart operating system. It’s the fact that the TV has an excellent picture quality, and while it’s not perfect, it’s about as close as you’re going to get for a TV in this price range.",
    "The H9G offers a 4K resolution, with support for Dolby Vision and HDR10+. The TV also offers full-array local dimming to make for deeper blacks and an increased contrast ratio, and there are a range of picture modes to choose from.",
    "When it comes to 1080p, SDR content, the picture quality is excellent. The upscaling tech on the TV means that a 1080p image looks almost as detailed as a 4K picture, and while you can tell a slight difference when you’re looking for it, it’s far from distracting. There are a total of seven picture modes in SDR, however we found that none of them looked perfect - and ended up keeping the TV on Standard mode and tweaking a few of the settings. During gaming, the mode was switched to Game mode, which lowers the input lag to a solid level.",
    "When it comes to 4K/HDR content, colors were beautifully vivid, while black levels were nice and deep. There was a little blooming with some bright objects, but it’s only at some times, and it’s barely noticeable. The other issue we noticed was that there were some minor issues related to gray uniformity, which might be noticeable at times. During most content, however, you won’t see it. Last but not least, the viewing angles aren’t the best, so if you’re living room setup involves needing to be able to see at a high angle, you may be a little disappointed.",
    "Generally, however, the image quality here is incredible for the price. Watching David Attenborough’s Our Planet gave us our nature fix without having to venture into the scary outside world, while the TV nicely highlighted Superstore’s bright colors.",
    "The audio performance on the H9G could be described as “fine.” It’s definitely passable if you’re in a pinch, but it’s worth getting a pair of bookshelf speakers or a soundbar if you want to pair that great viewing experience with a good audio experience too.",
    "The bass response is one of the weaker aspects of the TV’s audio quality, and as a result you won’t get the depth and body from things like explosions or kick drums in music that you might want. It’s essentially the same issue with the highs - there just isn’t enough extension to make for a super detailed listening experience. As is usually the case with TV built-in speakers, with the Hisense H9G you’ll get all mids all the time. That said, the speakers do get very loud.",
    "Of course, built-in speakers are better now than they were a few years ago, and hopefully they’ll continue to get better. But in the meantime, if you don’t mind paying a little extra, it’s worth using another speaker of some kind."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and release date",
    "5": "Design",
    "10": "Smart TV (Android TV)",
    "15": "Picture quality",
    "20": "Audio performance",
    "23": "Don't buy it if..."
  },
  "links": {
    "Hisense H9F": "https://www.techradar.com/reviews/hisense-h9f-55h9f-65h9f",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Black Friday 2020": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Vizio M-Series Quantum": "https://www.techradar.com/reviews/vizio-m-series-quantum-m658-g1",
    "TCL 6-Series (R635)": "https://www.techradar.com/reviews/tcl-6-series-2020",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Nvidia Shield TV": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "Apple TV+": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know"
  }
}