{
  "source": "https://www.techradar.com/reviews/kitchenaid-high-performance-series-blender-ksb6060",
  "title": "KitchenAid High Performance Series Blender KSB6060 review",
  "category": "appliances",
  "updated": "2021-12-02T14:39:40Z",
  "author": "helen-mccue",
  "summary": "A high-powered blender with a price tag to match",
  "verdict": "KitchenAid is a brand with a good reputation for countertop appliances and this is a top-quality blender. The KitchenAid High Performance Series Blender KSB6060 has a sturdy die-cast metal base, and high-power motor, which makes light work of blending tough, fibrous ingredients such as pineapple. It’s expensive, big and bulky, and there are no pre-set programs or smoothie accessories. That said, this is a high-performance machine aimed at seasoned cooks who want a blender without the gimmicks, that offers lots of speed settings.",
  "pros": [
    "10 speed settings",
    "Simple to operate",
    "Sturdy metal construction"
  ],
  "cons": [
    "Expensive",
    "Bulky",
    "Blades get warm"
  ],
  "article": [
    "KitchenAid has a long-standing reputation for manufacturing kitchen appliances for over 100 years. It has been manufacturing blenders for almost 30 years, with models from its range regularly making it into our best blender list.",
    "The KitchenAid High Performance Series Blender KSB6060 is no exception. Designed to be an easy-to-use no-nonsense kitchen appliance, it’s one of the most powerful blenders in KitchenAid’s range. It has a die-cast metal base and comes with a 60oz/ 1.75-liter plastic pitcher.",
    "With ten speed settings, but no auto programs, it’s designed more for experienced cooks than novices in the kitchen.The wide range of speed settings give the user plenty of control for whatever creation they choose. There are no additional blending cups or smoothie accessories included or available separately, so KitchenAid isn’t targeting the smoothie crowd with this appliance, it’s for serious cooks.",
    "At $419.99/ £499, the KitchenAid High Performance Series Blender KSB6060 is eye-wateringly expensive too. It’s best -suited to heavy-duty blending tasks that need some muscle, such as combining a range of tough fibrous ingredients. However, if you’re looking for a blender that can evenley chop nuts, this is best avoided as we were left disappointed with its attempts.",
    "The KitchenAid High Performance Series Blender KSB6060, which is known as the KitchenAid Blender High Performance ARTISAN 5KSB6061 in the UK, is priced at $419.99/ £499. It can be purchased directly from KitchenAid, but it isn’t currently available in Australia.",
    "The KitchenAid High Performance Blender is one of its most premium models in the KitchenAid range of blenders, with a high-power 3.0 peak horsepower motor, which is second only to the most premium models which have a 3.5 peak horsepower motor.",
    "As we mentioned earlier the KitchenAid High Performance Series Blender KSB6060 has a 3.0 peak horsepower motor, which is likely to be the reason for blender’s size. It’s one of the biggest we’ve seen and will take up more space on your countertop than an average blender. It measures 17.7 x 10.5 x 9.1 inches /45 x 26.7 x 23.1cm (h x w x d), and is also heavy at 19.5 lb / 8.85 kg. If you’re short on space and plan to keep it in a cupboard when not in use, it will be tricky to move around.",
    "It’s really simple to set up, comes with a generous 60 oz/ 1.75-liter BPA-free plastic blending jar and a tamper, but there are no other accessories included, or available to purchase separately either. You also won’t see any preset programs on this blender, but it has 10 infinitely variable speed settings for ultimate control, as well as a pulse option.",
    "The start/ stop and pulse toggle switches can be pushed either up or down to operate the blender and the jug can be placed with the handle on any corner to suit your needs.",
    "The sturdy die-cast metal base comes in black for those purchasing in the US or a choice of red or cream if you’re in the UK. Since this blender is designed for seasoned cooks who want a high-powered appliance, it doesn’t come with a recipe book, although there are a few speed suggestions in the instruction manual.",
    "During testing, we noticed that while the KitchenAid High Performance Series Blender KSB6060’s heavy sturdy base stays securely in position on the countertop, the jar doesn’t lock to the base and there can be some slight movement left or right.",
    "With just ten speeds or pulse to choose from, it’s simple to use the blender. We pulsed ice cubes to crush them, which the blender had no problem doing. The ice was crushed in a few seconds to a good even texture that wasn’t too powdery. We also tried chopping nuts with the pulse function, but the results were uneven, half was chopped into a powder with the other half being larger chunks. Our decibel meter measured 85dB when chopping nuts which was the loudest of all the tests we did using this appliance. While this isn’t the loudest blender we’ve tested, this noise level is equivalent to a truck travelling down the road at 40mph, which certainly makes it loud. That said, as the sound level is only experienced for a few minutes at a time, we think this is an acceptable level.",
    "For a smoothie, the instruction manual suggests using the maximum power level and the texture didn’t disappoint. It pulverized fibrous pineapple and leafy spinach with banana, yogurt and apple juice into a smoothie with no grittiness or visible bits at all. But despite all of our ingredients coming straight from the fridge we noticed the smoothie was at room temperature when we drank it. The blades were warm to the touch, leading to heat to transfer to the smoothie during blending. This is a big downside of this powerful blender, although when used for a shorter duration, such as when crushing ice, we didn’t experience any heat transference.",
    "We made a thick glossy mayonnaise using the lower speed settings, oil can easily be poured in during blending by removing the ingredient measuring cap. There was very little spitting and the blades are positioned low enough in the blender jug to ensure the small quantity of egg yolks are mixed fully. Towards the end of the mayonnaise test, we did stop blending and gave the condiment a stir because some of the oil wasn’t being fully incorporated, and instead remained on the side of the jug.",
    "When we filled the blender to maximum capacity with water and began blending, we were pleased to see there wasn’t any serious leaking. A very small amount of water was ejected through the side of the ingredient-measuring cap into the well in the lid. However, it quickly drained back into the jug and didn’t build up in the lid.",
    "The jug, lid and tamper are all dishwasher safe, and the manual instructs you on how to clean using maximum speed, hot water and dishwashing detergent, so it’s easy to clean off even the most gloopy food remnants such as our mayonnaise.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "30-second review",
    "4": "KitchenAid High Performance Series Blender KSB6060 price and availability",
    "6": "Design",
    "10": "Performance",
    "16": "Don’t buy it if…"
  },
  "links": {
    "blenders": "https://www.techradar.com/best/best-blenders"
  }
}