{
  "source": "https://www.techradar.com/reviews/aten-cs1953-hybrid-kvmp-switch",
  "title": "Aten CS1953 Hybrid KVMP Switch review",
  "category": "audio-visual",
  "updated": "2021-08-10T16:49:13Z",
  "author": "mark-pickavance",
  "summary": "One KVM to rule them all",
  "verdict": "Made to a high specification and can smartly switch between three systems with 4K output, the CS1953 is at the top of the KVM food chain. But, it is still a cabling nightmare and an expensive one at that.",
  "pros": [
    "Three-way KVM",
    "Four ways to trigger switching",
    "Split focus options"
  ],
  "cons": [
    "Expensive",
    "Only 45W charging",
    "Excessive number of cables"
  ],
  "article": [
    "KVM switches, standing for Keyboard, Video and Mouse, have been around a long time.",
    "I first used one to switch between multiple servers in a machine room, and that was at least 25 years or more ago.",
    "Being able to flip easily between different machines while only using one set of input peripherals and a single display has many operational advantages and also the potential for some equipment cost savings.",
    "As a reputable maker of KVMs, Aten has a wide range of these devices that can handle more than two computers, a requirement that many in IT and development share.",
    "The new Aten CS1953 Hybrid KVMP Switch is only a three-machine solution that sits somewhere between a conventional KVM and a docking station.",
    "It is an expensive choice, so is it worth the money?",
    "The typical UK pricing for this unit is £504.08, and that version includes the power supply. For those wishing to charge a laptop over USB-C, the PSU can either be bought separately or bundled, and the version without the PSU is cheaper than this.",
    "While this product isn’t yet listed on the Aten eShop in the USA, the American retailer Newegg carries it for $445.97 at this time.",
    "Note that Aten is the parent company of IOGEAR and that they also sell the device as the GCS1953",
    "The common problem that those designing docking stations and KVM devices experience is how to make it look less like a box and something that doesn’t dominate the desktop of those using it.",
    "An interesting approach taken here is to make it look reminiscent of a completely different piece of equipment at a much-reduced scale.",
    "With the word ‘AUTOSCAN’ across the front, this looks identical to a personal paper scanner circa 1994, though big enough only to take A5 pieces of paper.",
    "At just 217mm long, 71mm deep and 43mm high, it’s about the size of an old pencil case, if anyone remembers those?",
    "While it might be relatively small, the collection of cables that come with it dwarf the device entirely and fill most of the box it comes in.",
    "Including the remote clicker switch and PSU, there are nine cables, with three each for two of the PCs and a USB-C line for a third.",
    "Therefore, what the CS1953 doesn’t solve is the inherent ‘rats nest’ cabling issue that all conventional KVM have and its exponential growth when more than two computers are connected. It hints at a solution through USB-C, but as it only has one of these ports, this potential is never fully realised.",
    "To attach two computers using the standard ports requires a USB line, audio line, and a DisplayPort cable from both. And, then the speakers, keyboard, mouse, and monitor all connect to the CS1953. For those not keeping count, that’s ten cables.",
    "To that cabling list you can add a power supply line, a requirement if you want to charge via USB-C, and another two if you use the USB-C with its oddly separate audio line.",
    "That USB-C line also provides power to the connecting system, so it can charge a laptop that accepts this port as a charging source.",
    "Those expecting a connected laptop to charge fast might be disappointed. Because Aten only sends through a maximum of 45W to a USB-C attached device, less than the typical 67W or 85W that some performance laptops require.",
    "With only 45W of power, some laptops will consume more power running than they get from the CS1953, degrading the amount of battery left over time not increasing it. Given this choice, most laptop owners that have more than one USB-C port will not be charging through this device.",
    "For attaching USB peripherals are two USB 2.0 ports, meant for mouse and keyboard, and another two USB 3.1 Gen 1 ports that could be used for a wide range of USB devices.",
    "We’d avoid putting storage devices in these ports, as they could corrupt if a switch inadvertently happens while data is being written. But, they might be useful for printers, scanners and other less sensitive peripherals.",
    "One slightly curious difference between this and other KVMs we’ve seen is its dual focus separating KVM and USB/Audio into two independent selections. Therefore, it is possible to be seeing one computer on the monitor while connected to the sound from another system.",
    "That’s not something we’ve ever needed to do, but there may be situations where it might be useful occasionally.",
    "Once everything is connected, you can switch between the inputs in no less than four different ways. These include pushbuttons, keyboard hotkeys, a mouse, and a remote port selector included in the box.",
    "Of these options our personal favourite is the hotkey, as it allows the unit and all its nasty cabling to be placed out of sight but still function. The remote port selector is also useful, but you need to move your hands away from the keyboard to operate it, where the hotkey feature can be executed more easily by those working at the keyboard.",
    "Aten used the common KVM hotkey sequence of [scroll lock] [scroll lock] to initiate a switch, with other keys following to determine the change. For the expert, there are no less than ten possible key sequences to learn, as you can control the KVM and USB/audio aspects independently.",
    "While having this level of functionality might impress some, others would consider it more complicated than it needs to be, especially when there are only three possible inputs.",
    "A place it might win more friends and influence people is that it allows a USB connected keyboard to emulate an Apple Mac or Sun workstation layout, something that might be ideal for those in a mixed standards environment.",
    "What’s missing here is a small tray application that could be popped up on a connected system to quickly to see the current configuration to make changes as required. As it could generate the [scroll lock] [scroll lock] key sequences and push them into the keyboard buffer, this would be very easy to create and highly user-friendly.",
    "It’s impossible to deny that the CS1953 might be a highly useful piece of equipment to a person working with up to three computers that want to smoothly switch between them.",
    "However, these types of management tasks are often performed with remote desktop tools that are mostly free, and these can cope with significantly more satellite systems than just the three this can handle.",
    "One of the most significant selling points of this design is that it supports a 4K DCI (4096 x 2160 @ 60Hz) display. But only a limited subset of developers would probably need that, and if they were working with multiple computers, it would be easier to have three 4K screens and a much less expensive KVM device.",
    "And, that point hints at the major caveat of the CS1953, cost. As well made as this is, and with a great feature set, it’s far from cheap.",
    "There are widescreen monitors, like the BenQ DesignVue PD2705Q, available that include the KVM functionality are cheaper than the CS1953. That design includes a 27-inch 1440p display for $100 less. It might not have all the bells and whistles, like four ways to switch, and it is only dual input, but the connected laptop gets more charging watts than this device can offer.",
    "There are others, such as the ViewSonic VP2785-4K, that offer 4K resolutions for just $250 more than the CS1953. And, all these monitors with integrated KVMs have much simpler cabling schemes.",
    "Therefore, as useful as the CS1953 could be, it could hardly be described as the most cost-effective approach to this problem or the most elegant."
  ],
  "headers": {
    "6": "Price and availability",
    "9": "Design",
    "25": "In Use",
    "31": "Final verdict"
  },
  "links": {}
}