{
  "source": "https://www.techradar.com/reviews/lumie-bodyclock-active-250",
  "title": "Lumie Bodyclock Active 250 review",
  "category": "fitness",
  "updated": "2021-10-15T09:24:52Z",
  "author": "cat-ellis",
  "summary": "A wake-up light with nature sounds to rouse heavy sleepers",
  "verdict": "The Lumie Bodyclock Active 250 rouses you with a simulated sunrise. Light sleepers might find themselves jolted awake, as the light increases in steps rather than fading up gradually, but those who snooze more heavily are likely to find the experience more effective. Optional nature sounds can stop you oversleeping, though the short looping samples aren't very relaxing. The sunset mode works well though, and encourages you to settle down at night rather than spending time checking Twitter on your phone. There are more sophisticated wake-up lights, but the Bodyclock Active 250 is well worth considering if you sleep heavily, particularly if you can find a good deal on it.",
  "pros": [
    "Sunset and sunrise modes",
    "Lots of light and sound options",
    "FM radio"
  ],
  "cons": [
    "Poorly labelled controls",
    "Lowest light level is quite bright",
    "Short looping nature sound samples"
  ],
  "article": [
    "The Lumie Bodyclock Active 250 is a wake-up light and alarm clock that aims to rouse you gently with a simulated sunrise that increases in brightness over a period of time, with pre-programmed nature sounds to ease you into wakefulness. How well it works will depend on how heavily you sleep.",
    "Heavy sleepers will be able to snooze through the earliest stages of the sunrise and be woken gently as the brightness increases, but the illumination increases in steps rather than gently fading up, so those who sleep more lightly may find themselves startled awake by it. Similarly, the sounds (including a running river and birdsong) are very short, and loop after just a few seconds, which can become irritating rather than relaxing.",
    "We found the 'sunset' feature more useful, dimming the light over a period of time so you're not tempted to stay awake playing on your phone for too long. It's a good way to wind down at night (particularly when paired with a book) and we found it effective in encouraging better sleep habits in the evening.",
    "If you're a lighter sleeper, one of Lumie's newer models (such as the Bodyclock Luxe 750DAB) may suit you better. This clock also benefits from DAB rather than FM radio, so you can use it to tune into your favorite station after FM signals are turned off, and its controls are much more clearly labelled.",
    "The Lumie Bodyclock Active 250 was released in 2005, and is available for $139 from Amazon (about £100 / AU$190).",
    "That’s about the same as the Lumie Bodyclock Shine 300 – a newer model with an improved design with cloth-covered speakers, tap-snooze control, and reduced blue light emission. The newer clock also has extra sound options, including fading thunder, cafe noise, and even kittens and goats.",
    "The Lumie Bodyclock Active 250 is large, measuring 8.5in x 7.5in, with a white plastic body and a top covered with a translucent plastic shell that diffuses light from its single halogen bulb (replacements for which are available from Amazon, or direct from Lumie). This top cover has slits in the back that let through extra light, creating a ‘sun ray’ effect on the wall behind it.",
    "The controls aren’t very user-friendly – the sound and light settings are programmed using a set of buttons that are only marked with symbols (the clock can be set to different languages, which explains the lack of text labels). We had to keep the manual in our bedside cabinet to remind ourselves how to change its settings.",
    "The time is shown on a blue LCD display, which dims automatically after your programmed bedtime. The FM radio antenna is a thin cable that dangles from the back of the unit.",
    "We’ve used the Lumie Bodyclock Active 250 for several months, and it never failed to wake us, but usually did so quite abruptly.",
    "The Lumie Bodyclock Active 250 gives you lots of options to experiment with. For example, the simulated sunrise can last 15, 20, 30, 45, 60 or 90 minutes, depending how long it takes you to prepare yourself for the day ahead.",
    "Unfortunately, the light doesn’t fade on gradually, and even its lowest setting is fairly bright. We were woken with a start the moment the ‘sunrise’ began as it came on abruptly. The light then increases in brightness in jumps throughout your chosen timespan, rather than increasing gently. If you're a heavy sleeper however, like our reviewer's partner, that may not be an issue; you may doze through the first stages of the 'sunrise' and wake naturally, as intended.",
    "If you’re concerned that the light alone won’t rouse you, you can choose to back it up with a nature sound, white noise, a traditional beep, or your preferred radio station. This is an FM radio rather than digital, so it won’t work forever; if you’re in the UK, for example, FM signals are due to be turned off in 2032.",
    "The nature sounds are very short, only lasting a few seconds before looping. The water sound was the gentlest of the available options, followed by the dawn chorus (a slightly mechanical sounding snippet of birdsong), crashing waves, and a cockerel crowing.",
    "We found the light’s bedtime ‘sunset’ mode more useful, as it encouraged us to stick to a regular routine, and the rather abrupt shifts between lighting levels aren’t so much of a problem when you’re already awake. We also appreciate the fact that the time display dims automatically, so we weren't disturbed by unnecessary light throughout the night.",
    "If you’re a heavy sleeper then the Lumie Bodyclock Active 250 may suit you well, but if you’re easily jolted awake then you’d be better off with a more expensive, but more advanced sunrise light that will rouse you more gently.",
    "First reviewed September 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "6": "Design",
    "9": "Performance",
    "17": "Don't buy it if"
  },
  "links": {
    "wake-up light": "https://www.techradar.com/best/wakeup-light"
  }
}