{
  "source": "https://www.techradar.com/reviews/lg-gram-17-2021",
  "title": "LG Gram 17 (2021) review",
  "category": "computing",
  "updated": "2021-09-14T13:56:42Z",
  "author": "rhys-wood",
  "summary": "LG’s latest is a productivity powerhouse",
  "verdict": "The LG Gram 17 (2021) is spectacular for productivity, boasting an impressively sharp screen, incredible battery life and overall great performance.",
  "pros": [
    "Excellent battery life",
    "Large, high quality display",
    "Very light",
    "Whisper quiet"
  ],
  "cons": [
    "Expensive",
    "Subject to screen glare",
    "Touchpad could be better"
  ],
  "article": [
    "The LG Gram 17 (2021) is the latest 17-inch variant of the company’s so far superb lineup of productivity-oriented laptops that focus on being as light as possible. Powered by Intel’s 11th-generation mobile processors, the LG Gram 17 (2021) mostly allows for fast, hassle-free productivity to make your workload seamless.",
    "While the LG Gram 17 (2021) certainly isn’t going to win any awards for style, what the laptop does offer is pure function, poising it as one of the best choices for workplace use. If you can stomach the price, that is.",
    "Your immediate reaction to the LG Gram 17 (2021) laptop will almost definitely be how light it is. Weighing in at 2.98 pounds (1.35kg), the LG Gram 17 (2021) is fascinatingly lightweight, especially impressive given the extra bulk that 17-inch screen provides.",
    "Its lightness is easily one of the LG Gram 17 (2021)’s biggest selling points. It’s certainly one of the most portable-friendly options around, perfect for carrying around in a laptop bag. The importance of this can’t be overstated, as it could spell an end to heavier laptops giving you unnecessary strain during your morning and evening commutes to and from work or school.",
    "The laptop’s feathery weight pairs perfectly with its swiftness, too. Backed up by Intel 11th-generation processing power, the LG Gram 17 (2021) boots impressively quickly, letting you work on projects almost immediately without worrying about wasting time.",
    "Fast boot times are usually a good indicator of how well a laptop performs in everyday use, and the LG Gram 17 (2021) works hard in that regard, too. Under balanced power options, Intel’s technology has no trouble loading programs quickly and maintaining solid performance even when multiple tasks are running simultaneously. This naturally extends to browsers with a smorgasbord of tabs open.",
    "Another area where the LG Gram 17 (2021) absolutely excels is in its superb battery life. This is nothing new for the LG Gram series, but this latest model goes above and beyond even its predecessors in this regard, lasting just shy of 14 hours. As such, the LG Gram 17 (2021) will handily last you a full work or school day and then some.",
    "All this fantastic tech surely has to come at a steep price, and like other models in the series, the LG Gram 17 (2021) isn’t cheap. It’s an undoubtedly impressive laptop, but the high price point prevents it from being within reach of a huge number of potential consumers.",
    "The LG Gram 17 (2021) is on sale now for $1,799 / £1,599.",
    "This is comparative to other models in the LG Gram series. Last year’s LG Gram 17 (2020) model costs $1,749 / £1,549. That laptop ran on 10th-generation Intel processors, meaning the difference you’re paying for the LG Gram 17 (2021) goes towards extra processing power provided by the Intel Core i7-1165G7 CPU.",
    "Other LG Gram 17 (2021) configurations are also available. There’s a 512GB SSD configuration that costs a bit less, at $1,749 / £1,549 / AU$2,999. This is the only model available to Australians and might suit you better if you don’t work with files boasting large sizes.",
    "Another LG Gram 17 (2021) configuration features a 256GB SSD, which costs even less at $1,699 / £1,499, but it’s hard to recommend the laptop at that price with such a small amount of space, unless you’re planning on boosting it with external storage devices.",
    "If size is a concern for you, however, then the LG Gram 16 (2021) will be a more compact and cheaper option for you. At $1,299 / £1,249 / AU$2,799, the LG Gram 16 (2021) is a more affordable choice, and also features the same 2.8GHz Intel Core i7-1165G7 processor, 2,560 x 1,600 resolution and 1TB SSD (512GB in AU). That’s a pretty hefty saving if the smaller screen size isn’t a concern for you.",
    "Even though the 'LG Kilogram' might be a more literally accurate name for this laptop, the LG Gram 17 (2021) is shockingly light regardless. It’s arguably the very first thing you’ll notice about the laptop when first picking it up out of the box.",
    "It’s hard to truly gauge the value of this without holding the laptop yourself, but trust us when we say its light weight of just 2.98 pounds (1.35kg) is a remarkable achievement for a 17-inch laptop.",
    "That weight positions the LG Gram 17 (2021) as one of the lightest 17-inch laptops around. Other productivity-based laptops certainly don’t fare as well in this regard. The Gigabyte Aero 17, for example, weighs almost twice as much at 5.5 pounds (2.49kg), while the XMG Pro 17 fares a bit better at 5.1 pounds (2.3kg).",
    "That’s still roughly a whole kilogram the LG Gram 17 (2021) has over its competition, then. Still, if you want to go even lighter, the LG Gram 14 and 16-inch variants weigh even less and are slightly cheaper to boot. Those could be better options if you’re concerned about the extra real estate taken up by the LG Gram 17 (2021).",
    "Speaking of real estate, the LG Gram 17 (2021)’s dimensions are 15 x 10.3 x 0.7 inches (381 x 261 x 17.78mm). While the larger screen does take away from some of the portability aspect of its 14 and 16-inch counterparts, the impressively thin depth makes it compact enough to fit into an appropriately sized laptop bag with no issue.",
    "You might think that such a lightweight design comes at the cost of durability. After all, heftier laptops can give users peace of mind when it comes to preventing accidental damages. The LG Gram 17 (2021) is still impressively sturdy, however, featuring a full metal body that’s resistant to drops, dust and other common forms of wear and tear.",
    "For those who consider available ports as a purchasing factor won’t be disappointed either. The LG Gram 17 (2021) features two Thunderbolt 4 USB-C ports used to power the laptop and charge its battery. Those are flanked by a HDMI port and an audio jack on either side, the former allowing the laptop to be connected to other displays.",
    "On the laptop’s right side we have two USB 3.2 ports and a microSD card slot, giving users an abundance of options when it comes to slotting in portable storage devices as well as for connecting devices like smartphones and tablets for charging or file transfer and management purposes.",
    "The LG Gram 17 (2021)’s physical look isn’t going to wow anyone when opened up. In fact it’s rather inconspicuous. The laptop’s aesthetic design is so plain that you probably wouldn’t glance at it a second time, unless you get to see its gorgeous screen in action.",
    "At a resolution of 2560 x 1600, the LG Gram 17 (2021)’s sizable screen is a primary reason why the laptop is as big as it is. The WQXGA LCD screen is big for a reason, though, and from a productivity standpoint it’s hard to beat. The heightened display offered by its resolution means you might have more real estate shown on web pages and programs, and the choice of LCD renders the display beautifully sharp.",
    "Another standout feature of the laptop’s design is its keyboard. It’s satisfyingly punchy, with each key press giving strong feedback to ensure typing never becomes a chore. The touchpad fares less well, though. While it works just fine in practice, some users will miss the omission of dedicated left and right-click buttons, which can provide a satisfying and tactile experience on other productivity-based laptops.",
    "Rounding out the design feature set is the power button, which doubles as a fingerprint scanner as a secure method of logging in to your system. The sensor is both fast and accurate, requiring just a light touch of your fingertip, staying true to the LG Gram 17 (2021)’s prowess at getting you back into your projects as swift and painlessly as possible.",
    "The LG Gram 17 (2021) has impressed us from a design perspective, then, but it’s no slouch under the hood, either. Intel’s 11th-gen processor does a great job at multitasking, allowing you to juggle multiple projects on the go simultaneously.",
    "The model given to us for review features the aforementioned Intel Core i7-1165G7 as well as Intel Iris Xe integrated graphics, 16GB of RAM and an impressively large 1TB SSD. Those last two also help the laptop’s speeds tremendously.",
    "The laptop proved its worth in performing tasks quickly, even under the stress of multiple tabs and programs open at the same time. Google Chrome has traditionally been a resource hog, but it didn’t represent an issue for the LG Gram’s top of the line components.",
    "Photo editing is also handled fantastically, and can provide both enjoyable and accurate results thanks to the screen’s high image quality. Long sessions of editing of photos at 4K and above can start to tax the laptop, though, so if that’s part of your day to day, a more specialized laptop might benefit you more than the LG Gram 17 (2021).",
    "In our time working with the laptop on a day-to-day basis, the machine remained whisper quiet throughout, with only slight humming and heat buildup registering during our benchmark tests, which is to be expected.",
    "As a laptop made for work and school use, then, it gets the fundamentals right. Although one drawback is the LCD screen is prone to glare which can prove to be distracting in brightly lit office environments.",
    "The LG Gram 17 (2021)’s battery life is the real star of the show here, easily registering hours in the double digits during our benchmark tests.",
    "Our PC Mark 10 battery test clocked in at 13 hours and 48 minutes with the laptop’s screen set to 50% brightness. While this will undoubtedly vary depending on the type and amount of programs you’re running, it’s safe to say that the LG Gram 17 (2021)’s battery will last you a full work or school day without needing to be plugged in.",
    "The laptop also excels with video. We tested looping a 1080p video, again at 50% brightness, with the battery lasting a whopping 12 hours and two minutes before needing to recharge. Once again, mileage may vary based on the number of programs running in the background. If you’re on the move, then, the LG Gram 17 (2021)’s stellar battery life will allow you to keep yourself occupied with movies and shows for an extended period of time.",
    "Believe it or not, the LG Gram 17 (2021) will need charging eventually, and that’s where the superbly fast USB-C charging ports come in. Using the USB-C charger included with the laptop, the laptop fully charged from zero in just under a couple of hours when plugged into the mains."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and availability",
    "13": "Design",
    "25": "Performance",
    "31": "Battery life",
    "35": "Don't buy it if..."
  },
  "links": {
    "LG Gram 16 (2021)": "https://www.techradar.com/reviews/lg-gram-16-2021",
    "Gigabyte Aero 17": "https://www.techradar.com/reviews/gigabyte-aero-17-2021-review",
    "XMG Pro 17": "https://www.techradar.com/reviews/xmg-pro-17-2021-mobile-workstation"
  }
}