{
  "source": "https://www.techradar.com/reviews/team-t-force-delta-max",
  "title": "Team T-Force Delta Max review",
  "category": "computing",
  "updated": "2021-02-12T17:54:41Z",
  "author": "mark-knapp",
  "summary": "Can SATA SSDs improve? A little",
  "verdict": "There’s only so much you can get out of a SATA SSD, and the T-Force Delta Max actually delivers it with RGB lighting as the cherry on top. But, aesthetics aside, it’s value falls flat next to even modest PCIe NVMe drives.",
  "pros": [
    "Fun RGB",
    "Decent value",
    "Speedy"
  ],
  "cons": [
    "SATA speed limit",
    "Outclassed by PCIe"
  ],
  "article": [
    "The Team T-Force Delta Max is a SATA SSD joins the expansive ranks of fellow SATA SSDs with an RGB twist. At a price of $120 (about £90, AU$155) for a 1TB drive, it’s not making a name for itself in terms of value, but it’s certainly not the most expensive drive out there. It even manages to land near the $129 Samsung 870 QVO.",
    "What Team T-Force is offering with the Delta Max at this price is what helps it stand out. For one, the Delta Max is an SSD with TLC NAND rather than the QLC found in many budget drives. This TLC NAND tends to offer better endurance than competing QLC-based storage. That said, the 1TB T-Force Delta Max is offering an endurance rating of 360TBW (terabytes written), which isn’t higher than the QLC-based Samsung 870 QVO, though it is higher than the Intel 660p PCIe SSD.",
    "The T-Force Delta Max also has RGB, which usually comes with a premium, so it's a pleasure to see it remain reasonably priced compared to similar SATA SSDs. The RGB layer on the top of the Delta Max adds a little thickness, but it essentially adds a cluster of LEDs that create a glowing rectangle. The RGBs take power either from a USB cable or a 5V 3-pin aRGB header, both of which can connect to the drive’s micro USB port. The drive will display a color swirl by default, but connecting to an aRGB header allows for syncing with a wide variety of motherboard RGB software. Even with the lighting off, the drive has a rather pleasing mirror finish.",
    "The RGB lights are part of this drive’s gamer aesthetic but it’s nice to see that performance doesn’t take a back seat to style. Recent SATA drives push the limits of what the interface can even allow, and with sequential read speeds of 563MB/s, the Team T-Force Delta Max edges out the Samsung 860 Pro. Write speeds are a little slower, but the Delta Max makes up for that with random read and write speeds (the drive’s real worth in regular workloads) that beat the 860 Pro by close to 20MB/s and the 860 Evo by more than 100MB/s.",
    "The problem is that we’re not all limited to SATA drives. PCIe drives have come down in price considerably, enough to compete with SATA drives, and they almost unerringly offer higher speeds across the board. The Corsair MP400 is one of the stronger value PCIe SSDs, even tying the Delta Max for cost-per-gigabyte, and decimates Team’s offering in speed tests. It’s easily over four times as fast and more often closer to six times as fast. Never mind that PCIe 4.0 SSDs are also coming down in price with still higher speeds.",
    "Most of us probably have more SATA ports available inside our computers than we do PCIe NVMe slots, so there’s still good enough reason to pick up a SATA drive. We wouldn’t recommend the Delta Max over the Corsair MP400 or SK Hynix Gold P31 if you have the choice between PCIe and SATA SSDs. But, if you’re looking specifically for SATA, the Delta Max offers strong performance at a fair enough price and does it in style.",
    "You’re all about that RGB Sometimes having RGB alone is enough reason to buy one gadget over another. When building a computer with aesthetics in mind, having choice over lighting can be key, and the T-Force Delta Max can sync up with your computer’s lighting scheme using an ARGB header."
  ],
  "headers": {
    "6": "Buy it if…",
    "7": "Don’t buy it if…"
  },
  "links": {}
}