{
  "source": "https://www.techradar.com/reviews/backbone-one-ios-controller-review",
  "title": "Backbone One iOS controller review",
  "category": "gaming",
  "updated": "2021-12-08T11:28:23Z",
  "author": "gerald-lynch",
  "summary": "The very best way to play games on your iPhone",
  "verdict": "Compact, comfortable and classily executed, the Backbone One iOS controller wraps your iPhone in a premium gamepad shell that’s satisfying to play, well constructed and accompanied by a genuinely useful app.",
  "pros": [
    "Excellent in the hand",
    "Superb app",
    "Now fits newest, largest iPhones"
  ],
  "cons": [
    "Can’t accommodate cases",
    "Can’t automatically scan for games"
  ],
  "article": [
    "There’s never been a better time to get into mobile gaming. Whether you’re adventuring away in Genshin Impact, hunting the sus in Among Us, or headshotting to victory in Call of Duty Mobile, mobile games are now as detailed, social and competitive as their console and PC counterparts. Add into the mix services like Apple Arcade, and streaming platforms like Nvidia GeForce Now, Google Stadia and Xbox Game Pass Ultimate, and you’ve more choice than ever when it comes to taking games on the go with you.",
    "And so it's fitting that we finally have a mobile controller to match the growing ambitions of the mobile gaming scene. We’ve seen plenty of gaming clips, gamepads and cradles, but none have yet matched the finesse and finish of the Backbone One. Designed specifically for iPhones, it matches well-crafted hardware with that rarest of things – an accompanying app that’s actually useful. Altogether, the Backbone One is an essential purchase for the serious mobile gamer.",
    "The Backbone One is available now, and costs $99.99 / £99.99 / AU$179.99, and includes a three month trial of Xbox Game Pass Ultimate – the cloud-based portion of which can also be enjoyed on iPhone. That’s roughly what you’ll expect to pay for the similarly-excellent Razer Kishi – though it lacks the software chops that elevate the Backbone One.",
    "The Backbone One’s extendable / collapsible design makes it compatible with a wide range of iPhone devices, from the iPhone 6S through to the iPhone 13 and iPhone 13 Mini. It now can also be purchased with an adapter that’ll make it snugly fit the largest new iPhones – the iPhone 13 Pro and iPhone 13 Pro Max. Their larger camera modules necessitate the need for an additional rubber cradle that clips onto the Backbone One, which the company is now shipping out for free by request with each new order. Existing users can also order one.",
    "Refining a design style we’ve seen in other mobile gaming accessories, the Backbone One is an extendable, telescopic cradle for your iPhone. With a sliding and rigid backplate, you place your iPhone in its center, slotting the charging port into the Backbone One’s Lightning connector, giving traditional dual-stick-and-face-button control on either side of your horizontally-mounted smartphone.",
    "By using the Lightning connector, there’s no need to pair nor charge the Backbone One – your phone will recognise the controller automatically, while the Backbone will draw power from the phone itself. Power draw is minimal too – less than you’d see if you were using a cabled pair of headphones similarly using that Lightning port.",
    "If you’re an Xbox gamer, you’ll be familiar with the button and stick layout here. Analogue sticks (complete with clickable buttons) are positioned asymmetrically, with face buttons in an A, B, X,Y configuration. You’ll also find a D-Pad below the left analogue stick, shoulder and trigger buttons, and a selection of menu, options and screenshot buttons, as well as an orange ‘Backbone’ button that jumps back to the accompanying app’s interface - more on that in a bit.",
    "It’s a supremely comfortable device from our testing. The sticks have just the right amount of travel (though they are on the smaller side), with a responsively-springy D-Pad and satisfyingly-clicky buttons. There will be some difference from paired device to device of course, as the size of iPhones can vary. But we’ve been testing with a large iPhone 13 Pro, and have found it to be comfortable throughout. Our one concern would be the durability of the Lightning connector – unless you’re particularly nimble-fingered, the snap-back telescoping nature of the device can mean your phone may at times hold the connection at an awkward angle until you’ve had time to adjust it.",
    "But with Lightning connection pass-through charging of the phone, and the presence of a 3.5mm headphone jack on the bottom, it’s about as fully-featured as you could hope for.",
    "With an iPhone’s Lightning port automatically picking up connectivity to Backbone One, the team would have been forgiven for calling it a day there, with many an app’s auto-recognition of an accompanying controller doing the rest of the work for them when it came to button mapping and the like. But the Backbone’s accompanying app is the cherry on top of an already excellent package, creating a unified interface for your gaming apps, screen captures and social gaming options.",
    "With an Apple TV-like pane interface, Backbone One houses your iPhone gaming library in one place. Hit the Backbone button to jump from a game to this library for easy access. You do need to initially register each app with the controller to have them appear in the library by hitting the Backbone button once in game, but after that it’s all unified. It’s a shame this stage can’t be done automatically, but it’s likely an app security and permissions restriction at the OS level. But there’s a massive list of games that can be tied to the controller like this, and the Backbone app smartly offers recommendations based on what you’re playing.",
    "Also within the app is the ability to create lobbies and chat groups with fellow Backbone players, letting you jump into games together or share your screen at cool moments in your session. There’s also a built-in image and video capture and editing suite, letting you scrub and trim clips, with a built-in capture button letting you take snaps in-game with ease.",
    "For the most committed of Backbone players, the recently-announced Backbone+ introduced a few extra features too. A subscription service, it offers integrated Twitch streaming, high resolution captures, offers cabled connectivity for playing on iPad, Mac and Android devices over USB-C and a gaming mode to pause notifications while in game. All new users get a year’s access for free with each Backbone purchase. It’s not essential, but offers more flexibility to an already comprehensive experience."
  ],
  "headers": {
    "2": "Backbone One price, availability and compatibility",
    "4": "Hardware",
    "9": "Software",
    "13": "Don’t buy the Backbone One if…"
  },
  "links": {
    "Apple Arcade": "https://www.techradar.com/reviews/apple-arcade",
    "Nvidia GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Razer Kishi": "https://www.techradar.com/reviews/razer-kishi",
    "a massive list of games": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6150507349249626000&xs=1&url=https%3A%2F%2Fplaybackbone.com%2Fgames%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbackbone-one-ios-controller-review"
  }
}