{
  "source": "https://www.techradar.com/reviews/teclast-f7-plus-laptop",
  "title": "Teclast F7 Plus laptop review",
  "category": "computing",
  "updated": "2021-09-28T16:14:16Z",
  "author": "desire-athow",
  "summary": "Can the Chinese manufacturer come up trumps with the successor to the F7?",
  "verdict": "The Teclast F7 Plus is a tremendously capable laptop with an attractive price tag. It is fast, well designed, and boasts a good battery life along with a backlit keyboard that is enjoyable to use. What’s not to like? Definitely one of the best entry-level laptops out there for SMBs.",
  "pros": [
    "Excellent battery life",
    "Backlit keyboard",
    "Superb performance",
    "SSD rather than eMMC storage"
  ],
  "cons": [
    "Large touchpad can get in the way",
    "Proprietary power connector"
  ],
  "article": [
    "Say hello to the F7 Plus from Teclast, the follow up to the F7 which we reviewed back in June 2018. The F7 Plus comes with some notable improvements, but faces some stiff competition in the form of the Teclast F5, the Chuwi LapBook SE, the Jumper EZBook X1 and indeed the Jumper EZBook X4, and also, if your budget can extend far enough, the Teclast F6 Pro.",
    "As you might guess, Teclast is one of the more prolific Chinese laptop vendors on the market, offering no less than eight laptops and 2-in-1 devices in its portfolio at the time of going to press, alongside an equal amount of Android tablets. But fairly uniquely amongst manufacturers, it also sells solid-state drive and memory (RAM) products.",
    "The F7 Plus embraces the same design as the F7 (and reminds us of the Chuwi LapBook SE) which is itself loosely inspired by Apple’s minimalist, functional design, one that embraces curves and a brushed metallic finish as found on the older MacBook Air. Compared to the F7, the F7 Plus has a darker color scheme equivalent to Apple’s space grey (as opposed to silver), and the bezel is black as well.",
    "It also has gentler, rounder lines, a massive touchpad (78 x 125mm, roughly the size of two credit cards), a large hinge, and there’s no notch. The four rubber feet underneath are still present, and the inconspicuous Teclast logo from the F7 has been replaced by a more visible one that glows when powered up. It is a matter of personal taste, but we like the F7 Plus design better, bar the flashy logo.",
    "The ports and their arrangement remains the same: one USB 3.0 connector is on each side, along with a microHDMI and a proprietary power port on one side, and an audio socket and a microSD card slot on the other. As a 14-inch notebook, it doesn’t quite fit in the Dell XPS 13 or Huawei Matebook X category with its up to 16mm girth, a footprint bigger than an A4 sheet of paper, and a weight of 1.5kg.",
    "The F7 Plus stands out for providing an impressive overall combination of components rather than anything specific. It manages to pack the Intel Celeron N4100 CPU with 8GB of LPDDR4 system memory and a 128GB SSD (M.2 type) accessible via a flap under the laptop.",
    "The Gemini Lake processor is already 15 months old and while its TDP (the amount of heat it emits) is far lower than the Pentium J4105, we hope to see the latter power more laptops one day. The SSD is one of Teclast’s own, the NS550-2242, which is the same drive as used in the F7, and it allows this laptop to effortlessly pull ahead of other eMMC-equipped N4100 notebooks.",
    "The 14-inch IPS display has a Full HD resolution and is covered by two screen protectors. Make sure you remove both to improve your viewing experience.",
    "The battery is significantly smaller (37Whr versus 50Whr) than its predecessor, but is still powered by the same white 24W power supply unit. Teclast included four speakers to enhance the audio experience of the laptop, as well as a 2-megapixel webcam. Other features include 802.11ac Wi-Fi and Bluetooth 4.2.",
    "The keyboard has just a little bit of flex when used, and is logically laid out, spanning over 31cm. We like the fact that it sports an extra-large Escape key as well as dedicated ones for right click, home/end, and page up/page down.",
    "The typing experience is mundane with the key tiles being large enough to avoid mistakes, and with plenty of space between them. There’s no mushiness evident here, thankfully, and good travel and feedback ensures that you should be able to enjoy touch typing as much as we did on the F7 Plus.",
    "The touchpad is one of the biggest that we’ve come across, which is both a good and a bad thing – the negative aspect being that our palms touched it more often than we’d like when touch typing.",
    "The battery life has improved markedly from its predecessor, reaching 5 hours 29 minutes compared to 2 hours 2 minutes for the F7, despite the much smaller battery capacity. This leads us to believe that the model of the predecessor F7 we received for review was probably from a bad batch.",
    "Teclast opted for a glossy finish for the display despite the fact that the F7 Plus is a non-touchscreen model. It is bright under normal usage and, subjectively, has good color accuracy and viewing angles.",
    "Last but not least, we were pleasantly surprised by the audio capabilities of this laptop which is not as thin and boxy-sounding as some of its rivals.",
    "Teclast is not a well-known brand compared to the likes of Lenovo, Dell or HP, but we’d wager some money that if we blind-tested this laptop with notebooks from those established players, a lot of businesses wouldn’t be able to distinguish between entry-level models, which is where the F7 Plus sits with a sub-$400 price.",
    "It doesn’t have any specific business features like a fingerprint reader, a TPM chip or Windows 10 Pro, and as such, may struggle against established manufacturers if you have clear B2B requirements. But then again, none of them offer something as cheap as the F7 Plus.",
    "The Dell Inspiron 14 5481 convertible laptop comes closest at $480. It is a much more powerful model with a Core i3 CPU and 256GB PCIe SSD, but it only has an HD display, albeit a touchscreen one. The HP Pavilion x360 14t touch is also a touch-capable model which retails for $430, but it doesn’t have an SSD (though it’s available for an extra $160) or a Full HD display (available for $100 more).",
    "You get a free Teclast wireless mouse when you buy the F7 Plus, but that’s more of a sweetener than a deal-maker. However, Teclast’s current flagship model needs no crutch to establish itself as one of the contenders at the low-end of the market – if you can live with the caveats of buying from abroad.",
    "With a Full HD display, an excellent battery life, great performance levels – boosted by the SSD – plus a generous keyboard size, and sporting a surprisingly affordable price tag, the F7 Plus should be near the top of your buying short-list."
  ],
  "headers": {
    "2": "Design",
    "5": "Specifications",
    "9": "Usage",
    "15": "The business take",
    "18": "Final verdict"
  },
  "links": {
    "F7": "https://www.techradar.com/reviews/teclast-f7",
    "Teclast F5": "https://www.techradar.com/reviews/teclast-tbook-f5-2-in-1-convertible-laptop",
    "Chuwi LapBook SE": "https://www.techradar.com/reviews/chuwi-lapbook-se",
    "Jumper EZBook X1": "https://www.techradar.com/reviews/jumper-x1-convertible-2-in-1-laptop",
    "Jumper EZBook X4": "https://www.techradar.com/reviews/jumper-ezbook-x4",
    "Teclast F6 Pro": "https://www.techradar.com/reviews/teclast-f6-pro",
    "MacBook Air": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/13-inch-macbook-air-1158388/review",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "Huawei Matebook X": "https://www.techradar.com/reviews/huawei-matebook-x-review",
    "Dell Inspiron 14 5481": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1298538997804443000/https://www.dell.com/en-us/shop/dell-laptops/inspiron-14-5000-2-in-1/spd/inspiron-14-5481-2-in-1-laptop/FNCWBSV5015H",
    "HP Pavilion x360 14t touch": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1295933041592001300&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2Fpdp%2Fhp-pavilion-x360-convertible-laptop-14t-touch-3dr45av-1"
  }
}