{
  "source": "https://www.techradar.com/reviews/canvas-lms",
  "title": "Canvas LMS review",
  "category": "computing",
  "updated": "2021-10-18T15:30:05Z",
  "author": "jonas-p-demuro",
  "summary": "The digital classroom",
  "verdict": "Canvas LMS is a robust option to enhance teacher education to students in a remote or hybrid environment. Users will discover well rated apps, strong app integration, and use of SpeedGrader. We also appreciate the no cost teacher plan but wish the pricing for the upgraded institutional plans was not opaque.",
  "pros": [
    "Free teacher plan",
    "Free trial",
    "Highly rated smartphone apps",
    "Automated grading",
    "User support community"
  ],
  "cons": [
    "Opaque pricing",
    "No app dark mode",
    "Some sign on issues with apps",
    "Lacks gamification"
  ],
  "article": [
    "Back in 2008, two grad students started Instructure, which is home to Canvas LMS. By 2010, the platform was serving all of Utah’s public schools, and in 2014 the growth continued strong for this company to go international with offices in London, Sydney, Sao Paulo, and Budapest.",
    "Fast forward to today and with its impressive 99.99% uptime, Infrastructure serves over 6,000 worldwide global customers, and over 6 million users, with an over 90% satisfaction rate. Finally, it is impressive that 100% of Ivy League schools use Canvas LMS.",
    "Canvas LMS takes the approach that it doesn’t want to be an obstacle to the important task of teaching. Rather, it wants to be a partner that can facilitate it with a number of tools that together form the Canvas learning ecosystem via a 100% cloud based approach.",
    "Canvas takes integrations seriously, as no app lives on its own these days. Rather, Canvas embraces this important feature, as it can work well with literally hundreds of apps, including key ones such as Adobe Creative Cloud, Google Workspace and Microsoft Teams all from “One centralized learning hub.”",
    "Another useful feature helps teachers take the drudgery out of grading assignments. Thankfully, Canvas includes SpeedGrader that can reduce grading time by 50%.",
    "While gamification has become a sought after feature, Canvas lacks it so far. However, it does communication well, offering a range of options. This includes audio and video, messaging with individual students or the entire class, and other student collaboration tools.",
    "The pricing for Canvas LMS is unfortunately opaque for organizations. At least there is a free trial with a duration of two weeks. A custom quote will be given by Instructure with exchange of business credentials, along with company contact. We searched, and while we did not find hard pricing info, overall the consensus is that it is priced higher than other solutions in the space.",
    "We also note that Canvas LMS does provide a “Free-for-Teacher account” that while not fully functioning as a paid account does have the “Essential features and functionality” for education. It apparently is also free for students as well. Features provided include creation of assignments with quizzes, along with standards-based gradebooks, and mastery paths. It also has access to the suite of Canvas mobile apps, with 3rd party app integration.",
    "However, supposedly schools with multiple teachers that want to use the service will need to pay for a plan. Apparently this involves an implementation fee, along with a recurring subscription cost.",
    "Support for Canvas is better than some of its peers. Under the Contact Us section, the phone number for the direct corporate line is provided, along with a direct email. There is also a contact portal to establish contact. While it does not state specifically, the sense is that these methods are more for purchasing the product than getting help with it after.",
    "There is a dedicated section of the website for support, and while there is no direct phone number or email, there is a chat box provided. When we opened it, the virtual assistant indicated that it could be used for either a purchase, or for product support. There are also a number of FAQ’s to cover common issues, such as “How do I reset my password?” “How do I find my school login?” and “Where do I access parent resources?”",
    "Finally, there is an active forum, with over 1.4 million members, and almost 400k posts. There is a wealth of info here, with additional product guides, and a “Canvas Question Forum” to help with issues not covered in the FAQ.",
    "The Canvas LMS offers smartphone apps for both the iOS and Android platforms. Notably, they are both well rated.",
    "Starting on the iOS side of things, the Canvas Student app has a rating of 4.7 out of 5 stars, with a staggering 2.1 million ratings, and is also the #8 app in the category of Education. Many users praise that it is easier to use than the desktop version. There are some criticisms, such as the app backing out of the current screen if the user toggles to a different app, too many notifications when in a discussion, as users get them for all the posts on a topic, and not just for direct replies to only user posted content, and the usual glitches such as issues with initial app setup, or submitted work getting lost.",
    "Over on the Android side, the Canvas Student app is also well rated at 4.5 out of 5 stars, with a lower but still impressive 140k ratings. Here, there are also many satisfied users with 5 star reviews. However, some users point out that the app logs them out, and in some cases will not allow them to log back in, the lack of a dark mode, and too frequent crashes.",
    "The Canvas LMS offers plenty to see why it has enjoyed such a high level of popularity. Users will be pleased to see a free teacher tier offering, smartphone apps for both mobile platforms, and multiple communication tools. Some areas for improvement are noted to be some stability with the apps, the frustratingly opaque pricing for the paid tiers, and the lack of gamification. Overall, the free 30-day trial makes the Canvas LMS easy to try out and see if it meets your needs, as it has met millions of others worldwide."
  ],
  "headers": {
    "2": "Features",
    "6": "Plans and pricing",
    "9": "Support",
    "12": "User reviews",
    "15": "Final verdict"
  },
  "links": {
    "Canvas LMS": "https://www.instructure.com/product/higher-education/canvas-lms",
    "Adobe Creative Cloud": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}