{
  "source": "https://www.techradar.com/reviews/g-core",
  "title": "G-Core review",
  "category": "computing",
  "updated": "2021-02-24T05:11:14Z",
  "author": "mike-williams",
  "summary": "A polished, professional CDN - and it costs much less than you might expect",
  "verdict": "A low cost but capable CDN with a large network and some very advanced features.",
  "pros": [
    "Large network includes 30+ PoPs in Russia and CIS",
    "Well-designed web console",
    "Loads of features",
    "Great value"
  ],
  "cons": [
    "Average speed results at CDNPerf",
    "Basic support site",
    "Email support during business hours only with the starter plan",
    "Free trial required our payment details"
  ],
  "article": [
    "Founded in 2011 to support online gaming, Luxembourg-based G-Core Labs now offers powerful management hosting packages and a capable CDN.",
    "G-Core's network covers more than 75 locations across five continents, significantly more than most competitors. The company hasn't just crammed most of them into Europe and North America, either. Russia and CIS countries are covered by an exceptional 30+ points of presence (PoPs), there are seven in Asia, and others in Brazil, Istanbul, Dubai and Australia.",
    "The core service is a pull CDN, where G-Core automatically grabs files from your servers as they're required. A prefetching feature enables loading files before they're first requested, ensuring users always get the best possible performance. There's optional origin push support (G-Core stores all your content, reducing the load on your server) at extra cost.",
    "Security features include free shared SSL and Let's Encrypt certificates, and the option to use your own custom SSL certificate at no extra cost. There are plenty of content protection and access control settings, too - more on those in a moment.",
    "Elsewhere, a decent feature set includes support for HTTP/2 and IPv6. Custom HTTP rules allow you to define exactly how and when content is cached and served, an 'Instant Purge' (which actually takes 'several minutes') feature clears the cache whenever you like, and there's a REST API to help automate any complex tasks.",
    "It's easy to miss on the CDN area of the website, but G-Core also has an excellent media platform which supports live streaming up to 4K, VOD and transcoding, optionally with its own HTML5 media player.",
    "If you're curious about the fine details, click the Live Demo button on the website and you'll be taken to the CDN dashboard with a pre-prepared setup. You can't do much with this, it's just an interface demo, but it still gives you a chance to look at the various settings and options, and give you a basic feel for how the system works.",
    "G-Core CDN has a simple pricing structure where you pay a flat rate for the traffic you're using, with no variations for particular countries or continents.",
    "The Start plan gives you 1TB of traffic a month for 25 Euros ($30.25), or $0.03 per GB, with an overage charge of €0.025 per GB. There's no charge for requests unless you top the not unreasonable limit of a billion a month (and even if you do, overage is only €0.0075 per 10,000 extra requests.) Support is limited to email during business hours only (8-5.)",
    "The PRO 5TB plan includes 5TB traffic for 100 Euros ($121) a month, with an overage charge of €0.02, and adds 24/7 support by email, live chat and phone.",
    "As you'll guess, the PRO 10TB plan gets you 10TB traffic for 150 Euros ($181.50), with an overage charge of €0.015 per GB if you need more.",
    "As we write, signing up for the PRO 10TB plan also gets you 1TB of cloud storage for however long you have the contract, a very good deal (buy storage separately and you'll pay from 20 Euros a month for 250GB.)",
    "That looks like great value to us. Fastly, CloudFront and others charge from $0.12 per GB, four times G-Core's price, then add more for traffic from some locations, and charge extra for requests, too.",
    "G-Core hasn't finished yet, though. A 14-day trial comes with 300GB of free traffic, while a basic free plan gives you an ongoing 100GB a month. There's no support beyond the web knowledgebase, but it could still be a simple way to learn and master G-Core CDN's features.",
    "Getting started with G-Core took a little more work than expected. We first handed over our name, company and email address, and were prompted to choose a plan. We selected the Free option but still had to enter our payment details (card or PayPal.) Despite choosing PayPal, the site thanked us for adding a card, and demanded our physical address and phone number, too.",
    "That's important, as it allowed G-Core to begin charging our account as soon as the $50 credit ran out. If you're running your own trial on a busy website, that could be quicker than you think, so it's important to keep an eye on your account balance.",
    "G-Core's web dashboard is reasonably straightforward, as least by CDN standards. A large 'Create CDN Resource' button points you to your first step; the initial Create form is short, default settings are well chosen, and you could start by entering just your origin server (the source domain or IP address).",
    "There are other options for more experienced users. The CDN can pull content from a single source or a group, optionally with a custom port. It can connect only via HTTP, only via HTTPs, or choose automatically. You're able to use a shared SSL certificate, generate a free Let's Encrypt certificate, or add a standard or wildcard certificate of your own.",
    "The well-designed interface doesn't assume you're a CDN guru. Jargon is kept to the service basics, text boxes initially display example entries, and there's a caption under each setting to explain exactly what it does. It's both more powerful and usable than most of the competition.",
    "Creating the initial CDN resource is only the first step, but a Setup Instruction page gave an outline of what to do next: create a CNAME record, update our website code to point to the CDN (replace <img src=\"http://mydomain.com/path-to-image/image.jpg\" with <img src=\"http://cdn.mydomain.com/path-to-image/image.jpg\") and optionally integrate WordPress or other CMS with G-Core CDN.",
    "There's not exactly much depth - the entire page is under 250 words - but it's a useful starting point, and there's more guidance on the support site if (okay, when) you need it.",
    "G-Core's default CDN settings are a good place to start, but there are plenty more options available if you need them.",
    "These start with origin shielding, where you can specify a CDN server to handle requests in the event of a cache miss (a simple way to reduce the load on your origin server).",
    "Caching options (deciding when content expires) enable choosing whether this is controlled by your origin server or the CDN, and setting a cache expiry time (a lengthy 4 days by default, but can be set as low as 10 seconds, or to whatever custom value you like.)",
    "If your server provides no caching HTTP headers, G-Core will only cache content with 20x (successful) or 30x (redirect) HTTP codes, ignoring 40x and 50x error codes. That's another sensible default option, but the service also recognizes that you might want to serve stale cached content in some situations (if your origin server is down for some technical issue), and you can control that, too.",
    "Compression features range from GZip and Brotli support to a Large Files Delivery Optimization option which enables caching files larger than 10MB in separate parts. This can't work any bandwidth magic - overall download times remain similar, but it reduces the time for the user to see the first byte - but it's a welcome extra you won't often see elsewhere.",
    "A lengthy list of security tools allows you to control access by secure token, IP ranges, referrer, country, user agents and more. This gives you plenty of ways to limit hotlinking or other unwanted access to your content, and you can read a basic outline of what's available on the support site.",
    "If the menu settings don't quite give you what you need, G-Core's Rules dialog provides fine-tuned control which enables matching URLs with literal text or regular expressions, applying new caching rules, configuring access in various ways (country, IP address, referrer, secure token, user agent, HTTP method and more), adding custom headers, and generally taking full control of what's going on.",
    "This is by far the most complex set of functions G-Core has to offer. Rule creation isn't fully described in the support pages, and you'll need plenty of CDN and HTTP header experience to understand what's possible. But if that's not an issue, you'll find an enormous amount of power and flexibility available here.",
    "Once you're up and running, G-Core's Dashboard keeps you up-to-date with attractive reports on CDN traffic, bandwidth, response codes, cache hit ratio and requests per second. You can filter by time to view anything from the last hour to a full month, or you're able to view aggregated data over the last year.",
    "Advanced Analytics takes reporting even further, with details on cache use by location, directories, devices, browsers, operating systems and more.",
    "Support is available 24/7, including by live chat, email and ticket. We tried the chat service and had accurate and helpful replies to our questions within a couple of minutes, much better than we typically see elsewhere.",
    "Comparing CDNs is a challenge, as there are so many variables to consider: the numbers and locations of your visitors, the size and type of files, how often they're updated, the web applications you're using, and more. Change any element and you could get a different result.",
    "One simple approach is to just look at average CDN response time. It's only a single figure and can't begin to tell you the whole story, but it's still a useful metric which gives a basic idea of how fast a service may appear.",
    "As we write, CDNPerf ranks G-Core as 10th out of 20 for worldwide response times. While that might seem very ordinary, it's only fractionally behind some big-name services (Verizon, Akamai and Fastly are ranked 6, 7 and 9) and just ahead of a few others (Cloudflare, StackPath).",
    "Drilling down to continent-level performance revealed some interesting variations. G-Core rated a lower mid-range 12th in North America, 13th in Africa, 15th in Asia and Oceania, 16th in South America. But it made an impressive 5th place for response times in Europe, beaten only by 5centsCDN, Google Cloud, CloudFront and Azure.",
    "Overall, G-Core offers decent performance which is in line with many other enterprise CDNs. It's difficult to say precisely how it will work for you, as this depends on your setup and whether you can use advanced features like G-Core's rules, but we would recommend taking the free trial to see for yourself.",
    "G-Core is a quality service with a large network, a well-designed web dashboard and loads of useful reports and CDN analytics. We'd like to see more detailed help and guidance on the website, but there's no doubt you get a lot here for a very low price, and G-Core is a must for your CDN shortlist."
  ],
  "headers": {
    "7": "Pricing",
    "14": "Setup",
    "21": "Features",
    "32": "Performance",
    "37": "Final verdict"
  },
  "links": {
    "G-Core Labs": "https://gcore.lu/cdn/",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "SSL": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "media platform": "https://gcorelabs.com/streaming-platform/live-streaming/",
    "Start plan": "https://gcorelabs.com/pricing/",
    "PRO 5TB plan": "https://gcorelabs.com/pricing/",
    "PRO 10TB plan": "https://gcorelabs.com/pricing/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Fastly": "https://www.techradar.com/reviews/fastly",
    "CloudFront": "https://www.techradar.com/news/what-is-aws-cloudfront",
    "support site": "https://support.gcorelabs.com/hc/en-us/sections/115001163685-Security-",
    "CDNPerf": "https://www.cdnperf.com/",
    "Cloudflare": "https://www.techradar.com/reviews/cloudflare",
    "StackPath": "https://www.techradar.com/reviews/stackpath"
  }
}