{
  "source": "https://www.techradar.com/reviews/hp-envy-14-eb0000na",
  "title": "HP Envy 14-eb0000na review",
  "category": "computing",
  "updated": "2021-05-19T08:47:45Z",
  "author": "alex-cox",
  "summary": "Compact quality and professional power combined",
  "verdict": "HP's latest high-end laptop gives us very few reasons to fault it. It looks great, it performs well, and it'll likely stand the test of time.",
  "pros": [
    "Great understated design",
    "Plenty of power",
    "Excellent cooling"
  ],
  "cons": [
    "Slightly buggy touch screen",
    "Pretty pricey"
  ],
  "article": [
    "The HP Envy 14 is part of the new breed of productivity-focused laptops. It's not quite an ultrabook, being a little thicker and heavier than the sort of hardware you might expect to see in that category, although it successfully employs a little design trickery to make it look slimmer than it is. Whatever your chosen categorisation, it's delightfully compact and built perfectly for working hard and looking good doing it.",
    "The large 16:10 screen is an absolute highlight, and although it's not perfect - its touch screen is quick but we found it buggy in certain edge-case situations - it offers excellent contrast, with a pixel-dense 1920x1200 resolution that's a real joy to work with. The extra vertical height offers the Envy 14 plenty of chassis space on the keyboard side, which makes typing and using the trackpad all the more comfortable.",
    "The graphics, a mix of Intel's credible on-board Iris Xe and an Nvidia Max-Q GTX 1650 Ti, are powerful enough to suit just about any productivity task, and while we're not looking at something that'll happily keep up with today's AAA games, it'll work hard at a push. Intel's mobile processors currently face hot competition against the new breed of AMD Ryzen laptop chips, but we had no problem with the pep of the Intel Core i7-1165G7 on offer here.",
    "It generally runs very efficiently, clocking itself down for everyday desktop tasks, and pulling out a good burst of speed when it needs to. And while the CPU runs reasonably cool, we have to give credit to HP's chassis design where heat dissipation is concerned: this rarely even gets warm, and quickly returns to an ambient temperature when the hard work is over.",
    "There's a good amount of staying power in the Envy 14's battery, more than enough to see you through the day with average use. It's not a disappointment, certainly, though we're moving into an era where laptops are going to be able to offer more, and the Envy 14 just sits in the middle ground for now.",
    "For all its little flaws - and we're really struggling to find flaws to emphasise, you understand - the HP Envy 14 is a fantastic little laptop. It's reasonably expensive, positioning itself as an executive tool rather than a rank-and-file grafter, and we'd imagine the price at this spec will put a lot of people off considering you can find comparable specs elsewhere for less. But this is hardware we'd love to have hanging around, and a combination that really hits the mark.",
    "The HP Envy 14 falls into a category we're going to call 'premium but not so premium that your bank manager immediately arranges an intervention'; it's not cheap, as such, but it falls far closer to the 13-inch MacBook Pro street than it does the gated community of the ultra-premium 16-inch MacBook Pro.",
    "Specced as is, the US asking price is $1,749.99, though HP's own website lists it at $1,679.99 after a mysterious discount; in the UK, the same spec will set you back £1,399.99. We weren't able to find this exact configuration for sale in Australia, though a slightly scaled down version - the eb0007TX, which features a 512GB SSD rather than a full 1TB but matches the specs in other areas - is listed with a price of AU$2,999, again 'discounted' by HP to AU$2,399.",
    "Dial things back, remove the touch screen functionality and opt for on-board graphics and a Core i5 with 8GB RAM, and you can pick up what will still be a very reasonable 14-inch work machine for $999 - though only in the US. Elsewhere if you're looking to spend that sort of money you may be better off looking at HP's slightly-less-premium Pavilion 14 range, which tends to pack similar if not exactly equivalent hardware for closer to £700/AU$1,000.",
    "The HP Envy 14 is all class, but brutish when it wants to be. Its chassis is sleek, sexy, slightly adjusted from the previous generation but without getting distracted from the elegance that has made the Envy line so strong in the past.",
    "There's little in the way of distracting frippery beyond the optionally white-backlit keyboard, but it's not a cheap finish either. The tight bezels on the display, the precision-milled vents, and even the choice of keyboard font make sure of that. And it's solid; this is a laptop that doesn't budge, from its stiff central hinge to its low-flex glass-fronted screen to the cool aluminium chassis which exhibits basically no deck flex.",
    "Like many of the best Ultrabooks of this era - we're looking at you, Dell XPS 15 and LG Gram 16 - this owes a lot to the Mac. Not officially, of course (we've not had an HP engineer whisper covertly in our ear about the origins of its design inspiration or anything) but it's hard to argue that it's not Macish.",
    "Like earlier versions of the MacBook Air, the HP Envy 14 uses clever angles to maintain a slimline look while actually having a reasonably bulky belly; like the MacBook Pro, there's a very generous trackpad and a strong keyboard layout which make this perfect for peripheral-free work.",
    "Unlike modern Mac laptops, though, the Envy 14 features highly generous ventilation, with a huge grille allowing air in through the bottom of the case, a smaller dust-magnet grille above the keyboard, and a large exhaust hidden behind the screen hinge.",
    "Also unlike modern Macs, it's aware that you may sometimes want to use still-standard peripherals without a dongle, and features two Type-A USB ports alongside its ludicrously fast USB4 / Thunderbolt 4 / power delivery / DisplayPort Type-C socket. There's also a full-size HDMI 2.0 port, offering a bit of versatility if you're hot-desking.",
    "As comfortable as it'll be in your home, and the B&O tuned audio makes it reasonable (if not ideal) as a media laptop, the HP Envy 14 does feel very much like a professional laptop suitable for the office.",
    "Admittedly the two locations are not mutually exclusive these days, though it's worth noting that its metal chassis makes it reasonably heavy - not enough to stop you carrying it around with ease, but enough to fatigue an outstretched arm and certainly not the single kilo of the LG Gram.",
    "It opts for a 16:10 screen, which offers up plenty of desktop real estate; its additional vertical height also offers the base a little extra room for your wrists. Above the screen is a webcam with a tiny physical shutter, a very nice touch for the security-conscious, and the fingerprint reader is placed sensibly between the arrow keys and the Alt-Gr key so it's easily reached from anywhere.",
    "Basically, there's really very little about the Envy 14's design that we don't like. Could it be thinner? Possibly, though that would mean making unneeded sacrifices. Could it be flashier? Sure, but that would take away rather than add to its looks. This works.",
    "The HP Envy 14 does not simply coast on its looks. There generally comes a point during a laptop review period where the cracks begin to show, but the Envy 14 took an absolute desktop hammering without missing a beat.",
    "There's a significant power plant crammed inside, with enough speedy RAM, Optane-assisted storage and processor muscle to make it feel snappy and smooth whatever you throw at it. Intel's 11th generation seems to have thrown the cat amongst the pigeons; AMD Ryzen chips might still have the edge in terms of straight-up power, but this package is more than capable of desktop operation.",
    "It's not meant for much more, anyway, though the Max-Q GeForce GTX 1650 Ti inside defies its slightly crusty age by putting out a decent performance when it's called for.",
    "Overall - and let's stress the word overall - the 1,920 x 1,200 IPS screen is very good. Sure, it's not 4K, but it's perfectly sharp at the size, and its colour reproduction is absolutely superb.",
    "Day-to-day, for static creative or office tasks, it's a delight with great viewing angles. That said, we're not entirely sold on it. The screen is glassy and reflective, which looks beautiful but makes it a poor choice if you're stationed near a window.",
    "And we're not entirely sure that HP has yet ironed out all the bugs; running Eizo's suite of monitor tests revealed some slight banding in its lighting, a fairly slow response time and (more worryingly) a potential issue with the otherwise-brilliant touch screen.",
    "The Gamma test caused phantom taps to appear, skipping the test entirely. Perhaps the monitor didn't want us to see the results, because disabling touch to run the test showed that the screen struggled with certain aspects of the fine-pitched lines in the background, smearing the white of the left hand box across the screen.",
    "The keyboard and trackpad are responsive, the former offering a crisper-than-usual pop to its typing action, the latter managing solid palm detection and good multi-touch support. Even the touch screen (beyond that one unfortunate glitch) is a joy, fast enough that you have to look very hard to see any lag between finger and touch-trail.",
    "Our benchmark tests actually trend towards the upper end of average. Cinebench, in particular, was unable to take advantage of the potential of the Core i7-1165G7 because it is primarily a multi-core test, a situation for which Intel's mobile chips won't usually be allowed to hit the top end of their boost clocks - meaning this test pegged the chip at 2.8GHz rather than pulling out the maximum 4.7GHz.",
    "PCMark 10 fared better, and indeed pulled full power out of the chip for the majority of its runtime. Rest assured that real-world performance feels better than these numbers might suggest.",
    "It is worth mentioning the cooling performance at this point. It's good news: even when absolutely hammering the CPU and thoroughly stressing the GPU, we barely heard the fans spin up at all - and when they did spin, it was not for long. The HP Envy 14 seems to barely get warm, at least on top; the bottom portion of the chassis acts as a large heat sink (there's that Mac comparison again) and effectively dissipates excess heat.",
    "We found the battery life to be more than adequate, with the HP Envy 14 hanging on for a very creditable 8 hours 40 minutes in PCMark and drawing a solid 8 hours out of our movie-looping benchmark.",
    "The real test, though, is how things go in the real world, and we found this more than covered a full day's work of web browsing, writing and photo editing. It's a very credible battery - perhaps not up to the level of the low-powered titans out there, but entirely adequate for the task at hand."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and availability",
    "9": "Design",
    "19": "Performance",
    "30": "Battery life",
    "32": "Don't buy it if..."
  },
  "links": {
    "13-inch MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "16-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "LG Gram 16": "https://www.techradar.com/reviews/lg-gram-16-2021"
  }
}