{
  "source": "https://www.techradar.com/reviews/apple-tv-4k-2021",
  "title": "Apple TV 4K (2021) review",
  "category": "televisions",
  "updated": "2021-12-02T15:12:09Z",
  "author": "carrie-ann-skinner",
  "summary": "Apple’s latest streaming box is pricey, but does offer a few extra features",
  "verdict": "The Apple TV 4K (2021) is a slick streaming device, which can play 4K video in HDR and Dolby Vision, and supports high-frame-rate HDR to make fast action and sports look smooth and clear. The revamped Siri remote is a pleasure to use, and there are plenty of small but handy features, such as multi-user support and the ability to tweak your TV’s color balance automatically. There’s no denying it’s expensive, but it’s more than just a way to watch movies and TV shows, doubling up a smart home hub.",
  "pros": [
    "High-frame-rate HDR support",
    "Re-designed Siri remote",
    "Thread smart home technology built-in"
  ],
  "cons": [
    "Expensive",
    "Doesn’t work with Android"
  ],
  "article": [
    "It's been four years since Apple last revamped its streaming device, and you’d be forgiven for initially being underwhelmed – the Apple TV 4K (2021) looks identical to its predecessor, the Apple TV 4K (2017), and the tweaks and improvements it offers over its previous iteration are, on the face of it, minuscule. However, the interface is remarkably slick, and it finally brings more than just TV streaming to the table.",
    "So, what's the case for this pricey alternative? The Apple TV 4K (2021) is powered by the A12 Bionic processor, which is also found in the iPad and iPhone XS, rather than the A10X chip used in the previous iteration. This makes navigating the interface slightly speedier than before, and it also provides enough processing power to play high-frame-rate (60fps) HDR videos more smoothly than before.",
    "On top of that, there’s a handy color balance feature, which uses the light sensor in any iPhone that supports Face ID to check and tweak your TV’s color balance so it's more accurate and in line with industry standards, without you having to manually adjust the TV’s settings.",
    "Like its predecessor, the Apple TV 4K (2021) comes with either 32GB or 64GB of storage space – 32GB should be fine for most people unless you plan on downloading oodles of apps, games or movies and TV shows. As well as the streaming box itself, you’ll also get the revamped Siri remote.",
    "The remote supplied with the Apple TV 4K (2017) was a bone of contention, but the new-look Siri remote included here is thinner, and ditches the touch-sensitive trackpad in favor of a circular clickpad, which makes scrolling through the interface far easier.",
    "As well as allowing you to watch movies and shows from the major streaming services like Netflix, Amazon Prime, Disney Plus, and of course, Apple TV Plus, the Apple TV 4K (2021) also provides access to Apple’s services, from gaming platform Arcade to Apple Music and even Apple Fitness+.",
    "Apple’s voice-assistant, Siri, also comes built-in, and it’s an effective way to search for movies, TV shows and music, either by title or by genre, and you can use AirPlay to share everything from photos and video clips to presentations to your TV.",
    "The Apple TV 4K (2021) isn’t just for streaming – it can double as a HomeKit Hub, so you can control your smart home devices, even when you’re not at home – and if you have a HomeKit-enabled video doorbell or home security camera, you’ll be able to see a live feed on your TV. It also has Thread smart home technology built in, which enables your smart home gadgets from different manufacturers to work together more seamlessly.",
    "The Apple TV 4K (2021) doesn’t come cheap – in fact, it’s one of the priciest streamers on the market, costing around three times more than Roku’s 4K streaming stick+. For those that are deeply tied into the Apple Ecosystem, though, or who want to upgrade their streamer to provide the smoothest, sharpest 4K playback possible, it’s well worth investing in.",
    "The Apple TV 4K (2021) comes in two variants – a 32GB model priced at $179 / £169 / AU$249, and a 64GB model that will set you back $199 / £189 / AU$279.",
    "In the US and Australia, this is the same price as the current Apple TV 4K (2017) was when it launched; in the UK both versions are £10 cheaper. The new Siri Remote is also available to purchase separately for use with the previous-generation Apple TV 4K and Apple TV HD, for $59 / £55 / AU$59.",
    "The latest Apple TV 4K certainly isn’t the most compact TV streaming device on the market, but it’s not the bulkiest either – measuring 3.9 x 3.9 x 1.4 inches / 9.8 x 8.8 x 3.5cm (w x d x h) it can slot easily into your existing home cinema setup. It has a matt black top with a discreet Apple TV logo in the center, in the same glossy finish found on the sides. On the back are the power socket, a HDMI 2.1 port and an Ethernet socket, although it does also have Wi-Fi. However, unlike some of the best streaming devices, it doesn’t come bundled with a HDMI cable – you’ll need to provide this yourself. As we’ve already mentioned, the revamped Siri remote is one of the big draws of the new Apple TV 4K. The new Siri remote is thinner, but slightly heavier than before, and powered by a rechargeable battery. The circular clickpad at the top of the remote control works in the same way as the touch-sensitive trackpad, allowing you to swipe up, down and left to right to scroll through apps and settings on the Apple TV 4K. Pressing the clickpad will open apps, or pause/restart playback when you’re streaming TV shows, movies or music, while the outer ring can be used to scroll forwards and backwards during playback, enabling you to select a specific scene in a movie or show.",
    "For the first time, the Siri remote has a power button, so you can use it to switch the Apple TV 4K on or off, along with your TV too, and it also now features a back button and a mute button. The Siri button has now been moved to the right-hand edge of the remote.",
    "As we’ve mentioned, the Apple TV 4K (2021) is powered by the A12 Bionic chip, and supports both high-frame-rate HDR and Dolby Vision 4K format, along with Dolby Atmos audio.",
    "Like most Apple devices, the Apple TV 4K proved extremely easy to set up, and it was recognized by our iPhone as soon as we plugged it in. The iPhone took care of transferring our Apple ID and password to the Apple TV 4K automatically, and we were also impressed by the One Home Screen feature, which mirrors the apps and layout of any existing Apple TV devices in your home.",
    "The overall performance of the Apple TV 4K (2021) was very slick, with no lag when loading or switching apps, and we found Siri was effective at searching for content, even when a query contained multiple parameters – when we asked for comedy movies for children, a number of suitable films, including Paddington 2 and Finding Dory, were displayed at the bottom of the screen within seconds.",
    "When it comes to playing high-frame-rate HDR, there’s currently a limited amount of compatible content available, but we were able to see a clear difference when watching Red Bull TV on the Apple TV 4K (2021) compared to the Apple TV 4K (2017). On the newest Apple TV, Red Bull Straight Rhythm – a fast-paced motorbike supercross event – looked smooth and clear, while was slightly jittery and not as detailed when viewed on the previous iteration.",
    "We found the color balance feature simple to use – after holding our iPhone close to our TV screen with the camera pointed towards it, with the on-screen image cycling through a range of colors, we were presented with a new color profile that was less vivid and slightly more subdued. It’s easy to switch between your original color settings and the new balanced look using the on-screen options.",
    "We were impressed with the redesigned Siri remote: we found the clickpad to be far more accurate than the previous model when it came to scrolling through apps and shows, and were also impressed that the TV could be switched off at the same time as the Apple TV 4K (2021), which means fewer remotes cluttering up the coffee table. The extra weight – 2.25oz / 64g compared to 1.5oz / 45g – is welcome, giving the feel of a more premium build quality.",
    "There are plenty of small but extremely handy features built into the Apple TV 4K (2021) too. For example, if you need to enter text on the Apple TV 4K (2021), such as a password, you can type it on your iPhone rather than messing about trying to select on-screen characters with the remote. You can connect two pairs of Apple AirPods at the same time for private listening, and there’s also multi-user support, so family members with their own AppleID can be added to the device and see their own personalized app, video and music collections.",
    "These features are also available on the Apple TV 4K (2017), and it’s the close attention to detail that makes any iteration of Apple’s streaming box a real pleasure to use.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Apple TV 4K (2021) price and availability",
    "11": "Design",
    "14": "Performance",
    "21": "Don't buy it if..."
  },
  "links": {
    "streaming device": "https://www.techradar.com/best/streaming-device",
    "Apple TV 4K (2017)": "https://www.techradar.com/reviews/apple-tv-4k",
    "iPad": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "was a bone of contention": "https://www.techradar.com/news/what-was-so-wrong-with-the-apple-tv-4k-remote",
    "Thread smart home technology": "https://www.techradar.com/news/what-is-thread-and-why-do-your-smart-home-gadgets-need-it",
    "Roku’s 4K streaming stick+": "https://www.techradar.com/reviews/roku-streaming-stick",
    "new Siri Remote": "https://www.techradar.com/news/what-was-so-wrong-with-the-apple-tv-4k-remote",
    "best streaming devices": "https://www.techradar.com/best/streaming-device",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review"
  }
}