{
  "source": "https://www.techradar.com/reviews/doogee-s95-pro-rugged-smartphone",
  "title": "Doogee S95 Pro rugged smartphone review",
  "category": "phones",
  "updated": "2021-01-26T11:11:49Z",
  "author": "desire-athow",
  "summary": "This rugged handset has almost everything you could hope for",
  "verdict": "Doogee delivers yet another great piece of engineering with the S95 Pro, the fastest non-Qualcomm ruggedized smartphone to come through our labs. It has almost everything you could ask from a solid, waterproof smartphone at a very palatable price.",
  "pros": [
    "Two SIM trays",
    "Good performance",
    "Useful addons",
    "Great cameras"
  ],
  "cons": [
    "Fingerprint magnet",
    "Design is still a bit meh"
  ],
  "article": [
    "We have entered the golden age of ruggedized smartphones. Heated competition between the smaller players and the realization that bog-standard smartphones are often too fragile is driving increased interest in the space.",
    "With that in mind, meet the S95 Pro, a top of the range smartphone from prolific rugged device manufacturer Doogee.",
    "The design language of Doogee has evolved over the past three years into something more refined, through hundreds of man hours of research and development. You can check past reviews of the T5, the S50, S60, S70, S80 and S90 to see how that has changed.",
    "It weighs 284g without any accessories and the battery pack bumps it to 390g. Its overall size, 167 x 77 x 16mm, is significant without being overwhelming. Put it this way, it feels reassuringly heavy and chunky thanks to a metal frame covered with what Doogee’s marketing department calls “industry-leading rugged rubber sheet”",
    "There are two SIM trays, a first in a smartphone to our knowledge, the second one can take either microSD card or a second SIM. Having two of those make it a bit less cumbersome to swap cards or SIM.",
    "There’s a dedicated SOS button on the left edge and a power off button, a fingerprint sensor and a volume rocker on the opposite edge. On the back are located three camera sensors plus a lonely LED flash. The Type-C connector at the bottom is covered with a rubber flap, a hint that this phone is IP68/IP69K and MIL-STD810G tested.",
    "The S95 Pro uses a Mediatek Helio P90 chipset, which competes squarely in the mid-range battleground, facing the Qualcomm Snapdragon 710. It is paired with 8GB of system memory, likely to be LPDDR4X type and 128GB Samsung UFS 2.0 storage. Not as fast as SSD in laptops but still far faster than the usual eMMC found elsewhere.",
    "Like its predecessor, Doogee’s new flagship product supports wireless charging (up to 10W). This one however significantly improves its photo credentials thanks to the presence of no less than four camera sensors including the popular Sony IMX586, a 48-megapixel one, which is complemented by two other 8-megapixel sensors. Also in the front is a 16-megapixel front facing selfie camera.",
    "Other noteworthy features include NFC, a 5150mAh battery, a 6.3-inch screen with a 2160 x 1080 pixel resolution and Corning Gorilla Glass 5 overlay; sadly no oleophobic coating here. The battery pack has a 3500mAh capacity and magnetically attaches to the phone; the speaker module has a stand and two 27mm speakers. It has a separate battery that can last for 10 hours and, unlike the battery pack, will cover the phone’s camera.",
    "Note that these accessories are not waterproof or shock resistant; dropping is likely to cause damage.",
    "The S95 Pro uses a stock version of Android 9.0 Pie; there were no updates available at the time of writing; the latest update dates from October 22, 2019 with the September 2019 security patch.",
    "Featurewise, you get a useful SOS alert call setup, DuraSpeed (which limits the impact of background apps) plus the ubiquitous toolbag, a set of apps that can be found in most Mediatek-based rugged smartphones. Two features that stand out are the sound meter and the barometer.",
    "When it comes to overall performance, the S95 Pro is by far the most powerful Mediatek-based rugged smartphones we’ve ever tested but it still lags the Snapdragon 845 found in the AGM X3. It still delivers some great numbers both when it comes to general graphics performance (thanks to the PowerVR GPU).",
    "Ditto for the storage subsystem which fared much better than eMMC storage. The adoption of the UFS protocol means faster and more consistent performance as the benchmark numbers have shown.",
    "The BV9800 Pro from Blackview is probably the one rugged smartphone to beat at the time of writing. Blackview took the unusual route of indiegogo to make its project become true. With the backing of more than 2,700 investors and more than $1.1 million investment, the 9800 Pro, which should sell for about $500, has less memory (6GB) and a weaker CPU (Helio P70) but a much bigger battery and a unique FLIR Lepton Thermal Imaging camera.",
    "Then there’s the Ulefone Armor 7 which matches the S95 Pro (same price, same CPU, same memory, same camera, same storage capacity) but adds a bigger battery, UV sensor and a heartbeat monitor. Unlike the S95 Pro though, it cannot take extra accessories.",
    "The S95 Pro has fundamentally reshuffled the very top of the rugged smartphone market. It is fast, it has plenty of storage and memory and a useful set of (optional) accessories plus very solid photographic credentials.",
    "With an affordable price tag and few minor letdowns, the S95 Pro will provide a great experience for those looking for a great all-rounder that can perform everywhere and anywhere, regardless of the weather and location.",
    "Doogee has hit a sweet spot but watch out for models from Blackview and Ulefone that are set to launch soon. And check out the dark horse that is AGM Mobile when it announces its annual flagship model."
  ],
  "headers": {
    "2": "Design",
    "6": "Hardware",
    "10": "In use and performance",
    "14": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "ruggedized smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "T5": "https://www.techradar.com/reviews/doogee-t5",
    "S60": "https://www.techradar.com/reviews/doogee-s60",
    "S70": "https://www.techradar.com/reviews/doogee-s70",
    "S80": "https://www.techradar.com/reviews/dooge-s80-rugged-smartphone",
    "S90": "https://www.techradar.com/reviews/doogee-s90-rugged-smartphone",
    "AGM X3": "https://www.techradar.com/reviews/agm-x3-rugged-smartphone",
    "BV9800 Pro from Blackview": "https://www.techradar.com/news/we-tracked-down-the-cheapest-predator-heat-seeking-smartphone",
    "Ulefone Armor 7": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-2691711066104365600&p=https%3A%2F%2Fwww.gearbest.com%2Fcell-phones%2Fpp_009399745232.html%3Fwid%3D1349303"
  }
}