{
  "source": "https://www.techradar.com/reviews/g-data-antivirus-solutions",
  "title": "G Data Antivirus solutions review",
  "category": "computing",
  "updated": "2021-01-05T10:50:35Z",
  "author": "mike-williams",
  "summary": "Multiplatform antivirus tech from Germany",
  "verdict": "G Data Antivirus isn't a bad product, but it has a lot of issues, and there are no stand-out features to justify picking it ahead of the top competition.",
  "pros": [
    "Capable spam filter",
    "Flexible licenses support 1-10 devices",
    "Blocked our custom ransomware (eventually)",
    "Free trial"
  ],
  "cons": [
    "Mixed results in lab tests",
    "Anti-ransomware caused problems during testing",
    "Above average impact on system performance",
    "Short on features"
  ],
  "article": [
    "German antivirus company G Data takes a traditional three-tier approach to its PC range: a basic antivirus product, a starter suite with a firewall and parental controls, and a do-everything package which throws in everything the company has to offer.",
    "The starter G Data Antivirus Windows is mostly about squashing malware, with just a handful of extras: a spam filter, PC startup manager and a 'USB Keyboard Guard' to 'protect you against manipulated USB devices that pretend to be keyboards.'",
    "Prices start at $30 for a one year, one device license. Conveniently, you can add more devices as required up to a maximum of ten (which costs $100 annually.)",
    "That's not bad for a handful of devices, but gets relatively expensive as you cover more. Bitdefender Antivirus Plus has more features and costs $20 to cover one device for a year, for instance, but is $40 on renewal. But a ten-device license is only $80, and you can extend that to three years for only $180, just $6 per device per year.",
    "G Data Internet Security ramps up your PC protection with a firewall, parental controls and online backup. It also adds a Mac app with antivirus and browsing protection, and an Android edition with antivirus, an integrated browser, device tracking and an app locker.",
    "Despite all the extra functionality, Internet Security isn't much more expensive than Antivirus, at $40 to cover a single device for a year, $56 to cover three, or $112 for ten. (You want to protect a different number of devices? That's fine, we've only quoted these as examples - G Data allows you to choose any number between one and ten.)",
    "Again, that's decent value if you're just covering one or two devices, but not such a good deal if you add more. Bitdefender Internet Security is an annual $60 to protect a single device (after its first-year $20), for instance, but a ten-device license is just $90, cheaper than G Data Antivirus.",
    "G Data Total Security adds file encryption, a password manager and PC optimizer, along with access control to protect your PC from unauthorized devices (connecting an unapproved USB key, for instance.)",
    "Pricing is much the same as the rest of the range. Single device licenses start at a reasonable $50 per year, but the value falls away as you add more, up to $122 for ten devices. Bitdefender Total Security covers ten devices for $45 in year one, $90 on renewal, and you can save even more with two or three-year terms.",
    "G Data Antivirus installed easily, but grabbed an above average 1.7GB of storage space, and equipped our system with three new Windows services and a couple of background processes to handle the interface.",
    "We ran the top benchmark PCMark Professional before and after installation to detect any performance hit, and found our score dropped by 4.2%. That might not be enough to notice, but it's still more than we've seen with vendors like Trend Micro (4%), Avast (3.2%), Avira (1.7%), Bitdefender (1%) and Kaspersky (0.6%.)",
    "AV-Comparatives' October 2020 Performance Test considered more speed factors than us, but also found G Data had more performance impact than most, placing the company 13th out of 17.",
    "Malware sometimes tries to disable security software before attempting to infect a system, so a good antivirus must protect itself from attack. We used various tricks to disable G Data Antivirus, including deleting files, killing processes, stopping services and unloading drivers, but well-chosen permissions ensured we couldn't affect the core G Data engine.",
    "G Data Antivirus has a cluttered interface, absolutely crammed with options and security status information. There's some value in, say, making it clear that your real-time protection is currently active, but is it really important to know how many minutes there are until your next virus signature update?",
    "Clicking the Scan button gives you many more options, and again they're a little more complicated than usual. 'Check computer' is the usual full system scan, but rather than having a simple Quick Scan button, G Data has several more specific options: 'Check memory and Autostart', 'Check directories/ files', 'Check removable media' and 'Check for rootkits.'",
    "Even these aren't as clearly described as we'd like. Worried about rootkits, for instance? 'Check for rootkits' isn't your only option; it turns out the 'Check memory and Autostart' scan looks for them, too.",
    "Our scanning time checks got off to a good start, with G Data Antivirus taking only 18 minutes to inspect 50GB of executables, less than half Bitdefender's time. But Bitdefender's second scan time dropped to 27 seconds, as it only checks new and changed files by default; G Data Antivirus took 18 minutes on the second and third scans, too.",
    "We thought the 'Check memory and Autostart' option might be the equivalent of a Quick Scan, but no; partly because of the rootkit check, this took 24 minutes, longer than our regular test scan.",
    "We could at least create custom scheduled scans, allowing G Data to automatically check our system at set times. And the package has good support for simultaneous scans, too. We launched a full system scan, then right clicked a USB key in Explorer and selected 'Check for viruses.' Many antiviruses ask you to wait until the first scan is complete, but G Data just launched a second scan, displaying its results in a new window.",
    "AV-Comparatives' Real-World Protection Test is a tough benchmark which compares how 17 top antivirus engines handle the very latest malware.",
    "The July-October results placed G Data in a mid-range 9th place with a protection rate of 99.6%. That's not great, especially when Panda, F-Secure and Trend Micro blocked 100% of threats, but it still beat NortonLifeLock (99.5%), ESET and Avira (both 99.3%.)",
    "AV-Test's latest Home User Windows found G Data blocked 100% of threats, giving it a maximum 6/6 score for protection, but the company doesn't hit that mark in every test. G Data missed the top spot in two out of six tests over the past year. Bitdefender, F-Secure and Trend Micro all scored a perfect six every time, and even Avast Free Antivirus only missed getting a maximum protection score in a single test.",
    "We ran a few behavioral tests of our own, with executables which exploited common Windows tools to try and download malicious files.",
    "These are all very common malware tricks, but G Data didn't seem concerned. It allowed the behavior to continue, and although it blocked the files based on the URL or a file scan, our test executables remained running.",
    "Bitdefender and Kaspersky protected us at an earlier stage, detecting our dubious app actions and killing some one of them, while Trend Micro's ultra-aggressive engine destroyed all our test threats. That extra sensitivity is more likely to keep you safe from even the very latest threats, though with a down side: there's a greater chance of blocking legitimate apps, too.",
    "G Data claims its products are particularly tough on anti-ransomware, detecting and blocking threats based on behavior alone. We ran our own custom ransomware on the review system to find out more.",
    "Nothing seemed to happen at first, then our desktop froze for several minutes. The mouse cursor moved, but application windows didn't respond, and we couldn't switch between them. Eventually, an alert appeared warning of ransomware-like activity, displaying a list of processes, and asking if we'd like the actions to be blocked or allowed.",
    "We chose the Block option, and our system went back to its mostly disabled state. We tried various options without success, then rebooted our system after 30 minutes, and it was usable again.",
    "Checking the logs, G Data Antivirus had blocked many system and application processes, as well as killing the ransomware. There may be good security reasons for that in a few situations - if malware has injected malicious code into a legitimate process, for instance - but in our case it caused major problems.",
    "G Data had at least detected, killed and quarantined our simulator, but not before it encrypted 406 files. That's better than missing it entirely, but Norton spotted the threat after our threat had trashed 57 files, Bitdefender took only 10, Kaspersky 5, and Trend Micro only needed 3. Those products displayed their alerts far more quickly, without locking up our system. Best of all, Bitdefender, Kaspersky and Trend Micro all recovered every encrypted file, and we lost no data at all.",
    "G Data Antivirus' web protection detects and blocks access to malicious links via Chrome, Firefox and Edge browser extensions, and at the network level.",
    "The feature worked as advertised for us, sometimes displaying alerts in the browser window, and sometimes in G Data's own alerts.",
    "There is no immediate browser option to whitelist falsely flagged sites. That's a little inconvenient, but it's safer, and you can manually add legitimate sites to an Exceptions list in Settings.",
    "It's barely mentioned on the website, but G Data Antivirus includes a spam filter which integrated neatly with our Outlook setup.",
    "We ran a very, very quick test comparing its performance to the commercial SPAMfighter, and G Data scored very well. Out of 42 test messages, SPAMfighter picked out the six spam emails, G Data missed just one, and neither falsely flagged a single legitimate message.",
    "Performance might vary depending on the type of emails you receive, but the filter is surprisingly configurable, and you may be able to improve results by playing around its settings.",
    "G Data Antivirus includes banking protection, but this isn't in the form of a hardened browser, such as Bitdefender's Safepay. Instead, G Data says BankGuard 'secures your banking transactions' by 'checking that the network libraries used are genuine.' We're happy to accept it really is doing this, but have no way to measure how effective it might be.",
    "The package also includes keylogger protection, but this isn't quite as useful as it seems. By default, it only works with a predefined list of apps, mostly browsers and Bitcoin wallets. This looks a little out of date, for instance including Internet Explorer but not Edge. And although you can manually add other apps, G Data warns 'some programs are incompatible with keylogger protection', and you might run into 'problems.' That's presumably why it doesn't try to protect everything, but it makes us a little uncomfortable about using the feature.",
    "G Data's USB Keyboard Guard looks out for malicious USB devices which pose as a keyboard to steal your personal data. If you connect a new keyboard to your system, you'll receive a warning, and can decide whether you want to allow the device.",
    "Finally, a simple Autostart Manager enables controlling the apps configured to launch when Windows starts. If one app is making heavy demands on your system and extending boot time, you can delay its launch time by a few minutes (from one to ten.) It'll still run, but with less fighting over resources at boot time, your desktop should appear a little quicker.",
    "This is a useful feature which goes a step beyond the enable/disable functionality you get in Windows 10 Task Manager. It's not likely to make a significant difference to most systems, though, and there are plenty of more capable startup managers available for free.",
    "While G Data Antivirus has some good points, they're almost always balanced out by a negative. Good lab results here, not so great there; blocked our custom ransomware, locked up our system while doing it; fair value for one device, less so as you add more. If its feature set is exactly what you need, take a look, but most people will be better off with something else.",
    "G Data's mid-range suite builds on the malware-hunting abilities of G Data Antivirus by adding a firewall, parental controls and online backup, along with new apps for Android and Mac.",
    "Prices start at $40 to cover one device for a year, reasonable for a suite. Bitdefender's equivalent Internet Security license is $25 for year one, $60 on renewal; Norton AntiVirus Plus is a similar $20 in year one, $60 on renewal.",
    "G Data looks good on prices, then, but what exactly are you getting for your money? Let's see.",
    "The Internet Security firewall does its best to stay out of your way, and that's probably a smart decision. Sensible defaults mean the firewall stealths your ports and blocks simple network attacks out of the box, and won't hassle you with technical questions about whether process A can communicate using protocol B and port C with the destination Z.",
    "If the firewall does cause you any problems, you can disable it from the main dashboard for anything from five minutes to eight hours (or even permanently, if you can think of a good reason to do that.)",
    "The Settings box enables choosing one of four firewall security levels - Maximum, High, Standard, Low - and also gives you the option to disable it entirely.",
    "If you know what you're doing then you can turn off all this automation and take more in-depth control of how the firewall works, including manually approving which processes are allowed online, and which aren't.",
    "We tried that, and quickly regretted it as the alerts piled up. There's no sign of intelligence here, and the firewall prompted us for all kinds of core system and application components it should have known were trustworthy, or at least could have told us that (Windows' SmartScreen.exe, for instance.)",
    "G Data's firewall protects you from the most common networking risks, and deserves some credit for trying not to scare off novice users. But it's also no match for the smarter technology you'll get with Bitdefender and NortonLifeLock.",
    "G Data Internet Security includes a backup tool which archives your chosen files to the cloud, optionally including Dropbox or Google Drive.",
    "You're able to choose your source files, then customize it with various settings, including password protection, and optionally schedule your job to run automatically.",
    "Some features are disabled. There are options to burn backups to CD/ DVD or create local backups, for instance, but they're only available in the high-end G Data Total Security suite.",
    "The real problem came when we tried to authorize access to our Gmail account. G Data opened Google's login page in its own browser window, rather than the default, and when we entered our email address, Google warned: 'Can't sign you in. This browser or app may not be secure.'",
    "Would Dropbox be any different? Only the wording of the error message: 'Upgrade your browser to use Dropbox.'",
    "Maybe we were unlucky. Perhaps you'd get better results on your system. But if you're looking for an antivirus with simple backups, maybe try Norton AntiVirus Plus. It has a better firewall than G Data, comes with 2GB of free storage space, and upgrading to one of the Norton 360 suites gets you more.",
    "G Data's Parental Controls allow you to manage some of what your kids are able to do online. At least, that's the idea.",
    "This includes basic features including limiting access to web content by type, and restricting both internet and device usage by time. But if you're hoping for clever location-based restrictions, intelligent monitoring of social media feeds or anything else even faintly advanced, get ready for disappointment.",
    "Even the limited features on offer seem a little basic. The content blocking system starts with only five main categories, for instance: Drugs, Hackers, Violence, Extremist and Pornography. And even those only work with HTTP sites. If your child can find a porn site using HTTPS, G Data won't be able to do anything about it.",
    "The Parental Controls system has a sort-of solution which might work for very young children. You could block all the regular categories, and all HTTPS sites as well, but then whitelist particular types of safe content; 'Nature, animals and plants for Kids', say, or 'Encyclopedias, Lexicons, Almanacs, Dictionaries.'",
    "Even if you can live with that, the module has problems. Its filtering doesn't always block unsuitable sites, for instance, and scheduling isn't as flexible as it could be, with a minimum granularity of 30 minutes, starting and ending at x:00 or x:30.",
    "Put it all together, and even if your needs are simple, trying to make G Data's Parental Controls deliver will probably be more hassle than it's worth. If protecting your kids is top of your priority list, you'll be better off elsewhere.",
    "G Data Internet Security looks good on the comparison table with its bonus firewall, parental controls and backup tool, but none of these matches the top competition. Norton AntiVirus Plus includes all those features, and they're better implemented; even if you like G Data, we'd recommend taking a trial of each and comparing what you see.",
    "G Data Total Security is the most powerful product in G Data's Windows security range.",
    "The suite extends Internet Security's backup tool with the ability to save archives locally, as well as to the cloud. Extras include a password manager, secure encrypted storage, a Tuner to optimize performance and your security settings, and an access control system enables defining which devices are allowed to connect to your PC. (You could approve your own personal USB keys, for instance, but deny everything else.)",
    "It's not the most compelling of feature lists, but then it's not exactly expensive, either. A one year, one device license costs $50, so the extras are costing you only $10. Seems reasonable to us, but let's take a look at what you're getting for this small price premium.",
    "G Data's cloud backup didn't work with Internet Security, and it failed here, too. But at least we could now create local backups, or burn them to DVD, and both features worked as advertised.",
    "There's plenty of fine-tuning settings and controls, too, including some you might not expect. How about checking files for viruses before they're archived, for instance? A very sensible idea, but not one you'll see with most backup tools.",
    "Decent scheduling features include the ability to automatically run backups daily, weekly or monthly. The app supports creating incremental or differential backups, you can decide how many old backups you'd like to keep, and an option to 'not run on batteries' will help preserve battery life.",
    "Our cloud hassles are a major problem, then, but the app does a much better job with local backups.",
    "G Data's Password Manager is a very simple tool which enables securely storing your logins on the local device. Yes, unbelievably, just the local device; it won't synchronize them with anything else.",
    "The Total Security interface has links to install extensions for Chrome, Firefox, and Internet Explorer. There's no Edge support, which told us this hasn't been updated for a while; a quick check of the Chrome extension page showed it was last updated in December 2016; and the Firefox link got us a 'page not found' error. Looks like this is The Password Manager That Time Forgot.",
    "In the unlikely event that you install the Chrome extension, you'll find there's no import option beyond a simple CSV file; G Data hopes you'll manually enter all your existing passwords, or maybe that it'll capture them as you visit individual sites.",
    "It's really a waste of time, though, and you'd be better off almost anywhere else. Norton, Avira, Kaspersky and Bitdefender all have products with password managers, some specialist password managers have free versions (Dashlane) and they're a vast improvement on G Data's offering.",
    "The G Data Encryption feature supports creating multiple encrypted 'safes' to securely store all your most important documents.",
    "Setup starts by choosing the maximum size of your safe, and defining one or more passwords.",
    "Use the password to open the safe, and G Data mounts it as a virtual drive on your system. You can save confidential documents to it, just as you would with any other drive, except here they're saved in an encrypted form.",
    "Close the drive when you're done, the virtual drive is removed from Windows, and anyone else who accesses your PC won't even realize it's there. Even if they spot it, no-one's going to access your files unless they know the password.",
    "This could be handy for some users, but it didn't work for us on one device, complaining 'Safe formatting failed' and refusing to create a safe.",
    "G Data's Tuner screen has a lengthy list of suggested tweaks and optimizations for your PC.",
    "There are options to delete browser histories, defragment your drives, harden Windows privacy settings and more. You can run these on demand, or schedule them to run automatically.",
    "This all seemed like a good idea, until we looked more closely and realized how dated these options were. No Edge options, again - Internet Explorer only. An 'enable attachment security' feature for 'Outlook, Outlook Express, Windows Mail, Windows Live Mail.' The ability to clean Google Picasa thumbnails (Picasa was discontinued in 2016.)",
    "Even if all these settings made great choices in 2016, we wouldn't like to bet they'll do so now, and the feature is best ignored.",
    "The Tuner does have a more useful tool in its Browser Extension Manager. This displayed our Chrome and Firefox extensions, and allowed us to enable, disable or remove them. You could do the same from within Chrome and Firefox, or course, but it's more convenient to do it from a single dashboard.",
    "G Data Total Security's most unusual feature is its Device Control panel, where you're able to create rules which define which devices can be connected to your PC.",
    "A Settings panel enables choosing the types of devices you'd like to restrict: USB sticks, CD/DVD drives, webcams and more. Choose a device type and you're able to apply various restrictions.",
    "You can opt to create rules based on users. For example, you could block USB key use entirely for some user accounts, or give them read-only access.",
    "Your other option is to create rules based on specific devices. Again, you could block access to a particular USB key, or make it read-only by everyone but your user account.",
    "There are limits to what you can do with this type of feature. Access Control might stop a user accessing a USB on one system, for instance, but they can always connect it to something else.",
    "You can also find similar tools in one or two packages. ESET has a similar feature in its NOD32 antivirus and suites, for instance, and it's more configurable than this one.",
    "Still, this kind of functionality is rare, and experienced users, particularly in business which need better access control, may find it useful.",
    "G Data Total Security has a good-looking feature list, but much like Internet Security, the reality is a major disappointment. The antivirus does a fair job, but the suite-level extras are often outdated, horribly underpowered, and in some cases don't work at all."
  ],
  "headers": {
    "13": "Interface",
    "19": "Protection",
    "25": "Anti-ransomware",
    "30": "Features",
    "41": "Final verdict",
    "45": "Firewall",
    "51": "Backup",
    "57": "Parental controls",
    "63": "Final verdict",
    "67": "Backup",
    "71": "Password Manager",
    "75": "Encryption",
    "80": "Tuner",
    "85": "Device Control",
    "92": "Final verdict"
  },
  "links": {
    "G Data": "https://www.gdatasoftware.com/pc",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "G Data Antivirus Windows": "https://www.gdatasoftware.com/pc",
    "G Data Internet Security": "https://www.gdatasoftware.com/pc",
    "G Data Total Security": "https://www.gdatasoftware.com/pc",
    "password managers": "https://www.techradar.com/best/password-manager",
    "Dashlane": "https://www.techradar.com/reviews/dashlane"
  }
}