{
  "source": "https://www.techradar.com/reviews/one-netbook-a1-ultra-portable-laptop",
  "title": "One-Netbook A1 ultra portable laptop review",
  "category": "computing",
  "updated": "2021-01-19T05:35:56Z",
  "author": "desire-athow",
  "summary": "One of the strangest notebooks ever to have graced our test bench",
  "verdict": "The A1 by One Netbook is a surprising addition to the current laptop ecosystem thanks to some bold design and engineering features too many to be listed in this section. Some decisions are controversial though and its price will make a few potential buyers baulk.",
  "pros": [
    "Unexpected RS232 port",
    "Touchscreen display",
    "Immaculate construction",
    "Fingerprint sensor"
  ],
  "cons": [
    "MicroHDMI connector",
    "Core M3 not the best choice",
    "Unimpressive battery life",
    "Expensive",
    "No webcam",
    "Full HD totally superfluous",
    "Backlit keyboard on by default",
    "Noisy fan",
    "Redundant rope hole"
  ],
  "article": [
    "The past few years have seen the return of a few old trends: vintage vinyl and retro video games, for example. We can now add netbooks to that list, because the cheap and compact form factor from the 2010’s is making a comeback thanks to challenger brands looking to service niche markets.",
    "One-Netbook is one such brand; its A1 notebook targets a very niche audience with a very specific set of features. For example, unlike competing models, it has a rotatable screen that protects the keyboard better (compared to the design of say, the Bmax Y13 Pro).",
    "But that’s not all, it's the only laptop we know of that offers an RS232 port, useful for plugging in all sorts of devices that system administrators, IT technicians and others use. Read on to find out more.",
    "The A1 exists in a myriad of configurations; the one that we received is powered by an Intel Core M3 8100Y with 8GB of RAM and a 512GB SSD. It is on sale at popular Chinese online retailer Banggood for $669.99 (use the exclusive code BGb167fd at checkout); a 256GB version costing $40 less.",
    "The A1 reminds us of another laptop we reviewed a while back, the Chuwi Minibook, also a small convertible with a similar price tag and feature list.",
    "It presents itself as a reasonably small slab of anthracite brushed aluminum metal with four rubber feet on the perforated base that also contains a pair of extra holes to add a VESA mount.",
    "At only 173 x 136 x 19mm for a weight of 550g, it is the lightest laptop we’ve tested to date. Its screen is attached to the body with one rotatable 7-inch touchscreen display that supports up to 2048 pressure levels and can be used with an optional stylus.",
    "The keyboard is understandably crammed (only 15mm between the centre of each key) and while the designers have done a pristine job with arranging the keys around, they can’t break the laws of physics. Users should bear in mind that they won’t probably be able to touch type on it.",
    "The power button is located on the top of the keyboard and doubles as a fingerprint scanner, something that we wholeheartedly embrace. Another trend that we wouldn’t though is removing the webcam altogether. As for your touchpad, well, there’s none because of the space restrictions.",
    "Somehow though, engineers have managed to cram a reasonably good infrared touch sensor and a pair of buttons into a tight space. And guess what? It works pretty well.",
    "Ports include a 3.5mm audio connector on the right, an RS232 port, a micro HDMI connector, two USB 3.0 ports and a Gigabit Ethernet port at the back and a USB-C port (for charging) and a microSD card slot on the left.",
    "The vendor went into details to explain why a native RS-232 serial port is much better than a USB to RS-232 serial port.",
    "The One-Netbook A1 is powered by an Intel Core m3-8100Y, a dual-core processor that has four threads and a 5W TDP. It means that the processor is very power efficient and shouldn’t dissipate a lot of heat. That said, the laptop does have a fan which will get noisy under load. The Intel UHD Graphics 615 that acts as the graphics sidekick is a capable but ultimately limited component; don’t expect anything other than very light workloads although it can drive a 4K monitor, making it ideal for productivity applications.",
    "The processor works alongside 8GB RAM, the slower, older LPDDR3 type and a 512GB PCIe NVMe solid state drive from an unknown source. Wireless connectivity is handled by an Intel Wireless-AC 7265 network adapter which provides both Bluetooth 5 and Wi-Fi 5. The onboard battery is a smallish 22.2WHr model that is powered by a small adaptor that delivers up to 45W of power. Thumbs up for using a removable USB-C cable which means that you will be able to use an emergency power bank to charge it.",
    "Approach the One Netbook A1 with an open mind. This is not your usual laptop but rather a powerful sidekick for a system administrator (hint: the RS232 port). Its versatility and form factor means that there’s probably a few other use cases we haven’t thought of especially in an industrial/enterprise setup: think along the lines of ATM (Automatic Teller Machine), PLC controllers etc.",
    "Cutting to the chase, the A1 excels at single-thread applications but there’s only so much a dual-core processor can achieve especially with a very low power consumption; it will spar with the most powerful Celeron, losing some, winning some. Note that the laptop is noisy under load thanks to the active heatsink fan that works harder than expected.",
    "The storage subsystem is adequate, reaching higher-than-SATA numbers but lacking the oomph to allow this capable ultra portable to hit higher scores. The full HD touchscreen IPS display is glossy and a bit of a fingerprint magnet. It is sufficiently bright to be used outside but don’t try to utilize it under direct sunlight. The hinge works a treat and is a perfect match for a small screen while protecting the keyboard.",
    "When it came to battery life, the A1 proved to be a bit of a surprise clocking in a decent 4h27 minutes in our YouTube video playback battery test. That was not expected given the small battery but we will take it.",
    "It can be a challenge to rate a product that targets a niche market. Clearly, there will be fringe users to whom the One-Netbook A1 will appeal big time but for most of us, the sell will be a laborious and cringe worthy one. Sure, it is small but for many the disadvantages far outweigh the pros.",
    "We would have preferred another processor; the M3 is still expensive and should perform on par with an Intel Celeron J4125 CPU (based on CPUBenchmark, a popular benchmark). The latter consumes more power but the price difference should more than offset it, allowing, for example, One-Netbook to swap the microHDMI port for a more versatile USB-C connector and throw in a free Type-C to HDMI cable.",
    "We also believe that a full HD resolution on such a small screen is a bit of a waste. 1440x 900 pixels would have worked reasonably well, bumping the battery life a tad and lightening the GPU’s load by reducing the number of pixels displayed by around 40%.",
    "It is not a bad product though - one that for now remains without competition - and the attention to detail that the vendor has put in building this tiny engineering powerhouse is a testament to its designers."
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "12": "Hardware",
    "14": "In use",
    "18": "Final verdict"
  },
  "links": {
    "Bmax Y13 Pro": "https://www.techradar.com/reviews/bmax-y13-pro-windows-10-pro-2-in-1-convertible-laptop",
    "popular Chinese online retailer Banggood for $669.99": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-1136057185125967400&ulp=https%3A%2F%2Fwww.banggood.com%2FONE-NETBOOK-A1-Intel-Core-M3-8100Y-8GB-RAM-512GB-PCIe-SSD-7-Inch-1920%2B1200-Windows-10-Tablet-p-1763320.html%3Fcur_warehouse%3DCN",
    "Chuwi Minibook": "https://www.techradar.com/reviews/chuwi-minibook-2-in-1-laptop"
  }
}