{
  "source": "https://www.techradar.com/reviews/lenovo-thinkpad-x12-detachable-review",
  "title": "Lenovo ThinkPad X12 Detachable review",
  "category": "computing",
  "updated": "2021-05-07T20:17:40Z",
  "author": "john-loeffler",
  "summary": "Putting the Microsoft Surface Pro on notice",
  "verdict": "The Lenovo ThinkPad X12 Detachable is a respectably powerful hybrid business laptop for those who want to seamlessly move from canvas to workstation, but it's not without its faults. The entry level configuration is affordable, but if you want to get decent performance out of it, you'll have to spend a good bit more. As such, those who don't need all the business-centric features will probably want to look elsewhere, since there are more powerful hybrids for less.",
  "pros": [
    "Lightweight",
    "Good performance",
    "Excellent battery life"
  ],
  "cons": [
    "Limited Ports",
    "Terrible Speakers"
  ],
  "article": [
    "The Lenovo ThinkPad X12 Detachable is a powerful 2-in-1 laptop for on-the-go professionals who prefer to have an actual tablet running Windows 10 to work with instead of the typical 2-in-1 form factor. Much like the name suggests, this is a Lenovo ThinkPad, with all the performance and business functionality that this brand is known for, but the detachable, portfolio-style keyboard makes it clear that this is directly challenging the Microsoft Surface Pro 7 and Microsoft Surface Pro 7+.",
    "How well does it stack up against Microsoft's popular hybrid laptop? Remarkably well, in fact, especially considering the limitations of the form factor. The X12 Detachable beats our performance expectations, which aren't very high considering that this is essentially a 12.3-inch tablet with a magnetic, 8-pin connected keyboard.",
    "Speaking of connections, given the dimensions of the laptop panel itself, there aren't many ports on the X12 Detachable. While the battery life is quite excellent, you may need to keep a charger handy to finish out a workday, leaving you with only one other USB Type-C port to work with – and it's not a Thunderbolt port.",
    "That limited form factor also sacrifices sound quality, with very uninspiring speakers on either side of the panel (when in landscape mode). At least they aren't downward-facing. On the plus side, the webcam, while not fantastic, still works well enough for video conferencing and recording, and features a privacy shutter for when its not in use.",
    "The privacy shutter is just one of the many security features built into the Lenovo ThinkPad X12 Detachable, but taken together with its lightweight materials, the quality of the display, and the level of performance, this hybrid laptop starts out on the fairly affordable, but you'll have to spend some money to get a configuration with solid-enough performance to justify buying it. As such, this is definitely meant for a specific type of business user, but if you are that kind of user, the Lenovo ThinkPad X12 Detachable is definitely worth considering.",
    "The Lenovo ThinkPad X12 Detachable is available now in the US and coming soon to the UK and Australia, though Lenovo hasn't said exactly when. The US base configuration is $1,097 and comes with an 11th-gen Intel Core i3-1110G4, 8GB RAM, and a 256GB PCIe SSD.",
    "The model configuration we reviewed isn't available on Lenovo's website at this time, but the closest to it sells for $1,397 and comes with an Intel Core i5-1140G7, 16GB RAM, and a 512GB PCIe SSD. Maxing out the specs, for $1,649, you can get one with an Intel Core i7-1180G7, 16GB LPDDR4 RAM, and a 1TB PCIe SSD.",
    "For Australia, meanwhile, the base configuration comes with an Intel Core i5-1130G7, 8GB RAM, and a 256GB PCIe SSD for AU$2,079. Australian models max out with an Intel Core i7-1180G7, 16GB RAM, and a 1TB PCIe SSD, which will set you back $3,134.",
    "UK pricing hasn't been determined yet, but we expect that the entry level model will run about £850, assuming the same specs as the US entry-level model. It will probably max out at about £1,300 with the same max configuration as the US and Australia models.",
    "The Lenovo ThinkPad X12 Detachable is more like a tablet with a keyboard than a proper 2-in-1 hybrid, only this tablet can run Windows 10 Pro and it does it very well.",
    "The design of the chassis stays true to the Lenovo ThinkPad name and features a matte black magnesium chassis with a flip-out kickstand and the kind of design accents one would expect from a ThinkPad, down to the red dot over the \"i\" in the ThinkPad logo.",
    "The keyboard will look familiar to ThinkPad users, down to the bright red cursor button in the bottom-center of the keyboard and mouse buttons placed above the trackpad. There's also a fabric loop on the keyboard to help you keep track of the Lenovo Digital Pen, which is included with the X12 Detachable.",
    "The keyboard itself works well enough, and the rubber connector band tilts the keyboard up a bit when attached to the tablet, which makes typing on it more comfortable by default, but the thinness of the keyboard itself makes typing away on it feel somewhat unstable.",
    "Speaking of stability, don't forget that when you try to move the X12 Detachable back a bit on a desk or other surface, what you'll actually do is close the kickstand, causing the display to fall flat on its back. Like, every time.",
    "The bezels on the display aren't abominable, but they are still noticeably thick. The webcam, meanwhile, features a physical privacy shutter – like much of Lenovo's ThinkPad line – which is always appreciated.",
    "The size of the chassis doesn't leave much room for ports, unfortunately. There are two USB Type-C ports, one of which is a Thunderbolt 4, a 3.5mm combo jack, a Kensington lock slot, and a nano SIM slot if you opt to buy your ThinkPad X12 Detachable with a data plan.",
    "There's only so much you can do with a limited form factor like this, but we're rather surprised at how well the X12 Detachable performs.",
    "To be clear, it falls absolutely flat on its face in our 3DMark tests, so you really shouldn't expect to play anything more than Sudoku with this thing, but let's be real: you don't need pretty graphics for spreadsheets.",
    "When it comes to our CPU tests, which measure everything from number crunching to multitasking, the X12 Detachable holds its own and keeps pace with more traditional 2-in-1s running more powerful processors. The X12 Detachable still fell behind on Geekbench 5 and PCMark 10, but only by a couple hundred points and we honestly expected it to perform much worse.",
    "In our day-to-day use of the laptop, we didn't experience any real slowdown during general use or during more intense bouts with productivity apps and lots of Chrome tabs (16GB RAM really helps on this one).",
    "With just a 42WHr battery, the X12 Detachable lasts 9 hours and 26 minutes during our HD movie test, while making it to the 10 hour one minute mark during our PCMark10 battery test.",
    "This is better than a lot of other competing Ultrabooks and 2-in-1s, which is definitely not something we were expecting.",
    "There isn't much bloat on the Lenovo ThinkPad X12 Detachable, but there is a bunch of security features that will matter a lot to business customers. In addition to the privacy shutter over the webcam, there is a match-on-chip fingerprint scanner, Lenovo's self-healing BIOS, an IR camera that works seamlessly with Windows Hello, and a TPM 2.0 encryption chip which encrypts data as it comes into, or flows out of, the X12 Detachable."
  ],
  "headers": {
    "0": "Two minute review",
    "5": "Price and availability",
    "9": "Design",
    "16": "Performance",
    "20": "Battery Life",
    "22": "Software and features",
    "23": "Don't buy it if..."
  },
  "links": {
    "2-in-1 laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Microsoft Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "Microsoft Surface Pro 7+": "https://www.techradar.com/news/microsoft-surface-pro-7-is-a-2-in-1-designed-for-remote-learning-and-work"
  }
}