{
  "source": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
  "title": "Cambridge Audio Melomania 1 Plus review",
  "category": "audio-visual",
  "updated": "2021-08-18T16:21:52Z",
  "author": "olivia-tambini",
  "summary": "The best-sounding buds just got better",
  "verdict": "The Cambridge Audio Melomania 1 Plus are a clear upgrade on their predecessors, offering excellent audio performance, a helpful app, and easy-to-use controls.",
  "pros": [
    "Stunning audio performance",
    "Great app",
    "Easy controls"
  ],
  "cons": [
    "No ANC",
    "Pricier than their predecessors (in the US, at least)"
  ],
  "article": [
    "Cambridge Audio is a brand that was once associated with just hi-fi systems and amplifiers, but the past couple of years has seen the British company branch out into the world of true wireless earbuds.",
    "Its first offering, the Melomania 1, are among the best wireless earbuds you can buy, thanks to their stellar sound quality, However, the new Cambridge Audio Melomania 1 Plus are a worthy upgrade, putting many other earbuds in the shade for audio performance, battery life, and ease-of-use.",
    "While the design of the Melomania 1 Plus hasn’t deviated too far from its predecessors, there’s a clear step up in terms of audio performance, with levels of detail and clarity that could rival some of the best over-ear headphones.",
    "A helpful app, easy controls, and excellent connectivity just makes us love them even more. The only downside is that there’s no active noise cancellation. However, when these earbuds sound this good, we doubt you’ll miss it much.",
    "The Cambridge Audio Melomania 1 Plus hit the market on March 9, 2021, and wete initially available to buy for $139.95 / £119.95 (about AU$185). However, they've since been given a permanent price cut, bringing them down to $99.95 / £99.95.",
    "If you can still locate a pair then the original Melomania 1 are likely to be heavily discounted – although the new model is designed to replace them, so they may not be available to buy for much longer.",
    "So, how does that price stack up against the rest of the true wireless earbuds market? Well, the Cambridge Audio Melomania 1 Plus cost less than the best wireless earbuds you can buy today, the Sony WF-1000XM4. However, they lack active noise cancellation, which may go some way towards explaining the lower price. They’re also cheaper than the Apple AirPods; but you can buy great-sounding wireless earbuds for less – check out models such as the EarFun Air Pro if you’re on a tight budget.",
    "The Cambridge Audio Melomania 1 Plus sport a pretty similar look to their predecessors, coming in black or white, with bullet-shaped buds and a flip-top charging case – although that charging case now has a matte finish and feels a little sleeker than the previous generation.",
    "On the front of the charging case sits a row of five LEDs that indicate how much battery you have remaining, as well as a USB-C charging port on its left side.",
    "You’ll also find small LEDs on the outside of each earbud, which indicate their pairing status. The flat outer housings double up as physical control buttons that allow you to adjust your music playback, change the volume, handle calls, and summon your device’s voice assistant. There are a few different button presses to remember, but Cambridge Audio stashes a little card with all the combinations in the box, which you could just slip into your wallet or purse.",
    "Each earbud weighs 4.6g, and feels exceedingly light and comfortable in the ear – to the extent that you might even forget that the earbuds are there. A range of silicone and memory foam eartips are included in the box, but note that the memory foam tips only come in large and medium. It’s a shame there’s no smaller option, since a good fit is crucial to achieving a good seal against the ear canal and better noise isolation.",
    "Although the Melomania 1 Plus come with an IPX4 water-resistance rating, and can therefore handle a little sweat or rain, we’d be hesitant to use them while working out. This isn’t necessarily a criticism of the buds; we just feel that the form factor doesn’t lend itself to vigorous exercise, since they could be prone to falling out.",
    "Still, we’re glad Cambridge Audio has largely stuck to the design of its original true wireless earbuds. The bullet shape isn’t something we see often. In fact, it means that the Melomania 1 Plus stand out from the crowd of AirPods-style buds, while staying super lightweight as a result of the lack of bulk from ear stems, fins, or wings.",
    "If you’re looking for supreme audio quality, the Cambridge Audio Melomania 1 Plus will be right up your street. Boasting 5.8mm dynamic drivers, these earbuds offer tons of dynamism and character, with a lively presentation that will have you tapping your feet.",
    "Listening to Daði Freyr’s 10 Years, the pulsing synths and romantic strings complement the baritone vocal melody, with excellent balance across the different frequencies. As the chorus kicks in, the meandering bass guitar and drums sound punchy and controlled, while harmonized vocals are clear and rich.",
    "In terms of accuracy and detail, the Cambridge Audio Melomania 1 Plus feel like a step up on their predecessors – which were very good in their own right. In Normal Song by Perfume Genius, a gently undulating guitar supports his wavering vocal, with the earbuds eking out every last drop of detail with stunning clarity.",
    "You can adjust the EQ settings in the app, either manually or via a series of presets. Plus, you can also switch between High Performance mode, which uses a “hi-fi grade” amplification technology, and Low Power mode, for when you want to save battery life.",
    "There’s no noise cancellation on offer here, but the sound isolation is very good, provided you find a good fit with the eartips included in the box. In any case, when we had music playing, we couldn’t hear much of our surroundings.",
    "The Cambridge Audio Melomania 1 Plus offer up to nine hours of battery life from the earbuds themselves, with a further four charges provided by the case. This means you get a total battery life of 45 hours, although you’ll need to be in Low Power mode to achieve this.",
    "If you’re using the earbuds in the default High Performance mode, the earbuds will provide seven hours of battery life, with a 35-hour combined total with the charging case.",
    "Connectivity comes courtesy of Bluetooth 5, with support for aptX and AAC codecs – and we found pairing to be a breeze. You only need to pair one earbud to your device, and then the second earbud will request to connect to its sibling. You only have to do this once, after which the second bud will pair as soon as it’s powered on.",
    "The Melomania app is an excellent addition to the earbuds, allowing you to adjust the EQ, locate your lost earbuds, receive firmware updates, and check the battery level of each bud."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Cambridge Audio Melomania 1 Plus price and release date",
    "7": "Design",
    "13": "Audio performance",
    "18": "Battery life and connectivity",
    "22": "Don't buy them if..."
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1",
    "best wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "best over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "permanent price cut": "https://www.techradar.com/news/cambridge-audio-melomania-1-plus-top-wireless-earbuds-get-permanent-price-cut",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "EarFun Air Pro": "https://www.techradar.com/reviews/earfun-air-pro"
  }
}