{
  "source": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-inspiron-15-5000-1297284/review",
  "title": "Dell Inspiron 15 5000 review",
  "category": "computing",
  "updated": "2021-08-24T15:59:59Z",
  "author": "mike-jennings",
  "summary": "A solid piece of kit, let down by its keyboard and screen",
  "verdict": "The Core i7 processor and AMD graphics make this a powerful all-rounder, and it's got good looks and reasonable build quality. The keyboard isn't great, though, and the Inspiron's screen lacks resolution and quality.",
  "pros": [
    "Core i7 processor",
    "Dedicated AMD graphics",
    "Smart exterior design",
    "Decent build quality"
  ],
  "cons": [
    "Low screen resolution and quality",
    "Middling battery life",
    "Mediocre keyboard"
  ],
  "article": [
    "Dell's range of Inspiron laptops has been around for what feels like eons, so was about time the line was refreshed with more recent, superior Intel hardware. This 2018 laptop remains an attractive computer, too, with a brushed metal finish across the lid.",
    "Immediately, the metallic lid and attractive Dell logo make a strong first impression, and the aesthetic spreads to the sides and base, where more metal is layered over the Dell’s plastic skeleton to add a bit of sheen.",
    "Build quality is very consistent, too. The wrist-rest barely budges, the screen feels sturdy, and the underside has a little give – but all the components inside are well protected. We wouldn’t really have a problem with slinging the Dell Inspiron 15 inside a backpack and expecting it to survive our travels. You’ll only need to use a protective sleeve if you’re concerned about aesthetic damage.",
    "This isn't a particularly expensive notebook, though, so don't expect metal draped over every surface. The underside of the base is only covered in metal on areas where it'll be visible, and the keyboard, wrist-rest and screen bezel are all finished with underwhelming matte black plastic.",
    "The port situation is pretty standard here, too, with a trio of USB connections, a HDMI output and Gigabit Ethernet alongside an SD card reader. Interior access is decent: the base panel lifts away after just two screws have been removed, and the memory, hard drive, battery, processor and wireless card are all easily reachable. That’s great news for anyone that wants to be able to repair or upgrade their own laptop.",
    "This isn't an Ultrabook or a convertible machine, which means it's chunkier than both of its main rivals. At 0.9in (23mm) thick it's a tad broader than the 0.78in (20mm) Lenovo ThinkPad X250 and the 0.86in (22mm) Asus Transformer Book Flip TP300LA, and it tips the scales at 4.4lbs (2kg) – almost 2lb more than the Lenovo and around half a pound more than the Asus.",
    "The Scrabble-tile keyboard has a number pad, which is a boon for productivity, and its layout is mostly fine – we're not thrilled to a see a single-height Return key, but that's our only quibble.",
    "It’s a decent jumping off point, but the keys themselves aren’t great for serious typing. The base isn’t firm enough, and the keys don’t have enough travel – a combination of issues that can make the keyboard feel unsatisfying, without the movement and conviction of better, more expensive laptops. It’s perfect for browsing, instant messaging and the occasional email, but that’s really it.",
    "The trackpad is initially too sensitive, which can be fixed in the Control Panel, and it's fine elsewhere – the surface is smooth and responsive, and the buttons are light and consistent."
  ],
  "headers": {
    "1": "Design",
    "6": "Ergonomics"
  },
  "links": {
    "Lenovo ThinkPad X250": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/lenovo-thinkpad-x250-1293694/review",
    "Asus Transformer Book Flip TP300LA": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/asus-transformer-book-flip-tp300la-1293466/review"
  }
}