{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
  "title": "Samsung Galaxy Note 20 review",
  "category": "phones",
  "updated": "2021-07-15T14:06:42Z",
  "author": "andrew-williams",
  "summary": "The world’s priciest plastic phone?",
  "verdict": "It’s easy to love the Note 20’s S-Pen and the fun versatility of its triple-camera array. But its short battery life is testing, as is the sense that Samsung is really seeing how much profit it can squeeze out of each sale with this one, more so than usual.",
  "pros": [
    "Versatile three-camera array",
    "S-Pen is brilliant, as ever",
    "Strong performance"
  ],
  "cons": [
    "Expensive for a phone with a plastic back",
    "Lower-res screen than other Samsung flagships",
    "Only has a 60Hz display"
  ],
  "article": [
    "The Galaxy Note 20 is a lower-cost alternative to the Note 20 Ultra. It’s a top phone, if not a $1,300 one, as the Ultra is, and you still get Samsung’s best 2020 processor, a bold OLED screen and the series’s signature S-Pen stylus.",
    "However, it’s still not cheap, and Samsung has made more compromises here than it did with the drop down from the Galaxy S20 Ultra to the Galaxy S20 - though this is somewhat in line with differences between the Galaxy S21 Ultra and the Galaxy S21.",
    "The Note 20 doesn’t have a glass back, an ultra-high-res screen or a curved front, and while none of these omissions has a huge impact on how the Note 20 feels to use, they make the phone seem expensive for what you get.",
    "The prospect of buying any phone in the region of $1,000 or more involves a moment where you have to stop thinking about the cost and just throw down your credit card; but the expense here is less obviously justified than usual. The Galaxy S20 Plus is a classier phone with a better display and better build, and is now cheaper online in some places.",
    "There’s no real improvement to the camera tech in the Note 20 over the S20 phones either.",
    "All of this puts more pressure on the S-Pen, as it needs to do much of the heavy lifting in terms of justifying the Note 20’s $1,000 price. It’s a fun accessory, and still the best drawing tool you can get for a phone – and if it helps you wean yourself off looking at social networks when you have a spare moment, maybe that alone makes it worth the money.",
    "There’s another problem, though. While the Galaxy Note 20 has one of Samsung’s typically efficient screens, the UK version runs on the Exynos 990 processor, which isn’t all that easy on the juice – and due, we suspect, in large part to this, the battery doesn’t last as long as we’d like. It doesn’t have the longevity to satisfy heavy users, and it never seemed to last us longer than a day.",
    "If you’re a light or moderate phone user who doesn’t need the very latest tech in every area of your phone, and who doesn’t want to pay the very highest prices, the Galaxy Note 20 is great. It has plenty of power, tried and tested software, and good cameras, while the S-Pen really does offer something you don’t get anywhere else.",
    "The Samsung Galaxy Note 20 launched in August 2020 alongside the Note 20 Ultra, and is the more affordable of the pair.",
    "In the US the 5G model with 128GB of storage costs $999. The cheaper 4G version isn’t available in the US, which arguably makes sense when a 4G phone costing the better part of $1,000 would be a bad investment.",
    "In the UK the Note 20 starts at £849, which gets you the 4G model with 256GB of storage, and the 5G variant costs £949.",
    "This means the 5G Note 20 is $300 cheaper than the base-model Note 20 Ultra in the US (with half the storage) or £230 less in the UK (with the same 256GB storage).",
    "It's worth noting that while the above prices are what the Note 20 launched at, it can now often be found for significantly less if you shop around.",
    "There are no instructive price comparisons to be made other than with Samsung’s other phones, as nothing else has anything to match the mighty Samsung S-Pen. But those not obsessed with owning the stylus should check out the S20 Plus and S20 Ultra, which have dropped in price a little since they arrived earlier in 2020.",
    "You might also want to consider the Samsung Galaxy S21 range, with the standard model being more affordable than most Samsung flagships, and the Samsung Galaxy S21 Ultra coming with S-Pen support - meaning you don't even need to buy a Note to get Samsung's stylus anymore.",
    "Thank you to Vodafone UK for providing TechRadar's review unit",
    "The Samsung Galaxy Note 20 might be the most expensive plastic phone you can buy. Samsung has used plastic on the back of this phone in order to save on the cost of curved glass.",
    "Is it cheeky to try to sell us a $1,000 plastic phone? Absolutely.",
    "However, Samsung has at least put some work into making the Note 20’s back look as close to the Note 20 Ultra’s matt glass as possible. It has the same light-diffusing style of finish, and it looks exactly like textured glass until you hold the phone – and then it feels like plastic. It’s what the company is calling ‘Glasstic’. The Samsung Galaxy Note 20 is not all-plastic, though, as its sides are metal.",
    "This is in several ways a watered-down Galaxy Note 20 Ultra, but that isn’t always and everywhere a bad thing. The Note 20’s camera housing doesn’t stick out anywhere near as much as the Ultra’s, and the phone is significantly smaller, which will please those with smaller hands or smaller pockets. If you want a larger device, opt for the Ultra.",
    "It measures 161.6 x 75.2 x 8.3mm, and shaving just a couple of millimetres off the width and height makes the standard Note 20 seem part of a different class to the Ultra, size-wise.",
    "It’s only slightly narrower than an iPhone 11, and bigger than 2019’s Note 10, but as the number of genuinely small phones decreases, and more budget ones try to offer ‘value’ with ever-larger displays, the Note 20 feels like no more than a mid-size phone.",
    "The Note 20 also has much less severe corners than the Note 20 Ultra, which softens its appearance. It makes the Note 20 look more ordinary, but in a pleasant way.",
    "A flat screen is another nod to the ordinary, and another area where Samsung has scrimped on the design. The Galaxy Note 20 Ultra and other top Samsungs have curved glass on front and back, which looks elegant and also makes those phones less big, because the casing tapers towards the parts you hold.",
    "Curved glass makes a phone seem more luxurious, but as the Galaxy Note 20 still has extremely small bezels, there’s no great functional loss here. Some may even prefer a flat screen, as curved edges pool reflections, which can be distracting when you’re watching a video on your commute, although we tend to get used to that a day into using a curved-glass phone.",
    "Other top features are present. The Note 20 has a fairly quick in-screen fingerprint scanner and a good face unlock feature. It’s IP68 water/dust-resistant too, made to take submersion in 1.5 meters of water or less for up to 30 minutes.",
    "There are stereo speakers, one above the screen and another on the bottom of the phone. These are loud and clear, lacking only some of the bass of the Note 20 Ultra’s speakers, which may just be down to the bigger phone having a larger enclosure.",
    "As with other Note phones, one of the highlight features of the Note 20 is Samsung’s S-Pen and the stylus itself is exactly like the Note 20 Ultra’s. Take it out of its slot on the left side of the phone’s base and the S-Pen interface icon appears on your screen.",
    "This is a simple menu of shortcuts that take you to all the essential S-Pen features. These include the Notes app, the screen-writing feature, the doodler app PENUP, translations and Live Messages.",
    "What are Live Messages? The Note 20 can create a mini video of you drawing on the camera view, an image from the gallery or a colorful background.",
    "PENUP is the real place to start for drawing. It’s a Samsung-made app that offers basic drawing and digital painting, with some advanced touches like semi-realistic modeling of what happens when you put one layer of paint over another.",
    "Drawing on a Note 20 is fun, and the core feel of tracing the S-Pen nib over the screen, whether you leave the factory-applied screen protector in place or not, is great. It’s a much better way to spend a lazy 20 minutes than scrolling through Twitter or Instagram.",
    "However, PENUP does not support layers – you’ll need to switch to an app like Autodesk SketchBook or Adobe Photoshop Sketch for anything more involved, and these both get on with the S-Pen and its 4,096 pressure sensitivity levels just fine.",
    "A sketching session reveals another difference between the standard Note 20 and the Note 20 Ultra, though. This phone doesn’t have the pricier one’s ultra-fast 9ms response time, which means the input lags behind the pen nib just a little. We noticed it most when filling in fine detail, although given that its response is reportedly 18ms (still quick), the lag may actually be caused by the app working out how the current stroke should interact with the ones already on the paper.",
    "The Note 20 S-Pen supports Samsung’s wireless control features. There’s a little battery in the S-Pen, and motion sensors that can distinguish circles drawn in the air from upward and downward swipes.",
    "This allows for Samsung’s Air Actions gestures. They can control the track and volume when playing music, and there are five other gestures that can be programmed. You can also use the button on the side of the pen to activate the camera.",
    "Hardly anyone is likely to make full use of the Note 20’s Air Actions, but camera and music control may come in handy.",
    "And, as ever, the S-Pen is the best reason to buy a Note device over one of Samsung’s S-series phones, although since the Note 20's launch that's become slightly less true, as the stylus is also supported by the Samsung Galaxy S21 Ultra - though it's sold separately there, and there's no slot for it.",
    "The Samsung Galaxy Note 20 has a 6.64-inch OLED screen that, on first glance, seems quite similar to the Note 20 Ultra’s.",
    "Its OLED panel offers great color and contrast, and images really pop, and you can choose whether to use the screen’s native color gamut or the ultra-reserved sRGB (labelled ‘Natural’ in the settings). It supports HDR video too.",
    "However, the Note 20 misses out on all of the Note 20 Ultra’s high-end screen features, and it’s this, more than anything, that sets the two devices apart.",
    "High refresh rate is the obvious one. This is the most visible change in phone display tech of the last year or so, and along with several other of this year’s flagships, the Ultra has a 120Hz screen.",
    "The Note 20, though, has a ‘standard’ 60Hz refresh rate. If you’re reading this there’s a good chance your current phone has a 60Hz screen, but 90Hz and 120Hz ones are becoming increasingly common.",
    "It makes Android’s app homepages glide by much more smoothly, and you really notice the difference when scrolling your social media feeds. It doesn’t just look nice, it plays a perceptual trick that makes the phone seem to run faster all-round.",
    "Even the Poco X3 NFC offers a 120Hz refresh rate – and at a much, much lower price than the Note 20.",
    "Resolution is much lower here than on the Ultra or Galaxy S20 too. The Note 20 has a 2400 x 1080 pixel screen, which is Full HD elongated to fit the 20:9 aspect ratio. It’s easily high-res enough to make text and images appear nice and sharp, but if you look closely you can see the characteristic granularity of Samsung’s PenTile OLED panels.",
    "Brightness is also in a completely different league on the Note 20 Ultra. It hits around 600 nits in everyday conditions, and has a ‘turbo’ mode that kicks in when it’s very bright outdoors, increasing peak brightness to an incredible ~1600 nits.",
    "On the Note 20, we measured 370 nits at max brightness indoors using a SpyerX Pro colorimeter, and after blasting the screen with a 121-LED spotlight to simulate bright conditions this increased to 568 nits.",
    "This is enough for comfortable outdoors viewing, but the Ultra’s far greater peak brightness is a big benefit when you’re taking photos out in the sun, as you can see what you’re shooting much more easily. It helps if you’re watching Netflix outside, too.",
    "The Note 20 screen is also less bright than the standard Galaxy S20’s, according to our testing. So this isn’t a true high-end display in 2020, even if it is still a nice one.",
    "The Samsung Galaxy Note 20 has three rear cameras and one up front, and both the hardware and image quality are similar to what you get with the Galaxy S20 phones.",
    "The main camera has a 12-megapixel Samsung s2k2ld sensor with an f/1.8 lens. The drop-off in sharpness at the frame corners isn’t too bad, and the sensor is a large 1/1.76-inch chip, allowing for also-large 1.8-micron pixels. It’s a strong sensor.",
    "The ultra-wide camera is great too – it’s a slightly smaller 12-megapixel sensor with 1.4-micron pixels and an f/2.2 lens. Shoot indoors with this camera and you’ll see more noise than from the main camera, but just switch to the Note 20’s Night mode and most of that granularity will drop away. Again, it’s a strong performer.",
    "If there’s a weak point – particularly given the price you’re paying – it’s the zoom camera. The Note 20 does not have a true optical zoom like the Note 20 Ultra’s. It’s a 64-megapixel sensor with an only slightly longer focal length than the primary camera, 27mm (equivalent) as against 26mm.",
    "Samsung says it provides “3x hybrid zoom”, which is effectively a tiny, tiny amount of optical zoom, plus a crop into a sensor that’s much higher-resolution than the main one. You see the same tech in the Galaxy S20 and S20 Plus.",
    "While it’s not true optical zoom, it still does the job. Detail at 3x is far greater than from the main camera, which is all about using large sensor pixels to max-out dynamic range and image quality. Pixel-peeping detail isn’t the priority with that camera, leaving room for a dedicated high-res zoom sensor.",
    "Samsung lets you take photos at up to 30x zoom, to give you some of the same flexibility as the S20 Ultra and Note 20 Ultra. Not surprisingly, however, these images look dreadful – capturing 30x images with a 1.1x lens requires a huge amount of digital zoom. Even 3x images only look good if you don’t start inspecting them down at pixel level.",
    "This is especially highlighted because the main camera’s images really do tend to hold up to such scrutiny. Using larger sensor pixels means Samsung doesn’t have to use intense processing in all areas to get images to their final state. If you currently own an older Samsung flagship, you may be familiar with the ‘oil painting’ effect that’s applied to leaves and blades of glass – there’s very little of that here.",
    "However, the Galaxy Note 20 is a little too keen on processing in other areas. Skies tend to look too blue, whether you use the scene optimizer mode or not, while grass is usually hyped to make the picture pop. And despite excellent dynamic range boosting, all three cameras have a tendency to let clouds become blown out in order to make the image brighter in general.",
    "This isn’t a sound choice, as while dimmer parts of a picture can be jazzed up before you post them to Instagram, you can’t recover blown-out detail – and it happens too often with the Galaxy Note 20.",
    "The phone is also poor for macro images, where you get right up close to the subject to bring out, for example, the fine detail in flowers or a spider’s web. None of the three cameras lets you get particularly close, and the depth of field on the main camera is really too shallow to allow for striking close-ups with nicely blurred backdrops.",
    "All this said, there’s plenty to like about the Note 20 camera experience. Live Focus, the background blur mode, is pretty good, and lets you take arty-looking images with near-zero effort.",
    "The Night mode is great too, just a half-step behind the Note 20 Ultra and the very best from Huawei and Google. It improves the already good low-light performance of the optically stabilized main camera, not just lifting detail out of the shadows, but firming up detail and clarity across the frame by merging multiple exposures.",
    "The Note 20’s video capabilities match the Galaxy S20’s. You can shoot at up to 8K resolution, and the 8K mode does offer extra detail over 4K capture. It uses the 1.1x 64-megapixel telephoto camera, because the resolution of 8K video is far greater than 12MP (it’s 33MP).",
    "However, you should ignore the 8K option most of the time, as it’s virtually unstabilized and panning motion looks jerky, thanks to dropped frames.",
    "Results at 4K 60p and below are much more consistent. The Note 20 offers good electronic stabilization at this setting, although (perhaps counter intuitively) the path of movement often looks cleaner at 30fps. Stick to 30fps if you want to shoot in low light too, as 60fps naturally limits the exposure time possible for each frame.",
    "You can have the most fun with mid-shoot editing at 4K 30fps and below. These settings let you flick between the 3x, 1x and 0.5x views during capture (this is disabled at 4K 60p), and let you play the film director while capturing a video.",
    "The Samsung Galaxy Note 20’s 10-megapixel selfie camera is great. Images taken in good and moderate light are packed with fine facial detail, and while there’s only one lens the app offers two fields of view. The narrower one uses a 6.5MP crop, and is probably what you’ll want to use for solo selfies; get up close with the wide view and, well, let’s just say the perspective gets less flattering.",
    "In extremely low light you’ll still be able to make out your face clearly. Detail will have been all but obliterated, though, so consider switching on the display flash – this fires a blast of warm color at you just as the exposure happens, to bring image quality much closer to that of a well-lit scene.",
    "The Note 20 is a lesser phone than the Note 20 Ultra in a lot of ways, but the processor is not one of them. As is the case with the Note 20 Ultra and the S20 series, in the UK and Australia the Note 20 runs on the Samsung Exynos 990 processor, while US models have the Qualcomm Snapdragon 865 Plus CPU.",
    "Given the choice, we’d prefer the Snapdragon, which has a better GPU and superior power efficiency.",
    "There’s no obvious shortfall in performance day-to-day, though. The Note 20 feels fast, and can play games very well, and Epic Games lets you play Fortnite at 60fps, where most phones are capped at 30fps. You won’t see a solid 60fps whole playing though – the refresh rate jumps all over the place, dropping down into the 40s, with dips below 30fps as assets load. But the Note 20 is still a great phone for demanding games.",
    "The phone scores 2701 in Geekbench 5, which is the same sort of result you’d see from the Note 20 Ultra, S20 Ultra, S20 Plus or S20; same CPU, roughly the same power.",
    "The Galaxy Note 20 may feel slightly slower than the Note 20 Ultra in places because of its 60Hz screen, but it’s no less powerful a phone.",
    "Its software is the same too. The Galaxy Note 20 runs Android 10 (updateable to Android 11) with Samsung’s One UI on top. It’s a cute-but-tasteful interface, with the main point of departure from vanilla Android being the app drawer style, with pages replacing the vertical scroll used in most other 2020 takes on Android.",
    "One UI also has an extra home screen called Samsung Daily. This is populated by widget-like panels that show the latest news, and updates from apps like Spotify. Most are likely to ignore Samsung Daily, but it’s not terrible.",
    "Any discussion of the Note 20’s battery life has to start with an important disclaimer: we’re reviewing the UK/Europe/Australia version of the phone, which has an Exynos processor.",
    "Our experiences with other top Samsungs show the US versions, which have Snapdragon CPUs, tend to last noticeably longer between charges – and let’s hope this is the case again here, because the UK version of the Note 20 does not provide great battery life.",
    "Our US Samsung Galaxy Note 20 Ultra lasted for a full day, and often had over 20% leftover at the end of a long day. The Note 20 has a 4300mAh cell, 200mAh smaller than the Note 20 Ultra’s. And our UK unit fails the ‘confidence test’.",
    "That’s to say, start with a full charge in the morning and you don’t feel safe in the knowledge that the Note 20 will last until you get home if you go out for the evening – at one point we had to turn the phone off when we were in a bar to make sure there was enough juice for some Spotify on the way home.",
    "Having switched to the Galaxy Note 20 from the long-lasting (and cheap) Poco X3 NFC, this was disappointing. A power-user phone like this needs power-user battery life, and it doesn’t have it – and this failing is highlighted by the glut of much cheaper phones from Realme, Xiaomi and Oppo that seem to last a full day no matter what you’re doing.",
    "Playing a 90-minute video at maximum brightness drained 11% of the battery, starting from fully charged. This is a very good result, among the best, suggesting the screen itself is efficient. We re-ran the test starting at 65% battery instead of 100%, in case the first result was skewed by how the Note 20 reports the battery level (some hold onto ‘100%’ for a while), but it still only lost 12%.",
    "So the Galaxy Note 20 will last plenty long in a video playback drag race, but doesn’t fare so well out in the real world.",
    "You get a 25W charger in the box, and this takes the Note 20 from flat to 38% in 30 minutes. That’s nowhere near the fastest around, but there’s more: the phone supports 15W wireless charging and reverse wireless charging, which is handy if you have true wireless earphones that can be charged over the Qi standard.",
    "First reviewed: September 2020",
    "Thank you to Vodafone UK for providing TechRadar's review unit"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Samsung Galaxy Note 20 price and release date",
    "16": "Design",
    "27": "S-Pen",
    "38": "Display",
    "50": "Camera",
    "69": "Specs and performance",
    "76": "Battery life",
    "84": "Don’t buy it if..."
  },
  "links": {
    "Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "wireless earphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}