{
  "source": "https://www.techradar.com/reviews/microsoft-surface-duo",
  "title": "Microsoft Surface Duo review",
  "category": "phones",
  "updated": "2021-08-27T09:00:47.566Z",
  "author": "jackie-thomas",
  "summary": "A Windows phone that doesn't run Windows",
  "verdict": "The Surface Duo completely changes how you use your mobile device. More akin to a pocket-shaped laptop than an actual phone, the Surface Duo is probably the best device around for mobile productivity right now, even if the slightly dated hardware leaves something to be desired.",
  "pros": [
    "Excellent dual-screen implementation",
    "Gorgeous design",
    "Beautiful screens"
  ],
  "cons": [
    "Dated hardware",
    "Expensive",
    "Poor camera"
  ],
  "article": [
    "The Microsoft Surface Duo arrives in kind of a weird time. A huge number of professionals are now working from home long-term, and the idea of always being online and working is unfortunately widespread across different industries.",
    "And while phones have always allowed for some level of connectivity and availability even when you're away from one of the best laptops, it's always served as kind of a stopgap until you can get back to your main machine to get the real heavy lifting done. The Surface Duo, on the other hand, offers a glimpse at what a professional phone could look like in the future, even if there are some issues that stop it from being the true solution right away. But, after all, what first-generation product ever completely solves the problem it's targeting?",
    "There are definitely going to be people that scoff at the price tag, as Microsoft is asking a whopping $1,399 / £1,350 (about AU$1,930) for the Surface Duo. To put that in perspective, the LG V60, with a detachable second screen, starts at just $799 (about £615, AU$1,100). Keep in mind that LG's device has a newer chipset, the Qualcomm Snapdragon 865, along with an additional 2GB of RAM.",
    "On paper, that makes it seem like the Surface Duo is overpriced. While that may just be the case, Microsoft has put in a ton of work to make the actual experience of using the phone way better than we could have imagined. The LG V60 may have provided a hint of what a dual-screen phone could be like, but the Surface Duo makes it feel necessary.",
    "The Surface Duo was made available on September 10, 2020 in the US. The UK release date came in February 2021, and we've yet to see the phone debut in Australia.",
    "It started at $1,399 / £1,350 (about AU$1,930). That starting configuration will get you 128GB of internal storage, though you will be able to opt for a 256GB model for $1,499 / £1,449 (about AU$2,080).",
    "Since release we've seen the price of this handset drop a lot where it has been as low as $700 / £680 for the 128GB version and $750 / £730 for the 256GB variant. All models are 4G LTE, meaning this isn’t a 5G phone on any network.",
    "If we were going to use one word to describe the Surface Duo design it would be 'sexy'. The dual-screen device has an all-glass chassis – even though it doesn't support wireless charging.",
    "The two displays are connected with these tiny, but beautiful, hinges, with a minimal gap between the two. And while the aesthetic is certainly enthralling, it doesn't even compare to how the device feels to open and close.",
    "Microsoft somehow found a way to make a hinged device feel incredibly solid without being cumbersome to actually move. Even when we're walking and texting on the Surface Duo, the screen doesn't even begin to wobble, something we were definitely afraid of when we first saw the device all the way back in October 2019 when Microsoft announced it.",
    "Instead, the hinge has been fine-tuned for both longevity and comfort, making the device feel incredibly rigid without looking like it. We have definitely been finding ourselves just opening and closing the device over and over again because it feels so good.",
    "The Surface Duo is also incredibly symmetrical. On the right side of the device, you'll find a USB-C charger, a lock button, the volume rocker and a fingerprint sensor – but beyond that the two sides of this device are the same thickness, with the displays being the same resolution and size, too.",
    "This all makes using the Surface Duo in any orientation feel incredibly natural. We are constantly finding ourselves shifting the orientation of the device depending on the task we're actually performing. We'll have it open like a book when we're browsing Twitter and Instagram at the same time. Then, we turn it horizontally, which will allow the second screen to serve as a full-screen keyboard when we want to quickly respond to a work email without getting up from the awkward position we've taken up on the couch.",
    "Or, you can rotate the device all the way to serve as a single-screen device, which will let you talk on the phone or snap pictures. However, as we'll go into later, the Surface Duo isn't exactly great at either of these things, so we find that we rarely use the Surface Duo as a single-screen device.",
    "You can also just barely open the device to get a peek at the time. This is helpful, as there isn't an outside-facing display, but you can't actually see if you have notifications in this view, so it's basically only good for checking the time.",
    "And through all of this moving the phone around, there is only one marking on the back of the phone – a perfectly centered, perfectly square Windows logo on the back, which will look right no matter what angle or direction you're holding the phone.",
    "With its Surface line of laptops and desktops, especially over the last few years, Microsoft has proved itself a master of design, creating computing devices that go right up against MacBooks. But, with the Surface Duo, Microsoft has topped itself, creating the most beautiful Surface Device we've ever used. We just hope that the design philosophy Microsoft followed with this device gets echoed throughout the lineup, that Surface Book 3 is looking rather ancient by comparison.",
    "The whole crux of the Surface Duo is the dual-screen functionality, to the point where if that's not something absolutely necessary for you, there's not much reason to pick this thing up.",
    "When the device is open, you can have two full apps running side by side, or you can even extend apps across both screens – though that has limited utility. The only use that immediately springs to mind for expanding an app across both displays is for media consumption. But, even though the gap between the two displays is small, it's still there, and is definitely not ideal for watching a movie or something. Then again, if you just want a giant screen to watch media on, you’re probably looking at the Samsung Galaxy Z Fold 2.",
    "However, that's where Microsoft's own library of apps comes in. Microsoft preloaded the Surface Duo with the full Office Suite, and once you dive into these apps, the utility of the second screen becomes abundantly clear.",
    "Sure, you can run your web browser and your email side-by-side, but when you open Outlook across both screens simply by swiping up from the bottom of the display and sliding, then holding the app over the middle of the device, the view changes. Now, you'll have one display showing a list of your emails, while the other display will have the email you're currently reading open.",
    "The absolute best example, though, is OneNote. Being able to open this app across both screens was like having a little notebook with infinite paper – even if we had to supply our own Surface Pen. Microsoft stubbornly refuses to include a Surface Pen even with its Surface Pro lineup where it makes the most sense, so it's not surprising that it's not included here, even if it is incredibly disappointing.",
    "Either way, taking notes on the Surface Duo is a dream come true, and may be enough to convince a lot of people to take the plunge on the device, especially if they're Microsoft Office devotees already.",
    "Most of the time, however, we're using this phone by having Twitter open on one screen and Slack open on the other. Being able to run down to the bodega to pick up breakfast while still being able to have a dual screen setup to convincingly pretend to work is exactly what we wanted out of this phone. And by golly, it delivers.",
    "The Surface Duo only has a single-lens 11MP camera, which is on the front of the right-hand screen. This camera will be pulling double-duty, both acting as a selfie-cam and also as the main camera when you flip the device around into single-screen mode.",
    "Because it's just a single-lens camera, it's not going to be taking on the iPhone 11 Pro or the Google Pixel 4, but it's, you know, fine.",
    "This isn't exactly a device that's meant for the type of people shooting a ton of photos all the time, so it's something that's easy to overlook if your use case lines up with what the phone is designed to do.",
    "Don't get us wrong, it still packs a halfway decent portrait mode and can still record 4K video, but the camera is easily the weakest point of the device. However, the symmetrical design of the phone means that we almost wouldn't even want a camera to be on the back of the device anyways, so it's definitely something we can live with.",
    "Just be aware of the sub-par camera experience if you're going to go with the Surface Duo.",
    "This device is only powered by last year's Qualcomm Snapdragon 855 SoC and 6GB of RAM, which is definitely not top-tier specs, especially for a device whose entire raison d'être is multi-tasking.",
    "When it comes to scrolling through email and social media, the specs here are more than enough, but once you start introducing heavier apps, things stop operating so smoothly.",
    "There was a day near the beginning of our time with the Surface Duo where we got the bright idea of walking around our neighborhood, playing Pokemon Go while having Discord open – just because it was a thing we could do. However, the game quickly grew unresponsive, which then led the chat app to also become unresponsive.",
    "Again, this isn't a workload that the device is designed for – especially because the shorter aspect ratio of the two screens means most games UIs don't scale super well – but it's still disappointing that it's such a struggle.",
    "If the intended workload is all you're really planning to do, the hardware on offer should get the job done. Just don't expect to use a lot of super heavy creative workloads on this device.",
    "Packed with a 3,577mAh battery, and rocking last year's flagship Qualcomm meant that we weren't exactly expecting groundbreaking battery life with the Surface Duo, especially given that the device has to power two displays. We were pleasantly surprised.",
    "Only on the first day did we experience lackluster battery life, with the device dying out on us before we went to bed, but that could easily be chalked up to the device going through first-time setup and us poking and prodding at the device constantly.",
    "We spent a little over two weeks with the Surface Duo, using it as our main device, and we typically found that the device lasted a little over a day most of the time. Even days when we loaded up Pokemon Go to see how the device handled gaming, or watched a load of video content saw the battery last all day.",
    "Even when the battery does eventually die, the included 18W charger gets the device charged incredibly quickly, so we're never out of the action for long. It would have been nice if Microsoft deigned to support wireless charging with the Surface Duo, given the all-glass chassis, but maybe that’s something that will be included next time around (if there is one)"
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Microsoft Surface Duo price and release date",
    "7": "Design",
    "17": "Dual screen",
    "24": "Camera",
    "29": "Performance",
    "34": "Battery",
    "38": "Don't buy it if..."
  },
  "links": {
    "phones": "https://www.techradar.com/news/best-phone",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "LG V60": "https://www.techradar.com/reviews/lg-v60-thinq",
    "Surface Book 3": "https://www.techradar.com/reviews/surface-book-3",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "Google Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review"
  }
}