{
  "source": "https://www.techradar.com/reviews/arvixe",
  "title": "Arvixe review",
  "category": "computing",
  "updated": "2021-09-02T06:23:26Z",
  "author": "mike-williams",
  "summary": "Average host from the US with few fans",
  "verdict": "It seems that Arvixe has lost more than a handful of its fans since becoming a part of the EIG family. Refusing to be put off by online reviews, we have enjoyed their wide selection of hosting services, a few worthwhile features, and speedy performance along the road. However, there were a few bumps likely to discourage new users.",
  "pros": [
    "45-day money-back guarantee",
    "Variety of hosting options",
    "Free easy-to-use website builder",
    "No price hikes upon renewal"
  ],
  "cons": [
    "No support via telephone",
    "Support staff can be slow to respond",
    "No free SSL certificate with cheaper plans",
    "A worrying number of negative reviews on the web"
  ],
  "article": [
    "Founded in San Luis Obispo (California, the USA), Arvixe has been providing hosting for personal and business sites since 2003. As of 2014, it exists as part of EIG (Endurance International Group), an ever-growing web hosting giant that also owns over eighty companies, many of which are well-known web hosting businesses such as HostGator, iPage, Bluehost, JustHost, and HostMonster.",
    "According to numerous reviews from former and greatly dissatisfied users of Arvixe, everything went to rack and ruin after the takeover. For instance, out of 99 reviews on Trustpilot, 85% of them are extremely bad (one out of five stars) and describe Arvixe as “horrible”, “not worth the trouble” and (with a bit of an exaggeration, we reckon) “worst web hosting company on the planet”.",
    "Nevertheless, Arvixe boasts about providing web hosting services with a “rare combination of unmatched reliability, quality and affordability” and claims it has won “numerous” awards in the field. Headquartered in Calabasas (California, the USA), Arvixe operates three data centers from the USA, Europe, and Hong Kong.",
    "Arvixe’s official site has a nostalgic feel to it, although a cynic might simply describe it as outdated. Be that as it may, we had no trouble finding our way around it. The site is available in the English language only and it features a retro-looking (and pretty useful) blog. Unfortunately, it hasn't been updated since 2016.",
    "Although Arvixe has accounts on social networking platforms such as Facebook, Twitter, LinkedIn, and Google+ (somebody should tell them about the shutdown), none of them seem to be much alive.",
    "Arvixe offers a couple of choices for each type of hosting it provides and this includes shared hosting (located in PersonalClass and BusinessClass), reseller hosting (in Reseller class), VPS hosting (in VPSClass), and dedicated server hosting (in DedicatedClass). All hosting packages offer unmetered bandwidth and all shared hosting packages offer unlimited disk space, databases, and e-mail accounts as well.",
    "If you want to receive a free domain name with your shared hosting package, you’ll have to subscribe for a year at a minimum. Plans are displayed in great detail, however, to compare them with each other you’ll have to scroll up and down (again and again) which can be a pain in the neck.",
    "The cheapest shared hosting plan costs $8.47 per month and it will (in addition to the above-mentioned) allow you to host up to six websites, use a server located in the USA, utilize user-friendly cPanel, and a one-click installer by Softaculous. Something that isn’t included (yet it should have been) is an SSL certificate, which can be yours as an add-on costing $25 per year.",
    "With its shared, reseller, and VPS hosting packages Arvixe provides a generous 45-day money-back guarantee, which will give you plenty of time to go through everything before deciding whether you should stay or go.",
    "Arvixe supports payments via credit cards, PayPal, check, and money orders.",
    "Arvixe’s official site might not be too easy on the eyes, but it gives plenty of information about its plans (even entry-level ones) which should provide for easier decision-making than it usually is. At the very beginning, you’ll have information about the domain aliases, subdomains, and FTP accounts you’re allowed to create, and (here’s another good news) all of them are unlimited. You’ll also find all about the management and development tools, network and data safety measures, and more.",
    "After selecting a plan, the first thing you’ll have to deal with is your domain name, with options to register a new one, transfer an existing one or leave it with your current manager while updating your nameservers. The free domain registration feature applies to one-year contracts only (or above) and with selected domain extensions (fifteen are available at this time, including com, .net, .tech, .space, and .online). After this, you’ll choose a billing cycle (for every 1, 3, 6, 12, or 24 months) and consider adding some extras (such as CodeGuard daily backups, SSL certificates, ID protection, and Bing and Google advertising credit) for extra cash, mostly.",
    "Before checkout, you’ll want to create an account with Arvixe, and to do so you’ll have to hand over a fair share of your personal details and billing information, as well as to think up a strong password. After the transaction is complete, you’ll get your “welcome to the team” e-mail and your account should be activated without further delay.",
    "If Arvixe's dashboard looks and feels like that of many similar hosts, it's because it is powered by WHMCS, an industry-standard and easy-to-use web hosting management panel. From here you’ll want to enter cPanel which has access to a popular auto-installer by the name of Softaculous. Thereby, more than a hundred useful apps such as WordPress, Drupal, Joomla, and Magento should be put into practice within minutes and with minimum effort.",
    "If you would rather build your website with an easy-to-use website builder, Arvixe offers SiteBuilder, which is hardly surprising since both companies are children of the same mother (yes, EIG).",
    "After putting Arvixe’s main site to the test (courtesy of GTmetrix), we received some good and some bad news. The good one is that the page loaded quickly within 3.6 seconds, which is pretty close to the recommended loading time. In addition to this, most of the vital web metrics were above the average, all except for one.",
    "Enter total blocking time, a statistic that tells us how much time is blocked by scripts throughout the page loading process, and it showed lengthy 531 milliseconds (the recommended result is less than 150 milliseconds). This is the primary reason why the final GTmetrix rate was a modest C (76%), instead of something one could boast about.",
    "When it comes to uptime, Arvixe promises that its shared servers will be accessible 99.9% of the time in any month and adds that in case they fail to meet its uptime guarantee, their users are free to request a suitable amount of credit. Unfortunately, this doesn’t apply to unmanaged VPS and unmanaged dedicated server packages.",
    "With help of UptimeRobot (our tool of choice), we monitored the uptime of Arvixe’s main site for two weeks, during which we were unable to find a single trace of downtime. Although this is just a short-term test, it is still pretty encouraging.",
    "Although there have been several worrisome reviews questioning the quality of Arvixe’s customer support, at least you can get it around-the-clock (a cold comfort, we know). You can contact its staff via live chat, e-mail, and support ticket. We decided to try our luck with live chat support and got our reply within ten minutes. Although the response time wasn’t particularly fast, the reply we got was both friendly and informative.",
    "On the other hand, if you prefer to figure out solutions all by yourself, you can check Arvixe’s knowledgebase (titled “Support Center''), but don’t expect to be too impressed. To be fair, there are plenty of how-to guides and FAQs (over 350 of them as we write), however, their quality is constantly inconsistent. Some guides are detailed and easy-to-follow, others feel somewhat crude and unpolished, and one category (“Downloads”) is completely empty.",
    "Arvixe’s main page features a “Discussion Board” which sounds a lot like a community forum, however, clicking on it will redirect you to their status page. This is most likely a remnant of the forum that once was, but no longer exists (and regrettably so).",
    "One of Arvixe’s siblings (and a fierce rival) is HostGator, a similar US-based host offering everything from budget packages to those costing big bucks. Besides Arvixe offering no introductory discounts, the prices are pretty similar, as is their list of features. However, with Arvixe’s entry-level plan you can host up to six websites, while with HostGator’s plan you are limited to one.",
    "While we’re at it, let’s compare Arvixe with yet another of its siblings, a blue-eyed boy named Bluehost. Although they are pretty similar in terms of hosting plans, when it comes to pricing Bluehost is a bit cheaper (at least at first), while Arvixe provides a better value for money. In addition to this, Arvixe offers a 45-day money-back guarantee (while Bluehost provides a standard 30-day one), which gives you additional time to make up your mind.",
    "Another EIG-owned company with a peculiar name is FatCow, a highly experienced US-based company offering hosting services designed for individuals and businesses alike. Although FatCow is far from a bad host, in terms of plans, pricing and performance Arvixe is a clear winner.",
    "Last but not least of Arvixe’s competitors is Hawk Host, a Canada-based host with an animal mascot (much like HostGator and FatCow). In terms of hosting types and features, Arvixe and Hawk Host are quite similar. However, if you want to boost up your business with a dedicated server, with Hawk Host you’ll have to settle for semi-dedicated hosting, while Arvixe offers fully dedicated servers. On the other hand, you can pay for Hawk Host’s products with Bitcoin and Ethereum, while none of the hosts mentioned above accept cryptocurrencies at all.",
    "Although the stories paint Arvixe as a good host turned bad, to us it appears as an average host at its best. This isn’t the most pocket-friendly host around, but you won’t get caught off guard with price spikes or hidden costs either. It won’t overwhelm you with endless features but will equip you with everything essential for getting started. Its customer support isn’t the most responsive one, but at least you can count on it to be available at all times.",
    "In conclusion, if you still want to give Arvixe a chance, have a go at it, but bear in mind the length of their money-back guarantee (perhaps it will come in handy). If you'd rather not take a chance, HostGator and Bluehost are your safest bets."
  ],
  "headers": {
    "5": "Plans and pricing",
    "10": "Ease of use",
    "15": "Speed and experience",
    "19": "Support",
    "22": "The competition",
    "26": "Final verdict"
  },
  "links": {
    "Arvixe": "https://www.arvixe.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "FatCow": "https://www.techradar.com/reviews/fatcow",
    "Hawk Host": "https://www.techradar.com/reviews/hawk-host"
  }
}