{
  "source": "https://www.techradar.com/reviews/dc-universe-infinite-review",
  "title": "DC Universe Infinite review",
  "category": "entertainment",
  "updated": "2021-02-04T19:05:18Z",
  "author": "chris-aiken",
  "summary": "DC Universe is the Batman and Superman-themed alternative to on-demand comic service Marvel Unlimited",
  "verdict": "The DC Universe streaming service has become DC Universe Infinite, a comic book reading app in the vein of Marvel Unlimited. For a monthly subscription fee, you get access to a vast library of great comics featuring Batman, Superman and more – and while the app experience isn't perfect, there's a lot here for both old and new fans to enjoy.",
  "pros": [
    "Thousands of comics",
    "Great curated collection of books",
    "Strong interface that makes comics easy to read"
  ],
  "cons": [
    "Loses video content to HBO Max",
    "Not available outside the United States",
    "Can be difficult to read on phones"
  ],
  "article": [
    "DC Universe Infinite takes what was once a streaming service and strips it down to a single feature – reading comic books. That might seem like a downgrade from the variety of content the service offered before via the DC Universe app in the US (movies, television shows, animated features, and so on), but this new focus offers some serious upsides.",
    "Despite the revamp and loss of movies and television shows, DC Universe Infinite is not lacking in content or purpose. Now the app has become the key source for catching up on DC’s massive catalog of comic books, from famous storylines to popular series and recent events. If you've never read a Batman or Superman comic, you've now got decades' worth of material to enjoy for a monthly or yearly fee.",
    "Through the app, subscribers can access thousands of comic books across a variety of platforms, including mobile, tablet, or computer. The interface is mostly the same and all the features translate well, making reading comfortable no matter how readers choose to use the app. As with any digital comics subscription service, curation is an important part of helping to navigate the large resource of books available. It’s here that DC Universe has its ups and downs as far in terms of how it offers its content.",
    "Still, new and old fans looking to catch up on famous storylines, characters, or books now have an app that makes it easy to access and easier to read without breaking the bank. While fans of the previous DC Universe app may be disappointed that almost all of its video content has moved to HBO Max, most will still find that DC Universe Infinite is a worthwhile investment once they did deep into everything the app now offers.",
    "The original DC Universe made its debut in May 2018, offering up older movies and television shows based on DC comic book characters and stories, as well as original content like Harley Quinn, Titans, Doom Patrol, and Swamp Thing. It even streamed all of that live-action content in 4K Ultra HD.",
    "Before the arrival of HBO Max, video was the main offering of DC Universe – a large selection of comics books was available to read, too. All of this content was offered at the low price of $7.99 a month, making it a much more competitive option to similar apps like Marvel Unlimited, which are focused on comic books rather than video.",
    "Aside from the app’s loss of video content and focus on comic books, not much has changed since the app relaunched as DC Universe Infinite on January 21 2021 in the United States. The monthly subscription fee of $7.99 a month still applies and the annual subscription makes a return at $74.99, saving subscribers around $20 on the service for the whole year.",
    "New subscribers can even try the service out with a 7-day free trial, which is recommended if you want to see if the app fits into your lifestyle.",
    "The relaunch also means that previous subscribers will no longer be able to access the app through Roku, Apple TV, Android TV, Amazon TV and tablets and Xbox. DC Universe Infinite is only through iOS and Android phones and tablets, as well as online web and mobile web browsers.",
    "As of the time of publication, DC Universe Infinite is exclusively available in the United States. If you live anywhere else, don’t fret: DC plans to roll out the service for international folks sometime in summer 2021.",
    "DC Universe Infinite doesn’t break the mold when it comes to most comic book readers, which is a good thing. How you read comics on the app is probably the most important thing, and DC Universe Infinite implements smart view features similar to other apps like Marvel Unlimited and Comixology to offer a comfortable reading experience.",
    "A simple double-tap/click on a comic and the app will enter a panel mode that zooms in and out on panels, making it easier to follow the story of each comic book. And if you don’t feel like swiping to the next panel or page yourself, readers can turn on autoplay which sets each panel or page on a timer before it moves on to the next.",
    "Ultimately, how you read on the app is up to you. We found tablets to be the most comfortable option for reading books, as it mimics the page size of comics, which meant we spent less time having to zoom in on panels to read the text. On mobile and desktop, we often found the text was so small that we had to hold the phone really close or lean into the computer to read it.",
    "That’s not to say others will be completely uncomfortable using the app on the phone or computer, but panel mode almost becomes a necessity when using either one of those devices. Otherwise, you can download books if you want to read them on the go, and subscribe to your favorite series so you can enjoy new issues as they're added to the app. No matter which device you are using, too, books load up nice and fast.",
    "When it comes to navigating Infinite, users will once again find that it’s not that different from the original DC Universe app experience. In fact, DC Universe Infinite’s layout is exactly the same, except the movie and TV categories have been completely removed. Across phone, tablet, and web browsers, the app basically works in the same way.",
    "Its menus are clean, easy to navigate and you won’t get too lost exploring its different sections. You have a homepage which offers featured content, your reading history, latest releases, trending series, and several recommended lists. The comics section allows users to browse individual series, major storylines, get to know characters, and view showcased recommendations.",
    "What does set DC Universe Infinite apart from other comic book readers is its 'Get to Know' section. Here readers are presented with a random list of characters to learn about. For example, if you click on Robin in the 'Get to Know' section, you will find a list of recommended comics to read that will catch you up on everything you need to know about Batman's sidekick. Some of these curated lists even have encyclopedias or character profiles that give you detailed information on their origin, powers, and various appearances. It’s a cool feature that we haven’t seen in other apps likes Marvel Unlimited or ComiXology.",
    "Unfortunately, curation is a bit of a mixed bag overall. DC Universe Infinite is not starved for content, and the DC was smart enough to make a ton of curated lists for users to explore. These reading lists or playlists are exceptional, featuring comic books organized by various storylines, imprints, and characters.",
    "Where the curation falls apart is in how these feel randomly thrown into the app. Thankfully, filters make it easier to find this content, or specifically narrow down what you are looking for. The number of characters that are covered under the 'Get to Know' section is limited to 48, which will hopefully be expanded later on as more is added to the service.",
    "The sheer number of comics on DC Universe Infinite is the driving force of this app, and it's a massive selling point. DC Comics is home to characters from Batman to John Constantine, and the publisher's 80 years+ of comics are put to good use with DC Universe Infinite.",
    "Subscribers have access to over 22,000 comics from the start, ranging from some of DC’s oldest stuff to recent books. The only downside, like most comic book subscription services, is that the latest books will appear on the service six months after they hit the store shelves. The exception to this is DC's line of digital-first comics, which will release three months after their publication on ComiXology and other platforms.",
    "Still, the majority of readers will find this means they're not too far behind on the biggest stories currently happening.",
    "Modern classics like Dark Nights: Death Metal, Mister Miracle and Batman: Damned grace the front page of the app, quickly giving the reader a list of books they should be reading. The app does a great job of keeping users up to date on recently added books, what is currently popular, and what the most read books are overall.",
    "All of this encourages readers to make themselves more familiar with the best stories in the DC Universe, which is what we like to see in a new user experience. Honestly, what’s most worthy of your attention on DC Universe Infinite depends on if you are new to comics, or a fan who wants to catch up on stories you’ve missed.",
    "For those new to comics, they’ll find the books under the 'Get to Know' section the most valuable. While it doesn’t cover all of the hundreds of characters under the DC Universe banner, the essentials are there – mainly Superman, Wonder Woman, and Batman. Between the reading recommendations, articles and guide developed by the staff, and character profiles, every character’s 'Get to Know' section really puts together an excellent selection of old and new series, allowing you to pick up the basics nice and quickly.",
    "While you might think that more active comic book readers will find less that's worth reading on DC Universe Infinite, that’s actually not true. There's bound to be more than a handful of titles that these readers have missed out on, since buying individual comics can get incredibly pricey.",
    "Existing comic book fans will benefit the most from checking out books they were always curious about, but didn't want to drop money on at the time – maybe this is the time to catch up on Jeff Lemire's Animal Man run, for example. This makes for a cheap and effective alternative to buying collected digital versions of these comics individually from Amazon or ComiXology. The library is nice and comprehensive overall.",
    "Another big feature of the app that all subscribers will benefit from are the aforementioned digital-first comics and various imprints. DC's digital-first line will originally release on digital storefronts and the DC Universe Infinite app before moving to print. These stories were built to be read on digital platforms and feature several worthwhile series like Injustice, DCeased, Harley Quinn Black + White, and more.",
    "Meanwhile, publishing imprints like Vertigo and DC Black Label feature classic, mature, and self-contained stories like Hellblazer, Preacher, and Strange Adventures that expand the app's overall offering of comics.",
    "A few features are disappointing, though. The community and shop sections linked inside the app aren’t built into it. If you want to access those parts of DC Universe Infinite, it automatically bounces you to your browser on mobile and tablet. It feels less connected to everything else you can do within the app, which is sort of a shame.",
    "Still, overall, fans of DC Comics will find loads to love in the selection of comics here – whether you've read Kingdom Come 20 times, or you're picking up The Dark Knight Returns by Frank Miller for the first time."
  ],
  "headers": {
    "0": "The one-minute review",
    "4": "DC Universe Infinite price, release date and app availability",
    "10": "DC Universe Infinite app design and UI",
    "19": "DC Universe Infinite content",
    "31": "Don't subscribe to DC Universe if..."
  },
  "links": {
    "DC Universe": "https://www.techradar.com/news/dc-universe-streaming-service-is-like-netflix-facebook-and-comixology-rolled-into-one",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1039581119477603100&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fdc-universe-infinite%2Fid1329018000",
    "Android": "https://play.google.com/store/apps/details?id=com.wb.goog.dcuniverse&hl=en_US&gl=US",
    "Marvel Unlimited": "https://www.techradar.com/reviews/marvel-unlimited-review",
    "ComiXology": "https://www.techradar.com/news/world-of-tech/comixology-unlimited-isn-t-netflix-for-comics-but-that-s-ok-1322262"
  }
}