{
  "source": "https://www.techradar.com/reviews/panasonic-eh-na65-hair-dryer-review",
  "title": "Panasonic EH-NA65 hair dryer review",
  "category": "appliances",
  "updated": "2021-06-04T10:00:16Z",
  "author": "carrie-ann-skinner",
  "summary": "Fast speeds and an unusual design",
  "verdict": "The Panasonic EH-NA65 hair dryer is a mid-range hair-care appliance that’s speedy when it comes to drying hair. Comfortable to hold and easy to use, it’s built-in nanoe technology ensures shiny locks after every blow dry – although it’s marmite design won’t appeal to everyone",
  "pros": [
    "Fast drying speeds",
    "Shiny hair every time",
    "Choice of attachments"
  ],
  "cons": [
    "Unusual design",
    "Bulky"
  ],
  "article": [
    "Panasonic is a hair-care stalwart, having been manufacturing hair dryers for more than 80 years. While newcomers to the market including GHD and Dyson offer expensive hair-care appliances toting salon-style features, Panasonic gives them a run for their money with its mid-range appliances that offer plenty of technology tricks up their sleeves and prove to be some of the best hair dryers out there.",
    "The brand’s latest hair dryer, the Panasonic EH-NA65 enlists ‘nanoe technology’ rather than ionic technology, which uses negative ions to speed up evaporation of the water molecules and therefore drying time, and is found in many of the best hair dryers on the market to date.",
    "Unlike ions, which attach to the hair’s surface, Panasonic claims the nano-sized water particles created by the EH-NA65 penetrate the hair’s cuticle, reducing static, frizz and ensuring shiny locks after every blow-dry.",
    "The Panasonic EH-NA65 sports an unusual design that’s likely to divide opinion. Rather than a traditional-style barrel that’s wide at one end and becomes narrower towards the air outlet, the EH-NA65 has a nanoe outlet that sits on top of the barrel, set slightly back from the air outlet. This forms a hump on top of the barrel, which reminds us of the cockpit section on the exterior of an aeroplane.",
    "The 2000W hair dryer has four temperature settings, three speed levels and a cool-shot function. In the box you’ll also find three attachments that can help you achieve everything from a sleek, smooth finish to soft waves and gentle curls.",
    "The Panasonic EH-NA65 isn’t one of the more affordable hair dryers on the market. However, it’s certainly cheaper than professional-style hair-care appliances from Dyson and GHD, which are twice and, in the case of Dyson, three times the price of the Panasonic hair dryer. For those whose budget may be limited, but are wanting shiny locks every time, the EH-NA65 may be well worth the investment.",
    "The Panasonic EH NA65 will set you back $99.99 / £69.99 / AU$229.99 and is available worldwide from Panasonic and other online retailers such as Amazon.",
    "In the UK and Australia, a newer version is also available, which has the quick dry nozzle built into the hair dryer and a Scalp mode that increases moisture in the scalp to reduce dryness. Known as the EH NA98 is it priced at £129.99 / AU$349.99.",
    "The Panasonic EH-NA65’s unusual design gives the impression it’s going to be a heavy hair dryer, but weighing 1.3lb / 600g, it’s actually lighter than initially expected and comfortable to hold for long enough to fully-dry shoulder-length hair.",
    "As we’ve already mentioned, the EH-NA65 has a hump on top of the barrell, which does make it a rather bulky device; it measures 9.11 x 8.46 x 3.6 inches / 23.15 x 21.5 x 9.15cm (w x h x d). However, Panasonic has turned the hump into a design feature by accenting it in Rose Gold.",
    "In the UK and Australia, the hair dryer offers 2000W of power, four temperature settings and three speed levels – but in the US, the model comes with only three temperature settings, two speed levels and is 1875W. In all territories, the hair dryer has a cool-shot button that offers a blast of cold air to set your style.",
    "In the box you’ll find three attachments; a concentrator nozzle, diffuser, and a ‘quick dry’ nozzle. The latter splits the airflow into four sections – two strong streams in the center and two softer streams on each edge. Panasonic claims this speeds up drying time even further. The EH-NA65 also has a 9ft / 2.7m power cord, which means that those who don’t have a mirror conveniently located next to a power outlet will still be able to dry their hair. Plus, the hanging loop, often found on salon hair dryers, is a nice touch.",
    "We were impressed with how quickly the Panasonic EH-NA65 dried hair. On the lowest temperature setting and fastest speed, it took five minutes and eight seconds to take below-shoulder-length fine hair from damp to completely dry. Using the hottest of the four settings shaved one minute and 13 seconds off this time. However, on all settings hair was left looking shiny and smooth, with very few fly-away strands.",
    "Attaching the ‘quick dry’ nozzle and using the hair dryer on the fastest and hottest setting knocked a further 30 seconds off the drying time.",
    "Despite the EH-NA65’s unusual design, it felt balanced in the hand when blow-drying hair. In addition, the appliance was comfortable to hold, both in the left and right hands (we switched hands, depending upon the side of the head being styled). Note, though, that when drying the roots, we accidentally hit the cool-shot button several times while adjusting our grip of the unit, which is something to keep in mind. The removable filter is an added bonus, since it makes it easy to keep the hair dryer dust- and lint-free.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Panasonic EH-NA65 price and availability",
    "8": "Design",
    "12": "Performance",
    "15": "Don't buy it if..."
  },
  "links": {
    "best hair dryers": "https://www.techradar.com/best/best-hair-dryer-5-hair-dryers-for-smooth-and-shiny-styles"
  }
}