{
  "source": "https://www.techradar.com/reviews/qustodio-professional-for-business",
  "title": "Qustodio Professional for Business review",
  "category": "computing",
  "updated": "2021-01-14T06:26:00Z",
  "author": "mark-pickavance",
  "summary": "Parental control software adapted for business",
  "verdict": "A tracking system that has its origins in a parenting tool to keep youngsters from harm on the internet. Therefore, it lacks many of the features that business might expect from a surveillance solution, and it also won’t work on Chromebooks or Linux.",
  "pros": [
    "Reasonable prices",
    "Device-locking ability"
  ],
  "cons": [
    "No Linux or Chromebook support",
    "Setup problems",
    "Lacking in features"
  ],
  "article": [
    "Qustudio is the maker of well-known parental control software for Internet-connected devices. It also produces a solution for businesses that can help them monitor how employees are using their devices and company internet resources.",
    "So how does it compare with some of the best employee monitoring software options available on the market today? That’s what we set out to discover in this Qustodio Professional for Business review as we look at its pricing, features, ease of use, and support.",
    "Pricing for Qustodio Professional is simple: you pay for the number of devices you need to monitor. Prices start at $34.95/month for five devices and go up to $194.95/month for 100 devices. If you need to cover more devices than that, you can contact Qustodio for large-volume discounts. Prices are 10% cheaper if you purchase for a full year.",
    "If you want to try Qustodio out first, there is a 30-day free trial period available, valid for five devices. There is also a 30-day refund period after purchase.",
    "Qustodio Professional aims to make device management simple. From a single, centralized dashboard, you’ll be able to manage desktop computers, laptops, tablets, and smartphones. Windows, Mac OS, iOS, and Android operating systems are supported but there is no support for Linux.",
    "After installing the Qustodio Professional apps on your organization’s devices, you’ll be able to view device usage in real time and see what your staff are doing online, including what they’re searching for. You’ll be able to prevent access to specific websites and enforce your company’s acceptable use policies. You’ll also be able to set alerts and track and check the location of devices.",
    "We mentioned that Qustodio is better known for its parental control software, and it seems that the Business version of the software is little more than a rebranded version of the one used for kids. It has little in the way of surveillance tools that most businesses would expect from this sort of solution. For instance, it doesn’t track emails or record keystrokes or screen activity.",
    "To get started with Qustodio Professional you’ll need to create an account, add a profile (user), and then add a device. For the last step, you’ll need to install the Qustodio software on that device.",
    "With those set up, you’ll then need to configure your organization’s rules. You can set rules for the category of websites that can be visited, e.g. blocking gambling or pornography websites. You can also choose to allow or block specific domains.",
    "You can set time usage limits, block certain applications, block incoming or outgoing calls on phones, even from specific numbers, or even lock a device completely.",
    "With the configuration complete, you’ll then see updates for your users and their devices on the activity pages. The information is displayed under four different tabs: Activity summary, Social activity, Web activity, and Activity timeline.",
    "We found the display of information inconsistent with information displayed on some tabs, but not others. The Web activity tab interface was clunky too, and not that easy to use.",
    "For Applications, Qustodio will show you what was opened, but not what was done with it. So, for example, if we sent an email, the software would show that the email program was used, but not record any of the email contents.",
    "We had some trouble installing and configuring Qustodio initially and had to contact support. There is a form you can fill out to submit a support ticket; however, it’s a little hard to find and you need to be logged in to your account first.",
    "On submission of the form, you can expect to wait one to two business days for a response. We did, in fact, get an email back a few hours later, saying that it was the weekend and they would get back to us on Monday, but it did include a link to a video on YouTube that provided us with the information that we needed.",
    "If you’re not convinced that Qustodio Professional has all the features your business requires, alternatives you might consider include BrowseReporter and Time Doctor.",
    "BrowseReporter by CurrentWare will track the websites your employees visit and record their app usage. It will also track mouse and keyboard movement, and capture screens remotely. Prices go from $39.90/year/license for 10 licenses up to $20/year for up to 249. Any more than that and you can contact CurrentWare.",
    "Time Doctor is another solution with a similar feature set to BrowseReporter, but with a large range of integrations with external online services like Slack and SalesForce, and a different pricing model. Prices range from $7/month up to $20/month for a single user, with higher-tier plans including more features.",
    "Qustodio Professional for Business has reasonable prices and an interface that is straightforward and not difficult to understand, if not always that user-friendly. But it is lacking in a lot of features that businesses would expect from an employee monitoring solution.",
    "Much of what it does include, like the monitoring of web activity and blocking certain websites, could easily be achieved with other solutions that many businesses would already have in place, like firewalls.",
    "Features like the ability to set time usage limits and lock devices are useful, but they’re not the primary concern of employee monitoring software, and there are better device management options for that sort of thing."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "7": "Interface and in use",
    "13": "Support",
    "15": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Qustudio": "https://www.awin1.com/awclick.php?awinmid=7874&awinaffid=103504&clickref=trd-us-8750248722000952000&p=https%3A%2F%2Fwww.qustodio.com%2Fen%2F",
    "best employee monitoring software": "https://www.techradar.com/best/best-employee-monitoring-software",
    "BrowseReporter": "https://www.currentware.com/store/product/browsereporter-employee-monitoring-software/",
    "Time Doctor": "https://www.techradar.com/news/time-doctor-employee-monitoring-software"
  }
}