{
  "source": "https://www.techradar.com/reviews/iphone-11-review",
  "title": "iPhone 11 review",
  "category": "phones",
  "updated": "2021-09-29T21:30:08Z",
  "author": "gareth-beavis",
  "summary": "The cheaper iPhone 11 is still one of Apple's top 2019 phones",
  "verdict": "The iPhone 11 – the successor to the iPhone XR – has gone from secondary handset to firmly taking the limelight. Offering most of the top-end camera technology of the powerful iPhone 11 Pro, it packs good spec and manages to do so for a lower cost than many would expect – this is the one to go for if you want a good value new iPhone.",
  "pros": [
    "Improved camera",
    "New range of colors",
    "Good battery life remains"
  ],
  "cons": [
    "Design is almost identical to XR",
    "No headphone dongle in the box",
    "Camera bump a little sharp"
  ],
  "article": [
    "The iPhone 11 was a big surprise, packing more advanced technology (namely in the camera capabilities and the processing power under the hood) at a lower cost than the iPhone XR's price in 2018. It combines a large 6.1-inch display with a premium-feeling body, and comes in an array of colors too.",
    "It's worth noting that the iPhone 11 isn't Apple's newest smartphone – that's the iPhone 13, which launched in September 2021 alongside the tiny iPhone 13 mini, the iPhone 13 Pro, and the bigger iPhone 13 Pro Max. It didn't improve much on the iPhone 12 range that released in 2020, but they're still the most powerful Apple phones on the market.",
    "Despite launching in 2019, the newer smartphones are pretty similar in terms of design but have improved camera sensors, a newer chipset and flat, not curved, edges – and they're 5G capable. They're significant upgrades in some ways, but the iPhone 11 is still worth considering, especially with significant discounts since it launched.",
    "The most eye-catching feature of the iPhone 11 is its imaging capabilities: with two sensors on the rear, you can now take wider-angle snaps alongside the ‘normal’ main images. These sensors are 12MP each, and are raised from the rear of the phone in a square glass enclosure - which we’re not enamored with visually.",
    "The night mode is the most impressive part of the iPhone 11's imaging quality, bringing brightness and clarity to impossibly dark scenes, and the Portrait mode, defocusing the background, is improved on the new iPhone too.",
    "The phone has lost some of the spotlight now that the iPhone 12 line is available. But not being the newest iPhone on the block likely means significant discounts on the iPhone 11.",
    "The design hasn’t been updated much from the iPhone XR in 2018, although there are now six colors – including a new lilac and mint green shade - to choose from. The edges of the iPhone 11 still have the same feel as the older iPhone 6, 7 and 8, although the larger 6.1-inch display in the middle takes up most of the front of the phone (although with slightly thick borders around the screen).",
    "That display is bright enough and responds well under the finger, with bright sunlight performance good and the overall movie and video streaming playback strong - although not in the same league as the OLED-toting iPhone 11 Pro range, let alone the iPhone 12 range.",
    "Apple claims that the battery life of the iPhone 11 is an hour longer than that of the impressive iPhone XR, and in our tests this largely bore out. We were able to eke 24 hours’ use out of it without needing to try too hard - although sadly there’s no fast charger in the box, so if you do deplete the power pack you’ll need to wait around three hours before it’s fully juiced up.",
    "The overall speed and performance of the iPhone 11 is robust - and especially so for the price. It’s still one of the most powerful phones out there, according to our early benchmarks.",
    "In reality that just translates to a solid experience when flipping in and out of apps - although we did note that the speed in firing up the camera was a little slow, and processing pictures took longer than expected for a modern phone.",
    "That said, given you can edit 4K footage at 60 frames per second on a smartphone, it seems like a pretty powerful device to have in your pocket - especially if you’re a social influencer.",
    "Overall the iPhone 11 is a triumph for Apple - if, for nothing else, the fact it’s managed to lower the price year-on-year. We feel enough people are going to be won over by the hard-working camera (check the night mode samples further down this review to see what we mean) and the safety that buying a modern smartphone gives you.",
    "You should be able to get years of use from this phone, and sure, you could also consider the iPhone 11 Pro or iPhone 11 Pro Max, or even one of the iPhone 12 models, if you want more power and higher spec, but we found the iPhone 11 to be fun to use and often outperformed what we would expect given the price - and that's a feat some wouldn't have expected from Apple.",
    "Update: Apple has confirmed the iPhone 11 will receive iOS 15 when it lands later this year, so you'll get all the latest features on this handset.",
    "The iPhone 11 release date was September 20, 2019 around the world, and it's readily available to buy in the US, UK and Australia. You can purchase it directly from Apple, and a variety of other retailers.",
    "The iPhone 11 price currently starts at $499 / £489 / AU$849 (for which you get 64GB of storage). That's a fair bit less than the $699 / £729 / AU$1,199 that it used to cost.",
    "There are, as usual, a range of storage options to go for, with the aforementioned 64GB model joined by a 128GB ($549, £539, AU$929) and a 256GB ($749, £749, AU$1,249) version that isn't sold directly by Apple anymore but may still be sold by third-party retailers, if you’re happy to spend more money to get extra capacity.",
    "You'll likely be able to find the phone for a little less with some retailers, carriers and networks. That's even more so the case now that the phone has been out for some time and been superseded by the iPhone 13. Below we've put together the best deals you can find today for the iPhone 11.",
    "This isn’t something we normally do, but we’re going to get right to the simple fact that the iPhone 11 camera is easily the standout feature on this handset.",
    "Apple has doubled the number of lenses on offer here: where the iPhone XR had one, porthole-like sensor on the rear, things are much more grandiose for 2019, with a whole window on the rear containing two 12MP sensors.",
    "Apple’s clearly going for an iconic and uniform look with the iPhone 11 range, with the Pro and Pro Max packing the same square lens bump on the rear.",
    "It takes some getting used to, almost to the point of it being too obtrusive visually, with your fingers playing across it far more when you’re holding the iPhone in landscape, but it actually isn’t as obtrusive as the bump on 2018’s iPhone, thanks to being ‘layered’ up from the back – the glass housing around the lenses is raised a small amount from the rear glass, and the sensors themselves a little more.",
    "It’s a wide-angle array – that’s to say you get the ‘regular’ camera you’ll find on every phone, plus an ultra-wide-angle lens that brings more of the scene you’re shooting into the frame.",
    "It’s a setup that’s pretty easy to use: a toggle at the bottom of the camera interface enables you to move between focal length, and you can hold this down to activate a scroll wheel with which you can more smoothly zoom in and out.",
    "There’s a slight judder when transitioning between the two cameras, and if you look closely you can see there’s a difference in the light sensitivity of the two sensors as well in the preview.",
    "The overall output is quite different - you’ll get a far darker photo when zoomed out, so we’d suggest only using the further-out sensor in a strong, bright scene and relying on night mode for the rest of the time.",
    "One thing that’s supposed to be simple is fixing your too-narrow photos when you could be using the ultra-wide lens.",
    "We saw in a demo how the iPhone 11 would be able to take a shot using the standard lens, but during our testing could not work out how to get access to the wider shot that’s supposed to be taken at the same time, so you can change the composition post snap.",
    "We activated all the right settings but making the picture wide after taking it is not something that’s going to be easy to do for most.",
    "(Side note: iOS 13 brings a feature we've been after for a long time: the capability to change the aspect ratio when you're snapping. You can choose square, 16:9 alongside the 4:3 standard image. However no matter the ratio chosen, it's still a 4:3 image on the phone.)",
    "Let’s talk about something that does work well – the low-light performance. Historically Apple’s iPhone cameras have never been great here, but with its improved AI smarts the iPhone 11 is capable of rendering some amazing night snaps.",
    "Whether you’re in a sort-of-dark situation, or focusing a tripod-mounted phone at the night sky, there’s a setting that enables you to make what would normally be a badly-lit photo look as clear as… well not quite as clear as day, but wonderfully bright.",
    "This works by the iPhone 11 automatically telling you to hold the handset steady for 2-5 seconds so that the shutter can stay open for longer; the phone then captures a number of photos at different exposures and sharpness levels, before merging the data to produce the very best photo possible.",
    "If you’ve braced or mounted the phone securely, the capture time can be extended to up to 30 seconds – this is only really necessary if you’re going to be taking photos of the night sky, and for general night shots we saw very little difference between the brightness of photos taken over 5 seconds and 30 seconds.",
    "The results are startling, elevating Apple to the level of Huawei, Samsung and Google when it comes to taking low-light and night photos – and in some ways enabling it to surpass its rivals. Night mode can make photos shot at 1am look as if they were taken in late afternoon, and if you can get your subjects to remain still, you’ll take great snaps.",
    "However, try to photograph a scene that includes motion – people dancing at a concert, for instance – and it’s a world of blur. You’ll need to manually turn off night mode, and that’s a little bit of a nuisance when you’re trying to get a quick snap.",
    "Talking of speed, there’s a nice new feature added to iOS 13 whereby pressing and holding on the shutter button will allow you to take a quick video, Instagram-style, instead of burst mode photos (you can still do this by sliding your finger left; if you slide right instead recording will be locked, allowing you to take your finger off the shutter button to adjust exposure and zoom).",
    "This is a nice feature that’s going to appeal to those who want to share video clips to social media with ease. You don’t get the same low-light capabilities for video (more on that in a moment), but it’s smooth and defaults to the settings you’ve already set, so you can be shooting high-end 4K footage in a matter of seconds.",
    "We did notice on occasion that the iPhone 11 would show a black screen when we fired up the camera, meaning we would need to flick into another mode (like video or slow-mo) to jolt the viewfinder into showing something. We’ll keep an eye on this, as it’s likely something that will be fixed soon via an update, but it seems like a bug when starting the camera app.",
    "Deep Fusion",
    "There was one feature Apple made a huge deal of at the iPhone launch event, and it could be the thing that propels the iPhone to the head of our list of best camera phones, or at least gets it very close: Deep Fusion.",
    "This feature will take nine photos before you press the shutter button to take a snap, go through the information in each, and then on a pixel-by-pixel basis will decide how best to light and optimize the snap when you do take it. It was called “mad science” on stage – and if it works, we’ll be happy to go along with Apple’s description.",
    "We've yet to properly test this feature on the iPhone 11 as it was only introduced alongside iOS 13.2, but we're planning to include a full look at Deep Fusion in the review once we've had time to test it.",
    "Portrait mode",
    "With the addition of the second camera, Apple has made Portrait mode on the iPhone 11 far better than it was on last year’s iPhone XR – where last year software was used to help the iPhone know which was foreground and which was background, the extra sensor gives more physical information to help.",
    "It's not perfect – where a scene is divided into foreground subject and background, it sometimes leaves some blur around the object that’s supposed to be in focus (especially with hair) but it can take some decent snaps.",
    "New to the Portrait mode effects in iOS 13 is High Key Mono, joining the Stage Light and Stage Light Mono options – at times it looks arty and professional, but if that foreground image isn't captured precisely, it looks a bit poor.",
    "Movie recording",
    "Apple is making a lot of noise about how the iPhone 11 can shoot 4K footage at 60 frames per second (fps), and it's got good reason to: having such a feature on a phone at this price is going to be attractive to a lot of people.",
    "Shooting at 60fps will bring a certain fluidity to the shot, although some might not enjoy the effect as it doesn't look like the footage you’re used to seeing on TV.",
    "We also noticed a definite improvement in exposure and contrast, even over the iPhone XS from last year, with more definition and detail in the shadowy areas.",
    "The new iPhone 11 is a tool that those with some video-editing capability will be able to do a lot with; being able to tweak the filter effects, color balance and so on in the native Photos app is cool too, before you export to iMovie. It's not quite as advanced as other phones on the market in this regard, but it balances power and usability well, and is a worthwhile reason to buy if you're into quick video capture.",
    "Slofies",
    "We’ve had selfies, ‘bothies’ and ‘groufies’, and with the iPhone 11 Apple has added a new term to the lexicon of annoying front-facing camera slang: ‘slofies’. The front-facing snapper here can capture slow-motion video selfies, and slow + selfie gets you… yep, ‘slofie’. Thanks Apple – even selfie was bad enough.",
    "The results are good though, if you're into such things. The iPhone 11 will intelligently work out where to begin the slow motion sequence, or you can tweak it yourself in the editing app.",
    "The design of the iPhone 11 is rather similar to that of the iPhone XR from 2018; in fact, if you place it face-down and cover the camera, there’s very little to show it’s a new phone at all.",
    "You could, perhaps, tell by the new colors on offer – mint green, lilac and lighter yellow shades join the Product (RED), black and white variants on offer this year. But beyond that, the iPhone 11 and XR look identical from the front.",
    "On the rear, things are a little different. We’ve talked already about the unsightly camera bump on the back of the phone, but the iPhone logo has also been moved downwards and – in a new move – the word ‘iPhone’ is nowhere to be seen.",
    "This is something we expected to disappear, and it could herald the point in the next couple of years where we see the model number or name disappear completely disappear completely – the iPhone 12 could well be the new iPhone, as has become Apple’s practice with the iPad.",
    "(Or, it’s just redundant. What else is a phone with an Apple logo going to be called? In fact, it’s odd that it’s taken this long for Apple to drop the iPhone wording on the rear).",
    "If you’re reading this review wondering whether to go for the iPhone 11 or the new iPhone 11 Pro, then you’ll want to know the cheaper device is a little thicker - admittedly, only 0.2mm so, but you can feel the difference if you hold both.",
    "But that thickness doesn’t stop it feeling premium; the glass and aluminum combo might feel a little old, given it’s been used by Apple for so long, but given the iPhone 11’s price it certainly feels worth the cash.",
    "One the bottom of the phone you’ll still find the same old Lightning connector – we can’t help feeling that this will be replaced by a USB-C port in the near future, as it allows for faster charging.",
    "Unlike the bigger 11 Pro, the iPhone 11 has a 6.1-inch display that uses LCD technology rather than OLED, calling it ‘Liquid Retina’. That means you won’t get the richness of colors, nor the deep blacks and bright whites, that you’ll find on handsets with more advanced screen tech.",
    "You’re still getting a decent display here though, as Apple has crafted and calibrated the screen to be clear, bright and sharp, despite only having a resolution of 1792 x 828 pixels.",
    "That’s lower than the 2436 x 1125 of the iPhone 11 Pro, yet you don’t feel like you’re getting a low-res screen here – the brightness and strong color reproduction see to that.",
    "What’s less attractive is the thicker border around the outside of the display – these days we’re seeing a lot of phones, including ones with a lower price tag than the iPhone 11, come with edge-to-edge displays, and with no notch at the top .",
    "Clearly Apple still clearly believes that this is necessary to house the front-facing camera and advanced FaceID sensor to let users get into their phone.",
    "In terms of day to day use though, we found the iPhone 11’s screen to be clear, bright and easy to see even outdoors on bright days. It can run up to 625 nits of brightness, according to Apple, and that’s enough for us in most scenarios - blinding if you look at it on full brightness when opening your eyes in the morning.",
    "In terms of cinematic prowess, there’s no high dynamic range (HDR) playback here - so you get something called ‘Extended Dynamic Range’ - which doesn’t have the same capability as an OLED-toting iPhone at playing back top-end movies.",
    "The screen is slightly washed out in comparison to the iPhone 11 Pro Max, for instance, with the limitations of the LCD technology in the Liquid Retina display coming to the fore. It lacks the color depth and contrast ratio of the higher-spec phone, but is still perfectly serviceable for streaming Netflix or live sport, as we found in our testing.",
    "The iPhone 11 launched with iOS 13, and packs some nifty features as a result. We'll get to them below, but first it's worth noting that iOS 14 is now available for the phone. This adds some major new features like an App Library and home screen widgets.",
    "All of this builds on what was found in iOS 13, and the first thing we really like with that is that the OS now has more well-rounded, intelligent mini-notifications. That means that when you switch the phone to silent, or you change the volume, the little element that pops up to tell you what's happening is more useful and also interactive.",
    "It means, for example, that pressing a single volume key brings up a nice slider that you can control with a finger, rather than a box that covers the screen. It sounds minor, but such things will improve the way you interact with your phone day to day.",
    "FaceID has also had a much-needed upgrade – the field of view of the camera has been improved a fair bit, so you can glance at your phone from your seat and unlock it. While you may still need to move your face closer or lift the phone slightly, it's a big upgrade from what debuted on the iPhone X two years ago.",
    "This feature isn’t the result of new hardware though, and it’ll be coming to all iPhones launched in recent years – it’s just a case of Apple making better use of the information picked up by existing sensors.",
    "A couple of other new features we liked (not exclusive to the iPhone 11, but helpful nonetheless): swipe typing when using the keyboard, new Memoji stickers, and control of the Wi-Fi / Bluetooth options from Control Center.",
    "The new way of typing is great when you're trying to do things one-handed – while carrying shopping, for instance. The Memoji stickers need to be accessed from the side of the keyboard when composing a missive (they're not easy to see when you first open your messaging app), and offer something more personal: an image of your own face to punctuate your witty prose with pals.",
    "The ability to change Wi-Fi networks from within the Control Center is a really useful one – now you no longer need to open up the Settings menu to switch.",
    "That's iOS 13 covered, so what about the iPhone 11 itself? The new handset packs Apple’s new A13 Bionic chipset, and – according to spec leaks – pairs it with 4GB of RAM.",
    "That's a powerful combo, and our Geekbench testing returned a score of 3186, a real improvement on last year. This power is evident throughout the user experience, with everything as quick under the finger as you'd hope for.",
    "However, that's rather stating the obvious – smartphones became powerful enough to respond instantly to your every whim years ago, and it's in the nuances where we see the differences between the merely good handsets and the very best. The demo game we played on the iPhone 11 – Pascal's Wager – looked great, with all manner of shadows and reflections flickering about the screen, and ran fluidly.",
    "Our experience playing other, less-powerful games on the handset was just as we expected: everything looking bright and clear, with nothing in the way of slow-down, and racing games with scenery re-rendering quickly as we moved, and visual elements like water splashed about attractively..",
    "The iPhone 11 wasn’t quite so rapid across all tasks – saving photos or video to the camera roll sometimes took a second or two, but then again you’re processing large amounts of data (especially for Night mode or 4K video), so that’s perhaps to be expected; however, some people might expect performance to be instant all the time.",
    "Throughout our testing we didn't notice any real problems with the iPhone 11 – it's a smart and speedy handset, and delivers far better performance than similarly-priced phones on the market, as well as packing a more mature app catalog to augment your experience.",
    "There is one change that we want to highlight: as with the iPhone XR, there's no 3D Touch on offer with the iPhone 11, so pressing harder on the screen won't yield any new menus or additional functionality. Instead, it's a long-press-and-wait for new menus, or previews of things like web pages or Live Photos.",
    "That's fine, and the implementation works well when you get used to the 'rhythm' of having to wait – but it means that when you hold down on icons on the home screen you’ll now need to choose the option to rearrange apps (or wiggle your finger on the screen slightly), rather than it just happening naturally.",
    "One of the highlights of the iPhone XR was that it was easily one of the longest-lasting iPhones we’d seen, if not the longest-lasting.",
    "We were actually worried that our testing process had gone wrong in some way, such was the surprising performance, but it was true – and the iPhone 11 carries on in that vein. We found it to be essentially as good as the XR in terms of stamina, easily making it through to the end of a working day in our testing.",
    "On a low-use day we found that it held out for 27 hours – we took the phone off charge at 8.20am, and it finally gave up the ghost at 11am the next day when we employed it as a portable hotspot. This was still with around an hour of video streaming, some music playback, and about 45 minutes of photography thrown into the mix.",
    "With harder use, including a lot of app downloading and music streaming over Bluetooth, as well as regularly checking email throughout the day, it was dead just after 10pm. The iPhone 11 battery life didn't impress as much as that of the iPhone XR, but that's because we've quickly become used to the fact that a phone from Apple doesn't have to have an infuriatingly short battery life.",
    "That's not to say it's the best on the market – if you want a phone with the best battery life around, look to the Android stable, where there are some long-lasting phones indeed. However, if you're intending to stick with Apple, the iPhone 11 offers decent battery life, especially for the price.",
    "There’s no fast charger in the box with the iPhone 11, which is clearly a cost-saving move as the iPhone 11 Pro and Pro Max both have an 18W charger in the box, which powers up the iPhone 11 far more rapidly than the standard USB plug it comes with..",
    "To give you an idea of the difference when it comes to charging speeds, we tested using the slow charger in the box and a fast-charging unit separately.",
    "Using the standard, slower charger from the iPhone 11 box, after 20 mins it had gained 10%, and pretty much carried on that ‘1% every two minutes’ rhythm until fully charged.",
    "Using a fast charger, in 24 minutes the iPhone 11 had gained a whopping 35% charge, and by 12:03 was at 75%, where we needed to remove it to take it on the go. To get a largely-full battery in under an hour is brilliant, and we recommend you upgrade to a fast charger when you buy the phone.",
    "Also, if we’re recommending things, remember that the iPhone 11 supports wireless charging too, so getting yourself a wireless pad for home and for work will see you rarely with battery anxiety again - it’s a worthwhile investment, even if the charging is slower.",
    "First reviewed: September 2019"
  ],
  "headers": {
    "0": "Two-minute review",
    "15": "iPhone 11 price and release date",
    "19": "Camera",
    "56": "Design",
    "64": "Display",
    "72": "iOS 13, iOS 14 and performance",
    "88": "Battery life",
    "98": "Don’t buy it if…"
  },
  "links": {
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "iOS 13": "https://www.techradar.com/news/ios-13-release-date-features-and-everything-you-need-to-know",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news"
  }
}