{
  "source": "https://www.techradar.com/reviews/sony-a1",
  "title": "Sony A1 review",
  "category": "cameras",
  "updated": "2021-04-28T16:08:45Z",
  "author": "james-abbott",
  "summary": "An astonishing camera with a price tag to match",
  "verdict": "The Sony A1 is a truly remarkable camera that covers almost every photographic niche thanks to its high-resolution sensor, super-fast burst shooting, lightening quick AF, professional connectivity and 8K raw video. It’s a stunning camera to use and the image quality is second-to-none, but the price tag puts it out of the reach of the most photographers.",
  "pros": [
    "Captures incredible detail",
    "Blisteringly fast AF",
    "Super-speedy burst shooting",
    "Rare blend of speed and resolution"
  ],
  "cons": [
    "Prohibitively expensive",
    "Overkill for most photographers",
    "Menu system is complicated"
  ],
  "article": [
    "The Sony A1 is, in social media lingo, the camera equivalent of a 'flex'. With its rare blend of speed, high-resolution stills and 8K video, it's aiming to be the ultimate mirrorless camera and Sony's undisputed flagship – even if that results in a car-sized price tag.",
    "Its key selling point, if you're in a position to buy, is that it's probably the most versatile professional camera ever made. Not content with specializing in just one photographic area, the A1 (or Alpha 1, as it's otherwise known) is equally capable in the studio, on the touchline at a professional sporting event, papping celebs, in the jungle shooting wildlife and even shooting video on a Hollywood film set.",
    "The Sony A1's closest competitor is the Canon EOS R5, which also shoots 8K video (for more on that, read our in-depth Canon EOS R5 review). But it’s safe to say that in the stills department, the Alpha 1 trumps the R5 in multiple areas. This includes continuous frame rate with the A1 boasting 30fps compared to the R5 at 20fps, and resolution at 50.1MP compared to 45MP. Although realistically, neither camera is likely to entice photographers and videographers invested in either system to jump ship.",
    "The only real problem with the Sony A1 is that price tag; at $6,500 / £6,500 / AU$10,499 body-only, it’s an extremely expensive camera. If you only need high-resolution stills you could opt for the 61MP Sony A7R IV. Alternatively, if speed and professional connectivity are what you need, then the 24.2 MP Sony A9 II costs $4,500 / £4,800 / AU$7,299 and offers continuous shooting speeds of up to 20 fps.",
    "By matching your needs with one of Sony’s other full-frame cameras, you could save a considerable sum of money. On the other hand, you won’t be able to shoot 8K video with those cameras and the Sony F65 Cinema Camera costs a similar amount to the A1, but is a much larger and more specialized camera.",
    "But if you shoot a wide range of subjects and need both high-speed and high-resolution, this could be the one-body solution for you.",
    "Announced in January 2021, the Sony A1 will go on sale in late March with pre-orders currently available with several retailers.",
    "With a price tag that would make even hedge fund managers wince, the Alpha 1 is likely to be a niche camera, despite offering features that make it suitable for shooting practically every conceivable photographic subject – and that’s even before we factor in the 8K and 4K raw video features.",
    "At $6,500 / £6,499 / AU$10,499 body only, this camera is a serious investment that even some working professionals will struggle to justify. As a full-frame/35mm equivalent camera, the price point is encroaching on that of medium format cameras. Sure, you won’t find any sport or press photographers shooting with something along the lines of a Fujifilm GFX100S, but landscape and portrait photographers are a completely different story.",
    "Just to put this into perspective, the Fujifilm GFX100S costs $5,999 / £5,499 / AU$9,499, and offers just over double the resolution on a sensor that's 1.7x larger. But where the Sony A1 leaps ahead is with its all-round shooting power. For photographers shooting a diverse range of subjects, the Alpha 1 will remain an extremely attractive proposition despite that high price.",
    "At the heart of any camera is the sensor and processor, which other features and functions revolve around – and the Sony A1 is like a super-charged cross between a Sony A9 II and Sony A7R IV. Its 50.1MP full-frame Exmor R BSI CMOS sensor, which is powered by dual Bionz XR image processors, provides incredible image quality and speed.",
    "This combination not only serves up detail-rich images, it also allows the A1 to shoot at up to 30fps with a buffer that can capture up to 155 compressed raw files or 165 JPEGs with the electronic shutter. When shooting uncompressed raw files with the mechanical shutter, during testing we were able to capture approximately 67 images in each burst.",
    "Another feature this combination helps to accommodate is the ability to shoot video at up to 8K at 30fps in 10-bit 4:2:0 and 4K at 120/60fps in 10-bit 4:2:2, recording in multiple raw formats including S-Cinetone and S-Log3. The latter is claimed to provide over 15 stops of dynamic range. The inclusion of S-Gamut3 and S-Gamut3.Cine also make it possible to match footage with some of Sony’s cinema cameras and professional camcorders. Plus, there’s 16-bit raw output to an external recorder via HDMI.",
    "It’s not often you hear much about a camera's shutter, but the Alpha 1's dual-drive mechanical shutter is quite a marvel. It offers both standard and silent shooting, although even when not using the silent option the shutter is whisper-quiet, which is fantastic when shooting portraits, events and, of course, wildlife. The electronic shutter is, as you’d expect, silent and vibration-free.",
    "For photographers using flash, the sync speed of the mechanical shutter is 1/400 sec, which is fantastic for high-speed photography and also provides creative possibilities for portrait photographers. When shooting with the electronic shutter the sync speed is 1/200 sec, which is a first for Sony's A-series cameras.",
    "Despite the Alpha 1's speed and resolution, the camera provides a dynamic range of 15 stops for stills and over 15 stops for video. Combined with the five-axis optical in-body image stabilization (IBIS), which gives you a 5.5-stop shutter speed advantage, and high ISO settings available at ISO 100 to 32000 in the standard range and expanded from ISO 50 to ISO 102400, the Alpha 1 is perfectly configured for shooting in even the most challenging conditions.",
    "Take its Alpha 1 badge away, and the A1 looks very much like the Sony A9 II. This is a good thing, because that camera marked a sweet spot between its Sony A7 and A9-series cameras.",
    "Like the A9 II, the A1 has autofocus and drive mode dials on the left side of its top plate. On A7 models, these controls are tucked away in menus, but the direct access dials on the A1 are all about being able to change these settings quickly and easily.",
    "In the hand, the camera feels very much like other full-frame Sony mirrorless bodies and it uses the same NP-FZ100 battery as newer Sony Alpha models from the last couple of years, which means the camera will fit neatly into existing Sony kits. At 737g with a memory card and battery, the A1 is comfortable to hold with standard lenses, but when using larger telephoto lenses, a battery grip provides improved balance between the camera and lens and ultimately increases comfort.",
    "The button and dial layout of the camera is what you’d expect with A-series cameras and there’s nothing new here. In fact, it’s practically identical to the A9 II. On the right at the back of the grip there’s the memory card door, which features a lock and opens to reveal two slots that are compatible with both SD and CFexpress Type A memory cards – a great feature that means you don’t have to invest in new memory cards as soon as you buy the camera.",
    "Moving to the left, there are connections tucked away behind four tabs for a microphone, headphones, PC sync for flash, HDMI, USB-C, a multi USB terminal and the 1000BASE-T Ethernet offering lightning-fast connectivity. This is alongside Bluetooth 5.0 and dual-band WiFi connectivity and shows that this camera is designed for transferring images quickly and easily within a high-speed professional workflow.",
    "The LCD screen on the back is perfectly capable, although the resolution is 1.44-million dots (800 x 600 pixels) so it’s not the sharpest. Still, it's the 9.44 million-dot, Quad-XGA OLED electronic viewfinder more than compensates, not least because it features a refresh rate of 240fps.",
    "As a professional camera aimed in part at sports and wildlife photographers, it made much more sense for Sony to focus on the quality of the EVF, since this will be used way more than the rear LCD when shooting.",
    "Whether you shoot wildlife, sport, portraits, landscapes or anything else, the A1 is certainly no slouch and is more than capable of holding its own in any of these shooting situations. The camera is fast and capable in several areas, but the autofocus system is, in particular, incredibly powerful.",
    "The A1 features a 759-Point hybrid AF that covers 92% of the sensor, so you can place the active focus point(s) in almost any position in the viewfinder. Not to mention, phase-detection points in a high-density, focal-plane phase-detection AF system are designed to provide reliable autofocus in the most challenging situations.",
    "The sensor readout is claimed to be up to 120 AF/AE calculations per second, which is twice the speed of the Sony A9 II. This makes it possible for the A1 to focus successfully in challenging situations, but also provide real-time Eye AF of humans, animals and birds. For the latter, algorithms maintain tracking even when a bird moves rapidly or the composition of the shot is changed.",
    "The autofocus and AF tracking is nothing short of incredible. But it's not necessarily better than its stablemates in all situations. When we shot in a studio with just modeling lights on the flash heads turned on for focusing, plus a three-stop ND filter on the lens to allow for shooting at f/2.8 with flash, the A1 performed no better than other Sony A-series full-frame cameras. This wasn’t a scientific test and is an incredibly tricky shooting situation for most cameras, but given the high-speed credentials of the A1 and its generally impressive AF, this did come as a small surprise.",
    "Sony’s menu system for A-series cameras has long been a source of criticism. Firstly, there's the sheer size of it, then there's the fact that settings aren’t always where you’d expect them to be. Getting used to it remains a steep learning curve. Still, the A1 uses the same menu as the Sony A7S III, which provides color-coded sections to improve navigation and, strangely, a vertical design.",
    "Unfortunately, the color-coding makes no difference to accessibility, because this new menu sits vertically on a landscape format screen. The result of this is that menu items are smaller and harder to see, but most importantly this makes the notoriously cavernous and hard-to-navigate menus even trickier to use. Not exactly a great idea for a camera that’s touted for its speed, and ultimately a step back from the old menu that was far from popular.",
    "When it comes to image quality, the A1 certainly does not disappoint. The 50.1MP stacked CMOS sensor captures incredible amounts of detail that even studio photographers would be more than happy with.",
    "Not to mention, the 15 stops of dynamic range and excellent high ISO noise response that both contribute to the excellent image quality.",
    "To test the dynamic range, we shot images at the camera metered exposure as well as under- and over-exposed by three stops. The under- and over-exposed images were then corrected by three stops of Exposure in Adobe Camera Raw, and the results were as expected, despite the incredible 15-stop dynamic range.",
    "With the underexposed and camera-metered exposures, highlight detail remained in the sky, but with the overexposed shot, once corrected, the sky simply became a muddy grey with no detail.",
    "This is to be expected because when highlights are overexposed there is no image data in those areas, while highlight data in the metered exposure and underexposed shot remains intact, so detail remains available.",
    "In terms of ISO, noise is virtually undetectable up to ISO 3200. In fact, even ISO 12,800 remains usable. Beyond this setting, ISO 25,600 is just about usable, but higher settings display high levels of both chroma (color) and luminosity (grain) noise.",
    "These higher settings may be useful for press photographers for whom getting the shot can be more important than ISO noise, although sport and wildlife photographers will achieve the best results by remaining around and below ISO 12,800.",
    "Video quality is, as you’d expect, equally impressive, and the high ISO capabilities are extremely welcome in this area too. At the time of writing, there are few consumer-level applications for 8K video.",
    "But in professional workflows, this is a different story as videographers and filmmakers future-proof their footage by shooting at 8K, as well as taking advantage of the higher image quality you can achieve by shooting at a higher resolution and then downsizing footage to the final output resolution. For example, downsizing 8K to 4K or 4K to 1080p."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Sony A1 release date and price",
    "10": "Sony A1 features",
    "16": "Design, build and handling",
    "23": "Performance and autofocus",
    "29": "Image quality",
    "38": "Don't buy it if..."
  },
  "links": {
    "Canon EOS R5 review": "https://www.techradar.com/reviews/canon-eos-r5",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A9 II": "https://www.techradar.com/reviews/sony-alpha-a9-ii",
    "Fujifilm GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii"
  }
}