{
  "source": "https://www.techradar.com/reviews/trunkspace-hosting-vpn",
  "title": "Trunkspace Hosting VPN review",
  "category": "computing",
  "updated": "2021-01-19T18:50:29Z",
  "author": "sead-fadilpasic",
  "summary": "A solid VPN from a web hosting company",
  "verdict": "Aside from some minor issues, Trunkspace Hosting’s VPN product is a very good one, providing high download speeds, total anonymity and a range of payment methods. It also offers support for torrenting and access to geo-restricted content.",
  "pros": [
    "Solid speeds",
    "Allows selection of encryption level",
    "Speedy customer support",
    "Unblocks geo-restricted content",
    "Accepts cryptocurrency payments"
  ],
  "cons": [
    "No mobile apps",
    "Short money-back guarantee",
    "Low server count"
  ],
  "article": [
    "Trunkspace Hosting is a web hosting company founded in 2005 that offers several types of online services: VPN , VPS hosting, game servers, Teamspeak, dedicated server hosting and more.",
    "The company offers three pricing plans for its VPN product: monthly, six-monthly, and yearly. As usual, the cheapest among them is the longest package, which will cost you an equivalent of $4.16/month ($49.95 billed every 12 months). This sits right in the middle of the VPN industry’s pricing range.",
    "With one account, you’ll be able to cover up to 5 devices at the same time.",
    "This provider doesn’t have a free trial, so the only way to test its VPN service is to take advantage of the 7-day no-risk money-back guarantee. Accepted payment methods include PayPal, credit/debit cards, bank transfers, cash and prepaid gift cards, as well as cryptocurrency. The provider even offers Clan Pay/Group Pay payments so you can “share the bill with your friends”.",
    "Trunkspace Hosting’s VPN is a decent product, but still inferior to today’s most popular platforms in a few ways.",
    "For example, NordVPN, Surfshark, and CyberGhost are all cheaper than this solution, yet they offer longer money-back guarantee, nicely designed and feature-rich apps for all the major devices (mobile included) and thousands of servers all over the world.",
    "If you want a truly advanced VPN experience, meanwhile, look no further than ExpressVPN, which takes VPN service to a whole different level.",
    "Netflix, Hulu, HBO Go, and BBC iPlayer are just a few examples of popular VOD (Video On Demand) services whose localized libraries aren’t available in all parts of the world.",
    "People resort to various methods to access this type of content but the most popular one is using a VPN. Trunkspace Hosting’s VPN solution can get around the geo-blocks placed on content from various major streaming services.",
    "The company running this VPN, Trunkspace Hosting Inc., was established in 2005 and its headquarters are located in Montreal, Canada.",
    "Its VPN service offers access to around 100 servers in 49 countries, including Iceland, Isle of Man, Mexico, Moldova, Panama, Russia, South Africa, Turkey, Vietnam, and others.",
    "To protect your privacy on the vast expanses of the internet, Trunkspace Hosting VPN deploys the OpenVPN transfer protocol and data encryption via AES-256-GCM, AES-128-GCM (default), DES-CBC (backward compatibility with old routers). It allows users to select the level of encryption they prefer, giving them the choice between extra security and superior speeds. In other words, the better the encryption they choose, the more they’ll have to sacrifice in terms of speeds, and vice versa.",
    "Data authentication is conducted via 160-bit message hash 'SHA1' for HMAC authentication, combined with handshake encryption through TLSv1.2, cipher TLSv1.2, ECDHE-RSA-AES256-GCM-SHA384, and 2048-bit RSA.",
    "This VPN’s apps deploy a Stealth VPN option that simply obfuscates the data traffic, using OBFS4 from TOR in order to scramble the traffic and get through firewalls that attempt to block VPNs. This makes it suitable for use in even the most restrictive countries, such as China.",
    "The Windows app also has a \"leak fix\" option that uses OpenVPN block-outside-DNS, fixing DNS leaks and imposing UDP leaking methods specific to Windows. Users can also pick which domains can circumvent the VPN and be accessed via your normal connection. Exchanging large file types via torrenting and P2P clients is allowed.",
    "Looking for information on its data logging practices, we scanned Trunkspace Hosting’s Privacy Policy, where we discovered assurances that no data whatsoever is logged when using its VPN service, and this includes IP addresses, connection timestamps, disconnect timestamps, bandwidth usage, and DNS requests. The provider can achieve and guarantee this thanks to “having all log data output to /dev/null, so no data is stored anywhere for any length of time.”",
    "Trunkspace Hosting has VPN apps for Windows, Mac, and Linux only, but it can be set up on additional devices, including routers, Android, iOS, NAS, and Raspberry Pi devices, with the help of the third-party OpenVPN apps, configuration files, and some online instructions.",
    "Speaking of instructions, you can find them and other valuable information in the client area knowledge base and blog. If you prefer a more personal touch, then you should try contacting the customer support team via email, telephone, or opening a ticket. Regardless of the method you choose, someone will answer you ASAP, as we found when we emailed in.",
    "Due to a lack of any flashy features and extras, Trunkspace Hosting’s VPN apps are exceptionally easy to use. Switching servers is done in a single click but connecting can take a while (sometimes even failing to connect entirely).",
    "We conducted download speed tests on a 70Mbps testing connection. The results were quite satisfactory, with Belgium reaching an amazing 40.73Mbps, followed by the UK with a lower but still very good 17.22Mbps, and the US with an excellent 14.64Mbps. Vietnam did noticeably worse, hailing only 3.51Mbps, but this is often the case with such a far-flung location, relative to our own.",
    "Trunkspace Hosting VPN does a fine job of protecting its user’s privacy with advanced and customizable security methods, ensuring good download speeds, and allowing P2P traffic. It also unlocks a large amount of geo-restricted streaming content without buffering and offers various payment options.",
    "The areas in which this VPN must improve to be able to stand side-by-side with the industry’s hotshots include the size of its server network, offering native apps for mobile devices and the length of its money-back guarantee."
  ],
  "headers": {
    "1": "Price",
    "4": "Alternatives",
    "7": "Streaming",
    "9": "About the company",
    "11": "Privacy and encryption",
    "16": "Support",
    "18": "Speed and experience",
    "20": "Verdict"
  },
  "links": {
    "Trunkspace Hosting": "https://www.trunkspacehosting.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Privacy Policy": "https://www.trunkspacehosting.com/privacy-policy/",
    "blog": "https://www.trunkspacehosting.com/blog/",
    "email": "mailto:info@trunkspacehosting.com"
  }
}