{
  "source": "https://www.techradar.com/reviews/panasonic-toughbook-g2-rugged-2-in-1-windows-tablet",
  "title": "Hands on: Panasonic Toughbook G2 rugged 2-in-1 Windows tablet review",
  "category": "computing",
  "updated": "2021-09-20T18:18:29Z",
  "author": "anthony-spadafora",
  "summary": "A rugged 2-in-1 with a modular design",
  "verdict": "The Panasonic Toughbook G2 provides the power of a rugged laptop with the versatility and portability of a rugged tablet. While the optional keyboard dock expands the tablet’s functionality, the real star of the show is the device’s modular design and the user-removable xPAK expansion packs. The Toughbook G2 is also backwards-compatible with accessories from its predecessors, the Toughbook G1 and Toughbook 20.",
  "pros": [
    "FirstNet Ready",
    "Modular design",
    "Customizable buttons",
    "Backlit keyboard and desktop dock available",
    "Compatible with G1 and Toughbook 20 accessories"
  ],
  "cons": [
    "Heavy",
    "Poor trackpad"
  ],
  "article": [
    "With the release of its latest Toughbook, Panasonic has taken the difficulty out of having to choose between a rugged tablet or a rugged laptop. While the company’s Toughbook A3 rugged tablet runs Android, the Toughbook G2 is a versatile 2-in-1 that runs Windows 10 but will be upgradable to Windows 11 when the next version of Microsoft’s operating system releases this year.",
    "Although Android can be simpler to use, field workers often rely on Windows to access and run legacy software needed to do their jobs. Another upside to the Toughbook G2 is the addition of an optional keyboard dock that transforms the tablet into a laptop while adding extra USB ports. Panasonic has also designed its new keyboard dock in such a way that the tablet’s speakers and customizable buttons remain accessible.",
    "The Toughbook G2 is the predecessor to two devices: the Toughbook 20 released in 2013 and the Toughbook G1 released in 2016. Organizations that previously used either of the two devices are in luck as the Toughbook G2 is backwards-compatible with accessories from both of them including vehicle docks.",
    "Another interesting addition to the Toughbook G2 is that it uses the same modular design first introduced with the Toughbook 55. With Panasonic’s xPAK expansion modules, users can add additional functionality to the G2. With just a Phillips head screwdriver, you can swap out any of the four removable modules but we’ll cover that in more detail below.",
    "The Panasonic Toughbook G2 is available from Panasonic starting at $2,999 for the base version. It’s worth noting that this price is for the tablet itself while the keyboard dock will cost an additional $595. Those interested in buying the Toughbook G2 will need to contact the company’s sales department though the device is also available through Panasonic’s network of authorized reseller partners.",
    "At its essence, the Toughbook G2 is a rugged Windows tablet that weighs 2.9lbs (1.3kg) and has a 10.1-inch touchscreen with 1,000 nits of brightness. The screen, which has been treated with an anti-reflective coating, also supports gloved multi touch and its digitizer can be used with the attached stylus.",
    "In addition to the screen, the front of the tablet features two front-facing speakers, a 1080p webcam with a privacy cover and a total of eight physical buttons. While three are customizable, the others include volume controls, a Windows button, a button to toggle auto rotate on or off and a power button.",
    "The base of the Toughbook G2 has a 24-pin docking connector while the charging port can be found on the left side of the tablet. The right side of the tablet contains a USB-C port that can also be used for charging, a Type-A USB 3.0 port and an Ethernet port. All of the ports on both the tablet and keyboard dock are covered to protect them from water, dust and other materials that can be encountered while out in the field.",
    "When you flip the Toughbook G2 over, you’ll see the tablet’s fan along with the attached stylus. Our review unit wasn't a finished device and this is why you can see all of the modules at the back so easily. The battery and hard drive can both be swapped out and a variety of different xPAK modules can be installed in the top expansion area, the rear expansion area and the SSD expansion area.",
    "The optional keyboard dock adds an extra USB-C port on the left side as well as an extra USB 3.0 port on the right side. It also includes its own charging port so you can charge the tablet while docked as the tablet’s charging port is blocked when inserted into the dock.",
    "The backlit keyboard has a full set of function keys and there are arrow keys on the bottom right of the keyboard. A small trackpad with physical left and right click buttons is housed below the keyboard. Finally, the keyboard dock also adds a handle which needs to be fully extended when using the tablet in laptop mode as the tablet itself is heavier than the dock.",
    "The Toughbook G2 is powered by a 10th Gen Intel Core Processor (Quad Core) with Intel vPro technology. Customers can choose between an i5 or i7 processor when configuring their device and while the base version features 16GB of DDR4 RAM, this can actually be doubled to 32GB. In terms of storage, the Toughbook G2 can be outfitted with either a 512GB or 1TB quick-release OPAL NVMEe SSD. The tablet’s SSD is also available in both a Standard and a Quick release model with the latter being ideal for data sensitive sectors such as emergency services, police forces and defense.",
    "The Toughbook G2 can run for 18.5 hours on a single charge thanks to its large 6,300mAh battery that takes three hours to charge. However, Panasonic also sells an optional bridge battery that can be swapped out without the need to recharge the device. The included AC adapter is quite long at around 11ft but organizations using multiple Toughbook G2 devices can opt for a Panasonic 4-bay Battery Charger so they always have charged batteries for the device on hand.",
    "In terms of connectivity, the Toughbook G2 features an Intel AX201 that includes Wi-Fi 6 and Bluetooth 5.1. Meanwhile, the addition of eSIM and 4G allows first responders and other mobile workers to stay connected while out in the field.",
    "During our time testing out the Toughbook G2, the device started up quickly and was easy to set up and configure. The physical buttons on the front of the tablet reminded us a lot of the Toughbook A3 but the addition of a Windows button and an auto rotate toggle button made using Windows 10 easier in tablet mode. The touchscreen is quite responsive and the attached stylus, which also features two buttons, can be used for signatures, taking notes and more.",
    "With the keyboard dock attached, the Toughbook G2 transforms into a rugged laptop with a carrying handle. While the keyboard was easy to use despite being compact and keys themselves have a nice travel to them, the non-clicking touchpad wasn’t nearly as impressive. Although the trackpad wasn’t as precise as the kind you find on business laptops, the physical left and right click keys are a nice touch.",
    "Along with the tablet and keyboard dock, Panasonic also sent over three xPAKs for us to test out.",
    "The Toughbook G2 we tested came with an Ethernet xPAK pre-installed but with just a Phillips head screwdriver, we were able to swap it out and test out the company’s thermal camera, contactless smart card and barcode reader xPAKs. There is also a USB-A and True Serial Dongle xPAK available.",
    "Finding a rugged tablet that runs Windows and can be transformed into a rugged laptop with a keyboard dock is no small order. Thankfully there are several other options to choose from though they lack many of the unique features of the Toughbook G2.",
    "The Dell Latitude 7220 Rugged Extreme Tablet also runs Windows, has customizable buttons on its front and can be turned into a laptop by attaching a keyboard cover. While the Toughbook G2’s keyboard dock uses a 24 pin connector and locks into place, the Latitude 7220’s keyboard cover which costs $349 connects magnetically and doesn’t include any additional ports. The device is equipped with an older 8th Gen Intel CPU and uses slower DDR3 RAM as opposed to DDR4.",
    "Another Panasonic device worth considering is the Toughbook 33. It’s the company’s first full-rugged 2-in-1 and features a larger 12-inch screen. While the Toughbook 33 also has hot-swappable batteries, the device can’t be extended with additional functionality as it isn’t modular. Just like with the Toughbook G2, the Toughbook 33’s keyboard dock doesn’t increase the tablet’s battery life.",
    "The Panasonic Toughbook G2 provides the best features of a rugged tablet with the additional functionality of a rugged laptop. The optional keyboard dock can be quickly attached and detached and thankfully Panasonic has included support for vehicle mounts and other accessories from the Toughbook 20 and Toughbook G1. The 4-bay battery charger also makes this device a great choice for organizations that have multiple Toughbook G2 devices as it only takes a minute to swap in a new battery.",
    "The extra USB-C and USB 3.0 ports in the keyboard dock are a nice addition and we liked how the handle is used to carry the device as well as keep it from falling over when used in laptop mode. Still though, we wish the trackpad was a bit more accurate so we didn’t have to rely on the touchscreen or stylus.",
    "The Panasonic Toughbook G2 is a worthy successor to both of its predecessors and organizations that have used Toughbook devices in the past will likely want to upgrade for the additional functionality offered through Panasonic’s xPAK expansion modules."
  ],
  "headers": {
    "4": "Pricing and availability",
    "5": "Design",
    "11": "Hardware",
    "14": "Performance and in use",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "rugged tablet": "https://www.techradar.com/news/the-best-rugged-tablets",
    "rugged laptop": "https://www.techradar.com/news/best-rugged-laptops",
    "Toughbook A3": "https://www.techradar.com/reviews/panasonic-toughbook-a3-rugged-tablet",
    "2-in-1": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Toughbook 20": "https://www.techradar.com/news/mobile-computing/laptops/the-ruggedized-panasonic-toughbook-20-can-survive-6-foot-drops-and-scorching-hot-temperatures-1308524",
    "P": "https://na.panasonic.com/us/computers-tablets-handhelds/tablets/tablets/toughbook-g2?c3api=4452,124041321094,kwd-1393656592495&sc_mc=SEM_google_ai_PSCNA_Toughbook_product&aitrk=pan-tbsrc&_aiid=11864&teng=go&beng=b&deng=c&keng=+toughbook%20+g2&meng=b&peng=&ieng=124041321094&kieng=kwd-1393656592495&cieng=536264777690&cpieng=791511574&feng=&cleng=Cj0KCQjwssyJBhDXARIsAK98ITQ0kYCg0RjcaCU5_8GT4mAqoSv6zK5v9fQ9Kb-_dDIn5-GmdVXkuHAaApY1EALw_wcB&utm_source=google&utm_medium=cpc&utm_campaign=ToughBook",
    "anasonic Toughbook G2": "https://na.panasonic.com/us/computers-tablets-handhelds/tablets/tablets/toughbook-g2?c3api=4452,124041321094,kwd-1393656592495&sc_mc=SEM_google_ai_PSCNA_Toughbook_product&aitrk=pan-tbsrc&_aiid=11864&teng=go&beng=b&deng=c&keng=+toughbook%20+g2&meng=b&peng=&ieng=124041321094&kieng=kwd-1393656592495&cieng=536264777690&cpieng=791511574&feng=&cleng=Cj0KCQjwssyJBhDXARIsAK98ITQ0kYCg0RjcaCU5_8GT4mAqoSv6zK5v9fQ9Kb-_dDIn5-GmdVXkuHAaApY1EALw_wcB&utm_source=google&utm_medium=cpc&utm_campaign=ToughBook",
    "Panasonic 4-bay Battery Charger": "https://na.panasonic.com/us/computers-tablets-handhelds/tablets/tablets-accessories/fz-vcbg21m-panasonic-4-bay-battery-charger",
    "Dell Latitude 7220 Rugged Extreme Tablet": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4293050359102845000/https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/new-latitude-7220-rugged-extreme-tablet/spd/latitude-12-7220-tablet/xctol722012us?AID=5226272&cjevent=cf20ec270e0811ec82ea779d0a1c0e0e&cjdata=MXxOfDB8WXww&gacd=9614781-23761182-5750457-265988609-127889515&dgc=af&VEN1=12578053-5226272-02D3ibuXeNxHV4vR1kXMPik-Ziff%20Davis,%20LLC&dclid=CjkKEQjwssyJBhCsw_DvxNK-3e0BEiQAyQN4mQksRnnp0YtuvMnBu1qfo-pJtFNtYS4HuWiHFtV1XBXw_wcB&nclid=sT8e6Ne74IkO8kCpdY2NTFcmUGv2kQpIC8XKp3az-4pP-54pWhvtBTqhp1Ld0M1I",
    "Toughbook 33": "https://na.panasonic.com/us/computers-tablets-handhelds/computers/2-1s/toughbook-33"
  }
}