{
  "source": "https://www.techradar.com/reviews/joinme",
  "title": "join.me review",
  "category": "computing",
  "updated": "2021-02-17T18:05:10Z",
  "author": "michael-graw",
  "summary": "Videoconferencing for business teams",
  "verdict": "With its beginner-friendly user interface, ease of use, and collaboration features, join.me represents a viable choice for those looking for powerful video conferencing software for their business.",
  "pros": [
    "Includes built-in meeting schedule tool",
    "Easily swap presenters mid-meeting"
  ],
  "cons": [
    "Lacks some advanced features",
    "Quite expensive compared to other options"
  ],
  "article": [
    "Selecting the right video conferencing software for your business will make everyday communications a breeze. There are numerous options on the market, including leaders such as Zoom and Skype, along with various other smaller providers.",
    "In our full join.me review we take a closer look at this video conferencing and online meeting software provider. We analyze its plans and pricing, user interface, security, main features, customer service, and more to help you decide whether it’s an option worth using for your business.",
    "Since we wrote this review, join.me has been absorbed by its parent company GoTo. Existing clients can continue to use join.me, but all new users are directed to GoToMeeting, a very similar product offering near-identical services.",
    "If you want to sign up for a join.me subscription, there are three different payment tiers to choose from. Prices range from $10 to $30 per month, and all plans come with a 14-day free trial. All subscriptions are made on an annual basis.",
    "The Lite plan, at $10 per month, provides conferencing support for up to five participants per meeting. It also comes with unlimited toll and internet calls, screen sharing, various reporting tools, the ability to chat and send files, and more.",
    "Upgrading to the Pro plan ($20 per month) unlocks support for up to 250 participants per meeting, conference recording, and meeting scheduling, along with 50 GB of cloud storage. And finally, the Business plan ($30 per month) adds bulk user import tools, a Salesforce.com integration, and 1 TB of cloud storage.",
    "Ultimately, join.me openly advertises the fact that it doesn’t include a lot of specialized features with its platform. This is largely because it aims to deliver a simple, beginner-friendly video conferencing solution that does what it needs to without becoming cluttered.",
    "But don’t worry, you will find everything you need to conduct engaging, effective meetings without any issues. Included are a suite of video and audio conferencing tools, as well as various administrative control features.",
    "You can also schedule meetings by sending a personalized link through Outlook, Google Calendar, or any of numerous other platforms. The iOS Mobile Whiteboard allows you to create and share real-time illustrations, while the screen sharing tools let you share your screen with other members of a meeting.",
    "The bottom line: join.me provides the basic tools for streamlined video conferencing, but don’t expect anything too fancy.",
    "To get started with join.me, you can either subscribe to a paid plan or start a free trial. If you decide to test the program with a trial, you will be asked to create a new account and work through a simple six-step setup process. Then, you will be free to download the program and begin familiarizing yourself with the user interface.",
    "The user interface itself is extremely beginner-friendly and easy to navigate, if a little simple. Start by opening the desktop app and signing in. Then, you will be able to add participants to your room, share your screen, record what’s happening, and much, much more.",
    "Android and iOS apps with similar functionality are also available.",
    "When it comes to support, join.me could certainly do better. There aren’t any live support or email contact options, and the phone support is often busy with long wait times. It was nice to see the information submission form that you could fill out before making a call.",
    "Fortunately, there is a large self-help library filled with a great range of useful resources. Here, you will find numerous options. Begin with one of the getting started guides if you’re new to join.me, browse documentation about more advanced features, or look through various troubleshooting guides and advanced articles to solve common problems. Alternatively, use the built-in search bar to find relevant information in minutes.",
    "If you do decide to use join.me’s video conferencing services, you can rest assured that any data or other sensitive information you share is safe. For starters, all information, including voice, video, and message data, is secured with advanced 256-bit TLS encryption to protect it from malicious third-parties.",
    "Additionally, no information from your meetings is ever stored on the join.me servers, and any recordings are fully encrypted while at rest. Meeting links are assigned new random codes every time you start a new meeting, which reduces the risk of uninvited guests joining. You can even use the meeting lock feature to control who enters the room.",
    "If join.me doesn’t quite cut it for you, RingCentral could be a better choice. It provides high-end video conferencing solutions backed by a suite of powerful features, including integrations with Slack, Microsoft 365, Google Workspace, and various other platforms.",
    "Google Meet is another powerful choice, particularly if you already use other Google apps. Featuring streamlined integrations with the rest of the Google Workspace, very competitive prices, and a mobile-first approach, there’s little to not like here.",
    "All things considered, join.me is certainly a video conferencing option worth considering. Although its platform is a little basic and it lacks the advanced features some of its competitors include, there’s still a lot to like.",
    "For one, it’s extremely easy to get started with the 14-day free trial. The desktop and mobile apps are intuitive and well designed, and the security features are excellent. At the end of the day, we’d recommend starting with a free trial to help you decide whether join.me is right for your needs."
  ],
  "headers": {
    "3": "Plans and pricing",
    "6": "Features",
    "10": "Interface and in use",
    "13": "Support",
    "15": "Security",
    "17": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "join.me": "https://www.join.me/",
    "GoToMeeting": "https://www.techradar.com/reviews/gotomeeting",
    "Lite plan": "https://www.join.me/pricing",
    "Pro plan": "https://www.join.me/pricing",
    "Business plan": "https://www.join.me/pricing",
    "RingCentral": "https://www.techradar.com/reviews/ringcentral-video",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet"
  }
}