{
  "source": "https://www.techradar.com/reviews/lumie-bodyclock-luxe-750-dab",
  "title": "Lumie Bodyclock Luxe 750 DAB review",
  "category": "fitness",
  "updated": "2021-11-01T11:00:00Z",
  "author": "mark-mayne",
  "summary": "A premium sunrise and sunset alarm clock with DAB and Bluetooth",
  "verdict": "The Lumie Bodyclock Luxe 750 DAB promises more gentle, refreshing wakeups and a soothing wind-down at the end of the day. With DAB, Bluetooth and Aux inputs for audio, day and week alarms and an integrated bedside light, it’s a compact and stylish package that delivers in most areas. The downsides are a complicated setup, middling audio quality and substantial RRP.",
  "pros": [
    "Compact size",
    "Excellent light",
    "Solid audio options"
  ],
  "cons": [
    "Complex to set up",
    "Speaker not top quality",
    "Relatively costly"
  ],
  "article": [
    "The big pitch of the Lumie range of wake-up lights is that a gentle non-blue light that replicates the sunset and sunrise has big health benefits. How big is a matter for debate, but it is certainly less stressful being woken by gradually brightening light than the sudden blare of a traditional alarm.",
    "The Lumie Bodyclock Luxe 750 DAB tops the Lumie range, offering not only a medically-rated (class one) sunset/sunrise sleep-wake device, but also a DAB radio and Bluetooth speaker (with wires aux too). Being able to use the light as a bedside lamp is an added bonus, as is the USB charge port around the back.",
    "In many ways the Lumie Bodyclock Luxe 750 DAB combines all the things you might want on a bedside table, as well as offering a unique, more pleasant alarm system. The only major snags are that setup isn’t very intuitive, the audio quality is distinctly average, and the price is firmly camped at the premium end of town. However, there are few devices that combine so much bedside clutter, and the sunrise alarm is a genuine pleasure to behold.",
    "The Lumie Bodyclock Luxe 750 DAB was released in September 2017, and has a recommended retail price of £199 (about $270 / AU$360). That makes it one of the more expensive wake-up lights we've tested, and is around the same price as the Philips Somneo, which has a more stylish design but only offers FM radio, not DAB.",
    "The Lumie Bodyclock Luxe 750 DAB is Lumie’s flagship wake-up light, and visually has much in common with the other devices in the range. The cloth-covered base is available in five colours to match your home styling, and conceals the speakers to boot. A central light-sensitive auto-dimming display lets you navigate the interface, enormously aided by the two knobs either side, and a row of generously proportioned radio preset buttons grace the base.",
    "Around back there are USB-A and AUX inputs, the former also able to charge a phone/tablet overnight, an exceedingly useful addition. The main feature is of course the domed opaque light cover, which can be manually operated like a bedside lamp – plenty bright enough to read by.",
    "The vital statistics are a width of 23cm (9in), height of 20 cm (7.9in) and a depth of 13 cm (5.1in), making it a relatively compact package. It weighs 1.1kg (2.42lb), which makes it easy to move when needed, but provides enough heft to ensure it doesn’t skate around when you push a button.",
    "The Lumie Bodyclock Luxe 750 DAB offers broadly the same interface as cheaper models, but racks in plenty more tech options for music, essentially adding in a Bluetooth speaker as well as a DAB radio.",
    "Setting a basic alarm might sound straightforward enough, but as with other Lumi models, navigating the intricacies of sunset and sunrise settings can be initially confusing, resulting in subtle variations creeping in.",
    "That said, there’s lots to like here. The bedside light is controlled by the right-hand knob, a simple twist and light floods forth, intuitive and easy to dim to your taste. It’s bright enough to read by if necessary, but dimmed down its ideal for finding dropped items or dealing with restless children and other nocturnal emergencies.",
    "The DAB radio is a real asset too, easy to tune and save presets into (tab through the stations till the one you want to save, then hold the relevant preset button). The speaker quality isn’t that impressive, doomed by muddy highs at medium volume and a flat overall presence, but it’s adequate for playing a few tunes of a morning while getting up, or an audiobook in the evening.",
    "The USB-A will play MP3 tunes from a stick, although the folder structure has to be flat (one level) deep in order to navigate, so best used for a limited number of tracks. Of course, there’s Bluetooth here too, which happily syncs to a phone to really widen out your choices to all audio apps, from Spotify to Audible. The only downside of the DAB is the need for the old-school telescopic aerial, which extends to a substantial 60cm if required.",
    "The alarm might be complex to set up, but that’s partly a function of the sheer range of variables here. There are weekly and daily alarms to choose from, these can be combinations of light and sound, the latter chosen from 31 inbuilt sounds, the DAB radio or a USB drive. You can also choose duration, light levels, blue light levels and volume as well, making initial setup quite extensive. Indeed, your chances of getting the desired waking result first time and without extensive research in the user manual is very low indeed.",
    "The inbuilt sounds cover a truly impressive range, from a standard beep, waterfall, waves and white noise through to the genuinely bizarre - the brown-breasted bulbul being particularly specific. That said, sleeping through the ‘fairground music’ sample isn’t an option, and there are plenty of sounds to suit every taste here.",
    "First reviewed October 2021",
    "This article is part of TechRadar's Sleep Week 2021 (Sunday 31 October to Sunday 7 November) our in-depth look at sleep and how to snooze better. We've teamed up with experts in their field to bring you sleep techniques and tips to help you drift off easier, and have rounded-up the best sleep kit and Black Friday mattress deals to transform your bedroom into a den of zen."
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Price and release date",
    "4": "Design",
    "7": "Performance",
    "15": "Don't buy it if"
  },
  "links": {
    "wake-up lights": "https://www.techradar.com/best/wakeup-light",
    "DAB radio": "https://www.techradar.com/news/audio/hi-fi-radio/best-dab-radio-which-one-should-you-buy-901928",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Philips Somneo": "https://www.techradar.com/reviews/philips-somneo-sleep-and-wake-up-light",
    "TechRadar's Sleep Week 2021": "https://www.techradar.com/news/welcome-to-techradars-sleep-week",
    "Black Friday mattress deals": "https://www.techradar.com/black-friday/mattress-deals"
  }
}