{
  "source": "https://www.techradar.com/reviews/ibrave-hosting",
  "title": "iBrave Hosting review",
  "category": "computing",
  "updated": "2021-08-18T16:30:58Z",
  "author": "mirza-bahic",
  "summary": "Are you brave enough to put your website in the hands of this cloud-based provider?",
  "verdict": "iBrave Hosting is a US-based web hosting provider that offers affordable cloud-based solutions with an unmatched range of unlimited features such as bandwidth, storage space, databases, email account, subdomains and the websites themselves. However, its product range is limited as well as the support you're going to receive.",
  "pros": [
    "Simple and swift setup",
    "100% SSD storage",
    "Great value for money",
    "Unlimited pretty much everything"
  ],
  "cons": [
    "Limited support options",
    "Not many hosting options in general",
    "Official site doesn’t provide much information about the company"
  ],
  "article": [
    "In the iconic city of Miami (Florida, the USA), iBrave Hosting began its journey to become top-of-the-class web hosting provider specialized in cloud-based shared hosting solutions with as many unlimited features one can get away with. The company seems to be aiming at small businesses, e-commerce stores, personal blogs, photo galleries, portfolios and other profiles.",
    "The exact year the company was founded remains unclear, although they claim that their hosting platform was designed by “experts with over twenty years of industry experience”.",
    "Another information we couldn’t get hold of is the location of their data centers. However, since they provide a CDN (content delivery network), they should be operating across multiple data center locations throughout the world. The CDN includes their website acceleration suite, which should provide lightning-fast loading time for your website (or websites).",
    "iBrave Hosting’s official site bathes in pleasantly warm shades of red and yellow. Above all things, it feels user-friendly and everything seems to be at its rightful place. However, if you hope to find more about the company itself, its history and the minds behind it, prepare to be disappointed. The site is available in English exclusively and all prices are displayed in USD.",
    "After getting familiar with iBrave Hosting’s somewhat simplistic site, we didn’t expect it to feature a blog and (as you can imagine) it didn’t. Another aspect iBrave Hosting doesn’t seem to care about are social network sites, LinkedIn included.",
    "The major selling point of iBrave Hosting’s cloud-based shared hosting solutions are a wide range of features with as much unlimited resources as one could imagine. With that in mind, pricing seems rather reasonable.",
    "For instance, the most pocket-friendly plan (out of the three) is named “Startup”. It will cost you $4.95 per month, and if you submit for a whole year, you’ll get two months of free hosting. This plan includes an option to host one website, yet with unlimited subdomains, monthly bandwidth, SSD storage, MySQL databases and custom email addresses. To host unlimited websites, you’ll have to go with the self-descriptive “Unlimited” plan which goes for $ 24.95 per month, and this is their top-tier package.",
    "With all hosting plans you can choose to pay monthly, quarterly, semiannually, annually, biennially or triennially, and you can do so via all major credit/debit cards, Stripe and PayPal.",
    "iBrave Hosting provides a 30-day money-back guarantee with all its plans.",
    "Given that there are only three different-sized hosting plans to choose from, opting for one of them shouldn’t take more than a few minutes. It helps that all of them are easy-to-compare and listed together with all of their key features.",
    "With a “Startup” plan you can expect to get (in addition to everything listed in the previous chapter) a free website migration, a free Wildcard SSL certificate, free daily backups, free antivirus, free anti-spam protection and a free CDN. Clicking on “Get Started” will (obviously) get everything started and it begins with a domain. Here, you can register a new one, transfer an existing one or just use it without the transfer. The prices for a new one start at $6.99 per year, which is pretty reasonable.",
    "After this, you’ll be required to create an account (or sign in if you created one already) by providing your email address and creating a strong password. Also, make sure to read through terms and conditions so there would be no surprises, unpleasant or otherwise. Following verification via email, you’ll be asked to add further information (personal and billing) before making a purchase.",
    "iBrave Hosting’s client area is simple in design and user-friendly. From there you can manage your account information, order and manage services and seek support. Since iBrave Hosting doesn’t provide popular control panels like cPanel and Plesk, you’ll have to manage with their custom-made one, and it is (fortunately) pretty user-friendly.",
    "Thanks to their one-click installer, more than 80 of useful apps like WordPress, Drupal, Joomla, Magento and OpenCart can be yours in a matter of seconds.",
    "Other than this, you can use iBrave Hosting’s complimentary drag-and-drop site builder packed with numerous templates with which you’ll be able to build a beautiful site from scratch with no technical know-how.",
    "Considering that iBrave Hosting’s site doesn’t say much about anything, it is also rather quiet on the matter of speed. However, for the rhetorical question “Why iBrave Hosting” they highlight their “lightning-fast SSD storages” as part of the process to make every part of your hosting experience optimized for “maximum speed, security and user-friendliness”.",
    "Expecting them to deliver on what they've promised, we checked the speed of iBrave Hosting’s official site via GTmetrix and got just the opposite. We can give them the benefit of doubt that (for whatever reason) they may be using a different server than the ones their customers would be, but the results of the speed test must be reflected on.",
    "The site took a whopping 8.6 seconds to load completely, which is not only more than recommended, but over the average as well. What is more, every metric vital for measuring speed performance went over the recommended amount, resulting in an F (4%) as a final grade.",
    "As for uptime, we got somewhat better news. After monitoring the uptime of iBrave Hosting’s official site (via UptimeRobot) for two weeks (a bit more, actually), we got a report promising 99.96% uptime. There were, regrettably, three instances of downtime, but none of them lasted over 7 minutes straight, which shows a pretty speedy response from iBrave Hosting’s team.",
    "iBrave Hosting’s customer support staff can be reached via telephone, ticketing system and e-mail. There are also mentions of live chat, but it’s definitely limited, since it wasn’t available when we tried to take advantage of it. The site states that the support is “friendly” and available “seven days a week” but it does not specify when that is, so it’s safest to assume that they have business hours in mind.",
    "As for the self-support option, if you are not their customer you can read through a short FAQ section that deals with domain names and that’s about it. However, if you are a part of their client list, you should also gain access to support documentation and some how-to guides.",
    "Unfortunately, iBrave Hosting doesn’t provide a support forum where their customers could, in case support staff fail to respond, brainstorm a solution on their own.",
    "When it comes to unlimited hosting, both TMDHosting and iBrave Hosting are sure to fit the bill, however, there are differences. First of all, TMDHosting offers a wider variety of hosting types including shared, cloud, WordPress, VPS, reseller and dedicated server hosting, while iBrave Hosting provides three cloud-based shared hosting plans and that’s about it. What is more, with its shared and cloud hosting packages TMDHosting grants an incredible 60-day money-back guarantee, while with iBrave Hosting you’ll get a standard 30-day one.",
    "Another US-based host famous for its unlimited products is InMotion Hosting. In terms of features and pricing it is quite similar to iBrave Hosting. However, since all of InMotion Hosting’s plans come with an industry-standard cPanel (but plans from iBrave Hosting don’t), those who want to enjoy all benefits of probably the most user-friendly control panel out there will have to go with them.",
    "Both HostGator and Bluehost are well-known for their budget-friendly yet feature-packed hosting solutions with unmetered bandwidth, storage space and number of websites. What is more, both hosts provide a free SSL certificate, free CDN integration, user-friendly cPanel, one-click installs and free domain registration (that is, if you subscribe for a year at a minimum). There is also a money-back guarantee to soothe any needless angst in case you’re having second thoughts about your purchase.",
    "With a 30-day money-back guarantee, hosting with iBrave Hosting doesn’t really require great bravery. Therefore, if you are looking for an unlimited hosting solution for showcasing your portfolio online, opening a webshop or a small start-up, iBrave Hosting can fit the bill.",
    "With this said, we advise you to hunt for deals, since you can get a massive discount by being at the right place at the right time. Every now and then, iBrave Hosting offers a lifetime subscription for a one-time payment of $99.99, which is quite the catch if you are sure you want to use their services in the foreseeable future.",
    "However, if you can’t work without an industry-standard control panel or a superior round-the-clock support, check out hosts such as Bluehost, HostGator and InMotion Hosting before making a final choice."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "15": "Speed and experience",
    "19": "Support",
    "22": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "iBrave Hosting": "https://ibrave.io/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "Startup": "https://ibrave.io/",
    "Unlimited": "https://ibrave.io/",
    "TMDHosting": "https://www.techradar.com/reviews/tmdhosting",
    "InMotion Hosting": "https://www.techradar.com/reviews/inmotion-hosting",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}