{
  "source": "https://www.techradar.com/reviews/pure-air-pro-2021-electric-scooter",
  "title": "Pure Air Pro (2021) electric scooter review",
  "category": "appliances",
  "updated": "2021-06-03T11:36:45Z",
  "author": "tom-bedford",
  "summary": "Big upgrades and minor issues",
  "verdict": "The Pure Air Pro’s second-gen upgrade brings a few key changes, like a longer range, lower price and more powerful motor, which make it a great update for Pure’s most powerful vehicle. It’s also now the best-value member of its generation, taking that crown from the Pure Air which was 2020’s best Pure scooter. A few issues remain – driving fast saps the power very quickly, and the reported charge level felt inconsistent – but this is one of the best e-scooters you can buy right now.",
  "pros": [
    "Solid build",
    "High max range",
    "Cheaper than predecessor"
  ],
  "cons": [
    "Battery inconsistencies",
    "Quick battery drain when riding fast",
    "Very heavy"
  ],
  "article": [
    "Pure is one of the biggest electric scooter sellers in the UK, and it makes its own vehicles too – the new Air Pro (2021) is the second-generation version of its top-end scooter.",
    "This e-scooter has loads of improvements over the Pure Air Pro (2020), and so right out the gate, it’s easy to recommend the second-gen model as a better piece of kit than that original.",
    "With a 500W motor, 50km maximum range and lower price point, the Pure Air Pro (2021) beats its predecessor in a few key areas. Pure’s smartphone app has also launched since that first model was released, adding an extra level of functionality.",
    "That high-power motor makes the Air Pro adept at scaling hills, so while another scooter might slow dramatically on an incline, you won’t lose as much speed here.",
    "As with all previous Pure Air scooters, the Pro is a hardy vehicle, with waterproofing and loads of lights and reflectors. We rode the thing in wet conditions and at night, and always felt safe.",
    "On paper, the scooter’s 50km maximum range may be enough to win over customers – that’s an impressive distance for a scooter, with most hitting around 30-40km between charges. It’s worth noting, though, that the 50km figure is only for people riding at about 15kmph – travel at the maximum 25kmph and you’ll only get about half that distance.",
    "So while the range might be great for slower drivers, there are actually vehicles with better ranges if you travel quickly. The difference between those maximum ranges is pretty dramatic, compared to the competition.",
    "On the topic of the new Air Pro’s downsides, the other major one we had is that the battery level was often incorrectly reported via the scooter’s display, and the app. Sometimes we’d finish a journey with a certain amount of power left, then check the next day and find the percentage noticeably higher or lower. Sometimes the on-scooter display and app gave different figures too.",
    "The ‘range’ mentioned in the app can only be an estimate, since it depends on your travelling speed, but we found the unreliable battery figures could sometimes make us unsure of whether we’d need to charge before a journey or not.",
    "You’ll find the Pure Air Pro (2021) pretty heavy to carry too, and weighing 16.5kg it’s a bit chunkier than some competitors. Only buy this if you think you can carry that weight (or wouldn’t need to).",
    "In 2020, we named the Air (2020) the best scooter of Pure’s first generation of scooters, but thanks to its upgrades and lowered price, the Air Pro (2021) stands a good chance at being crowned the top model this time around. We’ll need to check the Air (2021) and the new Pure Go (2021) too, before we hand out awards.",
    "Costing a fair amount less than its predecessor, yet touting various upgrades, the Pure Air Pro (2021) is much better value than that previous version. In fact, with its new price it’s one of the most competitive mid-range scooters, and may even sway over people considering the non-Pro model.",
    "You can pick up the Pure Air Pro (2021) from the company’s website here. Pure also has brick-and-mortar stores around the UK.",
    "The scooter costs £599 (about $850, AU$1,100) – that’s cheaper than its predecessor which launched for £679 (roughly $890 / AU$1,230). To help you compare with the other scooters in the first- and second-generation Pure Air families, check out the graph below as well as some brief stat comparisons.",
    "Just bear in mind the 2020 model scooters aren't on sale any more - we've included them purely for context.",
    "One of Pure’s signature traits for its scooters are robust designs with an IP65 rating, plenty of lights and large 10-inch tires – this ensures the scooter will keep working for a long time, and will feel safe to ride. As the Pure Air Pro (2021) has a very similar design to its predecessor, that’s the same here.",
    "Well, the design of the new Pro (2021) is pretty similar to the 2020 model, but with lots of the non-Pro scooters’ DNA. We’re referring to the display, as the Air Pro has its screen mounted between the handlebars, with a button on the screen. Most Pure scooters have this, but the 2020 Pro didn’t.",
    "A change the 2021 Pure scooters make is having USB ports on the handlebars, so you can strap a USB-connected light to the front, or charge up your phone when you’re traveling (and, theoretically, therefore strap your phone to the handlebars and use it for directions). This could be useful, though it’s important to remember never to look at the screen while you’re actually moving (that would be pretty damn dangerous).",
    "The front of the handlebars boasts a front LED light and reflector, and there’s a bell on top too. The brake handle is on the left handlebar and the accelerator button is on the right one – this is pretty standard stuff.",
    "This accelerator is another aspect of the scooter where Pure has taken an element of its standard 2020 model and put it in 2021's Pro scooter, and it's much more comfortable and convenient than the Pro 2020's version.",
    "Looking down the scooter stem, there’s an easy latch for holding the bars up when you’ve unfolded the scooter. It’s easy to use and very secure, and is a premium feature the non-Pro scooters miss out on.",
    "The scooter’s board measures 116 x 50cm, roughly similar to last year’s model, and can actually be peeled away to reveal the battery (if you ever feel like replacing the internals yourself). Underneath there’s a stand that’s easy to kick out with your foot if you need. The whole thing supports riding weights up to 120kg, which is a standard for Pure’s vehicles.",
    "Both wheels have 10-inch diameters, which is pretty big. They’re filled with air but also have puncture protection fluid, so the wheels shouldn’t get shredded at the slightest provocation. The front wheel has reflectors on it, while the rear one has an LED light.",
    "The Pure Air Pro is very easy to fold down – it has a latch on the stem to release it, with a catch on the handlebars that attaches to a hook on the back wheel’s mud guard. The process is simple and quick, and when folded down, the scooter feels secure enough to pick up without falling apart.",
    "The scooter is somewhat of a burden to carry, though, because of its 16.5kg weight. That’s pretty heavy for a scooter, though not too far above average, but unless you’re strong it makes carrying the scooter long distances a pain.",
    "There’s no way of padlocking the Pure Air Pro like you would a bicycle – generally, scooters don’t have this design feature. The app lets you lock the thing, stopping the wheels from turning, but potential thieves can work around this by just picking up the scooter.",
    "As you’ve likely already read, the Pure Air Pro (2021) has a 50km max range, which beats out most of the competition. This is one of the scooter’s key selling points, making it vital for people who have long commutes.",
    "If you need a long-range scooter, though, there’s something you need to know: the Pro’s 50km range only applies if you’re traveling at the slowest of its three speed modes, at about 15km. Go at the max speed of 25kmph, and there’s no way you’re getting to the top max range.",
    "We’d estimate that, when traveling at top speed, you’ll travel about 25km – that’s a dramatic drop-off compared to the ‘true’ max range of the scooter, and notably a little less than the older Air Pro which went up to about 30km.",
    "Slower riders, or people with shorter commutes, won’t mind this range, and the improved motor still makes it a better choice if you’re in one of those categories. If you need it to quickly go far each day, though, it still might pose a problem.",
    "It’s a little hard to accurately ascertain the scooter’s range, though, because we got some pretty inconsistent readings in that department. We could travel the same route twice and end up with noticeably different amounts of charge remaining, even when accounting for variables, but the most noticeable problem was that the reported battery seemed inconsistent between platforms.",
    "Sometimes we’d finish a journey and have, for example, two of five bars of charge showing in the display. After turning the scooter off and waiting overnight, we’d find an extra bar had magically appeared. Sometimes the app and scooter would show different amounts of charge remaining.",
    "These discrepancies were never dramatic, and most of the time the charge went up overnight, not down. But it made it hard to work out if we needed to power the scooter overnight, or if we had enough power for the next morning’s commute.",
    "The scooter charges up in five and a half hours, according to Pure, which is one hour longer than the 2020 model. Just remember that you probably won't be charging the thing from 0%, though, so it usually won't take quite that long.",
    "The new Pure Air Pro sticks with the three riding modes its family members have - there’s a 15kmph, 20kmph and 25kmph mode, with the fastest one reaching the UK scooter speed limit. As we’ve already written, the faster you go, the lower your potential range.",
    "We generally find the fast mode is best for busier roads, so you can keep pace with traffic, but on quieter streets the medium speed is just fine.",
    "Riding is improved with the 500W motor. When you’re climbing hills, the speed drop-off is notably lesser than on the 350W Pure Air vehicles, letting you handle inclines without having to travel at a walking pace. You can accelerate to max speed pretty quickly too.",
    "In general, Pure Air scooters feel like comfortable and safe rides, and that’s the case here. There’s bountiful suspension so you don’t feel every bump in the road, acceleration is smooth so you’re at no risk of being shaken off the scooter when you speed up, and the brake and accelerator are both responsive and easy-to-reach. Pure remains the leader in comfortable scooting experiences.",
    "We did find that you have to kick off quite hard before engaging the accelerator - now and then we didn’t push off with enough vigor for it to work. The button on the display can be a little hard to reach when riding too, but since it’s only used for lights or changing the speed mode, you likely won’t want to use the button when riding.",
    "Something that’s great about the Pure Air Pro is its electronic braking system – it slows the scooter down smoothly, so instead of slowly braking before a red light, we simply stopped pressing the accelerator button and the scooter did the rest. On top of that, there’s energy recovery so doing this actually gives you a tiny bit more charge.",
    "Since the introduction of the 2020 Air scooters, Pure launched its tie-in app, so it’s ready to use for second-gen vehicles.",
    "The Pure Electric app, available on both Android and iOS, is quite a barebones affair, but that’s okay and it serves just as a useful extra. Unlike some scooter apps, it's absolutely not required for riding the vehicle.",
    "When you’re not riding, you can use the app to view the current charge and potential range to give an idea as to the remaining charge. You can also see the current speed which, of course, is only useful if you’re riding, and you can toggle the lights or lock the scooter.",
    "Because of the scooter’s USB port, you’re able to plug your phone in and use it while riding, but given the display already tells you speed and charge, it didn’t feel necessary to use the app when on the go.",
    "You can only use the app to see your data when the scooter is paired via Bluetooth, which means it needs to be on and nearby. This stops the app being useful as a way to view charge at other times, like checking if you need to power up the scooter when you’re away from it.",
    "First reviewed June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Pure Air Pro (2021) price and availability",
    "15": "Design",
    "23": "Portability",
    "26": "Battery",
    "34": "Riding",
    "40": "App",
    "45": "Don't buy it if..."
  },
  "links": {
    "electric scooter": "https://www.techradar.com/best/best-electric-scooters",
    "Pure Air Pro (2020)": "https://www.techradar.com/reviews/pure-air-pro-electric-scooter",
    "company’s website here": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-9035115636386542000&p=https%3A%2F%2Fwww.pureelectric.com%2Fcollections%2Fpure-electric-scooters%2Fproducts%2Fpure-air-pro-electric-scooter-second-generation%3Fgclid%3DCj0KCQjwna2FBhDPARIsACAEc_XWzIxix4I-2NouxU09YfDhmbRhAqzEVn01UpmS1u_muk4FSXXeYqEaAvl1EALw_wcB"
  }
}