{
  "source": "https://www.techradar.com/reviews/turbo-vpn",
  "title": "Turbo VPN review",
  "category": "computing",
  "updated": "2021-11-12T17:18:42.713Z",
  "author": "mike-williams",
  "summary": "A very simple VPN with an unlimited bandwidth free plan",
  "verdict": "Turbo VPN's commercial service is underpowered, overpriced, and not worth even a second of your time. The free version might be useful for basic unblocking tasks, but we wouldn't trust it with anything privacy-critical.",
  "pros": [
    "Free plan offers unlimited bandwidth",
    "Unblocks Amazon Prime Video",
    "Easy to use"
  ],
  "cons": [
    "Mostly below average speeds",
    "No Windows kill switch",
    "Many privacy concerns",
    "Expensive for what you get"
  ],
  "article": [
    "Turbo VPN is a popular VPN available for Android, iOS, Windows and Mac. Google Play alone reports that the app's free proxy version has had more than 100 million installs, and it's easy to see why: you get access to seven servers across North America, Europe and Asia, and there are no bandwidth limits or restrictions to hold you back.",
    "Download and install the app and you'll find it includes ads, but that's no surprise – if the service is going to be of any use, then money has to change hands at some point.",
    "There's no P2P support with the free or paid plans, but that's not really a surprise, either. Bandwidth is going to be in short supply for any provider with an unlimited free plan.",
    "Turbo VPN's website has very few details about the service. Supported protocols? Nope. Encrypted DNS? Don't ask us. Kill switch? The company isn't saying. This is a product aimed at folks who'll use it solely because it's free; if you're interested in the fine detail – or any details at all, really – you're going to be disappointed and may as well divert your attention to somebody like NordVPN straight away.",
    "Upgrading to a paid account drops the ads, gets you faster speeds, 23 locations, more servers, and allows connecting up to five devices simultaneously. The 1-month plan isn't cheap at $11.99 a month, but sign up for a year and the price falls to a reasonable $5, and the two-year plan is priced at just $4.17. You might save money with a few providers - Private Internet Access asks just $3.33 a month for its annual plan - but Turbo VPN still looks decent value. At first glance, anyway.",
    "Turbo VPN has completely rewritten its privacy policy since our last review. And that's very good news, as we found it was a mix of statements lifted from ExpressVPN's privacy policy, combined with vague and confusing nonsense which we struggled to understand at all.",
    "This time the text is more straightforward, starting with a lengthy list of details the company doesn't collect: browsing history, traffic destination, data content, DNS queries, incoming IP address when you connect, server IP address you're allocated, connection timestamps or session duration.",
    "The policy highlights some data collection, but nothing you wouldn't expect. Email address when you sign up, device ID codes to determine if you're using the free or paid plan, aggregated performance data (speed tests, connection failures) which aren't linked to your account.",
    "This reads better, but is it genuine, or has Turbo VPN simply rewritten it because we spotted their use of ExpressVPN text last time? There's maybe a clue in the Terms of Service page, which also looks extremely familiar.",
    "Take the opening lines, for instance: 'This is an agreement between you and Turbo VPN for Virtual Private Network (VPN) communications services, related services and features. It is NOT a service for the commission of criminal acts.' Nice. Distinctive. Eye-catching.",
    "Unfortunately, the document is also a very close match for this classic old PureVPN Terms page: 'This is an agreement between you and Purevpn.com for virtual private network communications services, related services and features It is NOT a service for the commission of criminal acts.'",
    "Although Turbo VPN adds its own text later, around the first 500 words are mostly taken from the older PureVPN page, with the company names changed (compare Turbo VPN's page and PureVPN at the Wayback Machine.)",
    "Maybe this is just cost cutting. 'It's difficult to set up a quality terms page, so, oh, I know, let's 'borrow' this one. No harm done.' And that might be true, but it still means we have very few reasons to believe what the company is saying, and some very good reasons to be suspicious.",
    "If Turbo VPN wants to be taken seriously, it needs to demonstrate that. Begin a blog where it can show its security knowledge and credentials. Fund open-source privacy projects, maybe. Build a track record showing its competence and honesty, and sign up for regular, in-depth and public security audits. Oh, and come up with its own contracts and small print. Until the company gets some way down that path, we'd recommend treating its claims with extreme caution.",
    "Turbo VPN's Windows app installed without difficulty, and there was no need to provide an email address or any other details – it was ready to go within a few seconds.",
    "The interface is as simple as we've seen. The app selects the nearest server by default, or you can choose from eight others with a click; there's a single button to connect or disconnect, and that's basically it.",
    "Settings are limited to a choice of protocol - IKEv2, OpenVPN, V2ray - and interface language (English, Russian, Spanish, Ukraine.) There are no protocol tweaks, no autoconnect, no DNS controls or anything else.",
    "The free version didn't allow us to set a protocol, but we found it connected via IKEv2. That's a fair choice, but it wasn't configured quite as well as we'd like. The connection is set only to 'require encryption', not the 'maximum strength encryption' used by the best providers. And IPv6 is enabled, leaving the chance of an IPv6 leak. This is still considerably better than nothing, but it's just not ideal.",
    "We upgraded to the paid version and checked out OpenVPN. This wasn't set up in a way that made it easy to inspect, but we noticed it used AES-128-CBC encryption. Again, that's most unlikely to be an issue, but it's not as strong as the AES-256-GCM and WireGuard connections used by many VPNs.",
    "In real-world use, we found connection times could be a problem. Occasionally they were just a few seconds, but often we'd be waiting for thirty seconds or more. Sometimes the client told us it had connected, but we couldn't access any website, and had to close the connection and try again.",
    "The client's 'Optimal Location' setting wasn't always as expected. As we were testing from the UK, we expected this to allocate us one of the UK servers, but we were often connected to the Netherlands, and a couple of times we even got an Indian IP. As the client doesn't display its preferred country, you'll only realize there might be an issue if speeds drop significantly.",
    "The client doesn't have a kill switch, but we were hoping it might at least warn us about a dropped connection and try to reconnect. But no: when we forced the VPN to drop, the client updated its interface, but didn't display any notification. If the client was minimized or behind some other app window, as it probably will be most of the time, there'll be no way to tell that your traffic is no longer protected.",
    "We checked out the Android app, too, but found no surprises. The interface has two tabs for its location lists – one titled All, the other Recommended – but otherwise it's very much the same look and feel, and there are still no settings or bonus features of any kind.",
    "The Android app doesn't have a kill switch, either. You can at least use Android's own, though, making you better protected than Windows users.",
    "Turbo VPN's app provides a Special tab dedicated to unblocking a handful of streaming sites: Disney+, ESPN, Netflix (US and Japan) and India's Hotstar.",
    "The company got off to a bad start, as it failed to get us into US Netflix. We tried three times, with different IPs, but no change.",
    "We had no success with Disney+, either. Maybe the Disney+ location would work for US Netflix? We tried, and - no, it didn't.",
    "Turbo VPN doesn't have a specialist location for Amazon Prime Video, but we tried the Disney+ and US Netflix servers, and it worked with both.",
    "We weren't so lucky with BBC iPlayer, probably as Turbo VPN only has one free UK location available. We tried that, with three different IPs, but failed each time.",
    "One success out of four is a poor result. Most decent VPNs unblock at least three of our test sites, and ExpressVPN, Hotspot Shield, Ivacy, NordVPN, ProtonVPN and a few others unblocked the full set.",
    "We measured Turbo VPN's performance by using multiple speed testing sites and services (SpeedTest's website and command line app, TestMy.net, Netflix' Fast.com, more) from a UK data center and a US location with a 1Gbps connection.",
    "We ran at least five speed tests at each site, using both OpenVPN and IKEv2 protocols, and repeated the full test group in both morning and evening sessions.",
    "US OpenVPN speeds were disappointing at 40-60Mbps. Most VPNs reached at least 150Mbps with OpenVPN, ExpressVPN hit 270-280Mbps, HideMyAss! managed an excellent 300-330Mbps.",
    "US IKEv2 download speeds reached 80-90Mbps, a welcome improvement, but still a long way behind the best. StrongVPN IKEv2 connections reached 260-280Mbps, for instance, while ExpressVPN managed an excellent 300-310Mbps.",
    "UK OpenVPN results saw far higher peak download speeds, with a range of 100-410Mbps. As the range indicates, results were very inconsistent, and you're far more likely to get scores at the lower end of that range, than the higher. But it looks like there's at least the possibility that Turbo VPN can deliver decent speeds.",
    "Turbo VPN could work as a simple free service for Amazon unblocking and low-res video streaming needs. It doesn't have the speed, platform support or privacy features to compete with the big-name VPNs like ExpressVPN, though, and we wouldn't even think of trusting it with anything confidential or sensitive.",
    "Other VPN providers we have recently tested include:",
    "VPN Gate, Seed4.me, Hideway VPN, BulletVPN, Tuxler VPN, VPNsecure, b.VPN, FastestVPN, X-VPN, SuperVPN, VeePN, ProXPN, Dashlane VPN, TouchVPN, Goose VPN, SlickVPN, Namecheap VPN and VPN Proxy Master"
  ],
  "headers": {
    "5": "Privacy",
    "14": "Apps",
    "24": "Netflix and streaming",
    "30": "Performance",
    "35": "Turbo VPN review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Terms of Service page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3115358464184011300&xs=1&url=https%3A%2F%2Fturbovpn.com%2Ftermsuse&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fturbo-vpn",
    "PureVPN": "https://www.techradar.com/reviews/pc-mac/software/utilities/purevpn-1325640/review",
    "Turbo VPN's page": "https://web.archive.org/web/20210115142536/https://turbovpn.com/termsuse",
    "PureVPN at the Wayback Machine": "https://web.archive.org/web/20140111080312/https://www.purevpn.com/term.php",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "WireGuard": "https://www.techradar.com/vpn/what-is-wireguard",
    "Hotspot Shield": "https://www.techradar.com/reviews/hotspot-shield-vpn",
    "Ivacy": "https://www.techradar.com/reviews/ivacy",
    "ProtonVPN": "https://www.techradar.com/reviews/protonvpn",
    "HideMyAss!": "https://www.techradar.com/reviews/hidemyass-vpn",
    "StrongVPN": "https://www.techradar.com/reviews/strongvpn",
    "VPN Gate": "https://www.techradar.com/reviews/vpn-gate",
    "Seed4.me": "https://www.techradar.com/reviews/seed4me",
    "Hideway VPN": "https://www.techradar.com/reviews/hideway-vpn",
    "BulletVPN": "https://www.techradar.com/reviews/hideway-vpn",
    "Tuxler VPN": "https://www.techradar.com/reviews/tuxler-vpn",
    "VPNsecure": "https://www.techradar.com/reviews/vpnsecure",
    "b.VPN": "https://www.techradar.com/reviews/bvpn",
    "FastestVPN": "https://www.techradar.com/reviews/fastestvpn",
    "X-VPN": "https://www.techradar.com/reviews/x-vpn",
    "SuperVPN": "https://www.techradar.com/reviews/supervpn-free-vpn-client",
    "VeePN": "https://www.techradar.com/reviews/veepn",
    "ProXPN": "https://www.techradar.com/reviews/proxpn",
    "Dashlane VPN": "https://www.techradar.com/reviews/dashlane-vpn",
    "TouchVPN": "https://www.techradar.com/reviews/touch-vpn",
    "Goose VPN": "https://www.techradar.com/reviews/goose-vpn",
    "SlickVPN": "https://www.techradar.com/reviews/slickvpn",
    "Namecheap VPN": "https://www.techradar.com/reviews/fastvpn",
    "VPN Proxy Master": "https://www.techradar.com/reviews/vpn-proxy-master"
  }
}