{
  "source": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
  "title": "Fossil Gen 5 smartwatch review",
  "category": "wearables",
  "updated": "2021-06-17T05:54:17Z",
  "author": "jennifer-allen",
  "summary": "The most high-tech Fossil yet",
  "verdict": "The Fossil Gen 5 is one of the best Wear OS smartwatches out there at the moment. That doesn't mean it's flawless, but it offers a decent battery life and plenty of features that should keep Wear OS fans happy.",
  "pros": [
    "Decent battery life",
    "Understated design",
    "Speedy to use"
  ],
  "cons": [
    "Speaker is subpar",
    "No ECG feature"
  ],
  "article": [
    "Fossil has a solid reputation for its smartwatches, making it a reliable source for anyone contemplating a Wear OS timepiece. Its latest entry - the Fossil Gen 5 - is the best of the bunch.",
    "That doesn't mean that it's perfect, as it lacks a few finer features that would make it an absolute must-buy, however when it comes to general all-purpose use, it's an attractive proposition for Android users.",
    "It's been a couple years since the Fossil Gen 5 came out, but its strong physical design and Wear OS software make it a serviceable wearable that you can probably get for cheaper this long after release.",
    "The Fossil Gen 5 may also be cheaper during Amazon Prime Day 2021, when many Wear OS watches are expected to go on sale. Check our review to see how this venerable design is considered in 2021.",
    "Here's our full verdict on the Fossil Gen 5 smartwatch and what works and doesn't work for it.",
    "Available in a few different variants, the Fossil Gen 5 seems ripe for price cuts in future. Our review unit was the Fossil Gen 5 Carlyle HR with a black silicone strap, however it's also possible to buy a brown leather strap version or stainless steel strap variant for the same price.",
    "The Fossil Gen 5 Carlyle HR is aimed at the male market, but there's also the Julianna HR which is a little more feminine in appearance.",
    "In all cases, it's possible to remove and replace the 22mm strap with any other similarly sized strap you might have lying around. Immediately, the Fossil Gen 5 is an attractive option for fashionista tech fans.",
    "It's currently available in the US, UK, and Australia, priced at £279 in the UK, $295 in the US, and AU$499 in Australia.",
    "The Fossil Gen 5 blends into whatever you're wearing or doing quite admirably. Its fully circular display is large at 44mm so it looks quite bulky on small wrists, but it means you can easily see the display at all times with minimal hassle.",
    "The watch we were sent had a black silicone strap which we'll admit feels a little cheap and basic to the touch. However, it does the job well enough. For the same price, you could get a stainless steel strap or leather version - both of which we'd suspect the average user would favor.",
    "Whichever you go with, at least you can easily swap out straps without any concerns surrounding proprietary connections here.",
    "The Fossil Gen 5 has three buttons on the side. There's the larger middle button which is a rotating crown for easily scrolling through options or the apps menu.",
    "In addition, there are two other buttons on either side of it that can be set as shortcuts. By default, one goes straight to the Fossil app while the other activates Fossil's Category setting, which tweaks the style and look of your watch at the touch of a button. We'd suggest immediately changing these around to more practical options such as Google Pay or Google Fit.",
    "On the back of the Fossil Gen 5 there's the optical heart rate monitor which sticks out slightly than with most smartwatches. It's not noticeable in use and also doubles as the perfect resting place for the magnetic charging puck.",
    "The Fossil Gen 5's display is the most eye-catching thing about it. It's bigger than most at 1.28 inches with a resolution of 416 x 416 and a pixel density of 328ppi. It's consistently sharp to look at, although we did find bright outside light made it trickier to see, with glare being an issue.",
    "Besides being bigger than some smartwatches at 44mm (the Samsung Galaxy Watch Active 2 for example can be had in a 40mm size), it's also quite thick at 12mm. On a small wrist, that makes a noticeable difference and means the Fossil Gen 5 doesn't lend itself to more delicate fashion requirements.",
    "It feels quite heavy too, weighing just under 100g, presumably because of its chunkiness. Still, it looks good.",
    "Those looks are further enhanced by Wear OS's consistently easy way of switching between watch faces. Like with other Wear OS watches, you can just press and hold on to the watch face to switch between different options.",
    "In the case of the Fossil Gen 5, the options are fairly varied, and you can easily find a mixture of stat heavy displays or those that look a bit more fashionable and stylish. And if you don't like any of the options you can always download more."
  ],
  "headers": {
    "5": "Fossil Gen 5 price and availability",
    "9": "Design",
    "15": "Display"
  },
  "links": {
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review"
  }
}