{
  "source": "https://www.techradar.com/reviews/logitech-ergo-k860-keyboard",
  "title": "Logitech ERGO K860 keyboard review",
  "category": "computing",
  "updated": "2021-03-16T16:38:53.142Z",
  "author": "rosario-blue",
  "summary": "Maximum ergonomic support",
  "verdict": "An impressive peripheral, the Logitech ERGO K860 keyboard does its job of providing support, comfort and reducing physical strain. It’s a little pricey, but has great features like its curved, split design, and a double-layered soft foam wrist rest with front end tilt legs. While initially awkward to use, you soon get used to it.",
  "pros": [
    "Very comfortable wrist rest",
    "Curved ergonomic design",
    "Front end tilt legs"
  ],
  "cons": [
    "Full-sized keyboard",
    "No backlighting",
    "Not easy to get used to"
  ],
  "article": [
    "The Logitech ERGO K860 ergonomic keyboard is a sturdy and thoughtfully-designed peripheral that’s great for long typing sessions, providing great support with its wrist rest and front tilt legs.",
    "Its design is sleek with a curved, split keyframe to provide full ergonomic support and improve posture; it’s black, professional-looking and uses Logitech’s PerfectStroke key system, which is similar to the scissor-key mechanism used on laptop keyboards. It’s sturdy and wireless and connects via Logitech’s unifying receiver USB dongle and Bluetooth. Meanwhile, its unusually-placed feet – at the front, not the back – can tilt the keyboard at 4 and 7-degree angles.",
    "The Logitech ERGO K860 Keyboard is priced at an expensive but forgivable $129.99 (around AU$230) and available for £100 on Amazon UK. It has a 2-year warranty.",
    "This full-sized keyboard measures 456mm wide and 233mm tall. There are 12 programmable keys on the top row, and up to three devices can be connected at once via Bluetooth or the 10m wireless range unifying receiver.",
    "Bluetooth is the most energy-efficient method, and when using the receiver, two AAA batteries are required, which according to Logitech have a two-year battery life.",
    "It was easy to set up, but Logitech provides a workstation setup guide that provides tips on aligning the keyboard for maximum comfort and efficiency. It’s compatible with Windows, from 7 to 10, Linux, Mac and Chrome OS. We wouldn’t recommend it for consoles (or gaming PCs), but that’s a personal option and depends on what you intend to use it for.",
    "For individuals suffering from repetitive strain injury or disabilities, and companies that want to reduce RSI (Repetitive Strain Injury) in its employees, Logitech has made a keyboard that will suit those needs.",
    "The wrist support is extremely comfortable, probably due to having a double layer of foam inside. Another massive plus for the K860 is that it’s compatible with Logitech Flow-enabled mice, so if you own an MX Master 2S, MX Master 3, MX Anywhere 3 or any other Flow-enabled peripheral from Logitech, you won’t need multiple receivers, as you can connect up to three devices at once.",
    "The Logitech ERGO K860's PerfectStroke keys are comfortable to use, but they’re not backlit. There isn’t very much else in terms of color, like RGB lighting, and the keyboard is only available in black. It’s definitely more of a professional work/office keyboard, so those features are not necessary, or suitable.",
    "Even though it takes time to adjust to its split-key design, the Logitech ERGO K860 is an impressive keyboard. The front end tilt support is interesting and refreshing, and helps keep your hands correctly perched above the keyboard.",
    "It’s definitely not for gaming, but great for typing all day, every day. One thing to bear in mind, though, is that the spacing of the keys can be a problem for programmers who mainly use the arrow keys when coding."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don’t buy it if…"
  },
  "links": {
    "workstation setup guide": "https://logitech.cfzu.net/c/221109/499820/8585?subId1=trd-us-1246205163083592400&sharedId=trd-us&u=https%3A%2F%2Fwww.logitech.com%2Fen-us%2Fpromo%2Fergosetup%2Fworkstation-setup.html",
    "MX Master 2S": "https://www.techradar.com/reviews/logitech-mx-master-2s",
    "MX Master 3": "https://www.techradar.com/news/logitech-mx-master-3-is-the-most-advanced-mouse-in-the-world",
    "MX Anywhere 3": "https://www.techradar.com/reviews/logitech-mx-anywhere-3"
  }
}