{
  "source": "https://www.techradar.com/reviews/ghd-flight",
  "title": "GHD Flight review",
  "category": "appliances",
  "updated": "2021-09-07T14:02:30Z",
  "author": "carrie-ann-skinner",
  "summary": "A compact, lightweight hair dryer that’s ideal for traveling",
  "verdict": "The GHD Flight is a lightweight hair care appliance, ideal for taking on the go. Simple to use, it may not be as powerful as GHD’s other models, but it still ensures hair is dried relatively quickly, and folds up for compact storage. However, it doesn’t have the ability to make shine like other hair dryers we’ve tested and there are cheaper travel hair dryers available.",
  "pros": [
    "Fast drying speeds",
    "Foldable design",
    "Dual voltage"
  ],
  "cons": [
    "Lacks additional attachments",
    "Filter isn’t removable"
  ],
  "article": [
    "GHD is most well known for its hair straighteners. The company has spent the past two decades offering ceramic-plated flat irons, taking over from steam-powered straighteners as the must-have tool for hair styling.",
    "However, more than nine years ago, GHD also dipped its toe in the world of hair dryers, and now offers three different models, the smallest and most compact of which is the GHD Flight. Designed to be packed in your suitcase, the GHD Flight is 50% lighter than the GHD Air, but offers 70% of the power, at 1400W, allowing you to dry your hair in a relatively short frame of time.",
    "The GHD Flight comes with a folding handle, which ensures the hair dryer takes up as little space in your suitcase as possible. It operates on both 120V and 240V electrical supplies, so it really can be used anywhere in the world.",
    "It has two temperature settings, along with a slower, cool-shot option for setting styles, and the hair dryer will automatically switch off if held too close to the hair when blow-drying to prevent overheating, too. In the box you’ll find a concentrator nozzle and a carry pouch.",
    "At $99 / £59 / AU$99, the GHD Flight is the most affordable hair dryer GHD offers, and is ideal for those on a budget. It also makes a great additional hair dryer for those who travel, easily slipping into a bag or suitcase, safe in the knowledge that it won’t send luggage over a weight limit. However, those looking for a hair dryer with a plethora of attachments to create a wide array of hair styles might be better looking elsewhere.",
    "The GHD Flight is the brand’s entry-level hair dryer and is priced at $99 / £59 / AU$99. It’s available from GHD or Amazon worldwide.",
    "GHD also offers a mid-range hair dryer, the GHD Air, which will set you back $199 / £99 / AU$220, while it’s top-of-the-range model, the GHD Helios, costs $249 / £159 / AU$295.",
    "The GHD Flight is the most compact hair dryer we’ve tested to date, measuring 9.6 x 5.2 x 2.7 inches / 24.4 x 13.3 x 6.8cm (h x w x d). It’s folding handle means its dimensions come down further still to 7.9 x 4.1 x 2.7 inches / 20 x 10.5 x 6.8cm. It’s lightweight, too, coming in at just 0.9lb / 422g.",
    "The hair dryer features a stylish matt black design, with a gold slider that lets you select one of the two temperature settings, or the cool-shot function for setting your hair after styling – a look that apes the GHD Air, although the gold band around the barrel of the Air hair dryer has been dropped in favor of a glossy black accent.",
    "As already mentioned, the 1400W hair dryer is dual voltage, so it can be used anywhere in the world. Simply use a coin to turn to the dial to select the correct voltage (either 120V or 240V) for the country in which you’re using it. The hair dryer has a 6ft / 1.8m cable and comes with a concentrator nozzle and a soft carry pouch in the box.",
    "The hanging loop is also a nice touch, and is usually a feature on hair dryers used in salons.",
    "Even though the GHD Flight offers less power than some of the brand's other hair dryers, it certainly isn’t sluggish when it comes to drying times. On the lowest temperature setting, it took 5 minutes and 52 seconds to take below-shoulder-length fine hair from damp to completely dry. Using the hottest settings shaved 1 minute and 51 seconds off this time. On both settings, locks were left smooth – although they lacked the shine we’ve achieved with other hair dryers, plus there were more fly-away strands than usual.",
    "We put this down to the lack of technology that uses negative ions to speed up evaporation and reduce flyaway strands.",
    "The GHD Flight felt balanced in the hand when blow-drying hair, and was comfortable to hold, both in the left and right hands (we switched hands, depending upon the side of the head being styled). The hair dryer was easy to fold into its more compact form, while the hinge felt durable and offered a reassuring click as the handle was moved.",
    "Also notable is the fact that the GHD Flight will automatically switch off if held too close to the hair, to stop the hair dryer from overheating. However, we were disappointed to find that the filter isn’t removable, which can make cleaning the hair dryer more difficult.",
    "For noise, the GHD Flight registered 77.8db on our decibel meter on its fastest setting. This puts it middle-of-the-range when it comes to noisy hair-care appliances, and is equivalent to the level of noise made by a vacuum cleaner. However, since it is likely to be on for only a few minutes at a time, it’s unlikely to bother too much.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "GHD Flight price and availability",
    "7": "Design",
    "11": "Performance",
    "16": "Don't buy it if..."
  },
  "links": {
    "hair dryers": "https://www.techradar.com/best/best-hair-dryer-5-hair-dryers-for-smooth-and-shiny-styles",
    "GHD Air": "https://www.techradar.com/reviews/ghd-air",
    "GHD Helios": "https://www.techradar.com/reviews/ghd-helios",
    "vacuum cleaner": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}