{
  "source": "https://www.techradar.com/reviews/vpnfacile",
  "title": "VPNFacile review",
  "category": "computing",
  "updated": "2021-03-18T16:28:44Z",
  "author": "sead-fadilpasic",
  "summary": "A VPN with questionable logging practices, but at least it unblocks Netflix",
  "verdict": "As the name implies, VPNFacile is easy to use, but it can also unblock multiple localized Netflix libraries and isn’t terribly expensive. That said, its download speeds are low, its server network tiny, and there is conflicting information on the website. Worst of all, we couldn’t find a no-logs policy anywhere.",
  "pros": [
    "Unblocks Netflix",
    "Supports P2P",
    "User-friendly"
  ],
  "cons": [
    "Below-average speeds",
    "Missing no-logs policy",
    "Mobile apps are too basic",
    "Limited server network",
    "Can’t unblock BBC iPlayer",
    "Information on the website needs updating"
  ],
  "article": [
    "VPNFacile is apparently a veteran VPN vendor, with over eight years under its belt and more than 100,000 customers.",
    "However, a company that has been in the industry this long should know that a missing no-logs policy sets alarm bells ringing and its mobile apps also leave a lot to be desired.",
    "The vendor’s cheapest subscription option is the one-year plan, at an equivalent of €3.25 or $3.95 per month (billed €39 or $47.39 annually), placing VPNFacile among the cheaper VPN services out there. Under one account, you can connect up to 5 devices at the same time.",
    "There’s no free trial on the table, but don’t worry, if things don’t work out you can make use of the 15-day money-back guarantee (note, the duration is listed a 14 days in certain instances).",
    "Accepted payment methods include PayPal and credit/debit cards.",
    "VPNFacile comes nowhere near today’s industry giants, like ExpressVPN, NordVPN, CyberGhost or Surfshark. It is more expensive than some of the competition yet has a smaller range of servers, few extra features and its apps and unblocking capabilities don't compare.",
    "Even though the website claims that VPNFacile unblocks BBC iPlayer, we had a different experience. At the time of writing, the streaming platform was successful in thwarting our attempts at watching its content with the help of VPNFacile. That said, our luck changed when it came to opening some localized Netflix content.",
    "The company running this VPN is called Easy Networks Solutions and is registered in Estonia. It currently offers access to more than 50 servers in over 30 countries, including Iceland, Fiji, China, Panama, Mexico, Pakistan, Peru, even Antarctica and North Korea, as well as others.",
    "Unlike VPNFacile’s mobile apps that are as basic as they come, its desktop apps have a decent amount of configuration options. These include a kill switch mechanism that blocks your entire internet connection if the VPN is terminated, DNS leak protection, a list of IP addresses to be excluded from VPN protection, protocol selection (TCP/UDP), and the option to launch the app discreetly (minimized). The kill switch is off by default so you’ll have to enable it if you want to make use of it.",
    "The provider uses OpenVPN (TCP and UDP), IKEv2, and L2TP connection protocols, as well as the SSL encryption. Thanks to these privacy mechanisms, you can use VPNFacile even in restrictive censorship-heavy countries and share large files via torrenting clients without any restrictions.",
    "We scoured the provider’s Privacy Policy but failed to find any information on what data is and isn’t logged when you’re using its apps. The only information we are given (in its Terms and Conditions) is that it records “your IP address and the time and date of connection to the service.” This is slightly concerning, considering you want the highest level of privacy when using a VPN.",
    "VPNFacile has user-friendly apps for Windows, Mac, Android, and iOS.",
    "At the time of writing, the Android app had been rated by 25 users and it has a score of 3.8 stars (out of 5). It has more than 1,000 installs but hasn’t been updated for over two years. Its iOS counterpart had a really low score, only 1 star, rated by 2 people.",
    "If you’re a bit more tech-savvy, you could install VPNFacile on Linux and routers as well, with the help of the provider’s manual installation guides. Although the installation guides are readily available, the rest of the information is scattered all over. For instance, it took us a while to find information on how many simultaneous connections are supported, as this isn’t immediately stated and there isn’t any sort of a knowledge base or FAQ section where you might find all the answers in one place.",
    "Instead, you could try a more direct approach, via email, contact form, or online chat via the blue button in the lower right corner of the website. The vendor also has a Twitter and Facebook account. We tried the contact form route but still haven’t gotten a response.",
    "The Windows app automatically starts in French, which was a bit confusing and it took us a while (more than we care to admit) to find the option to switch to English. Otherwise, it was pretty simple to use.",
    "We tested a few VPN locations using a 76.33Mbps connection and from a location in Southeast Europe. The results were below-average.",
    "First we tried a server in Germany, which gave us only 9.87Mbps via UDP protocol and 9.13Mbps via TCP. The results were slightly better for a server in the UK, which hailed 12.16Mbps via UDP and 8.15Mbps via TCP protocol.",
    "We then skipped across the Atlantic ocean to see how servers in the US would fare. We were disappointed with the download speeds via TCP protocol (2.60Mbps), whereas the UDP speeds were slightly better, at 10.17Mbps.",
    "Surprisingly, a server in India performed better than most others, delivering UDP speeds of 9.71Mbps and TCP speeds of 8.30Mbps.",
    "Considering VPNFacile has been around for eight years, we certainly expected more. Don’t get us wrong, the service performs its basic VPN duties, hiding your identity online, unblocking geo-restricted content, and allowing you to share large files via P2P clients.",
    "However, it pails in comparison to the VPN giants. It has no logging policy, offers average download speeds at best, provides access to only a few dozen servers and offers very little information on the website."
  ],
  "headers": {
    "2": "Price",
    "5": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "8": "Privacy and encryption",
    "11": "Support",
    "15": "Speed and experience",
    "20": "Verdict"
  },
  "links": {
    "VPNFacile": "https://vpnfacile.net/en/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "Privacy Policy": "https://vpnfacile.net/en/privacy-policy/",
    "Terms and Conditions": "https://vpnfacile.net/en/terms-and-conditions/",
    "Android app": "https://play.google.com/store/apps/details?id=com.easyns.vpnfacileandroid",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5230884003847674000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Ffr%2Fapp%2Fvpnfacile-net%2Fid1497422001",
    "email": "mailto:contact@vpnfacile.net",
    "contact form": "https://vpnfacile.net/en/contact/",
    "Twitter": "https://twitter.com/VPNFacile",
    "Facebook": "https://www.facebook.com/VPNFacile"
  }
}