{
  "source": "https://www.techradar.com/reviews/nikon-d3500-review",
  "title": "Nikon D3500 review",
  "category": "cameras",
  "updated": "2021-11-16T19:26:27Z",
  "author": "phil-hall",
  "summary": "Still the best DSLR for beginners",
  "verdict": "It's now over three years old, but the Nikon D3500 remains the best DSLR around for beginners looking to embrace creative, manual photography with a traditional setup. Built around a solid core of great image quality, intuitive menus and a superb battery life, the D3500 now offers impressive value, too. Mirrorless rivals should also be considered, particularly if you need a touchscreen or 4K video. But Nikon's entry-level DSLR continues to fly the flag for the format by offering the kind of handling and value that mirrorless cameras struggle to match.",
  "pros": [
    "Excellent image quality",
    "Remarkable 1,550-shot battery life",
    "Handy Guide mode",
    "Compact for a DSLR",
    "Easy to use"
  ],
  "cons": [
    "No 4K video",
    "No touchscreen control",
    "Bluetooth, but no Wi-Fi"
  ],
  "article": [
    "This product will likely be reduced in the Black Friday deals, and we’ll be conducting a re-review in the future. Features of the camera remain materially the same since our first review, but newer competitors may have different or better advantages in some respects. We've mentioned where appropriate when a competitor might be the better option.",
    "The Nikon D3500 might be well over three years old, but it remains our number one pick for the title of best beginner DSLR. Why so? While this is partly down to the lack of new competition – most manufacturers have now stopped making new DSLRs – it's also because the D3500 nails the basics in a way that few other cameras have managed.",
    "For starters, it delivers the three big advantages that DSLRs offer over their mirrorless alternatives: a superb battery life, great handling and good value. The latter is partly because the D3500 has an optical viewfinder, unlike the EVFs found on mirrorless rivals, but also because its huge range of native lenses are no longer new enough to command high price tags.",
    "While the D3500's age counts in its favor when it comes to price, it does mean it lacks some modern features. The first is a lack of 4K video capture, which is now standard on most new cameras, although if you're happy with 1080p resolution (or you're not that interested in video at all) that shouldn't bother you too much.",
    "Perhaps more limiting are the lack of an articulating screen and touchscreen functionality, which means the D3500 will take a little adjusting to for those coming from smartphones. If you think a touchscreen is a deal-breaker, then it's worth considering alternatives like the Canon EOS Rebel SL3 / EOS 250D, or a mirrorless camera like the Fujifilm X-T200.",
    "On the other hand, neither of those cameras come close to the D3500's 1,550-shot battery life, and it does compensate for the lack of a touchscreen with a handy 'Guide' mode for beginners, which takes you through the process of creating effects like a blurred background. This is a great way for inexperienced shooters to understand manual settings and start building their confidence and knowledge.",
    "What about image quality? The D3500's 24.2MP sensor produces impressive results, although you'll want to invest in some additional lenses to really see its potential.",
    "Fortunately, Nikon's DX system has a vast range of lenses to suit pretty much every shooting style and budget. We'd recommend buying the D3500 with the 'VR' version of its kit lens – the AF-P DX 18-55mm f/3.5-5.6G VR – as this brings handy vibration reduction for very little extra cost.",
    "Some more AF points would have been nice, but the 11-point AF system works fine for general shooting, and does the job for some moving subjects too.",
    "If you're looking for a smaller camera for travel shooting, then mirrorless alternatives like the Fujifilm X-T200 or Canon EOS M50 Mark II are worth considering. But as an affordable, beginner-friendly camera that'll teach you the nuts and bolts of creative photography, then the Nikon D3500 remains an excellent choice.",
    "The D3500 retains the same effective 24.2MP pixel count as the old Nikon D3400, but uses a newer sensor, and closer inspection of the specs shows that the total count on the D3500's sensor stands at 24.78MP, compared to 24.72MP on the D3400.",
    "The APS-C sized sensor (typical for an entry-level DSLR, and much larger than the sensors used in most compact cameras) in the D3500 also does away with an optical low-pass filter to help improve image quality.",
    "The D3500's ISO sensitivity range of 100-25,600 is also pretty wide, but doesn't improve on the D3400's range.",
    "Given that almost all mirrorless cameras (and even smartphones) offer 4K video, it's a bit disappointing to only see Full HD capture on the D3500. It's not all bad news though, as the D3500 can shoot at a smooth 60/50p, as well as 30/25p and 24p, while there are lower-resolution recording options as well.",
    "There's also no microphone port, so you'll need to rely on the D3500's built-in monaural microphones. If you're looking to shoot video regularly, you'll probably want to look elsewhere, but for those who only have need to capture the odd clip or two, it's a perfectly adequate set up.",
    "Nikon has also opted to carry over the same 3-inch display, with a modest 921,000-dot resolution, from the D3400. The screen is fixed, and sits flush with the body – if you want a DSLR with a vari-angle display then you'll need to look further up the range to the Nikon D5600 or at the Canon EOS Rebel SL3 / EOS 250D. It's also slightly disappointing to see no touchscreen functionality, a feature that would really lend itself to a entry-level DSLR, with touchscreens having become second nature for anyone using a smartphone.",
    "Complementing the rear display is an optical viewfinder. This is perhaps the most obvious feature that that distinguishes DSLRs from mirrorless cameras. Many similarly-priced mirrorless cameras either rely solely on the rear screen for shooting, while others will feature electronic viewfinders (EVF) with fairly modest resolutions (at this price point).",
    "EVFs certainly have their advantages, especially as you can see the exposure 'live', meaning you don't get any nasty surprises when you fire the shutter. These days, modern EVFs are also fantastic at what they do. But still many photographers prefer the cleaner, definitely lag-free view offered by an optical viewfinder, so there's no 'best' option for everyone.",
    "The optical viewfinder on the D3500 offers a coverage of 95%, which is typical for an entry-level DSLR, so you may need to be a bit careful when framing some shots to avoid unwanted elements creeping into the edges of the frame.",
    "As on the Nikon D3400 there's no Wi-Fi connectivity, but you do get Bluetooth, so it's possible to transfer images via Nikon's SnapBridge feature. Here, an always-on Bluetooth Low Energy connection is made between the camera and your smart device, and you can configure SnapBridge so that images are automatically transferred as you shoot, or later, so you can select particular images to transfer.",
    "While you can buy the Nikon D3500 as a standalone camera with no lens, most people looking at this beginner camera will choose to get the 18-55mm lens that's bundled with the camera for a few more dollars or pounds.",
    "Often referred to as a 'kit' lens as these lenses are sold as part of the kit with the camera, the focal range of 18-55mm offers a decent standard zoom range to get your started. This covers everything from wide-angle landscapes to moderate telephoto that's more suited for portraits.",
    "It's worth paying close attention to the lens though when you're looking to buy a D3500 as there's two versions available. There's the AF-P DX 18-55mm f/3.5-5.6G and the AF-P DX 18-55mm f/3.5-5.6G VR. The VR designation is what you want to pay attention to as this denotes Nikon's image stabilization system (known as Vibration Reduction).",
    "The difference in cost between the two lenses is negligible, so our advice is to splash out a few dollars or pounds more for the VR version of the lens, as this will allow you to shoot at slower shutter speeds and still achieve sharp shots.",
    "Once you're ready to upgrade your lens, or want something to complement your 18-55mm lens, take a look at our best Nikon lenses buying guide."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Nikon D3500 review: features",
    "20": "Which 18-55mm kit lens should you buy with the D3500?"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-camera-deals-sales",
    "best beginner DSLR": "https://www.techradar.com/news/best-entry-level-dslr-camera",
    "Canon EOS Rebel SL3 / EOS 250D": "https://www.techradar.com/reviews/canon-eos-rebel-sl3-eos-250d",
    "Fujifilm X-T200": "https://www.techradar.com/reviews/fujifilm-x-t200",
    "Nikon D3400": "https://www.techradar.com/reviews/nikon-d3400-review",
    "optical low-pass filter": "https://www.techradar.com/news/the-a-to-z-of-photography-low-pass-filter",
    "ISO": "https://www.techradar.com/news/the-a-to-z-of-photography-iso",
    "Nikon D5600": "https://www.techradar.com/reviews/nikon-d5600",
    "best Nikon lenses": "https://www.techradar.com/news/best-nikon-lens"
  }
}