{
  "source": "https://www.techradar.com/reviews/roborock-s7-vacuum-review",
  "title": "Roborock S7 vacuum review",
  "category": "smart-home",
  "updated": "2021-07-02T10:57:57Z",
  "author": "david-nield",
  "summary": "Another top-class cleaner from Roborock",
  "verdict": "The Roborock S7 impresses us as much as previous models from the robovac company have, and this is a cleaning machine that ticks a lot of boxes in terms of what it offers and how it operates. It's not quite perfect though, so compare it carefully with its competitors.",
  "pros": [
    "Simple setup",
    "Powerful cleaning",
    "Smart routing"
  ],
  "cons": [
    "No built-in camera",
    "Slow charging",
    "Quite chunky"
  ],
  "article": [
    "If you're in the market for one of the best robot vacuums in the business, then the Roborock S7 definitely deserves a place on your shortlist: it's powerful, it's smart, and it'll do a very decent job of keeping your home clean and tidy.",
    "Perhaps the biggest selling point here is the combination of both vacuum and mop, and the ability of the device to switch between the two on the fly. During our testing the S7 detected carpet and non-carpet flawlessly, so if you have a mix of surfaces in your home then you don't need to worry about your carpets getting soaked once the vacuum cleaner has worked its way out of the kitchen.",
    "Operating the S7 really is as simple as tapping a button on the app, and it's clever enough to find its way across rooms, between chair legs, and around obstacles. The volume never gets above the level of a hairdryer, we never saw the S7 get stuck, and the quality of the cleaning and the mopping impresses.",
    "It's not quite as good at vacuuming as a human being with a standard vacuum cleaner is, but that's true of any robovac at the moment: their squat size does mean something of a trade-off in terms of suction. If this is going to be your first robot vacuum cleaner, don't expect to be able to throw away your Dyson or Shark just yet – but you won't have to rely on it quite so often.",
    "It's worth mentioning that Roborock is bringing out an auto-emptying dock later in 2021 that will work with the S7, but it's not on the market yet. For now, you'll have to do your own emptying, but it's not much of a chore.",
    "The Roborock S7 is out and available to buy now in the US, for $649.99 (about £470 / AU$850) from Amazon and Walmart. Previous Roborock models have gone on sale in the UK and Australia, but there's no fixed date for international availability at the moment.",
    "Roborock hasn't sprung any surprises when it comes to the design of the S7, and its look is very much along the lines of previous models: a squashed down cylinder, with a central dome that houses the LiDAR scanner required for the robovac to find its way around. Function takes priority over form when it comes to a device like this, but the Roborock S7 isn't completely unappealing in terms of its aesthetics.",
    "White and black are your color choices, and if you're wondering if this is going to fit under your sofa, it stands 96.5 mm (3.8 inches) tall, with a maximum diameter of 353 mm (13.9 inches). It has a 470 ml dust canister and a 300ml water tank, which Roborock says is enough to clean an area of up to 200 sqm (2150 sqft).",
    "Along the top you've got control buttons for starting and stopping the unit, initiating a spot clean, and sending it back to base. We like the LED light on the top, which gives a reassuring glow when the unit is scanning, charging and so on.",
    "Speaking of the base, the bundled dock takes care of charging and sits up against a wall wherever you like. It's fairly unobtrusive, but you will need to find somewhere to put it. The adhesive tape on the underside is a nice touch to help keep it stable, and the robovac can automatically drive back and dock itself when cleaning is done.",
    "For vacuuming, the Roborock S7 keeps the same 2500Pa suction power as its predecessor, and you've got four different modes to pick from: quiet, balanced, turbo or max. As you go up the scale, the suction gets greater but so does the noise, and battery life takes a hit as well. We'd rather have the options than not, and it's good to see Roborock including a high level of customizability throughout the device's settings.",
    "We're impressed by the quality of the clean of the Roborock S7 at the highest settings, though it's not going to pick up every last bit of dirt embedded in your carpet – this won't replace your main vacuum cleaner, but it will mean you won't have to use it as often (which is pretty standard for the best robot vacuum cleaners on the market right now). New on this model is a rubberized brush, which should mean a deeper clean and less maintenance along the way.",
    "The device pilots itself around intelligently enough too, doing a good job of covering the ground efficiently, recognizing and avoiding obstacles, and getting into corners. We do like the voice feedback you get as well, so you know when the robovac is charging for example, or when it's done its rounds and is heading back to the dock.",
    "Superior mopping is the main upgrade you get with the S7: previous Roborock models could mop, but this time around the cleaner uses special sonic scrubbing technology to apply up to 3,000 vibrations per minute. Another upgrade is that the mop layer automatically raises itself when carpet is detected, so you don't need to manually switch between two modes on the same clean.",
    "During our testing, that sonic mopping works really well, even on dried spills – in fact the S7 is better at mopping than it is at vacuuming in terms of the end results. For floors that have rooms with a mix of carpets, hard floors and tiles, you can just set the Roborock S7 off and have it detect what it should be doing.",
    "All the Roborock goodies we've seen before are included too, including the ability to set certain no go zones in the app, and have specific rooms cleaned rather than an entire floor. Just about the only trick not available on the S7 is being able to climb up and down stairs on its own.",
    "The Roborock app is, thankfully, straightforward and simple to use – it's the same one that works with the previous Roborock models, so if you've got several devices from the same company then you can manage them all in the same app. Once you've loaded up the app on your phone and connected the Roborock S7 to Wi-Fi, you can just set it off on its way without having to wade through a lot of menus and options.",
    "There are options here, but you can check them out at your leisure after you've got used to the way the robovac works, which is a much better idea than having to sit through half an hour of tutorials before the app will let you start a cleaning routine.",
    "By and large the app is intuitive and polished in use: little touches like double-tapping to recenter the map feel well thought out, and the key features that you want access to (like vacuuming mode and zone management) are all easily accessible. Once scanned, maps can be saved, which then enables you to set scheduled cleans, clean just one or two rooms at a time, and so on.",
    "There's a 5,200 mAh battery installed inside the Roborock S7, which in our experience gets you about 20 minutes of use per 15 percent of battery at the highest levels of suction. In one of the tests we carried out, a clean of an entire floor of mixed surfaces knocked the battery down from 100 percent to 68 percent over 46 minutes, covering an area of 35 square meters (377 square feet) overall.",
    "As long as your Roborock S7 can make it back to the dock – which it can do on auto-pilot – battery life isn't much of an issue, because it will simply go back to base and recharge before finishing the job. Charging isn't particularly fast though, so for bigger homes you might be looking at several hours for the S7 to cover everything.",
    "First reviewed April 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Roborock S7 Price and availability",
    "6": "Design",
    "10": "Performance",
    "16": "App",
    "19": "Battery life",
    "21": "Don't buy it if..."
  },
  "links": {
    "best robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fstores%2Fpage%2F96C7CFCB-D4F4-41E2-96AC-B2D082E4FD31%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7656207291912382000-20",
    "Walmart": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-1334668997796952000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FRoborock-S7-Robot-Vacuum-Cleaner%2F334364564"
  }
}