{
  "source": "https://www.techradar.com/reviews/samsung-980-ssd",
  "title": "Samsung 980 SSD review",
  "category": "computing",
  "updated": "2021-03-31T19:31:19Z",
  "author": "mark-knapp",
  "summary": "An unexpected runner up",
  "verdict": "The Samsung 980 is a far cry from the 980 Pro. Though that’s to be expected, since it’s a PCIe 3.0 model, it doesn’t do as great a job leading the pack as past Samsung SSDs have done. It’s a strong drive, but just edged out by the competition at pretty much every angle.",
  "pros": [
    "Competitive price",
    "Highly capable",
    "Black PCB"
  ],
  "cons": [
    "Not the fastest",
    "Not the cheapest",
    "Not the biggest"
  ],
  "article": [
    "The Samsung 980 SSD is effectively an acknowledgement that we’re in a transitional period where not everyone has or needs a PCIe 4.0 M.2 SSD. The Samsung 980 Pro covered the high end of the M.2 SSD market, and now Samsung’s 980 SSD offers something a little more price-friendly by ditching the DRAM and the PCIe 4.0 capabilities.",
    "$129 (£119, AU$201) for a 1TB SSD is a decent bargain for any SSD, let alone a PCIe SSD and even more surprising to see it coming from Samsung. Samsung also offers a 500GB model for $69 (£64, AU$108) and a 250GB model for $49 (£46, AU$77), but their value proposition drops considerably as the capacity goes down, especially since the performance of the smaller models also drops.",
    "Samsung’s pricing puts it in pretty close running with the cheaper Corsair MP400 SSD as well as the slightly pricier SK Hynix Gold P31, which has held steady at $134 (about £100, AU$175) for some time now. Though Samsung has shown itself to be the best in the business with many of its SSDs, the Samsung 980 falls into a weird space, and it simply feels like Samsung put its efforts elsewhere. As we’ll see, the Samsung 980 does a fine job, but it fails to stand out in a field that’s growing ever faster and plenty crowded. Both the Corsair MP400 and SK Hynix Gold P31 give Samsung a hard time finding space for itself.",
    "We tested the 1TB model, and though it performs near the front of the pack for PCIe 3.0 SSDs in spite of its lack of DRAM, it doesn’t lead the way. Though its sequential read speed of 3,569MB/s is impressive, it falls short of the 3,602MB/s of the SK Hynix Gold P31. The gap widens even more when it comes to random writes, where Samsung only hits 2,846MB/s, dropping nearly 600MB/s short of SK Hynix’s offerings. Random read and write speeds, the bread and butter of SSDs, go even further in SK Hynix’s favor with a nearly 400MB/s lead in reads and almost 800MB/s gap in writes. Samsung trades blows with the Corsair MP400, but that drive has an edge in capacity, as Corsair offers 2TB, 4TB, and even 8TB options.",
    "It is impressive that Samsung’s drive is standing its ground as well as it is without DRAM. The drive does use Host Memory Buffer, which may help partially explain how it’s still keeping up so well. While DRAM may have helped it go even faster and maybe keep up with SK Hynix, the omissions undoubtedly helps keep the price down",
    "Though Samsung offers a commendable five-year warranty and 600 TBW endurance for the 1TB model, even that is topped by SK Hynix’s equivalent warranty and 750 TBW endurance. And so far, this has all been the competition the Samsung 980 faces just within the PCIe 3.0-spec. Silicon Power’s US70 and PNY’s XLR8 SSDs are both offering PCIe 4.0 speeds at prices closer to their PCIe 3.0 counterparts.",
    "So, while the Samsung 980 Pro may be a champion in the market, the Samsung 980 simply lives in the shadow of its sibling and borrows from its clout."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Don’t buy it if…"
  },
  "links": {
    "Samsung 980 Pro": "https://www.techradar.com/reviews/samsung-980-pro",
    "M.2 SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "Corsair MP400 SSD": "https://www.techradar.com/reviews/corsair-mp400",
    "SK Hynix Gold P31": "https://www.techradar.com/reviews/sk-hynix-gold-p31",
    "Silicon Power’s US70": "https://www.techradar.com/reviews/silicon-power-us70-gen4-ssd"
  }
}