{
  "source": "https://www.techradar.com/reviews/8x8-x-series",
  "title": "8x8 X Series review",
  "category": "computing",
  "updated": "2021-03-09T14:42:56Z",
  "author": "kieron-moore",
  "summary": "Voice, video, and text communications in one efficient package.",
  "verdict": "8x8 X Series is an excellent VoIP solution for your business, with multiple methods of communication combined into one efficient yet feature-rich workspace.",
  "pros": [
    "Efficient app interface",
    "Excellent security systems",
    "Prices start low"
  ],
  "cons": [
    "Variable standard of support"
  ],
  "article": [
    "Voice over Internet Protocol (VoIP) is becoming an increasingly popular alternative to traditional phone lines because it allows users to make voice calls over an internet connection. Since you don’t need the cable infrastructure, it’s easier to set up and can be more cost-effective to run, so it may be worth finding the best VoIP service for your business.",
    "Due to the large number of providers out there, it can be difficult to work out which VoIP solution is right for you. 8x8 Inc. is a popular provider and offers several different All-in-One Communications plans, which are also known under the banner, 8x8 X Series. It was formerly known as Virtual Office Pro.",
    "In this 8x8 All-in-One Communications review, we assess the pricing, features, interface, support, and security offered by this VoIP service.",
    "The three main options within the X Series range are 8x8 Express, X2, and X4.",
    "The lowest-price plan, 8x8 Express, is a very affordable $12 per user per month. Far from being an overly basic option, it offers all-in-one communications suitable for most small businesses. After you’ve signed up, users can download an app for mobile and desktop, through which they can access voice calls, video calls, and text messaging. The plan enables unlimited calling in the US and Canada and includes visual voicemail and browser-based video conferencing. Plus, the first month is a no-commitment free trial.",
    "If your business makes many international calls, you’d be better off with one of the more advanced plans. The X2 plan, which costs $24 per user per month, includes unlimited voice calling to 14 countries, as well as improved video and audio conferencing via the app and internet-based fax. The more expensive option is X4, which costs $44 per user per month. This includes unlimited voice calling to 47 countries, as well as in-depth supervisor analytics.",
    "For enterprises there are even more comprehensive options. The X6, X7, and X8 plans include a contact center and cost $112, $131, and $170, per user per month, respectively. For most businesses, one of the three cheaper plans will suffice.",
    "The call options offered by 8x8 are more than just the standard VoIP calls, as the X Series enables high-definition audio and video conferencing with up to 100 participants. There are multiple moderation controls available, including host delegation and participant lobbies. Also, it’s possible to record the audio, video, and chat, to be published to the cloud for those who missed the meeting.",
    "A large amount of analytics data is efficiently collected in a single platform, enabling easy access and analysis. The dashboards are updated in real time and can be customized to your liking. With detailed data like speech analyses of every call, you can identify employee and customer trends and interpret them to solve problems and increase business efficiency.",
    "Besides making calls from 8x8’s own app, you can integrate the service into other apps and software that your employees may already use, such as Microsoft Teams, Salesforce, Google Workspace, and Slack. This makes your processes more efficient and reduces the time that employees need to spend learning new software.",
    "The set-up process for 8x8 X Series is simple. It only takes a few minutes to provide the basic information about your business needed to get going, and you can then access the web dashboard, as well as the mobile and desktop apps.",
    "All the interfaces are well designed for efficient use. The main app for employees is called Work and has a simple layout that makes it easy to navigate. It functions as a central hub from which you can access voice calls, video calls, text messaging, meetings, and more.",
    "The browser-based dashboards for supervisor use are more complex but have a wide range of functions, including analytics and switchboard control.",
    "If you run into problems when setting up or running your 8x8 X Series system, there are various support options available. You’re first sent to an AI assistant, which will direct you to articles on the knowledge base relevant to your question.",
    "If these don’t help, you can contact technical support via text chat, ticket, or phone. However, the live assisted support is only available to those on the X2 plan or above, not 8x8 Express. The quality of tech support does seem to be variable—many customers have complained that communication has been poor, or that problems have been passed on from phone call to email.",
    "When you’re running a business that handles financial information or other confidential customer data, it’s crucial to know that your systems are secure. 8x8 excels in this respect, as it has multiple security measures in place, and it’s open and transparent regarding them.",
    "Communications are fully encrypted using Transport Layer Security and Secure Real-time Transport Protocol, so you can be sure messages and calls aren’t being intercepted. Secure coding practices are used to ensure that the technology is safe. Fraud detection tools are also built into the system.",
    "One popular choice is Dialpad, which has prices beginning at $15 per user per month. It has an impressive range of features and like 8x8, has comprehensive security. However, there’s no video conferencing functionality.",
    "Another option is RingCentral Office. This is more expensive, starting at $19.99 per user per month, but it comes with a suite of advanced features and integrations with numerous CRM programs and other software, including AI-driven call monitoring.",
    "There’s not much to fault with the 8x8 X Series. The app combines multiple methods of communication into one efficient workspace, and there are multiple useful features, such as analytics, integration with other software, and video conferencing. Also, the security is among the best on the market.",
    "One downside is that the quality of tech support isn’t always great. However, the pricing is quite good, with plenty of features packed into one of the most affordable VoIP packages that you’ll find.",
    "While the basic 8x8 Express plan includes all main features, the increased support options and international calling make the X2 plan the most likely choice for most small and medium businesses. If you’re looking for a comprehensive and reliable VoIP provider, we recommend signing up for a trial with 8x8."
  ],
  "headers": {
    "3": "8x8 X Series: Plans and pricing",
    "7": "8x8 X Series: Features",
    "10": "8x8 X Series: Interface and use",
    "13": "8x8 X Series: Support",
    "15": "8x8 X Series: Security",
    "17": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "best VoIP service": "https://www.techradar.com/news/best-voip-service",
    "8x8 X Series": "https://www.8x8.com/products/all-in-one-communications",
    "Virtual Office Pro": "https://www.techradar.com/reviews/8x8-virtual-office-pro",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Dialpad": "https://www.techradar.com/reviews/dialpad",
    "RingCentral Office": "https://www.techradar.com/reviews/ringcentral-office"
  }
}