{
  "source": "https://www.techradar.com/reviews/humanscale-freedom",
  "title": "Humanscale Freedom office chair review",
  "category": "computing",
  "updated": "2021-08-06T13:38:09Z",
  "author": "darren-allan",
  "summary": "This entry-level chair is great value for money",
  "verdict": "Shop around online and get the fabric version of the Humanscale Freedom at a good price, and you won’t regret it – we certainly didn’t. This is a superb office chair which is really well-built, and most importantly, very comfortable to sit in for long periods of time.",
  "pros": [
    "Great balance of comfort and support",
    "Nifty self-adjusting backrest",
    "Excellent build quality",
    "15-year warranty"
  ],
  "cons": [
    "Slight niggles with headrest and armrests",
    "Leather version gets very pricey"
  ],
  "article": [
    "Humanscale is known for its high-end (and correspondingly high-priced) office chairs, and the Freedom is one of the leading popular models. You might, perhaps, want to cover your wallet’s ears when it comes to the price of some of the top-end configurations of the Freedom, which can push well north of a grand.",
    "For that kind of considerable outlay, as you’d hope, you’re getting a lot of quality in terms of an office chair which is extremely well-built with a lengthy warranty (15 years), and one that benefits from some nifty design concepts.",
    "Furthermore, the truth is that if you shop around online, you can get this chair a fair bit cheaper than a thousand notes, assuming that you go for the basic fabric and graphite frame version (as opposed to the more expensive leather finish).",
    "Indeed, in this review, we are evaluating the basic fabric (Camira Oxygen fabric, to be precise) and graphite version (the one with the headrest), which is still a high-quality affair. We’ve been using this chair for a long time – three years now, in fact – and it has held up very well. In fact, it’s still as good as new, both in terms of operation and appearance.",
    "As mentioned, the Humanscale Freedom can vary widely in price depending on whether you want the leather or fabric version. For the fabric and graphite chair, which is the entry-level model, and the one we’re reviewing here as noted, you can currently expect to fork out around £750 (around $1,040). If you want the leather model, you’re looking at paying £1,350 (around $1,880) or thereabouts currently, or £1,400 (around $1,950) with the chrome rather than graphite frame.",
    "Suffice it to say that unless leather is something you’re really desperate to have, the entry-level fabric chair is a way better value proposition.",
    "As we’ve already mentioned, this is an office chair which boasts a very impressive build quality. The graphite frame is nicely solid, but not overly heavy – although it’s not exactly a piece of office equipment that you’ll easily pick up (unless you happen to hit the gym a lot in your spare time).",
    "The chair is entirely fashioned from graphite and fabric, although there are a few plastic bits, namely the underside of the seat, the back of the headrest, and underneath the armrests (which also have a firm plastic padding on top of them).",
    "Even the casters are well-made and roll smoothly around on hard floors, and the Humanscale Freedom is well-thought-out all round, in the main. There are some slight weak points, which we’ll come onto momentarily.",
    "This chair offers a range of adjustments as you’d expect from a high-end model. You can adjust the height of the seat, as well as the location of the seat pan (sliding it forwards or backwards), and the height of the backrest, as well as the headrest. The armrests move in tandem (they’re actually connected together with two metal rods that run around the back of the seat).",
    "The innovative design touch here is that the backrest is a flexible component which adjusts itself to your body and the way you’re sitting. Meaning it tilts as you move, so if you lean back, it’ll move with your spine and keep you comfortable.",
    "The idea is it supports your back naturally without you having to worry about making any adjustments to the backrest (save ensuring that when you first set this chair up, it’s at the right level for your particular height). And this system works brilliantly, and it’s one of the reasons why we fell in love with the Freedom.",
    "The various manual adjustments you can make to this chair are easily performed, with the various levers and sliders nicely implemented – albeit with two exceptions. The weak points are the armrests and headrest, which have slight flaws, the more annoying one pertaining to the latter.",
    "The headrest simply slides up and down on a pair of thin metal columns (one on each side), and while that makes it very easy to adjust, over time, it slips slightly downwards (further and further). Whether this is unique to our model – and this particular component has simply been put together too loosely here – we don’t know, but the end result is that every couple of days we have to readjust it.",
    "That is slightly irritating, but far from a dealbreaker. The armrests are also a little clunky to move as well (they move in tandem as mentioned earlier). This really isn’t a big deal, though, because once they’re locked in position, they’re set.",
    "What might niggle you slightly more about the armrests is that you can only adjust the height, with no horizontal adjustment possible, and they aren’t very long either. The somewhat short armrests don’t bother us – in fact, we like them at this size – but your mileage may vary depending on your particular desk setup and how you work.",
    "One thing we would like to change about the armrests is the rather cheap feeling plastic padding on the top. It seems rather at odds with the premium materials of the rest of the chair. Don’t get us wrong: it isn’t uncomfortable by any means, it’s just not ideal. No doubt the leather version of the Freedom chair does better on this score. That said, the plastic material hasn’t worn at all over the years, and seems very durable.",
    "As mentioned, we’ve been using this chair for a long time, and it has proved very comfortable overall throughout this period. The seat and backrest are well enough padded to be suitably comfortable, yet firm enough to provide support. In other words, in this critical comfort/support equation, they strike just the right balance – at least for us. Do note, of course, that comfort is one of those things that is naturally somewhat subjective.",
    "Over our three-year period of ownership, we have not noticed any change or decline in the level of padding – the chair remains just as comfortable, and the padding hasn’t sagged or flattened – and the same is true of the Freedom’s various mechanical parts which remain in good working order. That includes the headrest: while we mentioned that this is a touch loose, it was like this when the chair was new, and hasn’t got any looser over time (thankfully, because if it had done so, that could have proved problematic).",
    "Really, the downsides of the Freedom are minor nit-picks. Overall, we’ve been thoroughly impressed with this chair in terms of its quality and comfort levels.",
    "For the price we paid for the entry-level fabric and graphite version of the Humanscale Freedom, which was around £550 in the UK (that’s around $720), this chair represents superb value for money. In recent times, that price has crept up rather, and at the time of writing stands at more like £750 (around $1,040), but the Freedom is still well worth that amount of money.",
    "That said, the value proposition of the basic fabric version is one thing, but if you want the leather version of this office chair, you will pay a lot more than that - not too far off double, in fact - and the value factor is therefore proportionately lessened (so drop a half-star)."
  ],
  "headers": {
    "4": "Pricing",
    "6": "Design and build quality",
    "17": "Comfort",
    "19": "Final verdict"
  },
  "links": {
    "office chairs": "https://www.techradar.com/best/best-office-chairs"
  }
}