{
  "source": "https://www.techradar.com/reviews/zipdrive",
  "title": "ZipDrive personal cloud storage review",
  "category": "computing",
  "updated": "2021-04-14T00:33:48Z",
  "author": "darcy-french",
  "summary": "No NextCloud, but a platform to watch in coming years",
  "verdict": "Ideal for business leaders wanting a self-hosted cloud storage solution at minimal cost.",
  "pros": [
    "Affordable",
    "Microsoft 365 integration"
  ],
  "cons": [
    "No storage space included in plans",
    "No end-to-end encryption"
  ],
  "article": [
    "ZipDrive is a new product from the cloud storage and backup company IDrive. Rather than providing your typical cloud storage service, ZipDrive is a self-hosted cloud storage platform, which means all data is stored locally on a hard drive you own, but is available from any network-enabled device.",
    "For the right company or self-employed individual, ZipDrive could be the perfect choice, balancing anywhere access with the comfort of knowing exactly where and how your essential files are stored.",
    "In our ZipDrive article, we explore the platform’s strengths and weaknesses and compare it to the best cloud storage services.",
    "There is only one ZipDrive premium plan, the Basic plan. It costs $9.95 per year, and provides access to the ZipDrive software platform for one device. If you want to access the platform on another device, you must pay another $9.95 per year.",
    "Although this price may at first seem incredibly affordable, it’s important to remember the Basic plan does not include any storage space. It is up to the user to provide this, whether that be on a laptop, desktop, or even a dedicated server. Once you add up the costs of a server and associated power costs, the costs of buying and maintaining on-prem storage infrastructure can be quite high.",
    "Because ZipDrive is a subsidiary of the top-quality IDrive, users can enjoy a wide range of features that make it easy to upload, download, and organize files on your personal cloud storage system.",
    "Collaborative features also make ZipDrive ideal in a business setting.",
    "Many businesses rely on Microsoft 365 apps such as Word, PowerPoint, and Excel to power their business activities. Fortunately, ZipDrive users can create, access, and edit Microsoft 365 files directly within ZipDrive.",
    "Changes also appear in real-time, enabling several employees to collaborate dynamically on a single document.",
    "Self-hosted cloud storage is only helpful if you can access those files from other devices. Otherwise, it wouldn’t really be ‘in the cloud’. Fortunately, as long as you download the ZipDrive app, you can access files stored on your private cloud from any app-enabled mobile or desktop device.",
    "Of course, the drive where the data is being stored must be turned on and connected to the internet for this to work.",
    "Whenever you access your data via the ZipDrive platform, your data is protected using TLS v 1.2 encryption. Although there are superior encryption levels, TLS v1.2 is still considered adequate by most data security experts. Unless you plan on storing and accessing exceptionally sensitive data, we think ZipDrive’s security policies are more than adequate.",
    "The ZipDrive interface, like that of its big brother IDrive, is functional without being particularly aesthetic. A simple layout makes it easy to navigate the app, while drag-and-drop functionality helps users upload and organize their files.",
    "ZipDrive boasts a comprehensive support framework and this is an area in which the platform performs strongly. Phone support is available between 6:00 AM and 11:30 PM Pacific Standard Time. Users can send an email to the ZipDrive support team or fill out an online support form outside of these hours.",
    "The website’s FAQ section is also informative, with OS-specific support, general technical support, and how-to articles.",
    "Self-hosted cloud storage can be a blessing or a curse regarding security. On the one hand, it is more secure because your data is not stored in a major data center that may be exposed to data breaches or data loss incidents. You always know where your data is and how it is being stored.",
    "On the other hand, however, self-hosted storage is less secure because you do not benefit from the economies of scale that enable major data centers to deploy 24/7 physical security and state-of-the-art security protocols and encryption methods. It’s important to remember that when your data is stored on a hard drive in your home or office, it is only as secure as you make it. Fires, electrical storms, or theft could all result in total loss of data.",
    "Ultimately, the security of a ZipDrive account is up to the user. The more you spend on on-prem storage infrastructure, the more secure your data is likely to be. A comprehensive data backup option is also recommended, although this may make ZipDrive redundant if your backup data is sorted in the cloud…",
    "ZipDrive’s closest competitor is NextCloud, which is also a self-hosted cloud storage platform.",
    "We think NextCloud is superior to ZipDrive at the time of writing, due to a wider range of features and scalable plans. However, this is understandable considering ZipDrive is a new platform, while NextCloud has improved its product over many years.",
    "If ZipDrive can improve the number of third-party integrations (Microsoft 365 is a great start, however), it will compete more evenly with NextCloud.",
    "ZipDrive is an appealing option for businesses that want a self-hosted cloud storage solution. Although it may not compete with the leading self-hosted storage provider, NextCloud, we think the range of features, low price, and multi-platform compatibility make it worth considering.",
    "However, self-hosted storage isn’t for everyone as it requires more investment in infrastructure and more time and energy on the part of the business owner. If you want to learn more about the best externally hosted cloud storage platforms, our buying guide has all the details."
  ],
  "headers": {
    "3": "Plans and pricing",
    "5": "Features",
    "12": "Interface and in use",
    "13": "Support",
    "15": "Security",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "ZipDrive": "https://www.zipdrive.com/",
    "IDrive": "https://www.techradar.com/reviews/idrive",
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Basic plan": "https://www.zipdrive.com/pricing.htm",
    "dedicated server": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "NextCloud": "https://www.techradar.com/reviews/nextcloud-15"
  }
}