{
  "source": "https://www.techradar.com/reviews/acer-chromebook-spin-514",
  "title": "Hands on: Acer Chromebook Spin 514 review",
  "category": "computing",
  "updated": "2021-01-11T16:39:17Z",
  "author": "matt-hanson",
  "summary": "More powerful than the average Chromebook",
  "verdict": "The Acer Chromebook Spin 514 is the first Chromebook from Acer that's powered by AMD hardware, and it represents a big leap in performance for Chrome OS-based laptops.",
  "pros": [
    "Powerful",
    "Long battery life",
    "Comfortable keyboard",
    "Robust build"
  ],
  "cons": [
    "Heavy",
    "Pricey",
    "Are the specs overkill?"
  ],
  "article": [
    "The Acer Chromebook Spin 514, just announced at CES 2021, is the most powerful Chromebook Acer has ever made, and is its first to feature AMD hardware.",
    "It represents a bit of a departure, then, and not just for AMD, but for Chromebooks as a whole. While Chromebooks started out as cheap, lightweight, laptops that run Chrome OS, rather than Windows 10, we’re seeing a growing number of powerful Chromebooks that are really pushing back against people’s preconceived notions of what a Chromebook is.",
    "That means with AMD Ryzen 3000 series mobile processors and integrated graphics, along with up to 16GB of DDR4 RAM, the Acer Chromebook Spin 514 boasts the kind of specs we’d expect to see in Windows 10 laptops. With Chrome OS remaining a lot easier to run than Windows, it also means we should see drastically improved performance with the Acer Chromebook Spin 514 over other Chromebooks, and even Windows 10 laptops with similar spec, while still maintaining that all-important battery life, as Acer is promising up to 10 hours on a single charge.",
    "The Acer Chromebook Spin 514 will launch in February in the US starting at $479.99, and in the UK in March priced at £499.",
    "This is for the base model. For the more powerful versions, with Ryzen 5 and Ryzen 7 3000 processors, and 16GB of RAM, expect to see much higher prices. We’ve contacted Acer to find out just how much these models will cost.",
    "Acer has also unveiled an enterprise version of the new Chromebook aimed at business users, which comes with advanced security, productivity and admin features, and which can be administered remotely thanks to web-based tools, and this will launch in the US and UK in March, priced at $749.99 / £599 – we've yet to get confirmation of Australian pricing and launch dates.",
    "As far as Chromebooks go, then, these are going to be pricey, but they are offering more power than you’d usually get with a Chromebook. Also, they should still hopefully provide excellent value compared to similarly specced Windows 10 devices.",
    "The Acer Chromebook Spin 514 subverts expectations in many ways, and with the design, it shows that Chromebooks don’t necessarily need to be thin and light devices. Coming from a compact Chromebook like the Pixelbook Go, the Acer Chromebook Spin 514’s size (12.7 x 8.88 x 0.68 inches/322.6 x 225.5 x 17.35mm) and weight (3.42 pounds/1.55kg) may come as a surprise. It certainly looks and feels more like a traditional laptop.",
    "This isn’t necessarily a bad thing. While people that want an easily portable Chromebook may want to look elsewhere, the larger size allows for a comfortably sized keyboard that feels great when working. During our time with the Acer Chromebook Spin 514, we typed out a few short documents with ease. As this is a Chromebook primarily pithed as a productivity machine, the fact that it’s comfortable to work on is a boon.",
    "The 1080p 14-inch screen is also large enough to work on multiple apps at once, with the higher resolution really helping to give you more workspace. The screen can be flipped backwards, allowing you to use it in ‘tent mode’, which is handy for watching media (that 1080p resolution comes in handy here), or if you flip it all the way back, the Acer Chromebook Spin 514 turns into a tablet-like device.",
    "Thanks to the large 14-inch screen, and the ability to run most Android apps in Chrome OS, you then have a large, and powerful, Android tablet in your hands. It feels great to use, and the addition of Android apps, which have been specially designed for touchscreens, makes this a brilliant 2-in-1 device.",
    "The extra size also means Acer can fit in more ports than you’d usually see in a Chromebook, so on the left-hand side you get a USB-C port, a full-size USB 3.0 port, audio jack and microSD card reader.",
    "On the right hand side you also get another USB-C port and USB 3.0. Also, on the higher end models with Ryzen 5 or Ryzen 7 CPUs, you also get a full-size HDMI port – which is pretty much unheard of in a Chromebook. These extra ports mean you’re able to plug in peripherals, or hook the Acer Chromebook Spin 514 up to a TV or projector, without needing an extra dongle, which you do with most other Chromebooks.",
    "The size also allowed Acer to fit in more powerful components, which we’ll talk about more in a bit. This is a hefty Chromebook, but it feels sturdy, thanks to its metal chassis which has been put through rigorous military-grade durability tests (MIL-STD 810H in particular). This means this is certainly a laptop that you can carry around with you without worrying about it getting damaged.",
    "Overall, the design of the Acer Chromebook Spin 514 is smart and professional, if a little unexciting. It’s an ideal look for a business Chromebook, and the flexible screen hinge means this is a brilliant 2-in-1 for media watching and using as an Android tablet as well.",
    "We’re going to have to wait for our full review to find out how the Acer Chromebook Spin 514 performs, but based on the specs and promises Acer has made, along with our short time with it, we are pretty certain this is going to be a Chromebook that offers an impressively speedy experience.",
    "After all, Chrome OS has been made to run on low-powered devices with dual-core processors and 2GB of RAM. Seeing what a quad-core Ryzen chip and 16GB of RAM can do with the software is pretty exciting. With an ever growing list of Chrome OS apps, along with access to thousands of Android apps, and the ability to run Linux, the Acer Chromebook Spin 514 can suddenly become a viable alternative to mid-range and even high-end Windows laptops – something that was once unthought of.",
    "On the other hand, these specs may be overkill for a Chromebook – and you’ll end up paying for hardware you’re just not going to make the most out of with Chrome OS.",
    "As we only had a limited amount of time with a pre-production model, we weren’t able to test out just how much of a game changer the boosted hardware of the Acer Chromebook Spin 514 really is, but the potential is very exciting.",
    "It means that Chromebooks are no longer just ‘make-do’ devices that are great at day-to-day use, but nothing else. Instead, they can be powerful productivity machines that are ideal for people who are working or learning from home. With the current global Covid pandemic, this may be just what we need."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "15": "Performance",
    "18": "Early verdict"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Pixelbook Go": "https://www.techradar.com/reviews/google-pixelbook-go-review"
  }
}