{
  "source": "https://www.techradar.com/reviews/experian-identityworks",
  "title": "Experian IdentityWorks review",
  "category": "computing",
  "updated": "2021-11-30T20:31:55Z",
  "author": "john-brandon",
  "summary": "Despite the name, Experian IdentityWorks is a powerful app with deep instructional info",
  "verdict": "A powerful identity theft protection app designed for everyday users, Experian IdentityWorks has some of the most extensive educational information we’ve found, including a blog with hundreds of informational articles. If you can get past the fact that Experian is known more for their 2015 data breach that compromised 15 million accounts, it’s a deep and rich app.",
  "pros": [
    "Helpful website",
    "Extra alerts are useful",
    "30-day free trial",
    "Three tiers of plans",
    "Discount for paying annually"
  ],
  "cons": [
    "Slim website details",
    "Too many options on plans",
    "No dedicated app for smartphone"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "Almost every review or news report about Experian IdentityWorks has to start with the same disclaimer, and this review is no different. Whether that’s actually fair is debatable. IdentityWorks, a name you probably don’t know, is an identity theft protection app from the company Experian, which is a name you more than likely do know, but not for a good reason. In 2015, this consumer credit reporting company announced one of the most well-known data breaches up to that point involving a data leak of over 15 million customer records. The truth is that many data breaches have occurred since, but perhaps it was the irony of a credit reporting agency announcing a massive breach that made worldwide headlines.",
    "That was five years ago. Serious movie fans will know this reference, but it might remind you of a scene in the movie The World According to Garp when Robin Williams is shopping for a house. A plane suddenly crashes into the living room. He decides to buy it. “The chances of another plane hitting this house are astronomical,” he says. The same is true here. Experian likely strengthened their data security more than other companies. And, you could argue that the chances of another severe data breach would be “astronomical” at best.",
    "What is it about identity theft protection apps thinking we might have “up to” 10 children? Sure, that might be your choice, but the Census Bureau has a different take. (The average number of kids has stayed pretty consistent at two per family. In the U.K. it’s even fewer.) That hasn’t stopped IdentityWorks from offering pricing plans for one or two adults with up to 10 kids to use the app. It is easily the most confusing rubric we’ve found.",
    "There is a one adult plan for $9.99 monthly, a one adult and up to 10 children plan for $14.99 monthly, and a two adults and up to 10 children plan for $19.99 monthly. Unfortunately, there is no option for two adults, with no children, which is a fairly common family these days. Additionally, only a few folks out there have ten children, so many folks will be overpaying for their plan.",
    "Each of the above prices is for the “Plus” plan, which is really a euphemism for the base plan, and ends up adding to the confusion. It has the expected features, such as a Social Security number trace, fraud resolution services, and address change verification. It also goes beyond the basics that some others offer with Dark Web monitoring, social media monitoring, and the ability to lock and unlock your Experian credit file. It also has up to $500,000 of identity theft insurance should the need present itself.",
    "With the Premium plan, you get access to $1 million in insurance protection for dealing with bank account problems, credit issues, or emergency travel, which is in line with most of the identity theft protection apps. Additional features include monitoring of court records, payday loan monitoring, and financial account activity. The upper plan also includes three bureau credit scores, which the lower plan leaves out. The downside is as would be predicted the additional cost of the Premium plan, as it rises considerably, depending on the amount of people covered. For example, for the one adult with up to ten children the cost rises from $14.99 monthly for the Plus plan to $24.99 for the Premium plan.",
    "The above pricing is all for the month to month price. There is also a discount for paying annually of about 17%.",
    "Thankfully, we’re dealing with a major company here that knows how to design an app. Similar to how Norton LifeLock presents everything in a clear and understandable interface, IdentityWorks also uses a dashboard with tabs up top and a wizard that shows how many steps you have completed or accounts you have configured. Unlike PrivacyGuard, the interface is clean and subdued, as though you are working on something more serious and not playing Pokemon. (The PrivacyGuard site and app is a little too colorful).",
    "While there are links on the Identity Works website to both Android and iOS apps, this is not what most users expect. It really is to the Experian app, but not a dedicated app for IdentityWorks.",
    "Despite the incredible amount of information on their website and in the app about the threat detection topic and hundreds of blog posts at Experian.com, IdentityWorks still tends to mirror the features found in Norton LifeLock and others. You can check your credit score and monitor your credit, see if a sex offender moves into your area, and get notified if someone tries to steal your bank details. Fairly standard stuff, but IdentityWorks does add a few interesting extras.",
    "One that doesn’t come up too often with other apps is a court records verification. You can see an alert if there is a check or change to your court records (if they even exist in the first place). IdentityWorks also does a better job of simulating credit checks and FICO scores. The Plus and Premium plans differ in how often you can view and analyze these credit checks - with Premium, you can see a daily FICO credit score which might be a bit too often.",
    "Experian has one main competitor, and it’s Norton LifeLock. Anyone familiar with the identity theft field will know that LifeLock is a leader, and they will likely also know about Experian. While Norton is primarily a security company, Experian is primarily a credit reporting agency. That gives them a leg up in the industry and all of the ways you can destroy your credit (or have other people destroy your credit for you). There is a decision, though, about whether you care more about identity theft in terms of security and privacy - your good name tarnished - or whether it is related to your credit and buying a new house or a car. In the end, both are important as two sides of the same coin, but potential users need to be cognizant of the product they are choosing.",
    "In the final analysis, we would give the nod to Norton LifeLock compared to Experian IdentityWorks because the main concern here is personal security, not just your credit. In fact, credit is only one aspect of identity protection. There are concerns about how a criminal can damage your reputation and what it takes to expunge your record. You might want to know more about how someone is impersonating you online to their own gain in addition to credit and financial concerns.",
    "Experian IdentityWorks does provide some excellent educational info. If you do care mostly about credit and finances, it can be a good option, but undoubtedly some users will have a hard time getting past that data breach.",
    "We've also highlighted the best identity theft protection"
  ],
  "headers": {
    "3": "Plans and pricing",
    "8": "Interface",
    "10": "Features",
    "12": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "Experian IdentityWorks": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1051441754009079800/https://www.experian.com/consumer-products/identity-theft-and-credit-protection.html",
    "one adult plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1311648738905370000/https://www.experian.com/consumer-products/compare-identity-theft-products.html",
    "one adult and up to 10 children plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4427583410199094000/https://www.experian.com/consumer-products/compare-identity-theft-products.html",
    "two adults and up to 10 children plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1373852849254015500/https://www.experian.com/consumer-products/compare-identity-theft-products.html",
    "Dark Web monitoring": "https://www.techradar.com/news/what-is-a-dark-web-scan-and-do-you-need-one",
    "credit scores": "https://www.techradar.com/best/us-credit-monitoring-services",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "PrivacyGuard": "https://www.techradar.com/reviews/privacyguard",
    "hundreds of blog posts": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1365030208852491300/https://www.experian.com/blogs/ask-experian/category/fraud-and-identity-theft/",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}