{
  "source": "https://www.techradar.com/reviews/microsoft-surface-laptop-studio",
  "title": "Microsoft Surface Laptop Studio review",
  "category": "computing",
  "updated": "2021-10-05T14:58:16Z",
  "author": "jackie-thomas",
  "summary": "Microsoft's new attempt at a workstation",
  "verdict": "The Surface Laptop Studio follows in the footsteps of the Surface Book lineup, and brings about one of the most compelling laptops in Microsoft's history. Microsoft could have gone for more powerful hardware, but in the end, it probably won't matter too much, as the unique form factor is probably the biggest selling point here.",
  "pros": [
    "Beautiful display",
    "Easel-like hinge is amazing",
    "Much larger trackpad",
    "Amazing webcam"
  ],
  "cons": [
    "Expensive",
    "Only uses Intel H35 processors",
    "No legacy ports"
  ],
  "article": [
    "The new Surface Laptop Studio is, in a lot of ways, the direct follow-up to the Surface Book 3, one that, with a refreshed form factor and slightly more powerful hardware, is leading Microsoft's Windows 11 hardware push. But instead of simply taking the popular removable keyboard from the Surface Book 3 and iterating on it, Microsoft looked to another of its products for inspiration – the Surface Studio 2, and not exclusively in a good way.",
    "That means you get this amazing easel-like display that you can bring down at an angle or even lay down flat to draw, and it also has an H-series processor for the first time in a Surface mobile device – but there's a catch.",
    "Instead of using a full-fat H-series chip, like, say, the Intel Core i7-11850H, which would put it on the same level as the Dell XPS 15, Microsoft instead opted for the Intel Core i7-11370H, one of its Tiger Lake-H35 processors. This is a shaved down, low-power hybrid chip that's supposed to give decent performance without sacrificing portability.",
    "For a laptop that's targeting creative professionals that need multi-core performance more than anyone else, limiting it to a 4-core processor instead of a full 8-core chip is going to be a hindrance, especially if you do a lot of video editing or heavy coding.",
    "But, on the other hand, this is probably the nicest piece of hardware Microsoft has ever put out. It has a lovely display, one of the best keyboards we've ever used and a trackpad that is finally on par with what you'll find on a MacBook Pro 16. It's a device we haven't been able to put down in the week we've spent with it so far, and it's not one we're looking forward to moving on from any time soon.",
    "And so the Surface Laptop Studio is kind of in a weird spot. The hardware on offer is seriously lackluster for the audience it's aiming for, but at the same time, it is genuinely one of the nicest-looking pieces of tech we've used so far. But, we suspect, for professionals that care more about actually getting through their workloads efficiently, that attention to detail isn't going to matter much when they can get more work done on another laptop – for less money.",
    "Because, just like the Surface Book 3, this is an expensive device. You're going to have to spend $2,699 (about £1,980, AU$3,700) to get the configuration we reviewed here, and you can definitely get the same hardware elsewhere for less money – just without the fancy eye-catching chassis – for most people, that's probably the better move.",
    "The Surface Laptop Studio is available today, October 5, starting at $1,599 (around £1,200, AU$2,200) at least in the US. In both the UK and Australia, the Surface Laptop Studio isn't coming until early 2022, and you can't preorder yet it, either.",
    "That intro price will get you an 11th-generation Intel Core i5 processor, 16GB of RAM and a 256GB SSD. You can bump up every component in the device for a price, and the top-end spec has an eye-watering price of $3,099 (about £2,270, AU$4,260).",
    "That will get you an Intel Core i7-11370H, 32GB of RAM and a 2TB SSD, along with dedicated Nvidia GeForce RTX 3050 Ti graphics, but it's a hard price to swallow, especially when you consider you can get the Dell XPS 15, with basically the same specs, for a lot less. And, with Dell's 15-incher, you get an 8-core processor that is way faster.",
    "The only thing the Dell XPS doesn't have that the Surface Laptop Studio does is that easel-like display. But that may be worth the exchange, depending on your workflow.",
    "This laptop is likely only worth the price you're paying for it if you're an artist that really needs that easel-like display, because the hardware on offer just is not worth the price you're paying for it.",
    "It's pretty obvious that the Surface Laptop Studio takes a lot of inspiration from, well, the Surface Studio. The entire design of the laptop revolves around its easel-like display, which is exactly what has made the Surface Studio such an iconic PC for artists.",
    "The Surface Laptop Studio takes that design and translates it over into a laptop form factor, and while it's definitely not the first laptop to do this, it's one of the best one's we've used so far.",
    "The closest comparison that comes to mind is the Acer ConceptD Ezel, which has a very similar design, but where that laptop has a hinge that stands out on the back of the display, the Surface Laptop Studio takes a lot of cues from the Surface Pro line of tablets, and the easel mechanism and hinge looks a lot like those device's stands. That means that when the laptop is closed, the lid of the laptop is totally smooth.",
    "Couple that with the gorgeous gray colorway, and you have a laptop that is just as beautiful as any laptop in Microsoft's Surface lineup, but with unique functionality that will be extremely useful for artists on the go, especially if they're working on bigger projects that will require the extra horsepower the Surface Laptop Studio brings to the table.",
    "But it's more than just a fancy hinge. The keyboard is just as comfortable to type on as ever, with deep travel and nearly perfect spacing. Microsoft has also improved on the trackpad over the Surface Book 3, and not only is it bigger, but it uses a haptic engine, similar to something you'd find on the MacBook Pro.",
    "That means you can press down anywhere on the trackpad and have it register as a click with the same amount of feedback and accuracy. And, you can even go into the settings and tweak how much haptic feedback the trackpad gives off when you click, depending on your own preference. What makes it even better than the trackpad on a MacBook Pro is that the classic Windows tap to click functionality is still there, meaning you get the best of both worlds.",
    "Just like the Surface Laptop 4, the speakers here are located under the keyboard, which usually isn't ideal, but is still better than having them mounted on the bottom of the device. The Surface Laptop Studio has four speakers in total: two tweeters under the keyboard, then two woofers on the bottom of the laptop, to the left and the right.",
    "Thanks to the Surface Laptop Studio being one device, rather than a separate display and keyboard docking station thing, sound quality is so much better, even if the speakers aren't in an ideal location. The speakers are loud enough to fill a room, and have enough range to make most music sound pretty decent – though it's still obviously no match for dedicated speakers or headphones.",
    "Listening to Kanye West's God Breathed, the bass is nice and deep, while the occasional sound effects still come through with minimal distortion. Honestly, the Microsoft Surface Laptop Studio has some of the best laptop speakers we've tested. Things fall apart a bit when listening to Type O Negative's Christian Woman, where the heavy bits have too much bass for the bottom-mounted subwoofers to handle at full volume.",
    "Speaking of things on the bottom of the laptop, there's ventilation all around the sides, and located underneath this sort of ridge around the edge. Microsoft tells us that this is some of the best ventilation in its laptops to date, which it'll need. This is the most powerful processor Microsoft has put in anything but the Surface Studio, after all.",
    "We can't help but wonder that with ventilation this extreme (not to mention how much thicker this laptop is than most other laptops in its class), why Microsoft couldn't fit a more powerful chip, but that's a topic for another day.",
    "There's a terraced effect around the edge of these vents, with a small overhang. This is magnetic, and you can stash your Surface Pen under it, and it'll stay in place. Of course, you'll have to fork over extra cash for the Surface Pen. For a laptop that's already incredibly expensive, having to add an extra $99 / £99 / AU$139 is a bit ridiculous, especially when it's so central to the device.",
    "In one of the biggest breaths of fresh air that the Surface Laptop Studio brings, however, it finally supports Thunderbolt 4. The laptop has two Thunderbolt 4 ports on the left side of the laptop. On the right there's the Surface Connect port and a headphone jack. It's super cool that Microsoft opted to include Thunderbolt support after years of refusing to, but it also means that all the legacy ports that were on the Surface Book 3 are gone.",
    "As for the display, it's absolutely gorgeous, as always. The 14-inch PixelSense display has a resolution of 2,400 x 1,600, which is a perfect fit for the hardware on offer.",
    "It's one of the most beautiful displays in its class, with incredible color accuracy and brightness. It hits an amazing 105.3% of the sRGB spectrum, and has a peak brightness of 504 nits. That puts it in the same territory as the MacBook Pro, and the only thing that stops it from exceeding it is the slightly better color accuracy of Apple's display – but the MacBook doesn't have a touchscreen, so who really wins here?",
    "And unlike a lot of other laptops in its class, it has a 120Hz refresh rate, which makes navigating through Windows 11 feel incredibly smooth and responsive.",
    "Fast refresh rates like this are typically associated with gaming, but it's going to be great for artists, as it should cut down on the delay between drawing something on the display and having it appear on screen – not that there really was much of delay in the first place.",
    "If that wasn't enough, Microsoft also drastically narrowed the bezels, making it look like a laptop from this decade for the first time. The bezels on the sides of the laptop are more in-line with current laptops, but they're still not going to match the thinnest out there, which is a good thing. The Surface Laptop Studio does have a tablet mode, so having non-existent bezels would be a nightmare from a usability perspective.",
    "The top bezel is quite a bit thicker than the ones on the sides, but for good reason. The laptop has a 1080p webcam, which can be used for Windows Hello facial login, as well as a light sensor that will adjust the color temperature to match ambient lighting. Luckily you can turn that feature off if you don't like it.",
    "Microsoft is billing the Surface Laptop Studio as its most powerful mobile Surface yet. And, it's right, but only just barely – and that comes down to its choice of processors.",
    "Microsoft has opted to pack this laptop with the Intel Core i7-11370H, which is barely faster than a U-series chip, even though the laptop is significantly thicker than the Surface Pro 8, which uses the Intel Core i7-1185G7 – an Ultrabook part. Usually, an H-series chip will absolutely destroy a U-series chip, but that doesn't happen here. Instead, the Surface Laptop Studio only barely tops the Surface Pro 8 in CPU-dependent workloads like GeekBench and CineBench. And the kicker is that the Surface Pro 8 is literally half the price for similar specs – though with less RAM.",
    "Where the Surface Laptop Studio does pull away, though, is in graphics workloads. The Surface Laptop Studio we have in for review is the business SKU, which means instead of an Nvidia GeForce RTX 3050 Ti it instead has an Nvidia RTX A2000, but it's basically on the same level either way – it's just not as good at gaming.",
    "And, in graphics-heavy workloads like Blender, it doesn't have the best performance, thanks to its paltry 4GB of VRAM, which simply isn't enough and feels like the graphics were added in as an afterthought. And it's not for gaming either, because with its 1600p resolution, even the RTX 3050 Ti isn't going to have much luck at the native resolution – you're going to have to lower games down to Medium or High settings at 1080p, which will look kind of pixelated on the high-res display.",
    "The area where the Surface Laptop Studio is strongest is in its memory configuration, and we aren't seeing any system hangs, even when we have 50 Chrome tabs open while messing around in the Command Prompt trying to poke at every corner of Windows 11.",
    "But it just seems like the configuration for the Surface Laptop Studio doesn't match what Microsoft is going for. Microsoft wants to give creators the freedom to make whatever they want without inhibition, but we still haven't seen it launch a laptop that can handle creative workloads as well as even a gaming laptop. If you have to do any video or 3D work, seriously just buy a Razer Blade instead and you'll have a similar level of workmanship with a more appropriate set of hardware that won't slow you down.",
    "At the end of the day, this is a set of hardware that's going to be excellent for illustrators and other similar artists, but Microsoft already has a ton of hardware that specifically targets those people, and the Surface Pro 8 is probably a better choice for them.",
    "It's actually kind of silly, but the Surface Laptop Studio actually has the best battery life out of Microsoft's most recent run of mobile devices, and will easily last you all day without a charger in most workloads.",
    "It lasts nearly 11 hours in the PCMark10 battery benchmark, which simulates a bunch of real-world scenarios, which is more than enough to get you through your workday, with some juice left over for the commute home. It struggles a bit more with video playback, lasting just 7 hours and 29 minutes, but that is likely due to the fancy display.",
    "Because this is a bright display – even at the 50% setting we run battery tests at – and high resolution, it will consume more juice when playing a lot of video content. Couple that with the high refresh rate, and it's not great for all-day Netflix binges in bed, even though everything looks incredible on the display.",
    "We'd still encourage you to binge Netflix on this thing – especially if you're going to watch Midnight Mass – but maybe keep it plugged in.",
    "Let's face it, over the last couple of years, we've all spent way more time than usual in video calls on our computers, and it has become one of the main ways we use our devices. That means webcams are more important than ever, so it's good that Microsoft knocked it out of the park.",
    "We use a lot of laptops here at TechRadar, but none of them have webcams that are nearly as good as what is found on the Surface Laptop Studio. The quality is similar to what we get in our standalone webcams on our desktop PC, as you get a full 1080p lens. And to make it better – it supports IR for Windows Hello.",
    "The microphone isn't quite as incredible, but it's more than good enough that you don't need to rush for a headset just to take that last-minute meeting. For a device aimed at professionals who are probably going to be taking more meetings than most people, we're happy that Microsoft paid attention here, where most laptop manufacturers put in sub-par cameras in the name of thinner bezels.",
    "One of the things we love most about Surface devices is how pure of a Windows 11 experience you get. There is absolutely no bloatware to be found here, which means the newly-launched operating system is basically a blank canvass for you to configure to your liking."
  ],
  "headers": {
    "7": "Price and availability",
    "12": "Design",
    "31": "Performance",
    "38": "Battery life",
    "42": "Camera and microphone",
    "45": "Software and features",
    "46": "Don't buy it if..."
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Surface Book 3": "https://www.techradar.com/reviews/surface-book-3",
    "Surface Studio 2": "https://www.techradar.com/reviews/microsoft-surface-studio-2",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "MacBook Pro 16": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "Surface Studio": "https://www.techradar.com/reviews/surface-studio",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Surface Laptop 4": "https://www.techradar.com/reviews/surface-laptop-4"
  }
}