{
  "source": "https://www.techradar.com/reviews/caldigit-tuff-nano-plus-2tb-external-rugged-ssd",
  "title": "CalDigit Tuff Nano Plus 2TB external rugged SSD review",
  "category": "computing",
  "updated": "2021-11-11T13:04:12Z",
  "author": "desire-athow",
  "summary": "A tough little external storage device that is a hard case to crack",
  "verdict": "The CalDigit Tuff Nano Plus is a good product at best. It is fast, reasonably priced, is compact enough and water resistant. There are other alternatives on the wider market but they don’t have the balanced feature set that Caldigit delivers.",
  "pros": [
    "Very solidly built",
    "Reasonably fast",
    "IP67 rating"
  ],
  "cons": [
    "More expensive than expected",
    "Only two year warranty",
    "USB cable could be a tad longer"
  ],
  "article": [
    "The Tuff Nano Plus is the second Caldigit external rugged solid state drive that we’re reviewing from the US storage company. The original Tuff Nano earned 4-stars with a balanced mix of great performance plus a compact and robust design. The new one bests its predecessor when it comes to sheer performance while keeping the same design philosophy and features (like IP67-rating) that made it such a great product.",
    "On the other hand though, we feel that the Nano Plus should only be called the Nano as there’s no direct comparison that can be made. The Nano is available in 512GB and 1024GB models while the Nano Plus comes in only one capacity - 2TB. The marginal speed gains are likely to come from firmware tweaks as well as technological improvements since the Tuff Nano launched in 2019.",
    "The same conclusion that applied to the original Tuff Nano also applies to the Tuff Nano Plus. Its feature set is unrivalled but we think that Caldigit could improve its pricing strategy as well as the short warranty.",
    "The 2TB Tuff Nano Plus retails for $320 at Amazon and comes with a Charcoal Black or Royal Blue removable rubber sleeve. As a comparison, the 512GB and the 1TB Tuff Nano sell for $130 and $230 respectively.",
    "The updated version of the Tuff Nano is entirely made up of metal. It has the same width and thickness (54 x 14cm) but is longer (102mm) and heavier (100g).",
    "That’s without the rubber bumper that can be easily removed and helps protect the device better. It does remind us a lot (and I mean, A LOT) of the smaller Sabrent Rocket Nano.",
    "The bumper also contains a flap that hides the Type-C connector and allows the Tuff Nano Plus to earn an IP67 rating. This certification means that they can stay in 100cm of water for 30 minutes and withstand dust particles without being negatively affected. Then there’s its ability to withstand falls of up to 3m on any surface.",
    "Other than a few writings and the logotype, there’s hardly anything else worth mentioning when it comes to the design.",
    "The enclosure hides a Type-C to M.2 board with an NVMe drive and a thermally conductive pad that spreads the head around the metal enclosure. Less heat means that the device won’t throttle quickly, which means that performance is likely to stay stable over a long time.",
    "The exact source of the controller and the NAND chips will remain a mystery as you can’t open the drive without permanently damaging it. There are reports that it uses QLC technology but smaller vendors like Caldigit can often qualify and pick and choose different manufacturers depending on supply and pricing.",
    "The drive comes with a short Type-C to Type-C cable, in a clear plastic box with a warranty pamphlet.",
    "We used the beautiful Bleujour Kubb Gen 11 Intel Mini PC, which we reviewed earlier this year, as the benchmark machine. Caldigit claims that the drive can reach up to 1.088GBps, a tiny 0.033MBps on its predecessor. Bear in mind that these tend to be top speeds reached under optimal operating conditions.",
    "The drive is pre-formatted for out-of-box use with Apple’s MacOS. That means it will need to be formatted to exFAT (or NTFS) before being recognised on a Windows device.",
    "We’re glad to report that the drive was one of the fastest that we’ve reviewed in recent times. While it didn’t reach the top figure of 1088MBps, it did manage a still very respectable 1.063GBps on CrystalDiskMark and was faster than rivals such as the Sandisk Professional G-Drive SSD or the OWC Envoy Pro Elektron.",
    "Its read and write speeds were consistently better than most of the competition with its real life transfer rate speed clocked at an impressive 582MBps. As a reminder, this test includes moving a single 10GB file from one folder on Windows to the drive, which is exFAT formatted.",
    "The drive didn’t feel warm under load and while we wished the bundled USB cable was longer, it is a minor stumbling block.",
    "Buy it if:",
    "You need a storage device with more than 1TB capacity, is fast, compact, waterproof and reasonably cheap.",
    "As for its predecessor, the Caldigit Tuff Nano Plus has managed to balance the four aforementioned features of varying importance; that might go some way to justify the slightly higher price tag. Some will consider the Sandisk 2TB Extreme Portable SSD to be a better choice thanks to its carabiner and cheaper price tag but it is IP55 rated only. Others may claim that the Teamgroup PD1000 is a better deal despite its slightly worse performance and bigger size.",
    "Don’t buy it if:",
    "You want an ultra secure storage solution",
    "The smaller Samsung T7 Touch comes with a fingerprint reader and costs a tad less - at the time of writing - than the Call Tuff Nano Plus. On the other hand though, it is slightly slower and doesn’t come with a IP67 rating.",
    "You don’t need a waterproof external storage device",
    "The Crucial X8 is significantly cheaper than the Tuff Nano Plus and while it is a tad slower and doesn’t come with any waterproof rating, it does carry a significantly longer warranty (five years in the US, three years in the UK)."
  ],
  "headers": {
    "0": "Two minute review",
    "3": "Pricing and availability",
    "4": "Design",
    "8": "Hardware",
    "11": "Performance and in use",
    "16": "Should I buy the Caldigit Tuff Nano Plus?"
  },
  "links": {
    "Tuff Nano": "https://www.techradar.com/reviews/caldigit-tuff-nano-ssd",
    "2TB Tuff Nano Plus": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FCalDigit-Tuff-Nano-Compatible-Thunderbolt%2Fdp%2FB09BW88XBF%3Fref_%3Dast_sto_dp%26th%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1386492430463282000-20",
    "Bleujour Kubb Gen 11 Intel Mini PC": "https://www.techradar.com/reviews/bleujour-kubb-gen-11",
    "Sandisk Professional G-Drive SSD": "https://www.techradar.com/reviews/sandisk-professional-g-drive-rugged-external-2tb-ssd",
    "OWC Envoy Pro Elektron": "https://www.techradar.com/reviews/owc-envoy-pro-elektron-usb-c-nvme-ssd-review",
    "Sandisk 2TB Extreme Portable SSD": "https://www.techradar.com/reviews/sandisk-extreme-pro-v2-1tb-external-portable-ssd",
    "Teamgroup PD1000": "https://www.techradar.com/reviews/teamgroup-pd1000-external-rugged-ssd",
    "Samsung T7 Touch": "https://www.techradar.com/reviews/samsung-t7-touch-external-ssd",
    "Crucial X8": "https://www.techradar.com/reviews/crucial-x8-1tb-portable-ssd"
  }
}