{
  "source": "https://www.techradar.com/reviews/roku-streaming-stick-4k-2021",
  "title": "Hands on: Roku Streaming Stick 4K (2021) review",
  "category": "televisions",
  "updated": "2021-10-15T13:00:11Z",
  "author": "nick-pino",
  "summary": "A small upgrade for Roku’s mid-range 4K HDR streaming stick",
  "verdict": "The new Roku Streaming Stick 4K (2021) offers a few new appealing features like support for Dolby Vision and HDR10+ and faster startup speed, but so far it feels more iterative than innovative.",
  "pros": [
    "Faster boot up speed",
    "Dolby Vision and HDR10+ support",
    "Long-range Wi-Fi"
  ],
  "cons": [
    "Iterative not innovative",
    "Steep competition",
    "Remote pairing problems"
  ],
  "article": [
    "The Roku Streaming Stick (2021) isn’t quite the massive overhaul we were expecting for Roku’s popular mid-range streaming stick, but it does offer some nice upgrades.",
    "Among them are support for Dolby Vision and HDR10+ as well as a new processor that should speed up the startup process.",
    "Elsewhere, Roku is working on improving the Roku mobile app to be more helpful when you’re not right next to your streaming stick and the Stick’s unique selling point - longer Wi-Fi range - remains intact.",
    "Still, there’s a feeling of iteration here that’s hard to shake. And while it might offer a few good upgrades for folks just starting out with cord-cutting, anyone with a relatively recent streaming stick probably won’t see much of a reason to upgrade.",
    "The new Roku Streaming Stick 4K became available in mid-October 2021 and was released alongside the Roku Streaming Stick 4K+ that includes the Roku Voice Remote Pro.",
    "In terms of pricing you’re looking at $49.99 / £49.99 (around AU$70) for the Roku Streaming Stick 4K and $69.99 (around AU$100) for the Roku Streaming Stick 4K+.",
    "Compared to the competition, that’s incredibly close to the brand-new Amazon Fire TV Stick 4K Max that costs $54.99 / £55 / AU$99 and the Chromecast with Google TV that came out last year and goes for $49.99 / £59.99 / AU$99. Both of those players offer similar features to the new Roku Streaming Stick 4K and, for some, might even be better values.",
    "The new Roku Streaming Stick looks a lot like the old Roku Streaming Stick. It’s about the size of a USB thumb drive and it plugs right into the HDMI port on your TV.",
    "To get power, you’ll either need to plug it into a USB port on the TV or use the included power adapter to plug it into the wall.",
    "You’ll notice that in between the head and tail of the streaming stick is a solid plastic bar - that’s the long-range Wi-Fi antenna. To maximize its range Roku recommends keeping it away from the HDMI ports on the TV and making sure it doesn’t get tangled up with other cords. If it does, you might not get the maximum range from the antenna.",
    "Also included in the box is a Roku voice remote with two AAA batteries. Weirdly our remote didn’t sync up with our player - potentially, Roku says, because there are a number of other Roku devices elsewhere in the house - but we were able to get it connected to a Roku Voice Remote Pro.",
    "Admittedly there’s not a huge difference between the two remotes but the Pro offers an always-listening assistant that can be summoned with “Hey Roku” and a rechargeable battery.",
    "That being said, you don’t always need to use the remote if you don’t want to. The Roku Streaming Stick 4K supports Alexa and Google Assistant voice commands, as well as AirPlay 2 streaming from iPhone, iPad or Mac. You can also replace the remote entirely with the Roku app that allows you to control the streaming stick and offers private listening.",
    "Based on everything we knew about the new Roku Streaming Stick, we were expecting a moderate boost in performance, and that's exactly what we got: with a new SoC installed the Roku Streaming Stick does offer a slightly faster boot up speed (around 30%) and a hair faster navigation, but it hasn’t felt substantial.",
    "That being said, we do appreciate seeing both Dolby Vision and HDR10+ support on the streaming stick and slightly faster connection speeds. With both HDR formats on-board you can buy pretty much any model of high-end HDR TV from Samsung, LG or Sony and be able to watch shows and movies in every format.",
    "The user interface and app selection hasn’t changed much in the last few years either. We’ve gotten a few new big streaming services like HBO Max, Disney Plus and Peacock, but we’ve also lost YouTube TV to an ongoing negotiation between the two companies.",
    "Where Roku says it’s putting more of its innovation is in the Roku app that now allows you to stream content from the Roku Channel anywhere and will soon support up to four devices for private listening.",
    "The downside to investing in the app rather than making major changes to the player itself is that there’s then little reason to upgrade. If you already have a 4K HDR streaming stick from Roku - even one that doesn’t offer Dolby Vision / HDR10+ support - you’ll still see about 90% of the same features and performance as the latest model.",
    "For first time buyers and folks looking to upgrade their first- or second-gen Roku devices, the new Roku Streaming Stick seems like it's a very good value, offering modern specs and formats at a great price.",
    "However, if you have any model from, say, the last three years, you probably won’t see much of a performance boost here. All the changes to the app will be available to you and because the functionality is more or less the same across models, you’re not missing out on much by skipping this one."
  ],
  "headers": {
    "4": "Price and release date",
    "7": "Design",
    "13": "Performance",
    "18": "Early verdict"
  },
  "links": {
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "Roku Streaming Stick": "https://www.techradar.com/reviews/roku-streaming-stick"
  }
}