{
  "source": "https://www.techradar.com/reviews/nuratrue",
  "title": "NuraTrue review",
  "category": "audio-visual",
  "updated": "2021-07-28T14:01:11Z",
  "author": "olivia-tambini",
  "summary": "The most customizable wireless earbuds you can buy",
  "verdict": "The NuraTrue are a fantastic pair of wireless earbuds, with the level of customization on offer unrivaled. An excellent audio performance, noise cancellation, and an IPX4 water-resistance rating only sweeten the deal.",
  "pros": [
    "Excellent sound",
    "Highly personalized",
    "Noise cancellation"
  ],
  "cons": [
    "Don’t use latest Bluetooth version",
    "Battery life could be better"
  ],
  "article": [
    "The NuraTrue are perhaps the most personalized wireless earbuds you can buy today – and they’re among the best-sounding, too.",
    "They’re the first true wireless earbuds from Australian audio brand Nura, following in the footsteps of its NuraLoop earphones – which, incidentally, are our pick for the best wireless earbuds of 2021.",
    "The NuraTrue are another success for the company, offering unbeaten levels of customization that allow the earbuds to be tuned to your ears exactly. The accompanying app even analyzes how well the buds fit into your ears.",
    "The end result is outstanding audio performance that reveals superb levels of detail in your music, and a wide soundstage that enables every instrument to sing.",
    "And in case you think these earbuds are made with only audio in mind, they in fact come with plenty of features that will appeal to anyone who wants a cheaper alternative to popular models such as the AirPods Pro and the Sony WF-1000XM4. These features include decent noise cancellation, an IPX4 water-resistance rating, fast charging, and support for hi-res audio too.",
    "So, you’re getting an awful lot for your money with the NuraTrue – and as a result, they’re a worthy rival to the very best true wireless earbuds on the market.",
    "The NuraTrue wireless earbuds are available to buy for $199 / £199 / AU$299. This makes them cheaper than the best wireless earbuds you can buy today, the Sony WF-1000XM4, and around the same price as the Grado GT220.",
    "They’re also the same price as the NuraLoop earphones, which were launched in May, 2020. Unlike the NuraTrue, the NuraLoop headphones feature a cable that connects each bud, so they aren’t truly wireless.",
    "There are lots of cheaper wireless earbuds available, including the Cambridge Audio Melomania 1 Plus and the Lypertek PurePlay Z3, but neither of these models offers the personalization you get with the NuraTrue.",
    "The NuraTrue wireless earbuds sport some of the biggest housings we’ve seen from a pair of in-ear headphones, and you could be forgiven for thinking that they’d be uncomfortable to wear as a result.",
    "Happily, this isn’t the case. These buds come with a selection of foam and silicone eartips, as well as fins, to keep them secure. Plus, the flat circular housing of each bud sits comfortably in the outer part of your ear. Each housing, which is touch-sensitive, features the Nura logo in silver, which contrasts pleasingly with the otherwise all-black design.",
    "An IPX4 water-resistance rating means you shouldn’t encounter any issues wearing the NuraTrue through a workout; they’ll happily survive a splash of sweat or even being caught out in a minor rain shower.",
    "The buds come with a slick, flip-top charging case, which you can charge via the USB-C port on the back. Meanwhile, a row of four LEDs on the front of the case provides an indication of the remaining battery life.",
    "Our only bugbear is that it proved very easy to mix up the left and right earbuds when popping the units into the case for charging, since each bud sort of fits into the incorrect slot. If this happens, the earbuds won’t charge, and the case won’t shut fully – which is irritating.",
    "The setup is probably the most exciting thing about using the NuraTrue earbuds – and we don’t mean that in a disparaging way. This is where you get to personalize your earbuds.",
    "But first you’ll need to download the Nura app and pair the earbuds through your device’s Bluetooth settings. Then, open the app and select the NuraTrue from the available headphones.",
    "Next, the app will run you through a fit test, to ensure you’re wearing the right-sized eartips and fins for your ears. Then you’ll be put through some hearing tests, during which you’ll hear a multitude of beeps and boops that span the entire frequency range. This supposedly allows the buds’ soundstage to be tuned to your ears.",
    "To give you a sense of the difference this makes, the Nura app lets you hear music without this personalized sound profile applied, allowing you to toggle between Neutral and Personalized settings with an in-app switch.",
    "The app supplied the music – Sasha’s View2 – and we noticed the difference straight away. With the Personalized setting engaged, music sounded warmer, displaying far greater detail in the treble frequencies and better bass control as well. Overall, the track sounded more dynamic and generally more engaging to listen to. By comparison, the Neutral setting sounded rather tinny.",
    "You’re still not finished setting up the NuraTrue, however. Now the app moves on to Immersion mode, which Nura claims replicates the sound of live music. Using a slider, you can adjust how strongly you’d like the Immersion mode to be applied to your music. We were skeptical, but it does make a noticeable difference, creating a wider soundstage.",
    "With this setting turned all the way up, the bass was positively thunderous – in truth, we found it a little overwhelming, so we settled on half way.",
    "The final step in the setup process is to configure the touch controls, which is yet another way the NuraTrue earbuds offer a personal listening experience. We opted to set one tap of the left earbud to play / pause music and answer calls, and a double-tap to go back to the previous track. Meanwhile, one tap of the right earbud was set to volume up, and two taps to volume down. We found the touch controls worked pretty well. On occasion, we experienced a slight lag between a tap and the resulting action, but it’s a small concession when you consider the level of customization offered for the controls.",
    "The whole setup process does take some time – about five minutes in our experience – but the end result is worth it. Besides, you won’t actually be able to use the NuraTrue without going through the in-app setup.",
    "The NuraTrue wireless earbuds’ audio performance is outstanding – and, despite sounding excellent out of the box, it’s all those customizable audio settings that make these in-ear headphones so special.",
    "Listening to Princes’ Gang Gang Dance, the pulsating synths and driving, distorted percussion sounds as if it’s coming at you from every angle. As the bass line drops, with Tinchy Stryder’s attacking rap vocal coming in, the sound feels incredibly immersive, with a wide soundstage and plenty of detail.",
    "Subby kick drums are so powerful that you can almost feel them thumping in your chest – and that effect is only heightened as you turn up the Immersion mode in the app (although, as mentioned, we found this mode a little overpowering when set to max).",
    "More delicate arrangements are handled just as well by the NuraTrue earbuds, with the cascading harp arpeggios in Joanna Newsoms’ Cosmia sounding clear and rich. Incidental string flourishes sound lush, with plenty of room for every instrument to stand out – everything from Newsom’s piercing vocal to the rumble of orchestral cymbals has its place.",
    "Noise cancellation is pretty good, too. It isn’t as good as that offered by the Bose QuietComfort Earbuds, but it does a great job of blocking out most environmental noise. There’s also a Social mode, which feeds in the sound of your environment, as well as turning your music down – you can assign this mode to one of the touch controls if you want to be able to chat to someone quickly without removing your earbuds.",
    "The battery life of the NuraTrue wireless earbuds comes in at 6 hours from the buds themselves, with a further 18 hours provided by the charging case. That’s about the same as you’ll get from the Apple AirPods Pro. While it isn’t class-leading, like the 45 hours provided by the Cambridge Audio Melomania 1 Plus, it’s enough to get you through a week’s worth of commuting.",
    "The earbuds can be charged in two hours, while the charging case will take about two-and-a-half hours to top up.",
    "Connectivity comes courtesy of Bluetooth 5. This isn’t quite the latest version, but you can still be assured that pairing will be fast and your connection should remain stable. The NuraTrue earbuds also include support for aptX, SBC and AAC codecs, so you’ll be able to stream hi-res audio."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "NuraTrue price and availability",
    "9": "Design",
    "14": "Setup",
    "23": "Audio performance and noise cancellation",
    "28": "Battery life and connectivity",
    "31": "Don’t buy them if…"
  },
  "links": {
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "NuraLoop earphones": "https://www.techradar.com/reviews/nuraloop-headphones",
    "best wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Grado GT220": "https://www.techradar.com/reviews/grado-gt220",
    "Cambridge Audio Melomania 1 Plus": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
    "Lypertek PurePlay Z3": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "n-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds"
  }
}