{
  "source": "https://www.techradar.com/reviews/visualping-web-content-monitoring",
  "title": "Visualping web content monitoring review",
  "category": "computing",
  "updated": "2021-09-08T05:13:59Z",
  "author": "richard-sutherland",
  "summary": "Sophisticated website monitoring with a wealth of use cases",
  "verdict": "Visualping’s website change monitoring algorithm is one of the best, helping you keep track of important changes online, but it comes with a hefty price tag.",
  "pros": [
    "Easy to use but powerful",
    "Integrates with third-party tools like Slack"
  ],
  "cons": [
    "Limited documentation",
    "Support via email only"
  ],
  "article": [
    "Visualping is a set of tools for monitoring changes in website pages. You list the web pages that you want to monitor, and Visualping will send you an email when the content changes.",
    "This simple idea has many use cases. You can use Visualping to monitor competitor websites, get alerts on special offers, keep an eye on new job posts from coveted companies, track your Google rankings for key phrases, or get alerts when your company is mentioned online.",
    "In our Visualping review, we look at its pricing, features, and interface to ascertain whether it's the best website change monitoring software today.",
    "Visualping has multiple ways to pay. Personal plans can be paid monthly or annually, with the latter giving you two months for free. The Starter plan is free but limited to two pages per day, checked daily. The Intensive plan ($13/month) can be used to check one page every hour. Intensive 4k ($24/month) allows for five pages per hour.",
    "Only at the Intensive 10k level ($58/month) can you begin checking pages every five minutes, though you can check up to 13 pages at a time. Finally, the Intensive 20k plan ($97/month) includes 28 pages per hour.",
    "Pay-per-use pricing works on a sliding scale. $10 will get you 300 checks, but $20 will get you 1,000 checks. Pay $200, and you’ll get 30,000 checks.",
    "Business plans are priced on a per-month, per-user basis. There are three plans, paid annually, and the pricing is broadly in line with the personal plans. You get a few perks with a business plan, including a dedicated account manager and three hours of setup assistance.",
    "There are many website monitoring software solutions out there, but Visualping stands out for how customizable the alerts can be. You can control what you want to be alerted about, and there’s smart coding involved that avoids excessive false positives.",
    "Visualping lists mobile apps as a feature on its website, but they’re not actually available yet.",
    "Website widgets",
    "An interesting Visualping feature is its website widget, which you can add to your website so users can subscribe to your pages. They will be emailed when your page updates.",
    "This is a pleasant alternative to RSS feeds because customers won’t need an RSS reader. You also don’t need to worry about sending out newsletter blasts telling people about important changes—interested visitors will automatically receive page updates from Visualping.",
    "Browser extensions",
    "Visualping has browser extensions for Chrome and Firefox. When you find a web page that you want to be kept abreast of, you can create an alert using the extension. You have the choice of receiving alerts via email through the Visualping servers, or you can bypass email completely and just have alerts pop up in your browser.",
    "Visualping bills itself as simple but powerful. Getting started is as easy as entering a website to monitor and specifying your email address. But there are more advanced options for fine-grained control over your alerts.",
    "Checks can be performed on a schedule. You can decide whether Visualping should perform a visual or text comparison or check a single element on a web page. It can also be set to perform an action on the page, such as clicking a link or filling in a text box. You can set alerts to only be sent if a specific keyword has been added or removed.",
    "Instead of just email alerts, you can get notifications on Slack, Teams, Discord, or text, so anyone in your team can respond to an alert quickly. If you’re getting too many false positives, you can adjust how big a change needs to be before you get an alert.",
    "Visualping support is minimal. The FAQ page does an okay job of outlining many of the features, but some of the content refers to an older version of the software.",
    "There’s no phone support or live chat. Support is available through email with a 24-hour response time. Corporate customers get a faster reply because they have a dedicated account manager.",
    "That said, we found Visualping’s email support team to be exceptional, helping us understand the product better and working hard to ensure that we got the most from it.",
    "Visualping is good for monitoring other people’s websites, but if you need to monitor your own sites, we prefer Site24x7 from Zoho. It offers comprehensive reporting on all your websites, servers, and cloud services, and it can be used to set up automated actions for when something is wrong.",
    "We also like Wachete, which has a similar feature set to Visualping. Its free forever plan enables you to monitor five pages every 24 hours, and the paid plans are cheaper than Visualping ($49.90/month enables you to monitor 500 pages every five minutes).",
    "Visualping is an easy-to-use website monitoring tool with great customizability. It has an intuitive interface, so you can build website alerts quickly, but it also has enough options and filters that you can avoid false positives and only receive the alerts that you’re most interested in.",
    "This versatility comes at a cost, however. On a per-page basis, Visualping is more expensive than competitors like Wachete and Distill.io. Visualping has also been slow to roll out its mobile apps, making its competitors look like even better value.",
    "But if these other applications are sending you too many false positives or not alerting you in a timely fashion, you may find that Visualping’s more sophisticated monitoring system is worth the additional expense."
  ],
  "headers": {
    "3": "Plans and pricing",
    "7": "Features",
    "14": "Interface and in use",
    "17": "Support",
    "20": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Visualping": "https://visualping.io/",
    "best website change monitoring software": "https://www.techradar.com/best/best-online-content-monitoring-software",
    "Starter plan": "https://visualping.io/pricing",
    "Intensive plan": "https://visualping.io/pricing",
    "Intensive 4k": "https://visualping.io/pricing",
    "Intensive 10k level": "https://visualping.io/pricing",
    "Intensive 20k plan": "https://visualping.io/pricing",
    "Business plans": "https://visualping.io/corporate",
    "Site24x7": "https://www.site24x7.com/",
    "Wachete": "https://www.techradar.com/reviews/wachete-web-content-monitoring"
  }
}