{
  "source": "https://www.techradar.com/reviews/bomaker-polaris-4k-ultra-short-throw-laser-tv",
  "title": "Bomaker Polaris 4K ultra short throw laser projector review",
  "category": "computing",
  "updated": "2021-11-11T13:29:08Z",
  "author": "desire-athow",
  "summary": "A newcomer in the world of projectors wants to make a splash",
  "verdict": "While the Bomaker Polaris 4K scores very highly when it comes to core features like picture quality, it fails to impress on the overall user experience. Average connectivity, no smart capabilities and a high suggested retail price make it a difficult sell, placing it squarely in the laggard’s seat.",
  "pros": [
    "Solidly built",
    "Triple light sources",
    "MEMC",
    "Low power consumption"
  ],
  "cons": [
    "Relatively high SRP",
    "No App store",
    "No unified remote control experience",
    "Lack of corner keystone correction"
  ],
  "article": [
    "The Polaris 4K is a first attempt at the higher end of the market by Bomaker as it launched on Kickstarter. It fits the bill as a basic 4K ultra short throw projector with claims of being the world's widest color gamut projector (thanks to its RGB laser technology) to be taken with a pinch of salt.",
    "Businesses will love its ability to handle 4K content natively, delivering punchy colours even in a brightly lit room. While it delivers on that side, it still lacks the all-roundedness of a more mature platform and that’s simply not excusable at this price point, especially with rivals queuing up.",
    "The projector is available directly from Bomaker from just under $1900 with an $800 discount when you use the coupon code POLARIS800 at checkout. Note that the price doesn't include shipping or any extra fees you may have to pay for courier handling and local taxes. The offer ends on September 18th.",
    "The VAVA 4K projector got some superb comments in its review and sells for around $2,800 in the US on Amazon. Elsewhere, there’s a number of 4K ultra short throw projectors that have emerged as potential challengers in the sub $3,000 price bracket and, surprisingly, all tied to Chinese consumer behemoth, Xiaomi; Fengmi ($1,870 at Banggood) and Mijia (older version at $1,720, newer version at $1,900, both at Banggood) are untested but still worth a look given the growing clout of their common backer.",
    "At the time of writing, an 86-inch 4K TV from a tier-1 brand, LG, costs less than $1,900 and may serve as a useful baseline for choosing between a projector and a television set. Anything bigger costs exponentially more and falls into the digital signage/large format display panel category. Samsung’s 98-inch QB98R for example, retails for over $7,800 and weighs 77Kg without the stand.",
    "The Polaris 4K espouses the same format that others have popularized before it. A rectangular block of obsidian black plastic with a matte surface and a big glass window at an angle, bang in the middle. 22cm separates the side of the projector that sits against the wall to the window of the laser beam.",
    "This is an ultra short throw projector with some oomph. At 520 x 331 x 152mm for a weight of 9.2Kg, it is a big piece of electronics and can be said to be reassuringly heavy. A note to the manufacturer; it might be useful to have handles or recessed pockets to help carry the device securely.",
    "Facing away from the window, the connections are located on the right hand side of the device, there are two HDMI ports (labelled 4K at 60Hz) with one of them labelled as ARC enabled, two service ports, an AV in, an SPDIF port, a Gigabit Ethernet port and a USB port that can deliver 5W of power.",
    "Note there’s another one located on the left hand side of the device while the power button is a touch one located near the right corner furthest to screen.",
    "Inside, there’s a radio chip that provides 802.11n Wi-Fi and Bluetooth 4.2 as well as a quad-core processor (Mstar 6A-838 CPU) with 3GB memory and 32GB onboard storage.",
    "It is a major disappointment that the Polaris 4K doesn’t come with any smart features; forget about the sleek, intuitive Android TV experience like on the Xgimi MoGo Pro. Instead, say hello to a user interface that runs on Android 6.0, a five-year old operating system.",
    "There’s no app store and while the extensive granular control was better than expected, we couldn’t but cringe at the fact that the Roku 4K stick was merely bundled as a way to paper over the cracks.",
    "Bomaker explained that \"Google AndroidTV authorization certification only authorizes TV brands [to carry Google Play app store], and projector brands are not authorized. Therefore, projector products from China in overseas markets have no content (except those authorized by TV brands )\" and that includes rivals like VAVA and Optoma.",
    "Speaking of the Roku stick, the latter identified the Bomaker Polaris 4K as a Hisense Laser TV and both shared a number of features. The company has confirmed that Hisense is their OEM, that is, it produces the projector for Bomaker and therefore very likely uses a lot of similar parts found in the former's more expensive Laser TV. They do however have their own R&D team.",
    "Lastly, the remote control is gold champagne with solid buttons, comfortable to manipulate and was quite responsive during use; shame we didn’t enjoy a unified remote control environment.",
    "Since this is an ultra short throw projector, be aware that it has a short throw ratio of 1:4 which, Bomaker says, means you will get a 250cm display from a distance of 25cm. Obviously, the further you are from the screen, the fainter and more blurry the pictures become and this is especially true in the top right and top left corners. Just to confirm, this is something that impacts all projectors, not just Bomaker's.",
    "Sticking the projector next to the wall gave a diagonal of 140cm, around 55-inch, with the base of the screen 25.3cm above the ground (or 10.3cm higher than the top surface of the Bomaker Polaris 4K). While it is a suitably large display, an ultra short throw laser is destined for far, far bigger displays.",
    "Pull it a bit further (48cm) and the diagonal increases to 353cm (or around 140-inch) with the screen measuring 170 x 310cm. We couldn’t go further as this was the largest vertical surface available to us but we can’t see any reason why you wouldn’t use this projector on a much larger virtual screen.",
    "With a 30,000 hours lamp life, this “RGB color laser” projector uses MEMC motion compensation technology - which artificially boosts the frame rate - and the same 0.47-inch TI-sourced DMD (digital micro mirror) as most 4K UST projectors but with a laser light source compared to, say VAVA’s ALPD 3.0 source, like most of the competition. That translates into a lower power consumption (185W), which means quieter cooling and fans.",
    "The Polaris 4K claims to use three separate color sources (Class-2 laser beams) that converge to deliver above average coverage of the color gamut, up to 193% of NTSC’s conventional range (in geek speak, Rec/BT.2020 at 107% and DCI.P3 at 151%). In theory, that translates to finer details, more realistic colors and deeper black levels.",
    "The manufacturer claims up to 2,500 ANSI lumens of brightness as well as a contrast ratio of 2,000:1, something we haven’t tested, but which, if true, should match Vava’s and the Optoma CinemaX P1 numbers. Bear in mind that just like a color printout is only as good as the paper it is printed on, the picture quality of any projector is highly dependent on the surface on which it is paired with.",
    "Note that the Polaris 4K laser TV has the ability to detect an approaching body (animals, children, adults) and automatically shut down the projector to prevent any potential for harm. Technophiles should note that the projector uses a Ricoh lens, comes with HDR10 and has no built-in 3D capability.",
    "Our test (see boxout) shows that the Bomaker Polaris 4K is a capable workhorse. Still images certainly capitalize on the unit's resolution, which could pave the way for some intriguing use cases in a WFH scenario. Apart from the above average detail colours, which while a touch muted, are the right side of realistic and the Polaris 4K colour engine brings out well defined skin tones.",
    "We didn’t notice any rainbow effect or any artefact that’s common to DMD projectors. Note though that we tested the unit to the best of our ability but do understand that there are circumstances beyond our control that prevent us from exploring the capabilities of the Polaris 4K further.",
    "First the good news, the Bomaker Polaris 4K is quiet, partly because of its relatively low power consumption (and dissipation). At 185W it is significantly lower than the competition despite using three light sources rather than one. There’s a very loud jingle when you switch on the projector but that can - fortunately - be disabled in the settings.",
    "Despite its price tag, the Polaris 4K has only two 10W drivers, which compares poorly with rivals. That said, the sound quality was overall good despite the lack of granularity in terms of channel separation. The projector supports both Dolby and DTS audio formats.",
    "You want a quiet ultra short throw projector. At less than 30dB, this is a relatively quiet UST projector compared to some vacuum cleaners we’ve reviewed in the past. This makes it ideal for a boardroom or a conference space but how exactly does it achieve such noise levels.",
    "You want a relatively low-power projector. At 185W, it consumes significantly less power than the competition. Which in turn translates into lower running cost, less power dissipated and less need for powerful fans; likewise, less heat usually means higher reliability.",
    "You want great pictures. The Polaris 4K is promising to say the least. Despite our non-optimal viewing environment, it delivered some fantastic results under some very challenging circumstances to say the least. A decent screen in a blackout environment would deliver even better performance.",
    "You’re obsessed with brands. You’ll probably never heard of Bomaker and neither did we before the manufacturer reached out to us. Like Vava or Anker, this is one of the thousands of mostly Chinese mainland brands that have prospered on Amazon and do not have a pedigree of a Sony or an LG. A US-company called Substanbo builds the Polaris 4K. Not a household name but it still claims to have 500 employees.",
    "You have plenty of devices you want to plug in. The Polaris 4K has only two HDMI ports. Two.",
    "You want a full, integrated Android TV OS experience. The platform on which the Polaris is built is rudimentary to say the least. Don’t expect anything as sleek as what you’d encountered on a standard Android TV, “rough around the corners” is an understatement in the case of the Bomaker. Yes, it works, but think traditional display rather than smart monitor.",
    "You want a long warranty. The Bomaker Polaris 4K comes with 15 months warranty; Bomaker has confirmed that this can be extended at a cost."
  ],
  "headers": {
    "0": "One minute review",
    "2": "Where to buy",
    "3": "How does that compare to the competition?",
    "5": "Design and features",
    "15": "Picture quality",
    "24": "Audio performance",
    "26": "Buy it if...",
    "29": "Don't buy it if..."
  },
  "links": {
    "Bomaker": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3523160982293248500&xs=1&url=https%3A%2F%2Fwww.bomaker.com%2Fproducts%2Fpolaris-4k-ultra-short-throw-laser-tv&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbomaker-polaris-4k-ultra-short-throw-laser-tv",
    "VAVA 4K projector": "https://www.techradar.com/reviews/vava-4k-laser-projector",
    "Fengmi": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-1813848225713082400&ulp=https%3A%2F%2Fwww.banggood.com%2FNew-Version-Fengmi-4K-Cinema-Laser-Projector-2000-ANSI-Lumens-150-inch-ALPD-4K-3D-BT-4_0-MIUI-TV-White-p-1597909.html%3Frmmds%3Dsearch%26cur_warehouse%3DHK",
    "older version at $1,720": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-6193050553498349000&ulp=https%3A%2F%2Fwww.banggood.com%2FXiaomi-Mi-4K-UHD-Laser-Projector-150in-16GB-eMMC-5G-WiFi-Dolby-DTS-Android-TV-9_0-ALPD-3_0-1300lm-Laser-Smart-TV-Global-Version-p-1717994.html%3Frmmds%3Dsearch%26cur_warehouse%3DHK",
    "newer version at $1,900": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-2010421574505092400&ulp=https%3A%2F%2Fwww.banggood.com%2FNewest-VersionXiaomi-Mijia-1S-4K-Cinema-Laser-Projector-2000-ANSI-Lumens-150-inch-ALPD-4K-3D-BT-4_0-MIUI-TV-Xiaomi-Projector-p-1692866.html%3Frmmds%3Dsearch%26cur_warehouse%3DHK",
    "costs less than": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLG-86UN8570PUC-Alexa-Built-Ultra%2Fdp%2FB083XWM64D%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8606601802006358000-20",
    "digital signage": "https://www.techradar.com/best/best-digital-signage-software",
    "large format display panel": "https://www.techradar.com/news/large-format-displays",
    "Xgimi MoGo Pro": "https://www.techradar.com/reviews/xgimi-mogo-pro-portable-projector",
    "Laser TV": "https://www.techradar.com/news/hisense-laser-tv-claims-to-be-good-for-your-eyes",
    "Optoma CinemaX P1": "https://www.techradar.com/reviews/optoma-cinemax-p1",
    "vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}