{
  "source": "https://www.techradar.com/reviews/blackmagic-pocket-cinema-camera-6k-pro",
  "title": "Blackmagic Pocket Cinema Camera 6K Pro review",
  "category": "cameras",
  "updated": "2021-03-11T16:21:31Z",
  "author": "sam-kieldsen",
  "summary": "The most complete Pocket Cinema Camera yet",
  "verdict": "While beginners and even some experienced users might find its quirks quite baffling at first, the Pocket Cinema Camera 6K Pro is a fantastic and affordable tool for the professional videographer. Packed with useful, thoughtful features and offering the same superb 6K image quality as its predecessor, this compact and adaptable video maestro is ideal for filming b-roll and on-the-hoof material, while its small size, large screen and simple controls give it a well-honed, unfussy feel.",
  "pros": [
    "Fantastic image quality",
    "Improved battery life",
    "Time-saving built-in ND filters",
    "Huge, bright tilt screen"
  ],
  "cons": [
    "Not intended for beginners",
    "No real stills capability"
  ],
  "article": [
    "The third Pocket Cinema Camera in Blackmagic Design’s current range, joining the Pocket Cinema Camera 4K and Pocket Cinema Camera 6K, the Pocket Cinema Camera 6K Pro represents an incremental but significant upgrade over the 6K model.",
    "With improved battery life, a brighter and tilt-adjustable screen, three built-in ND filters, two mini XLR inputs and the optional of adding an OLED viewfinder and battery grip, the 6K Pro delivers a big quality-of-life boost.",
    "That said, upgrading from the older 6K isn’t necessarily a good idea. The sensor and image quality are exactly the same, so unless you really want those extra features it’s probably not worth the extra outlay.",
    "For anyone buying their first professional video camera, though, the 6K Pro represents a fantastic deal for the price: its superb image quality and relative user-friendliness make it one of the most accessible enthusiast cameras around.",
    "We say 'relative user-friendliness' because the Pocket Cinema Camera 6K Pro is certainly not designed for newbies or non-enthusiasts and skips many of the features you’d expect from a Sony, Panasonic, Canon or Fujifilm mirrorless camera.",
    "There’s no image stabilization, no tracking autofocus and its stills capabilities are rudimentary in the extreme. If you don’t know video inside-out and aren’t willing to invest in things like gimbals, you’re better off going with something a bit more beginner-friendly like the Panasonic Lumix GH5S.",
    "The Pocket Cinema Camera 6K Pro is available now from a wide range of retailers, priced at $2,495 / £2,254 / AU$3,935. Included in the price is a license for DaVinci Resolve Studio 17 desktop editing software.",
    "That seems like a reasonable price, given that it costs practically the same as the 'standard' Pocket Cinema Camera 6K did at the time of its release in 2019. That camera, as well as Blackmagic’s Pocket Cinema Camera 4K, will remain on sale as current products, rather than being replaced by the 6K Pro.",
    "There are two new 6K Pro-exclusive accessories launching alongside the camera: the Blackmagic Pocket Cinema Camera Pro EVF (costs $495 / £425 / AU$789) and Blackmagic Pocket Camera Battery Grip ($145 / £132 / $219).",
    "Don’t be fooled by the name: the Pocket Cinema Camera 6K Pro won’t be fitting in any of your pockets (unless you exclusively wear harem pants, perhaps).",
    "It has a chunky, angular and wide body that’s larger than most DSLRs (and both the Blackmagic Pocket Cinema Camera 4K and 6K). At 1.238kg without a lens or accessories attached it’s fairly heavy too, but (and this is the key point) it’s still smaller, lighter and more portable than the vast majority of professional cinema cameras.",
    "That’s especially impressive considering how self-contained it is. Lens and memory card aside, this camera has everything you need to start filming 6K footage squeezed inside its frame. There’s a built-in dual microphone and a 5-inch Full HD HDR display for composing and reviewing your shots (it’s a touchscreen too, so you’ll be using it to adjust settings most of the time), plus space for a Sony NP-F570 battery providing enough power for about an hour of recording.",
    "At long last in a Pocket Cinema Camera, the screen can be tilted (up to 90-degrees upwards or about 45-degrees downwards). It’s something Blackmagic users have long been clamoring for, as it makes filming with the camera above or below your eyeline much easier.",
    "It doesn’t flip fully forward like the screens in many video-centric mirrorless and compact cameras, so successfully filming yourself while holding the camera is still a matter of guesswork (unless you invest in an external monitor), but it’s a welcome start.",
    "There’s a huge, rubber-clad grip for your right hand and a large nub for your right thumb to rest against, so it’s not hard to get a good firm grip on the camera. When you do, you’ll find the majority of the physical controls easily to hand, including the all-important video stop/start button and dedicated controls for high frame-rate, autofocus and auto-aperture adjustment.",
    "Three mounting points (one on top, two on the bottom) allow for the attachment of tripods, gimbals, cages, microphones and other accessories, and a small panel on top can be removed to allow the attachment of Blackmagic’s new OLED viewfinder add-on. The other new first-party accessory, the battery grip, attaches to the bottom and trebles the usage time (it holds two extra batteries whilst letting you use a third internal battery).",
    "In terms of connectivity, the 6K Pro represents a slight upgrade on the 6K in that it has two mini XLR audio inputs rather than one. Also available: a 3.5mm stereo audio input (doubling as a timecode input); a full-size HDMI output supporting 1080p at 60fps; a 3.5mm headphone output; and a USB-C port for recording to an external drive, software updates and PTP camera control.",
    "From a filmmaking point-of-view that’s a great line-up compared to what you might expect on a video-centric mirrorless camera. There’s also a 12v power input for internal battery charging and external power supply. Two card slots are available for internal storage: one SD UHS-II slot, and one for CFast 2.0 cards.",
    "Finally, it’s worth noting that, while the PCC 6K Pro is sturdily constructed from a combination of tough plastic and carbon fibre, it’s in no official sense 'rugged' or water-sealed for use in adverse weather conditions.",
    "Anyone considering replacing their Pocket Cinema Camera 6K with the 6K Pro will be unlikely to notice any real improvement in image quality: the 6K and 6K Pro share a 23.1mm x 12.99mm Super 35 image sensor and offer exactly the same video formats, resolutions and frame rates.",
    "But what a sensor it is, allowing you to record 50fps videos at a maximum resolution of 6144 x 3456, or 60fps videos at a slightly lower 6144 x 2560 resolution. Drop down to 2.8K (2868 x 1512) and 1080p and you can up that frame rate to 120fps – perfect for smooth slow-motion playback.",
    "In all there are eight shooting resolutions to choose from, with up to nine frame-rates available (depending on the resolution). Several different Blackmagic RAW and ProRes video codecs are also available, allowing you to tailor capture and compression to fit your available storage space. There are also 13 stops of dynamic range, with an easily adjusted native ISO of 100 to 25,600.",
    "One notable improvement over the regular Pocket Cinema Camera 6K in the Pro is the inclusion of three built-in ND filters, which can be quickly cycled through using a two thumb buttons on the camera’s rear. Sitting between the sensor and lens, these two-, four- and six-stop filters make filming in bright sunlight with wide-aperture lenses possible, and having them inside the camera can potentially save you a lot of time.",
    "As with the regular Pocket Cinema Camera 6K, the 6K Pro has a Canon EF lens mount. It’s a good choice from a practicality point-of-view, as there are hundreds of lenses from lots of different manufacturers available for this system – but if you’re already heavily invested in a rival system like MFT or Sony E-mount, the thought of switching systems or buying adapters probably makes the Pocket Cinema Camera 6K Pro seem a little less affordable.",
    "Like its Blackmagic predecessors, the 6K Pro is not a camera designed for the casual user. There’s no built-in image stabilization and no tracking autofocus, and many of the things you’d take for granted on a consumer mirrorless camera just aren’t available here.",
    "Blackmagic assumes that its buyers are enthusiasts and/or professionals, happy to pull focus manually or pull a gimbal out of their cupboard if image stabilization is required. This approach helps keep the price down, but does make its cameras seem under-equipped and unfriendly in comparison to the major brands’ models.",
    "The switch to a new NP-F570 battery means the 6K Pro offers a sizable increase in battery life over the 6K: around 60 minutes of video recording compared to 45 minutes. That 15-minute boost might not seem like a huge difference, but considering the 6K Pro’s much brighter HDR screen, it’s actually a significant bump.",
    "The Pocket Cinema Camera 6K Pro uses the same sensor as the 6K model and, while it does come with upgraded color science, both the 6K and 4K Pocket Cinema Cameras will be getting the same upgrade via a software update. In other words, you’re getting the exact same image quality here as you’d get with the 6K.",
    "That means a choice between Blackmagic RAW and ProRes for your main recording format, with different options for compression, frame rate and resolution available depending on what you’ve picked.",
    "It’s worth noting that Blackmagic RAW crops the sensor to your desired resolution, which means shooting in anything other than full 6K will mean a cropped image (and a tighter field-of-view), while ProRes offers the full, uncropped field-of-view with all of its available resolutions.",
    "The sheer breadth of formats, profiles and resolutions gives videographers lots of scope for post-shoot editing – but crucially you can achieve excellent-looking results by simply picking the highest 6K resolution and whichever of the pre-loaded LUTs looks suitable, then performing some light color correction and electronic stabilization in post.",
    "Our embedded videos were edited in Blackmagic’s own DaVinci Resolve Studio app using preset LUTs and, in the case of the 4K low light sample, the one-click image stabilization option.",
    "While the sensor isn’t quite as big as a full frame camera’s, it’s physically large enough to handle low light situations excellently (of course, the lens you’re using will have an effect on this too – our embedded low light sample video was shot using a cheap but low light-suitable Canon 50mm f/1.8). The built-in ND filters, meanwhile, mean you can also film in bright sunlight with wide open apertures without blowing out the brighter areas of the picture.",
    "Overall, the sheer editing scope afforded by the Pocket Cinema 6K Pro and its excellent resolution and dynamic range make it just as capable a camera as its predecessor – and an easier one to live with."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Blackmagic Pocket Cinema Camera 6K Pro release date and price",
    "9": "Design and handling",
    "19": "Features and specs",
    "24": "Performance",
    "27": "Image quality",
    "34": "Don't buy it if..."
  },
  "links": {
    "Pocket Cinema Camera 4K": "https://www.techradar.com/reviews/blackmagic-pocket-cinema-camera-4k",
    "Panasonic": "https://www.techradar.com/reviews/panasonic-lumix-s5",
    "Canon": "https://www.techradar.com/reviews/canon-eos-r5",
    "Fujifilm": "https://www.techradar.com/reviews/fujifilm-x-s10",
    "Panasonic Lumix GH5S": "https://www.techradar.com/reviews/panasonic-lumix-gh5s",
    "DaVinci Resolve Studio 17": "https://www.techradar.com/reviews/davinci-resolve-17"
  }
}