{
  "source": "https://www.techradar.com/reviews/gigabyte-aorus-15p-yd",
  "title": "Gigabyte Aorus 15P YD review",
  "category": "computing",
  "updated": "2021-08-27T07:42:16Z",
  "author": "jess-weatherbed",
  "summary": "A devastating gaming powerhouse",
  "verdict": "The Gigabyte Aorus 15P YD absolutely nails the 'gaming' aspect of being a gaming laptop, but a few design choices make the machine feel questionably outdated. If you want something that can play anything you throw at it then look no further, but consider buying a few peripherals to compliment it.",
  "pros": [
    "Impressive gaming performance",
    "Fast display refresh rate",
    "Great selection of ports"
  ],
  "cons": [
    "Terrible webcam placement",
    "Questionable battery life"
  ],
  "article": [
    "If you're looking for a gaming laptop that packs a real punch, and you don't really care for much else then look no further than the Gigabyte Aorus 15P YD.",
    "Gigabyte has a habit of creating gaming laptops that would look more at home in 2015 than our current timeline, something that remains unchanged with the Aorus 15P YD. This isn't necessarily a bad thing, especially if you like a more retro or less 'blingy' look to your hardware, but it won't be winning any beauty competitions against rival products like the Alienware m17 R4.",
    "If you're not keen on the aesthetics then the Aorus 15P YD more than makes up for it when it comes to performance. Our review model is packing an Intel i7-11800H, 32GB of RAM and an Nvidia GeForce RTX 3080 graphics card, optimized in a way that makes it one of the closest desktop replacements we've seen in a portable device.",
    "The small criticisms we have are far from unique by gaming laptop standards, so if you already have concerns on things like battery life and webcam performance you won't be too dismayed by how the Aorus 15P YD represents itself. After all, this is a gaming laptop, so you're not going to squeeze a full day of playtime out of it away from a power source.",
    "Its gaming laptop designation shouldn't prevent you from utilizing all that raw power elsewhere though, especially as its powerful components make it a viable option for those in graphically demanding careers such as VFX artists and video editors.",
    "The somewhat bland design in a public environment like an office or lecture theatre can be a blessing in these circumstances, or if you simply enjoy a look that doesn't scream \"Hey world, I'm a gamer\". The RGB lighting is mostly restricted to the keyboard, and that can be turned down or off entirely, and while other Gigabyte gaming laptops like the Aorus 17G can feature an amazing built-in mechanical keyboard, your colleagues and friends will likely appreciate the lack of distracting noise.",
    "In all, Gigabyte has knocked it out of the park again. If you can stomach the price then buying an Aorus 15P YD will secure you one of the best gaming laptops on the market, providing you're happy to fork over a little more cash for some peripherals to correct where things like webcam and audio quality let the team down.",
    "Our review unit is the YD specification and is priced at $2,399 / £2,399 / AU$3,499, though there are other configurations available under the Aorus 15P name that can be identified by the last two letters of the laptops designation. For example, the Gigabyte Aorus 15P KD model comes with a 240Hz display, an RTX 3060 GPU, 16GB of RAM and a 512GB NVMe SSD, and the Aorus 15P XD has a 300Hz display, 16GB of RAM, a 1TB NVMe SSD and an RTX 3070 GPU.",
    "The availability of the other two models is scarce, but we found the YD model available across many global tech retail websites. This certainly isn't a cheap laptop, but considering the hardware you're getting, we wouldn't consider it to be overpriced, regardless of it being outside of many budgets.",
    "There are cheaper gaming laptops available on the market if you're restricted by the price, but you won't be getting the powerful RTX 3080 GPU or 32GB of RAM. Our suggestions would be the Asus TUF Dash F15 or the Asus ROG Zephyrus G15.",
    "The design of the Gigabyte Aorus 15P YD doesn't have many bells or whistles and plays things relatively safe. There is some of the typical RGB lighting that in true Gigabyte fashion comes out of the box in a blinding level of brightness, but it's restricted to the keyboard and can be switched off where needed. The chassis is rather boxy and lacks anything distinguishing which attributes to the more 'retro' look we mentioned earlier.",
    "It isn't inherently ugly but there are certainly fancier-looking gaming laptops on the market so this can work both ways. The more conservative design of the Aorus 15P will be better suited if you need a singular device for things like study or work, as well as gaming. It weighs in at 5.25 pounds / 2.38 kilograms and measures 14 x 9.6 x 1.06 inches / 357 x 244 x 27 mm which isn't particularly slim or lightweight, but you'll have no issue walking around with it in a satchel or backpack.",
    "A benefit of having such a thicc build is the resulting build quality, which is resoundingly solid. The keyboard baseplate is typically an area on laptops that flexes when pressure is applied, but the Aorus 15P YD doesn't have much give to it. The hinges also feel very robust, so while we wouldn't advise throwing it around, this feels like a gaming laptop that can handle being roughed up.",
    "The trackpad is fairly standard for a gaming laptop as the assumption is that you'll use a gaming mouse or game controller, so it's perfectly serviceable and responsive but lacks any real grain, and there was space available to make it larger and more central. The RGB backlit keyboard sadly lacks the appeal of the mechanical style one seen on the Gigabyte Aorus 17G, but it does manage to squeeze in a Numpad. The result is a little cramped, but the keys themselves feel tactile when you get used to the layout.",
    "On the left-hand side of the chassis, you'll find a dedicated HDMI, mini DisplayPort, USB Type-A port, 3.5mm headphone jack and Ethernet jack. On the right you're getting two additional USB Type-A ports, a Thunderbolt 4/USB-C port and a full-sized SD card slot, so you'll not be left wanting for places to plug in your external monitors and peripherals. The built-in SD card reader is also a great shout for creative professionals, so you won't need to keep a separate adapter or dongle close by.",
    "The speakers are located across the top of the base, alongside the hinge. The audio quality is loud, if a little light on bass, but unless you're an audiophile this won't be something that's noticeable enough to bother you. If you do want a better experience when playing games or watching media then we would absolutely recommend you look into buy a dedicated speaker or use a high-quality gaming headset.",
    "The 240Hz display is a real treat, which certainly helps the Gigabyte Aorus 15P YD's position as a viable replacement for a desktop. Any professional gamers or regular attendees of gaming events will appreciate this laptop as a perfect LAN party laptop that's paired some beasty internal components with a speedy display. Games ran buttery smooth, and while we're not ranked players of any Esports league, the boost from the 144Hz typically seen in gaming laptops could give you a real edge if you have the skills to make use of the higher refresh rate.",
    "The display would have benefited from a less glossy screen though, as we tested games in different lighting situations and found the glare while playing outside was a nuisance that could have been lessened with a matte or anti-glare coating.",
    "We certainly don't have any criticisms when it comes to the performance of the Gigabyte Aorus 15P YD. It handled everything we threw at it, which is to be expected for something with such impressive specifications.",
    "The model we reviewed comes with an RTX 3080 laptop GPU, which is currently the most powerful gaming GPU you’ll find in a laptop, and the 32GB of RAM and an Intel i7-11800H all combine to make this a formidable gaming laptop.",
    "The benchmark results are astonishingly good. In 3DMark the laptop achieved 45,386 on Night Raid, 22,721 on Firestrike, and 9,012 on Time Spy, some of the scores in those respected tests, so it can go toe-to-toe with the likes of the ROG Zephyrus G15 (Night Raid: 43,645 / Firestrike: 21,211 / Time Spy: 9,333).",
    "On top of our usual benchmarks, we played a few rounds of Rust and found that the typically tiresome loading screens were almost non-existent. You can expect to play newly released AAA titles with ease, with games like Cyberpunk 2077 hitting 70FPS with the settings maxed up to Ultra.",
    "32GB of RAM is going to be overkill for anyone who is just after a laptop to play games on. However, for multitasking and demanding creative applications, the additional memory is a great asset. If you're sure you can stick with the standard 16GB needed to play modern games though, the Gigabyte Aorus 15P has variants available.",
    "A setback of most gaming laptops that the Aorus 15P also suffers from is thermals. Given it's packing that beefy RTX 3080, the fans kick in at the mere suggestion of running a few chrome tabs and they're extremely loud. The alternative is you'll melt the laptop's internal components, but we really would suggest you buy a decent headset to block out as much of the noise as possible.",
    "The underside gets toasty too, so don't try and play something demanding while it's on your lap, but the heat isn't noticeably hotter than other products on the market.",
    "We're not going to sugar-coat it – the webcam on the Gigabyte Aorus 15P sucks. The continued insistence on placing a webcam anywhere other than the highest point of the display results in an unflattering angle looking up your nose or chin, so the placement itself is a huge no-no for us.",
    "The actually quality doesn't help it much either, with a considerable amount of background noise (that grainy, static-like disturbance seen when webcams are struggling with low light levels, usually indicating a poor quality sensor), and the image quality leaves a lot to be desired. It does come with a manual privacy cover, which is great, because you can shut it and pretend that the webcam doesn't exist.",
    "Many gaming laptops choose to not include a webcam at all, which would be preferred over this. If you need to look professional in meetings or want to give streaming a try, we would recommend you check out our list of the best webcams or best Logitech webcams on the market.",
    "The potential battery life of the Gigabyte Aorus 15P YD is conflicting, and despite rigours testing we got inconsistent results. Our initial run of the standard PCMark 10 battery test managed a dismal 1 hour and 13 minutes, and after checking everything was correct we ran the test again several time over, with results varying up to 3 hours and 56 minutes. Three tests came back with a similar result that gave us our average time of 3 hours, 11 minutes but we couldn't place what was causing the variation.",
    "Our movie test was more consistent, achieving an average of 3 hours, 47 minutes, and actual gameplay battery life varied depending on how demanding the application was, though typically managed to hit the three hour mark.",
    "This isn't terrible for a gaming device, and being able to play for hours on end, away from a power source isn't very achievable for any gaming optimized laptop, but you can squeeze a little more life out of devices like the Razer Blade Pro 17 if you want to maximize the time you spend away from a power outlet."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "10": "Design",
    "18": "Performance",
    "25": "Webcam",
    "28": "Battery life",
    "31": "Don't buy it if..."
  },
  "links": {
    "Alienware m17 R4": "https://www.techradar.com/reviews/alienware-m17-r4-2021",
    "Nvidia GeForce RTX 3080 graphics card": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "cheap laptop": "https://www.techradar.com/news/the-best-laptop-deals",
    "Asus TUF Dash F15": "https://www.techradar.com/reviews/asus-tuf-dash-f15",
    "Asus ROG Zephyrus G15": "https://www.techradar.com/reviews/asus-rog-zephyrus-g15",
    "Gigabyte Aorus 17G": "https://www.techradar.com/reviews/gigabyte-aorus-17g-2021",
    "HDMI": "https://www.tomshardware.com/uk/features/displayport-vs-hdmi-better-for-gaming",
    "dedicated speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "gaming headset": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "best Logitech webcams": "https://www.techradar.com/news/best-logitech-webcams"
  }
}