{
  "source": "https://www.techradar.com/reviews/alienware-x15-r1",
  "title": "Alienware x15 R1 review",
  "category": "computing",
  "updated": "2021-11-11T17:02:14Z",
  "author": "john-loeffler",
  "summary": "The Alienware x15 R1 offers otherworldly performance",
  "verdict": "The Alienware x15 R1 is quite simply the best gaming laptop on the market right now with best in class performance and a design that sets it apart in all the right ways. A laptop this powerful, though, runs hot and some might take issue with the display, but we sure don't. It looks and plays gorgeous, and needs to be on the top of everyone's list – assuming you have the budget for it, that is.",
  "pros": [
    "Best in class gaming performance",
    "Silky smooth display",
    "Distinctive design",
    "Surprisingly portable"
  ],
  "cons": [
    "Runs very hot",
    "Plastic construction",
    "Very expensive",
    "Laughable battery life",
    "Runs very hot"
  ],
  "article": [
    "The Alienware x15 R1 proves once again that, when it comes to making the best gaming laptops, nobody makes them like Alienware.",
    "The x15 R1 packs in some of the best gaming hardware you can get into a distinctive, well-designed package that will surely delight anyone looking for the gaming laptop aesthetic, just different than all the rest.",
    "The laptop itself is remarkably thin for a gaming laptop this powerful, and a well-designed layout manages to squeeze in the variety of ports for the needs of just about any gamer out there.",
    "That said, some compromises had to be made somewhere along the way, and the actual number of ports is fairly limited. You pretty much get one of each, so if you've got two USB Type-A devices you wanted to connect, well, better get yourself a USB hub or an adapter to plug in whatever peripherals you want to plug in.",
    "While we're on the topic of plugging things in, don't expect to spend much time away from a power outlet",
    "The x15 R1 maxes out at a 1440p display on its highest end model, while the rest are 1080p, so if you're looking for 1440p gaming on the go, expect to pay top dollar for it. For a 15.6-inch screen size, though, you're not likely to really notice the difference, especially with the 1080p display's decent-to-excellent refresh rates (165Hz and 360Hz) and response times (3ms and 1ms).",
    "Speaking of price, this definitely isn't the cheapest gaming laptop out there. Though there are some lower-spec configurations that make the x15 R1 at least a little more accessible, the highest-end configuration is one of the most expensive gaming laptops out there.",
    "Still, if you can afford the Alienware x15 R1, you're going to have one of the best laptops ever made whether you plan to use it for gaming on the go, content creation, or pretty much anything in between – just don't stray too far from a wall outlet.",
    "The Alienware x15 R1 is available now, starting at $2,100 / £2,150 / AU$3,700. In the US, the starting configuration comes with the Intel Core i7-11800H processor, an Nvidia RTX 3060 6GB DDR6 GPU, 16GB DDR4 3,200MHz RAM, a 256GB M.2 PCIe NVME SSD, and a 15.6-inch, 1080p, 165Hz, 3ms response display.",
    "The UK starting configuration bumps up the GPU to an RTX 3070 8GB DDR6 and a 512GB NVMe SSD. For Australia, the starting configuration comes with the same RTX 3060 6GB GPU as the US model, but ups the SSD to 512GB.",
    "The model we reviewed, which comes with the RTX 3080 8GB Max-Q GPU with 32GB DDR4 RAM, and two 1TB M.2 PCIe NVMe SSDs, is temporarily unavailable on Dell's site. Dell has promised to update us with pricing though, so we'll make sure to update this review with that pricing when we receive it.",
    "That said, the current maximum specced x15 R1 runs about $2,950 in the US, so the RTX 3080 model can be expected to sell for more than $3,000 / £3,000 / AU$4,500.",
    "While not the most expensive gaming laptop out there, the Alienware x15 R1 is still a very premium bit of kit.",
    "PS: It might be worth checking out the Alienware AW2720hf as a potential monitor for the X15",
    "Do you want a gaming laptop aesthetic that doesn't look like a transformer? You're in luck, since the Alienware x15 R1 stays true to the twinkly RGB gamers expect while offering the only really unique take on the aesthetic on the market.",
    "Right off the bat, the chassis of the x15 R1 is made of heavy duty plastic. While it doesn't feel cheap, some gamers might expect an aluminum-alloy chassis for this kind of money. That's never been Alienware's thing though; and to its credit, the build quality on the x15 R1 is pretty exceptional, even if it's not the absolutely most refined piece of electronic engineering ever constructed.",
    "The underside of the x15 R1 has a good bit of venting for airflow, but if you go for the RTX 3080 configuration like the one we tested, there is going to be a lot of heat pouring out of the bottom. With a laptop this thin, there just isn't any getting around that fact.",
    "Without some heavy duty fans (which would bulk up the thickness a good bit), too, heat management is going to be a problem. All we're saying is don't turn on ray tracing on for the latest AAA title on this thing if it's sitting on your lap.",
    "The screen on the unit we tested was a very fast (360Hz) 1080p display with 1ms response rate, which gave us a very smooth gaming experience overall.",
    "While playing some Cyberpunk 2077 on ultra settings, ray tracing on high, and DLSS on, we didn't even realize the display wasn't 1440p until we checked its specs after the fact. It honestly looks that good.",
    "The bezels are on the thick side, which honestly made us wish Alienware just went for it and slapped a 1080p webcam in it if it wasn't going to fuss about getting the slimmer bezels.",
    "The speakers on the x15 R1 were pretty decent as far as laptop speakers go. They were able to fill the room pretty well when playing Spotify and games sounded great, though a little light on the bass.",
    "The keyboard is decent enough for typing on and the trackpad was pretty responsive, though neither is going to be great for any intense gaming.",
    "There are obviously RGB options for the keyboard and even the trackpad, which is something we're not used to seeing. For RGB fans, its one more twinkly thing than most other laptops out there anyway.",
    "The x15 R1 puts all of its ports on the back of the chassis, leaving the sides for some pretty wide vents. This are definitely going to blow how under strain, so expect to find your cat parking itself in the vicinity when in use.",
    "There really isn't much else to say here other than the Alienware x15 R1 has just about the best gaming performance of any gaming laptop we've ever tested.",
    "Whether its the Intel Core i7-11800H CPU or the RTX 3080 Max-Q GPU, the benchmark scores for the x15 R1 beat out even some heavy hitters like the Gigabyte Auros 17X, which uses an unrestricted RTX 2080 GPU, so is able to run at a much higher wattage than just about any mobile GPU on the market.",
    "The x15 R1 handily beat it, though, edging to the top of the 3DMark leaderboard for gaming laptops we've seen recently. It also handily defeated the Gigabyte Aero 17, which runs the same GPU and a 10th-gen Intel Core i9.",
    "In actual gameplay, these results held up in terms of framerates, with the x15 R1 managing to get 59-and-some-change frames per second in our Metro Exodus benchmark with ultra settings, RTX on, and DLSS off. Turn RTX off and you're getting north of 80 FPS in Metro Exodus.",
    "It was a similar story with Dirt 5, where ultra settings with RTX on got us to 63 fps while RTX off on ultra settings also averaged 80 fps.",
    "Cyberpunk 2077 doesn't have a built in benchmark, but we loaded up a save game just before the final mission and went cyberpsycho in Corpo plaza downtown and consistently got around 45 fps on ultra settings with ray tracing and DLSS on, though this dropped to about 25 fps to 30 fps when DLSS was off.",
    "A couple of years ago, we'd have told you that no gaming laptop with its salt would last more than a couple of hours on battery power, and even though a lot of gaming laptops lately are bucking that tradition, the Alienware x15 R1 isn't one of them.",
    "Its 87WHr battery manages to get just three hours and nine minutes of life off its battery in PCMark 10, and managed to make it two hours and 47 minutes in our HD movie test.",
    "Some of the best gaming laptops out there like the Asus ROG Zephyrus G15 and Lenovo Legion 5 Pro managed to last much longer with roughly the same sized batteries, so we were hoping for a little bit more from the x15 R1, but with an RTX 3080 Max-Q GPU, we weren't expecting that much more.",
    "For bezels as thickish as they are, we really do wish Alienware had found a way to get a 1080p webcam in there, rather than the standard 720p it comes with.",
    "This is a gaming laptop, so we should be glad it came with a webcam at all, but it wouldn't have been a difficult upgrade to squeeze in. There also isn't a physical privacy shutter or a camera shut-off key on the keyboard, which is pretty much malpractice in late 2021.",
    "Yes, it's a gaming laptop, but gamers want to have some solid privacy protection too.",
    "The microphone is fine for video calls and the like, but if you plan on streaming or recording audio, you're better off using an external mic.",
    "For a laptop this expensive, we're glad to see there really isn't much in the way of bloatware beyond the standard Alienware utilities. The Alienware Command Center is where you're going to find all the RGB controls as well as some performance profiles for overclocking the GPU."
  ],
  "headers": {
    "0": "Alienware x15 R1 two minute review",
    "8": "Price and availability",
    "14": "Design",
    "25": "Performance",
    "31": "Battery Life",
    "34": "Webcam and microphone",
    "38": "Software and features",
    "39": "Don't buy it if..."
  },
  "links": {
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Alienware AW2720hf": "https://www.techradar.com/reviews/alienware-aw2720hf",
    "Gigabyte Auros 17X": "https://www.techradar.com/reviews/gigabyte-aorus-17x",
    "Gigabyte Aero 17": "https://www.techradar.com/reviews/gigabyte-aero-17-2021-review",
    "Asus ROG Zephyrus G15": "https://www.techradar.com/reviews/asus-rog-zephyrus-g15",
    "Lenovo Legion 5 Pro": "https://www.techradar.com/reviews/lenovo-legion-5-pro"
  }
}