{
  "source": "https://www.techradar.com/reviews/samsung-hw-q90r-soundbar",
  "title": "Samsung HW-Q90R Soundbar review",
  "category": "audio-visual",
  "updated": "2021-07-15T16:11:01Z",
  "author": "stephen-withers",
  "summary": "Total immersion therapy",
  "verdict": "The Samsung HW-Q90R sets itself apart from the competition with wireless rear speakers and four upward-firing drivers that combine to deliver a genuinely immersive surround experience with Dolby Atmos and DTS:X. No other soundbar comes close in terms of object-based performance.",
  "pros": [
    "Impressive sound quality",
    "Full-on immersion",
    "Dolby Atmos and DTS:X",
    "Easy to install and setup",
    "Looks good and well made"
  ],
  "cons": [
    "Limited HDMI Inputs",
    "No auto-calibration",
    "Expensive"
  ],
  "article": [
    "The Samsung HW-Q90R was the brand's all-singing, all-dancing flagship soundbar for 2019 – and in 2020, it's still our top pick for the best soundbar you can buy. It not only supports object-based audio in the shape of both Dolby Atmos and DTS:X, it's the only 2019 model to achieve this with actual rear speakers and four upward-firing drivers.",
    "However confusing model number aside, the HW-Q90R seems very similar to last year’s HW-N950. The new soundbar boasts a redesigned subwoofer, and adds Active Sound and Game Pro modes, but otherwise there’s little between them.",
    "So is it worth paying a premium for the new HW-Q90R, or are you better off looking for a deal on the end-of-line HW-N950? Let’s find out…",
    "If the Samsung HW-Q90R looks familiar that’s because it’s identical to last year’s HW-N950. That’s not necessarily a bad thing, as this is a cleverly-designed and well-made unit that boasts metal grilles and a ‘Carbon Silver’ finish - but it might be one reason that you could consider buying last year's N950 instead.",
    "That said, both are fairly wide soundbars, making them ideal for today’s big screen TVs. However despite its size, the HW-Q90 manages to remain unassuming in its appearance. You’ll need plenty of space to position it under your TV, but if that’s an issue there’s also the option of wall mounting.",
    "There’s a simple LED display that lights up when the soundbar receives a command, providing basic information. There are also some controls on the top centre of the soundbar for powering it on and off, selecting inputs, and adjusting the volume.",
    "The provided remote is identical to last year’s controller, but if it ain’t broke, why fix it? It remains an ergonomically-designed zapper, with all the necessary buttons to make operating the HW-Q90R an effective and highly intuitive process.",
    "The left and right rear speakers sport the same design and metal grilles as the main unit. Each speaker has forward- and upward-firing drivers for the top rear left and right channels, along with built-in amplification. The latter means that while they are wireless, you will need to plug them in.",
    "The redesigned subwoofer uses a side-firing 8-inch driver, backed up by a rear bass port. The finish matches the rest of the system, with revised dimensions intended to improve the bass response and overall control compared to last year.",
    "Design TL;DR: The HW-Q90R retains the unassuming design and high-end build quality of last year’s model, along with the same highly effective remote control.",
    "The Samsung HW-Q90R’s headline feature is support for Dolby Atmos and DTS:X (and variants thereof). However, what makes it different than other 'bars you've seen before is the ability to deliver these object-based audio formats using a genuine 7.1.4-channel setup, rather than resorting to acoustic beaming or psychoacoustics.",
    "To achieve this feat there are 12 speakers (including the subwoofer), using a total of 17 drivers. The front three channels use three drivers each – two woofers and a wide range tweeter – with all the other channels based on a single driver.",
    "The speakers are divided into 12 channels: front left and right, centre, two sides, two rears, two front heights, a pair of rear heights, and a sub. All these speakers are driven by 512W of built-in amplification, and the system has a claimed frequency response of 34Hz to 17kHz.",
    "One criticism of the HW-Q90 is that despite the sophistication of its object-based decoding and multichannel delivery, the actual setup is fairly basic. While that makes installation straightforward, it does mean getting the best from the system can be a bit tricky. It would be nice to see Samsung add some form of auto calibration to ensure everything is performing optimally.",
    "In terms of connections there are two HDMI inputs and an output, all of which support 4K/60p, 4:4:4, Rec.2020, High Dynamic Range (HDR10, HLG, HDR10+, and Dolby Vision), 3D and HDCP 2.2. That should ensure the Samsung can handle whatever you throw at it. It’s a common complaint, but two HDMI inputs seems stingy considering the price.",
    "The only other physical connection is an optical digital input but there are a number of wireless options, including Wi-Fi and Bluetooth, so it can double up as a Bluetooth speaker. However there’s no support for Chromecast or Apple AirPlay, which is a disappointing on a high-end soundbar.",
    "Samsung subsidiary Harman Kardon was actively involved in the development of the HW-Q90R, tuning the soundbar to ensure it’s as good with music as it is with multi-channel audio. In addition there are four sound modes this year: Standard, Surround, Game Pro, and Adaptive Sound.",
    "The Standard modes delivers the audio as encoded, while the Surround modes upmixes it to take advantage of all the available channels. The other two modes are new this year, with the Game Pro mode making playing more involved, and the Adaptive Sound mode analysing the content and changing the processing on the fly.",
    "As you’d expect from a modern soundbar, it can handle all the popular audio formats including AAC, WAV, OGG, ALAC, AIFF and FLAC, with high-resolution support up to 32-bit. It also includes UHQ 32-bit upscaling for high quality audio playback from compatible smart devices.",
    "As with most other Samsung products there’s support for the SmartThings app - this makes setup easier and allows you to control the soundbar along with other connected devices from a single hub. The HW-Q90 also works with Amazon Alexa, providing hands-free control and enabling you to listen to music via Spotify Connect.",
    "Features TL;DR: This feature-packed soundbar decodes Atmos and DTS:X in a 7.1.4 channel configuration, and also supports Hi-Res Audio, Amazon Alexa, and Adaptive Sound.",
    "Since the main reason for buying the Samsung HW-Q90R is its immersive audio skill set, it might seem strange to start by listening to some two-channel music. However it’s an important test of a soundbar’s capabilities, and if it sounds good in stereo those qualities should still be reflected as you add more channels.",
    "In general the Standard sound mode works best with music, and The Waterboys’ new album Where the Action Is provides plenty of opportunities for the Samsung to reveal a superbly nuanced sonic performance. The sheer size of the soundbar allows for excellent separation between the left and right speakers, which results in some impressive stereo imaging and precise location of instruments.",
    "There is an aggressive punky delivery to the song London Mick, which seems appropriate since the song is about Mick Jones from The Clash. The soundbar delivers the driving guitar riff with plenty of midrange presence, the vocals growl, and the excellent subwoofer provides a tight and controlled foundation to the drums that propel the song.",
    "Moving on to something a little more multichannel in nature, The Expanse on Amazon Prime has an excellent 5.1 mix that makes extensive use of both the surrounds and the sub. The crowded space stations and asteroid worlds make full use of the rear channels to generate a sense of claustrophobia, while the sub adds low frequencies to the space scenes to create the feeling of being in a vacuum. However, the dedicated centre speaker also ensures that dialogue always remains clear and focused on the action.",
    "The Adaptive Sound mode is skilful at teasing more detail out of the soundtrack, but tends to work best with sports broadcasts or dialogue driven programming. For something like The Expanse, the Surround mode is a good choice because it up-mixes the soundtrack to use the overhead channels, creating a more enveloping experience.",
    "Unsurprisingly, the HW-Q90 really outdid itself when delivering object-based audio soundtracks such as Dolby Atmos and DTS:X. In the case of the former, the recreation of Live Aid at the end of Bohemian Rhapsody makes use of all the available channels to create the scale of a massive rock show. The front two channels handle the music, with the side-firing drivers helping to add more width. The rears provide the sound of the audience, while the overheads recreate the echoey chasm of the old Wembley Stadium.",
    "The soundbar’s musicality really comes to fore here, helping to deliver the Queen songs with all the precision and clarity the format can muster. The bass is particularly effective, both supporting the overall soundtrack and helping to drive the songs forward as the Atmos mix produces a wall of sound. However within that wall, Freddie’s operatic vocals remain clear and focused.",
    "Atomic Blonde has a brutal DTS:X soundtrack that kicks like a mule when the action starts. Whether its a car cash, an explosion, or a fistfight down a staircase, the HW-Q90 reproduces each kick, punch and gunshot with remarkable precision. Once again the sub comes into its own, giving the hits a visceral quality and underscoring the action. However the soundbar’s musical quality also plays a part, making all the 80s songs in the film sound better than ever.",
    "Performance TL;DR: This excellent package sounds great with music and even better with immersive audio, thanks to a setup that delivers object-based audio without resorting to trickery.",
    "At first glance, the Samsung HW-Q90R appears rather expensive for a soundbar. However, once you consider its capabilities, you start to realise it offers surprising value. If you wanted to build an equivalent 5.1.4-channel system using separates, you’d find it hard to achieve for less than the cost of this soundbar/speaker/sub combo. You’d need a nine-channel AV receiver and matching speaker and subwoofer package, which might sound better but would ultimately cost more and be harder to install.",
    "The Samsung HW-Q90R exists in a class of its own, which makes recommending alternatives rather tricky. There are literally no other 2019 soundbar packages that deliver a genuine 7.1.4-channel experience using wireless rear speakers and four upwards firing drivers.",
    "That limits possible alternatives, although you could look at the Sony HT-FZ9, the LG SL10YG, and the Yamaha YSP-5600. All are cheaper but lack actual rear speakers (or even a sub in the case of the Yamaha), so the soundstage produced tends to be very front heavy.",
    "If you want a genuinely immersive experience but hope to save some money, your best bet is last year’s Samsung HW-N950. It's virtually identical and remains an excellent choice for those wanting the full object-based experience with the minimum of fuss.",
    "The Samsung HW-Q90R is a fantastic immersive audio soundbar that delivers real bang for your buck. Thanks to a wireless subwoofer, wireless rear speakers, and four upward-firing drivers, this well-made and cleverly designed package puts you right in the action.",
    "No other soundbar comes close to producing the full Dolby Atmos and DTS:X experience, and thanks to tuning from Harman Kardon the HW-Q90 even sounds good with music. A decent set of features and fully-specified HDMI connections complete a nearly flawless package."
  ],
  "headers": {
    "3": "Design",
    "10": "Features",
    "21": "Performance",
    "30": "Value",
    "31": "Other soundbars to consider",
    "34": "Final verdict"
  },
  "links": {
    "best soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "HW-N950": "https://www.techradar.com/reviews/samsung-hw-n950-soundbar",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Sony HT-FZ9": "https://www.techradar.com/reviews/sony-ht-z9f-soundbar"
  }
}