{
  "source": "https://www.techradar.com/reviews/beenverified",
  "title": "BeenVerified review",
  "category": "computing",
  "updated": "2021-11-01T05:25:38Z",
  "author": "michael-graw",
  "summary": "Another people search finder from the company behind US Search and Instant Checkmate",
  "verdict": "BeenVerified can be a useful tool if you need to run numerous people searches. However, you cannot see search results before paying and the report quality can be inconsistent.",
  "pros": [
    "Many input data options",
    "Unclaimed property search",
    "Three month prepay discount",
    "Offers social media handle search"
  ],
  "cons": [
    "Cannot buy a single report",
    "Paywall before search results",
    "Less than upfront pricing",
    "Difficult cancellation process",
    "Not the most detailed report"
  ],
  "article": [
    "BeenVerified was founded in 2007, and is a capable people search finder owned by Intelius, which also owns US Search and Instant Checkmate. All three search tools draw on data found in public records. With BeenVerified, you can run an informal background check on a new acquaintance or look up an old friend. The platform enables you to search using a wide variety of data points, including name, address, phone number, vehicle details, and more. With access to billions of records, they claim to have helped over a million customers.",
    "In our BeenVerified review, we’ll take a closer look at everything this people search tool has to offer and help you decide whether it’s worth the cost.",
    "BeenVerified unfortunately doesn’t enable you to purchase a report for a single individual, which is a pricing model that we suspect at least a few folks would prefer. Rather, you have to sign up for a monthly subscription that offers unlimited reports. The subscription costs $29.99 per month when you sign up month-to-month or $58.47 for three months, which works out to $19.49 per month. When we tried to find the pricing model online, we concluded that it is less than upfront as you are forced to go through the whole search process of running a report before providing a price, which frustratingly takes several screens and a time commitment.",
    "Payment is made via a major credit card, including Visa, MasterCard, American Express, and Discover. PayPal is also accepted, and if you purchase a subscription through the app, then payment can be made through iTunes or Google Play.",
    "Another item to note is that canceling your BeenVerified subscription can also be painfully difficult as there is no direct way to accomplish this from within the account. Rather, you have to call the company’s support line, or send them an email to turn off auto-renew. Additionally, make sure you request the cancellation well ahead of your next billing cycle to avoid being charged.",
    "BeenVerified aggregates public data records to help you find any person in the US. You can search using a variety of starting points that include a name, address, phone number, email, social media handle, or a vehicle identification number (VIN).",
    "The site then presents you with a list of potential matches, and you can download a full report for any individual. The report includes contact details, property records, criminal records, and social media information. However, you won’t get more detailed information about weapons licenses, traffic violations, and other records that some other people search finders provide.",
    "One additional thing that BeenVerified offers that many other people search tools do not is an unclaimed property search. You can search for yourself or anyone else to see if a state has unclaimed money or property in your name. Most states have websites already setup with similar search functionality at no cost, but this is a nice added feature if you already have a BeenVerified account.",
    "Getting started with BeenVerified is simple enough. Just choose what type of search you want to run and enter the data you have to start running a new database search. Depending on your search method, BeenVerified may ask some follow-up questions about where the person lives, their age, a middle name, or known relatives to help narrow down your results. If you don’t know the answers to these questions, you can skip them, and a wider search will continue.",
    "However, once our search was underway, we started running into trouble. Several searches that we initiated never finished—the progress bar stopped moving for more than 30 minutes and we were never presented with an option to view a report. Other searches did finish successfully, but you have to sign up for a subscription before you can even view the search results. That means you might pay, only to find that there isn’t a report for the specific person for whom you were originally looking to find.",
    "The quality of information in BeenVerified’s reports is also highly variable. Some reports were mostly complete, while others were missing data about criminal records, contact information, and more. It’s disappointing that you can’t find out what data fields are present in a report before signing up for the paid subscription.",
    "BeenVerified provides customer support by a toll free phone number and email from 6am to 11:30 pm Eastern Standard Time, seven days a week. The company’s website also has support pages covering frequently asked questions on account and billing topics such as “Can a person see that I searched for them?” and “How do I log into my BeenVerified account?” Finally, there is a contact portal to initiate contact electronically and a mailing address is also provided for those that prefer those methods.",
    "BeenVerified only shares information that is available in public records, so the company doesn’t put a huge amount of effort into security. That said, your account is secured with HTTPS and 128-bit encryption.",
    "If you’re looking to opt out of having your data included in BeenVerified’s records, you can also do that easily. Just search to find your record, and BeenVerified will remove it within 24 hours of your request.",
    "BeenVerified competes against two of Intelius’ other people search finders, US Search and Instant Checkmate. All three search public records but they differ slightly.",
    "US Search offers a cheaper monthly subscription ($19.86 per month) and enables you to view search results before you run into a paywall. Also, you can pay for a single search, rather than having to take a monthly subscription to see a result. However, the information in the reports is often inaccurate, so we wouldn’t trust this service for running even basic background checks.",
    "Instant Checkmate charges the same price as BeenVerified and offers far more information in its reports, including data about weapons licenses, vehicles, and traffic incidents. Instant Checkmate can be very frustrating to use since it entails clicking through numerous pop-ups. But thanks to the added report details, it offers a better bang for your buck than BeenVerified.",
    "BeenVerified is a useful people search tool that offers a wide range of search methods. It can be especially helpful if you’re trying to find someone using a VIN or social media handle since many other platforms won’t initiate a search with this data.",
    "Unfortunately, BeenVerified doesn’t enable you to see your search results before forcing you to sign up for a subscription, so it’s hard to know what you’re going to get prior to subscribing. We also found that the reports are of inconsistent quality and don’t offer a huge amount of information, which makes this somewhat pricey service less attractive.",
    "We've also highlighted the best background check services"
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "8": "Interface and in use",
    "11": "Support",
    "12": "Security",
    "14": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "BeenVerified": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1754001265677506000&xs=1&url=https%3A%2F%2Fwww.beenverified.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbeenverified",
    "people search finder": "https://www.techradar.com/best/best-people-search-finder-services-and-engines",
    "background check": "https://www.techradar.com/best/background-check-services-sites-online",
    "database": "https://www.techradar.com/best/best-database-software",
    "US Search": "https://www.techradar.com/reviews/us-search",
    "Instant Checkmate": "https://www.techradar.com/reviews/instant-checkmate",
    "best background check services": "https://www.techradar.com/best/background-check-services-sites-online"
  }
}