{
  "source": "https://www.techradar.com/reviews/webcom",
  "title": "Web.com review",
  "category": "computing",
  "updated": "2021-03-01T20:30:24Z",
  "author": "mirza-bahic",
  "summary": "Build your online presence with ease thanks to this beginner-friendly host",
  "verdict": "Web.com is a web hosting provider from the USA offering all-in-one packages aimed at first-time users in particular. Although it can cover all areas required for a perfect personal blog, a welcoming webstore or a small business, if you want something more, you’ll have to look elsewhere.",
  "pros": [
    "Beginner-friendly attitude",
    "Free domain name for first year of use",
    "Great variety of options for building a website",
    "Intuitive and user-friendly website builder"
  ],
  "cons": [
    "Significant price-hike after the promotional period",
    "Rigorous anti-refund policy",
    "Renewal rates for domains are overpriced",
    "Windows hosting isn’t supported"
  ],
  "article": [
    "Founded in 1999, Web.com worked its way to become one of the leading web hosting technology companies, as well as one of the largest providers of online marketing services in the USA. They are a part of the Web.com Group which also owns a whole portfolio of brands including Network Solutions and Register.com. Their main aim is (or so they claim) to “help customers of all sizes build an online presence that delivers results”. Since we are yet to find a company that wouldn’t accept customers of all shapes and sizes, we reckon that what they had in mind were their business targets, that is, all-sized businesses.",
    "In any case, Web.com Group at this time employs roughly 3,500 personnel and manages over 9 million domain names for customers across the globe. Web.com is headquartered in Jacksonville, Florida where one of their data centers is also located. The other one is situated in the US as well, but in Atlanta.",
    "In a similar way as with the other children of Web.com Group, Web.com’s main website feels fresh with its user-friendly layout, pleasant balance between text and visuals and a troupe of people obviously specialized in the laughing matters. We mean this literally, since the pictures on Web.com’s website (and on their blog) are oversaturated with young people having a laugh while looking at their computers, mostly. We suppose that the message is that hosting with Web.com equals happiness, which is something we have to put to the test.",
    "The blog itself feels vivid, and features plenty of new articles and offers (among other things) plus some useful tips on tricks about running small businesses. Their social network accounts (Facebook, Twitter, LinkedIn, YouTube and Instagram) are still in the land of the living, publishing new content fairly frequently and interacting with the customers.",
    "Web.com services aim to cover all the bases when it comes to hosting, website design and the problem of security. Besides shared hosting, they provide domain registration (and transfer) services, their own website builder and WordPress-optimized hosting (managed and unmanaged).",
    "At first, the pricing seems cheap and cheerful, but if you decide to dig a bit deeper you’ll reveal that the displayed price is valid for the first month only. From the second month onward, the price will be more than doubled and if you haven’t read everything through and through, you might feel like you’ve been played for a fool. For instance, the cheapest hosting package (labeled as “Essential Hosting”) is priced at $5.95 per month, yet this goes for the first month only and the second one is going to cost you $14.95, which is a broad daylight robbery in comparison. Well, at least you should get a “free” domain name registration with every package in addition to their beginner-friendly website builder.",
    "As for supported payment methods, they accept all major credit/debit cards and PayPal. If you are wondering about their refund policy, they are rather rigorous about not providing any, although you can cancel their services at any time.",
    "To kick off your website, you’ll first have to decide which is the right hosting solution for you and whether you want to build your website by yourself (there are several ways to do so) or you would rather put it in the hands of experts (by opting for the “Build It For Me” option). If the latter is the one you want, you should schedule a call with Web.com’s team to get a consultation on the matter (at no cost).",
    "Anyhow (sooner or later), you’ll have to pick out a plan and, since they are well presented, this should be as easy as anything. If you are new to all this, the FAQ section below might be of some help. After adding this plan to the cart, you’ll be asked (as expected) to register a new domain (all of them are free for a year, except for “.co”) or use the one you possess. However, keep in mind that after the renewal period your domain can cost you up to $38 per year, which is a handsome sum of money. There, you can apply a promotional code (if you are lucky to have one), enter your name,e-mail address and password and proceed to create your Web.com’s account.",
    "With all shared hosting packages, Web.com provides its users with an access to cPanel, which is great news. Thanks to its intuitive and beginner friendly interface and one-click installer (for about 25 open-source applications), your website will be on fire in a heartbeat. If you haven’t had much experience with coding and yet you want to develop your website by yourself, Web.com offers a newbie-friendly drag-and-drop website builder which should do the trick.",
    "Although Web.com is quite keen on presenting itself in the best possible light, it (curiously) doesn’t emphasize blazing speed performance as one of its greatest assets. Nevertheless, after putting Web.com’s main website to the test, we learned that they have nothing to worry about concerning this. After taking into account all of the vital web metrics, GTmetrix (our speed testing tool) rated speed performance of Web.com’s website with a B (95%), which is a pretty good result.",
    "Web.com promises an industry-standard uptime of 99.9%. However, after consistent monitoring of Web.com’s main website for a month we got a less favorable outcome resulting in 99.83%. There were four instances of downtime and together they lasted for 67 minutes, the longest one persisting for 28 minutes straight. Although this is not the most dreadful performance we’ve seen, it’s needless to say that we were hoping for better results.",
    "If you find yourself in need of help, proceed to Web.com‘s “Online Help Center'', which has familiar functionality of a knowledgebase. There, the articles are sorted out into eight fitting categories and each of them is rated by a system involving stars, from one to five. Most of these are beginner-oriented and offer solutions to various potential problems described in great detail, more often with pictures than without. Using the search box should get you a good deal of hits, although a number of them might be rather loosely connected to the actual problem.",
    "As an addition, there is a FAQ section on Web.com‘s site for each product type presented and it provides some helpful insight for all the newcomers.",
    "As a more human-centered alternative, you can reach out to Web.com's technical team via telephone, ticket and live chat, all of which should be available day-and-night. Other than that, you can get in touch with them via text messages on Facebook and Twitter, which is a nice touch for all the users out there.",
    "As children of the same parent company, Network Solutions and Web.com are somewhat similar. Both try to be accessible to new users and offer some affordable hosting solutions without the need for compromising the quality. That being said, Web.com gives its users an access to cPanel (probably the user-friendliest solution of its kind out there), while Network Solutions doesn’t, so the choice might be up to that.",
    "Both Bluehost and Web.com have packages aimed at new users in particular, and pretty good ones to boot. Nevertheless, if you’re looking to save some bucks, Bluehost is a better choice, since its entry-level plan goes for $2.95 per month, while it is $5.95 with Web.com. However, if you fail to read about the renewal rates after the promotional period, both hosts might make you jump out of your skin.",
    "While both HostGator and Web.com are more than able to cover everything needed to launch a small business, HostGator can do the same for medium-sized businesses as well. In addition to shared hosting, it provides several options for reseller, VPS and dedicated servers, which is a must-have for a growing business.",
    "WestHost is a fellow US-based web hosting provider with more than two decades of experience in the industry. The smallest plans with both of them are beyond budget-friendly at start (especially WestHost’s entry-level plan which is going for $0.99 at the moment), but they will raise the price after the promotional period to its fullest capacity. Even so, Web.com’s starter plan (which comes as no surprise) puts less restriction on its features and throws in a free domain registration to even the odds.",
    "At the end of the day, Web.com is pleasantly honest in not trying to be something more than it actually is. Their hosting solutions are primarily aimed at newcomers, which they try to supply with everything it takes so they can quickly kickstart their website across the virtual web highway. Hence, if you consider yourself one of them, Web.com’s hosting packages might provide you with a good value for money.",
    "However, if you have bigger plans for your website (or are determined to save some money for the rainy days), your dream website might find a forever home with more celebrated companies like Hostgator, Bluehost or GoDaddy."
  ],
  "headers": {
    "4": "Plans and pricing",
    "7": "Ease of use",
    "10": "Speed and experience",
    "12": "Support",
    "15": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Web.com": "https://web.yoxl.net/c/221109/58786/1642?subId1=trd-us-2439748180395320000&sharedId=trd-us&u=https%3A%2F%2Fwww.web.com%2F",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "domain registration": "https://www.techradar.com/news/best-domain-registrars",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Essential Hosting": "https://web.yoxl.net/c/221109/58786/1642?subId1=trd-us-4500243924268165000&sharedId=trd-us&u=https%3A%2F%2Fwww.web.com%2Fwebsites%2Fhosting",
    "Network Solutions": "https://www.techradar.com/reviews/network-solutions-website-builder",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "WestHost": "https://www.westhost.com/",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy"
  }
}