{
  "source": "https://www.techradar.com/reviews/oneplus-watch-review",
  "title": "OnePlus Watch review",
  "category": "wearables",
  "updated": "2021-07-15T14:37:16Z",
  "author": "david-lumb",
  "summary": "The OnePlus Watch is a sleek first-gen device with great battery life",
  "verdict": "The OnePlus Watch is a great first smartwatch from OnePlus, blowing pricier rivals away in a couple of key areas, with sleek looks and week-long battery life. However, with a bespoke operating system it can’t load more than the preinstalled selection of basic apps, and its companion smartphone app is only available on Android at launch. Despite a few software glitches betraying its first-gen status, the OnePlus Watch is good value for the price, which is notably lower than Samsung and Apple competitors.",
  "pros": [
    "Week-long battery life",
    "Sleek design",
    "Bright display and nice interface"
  ],
  "cons": [
    "No facility to add apps",
    "Software glitches",
    "Only basic fitness tracking"
  ],
  "article": [
    "The long-rumored OnePlus Watch is finally a reality – and it’s a polished wearable that can hold its own against the current best smartwatches when it comes to looks, battery life and basic features.",
    "Note the 'basic' there, though – the OnePlus Watch’s bespoke operating system (OnePlus Watch OS) means no third-party apps at launch, leaving users with only the preinstalled first-party apps.",
    "OnePlus doesn’t currently intend to add an app store or portal, and while it’s possible that customer feedback could change the company’s mind it's likely that the OnePlus Watch likely won’t ever get more functionality than it has at launch, which is admittedly limited compared to a Wear OS-running smartwatch or Apple Watch.",
    "What it does have, though, will serve anyone who's looking for basic fitness features and notifications.",
    "The OnePlus Watch looks similar to other top-end smartwatches like the Samsung Galaxy Watch 3, with a circular design and two function buttons on the right side. The stainless steel metal body has a glossy finish, which is actually a nice change from the matte finishes and/or colored aluminum of most of today’s watches.",
    "It’s also a pretty hefty smartwatch, with a 46mm width and heft that will likely make it too large for those with slimmer wrists or who prefer smaller watch faces. On the other hand it will suit those who like their watches chunky, with a design and material finish that feels more polished than your average wearable.",
    "It also has some of the best battery life we've seen in a smartwatch, lasting around a week with regular use and recharging from 0 to 100% in just under half an hour.",
    "In summary, the watch looks higher-quality than other smartwatches at its price, which is easily half that of comparable Apple Watches and Samsung Galaxy Watches. It may have less expansive capabilities than pricier rivals, and launch with only Android compatibility for its companion smartphone app (iOS coming soon), and be unable to load more apps, but it’s a good smartwatch for the value.",
    "The OnePlus Watch comes in one size and configuration at launch: 46mm watch face with 1GB RAM and 4GB storage, and a single color: Midnight Black.",
    "In the US and UK, it will go on sale on the OnePlus website on April 14 for $159 / £149 (around AU$210) and you'll then get the watch on April 30. There's no sign of OnePlus bringing this smartwatch to those in Australia.",
    "There's also a Cobalt Limited Edition in the works, which swaps out the stainless steel case for a cobalt alloy that’s “twice as hard and more corrosion-resistant” than steel, per a OnePlus press release.",
    "The usual watch face has been swapped for specially-treated sapphire glass with “a Mohs rating of 9,” suggesting better scratch-resistance and brightness than the glass on the standard model. OnePlus hasn’t announced a price or release date for this version.",
    "The OnePlus Watch is an attractive smartwatch with a polished sheen and streamlined design that make it look pricier than it is. As mentioned, it comes in one size, which will be a bit too large for those who prefer a smaller wearable, but it has the polish to appeal beyond the tech-chic crowd.",
    "The 46mm watch face is larger than even the larger 45mm version of the Samsung Galaxy Watch 3, making it the new king of Big Smartwatches. While it lacks the rotating bezel of the latter, the OnePlus Watch has the same 1.4-inch display size as Samsung’s flagship watch, though you would guess it was larger, thanks to a dark bezel under the flat glass.",
    "The display is sharp and bright, taking advantage of the AMOLED tech to show rich darks – though given the minimalist interface and limited number of apps, there isn’t much here that can take advantage of the screen, aside from some stylish watch faces (swappable in the OnePlus Health phone app).",
    "The display responds to touch controls, though getting around the apps and interface requires using the two buttons on the right side of the smartwatch: the top, etched with ‘OnePlus’ in small print (the texture is helpful in differentiating the buttons), brings you to the app menu. The bottom button is a customizable shortcut for any of the smartwatch’s apps (to swap, head to settings > function key).",
    "The rubber-like (fluoroelastomer) watch band is wide and thick, but at least it isn’t flimsy, and it feels secure enough on the wrist to counter the watch’s hefty weight. The rivulets running down the side of the band are a nice touch compared to the flat wristbands on other smartphones, though its thickness can mean some skin pinching when tucking the band back under itself until you’ve worn it in.",
    "The OnePlus Watch has decent if basic fitness and health tracking capability, which is enough for its price, though it may underwhelm those looking for more intensive workout-assisting solutions.",
    "OnePlus claims the watch offers over 110 workout types, and you’ll find 14 basic options when tapping into the Workout app, from running and swimming to mountaineering, badminton, cricket, and several others.",
    "The watch automatically detects workouts when running, with 5ATM pressure resistance and IP68 water and dust resistance. It tracks heart rate, blood oxygen saturation, and stress levels, which you can manually track via dedicated apps, as well as distance via GPS, calories, and swimming speed.",
    "The watch also tracks activity progress via four metrics – steps, workout, energy used (in kcals), and activity duration – which are visualized in the Activity app and on many of the watch faces. More advanced health info can be viewed through a new OnePlus Health smartphone app, which is on Android at launch (free on the Google Play Store) and coming soon to iOS.",
    "You’ll need the OnePlus Health app to get much use out of the OnePlus Watch – it’s how you pair the smartwatch with your smartphone and alter the former’s more advanced settings (tip for fellow Americans: head to Manage > settings cog in top right > Unit to change from metric to Imperial).",
    "The OnePlus Health app is surprisingly fully-featured, with breakdowns on tracked metrics (heart rate, sleep, blood oxygen level, stress, etc) that visualize data on graphs with day, week, month, and year tabs. While our workout examinations often showed inaccurate GPS location tracking, they break down into robust reports that are informative and easy to understand for different categories like heart rate, pace per mile, cadence, and so on.",
    "Lastly, we'd note that while the OnePlus Watch is large, it wasn’t annoying to exercise with. You won’t forget it’s there, but it doesn’t weigh down your wrist or offset your balance; the wide base spreads the watch’s weight out, and the wide band keeps it snug.",
    "The OnePlus Watch packs an undisclosed OnePlus-built chipset – we asked, and the company hasn’t gotten back to us about the specifics of the silicon in the watch – and 4GB of onboard storage, of which 2GB is available for media.",
    "The watch ran smoothly in our testing, and didn’t hiccup or slow down when put through a selection of tasks – though given the limited number of preinstalled apps there's not much scope for pushing this watch particularly hard.",
    "The OnePlus Watch doesn’t run Google’s WearOS, and instead uses the company's bespoke operating system (called OnePlus Watch OS). There are pros and cons to this, and on the plus side we don’t see WearOS watches coming anywhere near the OnePlus Watch’s battery efficiency, which we chalk up to OnePlus owning both the software and hardware of the wearable.",
    "On the other hand, it means the OnePlus Watch is stuck with its suite of preinstalled apps. These cover all the bases you’d need – workouts, heart rate, blood oxygen sensor, clock functions, and so on – and with clearly legible interfaces. While there are far fewer smartwatch apps (and fewer still that are worth downloading) than smartphone apps, veteran wearable users likely have a WearOS or watchOS app they particularly like, and would miss them on this device.",
    "That said, the OnePlus Watch is priced lower than more customizable smartwatches – if you want more apps on a watch of comparable polish you’d have to pay nearly twice as much for a Samsung Galaxy Watch 3, for example.",
    "The bespoke interface is simple and efficient, mimicking some of WearOS’ cardinal-direction-swipe navigation (swipe down for control panel, up for notifications, right for quick music access, etc). Press the top-right physical button and you’ll open the app menu, with apps listed vertically. Simple.",
    "So what's the OnePlus Watch like to use? Easy, intuitive – and a little rough around the edges in terms of occasional software hiccups. Our daily fitness progress, displayed in a quartet of colored bars on the default watch face, kept resetting after workouts (which is why the activity bars aren’t filled in the watch face of this review’s photos). The compass app kept needing to be recalibrated (it asks you to rotate your wrist in an ‘infinity’ pattern), and some text overlapped.",
    "In other words, the OnePlus Watch feels like a first-generation device in terms of software, if not hardware or design, but shows promise if these quirks can be ironed out – they don’t limit the smartwatch’s usability, but the overall experience is a little unpolished and annoying.",
    "The OnePlus Watch is compatible with most Bluetooth earbuds, and can apparently connect to the OnePlus TV to act as a smart remote and can even turn the television off when it detects that the wearer has fallen asleep (we didn’t have a device around to connect).",
    "One of the OnePlus Watch’s big advantages over the competition is its battery. Not only does it live up to the company’s claims of around a week of battery life with regular use, but it recharges very swiftly, too.",
    "The watch has a 402mAh battery, which sits between the Samsung Galaxy Watch 3’s 340mAh battery (which provides two to three days of use) and the original Samsung Galaxy Watch’s 472mAh battery (up to five days of use).",
    "OnePlus claims this capacity provides up to two weeks of sustained use or, for more active users, one-week battery life. We found the latter claim to be more in line with our experience, with the Watch topping out at five or six days before needing to be recharged – which is still far beyond what most other smartwatches offer. And we'd note that other fitness-oriented wearables that match this longevity aren’t powering as big a display as that on the OnePlus Watch.",
    "Better still, the included charger recharges the watch from empty to 50% in 15 minutes, and to full capacity in under half an hour. Smartwatch batteries aren’t huge, and most take less than an hour to juice back up to full, but given how long the OnePlus Watch lasts it’s pretty amazing to be able get enough charge for a full week’s operation in the time it takes to watch an episode of a sitcom.",
    "First reviewed: April 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "OnePlus Watch price and release date",
    "12": "Design and display",
    "17": "Fitness",
    "24": "Performance and software",
    "33": "Battery life",
    "37": "Don’t buy it if…"
  },
  "links": {
    "best smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "press release": "https://www.prnewswire.com/news-releases/oneplus-launches-oneplus-9-series-flagship-smartphones-and-first-ever-oneplus-watch-301253981.html",
    "Bluetooth earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}