{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
  "title": "Samsung Galaxy S20 FE review",
  "category": "phones",
  "updated": "2021-11-27T19:36:24Z",
  "author": "tom-bedford",
  "summary": "The Samsung Galaxy S20 FE is basically the Galaxy S20 Lite",
  "verdict": "While the Samsung Galaxy S20 Fan Edition perhaps isn’t the best example of a ‘lite’ phone we’ve seen, it’s still a great choice for plenty of people who were interested in the standard Galaxy S20 but found that handset a little too expensive. The S20 FE has three of the S20’s winning traits: a fast screen refresh rate, great photography potential, and a powerful processor. It’s just a shame that the design feels a little cheap, and the price isn’t as low as we might have hoped.",
  "pros": [
    "Can take great pictures",
    "Powerful processor",
    "Vibrant color options"
  ],
  "cons": [
    "Not very ‘lite’ in price",
    "Cheap-feeling design",
    "Battery life feels lacking"
  ],
  "article": [
    "The Samsung Galaxy S20 Fan Edition technically isn’t the ‘Galaxy S20 Lite’ that many were expecting, but that distinction is in name only, because the newest Galaxy phone is essentially a more affordable spin on the Galaxy S20 from early 2020.",
    "When the Samsung Galaxy S21 line came along in January 2021 the Galaxy S20 devices were discontinued, however the S20 FE wasn't. So if you're looking for an affordable Samsung flagship that undercuts the newer entries, it's still a worthy choice.",
    "If the Galaxy S20 tempted you, but its starting price of $999 / £899 / AU$1,499 (for a 5G model) put you off, then the Galaxy S20 Fan Edition (or FE for short) may be for you. It has many of the flagship’s top features, including a super-smooth 120Hz screen, useful photography tricks and a top-end processor, but at a lower starting price.",
    "Well, we say the price is lower, but maybe not enough so – at $699 / £699 / AU$1,149 (for the 5G model) the Samsung Galaxy S20 FE is certainly more affordable than the base-model S20, but it’s still pricier than many other phones with similar features and specs. Buy this if you’re committed to the Samsung line and want something more than a Galaxy A-series phone – but know that you could get a similarly specced phone from a Chinese brand for half the price.",
    "In fact the Galaxy S21 starts at only $799 / £769 / AU$1,249, so for a relatively minor price increase you could get a much better phone. Galaxy S20 FE deals are your friend in this regard, then.",
    "The Samsung Galaxy S20 FE comes in a wide variety of eye-catching colors, from a pale mint to bright red and more besides, and there’s much more diversity than the typically limited selection of other smartphones. The design could be divisive though, as the screen doesn’t curve at the edges, and the back of the handset is plastic, making the phone feel relatively cheap in the hand.",
    "Another issue is that the battery life feels lacking. With medium or heavy use the phone wouldn’t necessarily last a full day, and if we took a lot of photos or indulged in lengthy gaming sessions we’d have to charge it in the evening. This is likely due in large part to a couple of power-hungry top-tier features, including the 120Hz screen and 5G connectivity, so if you don’t make much use of those you’ll stand a better chance of your phone making it through a full day.",
    "The Samsung Galaxy S20 FE’s positives outweigh the negatives though. Lots of the Samsung Galaxy S20’s camera features are back here, like Single Take, which captures photos and video using all three rear cameras and picks out the best, and an improved Night Mode that uses the large main camera sensor. Samsung’s excellent scene optimization is here too, helping you to get some great-looking snaps.",
    "The high screen refresh rate and top-end processor are a couple of nice premium flourishes, and show Samsung hasn’t cut too many corners in order to key the price of the phone down.",
    "If you’re reading this introduction and finding the messages somewhat mixed, then you’re getting an accurate reflection of our experience with the phone – there are things we really liked, and things we really didn’t. The Samsung Galaxy S20 FE is good but not great, and while it’s probably not the best implementation of a ‘Galaxy S20 Lite’ we could have seen, it’s still one worth considering.",
    "The Samsung Galaxy S20 Fan Edition was launched on September 23, 2020, and became available to buy on October 2. That release date was roughly six months after the Galaxy S20’s launch, and we're expecting to see the Samsung Galaxy S21 in January 2021.",
    "You can pick up the Samsung Galaxy S20 FE for $699 / £699 / AU$1,149 – that’s for a 5G model though, and in some countries there’s a 4G model available too (check out our best Samsung Galaxy S20 FE deals to find out more).",
    "This costs £599 in the UK and AU$999 in Australia, but unless you live in a place that’s likely not going to see 5G for years, or you really don’t think you’ll need the super-fast download speeds it offers, we wouldn’t recommend buying this version as you’re not getting the future-proofing the 5G model offers.",
    "As mentioned, the Galaxy S20 started at $999 / £899 / AU$1,499, so a fair amount more, although we’d argue that both phones are pretty expensive for their specs. For context, the Galaxy S21 starts at $799 / £769 / AU$1,249.",
    "Given that in the UK you can buy a 120Hz-screen phone for less than £200 (the Poco X3 NFC), and that in many markets there are more affordable Snapdragon 865 phones, the Samsung Galaxy S20 FE certainly isn’t the cheapest way to get any of its specs. But if you’re a Samsung devotee this might be a better buy than a Galaxy A phone – those have lower price tags again, and it shows.",
    "At a glance the Samsung Galaxy S20 Fan Edition looks similar to the Galaxy S20 – it has a similar rectangular rear camera block, and a front-facing snapper in the same position as on the S20, but when you look closer the differences begin to appear.",
    "Firstly, the Samsung Galaxy S20 FE is bigger than the S20, with dimensions of 159.8 x 74.5 x 8.4mm (that’s 8.1 x 5.4 x 0.5mm more than the S20). Secondly, the edges of the screen don’t curve at all, so the phone doesn’t feel as comfortable in the hand – although given how that design feature can be quite divisive, some may not mind that they’re missing out.",
    "The back of the phone is slightly rounded, and this makes up for the lack of the curved screen edges in terms of handfeel to some extent, although we’d still prefer to have the latter. Instead, there’s a thin but noticeable bezel around the screen; this design feature tends to show up in lower-end handsets, and as such it makes the Galaxy S20 FE look a little cheap, and there’s one other design choice which adds to the slightly ‘budget’ feel.",
    "The Galaxy S20 FE’s back is made of Samsung’s ‘Glasstic’, plastic that’s designed to look and feel more like premium glass. The trick doesn’t work, however – Glasstic is very clearly plastic in touch and feel, and it’s a questionable design choice for a phone that costs this much – we’ve seen Motorola phones for a fraction of the price which feel more premium in the hand. Samsung has used Glasstic before in the Galaxy Note 20, and we didn’t like it there, so it’s a shame the company saw fit to bring it back.",
    "One possible upside is that the plastic back should withstand a little more punishment than glass, and in combination with the IP68 rating (dustproof and submergible at 2 meters for up to 30 minutes) it means the FE is a pretty hardy device.",
    "The phone comes in a wide choice of colors: Cloud Lavender (pink), Cloud Orange (pale orange), Cloud Red (red), Cloud Mint (blueish-green), Cloud White (white) and Cloud Navy (dark blue). That’s a lot more options than you get with most phones, and this variety is great for people who find the limited choices for many phones too bland.",
    "At the top-left of the phone’s rear is the camera bump, which doesn’t stick out much, so you can lay the phone down almost-flat on surfaces. On the right edge of the phone is the volume rocker, and below that is the power button, which feels at the right height to be easily accessible no matter how large or small your hands.",
    "There’s a USB-C port here, but no 3.5mm headphone jack – this isn’t totally surprising, as the other S20 phones also lacked the port, but given that some of Samsung’s more affordable phones do have it, you could be forgiven for having expected to see it here.",
    "The Samsung Galaxy S20 Fan Edition screen has a FHD+, or 2400 x 1080, resolution. That’s pretty standard for a smartphone, but given that the S20 phones had WQHD 3200 x 1440 resolutions, this represents one of the notable downgrades for the S20’s ‘lite’ model.",
    "The 120Hz refresh rate is here though, which the display updates 120 times per second, so twice as fast as the 60Hz ‘standard’ of many other smartphones (including the Note 20). A higher refresh rate makes motion look smoother, whether you’re playing games or swiping through menus, although depending on what you’re doing you won’t necessarily notice the difference. It’s worth pointing out that 120Hz is the maximum setting, and you can drop down to 60Hz in the settings if you want to save on battery life.",
    "It’s also worth noting that the Galaxy S20 phones only let you enable either 120Hz or WQHD+ at the same time, not both simultaneously – so if you want to use 120Hz you have to downgrade the screen resolution to FHD+. So if you prioritize a fast refresh rate over resolution, you can effectively enjoy the same screen performance on the S20 SE as on its premium siblings.",
    "The Samsung Galaxy S20 FE has a 6.5-inch screen, bigger than the 6.2-inch display on the Galaxy S20, but smaller than the 6.7-inch and 6.9-inch screens on the S20 Plus and S20 Ultra. This display is broken up by a ‘punch-hole’ cut-out in the top-center – it’s pretty small, and so doesn’t steal much screen space.",
    "In general, as we’ve come to expect from Samsung, the S20 FE’s screen looks good, with bold colors and high contrast ratios. Max brightness is okay, although the screen doesn’t excel in direct sunlight, especially given that the automatic brightness sometimes felt a little dimmer than it should.",
    "The Samsung Galaxy S20 Fan Edition has three rear cameras, with 12MP f/1.8 main, 12MP f/2.2 ultra-wide and 8MP f/2.4 telephoto snappers. While on paper those specs might seem inferior to those of the Galaxy S20 phones, due to the lack of a high-res sensor on the telephoto snapper, we didn’t really find the FE's camera chops demonstrably worse – in fact, we found that the pictures we took looked pretty great.",
    "The main camera has a large sensor, so it ‘sees’ light, and therefore color, better – snaps looked bright and punchy, with everything from blue skies to green plants looking bold. Samsung’s effective AI scene optimization likely has a hand here too, as that tweaks your images depending on what you’re pointing the camera at.",
    "Now and then, colors looked a bit too bold though, as though the scene optimization had gotten overzealous, making images look rather artificial. You can easily switch off this processing feature though.",
    "The S20 FE’s ultra-wide camera squeezes in twice as much of the scene you’re shooting compared to the main snapper – that’s more than comparable snappers on other devices. It captures shots at 0.5x zoom, compared to 0.6x on most, so you’ll see even more of your vista or group of friends in the frame.",
    "Finally, the telephoto camera facilitates 3x optical and 30x digital zoom, and in our testing it proved fairly good at closing the distance without losing detail. Our one issue we found was that zoomed-in shots had duller colors than ones taken with the other snappers – this could be as a result of the lower-res sensor, or perhaps the scene optimization isn’t as effective for zoom shots. You might only notice this if you compare snaps side-by-side though.",
    "A cool feature here, that you won’t find in many rivals, is that when you’re at a high zoom level, a small preview will show you the whole scene you’re zoomed in to. This means that if you find yourself so zoomed-in that you lose track of where you are in relation to the wider scene, you can easily re-frame. The screenshot above should illustrate how effective it is.",
    "A big selling point for the Samsung Galaxy S20 was Single Take photography mode, and it’s back here: you point your phone camera at a subject, enable the mode, and then record a short 5-to-15-second video, panning around the scene as you do so. The phone then selects the best still frames and video clips from the various sensors and edits them for you. It’s a fun mode to use, and can result in some great snaps you might not otherwise get.",
    "There are also returning modes here including Panorama, Night, Live Focus (Samsung’s take on Portrait mode), Live Focus Video, and two Slow-Mo modes – the one called ‘Slow Motion’ is useful, but ‘Super Slow-Mo’ takes such a short clip that we found it hard to use, as we often missed the action.",
    "The Night mode here is particularly useful, as it utilizes the main camera’s large sensor to take in lots of light in low-light settings. It’s pretty easy to use, as you don’t have to hold the phone still for too long, as some night modes require you to do, and the resulting pictures are pretty well-lit.",
    "The front-facing camera is a 32MP f/2.0 snapper, but note that if you take a regular selfie, you’re not getting a 32MP picture – that’s because this sensor is paired with a wide-angle lens. You’ll only get a high-res picture if you take a wider shot, while if it’s a close-up featuring just you, the photo will be automatically cropped.",
    "This is a pretty ingenious solution for letting you capture both solo and group selfies without having multiple front-facing snappers, and we wouldn’t be surprised to see other companies adopt it.",
    "Selfies look pretty good at the default settings, with accurate and appropriate background blur, while if you use Live Focus mode for selfies you get a range of controls for background effects and edits, so we found ourselves using this much of the time.",
    "The Galaxy S20 Fan Edition records video up to 4K 60fps, from both the front and back cameras, and there’s also a Pro Video, similar to the Pro photo mode that nearly all smartphone cameras have, which lets you adjust various settings. Some of the video features, like moving autofocus and other effects, only work when shooting in 1080p 30fps though, and that’s also the max resolution for aspect ratios other than 16:9, so if you’re trying to do professional shooting you’ll have to consider the trade-offs.",
    "The 5G version of the Samsung Galaxy S20 Fan Edition runs on the Qualcomm Snapdragon 865 chipset, while the 4G version uses Samsung’s own Exynos 990. Both are top-end chipsets (while there is a 865 Plus, it’s more a gaming-oriented upgrade), but we’ve found that Snapdragon 8-series processors typically outperform their Exynos counterparts.",
    "We’ve only tested the 5G phone, and in our benchmarking tests it returned a multi-core score of 3,130, slightly more than the 3,034 achieved by the Galaxy S20 Plus with the same chipset. That’s a high score, roughly equal to the results we’ve seen from the Sony Xperia 1 II, Black Shark 3 and OnePlus 8 Pro, and those phones were all great for gaming, multi-tasking and more.",
    "As that score would suggest, the Samsung Galaxy S20 FE was smooth and snappy in use, whether we were scrolling through menus, opening apps, taking loads of pictures in quick succession or playing games.",
    "Gaming in particular felt fast and responsive – we never experienced any lag or glitches, even when playing demanding games like Call of Duty: Mobile and PUBG Mobile at top settings.",
    "The phone’s speakers are pretty good – they’re not top-end, either in terms of audio quality or maximum volume, but they’re fit for purpose whether you’re gaming, watching a movie or just listening to music from the phone.",
    "The Samsung Galaxy S20 Fan Edition comes with Android 10 built in, though you’ll be able to download Android 11 when it rolls out to Samsung’s phones, likely towards the end of 2020. Before the Galaxy S20 FE’s launch, Samsung promised that future phones would get at least three years of Android updates, so you’ll definitely get Android 12 and 13, and perhaps beyond.",
    "Android 10’s key features include a system-wide Dark Mode, which you can enable from the Settings menu, Digital Wellbeing tools, and ‘Bubbles’ that enable you to display messages from communication apps over other apps that you have open.",
    "The Galaxy S20 FE operating system has OneUI laid over the top, which is Samsung’s own Android ‘fork’. As with most custom UIs, the changes this brings are mainly visual, but OneUI also offers plenty of customization options, more so than many other overlays.",
    "For example, there’s a large range of widgets available for the home screen, downloadable themes, and the option to change the font of all the text on the phone.",
    "Navigating the Samsung Galaxy S20 FE menus and home pages felt snappy, thanks both to the processor and refresh rate, and we were never left waiting for apps to load, or for the device to catch up with our swiping fingers.",
    "The Samsung Galaxy S20 Fan Edition’s 4,500mAh battery is fairly average for a smartphone, and we found it lasted roughly a full day – although that’s if you don’t spend too much time enjoying some of the phone’s bells and whistles.",
    "Features like the 120Hz display, 5G connectivity and always-on display are all battery hogs, and particularly when used together they can dramatically reduce how long the phone lasts between charges. When these were enabled, on a typical day we’d finish work with around 30% battery or less remaining, and we’d always have to charge the phone to make it through the evening if we wanted to play a game or watch Netflix.",
    "There are a few different power-saving modes that you can enable, each of which turns off certain features, and if you buy the Galaxy S20 FE we’d recommend that you experiment with these if you want to max-out your battery life.",
    "We found ourselves using the adaptive power saving option when using the phone, which turns features off or on depending on what you’re doing, in order to keep the phone ticking a little bit longer.",
    "The charging speed here is 25W, which isn’t the fastest, but if you’re powering up your phone overnight you won’t mind – it’ll get you from empty to 100% in about an hour. There’s also 15W wireless charging and 4.5W reverse wireless charging – if you’ve got a smartwatch or earbuds that power up wirelessly the latter feature may be useful, as it lets you use your smartphone as a wireless charging pad.",
    "First reviewed: October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Samsung Galaxy S20 FE price and availability",
    "15": "Design",
    "23": "Display",
    "28": "Cameras",
    "41": "Specs and performance",
    "46": "Software",
    "51": "Battery life",
    "56": "Don't buy it if..."
  },
  "links": {
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "best Samsung Galaxy S20 FE deals": "https://www.techradar.com/deals/samsung-galaxy-s20-fe-deals",
    "Poco X3 NFC": "https://www.techradar.com/reviews/xiaomi-poco-x3-nfc",
    "Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Black Shark 3": "https://www.techradar.com/reviews/xiaomi-black-shark-3-review",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android 12": "https://www.techradar.com/news/android-12-news"
  }
}