{
  "source": "https://www.techradar.com/reviews/zendure-superbase-2000-pro-portable-power-station",
  "title": "Zendure SuperBase Pro 2000 portable power station review",
  "category": "computing",
  "updated": "2021-09-30T14:50:35Z",
  "author": "jack-laurent",
  "summary": "A newcomer to the large capacity battery market but can it make a difference?",
  "verdict": "A big capacity at a small price, the Zendure SuperBase Pro 2000 has a lot of tricks up its sleeve and will certainly be a fan favorite thanks to its many innovative features.",
  "pros": [
    "Lots of charge cycles",
    "High battery capacity",
    "High inverter power",
    "Power Factor indicator"
  ],
  "cons": [
    "Screen always on when in use",
    "Fan is a bit loud"
  ],
  "article": [
    "The portable power storage scene has witnessed a mini-revolution since the beginning of the pandemic. The price per watt has fallen significantly thanks to fierce competition from many newcomers in the industry. Zendure, a company launched in 2013, is one of them and has recently introduced its first high-power battery-based generator. Their products are targeted towards an ecologically conscious younger audience on a tight budget.",
    "The 2000W SuperBase Pro is equipped with a 2kW inverter (with a 92.9% efficiency), a 2.1kW/hr battery capacity, and includes plenty of USB ports as well as DC and AC outputs. It is different from the competition by being a connected device thanks to 4G and Wi-Fi radios. The companion app also gives plenty of options not available through the front panel. Features such as a Power Factor indicator and lots of USB Type-C sockets make it stand out from the crowd.",
    "Zendure is running an IndieGogo campaign to launch this new power station in October. For the special price of $1299 which is one of the cheapest watts per dollar available right now, early birds can obtain their top configuration. An extra $448 gets you a high-efficient but compact 200W solar panel also available in the campaign. As with many heavy products that include batteries, shipping to most countries will be in the hundreds of dollars.",
    "The Zendure SuperBase Pro looks like a mini suitcase once unpacked. A retractable handle typically found in carry-on luggage is tucked at the back along with two wheels. The black plastic case measures about 45cm x 28cm x 36cm and at 21.2kg, the model has great power density making it easy to transport and store.",
    "A black accessory pouch containing three high-current charging cables and a USB Type-C to Type-A adapter is also included.",
    "The unit’s grey front panel sports a large and bright 6.1 inch LCD. Four push buttons located around the screen activate various functions of the generator. A green button on the top left turns it on while the remaining three enable the AC, DC, and Wi-Fi sections. Each button when pressed has a small LED that lights up while the LCD’s backlight remains on for as long as the unit is on.",
    "The well-designed display shows all essential information in one place. The customary battery capacity is there as well as the input and output aggregated power. Icons representing various features are located at the top and bottom of the screen. Last but not least is the power factor indicator which allows the user to see how well connected AC devices are performing compared to the inverter efficiency.",
    "On the left side of the case resides six AC outlets that can provide a total of 2,000W continuously or twice that amount in short periods.",
    "A regulated 10A,13.6V car output is also present on the same side while the overload reset switch and the input power sockets are located on the right side.",
    "The front panel contains low voltage DC sockets that include four USB Type-C PD divided into two power groups (20 and 100W), and three DC5521 barrel-type DC sockets. The latter is powered from the same source as the 13.6V car output, thus only outputting a maximum of 136W. The lack of Type-A USB sockets is compensated by the supplied Type-C to Type-A adapter.",
    "The battery used is based on Nickel Manganese Cobalt (NMC) type cells. They provide a better power-to-weight ratio while having at least 3000 charge cycles before degrading. NMC is also superior to the commonly available Lithium Polymer, offering more charge cycles while being a cheaper alternative to the LiFePo4 type.",
    "The SuperBase Pro includes some functionality not normally seen in other similar products. In addition to having Wi-Fi and a Power Factor indicator, a 4G radio and a UPS mode have also been included in the feature list. Having a cellphone in a power station can be seen as vanity but the concept that Zendure wants to sell is to have a unit that is always connected. This opens up applications such as device tracking in case of a lost item or transmission of critical information about the health of the system in case of emergency.",
    "Turning on the station requires pressing quickly on the green button while a longer press will turn it off. A beep validates any operations performed on the front panel. Activating the AC section will automatically activate the built-in fans, generating a low-level hum. The AC ports are capable of a total of 2000W which can be exceeded thanks to the patented Zendure AmpUp technology. This allows 3000W appliances to be powered safely by boosting the output current while decreasing the voltage, thus keeping both the generator and the appliance happy.",
    "Installing the Zendure phone application is strongly recommended in order to use all features of the generator. The unit is placed in pairing mode by pressing the WiFi button until the corresponding icon starts to flash on the display. A new access point is created to which the smartphone connects. On-screen instructions from the app then guide the user through the remaining steps, ending in the device successfully added. The tested app was missing several secondary features such as changing settings on the main page but it was a beta version and the core features all worked without a hitch.",
    "The mobile app offers many options not available through the unit main interface. The input power rate which is set to 1800W by default can only be lowered in the app to avoid tripping the home fuse when charging the station. The same thing goes for the AmpUp, sleep mode, and ambiance light bar which are all features available through the Zendure application.",
    "The uninterruptible power supply or UPS mode is a very useful feature that the SuperBase Pro provides to a household or small office. Thanks to a high output power capability, multiple devices such as home computers and gaming consoles can continue to work during a blackout without any user intervention.",
    "Various accessories are offered at a cost from Zendure. Among them, the 200W monocrystalline solar panel with an efficiency of 22% is an ideal companion for the SuperBase but at $499, is a bit expensive. There is also the EV-AC adapter that allows charging of the unit at any EV station, getting to 80% from being empty in less than one hour thanks to the 1800W charge rate.",
    "The price of the SuperBase Pro 2000 together with the included features place it in its own category. At 1.5W/$, it is the cheapest NMC-based generator that you can buy right now and competition at this price and performance is hard to come by.",
    "The Bluetti AC200P will often be compared to the SuperBase Pro but at $1700, it costs 30% more. In addition, features such as the AmpUp or the Power-Factor indicator are unique to the SuperBase Pro and give it an edge over similar stations.",
    "The EcoFlow Delta power station is very similar in price to the SuperBase Pro but has less inverter power and battery capacity. Having been on the market for a while, it also lacks modern capabilities such as a WiFi connection or an ambiance light.",
    "Finally, the Jackery Explorer 1500 which is a very capable battery-based generator gets you less inverter and battery power while being more expensive.",
    "Zendure, a neophyte in the world of portable power stations, is trying to cater to a younger audience by having both Wi-Fi and ambiance light built in a modern battery-based generator. At the same time, they mean serious business by including a powerful AC inverter and high-capacity NMC batteries. The price of their 2000W flagship makes for a very competitive product with many features available only on high-end units."
  ],
  "headers": {
    "2": "Pricing and availability",
    "3": "Design",
    "12": "In Use",
    "17": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "IndieGogo campaign": "https://www.indiegogo.com/projects/superbase-pro-fastest-recharge-iot-power-station#/",
    "Bluetti AC200P": "https://www.techradar.com/reviews/bluetti-ac200p-ac-power-generator",
    "EcoFlow Delta power station": "https://www.techradar.com/reviews/ecoflow-delta-pro-portable-power-station",
    "Jackery Explorer 1500": "https://www.techradar.com/reviews/jackery-explorer-1500-power-station-battery"
  }
}