{
  "source": "https://www.techradar.com/reviews/cooler-master-sk622-mini-keyboard",
  "title": "Cooler Master SK622 Mini Keyboard review",
  "category": "computing",
  "updated": "2021-07-09T20:45:49Z",
  "author": "michelle-rae-uy",
  "summary": "The wireless feature-rich contender",
  "verdict": "Whether you prefer wired or wireless gaming, Cooler Master’s SK622 60% keyboard is a great option for you. But, what’s even more appealing is that it comes with a host of features you wouldn’t expect. There’s definitely a lot going on here. At the same time, we wouldn’t recommend it to competitive gamers who need a whole lotta speed.",
  "pros": [
    "Comes with a host of features",
    "Great performance when gaming",
    "Thin profile",
    "Both wired and wireless",
    "Fairly quiet",
    "Lightbar nice touch"
  ],
  "cons": [
    "Bluetooth connection sluggish",
    "FN shortcuts feel overly complicated",
    "1000Hz polling rate wired"
  ],
  "article": [
    "Cooler Master has thrown its hat into the 60% gaming keyboard ring with two contenders: the Cooler Master SK622 and its newer fully-wired version, the SK620. However, these keyboards face some tough competition.",
    "Even with the SK622 dual-interface (wired and wireless) prowess, mini keyboards like the Corsair K65 RGB Mini, the Razer Huntsman Mini, and even the more stripped-down WhirlwindFX Atom have set the standards so high, you’d have to be pretty special to compete with the best of them. Is the Cooler Master SK622 special enough?",
    "For a mini keyboard with a low profile, there’s a lot going on, and the Cooler Master SK622 tries to do all that it can do with minimum fuss. At the same time, performance, while good, is nothing to write home about. What’s worse, the keyboard’s wireless performance – the one thing that would have set it apart from the (ultra-talented) crowd – could go back to the drawing board.",
    "The Cooler Master SK622 is $120 (£112, about AU$150). That’s $10 more than the Corsair K65 RGB Mini, whose performance is top-notch, thanks in part to its 8,000Hz polling rate, and on par with the Razer Huntsman Mini, whose optical switches should give it an advantage in longevity. Meanwhile, the stripped-down but still great WhirlwindFX Atom is much cheaper.",
    "You’re essentially paying for added features. If you’re after RGB lighting goodness, a lower profile or having both wired and wireless connectivity, you’ll likely be glad the Cooler Master SK622 is worth it. If, however, faster performance is more vital to you, then you might be happier saving a few bucks with the competition.",
    "Not that the Cooler Master SK622 doesn’t have a few other things it’s got going for it. Of all the mini gaming keyboards we’ve tested, we love how thin and light the SK622 is, measuring 293 x 103 x 30.28mm and weighing 446g. Not only is this keyboard a more compact version of a full-sized keyboard, but it also keeps a thinner and lighter profile.",
    "It feels great to use as well, its mechanical switches satisfying to press and the ergonomic keycaps offering a contoured shape to keep your fingertips in place. For added appeal and in an effort to let its RGB lighting shine, there’s that floating key design we all adore. For a bit of class, its top plate boasts a brushed aluminum finish.",
    "Speaking of RGB lighting, there’s a lot to love if you’re an RGB fan. The only thing that’s better than its per-key customizable RGB lighting is the light bar that runs along its sides and is made up of 44 smaller RGB bars all of which are also customizable. You can get away with using the keyboard’s FN shortcuts to cycle through RGB lighting presets, but if you truly want to make it your own, installing the software and personalizing it is the way to go.",
    "You might also appreciate the dedicated arrow keys that Cooler Master has managed to squeeze in here. While most 60% gaming keyboards have altogether abandoned arrow keys for the sake of compactness, Cooler Master has opted to keep them to the delight of users who use the same keyboard for productivity and gaming.",
    "Fans of wired peripherals will appreciate the Cooler Master SK622’s 1.8-meter braided USB-C to USB-A cable, which also doubles as the charging cable if you want to switch to wireless. If you’re more partial to a cable-free existence, however, there are three Bluetooth 4.0 connections on hand.",
    "Its range is impressive as well, although it doesn’t seem like Cooler Master is advertising the actual numbers for it. We’re able to use this keyboard 20 feet away from our computer in another room without issue. Sadly, we can’t say the same about its actual wireless performance. There’s noticeable latency here whether we’re playing It Takes Two, Cyberpunk 2077, or something older and simpler like Cuphead or Sayonara Wild Hearts.",
    "This won’t be surprising, however, if you happen to check its specifications. The Cooler Master SK622 has a 125Hz polling rate – not to mention, only a 6-key rollover (apparently to save battery life) – when in Bluetooth mode.",
    "Luckily, the Cooler Master SK622’s wired performance is on point. Its 1000Hz polling rate might be average, but when combined with its anti-ghosting technology and N-key rollover feature, this mini keyboard is able to keep up even during button-mashing moments.",
    "We’ve tested this in game and it hasn’t missed a beat – or rather, a key. Though, realistically, with that 1000Hz polling rate, you might want to stick to non-competitive gaming when using it.",
    "If you think you’re missing out on vital keys because of its compact form factor, think again. Cooler Master has loaded this 60% keyboard up with not just essential FN shortcuts like hot and media keys but quite a few non-essential ones as well like changing RGB lighting brightness.",
    "Although it works with the MasterPlus+ Software, the manufacturer has gone through great lengths to make this keyboard “self-sufficient.” You can even cycle through different RGB lighting effects, toggle up to 4 profiles, and record or delete macros using only these FN shortcuts.",
    "That’s a double-edged sword, however. There are a lot of FN shortcuts here, so it might feel overwhelming for some. However it feels to you, you’re going to need a cheat sheet, which Cooler Master has considerately provided.",
    "Of course, any fine-tuning must be done on the actual software. Don’t worry; the MasterPlus+ Software is incredibly easy to use with a user-friendly interface – unlike some other customization software we won’t mention by name. And, it gives you a world of customizations – from per-key and light bar RGB lighting customizations to key remaps, recording macros and setting up profiles."
  ],
  "headers": {
    "0": "Two-minute review",
    "18": "Don’t buy it if..."
  },
  "links": {
    "gaming keyboard": "https://www.techradar.com/reviews/razer-blade-14",
    "mini keyboards": "https://www.techradar.com/news/best-mini-keyboards-the-best-60-and-75-keyboards-for-gaming",
    "Corsair K65 RGB Mini": "https://www.techradar.com/reviews/corsair-k65-mini-keyboard",
    "Razer Huntsman Mini": "https://www.techradar.com/reviews/razer-huntsman-mini",
    "wireless": "https://www.techradar.com/news/best-wireless-keyboards",
    "gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}