{
  "source": "https://www.techradar.com/reviews/lg-signature-series-oled-tv-r-65r9",
  "title": "Hands on: LG Signature Series OLED TV R (65R9 rollable television) review",
  "category": "televisions",
  "updated": "2021-03-31T15:33:40Z",
  "author": "nick-pino",
  "summary": "A promising start to LG's potential R-Series",
  "verdict": "This magical, rollable 65-inch OLED TV has the style and picture performance to really impress – even if the lack of a firm release date is killing us.",
  "pros": [
    "OLED picture performance",
    "Good for 50,000 unfurlings",
    "2nd-Gen Alpha a9 Processor",
    "WebOS 4.5 with Alexa"
  ],
  "cons": [
    "One stand option",
    "800-nit peak brightness",
    "Same panel as other OLEDs"
  ],
  "article": [
    "A rollable OLED may be a hard thing to wrap your head around. At one time, seeing a TV appear out of thin air would’ve been something straight out of a magic act. But LG’s new rollable TV, the Signature Series OLED TV R isn’t magic – it’s engineering and display technology risen to the nth degree.",
    "And while it certainly has a magical, sci-fi quality about it – how many TVs have you seen collapse in on themselves without being destroyed? – it’s now more fact than it is fiction.",
    "LG's rollable OLED is now on sale in its first territory, South Korea, with pre-orders opening in the UK, and a wider global release expected to follow suit. With a firm pricing, too, we have a better sense of what we might be paying in the US or elsewhere, even if we're yet to hear conclusively from LG on the matter.",
    "This innovative OLED TV was first shown off at CES 2018, with LG proceeding to flaunt the sleek rising and falling screen at tech expos around the globe. However, an initial 2019 release window came and went, seemingly because of production issues, and we got through almost the whole of 2020 before LG was confident enough to release the set to the public.",
    "We've had plenty other OLED sets to contend with in that time too, including the 2020 LG TV range and the LG CX OLED and LG Gallery Series OLED that came with it.",
    "But, as ever, we find ourselves mesmerized by the South Korean electronics maker’s latest innovation. Here's everything we thought in our hands on review of the rollable OLED TV R, when we saw it in the flesh.",
    "UPDATE: The LG Signature OLED R is launching in the UK at a £99,999 price point. Pre-orders open in the first week of April, and we expect US availability to follow suit in the coming weeks.",
    "The Signature Series OLED R, is now available in South Korea, with pre-orders available in the UK.",
    "It's taken a while to get here, as the set was first shown off in early 2018, and we expected a global launch the year after. It's been so long that the product name has had to change from '65R9' to '65RX' to match the naming conventions of 2020 LG screens.",
    "In South Korea, the set is retailing for ₩100,000,000, which converts to around $87,000 / £67,000 / AU$123,000. It's a big step above the $60,000 RRP we were initially told to expect, though still lower than the $100,000 we heard reported by Nikkei Asia in early October.",
    "However, UK shoppers will be paying something of a premium at £99,999, with pre-orders kicking off at the start of April. We expected the US pricing to cleave close to $87,000, but at this rate we reckon it'll match the UK with a $99,999 RRP, and release in mid-2021.",
    "Either way, it's a lot of money, which is to be expected from such innovative (and mechanically complex) tech. We'll never take the simplicity of our LCD flatscreen for granted again...",
    "What LG has done with the R-Series is harness OLED’s natural flexibility and built a base that acts both as a storage facility, unfurling mechanism and, also, a sound system all in one.",
    "The base is slightly longer than 60 inches across but half that size vertically. That’s enough storage space for the screen, apparently, as well as the 4.2 Atmos sound system.",
    "The housing unit, which has all the inputs and outputs built into the back, sits on top of a plain white stand that comes with every 65R9 OLED. The base and the stand are all you're going to see when the TV is turned off... which is fine as long as you like the white stand and base. If not, you're out of luck: the stand only comes in one color and there's no swapping bases.",
    "While the single color option is a disappointment, the stand itself is a minimalist’s dream: it’s low to the ground, open at the bottom to allow for storage and fairly innocuous.",
    "The magic of the unfurling (the term we’ve given to the TV unrolling itself from the stand) remains a bit of a mystery, a short instructional video LG put together shows the TV being rolled up on a spindle inside the base.",
    "The TV unfurls itself silently and engineers have told LG executives that the TV can be furled and unfurled around 50,000 times – which means if you turned it off and on twice a day, you wouldn’t hit the upper limit for about 34 years.",
    "In practice, when you turn the TV on, a small portion of the top surface slides back and the TV unrolls itself into an upright position. The TV can either extend to its full 65-inch form – what LG is calling Full View – or display just a small part of the screen in Line View. The former is used when you're watching TV while the latter might be used when you want to play music or use Mood Mode which displays small visual effects to match a nature-themed audio soundtrack like Rain, Stars or Snow.",
    "According to LG, the 65-inch screen is held it in place with brackets at the base that prevents it from wobbling when upright. That doesn’t mean that the TV could survive a direct strike from a flying object like, say, a CRT could when they were popular a decade ago, but it certainly shouldn’t wilt over time, either.",
    "Around the back, you’ll find HDMI 2.1 ports which will support 4K120 playback once it’s available via an update later this year. HDMI 2.1 also includes support for HFR content when that arrives sometime down the road.",
    "When the TV is fully exposed, you're treated to a 4K HDR OLED TV set. It's just as beautiful as LG's screens from last year, even if there hasn't been a massive change in technology - the panel itself hasn't undergone a massive revision, unfortunately.",
    "Still, what we saw was particularly impressive. OLED picture quality is still at the top of the table compared to standard LED-LCD. Sure, the latter can get brighter - and that certainly makes LED-LCD look better in a brighter room - but when it comes to cinema-quality black levels OLED is still the absolute best.",
    "Inside the 65R9 is the next-generation of Alpha a9 processors that allow for deep learning picture quality and an ambient light detection feature that can actually adjust the PQ curve of a TV depending on the ambient brightness in the room - i.e. when it's daytime the TV will recognize the additional light and raise its max brightness to compensate, and reverse that process at night.",
    "In terms of sound quality, LG has implemented a new AI Sound mode that really upgrades the forward-firing speaker's audio performance by virtualizing it for a larger space. The speakers, despite no having an upfiring component, sounded very similar to some of the lower-end Atmos systems I've heard - and that was without the TV playing any Atmos-compatible content.",
    "The last feature is all part of LG's new WebOS 4.5 smart platform, which makes its debut on all of the 2019 LG UHD TVs. The big change this year is that the Amazon button on the remote doubles as a way to access Alexa - a short press brings up Amazon Prime Video while a long press brings up Amazon's virtual assistant. That doesn't mean Google Assistant or LG's own ThinQ smart platform are out of a job, however, those smart platforms still exist and can be accessed by pressing the press-to-talk button (microphone button) on the LG Smart Remote.",
    "Lastly, not to be outdone by Samsung's announcement that its 2019 TVs will support iTunes on its Tizen smart TV platform, LG says that it will support AirPlay 2... just stopping short of creating an iTunes app on the LG TV Store.",
    "While OLED still isn't hitting the brightest highlights that LED-LCD and MicroLED are hitting, it's still one of the best display technologies on the market. Combine OLED's superb picture performance with the novel, nearly magical ability for OLED to roll up into a base stand when you're not watching it and, well, this is easily one of the coolest, most noteworthy TVs we've ever seen at either CES or IFA.",
    "We'll have to wait until we get a Western release and some proper testing time to give a full verdict, though, and we expect the pricing will be a barrier for all but the biggest spenders, no matter how good the TV turns out to be.",
    "If the 65R9 catches on, though, it could spark a wave of more flexible OLED screens – and that would be a sight to behold.",
    "Can't wait until 2021? Check out deals on the latest LG OLED TVs below:"
  ],
  "headers": {
    "7": "Price and availability",
    "12": "Design",
    "21": "Performance",
    "27": "Early verdict"
  },
  "links": {
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "CES": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "2020 LG TV": "https://www.techradar.com/news/lg-tv-2021",
    "LG CX OLED": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "LG Gallery Series OLED": "https://www.techradar.com/reviews/lg-gallery-gx-oled-tv",
    "launching in the UK at a £99,999 price point": "https://www.techradar.com/news/you-can-finally-buy-the-lg-rollable-oled-tv-in-the-uk-if-you-can-afford-it",
    "Nikkei Asia": "https://asia.nikkei.com/Business/Electronics/LG-flexes-its-display-tech-with-100-000-rollable-TV-on-sale-this-month",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "smart platform": "https://www.techradar.com/news/best-tv"
  }
}