{
  "source": "https://www.techradar.com/reviews/godaddy-smartline",
  "title": "GoDaddy SmartLine review",
  "category": "computing",
  "updated": "2021-08-06T09:42:41Z",
  "author": "gabe-carey",
  "summary": "Two business phones in one",
  "verdict": "Despite lacking some of the more crucial VoIP features, such as internet fax, call log reports and a multi-level auto attendant, GoDaddy SmartLine has never claimed to be a real VoIP provider. Instead, the service is essentially an app for iOS and Android that repurposes your smartphone as a business handset, complete with its own number and voicemail greeting, and sells for a reasonable price.",
  "pros": [
    "Affordable prices",
    "Voicemail-to-text transcriptions",
    "Scalable business hours",
    "Easy to use"
  ],
  "cons": [
    "Plans are confined to smartphones",
    "No support for GIFs or video messages",
    "Light on VoIP features"
  ],
  "article": [
    "Sometime after the decline of the copper wire landline telephone but before the global domination of the smartphone, we as a society collectively decided that the de facto way to run a business was with the help of a Voice over Internet Protocol (VoIP) provider.",
    "Designed to make office phone calls more practical and cost-effective, these internet-powered desk phone services are still – to this day – most companies’ preferred method of verbal professional contact. The most popular VoIP providers, like RingCentral Office and Vonage Business Cloud are used because they give administrators control over which features they need to conduct their operations and which features they could do without.",
    "But what if there was another way? That’s the question asked by GoDaddy, a company you’ve probably heard of before, whether it’s because of its website domain and hosting services or because of its spicy Super Bowl ads that once stirred up some controversy back in the day. With GoDaddy’s SmartLine utility, businesses can theoretically ditch the desk phone altogether in favor of a subscription plan that costs less than a VoIP service and takes place entirely on employee smartphones.",
    "It would be understandable if businesses were not convinced initially if SmartLine can answer all their communication needs. Certainly, it offers a reduced number of features when compared to fully-fledged VoIP services. Instead, it’s better to think of SmartLine as a softphone solution - essentially, a piece of software that allows individuals to make telephone calls over the internet via a computer or smartphone.",
    "As SmartLine does not come with some of the flashier features that accompany other VoIP services, it is very reasonably priced. GoDaddy SmartLine costs just $3.99 (£3.12) per month for the Basic plan, which limits you to 100 calls and 100 text messages every billing period, or $9.99 (£7.81) per month for unlimited calling and texting to and from your business line. Both plans come with a free one-month trial run.",
    "Of course, these pricing plans compare favorably with traditional landlines. In particular, if businesses make a large number of international calls, then costs can skyrocket unless you are using some form of VoIP telephony. Another benefit of taking the softphone approach is that workers are contactable even when they are away from their desks. If organizations are embracing remote working (as many are today), then GoDaddy SmartLine offers an affordable way of ensuring that your employees are contactable whether they are working from the office or their home.",
    "Though technically not a VoIP service at all, GoDaddy SmartLine does serve as a viable alternative to some of the seasoned players over in that biz. It does so by giving you a second number to associate your smartphone with while keeping personal matters separate from your trade.",
    "Whenever you receive a call, for example, the service will let you know whether it’s your personal or business line that’s being phoned. If the caller is trying to reach your business line, you will see a convenient “Via SmartLink” dialogue just below your caller ID.",
    "Likewise, switching between your two numbers is seamless. Since the business line is only accessible through the SmartLine Second Phone Number app for iOS and Android, returning to your personal phone number to make calls and send texts is as straightforward as exiting the app.",
    "That said, the functionality within the app itself is rather limited. You can use the Dialer to make calls from your business phone number, either by entering the number of the recipient manually or by sifting through your contacts.",
    "Otherwise, you can send a text message by tapping the New Text feature. From there, you can send basic messages to one of your contacts, or to any number that you type in by hand, using standard Unicode characters and photos. GIFs and videos, on the other hand, are notably unsupported.",
    "Aside from that, there’s an Edit button on the home screen of the SmartLine Second Phone Number app. Tap it and you can subject your conversations to permanent deletion. In the corner opposite of the Edit button is what should be a familiar Settings gear icon. Upon tapping it, you can review your SmartLine phone number, change your linked personal phone number and manage your subscription to the service.",
    "One of the benefits of many modern VoIP services is the way that users can tweak certain features using an online dashboard. Smartline does offer a similar, albeit more limited, kind of flexibility for its users. In the Settings menu, you can set your available business hours so that the app can know when you can and cannot receive calls. You have the option to adjust business hours on a per-day basis or you can group days together so that Monday through Friday hours are set independently of weekend hours. If that’s not your style, you can turn on Do Not Disturb to ignore clients, customers and other professional contacts entirely.",
    "Moving down from the Availability subsection of the Settings menu, you can tweak your voicemail preferences too. Under the Voicemail subheader, you’ll see two boxes: Greeting and Email Notifications. In Greeting, of course, you customize what people hear when you don’t pick up and they’re sent to voicemail. By default, there’s a 14-second automated recording set as your “Current Greeting.” Here you can record a new greeting or simply reset your greeting back to its original, robotic state.",
    "In the Email Notifications submenu, you can decide if you want every voicemail you receive to be forwarded to your email address of choice as it’s received. Along with the audio clip, with this option enabled, you can expect to receive transcriptions of your voicemails as well. The only other feature in the SmartLine Second Phone Number app is number blocking, which can be achieved by swiping left on conversations (in iOS) and long pressing conversations (in Android) before hitting Block.",
    "As we mentioned before, GoDaddy SmartLine is not a VoIP service, and that’s according to GoDaddy itself. Still, it does share some unique qualities with VoIP providers whose services often cost more than double that of SmartLine. The voicemail-to-text transcription feature, for instance, is a major selling point of RingCentral Office and 8x8 Virtual Office Pro. In fact, it’s one we dinged Vonage Business Cloud for not having.",
    "So while GoDaddy SmartLine is somewhat barebones compared with genuine VoIP providers, it’s also tied to your smartphone, a concept that will undoubtedly attract employers advocating for BYOD (Bring Your Own Device)."
  ],
  "headers": {
    "15": "Final verdict"
  },
  "links": {
    "Voice over Internet Protocol (VoIP) provider": "https://www.techradar.com/news/best-voip-service",
    "RingCentral Office": "https://www.techradar.com/reviews/ringcentral-office",
    "Vonage Business Cloud": "https://www.techradar.com/reviews/vonage-business-cloud",
    "GoDaddy’s SmartLine": "https://www.anrdoezrs.net/click-6361382-11774111?url=https://www.godaddy.com/smartline&sid=trd-us-8951421876576488000",
    "iOS": "https://itunes.apple.com/us/app/smartline-second-phone-number/id1161533637?mt=8&at=1001lnRX&ct=trd-us-1367637410681295000",
    "Android": "https://play.google.com/store/apps/details?id=com.godaddy.gdm.smartline&hl=en_US",
    "8x8 Virtual Office Pro": "https://www.techradar.com/reviews/8x8-virtual-office-pro",
    "BYOD (Bring Your Own Device)": "https://www.techradar.com/news/computing/what-is-byod-and-why-is-it-important-1175088"
  }
}