{
  "source": "https://www.techradar.com/reviews/iweb",
  "title": "iWeb review",
  "category": "computing",
  "updated": "2021-09-16T06:08:18Z",
  "author": "mike-williams",
  "summary": "Canadian host geared towards professional users",
  "verdict": "iWeb is a well-established web hosting provider from Montreal that offers professional services aimed at businesses and users with technical know-how in general. Although the quality of their hosting solutions is nothing short of impressive, unfortunately, the same can’t be said for their customer support.",
  "pros": [
    "A decent variety of hosting services",
    "30-day money-back guarantee",
    "98% powered by renewable energy",
    "100% uptime guarantee",
    "Multiple server locations",
    "24/7 support available in English, French, and Spanish"
  ],
  "cons": [
    "No shared hosting",
    "Pretty high prices",
    "Customer support has been considerably criticized"
  ],
  "article": [
    "Founded in the land of cold winter but warm people (yes, we mean Canada), iWeb is a long-standing web hosting company with a history going back to 1996 when it started out under the name of Formatek. Two years later, its founders, Eric Chouinard and Martin Leclair consolidated Formatek and the rest of their collection of web services into iWeb (also known as iWeb Technologies), as well as established the company’s first colocation and server hosting facilities in Montreal (Canada).",
    "Today, iWeb operates three additional eco-friendly data centers in Montreal, as well as PoPs (points of presence) in Toronto (Canada), New York (the USA), Dallas (the USA), Santa Clara (the USA), Amsterdam (the Netherlands) and Singapore (Singapore). As of today, these data centers provide hosting for thousands of businesses in over 150 countries around the globe.",
    "In 2013 iWeb was acquired by INAP, an IT infrastructure giant from the USA and the company behind the first commercially available cloud computing service based on OpenStack.",
    "Finally, in 2021 iWeb was acquired by Leaseweb, a Dutch-based cloud computing and web services company with offices around the world.",
    "iWeb’s official site looks somewhat gloomy (too much gray for our taste), yet it feels very professional, user-friendly, and filled with all the necessary information. The same could be said for iWeb’s official blog if it didn’t suffer from a malady plaguing similar blogs and that is not being updated for years (since 2019, to be precise).",
    "Unfortunately, the same rule applies to their Facebook and Twitter accounts.",
    "iWeb’s scope of services seems to be intended for high-end users with its cloud servers, private cloud, dedicated servers, server clusters, server management, colocation, and more. However, even if you’re not searching for something at this level be sure to stick around since there are some good (although not cheap) options for less ambitious users as well.",
    "Let’s take iWeb’s VPS-like cloud servers as an example. With any of these plans you’ll get unlimited inbound and outbound traffic, 100Mbps of public bandwidth, one public (WAN) IP address, one private (LAN) IP address, a 100% uptime guarantee, and use of their Montreal data center.",
    "In addition to all of the above, the least expensive plan starts at $43.80 per month (or $0.02 per hour) and includes 1GB of RAM, 1 CPU, and 50GB of storage (SSD). With all available plans, you can choose between Linux and Windows servers, with the latter being (not surprisingly) more expensive.",
    "iWeb promises a so-called 30-day satisfaction guarantee, which, in theory, should function as a standard money-back guarantee. The process is less hassle-free than we expected, but it's nice knowing that the option in question is available nonetheless.",
    "The supported payment methods with iWeb include credit cards (Visa, MasterCard, and American Express), checks, wire transfers, automatic bank withdrawals, and cash payments.",
    "To launch your cloud (or any other) server with iWeb, the first thing you’ll need to do is to create your account with them, or simply sign in if you already have one. It is also advisable to read SLA before going any further.",
    "Creating an account involves surrendering a good deal of your data including a full name, a telephone number, and a physical address. Seconds upon sending a request for your account to be created, you’ll proceed to iWeb’s Control Center, a stripped-back console where you’ll (finally) be able to deploy a server.",
    "There you’ll find both ready-made and completely customizable hybrid solutions on offer, so if you’re not sure which one is best suited for your needs, you can try your luck with iWeb’s sales staff. In any case, the first step is to decide between co-called smart servers, cloud servers, and classic (dedicated) servers. After entering all your payment information, you’ll be offered to decide about the package details including GB of RAM, number of vCPUs, and OS (a few versions of Linux and Windows are available).",
    "After making a payment and wrapping everything up, your server should be up and running in less than a few minutes, and impressively so. iWeb doesn’t provide industry-standard cPanel with its cloud and smart hosting packages, but a minimalistic custom-made control panel mentioned above (Control Center) with which you’ll be able to monitor and manage your server.",
    "However, if you went with a dedicated server, iWeb offers both cPanel and Plesk (depending on the OS you chose), two of the most popular control panels on the market. Users with at least some experience should feel in their element straight away and those without it shouldn’t fall far behind.",
    "Among the reasons why to choose them, iWeb highlights their performance, reliability, and great value for the money. To measure the speed performance of iWeb's official site we employed GTmetrix (our tool of choice) and conducted several tests throughout the day. The results were quite similar, warring between A and B as a final grade, both of which are pretty good. The site took 6.1 seconds to fully load, which is swifter than the average result, although not picture perfect.",
    "As for uptime, iWeb offers an SLA-backed 100% network uptime and power guarantee, which is great to have although there is a good chance you won’t have to call on it. We say this because during our two-week testing period (via UptimeRobot) we failed to track down any downtime at all and just some minor oscillations in response time, the average being 340.33 milliseconds.",
    "Although iWeb's support staff claims that “your satisfaction is their priority” this doesn’t seem to be true if you haven’t subscribed for their services yet. Prior to signing up we sent them a message via chat with a few simple questions about their refund policy and haven’t received a reply to this date. After creating an account with iWeb we awaited a welcome e-mail with information about our account in vain since none were sent.",
    "Maybe your experience with iWeb's pre-sales support will be completely different from ours, and we might simply be unlucky. However, reviews from their (we suppose former) users on platforms such as HostAdvice, TrustPilot, and HostSearch are strangely similar to ours, which is something to consider especially if competent customer support is something you care about. In any case, iWeb's support staff is available via “live” chat, ticket, and telephone.",
    "There’s not much to be told about iWeb's self-help options except that their knowledgebase looks dated but it’s quite comprehensive. It is also available in French and Spanish in addition to the English language.",
    "If eco-friendly hosting is your thing, both GreenGeeks and iWeb are good candidates to consider. Both hosts provide a wide variety of hosting options with server locations all over the world. However, GreenGeeks goes a step further by providing entry-level shared hosting packages at pocket-friendly pricing for users with simpler needs. They are somewhat stronger in terms of customer support as well.",
    "Another worthy alternative to iWeb is a US-based HostGator. Both hosts are a good choice for tech-savvy users who don’t need a lot of hand-holding, however, those who do are better off with HostGator.",
    "Bluehost and iWeb are somewhat similar in terms of hosting options and features, but differ when it comes to pricing, with Bluehost being much more affordable, particularly for those who decide to commit for at least a year. In addition to this, Bluehost’s how-tos are incredibly easy to understand and follow, making everything easier for new users.",
    "The last (but not least) host we’re going to name is DigitalOcean, a US-based web hosting giant with a decade of experience under its belt and data centers all over the globe. Although both DigitalOcean and iWeb are geared towards users with some amount of technical know-how, DigitalOcean is the best fit for developers who want to deploy cloud infrastructure that won’t leave a hole in their pocket. On the other hand, iWeb offers a money-back guarantee (while DigitalOcean doesn’t), so you can check them out for yourself without any worries.",
    "If you are a veteran webmaster searching for a competent host that can provide you with customizable and easily scalable dedicated IT infrastructure solutions, iWeb is worth checking out. However, if you haven't had much experience with all of this, the silence of iWeb’s support staff will make you feel at a loss, and any additional services from the technical team will boost the (already considerable) price.",
    "For a superior variety of beginner-friendly hosting solutions that can fit most budgets, take a look at hosts such as HostGator, GreenGeeks, and Bluehost."
  ],
  "headers": {
    "6": "Plans and pricing",
    "11": "Ease of use",
    "16": "Speed and experience",
    "18": "Support",
    "21": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "iWeb": "https://iweb.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "colocation": "https://www.techradar.com/news/best-colocation-hosting",
    "server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "GreenGeeks": "https://www.techradar.com/reviews/greengeeks",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "DigitalOcean": "https://www.techradar.com/reviews/digitalocean"
  }
}