{
  "source": "https://www.techradar.com/reviews/asus-rt-ax58u",
  "title": "Asus RT-AX58U review",
  "category": "computing",
  "updated": "2021-12-06T00:01:31Z",
  "author": "cliff-joseph",
  "summary": "Fast and affordable Wi-Fi 6 router",
  "verdict": "The RT-AX58U gets all the basics right, combining fast, dual-band Wi-Fi 6 performance with a competitive price. It’s easy to use, with good parental controls and other features, and also offers a web browser interface for more advanced users.",
  "pros": [
    "Strong Wi-Fi 6 performance",
    "Simple set-up",
    "Good parental controls",
    "Competitive price for a Wi-Fi router"
  ],
  "cons": [
    "Dual-band only"
  ],
  "article": [
    "Give your network that Wi-Fi 6 boost with the Asus RT-AX58U. It offers that Wi-Fi 6 upgrade at a very competitive price to folks looking to cover medium-sized homes and office spaces.",
    "Widely available online for around £164.99/$179.99/AU$429, the Asus RT-AX58U picks up where high-end routers like the Asus ZenWifi AX mesh systems would be overkill. This dual-band router not only supports Wi-Fi 6, but does so on the 2.4GHz and 5.0GHz bands, with a top speed of 3000Mbps.",
    "Bear in mind that you won’t get the full benefit of Wi-Fi speed and reliability unless your computers and mobile devices also support Wi-Fi as well. However, Wi-Fi 6 is still compatible with devices that use 802.11ac wi-fi, so you don’t have to worry about replacing older devices when you buy a Wi-Fi router.",
    "Also watch out for Asus’ model numbers, though, as they can be a bit confusing, and there’s a very similar model called the RT-AX56U, which is about £40/$50/AU$70 cheaper, but only runs at 1800Mbps. That’s still a good speed, and perfectly adequate for streaming video and web browsing on just a handful of devices. However, homes that have lots of computers and mobile devices all connected to Wi-Fi at the same time will benefit from the stronger performance of the RT-AX58U.",
    "Asus’ designers have done a good job squeezing Wi-Fi 6 performance and features into this compact little router. The four black antennae poking up from the back look like they mean business, and the angle of each antenna can be adjusted to make sure you get good all-round coverage with your wi-fi signal.",
    "Even so, the router measures just 224mm wide, and its low-profile design means that it will sit neatly on any convenient shelf.",
    "Just remember that the RT-AX58U doesn’t include a modem, so you’ll need to connect it to your existing broadband modem or router in order to connect to the Internet.",
    "There’s a dedicated Gigabit Ethernet port for that Internet connection, along with four additional Ethernet ports for devices that need a wired connection, and a USB 3.1 port for sharing USB storage devices on your home network.",
    "Getting started is very straightforward, and Asus manages to cater for both complete beginners and more advanced users. The manual provided with the RT-AX58U shows how to plug everything in, and explains the two options that are available.",
    "If you’re familiar with networking technology then you can use an Ethernet cable to connect the router directly to a Mac or PC and configure the network settings for yourself via a web browser interface.",
    "However, most people will probably prefer to use the Asus Router app for iOS and Android devices instead. This gets off to a good start by giving you the option of creating a single network that combines the 2.4GHz and 5.0GHz bands, or setting up two separate networks that have different passwords.",
    "The app includes plenty of other useful features too, including the ability to create a temporary guest network, and use QoS - quality of service - to prioritise certain types of online services, such as streaming video or gaming, that really need top performance.",
    "Asus also has an edge on some of its router rivals by providing good parental controls, including the ability to create schedules for Internet use, and filters for blocking adult content and other unsuitable material.",
    "And, of course, the Wi-Fi 6 technology of the RT-AX58U provides impressive performance for your home wi-fi network. When used in the same room as our existing 802.11ac router, the RT-AX58U managed to squeeze a little extra speed out of our Internet connection, increasing Wi-Fi speeds from 55Mbps to 59Mbps.",
    "However, the real test in our building is the back office - where our Wi-Fi signal is so unreliable that we normally rely on a wired Ethernet connection for our office computers. The RT-AX58U took things in its stride, though, continuing to deliver a steady and reliable speed of 58Mbps even in that office. Download speeds from Steam held up as well, staying strong at just over 7MB/s in all locations in our building."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Design and features",
    "8": "Setup and performance",
    "15": "Don’t buy it if…"
  },
  "links": {
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Asus ZenWifi AX": "https://www.techradar.com/reviews/asus-zenwifi-ax-xt8",
    "mesh systems": "https://www.techradar.com/news/best-wireless-mesh-routers",
    "Wi-Fi router": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523"
  }
}