{
  "source": "https://www.techradar.com/reviews/govee-starpal-pro",
  "title": "Govee StarPal Pro review",
  "category": "smart-home",
  "updated": "2021-09-03T16:15:44Z",
  "author": "rhys-wood",
  "summary": "An affordable smart light alternative",
  "verdict": "The Govee StarPal Pro is a great choice if you're looking for an affordable smart light for your home. Covering a wide gamut of colors, it's only really held back by its bulky size and comparatively low lumen count.",
  "pros": [
    "Millions of colors",
    "Impressive customization",
    "Responsive app"
  ],
  "cons": [
    "Bulky",
    "Just 350 lumens",
    "Some modes less responsive than others"
  ],
  "article": [
    "The Govee StarPal Pro is a seriously impressive smart light for its price. Its affordability means it's well positioned for those interested in smart lights, but who may not have the budget to buy one of the best smart lights like Philips Hue bulbs.",
    "As a portable table lamp, you immediately have a lot of options as to where you could place the Govee StarPal Pro. In our testing, we found it to be best placed at bedside for a reading session, or placed behind a smart TV for immersive lighting in a darkened room.",
    "But the most immediately striking thing about the StarPal Pro out of the box, to its detriment, is the size of the device. It's surprisingly bulky, and certainly isn't what we'd class as lightweight. This isn't a deal breaker by any means, but it can make moving the lamp from room to room a bit of a pain.",
    "Impressions instantly improve when the StarPal Pro is turned on, however. By default, the StarPal Pro emits a bright white light, but by connecting to the Govee Home app via WiFi or Bluetooth will unlock tons of options to allow you to customize the light fully.",
    "The StarPal Pro's RGBWW lighting means that it's not just bright white lights you're getting. The full color spectrum is available to you using the Govee Home app, and you can choose between a static color, or set a light show using one of many presets. Better yet, you can create your own with the DIY option.",
    "The Govee Home app functionality is arguably the most impressive feature, then. While there's a bit of a learning curve, its hugely customizable lighting means you can not only find a color (or set of colors) that's right for you, it's also a ton of fun to experiment with. If you have kids, the StarPal Pro in conjunction with the Govee Home app could prove to be a great way to spend time with them.",
    "It helps that the app itself is responsive. Lighting changes occur instantaneously. That includes gradients and effects as well as single colors. This makes the Govee Home app hassle-free and fun to use.",
    "It all sounds like a fairly perfect package, then, but the big thing letting down the StarPal Pro is its low lumen count. At just 350 lumens, it falls well below the most basic smart lights from Philips Hue and LIFX bulbs which start at 800 lumens.",
    "Even in darkened environments, the lighting effect does appear quite dim. It's visible and still quite pleasant thanks to the customization available, but we'd have loved the StarPal Pro to have outputted more lumens. The obvious upside is that the StarPal Pro is available at a lower price point, but do note that the loss of brightness is significant.",
    "Speaking of price, the Govee StarPal Pro is available to buy right now from Govee's own site. If you're in the US, you have two purchase options available. The WiFi + Bluetooth model is available for $65.99. Alternatively, there's a Bluetooth-only model which costs less, at just $49.99.",
    "For UK buyers, only the WiFi + Bluetooth model is purchasable for £48. Unfortunately, Govee confirmed to us that the StarPal Pro is not available to buy in Australia.",
    "Even though it's a little on the bulky side, we actually really like the physical design of the Govee StarPal Pro. The bowl-shaped design features two stubs on the underside, allowing the smart light to be stood on upright or tilted at an angle. It's a small thing, but the option to choose here is welcome.",
    "The activation switch is also situated on the bottom of the device. This can be a little awkward if you want to manually turn off the lamp if you're not planning on using the app.",
    "The light itself crosses the entire diameter of the bowl, giving way to a pleasing effect when switched on and as it cycles through colors. The bowl-filling effect somewhat makes up for the drastically low lumen count, but not by all that much.",
    "The 350 lumens put put by the StarPal Pro is really starkly low compared to the competition, including Philips Hue and LIFX, which reliably put out bulbs upwards of 800 lumens. The LIFX Clean smart light bulb, for comparison's sake, puts out 1,200 lumens. And in the US, it's not much more expensive, retailing at $69.99. That's just $4 pricier than the StarPal Pro.",
    "However, the StarPal Pro can still be used to adequately light up a darkened environment if, say, you want to use it as a reading lamp, or as background immersion while watching a movie or playing your favorite games. It doesn't do the job as well as Hue or LIFX in that regard, but the StarPal Pro still delivers if you're on a tight budget.",
    "The StarPal Pro can take a few seconds to turn on or off via the app, but we found the smart light to be otherwise remarkably responsive.",
    "There are four main lighting modes to try on the StarPal Pro, and each did what they said on the tin to an admirable degree. Music mode syncs the tunes you're listening to on your connected device, and cycles through light colors and intensity based on the rhythm. It's not perfect, but a fun choice for parties or chill social gatherings thanks to multiple sensitivity settings.",
    "Second is Color mode. Quite simply, this will let you choose a singular color for the lamp to output. Handy sliders allow you to pick a color from across the spectrum, and alter the intensity between warm and cold on a secondary slider. The change is impressively instantaneous.",
    "The same almost applies to Scene mode, which lets you choose from a list of presets based on a variety of themes. Applying different scenes can take a second or two, but that's because it's loading not only colors, but also lighting effects based on the theme you've chosen.",
    "DIY mode is similar to Scene mode, except you're in full control of colors and effects. Strangely, we found our saved DIY presets to load slightly faster than the baked in presets of Scene mode.",
    "Finally, you can set timers for when you'd like the StarPal Pro to switch on or off. These timers are accompanied by \"Wake up\" and \"Sleep\" options, which gradually brighten or dim the lamp respectively.",
    "The beauty of the Govee Home app is that it's simultaneously simple and robust. And while it's not quite as particular as the LIFX app, what's here is an impressive array of options that allow you to tailor your lighting experience to your liking.",
    "The app is accessible to just about anyone, and is available on both iOS and Android. The home screen identifies the devices in your vicinity, and this is where you'll connect to them via Bluetooth or WiFi. The setup process is mercifully simple: you simply have to enter your WiFi password and are good to go.",
    "The homepage also has tabs for Govee's online store, as well as the novel Govee Light Studio, a community-driven hub where you can download effect presets other users have made, as well as show off images of your smart home setups. It's a cute little feature and doesn't get in the way of the primary experience.",
    "Lastly, voice activation is supported via Alexa and Google Assistant, and it works quite well. Your Govee StarPal Pro can be controlled with simple voice commands, such as adjusting brightness or changing lighting effects and colors. It's a simple integration we're glad to have, especially in such an affordable smart light."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Price and availability",
    "11": "Design",
    "16": "Performance",
    "22": "App",
    "26": "Don't buy it if..."
  },
  "links": {
    "best smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "Philips Hue bulbs": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "LIFX Clean": "https://www.techradar.com/reviews/lifx-clean-review"
  }
}