{
  "source": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
  "title": "iPad Pro 12.9 (2020) review",
  "category": "tablets",
  "updated": "2021-06-07T19:30:33Z",
  "author": "david-lumb",
  "summary": "The iPad Pro 2020 is still a powerful tablet, though no longer the best",
  "verdict": "The iPad Pro 2020 is a powerful tablet with the capability to effortlessly run even demanding apps, and it’s also an excellent device on which to play media, thanks to its impressive display and speakers. Unless you find it at a discount the professional tablet may be too far outpaced by its successor, the iPad Pro 2021 and its desktop computer-level M1 chipset; but if you’re just looking for a powerful tablet and don’t need the best of the best, wait for a good deal to make this top-performing slate better value.",
  "pros": [
    "Lovely sleek design",
    "Awesome screen and speakers for media",
    "Powerful performance"
  ],
  "cons": [
    "Expensive",
    "No longer the fastest for its price",
    "Necessary external keyboard adds more cost"
  ],
  "article": [
    "The iPad Pro 2020 is still one of the most powerful tablets on the market, with specs and software that enable it to do plenty of laptop-level work. But you’ll have to pay close to laptop-level prices for the privilege of owning one, reducing its appeal to the average user who may be served just fine by a cheaper iPad.",
    "Despite being eclipsed by the M1 silicon-powered iPad Pro 2021, the iPad Pro 2020, with its A12Z Bionic chipset, is still an eminently capable tablet. It has less RAM than the latest model (6GB, compared to 8GB or 16GB) and a lower storage ceiling (1TB, compared to 2TB), and its IPS LCD screen is less advanced than the mini LED-packing Super Retina XDR display on the 12.9-inch iPad Pro 2021, but you may be able to find last year’s top tablet at lower prices now.",
    "And you will want to score a sizable discount on the 2020 tablet, given how much more powerful the 2021 iPad Pro M1 is, at least going by benchmarks. That’s always possible, especially during deals events like the upcoming Amazon Prime Day; if not, for many the 2020 iPad Air can provide nearly the same performance at a lower price.",
    "The 12.9-inch iPad Pro has always been a big tablet, but this model feels especially massive. The squared-off edges and full-front glass cover even the bezels, making it a bit hard to hold without a case, and nigh impossible to manipulate one-handed. At 641g it’s not light, but its 5.9mm thickness makes it thinner than most iPhones, and it’s easy to slip in a backpack or knapsack – though at 215mm x 280mm (roughly the dimensions of 8.5-inch x 11-inch paper), it may be too big for small bags.",
    "This is a device that’s well-designed for watching movies, playing games and consuming media in general. Its 12.9-inch display (2732 x 2048 resolution) looks great, helped by a 120Hz refresh rate for super-smooth visuals, while the quad speakers produce impressive sound.",
    "The iPad Pro 2020 expands the camera suite from 2018's model: 12MP wide and 10MP ultra-wide rear cameras, along with a time-of-flight (ToF) LiDAR scanner to evaluate depth, video capture up to 4K at 60fps, and a 7MP front-facing camera for calls and selfies. It’s a good setup for a tablet, covering you for those increasingly ubiquitous video calls, while also able to capture serviceable photos or video in a pinch.",
    "The iPad Pro runs the latest iPadOS 14.5 software, forking off from iOS to provide tablet-specific features like mouse and keyboard support, app multitasking, and operating as an extra screen with the Sidecar feature. The A12Z Bionic chipset delivers speedy performance and its 6GB of RAM is enough to handle app multitasking, while storage options range from 128GB to 1TB. Its 9,720mAh battery is colossal, although it can drain speedily if you’re pushing the tablet hard at maximum brightness.",
    "All in all, the iPad Pro 2020 offers the ultimate tablet experience – or at least it did, until it was succeeded by the much-hyped iPad Pro 2021. While its successor brings several upgrades, the iPad Pro 2020 is still a powerful slate, serving as a portable productivity-focused middle ground between smartphone and tablet, performing some tasks of both but fully replacing neither, no matter what’s under the hood.",
    "Update: Apple has announced iPadOS 15, its 2021 iPad software update, with features like improved multitasking and widgets you can move about the menu. This upgrade will definitely be rolling out to the 2020 iPad Pro towards the end of 2021.",
    "The iPad Pro 2020 launched in March 2020, and the the 12.9-inch model started at $999 / £969 / AU$1,649 for 128GB of storage, rising up to $1499 / £1,469 / AU$2,499 for 1TB (all models have 6GB of RAM). For the cellular LTE model, that price rose to $1,149 / £1,149 / AU$1,899 for 128GB storage, or $1,649 / £1,619 / AU$2,749 for 1TB.",
    "The iPad Pro 2021 12.9-inch starts off even pricier, at $1,099 / £999 / AU$1,649 for the 128GB storage model, although that’s for 8GB RAM, and all models are packing the M1 chipset, as well as the Liquid Retina XDR mini-LED display.",
    "Apple no longer sells the iPad Pro 2020, but you can still get it from both online and bricks-and-mortar retailers – and now that the iPad Pro 2021 is on sale, it’s likely we’ll see some worthwhile discounts on the 2020 model appearing.",
    "The iPad Pro 2020 is a sleek, well-designed tablet that feels every bit as premium as its price would suggest. The larger 12.9-inch format makes it unwieldy in one hand compared to the smaller 11-inch version, but its big screen makes it an undeniably superior device for watching media.",
    "The iPad Pro 2020 inherits its design from its predecessor, the iPad Pro 2018, keeping that device’s flat edges and metallic finish. The 2018 model brought back the flat-edged look of the iPhone 4, and now the iPhone 12 line has adopted it as well – but it’s much more welcome in a tablet that’s not designed to be used one-handed (the sharp corners don’t dig in nearly as much when held in two hands).",
    "The front is entirely glass, and with such a big display, the half-inch bezels framing the screen look pretty small – and they’re certainly less obtrusive than the bezels on standard iPads.",
    "The iPad Pro 2020 is also noticeably thinner (5.9mm thick) than, say, the 10.2-inch iPad 2020 (7.5mm thick), so it feels more sleek than chunky. The metal back and sides, which feel like one seamless piece, have a matte finish that looks and feels premium, but doesn’t have much texture – don’t be surprised if your tablet slides around much like your gadgets with glossy surfaces.",
    "The back also houses the camera bump, in the top-left corner, and following iPad precedent, the cameras (12MP main and 10MP ultra-wide) look a little like they’ve been imported from the iPhones of the time, with the camera block appearing comically small on the expansive iPad Pro’s rear. Likewise, the lock and volume buttons – located on the right side of the top edge, and at the top of the right edge, respectively – are both the same size as on iPhones.",
    "The tablet also has quad speakers – two on the top edge, two on the bottom edge – that produce a good sound favoring lower, bass-heavy tones, and can fill a room at maximum volume. There’s also a conspicuous off-color patch in the middle of the right edge where you can magnetically attach (and charge) an Apple Pencil 2, a USB-C port on the bottom edge, and, on the LTE models, a SIM slot at the bottom of the right edge.",
    "One last note here: we used the 12.9-inch iPad Pro 2020 with the compatible Magic Keyboard, which we heartily recommend despite its hefty price tag. The larger model is unwieldy when held, and much tougher to brace than the smaller 11-inch version when typing using the on-screen touch keyboard, so we’d encourage owners to buy a case that props up the iPad Pro to use with an external keyboard – the Magic Keyboard or a cheaper third-party option – whenever possible.",
    "As we’ve mentioned, the 12.9-inch IPS LCD display is massive, covering almost the entire front of the tablet, save for the half-inch bezel that wraps all the way around it.",
    "The iPad Pro packs a bright, beautiful screen, and while its IPS LCD tech has been outpaced by the Liquid Retina display of its successor (which packs mini LED technology, with local dimming areas for greater light-and-dark contrast), the display you’re getting here is still impressive.",
    "Its near Quad HD (2732 x 2048) resolution is pretty dense, with greater detail than most phones and competing tablets. The 120Hz screen is another boon, although it’s probably something you’ll only notice while playing a game that supports such a high refresh rate or while browsing your social media feeds – iPadOS is already so fluid that you probably won’t notice it getting a lot smoother elsewhere.",
    "The screen brightness maxes out at 600 nits, which is fine for indoor use and acceptable outside, though it’s not quite bright enough in direct sunlight, where reflections and finger smudges are noticeable enough to be distracting (the display collects fingerprints like it’s a hobby).",
    "The iPad Pro 2020 packs a respectable camera setup for a tablet, but that shouldn’t be surprising – as we’ve mentioned, it appears to have inherited lenses and software from its iPhone counterparts.",
    "The 12MP f/1.8 main shooter takes good photos that benefit from the clarity and color correction Apple’s flagship phones are known for, while there’s also a 10MP f/2.4 ultra-wide camera for utility, along with a time-of-flight sensor for depth sensing, which is used to blur the background behind portrait photos as well as scan the environment for AR effects in apps. The tablet can also shoot 4K video at 60fps, as well as slow-mo at up to 1080p at 240fps.",
    "The 7MP front-facing camera, which is nestled in the bezel above the screen, is surprisingly adept for selfies. Portrait effects are understandably software-created, which means that ramping up the depth effects may result in some imprecise blurring around the outline of your subject.",
    "All in all, the iPad Pro 2020’s camera suite takes pretty good photos for a tablet, although understandably it’s a little awkward to shoot with such a large device.",
    "The iPad Pro 2020 represents the apex of Apple tablets running non-computing silicon. It’s (presumably) the last iPad Pro running designed-for-mobile chipsets that have been customized for tablets, with its A12Z Bionic chip building on the A12 Bionic that launched with the 2017 iPhone X.",
    "While it isn’t the M1 chipset that powers its successor, the A12Z Bionic is nothing to sneeze at, and teamed with 6GB of LPDDR4 RAM it ensures that the iPad Pro 2020 is capable of running apps and switching tasks without slowing down. In our tests, it achieved a Geekbench 5 benchmark score of 4720, which is far above its nearest competitor (and the top ranking on our best Android tablet list), the Samsung Galaxy Tab S7 Plus, which scored 2846 on the same test.",
    "The iPad Pro 2021, with its M1 chip and extra RAM, scored 7297, but the difference is only noticeable when you’re really pushing the tablet with performance-demanding software like Adobe’s photo- and video-editing apps.",
    "The 12.9-inch tablet comes in four storage tiers, which raise the price accordingly. Storage options run from 128GB – a new baseline that’s double the 64GB starting option on the iPad Pro 2018 – through 256GB and 512GB, and max out at 1TB (and no, you can’t expand it via microSD).",
    "The iPad Pro 2020 is compatible with iPadOS 14.5, the latest version of Apple’s tablet operating system, and the biggest update since iPadOS 14 in September 2020. iPadOS is a version of iOS tailored for tablets, with screen-splitting multi-app modes and more, and new features in the latest version include App Tracking Transparency, which forces apps to ask users for permission before collecting tracking data; new Siri voices; and most importantly for gamers, PS5 and Xbox Series X controller support.",
    "There are several neat accessories for the iPad Pro 2020, but a couple in particular stand out: the Apple Pencil 2 and the Magic Keyboard.",
    "The Apple Pencil 2 is Apple’s stylus of choice for pinpoint control. Obviously useful for visual art apps, the iPad Pro will adapt words written with the Pencil 2 to text, and has gesture controls to allow you to fluidly edit sentences while writing. It’s a wireless device, which magnetically attaches to the right edge of the iPad Pro to stay in place and charge up – it’s a much neater solution than its predecessor’s physical connector, which needed to be plugged into the iPad Pro’s Lightning port, and which jutted out while the Pencil charged up. The Apple Pencil 2 is pricier than the original though, at $129 / £119 / AU$199 – and it’s not included with the tablet.",
    "If you just want a simple keyboard to use with your iPad, you can pick up Apple’s Smart Keyboard Folio ($199 / £199 / AU$299 for the 12.9-inch iPad Pro 2020), which folds up into a case. However, if you want a more rigid platform to type on, the Magic Keyboard is the ultimate productivity accessory, with backlit keys, a trackpad, and a firm-yet-flexible cover that allows you to tilt the screen to your preferred angle.",
    "We wrote a good chunk of this review using a Magic Keyboard, and we can’t imagine using the iPad Pro without it – but the accessory is very pricey, at $350 / £329 / AU$549.",
    "And yes, you can use your 12.9-inch iPad Pro 2020 Magic Keyboard with an iPad Pro 2021 should you upgrade at a later date, but since the latter tablet is 0.5mm thicker, the fit won’t be as snug when the cover is folded up.",
    "The iPad Pro 2020 12.9-inch has a truly massive 9,720mAh battery, and in our experience it offered respectable endurance, lasting around 10 hours 16 minutes in our battery tests, so expect your tablet to last that long with casual use (browsing the internet, using apps, a bit of YouTube here and there).",
    "The battery can drain a lot faster if you’re performing demanding tasks, like playing games or editing photos and videos, or just watching media. Even keeping the brightness up can burn through the battery faster, as can running accessories dependent on the iPad Pro’s power, like the Magic Keyboard – we sat outside typing away one sunny afternoon with the brightness maxed out, and the battery plummeted 15% in an hour, a rate that would see the runtime reduced from over 10 hours to well under seven.",
    "That colossal battery takes a while to recharge, especially using the 18W USB-C charger that’s included in the box – it’s not the fastest recharging rate we’ve seen. Using said charger juiced up the tablet to 40% in an hour, which is about right – a smartphone with half the capacity would be fully recharged from zero over the same period.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "iPad Pro 2020 price and release date",
    "12": "Design",
    "19": "Display",
    "23": "Cameras",
    "27": "Specs and performance",
    "32": "Accessories",
    "37": "Battery life",
    "40": "Don’t buy it if…"
  },
  "links": {
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPadOS 14.5": "https://www.techradar.com/news/ipados-145",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15",
    "iPad Pro 2018": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "iPhone 4": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-4-694980/review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Apple Pencil 2": "https://www.techradar.com/how-to/apple-pencil-on-ipad-our-full-guide-on-how-to-use-it",
    "Samsung Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "snug": "https://www.techradar.com/news/new-129-inch-ipad-pro-is-05mm-thicker-so-youll-need-a-new-keyboard"
  }
}