{
  "source": "https://www.techradar.com/reviews/msi-ge76-raider",
  "title": "MSI GE76 Raider review",
  "category": "computing",
  "updated": "2021-11-11T18:14:48Z",
  "author": "bill-thomas",
  "summary": "A thick powerhouse of a gaming laptop",
  "verdict": "The MSI GE76 Raider is powerful, packed with the best laptop hardware you can get right now. However, it’s extremely expensive, and it’s heavy enough that you’re not going to want to commute with it.",
  "pros": [
    "Extremely powerful",
    "Tons of RGB",
    "Fast display"
  ],
  "cons": [
    "Expensive",
    "Heavy"
  ],
  "article": [
    "Gaming laptops like the MSI GE76 Raider seem like a dying breed. The big, thick gaming behemoths that are all about pushing the best performance possible at the cost of everything else are being replaced more and more by thin and light gaming devices – especially at the high end. And, really, it makes sense. Why go for a gaming laptop you can barely carry around when the best gaming PCs are also getting small enough for folks that don’t have space for a giant tower?",
    "However, there is something to be said about a gaming device that is portable enough to bring over to a friend’s house, without being so thin that it heats up to unbearable levels and can’t be upgraded nearly as much over time. So, the real question is – does the MSI GE76 Raider have a place in 2021?",
    "This is a gaming laptop that’s going to set you back a whopping $2,899 (about £2,110, AU$3,810) for the model reviewed here, packed with an RTX 3080 and a 10th-generation Core i7 processor. That’s a lot to ask, especially when you can get a Razer Blade 15 for the same price with the same specs – albeit with a slightly slower 240Hz display.",
    "However because of the ample space this laptop has for cooling, you’re going to get better performance for your money, and when you’re powering a 300Hz display, you want as many frames as you can get out of your GPU.",
    "The MSI GE76 Raider launched in March 2021, and starts at $1,499 (about £1,090, AU$1,970). For that, you’re getting an Intel Core i7-10750H, 16GB of RAM, and an Nvidia GeForce RTX 3060. However, for a laptop this beefy, you’re going to want a bit more power under the hood.",
    "You can crank up your GPU to an RTX 3070 with 32GB of RAM for $1,999 (about £1,460, AU$2,630), and that is probably the sweet spot for this particular laptop. We wish there was a configuration available that had the RTX 3070 and just 16GB of RAM – 32GB is overkill for most people – but it’s not like the extra RAM hinders anything, just makes it more expensive.",
    "If you want the all-out configuration listed to the right, however, you’re looking at a steep price tag of $2,899 (about £2,110, AU$3,810). This probably isn’t the most efficient way to spend your money, but you will get truly top-notch performance for that wallet-busting price tag.",
    "But while it seems expensive, it’s actually a reasonable price all around, and falls in line with what we see from most of the best gaming laptops out there. So, if you value performance more than carrying around your gaming laptop in your backpack, you could do a lot worse.",
    "The GE76 Raider is the heir to the GE66 Raider.",
    "Where a lot of recent gaming laptops have started to just look like any other laptop, the MSI GE76 Raider is a very gaming gaming laptop. Clad entirely in aluminum, with angular design flourishes and a Titanium Blue colorway that looks more gray than blue, this is a laptop you know someone will cover in cheesy Call of Duty stickers.",
    "And while that is definitely something that is going to turn a lot of people off (honestly, us included), there is definitely a ton of people that still value that kind of aesthetic. We’re just grateful that it feels so solid.",
    "The MSI GE76 Raider, with its all-aluminum build, feels like you could drop it off of your desk, and you’d be more worried about the floor than the laptop. There is a bit of flex, particularly above the keyboard and below the screen, but it doesn’t feel like it would, like, break or anything.",
    "MSI also partnered with Steelseries for the keyboard, which it has done for the last few years, and it results in one of the most responsive and comfortable gaming laptop keyboards we’ve used in a while. It’s not obnoxiously clicky like some gaming mechanical boards, but it has plenty of travel, and doesn’t feel like you’re punching a rock when you bottom out. This makes it both a dream for playing PC games without investing in one of the best gaming keyboards, and good enough for typing that you won’t feel the need to get an Ultrabook for school or work.",
    "There’s also a full numpad here, though it is a bit on the smaller side. Still, while we’d like to have it be a bit bigger, it’s better than not having a numpad at all, especially on a laptop of its size.",
    "Shrinking things down a bit did allow MSI to put top-mounted speakers on either side of the keyboard, which just makes everything better. They aren’t the best speakers in the world, but they get loud enough to fill a room and actually have a bass response that doesn’t sound like someone hitting a loaf of wet bread. Listening to 100 gecs’ “ringtone”, both the playful synthesizer and the sporadic beat sound clear and impactful. And if the MSI GE76 Raider speakers can handle the song of our generation, they can handle anything.",
    "The laptop is also completely bedecked in RGB lighting. The keyboard obviously lights up in rainbow colors – that’s to be expected on any premium gaming laptop in 2021 – but there’s even more RGB below the trackpad. There’s a giant RGB light bar below the trackpad with 30 lighting zones, which means you’re able to come up with all kinds of fun color combinations. You customize both the bar and the light through the SteelSeries Engine 3 software, which is both expansive and a little frustrating.",
    "You see, sometimes, even despite the sheer power that this laptop has on offer, the software can just lock up for a few seconds, which is especially frustrating when you’re in the middle of creating a new lighting profile – which is exactly what happened to us.",
    "The RGB light bar can look a bit garish, especially if you aren’t into the “light up everything” trend in PC gaming, but luckily it’s easy enough to turn off if you don’t want attention.",
    "Thanks in large part to the metal construction and the scope of the laptop, though, it’s a little on the hefty side. The MSI GE76 Raider weighs in at a whopping 6.3 lb (2.9Kg) and is 1.02 inches thick. So, while it would have been considered a thin and light gaming laptop about a year ago, it is rather bulky when compared to the Razer Blades and Asus ROG Zephyrus laptops out there.",
    "But that added bulk allows for a ton of ports. On the right side of the laptop, you get two USB-A ports and a full-sized SD card reader. Then, over on the left, you get a combo 3.5mm audio jack, another USB-A and a USB-C. That’s not all, though, there are surprise ports hiding on the back of the laptop. That’s where you’ll find a dedicated charger port – and the charger is super beefy – along with LAN, a mini DisplayPort, HDMI and another USB-C port. Pretty much no matter what you want to connect to this laptop, you won’t have to live the dongle life to do it.",
    "And then finally we have to talk about the display, and it is fast. The MSI GE76 Raider is equipped with a 17-inch 1080p display with a blazing 300Hz refresh rate on the model reviewed here. But even the entry-level model comes with a 144Hz display, so you’re still getting something esports-worthy no matter what level you come in at.",
    "However, with that speed comes a bit of a concession in color and brightness. The display only manages to average around 275 nits of brightness, and only hits 76% of the sRGB color spectrum. That’s not the worst, but if you’re looking to use that RTX 3080 to really get immersed in Cyberpunk 2077 in all of its ray traced glory, it leaves a little bit to be desired.",
    "The MSI GE76 Raider, packed with an Intel Core i7-10870H and an Nvidia GeForce RTX 3080, is an absolute powerhouse of a gaming laptop. No matter what game you throw at this thing, you’re going to be able to max it out at a high framerate – especially if you’re sticking to the 1080p display that’s built in.",
    "We’re able to get Metro Exodus running at 80 fps on Ultra settings, which means there’s more than enough headroom there to enable ray tracing in that game, without turning it into a slideshow.",
    "We’re playing a lot of Final Fantasy XII these days, and this laptop basically sleeps through that game, easily delivering a high refresh rate without having to work especially hard.",
    "The MSI GE76 Raider would also work exceptionally well as a mobile workstation, thanks to the huge amount of RAM and the exceptional CPU performance on offer. The laptop scores a whopping 9,500 points in Cinebench R23, which makes it one of the fastest laptops we’ve tested to date.",
    "You should be able to get extremely solid video editing performance out of it, too, thanks to the mobile RTX 3080, and the fact that you can enable CUDA rendering in Premiere, and use the NVENC encoder when you’re exporting the video.",
    "It used to be that when you got a big, thick gaming laptop like the MSI GE76 Raider, it would die within an hour or two – but that’s not the case here.",
    "To be clear, this doesn’t mean that you’re going to be able to carry this laptop around all day and use it without a charger, but it’s still enough to get you through a couple hours of work. In the PCMark 10 battery test, the laptop lasts 5 hours and 31 minutes. Not Ultrabook-worthy, but still long enough to get you through a short flight.",
    "And, we get a similar result in our video playback test, where the laptop lasts about 5 hours and 58 minutes. Not world-shaking, but enough to get you through a minor Netflix binge.",
    "This probably isn’t going to be much of a surprise, but the MSI GE76 Raider is packed with a load of MSI software, though it’s luckily not super intrusive. While you'll have some programs in your start menu like the MSI True Color and Nahimic, the program you’ll primarily use to manage the laptop is the MSI Dragon Center software.",
    "Through this, you’ll be able to keep an eye on temperatures and system usage, though the UI is a little less than totally intuitive. You can also navigate over to the General Settings tab and swap between a few performance presets. Just like all software of this type, the pre-configured presets range from a silent mode to one labeled “Extreme Performance” that turns all the fans to full speed and sounds like a jet engine.",
    "There’s also an option to create a custom performance profile, but really there’s not much you can truly customize.",
    "MSI has also included the SteelSeries Engine 3 software to handle cosmetic customization. This is great! While the software does slow down occasionally, it makes so much more sense than Dragon Center. Though, we do wish it was a bit more clear that Dragon Center can’t control the RGB lighting, as we spent like an hour clicking through all the tabs over and over again, sure that we had missed the lighting options somehow."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and availability",
    "9": "Design",
    "22": "Performance",
    "27": "Battery life",
    "30": "Software and features",
    "34": "Don’t buy it if…"
  },
  "links": {
    "Gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "best gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Razer Blade 15": "https://www.techradar.com/reviews/razer-blade-15-2020",
    "Nvidia GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "GE66 Raider": "https://www.techradar.com/reviews/msi-ge66-raider",
    "best gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "Ultrabook": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "100 gecs’ “ringtone”": "https://www.youtube.com/watch?v=OmX4UPiVS-w"
  }
}