{
  "source": "https://www.techradar.com/reviews/polar-grit-x-pro",
  "title": "Polar Grit X Pro review",
  "category": "fitness",
  "updated": "2021-12-03T12:55:11Z",
  "author": "michael-sawh",
  "summary": "This is the outdoor watch the Grit X should’ve been.",
  "verdict": "The Polar Grit X Pro is a better outdoor watch than the first Grit X, and added features from the Vantage V2 means it’s a better training partner too. The boost in durability and those software extras come at a bigger price than its predecessor, and some of the new Pro features are coming to the first Grit X too. If you want the best outdoor watch that Polar has to offer though, this is the one you want on your wrist.",
  "pros": [
    "Improved navigation features",
    "Nicer bezel look",
    "Rich sports tracking and training analysis"
  ],
  "cons": [
    "No TOPO maps",
    "Price jump from original Grit X",
    "Still laggy touchscreen"
  ],
  "article": [
    "The Grit X Pro showcases the best that Polar has to offer in terms of sports tracking and rich data analysis – and adding more navigation features means it’s a better outdoor watch too.",
    "The big question is whether it's enough of an upgrade on the original Grit X. Are the new navigation skills, extra performance and recovery tests from the Vantage V2, and a sleeker, more durable design enough to warrant the extra spend over its predecessor – especially as some of those new features are going to make it to the Grit X as well?",
    "There’s no doubt that it’s a solid performer, and if you’re a runner, swimmer, or someone who prefers hikes over gym time, you’re well served here. You’re getting a pretty reliable heart rate monitor, with the option to pair up external sensors for more accurate data. There's very good GPS tracking performance too and while it lacks the richer mapping you’ll find on Garmin’s Fenix 6 Pro, the Grit X Pro is still a watch that will help you find your way back home when you’re done with your exploring.",
    "Battery life isn’t class-leading, and Polar’s rich sleep tracking still has a noticeable drain on that stamina too. Smartwatch features are growing too, but this is still very much a sports watch first and smartwatch second.",
    "If you really don’t get on with Garmin or Coros platforms and hardware and like the idea of a good-looking, smaller outdoor watch, then the Grit X Pro will appeal.",
    "The Polar Grit X Pro launched in October 2021 and is available to buy now directly from Polar and third-party retailers priced at $499/£439 (about AU$700). There’s also a Polar Grit X Pro Titan edition that comes in more at £599.95/£519 (about AU$830).",
    "The Grit X Pro packs a 47mm stainless steel case that's 13mm thick, and is matched up with a 22mm fluoroelastomer strap that comes in small and large sizes to make sure you get a good, snug fit. You can grab that case in black, gold and copper colorways, and the whole watch weighs 79g when you factor in the band.",
    "The key changes here from the original Grit X is the new-look bezel, which Polar says includes deco detailing, and adds numbers and compass icons to make things feel a bit more outdoorsy in appearance. It’s still a watch that’s waterproof up to 100 meters, and has been tested to MIL-STD810G military standards to ensure it’s built for rugged use and now Polar has added in a sapphire glass lens to better protect the screen from scratches.",
    "That screen is a 1.2-inch, 240 x 240 resolution always-on colour transflective display. That’s exactly the same size and resolution as the original Grit X, which means it holds up well in bright outdoor light, and support taps and swipes. It can be unresponsive and sluggish though, so the physical buttons dotted around the edge feel like the better way to interact with the watch software.",
    "Along with the original Grit X and the Grit X Pro, Polar also offers a Grit X Titan model, which swaps the stainless steel bezel on the Pro and original Grit for a titanium one that brings the overall weight down considerably. You will have to pay over $80/£80 more if you want that version, though.",
    "The best way to think of the Grit X in general is a more outdoor-centric version of Polar’s top end Vantage V2 watch. It’s still equipped with a bountiful amount of sports modes and stats, and has the sensors to reliably track your performance too.",
    "You’re getting satellite support for GPS, Glonass, Galileo and QZSS systems, and assisted-GNSS support, which is intended to help get a quicker fix on those satellites. After a couple of laggy lock-ons in our early runs, it lived up to that promise in the rest of our testing.",
    "You can store up to 20 sports profiles at one time on the watch, but there are 130 profiles in total to choose from in the Polar app, so you can pick the ones you expect to use most frequently. Core activities like running, cycling and swimming (pool and open water) are covered here, with staple metrics and extras like power for runners without the need for an additional sensor.",
    "More niche pursuits and indoor activities are covered too, but you’ll just get the basic metrics of duration and heart rate for those.",
    "There's a barometric altimeter and a magnetometer-based compass for that extra hit of outdoor data, and you have the ability to pair up Bluetooth Low Energy heart rate monitors and cycling sensors. We had no problems pairing up Polar’s own H10 chest strap monitor or Garmin’s HRM-Pro to get that more accurate heart rate data.",
    "The Grit X Pro uses the same Precision Prime heart rate sensor technology as the first Grit X to continuously track heart rate, and power features like working in heart rate zones, determining energy sources used during workouts, and features like Training Load and Recovery Pro insights.",
    "The performance of that heart rate sensor is similar to what Polar delivered with the Grit X. It’s a sensor that’s a solid performer for most workouts, though increasing the intensity saw more inaccuracies creep in with both average and maximum heart rate readings.",
    "A lot of the big training insights on the Grit X are driven by heart rate, so we’d suggest throwing on an external heart rate monitor chest strap or armband to make sure those are actually useful.",
    "Two of the best features introduced on Polar’s watches recently made it onto the Grit X Pro too. The first is FitSpark recommended workouts, which looks at your training history, recovery needs, and fitness level to suggest workouts built around building cardio fitness, strength or working on core and mobility.",
    "For outdoor lovers and endurance athletes, FuelWise fueling reminders and the ability to make sure you’re taking on enough carbs for your chosen distance or target workout intensity is a feature that helps Polar stand out from the crowd.",
    "As a watch built for the outdoors, the Grit X Pro supports the ability to upload routes to Polar Flow via the third party app Komoot offering turn-by-turn guidance. You can also follow routes you’ve recorded on your Polar previously and import routes as TCX and GPX files.",
    "Polar has now added a 'back to the start' mode as well, which (as the name suggests) helps get you back to where you started tracking. It essentially involves following a green line back and will turn red if you veer off course. You won’t see rich, detailed maps and scenery on your watch. It’s just simple lines pointing you in the right direction, but it is at least easy to follow.",
    "Polar has also added the ability to view route and elevation profiles, which weren't available on the Grit X.",
    "On top of that smattering of added outdoor features, Polar is adding the leg recovery test and running and cycling performance tests that debuted on its Vantage V2 watch. Ultimately, these tests aim to give you a better sense of your fitness level for those sports, but also use jumping tests to assess whether your body is really ready to take on a high intensity training session.",
    "Elsewhere, Polar is still including its 24/7 activity tracking, which includes continuously monitoring heart rate. It can still also monitor sleep including its nightly recharge insights to better assess recovery from a tough workout day. It looks at sleep and your autonomic nervous system to generate that recovery data.",
    "That data lives in a separate section in the Polar Flow app, and along with reliable core sleep tracking stats that recharge data does feel like a useful piece of data to have at your disposal once you get to grips with what it all means.",
    "Polar offers some smartwatch extras here too, so you can view notifications from Android phones and iPhones but can’t act on them. You can use music controls in and outside of tracking a workout and it retains features like viewing detailed weather forecasts.",
    "The Grit X Pro brings richer watch faces to show off data like sunrise and sunset times and location coordinates, too. It’s still a more scaled back smartwatch experience compared to what you get on Garmin’s Fenix, but does still offer more than what you’ll find on the Coros Vertix 2 outdoor watch.",
    "The Grit X Pro promises a pretty impressive 40 hours of tracking time when putting the onboard GPS and heart rate monitoring to good use. You can also switch to a power saving mode, which lets you adjust the GPS recording rate to one or two minutes, turn off heart rate monitoring and bring the screen saver to play. That boosts training time to 100 hours.",
    "When you’re using it for 24/7 activity tracking and taking advantage of continuous heart rate monitoring, you can expect the battery to be hit around the seven-day mark.",
    "We’d say, based on our testing both for training and using the Grit X Pro day-to-day, that those numbers almost ring true. We were usually grabbing the same charger used on the Grit X after around five or six days. With GPS in use, an hour’s worth of running saw the battery drop by a maximum of 3%.",
    "Ultimately, you’re getting the same sort of battery life that the Grit X served up. It’s not the best battery life you can find on an outdoor watch, but there’s plenty to play with if you’re training and tracking on a regular basis."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Polar Grit X Pro Price and release date",
    "6": "Polar Grit X Pro design and display",
    "10": "Polar Grit X Pro sports tracking",
    "28": "Polar Grit X Pro battery life",
    "32": "Don't buy it if"
  },
  "links": {
    "Grit X": "https://www.techradar.com/reviews/polar-grit-x",
    "Vantage V2": "https://www.techradar.com/reviews/polar-vantage-v2",
    "heart rate monitor": "https://www.techradar.com/best/best-heart-rate-monitor",
    "Garmin’s Fenix 6 Pro": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "Garmin’s HRM-Pro": "https://www.techradar.com/reviews/garmin-hrm-pro",
    "Coros Vertix 2": "https://www.techradar.com/reviews/coros-vertix-2"
  }
}