{
  "source": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-2-review",
  "title": "Sennheiser Momentum True Wireless 2 review",
  "category": "audio-visual",
  "updated": "2021-07-15T14:53:28Z",
  "author": "olivia-tambini",
  "summary": "Sennheiser smashes it out of the park",
  "verdict": "The sound quality, battery life, and design of the Sennheiser Momentum True Wireless 2 are nothing short of excellent, and we would wholeheartedly recommend them to anyone looking for an alternative to the Sony WF-1000XM3. Those with smaller ears may find them a little uncomfortable, however, and their high price stops them from taking the top spot of the best true wireless earbuds of 2020.",
  "pros": [
    "Incredible sound",
    "Sleek design",
    "Support for Hi-Res Audio"
  ],
  "cons": [
    "May be uncomfortable for smaller ears",
    "More expensive than rivals"
  ],
  "article": [
    "The Sennheiser Momentum True Wireless 2 are among the best-sounding true wireless earbuds you can currently buy, beating the likes of the Apple AirPods by miles in terms of sound quality and battery life.",
    "The German audio brand has long been a trusted name in the world of over-ear headphones, and since the release of the popular Momentum True Wireless last year, the world of true wireless earbuds, too.",
    "Now Sennheiser has furnished its popular earbuds with noise cancelation, in a similar vein to the AirPods Pro and the Sony WF-1000XM3, as well as improved battery life, and a more compact design.",
    "The Sennheiser Momentum True Wireless 2 cost $299 / £279 / AU$499.95, making them considerably more expensive than our current top true wireless earbuds, the Sony WF-1000XM3, which cost $230 / £220 / AU$400.",
    "It’s the same price that their predecessors launched at last year – if you’re looking to save money, it may be worth checking out the first-gen Momentum True Wireless earbuds, as you can usually find them at a discount.",
    "If you have reservations about parting with so much cash for a pair of earbuds, spending a little time with the Sennheiser Momentum True Wireless 2 should convince you that these buds are very well-made, with the luxurious finish you’d expect at this price.",
    "The new true wireless earbuds look pretty similar to the originals, with shiny metallic touch-sensitive housings, and a rounded shape. The Sennheiser Momentum True Wireless 2 look really sleek and their silver finish looks slick and stylish, without being overly ostentatious. Even the inside of these buds looks good, with gold-plated charging pins and LEDs that indicate their pairing status.",
    "The charging case is similarly sophisticated, with a gray woven finish; on the back you’ll find a USB-C charging port, and a small button that you can press to see how much battery the case has via a little LED that glows red, orange, or green.",
    "Sennheiser says that the Momentum True Wireless 2 are 2mm smaller than the originals – and with three extra eartips in the box, you should be able to find a secure fit.",
    "However, if your ears are on the smaller side (like ours), you may find that the circular housings feel a little uncomfortable; after a longer listening session our ears felt quite sore.",
    "We don’t think this is a problem that all users will encounter, but it’s worth bearing in mind, that if you have small ears, you may find these buds too large to use comfortably.",
    "If you do find the fit to be comfortable, you should be able to use the IPX4-rated Sennheiser Momentum True Wireless 2 as running earbuds, as they can resist a little sweat or a few drops of rain.",
    "The touch-sensitive housings allow you to answer or reject phone calls, adjust your music playback, and summon your device’s voice assistant. We found the controls worked really well, and if you wish, you can assign different functions to the controls via the Sennheiser Smart Control app. There’s also a nifty auto-pause feature that stops your music whenever you remove the buds from your ears – handy if you’re in a rush.",
    "These controls also allow you to toggle the noise cancelation on and off, with a transparency mode that allows environmental sound to pass through the buds – useful if you're using these earbuds to work out and want to be aware of your surroundings.",
    "These buds boast a much longer battery life than their predecessors, with seven hours from the buds themselves, and a further 21 hours from the charging case. That's up from four hours in the earbuds, and eight from the charging case, putting them on a par with the best true wireless earbuds of 2020.",
    "Pairing them with our smartphone was a breeze, thanks to support for the latest wireless streaming standard, Bluetooth 5.1 – and with support for Qualcomm's aptX codec, you can stream Hi-Res Audio over Bluetooth with no issues..",
    "Like their predecessors, the Momentum True Wireless 2 are packing 7mm dynamic drivers, which Sennheiser says will create \"outstanding stereo sound, with deep bass, natural mids, and clear, detailed treble.\"",
    "Listening to SBTRKT’s Wildfire ft Little Dragon, the Momentum True Wireless 2 masterfully navigated tight synth bass, clear, smooth vocals, and textured highs that sounded punchy without being overly harsh.",
    "As we moved on to Kelela’s Rewind, we were amazed by how gutsy the lowest frequencies felt, with a chest thumping intensity that we wouldn’t normally expect from true wireless earbuds.",
    "That’s not to say that the mid and treble frequencies were neglected, as chattering hi-hats and lush RnB vocals swelled and bloomed throughout the track.",
    "A wide soundstage and plenty of crisp detail makes the Sennheiser Momentum True Wireless 2 a worthy rival for the Sony WF-1000XM3 – although we wouldn’t say they sound quite as tightly controlled as the latter.",
    "Noise-cancelling too, isn’t quite on par with Sony’s buds. We found that, while they block out some environmental noise, a fair amount was able to leak through – turn your music on though, and the rest of the world will melt away.",
    "The sound quality, battery life, and design of the Sennheiser Momentum True Wireless 2 are nothing short of excellent, and we would wholeheartedly recommend them to anyone looking for an alternative to the Sony WF-1000XM3 – the differences really are negligible.",
    "We’d hesitate to recommend these buds is if your ears are on the smaller side – in any case, make sure the vendor you choose allows for returns where the product is not faulty. (Sennheiser, for example, does not allow this if you deal with the company directly.)",
    "Otherwise, though, these true wireless earbuds should make a fantastic purchase for anyone looking to cut the cord, with enough sonic authority to keep even the staunchest audiophile happy."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "14": "Battery life and connectivity",
    "16": "Audio quality",
    "22": "Final verdict"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Momentum True Wireless": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "running earbuds": "https://www.techradar.com/best/best-running-headphones",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}