{
  "source": "https://www.techradar.com/reviews/microsoft-family-safety-parental-control-software",
  "title": "Microsoft Family Safety parental control software review",
  "category": "computing",
  "updated": "2021-06-30T07:31:24.460Z",
  "author": "mike-williams",
  "summary": "A free parental control app for Microsoft's ecosystem (but iOS and Android users get to play, too)",
  "verdict": "Microsoft Family Safety doesn't do much to protect your kids, especially on mobile devices, but it just scrapes three stars by giving you Microsoft App Store controls you won't see elsewhere, and location tracking for Android and iOS phones - not bad for a free app.",
  "pros": [
    "Simple Android, iOS location tracking",
    "Runs on Android, iOS, Xbox, Windows",
    "Flexible screen time limits for Xbox, Windows",
    "Controls access to Microsoft Store"
  ],
  "cons": [
    "Web filtering supports Edge only",
    "Safe Search enforced on Bing only",
    "Windows app blocking supports Store apps only",
    "Limited iOS app"
  ],
  "article": [
    "Microsoft Family Safety is the company's latest shot at parental control success, a simple Android and iOS app which uses a bunch of tricks and techniques to monitor and protect your kids.",
    "Family Safety restricts screen time on Windows and Xbox, and limits app and game usage on Windows, apps and Android.",
    "Multiple filtering layers block inappropriate web content in apps, games and Microsoft Edge (not Chrome, though, or any other browser.)",
    "Location support places your child's current (Android and iOS) device position on a map. Unlike most parental control apps, this isn't purely about keep an eye on them. Family Safety calls the feature 'location sharing', and parents are also free to share their location with the rest of the family.",
    "Sign up for a Microsoft account, if you don't have one already, and all this is available for free. It's a decent set of features for zero cost, especially with location sharing thrown in. (Qustodio and Kaspersky Safe Kids dropped location features in the free versions of their apps, although you can get a basic map tool in Google Family Link.)",
    "Spend $10 a month on a Microsoft 365 Office Family account, though, and along with the regular benefits (Office 365 desktop applications, 1TB OneDrive storage), you also get a couple of location-based extras.",
    "Geofencing support enables creating custom zones (home, work, grandma's, you get the idea) and receiving alerts when family members arrive or leave.",
    "The really unusual touch is a Driver Safety feature which records your family member's latest journeys on a map, and logs 'how many times the driver uses their phone, their top speed, and even the number of times they brake hard.' (Beware, this is only available in United States, United Kingdom, Australia, and Canada.)",
    "If you might be interested in Office 365 Family, for Driver Safety or just to get the Office apps, there's a 30-day free trial available.",
    "We grabbed Microsoft Family Safety for our Android device, and began a simple installation process. This didn't involve much low-level Android work - it only asked for a single permission (Location), for instance - and the app was up and running in barely a minute.",
    "App setup starts by building a family group. Enter an email address for each family member, give them a role (Organizers can manage settings, Members mostly do as they're told), tap the Invite button and Family Safety sends an invitation.",
    "Next, Microsoft prompts your family member to create a Microsoft account and install Family Safety on their device.",
    "This isn't an app which automatically allows parents to do whatever they like, and the profiles for older children may not allow you to limit their app usage, for instance. (If this is a young child and the monitor settings are still greyed out, check the child's birth date in their Microsoft profile. If they set this to make themselves appear older, that restricts what you're able to do.)",
    "Family Safety supports limiting device use by time and schedule. You could have a 5-hour overall limit, for instance, but only permit this within one or more ranges of times: 07:00 to 22:00, say, or 08:00 to 12:00, 13:30 to 18:00 and 19:30 to 21:30.",
    "Device time limits work in one-hour increments, and schedules use 30 minutes, which might not always be convenient. (Net Nanny limits just use any whole number of minutes, so if you'd like to set a 247-minute limit today, 195 tomorrow, that's not a problem.)",
    "Family Link assigns schedules by device type (Xbox consoles or Windows 10 devices) rather than individual devices, unusually. It's smart enough to count usage of any device towards your daily limit, which is good. But you can't set different schedules for separate Windows 10 systems, maybe to limit use of a Windows 10 desktop used for gaming, while allowing more hours for a school laptop.",
    "Microsoft Family Safety has a simple option to restrict Android, Windows and Xbox app and game usage by age (3-20.) Just head off to the Apps and Games area of the Content Filters section, choose the rating you need, and you're done.",
    "Family Safety offers a much wider choice of app time restrictions. You can set an overall time limit ('use this app up to two hours a day...'), a schedule ('...between 19:00 and 21:00...') and even change the rules at the weekends ('...and up to 22:00 on Saturday and Sunday.')",
    "These blocks and limits apply to Windows Store apps, not standard Windows applications, and that makes them easy to bypass, less suitable for older children to install on their own device. But they may help create a safer Windows environment for a young child, and the Xbox and Android controls have some value.",
    "If you do make use of the Windows store, though, Family Safety has more tools to help. You can prevent your child installing new apps unless you approve them, for instance. Or just add money to their Microsoft account, and leave them to go shopping. (Set a maximum age rating, as we mentioned above, and the Store won't allow them to browse anything unsuitable.)",
    "Family Safety has basic web content filtering, too, but, well, there's a catch. It's even more limited and Microsoft-centric than the app controls (and no, we're not kidding.)",
    "The core feature is an option to automatically block inappropriate content in Edge, and enforce Safe Search (built-in filtering to block dubious sites) at Bing. Bonus tools allow you to build website blacklists and whitelists, and Family Safety tries to block a stack of popular browsers to prevent your kids finding a way around the system (Chrome, Opera, Firefox, Brave, Tor - 25 in total, as we write.)",
    "That's better than nothing - just about - but even the free competition typically does a lot more. Kaspersky Safe Kids blocks sites by your choice of category (Adult, Drugs, Violence and others), for instance, and supports Safe Search at Bing, Google, Yahoo!, Yandex and YouTube.",
    "Microsoft Family Safety's location sharing features require a little setup, though nothing unexpected. You must explicitly turn on location sharing in the app settings, and enable the Android and iOS location permissions for Family Safety before it starts to work.",
    "Technical details sorted, Family Safety displays your child's location both within the app and in the web dashboard. And assuming you've also enabled location sharing, they can see you, too. That's unusual in the parental control world, but it's certainly fair, and that might create a better impression with your child. If it's parents watching kids, that could seem like spying; if it's every family member sharing their location with each other, that feels more like a feature which benefits everyone.",
    "Pay for Microsoft Office 365 Family and simple geofencing support enables creating common locations (home, school, work) and getting alerts when family members arrive or leave.",
    "We're reviewing the free app, not Office 365 Family, and so didn't test this, but the basics look good. Enter an address, give it a name, choose the size of a zone (Small/ Medium/ Large), and it's set up. We'd like a little more flexibility - ESET Parental Control can set a location by tapping the map, and set a zone to a specific size between 100-500m - but it's certainly easy to use.",
    "Family Safety gives far more control over location alerts. If this is a school location, for instance, you can choose the one or more children who go there; opt for alerts when they arrive there, leave, or both; and decide to get these alerts every time, or just once (a better choice for one-off events, like going to a party.) It's a handy set of options, and more than we've seen with other parental control apps.",
    "Driver Safety, probably the most interesting Family Safety Premium feature, takes this to a whole new level. Turn this on and Family Safety not only tracks your location, it also analyses your driving, logs journeys, and keeps a two-week history.",
    "We didn't test this either, not least because it deserves an entire review all by itself. But the logs try to capture lots of detail, including the journey route, top speed, moments of fast acceleration or hard braking. It even tries to detect phone use by checking 'if the phone moves around like someone’s touching it and for how long.'",
    "This is a useful way to keep an eye on the new drivers in your family, but it could help anyone check their driving, parents too. Whoever might benefit in your family, it's a welcome and unusual extra, and a definite plus for Family Safety's premium edition.",
    "It's horribly basic in many ways, but if your family spends more time in the Microsoft Store than the Google Play Store, Microsoft Family Safety gives you some useful controls and options. The ability to track Android and iOS locations is welcome, too, and unusual for a free parental control app."
  ],
  "headers": {
    "9": "Getting started",
    "13": "Time limits",
    "16": "App management",
    "20": "Web filtering",
    "23": "Location sharing",
    "28": "Driver Safety",
    "31": "Final verdict"
  },
  "links": {
    "Microsoft Family Safety": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9188686743542875000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Ffamily-safety",
    "parental control": "https://www.techradar.com/best/parental-control",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Qustodio": "https://www.techradar.com/reviews/qustodio-parental-control-software",
    "Kaspersky Safe Kids": "https://www.techradar.com/reviews/kaspersky-safe-kids-parental-control-software",
    "browsers": "https://www.techradar.com/best/browser",
    "ESET Parental Control": "https://www.techradar.com/reviews/eset-parental-control-for-android"
  }
}