{
  "source": "https://www.techradar.com/reviews/safeincloud",
  "title": "SafeInCloud password manager review",
  "category": "computing",
  "updated": "2021-03-22T22:53:48Z",
  "author": "daniel-blechynden",
  "summary": "A competitively-priced password manager",
  "verdict": "SafeInCloud password manager certainly isn’t the most advanced program available, but it's simple, intuitive, and does what it needs to.",
  "pros": [
    "Very easy to use",
    "Competitively priced"
  ],
  "cons": [
    "Lacks advanced features",
    "Limited customer support"
  ],
  "article": [
    "In our search for the best password manager available, we stumbled across SafeInCloud, a program that’s been around since 2012. It claims to service over 1,000,000 people, making it one of the most popular password management options available.",
    "Our SafeInCloud password manager review touches on everything you need to know about this program. We’ve looked closely at its plans and prices, main features, performance, security, and more to bring you the following analysis.",
    "Despite being free for desktops and very competitively-priced for mobile devices, SafeInCloud still offers a great selection of extra features. For starters, it can be used to store passwords, but also to remember credit card numbers, ID details, and pretty much any other sensitive information. These can be added fast and efficiently with one of the built-in templates.",
    "SafeInCloud also features a powerful password generator and strength analysis tool. In short, this assesses the strength and estimated crack time for each password, flagging those that are too weak.",
    "The program is also compatible with Apple Watch and Android Wear smartwatches. Browser extensions are available to streamline web use and provide autofill functionality, and you can even import existing data from other programs to the desktop app.",
    "Setting up a new SafeInCloud account is fast and very straightforward. If you’re using a mobile device, simply head to the relevant marketplace and download the app. The Windows 10 app can be installed from the Microsoft store, while older versions of the Windows app and all Mac versions are available for download from the SafeInCloud website.",
    "From here, you will have to set a strong master password before you can access your account. No personal details or other information is required. To import existing data, first export it from the program you currently use, and then import it directly to SafeInCloud.",
    "We tested SafeInCloud with a Windows 10 laptop and the Google Chrome browser extension. The desktop interface is somewhat outdated, but it remains simple and intuitive. Important options are available across the top of the window, passwords and accounts are listed in the center, and different password/information categories can be accessed via the panel on the left of screen.",
    "When it comes to performance, SafeInCloud is great, and adding a new password is extremely easy. Simply type the website, username/email address, and password into the app and hit enter. Login details for saved websites can then be filled with a single click on the browser extension.",
    "SafeInCloud’s security is quite impressive. It uses a powerful zero-knowledge security system, which effectively means that no one can ever access your data unless they have your password. There’s no way for the app developer or anyone else to enter through the back end.",
    "On top of this, it uses a 256-bit AES encryption protocol in all cases, further securing your information. A master password is required to login to your account, and the mobile apps also support biometric login. All data can be backed up in the cloud through Google Drive, Dropbox, or any one of a number of other options. Your data can also be exported and saved to your device or an external hard drive.",
    "Unfortunately, SafeInCloud’s support is a little limited. Email support is available, but only in English. On top of this, the website states that “Support requests are usually answered within 2 business days”. Not ideal if you have a serious security concern or another major problem.",
    "On the plus side, there is a fairly comprehensive knowledge base that includes information about a wide range of common problems and issues. Unless you have a major problem, this should be your first resource.",
    "Password Manager SafeInCloud is compatible with Android, iOS, Windows, and Mac devices. A two-week free trial is available with the two mobile apps, while the base Windows/Mac versions are free forever.",
    "The Android and iOS apps can be downloaded from the Play and App stores respectively. A Family Pro license costs $7.99 for life and can be shared with up to five people. Individual users can purchase a lifetime Individual Pro license for just $3.99.",
    "Now, the desktop app’s prices are a little more deceptive. Base features are free, but you will have to pay for more advanced tools with the Windows version. For example, a Windows Hello Integration costs $2.99.",
    "SafeInCloud is a solid password management program, but there are plenty of alternatives on the market. For example, Dashlane is a powerful option with a range of advanced features, including a built-in VPN and bulk password changer. Access to these features does cost $4.99 per month, but it’s worth every cent. Another great alternative is LogMeIn’s LastPass. It’s aimed at business users, starts from $4 per month, and also includes a great suite of extra tools.",
    "Overall, password manager SafeInCloud is a solid password management program with a range of useful features. It certainly isn’t the most powerful program we’ve used, but it’s hard to fault it for all but the most advanced users.",
    "On top of this, SafeInCloud is available on a range of different operating systems, including iOS, Android, Mac, and Windows. It’s backed by adequate security features and is very easy to use. Customer support could be better, but that’s a minor flaw."
  ],
  "headers": {
    "2": "Features and utilities",
    "5": "Setup",
    "7": "Interface and performance",
    "9": "Security",
    "11": "Support",
    "13": "Plans and pricing",
    "16": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "password manager": "https://www.techradar.com/best/password-manager",
    "SafeInCloud": "https://safe-in-cloud.com/",
    "credit card": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Windows 10": "https://www.techradar.com/news/best-windows-10-pro-laptops",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "mobile apps": "https://www.techradar.com/best/best-mobile-app-development-software",
    "external hard drive": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "password management program": "https://www.techradar.com/best/business-password-management-software"
  }
}