{
  "source": "https://www.techradar.com/reviews/brother-mfc-j5330dw",
  "title": "Brother MFC-J5330DW review",
  "category": "computing",
  "updated": "2021-07-13T13:25:50Z",
  "author": "jim-hill",
  "summary": "It looks a touch clunky, but this workhorse makes for a great business printer",
  "verdict": "This four-in-one MFP boasts a deep 250-page A4 paper tray, a rapid 22 ppm churn rate and duplex printing, with impressive output quality within a reasonable budget. Add the ability to print A3 paper and you have a potentially indispensable office printer.",
  "pros": [
    "Neat internal cable management",
    "A4-sized MFP capable of printing A3",
    "Reliable and sharp black pigment printing",
    "Companion app tells you how much ink is left"
  ],
  "cons": [
    "Some photos take ages to print",
    "Couldn’t update firmware via Wi-Fi",
    "Longwinded setup procedure",
    "A3 capability adds bulk and cost"
  ],
  "article": [
    "The Brother MFC-J5330DW might look like your typical multifunction printer, but it's got more than a few tricks up its sleeve. First and foremost, this machine can also print on A3.",
    "Due to its deep 250-page capacity paper tray, rapid duplex (two-sided) print speeds, the inclusion of a fax facility and a 50-page ADF (automatic document feeder), we can see that the Brother MFC-J5330DW is aimed at the busy small to medium business user. It's not a home printer, so you won’t find consumer-friendly features like an SD card slot or NFC for hooking up a mobile device, but this machine does offer Ethernet and Wi-Fi connectivity along with the usual square USB port.",
    "The J5330DW is a well-specified inkjet with a fairly high print resolution of 4,800 x 1,200 dpi – which makes it rather good at printing photos on photo paper – and its scan resolution is only slightly lower at 2,400 x 1,200 dpi.",
    "The ability to load A3 paper, one sheet at a time, is a real bonus that makes it possible to print full-colour A3 posters, or A4 booklets.",
    "If the MFC-J5330DW was merely an A4 multifunction printer, like the Canon Maxify MB2750, we would complain about it taking up a little more desk space. However, the fact that it can accept A3 puts it in a very different bracket. A4 sheets can be loaded into the tray in a portrait orientation, which means the drawer doesn’t stick out awkwardly, as with most A4 printers. Or you can extend the tray and fill it with 250 sheets of A3 paper. The scanner bed, however, is limited to A4.",
    "The J5330DW is an inkjet printer which retails at £190.80 (around $250, AU$325) and its four cartridges are loaded via a front flap. The top half of the printer opens in order to see the printer heads and also plug in the Ethernet and USB cables. Brother has put these ports on the inside with the wires leading out through the back presumably to stop people accidentally unplugging the cables.",
    "As mentioned, there’s a 50-page ADF on the top of the machine for lining up scanning or copying jobs, and a single document feed tray at the rear for envelopes, headed paper and the like.",
    "The control panel is a rather small, but still very user-friendly, colour touchscreen. It swivels upwards for easy access, along with a numerical keypad of the hard button variety.",
    "As a four-in-one MFP, this Brother offering can print, scan, copy and fax like a trooper. And as with most models aimed at the small to medium business it is well-featured, with both Ethernet and Wi-Fi connectivity, the latter of which includes Wi-Fi Direct in case you want to make a wireless connection without involving a router.",
    "You can also use the excellent companion app to print and scan wirelessly from a mobile device. The Brother iPrint & Scan app is a free download for iOS and Android.",
    "Printing speeds of up to 22 ppm (pages per minute) in mono, or 20 ppm in colour, are claimed, although we found this MFP rather slower than that. It does print on both sides of the page, though, and a bonus feature that you only get with A3 printers is the ability to print A5 booklets.",
    "Being an inkjet model, you will be committed to buying expensive cartridge refills for the rest of the printer’s life, but the cost is no worse than that of rival brands. The four coloured inks dispense separately, so you’re not forced into replacing the whole lot when one runs out, and if you choose the high-yield XL cartridges at £20.30 (around $26, AU$36) each, you can print up to 1,500 pages.",
    "When you set up the Brother MFC-J5330DW for the first time, the touchscreen display walks you through a rather time-consuming step-by-step guide that includes entering the date, time and Wi-Fi details. And when we fitted the four ink cartridges, we were asked by the setup wizard to remove them and put them in again. Presumably we somehow messed it up the first time.",
    "The setup procedure is very thorough if nothing else, and it includes printing out a colourful test page to ensure that the print heads are correctly aligned – which they were.",
    "In operation, the MFC-J5330DW was very straightforward to use, thanks to the logical touchscreen display. It is rather small at 2.7-inches, but we found we could type in Wi-Fi passwords without mashing the tiny Qwerty keyboard.",
    "The only problem we had occurred when updating the firmware, which would not work over Wi-Fi using the companion app. We had to attach an Ethernet cable and use the printer’s touchscreen interface to download and install it. And switching from Wi-Fi to a wired connection involved reinitialising the printer.",
    "Print quality in mono is perfectly acceptable, and in colour, it produced superior results to the similarly-styled Canon Maxify MB2750. Plain text appears in a bold pigmented black with smooth characters and no sign of smearing or running. The ink looks rather heavier than it would with a laser printer, but it is consistent.",
    "Documents with colourful charts and pictures come to life with the bold inks, and are free from smudging or blocking nastiness. It also makes a fine job of photos printed onto photo paper. Inkjets aimed at the office tend not to handle delicate shading as well as their consumer-friendly cousins, but these results managed to look both vibrant and quite natural.",
    "However, we did not achieve the print speeds quoted by the manufacturer. For us, the ‘first page out time’ (FPOT) was slightly longer than six seconds, and printing an A4 photo took the best part of a minute. Consecutive plain text pages were much closer to the suggested 22 ppm and that’s probably where speed is really of the essence."
  ],
  "headers": {
    "4": "Design and build",
    "8": "Features",
    "12": "Setup and operation",
    "16": "Performance"
  },
  "links": {
    "multifunction printer": "https://www.techradar.com/news/best-all-in-one-printer",
    "home printer": "https://www.techradar.com/news/best-home-printer",
    "Canon Maxify MB2750": "https://www.techradar.com/reviews/canon-maxify-mb2750",
    "inkjet printer": "https://www.techradar.com/news/best-inkjet-printers"
  }
}