{
  "source": "https://www.techradar.com/reviews/wolfram-alpha-search-engine",
  "title": "Wolfram Alpha search engine review",
  "category": "computing",
  "updated": "2021-09-30T16:30:21Z",
  "author": "lindsay-pietroluongo",
  "summary": "Algorithm-based answers for almost any topic",
  "verdict": "This one-of-a-kind search engine is as helpful for high-level math and science questions as it is for everyday help and entertainment.",
  "pros": [
    "Numerous topics",
    "In-depth search tips",
    "Mobile-optimized apps"
  ],
  "cons": [
    "Tricky phrasing required",
    "High amount of data collection and sharing",
    "Unclear pro-level tools"
  ],
  "article": [
    "Wolfram Alpha is a different kind of search engine, and if it’s your first time on the website, you’ll spend a lot of time staring at the home page. Is it a search engine? Is it a calculator? What is it?",
    "It’s kind of both. It’s a search engine that computes answers based on algorithms and high-level knowledge. That may sound too much like a college course to you, but you’ll be surprised at how helpful it can be for daily life – and you’re probably already using another device to look up the type of information Wolfram Alpha excels at delivering. Let’s dive in.",
    "Wolfram Alpha’s search topics are broken down into four categories – Mathematics, Science and Technology, Society and Culture, and Everyday Life – with subtopics underneath. By clicking on a subtopic, you’ll see several examples of how to search for related queries.",
    "Mathematics is pretty straightforward – you enter what you need to calculate, and the results show you the final answer and the steps for how to get there. This makes Wolfram Alpha unbeatable for math students or anyone who works in the field.",
    "The Science and Technology section is similar. Within that, though, are options that the everyday user may find helpful. For example, you can convert grams to ounces when you’re cooking, find out what your clothing size is in another country for help when shopping, or figure out how much paint you need to purchase to cover a room in your house.",
    "The Society and Culture and Everyday Life categories will be the most helpful for users. Think of what you may ask Alexa (or your voice assistant of choice) on a normal day – things like, “What time is it in London?” or “What size turkey do I need for 15 people?” That’s the sort of information Wolfram can help you out with, so long as you know how to enter the search query. And there are several examples for each subtopic to help you figure out what to search for and how to search.",
    "Wolfram Alpha is not a private search engine, and what they collect and how they use your information is laid out in their privacy policy. Essentially, Wolfram Alpha can collect a lot of information about you, and it can be disclosed to third parties, as well as be used to add you to Wolfram’s mailing list (which you should be able to opt-out of).",
    "The search engine uses cookies, too, and while you can configure your browser to block cookies, the company says that may negatively impact your search results.",
    "You can’t type just anything into Wolfram Alpha, like you can with Google, and expect to get results (or at least the right results). For example, searches like “what are the healthiest foods,” “what’s on TV tonight,” and “Paleo diet” all returned nothing related to the search – when anything was returned at all.",
    "Instead, you have to know how to search in Wolfram and the type of information to search for to get anywhere. But there are so many examples that you’ll get the hang of it in no time, as long as you take the time to learn how to communicate with it.",
    "Here’s an example of what search results look like. This is in response to “Oscar for best actress 1982.”",
    "The most entertaining section of Wolfram Alpha is the Surprises category nestled under Everyday Life. Ask Wolfram Alpha to tell you a corny joke, give it a tongue twister to reply to, have it recite a nursery rhyme, and more.",
    "Wolfram Alpha can be accessed via a browser, and there are also mobile apps for Android, iPad and iPhone, Kindle Fire, and Windows phones and tablets.",
    "There’s also Wolfram Alpha Pro, the upgraded, paid version of the basic search engine, but what you get for the price is unclear. Two of the biggest features are file upload for data analysis and form-based interfaces called web apps.",
    "When you go to the dedicated page for data analysis, the examples don’t seem to work. This could be because you’re not a Pro user, but the idea here is to see the functionality before you sign up.",
    "The web app samples are more helpful. This is an example of the auto loan app.",
    "There’s not much in the way of competition for Wolfram Alpha, besides the AI that your chosen virtual assistant uses – and even then, devices like Alexa often return irrelevant answers. Yes, Wolfram Alpha can return irrelevant answers too if you input the search the wrong way, but with so much guidance on the site, that’s easy to work around. Also, it’s nice to have the answers in front of you so you can see them and slowly go through the details.",
    "Wolfram Alpha is a wholly different type of search engine, and while you can’t search for anything and everything with it, what it does do it does very well. Whether you’re trying to figure out a geometry solution for class, get stats about a car you want to buy, remember who the president of a foreign country is, or find out the rating of a movie you want to watch with the family, Wolfram/Alpha can deliver the answers, along with more relevant info you probably want to know.",
    "Go back to basics to learn what an algorithm is with our explainer. Read it here."
  ],
  "headers": {
    "2": "Features",
    "6": "Privacy",
    "8": "User Experience",
    "12": "Platforms",
    "16": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Wolfram Alpha": "https://www.wolframalpha.com/",
    "privacy policy": "https://www.wolfram.com/legal/privacy/wolfram/",
    "browser": "https://www.techradar.com/best/browser",
    "dedicated page for data analysis": "https://www.wolframalpha.com/input/pro/uploadexamples/",
    "Pro": "https://www.wolframalpha.com/pro/",
    "web app samples": "https://www.wolframalpha.com/web-apps",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "here": "https://www.techradar.com/news/what-is-an-algorithm"
  }
}