{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
  "title": "Xiaomi Mi 11 Ultra review",
  "category": "phones",
  "updated": "2021-06-07T20:33:12Z",
  "author": "tom-bedford",
  "summary": "Great but gimmicky",
  "verdict": "The Xiaomi Mi 11 Ultra is a potentially great phone that’s ruined by what Xiaomi is pitching as its standout feature: the giant camera bump makes the phone unwieldy, and not only does the rear display not bring any important features, we also found it got in the way frequently. It’s hard to make a case for a phone with this annoying ‘extra’, especially given the high asking price. It’s a shame, because buried beneath that mountainous bump is a great phone with fantastic cameras, a powerful processor and a good-looking screen.",
  "pros": [
    "Mostly-great cameras",
    "Super-fast charging",
    "Good-looking display"
  ],
  "cons": [
    "Overheating issues",
    "Camera bump is too big",
    "High price"
  ],
  "article": [
    "If someone told us the Xiaomi Mi 11 Ultra was a parody of the Samsung Galaxy S21 Ultra and iPhone 12 Pro Max-style superphones, we'd probably believe them. Its feature set and design evoke those luxury phones, but it turns it up to 11 with one extra feature that seems almost sarcastic.",
    "This 'extra' is the rear camera bump, a material memo from Xiaomi that seems to say “You want more? You've got more.” It's absolutely huge, and it doesn't just house three powerful cameras with giant lenses – it includes a 1.1-inch secondary display too.",
    "Why does this phone have a second screen? Who knows. Mobiles have so far got by without rear displays (no offense, Nubia Z20). It's just one of several unnecessary additions that the Mi 11 Ultra has – but then again, it could be argued that many of the extra features this type of superphone has are equally gratuitous.",
    "This feature is our biggest issue with the Xiaomi Mi 11 Ultra, as its heft actively detracts from the user experience in a number of ways. You can’t put the phone flat on some wireless charging mats, it barely fits in pockets, and cases don’t really protect the phone with a bump that size. In addition, the second-screen functions range from useless (an always-on display that barely works) to really annoying (music controls sometimes pop up on it, in a spot that’s really easy to accidentally touch).",
    "It’s very likely that this big rear camera bump is also to blame for the Mi 11 Ultra’s huge price, though the all-around top specs probably don’t help. Given how the mound detracted from our enjoyment of the phone we can’t help but picture a version of the phone with a smaller camera bump and improved design, and indeed such a phone exists – it’s called the Mi 11.",
    "The Xiaomi Mi 11 Ultra is very, very similar to the Mi 11 – the Ultra has that bigger camera bump, better cameras, faster charging and a higher price, but the phones have a lot more in common than they don’t. The screens are identical, with 2K resolution and 120Hz refresh rates, and the chipsets, rear material, front camera, fingerprint scanner, reverse wireless charge speed and audio capabilities are all the same too – and given the price and features, the ‘standard’ phone is a much better buy.",
    "Saying that, the Xiaomi Mi 11 Ultra is still a great device – if you can somehow look past its eye-catching flaw, which is easier said than done.",
    "You’ll find three rear cameras on the Mi 11 Ultra: a ‘standard’, ultra-wide and periscope zoom, with resolutions of 50MP, 48MP and 48MP respectively. They’re all top-of-the-line snappers, with the latter camera hitting 10x hybrid or 120x digital zoom.",
    "Thanks to the hardware on display here, we took some absolutely lovely pictures with the phone – although there are one or two issues with certain modes (and one of the lenses).",
    "The Snapdragon 888 processor makes the Mi 11 Ultra snappy to use, which is especially useful for gaming, but it’s also great for when you’re editing photos and videos. An overheating issue with the device can sometimes mitigate the powerful processor, though.",
    "We’ve also got to commend the display, with its 2K resolution and 120Hz refresh rate, as it makes content look great, whether you’re streaming Netflix or scrolling through social media. The charging speeds are another feature we found super-useful, as the 67W wired powering boosts the phone up in (almost) no time at all.",
    "Reading this review, you’ll probably have the same thought process we did on opening the phone – we marveled at its design, its spec list, its camera samples, and were ready to give it full marks. But over a month of actually using the thing as our standard phone, cracks started forming (not literal ones, but just as troubling), which is why we’ve got a much more mixed opinion of the phone.",
    "The Xiaomi Mi 11 Ultra has a super-high price – it costs £1,199 / AU$1,799 (that’s roughly $1,600, though Xiaomi doesn’t sell its phones in the US). If you’re quick with your price conversions, you’ll see the handset costs a good deal more in the UK than in Australia, so it’s a better deal in the latter country.",
    "At that price, the phone is competing with rivals like the Samsung Galaxy S21 Ultra at $1,199 / £1,149 / AU$1,849, and the iPhone 12 Pro Max, which costs $1,099 / £1,099 / AU$1,849. Unlike Samsung and Apple, though, Xiaomi hasn’t had a globally-released phone come out at this ultra-high price point, so this is uncharted territory for the company.",
    "This is a monster of a phone. The Xiaomi Mi 11 Ultra would be big for a handset even if it didn’t have that massive rear bump; with it, the thing is a blunt weapon.",
    "The phone has dimensions of 164.3 x 74.6 x 8.4mm – the camera bump isn’t included there, but we’d estimate that it pushes the thickness over 10mm. It weighs 234g, so you’ll only find heavier handsets in the realm of giant gaming phones.",
    "On the right edge of the phone are the power button, which we found fairly easy to reach, and volume rocker. On the bottom edge there’s a USB-C port, but no 3.5mm headphone jack – sorry, wired audio fans. The phone has a dual-SIM slot, but no microSD card slot, so there’s no expandable storage.",
    "On paper, it sounds like the phone is well protected. Its glass back is made of Corning Gorilla Glass Victus, which is a toughened type of glass - though ‘tough… for glass’, doesn’t speak volumes on the material’s hardiness. The phone is also IP68 protected against water and dust.",
    "Now onto the elephant in the room – or the elephant on the phone. The rear camera bump is eye-catchingly huge, because it houses three giant lenses and a secondary display, and its presence on the device is very much felt.",
    "It’s hard to fit the Xiaomi Mi 11 Ultra in a smaller pocket – we sometimes found ourselves carrying it in our backpack because it just didn’t fit in some of our jeans, which is hardly the most accessible place for your phone. The in-the-box case barely covers the phone, and the bump is left totally exposed when the case is used, which made us fear that a drop could damage the cameras and the mini display.",
    "There are some fun aspects to the bump. We could use it to hook the phone onto our laptop, which was a handy way of letting us multi-task (although one that’s totally unnecessary given that we could have just split-screened on the laptop), and when holding the phone in landscape we could use the bump as a grip, a la a Kindle Oasis, instead of holding the sides. However, any such novelties the bump brings are more than offset by the annoyances.",
    "The Xiaomi Mi 11 Ultra has the exact same display as the ‘vanilla’ Mi 11 – it’s a 6.81-inch smartphone-screen powerhouse, curved at the edges, with a cut-out for the front camera in the top-left corner.",
    "At that size, the phone has one of the biggest displays we’ve seen on a phone; it's not just ‘Ultra’ in name.",
    "With a 1440 x 3200 resolution, the screen is higher-res than the standard 1080p most phones use; and with a 120Hz refresh rate, HDR 10+ support, 1700 nits max brightness and AMOLED technology, it’s one of the best-looking displays we’ve seen on a phone.",
    "There’s also an in-screen fingerprint scanner here. Xiaomi phones have in the past had issues with this piece of tech, as they can often be temperamental to use, and while the Mi 11 Ultra doesn’t have the same issues as the Mi 11, we still often had to lift and replace our thumb to get the scanner to recognize our print.",
    "So what about the rear 1.1-inch screen? Well, this is the same display as the Xiaomi Mi Band 6 has, but unlike on that multi-talented sports band, this rear panel is only used for three distinct tasks.",
    "Its main use is as an always-on display, so when you place your device screen-down you can still see the time and your battery level. However, while that’s the theory, it’s not actually ‘always’ on – it switches off after a short while, so it’s not too useful.",
    "The rear display also works as a viewfinder for photography, so when you’re taking a picture of someone with the rear cameras they can see how they look. As you can imagine, however, a 1.1-inch screen is hard to see from a distance, so the display doesn’t work for this purpose very well either – plus, the viewfinder only works in default Photo mode, not Portrait, which you’d probably be using to take a snap of someone.",
    "Finally – and again, in theory – if you’re playing music, a skip back, play/pause and skip forward button appear on this rear panel – in theory, you should be able to use these as easy ways to control your music, but in practice we found it the single most annoying aspect of the phone.",
    "These buttons only appeared sporadically – sometimes we'd flip the phone and they wouldn't appear, and sometimes they'd be active even when we were holding the phone in regular fashion, with the rear screen facing away from us.",
    "Why was this annoying? Because it was very easy to accidentally press the rear display and skip a track; we'd frequently be holding the phone as normal, only for our finger to accidentally touch the rear display and pause or skip the song. Even more annoyingly, this could easily happen when the phone was in a pocket too, and we'd often be walking along, minding our business and listening to some music, only to have our song randomly restart, or the podcast we were listening to repeatedly jump forward by 10 seconds.",
    "Of all our gripes with the rear bump, the music player issue is what has us cursing it the most. Sure, it seems like a minor complaint, but given how frequently many of us listen to music on our phones, and how often we experienced the issue, it’s a problem many users of this phone will be bumping up against time and time again.",
    "The Xiaomi Mi 11 Ultra has three rear cameras, the same number as the iPhone 12 Pro Max and one fewer than the Samsung Galaxy S21 Ultra or OnePlus 9 Pro, but quantity doesn’t necessarily equate to quality when it comes to smartphone photography – far from it in many cases.",
    "These are 50MP f/2.0 main, 48MP f/2.2 ultra-wide and 48MP f/4.1 periscope cameras, with the latter hitting 5x optical and 120x digital zoom. There’s also a 20MP f/2.2 front-facing snapper.",
    "Pictures taken on the main camera look fantastic – they’re bright and bold, with natural-looking depth effects and lots of detail. Xiaomi’s choice to prioritize a large sensor size over high resolution, as in the Mi 11 with its 108MP snapper, clearly pays off here.",
    "In well-lit settings especially, but also to an admirable degree in low-light conditions, images were sharp, and exposure was handled well too. It’s hard to fault photos taken with the main camera, as you can see in the ‘Camera samples’ section below.",
    "Next, to the periscope camera, which handles zoom shots. We were impressed by snaps taken with this, especially at 5x optical zoom. These pictures were just as bold and detailed as un-zoomed ones, and actually looked pretty similar – and often we found 5x zoom better than 1x zoom for photos, as it improved the framing of a snap without leading to a loss in quality.",
    "Quality drops off when you zoom in far though, especially towards the 120x end the phone goes up to (huge maximum zoom ranges like this are a nice gimmick, but the pictures are seldom very usable). Hybrid pictures at 10x zoom, which combine digital and optical zoom, are actually pretty impressive though, and we took some sharp pictures with this more modest range.",
    "In our ‘Two-minute review’ we said we had mixed experiences with the cameras, and while regular and zoomed photos looked great, ultra-wide and macro shots, both of which are captured using the phone’s 48MP ultra-wide lens, were mediocre by comparison.",
    "Wide-angle pictures were noticeably distorted at the edges, with horizons and subjects appearing curved or barrel-like towards the edges of the frame. The fact that this phone has a wider-angle ultra-wide lens than most is likely the reason for this, and if you crop in on a photo you can remove the worst of it. Still, we said ‘yikes’ more than once when testing this lens.",
    "While the Xiaomi Mi 11 had a fantastic telemacro lens for close-up snaps, which the Mi 11 Lite 5G also uses, the Mi 11 Ultra sticks with a common phone-camera trick of using the ultra-wide camera for close-up shots. This technique rarely works well, as the Mi 11 Ultra shows.",
    "Macro shots suffer from the same distortion issue as ultra-wide photos, and as a result snaps often looked bulbous and bloated. We didn’t take a single macro snap we were proud of, and we found ourselves longing for the Mi 11’s telemacro lens.",
    "Round the front, the selfie camera is pretty good – pictures were bright and detailed, and Portrait mode balanced the highlights and shadows well, although by default it blurred the background a little too much. However, we found ourselves using the main cameras for selfies, and using the rear screen viewfinder to compose them – this way the depth effect looked really natural, colors looked bold, and pictures were high-res enough that we could crop in if we needed to.",
    "Video recording is available at up to 8K at 24fps or 4K up to 60fps. Video recording uses the main camera, with all the depth and color benefits we’ve already described, and video shot on the Mi 11 Ultra was some of the best we’ve seen captured on a phone. The device heated up a little when shooting, but this was only an issue with longer takes.",
    "As well as the basic photo settings, the Mi 11 Ultra boasts several of the extra modes we’ve seen introduced in the last few generations of Mi devices. There’s ‘Movie effects’ which offers different video recording effects, Sky editing which lets you change the weather effects of a photo using AI, and VLOG mode, which automatically edits video clips together. It doesn’t seem like the Ultra brings any new tricks, though.",
    "Like most top-end Android phones of 2021, the Xiaomi Mi 11 Ultra uses the powerful Snapdragon 888 chipset, which is paired with 12GB of RAM. Thanks to these internals the phone is powerful enough for all kinds of tasks – at least that’s what our day-to-day experience suggested.",
    "When we ran the Geekbench 5 benchmark test, the phone returned a multi-core score of 3519, which puts it roughly on a par with the Mi 11 at 3569 and the iPhone 11 Pro Max at 3424. However, our testing process involves running the test three times and calculating an average score, so we ran the test again, and we found that the score dropped suspiciously.",
    "In total we ran the test five times, and found each time the score dropped between 100 and 350 points, and by the time we stopped testing the scores were on a par with those of the affordable Moto G100 and aging Sony Xperia 5.",
    "Is this a software bug? We can’t tell for sure, but we don’t think so. In our month with the phone we found that it seemed to heat up very quickly – and multiple TechRadar testers corroborated this. The phone became really hot during the process of running the Geekbench 5 test, which is likely to blame for the diminishing results, and we’d guess from this that it has pretty poor heat management.",
    "If the phone’s performance can dip so dramatically, so easily, this could spell disaster for power-users – if you play lots of games, or need to render lots of videos, you might find that the phone gets weaker the longer you use it. We haven’t seen this issue in other Snapdragon 888 phones.",
    "For what it’s worth, we didn’t notice any issues when gaming, even if we played quite a few games of COD: Mobile in a row or a long game of PUBG Mobile. So the heat management and performance issues likely won’t be a deal-breaker if, like us, you don’t play for too long at once, and our experience doesn’t entirely match up to what the numbers tell us.",
    "The Xiaomi Mi 11 Ultra has dual stereo speakers, so audio sounds great whether you’re playing Spotify out loud, watching a movie without headphones, or on a video or voice call.",
    "The Xiaomi Mi 11 Ultra runs Android 11 with the MIUI user interface laid over the top.",
    "As we’ve seen on other Xiaomi phones, MIUI can be great and annoying in equal measure. It’s fairly good-looking, and has quite a few customization options to allow you to personalize the look of your phone.",
    "However, MIUI is also fairly buggy – there are visual glitches in the swipe-down menu, notifications are sometimes sent multiple times, and you can get ‘phantom’ notifications which make your phone buzz and light up, despite no message having been received.",
    "Other issues include MIUI’s bloatware, or pre-installed third-party apps that you’ll likely find yourself deleting, and a security scan pop-up that appears when you install a new app, and which can appear in front of whatever else you’re doing.",
    "We also encountered a recurring bug where the phone was slow to respond when we were typing – sometimes dramatically so, taking a few seconds to register a press on the keyboard. We’re not sure what caused this, as it didn’t seem to be linked to the aforementioned overheating issue, but it became a source of frustration when it occurred, most notably when we were using the Notes app and WhatsApp.",
    "MIUI has become a divisive subject among Xiaomi phone users, with some loving it and others finding it a nightmare to use, but fortunately it’s fairly easy to install a custom OS as long as you're reasonably tech-savvy, or can follow a YouTube tutorial.",
    "Accounts of the Xiaomi Mi 11 Ultra’s battery life have varied quite dramatically – some are saying it’s excellent, while others are criticizing it as poor, and based on our experience we’d be closer to the latter judgement.",
    "While the phone’s 5,000mAh battery is fairly large, it clearly has a hard time keeping up with the big 120Hz display, the powerful processors and the rear screen, and we often found the phone struggled to last a day between charges.",
    "With light use, we’d often finish the day with between 10% and 20% charge remaining, and with more typical use we’d see the phone completely drained by the time we went to bed. It took fairly heavy use to necessitate a mid-day charge though.",
    "Power consumption seemed to increase dramatically when the phone became hot, as we’ve described in the ‘Performance and specs’ section, which is something to bear in mind if you’re a power-user.",
    "We can’t quite put ‘battery life’ on the ‘Cons’ list of this review, as there are lots of phones that won’t last for a full day of use, but we wouldn’t recommend buying this phone if you frequently get battery anxiety.",
    "Thankfully charging is incredibly quick, with the 67W wired solution powering the phone up from empty to full in just over half an hour. There’s also wireless charging at the same speed, is the quickest wireless powering we’ve seen for a phone (at least, as of its release), although there’s a catch.",
    "When we tried to use the Xiaomi Mi 11 Ultra with a wireless charger, the big camera bump stopped us from laying the device down flat, making it hard to find the optimum powering position – and even when we did find it, charging was agonizingly slow.",
    "Finally, there’s 10W reverse wireless charging, so you can use the phone to power up Qi-compatible watches, earbuds or other devices.",
    "First reviewed May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Xiaomi Mi 11 Ultra price and availability",
    "14": "Design",
    "21": "Display",
    "32": "Cameras",
    "45": "Performance and specs",
    "52": "Software",
    "58": "Battery life",
    "66": "Don't buy it if..."
  },
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Nubia Z20": "https://www.techradar.com/reviews/zte-nubia-z20-review",
    "Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review",
    "Xiaomi Mi Band 6": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-6",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Sony Xperia 5": "https://www.techradar.com/reviews/sony-xperia-5-review"
  }
}