{
  "source": "https://www.techradar.com/reviews/onecom",
  "title": "One.com review",
  "category": "computing",
  "updated": "2021-01-11T07:34:07Z",
  "author": "mike-williams",
  "summary": "Denmark-based provider with hosting plans aimed at newcomers",
  "verdict": "One.com is a competent Denmark-based web hosting provider which can give everything that is needed to those with simple needs. However, those who do not fall into this category will have to look elsewhere.",
  "pros": [
    "15-day money-back guarantee",
    "Beginner-friendly approach",
    "Customer support available in multiple languages",
    "Free WPBakery page builder"
  ],
  "cons": [
    "Existing domains have to be transferred",
    "No free domain registration",
    "Only annual billing is available",
    "Limited support options"
  ],
  "article": [
    "Launched in 2002 in Denmark by Jacob Jensen, One.com has since become one of the leading web hosting providers in Europe. They claim to host more than 1,500,000 websites for customers from 149 countries. Additionally, they employ more than 400 people, which is a testament to their size. The company seems to be oriented towards newcomers, offering entry-level, user-friendly and feature-packed hosting solutions at pocket-friendly prices. This is backed up by a number of rewards they have won over the years and they don’t shy away from boasting about them, although we can’t really blame them for it.",
    "Today, One.com has companies registered in Denmark, Sweden, the Philippines, India and Dubai, which shows their intention to conquer the global market. They presumably have several data centers across Europe and the US, but the locations aren’t specified.",
    "Besides English, One.com’s main website is available in ten different languages: German, Italian, French, Danish, Dutch, Spanish, Portuguese, Swedish, Norwegian and Finnish, which shows quite a dedication. The webpage itself is predominantly white, simple in style and uses a standardized layout, which is why it leaves an impression of user-friendliness.",
    "One.com features an official blog which is available both in English and Danish. There are several categories lined up on the side bar, but most of them will simply take you back to the landing page and leave you somewhat perplexed for it. However, the articles are written in a simple yet informative manner. Unfortunately, there's not many of them and it seems that the last one was published on March 22nd of 2020, which coincides with the start of a lockdown in Europe because of the COVID-19 pandemic.",
    "In addition, One.com has presence on YouTube, Facebook and Twitter, and all accounts appear to be active, at least every once in a while.",
    "At first glance, One.com’s plans look too good to be true. Well, this description will feel particularly true to those who were caught off guard upon seeing the price hike after the initial period has expired. At the moment, the renewal price is two times more expensive, but this usually depends on the current discount.",
    "Curiously, presented plans are displayed in such a way that the expensive ones are positioned to the right while the cheap ones are found to the left. It’s the first thing we’ve noticed, since the usual layout follows the opposite pattern. The cheapest Beginner plan starts at $2.49 ($4.99 upon renewal) per month and the most expensive plan, Guru will cost you $9.99 ($19.99 upon renewal) for a month. At a minimum, users will get 50GB of storage, ability to host 100 mail accounts, unlimited bandwidth, website builder and an SSL certificate. One.com covers basic shared, e-mail and WordPress hosting.",
    "One.com also provides a 15-day money-back guarantee, which is a bit shorter than usual, but good to have nonetheless.",
    "As for payment methods, One.com accepts payments through all major credit cards and PayPal.",
    "As expected with a company openly oriented towards a beginner, choosing and purchasing a hosting plan and setting up and maintaining a website is made as simple as possible. What makes this choice even simpler is the fact that only five hosting plans are displayed: two for shared hosting and three for WordPress hosting. Users are able to see and compare all details about these plans by clicking on the button below them.",
    "After making a decision about the plan, you’ll be asked to register a domain or transfer an existing one, while there is no option to (if you already own a domain) to leave it with its current manager and update DNS. In other words, you’ll still be required to pay for a new domain with One.com, which is an unnecessary and equally irritable limitation. We should also note that One.com does not offer free domain registration, neither for beginners nor for everyone else.",
    "To create an account with One.com, you’ll be asked to provide more personal information than expected, including your birth date. After this, if you don’t want to be bothered with newsletters informing you about One.com‘s new products, features and special offers, you should remove the checkmark from the box (since it will come already checked). Then you’ll choose a payment method, make a payment and wait for an e-mail with further instructions and codes.",
    "About ten minutes later and with the second registration, we were permitted to enter the control panel, as will likely you. Although One.com doesn’t use industry standard cPanel or Plesk, their custom control panel is competently user-friendly and even complete newbies should not have much trouble navigating around.",
    "If you choose a WordPress-oriented plan, the installation is one-click-away and getting other popular apps (such as Softaculous, Joomla, Drupal and so on) is easy enough. In addition, there are several tools which will help you set up a simple blog or a photo gallery. With a streamlined file manager, SSH and FTP support you can also manage your website manually, should you want that.",
    "One.com’s easy-to-use website builder will allow you to create a site with up to five pages only, but will let you pick from more than 140 ready-to-go templates, which is more than enough if you want to build a simpler website.",
    "Describing their hosting as “blazingly fast”, One.com seems pretty confident in its speed performance. However, after performing a GTmetrix speed test on One.com’s main website, we weren’t particularly impressed. The total load time and required requests were a bit above the average, but when it comes to more detailed performance metrics (such as first contentful paint, time to interactive, total blocking time, speed index and others) it took a bit longer (or much longer) than recommended. Conclusively, GTmetrix rated speed performance of One.com’s main website with a D (55%), which does not instill much confidence.",
    "Fortunately, the uptime of One.com’s main website was a completely different story. As monitored with UptimeRobot over a period of two weeks, there was no recorded downtime and merely one or two oscillations in response time. Therefore, although (strangely enough) One.com makes no promises on uptime, the report we received shows that there should be no need for concern.",
    "One.com’s customer service isn’t something you would call comprehensive. There is no traditional knowledgebase, although there are a number of guides, five of which are highlighted on the “Contact us” page. They are useful enough, but seem to be geared towards complete beginners and, therefore, don’t go into more complicated questions.",
    "If you would rather have support from a member of One.com’s team, you can try your luck with live chat or e-mail. When we tried ours, we were greeted by a bot and had to make a request to speak to a human agent. Luckily, we did not wait long and the help we got was up to the level. The support should be available 24/7 and they promise you’ll get a reply within 24 hours, which is not particularly responsive. It’s a pity One.com doesn’t offer telephone nor ticket support, but what it does offer seems good enough.",
    "When it comes to being beginner-friendly, both One.com and Krystal Hosting will tick the majority of boxes. Yet, while One.com’s plans come with lower prices (at the beginning, at least), Krystal Hosting offers more support options: ticket, live chat, telephone and a comprehensive knowledgebase.",
    "A similarity Bluehost and One.com share, and not a good one, is having a considerable price hike after the promotional period. Both hosts are remarkably beginner-friendly and offer a decent value for money. However, if you are after more than a simple website, Bluehost will provide you with a whole variety of options.",
    "Hostgator is one of toughest competitors around and not only to One.com. Their shared hosting plans come at almost identical pricing and while both have a lot to offer, Hostgator can provide its users with pretty much unlimited everything and a generous 45-day money-back guarantee which will give them enough time to make a definitive decision.",
    "PowWeb and One.com are more similar than we initially thought. Both are oriented towards beginners, provide custom control panels, exclude monthly billing and may knock your socks off with the price hike upon renewal. Despite this, PowWeb offers a one-and-only hosting plan while One.com (at least) invites its users to choose between five hosting solutions.",
    "With its attractive prices, simple and easy-to-use website management tools and competent (although somewhat limited) customer support, One.com is a good choice for newcomers with simple needs. If you, however, want more hosting options and feature-packed plans geared towards advanced users, developers or larger businesses, hosts like Bluehost, Hostgator and GoDaddy will have a lot to offer to you."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "15": "Speed and experience",
    "17": "Support",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "One.com": "https://www.awin1.com/awclick.php?awinmid=6935&awinaffid=103504&clickref=trd-us-8221443094949537000&p=https%3A%2F%2Fwww.one.com%2Fen%2F",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Beginner plan": "https://www.awin1.com/awclick.php?awinmid=6935&awinaffid=103504&clickref=trd-us-9925196760075040000&p=https%3A%2F%2Fwww.one.com%2Fen%2F#PlansAndPrices",
    "Guru": "https://www.awin1.com/awclick.php?awinmid=6935&awinaffid=103504&clickref=trd-us-9630480229125670000&p=https%3A%2F%2Fwww.one.com%2Fen%2F#PlansAndPrices",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Krystal Hosting": "https://www.techradar.com/reviews/krystal-hosting",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "PowWeb": "https://www.techradar.com/reviews/powweb"
  }
}