{
  "source": "https://www.techradar.com/reviews/vari-electric-standing-desk",
  "title": "Vari Electric Standing Desk review",
  "category": "computing",
  "updated": "2021-08-23T16:30:04Z",
  "author": "anthony-spadafora",
  "summary": "An electric standing desk you can set up in minutes",
  "verdict": "With excellent build quality, simple assembly and superb cable management features, Vari’s Electric Standing Desk has rightfully earned its place among the best standing desk. There are also several desktop sizes and finishes to choose from so you can find the right desk for your workspace.",
  "pros": [
    "Intuitive assembly process",
    "Multiple finishes and sizes available",
    "Excellent cable management features",
    "Supports up to 200 lb (90.7 kg)"
  ],
  "cons": [
    "Cable Management Tray costs extra"
  ],
  "article": [
    "The negative effects of sitting at a desk all day are now widely known which is why more people are deciding to upgrade their work from home setups with a standing desk. While manual standing desks are simple to set up and use, electric standing desks allow you to easily raise your desk to a standing position or lower it to a sitting one with just the push of a button.",
    "Based in Coppell, Texas, Vari has been making both standing desk converters and standalone standing desks since 2013. We recently reviewed the Vari Standing Desk and today we’ll be looking at the company’s Electric Standing Desk. Unlike its Standing Desk which is only available in one configuration, the company’s Electric Standing Desk is available in three different sizes, five different finishes and the desk features an electric straight up lift system.",
    "In this review, we’ll be taking a closer look at the packaging, assembly process, ease of use and the features offered in Vari’s Electric Standing Desk to help you determine whether or not this is the best standing desk for your office or home workspace.",
    "Vari’s Electric Standing Desk is available on the company’s website in three different configurations to suit the size of your office space. The Electric Standing Desk 48x30 costs $595, the Electric Standing Desk 60x30 costs $695 and the largest Electric Standing Desk 72x30 costs $795. While you can purchase Vari’s Electric Standing Desk from other online retailers including Amazon, Vari offers free shipping in the contiguous US so you won’t have to pay anything extra for shipping even though the smallest configuration of the desk weighs just under 115lb (52kg) while the largest configuration weighs just over 136lbs (61kg).",
    "Unlike its mechanical Standing Desk, Vari’s Electric Standing Desk features a design that has become quite popular among other standing desk manufacturers where the two legs of the desk attach to a metal frame which is fastened to the desktop. This isn’t necessarily a bad thing though as this is a tried and true design.",
    "The desk’s T-Style legs are not only sturdy but also house the motors that allow it to move from a sitting to a standing position. Each leg contains a wire that plugs into the desk’s control box which is lowered into the frame during assembly. The control panel that needs to be attached to the front of the desk on either the right or left side depending on your preference also has a cord that needs to be plugged into the control box as well.",
    "Despite all these wires, cable management is a cinch with Vari’s Electric Standing Desk as the company provides plenty of cable ties and the frame itself features a horizontal bar to hold wires plugged into the control box in place.",
    "Regardless of whether you choose the 48x30, 60x30 or 72x30 version of the desk, the desktop is available in five different finishes (reclaimed wood, black, white, butcher block or darkwood) and features a durable laminate finish. There is also a 26-inch (68cm) cutout at the rear of the desk to make it easier to run cables.",
    "The control panel has an up and down button as well as four programmable buttons that can be set to any height between 25 and 50.5 inches. However, you can manually set the desk’s upper and lower limit positions if you want and lock the control panel if you’re worried about someone else messing with your settings. If centimeters is your preferred unit of measurement, don’t worry as you can also toggle from inches to centimeters on the control panel’s display.",
    "Normally Vari’s Electric Standing Desk arrives in two boxes but since we also received the company’s Cable Management Tray, our desk came in three boxes. While one box contains the desktop with the frame already attached, the other contains the legs, control panel and other accessories which in our case included a coaster for a coffee mug, a welcome booklet with 12 cable ties, two headphone hangers and an instruction booklet.",
    "It’s clear that Vari put a lot of thought into the assembly process of its Electric Standing Desk and the whole thing can be put together in minutes using the two included Allen wrenches.",
    "After unboxing the desk, the first step is to place the two legs into the grooved areas on each side of the metal frame and attach them using two bolts on each side. You’ll then need to drop the control box into place and plug in the corresponding cords from each leg.",
    "Next the control panel needs to be attached to either the right or left side of the desk and plugged in before using two bolts on each side to attach the desk’s feet. Once the legs and feet are secure, Vari recommends that two people carefully flip the finished desk to an upright position.",
    "If you’ve purchased the Cable Management Tray, which we highly recommend if you want to use a desktop computer and a monitor with the desk, you can attach it to the back of the desk near the groove by aligning the cable tray brackets over the pre-drilled holes and using screws to attach each bracket. Unlike other fixed cable management solutions, Vari’s Cable Management Tray can swivel to the front or back to make it easier to plug devices into a power strip. There are also holes on each end so you can run the cable from your power strip to either the right or the left depending on where your closest power outlet may be.",
    "After we finished assembling Vari’s Electric Standing Desk, we decided to test it out for ourselves using a thin client from Zotac along with a business monitor from Samsung, the Samsung M5 Smart Monitor. As the desk itself supports up to 200lb (90.7kg) we could have opted for a larger desktop PC but we decided to keep things smaller and simpler to take full advantage of the desk’s large workspace.",
    "As Vari’s Electric Standing Desk has a maximum height of 50.5 inches and a minimum height of 25 inches, finding an appropriate sitting and standing height is easy regardless of whether you’re short or quite tall.",
    "Once you’ve found a height setting that works for you, simply press the “M” button on the control panel followed by one of the four programmable buttons to save it. In our case we assigned button “1” to our preferred standing height and button “2” to our sitting height. From here, you just need to press any of the buttons you’ve programmed and the desk will raise or lower to your preferred setting on its own. We found that the electric motors in each leg raise and lower the desk quickly and quietly enough that you won’t bother those around you.",
    "If this is your first standing desk, Vari offers a number of accessories on its site to help make the transition easier including a Standing Mat to reduce fatigue while standing for long periods. There’s also an Acrylic Modesty Panel for additional privacy in shared workspaces and as we mentioned before, a Cable Management Tray to hold a power strip.",
    "During our time using Vari’s Electric Standing Desk, we were impressed with the desk’s build quality as well as by the fact that the desk can be raised or lowered with a full cup of coffee placed on it without spilling a single drop.",
    "As Vari’s Electric Standing Desk is available in configurations starting at $595 all the way up to $795, we’ll be looking at similarly priced electric standing desks with comparable feature sets.",
    "Just like as Vari does, Branch Furniture offers two configurations for its Standing Desk. While the company’s Team Plus standing desk which has a width of 48 inches and a depth of 30 inches is available for $699, there is a larger Executive version for $799 with a width of 60 inches and a depth of 30 inches. There are three different color options available for the desktop though the legs only come in white at the moment. Although setup isn’t as simple when compared to Vari’s Electric Standing Desk and there’s currently no cable management tray available (though the company said it will release one next year), Branch Furniture’s Standing Desk does have a more premium feel once assembled.",
    "The Uplift Standing Desk V2 costs $599 for its base configuration which comes with a 42 inch wide desktop with a depth of 30 inches though this price can rise significantly after configuring the desk to your preferences. If customization is something you’re interested in, Uplift Desk offers 24 different desktop styles to choose from, five different desktop sizes, frames in four colors and multiple keypads in a variety of styles and even colors. You will need additional tools as well as help from a friend to put this desk together. Still though, the Uplift Standing Desk V2 makes a great deal of sense for those that want an electric standing desk customized completely to their liking.",
    "Being able to assemble such a sturdy and professional standing desk with just two included Allen wrenches certainly takes a lot of the work out of upgrading your current desk. We were equally impressed with Vari’s packaging, instructions and cable management accessories. The fact that Vari has three different configurations of its Electric Standing Desk available in five different finishes also allows you to easily choose the right desk for your home office or workspace.",
    "If Vari decides to make a second version of its Electric Standing Desk, we would love to see the company’s Cable Management Tray included instead of costing an extra $50 but purchasing this accessory on its own still makes a lot of sense especially if you want to use this desk with a monitor and a desktop.",
    "Vari’s Electric Standing Desk could be the perfect addition to your home office and with free delivery and 30-day risk free returns, there’s no reason stopping you from trying out this standing desk for yourself."
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "9": "Setup",
    "14": "In use",
    "19": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "standing desk": "https://www.techradar.com/news/best-standing-desk",
    "Vari Standing Desk": "https://www.techradar.com/reviews/vari-standing-desk",
    "Electric Standing Desk": "https://www.vari.com/electric-standing-desk-60x30/FD-ESD6030.html",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FVari-Electric-Standing-Desk-Adjustable%2Fdp%2FB089CX2F42%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1373110487958808800-20",
    "Standing Desk": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6237773104553492000/https://www.branchfurniture.com/products/standing-desk",
    "Cable Management Tray": "https://www.vari.com/cable-management-tray/FD-ESDCBL.html",
    "desktop computer": "https://www.techradar.com/news/best-business-desktop-pcs",
    "monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "thin client": "https://www.techradar.com/best/best-thin-client",
    "business monitor": "https://www.techradar.com/news/best-business-monitor",
    "Samsung M5 Smart Monitor": "https://www.techradar.com/news/samsung-reveals-its-biggest-smart-monitors-yet",
    "Standing Mat": "https://www.vari.com/standing-mat-34x20/MT-MT3420.html",
    "Acrylic Modesty Panel": "https://www.vari.com/acrylic-modesty-panel-60/PNL-ACRLM60.html",
    "Uplift Standing Desk V2": "https://www.upliftdesk.com/uplift-v2-standing-desk-v2-or-v2-commercial/"
  }
}