{
  "source": "https://www.techradar.com/reviews/dji-pocket-2",
  "title": "DJI Pocket 2 review",
  "category": "cameras",
  "updated": "2021-07-02T11:36:14Z",
  "author": "basil-kronfli",
  "summary": "The best pocket camera around for solo videographers",
  "verdict": "The DJI Pocket 2 may not be perfect, but it’s better than anything else on the market at what it does – namely, being a compact vlogging camera. In its pricier Creator Combo package, the inclusion of a wireless mic and other core tools for video production is fantastic, and the bump up in sensor size over its predecessor is similarly welcome. Where it also comes into its own is with object tracking, specifically for vloggers walking and talking around a space. Ultimately, it’s a fantastic imaging tool that can slot into a videographer or vlogger’s workflow nicely.",
  "pros": [
    "The most pocketable, stable camera around",
    "Creator Combo perfect for vloggers",
    "Very useful tracking feature"
  ],
  "cons": [
    "Poor low light performance",
    "Struggles with high-contrast scenes",
    "Can get hot while filming 4K"
  ],
  "article": [
    "The DJI Pocket 2 clearly wants to be the steady-cam option for vloggers and casual filmmakers. It’s never going to win over hardcore videographers; after all, its all-seeing eye is a 64MP camera with a smartphone-style sensor – how much quality can you realistically expect? That said, when you combine that sensor with DJI’s mastery of stabilization and object tracking, something very special ends up happening.",
    "If you’re familiar with the brand’s recent launches, you’ll know that DJI has dropped ‘Osmo’ from its consumer-grade products like the DJI OM Mobile 4 smartphone gimbal. So, the DJI Pocket 2 is the direct follow-up to the DJI Osmo Pocket, and the general idea across both is the same: a gimbal-stabilized camera sat on top of a hand-holdable stick thing.",
    "What’s new this time around? First off, there’s that 64MP sensor, bumped up from 12MP on the DJI Osmo Pocket. The Osmo Pocket’s 1/2.3-inch sensor has also been overshadowed by a much larger 1/1.7-inch sensor on the new DJI Pocket 2. Bigger sensors generally mean better performance, as evidenced by the recent high-end consumer drone, the excellent DJI Air 2S.",
    "Then there’s the field of view. The latest Pocket packs a 93-degree field of view (FOV), versus the 80 degrees of the original. In traditional focal length terms, that means 26mm (f/2.0) to 20mm (f/1.8). Wider framing means more reliable vlogging, and vlogging is a word that’ll be cropping up a fair bit when talking about the Pocket 2.",
    "Think we’re done? Think again; there’s HDR video, a wider ISO range, improved audio capture, slow-motion capture at Full HD – and then there are the accessories.",
    "Pick up the Creator Combo, and an external wireless mic, complete with windshield, is the most valuable inclusion. The combo also packs an ultra-wide-angle lens, tripod legs, the Do-It-All Handle – which sports a mic-in jack for third-party audio options – as well as a holster. It’s also worth noting that the included wireless microphone has a mic jack, so options for wireless audio are extensive.",
    "As wonderful as everything looks so far, when it comes to image quality, DJI stumbles where most smartphones do – dynamic range and low light performance. Additionally, the small touchscreen can be fiddly, however, it does offer up a welcome preview of what you’re shooting.",
    "This all makes the DJI Pocket 2 a best-in-class product, albeit one with clear areas for improvement. A DJI Pocket 3 with a 1-inch sensor? Sign us up.",
    "You can pick up the DJI Pocket 2 in two flavors. There’s a basic bundle, costing $349 / £339 / AU$599, which includes the Mini Control Stick and 1/4-inch tripod mount. Then there's also a DJI Pocket 2 Creator Combo, available for $499 / £469 / AU$799, which includes the basic bundle's accessories plus a Do-It-All Handle, Micro Tripod, Wide-Angle Lens, Windscreen (dead cat/wind guard) and a Wireless Microphone.",
    "This is by no means low-cost, given the sensor in your smartphone may well be better quality than that in the DJI Pocket 2. But what your smartphone can’t do is mechanically stabilize your shot, follow you around, and benefit from external wireless recording (out of the box). How much those features matter to you will dictate how attractive the Pocket 2 is as a package.",
    "The super-compact DJI Pocket 2 features a 3-axis gimbal at the helm, atop a stick which houses all its brains, battery and that very welcome screen. Hold the base, frame your shot on its 1-inch display and shoot for as long as the battery will let you on the very light, comfortable-to-hold, 117g gadget – there's no danger of hand fatigue here. Alternatively, you can prop it up on a tripod, included in the Creator Combo pack.",
    "The mode and record buttons are under the DJI Pocket 2’s screen, and there's a new power button around the side. While you can still turn the gimbal on via the mode button, only the side-mounted power button can turn it off – handy for avoiding accidental shut-offs when cycling through modes.",
    "There's a USB-C port on the bottom of the Pocket 2, though when mounted on a tripod, you’ll want to connect the gimbal to a phone via a universal port adapter that slides in between the screen and buttons. Included in the Pocket 2 box are small Lightning and USB-C adapters that fit into this slot for easy phone attachment and video export.",
    "Having a physical connection means it's faster and more reliable when transferring 4K video versus having to do it wirelessly – like we experience on so many action cameras. However, the adapters are extremely easy to lose.",
    "If you see yourself simultaneously shooting on and charging up the Pocket 2 while it’s on a tripod, opt for the Creator Combo. The tripod mount base included in the standard pack covers up the USB-C port. Whack on the Do-It-All handle, however, and you bag yourself an extra USB-C port around the back.",
    "The hard plastic holster that comes with the DJI Pocket 2 is a tight, secure fit. When not in the case, you can also rest a bit easier if you sense an impending drop, thanks to Drop Aware. This is DJI's preventative measure that senses a fall and locks up the gimbal to minimize damage. It’s still not quite an action cam like the GoPro Hero 9 Black, but is a great addition for anyone who's after mechanically stabilized video.",
    "You can think of the DJI Pocket 2 as two cameras in one. The first is a stabilized out-and-about vlogging camera. The second is a camera operator, fixed in position, following you around as you chat away, walk around your kitchen, vlogging your day, cooking up a storm, or doing whatever it is vloggers do these days.",
    "First thing’s first – as a gimbal system, the three-axis DJI Pocket 2 handles walks and wobbles like a champion. Sure, you could pick up an action camera, but there’s this micro-judder that comes through when shake is being smoothed out. The Pocket 2 is free of those. Alternatively, why not get a smartphone gimbal? That would occupy your phone, and performance varies from mobile to mobile. In turn, there’s definitely a place for this funky little camera on a stick.",
    "There are three main modes: Follow (camera remains horizontal), Tilt locked (up/down rotation disabled), and FPV mode (full range of movement). The differences aren’t immediately obvious, so we’d recommend an afternoon with a few cups of coffee, jumping around your garden or living room before actually taking it on a shoot.",
    "Fire up the app, and the DJI Pocket 2’s object tracking is unleashed as well as easier control over mode switching, panoramas and manual shooting. And if you fancy picking up the Creator Combo, you’ll have even more stuff to play with, specifically when it comes to ultra-wide capture thanks to the clip-on lens – propping the Pocket 2 up on the mini-pod – and external audio recording.",
    "The DJI Pocket 2 sports a 1/1.7-inch smartphone-grade sensor and 20mm f/1.8 lens. It still records 4K 60fps video at 100Mbps, as well as HDR video.",
    "Despite us referencing the DJI Pocket 2’s camera as having a ‘smartphone sensor’, don’t let that throw you off; smartphones have come a long way. The gadget can capture wonderfully shallow depth of field at close range for such a small camera, and its autofocus has been boosted which makes it even sweeter.",
    "The utility of object tracking can’t be overstated (which is why we’re bringing it up again). Place the Pocket on a tripod (standard thread fitting) and you’ll be able to walk around or move from side to side while the head follows you, and so long as you’ve got the app fired up, it keeps you center-frame throughout. With heavy backlighting, the DJI Pocket 2 dropped focus a couple of times, but it never lost a tracked face.",
    "Thanks to the sensor’s additional size, it can capture 4K video even when zoomed in slightly. Punch in four times lossless at 16MP for stills and 1080p video; three times for 2.7k video; and two times at 4K. This means, provided you’re shooting in a well-lit scene, you can frame your shot nice and tightly with a digital crop, and track your face without your pajama bottoms being in view, while retaining 4K resolution. It isn’t the crispest 4K we’ve seen – not by a long stretch – however, with decent sound matched with a respectable picture, this should suffice for most vloggers.",
    "We mention well-lit scenes a fair bit, largely because where the Pocket 2 falls down is noise handling and dealing with high-contrast environments. In the dark, or even when capturing dark objects, you’ll see some grain, and when there are heavy highlights, focus can struggle. If you need A-grade video quality in all environments, then, that isn’t what this camera is about – but then again, nothing in its price/size bracket really is.",
    "Pro controls are also fully accessible from the Pocket 2, so you can tinker with the shutter speed, EV, focus mode and ISO of 100 to 6400, though the app makes for a less fiddly experience. Also new is the ability to adjust the follow focus speed and pause recordings, making this even more of a creator's one-stop-shop for video. TikTok dream? Actually, it’s a bit of a faff to shoot portrait mode content on the Pocket 2, so maybe stick with your smartphone for Reels.",
    "Even more useful for shooting modes is how much you can squeeze in frame. The wide 93-degree field of view will delight vloggers who want to capture more of what's behind them, bettering the 80-degree Osmo Pocket by an ultra-wide margin.",
    "If you are a videographer, or shoot with more top-end hardware, there are ways you can elevate the Pocket 2’s footage. When creating a Full HD project, you can shoot in 4K, downsample the footage, and apply some noise reduction, for example.",
    "Additionally, flattening the look with the cinematic D-Cinelike color profile makes sure your output is as editable as possible. With less electronic stabilization (processing) needed than other pocketable video options, thanks to that gimbal system, any processing applied to footage is also minimal, leaving more room for edits in post.",
    "The Pocket 2 captures skin tones with flattering color balance, and the level of stabilization it delivers when shooting handheld is unparalleled, so talking scenes to camera look wonderful. Slowed down footage shot at 60fps also makes for luxurious pans that look like they were captured on a slider – there’s plenty of clarity to the Pocket 2’s videos, and DJI’s color profiles add a bit of flexibility.",
    "Sound quality also impresses, with the wireless mic and on-body mic both delivering the goods. We didn’t feel the wireless option was needed when shooting hand-held video, though if you’re worried about covering the mic holes, it might be a smart move to switch to wireless.",
    "When using the Pocket 2’s tracking feature, the wireless mic is essential. It let us go about our business without having to think about staying in-frame or speaking louder the further away we got from the camera.",
    "If you’re picking up the DJI Pocket 2 for photos, maybe don’t? There’s a very good chance if you’re using a 2020/21 flagship phone, it can do a much better job, and will be easier to handle with its larger screen. That said, if you’ve got the app fired up, Pro mode and the gimbal-grade stabilization will enable longer shutter speeds for anyone looking to get creative. Still, think of the DJI Pocket 2 as video recorder first, quick voiceover tool second, and stills camera a distant third.",
    "The 875mAh non-removable battery in the DJI Pocket 2 is pretty tiny, though so too is the gimbal’s screen. When you shoot a lot of 4K footage at high quality, the Pocket 2 can get hot, shutting down before the battery drains.",
    "This happened after about an hour of capture, with the battery draining by just over 70 percent. That said, provided you’re shooting at 4K standard quality or 1080p resolution, the DJI Pocket 2 can keep going for longer – around two hours at Full HD. It can also record while connected to a power source.",
    "When it comes to storage, the camera takes a microSD card, and four minutes of 4K footage clocks in at around 2.5GB. If you want to shoot at full resolution, you probably shouldn’t scrimp on card capacity, with support for up to 256GB storage via microSD card. DJI suggests UHS-I speeds."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "DJI Pocket 2 release date and price",
    "10": "Design and durability",
    "16": "Specs and features",
    "20": "Video and image quality",
    "33": "Battery life and additional specs",
    "36": "Don't buy it if..."
  },
  "links": {
    "DJI OM Mobile 4": "https://www.techradar.com/reviews/dji-om-4-gimbal",
    "DJI Osmo Pocket": "https://www.techradar.com/reviews/dji-osmo-pocket",
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s",
    "GoPro Hero 9 Black": "https://www.techradar.com/reviews/gopro-hero-9-black"
  }
}