{
  "source": "https://www.techradar.com/reviews/startmail-secure-email",
  "title": "StartMail secure email review",
  "category": "computing",
  "updated": "2021-07-16T16:00:42Z",
  "author": "chelsea-forsyth",
  "summary": "Send encrypted email to anyone with StartMail’s simple service",
  "verdict": "Top-class encryption, unlimited aliases, and huge amounts of storage mean that StartMail is a no-brainer for those looking to move away from less secure email providers.",
  "pros": [
    "Easy to use",
    "Affordable price plans",
    "Multiple aliases available"
  ],
  "cons": [
    "Payment details are needed for free trial",
    "No monthly payment option available"
  ],
  "article": [
    "Ease of use and familiarity often place Gmail and Microsoft Outlook high atop the list of email providers, but a downside to these services can be the lack of privacy. If security is a priority for you, it may be time to consider switching to one of the best secure email providers.",
    "An alternative email service for those looking to protect their data is StartMail; a user-friendly webmail service that prioritizes privacy with premium security and encryption.",
    "In this StartMail review, we’ll discuss the pricing and main features of the platform, and offer a final verdict on whether StartMail is worth the investment.",
    "Though StartMail comes with a price, its premium privacy and security features are highly affordable.",
    "Upon heading to the website, users can choose from two plans: Personal or Business. Both plans cost $59.95 per year, though the Personal account is currently on offer at $35.99 for the first year. Both plans offer unlimited aliases, PGP email encryption, full IMAP/SMTP support, 10GB of storage, and the option to pay with Bitcoin, though the Business account also provides custom domain support and centralized billing.",
    "Signing up for either plan requires a one year commitment, so the lack of a monthly payment option may discourage those requiring more flexibility. However, ahead of committing to a paid account, newbies are welcome to start with a free seven-day trial.",
    "StartMail provides many features for privacy and usability peace of mind—below, we’ll discuss some of the most notable.",
    "StartMail is a webmail service, meaning you don’t have to worry about timely installation or downloading of software—you can access your mail directly from your browser. Setup is simple, and new users are walked through the process in a matter of minutes.",
    "Business users can even opt to use a custom domain with StartMail, and it’s also possible to access your mail from other email programs like Outlook or Apple Mail, thanks to IMAP/SMTP compatibility—find out how to do so on StartMail’s website.",
    "Creating an alias allows you to send and receive mail from an address different to your main StartMail account. This means that if you don’t want to share your real email address or personal data, you can create a disposable address—and as many times as you like! Not only does this ensure an even higher level of privacy, it also helps keep your main account spam-free.",
    "You can create two different types of aliases with StartMail: a Custom alias, where you choose your own address, or a Quick alias, where a name is allocated by the system. Plus, if you’re using a Business account, you can also create a third type of alias ending with your own custom domain name.",
    "As an added bonus, each StartMail account comes with 10GB of cloud storage in a personal vault, so you won’t run out of space for your sensitive communications.",
    "StartMail’s fully-responsive website provides a user-friendly platform for its webmail service. Setting up a trial account is simple, requiring just a few personal details—though payment details are required, which means you run the risk of being charged for an annual subscription if you forget to cancel.",
    "The overall interface of the platform mimics what you’d see in a typical email provider—folders like drafts, sent mail, and trash are easily located in the left-hand column, with the classic split-screen view available.",
    "StartMail’s service is intended to work like an app within your web or phone browser, with access to all privacy features like encryption and aliases accessible. For easy access to email on your phone or tablet, you can add the StartMail website to your homescreen, or use an existing email application on your device by enabling an IMAP connection.",
    "If you need help familiarizing yourself with StartMail’s service, it’s reassuring to know you can easily access the online Knowledge Base filled with helpful articles and guides, as well as StartMail’s email help desk, FAQs forum, and phone support. Take a look at what’s on offer here.",
    "Users’ privacy and security is at the heart of StartMail’s service. Based in The Netherlands, StartMail adheres to the EU's GDPR and Dutch privacy laws that are among the strictest in the world.",
    "As a result, StartMail users are protected from unwarranted intrusion and surveillance. StartMail doesn’t collect any user information, nor does it sell any of your data or read your emails. Every account has its own encrypted safe where emails are stored, with messages encrypted before delivery to ensure only intended recipients can read them.",
    "Emails can be encrypted further with OpenPGP. Enabling this feature means your message can only be opened once a password has been entered, even if the recipient of your emails doesn’t use encryption. Plus, you can opt to enable two-factor authentication.",
    "StartMail’s service is innovative, but it does have some worthy competitors.",
    "Secure email providers like ProtonMail and Zoho Mail offer similar features, with both providing end-to-end encryption, excellent security features, and user-friendly interfaces. A feature StartMail lacks is a long-term free plan, which both alternatives do offer. However, these do come with limitations such as restricted storage capabilities and a daily limit for sending messages.",
    "Premium privacy features and security make StartMail the ideal email service for individuals or businesses sending sensitive information regularly. With unlimited aliases, huge amounts of storage, and top-class encryption, StartMail is a no-brainer for those looking to move away from more easily hackable services like Gmail or Outlook.",
    "The price tag may put some off, but you do get unsurpassed privacy and security, as well as a high-quality service and a clean user interface."
  ],
  "headers": {
    "3": "Plans and pricing",
    "6": "Features",
    "12": "Interface and in use",
    "15": "Support",
    "16": "Security",
    "19": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "best secure email providers": "https://www.techradar.com/best/best-secure-email-providers",
    "StartMail": "https://www.startmail.com/en/",
    "Personal": "https://www.startmail.com/en/#pricing",
    "Business": "https://www.startmail.com/en/#pricing",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "browser": "https://www.techradar.com/best/browser",
    "StartMail’s website": "https://support.startmail.com/hc/en-us/articles/360006536217-Configure-a-trusted-device-IMAP-password",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "add the StartMail website to your homescreen": "https://support.startmail.com/hc/en-us/articles/360006422158-Add-StartMail-to-your-home-screen",
    "what’s on offer here": "https://support.startmail.com/hc/en-us",
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know",
    "ProtonMail": "https://www.techradar.com/reviews/protonmail-secure-email",
    "Zoho Mail": "https://www.techradar.com/reviews/zoho-mail-review"
  }
}