{
  "source": "https://www.techradar.com/reviews/lg-sp11ra",
  "title": "LG SP11RA review",
  "category": "audio-visual",
  "updated": "2021-09-09T10:33:05Z",
  "author": "john-archer",
  "summary": "LG’s flagship soundbar revels in the details",
  "verdict": "LG’s SP11RA cares about the little things in home cinema life. Its knack for bringing out every last detail in a complex movie mix is exceptional, helping it build an immersive, busy soundstage that makes most soundbars - and all built-in TV systems - sound puny and one-dimensional by comparison.",
  "pros": [
    "Exceptionally detailed sound and a large soundstage",
    "Adapts well to music as well as films",
    "Very attractive and compact design"
  ],
  "cons": [
    "Doesn’t move the conversation forward much from 2020",
    "Sound can lack grunt at times",
    "Doesn’t quite justify its price"
  ],
  "article": [
    "The LG SP11RA makes an outstanding first impression. The fact that it comprises four separate components - wireless sub, wireless rears and the main soundbar - immediately starts to justify its price tag, for instance. Also, though, the design of the main soundbar is seriously attractive - slim enough to fit under most modern TVs, sleekly finished and robustly built.",
    "The SP11RA hits the right notes with its features, too. The Dolby Atmos and DTS:X sound formats are both supported - support which extends to four up-firing speakers, two in the main soundbar and one in each of the rears. These reflect their sound off your room’s ceiling to deliver overhead sound effects.",
    "There’s support for hi-res audio formats too, as well as a handy built-in calibration system.",
    "The SP11RA chiefly differs from its SN11RG predecessor on audio processing, in the shape of a new AI Sound Pro system, which automatically recognizes different source types and optimizes their playback accordingly, and an intriguing new Meridian Horizon processing system that seeks to improve the remapping of stereo music to the SP11RA’s large roster of speakers.",
    "Unfortunately neither of these new processing options prove to be an exactly unmitigated success.",
    "That doesn’t stop the SP11RA, though, from still delivering a large, dynamic, open and exceptionally detailed soundstage that brings films and music to life in a way few rivals can.",
    "If you’re looking for a soundbar that looks good, delivers a large, open and detailed sound stage and can turn its hand well to music as well as movies, the SP11RA is a seriously attractive option.",
    "It lacks, though, some of the focus and raw aggression with film soundtracks you get with some rivals, and neither of the processing-based improvements it adds to last year’s SR11RG feel like truly essential additions to the LG soundbar mix. Certainly they don’t have as much impact on sound quality as the extra two physical rear side channels introduced by Samsung for 2021 in its more expensive, 16-channel HW-Q950A soundbar.",
    "The SP11RA is a global product - though strangely, at the time of writing it hadn’t yet appeared in US stores or on LG’s US website. It is widely available in other territories, though.",
    "Its £1,499 / AU$1,695 (about $2,000) price is the same as last year’s SN11RG, which at first glance seems fair enough given that the new model adds a couple of potentially useful new audio processing options.",
    "The price also gets you a ‘full’ surround system, complete with two rear and four up-firing channels as well as a large subwoofer and a 7-channel main soundbar.",
    "Aesthetically we couldn’t detect any significant differences between the SP11RA and 2020’s LG SN11RG. That’s no bad thing, though - especially when it comes to the main soundbar.",
    "Although this is wider than most of today’s soundbars, it also sits lower than you might expect of a soundbar that carries two up-firing drivers on its top edge as well as front and side-firing speakers around its front and left/right edges. It should fit under the vast majority of TV screens without getting in the way of the picture or infra-red receivers.",
    "The smooth dark gray finish of the soundbar’s top edge contrasts beautifully with the textured, grille-like finish of its sides, too, and it’s good to find a little LED read out on the front to help you keep track of volume, selected input and so on.",
    "The finish of the rear speakers picks up on the key design cues of the main soundbar, too - though inevitably their shape has more in common with traditional bookshelf speakers.",
    "The subwoofer is less elegant than the rest of the speakers - basically just a chunky black box. Subwoofers can be tucked away under sideboards or in corners, though, so looking pretty matters much less than being big enough to pump out bags of bass.",
    "The SP11RA’s 7.1.4 channel count is backed up by a colossal 770W of power, according to LG’s claims. Provided the drivers are actually capable of handling that much power, it should be more than enough to deliver properly potent and immersive experiences from the Dolby Atmos and DTS:X soundtracks the soundbar is capable of decoding.",
    "The SP11RA can also play a wide range of hi-res audio formats, as well as supporting network streaming via Wi-Fi or Bluetooth.",
    "You can control the SP11RA using either the sparsely buttoned remote control, or use an app on your iOS or Android phone. Handily there’s an option in the mobile phone app for running a smart calibration routine that automatically balances the speakers to best suit your room setup. This is something that LG’s closest premium soundbar rival, Samsung, does not offer, even on its latest flagship model.",
    "The SP11RA’s speaker system breaks down as front center, left and right, side left/right and two upfiring drivers in the main soundbar, plus front and up-firing drivers in each rear speaker. The bass speaker, as usual, just supplies the low frequencies the main soundbar can’t comfortably reach.",
    "The SP11RA’s main advantage over its predecessor comes with the addition of two new processing systems. First up there’s LG’s AI sound system. This analyzes incoming sound on the fly and seeks to optimize the way the soundbar plays it, taking into account both the type of sound and LG’s intimate knowledge of the strengths of the soundbar’s specific speaker setup.",
    "The new Meridian Horizon processing, meanwhile, is focused on music. In fact, to get it to kick in you need to select the Music mode from LG’s list of audio profile options. The idea behind it is to convert stereo music into a multi-channel mix able to make use of more of the SP11RA’s speakers.",
    "This is hardly a new concept, of course. However, other soundbars don’t have the vast musical knowledge of a brand like Meridian behind their music ‘upscaling’ efforts.",
    "The SP11RA’s connections include two HDMI inputs, one HDMI output, and an optical digital audio input. The HDMI output supports eARC, too, where lossless Dolby Atmos and DTS:X sound mixes can be received from compatible TV eARC HDMI ports.",
    "Gamers might want to note, though, that the HDMI loopthrough system does not join new soundbars from Klipsch and Sony in supporting pass through of 4K/120Hz and variable refresh rate game graphics.",
    "You can work round this if your TV supports eARC by connecting your new console or PC to your TV directly and then having the TV output the game’s soundtracks to the soundbar. This is a relatively complicated process, though, and can sometimes cause issues with audio lag that you don’t get with a standard loopthrough approach.",
    "The SP11RA’s HDMIs also don’t pass through the HDR10+ HDR format. HDR10, HLG and Dolby Vision go through fine, but HDR10+ sources are ‘downgraded’ to standard HDR10, with their extra scene by scene data gone.",
    "It’s true that HDR10+ content is much less common than content mastered in Dolby Vision. But many other premium soundbars support pass through of both of the ‘advanced’ HDR formats, so it would be nice if a soundbar as expensive as the SP11RA did too.",
    "There’s one other compatibility issue to report with the SP11RA. For some reason, it won’t pass Dolby Vision through to compatible TVs from Panasonic 4K Blu-ray players. LG tells us that it’s aware of the problem and is working hard to get to the bottom of it.",
    "At first listen the SP11RA sounds almost unfeasibly good. The power and scale of the sound it produces instantly seems completely inconsistent with the main soundbar unit’s compact, elegant design. In fact, the soundbar is so good at throwing sound in all directions, including up, that the soundbar often becomes almost ‘invisible’ as a source for the audio maelstrom going on around you.",
    "The SP11RA doesn’t just throw its sound to the four corners of your room - and above your head - with reckless abandon, though. The sound distribution is expertly controlled to create a convincing and immersive sense of three-dimensional space. Especially, as you would hope, with Dolby Atmos and DTS:X mixes.",
    "Particularly striking is how accurately the SP11RA places details in the seemingly effortlessly large soundstage it can create. If a sound is supposed to be coming from high and to the left, that’s where it appears. If it’s supposed to be coming from somewhere behind and above your right shoulder, that’s where it appears. Details are also always beautifully clear and defined.",
    "The effects placement is particularly good versus most if not all rival Dolby Atmos soundtracks when it comes to height/overhead sound effects. So long, anyway, as you don’t have either a vaulted or heavily beamed ceiling that might impede the way the upfiring drivers reflect their sound.",
    "There’s some effective layering of scores, too, both vertically and horizontally, and as you would hope with a system that’s so astute with its detailing, sound transitions as noisy objects move around a mix are handled expertly.",
    "The rears are comfortably powerful enough to stand their ground against the main soundbar, while the subwoofer kicks in potently and enthusiastically whenever it’s required.",
    "Soundbars that excel with movie soundtracks sometimes - often, even - struggle to sound particularly musical. So long as you’re careful which sound settings you use, though, the SP11RA can sound rather good with stereo music. Clean, full of dynamic range, and convincingly staged, especially where vocals are concerned.",
    "The Music mode that activates the Meridian Horizon processing doesn’t sound as good as we’d hoped. It does a decent job of greatly enlarging the sound stage without losing the warmth and core musicality of your favourite tunes, but it can also make low frequency sounds a bit muddy and muffled, while general clarity levels also seem subdued.",
    "The new AI Sound Pro mode actually proves more interesting than the Horizon processing. It, too, greatly expands the soundstage and room-filling impact of stereo music, but sounds cleaner and more detailed than the Horizon setting. The results are a bit too aggressive at times, though, leaving the Standard mode as for me the best all-round music option.",
    "With film soundtracks the AI Sound Pro mode makes the soundbar sound louder, with a more expansive dynamic range. It also, unexpectedly, manages to make the sound stage feel like it’s wrapped more snugly around you. It also, though, doesn’t sound as pristine and detailed as the simple Dolby Atmos mode, and has an odd tendency to make trebles sound harsh.",
    "There are one or two other niggles about the SP11RA’s performance, too. Aggressive, hard impact sounds, for instance, such as loud gunfire, sudden bursts of score or ‘Hollywood’ punches can lack impact.",
    "Also, while detail levels and effects steering are both extremely good, sometimes, perhaps related to the previous issue, the sound stage becomes a bit vague - as if the soundbar doesn’t understand where the mix wants it to focus its attention.",
    "Extremely heavy bass tracks can suddenly make the usually nimble subwoofer sound a bit boxed in, and finally, while the SP11RA generally disperses its sound amazingly well, sometimes voices can seem a little locked into the soundbar, rather than sounding as if they’re coming from the TV screen above.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "LG SP11RA price and availability",
    "11": "Design and features",
    "29": "Audio performance",
    "42": "Don't buy it if..."
  },
  "links": {
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "HW-Q950A soundbar": "https://www.techradar.com/reviews/samsung-hw-q950a",
    "LG SN11RG": "https://www.techradar.com/reviews/lg-sn11rg-dolby-atmos-soundbar",
    "bookshelf speakers": "https://www.techradar.com/news/best-stereo-speakers"
  }
}