{
  "source": "https://www.techradar.com/reviews/moto-g9-power-review",
  "title": "Moto G9 Power review",
  "category": "phones",
  "updated": "2021-01-05T17:03:15Z",
  "author": "david-nield",
  "summary": "One of the best phones on a budget",
  "verdict": "The 'Moto' tells you you're getting a no-nonsense, dependable budget phone from Motorola, the 'Power' tells you this has one of the biggest batteries on the market – and that just about sums up what you can expect when it comes to the Moto G9 Power.",
  "pros": [
    "Long-lasting battery",
    "Spacious screen",
    "Very affordable"
  ],
  "cons": [
    "Average performance",
    "On the bulky side",
    "Only Android 10 for now"
  ],
  "article": [
    "We more or less know what to expect from Motorola's budget Android phones at this point – solid build quality, value for money, and respectable performance.",
    "These are the phones you get on your shortlist if you're prioritizing low cost over high benchmark scores, and would rather not spend four-figure sums on getting the very best components (screens, cameras and so on) that the smartphone market can offer right now.",
    "When it comes to the Moto G9 Power specifically, two features should catch your eye: the low, low price of this handset (check the widgets on this page for the latest deals), and the gigantic 6,000mAh battery capacity that is just about the biggest you'll find in terms of mainstream consumer handsets at the moment.",
    "Want a battery that will last and last, at a very affordable price point? The Moto G9 Power might be for you.",
    "Inevitably, with a phone so cheap there are compromises. The internal specs of the G9 Power, including a Snapdragon 662 chipset and 4GB of RAM, are nothing to write home about – the phone will get you through day-to-day tasks well enough, and even run demanding games at lower quality settings, but this is not a handset that's going to impress you with its speediness.",
    "Camera quality is another area where you should temper your expectations, though we actually think the Moto G9 Power hits above its weight when it comes to the pictures that you can get from it (if the lighting is good and you have a steady hand).",
    "The end results are significantly inferior to what you would get from the top-tier phones of today, but then you're paying significantly less for them – and for a lot of people who aren't producing enlarged canvas prints of their snaps, the Moto G9 Power is going to offer enough in the photography department.",
    "We like the look of the phone too, especially considering its price, and it comes with a large (if low resolution) screen. While we should point out that there are a whole host of good, cheap phones around at the moment – including the Moto G9 Play and Moto G9 Plus, by the way – the Moto G9 Power is one of the best when it comes to that all-important value for money metric.",
    "The Moto G9 Power is out now and available to buy right away, with a recommended retail price of £179.99 in the UK and €199.99 in Europe. Motorola has said the phone will also be available in India, plus selected Asian, Middle Eastern and Latin American countries, though as yet there's no indication that the handset will go on sale in the US or Australia.",
    "You can pick up the phone SIM-free direct from Motorola, as well as from third-party retailers including Carphone Warehouse, Currys and Argos. As always, check the embedded widgets on this page for the best Moto G9 Power deals and prices currently available online.",
    "The Moto G9 Power is a big and relatively chunky smartphone, with a screen that stretches 6.8 inches from corner to corner, and a thickness of 9.66mm (0.38 inches) – and the camera bump adds on a little extra too.",
    "It's not what you would call premium in its looks, with its plastic back and its thick-ish bezels (especially on the bottom chin), but nor is it a disaster in the aesthetics department. It's what we've come to expect from Motorola phones: plain and unspectacular.",
    "We like the compact triple-lens rear camera arrangement: the silver metal banding around each lens (plus the flash) adds a smart touch of style. There's also a nice texture to the plastic back casing, which has small ridges like a fingerprint – it makes the phone easier to hold, and it improves its appearance at the same time.",
    "You don't get many design flourishes like that down at the budget end of the market. The fingerprint sensor is on the back of the phone as well.",
    "As is the norm, there are power and volume buttons down the right-hand side of the handset as you look at it, and Motorola has also added a Google Assistant button to the left-hand side – it's a feature we like, because it makes the digital assistant app a lot easier to launch when you can't yell out \"hey Google\" with your voice.",
    "A USB-C port provides charging and data transfer capabilities, while there's also a standard 3.5mm audio jack on the top for your wired headphones.",
    "Compared with the very best smartphones on the market, the Moto G9 Power does look like a less expensive alternative, but when you measure it up against handsets that cost a similar amount of money, it more than holds its own. It's fair to say that for what you're paying, the G9 Power is a decent-looking smartphone, and that's all that you can really ask.",
    "As is normal at this price point, there's no IP rating for water and dust protection – though the phone is marketed as 'water repellent' – and your color options are the gray-ish Metallic Sage (like our review model) and a more striking Electric Violet.",
    "You'll struggle to find a phone with a bigger display than the 6.8-inch one offered by the Moto G9 Power – though the Moto G9 Plus just manages it – and this is not a phone for those with small hands or tiny pockets. You can do a bit of photo-taking and feed-scrolling with one hand, but to reach all of the screen (and all of the on-screen keyboard) you're definitely going to have to use both hands.",
    "The LCD display runs at a resolution of 720 x 1640 pixels, which gives it a density of around 264 pixels-per-inch, and an aspect ratio of 20.5:9.",
    "It's not a bad screen, especially when you ramp up the brightness, but it lacks the color depth and contrast that you get with the best OLED screens, and there's no HDR support here – that means the lightest and darkest parts of your photos and videos won't be quite so well balanced.",
    "The refresh rate is a standard 60Hz too, which is another way in which it's set apart from more expensive competitors.",
    "There's really only one selling point when it comes to the screen on the Moto G9 Power, and that's the size of it – which is sort of negated by the low 720p resolution.",
    "It's perfectly fine for watching videos though, and in landscape mode that extra width really helps on modern-day movies and shows. You can opt to expand videos to fill the entire screen, but you do then get a solid black circle in the corner where the selfie camera sits.",
    "The display is perhaps one of the weakest parts of the whole Moto G9 Power package, and if screen quality matters to you, it might be worth spending a little bit more money to get a display that's quite a lot better. The strengths of this particular phone lie elsewhere.",
    "The Motorola G9 Power sticks to the basics when it comes to its camera setup, but in 2021 the basics are actually pretty decent. The main 64MP f/1.8 camera is the star of the show when it comes to the three cameras on the back (the flash is the fourth circle you can see), while the additional 2MP depth and 2MP macro cameras don't make a huge amount of difference as far as we could tell. There's a single 16MP snapper on the front.",
    "Images are pixel-binned to 16MP by default, which should be enough for most people's needs (you can capture the whole 64MP resolution if you want to, through the settings). Video recording, meanwhile, tops out at 1080p and 60 frames per second, and is acceptable enough without reaching the quality of higher-end phones that can offer better color depth, video stabilization and so on.",
    "Based on the shots we took with the Moto G9 Power – which were out of necessity taken on a snowy, overcast winter's day, given the timing of our review – the camera quality is one area where the phone gives you more than you might expect for the price. These pictures are unlikely to win any photography awards, but they're more than good enough for social media and casual use.",
    "In good lighting, details are sharp and colors are well balanced, and we were impressed with the ability of the HDR processing to keep darker and lighter areas of each shot visible. Shutter speed is a little on the slow side, but whether it was close up shots or scenery pictures, the G9 Power's rear camera produced the goods most of the time.",
    "Low light photography is very hit and miss, despite the presence of a night mode in the camera settings. Noise creeps in and a lot of detail gets lost, but at the same time we were able to get photos that were just about usable at night – and considering this is one of the cheapest phones around at the moment, that's not bad going at all. If low light shots really matter to you, you're going to have to spend a bit more cash.",
    "It's a shame that there's no ultra-wide camera here, but you could argue that it's not a feature that a lot of people use all that often anyway. There's no optical zoom either, though the digital zoom is just about bearable, if you use it sparingly.",
    "Thankfully the integrated camera app is very simple and straightforward to use, emphasizing the Moto G9 Power's value as a point-and-shoot camera.",
    "The Moto G9 Power comes with the low-end Qualcomm Snapdragon 662 chipset under the hood, which is matched with 4GB of RAM and 128GB of internal storage (which you can expand by slotting in a memory card).",
    "Those are pretty much the minimum specs in 2021 if you want your smartphone to actually work properly, and the internal specs are one of the areas where Motorola has worked hard to keep the price as low as possible.",
    "In other words, if you're spending this little for your next smartphone, you can't expect it to have blistering performance – as modest Geekbench scores of 311 (single-core), 1,371 (multi-core) and 371 (OpenCL) bear out.",
    "It does edge out some other similarly priced phones such as the Oppo A53, but if you can pay a bit more for something significantly faster like the OnePlus Nord N10 5G, it's probably going to be worth the additional outlay.",
    "While the Moto G9 Power can handle visually demanding games such as the Asphalt racing series or the mobile Call of Duty, there is the occasional stutter along the way, and you're not going to get the frame rates or the smoothness of a mid-ranger. It's not a question of the phone not being able to play certain apps and games, but you are going to have to get used to dialing down the quality settings most of the time.",
    "In day-to-day tasks there's no real problem with the Moto G9 Power, though some tasks – like switching to full screen video, or bringing up dozens of browser tabs at once – do take a few milliseconds longer than they do on a more powerful phone. It's not going to seriously impact how you use the phone, but it's noticeable when you cut back the specs to the extent that the G9 Power does.",
    "Of course not everyone needs the raw power of top-end flagships – in fact it's probably fair to say that the majority don't – and during our time with the Moto G9 Power we didn't notice any real slowdowns. From photo editing to podcast playing, the smartphone was responsive and fast enough to provide a polished user experience.",
    "You only get Android 10 on board unfortunately, rather than the very latest Android 11, but again this tends to be par for the course when you're down at the budget end of the market: Motorola says the Android 11 update is in the works for handsets including the G9 Power, so watch this space.",
    "Motorola's close-to-stock version of Android is at least clean and mostly bloat-free, and we prefer it to a lot of the busier, more fiddly Android skins out there (Chinese phone makers, we're looking at you).",
    "We do like the custom home screen widget that Motorola provides though, which gives you the time and an at-a-glance weather forecast (it can also tell you when the next rain shower is coming, which is really handy).",
    "You don't get 5G with the Moto G9 Power, we should point out. That's not uncommon at this end of the market, and at the moment it's not a huge problem – 5G has yet to find its way to large swathes of the world. If you're looking for a smartphone that's fully future-proofed, however, it's something to bear in mind.",
    "The clue's in the name – the Moto G9 Power's biggest selling point is definitely the huge capacity of its 6,000mAh battery, which with ordinary use should see you through two days, based on our testing. It's very difficult to drain this battery quickly, unless you're really trying, and in standby it doesn't fall much faster than 1% per hour. When video streaming, it drops around 10% every two hours.",
    "That large capacity, plus the low resolution screen and modest internal specs, mean you don't have to worry about charging the G9 Power every single night. When you do charge it, you need a cable – there's no wireless charging support – and you can take advantage of 20W fast charging. That's by no means the speediest on the market, but your phone should be fully juiced from zero in around an hour or so.",
    "In our time with the phone we were seeing battery levels of over 50% left by the end of the day, which is higher than any other handset we can think of in recent memory. If you're really pushing the G9 Power with GPS and gaming then you might struggle to get through the whole of that second day, but it's not usual nowadays to find a smartphone that you can still get hours of use from after an entire day and night.",
    "As always there's the caveat that we're testing a brand new phone with a brand new battery, but battery life is definitely the main reason besides the low price to put the Moto G9 Power on your shopping list. It's perfect if you spend extended periods of time away from a charging socket (or you just tend to forget to put your phone on charge).",
    "First reviewed: January 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Moto G9 Power price and availability",
    "10": "Design",
    "18": "Display",
    "25": "Camera",
    "32": "Specs and performance",
    "43": "Battery life",
    "47": "Don't buy it if..."
  },
  "links": {
    "These are the phones": "https://www.techradar.com/news/best-moto-phones",
    "Moto G9 Play": "https://www.techradar.com/news/the-moto-g9-just-launched-but-you-cant-buy-it-yet",
    "Moto G9 Plus": "https://www.techradar.com/reviews/moto-g9-plus-review",
    "Motorola": "https://www.motorola.co.uk/smartphones-moto-g-power-gen-9/p?skuId=397",
    "Carphone Warehouse": "https://www.awin1.com/awclick.php?awinmid=2264&awinaffid=103504&clickref=trd-us-2562990497768668700&p=https%3A%2F%2Fwww.carphonewarehouse.com%2Fmotorola%2Fg9-power.html#!colour=violet&capacity=128GB&dealType=pm",
    "Currys": "https://www.awin1.com/awclick.php?awinmid=22479&awinaffid=103504&clickref=trd-us-1360812916039639800&p=https%3A%2F%2Fwww.currys.co.uk%2Fgbuk%2Fphones-broadband-and-sat-nav%2Fmobile-phones-and-accessories%2Fmobile-phones%2Fmotorola-moto-g9-power-128-gb-metallic-green-10218748-pdt.html",
    "Argos": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1378883825043389000/https://www.argos.co.uk/product/8782045?%24ja=tsid%3A11674%7Cprd%3A6361382",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "Images are pixel-binned": "https://www.techradar.com/how-to/what-is-pixel-binning-and-how-can-it-help-my-smartphone-photography",
    "Oppo A53": "https://www.techradar.com/reviews/oppo-a53",
    "OnePlus Nord N10 5G": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Motorola says": "https://www.techradar.com/news/motorolas-android-11-update-plans-include-lots-of-phones-and-lots-of-omissions"
  }
}