{
  "source": "https://www.techradar.com/reviews/ecwid-ecommerce",
  "title": "Ecwid ecommerce review",
  "category": "computing",
  "updated": "2021-07-13T05:18:30Z",
  "author": "daniel-blechynden",
  "summary": "Add an online store to your existing website with this powerful tool",
  "verdict": "With its suite of ecommerce tools, competitive prices, and user-friendly management interface, Ecwid stands out as an excellent tool to help you add a store to your existing website.",
  "pros": [
    "Excellent automatic translation tools",
    "Powerful “free forever” plan"
  ],
  "cons": [
    "Instant store builder is limited",
    "Not ideal for building a standalone store"
  ],
  "article": [
    "With the best ecommerce platforms, virtually anyone can build their own online store. There are countless high-end options available, and all of them have their pros and cons.",
    "In our Ecwid review, we take a close look at one of the world’s leading ecommerce software providers. Before we start, it’s important to note that, although possible, it’s not an ideal option for building a standalone store. Rather, it’s designed predominately to help you add a store to an existing website or third-party marketplace.",
    "By analyzing the platform’s prices, main features, support, security, user interface, and more, we aim to provide you with the information that you need to decide whether it’s the right choice for your new store.",
    "Ecwid offers some of the most competitive ecommerce pricing that we’ve seen. There’s a “free forever” plan, along with paid options. Annual discounts are also available.",
    "With the free forever plan, you will be able to create a simple online store. You can take advantage of various advertising integrations, a mobile responsive shopping cart, and basic ecommerce tools. However, you will be limited to selling 10 products, and digital sales aren’t available.",
    "Upgrading to the Venture plan costs $15 per month ($12.50 with annual payments) and adds Facebook and Instagram selling, along with mobile point-of-sale (POS). You will also get access to a mobile store management app and support for up to 100 products, including digital goods.",
    "The Business plan ($35 per month, $29.17 with annual payments) adds Amazon and eBay selling, along with Mailchimp integration. You’ll be able to list up to 2,500 products and have access to all advanced ecommerce tools.",
    "Finally, the most expensive Unlimited plan costs $99 per month ($82.50 if you pay annually) and adds support for a custom mobile store app. List unlimited products, access priority support, and take advantage of 12 hours of free design help.",
    "With Ecwid, you will have access to all the expected ecommerce tools, including an inventory management portal, store analytics, and order management.",
    "One particularly noteworthy feature is the custom store app creation tool. With this, you can build your own mobile store app, complete with custom branding and integrated payment options. Note, though, that this is only available with an Unlimited subscription.",
    "Ecwid also offers full point-of-sale (POS) functionality, which allows you to sell through your store from physical locations. For example, if you run an online merchandise store, you might decide to set up at a street market occasionally. The POS tools make it extremely easy to collect payment.",
    "This feature makes Ecwid stand out above its competitors. With automatic translation into over 45 languages, your store will be presented to prospective customers in their native language (based on their web browser language).",
    "To get started with Ecwid’s free plan, simply create a new account and follow the prompts to set up your store. You will be taken to the management dashboard, which includes a to-do list to help you get started and all the tools that you will need to look after your store.",
    "Navigating to the store editor will give you access to a suite of customization options. Select from numerous themes, and take advantage of the various global design tools. The design flexibility is quite limited, however.",
    "You can also create or upload your own theme if required.",
    "All Ecwid users will have access to the company Help Center, which contains a broad selection of guides, tutorials, and other self-help resources. Use the built-in search bar to find exactly what you’re looking for. Online ticket support is also available for all users.",
    "Anyone with a paid subscription can access live chat support, but phone service is only available with the Business and Unlimited plans. Unlimited subscribers will also benefit from priority support.",
    "Like most reliable ecommerce service providers, Ecwid offers excellent security across the board. All stores always connect via HTTPS to ensure that sensitive information can’t be leaked. Credit card information and other personal details are never collected or stored.",
    "Ecwid also boasts a Level 1 PCI DSS certification, which essentially means that you can rely on it to facilitate secure data transmission. Finally, it's backed by secure Amazon Web Services (AWS) hosting.",
    "If you’re looking for another all-in-one platform that boasts a great reputation and industry-leading tools, you must consider Shopify. Prices start from $29 per month, which is slightly more expensive than Ecwid’s Venture plan, but the wide variety of Shopify’s ecommerce features must be seen to be believed.",
    "Another great alternative is Wix. There are few better options if you want to build a content-based site with a small online store. You will benefit from the beginner-friendly site editor and excellent design flexibility across the board.",
    "Overall, Ecwid stands out as an excellent ecommerce tool for some people. It offers excellent online selling tools, along with competitive management features and a free forever plan.",
    "However, the store builder is quite limited, which means it’s not a great option to use on its own. That said, we highly recommend using Ecwid if you want to add an online store to an existing website."
  ],
  "headers": {
    "3": "Plans and pricing",
    "8": "Features",
    "12": "Interface and in use",
    "15": "Support",
    "17": "Security",
    "19": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "best ecommerce platforms": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "online store": "https://www.techradar.com/how-to/start-an-online-store-from-scratch-and-drive-sales",
    "Ecwid": "https://www.ecwid.com/home",
    "free forever plan": "https://www.ecwid.com/price",
    "shopping cart": "https://www.techradar.com/best/best-shopping-cart-software",
    "Venture plan": "https://www.ecwid.com/price",
    "POS": "https://www.techradar.com/news/the-best-pos-system",
    "Business plan": "https://www.ecwid.com/price",
    "ecommerce tools": "https://www.techradar.com/best/ecommerce-tools",
    "Unlimited plan": "https://www.ecwid.com/price",
    "AWS": "https://www.techradar.com/news/aws",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "Wix": "https://www.techradar.com/reviews/wix"
  }
}