{
  "source": "https://www.techradar.com/reviews/widgio",
  "title": "Widg.io widget builder review",
  "category": "computing",
  "updated": "2021-03-29T01:56:41Z",
  "author": "alexis-james",
  "summary": "Innovative plug-and-play widgets that work with any website platform",
  "verdict": "If your website is crying out for some new functionality, you could do a lot worse than trying out the wide range of inventive widgets on offer from Widg.io.",
  "pros": [
    "Over 50 widgets",
    "Compatible with most web platforms",
    "Low entry cost"
  ],
  "cons": [
    "Watermark on free version"
  ],
  "article": [
    "If your website is missing some key functionality but you're generally happy with its design, then you might want to consider the innovative plug-and-play service offered by Widg.io.",
    "As an alternative to wholesale rebuilding your website, Widg.io provides over 50 widgets that can be implemented into your existing site without needing a developer or prior coding knowledge. In this Widg.io review, we'll take a look at how exactly this can be done and how much it will cost.",
    "To read about other market-leading website builders, check out our best website builder guide.",
    "Widg.io’s unique pricing structure ensures customers only ever pay for the widgets they use, with costs also tied to the number of views a widget has. It means that those with a small website won’t be required to pay the same cost as a business that welcomes thousands of visitors a day.",
    "Free watermarked widgets are available for customers for whom a widget is only likely to be viewed less than 200 times a month. For anything above that, the Lite package costs around $7 per widget and can be used on unlimited websites, with 2,500 maximum views.",
    "The Pro option allows 20,000 views per widget and includes live chat support, while the Premium package allows up to 500,000 views per widget.",
    "For those prepared to pay the annual cost upfront, there is a 20% discount. Widg.io also offers bundle packages that can provide access to all widgets, of which over 50 are currently available.",
    "Divided into subsections including chat, reviews, eCommerce, images, and social, Widg.io's list of available widgets gives customers a vast choice spanning various functions.",
    "Among the bestsellers include WhatsApp chat, All-in-One Reviews, Countdown Timer, and Instagram Feed. There are also widgets for embedding YouTube and Vimeo videos, and even an integrated Spotify player for websites to provide an audio experience for visitors.",
    "\"We play well with others\" reads the Widg.io website blurb, and with the full list of compatible web hosting platforms totaling well over 35, it's hard to disagree. The list includes the most popular hosting platforms, website builders, and landing page builders, including GoDaddy, Google Sites, WordPress, and Wix.",
    "For detailed information on how Widg.io integrates with each platform, users can head to the integrations page and click on the relevant platform logo. Here you'll find instructions on how each widget, after being customized, can be installed onto your existing site.",
    "The team at Widg.io are constantly adding new widgets to their range, and are receptive to suggestions from their customers. If the widget you require does not appear to be listed, the Widg.io team encourages users to head to the Feature Wishlist page. There they’ll be asked four questions on a Widget Builder form. If the creators can help with your bespoke request, they’ll get in touch.",
    "Creating and customizing a widget for your existing site couldn’t be simpler, as it’s all done on the Widg.io website. Simply sign up for a Widg.io account and log in to see the full selection of widgets available. Once you’ve chosen the widget you want, you’ll be given a choice of templates, ranging in styles and colors to allow you to pick the one that will best match your site design.",
    "From the editor you can make further tweaks, and you'll be prompted to add additional required information that will tailor the content and style of the widget. At any time you can see how it will look via the Preview Window on the right, and you can test how your widget will look on different screen sizes by toggling between desktop, tablet, and mobile modes.",
    "Once you're happy with how it looks, you'll be able to click Add to Website, which will provide you with code required to embed the widget on your website. Platform-specific instructions are also provided at this point.",
    "The process of signing up for Widg.io and of customizing your chosen widgets is intuitive throughout. But what's particularly impressive about Widg.io is the sheer breadth of platform-specific information provided at every step, ensuring the user is fully informed on how to implement the widgets on their own site.",
    "Should users encounter issues, Widg.io's Support Center includes a comprehensive bank of tutorials covering all possible platform integrations. If your query remains unresolved, users on the Pro package or above can access the live chat service, while users on the Lite option will get email support.",
    "The likes of Elfsight and Powr can be considered like-for-like competition for Widg.io. In the case of the former, its offering is very similar to Widg.io in terms of pricing structures and cost, though it does have a wider selection of widgets to choose from.",
    "Powr has the fewest widgets (which it calls plugins) available and comes a bit higher in price for single-widget subscriptions, though its business package is roughly in line with both Elfsight and Powr.",
    "Given that all three services offer free basic versions of all their widgets, the smart choice is to test and try each of them, making an informed choice based on the type of widget you require and how it fits in with your existing website.",
    "It’s key to note here that while the uninitiated may consider Widg.io to be a website builder in the mold of Wix, Squarespace, or Weebly, the platform doesn’t offer page-by-page website-building or hosting capabilities. Instead it’s best to consider Widg.io as a complimentary service, potentially offering a wider choice of add-ons than may be readily available with your existing web platform.",
    "With that in mind, for those who are content with their website design and platform but have a specific need for a function that is either unavailable or unsuitable, it’s certainly worth testing out the options over at Widg.io to see if their customizable and easy-to-install widgets provide the solution."
  ],
  "headers": {
    "3": "Plans and pricing",
    "7": "Features",
    "12": "Interface and in use",
    "15": "Support",
    "17": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "Widg.io": "https://www.widg.io/",
    "best website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Lite package": "https://www.widg.io/pricing",
    "Pro": "https://www.widg.io/pricing",
    "Premium package": "https://www.widg.io/pricing",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "website builders": "https://www.techradar.com/news/the-best-website-builder",
    "landing page builders": "https://www.techradar.com/best/landing-page-creator",
    "Feature Wishlist": "https://www.widg.io/feature-wishlist",
    "Elfsight": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9907899585444979000&xs=1&url=https%3A%2F%2Felfsight.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwidgio",
    "Powr": "https://www.powr.io/plugins",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "Weebly,": "https://www.techradar.com/reviews/weebly"
  }
}