{
  "source": "https://www.techradar.com/reviews/careerbuilder",
  "title": "CareerBuilder review",
  "category": "computing",
  "updated": "2021-11-29T07:27:27Z",
  "author": "mike-jennings",
  "summary": "Are the AI-powered features on CareerBuilder worth using if you want to apply for a job or find new staff?",
  "verdict": "CareerBuilder is a fast and straightforward option for job seekers and recruiters, but it’s not the biggest or most affordable option.",
  "pros": [
    "Useful AI features",
    "Impressive speed",
    "Consistently easy to use"
  ],
  "cons": [
    "Moderate database size",
    "Expensive for recruiters"
  ],
  "article": [
    "CareerBuilder aims to provide an enormous range of features for job seekers and employers with an emphasis on speed that you won’t often find elsewhere.",
    "That’s an admirable aim for any job site, and it’ll be impressive if the site can succeed in the face of plenty of bigger and more well-known rivals. But it does mean that CareerBuilder is going to have to go some way to outpace the competition, and it’ll have to impress to justify its relatively pricey recruitment tiers.",
    "CareerBuilder is impressively easy to use if you’re a job seeker. When you sign up for an account, you can upload your resume, transfer it from your cloud storage site or enter information about your work and education history and allow the site to build your resume instantly. You can fine-tune communications preferences and be alerted when your job applications or resumes are viewed.",
    "Once you’ve built your profile, you can explore CareerBuilder’s job listings. Many on the site use the site’s one-click application system, and you can filter positions by the job type, posting date and pay level. Users can also select only to see jobs with easy apply and remote working options.",
    "There’s a big emphasis on AI on CareerBuilder, too, and it’s visible throughout the site. Your resume is enhanced with AI during the building process, and the site also uses AI and your previous actions to deliver lists of recommended jobs.",
    "CareerBuilder has a salary search module that indicates the range of salaries you should expect for any chosen job – so you can see if you’re being offered above average or underwhelming remuneration.",
    "The site also has a career advice hub with articles about a wide selection of topics, from the highest-paying jobs and key skills to tips on job interview clothing and best locations for certain industries.",
    "As usual, job hunters can create personalized job alerts and use Android and iOS apps to search for jobs on the move. The apps also provide push notifications if likely jobs are listed.",
    "Negatively, though, CareerBuilder does have a reputation for sending too many irrelevant emails, and it could do with more filtering options on searches – they’re basic compared to many other job boards.",
    "Recruiters can easily post job listings on CareerBuilder, with AI features used to automate and complete many of the more mundane parts of the process, and AI can help create the job description, so you won’t miss any obvious topics.",
    "You’ll get alerts when CareerBuilder detects a potentially ideal new candidate – up to a limit of 25 per day – and the site has a superb dashboard that provides a huge amount of data about your job listing and applicants. You can send job listings to targeted groups of candidates, and automate that process, and see the salaries your competitors are offering for similar positions.",
    "Elsewhere, CareerBuilder claims to have more than 20 million active job seekers and over 140 million resumes, which is a solid number, and it integrates with more than 70 ATS products.",
    "That’s good, and you can drill down into CareerBuilder’s extra products if you want to build a careers website, get specialist help with candidate sourcing or improve your social network presence.",
    "There’s no doubt that other sites like Indeed and LinkedIn have bigger talent pools, though, and CareerBuilder isn’t an aggregator, so it doesn’t pull in job listings from other sites.",
    "This isn’t the cheapest site for recruiters, either. If you pay for CareerBuilder’s Lite package it’ll cost you $219 per month and you’re able to post one job listing each month and view 500 resumes. The $299 per month Standard package allows you to list three jobs, and the $599 Pro option upgrades that to five jobs.",
    "All of those packages provide the same features elsewhere, and you can pay extra to add additional products and services – although you’ll have to talk to CareerBuilder to discuss those.",
    "There’s also a Build Your Own package, which allows more flexibility. It starts with a one-off cost of $375 and allows companies to post a single job and view resumes and profiles for thirty days. You can add additional jobs to this package for an extra $250 per posting. Not many sites offer this sort of package, and it does increase CareerBuilder’s versatility.",
    "CareerBuilder offers a good range of features for job seekers and recruiters, but it’s rarely able to overhaul some of the bigger names in the space.",
    "If you’re on the hunt for a job, you can quickly and easily apply for positions using CareerBuilder. Its decent AI features can provide you with recommended roles with minimum effort. Recruiters benefit from that AI and speed, too, and the site is easy to use – but it’s pricier than rivals, and doesn’t have the biggest database of candidates.",
    "CareerBuilder is a reasonably good job site, and it does succeed when it comes to offering speed and ease of use, but other sites have more features and bigger databases, so they should arguably be your first choice.",
    "We've also highlighted the best US job sites, best free job boards and best recruitment platforms",
    "CareerBuilder receives a 6.7 average rating from reviews, while Monster holds the higher rating with 7.6.",
    "Features: A massive database with over 80 million job seeker profiles, advertising starting with the basic plan, resume match notifications, social media profile search, and seamless integration with any existing Applicant Tracking System (ATS) are some of the features offered by CareerBuilder.",
    "Monster is known for allowing users to reach their audience proactively as open positions are advertised in local news websites in the United States. Their features include resume search, staffing services, and a mobile app that lets users create video job descriptions, among others. Monster also offers recruitment marketing, employer branding, and reusable job postings.",
    "Pricing: CareerBuilder’s plans are called Lite, Standard, and Pro. These plans go for $219, $299, and $599 per month. On top of these plans, the freedom to DIY a plan to suit your needs is available for a one-time fee of $375. Add-ons can be purchased on top of these monthly fees so you can further tailor your plan to your needs. Enterprise and mid-market corporations have different pricing schemes.",
    "Much like CareerBuilder, Monster also has three pricing tiers available. These plans are Starter for $279 per month, Standard for $399 per month, and the highest tier, Premium, with a monthly fee of $649. These plans offer one, three, and five job postings, 50-250 resume views, and both Standard and Premium come with a feature called Performance Booster.",
    "Conclusion: Monster’s rating is higher than that of CareerBuilder's for a reason. Most companies prefer Monster’s straightforward plan feature distribution and more reasonable pricing schemes in each of these plans. There’s also a 4-day trial available.",
    "Craigslist has an average rating of 3.8, while CareerBuilder is preferred by some with a 6.7 average rating.",
    "Features: Craigslist has one of the largest job boards you’ll find, with a million new job posts added on a monthly basis. That said, posting on this platform gives users a massive number of viewers. Unlike most job boards, however, Craigslist does not offer automations such as employee tracking. One might refer to Craigslist as an online classified ads and just that.",
    "CareerBuilder, on the other hand, is the job board of choice for large companies. It offers the convenience of features such as resume match notifications, application alerts, custom lists to manage candidates, and profile search via resumes or even social profiles. It’s more advanced compared to Craigslist.",
    "Pricing: CareerBuilder offers three plans from employers that start at $219 per month, all of which give users up to five job listings per month, 500 resume views, and all the features mentioned above. Lite markets for a meager $219, while Standard and Pro cost $299 and $599 per month respectively. Users have the option to pay a one-time $375 fee for a build-your-own plan that posts one job and gives them all the perks of the paid plans.",
    "Craiglist does not have the benefits of set plans. Instead, they charge per job post. This is preferred by smaller companies or those who aren’t always scouting for new talents. The rates of job posts depend on the location, which can be anywhere from $10 to $75.",
    "Conclusion: Craigslist and CareerBuilder are excellent choices as they both have a huge audience. If you’re not constantly hiring, Craigslist is a more affordable choice, while CareerBuilder is great if there’s more than one role to fill.",
    "CareerBuilder has a 6.7 rating from users, while LinkedIn leads with an average rating of 8.4 from users.",
    "Features: Both let users search for resumes from their database. CareerBuilder’s database houses 140 million resumes including social profiles. They help users build a pipeline that makes engagements with candidates automated and include features like display advertising, multiple sourcing tools, and digital resume captures, among others.",
    "LinkedIn’s massive network of 675 million and growing means every job post reaches a huge audience (35 million weekly visitors). LinkedIn has integrated applicant tools that let users filter out candidates based on skills, industry, experience, interests, and reach out to them without having to leave the platform. A favorite feature is LinkedIn’s interview scheduler.",
    "Pricing: LinkedIn’s pricing plans are called Recruiter Lite, which has a $99.95 monthly fee, and Recruiter + Job slots, with a monthly fee that starts at $825. The first plan lets users start building a pipeline for candidates and gives them up to 30 InMail messages. The latter also lets you post jobs and get up to 150 InMail messages monthly.",
    "CareerBuilder’s plans are priced at $219, $299, and $599 per month (Lite, Standard, and Pro). These plans help you connect with the best candidates faster when you post up to five jobs and have add-ons that can give you access to optimized career sites and let you access resumes in one snapshot. A one-time payment of $375 lets you build your own plan.",
    "Conclusion: LinkedIn is definitely pricier than most options, but it’s still preferred by many because of the reach to a huge pool of professionals, and because it’s also a social media platform at the same time.",
    "Glassdoor has a higher overall rating at 7.1, while CareerBuilder follows with a 6.7.",
    "Features: CareerBuilder makes finding the right people fast, easy and affordable. They offer commitment-free subscriptions, access to millions of candidate profiles, and AI-powered matching, a sophisticated matching technology that finds the candidates for you. You can also manage your applicant comments and messages all in one place.",
    "It’s estimated that 80% of job seekers in the United States can be reached via Glassdoor. As a result, Glassdoor’s top priority has been to ensure your employer branding needs are met, and this is delivered via their rich features that help you grow brand awareness, understand your job seekers by comparison and analysis, and increase your influence.",
    "Pricing: CareerBuilder has comprehensive plans called Lite, Standard, and Pro. Lite is a $219 monthly subscription where you can have one job post and 500 resume views each month. Standard is a $299 monthly plan for three job postings, while Pro allows up to five at $599. Add-ons can also be availed should you want to streamline your hiring process.",
    "The Free, Standard and Select monthly plans Glassdoor offers are available for $219-$599. These plans will let you get started with sharing company information, creating your Employer Profile Analytics, featuring reviews, and getting insights for targeting an audience, among others.",
    "Conclusion: Glassdoor, when used in conjunction with Indeed, is a very powerful recruiting tool that’s reasonably priced considering the reach entailed. When you’re able to reach 80% of the applicants, there really should be no other place to seek applicants."
  ],
  "headers": {
    "2": "Features",
    "14": "Plans and pricing",
    "17": "Final verdict",
    "21": "CareerBuilder vs Monster",
    "27": "CareerBuilder vs Craigslist",
    "33": "CareerBuilder vs LinkedIn",
    "39": "CareerBuilder vs Glassdoor"
  },
  "links": {
    "CareerBuilder": "https://www.careerbuilder.com/",
    "job site": "https://www.techradar.com/best/us-job-sites",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "A": "https://www.techradar.com/best/recruitment-platforms",
    "TS products": "https://www.techradar.com/best/recruitment-platforms",
    "Indeed": "https://www.techradar.com/reviews/indeed",
    "LinkedIn": "https://www.techradar.com/reviews/linkedin-jobs",
    "Lite": "https://hiring.careerbuilder.com/post-jobs",
    "Standard": "https://hiring.careerbuilder.com/post-jobs",
    "Pro": "https://hiring.careerbuilder.com/post-jobs",
    "Build Your Own": "https://hiring.careerbuilder.com/post-jobs",
    "best US job sites": "https://www.techradar.com/best/us-job-sites",
    "best free job boards": "https://www.techradar.com/best/free-job-boards",
    "best recruitment platforms": "https://www.techradar.com/best/recruitment-platforms"
  }
}