{
  "source": "https://www.techradar.com/reviews/google-nest-doorbell-battery",
  "title": "Google Nest Doorbell (battery) review",
  "category": "smart-home",
  "updated": "2021-10-14T09:30:00Z",
  "author": "esat-dedezade",
  "summary": "A handsome smart doorbell that’s ideal for Google-powered homes",
  "verdict": "The Nest Doorbell is a beautifully designed bit of kit. Resembling a futuristic device sent to guard your home, it records clear footage when the doorbell is pressed or motion is detected, and even identifies when packages are left or taken, as well as animals and recognize faces. However, if you want more than three hours of video storage or facial recognition though, you’ll need a Nest Aware subscription.",
  "pros": [
    "Clear footage during the day and at night",
    "Easy installation",
    "Facial recognition"
  ],
  "cons": [
    "Free storage might be limiting for some",
    "No Alexa or Siri support",
    "Battery isn’t swappable"
  ],
  "article": [
    "Google may not have the same legacy as Ring and Arlo when it comes to the smart security market, having only launched its first device in 2017. However, with cutting-edge tech such as facial recognition and integration with its voice assistant, it’s very quickly becoming a substantial rival.",
    "The Nest Hello was the brand’s first video doorbell, which was launched in 2018 but was a mains-powered doorbell. Now Google has followed up with a battery-powered option, that’s slightly more affordable too.",
    "Easily the best-looking doorbell to grace our home, its sleek, minimal design will stand out for all the right reasons and is a breath of fresh air amongst the other clunkier options out there. Housed within its frame is a hefty 6,000mAh battery, which can provide up to six months of use per charge.",
    "The not-quite HD camera’s unique portrait aspect ratio narrows the field of view to 145 degrees from the Nest Hello’s 160-degree angle but makes up for it by showing full bodies as well as items like packages that are left on the ground.",
    "The Google Nest Doorbell (battery) will send an alert to your smartphone if the button is pressed or the doorbell detects motion, enabling you to view the camera’s live feed from the Google Home app. It can differentiate between people and animals and is even clever enough to notify you when packages have been left or taken. HDR ensures details are clearly visible, even when the surroundings are particularly bright or shadows are being cast, and a 6x zoom lets you enlarge footage too.",
    "Video clips of these events are stored for up to three hours after they’ve been recorded, so you can review them. However, to access them for up to 60 days you’ll need to subscribe to Nest Aware. This also unlocks access to the Familiar Face feature, which allows you to assign names to people detected by the camera, and get an alert next time they appear in the doorbell's field of view.",
    "The video doorbell can store up to 60 minutes of video locally if the Wi-Fi goes down, or the power is cut, too. This will be uploaded to the cloud, and subsequently appear in the timeline of events in the app, when the doorbell comes back online.",
    "If you’ve got a house filled with Nest speakers or screens already, then this is a no-brainer, especially as you can see the camera feed through Nest screens as well as your phone. If you’re in the Alexa camp though, then you’re better off with something like the Ring Video Doorbell 4, which can be snapped up for the same price.",
    "At $179.99 / £179.99 / AU$329 the Nest Doorbell (battery) is ideal for renters and anyone that shies away from DIY, or for those who want to review footage for a limited time after it’s captured without having to pay for a subscription for a cloud storage service.",
    "The Google Nest Doorbell (battery) will set you back $179.99 / £179.99 / AU$329, which is slightly more affordable than the Nest Doorbell (wired), which was previously known as the Nest Hello, and costs $229 / £229 - it’s currently not available in Australia. However, this can capture higher-resolution footage, has a wider field of view, and offers an 8x zoom too. It’s almost identically priced to its closest rival, the Ring Video Doorbell 4, which costs $199.99 / £179 / AU$329. As we’ve mentioned, the Google Nest Doorbell (battery) will store video clips recorded by the camera for up to three hours free of charge. If you want to be able to view clips for a longer period you can subscribe to the Nest Aware service, which offers continuous recording and stores footage for up to 60 days, with prices starting from $5 / £5 / AU$9 per month.",
    "There are no two ways about it — as far as doorbells go, the Nest Doorbell (battery) is a veritable work of art. Seriously, when we first laid eyes on it, we were taken aback by its sleek, minimal, futuristic design, especially compared to that of the boxy, utilitarian look of rivals from Eufy and Ring.",
    "Its long flat body and symmetrically positioned circular camera and ring button lend it a clean refreshing air that’s unlike any other doorbell you’re likely to come across. Measuring 1.8 in x 0.95 in x 6.3 inches / 4.6 x 2.41 x 16 cm (w x d h), it's one of the most compact video doorbells we’ve tested to date.",
    "The 145-degree camera, which has a resolution of 960 x 1280 and records footage at 30fps, is housed in the black circular fascia at the top of the doorbell, along with the speaker and microphone that enable you to converse with anyone in the camera’s field of view. Meanwhile, the doorbell’s button sits in line with the camera lens at the bottom of the unit.",
    "Made from sturdy plastic and including all the mounting kit you need in the box, installation is simple enough for even those with the most basic of DIY skills. Screw the mount into your door frame, clip it in, and you’re good to go. There’s a tiny security key-like device which you insert at the top to remove it for charging (more on that in a bit), and that’s pretty much it as far as wireless installation is concerned.",
    "Things are a little trickier if you’re replacing an existing wired doorbell and opting for a wired installation, but not by much. It’s just a case of attaching the supplied connectors to the doorbell before hooking those up to your existing doorbell wires.",
    "The Google Nest Doorbell (battery) recorded clear footage both during the day and at night, despite the fact it’s the lowest resolution doorbell we’ve tested to date. Still, we can’t help but feel that Full HD should be the minimum mark to aim for.",
    "The unconventional 3:4 aspect ratio provides portrait footage, rather than the landscape footage you get from other video doorbells on the market. While you lose a bit of vision from the side, we actually love the ratio as it lets you see the entirety of a person from head to toe, as well as things like packages being left on the ground, or needy cats pawing at the bottom of the door. With a landscape camera, you lose quite a bit of crucial footage nearer the ground, so the Nest Doorbell (battery) takes the edge for us.",
    "The Google Nest Doorbell (battery) proved effective at identifying people in its field of view, as well as animals and vehicles. If the camera is used with a Nest Aware subscription you can assign names to faces of friends and family, and when you receive an alert you’ll be notified whether it’s a recognized face or a stranger in the camera’s field of view.",
    "One area where the Nest Doorbell (battery) falls short though, is the fact that you can’t buy wireless plug-in chimes for it, which is something offered by rivals like Ring. This means that if you don’t have a Google speaker such as the Nest Audio, or a compatible smart display like the Lenovo Smart Clock or Nest Hub Max, you’ll only be notified via the Home app on your smartphone.",
    "While most of us have our phones on us at all times, if yours tends to be on silent mode, you won’t hear any notification sounds, which can be a risk. It’s worth noting that if you’re going for a wired installation of the Nest Doorbell (battery), it will work with your existing wired doorbell chime.",
    "The Nest Doorbell (battery) uses Google’s Home app rather than the one offered by Nest. Setup is quick and easy, and the app itself is minimal and easy to navigate, with a plethora of options and features available.",
    "One of the most important of these is the ability to set motion zones, letting the app know that only movement in these zones is of importance to you. This is particularly useful if you don’t want regular activity firing off your motion notifications all the time. In our case, we set things up so that only our front garden was a priority, so that passing cars and our neighbor’s front garden wouldn’t trigger any alerts.",
    "Taking things one step further, you have some powerful customization options available. You can, for example, set it so that you’re notified of approaching people and packages being left on the ground while ignoring movement by cars and animals. This is a great feature that sets the Next Doorbell (battery) apart from the Ring Doorbell range, as it’s included for free without requiring a subscription.",
    "Not only that, but Nest’s offering is clever enough to know if a package has been removed, alerting you to any pesky parcel thieves. Oddly though, you have to manually deselect event notifications outside of the motion zone you’ve set, which is an extra step that’s rather unnecessary, given the trouble you’d have already taken to let the app know which zones you’re interested in.",
    "Once you’ve tweaked things to your liking though, you’ve got yourself a very capable, clever camera that can alert you to only the events you care about.",
    "The best part about all this is that these clever recognition tricks are all completely free. Its ability to store three hours of video footage to local storage is a great boon too, though if this was bumped up a bit higher, we wouldn’t complain. If something happened at 3am, for example, you’d have to catch it by 6am or lose the footage.",
    "The only real reason you’d need to fork out extra for a Nest Aware subscription is if you want facial recognition smarts or longer storage options. However, this doorbell doesn’t offer the 10 days of 24/7 continuous video history that Nest Doorbell (wired) users can get on the most expensive Nest Aware plan, even if it’s undergone a wired installation.",
    "The upshot of all this is that, in our opinion, most people can comfortably get away with using the free functionality of the Nest Doorbell (battery) without having to spend a penny, which is a superb pro in a world where core features are being hidden behind pesky paywalls.",
    "As expected, the battery life of the Nest Doorbell (battery) will vary depending on how much it’s being used including how often the doorbell is pressed, the number of motion events it detects, and how often the doorbell’s live feed is viewed from the app. Google claims the battery will last six months before needing to be recharged. However, this is based on only around two to four recorded events per day. It drops down to two and a half months with 13 to 16 recorded events per day, and one month with 25 to 30 recorded events per day.",
    "In our case, it took just under one and a half months before we had to recharge the Nest Doorbell (battery). While that might not sound like a long time, it’s pretty impressive given the heavy testing we put the doorbell through in its first couple of weeks.",
    "While USB-C recharging is simple enough though, we’d have loved a swappable battery that means, providing you can purchase an additional battery, the doorbell isn’t out of action when the battery runs out. We found it took around five hours to fully recharge the battery.",
    "As we’ve mentioned already, the doorbell can be connected to the mains power. However, it’s worth noting, this provides a trickle charge to the battery. Depending on how the doorbell is being used, the battery may drain faster than the hard-wire can charge it, so you may still need to use the USB-C cable to recharge it yourself.",
    "First reviewed: October 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Google Nest Doorbell (battery) price and availability",
    "10": "Design",
    "15": "Performance",
    "20": "App",
    "28": "Battery life",
    "32": "Don't buy it if..."
  },
  "links": {
    "Nest Hello": "https://www.techradar.com/reviews/nest-hello",
    "video doorbell": "https://www.techradar.com/best/best-video-doorbells",
    "Ring Video Doorbell 4": "https://www.techradar.com/reviews/ring-video-doorbell-4",
    "Nest Audio": "https://www.techradar.com/reviews/google-nest-audio",
    "Lenovo Smart Clock": "https://www.techradar.com/reviews/lenovo-smart-clock-review",
    "Nest Hub Max": "https://www.techradar.com/reviews/google-nest-hub-max"
  }
}