{
  "source": "https://www.techradar.com/reviews/hammerhead-karoo-2",
  "title": "Hammerhead Karoo 2 review",
  "category": "fitness",
  "updated": "2021-02-22T12:11:42Z",
  "author": "rob-clymo",
  "summary": "A head unit that ticks all the right bike computer boxes",
  "verdict": "There’s a lot to like about the Hammerhead Karoo 2 bike computer, which gives rivals from Garmin and Wahoo a run for their money. Expect Android smartphone-style performance and functions combined with excellent usability from this rugged-yet-refined head unit for an end product that’s a little pricey, but very impressive.",
  "pros": [
    "High resolution screen",
    "Responsive touchscreen",
    "Comes with a robust mount"
  ],
  "cons": [
    "Relatively pricey",
    "Menus take time to master",
    "Exposed charge port"
  ],
  "article": [
    "The Hammerhead Karoo 2 is a bike computer, or head unit, which will appeal if you're a keen cyclist who requires a device that can take on leading brands like Garmin or Wahoo but offers a decent variation on the theme.",
    "It features excellent build quality, plenty of practical features that cyclists need for the great outdoors and is easy to use thanks to its Android-powered smartphone-like interface. Navigation is a doddle thanks to the built-in GPS and intuitive map system, plus there’s integration with the likes of Strava, TrainingPeaks, Ride with GPS and more.",
    "The Hammerhead Karoo 2 also benefits from a rugged design that can be quickly mounted to your bike, while its battery life is more than enough to ensure you get from one location to another without the need for a recharge. It even comes with a USB port in case you need to charge your smartphone.",
    "However, with this bike computer on board you can leave your phone behind and use the Hammerhead Karoo 2 for all of your navigation needs instead.",
    "The Hammerhead Karoo 2 bike computer is available now direct from Hammerhead, and costs $399 / £359 (about AU$500).",
    "Before you’ve even powered it up the Hammerhead Karoo 2 impresses with its well-built design. Lifting it out of the box, the head unit feels chunky and robust, with a solid black plastic case that features rubberized buttons on both sides. It weighs just 134 grams too, or 167 grams with the mount attached.",
    "The overall impression is one of quality. That feeling carries on over when you power up the device via the supplied USB cable. The unit comes alive quickly enough but the really good bit is the 400 x 800, 292 PPI screen itself, which dazzles with its high resolution. If, in the past, you’ve felt deflated by many bike computers with their tiny fuzzy screens, then prepare to be impressed by this one.",
    "With the screen on, you can soon start to appreciate the intuitive design features that have been incorporated into the software. It’s basically running Android, and if you’re au fait with this operating system on a smartphone or tablet then you’ll immediately see lots of similar features and functions. Even if you come from the iOS school of thought it’s hard not to appreciate just how effectively this head unit has been engineered.",
    "There are other smartphone-flavoured touches too, such as the SIM-card slot for mobile data connectivity should you need it, plus 32GB of storage. However, the Karoo works as-is for most tasks, without any additional card inserted.",
    "Toughened Dragontrail glass with IP67 waterproofing rounds it out.",
    "We were particularly impressed with the mounting bracket that is supplied with the Hammerhead Karoo 2. While it’s simple enough to look at, the main thing is it’s robust enough to attach to your handlebars without you feeling the need to check if it’s secure or not.",
    "The package includes a small Allen key that can be used to tighten the nut and bolt so you’re sure the mount won't be going anywhere. The computer itself then slides into a slot on the mount, which only goes one way, so it’s simple but effective. A lanyard is also included and the inclusion of a USB-C charging port is a good idea too.",
    "Before you get to put it on your bike though you’ll need to go through the setup stages, which by and large are simple enough. You’ll need to register with the Hammerhead.io website, which you can then use as a desktop accompaniment to the device and its supporting app.",
    "The site is quite useful if you like to map your data as well as keep lists of maps, rides and routes while being able to pore over it all on a larger screen. You can do much the same on the device, but the Hammerhead site makes a handy one to bookmark and for storing data in the cloud.",
    "The Karoo is great in that it can also be used in tandem with your favorite services, such as Strava so you can still keep tabs on your rides and the wider cycling community. But the real strength lies in the navigation that you get from the maps on the 3.2-inch screen. There’s a built-in speaker, which can issue smartphone alerts along with navigation assistance.",
    "There are also buttons on the unit if your fingers are less able to handle touchscreens due to large digits, or if you’re wearing gloves. They allow you to get to locations in the menu system via shortcuts, which is a practical consideration for sure.",
    "Another hit with us is the ability to create different profiles depending on your ride preference, so you can generate road or gravel profiles to suit your interests or mood on the day.",
    "Indeed, if you’re keen to focus on workouts then the Karoo 2 can be easily configured to offer training plans from TrainingPeaks. The unit and your Hammerhead account can be employed to upload data to the likes of Strava and TrainingPeaks without fuss too.",
    "Unlike taking a smartphone along for the ride we found the fully charged Karoo 2 to be generally quite frugal on the power consumption front. The 2500 mAh battery in the Karoo 2 could be replenished in about an hour if we’d been out with it for the day using all of the features and functions.",
    "Expect it to take about three hours tops if you’ve run the battery down to nothing, with around 12 hours of ride time suggested by the manufacturer after getting it back to a full charge. During our runs we found it to be very dependable, even if we were making maximum use of the many and varied menus.",
    "The Hammerhead Karoo 2 is generally pretty easy to get the hang of, although it reveals more secrets the more you use it. Pick your way through the menus and there are some cool features and functions including the smart QWERTY keyboard, but it does take a while to familiarize yourself with them all.",
    "The device carries on its smartphone theme with the screen too, because you can pinch to zoom for things like extra map detail. The screen might only be 3.2in, but the responsiveness of it is largely excellent. If you’ve got nimble digits then finding your way around, and up and down through the menus is a cinch.",
    "Head out on a ride and you’ll find the Karoo 2 is a nimble performer, with those responsive touchscreen menus provided zesty performance aided by the gaggle of on-board sensors. These include a three-axis accelerometer, a magnetometer, gyroscope and barometer along with one that measures ambient temperature.",
    "The navigation is consistent and clear, with a crisp combination of yellow and back allowing you to easily see turn-by-turn instructions, even on brightly lit streets or in strong sunshine. We found it was easy to modify a ride while we were out and about too, while the additional bonus was the live tracking feature. You can use this to share your live location via text or email, which is a practical inclusion if you’re out riding solo and want to keep relatives up to date on your whereabouts.",
    "Once you get back home it’s quick and easy to check all of your stats, which are stored in your Hammerhead cloud account and can include dynamic heart rate and power zone datafields, upcoming and historical elevation plus electronic gearing information depending on your requirements. We found this worked well, with routes, workouts and settings all updating as promised.",
    "There’s certainly enough appeal here for cyclists considering the likes of close rivals that include the Garmin 1030+ or Wahoo’s Elemnt Roam or Bolt models. Of course, it also integrates nicely with Strava and TrainingPeaks as you’d expect from a premium head unit, which is an expected bonus. Karoo 2 offers standard ANT+ and Bluetooth smart sensor support for riders who want to keep tabs of their usual stats, including heart rate and cadence, so it comes armed with everything needed by the hardcore cycling fraternity too."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and availability",
    "5": "Design",
    "10": "Setup",
    "20": "User experience",
    "26": "Don't buy it if"
  },
  "links": {
    "Android": "https://www.techradar.com/best/best-android-phones",
    "direct from Hammerhead": "https://www.hammerhead.io/",
    "Strava": "https://www.techradar.com/how-to/use-strava"
  }
}