{
  "source": "https://www.techradar.com/reviews/devialet-phantom-i",
  "title": "Devialet Phantom I review",
  "category": "audio-visual",
  "updated": "2021-04-09T11:35:20Z",
  "author": "olivia-tambini",
  "summary": "Space-age opulence",
  "verdict": "The Devialet Phantom I is a continuation of the French audio brand’s iconic range of wireless speakers, which come with powerful side-firing bass reflex ports that pulse in time to your music. The sound is nothing short of outstanding, and a good range of connectivity options and an easy-to-use app make the Phantom I easy to recommend – if you have a lot of money to spare, that is.",
  "pros": [
    "Unique design",
    "Fantastic audio performance",
    "Easy-to-use app"
  ],
  "cons": [
    "Super-expensive",
    "Quite heavy and large"
  ],
  "article": [
    "Devialet’s Phantom series of wireless speakers is notorious for its opulent, space age-inspired designs and mind-blowing price tags.",
    "The latest, the Devialet Phantom I, is no different. It sports a Kubrick-esque build, side-firing bass reflex ports that pulse to the beat of your music, and a futuristic puck-shaped remote control.",
    "Oh, and don’t forget the 22-carat rose gold-plated sides – which may go some way to explain the speaker’s $3,200 / £2,790 / AU$5,490 price. And that’s the price for just one speaker, by the way. If you want to pair two for stereo sound, it will cost you double.",
    "Still, the sound is undeniably good. This speaker packs a real punch, presenting a powerful, immersive sound, thumping bass, smooth mids and detailed trebles.",
    "Thanks to the nifty audio tech onboard, including the company’s Active Cospherical Engine (ACE), the egg-shaped speaker can diffuse sound in all directions. The soundstage certainly feels wide with excellent separation, which is only heightened when you pair two speakers in stereo mode.",
    "As for connectivity? Well, there’s support for Wi-Fi, Ethernet and Bluetooth connections, alongside AUX and optical inputs. For iPhone users, there’s AirPlay 2 support. Meanwhile, a handy new Devialet app allows for multi-room configuration between all Phantom models and Roon-Ready support for wireless Hi-Res Audio streaming.",
    "Sound good? Take another look at that price tag before you start clearing a space for the Phantom I. There’s no doubt that you get a lot for your money, but it’s far pricier than many of the best wireless speakers on the market.",
    "Still, if you have money to spare and you’re looking for a truly unique speaker that will do your hi-res music justice, the Devialet Phantom I is the speaker for you.",
    "The Devialet Phantom I is available in two power levels. The first comes in light chrome or matte black, and delivers a maximum volume of 103dB and a frequency range of 16Hz to 25kHz. Costing $2,200 / £1,890 / AU$3,690, it's considerably more expensive than its predecessor, the confusingly named Devialet Phantom II (previously known as the Phantom Reactor 900).",
    "For those looking for a little more power, there's the 108dB model with a frequency range of 14Hz to 27kHz. It’s available with dark chrome or luxurious gold side panels – and is more expensive still at $3,200 / £2,790 / AU$5,490. This is the version we tested for this review.",
    "That’s far pricier than many of the best wireless speakers you can buy today. For comparison, the Sonos One costs $199 / £199 / AU$299. Even the relatively pricey KEF LS50 Wireless II stereo speakers cost $2,499 / £2,250 / AU$4,295 – and you’re getting two speakers for your money there. While you can use two of the Phantom I for stereo sound, there’s no discount if you wish to do so; you’ll be paying double.",
    "The Devialet Phantom looks quite unlike any other speaker on the market (unless you count its predecessor, that is). Like a hybrid between a Kubrick-esque spaceship and a gilded egg, this wireless speaker isn’t designed to blend into the background – it’s a statement piece that will take center-stage in your home, particularly if you choose to buy two for stereo pairing.",
    "While it does share some aesthetic similarities with the Phantom II, the Devialet Phantom I is larger and heavier than its predecessor. Weighing in at 11.4kg, you won’t want to be moving it around your home too much.",
    "The Phantom I comes in matte black or white, with the latter including 22-carat rose gold-plated sides that are emblazoned with the Devialet insignia; they look incredibly luxurious and go some way to explaining its high price.",
    "At the front of the speaker sits the Devialet logo, which is cut into the chassis itself, while each side features bass reflex ports that pump air rhythmically in time with the beat of your music.",
    "Around the back of the Phantom I you’ll find ventilation grilles to stop it from overheating, a power button that lights up when the speaker is in use, and a port to connect your power cable.",
    "The Phantom I comes with a rather cool circular remote control, which only adds to the space-age feel of the speaker. This puck-like unit can be rotated to adjust the volume, while a touch-sensitive panel allows you to skip tracks, and play/pause your music. A rubberized ring at the base of the remote means it won’t budge if you place it on a coffee table, and its stylish white and silver color scheme makes it more aesthetically-pleasing than your average remote.",
    "Saying that, we’d have loved a continuation of the rose gold motif seen on the speaker itself – and, at this price, we don’t have any qualms about being so picky.",
    "Still, there’s nothing about the design of the Phantom I and its accompanying remote that leaves you in any doubt of this speaker’s luxurious credentials – and, if you want to make even more of a style statement and give your speaker a dedicated home, Devialet sells some stands for a cool $350 / £349 / AU$699 each.",
    "The Devialet Phantom I is a remarkably powerful speaker, reaching volumes you’d expect from a professional studio setup, without any distortion.",
    "Inside the speaker is a grade 1 titanium tweeter driver, an aluminum medium driver, and aluminum bass drivers.",
    "The Phantom I uses Devialet's proprietary audio tech, including the Analogue Digital Hybrid (ADH) amp, which the company says can deliver the quality of an analogue amp in a digital-sized package. There's also Speaker Active Matching (SAM) signal processing to retain high acoustic fidelity, Heart Bass Implosion (HBI) for powerful bass, and the Active Cospherical Engine (ACE), which allows the egg-shaped speaker to diffuse sound in all directions.",
    "These technologies certainly seem to do the trick. The soundstage feels wide and immersive, with excellent separation, strong bass frequencies, smooth mids, and high-fidelity trebles.",
    "Listening to Jazmine Sullivan’s On It, lazy guitar riffs and thumping bass lines complement complex vocal riffs and harmonies, with those iconic side-firing woofers pulsating with every beat.",
    "What really gets those woofers going, though, is Björk’s Hyperballad. In the verses, deep sub-bass drones and contrasts with chime-like keys and Björk’s tentative vocal, before the song launches into the chorus, laden with industrial dance beats and pulsing synths.",
    "Percussion sounds crisp and accurate in Bjork’s Venus As A Boy, with swinging rhythms and cascading violin and vibraphone melodies handled with dexterity.",
    "In stereo, the Phantom I sounds better still. Agnes Obel’s Dorian moody cello undercurrents and rolling piano riffs provide a bedrock for haunting vocal harmonies, with each melody coming through with clarity and precision.",
    "Little Dragon’s Wildfire boasts subby bass lines that display plenty of power without sounding overpowering – but it’s the vocals that are the star of the show, with a clear and smooth presentation. Percussion sounds crisp, while alarm-like synths peel through the mix, with the stereo configuration adding even more immersion and dynamism to the sound.",
    "The Devialet Phantom I has been given some nifty connectivity upgrades over its predecessor, including a new accompanying app that allows for multi-room configuration between all Phantom models, and Roon Ready support for wireless Hi-Res Audio streaming.",
    "Wi-Fi, Ethernet, and Bluetooth support mean you have a few options when it comes to wirelessly streaming your music, with the latter supporting SBC and AAC codecs.",
    "The new app is slick and easy to use, with a sliding volume dial that echoes the design of the accompanying remote control. You can also use the app to turn on ‘AV sync’, which reduces the audio latency when using the AUX input, and improves audio and video synchronization if you’re using the Phantom I as a TV speaker.",
    "If you do want your Phantom I to double up as a soundbar, there’s a TOSLINK optical port, although you won’t find an HDMI port.",
    "There's also support for AirPlay 2, which means you can stream music directly from your iPhone to multiple AirPlay speakers without using the Devialet app."
  ],
  "headers": {
    "0": "One-minute review",
    "8": "Devialet Phantom I price and availability",
    "11": "Design",
    "19": "Audio performance",
    "28": "Connectivity",
    "33": "Don't buy it if..."
  },
  "links": {
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "best wireless speakers": "https://www.techradar.com/news/best-speaker",
    "hi-res music": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Phantom Reactor 900": "https://www.techradar.com/reviews/devialet-phantom-reactor-900-review",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "KEF LS50 Wireless II": "https://www.techradar.com/reviews/kef-ls50-wireless-ii",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "AirPlay speakers": "https://www.techradar.com/news/audio/hi-fi-radio/best-airplay-speakers-5-budget-options-to-choose-from-1205484"
  }
}