{
  "source": "https://www.techradar.com/reviews/flexispot-e7b",
  "title": "Flexispot E7B height adjustable standing desk review",
  "category": "computing",
  "updated": "2021-09-13T08:55:12Z",
  "author": "desire-athow",
  "summary": "A robust table that is great value for money, just be aware of its heft",
  "verdict": "The E7B height adjustable standing desk from Flexispot scores highly when it comes to a balanced, well priced work table that offers acres of usable space while being simple to operate and assemble. It also has a longer warranty and a bigger deadlift capacity than most of its rivals.",
  "pros": [
    "Huge working area",
    "Robust construction",
    "125Kg load weight",
    "Easy assembly",
    "Keenly price"
  ],
  "cons": [
    "No drawers as option",
    "Extra large worktops not available",
    "Lacks cable management",
    "160 x 80cm worktop comes in three parts.",
    "Assembly instructions not clear enough"
  ],
  "article": [
    "Standing desks have been one of the stand out (pun intended) products of the last 12 months due to the pandemic. Remote working meant that millions had to rethink their work routine, which meant having a decent working area with a desk and a chair.",
    "While many ended up on dining and kitchen tables for a while, nothing can beat an actual office desk, especially one that can be adjusted vertically, with ample wiggle room and the sort of finish that puts it head and shoulders above general purpose, utilitarian tables.",
    "Enter a slew of products including the one we’re looking at today, the Flexispot E7B height adjustable standing desk, which combines a desk frame with - in our case - a 160 x 80mm worktop.",
    "Configured in black with the biggest worktop available, this standing desk is sold on Flexispot for just under £499.98 in the UK with free delivery, 30 days risk free returns and a comfortable warranty (5-year for the frame, three for the motor). Note that this model is not available outside Europe so for our US, Australian or rest of world audiences, we encourage you to visit their global website. The EC4 Standing Desk Pro series is the equivalent in the US and costs $590 with a slightly different keypad.",
    "One word of advice/warning: Make sure you have enough space before tackling such a project. Putting together a height adjustable standing desk in itself is not very difficult but it may require some heavy lifting and definitely more suited to those with basic knowledge of DIY. You will need an electric screwdriver as well.",
    "The first thing you will notice is that the table is branded Sanodesk; Flexispot confirmed that it is one of its sub brands. Our model came with an advanced control panel that can control the height of the worktop to the nearest millimeter. It has four programmable presets with a height memory. Long press the height memory to engage the child lock function (a tiny blue light will turn on as well).",
    "There’s also a customizable reminder to stand up (up to 99 minutes). The worktop is about 25mm thick which means that at its lowest, its top surface will be around 605mm high and at its highest point, 1255mm, thanks to three-stage legs.",
    "Putting the table together is fairly simple. You get three boxes containing the various parts and the six steps to assemble it are spread on three pages only. There’s a couple of pages dedicated to the control panel and troubleshooting it.",
    "Some of the instructions though could be clearer (e.g. for the baffle) and the steps involving larger frames. Likewise, the desktop panels that we were given didn’t have all the expected pre-drilled holes and there were no proper labels on the supporting beam to indicate the corresponding desktop sizes. You can adjust it to 190cm which would allow for worktop sizes of at least 210cm.",
    "We wouldn’t recommend putting the desktop on the floor as getting the desk in an upright position will prove to be a Herculean endeavour as the assembled desk weighs more than 50kg. Instead, we built the frame, put it in the correct position - feet on the ground - and added the worktop on top.",
    "The latter is made of MDF with a scratch resistant finish that is a step; worth pointing out that the central panel (which is 1m wide) is connected to the two 30cm side panels by six dowels and two metal plates and secured to the central beam by four 25mm screws.",
    "The anti collision system worked as expected and you can adjust its sensitivity. The motor on the E7B is a particularly powerful one as it allows the table to deadlift up to 125Kg; it is slightly noisy but we’ve come across laptop fans that were far worse. It did pass our “cup-of-tea” test with aplomb with only the slightest of shakings.",
    "There’s no cable management features which is a bit of a shame; speaking of cables, just make sure that you have enough free spare cable before moving the table up as that might damage your docking station/laptop/monitor.",
    "We’re looking for an electric-powered standing desk with a three-stage frame and a worktop that’s at least 160 x 80cm and capable of supporting",
    "The world’s largest furniture company, Ikea, has a wide range of standing desks. Idasen is its top of the range product and includes a simple cable management as well as Bluetooth connectivity (yes you can adjust the height using your smartphone). It doesn’t offer an extensive control panel and the shipping prices are shockingly high. At the other end of the spectrum is Skarsta, which uses a hand crank to raise or lower the table. Likely to be a pain if you change it daily but otherwise, a viable and much cheaper alternative - at less than half the price - that’s less likely to fail as well.",
    "Amazon’s cheapest standing desk frame and worktop combo is the Hwin, a challenger brand, combined with the Alldrei bamboo desktop. The pair costs just over £200 which is significantly less than the E7B. Its surface area is slightly smaller (160 x 75) plus Hwin is an unknown quantity so potentially a risky purchase.",
    "The Flexispot E7B is a very decent height adjustable standing desk and one that comes with a competitive price tag for such a massive usable surface area (160 x 80cm). There are some minor niggles like the lack of drawers even as an option, no cable management by default and instructions that could be better. Overall though, it meets the expectations of what we’d expect from a standing desk. Just remember to get a good office chair as well as you’d otherwise miss out on a comfortable, stress free working environment."
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "7": "In use",
    "13": "Competition",
    "16": "Final verdict"
  },
  "links": {
    "Standing desks": "https://www.techradar.com/news/best-standing-desk",
    "Flexispot E7B": "https://www.awin1.com/awclick.php?awinmid=22506&awinaffid=103504&clickref=trd-us-8923893434839543000&p=https%3A%2F%2Fflexispot.co.uk%2Felectric-standing-desk-frame-3-stage-e7.html",
    "standing desk is sold on Flexispot": "https://www.awin1.com/awclick.php?awinmid=22506&awinaffid=103504&clickref=trd-us-6821859192775736000&p=https%3A%2F%2Fflexispot.co.uk%2Felectric-standing-desk-frame-3-stage-e7.html",
    "EC4 Standing Desk Pro series": "https://shareasale.com/r.cfm?b=68890&u=1338591&m=68890&afftrack=trd-us-9732860380770062000&urllink=https%3A%2F%2Fwww.flexispot.com%2Fdesks%2Fheight-adjustable-desks%2Felectric-height-adjustable-standing-desk-dual-motor-economical-option-ec3-ec4",
    "docking station": "https://www.techradar.com/news/the-best-laptop-docking-stations",
    "Idasen": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1241169395191480800&xs=1&url=https%3A%2F%2Fwww.ikea.com%2Fgb%2Fen%2Fp%2Fidasen-desk-sit-stand-black-dark-grey-s89280993%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fflexispot-e7b",
    "Skarsta": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1338096909809390000&xs=1&url=https%3A%2F%2Fwww.ikea.com%2Fgb%2Fen%2Fp%2Fskarsta-desk-sit-stand-beige-white-s19324815%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fflexispot-e7b",
    "Hwin": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FAdjustable-Electric-Standing-Automatic-Computer%2Fdp%2FB08VJ26BXT%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1270118520110040000-21",
    "Alldrei bamboo desktop": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FALLDREI-standing-height-adjustable-Manual%2Fdp%2FB08CH8Q7Y8%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1328445608501667600-21",
    "office chair": "https://www.techradar.com/best/best-office-chairs"
  }
}