{
  "source": "https://www.techradar.com/reviews/ecovacs-deebot-ozmo-n8",
  "title": "Ecovacs Deebot Ozmo N8 Plus review",
  "category": "appliances",
  "updated": "2021-11-09T16:28:31Z",
  "author": "rachel-ogden",
  "summary": "An all-in-one flooring cleaning solution that won’t blow your budget",
  "verdict": "The Ecovacs Deebot Ozmo N8 Plus is one of the brand’s latest launches, combining simultaneous vacuuming and mopping with auto emptying into its charging station. Its app allows it to map floors accurately and be controlled by voice, while providing plenty of progress information. Mid-priced, for the amount of functionality it provides, it’s a great value buy. However, its navigation and vacuuming on carpet could use a tweak.",
  "pros": [
    "Can vacuum as well as mop",
    "Auto emptying",
    "Intelligent floor mapping"
  ],
  "cons": [
    "Prone to getting stuck",
    "Standard cleaning ineffective on medium-pile carpet",
    "Some debris spills out when docking"
  ],
  "article": [
    "For a robot vacuum that removes not just one chore from your life, but two, look no further than Ecovac’s Deebot’s Ozmo range. First launched four years ago, these robot vacuums that can mop as well, have proved popular, and the range has been expanded.",
    "The Ecovacs Deebot Ozmo N8 Plus is the latest addition. While the vacuum sweeps your hard floors, a pad that’s supplied with water will wipe away dirt at the back, picking up any fine dust that the brushes may have missed. Plus, it’s clever enough to know not to stray onto carpet when mopping is in progress.",
    "Key features on this model include advanced laser navigation and mapping – so it knows which way to go without bumping into obstacles – and an Auto-Empty Station that cleans its onboard 14.2oz / 420ml dust box for you into a disposable 0.5 gallon / 2.5-liter dust bag. This means that not only is there no need to keep emptying the dust box, you may only need to think about emptying the bag once a month or so.",
    "Unlike standard robot vacuum cleaners, the Deebot Ozmo N8 Plus includes an 8.1oz / 240ml water reservoir at the back and a clip-on mopping pad. This adds to its size slightly but not as much as you’d imagine.",
    "The Ecovacs Deebot Ozmo N8Plus is especially suited to homes with large areas of hard floors that want both a vacuum and mop in one. However, app and voice control at a reasonable price point could also make it a good buy for a busy family, too.",
    "The Ecovacs Deebot Ozmo N8 Plus is priced at $599.99 / £599.99 / AU$1,199. It’s available to buy now in the US direct from Ecovas and in the UK and Australia from Amazon.",
    "It comes with a washable mopping pad and a pack of 10 disposable mopping pads. Three replacement reusable pads cost $34.99 / £32 / AU$39 and a pack of 25 disposable mopping pads cost $34.99 / £32 / AU$39.",
    "It’s the brand’s budget model that’s still equipped with an emptying station – which alone costs $249.99 in the US – packing in a host of high-end features for a pocket-friendly price.",
    "As mentioned above, the Ecovacs Deebot Ozmo N8 Plus is a little larger than some robot vacuums, in part because of its 8.1oz / 240ml water reservoir, but not substantially so. It’s 3.66 inches / 9.3cm tall and has a diameter of 13.9 inches / 35.3cm. This does mean it’s not quite as nimble as some when nipping underneath tables and chairs, and carrying it upstairs could be a chore – it weighs 7.9lb / 3.6kg.",
    "In terms of outward appearance, it’s incredibly sleek, with one button on top to start it cleaning, and is available in glossy white as well as black. The Auto-Empty Station comes in a matching color and is fairly sizeable at 16.8 inches / 42.6cm tall, 11.8 inches / 30cm wide and 16.1 inches / 41cm deep, plus it needs 19.7 inches / 50cm clearance on either side – we found it struggled to get back onto the charging base when obstacles were closer. Inside, you'll find a 0.1 gallon / 420ml dust box, along with a three-layer dust filtration system that filters 99% of minute particle matter, and particles as small as 6 microns, as well as pet hair.",
    "The Ecovacs Deebot Ozmo N8 Plus is straightforward to set up using the app, with its first task set to map the floor, although this can be disabled if you want to do it later. However, it’s a good demonstration of Deebot Ozmo N8 Plus’s mapping technology as you can watch it fill in parts of the room before it reaches them. You can choose one of four vacuuming levels – Quiet, Standard, Max, and Max+ – and the whole floor, individual rooms, or specific areas to clean. This last option relies on having your floor completely mapped beforehand.",
    "As well as a single washable cloth for mopping and a pack of disposable cloths, there’s also a cleaning tool in the box.",
    "We started all our tests on the Ecovacs Deebot Ozmo N8 Plus’s Quiet mode, which worked well on hard floors to suck up both fine flour dust and larger debris (oats) with minimal effort. Disappointingly, when the vacuum docked itself to charge, a few oats fell out and were left on the floor around the Auto-Empty Station.",
    "Cleaning medium-pile carpet was more of a challenge. Oats were mostly picked up on the Quiet setting but it required the Standard power level to remove them all. Fine dust was problematic on most levels, requiring the highest Max+ to remove the most visible traces of flour.",
    "Despite having laser detection for objects, the Deebot Ozmo N8 Plus became stuck a few times – on piano pedals, between the legs of a dining chair, and on a rug – and repeatedly banged into pet food bowls. Once the floors were mapped, we also noticed that it didn’t go over the same area twice, even though some dust was left behind.",
    "The auto-emptying was especially convenient and we liked that you can switch this function off, should the Deebot Ozmo N8 Plus be vacuuming at night. Otherwise, there’s minimal maintenance – the dust bag only needs replacing every 30 days or so, with a suggested weekly clean for the filter and main brush with the included cleaning tool. The mopping pad needs to be washed after every use but the option of disposable cloths is a great alternative if you don’t have time.",
    "The robot vacuum was quiet in us, reaching a maximum of 60db on our decibel meter on Max+ mode, which is equivalent to the sound a dishwasher makes mid-cycle, which is more than acceptable. However, when automatically emptying its dust box at the station, our decibel meter hit 74dB, which is a level similar to that experienced inside a vehicle when traveling at 60mph.",
    "While a little more complex than some – it pays to spend time exploring the menus to get a good grasp of the Deebot Ozmo N8 Plus’s functionality – the Ecovacs Home app is fairly straightforward to use. The main screen gives a round-up of information you might want to know at a glance – remaining battery power of the machine, one click for auto cleaning and one for returning it to the dock to charge – with more detailed information in the Smart Cleaning section.",
    "This second page is where most settings can be adjusted, and where you can follow the progress of your robot vacuum as it cleans. Another click-through takes you to Multi-floor maps or a history of messages from your vacuum. It doesn’t feel as slick as some apps, but works well overall.",
    "One thing missing is an explanation of how to use voice control. Deebot Ozmo N8+ is compatible with Google Assistant and Alexa – but it’s not obvious how to pair them. You’ll need to enable the Ecovacs skill in the Alexa app and link your Google account.",
    "Compared to some robot vacuums, the battery for the Deebot Ozmo N8 Plus seems to drain quite quickly. While its manufacturers estimate a working time of 110 minutes, on a standard-setting cleaning our ground floor over 29 minutes, the battery drained down to 56% from 100%.",
    "The more powerful Max+ setting drained it faster – from 100% to 70% over 15 minutes. And when not on charge, the battery continues to drain, even when static, meaning that if the Deebot Ozmo N8 Plus gets stuck when you’re out of the house, you may come home to find it flat. However, we found that it charged from empty to full in 3 hours 40 minutes – faster than the estimated four hours.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Ecovacs Deebot Ozmo N8 Plus price and availability",
    "8": "Design",
    "12": "Performance",
    "17": "App",
    "20": "Battery life",
    "22": "Don't buy it if.."
  },
  "links": {
    "robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "vacuum": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}