{
  "source": "https://www.techradar.com/reviews/without-remorse-review",
  "title": "Without Remorse review",
  "category": "entertainment",
  "updated": "2021-04-28T16:01:00Z",
  "author": "tom-power",
  "summary": "All’s unfair in love and war",
  "verdict": "Without Remorse feels like a movie that could've been better than it is. Solid action set-pieces and a stellar cast are ultimately weighed down by its unoriginal tale of revenge, which would've benefitted from some unexpected plot twists and more tension-building moments.",
  "pros": [
    "Excellent casting",
    "Riveting action",
    "Solid thematic exploration"
  ],
  "cons": [
    "Conventional story",
    "Expected plot twists",
    "Feels more like a sequel set-up movie"
  ],
  "article": [
    "Tom Clancy-based movies have been in the midst of a barren spell recently. The 1990s saw the best-selling author’s name become synonymous with award-winning film adaptations of his novels, including The Hunt for Red October, but mixed responses to movies like Jack Ryan seemed to put a stop to more being developed - until now, that is.",
    "Based on the novel of the same name, Without Remorse is the latest attempt to reignite the Clancy movie series. Despite being elevated by its stellar cast, solid pacing and thrilling set pieces, though, Without Remorse is a fairly standard revenge tale that suffers from some run-of-the-mill plot twists and hoary tropes.",
    "Without Remorse tells the story US Navy SEAL John Clark (Michael B. Jordan) as he seeks retribution for the murder of his pregnant wife Pam (Lauren London). After Clark’s team conducts a rescue mission in war-torn Syria - one that sees his squad kill a number of ex-Russian armed forces personnel - Clark and his wife are attacked in their home by Russian mercenaries, who kill Pam and leave John for dead.",
    "Clark, who kills two intruders before being shot multiple times by another, survives and vows revenge on those responsible. With the help of fellow SEAL Karen Greer (Jodie Turner-Smith), shadowy CIA agent Robert Ritter (Jamie Bell) and US Secretary of Defense Thomas Clay (Guy Perace), Clark’s bid to track down his wife’s killers sees him become embroiled in a conspiracy that threatens all-out war between the US and Russia.",
    "Without Remorse’s revenge plot is pretty unoriginal, then, and it isn’t helped by some entirely predictable twists along the way.",
    "Sure, it can be fun to try and deduce who the real bad guys are in a revenge flick, and there are enough shady characters here for a Usual Suspects-style lineup. It’s easy to work out who Without Remorse’s big bad is, though, even without reading the book first. Viewers who crack the case early will feel that the rest of the movie is nothing more than a slow march to this major reveal, but even if the story doesn't maintain your attention, other parts of the movie will.",
    "For one, Without Remorse feels as timely in the present day as when the book was first written. Clancy’s novel is set during the Cold War and follows Clark’s revenge mission through the US and Vietnam, which includes an assault on a drug ring and rescuing prisoners of war.",
    "The movie adaptation alters these events to better reflect the world in 2021, such as replacing the Vietnam War with the ongoing Syrian conflict, and Russia and America's presently frosty relationship ensures that the story isn’t one necessarily told out of time.",
    "It’s also more globetrotting in its setting than the source material, which helps with the film’s pacing and doesn’t allow it to become bogged down in one particular location. This around-the-world adventure adds to the film’s theme of globalization, too, and the potential consequences of the characters' actions. If the murder plot doesn't hook you, perhaps its exploration of hot-button topics - including the US and Russia’s positions on the world stage - will.",
    "The movie’s cast brings a bit more credibility to the film as it explores these subjects. Jordan excels as the purposeful Clark, and the emotional weight he brings to Without Remorse’s protagonist heightens the impact of a familiar revenge story. It’s a shame, though, that Jordan and London don’t share more screen time as the Clarks, given how Pam's murder drives the plot.",
    "Turner-Smith, too, puts in a solid performance as the stoic-and-resourceful Greer, while Bell’s abrasive CIA agent will make you bristle every time he’s on screen. Add in Jordan’s Clark and the trio’s clashing personalities means that verbal fireworks are never far away, even when they’re all pulling in the same direction.",
    "As for the action, there’s plenty of it. Gunfights look and feel authentic, and one sequence involving snipers in a small Russian city is a particularly tense set piece that actually brings weight to how life and death is portrayed in the movie. The film’s main close-quarters fight sequence is also excellent without being overly gratuitous, and offers a nice contrast to the movie's multiple firefights. There are some notable sequences that really put Jordan’s Clark in harm’s way, too, and show how much training the film’s lead actor underwent to realistically portray a Navy SEAL.",
    "These sequences are impressive but, ultimately, it never feels like Jordan’s Clark is in danger. He’s the hero after all and, like so many other predictable elements of this movie, it’s expected that he’ll live to fight another day. But, the attack in his home aside, Clark’s life doesn't feel in jeopardy at any point - and maybe more tension on that side of things would've resulted in a more exciting finished movie.",
    "Ultimately, Without Remorse is caught between a rock and a hard place. Sure, traditional revenge stories almost write themselves, but it feels like more could have been done to set it apart from similar movies.",
    "Leaning into the source material’s R-rated content, or making the film’s true villain less obvious, would’ve helped to differentiate it from the usual ‘person seeks vengeance for a loved one’s death’ story mechanic. As it is, Without Remorse won’t trouble more recent critically-acclaimed revenge-led flicks, such as John Wick.",
    "It’ll be interesting to see where the sequel goes - Jordan has already confirmed what it’ll entail, but we won’t spoil it here - from plot and character growth perspectives, and maybe Without Remorse will end up being a great primer for a potential Tom Clancy cinematic universe. As a standalone film, though, Without Remorse is fairly enjoyable without being outstanding.",
    "Without Remorse launches on Amazon Prime Video on Friday, April 30."
  ],
  "headers": {
    "2": "Man on a mission",
    "9": "Calling the shots",
    "13": "The verdict"
  },
  "links": {}
}