{
  "source": "https://www.techradar.com/reviews/pc-mac/software/utilities/torguard-1325674/review",
  "title": "TorGuard VPN review",
  "category": "computing",
  "updated": "2021-05-18T18:55:09Z",
  "author": "mike-williams",
  "summary": "A fast and highly configurable VPN, crammed with expert-level features",
  "verdict": "TorGuard is speedy, hugely configurable and has some uniquely powerful options, but it's not built for ease of use, and you'll need to be an expert to really take advantage of the service.",
  "pros": [
    "Connect up to 8 devices simultaneously",
    "Excellent speeds",
    "Expert-level configurability",
    "Unblocked Netflix"
  ],
  "cons": [
    "Intimidating for beginners",
    "Clumsy desktop app interface",
    "Poor support website",
    "Standard plan didn't unblock iPlayer, Prime Video, Disney+"
  ],
  "article": [
    "The name may look very familiar, but despite sharing the same privacy angle, TorGuard has nothing to do with the Tor Project. Instead, it's a company which offers a range of products, including an anonymous VPN plan for protecting your privacy while using torrents (which is where the 'Tor' part of the name comes from).",
    "Specs are good, with 3,000+ P2P-friendly servers in 68 locations across 55 countries, OpenVPN/OpenConnect/WireGuard protocol support with multiple stealth options to avoid VPN blocking (OpenVPN obfuscation, Stunnel, OpenConnect, and Shadowsocks), custom apps for Windows, Mac, Android and iOS, and setup instructions for Linux, routers and more.",
    "TorGuard supports connecting up to an impressive eight devices simultaneously (most providers stop at five, although Windscribe, Surfshark and a few others have no limits at all).",
    "Top of the 'What's New' list is a major iOS release with a redesigned and improved interface, which the company says will be rolled out to other platforms in the 'coming weeks.'",
    "Welcome usability tweaks include the ability to switch servers without manually closing the current connection first. Gesture support enables swiping back to return to the previous screen, and you can now report a problem directly to support from within the app.",
    "Prices are reasonable at $9.99 a month, $6.66 on the quarterly plan, $5 per month on the annual plan, $4.17 over two years or $3.89 over three. There's scope for saving money elsewhere, especially if you're happy to sign up for a long contract – ZenMate asks $1.64 a month for its three-year plan, Ivacy just $1.33 over five years – but TorGuard's pricing looks fair, and in the range we'd expect for a quality VPN.",
    "TorGuard offers dedicated streaming and residential IPs for multiple countries and US states, potentially allowing you to unblock just about anything in your destination country, from an extra $7.99 a month. There's way more choice than you'll get with most vendors, and the residential IPs are far more likely to unblock your favorite websites, but there are cheaper options around. NordVPN provides static IPs for $70 a year ($5.83 a month), while Ivacy asks a minimal $1.99 a month.",
    "TorGuard has a sort of 7-day trial, but it's not quite like anything else we've seen. It's only for users who currently have an account with another service, for instance. To prove that you must 'email your recent VPN bill from your current provider', perhaps giving away more personal information than you'd like. The company then says it will 'verify' your bill. What? How?",
    "If you get the free week, and cancel your old VPN, and email 'proof' of the cancellation to TorGuard, and they verify that, you'll also get 30 days free on any VPN plan.",
    "That's certainly more generous than most, but we'd prefer something simpler and less intrusive, even if it's just, say, a free 3-day trial for everyone.",
    "If you do decide to sign up, there's support for paying via card, Bitcoin, gift cards, and many other payment types via Paymentwall. It's good to see support for PayPal has arrived since our last review, too.",
    "Sign up and a money-back guarantee offers a little protection, but only for 7 days; most providers give you at least 30. There are some potential catches, too, with the small print stating that 'Geo location, blocks and Info from third party sites do not merit a refund.' That suggests this isn't a 'no questions asked' guarantee, and you'll need to give TorGuard a reason it accepts for the refund request before you'll get your money back.",
    "Most VPN providers use their privacy policy to spell out any logging issues in detail, but TorGuard's privacy page restricts itself to a single sentence on the topic: 'TorGuard does not collect or log any data from its Virtual Private Network (VPN) or Proxy services.' This is just about as basic as any privacy policy can get, but at least it's easy to read.",
    "Is it true, though? We've no idea. And as TorGuard hasn't put itself through any form of public audit, we're left to trust that the company is telling it like it is.",
    "TorGuard certainly provides a pile of technical features to enhance your privacy, at least for old hands who can figure out how to use them. Multiple stealth and obfuscation technologies aim to get you connected, even in countries which detect and block regular VPNs. You're able to take manual control of your encryption algorithm, port and authentication method (AES-256, various CBC and GCM algorithms, SHA1, SHA256, SHA512). Built-in blocking of WebRTC and IPv6 leaks prevents you giving away clues to your identity, and a kill switch blocks internet access if the VPN drops.",
    "There are plenty of other options which could help, if you're willing to spend time setting them up. The Windows client can automatically launch a program when the VPN connects, for instance, and close it when it disconnects, ensuring everything it does online is always protected.",
    "The key here is probably the user's knowledge and experience. If you understand everything TorGuard has to offer, you'll be able to set it up to deliver excellent privacy and security. The service won't help you much by default, though, so network novices could get better results from much simpler apps with a very few settings they might actually understand (global kill switch, DNS leak protection, auto-connect when accessing insecure networks).",
    "Buying a TorGuard plan was easy, and the TorGuard Download page pointed us to links and setup instructions for the Windows, Mac, Linux, iOS and Android apps, as well as browser extensions for Chrome and Firefox.",
    "We grabbed the Windows client. The installer had some very unusual expert-level options, including a choice of TAP driver version to install, or whether you want to install one at all. It looks a little intimidating, but fortunately the default settings work fine – keep hitting Next and the client should install without difficulty.",
    "There was more confusion at the first app launch, though, when the client displayed a bizarre warning that ‘setting the DNS “at application start”, “while establishing VPN connection” is not recommended and will be removed in the near future,’ asking us to ‘please disable them selecting “None” and keep only the selection “when VPN is connected.”’",
    "This is far too much information to pile into a tiny dialog box, and left us with more questions than answers. If these app settings are no longer recommended, then why not change them during installation, or at least offer to do that? Even if there is some reason the user has to do it, the alert assumes way too much technical knowledge. What it should have done is point us to a page on the website with a detailed explanation of the problem, showing why it's necessary to make the changes, and providing a screenshot-packed guide on how to make them.",
    "Clearing the alert, we found the Windows app interface was dated, text-heavy and (once again) a little intimidating. But while we can only review what we see, the far more straightforward iOS app design is due to be rolled out imminently, so it could look very different by the time you read this.",
    "TorGuard doesn't have an 'automatic' or 'best' option where the client selects your nearest location on its own, which is probably why it chose Dallas as our default location, even though we were in the UK.",
    "The client's location picker does a reasonable job of making up for this. Although it looks like a simple list of countries, you can filter it by continent, or sort by distance from you, or how often you've used each location. There are some smart ideas here, but we also see room for improvement (there's no Favorites system, for instance, although sorting locations by usage has a similar effect).",
    "The cluttered interface might confuse newbies, too, with all kinds of intimidating options displayed upfront, such as: Tunnel Type, Port/Auth, Cipher, a 'Stunnel enabled' switch and more.",
    "Tapping Connect got us a Windows User Account Control message complaining that 'Windows Defender Firewall has blocked some features of this app.' That's easily fixed – just click 'Allow Access' and it doesn't appear again – but it might confuse newcomers, and it really shouldn't be necessary. Most apps set up permissions and maybe firewall rules during installation, ensuring users aren't prompted later.",
    "Connection times were a little longer than expected at around 8 seconds for WireGuard, 12 seconds for OpenVPN (the best apps take 2-3 seconds for WireGuard, 6-8 seconds for OpenVPN), but there were no connection failures or drops during the review.",
    "When we got online, the client displayed even more technical details about the connection: HMAC, PFS/TLS, protocol, cipher, and both local and remote IPs. It's great to have some status information, but this is probably going to intimidate the VPN novice, and even experts may feel they don't need to see all this information, all of the time.",
    "Navigation around the app can be awkward. With most VPN apps, when you click Connect, you stay on the same screen, and often you can browse other locations, maybe change settings, while you're connected. With this client, when you connect, you're taken to an entirely different status screen, and can't do anything else until you've manually disconnected. This isn't difficult to figure out – you'll understand within seconds – but it's still not as comfortable to use as the average VPN app.",
    "For all its interface shortcomings, the TorGuard client does have one major compensation, for experts at least: a hugely comprehensive Settings dialog with more low-level tweaks, options and customization possibilities than we've seen anywhere else.",
    "Many VPN apps automatically assign their own DNS servers when they connect, for instance, but TorGuard gives you so much more control. You're able to use multiple alternative DNS providers (Cloudflare, OpenDNS, Level3, Google, Quad9) while you're connected, change them at other points (when the client starts, while the VPN connects), add custom nameservers as required, refresh the local DNS cache when connected, or save and recover the DNS state of your VPN session.",
    "The client can run scripts before and after connecting, and after disconnecting. This could be handy for launching programs you only want to run when the VPN is active, or perhaps to clean up after it's closed (delete cookies or your internet history).",
    "The advanced features continue with WebRTC and IPv6 leak prevention, and the ability to choose the network interface TorGuard will block as part of its kill switch (very useful if you have more than one). It's all hugely configurable, and could be ideal for experts who need to tailor the service for tricky network situations.",
    "TorGuard's Android app looks and feels much like the desktop builds. It does the job, but the interface is a little cluttered and not as simple and straightforward as most of the competition.",
    "The app does have some usability extras, though, including a Favorites system to enable grouping your most important locations.",
    "There are some handy new mobile-friendly settings, too. The Android app understands and has a setting for Android's Always-On VPN, for instance; effectively a system kill switch. And a Pause/Resume feature enables telling TorGuard to optionally pause the VPN when you access a mobile or protected Wi-Fi network.",
    "The real star here, though, is the new iOS app. It boasts eye-catching visuals, locations highlighted on a map, and (unlike the desktop build) a Favorites system for easy reconnections. It's a far more appealing and up-to-date look.",
    "It isn't just about the visuals either. TorGuard has thought about usability, too (at last), with simple touches like swiping to move between screens and an app icon context menu to connect or disconnect.",
    "TorGuard hasn't dropped its level of detail or functionality, though. Connect and you'll still see information on your protocol, cipher, authentication algorithm and more. There's support for connecting via WireGuard, OpenVPN, IKEv2 and IPSec, and although the app can't match the desktop client for settings, there are still options to automatically connect on launch, or use TorGuard's ad-blocking DNS system.",
    "It's all very well presented, and although we don't normally take much notice of App Store ratings, TorGuard's 4.8 is so good that it has to be doing something right.",
    "Our in-depth TorGuard testing began with a look at the Windows client kill switch. Or, at least, that was the idea. It turned out to be more difficult than we expected.",
    "There's no single kill switch setting, for instance. The first one we saw was an 'arm kill switches after first successful connection' option – was that what we needed? We enabled it, ran some tests, and no – our internet connection wasn't blocked when the VPN connection dropped. That leaves the possibility that a user may check the first 'kill switch' box they see and think they're protected when they're not, an issue in itself.",
    "Head over to the network tab and there is now a 'Kill Switch' checkbox as part of a 'Seamless reconnect' feature. That's simpler than a previous build, where we had to specify the network interfaces the kill switch should block, but it's still poor design to place two kill switch settings in separate tabs. (And actually, it's three: an App Kill option automatically closes the apps you specify if the VPN drops.)",
    "We enabled the 'Seamless reconnect' kill switch anyway, and found it worked well with both OpenConnect and OpenVPN connections. When we closed them, our internet access was immediately blocked, the client displayed a warning within a second or two, and our traffic remained protected at all times.",
    "Oddly, the client made no attempt to reconnect after the VPN dropped, and we saw no option to do that (we were left to do it manually). If there's a problem with TorGuard's client, that's a very good example; the developer has worked hard to include low-level technical settings most users won't begin to understand ('disable interface default route'), while ignoring common features they're far more likely to appreciate ('automatically reconnect if the connection drops').",
    "Whatever we think of TorGuard's design decisions, the client scored in key areas by protecting our privacy and warning us if the connection dropped. Getting reconnected was easy – switch to the client, click Connect – and we were generally back online within a few seconds.",
    "We measured TorGuard performance from a US home and a UK data center, both with fast 1Gbps connections.",
    "After installing the latest TorGuard apps, we connected to our nearest locations and measured download performance using multiple speed test sites and services, including SpeedTest (the website and command line app), TestMy.net, Netflix's Fast.com and more.",
    "Speed results can vary for all kinds of reasons, so to get a more representative picture we measured our speeds at least five times at each site, using both OpenVPN and WireGuard protocols, and ran the full test set in both morning and evening sessions.",
    "UK OpenVPN results were excellent at 350-375Mbps. A few VPNs reached faster peak speeds, but weren't as consistent. CyberGhost hit 250-400Mbps, for instance, and KeepSolid VPN Unlimited gave us a wide-ranging 85-490Mbps.",
    "It was much the same story with WireGuard, where TorGuard hit a turbocharged 680-690Mbps. It's not quite the fastest we've seen – NordVPN's NordLynx protocol helped it hit 480-820Mbps – but, let's be realistic, it's probably fast enough for most people (and again impressively consistent).",
    "US OpenVPN speeds were a little slower at 270-300Mbps, but that's still right up there with the best of the competition (ExpressVPN made 270-280Mbps from our US location, HideMyAss! 300-330Mbps).",
    "US WireGuard speeds kept up the 'consistent and fast' pattern at 410-480Mbps. One or two providers did better – StrongVPN reached 590-600Mbps, ExpressVPN 490-630Mbps – but TorGuard ranked well above average overall.",
    "The TorGuard website confidently claims it allows you to 'connect to any location in the world and experience content without any restrictions.' Is that the reality, or marketing spin? Let's find out…",
    "We couldn't get into BBC iPlayer from either of TorGuard's UK servers; not a great start.",
    "It didn't look like there was much hope for US Netflix, especially when it failed with our first location. But then we successfully streamed US-only content via the next two, so clearly TorGuard does have some unblocking skills.",
    "The good news didn't last for long, though, as TorGuard was detected and blocked by Disney+ and Amazon Prime Video at each of our three test locations.",
    "If unblocking websites is a priority, buying one of TorGuard's dedicated residential IPs should resolve the problem, hopefully forever (no one else will use the IP, so it's unlikely it'll be spotted). It's an expensive solution, though, at an extra $7.99 a month. NordVPN unblocked all our test streaming platforms with its standard products, and they're priced from $3.71 a month on the first term of the two-year plan.",
    "If you're baffled by TorGuard's complexities then you could head off to the support site, where you'll find a knowledgebase, video guides, a user forum, and more.",
    "Explore these sections, though, and you'll discover that they don't match the level of help you might see elsewhere. The knowledgebase is more about technical how-to type articles than general VPN guidance (the most popular article is apparently 'How to setup a SOCKS Proxy in uTorrent/BitTorrent On Windows'). Furthermore, the video guides section has seen only two additions in the past five years, and even they are more about marketing than helping you use the service.",
    "We tried using the Search box to find useful information, but without much success. Searching for the 'arm kill switches after the first successful connection' setting that puzzled us earlier, for instance, returned no hits at all (a blog post has some details, but you can't find it from the support Search box). We appreciate TorGuard's power and versatility, but that's not much use if you can't figure out how to make the most of it.",
    "Fortunately, you can contact support agents directly via tickets, live chat and even a toll-free phone number in the US.",
    "We raised a ticket regarding the 'arm kill switches' setting, and received a reply only six minutes later. That's quick, but maybe too quick: although the message gave us some useful information, it was brief, and didn't include any links to the kill switch blog post or anything else that might help us see the big picture.",
    "Still, if TorGuard typically responds within minutes, having to send an extra follow-up email or two is no great hardship. We would still like to see a much better knowledgebase to help users find their way around in their own time, but the support team should help you solve most problems.",
    "TorGuard is very fast and has more low-level VPN tweaks and options than just about anyone else, but the awkward interface and limited online help means most users won't find it as easy to use as the likes of ExpressVPN. Still, this provider is well worth a look for power users who need way more than the VPN basics."
  ],
  "headers": {
    "12": "Privacy and logging",
    "17": "Apps",
    "40": "Kill switch",
    "46": "Performance",
    "53": "Netflix and streaming",
    "58": "Support",
    "64": "TorGuard review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Windscribe": "https://www.techradar.com/reviews/windscribe",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "$9.99 a month": "https://torguard.net/anonymoustorrentvpn.php",
    "quarterly plan": "https://torguard.net/anonymoustorrentvpn.php",
    "annual plan": "https://torguard.net/anonymoustorrentvpn.php",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "7-day trial": "https://torguard.net/blog/switch-to-torguard-with-our-fresh-start-promo-and-get-30-days-free/",
    "small print": "https://torguard.net/terms.php",
    "privacy page": "https://torguard.net/privacy.php",
    "Windows": "https://www.techradar.com/vpn/best-windows-10-vpn",
    "Android": "https://www.techradar.com/vpn/best-vpn-for-android-our-5-top-choices",
    "iOS": "https://www.techradar.com/vpn/the-best-vpn-for-iphone",
    "Netflix": "https://www.techradar.com/vpn/best-netflix-vpn",
    "knowledgebase": "https://torguard.net/knowledgebase.php",
    "video guides": "https://www.youtube.com/channel/UCQbQmrWFt1-p8XroaXsvefw",
    "user forum": "https://forums.torguard.net",
    "blog post": "https://torguard.net/blog/how-to-use-torguards-vpn-kill-switch-features/",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn"
  }
}