{
  "source": "https://www.techradar.com/reviews/vyprvpn",
  "title": "VyprVPN review",
  "category": "computing",
  "updated": "2021-11-09T15:06:05Z",
  "author": "mike-williams",
  "summary": "A popular no logs VPN with apps for almost everything",
  "verdict": "VyprVPN has several small issues and doesn't unblock Netflix right now, but it also gets a lot right: there are loads of apps, it's easy to use, great value, may get you online in China, and has confirmed its zero-log status with a public audit (although we'd like to see another – the last one was in 2018).",
  "pros": [
    "WireGuard available on desktop and mobiles",
    "Chameleon protocol can get around VPN blocking",
    "Unblocks BBC iPlayer, Amazon Prime Video",
    "Low prices on the two-year plan"
  ],
  "cons": [
    "Doesn't unblock US Netflix, Disney Plus",
    "Below average speeds",
    "Windows kill switch issues",
    "Support website articles are often basic"
  ],
  "article": [
    "A popular Swiss-based VPN from the same corporate group as Usenet provider Giganews, VyprVPN has a decent-sized network with 700+ servers in 70+ locations across 60+ countries. These aren't solely focused on Europe and North America, as we often see – VyprVPN has 14 locations in Asia, 5 in the Middle East, 7 in Central and South America, 2 in Africa and 5 in Oceania.",
    "Even better, these servers are owned and managed by the company. That means there's no reliance on third-party web hosts, unlike most of the competition.",
    "Welcome features include a zero-knowledge DNS service, a customized Chameleon protocol to help bypass VPN blocking, WireGuard support to optimize performance, P2P support across the network, and 24/7/365 customer support to keep the service running smoothly.",
    "Wide platform support includes apps for Windows, Mac, iOS, Android, Tomato-based routers, QNAP, Anonabox, Smart TVs and Blackphone.",
    "If that's not enough, the website has 30 tutorials to help you set up the service on Chromebooks, Linux, Blackberry, Synology NAS, OpenELEC, Android TV, Apple TV, and via DD-WRT, AsusWRT, OpenWRT and more.",
    "Whatever hardware you're using, VyprVPN supports connecting up to 30 devices simultaneously. One or two providers go a step further – Windscribe and Surfshark have no connection limits at all – but, let's be realistic, 30 simultaneous connections will be more than enough for most people.",
    "The website has the usual 'no logging' claims, but unlike most of the competition, you don't have to take these on trust. In 2018, VyprVPN had an independent audit to verify that it doesn't log or share anything about what you're doing online, including session logs, and you can read the report for yourself.",
    "Additions since our last review include a beta Chrome extension, which doesn't offer any extra privacy features, but it's easy to use, and could be very convenient if you're only looking to unblock websites.",
    "VyprVPN has dropped monthly billing in favor of a 'two-month plan' with one month free.' It's a little strange, but we're not complaining: at $6.47 a month ($12.95 billed every two months), it's cheaper than some VPN's annual accounts.",
    "VyprVPN doesn't have an annual subscription, either, and for a similar reason. A new '18-month plan with six months free' is priced at a very, very low $2.50 a month.",
    "And if you're still not impressed, a three-year plan (with one year free) is priced at just $1.81 a month. There are one or two cheaper deals around – Ivacy's five-year plan is $1.33 a month, and throws in 2TB of encrypted cloud storage for free – but otherwise this is as low a price as you'll find anywhere.",
    "Payment options are limited to card and PayPal. If you sign up and aren't happy, you're protected by a 30-day money-back guarantee. A few companies give you more – Hotspot Shield and CyberGhost allow 45 days, for example – but 30 days should be long enough to identify any problems.",
    "VyprVPN protects your privacy with well-chosen protocols and industrial-strength encryption. It supports AES-256-GCM and SHA384 HMAC by default for OpenVPN, with TLS-ECDHE-RSA-2048 to provide Perfect Forward Secrecy. (The latter is a smart technique which ensures that a different key is used for every connection, so that even if an attacker obtains a private key, they would only be able to access data in that particular session.)",
    "WireGuard is now supported across all platforms, along with OpenVPN and IKEv2. VyprVPN's custom Chameleon 2.0 protocol has been improved to do an even better job of bypassing aggressive VPN blocking (it's a new option on the iOS app, too, which is good to see).",
    "We don't test access from China, but reports suggest VyprVPN works well. It's certainly more transparent than many providers. The company doesn't seem to hide access problems, for instance: it publishes details of any problems on its Service Status page.",
    "VyprVPN uses the page to publish streaming updates, too. For example, on June 11, 2021, it reported that some users were having trouble viewing BBC iPlayer. It recommended a workaround of refreshing the page multiple times, saying it would play eventually. A week later, an update said this was resolved. The page looks great for keeping users up to date with issues, and we wish other providers would be as upfront about their service difficulties.",
    "Back to privacy: VyprVPN provides an encrypted zero-knowledge DNS service, a handy way to avoid 'man-in-the-middle' attacks, DNS filtering and other snooping strategies. Works for us, although if you're less happy with the idea, the apps also allow you to switch to any third-party service (just enter whatever IP addresses you need).",
    "Individual apps have their own privacy protecting technologies, too, including options to defend against DNS leaks and bundled kill switches to reduce the chance of data leaks if the VPN connection drops. We'll look at these in more detail later.",
    "Figuring out a VPN's real logging procedures can require spending an age digging through the privacy policy, terms of service, support documents and more, before trying to decide how much you can trust whatever the provider has said.",
    "VyprVPN improves on this immediately with a privacy policy which gets straight to the point, explaining that there's no logging of source or destination IP addresses, connection start or stop times, user traffic or DNS requests.",
    "Even better, you don't have to take VyprVPN's word for this, as in September 2018 the company hired Leviathan Security Group to audit the platform and produce a public report on its logging practices.",
    "The results [PDF] are available to all on the VyprVPN website, and make an interesting read. Experts will find a huge amount of detail on how VyprVPN works, and the in-depth testing performed by the auditors (logging in to servers, inspecting running processes, examining source code, and more).",
    "Everyone else can simply check the executive summary, which explains that the audit initially found a few limited issues ('from inadvertent configuration mistakes'), but these were 'quickly fixed', and 'as a result, [the audit] can provide VyprVPN users with the assurance that the company is not logging their VPN activity.'",
    "While that's great news, and still much more than the majority of VPN providers have done, we hope VyprVPN doesn't stop there. It's been more than three years since this audit; plenty of time for new problems to have cropped up. TunnelBear has had four annual security audits of its service, and we'd like to see other providers do repeat runs in this way.",
    "Signing up to VyprVPN is easy, and once you've handed over your details, the website points you to the company's Windows, Mac, Android and iOS apps, plus a host of setup guides for other platforms.",
    "These aren't just links to files or app store pages. The VyprVPN website also gives you useful details on each app, including supported protocols, the minimum operating system version, and even a changelog. That's more interesting and useful than it might sound, as even if you've no development knowledge at all, you can look at something like the Android changelog and get a feel for how often the app has been improved, and when major new features have been added.",
    "Client setup is straightforward, and follows more or less the same process for every other VPN app you've ever installed. Download and run the app, follow the instructions, enter your username and password when you're prompted, and essentially, you're ready to go.",
    "Experienced users should find it easy to set up other devices manually. The Android app is available as a plain APK file, for instance. The OpenVPN configuration files are also just a click or two away. These don't give you the control you'll often get with other VPNs, so for example there's no configuration wizard, and no choice of UDP or TCP connections. But they are at least sensibly named. VyprVPN's Singapore.ovpn looks far more straightforward on a server list than NordVPN's sg26.nordvpn.com.udp.ovpn, for instance.",
    "If you need some assistance, the website has more than 50 tutorials to help you manually set up the service on Chromebooks, Linux, Synology NAS, OpenELEC, Android TV, Apple TV, and via DD-WRT, AsusWRT, OpenWRT and more.",
    "These setup guides are, for the most part, relatively basic. Many are short, with only the bare minimum of text, and no screenshots (the Android TV guide says little more than 'you'll need the Android app, get it here or here'). They appear to cover the basics, though, and should get you connected with minimal hassle.",
    "VyprVPN's Windows VPN client looks and feels much like a mobile VPN app: a simple opening window displays your connection state and preferred location, and you can connect or disconnect with a click.",
    "A capable location picker lists available locations by country and city, includes ping times to give you an idea of distance, and provides a simple Favorites system to save your commonly-used servers. Locations are sorted by country initially, but you can also organize them by continent or ping time.",
    "The client supports four protocols: there's WireGuard, OpenVPN, VyprVPN's proprietary Chameleon, and IKEv2.",
    "A kill switch aims to protect you if the VPN drops. That's the idea, but it didn't always work that way.",
    "If we manually closed an OpenVPN connection the kill switch kicked in instantly, blocking internet traffic, displaying a warning and giving us an option to reconnect.",
    "If we did the same with an IKEv2 connection, though, the kill switch didn't work right away, and the device briefly used our regular connection instead. We really do mean briefly – for maybe two or three seconds – but it's still a weakness in the system, especially as the client didn't display a 'Disconnected' alert to warn us about the problem.",
    "After connecting via WireGuard, we forcibly closed VyprVPN's WireGuard service. Our connection dropped immediately, and again our traffic was unprotected for just a second or two before the kill switch kicked in. But now there was a new issue. Although our internet was blocked, the app didn't appear to recognize there was a problem. It continued to display our status as 'Connected' and didn't attempt to restore the connection.",
    "In a real-world situation, you'd see your internet was down, but with no clue that the VPN was responsible, so you'd probably assume this was some general network issue. The fix is easy – just disconnect and reconnect – but we suspect many users wouldn't think to try that, at least not right away.",
    "VyprVPN's kill switch mostly does its job, then, but doesn't always kick in instantly, and there could be usability issues in some extreme situations.",
    "Elsewhere, a capable Settings dialog can configure the client to connect when Windows starts or the application launches. DNS leak protection reduces the chance of others snooping on your web traffic, and the kill switch is joined by an auto-reconnect system to protect you if the VPN drops.",
    "That's just the start. VyprVPN doesn't just provide its own zero-knowledge VyprDNS service, for instance – you can switch it to any other DNS service you like. The client can also automatically connect VyprVPN when you're using untrusted Wi-Fi networks.",
    "VyprVPN has dropped some of the geekier settings available in its older client (you can't set MTU size anymore, for instance), but for the most part, the latest version works very well: it's fast, has a strong set of features and is generally easy to use.",
    "VyprVPN's Android VPN app opens with an identical interface to the Windows build. In a tap or two you're able to connect to your nearest server, or choose an alternative from the same location picker as the desktop version.",
    "The app has very similar settings to the Windows version, too: a kill switch, DNS leak protection, startup and auto-reconnect options, and the ability to use custom DNS settings.",
    "Protocol support now includes WireGuard as well as OpenVPN and VyprVPN's own Chameleon.",
    "Bonus features include optional URL filtering to protect you from malicious websites. Although we didn't test the effectiveness of the system, we noticed that it gives you more control than most competing services. If you hit a site on the blacklist, for instance, the system doesn't just block it. Instead, it displays a warning, and you can ignore this and proceed to the site if you're sure it's safe.",
    "A Connection Per App feature enables customizing VPN usage by individual app (other services call this 'split tunneling'). Choose any installed app and you can set it to always use the VPN, or bypass it and use your regular connection.",
    "The app isn't quite perfect – connection times were fractionally longer than usual, for instance, and we'd like to have IKEv2 support (although that's less relevant now the much faster WireGuard is here) – but it's easy to use, with a decent feature list, and more capable than a lot of the competition.",
    "VyprVPN's iOS app shares much the same look and feel as the rest of the range. Use the service on any other platform and you'll immediately feel at home.",
    "Most operations work just as they do with the other apps. A simple location picker makes it easy to find locations by name or speed, and commonly-used servers can be saved as favorites for speedy reconnection later.",
    "The iOS app doesn't include all the Android features. In particular, there's no URL blocking, and no kill switch. There are relatively few settings, too, although it is possible to set up the app to connect to the VPN whenever you access an untrusted wireless network, or automatically reconnect if the VPN drops unexpectedly, and you can set a custom DNS.",
    "There's a major recent addition in terms of support for WireGuard, though, as well as OpenVPN, IKEv2 and VyprVPN's Chameleon. If you need more control, the VyprVPN support site has instructions on manually setting up OpenVPN, L2TP/IPSec, IKEv2 and even PPTP connections.",
    "As with Android, VyprVPN's iOS app isn't exactly packing any killer features, but it's a likeable, user-friendly, and simple way to access VyprVPN from your iDevice.",
    "To understand the real-world performance of a VPN, we put every service we review through a series of intensive tests.",
    "We use test locations in the US and UK, each with a 1Gbps connection. After connecting to our nearest VPN server, we check speeds at least five times with multiple benchmarking sites and services: SpeedTest.net's website and the command line app, Netflix's Fast.com, TestMy.net and more. Tests are repeated for at least two protocols (where possible), and the full set of tests is repeated across morning and evening sessions, before we crunch the numbers and calculate median speeds.",
    "OpenVPN performance proved disappointing, with speeds peaking at 50Mbps. We don't know why, but it's been much the same story for three consecutive reviews now, so the tests seem to be telling us something useful.",
    "Don't give up on VyprVPN just yet, though, because switching protocol made a huge difference. Moving to WireGuard in the UK increased speeds to a far more acceptable 330-360Mbps. That's still on the low side – most VPNs reach 400-600Mbps, NordVPN managed 760-880Mbps in recent tests – but it's likely to be enough for many situations.",
    "VPNs often sell themselves on their ability to access geoblocked sites, giving you access to content you wouldn't normally be able to view – VPNs for Netflix have become particularly popular.",
    "To test VyprVPN's unblocking technologies, we connected to UK and US locations, then tried to access BBC iPlayer, US Netflix, Amazon Prime Video and Disney Plus. Whatever happened, we disconnected, reconnected, checked we had a different IP address and tried again, just to see if the result might vary depending on our IP.",
    "VyprVPN only has a single location in UK, limiting options for unblocking BBC iPlayer, but it successfully allowed us to stream content on all three test connections without any issues at all.",
    "US Netflix is a bigger challenge, and VyprVPN failed to get us access with all three of our test locations.",
    "Disney Plus was another miss, warning us that it is 'only available in certain locations' when we tried to log in.",
    "Results picked up at the end, with VyprVPN allowing us to access content on US Amazon Prime Video.",
    "That's not a terrible performance, but we've seen others do much better. CyberGhost, ExpressVPN, Hide.me, Hola, PrivadoVPN, Private Internet Access, ProtonVPN and Surfshark unblocked all test sites in recent reviews.",
    "VyprVPN support starts on its website, where a knowledgebase provides setup instructions, troubleshooting guidance and specific advice for various device types.",
    "Browse the site and this looks impressive, at least initially, with plenty of guides covering setting up the service on a wide range of platforms.",
    "However, this isn't quite as good as it first seems: the site assumes you know exactly what you want to do. So, for instance, clicking the Windows Manual Setup link gets you more links for guides covering Windows Vista to Windows 10, and choosing Windows 10 presents you with links for PPTP setup, L2TP, IKEv2 and OpenVPN GUI. We'd like to see more text explaining at least some of the relevant background knowledge (IKEv2 is best for security, OpenVPN GUI is a third-party system), but all you get right now is the page titles.",
    "As discussed above, when you eventually reach an article, there's usually not much to explore. Setup guides are generally stripped back to the essentials, with few or no screenshots to help illustrate the points they're trying to make. FAQs can also be very basic, often no more than 'how do I turn on feature x?', with a few lines of text to point users in the right direction.",
    "Still, there is some decent content here, and an accurate search system did a good job of finding relevant articles for all our test keywords.",
    "If the website can't help, live chat is available to give you a near-instant response. We only raised one test question, but the support agent was talking to us within a couple of minutes, and gave a helpful and informative response.",
    "The final option is to send an email. We raised a simple product question and had a clear response within an hour.",
    "VyprVPN support clearly has some issues, and it's not as thorough or in-depth as top competitors like ExpressVPN. The website does give you basic information on a wide range of topics, though, and with speedy live chat support on hand, it shouldn't take long to get helpful advice on any service problems.",
    "VyprVPN isn't the fastest or the most powerful VPN out there – but it's better than many, and there's plenty to like here, from the wide platform support, to the custom firewall-bypassing Chameleon protocol, and seriously low prices. We like the no logging security audit, too, although this dates back to 2018, so it's definitely time for another."
  ],
  "headers": {
    "8": "VyprVPN pricing",
    "12": "Privacy",
    "18": "Logging",
    "24": "Client setup",
    "30": "Windows client",
    "42": "Android app",
    "48": "iOS app",
    "53": "Performance",
    "57": "Netflix and streaming",
    "64": "Support",
    "72": "VyprVPN review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "two-month plan": "https://powerhouse.go2cloud.org/aff_c?offer_id=119&aff_id=3380&source=trd&aff_click_id=trd-us-5789256256795445000&url=https%3A%2F%2Fget.vyprvpn.com%2Frefer%2F%3Foffer_id%3D119%26aff_id%3D3380%26transaction_id%3D%7Btransaction_id%7D%26offer_id%3D%7Boffer_id%7D%26aff_id%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvyprvpn",
    "18-month plan": "https://powerhouse.go2cloud.org/aff_c?offer_id=119&aff_id=3380&source=trd&aff_click_id=trd-us-9031100197558442000&url=https%3A%2F%2Fget.vyprvpn.com%2Frefer%2F%3Foffer_id%3D119%26aff_id%3D3380%26transaction_id%3D%7Btransaction_id%7D%26offer_id%3D%7Boffer_id%7D%26aff_id%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvyprvpn",
    "three-year plan": "https://powerhouse.go2cloud.org/aff_c?offer_id=119&aff_id=3380&source=trd&aff_click_id=trd-us-1477381169945499600&url=https%3A%2F%2Fget.vyprvpn.com%2Frefer%2F%3Foffer_id%3D119%26aff_id%3D3380%26transaction_id%3D%7Btransaction_id%7D%26offer_id%3D%7Boffer_id%7D%26aff_id%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvyprvpn",
    "Hotspot Shield": "https://www.techradar.com/reviews/hotspot-shield-vpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Service Status": "https://powerhouse.go2cloud.org/aff_c?offer_id=119&aff_id=3380&source=trd&aff_click_id=trd-us-5941856102722493000&url=https%3A%2F%2Fsupport.vyprvpn.com%2Fhc%2Fen-us%2Farticles%2F360037728992-VyprVPN-Service-Status%3Ftransaction_id%3D%7Btransaction_id%7D%26offer_id%3D%7Boffer_id%7D%26aff_id%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvyprvpn",
    "public report": "https://powerhouse.go2cloud.org/aff_c?offer_id=119&aff_id=3380&source=trd&aff_click_id=trd-us-1183345191110199000&url=https%3A%2F%2Fwww.vyprvpn.com%2Fblog%2Fno-log-vpn-service%3Ftransaction_id%3D%7Btransaction_id%7D%26offer_id%3D%7Boffer_id%7D%26aff_id%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvyprvpn",
    "results": "https://powerhouse.go2cloud.org/aff_c?offer_id=119&aff_id=3380&source=trd&aff_click_id=trd-us-7921717010035655000&url=https%3A%2F%2Fwww.vyprvpn.com%2Fvyprvpn%2Faudit.pdf%3Ftransaction_id%3D%7Btransaction_id%7D%26offer_id%3D%7Boffer_id%7D%26aff_id%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvyprvpn",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn",
    "50 tutorials": "https://powerhouse.go2cloud.org/aff_c?offer_id=119&aff_id=3380&source=trd&aff_click_id=trd-us-8172520756987548000&url=https%3A%2F%2Fsupport.vyprvpn.com%2Fhc%2Fen-us%2Fcategories%2F360002441271-Getting-Started%3Ftransaction_id%3D%7Btransaction_id%7D%26offer_id%3D%7Boffer_id%7D%26aff_id%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvyprvpn",
    "Windows VPN": "https://www.techradar.com/vpn/best-windows-10-vpn",
    "Android VPN": "https://www.techradar.com/vpn/best-vpn-for-android-our-5-top-choices",
    "iOS app": "https://www.techradar.com/vpn/the-best-vpn-for-iphone",
    "VPNs for Netflix": "https://www.techradar.com/vpn/best-netflix-vpn",
    "support": "https://powerhouse.go2cloud.org/aff_c?offer_id=119&aff_id=3380&source=trd&aff_click_id=trd-us-5282422460134756000&url=https%3A%2F%2Fsupport.vyprvpn.com%2Fhc%2Fen-us%3Ftransaction_id%3D%7Btransaction_id%7D%26offer_id%3D%7Boffer_id%7D%26aff_id%3D%7Baffiliate_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvyprvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn"
  }
}