{
  "source": "https://www.techradar.com/reviews/mecool-now",
  "title": "Mecool Now Android webcam/thin client review",
  "category": "computing",
  "updated": "2021-05-26T10:29:08.174Z",
  "author": "desire-athow",
  "summary": "An exciting new mini computer designed for the WFH era",
  "verdict": "The Mecool Now is a refreshing attempt to elevate the humble webcam to something that’s far more versatile and useful in a daily working environment but it is a disappointment to say the least but the blame lies squarely at the feet of Google.",
  "pros": [
    "Google Certification",
    "Well designed product",
    "Well thought-out remote control",
    "Reasonable pricing"
  ],
  "cons": [
    "Only Google Duo available",
    "10/100 Ethernet port",
    "Only one USB port",
    "No microSD card slot"
  ],
  "article": [
    "And now for something slightly different, a computer that has been designed around a webcam and runs on Android. Meet the Now which comes from a Chinese company that specializes in thin clients (otherwise known as TV boxes) that run on Google’s ubiquitous operating system including one that we reviewed four years ago (Mecool M8S Pro). It also produced one that comes with a TV tuner, another one that is fused with a soundbar and the cheapest computer in the world at less than $15, all the way back in January 2020.",
    "The Mecool Now is on sale directly for a mere $129 and you can grab a 5-foot tall extendable tripod stand for a mere $22. You can also buy a pair of Mecool Now devices for $246 at the time of writing. Note that the prices are excluding shipping, local taxes and any administrative fees that may be levied. Until June 21st, you can get two Mecool Now devices for $207 thanks to a discount code that will be automatically applied.",
    "Shaped like a flat black brick of plastic (200 x 68 x 25mm), the Mecool Now is cleverly designed with plenty of features that underline the amount of work that went into the R&D process. The device has been shaped to sit atop of a monitor or TV, which means that the camera sensor and most of the buttons are located on the thin long edge.",
    "From left to right are the power button, the remote control sensor, a physical answering/dial phone button, four lights to indicate the status of a call, a pair of microphone pin holes, a camera indicator and switch/cover for those wary about their privacy.",
    "The speaker grill is located on top, as is a physical microphone button to eliminate any risk of accidental snooping. On the base, one can find a barrel-type power connector, a tripod mounting hole, two HDMI ports (one being a HDMI-in), a device bracket - to mount on top of a TV - and a 10/100 Ethernet port.",
    "On one side is a USB 3.0 port only; no microSD card slot and no additional ports. The bundled remote control is a fairly standard one but with dedicated Google Assistant, Tiktok, YouTube and Google Duo buttons. Made entirely of plastic - to keep costs low, it is practical rather than aspirational.",
    "This Android-powered webcam (or video conferencing solution as we’d call it) contains a quad-core Amlogic S905X4 processor with 2GB of RAM and 16GB onboard storage. It boosts Wi-Fi 5 wireless connectivity, Bluetooth 4.2, a full HD webcam, a powerful 5W speaker and two microphones. The power supply unit (10W, 5V2A) is tiny but the cable could be a bit longer.",
    "The Mecool Now runs on Android TV 10 rather than the bog standard Android mobile OS that powers a lot of Android TV boxes. It is therefore a fully Google Certified video calling streaming media device with Google Duo TV version built-in.",
    "The setup was surprisingly straightforward with syncing your remote control being your first step (you will need AAA batteries).",
    "Note that you can’t use the Mecool Now as a standalone webcam which is a bit of a missed opportunity although Mecool have plans to add this in the near future via a firmware update. As expected you don’t have access to the full Google Play store, only a subset. Business users will be disappointed to learn that the business and productivity categories are devoid of any heavyweights.",
    "There’s TeamViewer, a popular remote desktop service, a bunch of VPN providers but no Google Meet, Google Hangouts, Zoom or Chat, all of which are more popular than Duo.",
    "You will need to run non-compatible apps through the bundled sideload launcher instead. You cannot however install non-supported apps, probably something linked to the official Google certification. During our test, the audio was excellent thanks to the device’s far-field voice control as was the quality of the pictures provided that (a) you are not too far from your router (b) there’s enough ambient light.",
    "The HDMI-in port is an interesting addition as it essentially simplifies the switch between cable TV and the video calling device, a boon for technophobes and people who might find the whole switching HDMI ports a bit confusing.",
    "There’s at least one more such product on the market, the Banggood T95 C1 which we reviewed in October 2020. At less than $100, it is more affordable than the Mecool Now but the latter is in a different category altogether because it is a tidier, better designed product. Note that back in 2016, we reviewed the Cenovo King Kong Mini PC, the first - and only - Windows 10 Mini PC we’re aware of that came with a built-in webcam. It is no longer on sale.",
    "The Mecool Now is a well thought out product that suffers from minor issues, none of which are game changing. The core of the product is solid and we understand that corners have been cut in order to make sure that this remains - despite its premium status - an affordable product. We applaud the attention to details: from the placement of the buttons to providing multiple ways of improving privacy and interacting with the device.",
    "Its strength however remains the robustness of the software which is miles ahead of anything we’ve seen on Android TV boxes. Yes you lose the flexibility of bog standard Android OS (mobile) but you gain the seamlessness associated with Android TV (the OS).",
    "And herein lies its biggest problem: Android TV OS is limited, very limited and if businesses are planning to use it as an alternative to a Chromebox, then it simply won’t happen. It also paves the way for another question: why didn’t Mecool use ChromeOS. Truly, a missed opportunity to deliver something exceptional."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "6": "Hardware",
    "7": "In use",
    "13": "Competition",
    "14": "Final verdict"
  },
  "links": {
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "thin clients": "https://www.techradar.com/best/best-thin-client",
    "Mecool M8S Pro": "https://www.techradar.com/reviews/mecool-m8s-pro",
    "cheapest computer in the world": "https://www.techradar.com/news/meet-the-cheapest-pc-in-the-world-android-goodness-for-less-than-dollar15",
    "Mecool Now": "https://www.mecoolonline.com/collections/video-calling-on-tv-1/products/mecool-now-smart-video-calling-on-your-tv-google-certified",
    "two Mecool Now devices for $207 thanks to a discount code that will be automatically applied": "https://www.mecoolonline.com/collections/fathers-day-sale/products/2021-mecool-now-2-pack-google-certified-video-calling-on-your-tv%20",
    "video conferencing solution": "https://www.techradar.com/best/best-video-conferencing-software",
    "TeamViewer": "https://www.techradar.com/reviews/teamviewer",
    "remote desktop service": "https://www.techradar.com/news/best-remote-desktop-software",
    "VPN providers": "https://www.techradar.com/vpn/best-vpn",
    "Banggood T95 C1": "https://www.techradar.com/reviews/banggood-t95-c1-android-thin-client-pc",
    "Cenovo King Kong Mini PC": "https://www.techradar.com/reviews/cenovo-king-kong-mini-pc",
    "Chromebox": "https://www.techradar.com/reviews/pc-mac/pc-mac-desktops/samsung-chromebox-1082362/review",
    "ChromeOS": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/google-chrome-os-1082513/review"
  }
}