{
  "source": "https://www.techradar.com/reviews/huawei-matebook-x-pro-2021",
  "title": "Huawei MateBook X Pro (2021) review",
  "category": "computing",
  "updated": "2021-06-02T19:20:06Z",
  "author": "jess-weatherbed",
  "summary": "Sleek, stylish and slightly pricey",
  "verdict": "The Huawei MateBook X Pro is certainly gorgeous, stylish enough to rival other luxury devices on the market. Where it succeeds it does so with a flourish, but its disappointments are hard to swallow for something this expensive.",
  "pros": [
    "Stylish design",
    "Great 3:2 display",
    "Includes USB-A port",
    "Decent speakers for a laptop"
  ],
  "cons": [
    "'Up nose' webcam placement",
    "Pricey compared to rivals",
    "Needs other Huawei devices for features",
    "Limited availability"
  ],
  "article": [
    "The Huawei MateBook X Pro gets a 2021 refresh to go head-to-head with other products in the 'luxury laptop' market, such as the 13-inch M1 MacBook Pro and the Dell XPX 15. In fact, the first version of the MateBook X Pro impressed us so much back in 2018 that we awarded it a coveted 'best in class' award and stuck it right at the top of our list of the best laptops at the time. That sadly seems to have created some very imposing shoes to fill since, despite being impressed with this new offering, the MateBook X Pro (2021) falls flat in a few key areas. A glaring one is regional availability, with the device only available throughout China and parts of Europe at the moment, though Huawei has confirmed there are plans to make the product available in the USA through third-party retailers like Amazon - eventually. It's important to not take our criticism on the MateBook X Pro to mean that it's a bad product though. The experience of using the sleek ultrabook was very pleasant for everyday tasks, and it took heavy workloads like a total champ thanks to its powerful hardware.",
    "Our review model came with an 11th gen Intel Core i7 CPU and 16GB of DDR4 RAM, which quite happily ate its way through every spreadsheet, chrome tab and streaming app we could throw its way with very few complaints. Our benchmarks also revealed it's a capable workhorse that will happily keep pace with your daily needs, though it can't compete with similarly specced machines like the HP Spectre x360. There are a few innovations to the design that also didn't meet expectations, like webcam being cleverly concealed within the keyboard that results in an unflattering view of your chin, and some interesting software that allows you to share data via Wi-Fi or Bluetooth, but only if you own a Huawei mobile phone. When you also take the high price tag into account, these issues make the MateBook X Pro feel overpriced for what essentially amounts to a bang-average luxury laptop. If you care about style over features then this is still a decent purchase of course, and the premium aesthetic of this laptop outshines products that boast better functionality.",
    "The model we reviewed is available for £1,600 / €1,900 (around $2,250, AU$3,000) though as previously mentioned, it's not currently available outside of China or Europe right now. This makes it a tricky sell as both the M1 MacBook Air and the Windows Surface Laptop 4 are subjectively better laptops at a much smaller price point, but the asking price isn't wholly unexpected for an ultrabook in the 'premium' category. It's still pricey, but for a luxury price tag you're getting some pretty luxury (if not quirky) features. Working out if this is a suitable laptop for you will mostly boil down to how many of these niche benefits you will actually use, which could in turn justify how expensive it is. For anyone not looking to drop a hefty sum of cash on a device or look into importing a device from overseas, there are cheaper laptops available that will suit your needs.",
    "The design of the Huawei MateBook X Pro is absolutely where it shines, but even then it couldn't pass up raising a few eyebrows. Only two finishes are available – Space Grey and Emerald Green, which might understandably confuse you given the photos of the product dotted throughout this review clearly display a blue laptop. Apparently, this is the Emerald Green finish, which is even bluer in life than our photographs would suggest, perhaps teal at a push. Regardless of color discrepancy, this is a gorgeous laptop. The bright color stands out against a sea of mostly silver and black products on the market, with a metallic gold Huawei logo embellished on the back that really helps the blue hue pop. It isn't the lightest laptop in the ultra-slim category by any stretch, measuring in at 15.51 x 8.54 x 0.57 inches and weighing 2.9 pounds, but it's still perfectly portable and easy to throw into a bag. We didn't find the lovely blue coating easy to scratch either, but it would likely be best to make sure it gets some sort of protective case if you care about it not taking a beating. The 13.9-inch 3000 x 2000-pixel display has a 3:2 aspect ratio that provides wonderfully sharp visuals, and the bezels are incredibly small. It's a real joy to watch shows on, so if streaming or watching movies on the go is a priority then this is a great choice. The touchscreen functionality is very reactive but the screen having a gloss finish resulted in unsightly fingerprints all over the surface with even the cleanest of hands. The screen being glossy also means that using the laptop in any bright environment is a complete nightmare though, so don't expect to be working out in the garden when the sun comes out. The glare makes it impossible to use.",
    "The keyboard is decent, with some soft underlighting to illuminate the keys in darker environments. The keys themselves do feel a little shallow, but still manage to have more 'click' to them than the dreaded Apple butterfly keyboard and are pleasant enough to type on without feeling spongey. The power button also doubles as a fingerprint reader and we were suitably impressed by its reliability and speed. There was only one incident in which we had to readjust our finger position to get the sensor to work, and it quickly recognized our print on the second attempt.",
    "Efforts have also been made to blend the top firing speakers into the design, stealthily building the vents directly into the chassis along either side of the keyboard. The audio is really impressive for such a slim laptop, if lacking a little in bass, with crisp vocals and great volume levels. The MateBook X Pro also comes with Nahimic pre-installed so you can optimize for the media you're listening to, be it music or TV/Film.",
    "Dubbed the 'Free Touch', the Matebook X Pro's 4.5 x 3.0-inch touchpad might take some getting used to, and appears to be inspired somewhat by those found on MacBooks. The surface is sleek and doesn't create any drag, but those used to other Windows devices might need to adjust to the haptic feedback rather than a physical click.",
    "If you have a Huawei mobile phone then you can also use the touchpad as a built-in NFC (Near Field Communication), allowing you to connect the devices by simply placing your phone on it like a card reader. This feature only works for Huawei phones, unfortunately, and a select few models at that.",
    "In all this, the build quality feels very solid. The keyboard plate provides very little flex, and the chassis is made from aluminum rather than acrylic which certainly helps to justify the lofty retail price. Just like many other ultra-slim laptops, you're not getting a lot of ports for your investment. On the left side of the device you'll find a 3.5mm headphone jack and two Thunderbolt USB-C ports, one of which is labeled up to use for charging the MateBook X Pro. On the right-hand side you'll thankfully find a USB-A port, a rare sight these days on modern laptops that means you won't be at the mercy of using a dongle if you want to connect a flash drive.",
    "Given the MateBook X Pro comes with an 11th gen Core i7-1165G7 and 16Gb of DDR4 RAM, you're getting some fairly speedy performance. It limps behind most of its rivals in the premium laptop market, but it's unlikely you would notice for most day-to-day activities. A good reference is the PCMark 10 home test that replicates typical tasks you would need from your laptops such as spreadsheets, conference calling and web browsing and then awards points based on how well it performs the benchmark. While the Huawei MateBook X Pro achieved 4,459 points, the HP Spectre x360 managed 4,721 and the Dell XPS 13 leads with 4,816. The integrated Intel Iris Xe graphics are an additional benefit that could sway you over other products though, as while you certainly won't be playing the latest AAA games at 60+fps, it's powerful enough to run indie titles and low-requirement shooters. You should have zero issues playing Fortnite or CS:GO at a playable framerate if you're sensible about the graphical settings in game. This is also reflected on the graphics benchmarks we ran, with the MateBook X Pro achieving a respectable 1,390 on 3DMark's Time Spy test.",
    "Heat also wasn't much of an issue regardless of how much we threw at it. The underside got a little toasty after a period of streaming music while working with a frankly embarrassing amount of Google Chrome tabs open, but the temperature is still 'lap friendly' and the fan noise didn't become disruptive. There was a pleasant lack of any unnecessary bloatware on the laptop too, so you're getting the most out of the 1TB of fast SSD storage. There are a couple of features like 'Huawei Share' that will likely be lost on anyone in the USA should the MateBook X Pro ever make an appearance on shelves though, given that they need a Huawei mobile phone to use. Huawei devices are very rare in the USA so it's unlikely many people will actually have one of those devices. If you're lucky enough to have a great internet connection then you can make the most of it with the MateBook X Pro as it comes with the latest Wifi 6 and Bluetooth 5",
    "The battery life of the Huawei MateBook X Pro is another area that falls under the average for premium laptops, managing to trundle along for 10 hours and 13 minutes in the PCMark battery life benchmark. The TechRadar movie test came in just under that, playing a looping video for eight hours and 46 minutes, less than the 10 hours of video playback claimed possible by Huawei. There's is a pattern emerging with many of these results in which the MateBook X Pro isn't disappointing per se until you look at what else is available for a similar (or even cheaper) price. The M1 MacBook Air manages 11 hours and 15 minutes in the same PCMark test, and generally offers a better deal than the MateBook X Pro, with the HP Spectre x360 similarly achieving 12 hours and 52 minutes. It makes up for this slightly with how fast the device can charge. We were able to fully charge the laptop in less than two hours, with four hours of power only taking around 35 minutes. The full ten hours of battery life is also more than enough for most folk who need to work away from a power supply, but you might not be able to make it through a long haul flight if you're watching some of your favorite movies.",
    "Let's not beat around the bush here – this webcam placement is terrible. Sure, a few years back this was an ingenious design, concealing the webcam stealthily within the keyboard to free up space on the display, but in a world where conference calling has become a nearly daily activity for many of us, it's a questionable choice. The 720p quality is grainy even in a well-lit environment, so this somehow manages to feel like both too much and too little thought went into the webcam itself. The viewing angle is incredibly unflattering, mainly capturing the user's chin and nostrils so it's hard to hold a professional meeting or presentation without staring down directly at the keyboard surface for eye contact. You can click down to hide the webcam away, which acts as a built-in privacy switch but doesn't actually cut the call or cancel the video feed. Instead, your footage will continue, albeit in the dark."
  ],
  "headers": {
    "0": "Two-minute review",
    "2": "Price and availability",
    "3": "Design",
    "9": "Performance",
    "11": "Battery life",
    "12": "Webcam",
    "13": "Don't buy it if..."
  },
  "links": {
    "13-inch M1 MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Dell XPX 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "HP Spectre x360": "https://www.techradar.com/reviews/hp-spectre-x360-2021",
    "M1 MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Windows Surface Laptop 4": "https://www.techradar.com/reviews/surface-laptop-4",
    "cheaper laptops": "https://www.techradar.com/news/the-best-laptop-deals"
  }
}