{
  "source": "https://www.techradar.com/reviews/tp-link-kasa-smart-wi-fi-plug-slim-kp105",
  "title": "TP-Link Kasa Smart Wi-Fi Plug Slim KP105 review",
  "category": "smart-home",
  "updated": "2021-06-02T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "A compact smart plug that lets you control any electrical device connected to it, even if you’re not at home",
  "verdict": "The TP-Link Kasa Smart Wi-Fi Plug Slim KP105 is an affordable, compact smart plug that allows you to control any electrical appliance connected to it from your smartphone, even when you’re not at home. It integrates with Alexa and Google Assistant, but unlike the HS110, it doesn’t keep track of the energy consumption of the device connected to it, nor does it support HomeKit.",
  "pros": [
    "Simple to use",
    "Slim design",
    "Compatible with Alexa and Google Assistant"
  ],
  "cons": [
    "No HomeKit support",
    "No energy monitoring"
  ],
  "article": [
    "A name more familiar with routers and powerline adapters, TP-Link has been at the forefront of networking products for more than two decades. However, the brand has also been making smart home devices since 2015, offering a wide range of affordable gadgets to automate your home, including the best smart light bulbs, home security cameras and smart plugs.",
    "Its entry-level device is the TP-Link Kasa Smart Wi-Fi Plug Slim KP105 – a single smart socket that ensures you can control any device plugged into it from your smartphone, even when you’re not at home. If you’re the forgetful type who can’t recall whether you’ve turned off the radio or your straighteners before you left the house, this smart plug can certainly help. Compatibility with Alexa and Google Assistant means you can use your voice to control the smart plug, too.",
    "Connect the TP-Link Kasa Smart Wi-Fi Plug Slim to your home Wi-Fi network and then use the Kasa app to turn it on and off, or set timers and schedules for when it should be switched on or off. If you own other TP-Link smart home devices, these can be grouped together with the smart plug in the app, so several gadgets can be controlled at once.",
    "The TP-Link Kasa Smart Wi-Fi Plug Slim KP105 is priced at £14 / AU$24. It’s available in the UK and Australia through Amazon and a selection of electrical retailers.",
    "TP-Link also offers a version of this smart plug with an energy monitoring feature, known as the TP-Link KP115. This model is available in the US, as well as in the UK and Australia, and will set you back $19 / £17.99 / AU$29.99.",
    "One of the most compact smart plugs we’ve tested, the TP-Link Kasa Smart Wi-Fi Plug Slim KP105 is an unobtrusive white plastic device measuring 2.85 x 2.0 x 1.5 inches / 7.25 x 5.15 x 3.75 cm (h x w x d). It isn’t as bulky as other TP-Link smart plugs, and it sports a plain rectangle design rather than the oval-shaped look of the TP-Link Smart Wi-Fi Plug with Energy Monitoring HS110. That said, if your power sockets are chrome, it’s white finish will certainly stand out.",
    "On the front of the plug is a single socket with a tiny LED above that glows green when the plug is switched on; a manual power button can be found on the left-hand side of the unit. There’s no Wi-Fi indicator that alerts you to any connectivity issues, and the smart plug only works on the 2.4GHz band. As such, you may find you suffer connectivity issues if you’re installing it in a different room to your router.",
    "Like other TP-Link smart plugs, the KP105 is extremely simple to set up. Once the device has been plugged into an electrical outlet, download the Kasa app onto your smartphone and follow the steps on-screen. A few extra taps will be required to connect your phone to the plug’s own Wi-Fi network, before the app can discover and connect to it. Nevertheless, the whole process took us less than two minutes. If you run into problems during set-up, there’s a visible help option in the app that offers information on what you should do next.",
    "When assigning a name to the plug, you can also select for a range of icons or add your own picture to make it easier to identify individual plugs, if you have several installed in your home.",
    "Once the device has been set up, it’s unlikely that you’ll need to interact with the unit itself, since all control is via the Kasa app. On test, the plug responded instantly when we used the app to switch it on or off, denoting each with a reassuring click.",
    "A handy Away mode can turn the smart plug on and off at random intervals. If connected to a lamp or radio, it can be activated to simulate occupancy in your home, even if you’re not around, which may help boost your home’s security.",
    "Unlike other TP-Link smart plugs, there’s no energy monitoring feature here, although the app will show you how many hours any device connected to the plug has been on for – although we remain unclear about what use this will have for most people.",
    "We found the Kasa app super-easy to navigate. On launch, a list of all TP-Link smart home devices is displayed, making it easy to control all of your smart home devices. In the case of the smart plug, tapping the power icon to the right of the screen switches the smart plug on or off.",
    "The app also allowed us to create a group of devices that can be controlled at once, alongside setting timers and schedules for when the plug should switch on or off, and even activate Away mode.",
    "Automations can be created directly from the app using the Scenes tab, and you can select the word or phrase you wish to use to activate the automation. In addition, the Smart Actions section lets you create automations that can be activated at a certain point in time, or based on any motion detected by TP-Link cameras you may have in your home.",
    "The app also allows you to integrate the smart plug with Amazon Alexa, Google Assistant, IFTTT and SmartThings. The only service missing here is Apple HomeKit.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "3": "TP-Link Kasa Smart Wi-Fi Plug Slim KP105 price and availability",
    "5": "Design",
    "7": "Performance",
    "12": "App",
    "16": "Don't buy it if"
  },
  "links": {
    "routers": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523",
    "powerline adapter": "https://www.techradar.com/news/the-best-powerline-adaptors",
    "smart plugs": "https://www.techradar.com/news/best-smart-plugs-and-switches"
  }
}