{
  "source": "https://www.techradar.com/reviews/unihertz-ticktock-5g-dual-screen-rugged-smartphone",
  "title": "Unihertz TickTock 5G dual-screen rugged smartphone review",
  "category": "phones",
  "updated": "2021-12-08T08:51:25Z",
  "author": "desire-athow",
  "summary": "A 5G rugged smartphone with a difference but will that be enough to sway users?",
  "verdict": "Without the secondary display, the Ticktock 5G is just another 5G rugged smartphone powered by the ubiquitous Dimensity 700. It offers no compelling features other than perhaps the dual customized buttons and the IR sensor. That said, it is eminently affordable, at least for now.",
  "pros": [
    "Reasonably big battery",
    "IR sensor",
    "Dual customizable buttons",
    "Solidly built",
    "Good price for Early Bird"
  ],
  "cons": [
    "No wireless charging",
    "FM radio doesn’t work",
    "Odd design choice",
    "Second display is a bit pointless",
    "Can’t use front and rear cameras at the same time"
  ],
  "article": [
    "A second display on a rugged smartphone is a bit like yeast-based spread Marmite (or Vegemite depending where you are), you will either like it a lot or not like it at all. Unihertz has been known for producing some of the most innovative smartphones we’ve seen in recent years, adding keyboards to Android smartphones or shrinking them for Lilliputian hands. Its latest product is the TickTock 5G and while we understand that the inclusion of a round rear display might wow an audience looking for such a feature, it didn’t knock us off our socks. For us, that screen is too limited to count as a compelling unique selling point. That said, for $279, it is a good deal for those looking for a rugged 5G smartphone.",
    "The Unihertz TickTock 5G is currently on Kickstarter with 29 days left. At the time of writing, 440 backers had pledged nearly £100,000 with the Early Bird prices set at $279 (about 150 left) and an estimated delivery date of April 2022. That’s a 35% discount off the suggested retail price and do remember that the price doesn’t include delivery.",
    "Unihertz bucks the trend of rectangular-shaped rugged smartphones by going for one with six sides. That’s right, the TickTock 5G smartphone has pointy ends at the bottom and the top of the device.",
    "There’s an infrared sensor there while a flap hides a Type-C connector on the opposite apex. Other than trying to look different, we can’t really think of any good reason to opt for an hexagonal shape. We can think of at least one reason why it is a bad idea. You can sort of make a smartphone stand by leaning it against a vertical flat surface (wall, monitor etc). You can’t with the TickTock 5G as it will awkwardly tip to the left or to the right.",
    "At the back are two camera sensors, one of which seems to be a dummy one (that’s the one without the LED flash on above it) while the other one is a 48-megapixel model. Then there’s the 1.3-inch round color touchscreen display next to it, which looks like a posh smartwatch without the straps. The metal ring surrounding it adds to that sentiment as it protrudes significantly from the back, by about 3mm. Further down is the Unihertz logo and a grill that hides one speaker (the phone is 176 x 86 x 15mm for a weight of 308g).",
    "On the right edge are the volume rocker and the power button that incorporates a fingerprint sensor. There’s two red buttons on the other side next to the SIM tray; the buttons can be customized and are usually used for ICE or push-to-talk.",
    "As for the front of the device, a large 6.5-inch display with a 2340 x 1080 pixel resolution has a centrally located waterdrop 8-megapixel selfie camera sensor and a notification LED. Overall, the utilitarian, industrial look of the smartphone (dark color scheme, reinforced corners, generous use of plastic, metal frame) is what we’d expect from a rugged smartphone that adheres to both IP68 and MIL-STD-810G certifications.",
    "A Mediatek Dimensity 700 system-on-chip powers the TickTock 5G smartphone with 8GB of RAM and 128GB eMMC storage which can be augmented via the microSD card slot. Wireless connectivity comprises 5G, Wi-Fi 5, Bluetooth 5.1 and NFC. There’s even an FM radio (apparently) but you can’t use it because you need to plug in an earphone to be used as an antenna. Trouble is that there’s no 3.5mm jack. A 6,000mAh battery fed by a 30W fast charging power supply unit that makes the whole thing tick.",
    "The TickTock 5G runs on Android 11 with a near-stock UI; when it comes to performance, there’s not much to write about; it is on par with other Dimensity 700 rugged smartphones we’ve tested in the past months; the Blackview BL5000, the Oukitel WP15, the Doogee V10 and the Ulefone Armor 12. In other words, it is solidly mid-range when it comes to benchmark numbers.",
    "By default, the rear display is off. Double tap it to activate it; you can choose from 16 existing watch faces or add your own.",
    "Elsewhere is an app toolbox that contains a whopping 15 different applications aimed at outdoor enthusiasts, DIY fans and field workers. Out of the lot, a speedometer and a barometer caught our eye.",
    "It appears that you cannot use both cameras at the same time, which is a bit of a bummer. Being able to use both would have been a definite plus.",
    "We’re not convinced by the rear display; it is too small to be really useful in our opinion and it has limited functionality as it stands right now, although Unihertz promises that “as Ticktock goes through more software updates, there will be more features added to the list”.",
    "Don’t get us wrong, we really, really like Unihertz's tendency to defy expectations, think outside the box and come up with innovative, quirky innovations (see the Atom, the Titan or the Atom XL) but the TickTock sounds more like a half-baked platform looking for problems to solve.",
    "Add a proper 48-megapixel front-facing selfie (if pixel count is what you’re after) or a selfie sensor with an LED ring or an e-ink, always-on display like the one on the Hisense A5. That would instantly make it more attractive to us.",
    "Buy it if:",
    "You want a secondary display at all costs. Strictly speaking, it is a unique selling point but it feels to us like a solution looking for a problem. Unihertz suggests three use cases, none of which are particularly compelling.",
    "Don’t buy it if:",
    "You don’t need a secondary display. There are cheaper options out there; the Oukitel WP13 being by far the cheapest at $246 at the time of writing. It lacks the IR sensor or the dual customizable buttons.",
    "We've also rounded up the best rugged smartphones and best rugged tablets"
  ],
  "headers": {
    "0": "Two minute review",
    "1": "Pricing and availability",
    "2": "Design",
    "7": "Hardware",
    "8": "Performance and in use",
    "15": "Should I buy the Unihertz TickTock?"
  },
  "links": {
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "5G smartphone": "https://www.techradar.com/best/best-5g-phones",
    "Unihertz TickTock 5G": "https://www.kickstarter.com/projects/jellyphone/ticktock-the-unique-5g-dual-screen-rugged-smartphone",
    "Blackview BL5000": "https://www.techradar.com/reviews/blackview-bl5000-rugged-smartphone",
    "Oukitel WP15": "https://www.techradar.com/reviews/oukitel-wp15-rugged-smartphone",
    "Doogee V10": "https://www.techradar.com/reviews/doogee-v10-rugged-smartphone",
    "Ulefone Armor 12": "https://www.techradar.com/reviews/ulefone-armor-12-5g-rugged-smartphone",
    "Atom": "https://www.techradar.com/reviews/unihertz-atom",
    "Titan": "https://www.techradar.com/reviews/unihertz-titan-ruggedised-smartphone",
    "Atom XL": "https://www.techradar.com/reviews/unihertz-atom-xl-rugged-smartphone",
    "Hisense A5": "https://www.techradar.com/news/this-dollar220-smartphone-has-embraced-obsolete-tech-from-the-1970s",
    "best rugged smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "best rugged tablets": "https://www.techradar.com/news/the-best-rugged-tablets"
  }
}