{
  "source": "https://www.techradar.com/reviews/lumie-bodyclock-spark-100",
  "title": "Lumie Bodyclock Spark 100 review",
  "category": "fitness",
  "updated": "2021-11-07T19:35:42Z",
  "author": "rob-clymo",
  "summary": "A calming wake-up light that makes mornings a little more palatable",
  "verdict": "Some folks love getting up in the mornings and don’t seem at all bothered when their alarm clock or smartphone goes off. Many of us aren’t so keen on hearing the sound of an alarm though, or handling the harshness of a bedside light at what always seems like silly-o-clock. Waking up can be unnecessarily stressful, which is why we love the Lumie Bodyclock Spark 100. Using smart lighting effects to emulate the sunrise (and sunset too), while delivering an alarm that’s fairly easy on the senses, this great little gadget. It’s simple to set up and use, can be configured to suit different family members and can help to fend off SAD and other seasonal negative vibes. If you view going to bed and getting up again with limited enthusiasm, it’s really well worth a try.",
  "pros": [
    "All-in-one alarm, clock and light",
    "Light settings can be customised",
    "Soothing tones to suite all tastes",
    "Auto-dimming display"
  ],
  "cons": [
    "Alarm a bit harsh",
    "Bigger than average alarm clock",
    "Mains powered",
    "Plasticky design"
  ],
  "article": [
    "The Lumie Bodyclock Spark 100 is a great little solution if you’re not particularly great at getting up in the mornings, or going to bed at night for that matter. It’s effectively a smart alarm clock, which combines digital bedside timekeeping with a nightlight in a design that soothes rather than scares when it kicks into life.",
    "This mains-powered wake-up light fits nicely on a bedside table and can be adjusted to suit the needs and sleep habits of each individual user. Sleep and wake up times, both for adults and children, can be tailored so that the light emulates sunset and sunrise. That means you can head off to sleep with a calming glow that gradually fades to nothing.",
    "Come wake-up time, the Lumie Bodyclock Spark 100 recreates the gradual rising of the sun, which allows you to wake up much less stressed than by using an old-school alarm clock or your phone.",
    "The Lumie Bodyclock Spark 100 launched in 2018. It can be found at various retailers, with a recommended retail price of $100 in the US, and £79 in the UK. If you're in the UK, you can also buy it direct from Lumie.",
    "That's roughly the same as the excellent Beurer Wake Up Light WL50, so you're spoilt for choice if you're looking for a wake-up light in this price range.",
    "The Bodyclock Spark 100 is listed on Amazon Australia as well, though at the time of writing was out of stock.",
    "Lumie is of the best known names in the sizeable wake-up light marketplace, and the Lumie Bodyclock Spark 100 model one of the best-selling in its range. As a result, this is a design that’s been carefully refined over time and looks great on your nightstand.",
    "The design is dominated by plastic, with some elements that feel slightly flimsy (the main button interface being the main offender). However, everything works in a straightforward fashion and the Lumie Bodyclock Spark 100 benefits from a quick and easy set-up process. The same goes for making additional adjustments, to light settings and alarm times respectively, as you use it over time.",
    "The plastic ‘dome’ part of the design feels like it might not be able to handle any major knock or drops, but treat it with respect and the Lumie Bodyclock Spark 100 should deliver several years of service.",
    "The designers at Lumie have done the decent thing and developed a digital clock display that can be dimmed, which is crucial if you tend to be disturbed by any level of light pollution. There’s a button on the underside next to the power port input that lets you switch the display to either off or auto too, which is well worth knowing.",
    "In fact, light levels can also be set to suit your tastes too, using an incremental scale while the alarm has the same set of options. Thanks to this versatility, the light emitted by the Lumie is wonderfully adjustable, from a subtle red/orange hue at the lowest level through to a dazzling, some might say harsh white light at its strongest.",
    "Of course, the best thing about the light is its ability to be adjusted to suit your morning – and evening moods. Core settings are controlled using three buttons: one for waking up, another for sunset settings and a third central button is used to confirm your choice once you’ve pressed the + or – buttons to make a selection.",
    "There’s a reasonable length power cable that connects it to the mains although the unit will also briefly retain the time and settings if it gets switched off by mistake.",
    "The Lumie Bodyclock Spark 100 comes with a decent-sized manual, which you’ll certainly need to pick through to avoid the light and/or alarm coming on at the wrong time. It’s pretty easy to configure and Lumie has done a respectable job with those buttons that surround the digital clock display, though time will tell how robust they actually are.",
    "The whole point of the Lumie Bodyclock Spark 100 is to aid sleep and allow you to reset your body clock without any negative stuff such as shrill alarms and harsh lights. It’s also the reason why sleeps aids like this are often recommended for people with SAD or other sleep issues, simply because the overall effect is much less stressful on the body.",
    "While sleep time is personal to everyone, and getting up even more so, we tried the Lumie Bodyclock Spark 100 with three different family members and the effects were largely positive. It seems particularly good for children, especially if you have young ones that aren’t too keen on lights-out time. Usefully, the Lumie Bodyclock Spark 100 can be programmed to deliver a slow fading light from 1 to 5 in the evenings, running down over 30 minutes. Anyone using it gets a calming effect as well as a subtle nudge that it’s actually time to go to sleep. It works.",
    "Waking up delivers a similarly soft-on-the-senses performance, with a 30-minute gradual glow that emulates the rising of the sun. This is tempered somewhat by the alarm, which is less easy on the senses and gets more frenetic the longer you ignore it, but the noise only starts once the light has got to its brightest sunrise setting. It’s still much less grating than something delivered by an old-school alarm clock too.",
    "Smartphone alarm devotees might not feel the urge to try it and stick with their regular wake up method, but the gradual glow of the light is an undeniably positive thing. Adults and children alike seem to agree that it’s one of the best ways to prise those sleepy eyes open in the morning.",
    "If you’re really not keen on alarms it’s also worth trying the Lumie Bodyclock Spark 100 with the alarm switched off and just using the light as a gentle wake-up prod in the morning. However, it may also be worth keeping a back-up alarm in place, just in case the fake sunset doesn't actually wake up you as intended.",
    "The tap-to-snooze function also got good use during our time with the Lumie, proving once again that there’s nothing quite so rewarding as a few more minutes of shut-eye before breakfast.",
    "If you’re looking for a slightly more sophisticated option, with audio noises, look out for the Lumie Glow 150. The Lumie Shine even adds a radio.",
    "We found the Lumie Bodyclock Spark 100 perfect for basic use though, and anyone, from problem sleepers through to those affected by seasonal affective disorder might find it a really great addition to the bedroom. It’s bigger than many generic alarm clocks mind, so you’ll need a little more space for it as a result because of those 16cm x 19cm x 12cm dimensions.",
    "First reviewed October 2021",
    "This article is part of TechRadar's Sleep Week 2021 (running from Sunday 31 October to Sunday 7 November), our in-depth look at sleep and how to snooze better. We've teamed up with experts in their field to bring you sleep techniques and tips to help you drift off easier, and have rounded-up the best sleep kit to transform your bedroom into a den of zen."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and availability",
    "6": "Design",
    "14": "Performance",
    "23": "Don't buy it if"
  },
  "links": {
    "wake-up light": "https://www.techradar.com/best/wakeup-light",
    "direct from Lumie": "https://www.lumie.com/products/bodyclock-spark-100",
    "Beurer Wake Up Light WL50": "https://www.techradar.com/reviews/beurer-wake-up-light-wl50",
    "Amazon Australia": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com.au%2FLumie-Bodyclock-Spark-100-Wake-up%2Fdp%2FB07CN5P1RJ%3Ftag%3Dhawk-future-22%26ascsubtag%3Dtrd-us-7312310816716367000-22",
    "Lumie Glow 150": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB082V9XT9N%3Ftag%3Dhawk-future-20%26linkCode%3Dogi%26th%3D1%26psc%3D1%26ascsubtag%3Dtrd-us-6024293921361521000-20",
    "Lumie Shine": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB082VB97H9%3Ftag%3Dhawk-future-20%26linkCode%3Dogi%26th%3D1%26psc%3D1%26ascsubtag%3Dtrd-us-5547463472024429000-20",
    "TechRadar's Sleep Week 2021": "https://www.techradar.com/news/welcome-to-techradars-sleep-week"
  }
}