{
  "source": "https://www.techradar.com/reviews/jbl-bar-51",
  "title": "JBL Bar 5.1 review",
  "category": "audio-visual",
  "updated": "2021-11-23T16:47:35Z",
  "author": "andrew-london",
  "summary": "Smart design makes up for a slightly-lacking sound",
  "verdict": "For movie lovers with a shortage of space, the JBL offers a seriously appealing prospect: totally wireless surround sound from a soundbar. The sound palette that it offers isn’t as rich as some of its competitors, but its transforming surround sound capabilities are impressive.",
  "pros": [
    "Truly wireless 5.1 surround sound",
    "Easy to set up and use",
    "Impressive vocal clarity"
  ],
  "cons": [
    "Music feels flat",
    "Plastic design",
    "Gap between mids and bass"
  ],
  "article": [
    "The JBL 5.1 is a few years old now, but in the world of audio devices a few years is merely a drop in the bucket. Often you can find the soundbar on sale, so it's still worth considering if you're in the market for a simple 5.1 system.",
    "So how does it work? The soundbar has two speakers that magnetically attach to either end of a central bar, meaning you can have a single unit, or you can disconnect the speakers, and put them behind your couch to create a truly wireless 5.1 surround sound system.",
    "It also comes with a subwoofer of the kind found in more traditional ‘wireless’ setups, as it's wired to a power supply but connects to the soundbar wirelessly. Each satellite speaker has a battery life of about 10 hours, and are charged when plugged into the soundbar.",
    "It’s an interesting proposition, and one that certainly makes the JBL Bar 5.1 stand out. The real question is, by making the system halfway between a soundbar and a surround sound system, do you get the best of both worlds, or a device that isn’t really either?",
    "The JBL Bar 5.1 dropped in 2017 for $699 (about £500, AU$850) and has since come down slightly in price. We recommend keeping an eye on it during big sales events like Black Friday and Cyber Monday when it's possible to see the bar drop in price.",
    "The JBL Bar 5.1 is surprisingly cheap-looking for its formidable price tag. It's mostly plastic in its design, and while it feels robust, the buttons and screen aren’t as slick as you’ll find on competitors like the Bose SoundTouch 300.",
    "The main body of the soundbar is wrapped in a perforated mesh, and disguises a small display that sits underneath it, just to the right of a small JBL logo.",
    "On top are four manual buttons for power, volume and input source. Around the back are a number of different inputs, three HDMI ports, one USB, one AUX, and one optical.",
    "The satellite speakers plug into the ends of the soundbar with great ease, making a strong magnetic connection, and follow the same design language as the rest of the unit. When they’re plugged in the whole unit looks convincingly like a traditional soundbar.",
    "The soundbar stands at 58mm tall, meaning it'll comfortably fit in front of most TVs, although it’s clearly designed to be attached to a wall underneath a screen. Included in the box is everything you should need to fasten the JBL Bar 5.1 to the wall.",
    "There are even brackets to attach the satellite speakers to the wall, but as these being removable is the unit’s main selling point, we can’t imagine why you would want to.",
    "When connected as one unit, the JBL Bar 5.1 sits at 1148mm, which is wide for a soundbar, so if you are thinking of making the purchase, it’s definitely worth making sure you’ve got the space for it.",
    "The subwoofer is 440 x 305 x 305mm and has the uniform ‘black box’ look that we’ve come to expect from subwoofers. On the back, just above the power input, is a single button for wirelessly syncing up the subwoofer to the soundbar.",
    "Without doubt, the biggest selling point of the JBL Bar 5.1 is its wireless surround sound capabilities. It’s remarkably easy to set up the system: you unplug the satellite speakers, place them where they're going to sit in your room, plug a small black microphone into the main soundbar, and then run auto-calibration, which will fill your room with short bursts of loud and unpleasant white noise for a brief period.",
    "We didn’t know what to expect with such a low-fi approach to surround sound, but we were pleasantly surprised. We tested its capabilities with movies renowned for putting a surround sound system through its paces – Mad Max: Fury Road, Star Wars: The Force Awakens, and John Wick.",
    "With Mad Max, you could hear with perfect clarity the different whispered voices and soundtrack elements that are supposed to draw you into Max’s insanity. The balance was very satisfying, and immediately immersive, exactly as a good surround sound system should be.",
    "The sound quality favors trebles and bass (and we’ll get into this in more detail later) which meant the echoing chamber of Rey’s reveal in Star Wars felt expansive but not quite real which was a shame.",
    "For the general movie and TV watching experience, the sound stage has clearly been optimized to bring out voices, and this is welcome in big action sequences in which you can distinctly hear dialogue over heavy scoring, and even gunfire in the case of John Wick.",
    "The JBL Bar 5.1 can also be paired to a device over Bluetooth for wireless music playing, allowing it to double up as a Bluetooth speaker. A button on the remote allows you to easily swap backwards and forwards between a wired and Bluetooth connection.",
    "For us, this feature proved a little redundant, and the bar’s ‘intelligent’ switching whenever we used our phone during a movie meant that the sound often cut out to favor the phone, even when there wasn’t anything playing on the phone.",
    "The JBL Bar 5.1 is clearly designed for one specific audience: movie fans. The bass capabilities and sharp trebles mean you get both satisfying room-rattling sound, and crystal-clear dialogue.",
    "This strength is also a weakness though, as it means it has weak mids, and the ‘gap’ that some systems have between mids and bass is very noticeable when you're trying to listen to music on the soundbar.",
    "What this ultimately means is that you get loud, clear, bassy musical reproduction that lacks warmth. We tried listening to a number of different tracks. We found the Bar was very capable dealing with bass-heavy alt-pop like Maggie Rogers’ Alaska, but fell short on tracks that rely on warm mids, such as James Taylor’s achingly beautiful You Can Close Your Eyes.",
    "If audio quality is important to you, you’d probably be better off going for a system like the Samsung HW-MS650. That doesn’t have the surround sound features of the Bar 5.1, but does have an impressive dynamic range.",
    "If, however, you’re looking for an alternative to a wired-in surround sound system because you haven’t got the space, or would rather have the flexibility of not always having satellite speakers sitting behind you, the JBL Bar 5.1 is a very tempting option.",
    "The JBL Bar 5.1 is incredibly easy to set up. It’s as simple as plug in and go, which definitely can’t be said for most surround sound systems. The wireless speakers (both sub and satellite) seamlessly synced with the main soundbar, and calibrating the system was as easy as pressing a single button.",
    "The speakers are able to produce room-shaking volume without ever losing clarity, and the dedicated driver for voice means that dialogue is never overpowered, something of a holy grail when it comes to TV audio. Without doubt, the best thing about the Bar 5.1 is the ability to immerse yourself in the audio world of a movie by simply popping a couple of rechargeable speakers behind your couch.",
    "The gamut of musical reproduction is underwhelming, with weak mids and an obvious ‘gap’ between what mids there are and the bass being produced by the subwoofer. It’s also not the most attractive design, looking significantly cheaper than you’d expect for the price tag.",
    "The JBL Bar 5.1 is a difficult device to give a definitive verdict on. On the one hand, we’re loathe to recommend a device that handles music the way that it does, but at the same time we were so impressed with the ease of turning a soundbar into a completely wireless surround sound system that we have to recommend it.",
    "If you’re the type of person who wants to immerse yourself in the world of a film with the minimum of fuss, wires, and set-up, the JBL Bar 5.1 is exactly what you’re looking for. It does a fantastic job of bringing out dialogue, and across every film we tried, we were deeply impressed with the surround sound capabilities.",
    "If however, you’re the type of person who's going to use your soundbar as the main sound system for your living room, this is not the device for you."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Price and release date",
    "5": "Design",
    "13": "Features",
    "20": "Performance",
    "25": "We liked",
    "27": "We disliked",
    "28": "Final verdict"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Bose SoundTouch 300": "https://www.techradar.com/reviews/bose-soundtouch-300",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Samsung HW-MS650": "https://www.techradar.com/reviews/samsung-hw-ms650-soundbar"
  }
}