{
  "source": "https://www.techradar.com/reviews/msi-stealth-15m",
  "title": "MSI Stealth 15M review",
  "category": "computing",
  "updated": "2021-12-03T08:57:03Z",
  "author": "michelle-rae-uy",
  "summary": "A promising gaming laptop that still has room to grow",
  "verdict": "We wish we could heartily recommend the MSI Stealth 15M, but while it does win in form factor, making it a great Ultrabook-cum-gaming-laptop candidate, it falls a bit short on performance and disappoints in terms of battery life. It’s a promising new entry in the gaming laptop revolution, but not quite ready to lead the battle yet.",
  "pros": [
    "Thin and light",
    "Good mid-range performance",
    "Comfortable keyboard",
    "Decent port selection"
  ],
  "cons": [
    "Poor battery life",
    "Ray-tracing performance is sad",
    "Heat management is atrocious",
    "Speakers are mediocre",
    "Plain appearance"
  ],
  "article": [
    "The MSI Stealth 15M is a bit of a bizarre gaming laptop from MSI. With strong contenders like the Asus ROG Zephyrus G14, for example, which is currently enjoying its place in the sun, we get what MSI is doing here. It wants to offer gamers another thin and light gaming laptop that boasts Nvidia RTX 3000 series’ prowess. After all, if Asus is able to pull it off, so could MSI.",
    "The MSI Stealth 15M’s thin and light design, along with the comfortable keyboard and decent port selection, is a terrific start. And if gaming laptops were judged solely on those metrics, we’d happily recommend it, especially because it does a decent job of getting you through gaming at medium settings.",
    "Sadly, in terms of ray tracing performance, battery life and heat management, it also leaves something to be desired. Although normally those aren’t huge deal-breakers to gamers, it has, unfortunately, targeted the same market as the new Zephyrus G14 with its similar specs and form factor while also being slightly more expensive and less powerful.",
    "Fitted with an 11th-gen Intel Core i7-11375H processor, an Nvidia GeForce RTX 3060, 32GB RAM and a 1TB SSD, the carbon gray MSI Stealth 15M will set you back $1,699 (£1,200, AU$2,180).",
    "We’d call that mid-range, considering the Alienware m15 R4 with similar specs will set you back almost $2,000 in the US. Still, there are cheaper options out there.",
    "Our favorite Asus ROG Zephyrus G14, which comes with the same graphics, amount of storage, display resolution and refresh rate, only with an AMD Ryzen 9 5900HS chip and 16GB RAM, is cheaper at $1,499 in the US. And, based on our testing, the Zephyrus G14 fared much better when running demanding games.",
    "Still, the MSI Stealth 15M has the advantage of a bigger screen, giving you more real estate and twice the amount of memory, if those are important to you.",
    "If you just picked up the MSI Stealth 15M, you probably wouldn’t know it’s a gaming laptop. There aren’t many gamer aesthetic elements here. Beyond the honeycomb vents at the button, which are similar to what the Alienware m15 R4 has, there’s really nothing gamer-y about its look. There’s not even any type of tapered trimmings or RGB lighting.",
    "That could be a good thing or bad thing, depending on your taste. If you prefer a bit of flair or love RGB lighting, this will seem very plain and boring to you. On the other hand, if you want a device that you can easily use at the office without being judged by your colleagues, this might just be the laptop of your dreams. As long as you don’t mind the fact that its lid is a bit hard to pop open.",
    "This is one of the lightest and thinnest gaming laptops out there – something you do have to give it credit for. After all, even by today’s standards, a lot of gaming laptops are still big and bulky. At 3.73 lbs and 0.63 inches thin, it actually beats the 16-inch MacBook Pro and the Dell XPS 15, two of the best and most portable laptops on the market.",
    "If you are looking at the MSI Stealth 15M as a device for both play and work, you’ll also appreciate its keyboard and trackpad. The keyboard is extremely comfortable and satisfying to use, not to mention, responsive. And while you’re still better off gaming with a dedicated mouse, that trackpad feels nice and great to use for productivity tasks.",
    "The display is good. It’s perhaps not the most amazing out there, but it’s vibrant enough and does a decent job of minimizing glare. So, even if it’s not completely glare-free, you’ll do alright using it outdoors. Games look great on the 1080p 144Hz screen, even if at default, it does lean towards cooler hues.",
    "Unfortunately we can’t say the same for its speakers. While the two Nahimic Hi-Res 2W speakers actually sound decent, they lack any real low end. Not only do they sound a bit thin, but they’re also not ideal for gamers who want a bit of low-end oomph while gaming. Of course, you can always hook up your favorite pair of headphones, but if a small laptop like the MacBook Pro 13-inch can squeeze in tiny yet impressive speakers in its chassis, it feels like bigger laptops like the Stealth 15M should have no excuse for lackluster speakers.",
    "It’s a good thing that there’s a decent port selection on the MSI Stealth 15M. There’s an HDMI port, two USB-C ports (one of which is Thunderbolt), two USB 3.2 Gen1 ports, a headphone jack, and a microSD reader. So, you can actually improve your gaming experience by adding a gaming mouse, a pair of headphones or computer speakers, and a dedicated display, and still have room to connect other peripherals.",
    "Another reason why you should have a headset at the ready if you plan on gaming on the MSI Stealth 15M is that the speakers are no match for the loud fans. It makes sense due to the thin chassis that heat management isn’t going to be ideal, but those fans get so obnoxiously loud you can actually hear them from another room.",
    "It hardly keeps things cool, either. While your wrists are somewhat safe from the heat, your hands – your fingers, especially – will feel the heat emanating from the vents above the keyboard and from both sides of the laptop. There’s plenty more heat coming out of the underside as well, so we wouldn’t advise putting it on a porous surface - or your lap.",
    "Of course, that also depends on the game you're playing. Games like Valheim, It Takes Two, and Microsoft Flight Simulator push the fans to work harder, but it's titles like Cyberpunk 2077 and Resident Evil Village that really put them on overdrive. Though, to be honest, they really don’t do all that well in keeping the heat down.",
    "We haven’t been able to properly benchmark our Asus ROG Zephyrus G14 just yet. But comparing the Stealth 15M with another thin and light contender, the Asus TUF Dash F15, which boasts an 11th-gen i7, RTX 3070, and 16GB RAM, the former doesn’t allow itself to be left in the dust.",
    "In Cinebench R23, the MSI Stealth 15M is only 13% behind the Dash F15’s 6,715 points. Meanwhile, in Geekbench 5, although there’s a 43% difference between the two’s multi-core results, the Dash F15 only beats it by around 4% in the single-core test – something gamers will appreciate.",
    "The more important question, however, is how exactly does the MSI Stealth 15M perform in the real world.",
    "We’ve put it through quite a few of the latest games, including the Microsoft Flight Simulator, It Takes Two, Valheim, Cyberpunk 2077, and Resident Evil Village. And, our main takeaway is that there are better performing gaming laptops out there. That includes our Asus ROG Zephyrus G14, which has the same GPU and half the RAM of our Stealth 15M test unit.",
    "The MSI Stealth 15M does well enough with less demanding games like It Takes Two and Valheim, although it does falter once in a while when playing the former and you’d have to drop your settings down to medium when playing the latter.",
    "Playing Valheim at high settings on this laptop isn’t the smoothest experience. And, it’s even worse when doing so with Cyberpunk 2077 with ray tracing turned on. Things do improve a lot when you turn off ray tracing and drop settings down to medium. However, every time you turn on ray tracing, even when you set it at medium, you’ll experience a lot of stuttering and choppiness that just ruins the whole experience.",
    "Perhaps this wouldn’t be such a big deal, considering that the MSI Stealth 15M is a thin gaming laptop. However, we play Cyberpunk 2077 at the same medium settings with ray tracing on our Asus ROG Zephyrus G14 – a laptop that’s smaller and only a tiny bit thicker, and we get a much more seamless and smoother experience.",
    "If you’re hoping that the MSI Stealth 15M’s battery life would be its saving grace, you will be disappointed. The laptop only lasted three hours and 42 minutes when we did our 1080p movie loop test, and a measly 4 hours and 5 minutes in the PCMark 10 Modern Office battery test.",
    "We also ran the PCMark 10 Gaming battery test for curiosity, and the laptop lasted an hour and 10 minutes, which is pretty much on par with our gaming experience.",
    "Putting that into perspective, 2020’s Asus Zephyrus G14 lasted 8 hours and 10 minutes in the movie test. Meanwhile, our own Alienware m15 R4 only did slightly better than the Stealth 15M, yielding a 4-hour and 28-minute result in the PCMark 10 Modern Office battery test, and holding out for an hour and 27 minutes in the PCMark 10 Gaming battery test.",
    "In short, the MSI Stealth 15M’s battery life is atrocious, and that’s even after we’ve done several tests and a battery calibration just to make sure that there’s nothing wrong.",
    "To manage the system as well as make minor customizations (mainly, app-related and keyboard backlighting), the MSI Stealth 15M come with the MSI Dragon Center software. Fairly easy to use, albeit perhaps with a bit of a learning curve, the Dragon Center gives you quick access to game-specific presets, system-wide presets, toggling certain featuring and buttons on/off, freeing up your memory, and disk cleaning.",
    "It’s very simplistic though, and the customizations it offers are very minimal. For example, those game-specific presets are really only composed of two things – whether or not to go on Extreme Performance mode, and enabling or disabling the touchpad.",
    "There’s a Mystic Light tab on there, and you’d be forgiven to think that maybe the laptop is hiding a secret compartment of RGB light. However, it’s really only for the keyboard backlighting. You will have access to MSI’s Ambient Link, which lets you connect to smart lights like Philips Hue and Nanoleaf. However, connectivity is only being offered for certain devices, so don’t get your hopes up if you have Philips smart light bulbs.",
    "The Monitor tab, as its name implies, lets you monitor the laptop’s vitals such as CPU and GPU usage, fan speeds, CPU and GPU temperature, and network speeds. Out of all the tabs on this software, this is perhaps the most useful to gamers."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and availability",
    "7": "Design",
    "14": "Performance",
    "24": "Battery life",
    "28": "Software",
    "32": "Don’t buy it if…"
  },
  "links": {
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Zephyrus G14": "https://www.techradar.com/deals/the-best-asus-zephyrus-g14-prices-and-deals-for-july-2020",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Nvidia GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "Alienware m15": "https://www.techradar.com/reviews/alienware-m15-r3-2020",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village"
  }
}