{
  "source": "https://www.techradar.com/reviews/complete-id",
  "title": "Complete ID identity theft protection review",
  "category": "computing",
  "updated": "2021-11-16T07:47:20Z",
  "author": "john-brandon",
  "summary": "A no-brainer if you already have a Costco membership",
  "verdict": "A curiously low-priced offering from the same company that makes IdentityWatch, it’s another perk of being a Costco member and a serious no-brainer if you care about identity theft protection. There are more feature-rich offerings from more illustrious and well-established personal security companies like Norton LifeLock that cost much more. IdentityForce has more features related to support and identity theft resolution. Complete ID beats both on price.",
  "pros": [
    "Very low cost",
    "Good set of features",
    "Identity theft insurance included",
    "Direct phone support"
  ],
  "cons": [
    "Interface is a bit dull",
    "Requires you to have Costco membership",
    "Single support option"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "Nothing in life is free. However, if you happen to be a Costco member, there are some wonderful discounts. While you might be thinking of apple turnovers and cheese blocks, the savings also apply to identity theft protection as well.",
    "Complete ID is a comprehensive security app available exclusively for Costco members that might remind you of IdentityWorks. (In truth, both products are made by Experian and offer remarkably similar features.) Don’t let that stand in your way because this is the lowest price we’ve seen from similar security apps.",
    "It’s not always about price - at least until it is all about price. In terms of a company being the most-well known identity theft protection app or the one that rises above the rest in terms of technical achievements, Complete ID is not the best choice. As for a crisp and clear interface, brilliant background information that can help you recover from a security nightmare, or really any other benefits beyond the basic credit score guidance and alerts about hacks and fraudulent claims, Complete ID also falters compared to our top picks Norton LifeLock and IdentityForce.",
    "But then there’s the price. Norton LifeLock costs a jaw-dropping $30 per month for the most comprehensive plan with $1 million of theft insurance. IdentityForce costs $20 per month for similar identity theft and credit protection plans. Both of these premium choices are not exactly budget friendly.",
    "Complete ID costs just $8.99 per month for Executive Costco members and $13.99 per month per person if you happen to be a Business+ or Gold Star member. Now realize that the Executive plan does cost $120 per year, but you are likely reaping the rewards of that plan already, such as 2% back on purchases and the aforementioned low-cost apple turnovers. A Business+ plan costs a more budget friendly $60 per year.",
    "To dwell on that a moment longer: The $8.99 plan includes many of the features of other identity theft protection apps, including the $1 million of ID theft insurance protection, credit monitoring from three different credit bureaus, and a monthly credit score via the VantageScore Credit Update. There’s also Dark web surveillance, payday loan monitoring, SSN identity monitoring, and criminal record monitoring to round out the protection.",
    "We’ll go out on a limb here and say this: You can sign up for Costco for what works out to about $10 per month and still save on the cost of identity theft protection per month compared to other, more full-featured apps.",
    "That’s not to say Complete ID doesn’t live up to its name. It is a complete package with most of the features you will find in other products, but where it falters a bit is in the interface which looks more like a tax program and something you’d used mainly for credit score alerts. You can easily find most features and there’s a pleasant, if a bit dull, blue interface that seems to borrow the ethos from TurboTax, you know, the interface that is all business and gets right to the point, without any zany stock photos. Norton LifeLock is certainly easier on the eyes because of the yellow-alert interface and much more obvious wizards and dashboard metrics that show how far along in the process you are.",
    "Once again, Complete ID is fairly complete in terms of the basics - credit reporting, alerts regarding change of physical address, changes to your criminal record, or the most obvious credit score problems. Security to protect a user’s data is high as it uses the SHA-256 algorithm.",
    "If you lose your wallet, you’re covered under the included insurance that is integrated into the plan. A few other apps like IdentityWorks make a bigger case for the technical assistance on offer and provide more specifics about how an agent can help you.",
    "Unlike some other offerings, support is quite direct, with a toll free number available for contact. Furthermore, it is available on a 24/7, 365 day a year basis. This is reassuring, because when faced with identity theft, a user will want help right away.",
    "The downside of the approach is that there are no other options for contact, such as email or chat- neither of which are available.",
    "One of the interesting lessons you learn quickly when evaluating software is that the most critical feature is price. You may have considered Adobe Photoshop and thought seriously about the monthly fees, but when you realize Affinity Photo costs $50 and provides many of the same functions, you might suddenly become more interested. (For the record, Photoshop is a better app.) The same is true with Complete ID. If you already have an Exec membership at Costco, it might be easy to overlook the fact that Norton LifeLock is easier to use, and instead buy this service just on the price alone.",
    "That all leads to a final disclaimer and a final thought. The disclaimer is that, while price is perhaps a determining factor when it comes to photo-editing software, it might not be the best guide when it comes to personal identity. We’ve identified Norton LifeLock and Identity Force as two leading identity theft protection apps and we stand by them as being more feature rich. When you consider how everything is spelled out for you in Norton LifeLock, for example, you might see an alert or a way to resolve a serious credit issue, which is almost invaluable.",
    "Apart from that disclaimer - pick the best tool and don’t base the decision entirely on price - Complete ID is in that second tier of products that provides all of the necessary features. It can’t compete with Norton LifeLock on the total package or interface, but it’s affordable.",
    "A better comparison here might be to a VW sedan versus an Audi sedan. VW makes extremely appealing cars without the frills and high-end features of Audi. However, Audi is part of VW and the cars are fairly similar. The main difference - apart from the luxury extras on an Audi - is that a VW costs less. Their cars often have a turbo-charged engine and techie features. Some of us only want the best. Others will want a value proposition, and for those folks, Complete ID isn’t the best, but it is certainly a smart, worthwhile purchase.",
    "We've also highlighted the best identity theft protection"
  ],
  "headers": {
    "3": "Plans and pricing",
    "8": "Interface",
    "9": "Features",
    "11": "Support",
    "13": "The competition",
    "14": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "Costco": "https://www.techradar.com/news/what-credit-cards-does-costco-accept",
    "Complete ID": "https://www.completeid.com/",
    "IdentityWorks": "https://www.techradar.com/reviews/experian-identityworks",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "IdentityForce": "https://www.techradar.com/reviews/identityforce",
    "Executive plan": "https://www.completeid.com/pricing/",
    "Business+ plan": "https://www.completeid.com/pricing/",
    "credit monitoring": "https://www.techradar.com/best/us-credit-monitoring-services",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}