{
  "source": "https://www.techradar.com/reviews/fitbit-inspire-2",
  "title": "Fitbit Inspire 2 review",
  "category": "fitness",
  "updated": "2021-12-03T15:57:14Z",
  "author": "joseph-delves",
  "summary": "The Fitbit Inspire 2 passive health tracking with solid sporting features",
  "verdict": "The Fitbit Inspire 2 impressed us with its simplicity, unobtrusive styling, good battery life and heart rate monitoring. As a simple multi-sport tracker or a tool to gently nudge you towards a more active lifestyle, it works well. We were less keen on having to spend the cost of the device again on a subscription to retain access to the app's premium features after a year. Its screen is also a little too small to make the most of its sports-specific features. Nevertheless, is you're interested in logging exercise and keeping general insights into your health, we don't think you'll be disappointed.",
  "pros": [
    "Heart rate feature",
    "Simple to use",
    "Excellent app"
  ],
  "cons": [
    "Basic functionality",
    "Small screen",
    "No in-built GPS"
  ],
  "article": [
    "Whereas the original Fitbit Inspire was split into standard and heart rate monitoring versions, the Fitbit Inspire 2 allows everyone can now keep an eye on their ticker, along with all the standard activity tracking features you’d expect.",
    "Given that Apple Health now keeps an eye on everything from sleep to periods, it’s probably a good thing too. With gussied up pedometers starting to look somewhat redundant, the Inspire 2’s heart rate monitor lets it provide some additional insights into the effectiveness of your exercise and health generally.",
    "Used extensively by athletes, heart rate will tell you exactly how hard you’re working, allowing you to pace yourself, or work to a set intensity, it’s a fantastic training tool. It's just as useful for the less competitive too, and has earned a place in our comprehensive guides to both the best Fitbits and the best fitness trackers.",
    "Take Fitbit’s somewhat arbitrary goal of trying to accumulate 10,000 steps a day. Strolling these is great, but marching them is even better. With heart rate, Fitbit can divide up your time exercising depending on the effort you put in.",
    "Doubling the value of minutes spent in what it calls ‘cardio peak zone’ compared to the less intense ‘fat burn zone’, this will give you an idea of the stress you’re putting your body under, along with a better understanding of potential fitness outcomes and calorie expenditure. As you progress, average resting heart rate is also a great indicator of overall health.",
    "With this data viewable on the watch itself, you can also always pull up a page on your phone showing your total number of steps, distance travelled, calories expended, plus a ton of other metrics. Cleverly, the Inspire 2 will also automatically detect what you’ve been up to during the day, whether walking, swimming, cycling, kicking a ball around, or any of over 20 other activities.",
    "However, although it includes an accelerometer, the Fitbit Inspire 2 doesn’t have in-built GPS tracking. Able to determine your location when connected to your phone, turning your Bluetooth off will leave it more prone to getting confused, for instance by mistaking a cycle ride for a brisk walk. Thankfully, it’s easy enough to use the app to redesignate any misidentified activity later.",
    "Of the pre-listed sports, you can also use the app to create shortcuts to six of these on the device itself. Selecting one before you start will then allow the Fitbit to provide useful data such as reps or pace during your activity, as well as logging the entirety of your session.",
    "Although it can perform many functions normally associated with a sports watch, the Inspire 2’s small face nevertheless means you’ll likely spend a lot of time squinting at it while trying not to run into things. However, matters are improved once you get home, where reviewing on the app allows you to combine any harvested data together. For instance, if you’ve been out for a run, you’ll get a map of your route, pace, and heart rate, all overlaid on the map and time chart so you can see exactly how hard you were working at each point.",
    "Along with counting heartbeats, the Inspire 2’s other key skill is counting things. Steps, star jumps, push ups, it’ll keep a log of every move you make, or guide you through set routines. Although adjustable, by default it’ll also intermittently encourage you to get off your bum and move about, while rewarding you for reaching your daily goals by vibrating and letting off some virtual fireworks.",
    "Persuading you to go out for a walk at lunchtime, do some stretches, or jog for an extra five minutes makes it an ideal workout companion. However, at other times being reminded that you’ve not walked further than between your bedroom, desk and kitchen can be somewhat disheartening.",
    "Which leads to another revelation. Left on your wrist, the Inspire 2 will also provide useful if sometimes uncomfortable insights. For instance, concerns regarding our caffeine intake have gone from a joke to a genuine concern. Similarly, you’ll soon identify elements in your life that raise your heart rate, from colleagues on Zoom meetings to dealing with awkward relatives.",
    "Similarly, unlike purely motion-based trackers, the Inspire 2’s heart rate function can break down sleep into various different stages, which allows you to learn a lot more than just how much of the night you spend lying still. The Fitbit app will also generate a sleep quality score, and, like a good friend, can tell you when you’ve had enough and it’s time to go to bed.",
    "Basically, it does a good job of confirming what should be obvious but you sometimes need to be told: that you should do more exercise, drink less caffeine and get a bit more sleep.",
    "The look of the Fitbit is unobtrusive, sort of like if Jony Ive had redesigned the probation service’s electronic monitoring tag. With a small black and white screen, it’s stylish and weighs a negligible 20g including its soft, rubbery strap.",
    "Although bright and crisp, its tiny face can’t display large amounts of information, resulting in the need to swipe through each data field in turn. It's blank by default to save power, and lights up when you raise your wrist. Alternatively, pinching its sides will wake up the device or return you to the home screen.",
    "Its display style can be customized via the app, from stats heavy designs to minimalist retro clock faces (we chose friendly motivational cat).",
    "The notifications feature allows you to see whether the person calling you is worth interrupting your exercise for, and it's possible to receive pings from apps so you can keep an eye on your eBay sales as you work out.",
    "Annoyingly, this third-party app connectivity doesn’t extend to controlling your playlist, which would have been a great feature. Similarly there’s no Fitbit Pay support, which is a shame, especially if you like exercising without a phone or wallet.",
    "In common with all optical-style monitors, the Inspire 2’s heart rate reading is only moderately accurate, so while it’ll give you an acceptable average, it doesn’t respond well to sudden changes in effort. It's enough for general fitness tracking, and OK for pacing or hitting zones during longer stints, it won’t keep up if you’re using it for short and sharp efforts like high-intensity interval training (HIIT). If you’re a swimmer, it won’t work in the pool.",
    "Battery life is solid, lasting up to 10 days between charges if you go easy on it.",
    "Bundled with the Fitbit is one year subscription to Fitbit Premium, which gives you access to guided workouts and fitness programmes, a detailed wellness report with which to irritate your family doctor, plus some on-trend mindfulness content. Useful, but not really essential to getting decent functionality out of the Inspire 2.",
    "We imagine each user will find one element they'll miss once the subscription runs out. For us, this would probably be the detailed Advanced Sleep Analytics feature, but would we then pay £7.99 / $9.99 / AU$15.49 a month to retain it? Probably not.",
    "However, we would probably feel a mild annoyance at suddenly finding the device had slightly less functionality, especially when Polar and Garmin let you perpetually use all their ecosystem features for free.",
    "That grumble aside, the standard app functionality and user experience is generally very good, so we're probably just being picky.",
    "We like the Fitbit Inspire 2, particularly its simplicity, unobtrusive styling, good battery life, and heart rate monitoring. Either as a simple multi-sport tracker or a kind of fitness coach that’ll gently chivvy you towards a more active lifestyle, it works well. The heart rate feature, in particular, will give anyone who’s not worn one before some intriguing insights, even if the design of the device itself is a little basic for more data-driven athletes.",
    "What we were less keen on is having to spend the cost of the device again to retain access to the app’s premium features after a year. Then there’s the upfront price to consider. At first glance the cost seems reasonable for something including a heart rate monitor. But then Huawei will sell you its Band 4 Pro, which does a similar job while also providing GPS functionality, better battery life, and a colour screen, for $60 / £50 / AU$130.",
    "Relatively smart, the Inspire 2’s screen is also a bit too small to make the most of its surprisingly decent sports-specific features. Instead it does better at the job as the sort of thing you leave on and collect your data from at the end of the week, rather than keep an eye on activity by activity. It’s an idea backed up by the easy-to-use app interface that does a good job of presenting a lot of information in a digestible format.",
    "For Fitbit aficionados, the lack of major updates since the last version might seem like a slight missed opportunity. Still, a few limitations aside, if you’re looking to keep a log of your exercise and get general insights into your health I don’t think you’ll be disappointed with the performance of the Inspire 2."
  ],
  "headers": {
    "5": "Following you around",
    "9": "Insights",
    "14": "Styling",
    "17": "Key stats and additional features",
    "25": "Pricing and conclusion"
  },
  "links": {
    "Apple Health": "https://www.techradar.com/how-to/phone-and-communications/mobile-phones/how-to-use-apples-health-app-1305634",
    "best Fitbits": "https://www.techradar.com/best/the-best-fitbit",
    "best fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Band 4 Pro": "https://www.techradar.com/news/huawei-band-4-pro"
  }
}