{
  "source": "https://www.techradar.com/reviews/paypal-commerce-platform",
  "title": "PayPal Commerce Platform review",
  "category": "computing",
  "updated": "2021-08-03T12:35:08Z",
  "author": "rob-clymo",
  "summary": "Call on PayPal’s Commerce Platform if you’ve got more demanding business needs",
  "verdict": "The PayPal Commerce Platform has plenty of appeal for businesses with its many and varied features, but navigating its size and cost structure can be daunting.",
  "pros": [
    "Global appeal",
    "Many features",
    "One-stop option"
  ],
  "cons": [
    "Sheer array of options can be intimidating",
    "PayPal gets mixed customer reviews"
  ],
  "article": [
    "PayPal Commerce Platform is a product that has evolved from PayPal for Business. The idea is that business owners can have access to a one-stop facility that allows them to use the convenience of PayPal’s merchant services to process payments.",
    "Added to that, the PayPal Business Platform comes with other features aimed at smoothing everyday workflow for businesses, with options for creating and processing invoices, transferring funds, processing payments and so on. PayPal has also launched its Zettle point-of-sale (POS) system in the US in a move designed to offer small businesses a more complete, full-service sales setup.",
    "Naturally, for a company the size of PayPal, which offers all sorts of products and services all over the world, there’s a whole spectrum of options available and they are suited to many different types and sizes of business. The only real challenge is deciding if it’s going to properly fit the needs of your own venture.",
    "The PayPal Commerce Platform is a business service, as opposed to the company’s more consumer-focused products, so as a result the prices are for merchants. Because of that you’ll need to pick through the many different pricing variants that are outlined on the PayPal Commerce Platform merchant pricing page.",
    "Being a global operation means that there are different criteria based on your location, and on top of that there are considerations for domestic transactions, international transactions and more besides. In fact, working your way through the PayPal pricing structure is perhaps one of the more daunting aspects of the whole package.",
    "There are a lot of different factors to consider, which if you’re a small business owner might even be enough to make you look elsewhere. Larger businesses will doubtless have the resources to take on the challenge with a little more vim.",
    "Once you’ve worked out which prices and package options will fall into your business arena there’s no doubting that PayPal’s feature set is impressive. A global brand, with the same clout when it comes to offering ways of getting things done, the platform is undeniably muscular.",
    "Making use of PayPal merchant services means you’ll be able to tap into its invoicing tools and accept a wide range of payments, from PayPal transfers themselves to PayPal credit card transactions.",
    "There’s also iZettle, the PayPal mobile payment package plus an array of debit and credit cards acceptance from other providers. PayPal’s ability to let customers pay using QR codes is also proving useful, especially in the wake of the coronavirus pandemic. Merchants can also have the option to process smaller payments, or micropayments, that amount to $10 or under.",
    "And, there’s the convenience offered by the PayPal Here service too, which combines the ability to process payments on your tablet or smartphone using its app and card reading capability. PayPal now has its Pay in 4 option too, which lets customers buy now and pay later, without your business having to carry the financial burden. Again, this has been a useful development following the fallout from the global pandemic.",
    "With the power of a global infrastructure behind it PayPal is certainly no slouch when it comes to providing merchants with the potential for efficient business transactions. Having a PayPal Commerce Platform account will allow you to process payments from all over the world, albeit with the charges that come associated with that convenience.",
    "PayPal has engineered its products to be used by people out in the field too, by people who might not always have the option of being able to send an invoice or process a sale at their desk. Digital paperwork can be processed via your phone and email, while there’s also a PayPal Business Debit Mastercard that may appeal to some.",
    "Equally, businesses who have a PayPal merchant account will find that its infrastructure for processing payments in-store and at other physical outlets allows it to be easily harnessed to the power of point of sale services such as Vend or Lavu.",
    "While the PayPal Commerce Platform is a bit of a daunting prospect if you’re starting out and exploring its features, once it’s been tailored to your needs, and fully configured, the learning curve is less steep. It certainly offers easy options for merchants who need to process payments, especially as customers don't have to be signed up to PayPal themselves in order for you to facilitate a transaction.",
    "Just having the day-to-day convenience of things like PayPal Here for processing payments is really convenient, even though there are now plenty of options when it comes to handling point of sale transactions, especially if you don’t have a physical outlet or are mobile focused.",
    "PayPal has made considerable effort to offer plenty of support to its merchant customers, with staff speaking 17 different languages on-board to help deal with queries. The various PayPal websites around the world, depending on your location, also have an impressive collection of online help, plus business resource centers and more. However, the overall standard of service for a business that operates in so many territories is hard to gauge, with mixed opinions coming from users in a variety of locations around the globe.",
    "PayPal Commerce Platform offers a brilliant, though it has to be said, pretty bewildering array of options for business owners of all shapes and sizes. It’s definitely got the business muscle behind it, with the ability to handle over 100 different currencies and operates in excess of over 200 countries. If you’re looking to accept and make payments, or move from an existing arrangement doing the same thing, then it’s a contender.",
    "However, you’ll need to take your time and pick through all of the options, and also try to break down the costings as these are just as numerous. As with any big company, PayPal gets mixed reviews too, with some merchants sounding very enthusiastic about its powerful feature set.",
    "Others, however, take issue with the often poor levels of communication they get as customers. With a platform that’s offered on a global scale and with so many facets it’s hardly surprising that opinions are so mixed."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "10": "Performance",
    "13": "Ease of use",
    "15": "Support",
    "16": "Final verdict"
  },
  "links": {
    "PayPal Commerce Platform": "https://www.paypal.com/us/business",
    "merchant services": "https://www.techradar.com/best/best-merchant-services",
    "invoices": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "transferring funds": "https://www.techradar.com/best/best-money-transfer-apps",
    "processing payments": "https://www.techradar.com/best/best-credit-card-processing-service",
    "Zettle point-of-sale": "https://www.techradar.com/reviews/izettle-pos-point-of-sale-review",
    "small businesses": "https://www.techradar.com/best/best-small-business-software",
    "merchant pricing": "https://www.paypal.com/us/webapps/mpp/merchant-fees",
    "iZettle": "https://www.techradar.com/reviews/izettle-pos-point-of-sale-review",
    "QR codes": "https://www.techradar.com/news/paypal-rolls-out-qr-code-payments-for-a-touch-free-way-to-buy-and-sell-in-person",
    "micropayments": "https://www.techradar.com/best/best-payment-gateways",
    "Pay in 4": "https://www.techradar.com/news/paypal-launches-installment-payment-plans"
  }
}