{
  "source": "https://www.techradar.com/reviews/media-temple",
  "title": "Media Temple review",
  "category": "computing",
  "updated": "2021-10-28T05:39:54Z",
  "author": "mike-williams",
  "summary": "High quality hosting for an even higher price",
  "verdict": "Media Temple is a USA-based developer-friendly web hosting provider that offers a wide array of high-quality hosting solutions but for a high price as well. If you are ready to pay for it, you can expect to get some fine features, powerful performance and around-the-clock support.",
  "pros": [
    "Tons of developer tools",
    "A wide variety of hosting products",
    "No misleading marketing tactics",
    "US-based support available 24/7",
    "30-day money-back guarantee"
  ],
  "cons": [
    "High-priced products",
    "Not beginner-friendly",
    "No free SSL certificates"
  ],
  "article": [
    "The company that was set in motion in 1998 under the name Integress Technologies would later become the Media Temple we all now know. After the company merged with a web design studio, its founder Demian Sellfors and co-founder John Carey decided to fully focus on delivering business-to-business internet services “with sophistication and reliability”.",
    "In the following years, Media Temple has drawn the attention of an American web hosting giant by the name GoDaddy, so much so that the company decided to purchase it. Although part of GoDaddy, Media Temple has been operating separately since and providing a whole variety of premium hosting solutions and hosting-related products and services.",
    "Media Temple is headquartered in Los Angeles (California, the USA) from where they operate two data centers, both within the borders of the USA. Their official website is simple but it also feels stylish, well-organized, and straightforward to use. It also possesses a vigorously updated blog filled with handy tips and tricks on hosting, web design, development, and so on. Both the site and the blog are available in English only and the prices are displayed in USD.",
    "If you fancy social networking, you’ll find Media Temple on Facebook, Twitter, LinkedIn, Instagram, and YouTube where all accounts appear to be very much alive.",
    "If you think Media Temple will give you an unlimited hosting solution and for a song to boot, you better think twice. The company’s major selling point is its quality, so even the entry-level shared hosting package (suitably called “Deluxe”) feels like crème de la crème with its incredible list of features including countless sites, unlimited storage space, unmetered bandwidth, 512MB of RAM, 100 mailboxes, and 25 MySQL databases, among other things. With a suitable price tag of $20.00 per month (about $16.70 if billed annually) it will make you feel like a king but keep in mind you’ll also be expected to pay like one.",
    "The most affordable option on the menu is a self-managed VPS hosting plan called “1 vCPU” that goes for $10.00 per month, but you should avoid this one if you aren’t particularly tech-savvy.",
    "In addition to three shared hosting plans, Media Temple offers three additional VPS-like shared hosting plans, five for managed WordPress hosting, four for fully managed VPS (which is new), four for self-managed VPS (new as well), one for WordPress ecommerce, managed hosting services for AWS (Amazon Web Services), as well as a full scope of hosting-related services.",
    "All of Media Temple’s hosting plans are backed by a 30-day money-back guarantee. However, it doesn’t cover any additional fees such as domain registration, setup, or premium services.",
    "Media Temple accepts payments via all major credit cards, PayPal, ACH, and wire transfers.",
    "The pricing of Media Temple's plans may look like daylight robbery. Yet, the price you see on the company’s site is the price you’ll pay for exactly one month, just like it says. With many other hosts (we’ll not name them), you would get misleading figures that actually apply for longer billing periods only, while you were cunningly led to believe this is the price for the monthly billing. Although you’ll get a slight discount when signing up for a longer period, the company won’t push you to do so in any way. With Media Temple, you can feel completely safe from misleading marketing practices.",
    "If you need help choosing the perfect plan for your needs, Media Temple's pre-sales support staff invites you to start the chat or give them a ring. In any case, the purchase process is both simple and swift. Besides the plan, you’ll have to select a billing cycle (monthly, annual, biennial or triennial one), enter your personal and billing details, and finish things up by making a payment.",
    "After this, you’ll be provided a link that will take you to Media Temple’s dashboard, a user-friendly and professional customer console that will lead you to the product you’ve just purchased without any difficulty. Here you’ll also find File Manager, FTP Manager, and phpMyAdmin, but if you want to carry out any other setup task, you’ll have to go to your control panel. Fortunately, you’ll see the much-beloved industry-standard cPanel there.",
    "With cPanel’s intuitive UI and a myriad of useful built-in tools, you’ll manage all aspects of your website without much technical know-how. Another thing you’ll find here is Installatron, a one-click installer thanks to which all the essential apps (such WordPress, Drupal, and Joomla) can be yours in a matter of seconds.",
    "At this moment Media Temple doesn’t offer a website builder which would surely boost the morale of beginners.",
    "A speed test performed on Media Temple’s official site via GTmetrix places it considerably above average, requiring only 2.5 seconds to completely load (in comparison with the average of 8.1 seconds). All other web vitals (largest contentful paint, total blocking time, and cumulative layout shift) were around or above the average concluding in a GTmetrix grade B (88%).",
    "When it comes to uptime, Media Temple guarantees 99.99% of it. However, with its DV (that is, VPS, managed, and dedicated server hosting products) it also offers a so-called DV 20/20 uptime guarantee according to which you get 20% of your monthly hosting cost back for every 20 minutes of downtime your site may suffer that month.",
    "An uptime test via UptimeRobot, which continued for two weeks on Media Temple’s official site, failed to record any downtime at all (and no major spikes in response time to boot) leading us to believe that it promises reliable performance.",
    "Media Temple provides its customers with round-the-clock customer support available via telephone, live chat, and ticketing system. Yet, you may need to sign up before getting all of the options. The live chat seems to be unavailable at times, so you may want to check the other options instead of burning daylight waiting for it to become available again. For customers from the US, telephone support is toll-free and they also have an option to book a call. Besides this, all users are welcome to seek support via Twitter.",
    "An alternative to helping hand for all the self-sufficient webmasters out there is Media Temple’s one-stop support center. Together with a standard knowledgebase stuffed with well-written how-to articles and easy-to-follow video guides, the center also stores all your support tickets, service diagnostics, and provides access to the network status page. In addition, you can check out a pretty detailed FAQ section.",
    "Apart from Media Temple, GoDaddy has acquired quite a collection of web hosting companies, even buying the rights to its long-time rival Host Europe. Besides being part of the same corporation, Media Temple and Host Europe share a similar scope of hosting services. However, Host Europe is geared towards German-speaking customers while Media Temple is better suited for English-speaking clientele.",
    "Another excellent alternative to Media Temple is a fellow US-based host by the name of HostGator. Like Media Temple, HostGator offers a wide variety of feature-packed hosting solutions backed by superb 24/7 customer support, splendid (written and video) how-to guides, and a money-back guarantee. Unlike Media Temple, HostGator is a wise choice for complete beginners looking for a budget-friendly hosting solution to fire up their first sites.",
    "In comparison with Media Temple, Bluehost may look quite cheap and cheerful, but its marketing tactics may also cause confusion. While doing business with Media Temple, what you see on the site is exactly what you can expect to get. Nevertheless, Bluehost is almost ten times cheaper, offers more free features, and provides more beginner-friendly tools, making itself much easier to recommend, especially to new users.",
    "If you are looking for an alternative to Media Temple that can cover both small and large businesses, look no further than Kinsta, an enterprise-level host that won’t shy away from breaking your budget. Although Kinsta is even more expensive than Media Temple is, it has 28 data centers across the world (while Media Temple owns servers in the USA only), and a global CDN that spans over 200 regions (while it’s around ten with Media Temple). However, since both hosts offer a 30-day money-back guarantee, we advise you to try them out for yourself before making a big decision.",
    "Although Media Temple offers a full range of hosting solutions that come with a decent degree of features, its over-the-top prices may keep it out of the range for new users and standard small business owners. If you’re not sure spending big bucks is worth not having to worry about your hosting, do check out more budget-friendly hosts such as HostGator and Bluehost before blowing a hole in your budget."
  ],
  "headers": {
    "4": "Plans and pricing",
    "9": "Ease of use",
    "14": "Speed and performance",
    "17": "Support",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "Media Temple": "https://mediatemple.net/webhosting?AID=13437767&PID=6361382&utm_source=CJ&utm_medium=affiliate&sid=trd-us-1256392800790875100",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "unlimited hosting": "https://www.techradar.com/web-hosting/best-unlimited-hosting",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "Deluxe": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1358990541013266400/https://mediatemple.net/webhosting/shared-hosting",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "1 vCPU": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1101228216106493200/https://mediatemple.net/webhosting/vps-hosting/managed",
    "managed WordPress hosting": "https://www.techradar.com/news/best-managed-wordpress-hosting",
    "AWS": "https://www.techradar.com/news/aws",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Host Europe": "https://www.techradar.com/reviews/host-europe",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Kinsta": "https://www.techradar.com/reviews/kinsta"
  }
}