{
  "source": "https://www.techradar.com/reviews/xdo-pico-projector",
  "title": "XDO Pico Projector review",
  "category": "computing",
  "updated": "2021-09-14T11:24:36Z",
  "author": "mark-pickavance",
  "summary": "Improbably tiny pocket projector",
  "verdict": "Like XDO’s Pico PC, the Pico Projector’s scale skirts on the edge of practicality. It works surprisingly well if you have a dark room and external power. The snag is that you can’t just buy it without investing in a Kickstarter bundle.",
  "pros": [
    "Highly portable",
    "Works on battery power for 2 hours",
    "Eshare/Airplay/MiraCast support"
  ],
  "cons": [
    "Not available without Kickstarter bundle",
    "70 lumens isn’t very bright",
    "Insecure Android platform"
  ],
  "article": [
    "We recently covered the XDO Tech Pantera Pico PC, and alongside that intriguing device, its makers are also promoting another tiny product, the Pico Projector.",
    "An exercise in miniaturisation, its designers distilled the critical functionality of an LED DLP projector into an object small enough to put in your pocket. The marketing promise is to project up to 100-inch images for two hours from an HDMI source or a mobile device.",
    "Making any complex device at this scale is bound to involve some compromises. Do these in the Pico Projector make it impractical, or has XDO navigated all of the challenges of delivering workable projection in a box this small?",
    "Those that visit the XDO website will be disappointed to discover that the Pico Projector is currently out of stock, but you can still get it if you are prepared to enter a Kickstarter for the associated Pantera Pico PC in an All-Star-Pack.",
    "Those that agree to support the Kickstarter with HK$ 4,034 (about £375 or $519) can get the Pico Projector along with a 1TB version of the Pico PC, a folding Keyboard, Portable 12V 9800mAh PowerStation and a Full Set EVA case.",
    "Given the pricing for the 1TB Pico PC, the Pico Projector is priced about the same as that device, which is roughly half the value of the bundle minus some of the accessories.",
    "A representative of XDO informed me that once the Pico PC Kickstarter has ended that one specifically for the Pico Projector will be run, but currently, this bundle is the only way to get one.",
    "Glossing over why you would need a Kickstarter when the product already exists and is being manufactured, we need to mention that Kickstarters aren’t guaranteed to be successful, and investors might not see their money back if things go wrong.",
    "Most of the portable projectors we've seen before are typically about the size of a large coffee cup, at the very least.",
    "But the Pico Projector is a rounded cube measuring just 63mm in each direction, making it only slightly larger than the diminutive Pico PC.",
    "Inside that remarkably small form factor is a full DLP LED projector with a native 854 x 480 resolution, a quad-core ARM processor with a GPU, RAM and ROM enough to run Android, Wireless networking and a battery to keep it working for a couple of hours without a power socket.",
    "To stop this tightly packed hardware from rapidly overheating while in use, a small fan runs automatically when it is turned on, and its noise can be mildly distracting.",
    "Along with the Pico Projector, XDO provides a power supply that doubles as a charger, a small IR remote control and a tiny tripod to help the projector be raised and angled for optimal positioning.",
    "The tripod uses a standard threaded bolt common to photography equipment, so any tripod or gorilla grip could be used to mount the Pico Projector.",
    "What was missing from this solution was an HDMI cable. Since the port on the side is of the unit is a mini-HDMI input type that isn’t commonly used. And, the remote also came without any batteries, so you will need two AAA cells to make that functional.",
    "The electronics platform of the Pico Projector is effectively a budget smartphone that might have been state-of-the-art six years ago.",
    "At the heart of this device is a Rockchip RK3128 ARM processor, a relatively low power quad-core Cortex-A7 1.2GHz SoC with an associated Mali-400MP2 GPU.",
    "The XDO specification states 1GB of RAM, but our review model had 2GB which we hope is the standard amount. For storing applications and data, the unit contains 16GB of Flash memory, with just over 5GB being used by the system and default apps installed.",
    "The platform and the projection electronics can be powered via the included power supply or an internal 3,300 mAh battery with a claimed operating life of 2 hours.",
    "Any device with HDMI output can be connected directly with a suitable cable (not included), or files can be presented from USB connected storage. But most owners will probably source their content using either a streaming service, like Netflix, or cast to the device from a phone or tablet using either Eshare, Airplay or MiraCast.",
    "Network connections on the Pico Projector are via dual-band WiFi supporting most standards up to 802.11ac, and for connecting peripherals, it also has Bluetooth 5.0 networking.",
    "Being so small, the projection hardware in this device is diminutive, with just a 2-inch DLP panel and an LED light source that uses 10W and only generates 70 ANSI Lumens.",
    "With such low power levels, the maximum quoted image size of 100 inches appears a little optimistic, but you can project just 10 inches away if you want the brightest experience.",
    "The projection ratio is 1.35:1, and the light source LED has a lifespan of 30,000 hours of use. If the LED fails, there aren’t any practical means for it to be replaced, sadly.",
    "Audio output is either through a 3.5mm headphone jack or with a very small 1W internal speaker.",
    "Overall, XDO should be congratulated for getting all this equipment inside this tiny 63mm, 210g enclosure and that it functions.",
    "The pre-installed OS is Android 7.1.2, and this has seen a security patch from 2017, but nothing since then.",
    "It is easy to argue that, like any phone running this OS revision, this hardware is inherently unsafe to use due to the lack of security updates and the age of the OS.",
    "Those feeling brave enough to Google account details on the Pico Projector should ensure they use two-factor authentication and never side-install applications sourced from third-party app sources.",
    "Taking these steps might not stop it from being hacked, but it’s the best mitigation that you have available. Maybe creating a Google account just for the device might also be a good idea.",
    "The Pico Projector is remarkably simple to use, having an easy-to-follow interface controlled using the included remote or via touch-sensitive buttons on the top face.",
    "A Bluetooth remote would have been preferable to the one XDO includes that uses Infra-Red communication to a sensor on the rear of the projector, limiting where you can position it.",
    "We also noticed that while the remote can turn the projector off, the remotes power button can’t then turn it back on.",
    "The projector has automatic keystone correction but a manual focus controlled through a wheel on the side. The control wheel needs gearing down somehow, as it is so sensitive that getting really sharp focus is nearly impossible.",
    "For putting in passwords to streaming services, we recommend finding a USB keyboard and using the USB 2.0 port on the rear to attach it.",
    "As a user experience, there are good and bad things here. But critically, the Pico Projector does come with a version of Android that connects to the official Google Play store and not any obscure alternative with a very limited selection of applications.",
    "One caveat to the app store is Android 7 support, the number of applications that insist on later releases is increasing, reducing the number of apps available to the Pico Projector. While this isn’t an immediate problem, but it might become one in years to come.",
    "With at least 10GB of free space on the internal flash, there is sufficient room for a reasonable number of apps, and those that don’t use the USB port for another purpose can install more on an external flash drive.",
    "In our testing, we played a range of packaged files from a USB stick and streamed live TV from YouTube, and it worked well enough. The only trick this platform misses is that Google Casting isn’t supported, so a MiraCast app might be needed on your phone to mirror content to the projector.",
    "Where things get slightly odd is when you attempt to use this device in conjunction with a PC, as the native resolution of 854 x 480 isn’t one that is normally supported.",
    "The Pico Projector will scale from 1920 x 1080 or even 1920 x 2160, with some loss of detail, but it curiously recommends 1360 x 768. We’re not sure which is best, but neither resolution isn’t an image that you would want to work at for long periods that involved reading.",
    "The battery life is close to the quoted 2 hours at full brightness. We managed 1 hour 55 minutes streaming YouTube over WiFi continually, so it might be possible to get longer with USB connected content.",
    "There are some issues with this product, like the old version of Android and the relatively low level of brightness that the LED generates.",
    "But depending on how you intend to use it, these aren’t show stoppers for many potential customers. The Pico Projector isn’t a practical replacement for a standard home cinema projector, TV or monitor, but it can still be useful. And, given the size, that it works at all is something of a miracle to us.",
    "What we can find fault in is that it is incredibly portable, has an old but functional version of Android that connects to the official app store, works with streaming services, and you can cast to it from a mobile device with a little bit of effort.",
    "If you are on vacation and want to throw pictures or video, you’ve taken up on a wall to show others, then this device will do that job. You must avoid brightly lit locations, and the show can’t go on for more than a couple of hours.",
    "Probably the biggest issue with this device is that currently, you can purchase it separately, but only as part of a bundle with the Pico PC.",
    "Hopefully, that will change soon, and XDO will realise that Kickstarter isn’t the appropriate place to promote its products.",
    "Should those things come to pass, the XDO Pico Projector could become the low-cost solution for those that want to take a projector with them in their hand luggage."
  ],
  "headers": {
    "3": "Price and availability",
    "8": "Design",
    "15": "Hardware",
    "26": "In use",
    "42": "Final verdict"
  },
  "links": {
    "XDO Tech Pantera Pico PC,": "https://www.techradar.com/reviews/pantera-pico-pc",
    "XDO website": "https://picopc.net/",
    "Pantera Pico PC": "https://www.techradar.com/reviews/pantera-pico-pc",
    "All-Star-Pack": "https://www.kickstarter.com/projects/xdo/Pico%20PC-tiny-desktop-pc-palm-sized-windows-linux-computer/description",
    "Pico PC": "https://www.techradar.com/reviews/pantera-pico-pc"
  }
}