{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
  "title": "Samsung Galaxy S20 Ultra review",
  "category": "phones",
  "updated": "2021-11-27T12:06:01Z",
  "author": "matt-swider",
  "summary": "The S20 Ultra is maximum everything: big photos, big zoom range and big price",
  "verdict": "The Samsung Galaxy S20 Ultra goes big in every way imaginable, with 108MP photos, a 100x camera zoom, 40MP selfies, and a 6.9-inch 120Hz display. With over-the-top internal specs on a par with some laptops, you'll pay more for this phone than any non-foldable phone before it, but that's not surprising. What is surprising are some of the bugs we've encountered that keep the Ultra from reaching its full potential.",
  "pros": [
    "Impressive camera zoom range",
    "Samsung’s best display yet",
    "Fast 5G speeds confirmed"
  ],
  "cons": [
    "Camera quality is inconsistent",
    "Price is a new kind of ridiculous",
    "You’re going to need a bigger hand"
  ],
  "article": [
    "The Galaxy S20 Ultra is one of Samsung’s biggest Android phones, and at launch was its most daring sales pitch: you could own the world’s most advanced 5G phone with massive camera specs... if you’re prepared to spend more money than ever on a non-foldable smartphone.",
    "The Ultra is designed for early adopters, and three things stand out: it has a massive 6.9-inch display with next-gen fluid-scrolling tech that will stretch your hand; five cameras to capture 108MP photos, 40MP selfies and 8K video, and 5G antennas with peak speeds 66 times as fast as 4G LTE.",
    "It's a nice jump from the Galaxy S10 and S10 Plus cameras, although issues with inconsistent autofocus and overexposure kept the Ultra from being the best camera phone even at launch. Even with a camera software update, we still find the Galaxy S20 and S20 Plus to be better in most non-zoom scenarios.",
    "And now there's a new max-sized, max-specced phone out there: the Samsung Galaxy S21 Ultra. This actually has a marginally smaller 6.8-inch screen, but it has even more power, better camera performance, and support for Samsung's S Pen stylus. It's undeniably the better phone then, but will also likely cost you even more than the S20 Ultra does currently - though notably the S21 Ultra's launch price is lower than the S20 Ultra's was.",
    "You might also want to consider the Samsung Galaxy S21 or Samsung Galaxy S21 Plus - phones which are upgrades in some ways and downgrades in others.",
    "Rumours are already growing about the Samsung Galaxy S22 as well meaning this phone could feel even older soon, although there’s no confirmation of a release date just yet.",
    "In any case, back on the subject of the Galaxy S20 Ultra, while the cameras are inconsistent, they do shine for far-off subjects. The 48MP telephoto lens allowed us to get up close and personal thanks to an impressive variety of zoom lenses. It far surpasses the 2x optical and 10x digital zoom of previous Samsung phones, and the limited 8x digital zoom on the Google Pixel 4 – although 100x zoom snaps were hardly Instagram-worthy, 30x zoom looked fine on a tripod.",
    "Samsung's 'single-take mode' helps you answer an everyday question: should I take photos or a video?",
    "Take both. Its new ‘single-take mode’ captures a variety of shots over a 10-second span: photos, ultra-wides, portraits, hyperlapse video, regular video, and so on. It kept us out of the settings menus and in the moment, plus you can also clip 33MP photos from video, which proved handy.",
    "The S20 Ultra has a monster spec list: 12GB or 16GB of RAM and 128GB or 512GB of internal storage kick things off.",
    "There’s also a huge 5,000mAh battery for pulling down battery-intensive 5G signal, although we found it could only last more than 24 hours in 4G mode. Then there's the in-screen fingerprint sensor from the previous year’s phones, but it sadly is the first S phone without a 3.5mm headphone jack.",
    "It’s impossible to justify the Galaxy S20 Ultra price for everyone – even those who bought the S9 Plus or S10 Plus, and intended to get the next ‘big one’ from Samsung.",
    "For others, though, the word ‘upgrade’ means a completely different thing: they want a phone that pushes new boundaries, and they don’t mind if that pushes the price tag further into Galaxy Z Fold 2 territory.",
    "The Galaxy S20 Ultra is Samsung’s own version of Tesla’s ‘Ludicrous Mode’ in its electric cars, and even if the camera is a bit overhyped and inconsistent at the moment, early adopters will love showing off how its cameras go from 0.5x to 100x zoom real quick.",
    "The Samsung Galaxy S20 Ultra will likely be reduced in the Black Friday deals if you can find it, so it’s worth looking at the best phone Black Friday deals out there. We’ll be conducting a re-review in the future. However, we’ve updated references within our review to highlight new features that have emerged since our tests to give you a better idea of what you might be buying.",
    "The Samsung Galaxy S20 Ultra release date was March 6, 2020 in the US and Australia, and March 13 in the UK, alongside the S20 and S20 Plus.",
    "The S20 Ultra launched at a staggering $1,399 / £1,199 / AU$1,999, which is more than any non-foldable smartphone we've tested in the past – and that price is just for the version with 128GB of internal storage and 12GB of RAM.",
    "If you feel like you may need 512GB of onboard storage and a mind-boggling 16GB of RAM, the S20 Ultra price jumps to $1,599 / £1,399 / AU$2,249. Sadly, there's no 256GB version in between, which most people who shoot video may want.",
    "Some good news, though: you’re not going to need to max-out the storage, given our ever-accelerating move to the cloud and the fact that 5G connectivity will allow you to easily pull down remotely stored data.",
    "Plus, all models of the S20 have a microSD slot for expanding the storage by up to 1TB in case you do hit the built-in capacity.",
    "The Samsung Galaxy S21 series has also now landed though, and that may be a suitable alternative for you to to the Galaxy S20 Ultra. The new Samsung Galaxy S21 Ultra offers a slight spec upgrade and better camera performance, but has a lower launch price of $1,199 / £1,149 / AU$1849.",
    "Of course, the Samsung Galaxy S20 Ultra can now often be picked up for less than it cost at launch, however it's also trickier to find now that it's an older phone.",
    "Samsung’s 6.9-inch display will push the boundaries of your fingers’ reach and your thumb’s dexterity, yet it won’t feel much bigger than the S10 Plus – its width is actually a tad smaller than the 6.8-inch Note 10 Plus and 6.7-inch Galaxy S10 5G.",
    "It’s just that the Galaxy S20 Ultra is noticeably taller, not wider, expanding to a 20:9 aspect ratio. You can still grip it with one hand, and shove it in a deep-enough jeans pocket – just know that you’ll have to operate it with two hands to comfortably touch all corners of the display. It’s big; just not as big as its 6.9-inch screen suggests.",
    "We found the Super AMOLED display to be bright and pixel-dense at its 3200 x 1440 QHD resolution, yet also look perfectly fine at the default Full HD+ resolution. The lower resolution saves battery life and – spoiler – it’s the only resolution at which you can experience the 120Hz screen refresh rate; that’s not QuadHD-compatible yet.",
    "That's okay – we tended to favor Full HD+ with 120Hz turned on rather than dialing the refresh rate back down to 60Hz. Samsung matches pure gaming phones like the Asus ROG Phone 2 and Razer Phone 2 with this refresh rate, and the screen fluidity makes playing fast-paced games, and even just scrolling through Instagram, feel nicer.",
    "We appreciate that Samsung found a way to make a smaller punch-hole for its front-facing camera in the top-center of the screen, and selfies actually look better than before – and say goodbye to that wide dual-lens selfie camera from the S10 Plus, as there’s only one camera embedded in this display.",
    "Software handled the depth detection fine, which casts doubt on why you need a depth camera on the back of the Ultra and the Plus.",
    "We were consistently wowed by the Ultra's screen-to-body ratio, brightness levels and support of display standards such as HDR10+, offsetting our often cumbersome handling of this massive phone. It's worth it if you want today's best smartphone display, and aren't secretly wishing that the rumored iPhone 9 ushers in iPhone SE era sizes.",
    "The Samsung Galaxy S20 Ultra is made of glass and aluminum – there’s no ceramic version this year – and comes in just two colors: Cosmic Gray and Cosmic Black. The Cloud Blue color is exclusive to the S20 and S20 Plus, while Cloud Pink is an option with the smaller S20 size, which is a shame for Ultra owners who want some extra flash.",
    "There’s still a curve on the right and left edges of the screens, though it’s much less pronounced compared to past S phones. Sadly, that doesn't mean fewer accidental presses of the nearly bezel-less screen – Samsung still doesn't have excellent palm rejection software, so when we touched the edges with our grip and tried to press the shutter button in the camera app, the phone constantly thought we were trying to activate multi-touch and zoom in, instead of performing single press of a button. Palm creep is very real on this phone.",
    "We’ve talked about the tall-not-wide dimensions (166.9mm x 76mm), so now let’s talk about the girth and weight. At 8.8mm, the Ultra is noticeably thicker than the other S20 phones and all of the S10 phones (those range from 7.8mm to 7.9mm), and it has a sizable rear camera bump on top of that. Both are completely okay with us.",
    "It’s also heavier at 220g (roughly in between the S10 Plus at 175g and the Galaxy Fold at 276g). But again, to us, this is a completely favorable trade-off given the fast 5G mmWave technology, 108MP camera, and 5,000mAh battery that are packed into this cutting-edge smartphone.",
    "Too many times, camera team leads from various phone makers have told TechRadar “we would’ve fit in a better camera, but the design team won” – that’s a direct quote from one of them.",
    "The Galaxy S20 Ultra, thankfully, doesn’t sacrifice camera quality in order to look extra chic. It’s big, but it looks stylish enough – and more people will see your glorious 108MP photos than your phone anyway.",
    "Update: As promised, we went back are thoroughly tested this phone's camera with the newest software following our initial in-depth Samsung Galaxy S20 Ultra camera test. There are changes, but they didn't move the needle enough to change our review verdict.",
    "We could write a whole review of the Samsung Galaxy S20 Ultra’s cameras, there’s so much to say about them – and that’s good news if you want something fresh out of your smartphone’s photos, but bad news if you want the best photos with every snap.",
    "It’s Samsung’s biggest camera sensor upgrade since the Galaxy S7 and S7 Edge, yet we found the hyped-up 108MP camera mode captures photos that don't look much different than snaps taken in the main camera's default 12MP mode.",
    "However, the the extra-large pictures do offer the ability to crop in without as much quality loss. It makes sense for the same reason recording 8K video is often a good idea even if you don’t own anything more than a 4K TV: you can crop and edit without sacrificing detail. It gives you creative latitude, even if you ultimately output to a 12MP photo and 1080p video.",
    "But Samsung’s 108MP mode has a tendency towards overexposing images while its overaggressive image processing can smooth out faces and textures, and we had difficulty with the autofocus in several of our tests. Another issue: once we snapped good 108MP shots, we had issues with uploading the 20MB files to some social media networks, as they had a 12,000 x 9,000-pixel resolution. Twitter didn't just downsize the pictures, it flat-out rejected them.",
    "That's troubling for such a pricey camera phone. You also lose some features in 108MP mode, including motion photos (fine) and beauty mode (won't miss that), and there seems to be some baseline skin smoothing you can't control (not good).",
    "In the two photos above, taken on the Ultra and an iPhone 11 Pro Max, you can see that the Ultra image is brighter, but to the detriment of the dynamic range – this happened a lot with the photos we tested. You can also see where the phone had trouble focusing. The bokeh is good, though, giving the background some nice blur.",
    "The 100x digital zoom range of the 48MP telephoto camera is a neat party trick, but never gave us a usable photo. Even on a tripod, we found images taken using the 30x digital zoom looked oversharpened, and not at all great. It's the 10x hybrid optical zoom that appeared most impressive in side-by-side photo comparisons with the iPhone and Pixel.",
    "Where the 108MP camera struggled, the front-facing 40MP camera produced some of the best selfie photos in our tests. There were few autofocusing issues in the default 12MP mode, and more noticeable detail in the 40MP mode, but again, only once we cropped in.",
    "Samsung should give you more control over the virtual bokeh on its selfie camera, because a shallow depth of field limits the versatility of a 40MP camera (although the selfie camera takes 10MP photos by default). There isn’t a huge amount you can crop into if the backgrounds are always blurred.",
    "Samsung has also introduced 'Smart Selfie Angle', a menu option that zooms out of group selfies automatically. We've seen the ability to expand the frame on the Google Pixel 3, iPhone 11, and S10 series, but here it happens automatically when the camera detects two or more faces; when you're alone, it says tight for a more intimate view. This is one less option to worry about when you're trying to grab a quick selfie with several friends.",
    "Portrait mode, which Samsung calls Live Focus, does better than most camera phones in daylight, but struggled at night. Regardless, while we've never said Samsung had the best camera, we've previously said it has the most fun camera because of this feature – the Color Point filter a selective black-and-white mode), for example, makes your subject pop.",
    "There’s often a downside to inflated megapixel counts: the individual pixels are often smaller. We’ve seen that on plenty of cheap Android phones that tout 48MP and 64MP cameras with deceptive marketing, only to perform poorly in low light. Luckily, Samsung's approach here is different. The S20 Ultra does have smaller pixels at 0.8 microns, whereas the S20 and S20 Plus push the pixel size to 1.8 microns (up from the S10 series’ 1.4 microns). But there are two things going for the Ultra that should make up for those smaller microns.",
    "First, Samsung employs something called nona-binning technology, combining nine pixels into one to increase the pixel size to 2.4 microns in low-light situations, and leaving you with 12MP photos (the 9-to-1 math on a 108MP camera checks out).",
    "Second, the S20 Ultra has physically larger camera sensors – a 1/1.33-inch main sensor and 1/2-inch telephoto sensor. We've seen less noise from nighttime photos thanks to these physically bigger sensors that can absorb more light, although as mentioned Samsung tends to go overboard with the exposure, making some shots look artificial and smoothed.",
    "And that's the rub with the Galaxy S20 Ultra camera. It has the best hardware we've seen on a camera phone, and deserves all of the hype it's attracted. But autofocus and overexposure issues leave us wondering why you should pay so much for big camera spec numbers that result in photos that look pretty good, but not any better than what you can get on an iPhone, a Pixel or last year's Note 10 Plus.",
    "Samsung’s camera app continues to be the best out there, balancing robust features with ease of use. You can swipe anywhere on the screen to flip between the front and back cameras, and make a hand gesture to trigger the selfie camera timer. This is so much better than what Apple does right now – the timer is now hidden behind a menu on the iPhone 11 series.",
    "We also love the fact that you can double-press the lock button to launch the camera app without having to look at the screen; sometimes it's the little things that make snapping a photo easier.",
    "We had fun with the new ‘single-take mode’, which cycles through the cameras and some of Samsung’s 13 photo and video modes for 10 seconds, then picks the best shots. We ended up with wide, ultra-wide, smart cropped and filtered photos, as well as a video and hyperlapse video. It feels like this is more than a gimmick, and we hope other phonemakers adopt something similar.",
    "The S20 Ultra introduces 8K-resolution video recording, and Samsung's Super Steady stabilization now incorporates anti-rolling correction (up to 60 degrees). Both sound great, but both can't be used at the same time.",
    "We discovered that you can’t have 8K and Super Steady; in fact, Super Steady didn’t work in 4K either – it’s still a 1080p affair. And 8K is limited to 24fps, so you’re not going to get all the bells and whistles you do with 4K and Full HD video.",
    "What 8K did for us was allow us to crop and edit video without sacrificing quality. 4K, meanwhile, gave us frame-rate and zoom versatility – you get 20x video zoom in 4K, whereas you’re stuck at 6x in 8K. We did experience the same autofocusing flaws in 8K as we saw with 108MP photos, though, and you can start to see a theme here: big numbers aren't always better.",
    "To give you some storage requirement context, 8K video files will eat up just under 600MB for every minute of footage in the HEIC format (and every 8GB it’ll start a new file) – we say that just in case you’re deciding between the 128GB and 512GB versions of this phone.",
    "Luckily, we were able to trim the large 8K video files using the phone's built-in video trimmer, which we found handy. You can also clip 33MP photos on the Galaxy S20 Ultra while recording, or in post if you're shooting 8K video – you just tap a button inside the camera UI and it saves a high-resolution photo to your camera roll.",
    "The Galaxy S20 Ultra could still be many people's first 5G smartphone as it's still fairly new tech.",
    "Like the S20 Plus, the Ultra combines mmWave and sub-6 technology to offer the fastest peak download speeds (mmWave) and the widest range (sub-6). The S20 is outfitted with just sub-6, and it won’t be sold by Verizon, an mmWave-exclusive carrier in the US, for this reason.",
    "So how fast is 5G on the S20 Ultra? Exactly 66 times faster than the 4G LTE iPhone 11 Pro Max we tested right next to Samsung's phone, at least in New York City. We got 1.9Gbps on Verizon's mmWave network in Bryant Park, which broke our previous record of 1.6Gbps on the Galaxy S10 Plus in the same spot.",
    "We did have to be outdoors, and close to a 5G node on top of a lamppost, to make that happen. Sadly, mmWave is extremely fast but incredibly limited in range, whereas sub-6 is slower (ranging from 200Mbps to 500Mbps) but has a wider range, offers a more reliable connection and works indoors. Traveling around London, which is limited to sub-6 networks right now, we actually saw faster speeds with our 4G LTE iPhone 11.",
    "The fact is that 5G is still very much in its infancy in some regions, but, by combining the two 5G technologies, the S20 Ultra and S20 Plus futureproof your access to super-fast connectivity.",
    "The rest of the internal specs are all top-of-the-line: a 7nm chipset (Qualcomm’s Snapdragon 865 in the US, or Samsung’s Exynos 990 in the UK and Europe), 12GB or 16GB or RAM, 128GB or 512GB of internal storage, and a microSD card slot for expandable storage.",
    "Samsung’s One UI 2.0 software reskins Android 10 with a one-hand-friendly layout, with a lot of the menus items you need to touch appearing on the bottom half of the screen. Another perk is that Google Duo is now integrated directly in the dialer app – we were able to make Full HD video calls, and you can chat with up to eight people.",
    "The other new software addition is Quick Share, Samsung's take on Apple's AirDrop. It allows you to share files with multiple people, not just one person at a time, without having to connect to Bluetooth or sign into anything. However, the feature is exclusive to the Galaxy S20 series for now, with the intention that older Samsung phones should get it in the future.",
    "Using 5G hogs battery life, and in part to counter this the Galaxy S20 Ultra has a 5,000mAh battery capacity, while the S20 Plus has a 4,500mAh battery. We found that the Ultra lasted longer than 24 hours on days we weren't testing 5G speeds non-stop.",
    "The Ultra lasted 12 hours and 13 minutes in our battery drain test that ran through web pages on the T-Mobile LTE network. Switching to the 120Hz screen, however, shaved off exactly three hours, with the phone dying at 9 hours and 13 minutes using the same test. We found it hard to say no to the fluidity of 120Hz screen, but you may want to turn it off when you're not gaming.",
    "Samsung’s ‘Super Fast’ charging returns on the S20 Ultra, up to 45W here with an optional charger, and 25W with the charger included in the box.",
    "That mirrors what we saw on the Galaxy Note 10 Plus, as does the Ultra’s fast wireless charging prowess of up to 15W.",
    "Despite the large battery size, we were able to charge the phone to 31% in just 15 minutes, and 63% in 30 minutes, using the 25W charger.",
    "First reviewed: March 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "15": "Samsung Galaxy S20 Ultra release date and price",
    "22": "Display and overall size",
    "29": "Design",
    "35": "Five cameras",
    "51": "Samsung’s single-take mode and 8K video",
    "59": "5G, battery life, specs and software",
    "67": "Battery life",
    "72": "Don't buy it if..."
  },
  "links": {
    "5G phone": "https://www.techradar.com/best/best-5g-phones",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Google Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "best phone Black Friday deals": "https://www.techradar.com/black-friday/black-friday-phone-deals-2021",
    "Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs",
    "Galaxy S10 5G": "https://www.techradar.com/reviews/samsung-galaxy-s10-5g-review",
    "Asus ROG Phone 2": "https://www.techradar.com/reviews/asus-rog-phone-2-review",
    "Razer Phone 2": "https://www.techradar.com/reviews/razer-phone-2",
    "best smartphone": "https://www.techradar.com/news/best-phone",
    "Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "Samsung Galaxy S20 Ultra camera test": "https://www.techradar.com/news/samsung-galaxy-s20-ultra-camera-test-zoom-samples",
    "Galaxy S7": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s7-1315188/review",
    "S7 Edge": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s7-edge-1315189/review",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "5G smartphone": "https://www.techradar.com/best/best-5g-phones",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "Snapdragon 865": "https://www.techradar.com/news/snapdragon-865-phones-list-specs-and-5g-capabilities",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}