{
  "source": "https://www.techradar.com/reviews/gigabyte-aero-17-2021-review",
  "title": "Gigabyte Aero 17 (2021) review",
  "category": "computing",
  "updated": "2021-09-29T01:43:24Z",
  "author": "john-loeffler",
  "summary": "The Gigabyte Aero 17 is a creative professional's dream",
  "verdict": "The Gigabyte Aero 17 (2021) is definitely one of the most powerful mobile workstations for creative professional you're going to find. Its build quality is exceptional, the design and display are gorgeous, and you definitely won't lack for ports. Best of all, it's priced well below its less-powerful rivals regardless of configuration, so its price-to-performance ratio should put it at the top of the list for any creative professional looking to upgrade their work laptop. That said, all this comes at the cost of portability and battery life and while it can play AAA games very well, there are better gaming laptops out there.",
  "pros": [
    "Outstanding performance",
    "Gorgeous display",
    "Incredible build quality",
    "Abundance of ports",
    "Great price"
  ],
  "cons": [
    "Runs hot",
    "Not the best for gaming",
    "Fairly heavy",
    "OK battery life",
    "Pretty loud under strain"
  ],
  "article": [
    "The Gigabyte Aero 17 (2021) is one of the first laptops to come out this year with the new mobile Nvidia GeForce RTX 30-series GPUs, and for a portable creative's workstation, you're going to be hard-pressed to find anything as powerful as this laptop. It's simply one of the best laptops for graphic design and video editing on the market today.",
    "Pairing a powerful, 10th-gen Intel Core i7 or i9 CPU with the latest RTX 3060, RTX 3070, or RTX 3080 GPU, the Gigabyte Aero 17 (2021) offers creative professionals incredible performance starting at a midrange price and scales up to one of the most powerful mobile workstations for graphics design, video editing, and 3D rendering we've seen yet, all while keeping the price from absolutely running away with all your money.",
    "Considering the amount of hardware packed into this thing, you'd expect it to be thicker, but it's surprisingly thin - though definitely not an Ultrabook. It's also a hefty piece of kit, so it's not as portable as some of its rivals, but can still sit comfortably under your arm as you move around the house or office.",
    "The chassis is very well designed and offers a look that's somewhere between a gaming laptop and a professional workstation, though the RGB lighting on the keyboard might be too much for the office. The build quality is exceptional and while the keyboard and trackpad aren't the best, they'll do in a pinch if you're away from your desk. Fortunately, it has ports for days and Bluetooth 5.0 built in, so connecting quality peripherals takes no time at all.",
    "With a 99WHr battery, its battery life is just OK, which isn't surprising given the kind of hardware it's running. But if you're doing the kind of creative, resource intensive work this laptop was designed for, you're going to need to plug this bad boy in by lunchtime, without a doubt.",
    "And definitely don't render a 3D scene on the Aero 17 while it's sitting on your lap. Under strain, it can run very hot on the underside, and it runs pretty warm even in the best of circumstances. Fortunately, the Aero 17 has some software installed that lets you tweak all sorts of hardware settings that can help manage power usage, which does help.",
    "For a mobile workstation for creative professionals, though, all the downsides kind of come with the territory, but what you get for the trouble with the Aero 17 more than makes up for it.",
    "With a price substantially lower than its less-powerful rivals, this is easily one of the best mobile workstations you can buy right now, if not the best.",
    "The Gigabyte Aero 17 (2021) is available in the US, starting at $1,599 (about £1,170 / AU$2,070, no confirmed UK/AU pricing or availability yet). The base model Aero 17 comes with an Intel Core i7-10870H with an Nvidia GeForce RTX 3060 with Max-Q, 16GB 2,933Hz DDR4 RAM, 1TB SSD, and a 17.3-inch full HD 300Hz display.",
    "From there, different configuration options are available, with the highest-end configuration - the one we tested - costing an eye-watering $3,699 (about £2,700 / AU$4,790). This one comes with an Intel Core i9-10980HK, an Nvidia GeForce RTX 3080 Max-Q 8GB, 64GB 2,933Hz DDR4 RAM, two 1TB SSDs, Windows 10 Pro, and a 17.3-inch 4K HDR400 OLED display, running at 60Hz, and with Pantone factory calibration for 100% Adobe RGB.",
    "Prices for the other configurations obviously fall somewhere in between, depending on your configuration, but the Aero 17 can be configured to be more of a creative workstation that can play games or a gaming laptop that can do some prosumer creative work.",
    "The chassis of the Gigabyte Aero 17 (2021) is cut from CNC aluminum for a smooth finish across the lid, with a lithographed geometric accent and the contrasting Aero logo in the middle. There is a heat vent along the back with another Aero logo printed in silver in the center which is subtle enough to not be gaudy but high-contrast enough to catch the eye.",
    "On the bottom of the chassis, you find a grill in the characteristic Gigabyte design towards the rear that feeds air into the cooling system for the machine's internals.",
    "There's rubber footing around the grill to keep it raised up enough for air to flow through, and this grill is also where a lot of the heat is going to bleed out when you're taxing the system to its limit, despite the best efforts of its twin fans and heat piping. The screws holding the bottom cover in place are also easily accessible, should you want to void your warranty and access the internals directly.",
    "The bezels on the top and sides of the display are just 3mm thick, so the screen really shines here. Whether you opt for the 4K OLED or the 300Hz full HD LCD panel, the display is going to look sharp and modern, and thanks to those slim bezels, Gigabyte is able to fit a 17.3-inch screen into a much smaller chassis.",
    "The bottom bezel is thicker, but not egregiously so. Just underneath the display, you'll find the laptop's webcam - a location we're never going to really like, since it can give an unflattering, up-the-nose camera angle, but with the top and side bezels around the display as thin as they are, the camera does have to go somewhere.",
    "On the plus side, there is a physical slide that can cover the webcam when it's not in use, which is something every webcam should come with. Since they don't, that's just another point in the Aero 17's favor.",
    "Above the keyboard, you'll find the Aero 17's speakers in a long strip running beneath the screen. We will always prefer a top-firing speaker for its superior sound quality and the Aero 17 delivers on that note as much as a laptop speaker can. While audio professionals will still want to use dedicated headphones and a microphone for recording and editing work, the speaker quality is very good for playback purposes.",
    "You'll find several ports on either side of the Aero 17, along with a vent towards the back to help bleed off heat. There are three USB 3.2 Gen1 Type-A ports as well as a USB Type-C with Thunderbolt 3. There's also an HDMI 2.1 port and a mini DisplayPort 1.4 to output video up to 8K at 120Hz.",
    "There are separate headphone-out and microphone-in jacks for audio editing and recording work, a full sized SD card slot for photo and video, and a RJ-45 1Gbps port for a wired network connection. The 99WHr battery is charged through the DC-in connector, and while the USB Type-C port supports video out and data transfer, it doesn't support power input or charging.",
    "The keyboard is full-sized with a numpad and the trackpad has a built in fingerprint reader for secure log-in. The keyboard is rather cramped, unfortunately, and we found that it took some getting used to it for us to type on it effectively. The keys are all shifted slightly to left from where you'd expect to accommodate the numpad, so you will need to adjust to that if you're coming from a standard, numpad-less laptop keyboard layout.",
    "The trackpad is responsive enough for day-to-day tasks and productivity use, but if you're a creative professional, you aren't using a trackpad for anything more than that. The fingerprint reader nearly always registers on the first try, but it blends in with the trackpad somewhat so it does sometimes take a second try to hit it at the correct angle.",
    "Our biggest complaint about the keyboard though isn't the keyboard itself - its the RGB backlighting. For a laptop marketed towards creative professionals, the RGB lighting on the Aero 17 seems out of place. Fortunately, you can turn off the backlighting - or at least make it look less like a discotek when you have an important meeting or have to show something to the boss.",
    "Now, you might hear the words RTX 3080 and get some ideas into your head about what this GPU is capable of. You should definitely disabuse yourself of that notion right now; this is not the same desktop RTX 3080 that everyone is clamoring for and can't find anywhere.",
    "In many ways, this is an entirely different GPU, and our Jackie Thomas has an excellent explainer that breaks down the differences between desktop and mobile RTX GPUs, so you should check that out if you want to understand the difference.",
    "With all that said, the performance of the RTX 3080 with Max-Q in the Gigabyte Aero 17 (2021) is as good as you are going to find in a laptop geared toward the creative class. Compared to last year's HP ZBook Create G7 - one of our most highly recommended mobile workstations - the Aero 17's is the clear winner and by a substantial margin.",
    "In Cinebench20's CPU benchmark, the Aero 17's Core i9-10980HK performed as well as we expected, scoring 3,352cb in the multi core rendering test. This is slightly less than the Create G7's i9-10885H, which scored a 3,620cb on the same benchmark, but still close enough to be largely negligible in practice.",
    "And since we've seen an i9-10980HK score as high as 4,045cb on this benchmark (with last year's Asus Zephyrus Duo 15 GX550), a different driver or different processes running in the background could have made the difference here.",
    "We also ran a couple of rendering benchmark tests from open-source 3D modeling software Blender, specifically BMW27 and Pavilion Barcelona, to get a better sense of the kind of performance we could expect with its targeted workload.",
    "On the BMW27 benchmark, the Aero 17 finished the workload in 40 seconds, while it took 213 seconds to complete the Pavilion Barcelona workload. The median workload times, according to Blender's Open Data page at the time of writing, was 147.3 seconds for BMW27 and 455.62 seconds for Pavilion Barcelona. The Aero 17, then, finished the two workloads 73% and 53% faster, respectively.",
    "When it came to taxing a GPU, though, nothing beats 3DMark's benchmark tests, and it's on these tests that the Aero 17 really pulls away from its competition.",
    "The Create G7 scored a 14,328 in 3DMark's Firestrike test, compared to the Aero 17's 21,455, and in Time Spy, the Create G7 scored a 6,017 to the Aero 17's 9,577. Granted, the Create G7 was sporting an RTX 2070 with Max-Q, so it wasn't exactly a fair fight, but the Aero 17 still outperformed one of our favorite mobile creative workstations from last year by around 50% to 60%.",
    "In a more apples-to-apples comparison, the Zephyrus Duo 15 was loaded up with an RTX 2080 with Max-Q and 8GB VRAM, which is much closer to the RTX 3080 in the Aero 17. Here, the Duo scored a 17,571 on Firestrike and a 7,641 on Time Spy. The Aero 17 outperformed the Duo by a little over 22% and 25% on these tests, respectively.",
    "Where the Aero 17's RTX 3080 fell short was against last year's Gigabyte Aorus 17X and it's RTX 2080 Super with Max-P which, to be fair, is an absolute beast of a gaming laptop that needs two power supplies just to run all its hardware. The Aorus 17X scored a 20,803 on Firestrike and a 10,252 on Time Spy, so it's somewhat of a wash between it and the Aero 17.",
    "You can definitely see the difference while gaming though, with the Auros 17X pumping out 232 fps on low settings and 82 fps on ultra settings during our Total War: Three Kingdoms' battle benchmark. Here, the Aero 17 put out 208 fps and 67 fps on the same test, respectively.",
    "In our Metro: Exodus benchmark, the Aorus 17X again outperformed the Aero 17, with 173 fps on low settings, 80 fps on ultra settings without ray tracing, and 60 fps on ultra settings with ray tracing turned on. The Aero 17 put out 143 fps, 65 fps, and 53 fps on these three settings, respectively.",
    "That said, the Aero 17 isn't a high performance gaming laptop and isn't meant to be. The configuration we tested is definitely geared more toward creative professionals and against its rivals in the creative's mobile workstation class, it is the hands-down winner.",
    "The final point to touch on is the battery life. Gigabyte claims that in power-saver mode with 20% brightness and both Bluetooth and Wi-Fi turned off, the Aero 17 can get eight hours of battery life in their video playback tests. We have no reason to doubt that claim, but it's also not reflective of typical usage.",
    "In our movie test, with brightness and volume set to 50% with Bluetooth off, Wi-Fi on, and a balanced power setting, the Aero 17 made it three hours and 39 minutes - on a 99WHr battery. It did better in our PCMark10 battery test - six hours and seven minutes - but its still not exactly built for endurance.",
    "Your mileage may vary and with lower end specs, you'll definitely get more life out of that 99WHr Li-polymer pack, but at the high end, the hardware is just too powerful to make this anything but a desktop replacement that you can take with you to meetings and around the office for short stretches.",
    "Considering the target market for the Gigabyte Aero 17 (2021) as well as its more premium price tag, we did not expect to see much in the way of bloat and we didn't really find any. There's the standard preinstalls that come with every copy of Windows 10, but nothing egregious like McAfee and we didn't see any pop-ups near the notification center that we're starting to see on some laptops.",
    "The two biggest software installs of note are the Gigabyte control center and Microsoft Azure AI. The control center app lets you manage everything from GPU performance to Pantone color profiles to driver updates. Most importantly, it's also where you can adjust or turn off the RGB lighting, if necessary.",
    "Microsoft Azure AI, meanwhile, monitors your system resource usage and power consumption when using different apps and automatically adjusts power distribution between the CPU and GPU to maintain consistent performance and system stability.",
    "It does this automatically, so there's nothing you need to do, but you can right click the AI icon on the top right of the desktop and select options to emphasize performance or energy efficiency and to process data using Azure's cloud computing platform or process at the edge."
  ],
  "headers": {
    "0": "Two minute review",
    "8": "Price and availability",
    "11": "Design",
    "23": "Performance",
    "40": "Software and features",
    "44": "Don't buy it if..."
  },
  "links": {
    "best laptops for graphic design": "https://www.techradar.com/news/best-laptops-for-graphic-design",
    "Ultrabook": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "best mobile workstations": "https://www.techradar.com/news/best-mobile-workstations",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "excellent explainer": "https://www.techradar.com/news/the-new-nvidia-rtx-mobile-gpus-are-here-and-we-put-them-to-the-test",
    "HP ZBook Create G7": "https://www.techradar.com/reviews/hp-zbook-create-g7-2020-review",
    "Asus Zephyrus Duo 15 GX550": "https://www.techradar.com/reviews/asus-zephyrus-duo-gx550",
    "Open Data page": "https://opendata.blender.org/",
    "Gigabyte Aorus 17X": "https://www.techradar.com/reviews/gigabyte-aorus-17x"
  }
}