{
  "source": "https://www.techradar.com/reviews/clear-tv-hdtv-antenna",
  "title": "Clear TV HDTV Antenna review",
  "category": "televisions",
  "updated": "2021-11-10T00:02:23Z",
  "author": "andrew-hayward",
  "summary": "A cheap and compact antenna with inconsistent results",
  "verdict": "The Clear TV HDTV Antenna is one of the smallest and most affordable digital antennas on the market, but hit-or-miss reception holds it back.",
  "pros": [
    "Compact size",
    "Very affordable"
  ],
  "cons": [
    "Inconsistent performance"
  ],
  "article": [
    "Modern indoor TV antennas have mostly evolved from the enormous (but charming) \"rabbit ears\" design of old to near-paper-thin sheets of plastic that you can mount to a wall or even hide behind your TV. But the Clear TV HDTV Antenna reimagines the classic design as a USB stick-sized antenna with extendable rabbit ears.",
    "It's small, simple and amazingly cheap (we picked ours up from Walmart for a mere $10). But if you're thinking that a design like this is too good to be true, you'd be kind of correct. While we experienced good reception in one location that we've used to test many antennas, we struggled to pull as many channels or as consistent of reception in another area that has been fine with larger, more powerful rivals.",
    "The Clear TV HDTV Antenna might do the trick for you and could be a steal... but if it doesn't, then you've just wasted $10 on a half-functional hunk of plastic.",
    "As mentioned, the Clear TV HDTV Antenna is incredibly small. While it has a coaxial cable attached, the black plastic device itself fits in the palm of your hand—it's only about 3 inches tall and weighs practically nothing. The flat base is a little bit wider so that it can stand upright, which is aided by a peel-off sticky surface. We were able to move it between TVs and locations without leaving residue, although the stickiness gradually subsides each time you move it.",
    "The little metal arms on either side of the Clear TV HDTV Antenna are flip-up bunny ears that extend out to about 4.5 inches, bringing the total height of the device to just over 7 inches. The telescoping ears aren't omnidirectional, but you can point each independently along the spectrum from being folded to fully upright.",
    "Like any other detachable antenna, the Clear TV HDTV Antenna has a coaxial connector that plugs into the back of your TV, with about 6.5 feet of cable included. This isn't an amplified antenna, which means it doesn't have a separate cord that plugs into a wall outlet or USB port to extend the range.",
    "The Clear TV HDTV Antenna advertises a range of 35 miles and claims to be compatible with 1080p and 4K resolution signals alike. American networks are not currently broadcasting in 4K resolution, so that's a promise that the Clear TV and other antennas can't fulfill for now.",
    "We saw very different results on two floors of a house about 15 miles north of downtown Chicago. On the top floor, the antenna performed similarly to many others that we have tested in the location, picking up 55 channels and providing strong reception on most of them. We tested the antenna both directly behind the TV and a couple feet away from it on the same surface, and the results were similar in both instances.",
    "Downstairs in the living room, the Clear TV was much less successful. We ran multiple channel scans with the antenna behind the TV, both resting on the stand and on the back of the set itself, and only pulled in about 20 channels. Those channels looked clear and were stable, but it was a fraction of what we had pulled one floor higher.",
    "Pulling the Clear TV antenna a few feet away from the TV increased the number of channels discovered to about 40, but those additional channels were choppy and inconsistent—the end result wasn't really any better. We tried it again on a separate TV on a table about 10 feet away and discovered more than 40 channels, but once more, the reception on some channels made them very difficult to watch.",
    "We have tested other antennas in that ground-floor setting, both standard and amplified, and have typically seen pretty strong results. However, the Clear TV HDTV Antenna seemingly couldn't penetrate the added obstructions of houses and trees, delivering fewer overall channels and less consistent picture quality as a result.",
    "Given the results of our testing, buying the Clear TV HDTV Antenna is a tough sell. On one hand, we saw great reception and plenty of channels in a second-floor setting—and at $10, it worked about as well as pricier antennas that we have tested in the space.",
    "But downstairs, the limitations of the compact design were immediately apparent, picking up a smaller number of available channels and delivering inconsistent reception for some of them. For just $10, it might be worth trying if you live close to the broadcast feed and don't mind returning or exchanging the product for something more powerful if needed.",
    "However, if you have experienced troubles with interference or live farther away from a source, then you'll probably want to invest in something more powerful."
  ],
  "headers": {
    "3": "Design",
    "6": "Performance",
    "11": "Final verdict"
  },
  "links": {
    "indoor TV antennas": "https://www.techradar.com/news/best-indoor-tv-antennas",
    "test many antennas": "https://www.techradar.com/news/best-indoor-tv-antennas"
  }
}