{
  "source": "https://www.techradar.com/reviews/hostens",
  "title": "Hostens review",
  "category": "computing",
  "updated": "2021-01-19T20:30:15Z",
  "author": "mirza-bahic",
  "summary": "What does Hostens have to offer besides a cute hamster?",
  "verdict": "Hostens is a likeable web hosting provider from Lithuania with a considerable number of customers across Europe. With its user-oriented approach, feature-packed plans and pocket-friendly pricing, it might be one of the best hosting solutions for newcomers.",
  "pros": [
    "All plans come with daily and weekly backups",
    "Budget-friendly hosting solutions",
    "Cost-free Let’s Encrypt SSL certificate",
    "Free domain with all annual plans",
    "No hidden fees nor questionable marketing ethics",
    "Perfect speed performance",
    "They accept bitcoin payment"
  ],
  "cons": [
    "All plans have a restriction on bandwidth",
    "Doesn’t offer assistance with website migrations",
    "No protection against DDoS"
  ],
  "article": [
    "With Hostens even a hamster can have its own website, or we have to believe it can, since we failed to find a hamster of sound mind that would confirm this. Nevertheless, Hostens started its journey as a division of company Interneto vizija in 2003, and has since grown to serve more than 150,000 customers throughout Europe. Achieving their goal to create a balance between affordability and enterprise-level technology, they became Lithuania’s best known web hosting company in 2005.",
    "Hostens owns and operates “state-of-the-art” data center which meets the international standards of tier 3 technology (this indicates 99.98% availability). Located in Vilnius, Lithuania, it is conveniently situated at Europe’s geographic midpoint.",
    "The landing page of Hostens’s main website is irresistibly reminiscent of children's picture books with its idyllic cartoonish landscape, eternal sunshine and a little charming mascot in the form of a hamster. The section about the company provides a decent amount of information about its history, data centers and team behind it, all with photos. The website itself is available in multiple languages besides English, including: Estonian, Latvian, Ukrainian, Russian, Spanish, Portuguese, Indonesian and Chinese (Mandarin, to be specific).",
    "Now, let’s talk about Hostens’s official blog and the (mis)adventures of a familiar little critter emanating his cuteness beyond the boundaries of the digital world. So what does the blog have to offer beside this? In fact, everything it should: a great deal of up-to-date, informative and instructive articles on various relevant and interconnected topics.",
    "When it comes to social networks, Hostens can be found on Facebook, Twitter, LinkedIn and (although less obvious) on Reddit. All accounts seem to be updated pretty frequently, aside from the Reddit one.",
    "Hostens has three different types of hosting on the menu: shared hosting, VPS and reseller hosting, and three plans of different sizes are provided for each of them. The entry-level shared hosting plan has a lot to offer and for a very reasonable price of $3.00 per month. It drops to $1.50 if you commit for a year, $1.20 for two of them and $0.90 for three years, which is the most cost-efficient solution if you are willing to make a long-term decision. This plan will provide you with: 10GB of disk space, 1TB of bandwidth, supports up to 10 websites and databases, and 100 email accounts. Also, it includes daily and weekly automated backups, the industry standard cPanel, Let’s Encrypt SSL certificate and a website builder.",
    "In case their services do not meet your needs, there is a 30-day money-back guarantee, but only if the invoice was paid via credit card or PayPal, and it (as expected) excludes a domain registration and any add-ons.",
    "As for payment methods, in addition to those mentioned above, Hostens allows you to pay via Alipay, BitPay (yes, they accept bitcoins), Bitcoin Cash, Ethereum, XRP, Boletol or DOKU.",
    "Just as Hostens’s website is simple to use, so is the process of choosing and purchasing the wanted hosting plan. For every hosting type, underneath the presented plans you can find a rather useful FAQ section with most of the basic questions answered in an easy-to-follow manner. When you decide on a plan, all details about it will be displayed clearly, together with billing cycles to choose form and appropriate add-ons. Next, you’ll be asked to choose a payment method, and there are more than a few available.",
    "If you are new to Hostens, here you’ll be required to provide a number of personal information, but nothing out of the ordinary. Additionally, you can subscribe to receive notifications about news and updates via SMS. If you want to enable two-factor authentication to enhance your sense of security, this is where you want to do it. After making the payment, new users can register their new domain name or transfer an old one, provided they have it.",
    "After wrapping up everything, you should get access to your recently created website without much delay.",
    "Hostens uses industry standard cPanel, which is beneficial both to newcomers as to those who are already familiar with it. From there, you can easily set up SSL and install WordPress or other popular apps using Installatrion, a handy one-click installer. As of late, Hostens enriched its hosting plans with a drag-and-drop website builder to the delight of all those who awaited it. We should not forget to mention that all shared hosting plans support Python, Ruby, and Git programming languages.",
    "All in all, it’s hard to deny that Hostens has much to offer, but one thing it (still) lacks is DDoS (Distributed Denial of Service) attack protection. Being aware of this issue for quite some time, they even advise its own customers to implement DDoS protection solutions on their own. Although the risk of being targeted by a DDoS attack is relatively low, it’s still an issue that should be addressed sooner rather than later.",
    "Having all the necessary information about Hostens’s data centers, we expected a perfect performance and that's exactly what we got. As a matter of fact, this is the first time we’ve seen GTmetrix grade speed performance of a website with a flawless A (100%), which is nothing but impressive. Hostens’s main website took 2.8 seconds to fully load the page (the average result is 8.1) and 48 requests (the average being 89), which looks promising, to say the least.",
    "Hostens offers 99.95% uptime guarantee, which doesn’t measure up to tier 3 server’s potential of maintaining an uptime of 99.98%. Despite that, after monitoring uptime of Hostens’s main website constantly for two weeks (through the use of UptimeRobot) we recorded no downtime whatsoever. One major oscillation in response time was recorded and a few minor ones, but nothing significant enough to have impact on the overall performance.",
    "Although it lacks the curtness of a well-known hamster, Hostens’s knowledgebase has much to offer. A decent amount of articles is divided into corresponding categories, some of which are more informative and others are of tutorial-like nature. All articles are accessible through categories on the side bar as well, with a few of the most recent ones being highlighted. As an alternative, you can simply use the search box.",
    "If you still can’t find the answers you are looking for (or you would rather have more personal assistance), you are welcome to get in touch with Hostens’s team via live chat, e-mail, ticket or contact form. Their support team is available round-the-clock, so any problems, questions or concerns should be resolved in a heartbeat.",
    "However, although we didn’t have any unpleasant experience with Hostens’s support, evidently, a certain amount of their customers did, according to a considerable number of complaints that can be found all over the internet, most notably on Trustpilot. User experiences vary drastically, from the ones that are more than pleased with Hostens’s services to those who characterized them as “scoundrels and scammers” with “useless” customer support. We understand that no one is able to make everyone happy, but perhaps there are issues that Hostens should address.",
    "At first glance, MilesWeb and Hostens might seem a bit similar: both hosts have modern user-friendly websites occupied by the company’s mascot, feature-packed plans, access to cPanel’s demo version and both are big players in their surroundings (MilesWeb in India, Hostens in post-Soviet states). However, for those with high demands, MilesWeb has more on the menu, while Hostens seems perfect for newcomers and individual bloggers.",
    "Hostgator’s Snappy (their mascot that takes the form of an alligator) is a major competitor to Hostens’s adorable hamster, although we consider them equal in that area. Where they are not equal is the extensiveness of their services. When it comes to shared hosting plans, Hostgator can offer everything Hostens can, but also with unlimited bandwidth and disk space with all its plans.",
    "Both Bluehost and Hostens are competent hosts and are rather generous towards newcomers (free domain, free SSL, cPanel, easy-installs and more). While Hostens throws in a website builder to spice up the deal, Bluehost has more on the offer for demanding businesses (such as dedicated servers) and, as of recently, a managed WordPress hosting as an option.",
    "Strato is another rather strong competitor to Hostens, but one based in Berlin, Germany (as their data center is). Since both hosts' data centers are located inside Europe, both can appeal to customers from European countries. Despite that, Strato is unavailable in some of them, while Hostens covers every single country. Besides that, Scooter’s H.P. Baxxter (despite being regarded as a successful musician) can’t compete with the charm of Hostens’s nameless hamster.",
    "In the end, what does Hostens have to offer beside a cute hamster? Actually a lot, and most likely everything a beginner or independent blogger could wish for. Of course, like with everything, there are flaws. The lack of safety from DDoS attacks and some concerning comments from old customers are the ones we should mention. Even so, is Hostens worth the risk? Yes, without a doubt, but if you would rather stay on the safe side, hosts like GoDaddy, Hostgator and Bluehost are always a good bet."
  ],
  "headers": {
    "5": "Plans and pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "18": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Hostens": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1206422569391993900&xs=1&url=https%3A%2F%2Fwww.hostens.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhostens",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "shared hosting plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3430447783547774000&xs=1&url=https%3A%2F%2Fwww.hostens.com%2Fshared-hosting%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhostens",
    "MilesWeb": "https://www.techradar.com/reviews/milesweb",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Strato": "https://www.techradar.com/reviews/strato"
  }
}