{
  "source": "https://www.techradar.com/reviews/adidas-adizero-boston-10",
  "title": "Adidas Adizero Boston 10 review",
  "category": "fitness",
  "updated": "2021-11-03T14:26:39Z",
  "author": "michael-sawh",
  "summary": "A heavy but dependable daily trainer that offers a smooth ride",
  "verdict": "The Adidas Adizero Boston 10 is a daily trainer that offers generous cushioning and good protection for the legs, but does feel a bit on the heavy side. It’s definitely one that works for easy to moderate paced training runs rather than big speed or interval sessions.",
  "pros": [
    "Lots of cushioning",
    "Smooth ride",
    "Comfortable, supportive upper"
  ],
  "cons": [
    "Firmer ride than other daily trainer shoes",
    "Heavier than we’d like",
    "Not a great fit for speed sessions"
  ],
  "article": [
    "The Adidas Adizero Boston 10 is a running shoe that’s well built for training runs when you’re going long but you’re more coasting than hitting your fastest speeds. The generous amount of cushioning means your legs are well protected, but it comes at the expense of the shoe feeling a bit of heavy and slightly firm.",
    "That cushioning does offer a smooth, consistent ride though, while the upper feels supportive too. It just doesn’t feel like the most exciting shoe out there, particularly when you compare it to what else is available around this price.",
    "The Adidas Adizero Boston 10 was launched in June 2021, priced at $140 / £130 / AU$260.",
    "The Boston 10 certainly has the look of Adidas’s more elite-focused Adios Pro 2 shoe, and while it inherits some characteristics from the Pro 2, it’s clearly built for a different type of running.",
    "It weighs in at a noticeably hefty 295g for the men's shoe and 266g for the women’s, with a quite substantial mesh upper. There are two types of material used in the midsole foam, and on the outsole Adidas’s signature Continental Rubber provides strong traction on the road in wet and dry conditions.",
    "The shoe has an 8.5mm drop and a stack height that’s 39.5mm at the heel and 31mm at the forefoot. It definitely looks a little chunky at the back.",
    "The upper comes in three colorways, including the Sonic Ink, Cloud White, and Screaming Green combination we tested here (provided by SportsShoes.com). We've seen some quite extreme color choices this year, and it’s fair to say Adidas has taken a more traditional approach with the look of its Boston 10 shoe.",
    "That upper feels nicely padded, and the traditional laces get you a nice locked-down fit. Adidas has opted for a very skinny tongue, so there’s not a great deal of padding on the top of the foot, but there's a good amount of padding at the heel collar to offer support and comfort. Adidas is using its Primegreen material, which includes recycled Parley ocean plastic, but we’d definitely like to see more than the 50% that’s being used here.",
    "It’s a shoe that felt true to size for us in our UK size 8, with a good amount of room up front in the toe box without ever feeling tight or uncomfortable to run. You might be able to drop down a size, but we’d recommend sticking to your usual here.",
    "The Boston 10 isn’t the most exciting or enjoyable shoe we’ve run in, but what you get here is something that’s built to soak up a lot of time on your feet.",
    "Adidas uses its Lightstrike Pro foam and Lightstrike EVA to offer what it hopes is the right mix of cushioning and durability, with its Energyrods sandwiched in between for stiffness and low energy loss. The overall result is a shoe with a firmer and heavier feel than we’d like, but the ride overall was smooth, consistent, and it felt good when we picked up the pace a little.",
    "While it’s a bit firm underfoot, the Boston 10 never felt taxing on the legs after a run, which is testament to the design of this shoe. That substantial upper offers good structure and the cushioning system, while not the most lively, feels like it’s well suited to tackling long, evenly paced runs. It’s a shoe that definitely felt best on 10km or longer runs; its weight is more noticeable on shorter, sharper efforts.",
    "The Boston 10’s outsole is great. That Continental rubber was firmly put to the test in our first few runs, which were in pretty horrendous rainy conditions. They more than stood up to the task, and thankfully didn’t have us slipping and sliding even at speed.",
    "As mentioned, the Boston 10 isn’t a shoe that thrills, but it will work as a go-to for big, long runs below your top speed. There’s definitely daily trainer-style shoes that sit around this price and actually come in a bit less, that can get you a lighter, more energetic midsole and upper combination. That may well come at the expense of things like durability and offering good support and protection, which the Boston 10 clearly seems to have in abundance.",
    "'Dependable' would be a good word to associate with the Boston 10. If you’re looking for a running shoe where there’s less emphasis on going quick and you want something to help bank your long training runs with, then it’s going to appeal.",
    "First reviewed November 2021"
  ],
  "headers": {
    "0": "30-second review",
    "2": "Price and release date",
    "3": "Design",
    "9": "Performance",
    "16": "Don't buy it if"
  },
  "links": {
    "running shoe": "https://www.techradar.com/best/best-running-shoes",
    "SportsShoes.com": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7535786367525482000&xs=1&url=https%3A%2F%2Fwww.sportsshoes.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fadidas-adizero-boston-10",
    "Parley ocean plastic": "https://www.parley.tv/#fortheoceans"
  }
}