{
  "source": "https://www.techradar.com/reviews/airpods-max",
  "title": "Apple AirPods Max review",
  "category": "audio-visual",
  "updated": "2021-12-02T14:52:59Z",
  "author": "olivia-tambini",
  "summary": "The perfect headphones for Apple devotees",
  "verdict": "The Apple AirPods Max are among the best-sounding headphones we've ever tested, they're easy to use, and their noise cancellation can easily stand up to the likes of the Sony WH-1000XM4 and the Bose Noise Cancelling Headphones 700. However, their high price, limitations for Android users, and lack of 3.5mm audio port means we'd only recommend them to iOS users with a lot of money to spare – and no interest in Hi-Res Audio.",
  "pros": [
    "Unbelievable audio performance",
    "Fantastic user experience",
    "Brilliant extra features for iOS",
    "Great noise cancellation"
  ],
  "cons": [
    "Very expensive",
    "No 3.5mm audio port",
    "Limited features for Android",
    "Ineffective carrying case"
  ],
  "article": [
    "The Apple AirPods Max were the most hotly-anticipated headphones of 2020, having been the subject of rumor and speculation for two years.",
    "As the first Apple over-ear headphones, expectations were high, especially considering the success of the Apple AirPods and the AirPods Pro, which have quickly become the most easily-recognizable wireless earbuds available today.",
    "Since 2018, we heard rumors that the AirPods Max would be the most advanced wireless headphones ever to be released, with speculation that they would come with futuristic features like air gestures that wouldn't require you to touch the headphones at all to control them.",
    "If the AirPods Max had come with those game-changing specs, their $549 / £549 / AU$899 price tag may have been justified – unfortunately that’s not the case.",
    "In reality, the Apple AirPods Max are more ordinary than many expected; albeit with extraordinary audio quality and brilliant quality of life features for those already devoted to the Apple ecosystem.",
    "Let's take a look at the positives first; the best thing about the AirPods Max is their sound, which is nothing short of outstanding. They can easily compete with the Sony WH-1000XM4 in this regard, with a wide, immersive soundstage and carefully balanced profile, with crisp trebles, smooth mids, and powerful bass frequencies.",
    "With high levels of detail and clarity, the AirPods Max reveal elements in your favorite songs that you may not have noticed before – and that's the mark of a pair of really fantastic-sounding headphones.",
    "The active noise cancellation is also class-leading, sitting shoulder to shoulder with the Bose Noise Cancelling Headphones 700 – and the Transparency mode is undeniably handy when you need to quickly tap into your surroundings.",
    "The design, although divisive, is another win for Apple. With large, flat earcups crafted from hunks of stainless steel, the AirPods Max look unmistakably 'Apple', focussing on simplicity and functionality.",
    "They feel premium, more so than the Sony WH-1000XM4, which are largely made from plastic, though that stainless steel build does mean the AirPods Max are rather heavy. Apple has included a mesh headband that's designed to reduce the pressure on your head during use, but there's no escaping their density; if you're particularly sensitive to on-head pressure, the AirPods Max may not be the right headphones for you.",
    "Saying that, we did find them comfortable enough during our tests, and we appreciate the use of physical controls as opposed to the voguish swipe controls that most wireless headphones seem to favor these days. We particularly liked the reprisal of the Apple Watch's Digital Crown, which allows you to precisely adjust the volume and easily control your music playback.",
    "That’s the thing about the AirPods Max, and Apple products in general: they just work. Pairing is incredibly easy, we didn't experience any annoying connection dropouts, and Apple has eschewed technology like swipe controls that it doesn't deem good enough for its products for the sake of keeping up with the competition.",
    "One rather large design issue is the lack of a 3.5mm audio port; if you want to listen to music with a wired connection, or hook up the AirPods Max to an amp or DAC, you'll have to shell out for a USB-C to 3.5mm audio port adaptor. That seems rather miserly when you consider the price – and if Apple wants to market these as a pair of premium headphones, the inability to use them with an amp straight out of the box is unfortunate.",
    "Another thing that will put off the audiophile crowd is the lack of support for Hi-Res Audio codecs, which is limited to Apple's own Apple Digital Masters.",
    "It begs the question: Who are the Apple AirPods Max for? Despite their premium price and fantastic sound quality, they certainly haven't been marketed towards audiophiles who want to eek out every last drop of audio fidelity from their headphones with the use of Hi-Res Audio codecs and amplifiers.",
    "Yet, their price means the AirPods Max are hardly a mass-market product either, as many casual music listeners will be unwilling to shell out so much for a pair of noise-cancelling headphones.",
    "The conclusion we've come to is that the AirPods Max are aimed squarely at Apple devotees; those who already have an iPhone, use Siri regularly, and have perhaps already invested in a pair of AirPods in the past.",
    "There are so many benefits open to Apple users that Android users aren't privy to, including immersive Spatial Audio, the ability to automatically switch between iOS devices, one-tap setup, hands-free Siri activation, and Audio Sharing. Post-launch updates include Conversation Boost, the ability to announce notifications with Siri, and integration with Apple's Find My feature.",
    "For Android users, the AirPods Max are simply a high-performance pair of noise-cancelling headphones with an unusual design, as fantastic as they may sound – and for these users, we can't see how the high price is justified.",
    "But, if you're a card-carrying member of the wider Apple ecosystem, you have a lot of money to burn, and you don't care about Hi-Res Audio, you won't find headphones that sound better or are easier to use than the AirPods Max.",
    "The Apple AirPods Max cost $549 / £549 / AU$899 and were officially released on December 15, 2020.",
    "That price makes the AirPods Max far more expensive than many of the best over-ear headphones on the market, including our current favorite cans, the Sony WH-1000XM4; anyone hoping for a budget-friendly price, as we saw with the recently-launched HomePod mini, will be disappointed.",
    "A year on from their launch, and we're starting to see some good discounts on the AirPods Max, so you'll probably find them cheaper than their original RRP.",
    "There are rumors that Apple is planning to release a cheaper, sports-friendly variant of the AirPods Max, but even then you can expect those to cost a pretty penny.",
    "After the price, the next biggest controversy surrounding the Apple AirPods Max is their design; they look quite unlike any other headphones on the market right now, with large flat earcups crafted from stainless steel, and a carrying case that's instantly recognizable.",
    "There's an unmistakably 'Apple' quality to the earcups; some may describe them as stylishly minimal, while others might say they're rather featureless. Those that are looking for a bit more impact from their headphones may want to try the AirPods Max in one of their brighter color options, which include, silver, sky blue, green, and pink",
    "We weren't sure about the overall design at first, but we have to say it's grown on us; they do look rather special compared to the competition, with a build quality that feels suitably premium for the price.",
    "Special though they may be, those stainless steel earcups mean that the AirPods Max are quite heavy, coming in at 385g – for comparison, the Sony WH-1000XM4 weigh 254g. Sure, that extra heft does make the AirPods Max feel as though they're sturdy and well-made, but it's a lot of weight to be carrying around on your head all day.",
    "To offset that added weight, the Apple AirPods Max come with a headband made from a knitted mesh fabric that's designed to reduce on-head pressure. The look of the headband is certainly novel, but after spending time with the AirPods Max, we've come to appreciate it – they're very comfortable to wear despite their relative heaviness.",
    "Are they as comfortable as the Sony WH-1000XM4? We don't think they quite measure up to the best headphones you can buy today in that respect, but the AirPods Max don't come with that uncomfortable clamping feeling that some over-ear headphones cause.",
    "The headband frame itself is made from stainless steel, with telescoping arms that you can adjust to find a good fit – they'll stay in place once you adjust them, so you won't be constantly fiddling with the fit. The frame feels sturdy and well-made, but it's not so heavy as to put pressure on your head.",
    "The memory foam earcups also feel comfortable, and can pivot independently to fit your head. The earcups are easily removable, snapping in place via a magnet; you'll be able to buy replacement earcups for the AirPods Max for $69 / £75 / $99 from the Apple Store.",
    "The on-ear controls on the AirPods Max are minimal; interestingly, Apple has reprised the Digital Crown dial of the Apple Watch, which it says enables precise volume control, as well as allowing you to play or pause audio, skip tracks, answer or end phone calls, and activate Siri.",
    "You can simply turn the dial on the top of the right earcup to adjust the volume, or press once to play / pause your music, press once to answer and end phone calls, press twice to skip to the next track, and press three times to skip backwards.",
    "We liked the tactility a dial provides, and it definitely feels like a more precise way of adjusting the volume as opposed to a button or swipe controls. In fact, we're quite pleased that Apple hasn't opted for touch-sensitive housings; in our experience, they can be temperamental, and it's tricky to remember all those different gestures.",
    "The right earcup also houses a noise control button that allows you to switch between active noise cancellation and Transparency mode, which allows some environmental noise to pass through the headphones, while the bottom of the earcup houses an Apple Lightning port for charging.",
    "What isn't included is a 3.5mm audio port. So, if you want to listen with a wired connection, you'll have to fork out for a Lighting to 3.5mm audio adapter for an additional $35 / £35 (about AU$45).",
    "It's frustrating that this doesn't come included with the headphones when you consider how expensive they are – if you're paying $549 / £549 / AU$899 for a pair of headphones, you might (quite reasonably) expect to be able to plug them into an amplifier or DAC to squeeze out every last drop of fidelity right out of the box.",
    "Interestingly, the lack of audio port isn't the most divisive design aspect of the AirPods Max; that award goes to the unusual-looking Smart Case, which puts the headphones in an 'ultralow power state', preserving the battery while the headphones aren't in use.",
    "So far, the Smart Case has been compared to a bra, a sleeping mask, and a handbag by bemused Twitter users, and we can't say that we blame them.",
    "That design wouldn't be so egregious if the case actually did what it's supposed to do: protect your headphones. Instead, the Smart Case leaves the headband of the AirPods Max totally exposed, and while an opening at the bottom of the case does make it easy to charge the headphones without removing them, it leaves them vulnerable to debris finding its way inside.",
    "The rubberized material is also a magnet for smudges and scrapes, and just placing the Smart Case in a bag is enough to ruin the pristine look you get straight out of the box. Again, we'’d expect more from Apple at the price; while lightweight and compact, a hard case with a zip would provide far more protection and peace of mind.",
    "The audio quality offered by the Apple AirPods Max is simply outstanding. They come with a wide, well-balanced soundstage that leaves plenty of room for each instrument to really sing – pair that with cool extra features like automatically pausing your music when you remove the headphones and Spatial Audio, and you've got yourself a very special pair of cans.",
    "Listening to Phoebe Bridgers' Garden Song, and her soft vocal sounded smooth and clear, with every detail meticulously conveyed by the AirPods Max. The glitchy picked guitar had a lovely rich quality to it, with a fantastic sense of rhythm and stereo separation.",
    "Moving onto Love My Way by The Psychedelic Furs, the glockenspiel sounded bright and vivid, while the tightly-controlled bass provided a solid bedrock for the guitar and vocals. As we turned up the volume, we didn't experience any issues with distortion, partly thanks to the neodymium ring magnet motor inside the headphones that powers its 40mm drivers.",
    "The AirPods Max are great for listening to pretty much any genre of music, whether you're into sparkly pop with strong vocals or hip-hop with punchy basslines – and unlike the AirPods Pro, they can handle classical music, too. As we listened to Mozart's Jupiter, the raucous opening sounded expansive and decadent, while the quieter flute passages were handled delicately with accuracy and precision.",
    "Despite the high price of the AirPods Max, support for Hi-Res Audio files is limited to Apple's own Apple Digital Masters tracks, which are only available via Apple Music. Again, this makes it feel as though we're being somewhat shortchanged, as we'd expect comprehensive codec support at this price - and now that Apple Music offers Lossless Audio, the lack of lossless streaming support is unfortunate.",
    "Like the AirPods and AirPods Pro, the AirPods Max come with the Apple H1 chip in each earcup, which features no less than 10 audio cores to allow for Adaptive EQ, active noise cancellation, Transparency mode, and Spatial Audio.",
    "Released as part of iOS 14, the Spatial Audio feature first came to the AirPods Pro, and works for content in 5.1, 7.1 and Dolby Atmos, which positions sound all around you within a virtual sphere – this means that, for example, if you're watching a Dolby Atmos film that shows a plane flying overhead, it will sound as though the plane really is passing above you.",
    "Something that's unique to Spatial Audio is the fact that the AirPods Max are able to track your head movement using inbuilt accelerometers and gyroscopes, as well as the position of your iOS device; that means that as you move your head, the audio will always sound as though it's coming from the screen.",
    "To try it for yourself, you just need to find content that's available in the aforementioned surround formats – Apple TV Plus, Disney Plus and HBO Max all allow for Spatial Audio, though the likes of Netflix and Amazon Prime Video are yet to follow suit and add surround sound support for their iOS apps.",
    "Happily, it's possible for stereo content to be converted to Spatial Audio while using the AirPods Max or AirPods Pro by opening the headphones' settings on your device.",
    "We tested out the Spatial Audio feature on the AirPods Max with content from Apple TV Plus, and we have to say it's very effective. No, it's not as convincing as a true Dolby Atmos surround setup, but it does make movie-watching feel far more immersive – and it's a fantastic extra feature for those that watch a lot of TV shows and films on an iPhone or iPad.",
    "The noise cancellation provided by the Apple AirPods Max is very strong, and we'd say it's on par with the likes of the Sony WH-1000XM4 and the Bose Noise Cancelling Headphones 700.",
    "Each ear cup features three outward-facing microphones to detect environmental noise, while one microphone inside the ear cup monitors the sound reaching your ear.",
    "Apple says the AirPods Max use computational audio to continuously adapt their noise cancellation performance based on \"the headphone fit and movement in real time\". It certainly seemed effective when we tested them out in a range of situations.",
    "During a commute, most of the rumble from the train was blocked out, and with our music playing, we couldn't hear it at all. You truly get a sense of peace when using the AirPods Max in noisy environments, whether you're working in your kitchen with the washing machine roaring away in the background, or trying to steal a few moments of solitude on a busy journey.",
    "The Transparency mode is useful, too; you just need to press the noise cancellation button on the right earcup to allow environmental noise to pass through the headphones, allowing you to tap into your surroundings.",
    "It's certainly handy if you need to have a quick conversation with someone without having to stop your music, and it worked really well in our tests, making it feel as though you're not wearing headphones at all.",
    "Apple says the AirPods Max provide up to 20 hours of high-fidelity audio, talk time, or movie playback, which ordinarily wouldn't seem a huge amount; however, given that this is with Active Noise Cancellation enabled, it's a pretty respectable figure.",
    "The best over-ear headphones will usually hit around 30 hours of battery life, although many very good models only make it to around 20 – either way it's enough for a full day or two's use, depending on how wedded they'll be to your ears.",
    "The stated battery life seems about right to us, and we like the fact that the Smart Case puts the headphones into a low power mode; however, the inability to actually turn the AirPods Max off is puzzling. Still, having left them in the Smart Case overnight several times, we didn't notice a significant drop off in battery life.",
    "Connectivity comes courtesy of Bluetooth 5, and as such, pairing is fast and stable, and you shouldn't lose your connection as you move away from your source device (as long as you don't go further than 800 feet / 420 meters, or put several thick walls between the AirPods Max and your phone).",
    "Apple says the AirPods Max require Apple devices running iOS 14.3 or later, iPadOS 14.3 or later, macOS Big Sur 11.1 or later, watchOS 7.2 or later, or tvOS 14.3 or later – while they'll work with both Android and Windows devices, you won't be able to use Spatial Audio or Automatic Switching without one of the aforementioned Apple devices.",
    "The Automatic Switching feature means you can easily switch between iPhone, iPad and Mac when jumping between music listening and taking calls, while one-tap setup will mean you can get up and running with your new cans pretty swiftly. We found the setup to be incredibly easy using both an Android device and an iOS device, though iPhone users do benefit from the ability to toggle Spatial Audio and other control settings.",
    "You can also share audio between two sets of AirPods from pretty much any Apple source device – even the Apple TV 4K or the iPod Touch – so you and a friend can listen to the same music simultaneously.",
    "As ever, Apple has included support for its smart assistant Siri too, meaning you can use voice commands to play music, make phone calls, adjust the volume and get directions when you're on the move, among other things. Siri can also read your incoming messages, which is useful if you don't want to dig your phone out of your pocket, bag or wherever you may have left it.",
    "Since their release, Apple has brought a new feature to the AirPods Max: Conversation Boost. This feature dials up the volume of conversations happening in front of the user when you're in transparency mode. While anyone can benefit, it effectively allows people who are hearing impaired to better understand what people are saying in a conversation.",
    "Again, these features are limited to iOS devices, which means many of the things that set the AirPods Max apart from the competition won't be available to Android users."
  ],
  "headers": {
    "0": "Two-minute review",
    "20": "Apple AirPods Max price and release date",
    "24": "Design",
    "42": "Audio performance",
    "47": "Spatial audio",
    "53": "Noise cancellation",
    "59": "Battery life and connectivity",
    "69": "Don't buy them if..."
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Apple Digital Masters": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1267788561617745700&u=https%3A%2F%2Fwww.apple.com%2Fitunes%2Fmastered-for-itunes%2F",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "iPod Touch": "https://www.techradar.com/reviews/ipod-touch-7th-generation"
  }
}