{
  "source": "https://www.techradar.com/reviews/viofo-a139",
  "title": "Viofo A139 review",
  "category": "cameras",
  "updated": "2021-04-26T15:36:35Z",
  "author": "leon-poultney",
  "summary": "A triple-threat dash cam that misses the mark",
  "verdict": "Predominantly aimed at professional drivers who need to capture unruly behavior inside the car, the Viofo A139 offers plenty of tech for the money. That said, quality from the 1440p front camera isn’t as good as other Viofo models, the set-up process is fairly arduous, and the app is fiddly to navigate.",
  "pros": [
    "Excellent coverage",
    "External microphone support",
    "GPS enabled"
  ],
  "cons": [
    "2K footage lacks sharpness",
    "Voice recognition isn’t great"
  ],
  "article": [
    "We’ve already heaped much praise on Viofo. Despite being a relatively obscure name in the dash cam game, the company offers excellent bang for your buck in its 4K Viofo Pro Duo bundle, which features a surprisingly crisp full 4K resolution front camera and Full HD rear-facing unit.",
    "The A139 isn’t exactly this model’s successor, but instead an additional offering that includes another camera in the mix. The newcomer is an interior unit that monitors the cabin of the vehicle in Full HD, with the added benefit of six infrared LEDs to capture footage in even the lowest light.",
    "The downside to Viofo’s generosity is that the front-facing camera drops its resolution to 2K quality (2,560 x 1,440 pixels at either 30 or 60fps) and you lose the small color display that makes setting up and monitoring these things far easier.",
    "In this case, users first have to download the Viofo app (iOS and Android) and connect a smartphone via the camera’s onboard Wi-Fi. But first, you’ll have to flick to the back of the instruction book to find the default Wi-Fi code (it’s 12345678, in case you were wondering).",
    "The process is fiddly and the app isn’t the slickest. What’s more, the camera will beep at you incessantly if you don’t have a memory card installed. It also talks, telling you when the memory card is getting full or isn’t installed properly.",
    "Initial set-up is made even more arduous if you want all three cameras installed, since it will involve a fair amount of wire-routing and temporary car headliner removal to create an environment that doesn’t look like the spaghetti junction of trailed cables.",
    "Each unit is affixed to the glass via 3M adhesive patches, so it’s worth sketching out a vague plan before you start sticking – because, unlike sucker mounts, these aren’t the easiest to get off. You only really get one shot at it.",
    "Once installed, the camera works like most others on the market, continuously capturing and saving video footage to a memory card, before overwriting any unsaved incidents so you don’t have to continuously format the card.",
    "It can handle up to 256GB memory cards and it’s definitely worth investing in the larger storage space, since footage from three separate cameras soon takes up valuable room. Clips are saved automatically via a G-sensor, or motion sensing when the vehicle is parked, but you’ll need to hard-wire the camera into the vehicle’s power supply to allow the tech to work when the ignition is switched off.",
    "Otherwise, it’s possible to manually save clips via a button on the back of the main front-facing unit. Here, you’ll also find buttons to activate the Wi-Fi (necessary for smartphone pairing), manually start a recording, and a mic on/off switch should you not want conversations committed to the card.",
    "The video footage itself is pretty good, with the 140-degree front camera easily capturing everything out of the windscreen, while the wider 170-degree interior and rear cameras feel like the right field of view to snare the most action.",
    "Viofo uses Sony Starvis image sensors, which work well when capturing footage in low-light situations. However, note that the drop in resolution here does mean that some of the quality is lost in sub-par driving conditions. You’ll be able to punch into the footage using some video software, but distant details become fuzzy.",
    "It’s difficult to see who, outside of professional drivers, cabbies and Uber operatives, will require an internal camera, especially one that packs infrared technology. After all, how many family quarrels do you need to settle with video evidence?",
    "Regardless, the tech works well and the built-in microphone does a good job of capturing audio, although it does sound tinny on playback. The camera does feature an external microphone input if clarity is an issue.",
    "However, with an RRP of around £220 ($270 / AU$350) the Viofo A139 competes with a lot of fantastic cameras on our best dash cams list, while the company’s own A129 4K dual dash cam setup comes in at the same price. Unless you absolutely need the interior footage, the higher-resolution A129 (with rear screen) is the better buy."
  ],
  "headers": {
    "15": "Don’t buy it if…"
  },
  "links": {
    "best dash cams": "https://www.techradar.com/best/best-dash-cam"
  }
}