{
  "source": "https://www.techradar.com/reviews/netgear-nighthawk-mr5200-5g-wifi-6-portable-mobile-hotspot-router",
  "title": "Netgear Nighthawk MR5200 5G WiFi 6 portable mobile hotspot router review",
  "category": "computing",
  "updated": "2021-04-29T18:41:55Z",
  "author": "desire-athow",
  "summary": "A true, landline replacement wireless option but at a very steep price",
  "verdict": "The Netgear Nighthawk MR5200 5G WiFi 6 portable router is the fastest mobile hotspot money can buy, delivering the sort of speed that most broadband landline users can only dream of. It is simple to operate and supports dozens of simultaneous connections.",
  "pros": [
    "Simple to operate",
    "Fastest mobile hotspot on the market",
    "Very well built",
    "Three ways of connecting"
  ],
  "cons": [
    "Very expensive",
    "No support for multiple SIM",
    "No support for onboard storage.",
    "No LAN cable bundled",
    "Rather large power adaptor"
  ],
  "article": [
    "Today, we’re looking at one of Netgear’s most expensive - if not the most expensive - routers.",
    "No, it is not a souped-up, top of the range gaming router nor a ridiculously complex, mindboggingly plain enterprise router. Instead, it is a puck-sized, handheld portable router (that doubles as a mobile hotspot) called the Nighthawk MR5200 (or M5 depending how you search for it), a device that promises wireless freedom infused with WiFi 6 and a big dollop of 5G greatness.",
    "Is the portable Netgear Nighthawk MR5200 one of the best Wi-Fi 6 routers?",
    "As we alluded to in the opening paragraph, the MR5200 is not exactly what you’d call cheap. At £799 at Amazon UK, it costs MORE than buying a Huawei-powered 5G hub from Three (the network) AND the accompanying 24-month unlimited 5G plan (about £100 extra). In the US, it can be purchased directly from Netgear for under $700 excluding sales taxes. Note that there’s an AT&T exclusive version, the MR5100, called the Netgear Nighthawk 5G Mobile Hotspot Pro which sells for a mere $510. Easy to be confused!",
    "The MR5200 is similar in shape and size to its predecessor, the Nighthawk M1 (AKA MR1100). It is a square device with rounded corners, with a fair amount of glossy plastic on top, ridged sides and a soft rubber plate on the bottom that can be removed. Do that and you’ll find a 5.04Ah battery, login details and a single SIM slot.",
    "A small 2.5-inch color touchscreen display provides a neat way of interacting with the MR5200 with three buttons (power, home and back) ensuring that navigating through the different options is as intuitive as possible.",
    "On one of the sides are two flaps that allow the end user to connect an optional external antenna, a Gigabit Ethernet port and a Type-C connector that offers USB 3.2 Gen 2 speeds (i.e. 10Gbps maximum). The latter can be used both for data AND for charging. Speaking of which, Netgear bundles a fairly chunky charger that either delivers 10W (5V2A) or 16.2W (9V1.8A).",
    "The power supply unit weighs about a third of the MR5200 proper (83g vs 243g). The unit provided to us came with a 2-pin adaptor for European countries but no Ethernet cable, which is a bit of a letdown given the price of the product and its universal reach.",
    "The Nighthawk M5 is the first (and only) mobile router to feature Qualcomm’s latest Snapdragon X55 mobile platform. In a nutshell, it supports (as per the marketing literature) 5G NR Sub 6 GHz (NSA), LTE CAT 22, LTE Advanced, 4x4 MIMO, 256QAM plus all the latest 802.11ax technology (AKA WiFi 6).",
    "We tested the device using an unlimited 5G data SIM from Three. As always, your mileage will vary and results may not apply to you given the large amount of variables involved - including the number of devices you connect to it (up to 32).",
    "Using the popular - and usually reliable - Fast.com speed testing website, we achieved speeds of up to 570Mbps using the Blackview BL6000 Pro which uses a Mediatek Dimensity 800 chipset - as a baseline. The slowest of the 20 or so quickfire readings we took - sitting next to a window, on the first floor of our dwelling - was 240Mbps.",
    "Next we connected our test laptop, a Dell Latitude with an Intel Wireless-AC 8265 radio chipset to the MR5200 loaded with the 5G SIM. With the hotspot sitting next to it, we scored speeds that ranged between 360 and 510Mbps. We achieved similar results using the LAN port and the USB connector; in both instances, we used decent cables as we saw very significant speed drops (LAN) or no connection at all (USB) when using the wrong type.",
    "The highest speed we reached was by connecting the device to a Thunderbolt 3 port which is essentially a supercharged USB Type-C connector. We saw speeds of up to 670Mbps with the slowest recorded number higher than 500Mbps. Note that these speeds were achieved during a weekend before noon, in an area where Three says 5G speeds should be average (i.e. coverage outside, rather than inside and outside).",
    "The on-device offers a subset of the features of what the web backend offers. The latter offers extra security features such as having a SIM PIN, port forwarding and filtering, website filtering or parental controls (see the screenshot below). There’s also a nifty mobile app that allows you to control the essential features of the MR5200 but there are no advanced features like dynamic DNS or VPN.",
    "Note that a quick look online shows that the M5 may have had issues with its firmware upgrade as recently as February 2021. We managed to update the firmware to the latest version dated late November 2020 without encountering any loss in Wi-Fi connectivity.",
    "The Netgear Nighthawk doesn’t have any competition at the time of writing that we know of. Feel free to prove us wrong and we’ll happily amend this paragraph. One could argue that a smartphone with WiFi 6 and USB Type C 3.2 Gen 2 (e.g. Samsung Galaxy S20 FE) could provide a much cheaper and far more versatile alternative. We have yet to try that route but USB Type-C seems to be the best way to eek out the most of the MR5200 while charging it.",
    "It is important to understand that the audience it seeks to service is primarily mobile professionals or very niche use cases that validate the need for wireless ultra high speeds.",
    "So where does that leave us? If you need ultra fast broadband speed on the move, know you can get excellent 5G coverage and price is not an issue, then by all means, purchase it. The MR5200 is expensive but it is also the best 5G hotspot money can buy right now. You will need to do your homework first though; check 5G coverage in the area(s) where the hotspot will be deployed.",
    "Improvements? We’d love to see extra features, a drop in price, support for multiple SIMs (or at least the ability to swap SIMs easily, without resorting to removing the battery), support for microSD cards to transform it into a mini NAS, a smaller power adaptor and a LAN cable."
  ],
  "headers": {
    "3": "Availability and pricing",
    "4": "Design",
    "8": "In use",
    "15": "Final verdict"
  },
  "links": {
    "routers": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523",
    "mobile hotspot": "https://www.techradar.com/news/best-mobile-hotspots-for-3g-4g-and-5g",
    "WiFi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Wi-Fi 6 routers": "https://www.techradar.com/news/wi-fi-6-routers-the-best-wi-fi-6-routers-you-can-buy-in-2019",
    "£799 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FNETGEAR-Nighthawk-Mobile-Router-MR5200%2Fdp%2FB08HWRYVH5%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1002039034415082900-21",
    "24-month unlimited 5G plan": "http://www.three.co.uk/Huawei/5G-Hub/hbbPlans?bundle=HBBDevice&manufacturer=&ID=1683&ty=aff&aff_id=3713&link_id=lc&link_ref=trd-us-6020738318543962000",
    "Netgear for under $700 excluding sales taxes": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1235524683078625800&xs=1&url=https%3A%2F%2Fwww.netgear.com%2Fhome%2Fmobile-wifi%2Fhotspots%2Fmr5200%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnetgear-nighthawk-mr5200-5g-wifi-6-portable-mobile-hotspot-router",
    "Netgear Nighthawk 5G Mobile Hotspot Pro": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4463178160423153700/https://www.att.com/buy/connected-devices-and-more/nighthawk-5g-mobile-hotspot-pro-black.html",
    "unlimited 5G data SIM": "https://www.techradar.com/deals/5g-sim-only-plans-deals",
    "Blackview BL6000 Pro": "https://www.techradar.com/reviews/blackview-bl6000-pro-5g-rugged-smartphone",
    "port forwarding": "https://www.techradar.com/how-to/how-to-port-forward",
    "dynamic DNS": "https://www.techradar.com/news/best-dns-server",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "microSD cards": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards",
    "NAS": "https://www.techradar.com/news/the-10-best-nas-devices-reviewed"
  }
}