{
  "source": "https://www.techradar.com/reviews/tenon",
  "title": "Tenon review",
  "category": "computing",
  "updated": "2021-07-03T21:00:10Z",
  "author": "jonas-p-demuro",
  "summary": "Accessibility for all",
  "verdict": "Tenon offers a comprehensive approach to bringing your website up in accessibility standards, and we highlight the upfront pricing, the support options, and the free trial. Some concerns remain though, such as the missing user reviews, and that its own site has issues when tested with the Tenon tools.",
  "pros": [
    "Free trial",
    "Free tier",
    "Upfront pricing",
    "Support videos",
    "Good options for support"
  ],
  "cons": [
    "Lack of user reviews",
    "Tenon site with potential issues"
  ],
  "article": [
    "Back in 2012, Tenon was born out of the goal of increasing accessibility for all, via an API-centered tool. Since then, Tenon became the first SaaS product for web accessibility, and the first “API first” product in this increasingly important space. Tenon also has a number of additional firsts, for example, the first to have a plugin for Microsoft’s Visual Studio, the first to have a web accessibility plugin for WordPress, and the first to be able to generate reports in the xUnit format. It also proudly states that it was created out of a community of users 11,500 strong.",
    "They even put their money where their mouth is, as it states on their website “Found an accessibility issue on this site? Let us know.” Among the notable Tenon clients are Mastercard, Bed, Bath & Beyond, and Delta Airlines.",
    "Tenon can integrate its API into the pipeline for development, and can be used with IDE’s, Jira, Git, Grunt and others. A range of issues get identified to become compliant with WCAG 2.0, 2.1 and Section 508. With Tenon Enterprise, there is added level of privacy and security via a private cloud, or the option of running it on-premise.",
    "Tenon can “Fix accessibility fast,” by first doing a website audit. With this done, and the problems identified, next their team can prioritize efforts to the highest trafficked content, to bring things up to standards quickly. Tenon can also work with your developers to identify core system UI patterns, and then test and adapt these to increase the web accessibility.",
    "Tenon also offers training to make your content more accessible.",
    "Of note, Tenon does offer an easy way for a user to get started, with true minimum effort, via its “Test your website” function located conveniently on the homepage. We decided to put the Tenon page into the bar, and in a few secs, 40 total issues were identified, with 15 errors and 25 warnings. When we click on the “View detailed results” it comes up that none of the potential issues get detailed, but rather an invitation to register for a free trial to unlock the results.",
    "We did some Googling, and did not come up with any user reviews of the Tenon service. We also could not find any reviews on the social media pages we checked for Tenon, that include Twitter, LinkedIn and GitHub.",
    "The pricing for Tenon is described as freemium, as there is a free tier to get introduced to the service, and which may be enough for some smaller and budget strapped users. There is also a choice of plans in a tiered structure, with a free trial available.",
    "At the bottom is a free tier, and it totally says as a feature that it is “Free forever,” so this is no bait and switch tactic. The downside is that the support is minimal, but this is still a generous offering from Tenon.",
    "The next tier up is the “Pay along” level, which has a $5 monthly fee, and then cost $0.02 per each API call. You can also set a maximum monthly spend to keep this service on a targeted budget.",
    "The next up is the “Small” tier, which for $90/month, offers 3,000 API calls monthly. There are higher tiered plans also, including “Medium” which provides 15,000 API calls monthly for $450 monthly, and “Large” for $750 per month that covers 30,000 API calls. These two highest plans also have the benefit of free training. There is also a discount offered on any of these plans paid annually, along with the possibility of a custom plan for even larger users that need an Enterprise plan with a cost as low as $0.01 per each API call.",
    "It is also indicated that there are discounts available for non-profits, such as educational institutions.",
    "Getting in touch with Tenon has limited options, although the essentials are covered. This starts with phone contact, which is a direct number, but it is not toll free, and limited to only business hours of 9:00 AM to 5:30 PM. There is also an email address, with separate ones for sales and for support. There is no chat, but there is an online portal for contact. It is also stated that there is no guarantee of support for free users, which is pretty reasonable. Also, there is no support for third party products, or experimental code that Tenon releases to the community for development purposes, which again makes sense.",
    "We did find a chat function which can be quite convenient, but did not locate any whitepapers or eBooks. However, there is a whole page of educational video content, for example “How to view and understand your test history.” Overall, Tenon has more support options than most.",
    "Tenon has a well done service to remedy web accessibility on your digital content. We like the positives such as the pricing that is more transparent than most, the support options, the free tier and free trial, and the high quality support videos that cover a wide range of topics. We also criticize the complete lack of user reviews that we found, and that Tenon’s website has multiple potential accessibility issues when tested via this company’s own tool. We conclude that Tenon is certainly worth a look, and that the available options allow a full test drive for no cost to make a decision for your company."
  ],
  "headers": {
    "2": "Services",
    "6": "User reviews",
    "7": "Pricing",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "Tenon": "https://tenon.io/",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "free tier": "https://tenon.io/pricing.php",
    "Pay along": "https://tenon.io/pricing.php",
    "Small": "https://tenon.io/pricing.php",
    "Medium": "https://tenon.io/pricing.php",
    "Large": "https://tenon.io/pricing.php"
  }
}