{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
  "title": "Samsung Galaxy Buds Pro review",
  "category": "audio-visual",
  "updated": "2021-12-08T21:39:49Z",
  "author": "nick-pino",
  "summary": "Samsung Galaxy Buds Pro are a great choice if you have a Samsung phone, but not the peak of perfection",
  "verdict": "The new Samsung Galaxy Buds Pro are a huge step up from the Samsung Galaxy Buds Live, offering better sound and microphone quality with multipoint pairing and spatial audio support. They don’t offer the same level of noise cancellation as over-ear headphones or the sound quality of high-end earbuds, but for their price they offer just enough of both to be competitive.",
  "pros": [
    "IPX7 waterproof",
    "Basic noise cancellation",
    "Simple touch controls"
  ],
  "cons": [
    "Flat, cramped sound",
    "No Google Assistant / Siri support",
    "Bulge out of the ear"
  ],
  "article": [
    "Think of the Samsung Galaxy Buds Pro as the Apple AirPods Pro equivalent for the new Samsung Galaxy S21 series of phones. Although that doesn’t quite cover everything these true wireless earbuds can do.",
    "Yes, both the AirPods Pro and Galaxy Buds Pro earbuds do offer active noise cancellation. And they both have some form of spatial audio support that can make TV shows and movies sound even more immersive. They also both have five hours of battery life before they need to be recharged.",
    "But the Samsung Galaxy Buds Pro offer more and go beyond these key features for people who own a Samsung phone and tablet. For them, these earbuds are the missing puzzle piece that ties everything in Samsung’s ecosystem together.",
    "That said, however, the Galaxy Buds Pro aren't Samsung's latest (or greatest) anymore: the Samsung Galaxy Buds 2 feature a number of improvements over the Buds Pro, including overall better sound and slightly improved active noise cancellation, too. They're also a good deal cheaper than the Galaxy Buds Pro, which does make the Galaxy Buds 2 Samsung's best pair of earbuds yet.",
    "But like the more recently released Samsung Galaxy Buds 2, the Galaxy Buds Pro are specially built to cater to people who already have a Samsung phone. That’s because they offer multipoint pairing, hands-free Bixby support (but not Google Assistant) and the Samsung Galaxy Wearable app – this is only available on Android that you’ll need to use to unlock the Buds’ best features.",
    "The Galaxy Buds Pro also use Samsung’s proprietary Scalable Audio. This supports UHQ audio streaming over Bluetooth at up to 24-bit / 96kHz, SmartThings Finder and multi-mic recording, which allows you to use the Buds as a lapel mic stand-in when you shoot videos on your Samsung phone.",
    "Ultimately, if you’re looking for full-featured wireless earbuds that sound good, fit well and are going to work well with your Samsung smartphone – and don’t mind spending a bit more money on them than, say, for the Samsung Galaxy Buds Live – the Buds Pro are a great option. If that’s not you, they’re still worth recommending to your friends and family who absolutely love their Samsung smartphones.",
    "The Samsung Galaxy Buds Pro launched alongside the Samsung Galaxy S21 smartphone on January 14, 2021 (the day it was announced at Samsung Unpacked) on Samsung's website and became widely available starting on January 15, 2021.",
    "In terms of price, the Galaxy Buds Pro will set you back $199 / £219 / AU$349. That's pricey, but it makes sense that they'd cost a little more than their predecessors, the Samsung Galaxy Buds Live, which cost $169.99 / £179 / AU$319 at launch. Considering how much better these are, they’re well worth the upgrade.",
    "Of course, Samsung’s putting us in a weird position releasing these true wireless earbuds so close together – the Samsung Galaxy Buds Pro's release date comes just five short months after the South Korean company launched the Samsung Galaxy Buds Live, and less than a year after the launch of the Samsung Galaxy Buds Plus. It’s unclear why Samsung is in such a rush to get these out the door, but it’s causing a bit of a traffic jam.",
    "That said, if you’re looking for cheaper alternatives, you don’t have to look far: the Sony WF-SP800N and Jabra Elite 75t both offer active noise cancellation for $50 less if you don’t mind skipping out on the Samsung-specific features, and there are more new arrivals (like the Anker Soundcore Liberty 2 Pro and Philips Audio T8505) coming everyday.",
    "The Samsung Galaxy Buds Pro are available in three colors: Phantom Black, Phantom Silver and Phantom Violet to match the new Samsung Galaxy S21, and the color of the Buds will match the color of the charging case that comes along with them.",
    "Speaking of the case, it’s sort of shaped like a little treasure chest – there’s a concave lid that unhinges in the middle and flips up. It’s fairly compact, which is nice when you want to slip it into your pocket, and has a status LED on both the inside and outside of the case that turns green, yellow, and red depending on how much battery is left in the case itself.",
    "As for the Buds themselves, they’re a far cry from their bean-shaped predecessors. The Samsung Galaxy Buds Pro are back to their usual form as eartip-equipped funnels of sound.",
    "Funnel is probably the appropriate word to describe them as they’re fairly long for earbuds, measuring in at just under an inch (20.8mm) long. The Buds need all that real estate however for their bevy of sensors, pogo pins, and microphones.",
    "The outside of the Buds have a glossy, reflective plastic coating that is touch-capacitive and two more microphones with a wind guard that reduces ambient noise when walking outside. All of that houses the 11mm woofer and 6.5mm tweeter that we’ll talk about more in the performance section down below.",
    "So how do they fit? Well, despite their almost futuristic appearance, the way the earbuds jut out of your ear makes them look bulky and awkward. Wearing them to bed would be uncomfortable at best, and painful at worst. And because they lack a way to actually ‘lock’ them into your ear, they do shift periodically, which means you’ll have to readjust them or else the seal will weaken and noise cancellation will slowly diminish as you wear them.",
    "To help alleviate some of these issues, inside the box are two additional sets of eartips to help you get a better seal, which are absolutely essential. You’ll also find a USB-C charging cable without a head – part of Samsung’s move to reduce waste (yay!) and a potential hurdle to folks just picking up their first earbuds (boo).",
    "Learning to control them isn’t hard, and can be mastered quickly: the default controls include a single touch to play/pause your music; a double touch plays the next song or answers/ends a call; a triple touch plays the previous track; and a touch and hold activates your preset feature, which by default switches between ambient and noise cancellation modes.",
    "That last command can be customized, but you’ll need the Samsung Wearable app to do so.",
    "Overall, they’re surprisingly comfortable to wear for extended periods of time and don’t suffer from pressure build up thanks to the external vent, but because of the way they jut out of your ear, they aren’t the most attractive-looking earbuds or very comfortable to wear in bed.",
    "The two big marquee features of the Samsung Galaxy Buds Pro are its active noise cancellation and IPX7 waterproofing, the highest rating so far for Samsung earbuds.",
    "Up to this point, Samsung’s earbuds have only been IPX2 or IPX4 water-resistant. That meant that they were good for a few drops of rain or a bit of sweat, but they weren’t the kind of things you’d want to have around you during intense workouts.",
    "With IPX7 certification, the Samsung Galaxy Buds Pro are protected against fresh water immersion for 30 minutes at a depth of up to one meter - i.e. if they fall into the bathtub for a minute or you want to clean them under some running water you won’t have to worry about them. It’s a big step up for Samsung, and rivals the highest standards of other earbuds.",
    "So how good is that noise cancellation? Well, it’s good… for Samsung. The three built-in microphones definitely help the Galaxy Buds Pro do a better job of keeping out noise than the Galaxy Buds Live, but they’re not better at noise cancellation than, say, the Sony WF-1000XM4 or most flagship over-ear headphones with ANC.",
    "Just wearing them around the house for a few days, the Samsung Galaxy Buds Pro were able to drastically reduce the sounds of loud air purifiers and humidifiers, but didn’t stand a chance when someone else in the house was playing music. They’re good enough that you won’t be able to hear nearby conversations in another room, but anything louder than someone speaking will be audible through the ANC.",
    "The flip side of active noise cancellation is audio amplification – also known as audio passthrough – that can be accessed by pressing and holding the touch capacitive panel. The Galaxy Buds Pro can take outside audio and pipe it into your ears, amplifying sound by as much as 20db, making them convenient to wear in airplane terminals while waiting for your flight to be called over the PA system or at the deli counter.",
    "The Samsung Galaxy Buds Pro also has a few Samsung-specific features worth calling attention to - there’s a hands-free Bixby mode, which works exactly like you’d expect, and a Find My Earbuds feature powered by SmartThings Find.",
    "SmartThings Find, located inside the SmartThings app, can show you a map of where your devices are, even when they’re offline and disconnected from Bluetooth. That should give you peace of mind should they ever get stolen and, at the very least, help you track them down if you can’t remember where you left them.",
    "Last but not least, if you have multiple Galaxy products, you can switch devices seamlessly with the Buds Pro thanks to an Auto Switch feature. Say, for example, you listen to music via your Galaxy Tab S7 Plus and receive calls via your Samsung Galaxy S20 – Auto Switch, means the earphones can be used automatically for the phone call, and connect themselves back to the tablet after the call. It’s a bit of a niche feature, but it’s nice all the same.",
    "The Samsung Galaxy Buds aren’t designed exclusively by Samsung – audio manufacturer AKG, a subsidiary of Harman (which is, in fact, a subsidiary of Samsung) – also helped tune these headphones to get the EQ just right.",
    "So how did they do?",
    "Well, the Buds Pro do have balanced sound quality that doesn’t skew too sibilant in the trebles or too bloated in the bass, which we really like, but they are missing some clarity in the mids and highs, and have a smaller, isolated soundstage. The flat sound is really centered and not nearly as rich as we’d like it to be.",
    "In plain language it means that you’ll be able to hear both the smooth bass lines in a song like Hotel California by The Eagles as well as the hi-hats, but the sounds will only have left-right directionality. The result is a workman-like representation of the audio that pleases, but doesn’t quite wow you like some higher-end earbuds would.",
    "Thankfully, if you’re the kind of person who likes to tweak the EQ of your Buds, the Samsung Wearable app does allow you to go in and tweak the sound however you like (we actually quite liked the Dynamic setting) but none of them offer a wider, fuller soundstage. That said, that could change when Samsung introduces 360 Audio support later this year, which it says will bring “theater-like, multichannel sound” to the buds – but that feature wasn’t available to us during our testing process.",
    "For now, you’re stuck with simple stereo sound.",
    "Worse, if you’re not using a Samsung Galaxy device, the sound will be transmitted over SBC or AAC, both of which are lossy codecs. That means there’s a marked difference using them with Samsung’s Scalable Codec devices – like say the Samsung Galaxy Note 20 Ultra 5G – and a device that uses SBC, like the Google Pixel 3.",
    "While that is another advantage the headphones have for Samsung smartphone owners, it really puts the earbuds in a bind when it comes to other platforms. Had Samsung also licensed aptX HD from Qualcomm or utilized the newer Bluetooth LE codec, you’d have more widespread HD support, but we suppose some UHQ audio support is better than none.",
    "When talking to friends and family, they said we sounded fine while using the Samsung Galaxy Buds Pro, though they thought we sounded a bit clearer using our smartphone’s built-in microphone instead. That’s not a knock against the Samsung Galaxy Buds Pro – as most earbuds don’t sound as good as a smartphone’s microphone – but it does mean you should be slightly cautious of buying these exclusively for taking phone calls.",
    "The Samsung Galaxy Buds Pro’s battery life is good for active noise-cancelling earbuds, but a real step down from the Samsung Galaxy Buds Plus that offered 11 hours of playback time on a single charge. Still, you’re getting ANC here and Bixby, and they’re both power hogs.",
    "Samsung promises five hours of listening pleasure on one cycle, after which the charging case can provide an additional 13 hours if you have ANC turned on. If you turn it off the buds will last seven to eight hours, and you can get upwards of 20 hours of battery from the case.",
    "In real-world testing, we found that the Samsung Galaxy Buds Pro lasted about three days of constant use (more than five hours of listening a day) or a bit less than a week when we were only listening to them in our free time (three-ish hours a day).",
    "If you ever find yourself without juice, the Galaxy Buds Pro supports fast charging and within five minutes on the charger there should be enough battery available for one hour of playback. Fast charging takes place via the USB-C port, but wireless charging is also possible, although it’s a bit slower.",
    "So how does this stack up against other earbuds? It’s fairly competitive. The Sony WF-SP800N we mentioned earlier provides about nine hours of battery life via the earbuds and has another nine in the case, while the Jabra Elite 75t are good for eight hours of playback with 20 more hours of charge inside the case. It’s a close race with no clear winners.",
    "Both Jarno Stinissen and John McCann contributed to this review."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "11": "Design",
    "21": "Features",
    "30": "Audio performance",
    "39": "Battery life",
    "44": "Don't buy them if..."
  },
  "links": {
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Sony WF-SP800N": "https://www.techradar.com/reviews/sony-wf-sp800n",
    "Jabra Elite 75t": "https://www.techradar.com/reviews/jabra-elite-75t",
    "Anker Soundcore Liberty 2 Pro": "https://www.techradar.com/news/this-new-airpods-pro-rival-offers-noise-cancellation-and-wireless-charging-at-half-the-cost",
    "Philips Audio T8505": "https://www.techradar.com/news/philips-unveils-new-noise-cancelling-headphones-including-airpods-pro-rivaling-earbuds",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy Note 20 Ultra 5G": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review"
  }
}