{
  "source": "https://www.techradar.com/reviews/branch-standing-desk",
  "title": "Branch Standing Desk review",
  "category": "computing",
  "updated": "2021-08-31T15:30:35.787Z",
  "author": "anthony-spadafora",
  "summary": "A premium electric standing desk with a quiet lift mechanism",
  "verdict": "Branch’s Standing Desk sets itself apart from the competition with its premium look, feel and build quality. Although the assembly process could be simpler, once the desk is built and set up, it will likely turn heads while also blending in nicely with your home workspace or office.",
  "pros": [
    "Quiet dual motors",
    "Supports up to 275lb (124kg)",
    "Brushed grommet for routing cables",
    "White glove installation available"
  ],
  "cons": [
    "Tools required",
    "Assembly is a bit complicated",
    "Legs only come in one color",
    "No cable management tray available yet"
  ],
  "article": [
    "Working in a seated position all day long has been proven to have negative effects on your health which is why more office workers and even those working from home have decided to upgrade their workspaces with a standing desk. With an electric standing desk, you can easily move from sitting down to a standing position with just the push of a button.",
    "After working in the commercial real estate industry for years and furnishing dozens of offices, Greg Hayes set out to simplify the process of purchasing high quality office furniture by starting his own direct-to-enterprise office furniture company originally called Bureau in 2018 that was later renamed to Branch. While the original iteration of the company grew rapidly and succeeded in completing installations across the US and Canada, enterprise office furniture sales began to dry up at the beginning of the pandemic. For this reason, Branch made the shift to becoming a direct-to-consumer business and these efforts have paid off well for the company as its consumer business is now larger than its enterprise business previously was.",
    "While Branch continues to make a number of high-end desks for offices and enterprise businesses, the company launched its Standing Desk in 2019. Unlike other standing desks that you’ll need to research extensively before buying, if you’re located in New York City or planning a trip there, you can actually go look at Branch’s Standing Desk in person as the company’s flagship showroom is located just two blocks away from Penn Station. However, you will need to book your visit first as Branch isn’t accepting drop-ins at this time.",
    "In this review, we’ll be taking a closer look at the packaging, assembly process, ease of use and the features offered in Branch’s Standing Desk to help you decide whether it’s the right fit for your office or home workspace.",
    "Branch’s Standing Desk is available on the company’s website in two configurations. The smaller Team Plus version costs $699 while the larger Executive version costs $799. Despite the fact that the desktop can weigh anywhere between 43lb (19kg) and 51lb (23kg) depending on which version you choose and the base weighs 73lb (33kg), Branch offers free shipping on most home office orders within the continental US. The company’s desks typically arrive within 1-5 business days if they are currently in stock.",
    "Regardless of whether you choose the Team Plus or Executive configuration, both desks feature a depth of 30 inches and have a minimum height of 25 inches and a maximum height of 52 inches. However, while the Team Plus version of the desk has a width of 48 inches, the Executive version of the desk has a width of 60 inches. One of the things that sets Branch’s Standing Desk apart from the competition is the fact that it has a lift capacity of 275lb (124kg).",
    "Branch’s Standing Desk features a modern design with an impact resistant melamine top that’s available in woodgrain, white or walnut. While you can pick the color of the desktop, the desk’s legs are only available in white. Still though, the white legs give the desk a premium feel especially when paired with the white top.",
    "Each leg contains a low-decibel EasyGlide motor, three-stage lift columns for a smooth, stable raise and tapered, adjustable feet. Both legs slot into the desk’s frame and brackets on either side of the frame are used to attach the desktop to the base of the desk.",
    "Mounted between the frame and the brushed grommet used for running cables on the underside of the desk is a control box which both legs plug into as well as the power cable and keypad.",
    "The keypad used to raise and lower the desk as well as for storing your sitting and standing preferences is mounted on the right side of the desk. While there aren’t any pre-drilled holes on the left side of the desk, you can mount the keypad to that side as well as the cord, which needs to be plugged into the control box, is quite long.",
    "Branch provides a number of cable ties as well as some adhesive-backed zip tie mounts to help you tidy up the cables running from both legs as well as from the keypad.",
    "Branch’s Standing Desk arrived in two boxes with one containing the Standing Desk Base and the other containing the desktop.",
    "You also receive an instruction manual, a bag with all of the screws, an Allen wrench and five cable clips.",
    "To begin assembling the desk, you first need to adjust the two bars in the middle of the frame to line up with two pre-drilled holes at the center of the desk. The reason for this is that both the Team Plus and Executive configurations of Branch’s Standing Desk use the same base. From here you slot in both Lifting Columns and connect them to the frame and then attach the feet to the Lifting Columns.",
    "After flipping over the frame, you need to attach the two brackets to either side before flipping it over again and attaching it to the desktop using a Philips head screwdriver.",
    "Once this is complete, you need to attach the control box between the frame and the brushed grommet. The cords from both Lifting Columns need to be plugged into the control box along with the cord from the keypad that is secured to the right side of the desk at the front. You will then need a friend or co-worker to help you flip the desk over one last time.",
    "To finish setting up Branch's Standing Desk, you need to plug it in and hold the up and down buttons at the same time. The desk will lower itself all the way down and you’ll hear a slight beep followed by a brief flash on the display. After pressing the up button once to engage the motors, your desk should be activated and ready to go.",
    "After we finished assembling Branch’s Standing Desk, we did our first round of testing using a Chromebook from Samsung. The desk itself was very sturdy and we found its lifting mechanism to be both quick as well as quiet. You can also save up to four different height configurations to the keypad using the 1-4 buttons. To save a configuration, simply adjust the desk to the height you want it at, press and hold the “M” button until the display flashes and then press the number key you want to assign it to.",
    "Branch also offers an In-Desk Power accessory for its standing desk which consists of a wire box that holds a power strip with two USB ports for $160. While having a power strip attached to your standing desk is highly recommended especially if you want to use a desktop PC and a monitor instead of a laptop, the design of branch’s In-Desk Power accessory makes it difficult to plug in devices with larger power bricks. Although you can plug in a larger power adapter you won’t be able to close the top door of the brushed grommet when charging your laptop.",
    "For this reason, we decided to mount one of Ikea’s SIGNUM cable management systems to the underside of the desk instead. This allowed us to have a power strip under the desk with enough room that we could plug in all of our adapters and use the brushed grommet to run our cables. However, a Branch spokesperson did explain to us that the company plans to release a cable tray early next year and this should make it much easier to keep all of your cables as well as a power strip neatly tucked away under its standing desk.",
    "During our second round of testing, we used Branch’s Standing Desk with a MacBook Pro though we also had an iPad as well as a desk lamp, a laminator and an HP Tango X printer on top of the desk. Even though we opted for the smaller Team Plus configuration of the desk, there was still plenty of room for all of our devices.",
    "The premium look and feel of Branch’s Standing Desk really impressed us as well as how quickly it could make the transition from sitting to standing height with just the push of a button.",
    "As Branch’s Standing Desk is available for either $699 or $799 depending on the size of the desktop you choose, we’ll be looking at similarly priced electric standing desks that offer similar features.",
    "Vari’s Electric Standing Desk is available in multiple configurations to suit the size of your workspace starting at $595 and going up to $795. The company also offers an extra wide desk with a width of 72 inches and its desktop is available in five finishes as opposed to just three. Vari’s Cable Management Tray is also significantly cheaper than Branch’s In-Desk Power at only $50. If you plan on using multiple monitors with a workstation, Branch’s Standing Desk is the better choice as its desk supports up to 275lb while Vari’s Electric Standing Desk supports from 180lb to 220lb depending on which configuration you choose.",
    "If you really want to customize your desk to suit the look and feel of your workspace, the Uplift Standing Desk V2, which costs $599 for its base configuration, could be a good choice as Uplift Desk offers 24 different desktop styles to choose from, five desktop sizes, frames in four colors and multiple keypads in a variety of styles and even colors. The company also offers free shipping within the continental US. Surprisingly, the Uplift Standing Desk V2 is capable of lifting up to 355lb (161kg). Uplift Desk also offers a number of accessories for its desk that mount to its frame including a PC mount, a power strip, desk extensions and even a hammock for your feet.",
    "Branch’s Standing Desk is a testament to just how well the company was able to transition from a direct-to-enterprise to a direct-to-consumer model. While its standing desk can easily be shipped to your home for you to assemble yourself, the company also offers White Glove Installation, which includes, delivery, assembly and cleanup for an additional fee, in major cities across the US including Atlanta, Austin, Boston, Chicago, Houston, New York City, Los Angeles, Philadelphia, Seattle, Washington DC and others.",
    "Although Branch’s In-Desk Power accessory is a bit on the expensive side and makes it difficult to hide large power adapters from view, the company is working on a cable tray for its standing desk that is expected to be released early next year. This new accessory will likely fix some of the cable management concerns we had when setting up our standing desk.",
    "If you’re looking for a new desk with a premium look and feel that can be used in a sitting or standing position and don’t want to break the bank, you’ll be hard pressed to find a better option than Branch’s Standing Desk. Also as the company has a worry-free return policy, you can send your desk back to Branch for a refund within 30 days of purchase but you will need to hold onto the original packaging to do so."
  ],
  "headers": {
    "4": "Pricing and availability",
    "5": "Design",
    "11": "Setup",
    "17": "In use",
    "22": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "standing desk": "https://www.techradar.com/news/best-standing-desk",
    "Branch": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7118129161230109000/https://www.branchfurniture.com/",
    "book your visit": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1026683944203721700/https://www.branchfurniture.com/pages/showroom-nyc",
    "Standing Desk": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6989373121416529000/https://www.branchfurniture.com/products/standing-desk",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "In-Desk Power": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8208481879529254000/https://www.branchfurniture.com/products/in-desk-power",
    "desktop PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "SIGNUM": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7985910213403384000&xs=1&url=https%3A%2F%2Fwww.ikea.com%2Fus%2Fen%2Fp%2Fsignum-cable-management-horizontal-silver-color-30200253%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbranch-standing-desk",
    "MacBook Pro": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "HP Tango X": "https://www.techradar.com/reviews/hp-tango-x",
    "Electric Standing Desk": "https://www.techradar.com/reviews/vari-electric-standing-desk",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "Uplift Standing Desk V2": "https://www.upliftdesk.com/uplift-v2-standing-desk-v2-or-v2-commercial/",
    "White Glove Installation": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3494713282542690000/https://www.branchfurniture.com/pages/shipping-and-assembly"
  }
}