{
  "source": "https://www.techradar.com/reviews/benq-gs2-portable-projector",
  "title": "BenQ GS2 Portable Projector review",
  "category": "audio-visual",
  "updated": "2021-08-12T13:31:25Z",
  "author": "mark-pickavance",
  "summary": "A portable projector that needs a new app store",
  "verdict": "Better than some portable projectors by having a USB-C connection. But the lack of a credible and working application store for the inbuilt Android blights yet another portable projector.",
  "pros": [
    "Doubles as a Bluetooth speaker",
    "Android-based",
    "Splash resistant"
  ],
  "cons": [
    "Aptoide Tv",
    "Only 720p native resolution",
    "No Google Play Store access",
    "Limited brightness"
  ],
  "article": [
    "When we travel away, or when we do again, many of us will expect home comforts to come along.",
    "That’s the entire premise of portable projectors, as they can enable the big screen experience without having to lug a 55-inch or bigger screen along with all the other vacation paraphernalia on a break.",
    "Many have tried, few have succeeded. Is the BenQ GS2 one of those that deliver on the promise of portable projection, or was the balancing act between practicality and portability beyond its skillset?",
    "The UK price on Amazon of the BenQ GS2 is £549, and on the US-based Amazon.com, that translates into $599. It may be possible to find it cheaper elsewhere, but we didn’t see that bargain.",
    "Portable projector designs are much less predictable than their home and office counterparts, as there seems little consensus on what form factors work or not.",
    "The shape chosen by BenQ for the GS2 is technically a heavily filleted Frustrum square pyramid, but most would describe it as a rounded cube.",
    "It sits on a circular foot that allows the vertical projection angle to be adjusted by fifteen degrees enabling the GS2 to be placed on a table or ground, depending on personal preference.",
    "The projector comes in a nicely made soft carry case along with the battery charger PSU, a small remote control, and a wireless dongle.",
    "That last item seemed an odd choice since it would be easier and more reliable to place the WiFi technology on the internal electronics, surely?",
    "The one advantage we can see to this approach is that the dongle could be upgraded to better technology, or even LTE, in the future.",
    "But, as WiFi is almost a prerequisite to using the GS2, the first action most owners will need to do is remove the dongle from its packaging, and pulling the port access panel open, insert it into the projector.",
    "The port cover was one of the first things that looked less than ideal. It’s made of a rubberised material that BenQ covered the GS2 to make it ‘splash proof’. Loosely connected by a single strap at one end, this looks designed to be the first item to get detached and lost from this hardware.",
    "This cover would be less of a problem if you didn’t need to pull it open whenever you connect HDMI, USB or USB-C devices to the GS2.",
    "The only exception is the power connector that is located at the very back and has a very clever magnetic connector. Therefore, while it is being charged or powered, it can’t easily be damaged if the PSU is accidentally pulled away.",
    "The top surface face has pressable buttons embedded in it for all the standard controls that are also replicated on the remote. We’d recommend using the remote because the thickness of the rubberised covering stops some presses from being recognised.",
    "Once powered the GUI of the Android platform inside appears, and this automatically adjusts focus and keystone on any vertical surface in front of the GS2.",
    "The automatic controls function much better on nearby surfaces and less accurately as the distance increases. At much more than a metre, it is best to manually focus for an optimal image.",
    "Like many portable projectors, this is an LED illuminated DLP projector with a 1280 x 720 resolution panel that can accept a maximum of 1080p resolution content.",
    "As it is battery powered, the maximum power output of the LED bulb is 500 ANSI Lumens and depending on the brightness setting used, a life expectancy of 30,000 hours is possible.",
    "That’s a useful amount of life, thankfully, as the bulb can’t be replaced. When it fails, and eventually it will, this device is toast, sadly.",
    "To put Lumens output in perspective, typical mains powered 720p or 1080p projectors often generate at least 6,000 ANSI lumens and have a bulb life of 50,000 hours.",
    "With only 500 Lumens available, this isn’t a projector that you’ll be using in daylight, a point that contradicts BenQ’s efforts to make it splash resistant, as few people only go to the beach at night.",
    "There is no quoted wattage for the internal battery, but to achieve the three hours that is mentioned in the promotional material requires that you select ‘Battery Mode’ in the brightness options, reducing the output Lumens further.",
    "The other impact of lack of brightness is that it curtails how big the projection can be before the image quality degrades dramatically. Even in complete darkness, the GS2 can’t deliver much more than 60 inches wide, and with some ambient external light, even less.",
    "That said, 720p digital content wasn’t created to be seen at 60 inches or larger, as it reveals its recognisable resolution limitations.",
    "Where this design surpasses others, like the Asus ZenBeam Latte L1, are in the input options.",
    "Having HDMI is standard and welcome, but GS2 also offers USB-C in addition to a USB-A port.",
    "Probably the most useful of these is the HDMI, as it allows the use of an Amazon Fire Stick or Google Chromecast in conjunction with the GS2. But, the USB-C input is also very useful if you wish instead to use your mobile phone to access streaming services that you already have on that device.",
    "But, you may be wondering why, as the GS2 uses Android, why you would need to do this when the applications could be locally installed? There are issues that we’ll cover later.",
    "For the simplest solution that doesn’t require any networking, it is possible to place video files on a USB flash drive and launch them using an inbuilt file manager. The success rate on this depends on the types of files they use and what codecs are used to create them.",
    "In the MKV packaged files we tried, the GS2 didn’t support EAC3 audio, even if the H264 video played perfectly.",
    "For various reasons, many companies choose to use Android but pass on the Google services part of this equation.",
    "The major factor is simple, cost. Where Android is effectively free, those that want to include Google's mobile services, which include the Play Store, will need a license from Google.",
    "Depending on who you talk to, numbers like $75,000 are often mentioned as the possible cost to test 100,000 devices for conformity.",
    "For some, that’s the profit they could use elsewhere, and they don’t include any of the core Google apps and services to avoid the overhead. The GS2 is one of those devices.",
    "That leaves the maker with an issue, as without applications and services, Android isn’t much use.",
    "The solution used here, and seen previously in the Asus ZenBeam Latte L1, is the Aptoide Tv application store. This is a third-party app store that contains a small subset of the applications that you can find on Google Play.",
    "And, if the apps on this store worked, that would be fine, but this is the second Aptoide Tv device we’ve seen where it isn’t possible to download from the store.",
    "We should also mention that in 2020, the account information of 20 million Aptoide Tv user accounts was leaked on a hacking forum by a person claiming to have 39 million records from this system.",
    "In short, avoid Aptoide Tv like the plague even if you are fortunate enough to get it working, and instead, use a BenQ wireless projection application for Android or iOS that you can get on your phone, or as we previously mentioned, Chromecast or Fire Stick’s are also a workable solution.",
    "Had BenQ implemented Google TV on here, it might have been more compelling a solution, but that’s a choice they can make.",
    "Not sure what to think about the BenQ GS2 other than the concept had potential that wasn’t realised for avoidable reasons.",
    "As a portable projector, it’s brighter than some we’ve tested but still not bright enough to be suitable for locations that aren’t shaded. It lacks any zoom control, the native 720p resolution isn’t high enough for many uses, and the battery life wouldn’t get you through any of the Lord of the Rings trilogy running time.",
    "But, the most damming aspect of design, and something it shares with the Asus ZenBeam Latte L1, is that the designers passed on Google services and went with the remarkably poor Aptoide Tv application store.",
    "Not only does this have issues installing applications, but many of the most popular apps also won’t work without side-loading or other tweaks that are beyond the scope of average customers.",
    "Without an easy-to-use application source and seamless access to the majority of android applications has made the GS2 much less user friendly.",
    "The cost is also high when compared with a 720p home projector, and many might wonder if a cheaper solution would be to use a mains powered projector with power provided by a vehicle or generator. It wouldn’t be as portable as the GS2, but the projected image would be much bigger and brighter.",
    "Hopefully, BenQ will endeavour to rectify the app store issue and make the GS2 into a solution that inherently does more with the technology it already has."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design",
    "17": "Specifications",
    "31": "In Use",
    "41": "Final verdict"
  },
  "links": {
    "Asus ZenBeam Latte L1": "https://www.techradar.com/reviews/asus-zenbeam-latte-l1-portable-led-projector"
  }
}