{
  "source": "https://www.techradar.com/reviews/nubia-red-magic-6",
  "title": "Nubia Red Magic 6 review",
  "category": "phones",
  "updated": "2021-04-09T07:00:49Z",
  "author": "tom-bedford",
  "summary": "Great for gaming, but with some rough edges",
  "verdict": "If all you care about is gaming, the Nubia Red Magic is great – it’s got top specs, a high screen refresh rate and easy-to-use haptic triggers. The handset is a little rough around the edges though, with a noisy internal fan, some software issues and a UI that might not be to everyone’s tastes. The clincher for some, though, could be its price, which makes it more affordable than its rivals.",
  "pros": [
    "Triggers feel fantastic to use",
    "Plenty of gaming power",
    "Relatively affordable"
  ],
  "cons": [
    "Lots of software bugs",
    "Internal fan is really noisy",
    "Divisive UI design"
  ],
  "article": [
    "Nubia is one of the big three gaming phone makers, with its Red Magic range competing with Xiaomi’s Black Shark and Asus’ ROG Phone lines, and the Red Magic 6 is the third-gen gaming phone from the company (yep, despite that number 6 in the name).",
    "Launched alongside a Pro model which has a few small differences (such as an internal cooling system), the Red Magic 6 is Nubia’s 2021 gaming phone, and it should be a contender for the title of best gaming phone – but it might not get there for a couple of reasons.",
    "The Nubia Red Magic 6 ticks all the boxes you’d expect of a gaming phone: it has a powerful processor and plenty of RAM, a Game Space mode to improve processing speeds further, and an array of antennae and speakers.",
    "It goes above and beyond in a few ways too: its haptic triggers feel fantastic, and can genuinely give you the edge when you’re gaming. Its display refresh rate hits a high of 165Hz the highest on any smartphone as of launch, which beats the competition with their 144Hz screens. It also has a built-in fan, which helps to prevent the phone getting too hot when you’re gaming.",
    "However, there are a few goofy software bugs that make the phone a little annoying to use. For one, the word ‘charging’ is misspelled in the notification that pops up when you plug the phone in. Audio from games can continue to play even when you’ve closed the game down, and we also found one of the games we use to test mobiles just wouldn’t open, despite us uninstalling and reinstalling it.",
    "The internal fan is also really whiny, which can get annoying when you’re trying to listen to footsteps in online games or enjoy the ambiance of a title. You can either turn the fan off, which makes the phone heat up, or, as Nubia likely wants, buy its external fan, which keeps the handset ice cool.",
    "Oh, and turning on the 165Hz display option is very confusing, as it’s hidden away. You don’t activate it by jumping into the Settings app, as that only offers up to 144Hz, despite this being the way you change the refresh rate on practically every other smartphone. Instead you have to go into the quick settings (swipe-down) menu, find the framerate option, select the drop-down arrow, and then click 165Hz.",
    "In its defense, the Nubia Red Magic 6 is pretty affordable as gaming phones go, enough so that we could overlook some of the phone’s annoyances. It undercuts the Asus ROG Phone 5 by a fair amount, and the Lenovo Legion Phone Duel, which tops our gaming phone rankings at the time of writing, by a significant chunk. It has, respectively, the same and better internals than Asus and Lenovo’s latest devices too, so it’s not like you’re missing out on much here.",
    "This two-minute review may paint a somewhat negative picture of the phone, but as you can see by the star rating, we can hesitantly recommend it based on its mid-ranged price – just don’t expect a flawless, premium experience.",
    "The Nubia Red Magic 6 comes in one configuration, with 12GB RAM and 128GB storage, and costs $599 / £509 (roughly AU$850) for it – there’s also a Pro model for $699 / £599 (roughly AU$1,000) with 16GB RAM and 256GB storage.",
    "That’s a fairly low cost for a gaming phone, when you consider the Lenovo Legion Phone Duel starts at £799 (roughly $1,060, AU$1,440), and the Asus ROG Phone 5 costs €799 (around $950 / £685 / AU$1,235). Red Magic has always been one of the most affordable lines of gaming phones around.",
    "You can buy the gaming phone on Red Magic’s global store, which ships to many countries around the world.",
    "As with all gaming phones, the Nubia Red Magic 6 is a bit of a chunky chap - it measures 169.9 x 77.2 x 9.7mm and weighs 220g, so it’s going to be a stretch for you to use it one-handed.",
    "On the back, the Red Magic 6 has a pattern quite similar to its predecessor, with the Red Magic logo, a patterned decal and a fairly small camera bump that doesn’t stick out far from the body. It’s a glass back, and the phone has a metal frame.",
    "There are two LED strips on the rear, but they’re quite small compared to those on other gaming phones.",
    "The Red Magic 6’s ports are scattered all over the edges - there’s a USB-C port on the bottom and a 3.5mm headphone jack at the top, a volume rocker and gaming mode slider on the left edge, and a power button and two haptic triggers on the right edge.",
    "These triggers are among the best we’ve used on a gaming phone, because they feel really natural to tap, and give a small shudder to let you know the touch was registered. They’re also unintrusive, as there’s nothing physical on the phone to let you know they’re there, unlike the physical triggers some gaming phones have.",
    "The Nubia Red Magic 6 doesn’t have an IP rating, so it’s best not to take it for a swim, though it feels pretty sturdy, so it should be able to survive knocks and small drops.",
    "The Nubia Red Magic 6 has a large 6.8-inch display, so there’s plenty of screen real estate to see your game. The front camera is housed in the top bezel, so the screen isn’t broken up by any intrusive lens placement.",
    "It’s an AMOLED panel with a 2400 x 1080 resolution and around 387 pixels per inch. Images look pretty bold and bright, and the contrast is also great, which is important as it can help you easily distinguish different aspects of a game at a glance.",
    "The key feature here is that the display’s refresh rate clocks up to an all-time high of 165Hz - at the time of the Red Magic 6’s release, it’s the only phone to get that high. That means the screen refreshes the image 165 times per second, compared to the 60Hz of your ‘standard’ smartphone, 120Hz of your premium phone and 144Hz of other gaming phones.",
    "As a result, motion feels silky-smooth when you’re scrolling through menus, and when playing games that support higher refresh rates. This high refresh drains the battery quickly, but you can downgrade it if you want, to various different lower rates.",
    "One issue we found, though, is that the ability to activate 165Hz is well-hidden. If you jump into the Display part of the Settings menu, you can turn it up to 144Hz, but to activate 165Hz you actually have to go into the swipe-down quick settings menu, scroll over to the framerate icon, press the drop-down arrow, then select 165Hz. This is different to on all other phones, and the lack of 165Hz in the Display menu made us initially, and incorrectly, assume the phone only went to 144Hz.",
    "Another important gaming spec is the touch input rate of 500Hz, so the screen scans for your finger 500 times per second (or 360 times per second if you’re using multiple fingers at once). This is way higher than the ‘standard’ of 120Hz, and it’s great for gaming as it means your reactions are translated to on-screen actions quicker.",
    "The phone has an in-display fingerprint scanner, which we found fairly snappy, though finding it intuitively took a little getting-used-to since it’s small compared to the large phone.",
    "While the Nubia Red Magic 6 isn’t exactly a fantastic camera phone, you’re probably not buying this to become an amateur photographer. There are three rear cameras: a 64MP f/1.8 main, an 8MP f/2.0 ultra-wide, and a 2MP f/2.4 macro camera.",
    "The main camera is a mixed bag, but we were generally happy with its performance. Dynamic range is fair, though there were sometimes some overexposure problems with pictures. Focusing was always quick and fairly accurate, and snaps were 16MP by default, but you can turn that up to 64MP for high-res snaps.",
    "This high-res sensor lets you zoom digitally, up to 10x, and while pics at this zoom aren’t incredible, they’re still perfectly usable.",
    "Problems arise when you try to use the other cameras, because ‘try’ is the operative word - there isn’t an ‘ultra-wide’ option so you can easily jump to a wider field-of-view when you’re looking through the viewfinder. As we found out after ages of testing, the only way to use this lens is to jump into the Pro camera mode. Macro mode is nearly as confusing to initiate - you have to press ‘Camera-Family’ to bring up a big grid of options, then find ‘Macro’ there.",
    "If you can get there, ultra-wide and macro pictures are fine. Wide pictures retain the same color composition of standard shots, though could be distorted around the edges. Macro pictures were a little low-res, and we didn’t end up using it much as the standard camera was just as good for the same kind of shot.",
    "To be fair, there is a huge array of modes in this list including multi-exposure, time lapse, light drawing and more, so if you love gimmicky smartphone camera modes there’s a treasure trove here. We found that some were fun to play around with.",
    "The front-facing camera has an 8MP resolution and an f/2.0 aperture, and that’s a relatively low resolution for such a snapper. As such pictures were fine, as they were fairly bright, but if we cropped them at all they could look a little grainy. Snaps weren’t exactly vibrant either.",
    "The Nubia Red Magic 6 can record video at up to 8K, or up to 4K at 60fps - a surprisingly high spec which is probably thanks to the top-end chipset. Settings like HDR or stabilization aren’t available at 8K though.",
    "The Nubia Red Magic 6 has basically the best internals available to it: that’s the Snapdragon 888 chipset and 12GB of RAM, and together they make quite the team. There’s also 5G of course.",
    "In the Geekbench 5 benchmark test, the multi-core score we found was 3,606, which is pretty high, losing only to the OnePlus 9 (3,654) and Asus ROG Phone 5 (3,732). Weirdly, though, when we put the phone through the same tests in its ‘Game Space’ mode which mutes notifications and focuses the processing power on the game, the score was noticeably lower at 3,196.",
    "This lower benchmark score wasn’t reflected in our experiences using Game Space, as gaming was great. Graphics always defaulted to their highest setting, we didn’t experience lag, and titles loaded fast.",
    "One little annoyance: when using Game Space, the phone’s internal fan turns on, resulting in an incessant whining sound which really got on our nerves. You can turn this off, but the phone heats up exceptionally quickly as a result. Your two options are to buy an external fan to clip on the back, which keeps the phone ice cold, or just plug in headphones to ignore the sound.",
    "Two things that made gaming particularly great are ones we’ve already covered: the high screen refresh rate and touch input rate, which makes games feel super responsive, and the two haptic triggers which, as we previously stated, could be the best on a gaming phone. They’re easy to reach, give satisfying rumbles when you use them well, and have no noticeable delay between being pressed and working.",
    "We should point out, though, that PUBG Mobile just wouldn’t load on the phone, for a reason we couldn’t fathom or fix. This put a damper on our testing processes, as it's a good tester game.",
    "The phone has dual front-facing speakers, and we found them fit for purpose, providing the closest thing to surround sound you can get on mobile, and adequately playing game audio.",
    "The Red Magic 6 runs Android 11, with the Redmagic 4 UI laid over the top, a skin that mainly just changes the way Android looks.",
    "In Redmagic 4, home screen icons are big and angular, which makes the app drawer especially look rather intimidating - as that language implies, we don’t like the design of the UI, but that’s totally subjective. One positive is that the swipe-down quick settings menu has far more options than on most other phones, with options like back-lighting, fan use, screen refresh rate, and Nubia’s file refresh feature added to the usuals like Wi-Fi, Bluetooth and mobile data.",
    "If you flick the Game Space slider, you’re brought into the phone’s dedicated gaming mode which focuses processing on the game, mutes notifications (if you want it to) and lets you assign trigger controls. These modes are useful for dedicated gamers for their extra functions.",
    "We found a broad swathe of annoying software bugs which marred our experience with the phone. Some of these actively affected functionality; when games were closed, they’d often keep playing their audio for a while, with no apparent way to stop it. Some were just silly, like the fact ‘charging’ was misspelled as ‘charing’ when a charger was plugged in.",
    "We were generally pleased with the Nubia Red Magic 6’s battery life, as we found it easily lasted us a day - when we were playing lots of games, it was a tighter call, but we still never found ourselves powering up the phone in the evening.",
    "It’s a 5,050mAh battery that we have to thank for this - that’s fairly large for a smartphone, even a gaming one (as those tend to have bigger battery packs).",
    "Charging is done at 66W - Nubia says that, at this speed, the battery will go from empty to full in 38 minutes, and from our testing we’d concur. You might have heard that the Red Magic 6 has 120W charging, which would seem to beat this, but that’s only true in China - international versions of the Pro model also top out at 66W.",
    "There’s no wireless or reverse wireless charging here, but those two features aren’t common (or, arguably, useful) for gaming phones, as you can’t use wireless powering while gaming.",
    "First reviewed April 2021."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Nubia Red Magic 6 price and availability",
    "12": "Design",
    "18": "Display",
    "25": "Cameras",
    "33": "Performance and specs",
    "40": "Software",
    "44": "Battery life",
    "48": "Don't buy it if..."
  },
  "links": {
    "Asus ROG Phone 5": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "Lenovo Legion Phone Duel": "https://www.techradar.com/reviews/lenovo-legion-phone-duel-review",
    "Red Magic’s global store": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8981123887019339000&xs=1&url=https%3A%2F%2Fuk.redmagic.gg%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnubia-red-magic-6",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}