{
  "source": "https://www.techradar.com/reviews/polarbackup-review",
  "title": "Polarbackup cloud backup review",
  "category": "computing",
  "updated": "2021-05-11T22:36:33Z",
  "author": "david-nield",
  "summary": "Polarbackup has some hot deals on cold storage",
  "verdict": "Impressive in a number of areas, Polarbackup includes the security measures, and encryption, at fair prices for storing your data. As long as you understand the limitations of cold storage backup, it's an appealing option for keeping your data safe.",
  "pros": [
    "Very competitive lifetime pricing",
    "Customisable backup schedules",
    "Easy-to-operate software interface"
  ],
  "cons": [
    "Data can't be retrieved instantly",
    "No real-time syncing functionality",
    "Lacks two factor authentication"
  ],
  "article": [
    "Polarbackup provides a comprehensive cloud backup solution, giving you a straightforward way to offload your data to its online servers. It's packed with features, is quite affordable, with an appeal to a broad range of individuals and businesses.",
    "The weakness to be aware of is that this is a cold rather than a hot storage solution. This means that you'll have to wait a few hours to get your data back when and if you need to restore it. Those ok with that issue will find that Polarbackup covers most of your cloud storage needs.",
    "As previously noted, Polarbackup is a cold storage solution, which is designed for data you want to back up somewhere, but that you don't need to access very often. After setting it up on your computer, it'll copy all the files you want to the web – including those on external drives and network drives – without any fanfare. In short, it's fast, simple to use and is quick to configure.",
    "The reality of cold storage is when you need to restore a file, it takes between 3 and 12 hours according to Polarbackup. When something disastrous happens to your computer, you get all your files and folders back again, but you just won't be able to get them back again right away. File versioning gets support also, allowing you to save multiple versions of the same file and then choose which one you need to get back when running a restore.",
    "There’s also business packages, and you get extra options for user management, setting data policies, digging into activity logs and handling standards compliance. We like the no limits on users, servers or file sizes, and no additional charge for data restoration (you'll just have to wait a few hours to get it back).",
    "With the desktop clients installed, backups can be run at set intervals (anywhere from every 12 hours to every 7 days), or on a custom schedule. There's also an option of limiting bandwidth through the desktop client if you need to. Also you can get Polarbackup to run a selective backup on particular file types, like Microsoft Office files, videos or desktop files, for example.",
    "If you think that the Polarbackup interface looks familiar, you would be correct as it is similar to another backup solution Zoolz, and the two services are run by the same company. However, Zoolz offers both cold and hot storage, while Polarbackup sticks to cold storage only (hence the name, we’d guess). Some of the software stylings are the same between both of these cloud storage services.",
    "The reality is that these aren't the most modern or the slickest interfaces you're ever going to come across. However, they do the job well enough and the software has plenty of useful features scattered throughout – such as the backup filter that lets you pick out files with a particular filename or using a particular extension. Desktop clients for Windows and macOS are easy to use for picking out files and folders.",
    "From the web interface, the files you've uploaded can be viewed, and downloads can be requested, which take several hours, and you get an email when the link is ready to download. For business users, you can manage all of your users and servers conveniently from the web portal, as well as get reports for bandwidth usage, file transfers, etc.",
    "We would characterize upload speeds as decent, namely not particularly fast, but adequate for the purposes of encrypted, cold storage backup. The idea is to leave Polarbackup running in the background, taking care of all your long-term backup needs, rather than having it transfer files to the web in a flash. Be aware of what you're signing up for, and you won't be disappointed.",
    "It's immediately apparent that Polarbackup takes security very seriously. Files get protected with 256-AES military grade encryption, and stored using an end-to-end encryption (or zero knowledge) process. This high security process translates to Polarbackup engineers can’t get to your data at all! Also be aware that this also follows that if you lose your encryption password that you've lost your cloud backup forever... so be warned.",
    "A shortcoming is that there's no two-factor authentication (2FA) available on Polarbackup, so be extra careful about who gets hold of your email address and password. Other than the missing 2FA it's an impressive all-round security package. When heading to your user account panel inside the Polarbackup web interface, there is even transparency of the location of the data center that's holding your files.",
    "Polarbackup is based in London. For an individual plan, there is a single plan offered currently that costs $10 (£7) monthly, and is currently on sale for $4 (£3) monthly- with unlimited data. There were previously offered lifetime backup plans with a pay once and use forever price, but none are currently offered on their website, and this promotion appears to have ended.",
    "For a business plan, the prices are currently on sale for $63.19 (£45) a year for 1TB of total storage, $126.38 (£90) a year for 2TB, and $315.96 (£226) for 5TB. More room on the Polarbackup servers can be available on request.",
    "Plans have a 15-day free trial, and we appreciate that no credit card is required. Furthermore, there is a 30-day money back guarantee.",
    "Polarbackup is laser focused on a specific job: long-term cold storage at affordable rates. As an offshoot of Zoolz, we can have some confidence that the company knows what it's doing. Polarbackup is basically a cheaper, more limited version of Zoolz, that is a good choice if you don't need as many features, or instant access to your data.",
    "The service gets high marks in terms of speed, reliability, and security, which are the areas that most users need. While Polarbackup is not quite as impressive in terms of the breadth of features that it offers, or the quality of the software interfaces that it uses but as long as it's keeping your data safe and sound, these should be secondary concerns."
  ],
  "headers": {
    "2": "Polarbackup features",
    "6": "Polarbackup interface",
    "10": "Polarbackup security",
    "12": "Polarbackup pricing",
    "15": "Polarbackup verdict"
  },
  "links": {
    "Polarbackup": "https://www.polarbackup.com/",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "external drives": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "network drives": "https://www.techradar.com/best/best-nas-hard-drives",
    "Microsoft Office": "https://www.techradar.com/news/buy-microsoft-office-prices",
    "Zoolz": "https://www.techradar.com/reviews/zoolz-cloud-backup",
    "transfer files": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "single plan": "https://www.polarbackup.com/",
    "business plan": "https://www.polarbackup.com/business/"
  }
}