{
  "source": "https://www.techradar.com/reviews/corsair-k100-rgb",
  "title": "Corsair K100 RGB review",
  "category": "computing",
  "updated": "2021-02-16T20:23:57Z",
  "author": "mark-knapp",
  "summary": "All the features and then some",
  "verdict": "The Corsair K100 RGB is one of the most capable and flashiest keyboards you can get, as long as you can get past the hurdles of iCue and the price tag.",
  "pros": [
    "Maxed out features",
    "Stable keycaps",
    "Consistent"
  ],
  "cons": [
    "Very expensive",
    "iCue woes",
    "Limited utility for some"
  ],
  "article": [
    "The Corsair K100 RGB brings a nearly maxed-out feature set with media controls, macro buttons, and plenty of RGB to compete with the best gaming keyboards out there. At $229 (£229, AU$379) the Corsair K100 RGB is expensive, stepping up even from the $199 (£179, AU$349) Corsair K95 RGB Platinum. In fact, a good many of our favorite keyboards cost considerably less than this one while offering fairly similar capabilities. So, Corsair delivered a new level of keyboard performance to justify the price.",
    "This keyboard comes with either Corsair OPX Opto-mechanical switches or Cherry MX Speed switches. Both options are built for fast actuation, our review unit uses the OPX switches with a 1mm actuation point, a 45g actuation force, and a 3.2mm travel. Those distances are a fair bit shorter than the common Cherry MX Red switches.",
    "The combination of these fast switches with a new 4,000Hz polling rate is intended to make sure your computer registers your keystrokes incredibly quickly. The combination of a short 1mm travel is paired well with the 45g actuation force, as it reacts quickly but it’s not so easy to press down that we perform keystrokes any time we rest our fingers on the keyboard.",
    "This keyboard performs phenomenally in gaming, but not exceptionally. A 1,000Hz polling rate is already intangibly fast, and jumping to 4,000Hz makes little difference. Playing Ghostrunner, perhaps one of the twitchiest games we’ve played recently, our inputs are certainly quick and responsive, but even at high frame rates and low response times, we’d be hard pressed to notice the difference 4,000Hz made.",
    "What’s perhaps more valuable in gaming is the consistency of the actuation. We can hammer away on the F key to pick up loot on the ground in Call of Duty Warzone, and we don’t frequently run into an issue with occasional presses getting missed since we didn’t let the key up high enough. It can happen, but only if we keep the key very close to fully bottomed out.",
    "Corsair has managed to do something truly praiseworthy with its keycaps. The RGB lighting actually fully illuminating the key legends was already a nice touch, but Corsair has stabilized the keys in a way we don’t often see on mechanical keyboards. They have a little wiggle on the X/Y axis, but tilt is almost non-existent, and it’s amazing what a difference that makes when it comes to typing on them. It’s so much easier to avoid hitting neighboring keys when the key we’re pressing doesn’t tilt slightly. It’s worth noting that this may be specific to the OPX model. How Corsair did it isn’t apparent, as the stems appear the same as most other mechanical key switches. The only inconsistency we notice is that larger keys (shift, enter, backspace, etc..) squish a bit more when bottomed out.",
    "All of this capability is packed into a keyboard that delivers premium quality. The Corsair K100 RGB is built around an aluminum top plate for sturdiness. There’s cable routing underneath to make USB passthrough easier to use. The height adjustment legs offer two different height levels and work together with strong grips. The palm rest is even upgraded from the K95 RGB Platinum, now with a more luxurious cushion.",
    "This model has been upgraded to include even more RGB Light Edge as well. Where the K95 Platinum had this light strip just along the top edge of the keyboard, the K100 sees it wrap around the sides as well for 44 zones of controllable light. Except now the light isn’t directly visible from above, instead spilling out onto the desk surface around. It’s a feature somewhat lost if the keyboard is at the edge of a desk. Fortunately, the per-key RGB lighting of the keys themselves is more than enough of a lightshow.",
    "Unfortunately, some of the Corsair K100 RGB’s unique features require one of the worst peripheral softwares out there: Corsair iCue. It’s not bad so much as it is very hard to use (and large, at 1.5GB). iCUE still has one of the steepest learning curves of software for PC peripherals – something that hasn’t changed in years. It remains surprisingly confusing how lighting effects, functions, macros and such are assigned to individual keys. And with a keyboard that has so many keys and lighting zones, it’s far too easy to undo a ton of customization by accidentally making the wrong selection.",
    "That reliance on iCue, a shocking 1.5GB software, somewhat buries the K100 RGB’s extra features. The Elgato Stream Deck integration (which is an additional installation) adds some special functions available for the six dedicated macro keys at the left edge of the keyboard. But the more interesting wheel at the top of the keyboard relies on iCue for customization, and its usefulness will vary between softwares (e.g., it can scrobble through tracks on iTunes or Spotify but not Winamp or Groove Music). This limits the usefulness of some of these unique features to a small subset of users."
  ],
  "headers": {
    "10": "Don’t buy it if…"
  },
  "links": {
    "best gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "Corsair K95 RGB Platinum": "https://www.techradar.com/reviews/corsair-k95-rgb-platinum",
    "Call of Duty Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone"
  }
}