{
  "source": "https://www.techradar.com/reviews/grandstream-ip-phone-grp-gxp-gxv-series",
  "title": "Grandstream IP Phone GRP, GXP, GXV series review",
  "category": "computing",
  "updated": "2021-08-17T09:43:20Z",
  "author": "barclay-ballard",
  "summary": "We've assessed three of Grandstream's most popular VoIP ranges",
  "verdict": "Some great devices - particularly for group calls",
  "pros": [
    "Excellent call quality",
    "Big bright LCD touchscreen",
    "Conferencing functionality"
  ],
  "cons": [
    "Reports of glitches from some users"
  ],
  "article": [
    "Grandstream Networks has been supplying businesses worldwide with its award-winning communication solutions since 2002. The company offers a wide variety of VoIP phones, so there’s likely to be one at a price range to suit your budget.",
    "Grandstream’s solutions are used by organizations in more than 150 countries and include headsets, Wi-Fi management solutions, and scalable unified communications offerings, in addition to its IP phones.",
    "This review will focus on three specific ranges of IP phones offered by Grandstream: the GRP, GXP, and GXV ranges. All the devices offered within these ranges deliver the quality and reliability that Grandstream has become known for over the last two decades, but the different features offered by each will be more suited to some organizations than others.",
    "However, businesses that opt for any of the Grandstream handsets mentioned below are sure to encounter handsets that boast excellent call quality and are particularly well-suited to group conference calls. Whether your organization requires video calling functionality, Bluetooth connectivity, or any number of other VoIP features, Grandstream is bound to have a device that’s right for you.",
    "Within Grandstream’s GRP range, there are two distinct sets of devices. First, the Essential IP Phone line is designed for mass deployment and easy management. There are four devices in this range, which aim to deliver next-generation features at an affordable price.",
    "The standout phone here is the GRP2604 - a three-line model that boasts a sleek design and several of the important features that modern businesses expect from their IP phone. This includes five-way voice conferencing, integrated power over Ethernet, full HD audio on both the speaker and handset, as well as multi-language support.",
    "Businesses will also be pleased to know that the GRP series comes with carrier-grade security features, including secure boot, dual firmware images, and encrypted data storage. The GRP2604 is also supported by Grandsteam’s cloud-based Device Management System, which provides users with a centralized platform to configure and manage their Grandstream endpoints.",
    "Also sitting within the GRP series are five mid-range carrier-grade IP phones, equipped with a more extensive range of features. These handsets are built for enterprise customers and other high-volume businesses. Starting at the lower end, the GRP2612 comes with 16 virtual multi-purpose keys, a full-color LCD screen, and a host of other features. The inclusion of a swappable faceplate is also a nice touch, providing businesses with an additional branding opportunity in the workplace.",
    "The GRP2613, meanwhile, champions efficiency above all else. The handset includes three SIP accounts, six multipurpose keys, HD audio with support for all major codecs, and a color LCD display. The GRP2613 is designed for smaller firms that can’t afford to waste time using inefficient equipment. Setup is also straightforward. Users simply need to unpackage and assemble the phone, which includes the handset, an Ethernet cable, and a power adapter. Easy-to-follow instructions even make configuring your Grandstream GRP2613 device on your network as simple as could be.",
    "Those looking for a more premium experience may want to try the GRP2614. This model outperforms some of the other GRP devices in terms of call-quality - particularly when using the speakerphone. The inclusion of 40 virtual multi-purpose keys, as well as dual-LED screens, will also surely be welcomed by high-volume users, particularly as the lower LED is customizable so users can configure it for fast access to frequently dialed numbers, for example.",
    "Rounding out the GRP series are the GRP2615 and GRP2616 models. These high-end devices boast the same sleek design found in Grandstream’s other models but also include color LCD screens and the option of adding a larger number of SIP accounts. For businesses that need their VoIP handsets to look the part, these are probably the GRP models that will appeal the most.",
    "Grandstream’s GXP series of phones are designed for users who are frequently on the phone and may need access to more advanced features. The company offers basic, mid-range, and high-end IP phones, all of which deliver a variety of interactive communication features, depending on the user’s needs.",
    "The basic IP phones range from the GXP1610/15 model, which offers a streamlined service and just one SIP account, to the GXP1630, with its support for three SIP accounts. In between, there's the Grandstream GXP1625 IP Phone, which promises both rich HD sound quality and a 132×48 backlit graphic display. The option of three-way audio conferencing should also help employees collaborate wherever they are based.",
    "Looking at the mid-range GXP phones available, Grandstream envisions that these handsets will be ideal for businesses that are experiencing rapid growth, as they deliver the kind of flexibility that scale-ups demand. Here, there are two handsets available. The first, the GXP1760W, is ideal for businesses that handle moderate call volumes, offering dual-band Wi-Fi for easy integration with wireless networks and a sleek design. The GXP offers even more scalability, via its four SIP accounts and its eight dual-color line keys.",
    "Businesses that need access to more advanced features, however, may want to look at the high-end offerings within the GXP range. The GXP2130 v2, for example, boasts a 2.8-inch color LCD screen, four XML programmable soft keys, and the option of utilizing three SIP accounts. Other features, such as integrated Bluetooth, HD audio, and dual Gigabit network ports are also included.",
    "Organizations will also find that the GXP2130 v2 is offered at a very affordable cost, with it being rare to find a color screen IP phone available at this price. In terms of drawbacks, some users have complained that this particular model feels a little small and does not sit as comfortably in the hand. Others have claimed that the graphical icons used to identify the functionality of each key are not always the most intuitive.",
    "But if employees aren’t happy with the GXP2130 v2, there are other models that they can try. The GXP2135, for example, offers quick and powerful usability - the kind required by users managing medium to heavy call volumes. The handset comes with 32 digital speed dial keys, eight physical line keys, and four-way audio conferencing. There have been reports of the color LCD screen fading over time from a minority of users, however.",
    "Standing out noticeably from the other VoIP handsets offered by Grandstream, GXV devices run off the Android operating system and offer a kind of hybrid functionality that is part-VoIP phone, part-tablet. The devices, of which there are three, all offer video functionality, which could prove essential for organizations demanding a multimedia experience.",
    "The newest, but cheapest, addition to the range is the GXV3350 IP Video Phone, which delivers both a multi-platform video collaboration solution and the functionality of an Android tablet within an all-in-one communications solution. The GXV3350 boasts a five-inch 1280x720 capacitive touch screen, HDMI output, dual microphones, and an adjustable camera. PoE Gigabit ports, integrated Wi-Fi connectivity, and Bluetooth support are also included.",
    "Offering similar capabilities but a slightly larger screen, the GXV 3370 also comes with flexible SDK support for custom apps. This handset offers a seven-inch touch screen and is fully interoperable with nearly all major SIP platforms. The GXV3370 will be welcomed into the majority of evolving workplaces, with the three-way 720p video conferencing feature likely to be particularly useful for firms engaging in remote collaboration.",
    "Finally, the GXV3380 IP Video Phone for Android is the most advanced of the GXV range. This 16-line IP video phone boasts an eight-inch 1280x800 capacitive touch screen, a two-megapixel camera, HDMI in/out for content sharing, and support for 1080p HD video. In spite of its many fancy features, the GXV3380 couldn’t be easier to use. The fact that it runs off the Android operating system means that many users will already be familiar with the underlying technology here, making any learning curve particularly gentle.",
    "One of the biggest draws of the GXV range is likely to be the fact that these handsets offer access to thousands of Android apps. This could greatly increase the productivity of a company’s employees by enabling them to quickly reach the workplace tools they need without having to engage with another device. More than just a VoIP phone, the GXV series of devices are powerful business tools that offer functionality that stretches far beyond sending and receiving calls.",
    "The GXP2200 extension module is compatible with the GXP2140, GXP2170 and GXV3240 models of Grandstream’s IP phones. If businesses are interested in any of those devices but would like the option of some additional functionality, then the GXP2200 extension module is certainly worth taking a look at.",
    "The extension module comes with 20 dual-colored extension keys and two arrow keys for page switching. The module also enables users to view an additional 40 contacts and extensions. That is, if business users decide that they only need one expansion module. In fact, the compatible handsets can be connected to as many as four GXP2200EXT modules at once, which allows the addition of up to 160 new contacts or extensions.",
    "The additional screen real estate provided by the expansion modules should help businesses users increase their productivity levels by ensuring that all of their contacts are easily accessible from a single device. In particular, large firms may find the use of the GXP2200EXT helpful, as it makes it easier to manage bigger quantities of employees or clients.",
    "With its programmable buttons, the GXP2200EXT supports traditional call features like bridged line appearance/shared call appearance, busy lamp fields, call park/pick-up, speed dial, presence, intercom, and conference/transfer/forward. One of the main advantages of selecting this Grandstream expansion module is the added flexibility that it will give to users. Plus, despite its feature-rich design, the module boasts power consumption of just 1.2W per unit - meaning it should fit right in with most organization’s sustainability strategies.",
    "With more jobs than ever embracing remote or hybrid work, it has become increasingly important for workers to be accessible even when they are away from their desks for long periods. However, many employees still want some way of keeping their business and personal lives separate. This is part of the reason why softphone applications are often included as part of VoIP solutions - including those manufactured by Grandstream.",
    "The Grandstream softphone app, dubbed Wave Lite, is a free application that allows users to make and receive voice calls through up to six different business or residential SIP accounts on any Android or iOS device. It doesn’t matter where an individual is located, as long as they have a reliable internet connection, they will be able to remain in contact with their colleagues and customers by accessing their usual work phone numbers through their smartphone.",
    "As well as offering support for up to six SIP accounts, Wave Lite also offers six-way voice conferencing and allows users to monitor their IP PBX (such as Grandstream’s UCM6100 series IP PBX and UCM6510 IP PBX) while utilizing speed dial through as many as 24 virtual BLF keys. Additional features include TLS and SRTP security encryption technology and voice channel switching between Bluetooth, mobile device, speakerphone, and headset jack.",
    "Although Grandstream’s IP phones provide great functionality for office users, they will never be able to replace the flexibility of a smartphone. Fortunately, because of the Wave Lite app, they don’t have to, as it allows users to remain contactable at all times.",
    "Grandstream’s VoIP devices really have something for everyone. For companies with smaller budgets or less intensive VoIP needs, the GRP range may represent the best solution - although it is worth bearing in mind that a small number of customers have reported glitches with some of these models.",
    "For organizations that want flashier VoIP handsets, the GXV series offers some truly impressive handsets. The ability to conduct calls using the familiar Android operating system is also likely to appeal to a number of firms - as will the bright, clear screen and sharp audio quality.",
    "Overall, Grandstream’s VoIP phones represent great all-rounders for any office - particularly those that engage in a sizeable number of conference calls."
  ],
  "headers": {
    "30": "Our overall verdict"
  },
  "links": {
    "hybrid": "https://www.techradar.com/news/defining-your-hybrid-working-strategy"
  }
}