{
  "source": "https://www.techradar.com/reviews/quickbooks-pos-point-of-sale",
  "title": "QuickBooks POS (point of sale) review",
  "category": "computing",
  "updated": "2021-09-09T10:12:28.887Z",
  "author": "anthony-spadafora",
  "summary": "A Windows-only POS system from the accounting software giant, Intuit",
  "verdict": "This could be a great choice for those already invested in the QuickBooks ecosystem, but for those who aren't, this POS system is too expensive for its limited feature set.",
  "pros": [
    "One-time fee instead of monthly payments",
    "30-day free trial",
    "Integrates with other QuickBooks products",
    "Takes all payment types",
    "Real-time inventory updates",
    "PCI and EMV compliant",
    "Different hardware colours available"
  ],
  "cons": [
    "Expensive",
    "Separate license needed for each device",
    "Customer support is not free",
    "Windows-only",
    "Payment integrations are limited"
  ],
  "article": [
    "Intuit is known and trusted the world over for its popular and reliable finance software QuickBooks, so it's understandable that the company would create its own POS system. In our QuickBooks POS review, we discover what Intuit has brought to the retail sector, and see how it compares to its competitors.",
    "First up, it's worth pointing out that QuickBooks POS does things quite differently to its competitors, which can be a good or bad thing depending on the needs of your business.",
    "For instance, while most other POS systems charge customers a monthly fee for their services (Square POS being a notable exception), Intuit has instead decided to go with a one-time purchase fee for all of its POS systems.",
    "The smart thing about contactless POS systems like QuickBooks, is that no contract means you'll save on paying the typical early termination fee.",
    "This could work out to your advantage in the long run, but unlike NCR Silver POS system which offers free support, QuickBooks POS charges either $89.95 per month or $299.95 per year for customer support.",
    "Are your employees more comfortable working on an iPad POS or Android-based POS system? Well, despite the fact that the QuickBooks website has an entry in the drop-down POS Overview menu about how it is compatible with tablets, the company isn’t referring to Apple’s iPad or the many Android tablets available.",
    "Instead, Intuit added support for the Microsoft Surface Pro 4 which technically is a tablet, of course, but not really what businesses are used to when considering tablet support options for their POS system.",
    "Arguably the best feature of QuickBooks POS system is how it is compatible with Intuit’s popular accounting software QuickBooks. While other POS systems claim to integrate easily with QuickBooks, QuickBooks POS actually does, as you’d expect, and the software easily syncs your data, saving you time and errors.",
    "So is QuickBooks the right POS solution for your business? Let’s take a closer look at what makes Intuit’s POS system tick by examining the software’s features, pricing, setup and ease of use.",
    "As we said before, most POS systems charge a monthly rate in addition to a fee for all transactions. QuickBooks POS does things a bit differently by offering three different plans tailored to the needs of small, medium and multi-store businesses.",
    "The Basic plan allows you to ring up sales, take payments, track inventory, track customer data and perform basic reporting, and is available for a one-time purchase of $1,200. If this seems expensive, keep in mind that NCR Silver’s basic plan costs $99 per month or $1,188 per year. Another thing to note when considering any QuickBooks POS plan is that the required hardware is sold separately and is not covered by the company’s rather high one-time payment.",
    "Next up we have the Pro plan which includes all of the features of the basic plan along with the ability to manage employees and payroll, offer layaway and gift cards, set up reward and loyalty programs for customers, and do advanced reporting. This plan costs $1,700 and it is the one which Intuit recommends.",
    "Last up we have the Multi-Store plan that includes all of the features in the Pro plan along with the ability to manage multiple stores, manage and transfer inventory, and perform advanced sales and inventory reporting between stores. This is the most expensive product at $1,900, but for businesses with more than one location, this plan is a requirement.",
    "Intuit does offer a free 30-day trial with all of its plans, and that is a long enough time period to see if QuickBooks POS is a good fit for your business.",
    "If you’re familiar at all with Windows, then you should have no trouble getting QuickBooks POS up and running. First you have to download and install the software itself which is compatible with all editions of Windows 10, Windows 8.1 (Update 1), Windows 7 SP1 as well as Windows Server 2008, 2011, 2012 and 2016.",
    "Intuit recommends at least 4GB of RAM for a single workstation installation with at least a 2GHz processor for a single user, and a 2.8GHz processor for multiple users. QuickBooks Pro is also optimized for screens with a resolution of 720p or higher.",
    "If you plan on exporting your POS data to Microsoft Word or Excel, QuickBooks POS requires that at least Microsoft Word and Excel 2000 or higher be installed on your system(s).",
    "Another point to note is that hardware such as PIN pads and physical inventory scanners not purchased from Intuit may not be configured correctly to work with its software. On its website, the company stresses that it does not provide hardware configuration, nor does it guarantee hardware purchased elsewhere will work with its software and services.",
    "For customers who are not sure if their hardware will work with QuickBooks POS, Intuit does provide a list of compatible hardware on its site as well as the full system requirements needed to utilize its POS system.",
    "QuickBooks POS offers all the features you would expect from a premium POS system such as the ability to accept credit and debit cards (including EMV cards) as well as cash and checks for payments. Sales can be rung up using a barcode scanner and the system also allows you to offer discounts and add customer information for better personalization.",
    "So, let’s highlight a few of the best and most notable features of QuickBooks POS, starting with inventory management.",
    "Inventory management is well implemented and the system keeps all of your inventory organized and up to date by adjusting and updating with every sale or return. QuickBooks POS can track which of your items are selling and which are not, so that you can adjust your inventory accordingly. If an item is about to sell out, the system will notify you, and can even generate a purchase order automatically if you’re subscribed to either the Pro or Multi-store plan.",
    "Business owners with the Pro version of QuickBooks POS will also be able to manage their employees. The system can track employee hours and commissions with the ability to send this data to QuickBooks or other accounts software to help simplify the payroll management process. You can also customize access to certain functions of the software based on an employee’s status.",
    "QuickBooks POS includes extensive reporting options and the software will provide you with reports on the best and worst selling items, sales over time, payment method summaries, common returns, busiest times and more. Every report gives you the ability to drill down for more detail on each individual sale made.",
    "For businesses that would prefer to use either an iPhone or iPad to conduct sales, you’re in luck, as version 12.0 included a new app which allows you to make sales and track stock from Apple’s devices. However, you will need a “Go Payments” card reader to make sales on these devices.",
    "There are a number of great POS systems out there so if QuickBooks POS is a bit too much in terms of an initial investment, you might be better off with Square or Shopify POS.",
    "While Square’s prices may be higher than other credit card processing companies, there are no overhead costs to deal with, and all retail and mobile customers get a Square Reader for free. The company does not charge users a monthly fee and there are no monthly minimums to be met, which makes the service a great fit for businesses that only occasionally need to process credit cards.",
    "If your business is more e-commerce focused, then Shopify POS might be the right choice for you. Shopify is well-known in the e-commerce industry and the company’s POS system fully integrates with its other services. Shopify POS is also on the cheaper side and even offers a Lite Plan at just $9 a month.",
    "If you’re already heavily invested in the QuickBooks ecosystem, then using Intuit’s POS system makes a great deal of sense, but for those just looking to accept payments, there are a lot of cheaper alternatives out there.",
    "QuickBooks POS is a no-brainer for businesses that already rely on Intuit’s financial software. However, for those that don’t, the company’s POS solution seems dated compared to other more modern, cloud-based offerings.",
    "The service will likely improve over time, especially with Intuit’s full backing behind it, but as of now it is hard to recommend, and the high upfront costs are enough to turn away small businesses looking to accept card payments."
  ],
  "headers": {
    "9": "QuickBooks POS: Pricing",
    "14": "QuickBooks POS: Setup",
    "19": "QuickBooks POS: Features",
    "25": "QuickBooks POS: The competition",
    "29": "Final verdict",
    "31": "Further reading"
  },
  "links": {
    "POS system": "https://www.techradar.com/news/the-best-pos-system",
    "QuickBooks POS": "https://quickbooks.intuit.com/point-of-sale/",
    "Square POS": "https://www.techradar.com/reviews/square-pos-system-review",
    "NCR Silver POS system": "https://www.techradar.com/reviews/ncr-silver-point-of-sale-pos-review",
    "compatible with tablets": "https://quickbooks.intuit.com/point-of-sale/tablet-hardware/",
    "Microsoft Surface Pro 4": "https://www.techradar.com/reviews/pc-mac/tablets/microsoft-surface-pro-4-1290285/review",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-online",
    "Basic plan": "https://quickbooks.intuit.com/point-of-sale/pricing/",
    "Pro plan": "https://quickbooks.intuit.com/point-of-sale/pricing/",
    "Multi-Store plan": "https://quickbooks.intuit.com/point-of-sale/pricing/",
    "free 30-day trial": "https://quickbooks.intuit.com/point-of-sale/free-trial/",
    "list of compatible hardware": "https://community.intuit.com/articles/1770099-point-of-sale-compatible-hardware",
    "full system requirements": "https://quickbooks.intuit.com/point-of-sale/system-requirements/",
    "Square": "https://www.techradar.com/reviews/square-pos-system-review",
    "Shopify POS": "https://www.techradar.com/reviews/shopify-pos"
  }
}