{
  "source": "https://www.techradar.com/reviews/undelete-360",
  "title": "Undelete 360 review",
  "category": "computing",
  "updated": "2021-06-10T04:01:11Z",
  "author": "christian-cawley",
  "summary": "A relic of a bygone era",
  "verdict": "A relic of the past stuck in the Windows 10 era, the now ironically named Undelete 360 struggled with speed, competent recovery, and detecting unmountable devices. With unclear updates and support for the paid version, this is best avoided.",
  "pros": [
    "Easy to use",
    "Available with multiple languages"
  ],
  "cons": [
    "Styled for Windows 7",
    "Expensive for such a feature-free tool"
  ],
  "article": [
    "Free data recovery tools are hard to come by. Almost all file undelete and data recovery utilities are premium products, often a hefty one-off charge potentially to recover just a single file.",
    "The solution for those on a tight budget and without the resources of a business or SME is free or freeware recovery software.",
    "Claiming to be \"one of the best programs to use for restoring accidentally or unintentionally deleted files\" around, Undelete 360 is such a tool. Launched in 2010 and available as freeware, Undelete 360 is compatible with Windows 7 and later.",
    "Undelete 360 has been around for years without (significant) updates yet remains available to use.",
    "Curiously, there is no option to buy the software anywhere on the website until you try it. This is instigated by clicking the Wipe Files option in the app, which launches Internet Explorer (regardless of your PC's default browser).",
    "For all the wrong reasons, Undelete 360 stands out among other data recovery utilities. Free and open-source software like TestDisk & PhotoRec is one thing, distributed freely based on a philosophy.",
    "Two paid options for Undelete 360 are available:",
    "You can also upgrade from Professional to Ultimate for $34 (£24.95). Sadly, there is scant information about what the Pro and Ultimate packages offer, beyond lifetime activation, free upgrades for one year, and free technical support, without actually using the software and finding out what is restricted.",
    "This alone is reason to avoid Undelete 360.",
    "Want to recover some data from a drive and need a free utility? Undelete 360 is intended to restore lost or deleted data from hard disk drives, digital cameras, and USB flash drives. Undelete 360 will also find data on floppy drives, although this feature is probably not going to be widely used in the 2020s.",
    "Data that has been accidentally deleted, lost to viruses, or discarded from Windows network shares can be recovered with Undelete 360. Files that have been created and deleted by specific applications, deleted in the command line, and erased when the move or cut commands have been used can also be recovered.",
    "The paid version of Undelete 360 lets you do things like filter and sort the scanned files, preview and check file properties, and wipe files from the device.",
    "For testing we connected a 16GB SanDisk Cruzer Blade USB thumb drive to a Dell 5505 laptop running Windows 10. This device includes several deleted media files and disk images and is considered unmountable by Windows under normal circumstances.",
    "Launching Undelete 360 and choosing the Search mode to select a drive, only the two internal devices were detected. Clearly, Undelete 360 is unable to access unmountable devices.",
    "Checking a known-to-be-working USB device had better results.",
    "Consequently, we opted to use Undelete 360 to find deleted files on the system drive. All found files were listed in the main pane, with a Status indicating their recoverability. This ranges from Very Good via Good, Middle, and Bad to Overwritten.",
    "Suitable files can be recovered by checking the corresponding box to select, then clicking Recover and selecting the target folder.",
    "Recovery completed in around 30 minutes, which is acceptable for a 256GB NMVe device.",
    "Sadly, while plenty of files are uncovered by Undelete 360, many seem irrecoverable, even when labelled \"Very Good.\" We tried a range of data, from text files to PNGs and JPGs to ZIP archives and MP3s, all with that rating. Only half of those tested were rec",
    "With a comparatively basic user interface, Undelete 360 has a Help option in the About menu. Sadly, however, this links to a blank page.",
    "Other support options are available, however, which is useful for recovery software as this is a process that is prone to accidents. The Undelete 360 website features a detailed \"getting started\" page, which walks through the recovery procedure step-by-step. How-to videos, hosted on YouTube, are also available – one in English, another in German. Usefully, the site can be read in German, French, Italian, Spanish, and Russian.",
    "A short FAQ is also provided on the Undelete 360 home page, along with a page to request support. This can be done either by filling in a form or using the email address.",
    "Overall, however, the support section is underwhelming, leaving much to be desired. While if offers everything you might expect, there is little of any real substance. There is no indication of the paid support option via any of the site's menus.",
    "While fast enough, the recovery options, opaque upgrade process, lack of support, and decade-old user interface make Undelete 360 little more than a second-tier option. The fact that it remains online, with paid hosting, an active URL, and a company contracted to handle order processing suggests that someone, somewhere, has been fooled into relying on software that has long been left behind. And if you did pay for Undelete 360, you would feel ripped off.",
    "Put simply, Undelete 360 is about five years beyond its sell-by date. Surprise feature locks aside, the inability to scan unmounted disks and poor recovery file classification make it next to useless in a marketplace of both free and extremely expensive alternatives. Not only should Undelete 360 be avoided, its developers should upgrade it for the current decade, or remove it from the web."
  ],
  "headers": {
    "3": "Recovery software without the features",
    "9": "Key recovery features",
    "12": "Finding files with Undelete 360",
    "17": "Recovery performance",
    "19": "Support",
    "23": "Final verdict"
  },
  "links": {
    "data recovery tools": "https://www.techradar.com/best/best-data-recovery-software",
    "Undelete 360": "https://undelete360.com/",
    "TestDisk & PhotoRec": "https://www.techradar.com/reviews/testdisk-and-photorec",
    "USB thumb drive": "https://www.techradar.com/news/best-usb-flash-drives",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938"
  }
}