{
  "source": "https://www.techradar.com/reviews/deathloop-review",
  "title": "Deathloop review",
  "category": "gaming",
  "updated": "2021-09-17T15:06:02Z",
  "author": "samuel-roberts",
  "summary": "Happy death day",
  "verdict": "Deathloop offers an engaging blend of shooting and stealth in one endlessly looping day. It leaves a lot of room for players to experiment with their preferred approach to combat and exploration, which makes it stimulating and exciting to play. A multiplayer invasion mode, too, has so much potential if it actually takes off – it could keep you playing for many hours more. Deathloop won't be for everyone, but its mix of ideas comes together so confidently that it's easily a game of the year contender for us.",
  "pros": [
    "An exciting mystery to unpick",
    "Shooting is genuinely fun",
    "Multiplayer has potential"
  ],
  "cons": [
    "Repetition sets in during final third",
    "Focuses a bit too much on stealth",
    "Enemies are mostly identical"
  ],
  "article": [
    "Want to know the coolest thing we've done in Deathloop so far? There's a power in this game called Nexus – using it on one enemy means that if anything happens to them, the effect is repeated on any linked enemies in close proximity.",
    "We snuck into a party at night in the Updaam area of the game, followed a walkway around a busy room and cast Nexus on a large group of guards dancing below. With a careful, silent headshot from one of the game's nail guns on just a single enemy, the entire room of guests died quietly at once.",
    "It was murder on the dancefloor, and it felt amazing – but it took a while to get to that point. When you start in Deathloop, your character Colt wakes up on a beach with nothing, and is stuck living the same day over and over again. Your journey in this game is a slow accumulation of powers, weapons and information. It's a first-person shooter built around a stealth system, mixing things up with supernatural abilities. It's a game of messy firefights, experimentation and eventual moments of punch-the-air satisfaction, with a potentially long-lasting multiplayer invasion mode waiting for you in its endgame.",
    "Colt's overall goal is to execute eight targets – called Visionaries – on Blackreef in a single day in order to break the loop. At first, this seems insurmountable. Over time, as murdering each of the targets becomes routine and you start figuring out shortcuts, you slowly piece together how you're going to get this done.",
    "Deathloop divides each day into four periods, and the island's four regions change depending on what time you're there. Guard placements are altered, and some locations will only be accessible at certain times of day – encouraging you to return on the next loop at a time when a certain door might be open, or a bridge is accessible.",
    "Progress through Deathloop is understanding that you're not exactly playing a game that starts again each time Colt washes up on the beach, ready to relive the same day. You can carry weapons and powers between loops with a resource called Residuum, so you've got a permanent arsenal for when the day starts again. It helps, too, that Colt remembers what happens between loops – so the story and your journey as a player is functionally linear, even if the world around you is repeating.",
    "Instead, you'll start thinking strategically about the many clues in your objectives menu, and piece together shortcuts on how to deal with each of the Visionaries. As an example, there's a house in the Updaam area of Blackreef that's burned down by the evening – but maybe if you return earlier in the day, you can stop it from catching fire and explore the space. Many breadcrumb trails like this make the act of unraveling Deathloop's final murder puzzle feel compelling.",
    "Deathloop is a hard game to categorize. Like Dishonored from the same developers, it seems like a stealth game at its heart – you start each level without enemies knowing where you are, and you can sneak up on them with a machete for a stealth kill. But unlike Dishonored, this game gives you a lot of guns, explosives and powerful abilities to use in open combat, and you sense that the developers want you to get your hands dirty.",
    "The enemies are pleasantly disposable, with an odd mannequin or crash test dummy-like look to them. There's little variety between these NPCs aside from the guns they carry, and they're not overwhelmingly intelligent, which is a relief considering you'll run into them many times over.",
    "One of Deathloop's weaknesses is the way it bombards the screen with exclamation marks when enemies catch you, which, whether intentional or not, makes it feel like being caught is a mistake you've made as a player. The fact is, though, you have to play Deathloop like a shooter to really get the most out of it, and if you're anything like us, you'll get too impatient to sneak up on the same groups of enemies every time the day resets. It's much easier to just get into some firefights – and the PS5's adaptive triggers help make the gunplay feel nice.",
    "Deathloop's powers are called Slabs, and you take them from dead Visionaries. They include abilities like Shift, which lets you teleport to high places of the map instantly, or Karnesis, which is like slapping an enemy with an invisible tentacle – that one is fun for knocking enemies off cliffs. Aether lets you turn invisible for a short space of time, and we already mentioned Nexus. Using accessories called trinkets, you can customize Colt's loadout every time you enter a level – maybe amping up your magic if you're trying to stay invisible, or boosting your health if you're planning on going through the front door.",
    "While the complicated mix of powers and time loops might seem off-putting to players more familiar with traditional shooters, Arkane has done a fabulous job of moving out of its comfort zone and making a game where it feels good to pull the trigger.",
    "Arkane has built a fun location in Blackreef. The game's tone is spot-on – it focuses the story around Colt's dynamic with Julianna, one of the Visionaries who's positioned herself as his rival. In the unending time loop of this island, killing each other has become a sport. Berating each other is part of the fun. The '60s setting mixes up a whole bunch of influences, from the art of Saul Bass to Connery/Lazenby-era James Bond, while Colt's voice actor Jason E Kelley hilariously conveys the air of a weary man who's permanently hungover in limbo.",
    "The Visionaries, too, give the game some real color. There's Frank, a cruel crooner who likes hanging out in his recording studio, a space you can't enter with your powers. There's Charlie, a guy who's designed his own game in a theme park-like area, and the entire place is stacked with guards. There's a preacher lady called Harriet who likes to fill her surroundings with gas if she spots you. How will you deal with this array of total b******s, alongside five more, in just one loop?",
    "What you're ultimately building towards is a single feasible way to kill all these targets – and the objectives menu guides you along the way, perhaps with a little too much hand holding. After everyone's dead and the credits have rolled, which took us around 20 hours, you can do it all again and perfect it, or try some slightly different methods along the way.",
    "Here's the thing we haven't mentioned yet, though: Julianna is secretly the endgame of Deathloop. Throughout the story, she'll pop up randomly as an enemy throughout the game's levels, and you can choose in the menu whether she's AI-controlled or if you want players to invade your game as her. As an AI opponent, Julianna is easy enough to kill but still a vaguely interesting threat. If a human player takes on the role of Julianna, though, Deathloop comes to life in the most extraordinary way.",
    "When you play as Julianna, you enter Colt's game with a deep knowledge of Blackreef and where he'll want to go at different times of day. A location usually flush with enemies might be cleared out, telling you he's been there – and following the trail becomes a thrilling game of cat-and-mouse, as the other player is on the lookout for you. Julianna can't respawn, whereas Colt has three chances, meaning it's harder for her to win. That makes victory even sweeter when you do get the drop on the same player three times.",
    "It also means for Colt players, though, that repeating the game's final loop to murder the Visionaries is no longer the reason to play. You'll start the loop again because you'll want a human-controlled Julianna to invade your game – the excitement of being hunted in this mode is extraordinary, and it creates some incredibly funny moments.",
    "We had one loop as Colt where we were perched on a roof with a sniper rifle. Julianna has an ability that lets her take on the role of a regular enemy in the game – in theory, she can blend in, with a careful approach. Our opponent, though, started doing the most rad parkour moves across rooftops while playing as an NPC, a dead giveaway that was a Julianna player with no subtlety. Several bullets later, she was down.",
    "But we've also encountered a Julianna who did nothing but swing wildly with a machete in close quarters. We've met another who killed us twice with careful placements of mines while staying invisible on rooftops. We've met another who stalked us through the corridors of a party, but left so many doors open we could see her coming. The other player gets to put their own imprint on how they invade, and the novelty of seeing an opponent pop up in your game is appealing.",
    "This means that when you've finished the game, it's not over. How much longevity is in this invasion mode remains to be seen – but playing it in a pre-release state, it is very moreish, even if we've had some lag when taking on the Julianna part (crucially, this just can't be tested effectively until the game is live). It's equally tense whether you're the hunter or the hunted, and we hope it takes off with players.",
    "In some ways, Deathloop is a strange fit to do the heavy lifting of being the PS5's only major exclusive during the holidays in 2021. Sony backed the right horse, though, and Arkane has created a singular stealth-shooter hybrid with a lot of personality, and a potential whole other game with its multiplayer invasions.",
    "Perhaps it won't be for everyone, and some players will dial out of seeing the same locations too many times. And while Arkane's talented artists have created a beautiful world with so much character, it's not necessarily a PS5 showcase when it comes to visual heft. We also noted some rare slowdown in busier places on performance mode.",
    "Those who engage with the spirit of Deathloop, however, will absolutely love it. This isn't a game that plays itself for you, and it genuinely responds to your approach as a player in interesting ways – that means the potential rewards are massive, even if mastering it might take you a while. Colt might be sick of living the same day again and again, but you'll have plenty of reasons to look forward to waking up in the morning."
  ],
  "headers": {
    "4": "Day and night",
    "7": "Shooter or stealth game?",
    "12": "Julianna and the Visionaries",
    "20": "Never ending"
  },
  "links": {
    "first-person shooter": "https://www.techradar.com/news/best-fps-games"
  }
}