{
  "source": "https://www.techradar.com/reviews/irobot-roomba-i7",
  "title": "iRobot Roomba i7+ review",
  "category": "appliances",
  "updated": "2021-12-02T14:41:31Z",
  "author": "joe-osborne",
  "summary": "Making the worst part of robot vacuums a lot better",
  "verdict": "The iRobot i7+ is one of the brand’s popular models. Between the smart mapping technology and digital assistant integration, it’s well worth the money - if you can swing the steep price.",
  "pros": [
    "Imprint Smart Mapping",
    "Digital assistant integration",
    "Automatically empties dust",
    "Nearly 100% automated"
  ],
  "cons": [
    "Expensive",
    "Recurring operating cost"
  ],
  "article": [
    "The iRobot Roomba i7+ is one of the brand's hugely popular robot vacuums and that’s because it combines powerful cleaning power, smart mapping, and even empties its own dirt bin.",
    "If you’ve got a smart speaker, you’ll be able to give the iRobot Roomba i7+ instructions and set it to work without having to lift a finger. The i7+ isn’t cheap but for the price, you also get a base that doubles up as a trash bin included with the vacuum.",
    "Now that the iRobot Roomba i7+ is a few years old, you can get it for considerably less than the original price. There are newer models available from the brand, such as the iRobot Roomba S9+, but the i7+ is still a very popular choice.",
    "We put the i7+ through extensive testing to see if it's worth your money.",
    "The Roomba i7+ is priced at $699 / £599.99 / AU$1499 for the product on its own, or for $949 / £799.99 / AU$1899 with the Clean Base Automatic Dirt Disposal dock included.",
    "The Roomba i7+ looks an awful lot like its predecessors at first glance, but contains so many more differences once you flip the machine upside-down. Before getting into that, one thing about the vacuum’s shell that’s markedly different here is that the LED now blinks and shines different colors depending on its current state.",
    "Once you flip the vacuum over, you’ll immediately notice some improvements to the rubber rollers that pull in dirt, as there are now more – and more refined – grooves for better pickup. Also, the dust bin that’s attached to the vacuum has been improved, both for easier emptying manually and automatically.",
    "Automatic emptying is handled via a new vacuum port that, when the vacuum is docked, attaches to a vacuum port in the dock that immediately sucks up whatever is in the dust bin into the Clean Base. The dust and debris is then stored in disposable bags that can hold up to 30 bins’ – or, generally speaking, days – worth of debris.",
    "At that point, you’ll be alerted to replace the bag via the connected iRobot app for smartphones. These ‘Dirt Disposal’ bags are available via iRobot for $14.99 per pack of three bags in the US.",
    "This alleviates what is arguably the most annoying part of using a robot vacuum: emptying the bin. However, it’s clear that this product introduces a cost of operation that few, if any, other robot vacuums require.",
    "That said, even if you run your Roomba i7+ daily, that adds up to a rather tiny operating cost every two to three months. That’s not too shabby, but you might bristle at how much cash iRobot stands to make on these bag replacements.",
    "As for how the Roomba i7+ performs, iRobot has vastly improved its leading vacuum’s smart navigation capabilities. Now, rather than just map a single room and forget it after the job is done, the Roomba i7+ uploads maps of every room in your home securely to iRobot’s cloud servers.",
    "However, your Roomba i7+ won’t come out of box knowing how every room in your home is laid out. It will have to learn them through its first few cleanings. During this process, the cleaning pattern of the Roomba i7+ will look much like that of the Roomba 980, as viewable through the companion app.",
    "Developing the smart maps doesn't take much time, in the grand scheme of things, the better part of a week. From there, you can tell Roomba to clean specific rooms in your space after you've designated those spaces using the iRobot app.",
    "However, beware that, if you ever change or reset your Wi-Fi network, chances are that you'll have to act out this process all over again. This is at least in our experience, and it's ultimately a minor inconvenience but an inconvenience nevertheless.",
    "Once your Roomba i7+ has uploaded detailed maps of your room layouts, it will assume a much more efficient cleaning pattern of pacing across each room in as straight of lines as possible. iRobot calls this ‘Imprint Smart Mapping,’ and claims that this new method will save both energy and time.",
    "The mapping system can strangely remember only up to 10 floor plans at a time, which you can name either with set names or custom names. We imagine this is both because iRobot isn’t charging users to store their floor plans in its cloud servers and that its servers only have so much space for everyone’s Roomba i7+ maps.",
    "Once you rope Amazon’s Alexa and the Google Assistant AI services into the mix, this robot vacuum’s value proposition blows wide open. Once connected with either service through the iRobot companion app, you can quite literally say, “Hey Google, clean the master bedroom,” and the Roomba i7+ will undock and bee-line it straight for the room(s) you requested.",
    "This is the true power of iRobot’s mapping system, as it drills the process of getting your Roomba to clean a room down to a single sentence uttered. All you have to worry about is emptying the Clean Base once a month or so – and cleaning the vacuum’s rollers and other parts every so often.",
    "The iRobot Roomba i7+ is an impressive choice from iRobot’s line of robot vacuums. Roomba was already enough for us to leave sweeping and vacuuming ourselves in the dust, but now it’s practically irresistible.",
    "That’s not to say that you won’t pay dearly for this ultimate evolution of Roomba, even after you’ve put up the price of entry. You’ll just have to decide whether both the upfront and recurring costs of owning this Roomba are worth the level of convenience it offers. We're here to say that, if you can afford it, nigh-fully automated sweeping and vacuuming from Roomba earns our 'Recommended' award."
  ],
  "headers": {
    "4": "Price and availability",
    "5": "Design and performance",
    "19": "Final verdict"
  },
  "links": {
    "robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "vacuum": "https://www.techradar.com/news/best-vacuum-cleaners",
    "iRobot Roomba S9+": "https://www.techradar.com/reviews/irobot-roomba-s9"
  }
}