{
  "source": "https://www.techradar.com/reviews/hostinguk",
  "title": "Hosting.uk review",
  "category": "computing",
  "updated": "2021-06-16T04:29:38.791Z",
  "author": "mirza-bahic",
  "summary": "A lesser-known host from the UK offering a full line of hosting services for a decent price",
  "verdict": "Although Hosting.uk is a versatile web hosting provider with enough hosting options and worthwhile features to draw anyone’s attention, it is aimed at UK-based customers only.",
  "pros": [
    "30-day money-back guarantee",
    "Lifetime price-lock guarantee with all plans",
    "Plenty of payment methods, cryptocurrencies included",
    "Whole array of hosting options"
  ],
  "cons": [
    "No free domain registration",
    "No free SSL certificates",
    "No 24/7 live support with shared hosting packages"
  ],
  "article": [
    "As its name implies, Hosting.uk is a UK-based web hosting provider. The company is headquartered in London (the UK) and was launched in 2012 aspiring to “revolutionize the UK web hosting market with powerful, modern and high performing servers.” They also claim to be “all about smart hosting” and ways to provide high quality services, fast speed and server performance without leaving a burning hole in your pocket.",
    "Judging by their rich repertoire of hosting services, there should be something to satisfy almost everyone’s needs. However, this is even truer if you are from the UK, because all of their tier 4 data centers are found there, which implies their targeted market. The maintenance of Hosting.uk’s data centers is entrusted to Timico, another company from the UK and their long-term partner.",
    "Hosting.uk’s main website is simple in style and simple to use, to our satisfaction. It features an enthusiastically updated blog with articles that cover various hosting-related topics, and all in a novice-friendly way. Although there is no clear listing for the articles (preferably listed by date and with a summary), you are free to thumb through them by using search box or by picking them out form the specific categories.",
    "Besides being committed to their blog, Hosting.uk has an active presence on several social networks including Facebook, Twitter, Instagram, Pinterest and YouTube. Most of these accounts were created in the summer of 2018 and have been updated regularly from then on. Although this is not the case with the YouTube one, it redeems itself by offering several well-made video guides.",
    "The price range with Hosting.uk is rather flexible, and that goes for each of the hosting types they provide: cloud-based shared hosting, VPS hosting, reseller hosting, dedicated server hosting and Minecraft hosting for all the Minecraft enthusiasts out there. For all of these types there are four different-sized plans currently available, from a simple beginner-friendly one to premium ones. One common feature (and a great selling point) of all these plans is a lifelong price-lock guarantee, which means that the price you initially paid for your hosting package will be the price you will pay upon every renewal.",
    "Hosting.uk’s cheapest plan is a shared hosting bargain titled “Beginner” and for a small price of £2.40 ($3.29) per month it will enable you to host up to two websites, use up to 10GB of storage, 100GB of bandwidth, have up to 10 email accounts, equip you with fan-favorite cPanel and a one-click installer. All of this has a nice ring to it, and if you do happen to change your mind within 30 days, there is a money-back guarantee with all plans, except with the ones for dedicated servers.",
    "Acceptable methods of payment with Hosting.uk include credit/debit cards, direct debit (UK only), bank transfers, PayPal, PlaySafe, Stripe Payment and cryptocurrencies (over 50 of them are supported), which is a lot of options.",
    "Hosting.uk’s hosting plans are well presented in general, and all of their key features are highlighted. However, you can find out even more by scrolling way down and tapping on “Show more” below the “Cloud hosting technical specification” paragraph. There, you’ll find all you need to know about the security, available operating systems, control panels, types of support you’ll be getting, guarantees and so forth.",
    "It’s worth noting that Hosting.uk promises round-the-clock on-site security of all of their data centers, daily security checks and backups (and this is included in all their packages), so you can feel at ease as far as this is concerned.",
    "After you opt for a hosting package, you’ll make a choice about your domain name, where you can register a new one, transfer an old one or use it as it is. Since Hosting.uk doesn’t offer a free domain registration, the registration can cost you anything from £5.99 ($8.22) to £65.99 ($90.61) for a year, depending on the name you want. After this, you can pick out a billing cycle: monthly, quarterly, annual, biennial or triennial. As it goes without saying, the length of the subscription period is proportional to the money you will save in the long run.",
    "The following step is the domain configuration, after which you’ll be asked to fill out a form with a number of personal data, so your account with Hosting.uk can be created. Besides this, you’ll be required to create (or generate) a password, opt for a payment method, answer the question about where you found out about them (on TechRadar, of course) and decide whether you want to be a part of their mailing list or leave any additional notes.",
    "After completing the payment and verification process, and remaining patient for a day (given that Hosting.uk promises “a same-day setup” without further elaboration) before your new website appears in all of its (future) glory, you’ll enter a pretty ordinary-looking dashboard. Being far from flashy is actually good news and you should have no trouble navigating around. Another good news is easy-to-use Linux-based cPanel which is the default control panel and one of the greatest solutions (if not the greatest one) for website and server management in general. With a one-click installer provided, all the best apps (such as WordPress, Joomla and Drupal) will be yours to command in no time.",
    "As an alternative, there is a drag-and-drop website builder, however, you’ll have to pay an additional fee to acquire it.",
    "Among other things, Hosting.uk promises “ultra-fast” websites as a result of utilizing “the UK’s fastest servers with modern software” support. Having that in mind, after putting Hosting.uk’s main website to speed test (via GTmetrix) we expected to get blown away by the results. However, what we expected and what we got were whole different stories. The time it took for the page to completely load was above the average, as was the number of requests. Nevertheless, the most of the vital web metrics (initial server response time, preload key requests, largest contentful paint and so forth) were showing merely a mediocre performance resulting in a C (65%) as a conclusive grade.",
    "Not failing to proudly mention their “state-of-the-art” web hosting infrastructure, Hosting.uk guarantees a 99.9% of uptime, which is actually acknowledged as a hosting industry standard. Unfortunately, after monitoring Hosting.uk’s main website for more than a month, we were faced with results showing 99.54% of uptime, which isn’t particularly presentable performance. There were five instances of downtime in total, the longest one continuing for 48 minutes straight, while the shortest one lasted for 3 minutes only.",
    "As for support, the first options that caught our eyes on Hosting.uk’s website were chat (not a live one by any means, since every time we checked if anyone was there, we got “We’re offline” as an answer) and two telephone numbers (one is international and another one is reserved for the UK customer base). Beside this, you can open a support ticket and hope for a prompt reply. The availability of technical support depends on your hosting package, so if you choose any of the shared hosting options, there is no 24/7 live support for you. It is, however, available with all dedicated server packages, which is rather reasonable considering they cost a pretty penny.",
    "Hosting.uk’s FAQ section is pretty well-structured although it doesn’t go into much detail. Their knowledgebase, on the other hand, holds a decent number of articles covering most important matters about hosting. If you would rather watch an instructive video, twelve of them are featured on Hosting.uk’s official YouTube account and they are very easy-to-follow.",
    "Both UKHost4U and Hosting.uk have their fellow countrymen as their targeted audience, since all of their data centers are located in the UK. In terms of hosting services and features they are almost equal. Almost equal, actually, since UKHost4U will sweeten the deal with its drag-and-drop website builder which will give you an alternative way to create content, design and develop your website.",
    "Unlike Hosting.uk, HostGator is a US-based host, so it might be more convenient for users from the USA, while Hosting.uk is more likely to appeal to those in the UK. If we overlook this difference, HostGator offers more novice-friendly features (like free domain, free SSL certificate and free website builder) which will attract more first-time users without a doubt. However, one thing that Hosting.uk has and HostGator lacks is Minecraft server hosting which will be a decisive factor for those who want to set up their Minecraft servers and get lost in its immense world.",
    "Like Hosting.uk, Shockbyte is a fellow provider of Minecraft servers, but the one that is entirely focused on game servers. In contrast, Hosting.uk provides a full range of hosting services and sees Minecraft servers as an addition to its collection rather than something it is specialized in. Therefore, if you seek Minecraft servers, go with Shockbyte, for it is one of the greatest options on the market. For everything else, take a look at Hosting.uk.",
    "Much like HostGator, Bluehost offers a myriad of hosting options, features, available apps and (unfortunately) a price hike when the promotional period comes to an end. Hosting.uk will spare you the trouble, since it offers a price-lock guarantee for life ensuring that the price of your product will never come as a surprise.",
    "Although Hosting.uk has been part of the UK's web hosting industry for nearly a decade, it has managed to remain relatively obscure to this date, as if fighting a losing battle against more widely known hosts such as Easyspace, UK2 and Tsohost. Nevertheless, it puts forward a rather decent range of hosting options and valuable features (price-lock guarantee being one of them), so if you are exploring what the UK's market has to offer, give them a try. Hosting.uk‘s 30-day money-back guarantee will make sure you can do it without the risk.",
    "However, if you are looking for a cheap and cheerful newbie-friendly shared hosting package that includes everything you need for a good start, you’ll do better with providers such as Bluehost and HostGator."
  ],
  "headers": {
    "4": "Plans and pricing",
    "7": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "17": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "Hosting.uk": "https://hosting.uk/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "Minecraft hosting": "https://www.techradar.com/web-hosting/best-minecraft-server-hosting",
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "UKHost4U": "https://www.techradar.com/reviews/ukhost4u",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Shockbyte": "https://shockbyte.com/",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}