{
  "source": "https://www.techradar.com/reviews/linode",
  "title": "Linode web hosting review",
  "category": "computing",
  "updated": "2021-11-02T06:50:38Z",
  "author": "mike-williams",
  "summary": "A developer-friendly host offering high-performance services at a low-cost",
  "verdict": "Linode is a US-based cloud computing company that can supply developers with everything they need for a flying start. Newsflash: if you don’t fall into this category this probably isn’t the host for you.",
  "pros": [
    "Powerful performance",
    "Swift and simple setup",
    "“State-of-the-art” hardware",
    "Wide variety of server options",
    "Reasonably priced cloud-based products",
    "Worldwide network of data centers to choose from"
  ],
  "cons": [
    "Backups cost extra cash",
    "No domain registration services",
    "Not beginner-friendly",
    "Stingy 7-day money-back guarantee"
  ],
  "article": [
    "Founded in 2003, and headquartered in Philadelphia (Pennsylvania, the USA), Linode is specialized in cloud hosting solutions aimed at developers and all those who possess a high level of Linux know-how. The company provides high-performance hosting infrastructure to over 800,000 customers around the world allowing them to deploy cloud servers, use native SSDs on a superfast 40GB/s network and utilize superior headwear like E5 processors.",
    "Linode also offers additional services such as infrastructure management, so-called “NodeBalancers” which are (as the name suggests) load balancers as a service, a DNS manager, block and object storages, professional consultations and more. Although Linode was launched as a company “built by developers for developers”, they continue to follow trends in technology and grow together with them aiming to serve a wider customer base.",
    "As we write, Linode offers 11 data center locations scattered across the globe, and they include four locations in the USA (Atlanta, Dallas, Fremont, and Newark), one in the UK (London), one in Germany (Frankfurt), one in Canada (Toronto), one in India (Mumbai), one in Singapore (Singapore), one in Japan (Tokyo), and the final one in Australia (Sydney). The company also provides a speed test for each of these locations so their customers can decide which server works for them.",
    "Linode’s official site is superbly user-friendly and bursting with information about the company and all of its products, and exactly the same can be said about its blog. In addition to the English language, the site is available in German, Spanish, Portuguese, Korean, and Japanese.",
    "As for social networking sites, you are free to follow Linode on Twitter, LinkedIn, Instagram, Youtube, and (naturally) GitHub.",
    "While hosting with Linode you’ll be billed by an hour, which means you’ll only be paying for what you've used. In addition to that, all plans can be upgraded and downgraded without a hitch, which gives you the flexibility that is seldom found with most providers.",
    "You can choose between shared and dedicated CPU, “High Memory” plans (which are optimized for memory-intensive applications), GPU-optimized plans, deploy fully-managed Kubernetes clusters, or go with bare-metal solutions that combine non-virtualized hardware with the flexibility of a virtual machine. All in all, there are plenty of choices that, combined with affordable pricing, should make any tech-savvy individual feel like a child visiting a candy store.",
    "If you are in the penny-pinching mood, your safest bet is the smallest shared CPU plan, and for $5.00 per month (or $.0075 per hour) it will provide 1GB RAM, 1 CPU core, 25GB of SSD storage, 1TB network transfer, 40 GB/s Network In (received traffic), and 1 GB/s Network Out (sent traffic). There are ten plans of this type and the more money you are willing to spend, the more of these features you're going to get.",
    "Linode offers a 7-day money-back guarantee (a bit too brief, we must add), and a $100 promotional credit which you can use within 60 days before it starts to charge for the services.",
    "Available methods of payment with Linode include credit cards (Visa, MasterCard, Discover, and American Express), PayPal, checks, and money orders (in USD only).",
    "If you’re blowing hot and cold about going with Linode’s cloud solutions, make sure to use the promotional $100 free credit by signing up with them from the appropriate page. To get this, you can sign up via Google, GitHub, or email, pass the verification process and proceed to create your account with Linode. For this, you’ll have to provide your billing information together with a credit/debit card, since it will serve as the default payment method for your account. Take note that Linode will take a temporary hold of $1.00 (which will be released later) to authorize your card. After the promotional period comes to an end, you’ll be charged for the services you use.",
    "Once you’ve done with this, you should get a couple of step-by-step guides that will walk you through the setup process. Although these guides do a good job of simplifying the process, you’re still expected to possess at least some level of technical know-how.",
    "Linode’s dashboard is designed with simplicity in mind, but if you get stuck somewhere along the way you are welcome to contact Linode’s support team for help. Here, you can choose your web server, its location, the hosting plan you want, set a password and add backups for extra cash. Although Linode doesn’t provide a control panel as such, its how-to guides can lead you through the whole process and even give you advice on what control panel is the right one for you. You’ll just have to purchase the license for the one you want separately from Linode and install it.",
    "Besides offering Intel E5 processors, SSD, SSH access, 40GB/s network, and root access, Linode provides StackScripts, with which you can customize your templates. Linode Manager is as user-friendly as it gets, and works as a one-stop solution for booting, deploying, cloning, and managing all aspects of your cloud server in general.",
    "If you find managing your server too overwhelming, managed services are available as an add-on. However, be prepared to pay $100 per month for each Linode compute instance with your account.",
    "While putting the speed of Linode’s site to the GTmetrix test, we expected nothing less than lightning-fast performance, and that’s exactly what we got. The site fully loaded in 1.5 seconds, which is one of the best speed performances we have witnessed lately. On top of that, all other vital speed metrics (largest contentful paint, total blocking time, and cumulative layout shift) confirmed that when it comes to speed, Linode doesn’t have anything to worry about. Not surprisingly, GTmetrix decided to crown the speed performance of Linode’s site with an impeccable A (100%).",
    "Linode provides a 99.99% SLA-backed uptime guarantee on all its hardware, and network connectivity. This means that if at any given month your site goes down for more than 0.01%, you have a right to request a pro-rated credit for the downtime exceeding the guarantee.",
    "During our two-week test via UptimeRobot, the uptime of Linode’s official site remained at 100% showing just a few minor oscillations in response time throughout the test. This was a promising performance at the very least.",
    "If you would like to get in touch with Linode’s support staff before signing up with them, you can do so via telephone number (both US-based and international numbers are available), ticket, email, IRC chat, and (if you feel nostalgic about the “old times”) fax. The phone and email support should be at your service 24/7/365, but if you are currently their customer you can expect to get a more rapid response.",
    "The “Community Q&A” section can also be highly helpful, with forum posts from users from all over the world brainstorming solutions for a whole variety of issues and concerns. Although not too busy, the forum is well-staffed, as most of the questions are answered within a day or less, by Linode’s staff or fellow users. Alternatively, you can check the “Search Docs & Resources” section for quick answers and in-depth guides, some of which are surprisingly novice-friendly.",
    "Both Cloudways and Linode are very developer-friendly and offer free trials so new users can try them out without worrying about their budget. Linode is, however, a bit cheaper with the entry-level plan starting at $5.00 per month, while it’s $10.00 with Cloudways.",
    "Like its competitors above, Hostwinds offers a simple, swift, and smart way to launch a world-class cloud server. Besides this Hostwinds also provides shared, VPS (both Linux and Windows-based), dedicated server, reseller solutions, as well as a whole variety of hosting-related services. On the other hand, while Linode’s 7-day money-back guarantee seems slightly stingy, Hostwinds provides none, which is regrettable.",
    "Those who are looking for a more beginner-friendly host that offers a full range of hosting options at attractive prices should check out HostGator. Its entry-level plan will supply you with lots of unlimited features and beginner-friendly tools, and since it comes with an ample 45-day money-back guarantee, you can try everything out without hurrying or worrying about a thing.",
    "Another great alternative to Linode for all the newcomers out there is US-based Bluehost. Not only is it cheaper than Linode, but it also provides shared, managed WordPress, WooCommerce, VPS, and dedicated server solutions. Therefore, if you’re looking for a more comprehensive host with low-cost packages, you’ll probably want to pick Bluehost as your provider.",
    "Linode is a superb solution for Linux-savvy developers looking for high-performance services at a low cost. If this describes you, you can put Linode’s services to the test with their $100 promotional credit which will give you about two months to decide if it is the right host for you.",
    "Nevertheless, newcomers will probably find the learning curve with Linode a bit too steep. Therefore, if you are a novice, we urge you to check out HostGator and Bluehost before making a big decision for they are among the most beginner-friendly hosts out there."
  ],
  "headers": {
    "5": "Pricing",
    "10": "Ease of use",
    "15": "Speed and experience",
    "18": "Support",
    "20": "The competition",
    "24": "Final verdict"
  },
  "links": {
    "Linode": "https://linode.gvw92c.net/c/221109/746236/10906?subId1=trd-us-1034575813245015300&sharedId=trd-us&u=https%3A%2F%2Fwww.linode.com%2F",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Kubernetes": "https://www.techradar.com/news/what-is-kubernetes",
    "bare-metal": "https://www.techradar.com/how-to/what-is-bare-metal-hosting",
    "virtual machine": "https://www.techradar.com/best/best-virtual-machine-software",
    "ten plans": "https://linode.gvw92c.net/c/221109/746236/10906?subId1=trd-us-5434010080066104000&sharedId=trd-us&u=https%3A%2F%2Fwww.linode.com%2Fpricing%2F",
    "Community Q&A": "https://linode.gvw92c.net/c/221109/746236/10906?subId1=trd-us-5475671506798298000&sharedId=trd-us&u=https%3A%2F%2Fwww.linode.com%2Fcommunity%2F",
    "Cloudways": "https://www.techradar.com/reviews/cloudways",
    "Hostwinds": "https://www.techradar.com/reviews/hostwinds",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}