{
  "source": "https://www.techradar.com/reviews/the-medium",
  "title": "The Medium review",
  "category": "gaming",
  "updated": "2021-09-27T11:01:27Z",
  "author": "vic-hood",
  "summary": "It all started with a dead girl",
  "verdict": "The Medium shows that the best horror games don’t solely need to rely on jumpscares and clichés. Instead, Bloober Team has crafted an unnerving psychological horror bolstered by its unsettling characters, tailor-made score and often unpredictable story. However, pacing issues in the latter part of the game makes it difficult at times to keep up with the narrative and at times it felt like the game was too linear.",
  "pros": [
    "Gripping story with plenty of twists",
    "Fixed camera gives retro horror vibes",
    "Doesn’t rely on jumpscares",
    "Score elevates atmosphere",
    "Terrifying and unique adversary"
  ],
  "cons": [
    "Can be hard to keep track of story",
    "Loses pacing near the end",
    "May be too linear for some"
  ],
  "article": [
    "“Let me try you on,” a raspy voice breathes from the shadows, as we creep through the dilapidated corridors of the abandoned Niwa hotel – knowing that the creature which uttered the words could be waiting around the next corridor. Yet we know, from the hours already spent with The Medium, that this creature, the Maw, won’t simply jump out on me – that would be too easy. Instead, we’ll stumble upon it in the next room, its sheer appearance alone, combined with its intent to wear me like a glove, enough to send shivers down my spine. But we can’t even be sure that will happen, this isn’t a game that’s easy to predict.",
    "And that’s the beauty of Bloober Team’s The Medium. It never feels the need to inundate you with jump scares, which soon lose their impact, or to throw every horror cliché in the book at you from the word “go”. Instead, the tension is built slowly and deliberately. When you think you know what to expect from this psychological thriller, the formula is changed up once again creating a constant sense of unease.",
    "While that unease does fill you with dread over the 11-hour playtime, that’s not the developer’s only ambition: instead Bloober Team have crafted a story full of twists that makes you want to persevere and unearth the mysteries of the Niwa hotel – and what ties it to our medium protagonist, Marianne.",
    "The Medium brings classic fixed-camera horror to the modern day, which we’ve seen with the likes of Until Dawn, but makes sure to add its own touch through the ‘split’ feature that sees Marianne moving between both the ‘real’ world and the spirit world, adding a new dimension to the puzzle elements we’ve seen in similar titles such as the early entries in the Resident Evil series. And while there are some pacing issues in the latter part of the game, and the story can be at times hard to keep up with, it proves that Boober Team has the perfect formula for scaring the sh** out of us.",
    "On paper, The Medium’s story could be misconstrued as another stereotypical horror game. You play as Marianne, a powerful Medium, who is able to exist in two different realities: the ‘real’ world and the spirit world. Haunted by images of a dead girl, Marianne travels to the dilapidated Niwa Hotel, following a tip that the rundown resort may hold the secrets to the visions – and her past.",
    "The Medium sees Bloober Team leaning into its Polish history, with the game set in post-communist Poland – a thread that runs throughout the heart of the game’s narrative. As such, the Niwa resort is the epitome of brutalist architecture, cold and vast, the perfect setting to keep you uneasy: you’re certainly not welcome here.",
    "Marianne’s traversal of the Niwa is all pretty linear, with the game setting a clear path ahead of you for where you’re meant to go, and fairly straightforward clues as to how you get there. Most of your progression relies on solving puzzles: primarily finding the applicable item to use which will remove the obstacle in your way and allow you to move forward or uncovering the item that unearths more of the story. This is a tried and tested method which has worked well for the likes of Resident Evil, but Bloober puts its own stamp on it with the inclusion of the ‘split’ feature.",
    "As previously mentioned, Marianne exists in both the ‘real’ world and the spirit world. In the real word she sees things as any of us would (which means she can’t see some things, but we’ll come back to that later), but in the spirit world the Niwa turns into a hellish nightmare realm strewn in decomposing bodies, black tar and the occasional creeping tentacle. For the most part, we play as Marianne in the real world, however at certain points in the game the screen splits, showing in real-time Marianne existing in both the real world and spirit world. This is the key to a lot of The Medium’s puzzle-solving, as there are instances when Marianne sees things in the spirit world which she can’t see in the real world, and vice versa.",
    "In some cases, Marianne can also ‘drop out’ of her body, allowing you to play solely in the spirit world. This is handy in instances when Marianne’s path is blocked by an object in the real world, but is passable in the spirit world, as it means she can drop out of her body, pass the obstacle in the spirit world, and then in the spirit world solve the issue that’s obstructing her way in the real world. So, for example, in one instance, Marianne is trying to use an elevator but the elevator hasn’t got any power. While she can’t pass through the doors of the elevator in the real world, she can in the spirit world, so you drop out of her body and see that there’s a power box just outside the elevator door. You can then quickly search the spirit world for a spirit well, which Marianne can absorb energy from to use certain abilities, and then return to the power box and use an energy blast on it – charging the power box and therefore springing the elevator back into life in both worlds.",
    "The split feature adds an extra layer to The Medium’s puzzle solving, making you think a bit more about how to approach puzzles rather than simply finding a key and putting it in the door. In addition, you only have a certain amount of time that you can stay solely in the spirit world, as Marianne disintegrates the longer you stay, until she eventually dies. There’s no set time on how long this takes according to Bloober, who compared it to depleting oxygen in games where you can swim underwater. Essentially just move as quickly and efficiently as you can.",
    "But despite this refreshing approach, these puzzles aren’t particularly difficult and at times it felt like the solution was a bit too simple, given the linearity of the game there’s only so many places you can search for the item you need. While there’s some time to explore each room you’re in, and plenty of echoes and memories to uncover which flesh out the story’s plot, if you miss your chance to uncover them then it’s too late, you’re quickly moved on to the next area with little chance of retracing previous steps.",
    "We wish there were more opportunities to explore Niwa for ourselves, as at times it feels like we were being bustled through the game, with Bloober holding our hand every step of the way.",
    "At times this restriction works to The Medium’s advantage, as it creates a sense of confinement when encountering Niwa’s more unwelcome resident. As mentioned previously, the game’s main antagonist is The Maw, a tall, spindly creature with a whipping tongue, tattered wings and which inexplicably enjoys walking around on its tippy toes. Voiced by Troy Baker (yep), this creature is wildly unnerving, muttering skin-crawling threats at you when it comes in close proximity. Marianne can only see this creature when in the spirit world, where she can protect herself to some degree using the energy she gathers from the spirit well, but in the real world it appears as only a faint outline, with the only options being to outwit it or stealth around it.",
    "While the Maw plays an integral role in The Medium’s story, it begins to lose its fear factor the more you encounter it. There are occasions when Bloober shakes things up, having the adversary approach you in a different way – and in those moments it had our heart racing. But those seemed to become less and less as the game progressed, as the game leaned more into the story than the horror.",
    "That’s not such a bad thing, however, as the story is gripping. We found ourselves hooked from the start, intrigued to unearth more of Niwa’s secrets and how Bloober weaved Poland’s history into the narrative. There are twists aplenty too and the game goes in directions we didn’t necessarily expect. In the first three-quarters of the game or so, this overarching story is well-paced, letting you slowly uncover what exactly is happening. However, in the latter part of the game (without spoilers) – and arguably the most critical – the pacing loses its footing and it almost feels rushed. There’s a lot of information flying at you at once and while you can get the gist of what’s happening, the finer details are easy to lose – several days later we’re still trying to piece together some parts despite picking up every collectible we could. Miss a key line, and you may be completely lost.",
    "It’s a real shame as we were completely taken in by The Medium for the most part. If we had been given more time to marinate on the bigger revelations in the endgame, given more time to breathe, then it would have done wonders for the impact of the story.",
    "While there’s some aspects where The Medium falters, the atmosphere is not one. Bloober does a fantastic job of making you feel consistently uneasy, through both the previously mentioned environment of Niwa and its wonderfully crafted score. One The Medium’s biggest flexes is that its score has been jointly composed by Silent Hill composer Akira Yamaoka and Bloober Team’s own Arkadiusz Reikowski. While Yamaoka was tasked with composing the spirit world’s score, Reikowski scored the real world.",
    "The two scores work brilliantly both together and standalone, with shift between the two scores being immediately obvious as you step from one world into the other. While the spirit world is immediately haunting, laced with intermittent chimes and melancholy vocal sounds, in contrast, the real world score gives us major 80s horror vibes thanks to its heavy use of a synthesiser similar, in many ways, to Stranger Things.",
    "And it’s not just the score with harks back to classic horrors of days gone, The Medium features a fixed camera, a la Silent Hill and classic Resident Evil. While we don’t see this camera angle used much in modern games, it does wonders in creating the constant feeling that you’re being watched – though may be difficult to get used to for those who haven’t played classic horrors.",
    "All this comes together to make a game that feels like a fitting tribute to these titans of the genre. It creates an unpredictability to The Medium that sees players constantly on edge from the fear of the unknown, rather than expecting a jump scare when it seems fitting to have one. The Medium only has one jump scare and, when it’s used, it absolutely works because you never expected it in the first place.",
    "The Medium is smarter than your average horror game. Rather than relying on jump scares for cheap thrills, it does a brilliant job of slowly building an atmosphere that has you on edge throughout. But this isn’t a game that is just about scaring the bejesus out of you, there’s also a well-crafted story here that contains plenty of twists and turns to keep you guessing – and that add to the game’s unpredictability - while the split feature adds an extra layer to the classic puzzle element.",
    "However, The Medium is let down by its poor pacing in the endgame that could see you losing track of its story if you don’t pay close attention, and which tries to do a lot (maybe too much) in a short space of time – after all the game is just 11 hours long. We also found that we wanted more of an opportunity to explore The Medium’s world and, at times, it felt like we were being shoved along in the story with little time to breathe or take in our surroundings.",
    "It’s not the longest game, but the price reflects that, where most Xbox Series X games could set you back around £60/$70, The Medium comes in at around £40/$50 - and it’s free on Xbox Game Pass.",
    "The Medium is recommended for those who love a classic horror game that is smarter in the way that it terrifies you and – despite its downfalls – we thoroughly enjoyed it."
  ],
  "headers": {
    "4": "It all started with a dead girl",
    "12": "A story let down by pacing in the end game",
    "16": "Classic horror modernized",
    "20": "Verdict"
  },
  "links": {}
}