{
  "source": "https://www.techradar.com/reviews/abelohost",
  "title": "AbeloHost review",
  "category": "computing",
  "updated": "2021-05-20T08:41:29Z",
  "author": "mirza-bahic",
  "summary": "World-class offshore hosting services for a fair price",
  "verdict": "AbeloHost is a Dutch hosting service that provides offshore web hosting, VPS, dedicated servers, 24/7 support and first-rate data protection.",
  "pros": [
    "Affordable offshore hosting packages",
    "Capable and courteous customer support",
    "Decent range of hosting services",
    "Dutch laws that ensure privacy and data security",
    "Various payment methods including cryptocurrencies"
  ],
  "cons": [
    "No free domain registration for first-time users",
    "No website builder",
    "There are cheaper options on the market"
  ],
  "article": [
    "AbeloHost was established back in 2012 in the Netherlands. From the get-go, the company’s mission has been to provide high-quality offshore web hosting, including shared hosting, VPS, and dedicated servers in an oversaturated market that doesn’t always combine high service quality with reasonable pricing. In just a few years, AbeloHost grew into one of the market leaders in offshore hosting. The company now services more than 5,000 registered domains and over 10,000 clients and counting.",
    "Besides combining high-quality servers with equally good service, AbeloHost strives to uphold the company’s commitment to absolute data privacy and safety practices. All of the company’s data centers are situated in the Netherlands and under the exclusive jurisdiction of the Dutch law, which is known for its stringent privacy regulations and freedom of speech protections. That should ensure total data security, data privacy, and a wide range of content acceptability for all of AbeloHost’s customers, wherever in the world they might be based. What’s more, all of the company hardware is privately owned, which means that it is not accessible to anyone else other than the AbeloHost staff and data center personnel.",
    "AbeloHost’s website looks modern yet it is very user-friendly and well-organized. All information about the company and its various products is presented in a clear manner, and the site navigation is intuitive and straightforward. Apart from English, it is available in Spanish, Chinese and Japanese language.",
    "While the website does not have a blog like many of its competitors, it does feature a dedicated knowledgebase with tutorials on various topics, from how to transfer your site with no downtime in four easy steps to how to manually set up WordPress on shared hosting and much more. All in all, these are excellent resources for people looking to learn how to run a website professionally.",
    "As for social media, AbeloHost is on Facebook, Twitter, and LinkedIn, but the Facebook profile is the only one that gets regular updates. A more solid social media presence is something that the company could definitely work on in the future.",
    "AbeloHost offers four shared hosting plans varying in size and price, managed hosting, four VPS ones and a myriad of different-sized plans for dedicated server solutions. However, some of the dedicated server best deals might be out of stock, so if you want to wait for one of those, you can join AbeloHost’s queue system by writing them a support ticket.",
    "Interestingly, the VPS options supports Alpine Linux distribution, which can be especially gppd for small applications and websites.",
    "AbeloHost’s most budget-friendly package is the shared hosting plan descriptively titled “SSD Web Pro v1” and it is currently available for €5.99 ($7.04) per month. It provides users with 50GB of bandwidth, 10GB of SSD web space, 0.7 core/512 MB of RAM, dedicated IP and free SSL certificates, all of which sounds pretty good.",
    "If AbeloHost’s services do not meet your expectations, you can claim a full refund thanks to the 30-day money-back guarantee.",
    "The company also supports an amazing array of payment gateways, including credit cards, bank transfer, PayPal, Bitcoin and WebMoney.",
    "AbeloHost’s flagship features that most users will find appealing are a wide range of hosting solutions and the company’s dedication to free speech and data security. It also doesn’t hurt that users can easily scale their plans within the company. With one-click users can upgrade from the lower-priced shared solutions to VPS or dedicated servers once their websites start growing and generate a lot of traffic, which could save you a lot of trouble in the long run.",
    "All those thinking of switching from another host should know that AbeloHost also provides website migration services free of charge. If you have purchased any of the AbeloHost annual plans, you can get your site migrated without paying a dime. It’s all done for you as part of AbeloHost’s service offering, which include: full file migration, optional domain migration, Cloudflare-protected nameservers and free installation of your preferred control panel.",
    "Setting up your AbeloHost account is quick and easy. The first thing you need to do is to decide if you want to register a new domain (which is free of charge for new users), transfer an old one, or update your nameservers. Given that the billing cycle is fairly flexible, you can decide on practically anything between one month and three years. Next, you’ll tend to details about your plan, control panel, and offshore backup option. If you want to include any of the suggested add-one (like DNS management, ID protection or e-mail forwarding), this is where you can do it.",
    "After this, you’ll be asked to provide (an expected amount of) your personal information, create a password, opt for a payment method and decide whether you want to be on AbeloHost’s mailing list or not.",
    "One of the highlights of hosting with AbeloHost is that their technical team will install all control panels for their customers without any additional fee. The available options include cPanel, VestaCP, zPanel, Sentora and ISPManager, so with what ease you’ll be able to manage all aspects of your website depends on your prior experience with any of these. From your control panel (and thanks to Softaculous) more than 200 of popular apps (WordPress, Joomla, PrestaShop, AbanteCart, Magento, phpBB and so forth) can be made part of your arsenal with a few clicks.",
    "Additionally, AbeloHost also provides an auto-deployment feature, which is pretty unique. It automatically installs a web panel and content management system like WordPress without any human interaction, which makes it really simple for non-techy people",
    "It’s worthy to note that AbeloHost offers no free daily backups, but if you want to stay smart on security and safeguard your data, they can be yours for €5.00 ($5.88) or more.",
    "AbeloHost’s customers should benefit from infrastructure redundancy, since the company partners with two data centers in Amsterdam, as well as another in Dronten, to ensure maximum uptime in case of emergency or system failure. Despite this, AbeloHost offers no uptime guarantee to its users, so we had to check first-hand how they will prove themselves on that matter. After monitoring the uptime of AbeloHost’s main website for a month nonstop (by utilizing UptimeRobot), we were encouraged by its pretty good performance, with 99.95% of uptime. Only one instance of downtime was recorded and it persisted for 18 minutes without a break.",
    "Although the testing period was relatively short, it can often indicate a general trend, which (luckily for AbeloHost) looks very promising.",
    "As for speed, AbeloHost claims they purchase the latest Intel processors, RAM, and storage drives every single year, so as to provide maximum power and speed. However, after testing the speed performance of AbeloHost’s main website (via GTmetrix), we got rather unremarkable results and a conclusive grade of C (68%). On a positive note, the time it took for the page to entirely load was 4.3 seconds, which looks good compared with the average result of 8.1.",
    "The first support options you’ll probably find on AbeloHost’s main website is the one to open a support ticket, and someone should be ready-and-willing to aid you around-the-clock. You might have to wait a while to get a reply (around half a day), but in our experience it was worth it, since the response we got provided us with everything needed, kindness included. Their dedicated customer support team seems ready to assist with any hosting-related issues and share quality advice about online marketing, website design and business development. Alternately, you can get in touch with the support team via live chat, but right now it is available during the working hours only.",
    "If you are resolved to stay self-reliant, there are several options for you as well, although these would benefit from a bit of improvement. AbeloHost’s knowledgebase isn’t exactly bursting with tutorials, but those it does provide are easy-to-follow and packed with pictures, so even the novices can put them to use without any difficulties.",
    "An e-mail address is available as well, but it is reserved for reports of abuse.",
    "Let’s compare AbeloHost with Flaunt7, a popular and somewhat similar hosting provider, and see if it stacks up. The main disadvantage to using Flaunt7 is that while its servers are located offshore in the Netherlands, its headquarters aren’t. They are based in India, which could result in potential legal issues and the lack of on-site support. Pricing-wise, Flaunt7 is by far the cheaper option, but AbeloHost offers higher-quality customer service. So, if you are looking for a reliable, premium offshore host, AbeloHost is the way to go. However, if you only have a limited budget to spare, Flaunt7 is likely to fit the bill.",
    "Shinjiru, whose service offering is very similar to that of Flaunt7, has more affordable plans than AbeloHost. However, there have been some complaints by customers about the company’s subpar customer service. In contrast, AbeloHost’s support team has been extremely helpful, and there have been no issues that we know of in that regard. In addition, AbeloHost offers standard DDoS protection with all its plans, while Shinjiru doesn’t include it in its cheapest plans. On the other hand, since Shinjiru maintains multiple servers across Europe and Asia, it is a better choice for those who insist on a specific server location for legal or logistical reasons.",
    "Bluehost is another budget-friendly, wide-ranging and easy-to-use alternative to AbeloHost. However, all of their servers are US-based, which might ward off offshore customers. Additionally, Bluehost appears to be a much cheaper option, but it charges significantly more after the promotional period runs out. AbeloHost, although more expensive at first, has no hidden fees and what you see is what you’ll get, at present and in the years to come.",
    "Although AbeloHost’s 30-day money-back guarantee looks attractive, it is quickly overshadowed by HostGator’s 45-day guarantee. In addition to all of its novice-friendly features (free domain registration, SSL certificate and one-click installs) HostGator offers its own drag-and-drop website builder, while AbeloHost doesn’t have one on the offer. However, both of HostGator’s data centers are situated in the USA, which is less convenient for offshore users.",
    "Being one of the largest and oldest offshore hosting companies on the market, AbeloHost is without a doubt a safe pick for those looking for offshore hosting. It may not be the most budget-friendly option on the market, but the pricing is rather reasonable for an offshore host and it does provide a good value for money.",
    "However, if you are searching for an onshore host, both HostGator and Bluehost can supply you with everything needed and you can get it for a song."
  ],
  "headers": {
    "5": "Plans and pricing",
    "10": "Ease of use",
    "17": "Speed and experience",
    "20": "Support",
    "23": "The competition",
    "27": "Final verdict"
  },
  "links": {
    "AbeloHost": "https://abelohost.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "SSD Web Pro v1": "https://abelohost.com/offshore-web-hosting/",
    "SSL certificates": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "Flaunt7": "https://flaunt7.com/",
    "Shinjiru": "https://www.shinjiru.com/",
    "DDoS protection": "https://www.techradar.com/news/best-ddos-protection",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator"
  }
}