{
  "source": "https://www.techradar.com/reviews/ps5-pulse-3d-wireless-headset",
  "title": "PS5 Pulse 3D Wireless Headset review",
  "category": "gaming",
  "updated": "2021-10-07T20:52:31Z",
  "author": "nick-pino",
  "summary": "The Sony PlayStation Pulse 3D Wireless Headset is the must-own PS5 headset",
  "verdict": "The Pulse 3D Wireless Headset makes a strong case as the de facto headset for the PS5. It offers decent stereo sound, an easy setup and a quality mic, plus it gives you a taste of Sony’s Tempest 3D AudioTech. The plastic build quality is a bit off-putting and the 12-hour battery life runs out fast, but otherwise this is a solid accessory that offers a lot for its $99 / £89.99 / AU$159 price point.",
  "pros": [
    "Solid stereo sound",
    "Good mic quality and mic monitoring",
    "Seamless compatibility with PS5"
  ],
  "cons": [
    "Plastic build quality",
    "Weak 3D audio effect",
    "12-hour battery life"
  ],
  "article": [
    "It’s a longstanding tradition that, with every new Sony console, comes a new PlayStation headset: it happened on the PS3 with the first Wireless Stereo Headset, then on the PS4 with the Gold Wireless Stereo Headset, and now finally on the PS5 with the Sony PlayStation Pulse 3D Stereo Headset.",
    "Like its predecessors, the new PS5 Pulse 3D Headset is definitely a strong performer in the sound department, offering detail-rich stereo and surround sound, but the addition of new features like 3D Tempest AudioTech support is what makes this probably the must-own PS5 headset.",
    "For social and competitive gamers, extras like mic monitoring and individual level-setting for chat and game audio help set the headset apart from your standard pair of wired headphones you have laying around, and the mic quality is fairly good all things considered. It doesn't hurt either that the setup is dead simple and will soon be available in a new color: Midnight Black.",
    "While it’s not without problems – its 12-hour battery runs out fast, its build quality isn’t the best and the 3D effect does take some tuning to get right – the Pulse 3D is a rock-solid PS5 headset and one that we’d recommend you pick up when you finally get your hands on the console.",
    "The white Sony PlayStation Pulse 3D Wireless Headset release date was October, 30 2020, almost a full two weeks ahead of the launch of the PS5 release date November 12, and a Midnight Black version will be available starting in October 2021. They're compatible with both the PS5 and PS4, and step up to replace the Sony Platinum Wireless Headset for the PS4 that came out back in 2017.",
    "In terms of price, the Sony Pulse 3D Headset comes in at $99 / £89.99 / AU$159, which might sound expensive considering the price of other third-party headsets, but that’s actually fairly reasonable considering all of the things the Pulse 3D brings to the table.",
    "That said, if you’re looking for some alternatives, you could check out the Turtle Beach Recon 200 that’s compatible with the PS5 and priced at only $49.99 / £29.99 / AU$77.99, however you’ll be making a sacrifice in the sound performance department and overall feature set. For now, the PlayStation Pulse seems to offer the best price-to-performance ratio of any PS5 headset.",
    "While the original Sony Wireless Headphones matched the bulky, jet-black PS3, the new Pulse 3D Headset matches the aesthetic of the PS5 perfectly with a two-tone black-and-white color scheme. It's sleek, too, with an adjustable top strap that perfectly cradles your head. It’s a balanced look between classic and space age without straying too far in either direction.",
    "In terms of weight, the Pulse 3D weighs in at 295 grams, which is about average for a pair of over-ear headphones. The cans themselves house medium-sized 40mm drivers and the clamping force of the headphones – i.e. how much pressure the cups put on your head - is just enough to keep them on without them falling off.",
    "Like before, Sony has chosen to use a leatherette material for the earcups that feels soft and supple and a plastic bridge that feels the slightest bit flimsy. Sure, going for silk and metal might’ve made them a bit cosier on the ears and sturdier, but the pleather stays relatively cool and comfortable after extended use and the plastic, while definitely not ideal, does keep the cost of the headset down.",
    "The outside of the left earcup plays host to the controls: a rocker for game and chat audio that can raise either individually; a microphone monitor toggle so that you can hear yourself; a volume rocker; a mute button and the power switch. There’s also a 3.5mm jack that can connect to any 3.5mm device using the included cable and a USB-C port for charging.",
    "Because the headset has a 3.5mm jack, you can use the headset without the included dongle and you'll still get to hear 3D Tempest AudioTech, though that will drain the battery on the controller faster. That said, it's probably best that, when using the headphones with the PS5, you should make sure the dongle is plugged in and connected instead of connecting the headphones to the controller with the audio cable.",
    "The only problem with the design is that, realistically, it’s not the kind of thing you’d wear outside of the house. If you’re planning on buying a pair of headphones you can take with you on the go, the PlayStation Pulse 3D Wireless Headset isn’t going to be it.",
    "Setting up the headset is as simple as plugging the included dongle into one of the PS5’s USB ports and turning the headset on. The console will automatically connect to the headset and direct all audio there instead of the TV’s speakers. You can also plug the dongle into a PC's USB port if you want to use it there, but you won't get surround sound that way.",
    "Once it's all connected, the Pulse 3D Wireless actually sounds good, with solid stereo and simulated surround sound. Songs on Spotify didn't have as much detail or clarity as they did on other traditional headphones, and some games like Fall Guys or Genshin Impact didn't see much of a boost from the headphones, but by and large the stereo and simulated surround experience was decent, if not quite impressive.",
    "Of course, what you'll really want to buy the Pulse 3D Wireless for is its compatibility with Sony's new Tempest 3D AudioTech that it's implementing in all its first-party games that give them a more realistic and immersive sound quality. In practice, using the Pulse 3D with Spider-Man: Miles Morales meant being able to hear more realistic city sounds, while in Sackboy: A Big Adventure, every sound effect had a distinct directionality to it.",
    "The list of games that support 3D Tempest AudioTech is fairly limited at the moment - in fact, it's just Marvel’s Spider-Man: Miles Morales, Marvel’s Spider-Man Remastered, Astro’s Playroom, Sackboy: A Big Adventure and Demon’s Souls - but you can also expect support for Gran Turismo 7, Returnal, Destruction AllStars, Ratchet & Clank: Rift Apart, Horizon Forbidden West, Resident Evil Village and more later down the road.",
    "Unfortunately, none of the games we tried with the headphones so far sounded as immersive as, say, a Dolby Atmos film due to the limited nature of the 3D sound, but getting a taste of the 3D AudioTech was preferable to not hearing it at all.",
    "Over the course of a few weeks, we talked to friends on PS5 with the headset and family on Google Meet when we connected the headset to our laptop. Both said we sounded fine, though not crystal-clear, and that it was comparable to speakerphone. The one added bonus of the Pulse 3D Headset is that it does have built-in mic monitoring, which allows you to hear yourself when you're talking. It's a nice feature to have for first-person shooters where the action can sometimes override the chat audio, and you can be sure you're coming through loud and clear.",
    "In terms of battery life, Sony claims that the Pulse 3D Wireless Headset should last about 12 hours on a single charge, and we found that claim to be pretty accurate, give or take an hour depending on how loud we listened to music and if we forgot to turn them off after we were done using them for the day. Unfortunately, that 12 hours is around three hours less than comparable headphones from Astro, Razer, Turtle Beach and other headphone makers, but it shouldn't be a deal-breaker unless you're someone who can never remember to plug your headphones in at the end of the day. (Don't worry, we're guilty of it, too.)",
    "Overall, the headset's performance was far better than we expected, and while it isn't the first name in clarity or soundstage, its workman-like performance and ease-of-setup plus the support for 3D Tempest AudioTech should be more than enough to keep most gamers happy."
  ],
  "headers": {
    "4": "Price and release date",
    "7": "Design",
    "13": "Performance",
    "21": "Don’t buy it if…"
  },
  "links": {
    "Wireless Stereo Headset": "https://www.techradar.com/news/gaming/sony-releases-official-wireless-ps3-headset-960419",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Gold Wireless Stereo Headset": "https://www.techradar.com/reviews/gaming/gaming-accessories/playstation-gold-wireless-stereo-headset-1229917/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Sony Platinum Wireless Headset": "https://www.techradar.com/reviews/playstation-platinum-wireless-headset"
  }
}