{
  "source": "https://www.techradar.com/reviews/atomstack-cambrian-pro",
  "title": "Atomstack Cambrian Pro review",
  "category": "computing",
  "updated": "2021-02-19T05:17:24Z",
  "author": "ali-jennings",
  "summary": "A 3D printer that can print flexible filament",
  "verdict": "Ever tried to print flexible filament? If you have, you'll know what a headache it is, at least that was until the Cambrian Pro. This 3D printer has a relatively simple design with an interchangeable head, enabling you to switch between flexible and standard filament printing. Documentation is generally good and runs through assembly, maintenance as well as basic Cura set-up. Standard filament print quality is average, but where this printer excels is in printing rubber.",
  "pros": [
    "Prints rubber",
    "Easy to use",
    "Good documentation"
  ],
  "cons": [
    "The slightly odd touchscreen interface",
    "Some design elements could be better",
    "Average standard filament print quality"
  ],
  "article": [
    "Over the years, I've seen a variety of different solutions to flexible filament printing. While most solutions work, it usually involves a swap of the print head along with quite a bit of adjustment and fiddling about.",
    "Enter the Atomstack Cambrian Pro, designed from the outset to print flexible filament, with the option, after a quick swap of the print head, to print standard materials as well.",
    "The printer on arrival does require some assembly, but it's nothing too challenging, and thankfully the manual is quite detailed in its layout helping to explain where everything fits.",
    "After the machine is bolted together, which takes between 5 and 10 minutes, you're ready to go. There's a series of printable models on the supplied MicroSD card that have been designed for rubber printing, or you can import and use your own using Ultimaker's Cura software.",
    "This printer's main focus is rubber printing, and the models supplied demonstrate impressively what's possible.",
    "If you don't always want to print in rubber, then a quick swap of the head and you can print with standard filaments such as PLA, ABS, and PETG.",
    "From the machine's look to the use, there's a definite hint of an engineer rather than a product designer. Some things on the machine such as the push-fit ribbon cables aren't designed for everyday use or longevity.",
    "Other aspects such as the belt adjusters are function are definitely as an engineer would have them, but not a product designer.",
    "However, this is a unique machine in its main aim to print rubber, which makes it stand out in an ever-increasingly crowded market.",
    "At present, there's an increase in multiple-use 3D printers with dual or even triple function. The benchmark of this type of machine has to be the SnapMaker 2, which is finessed in design and support.",
    "The Atomstack has reflections of the Snapmaker with it's all aluminum design, but the Snapmaker is a streamlined commercial product, whereas the Atomstack is a little rough around the edges.",
    "Checking through the manual and it's well-detailed and accurately points out how to construct the flatpack machine and maintain.",
    "Once constructed, it is all seems solid, and the manual runs through all the points that need to be checked regularly to maintain quality printing.",
    "Looking over the design once constructed and there's nothing outwardly wrong with the parts or construction.",
    "Still, despite the main solid build of the 3D printer, the ribbon cable end that pushes fits into the print head is a worry and a weak point. The cable isn't finished with the standard style connector but instead is left as just the push-fit ribbon.",
    "That aside, the construction once tightened is all solid enough, and the full metal frame design gives it a very neat look on the workbench. One feature that stands out from the outset is the touch screen interface. This enables you to quickly go through the machine settings, select materials, add custom materials, configure the bed levelling and check parameters.",
    "The interface while good isn't the most intuitive that I've seen, and there are some screens, such as the one that shows the machine's parameters, that leaves you a little baffled as to why it's there.",
    "While there's the touch screen which gives the machine quite an advanced feel, other features that usually go hand in hand with touch screen inclusion are missing.",
    "Bed levelling is done manually as is filament loading and nozzle cleaning; then there's no filament detection or Wi-Fi. What you have with the Atomstack Cambrian Pro is a 3D printer that has been designed with flexible printing at its heart.",
    "The Atomstack Cambrian Pro is available in two sizes, the Pro, which I've looked at in this review and the larger Max. Essentially aside from the size, they're identical.",
    "Both feature an interchangeable tool head, the model that I'm looking at comes with the flexible and standard 3D print head. Looking through the literature and it looks as though there's also the option for a laser engraving head.",
    "The printer's manufacturer has developed its TPR filament, which offers good elasticity and high resilience rated at 50-70A hardness with a > 50% resilience rate. This compares to NinjaFlex with a Shore Hardness of 85A and resilience or 20%.",
    "Essentially TPR is more flexible and less likely to break when flexed making it ideal for real-world solutions.",
    "Atomstack has also invested in decent hardware, and motor drivers that help ensure the machine makes very little noise, aside from the virr of the fans.",
    "The print area is decent at 235mm x 235mm x 150mm, enabling you to print a good range of products. If you do need bigger, then there's the Max model.",
    "The design style means that all motors, electronics, and cables are all neatly tucked away and ribbon cables have been used on the exterior to complement the machine's clean lines.",
    "The touch screen is a nice addition and very responsive, enabling you to dip into settings and select prints that have been loaded onto the MicroSD that fits into the slot on the machine's main base.",
    "One of the main features is the swappable print heads. These are held in place by three bolts and then the ribbon data cable push fits in place.",
    "What is unusual, but makes absolute sense is that the flex head uses larger 2.85mm filament while the standard head uses 1.75mm filament.",
    "Both options print out onto the lattice glass Hotbed which offers a better hold than flat glass.",
    "Machine set-up with the help of the instructions is relatively fast. Follow the instructions to bolt in the frame, attach the filament reel holder, LCD screen and head of choice.",
    "Then clip and slot in the cables and wires, switch on and then run through the calibration test and you're done.",
    "For this test, I use CURA as there were instructions on the set-up in the manual, but you can configure your chosen software for use with the Cambrian as it doesn't ship with its own.",
    "It would have been nice if Atomstack could have provided a Cura profile, but maybe that will come later.",
    "Either way, set up and configuration is straight forward, and you can expect to get set-up and started with your prints in around 30 minutes.",
    "Fitting either of the two print heads requires you to bolt the head to the frame with three small bolts and then push-fit the ribbon cable. The bolts are small and a bit fiddly to tighten with the head not fitting quite as flushy as you'd expect. The real issue is the ribbon cable, which feels very fragile, I've been told by Atomstack that this cable design is due to be updated in the final version of the machine.",
    "Once you have CURA configured, files can be saved to MicroSD card and inserted into the machine's base. There's also a MicroSD card slot in the top of the LCD, but this doesn't seem to recognise the card, so maybe it's for something else.",
    "Starting and printing with the flexible filament, and the results were impressive. The large 0.8mm nozzle ensures a big print and the quality of the ball, type and shoe that I printed were all excellent.",
    "There were a few splits in the side of the tire wall, but this is due to wall thickness rather than the print quality, and the shoe was one of the most amazing things that I've seen come out of a 3D printer in years.",
    "The Atomstack surprisingly brings back the wow factor to 3D printing.",
    "This is a flexible filament, and by flexible, I mean flexible well beyond any flexible filament I have printed with in the past.",
    "Switching over to PLA to check out the standard printing ability and the printer put in an average performance. It prints OK through the direct drive 0.4mm nozzle, but the real focus of this printer should be the flexible printing ability.",
    "Over the month's test, the printer produced decent rubber prints, however, the ribbon cable did prove to be a point of weakness and eventually failed.",
    "Multi-use 3D printers are the theme for 2021, and the Atomstack is the first that I've seen that prints flexible and standard filament all at a good standard.",
    "Swapping between each head is quick but you need to be incredibly careful with the ribbon cable. That push-fit design is far from ideal and did cause issues during the test as cable end contacts started to lift making it difficult to re-insert into the chosen print head. I have spoken to Atomstack about the ribbon and they've said that this is being looked at and should be updated in the final design.",
    "The printer is simple in design despite lacking some of the finer and more advanced features of the latest printers. It prints rubber exceptionally well and standard filament prints are ok.",
    "If you need to print rubber then the Atomstack Cambrian is a great choice, but I would stick to using it as a one function printer if that cable isn't updated."
  ],
  "headers": {
    "9": "Design",
    "19": "Features",
    "30": "Setup in detail",
    "37": "Performance",
    "43": "Final verdict"
  },
  "links": {
    "Atomstack Cambrian Pro": "http://atomstack3d.com/cambrianpro",
    "3D printers": "https://www.techradar.com/best/best-3d-printers",
    "SnapMaker 2": "https://www.techradar.com/reviews/snapmaker-20"
  }
}