{
  "source": "https://www.techradar.com/reviews/apple-homepod-review",
  "title": "Apple HomePod review",
  "category": "audio-visual",
  "updated": "2021-08-16T11:56:29.492Z",
  "author": "gareth-beavis",
  "summary": "The Apple HomePod offers superb sound, but it's a so-so smart speaker",
  "verdict": "With the Apple HomePod, we're really reviewing two things at once: a premium speaker and a smart home hub. In the former category, the HomePod is excellent, with amazing sound and incredibly intuitive set-up. But in the latter Siri is only middling in its implementation, and the fact that you're not able to break out of the Apple ecosystem for many key functions also rankles.",
  "pros": [
    "Amazing sound quality",
    "Siri voice accuracy is high",
    "Attractive, understated design"
  ],
  "cons": [
    "Siri is limited",
    "No Bluetooth streaming",
    "Apple Music subscription needed for a worthwhile experience"
  ],
  "article": [
    "[Update: Having first gone on sale at the start of 2018, the Apple HomePod smart speaker is now being discontinued, with Apple turning all of its attention to the smaller (and cheaper) HomePod Mini instead.",
    "That doesn't mean it won't get any updates, though. Both the HomePod and HomePod mini look like they'll see the addition of Spatial and Lossless audio options soon, as the latest beta features previews for both for some users.]",
    "The Apple HomePod isn't just a fantastic device and solid smart speaker option, but it represents the changing focus of the tech giant over the past decade – from the golden age of the iconic iPod right up the latest and greatest iPhone models.",
    "While it's recently been joined by the cheaper Apple HomePod Mini, there's no indication that the original smart speaker will be discontinued in the near future – and it's even been given a an update that brings spatial audio to the smart speaker, working in 5.1, 7.1, and Dolby Atmos.",
    "That's not the only new feature. The Apple HomePod can now double up as an intercom system for your home, letting you send voice messages to other HomePods, iPhones, iPads, and even AirPods.",
    "Another exciting new feature is Pandora integration – it's the first time a third-party streaming service has been available on the Apple HomePod, and it could pave the way for future partnerships with the likes of Spotify and Tidal.",
    "Of course the HomePod may borrow half of its name from the iPod, but it seems that we're still asking that same question posed by previous Apple devices: is it worth paying large prices for an Apple-branded device that fits seamlessly into its own ecosystem as opposed to a third party wireless speaker like the Sonos One?",
    "In many ways the HomePod was a late entry to the smart speaker game, but Apple has never worried too much about that. The executives in Cupertino seem content to let the rest of the industry stride ahead with a new form factor, identify the issues and then offer something that ‘just works’. Although it's generally for a higher price, Apple also tends to bring the most stylish designs and most reliable tech to us all.",
    "That’s what has happened with the HomePod, though not in quite the same way as previously. There’s no denying that the sound quality of Apple’s speaker is top-notch, but in a marketplace where Amazon and Google have such entrenched smart speaker/voice assistant ecosystems, can a great-sounding-but-imperfect device be worth buying?",
    "Here are our thoughts on the Apple smart speaker, as well as some testing we've done with two HomePods, now you can use them in a stereo setup.",
    "As intimated, the HomePod price isn't a cheap speaker – the price at launch was a weighty $349 / £319 / AU$499, and the speaker began shipping on February 9, 2018 in selected territories across the world.",
    "That means, at launch, it was one of the most expensive smart speakers on the market – and certainly the most expensive mainstream option – but Apple is hoping to justify that price by embedding Siri inside and offering premium-quality audio too.",
    "These days however, you can usually find it cheaper, hovering around the $299 / £279 / AU$469 mark.",
    "The Apple HomePod is so, well, Apple in the way you’ll use it. As with the AirPods, simply hold your phone near the unit and your handset will send over your Apple ID and Apple Music preferences, and fill in all the long-winded Wi-Fi passwords that you’re proud you remember but thankfully don’t have to type in.",
    "The set-up process was only delayed for us by the fact that we needed to upgrade to a newer version of iOS on our iPhone, which is a prerequisite for making the speaker work.",
    "That highlights one key thing about the HomePod: you’ll need to have an iPhone or iPad to set it up in the first place.",
    "It’s hard to see why you’d buy this speaker without owning one of those already, but it trims the target audience down right from the outset.",
    "However, the set-up process does highlight one of the nice features of the HomePod: the glowing light on the top (which turns into the multi-colored Siri logo when you’re issuing commands to it later on).",
    "The whole process is so swift though – compare it to the long-long-long-winded set-up process for the Amazon Echo or Sonos One – and you’ll be so glad that you don't have to spend a minute wafting your iPhone around the room to calibrate the sound levels.",
    "Add to that further such conveniences in day-to-day use – if you need to use a new Wi-Fi network that's already set up on your phone, you just literally hold the phone nearby and it's done – and you can see how Apple has smashed the competition when it comes to ease of use, one of its real hallmarks.",
    "The HomePod will actually just work out where it is within the room simply by playing some music – it’ll assess its physical surroundings by hearing how the sound it emits bounces around, and if there’s a wall behind it will send certain sections of what you’re listening to that way, while the main vocals or instruments will fire forwards.",
    "If it's not adjacent to a wall then the HomePod will chuck the sound out in a 360-degree space, although in most cases we’d imagine people would use the speaker up against a wall.",
    "After that’s all set up, you can leave the house with your iPhone and your family or housemates will still be able to use the speaker, although you can turn off ‘personal requests’ based on your information if you don’t want other people meddling with your business.",
    "(Thankfully you can also stop requests to the speaker messing with your music listening history – if you’re trying to build decent automated playlists on Apple Music, your housemates playing Justin Bieber and Moana on repeat won’t ruin everything.)",
    "If you’re thinking of picking up the HomePod you may want to go with both hands to start with. That’s because this speaker is incredibly dense, packing 2.5kg of weight into its 172mm (6.8-inch) high frame.",
    "It feels a good deal heavier than it looks, and that’s because there are so many speakers in there. We’re talking a woofer and seven tweeters, each with its own amplifier, and six microphones spread around to help pick up your voice when you're hailing Siri.",
    "And once its placement is locked in, you’ll need to answer one more question: how are you going to run the power lead that comes out the back? It’s the only wire on this device, and the only thing that resembles a port too. There’s no other physical connectivity on offer, which sadly means no aux-in port for connecting up a record player or other device.",
    "All you’ve got is a squat little speaker covered in an ‘acoustic mesh’ that’s designed to protect the device while letting out as much sound as possible. It looks as unremarkable as you’d expect – there are no decorative flourishes here – and the only break in the mesh is on the top, where a round, reflective disc sits.",
    "This is, as we've mentioned, where the glowing light pulses, signifying when Siri is listening and processing commands, and it's also where you'll find the plus and minus icons for adjusting the volume.",
    "It’s a shame there’s no haptic feedback from the buttons, but given that most of the time you’re going to be controlling the HomePod with your voice it's not a big deal.",
    "The HomePod isn't the most aesthetically pleasing speaker out there, but it's attractive in its simplicity. Some might think that, for the price, it should be more striking, but the speaker is certainly well-made.",
    "And be warned – the Apple HomePod can leave a white ring underneath if you leave it on certain surfaces (mostly more expensive, porous wood). Apple has acknowledged this and says it should wipe off, or disappear after a few days, but other claims state that it can leave a more permanent ring. Either way, think about where you place the speaker, as the vibration causes a reaction between the silicon base to the wood thanks to the deeper bass.",
    "We had our speaker on a wooden surface in our testing, but it was a thinner (well, cheaper) wood, and found no example of the staining... but it seems that more porous, expensive veneers are those in danger.",
    "In terms of processing, the HomePod is equipped with Apple’s A8 chip, created to be used in the iPhone 6 from 2015. That may sound a little old, but given that it was designed to power a whole smartphone, it’s actually quite a lot of power for ‘only’ a speaker, even one that’s sending and receiving commands to and from the cloud on a regular basis.",
    "The audio quality of the Apple HomePod is, to put it simply, premium. It fills a room easily, with clear separation between all elements of music tracks.",
    "It's certainly at its best when placed against a wall, pulling apart the sounds well, with elements such as voices coming through with incredible breadth.",
    "We're probably all used to hearing music of various quality throughout our day, from poor-quality headphones to whatever speakers our TV has, so using the HomePod will expose a lot of people who aren't audiophiles to new subtleties in music which they may not have heard before.",
    "The bass, in particular, is strong, but like most sounds emanating from the speaker the audio is stable, with sharp notes clipping very well. Listening to electronica, in particular, offered a lot of clarity, while bass guitar sounds brought a slight reverberation to the sound – those with an untrained ear in particular will be blown away.",
    "But it's the fusion of all this that's impressive – being able to hear thudding bass (a teeny bit too thudding at times, it has to be said) while at the same time being treated to crystal-clear vocals on top is a lovely experience.",
    "Sometimes you'll feel that things can get a little mixed together – bass guitar can be a touch muddy, or something like a violin can be easily overpowered – but compared to a cheap, low-end speaker the quality is just miles and miles ahead.",
    "The HomePod is loud too, with Siri asking if you definitely want to do that when you ask the speaker to play at full volume. And if there are any sound effects on a track, be it water splashing, rain or a faux-vinyl sound, the crispness again is amazing.",
    "In fact, the audio quality is so good that the biggest criticism we can level at the audio capabilities of the speaker is how you interact with it. Saying ‘Hey Siri’ over and over to achieve anything irks, and if you’re in a room with multiple people talking you’ll need others to shush otherwise their words are easily picked up, leading to random songs being played.",
    "It would be nice to somehow have your intentions registered without the need for a key phrase.",
    "Comparing the HomePod to the new Amazon Echo and the Sonos One, though, it bests both of them easily. Leaving aside the simple set-up, which is a godsend, the sound from Apple's speaker is the most expansive and clear... it just feels like there's more information flooding into your ears.",
    "The Amazon Echo is obviously the lowest-quality of the three in terms of sound quality, but it's not terrible. Listen to it in isolation and you'll like how it sounds, especially for the price. But the HomePod just destroys it with the level of audio on offer, making music sound, well, 'proper'.",
    "The Sonos One is understandably much closer to the HomePod when it comes to audio performance, but it's not quite as good – the only way we can describe it is as being 'narrower' in its sound, with the volume and breadth of the audio not matching Apple's efforts.",
    "That's not to say the Sonos One's sound quality isn't hugely clear and evocative – it thoroughly is – but there's just more power and depth from the HomePod.",
    "But now we get onto how you actually listen to things on the HomePod, and therein lies the rub. You need a subscription to Apple Music unless you just want to stream stuff from your iPhone – and even that can only be done using AirPlay.",
    "We say 'only' because you can't stream over Bluetooth to the HomePod. That's not a massive issue if you'll only ever want to play audio from an Apple product, but if you've got something else that can be used to stream Bluetooth music you're out of luck.",
    "Similarly, with no aux input you won't be able to use the premium sound of the HomePod to play your CDs, or your vinyl collection if you've jumped on that particular bandwagon.",
    "We can see the argument for not offering Bluetooth streaming – despite there being a Bluetooth connection on board to enable the HomePod to talk to other smart home devices – but not having an aux input is a missed opportunity.",
    "So, given the above, how are you supposed to get the most out of your HomePod? With the aforementioned Apple Music – meaning you're essentially going to need to pay $10 / £10 a month to keep using your new speaker.",
    "If you're already paying that, no problem – but if you're currently a Spotify user you won't be able to use that service without streaming it over your phone, which isn't ideal – you can still control the music using your voice in this mode, but it's a lot slower to respond.",
    "The fact that you're pretty much locked to Apple Music is a shame, but at least Spatial and Lossless audio format support is on the way, as both are perfectly suited to the HomePod's high-quality sound.",
    "Perhaps that's coming in the future. Or perhaps Apple thinks the sound is good enough with what's there – and as we've said, it is great.",
    "But the fact that you can only use Apple Music rankles, further highlighting how you need to be deeply embedded in the Apple ecosystem to get proper use out of the HomePod.",
    "Speaking of the future, thanks to AirPlay 2, you can now link two HomePods together to get stereo sound, or add in speakers from different brands to spread your sound to them too. The list of AirPlay 2-compatible speakers currently includes the Sonos Playbase, Sonos Beam, Sonos One and Sonos Play:5 speakers, plus speakers from Bang & Olufsen, Libratone and Naim are plugged for AirPlay 2 as well.",
    "We tried it with the Apple TV, and while the sound was brilliant we had to dive into the settings every time to tell the TV to play the sound through the speaker. Having two HomePods proudly sitting either side of the screen and automatically playing the audio from Netflix or whatever would be great.",
    "We were looking forward to having two HomePod speakers that we could AirPlay music to – while you can't use them as Bluetooth speakers, you can send music from an iPhone or iPod – but it was often disastrous.",
    "When trying to play Spotify to both, there was a noticeable lag between the two, that only constantly starting and disabling the sound could eventually fix. It certainly isn't the premium experience we'd expect from Apple.",
    "Also, there's no easy way to link the volume of both together. Yes, you can control the sound of each from the iPhone, but one would assume that you could link them both easily to the same level.",
    "Overall, it's not the premium dual-speaker experience we expected from Apple when stepping outside of just requesting music with your voice."
  ],
  "headers": {
    "10": "Apple HomePod price and availability",
    "13": "Apple HomePod set-up",
    "24": "Apple HomePod design",
    "34": "Apple HomePod audio performance"
  },
  "links": {
    "HomePod Mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "Spatial and Lossless audio options soon": "https://www.techradar.com/news/apple-homepods-get-two-big-features-but-not-everyone-can-use-them",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Apple HomePod Mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Apple HomePod can now double up as an intercom system": "https://www.techradar.com/news/the-apple-homepod-now-has-one-of-the-homepod-minis-best-features",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "record player": "https://www.techradar.com/news/best-turntables",
    "Apple HomePod can leave a white ring underneath": "https://www.techradar.com/news/apple-admits-your-homepod-might-stain-wooden-surfaces",
    "acknowledged this": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9703623288145988000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT208435",
    "iPhone 6": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6-1264565/review",
    "Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079"
  }
}