{
  "source": "https://www.techradar.com/reviews/sony-zv-e10",
  "title": "Sony ZV-E10 review",
  "category": "cameras",
  "updated": "2021-07-27T14:00:00Z",
  "author": "basil-kronfli",
  "summary": "Sony’s vlogging camera line-up gets a mid-range champion",
  "verdict": "The Sony ZV-E10 is a logical gap-filler in Sony’s lineup. A vlogging-focused camera with an articulating screen, boosted microphones, and a compact body, it’s a powerful little video tool and takes impressive photos. The ZV-E10 definitely isn’t perfect, with its three main limitations being significant rolling shutter when panning, a non-touch menu system, and no 4K capture at 60p (which isn’t common at the price). Get past those limitations though and you'll find an affordable, video-focused hybrid with solid audio options.",
  "pros": [
    "Compact size",
    "Articulating screen",
    "Great autofocus",
    "Impressive stills camera",
    "Solid audio credentials"
  ],
  "cons": [
    "Rolling shutter while panning",
    "No 4K/60p video mode",
    "Menu system isn’t touch-optimized",
    "No viewfinder"
  ],
  "article": [
    "Remember when Sony cameras didn't even offer vloggers so much as an articulating screen? That wasn't long ago, but the Sony ZV-E10 is the latest in a growing line of video-centric Sony cameras that fixes this limitation, while neatly filling a gap between its entry-level (Sony ZV-1) and mid-range (Sony A6100) offerings.",
    "Like an A6100 spin-off with a video-tastic bod, the ZV-E10 is effectively two parts old internals and one-part new body, with a dash of souped-up software. What’s even better is that this new entry wants to scratch your video itch without going over $1,000/ £1,000/ AUS $1,500 mark.",
    "So what’s the ZV-E10 packing in a nutshell? There’s a 24MP APS-C sensor at its heart, and it’s powered by Sony’s NP-FW50 batteries. The camera captures 4K video at up to 30fps (sadly not 60fps), and as far as still go, it does everything the A6100 does (11fps burst shooting, for example) while offering software smarts like the 'bokeh switch' and 'product showcase' setting that we saw on the Sony ZV-1.",
    "Sony’s made the ZV-E10 lightweight, with the compact body taking less space in a kit bag and hand than an A6100, for example. It’s smaller because it loses out on a viewfinder and flash, though Sony does add a larger microphone grille at the top of the camera, which in turn, boosts its sound recording.",
    "The ZV-E10 also sports a fully articulating screen, as well as both a mic-in and a headphone out; ports that are missing on its A6000-series counterparts. Now, while this all screams video, the 24MP sensor isn’t without its limitations; specifically, that well-documented jelly effect when panning with it. Just like the A6100, whose under-the-hood specs it matches in most respects, the camera’s rolling shutter can render it unusable for run-and-gun camera operators who love aggressive pans.",
    "With handy USB-C tethering for direct streaming to PC, and the additional audio port and video-oriented design, the ZV-E10 is still a compelling choice for Sony users looking for an affordable studio B cam or interview camera, or something to keep hooked up to their computer. The ZV-E10 is also a clear step up over the ZV-1, and costs less than half the price of the full-frame Sony A7C, so makes sense in the context of Sony's other cameras.",
    "If you aren’t sold on Sony, though, you could well be better off spending a bit more and opting for a Panasonic GH5 Mark II if you want 4K/60p capture, or even a Blackmagic Pocket Cinema Camera if you consider yourself more of a filmmaker and don’t need stills capture. Alternatively, the Canon EOS M6 Mark II costs about the same as the ZV-E10, and with the right adapter could be the better option if you’ve got a bunch of Canon glass.",
    "Alternatives aside, if you want a compact mirrorless Sony camera with a flip-out screen for video, and can handle some wobbles in your panning clips, nothing else does what the ZV-E10 can for the price. It’s also got better than average on-body microphone performance, and a headphone jack, making it a perfect alternative to the A6100, even if it isn’t quite a perfect camera.",
    "The Sony ZV-E10 will be available to buy from the end of August for $700 / £680 / AU$1,249 or $800 / £770 / AU$1,449 with the 16-50mm kit lens.",
    "This means the ZV-E10 sits in between the Sony ZV-1 and the Sony A6100, although the latter's recently discounted price brings it down the ZV-E10's level. While the A6100 still makes sense for stills photographers, the ZV-E10 has better video-related features, ergonomics and ports.",
    "With a price tag that's not much higher than the Sony ZV-1 compact camera, Sony is effectively giving you a choice between a pocketable all-in-one vlogging camera (the Sony ZV-1) and the flexibility and larger sensor of an interchangeable lens camera (the ZV-E10).",
    "You’ll know the ZV-E10 is a Sony camera as soon as you prod the touchscreen to interact with the menus and nothing happens. Yep, while Sony introduced a fancy new touch menu for the Sony A7S III and FX3, the newer ZV-E10 forces you to navigate the UI with the four-way wheel to the right of the display, meaning we’re still waiting for the feature to land on a lower-end camera.",
    "You’ll also recognize plenty of Sony-isms in the camera’s design language well before you get to the menu. The top of the camera features a Multi-Interface hot shoe mount, which supports digital audio devices, alongside a grille that covers a three-capsule microphone. Below the power switch is a toggle to cycle across Photo, Video, and Sony’s S&Q ('Slow and Quick') mode for timelapses. There’s also a dedicated movie record button, and a Bokeh Switch button (which doubles up as C1). Finally, for the top, there’s a wheel that controls aperture by default and is operated by a thumb, a shutter release button, and a zoom toggle.",
    "The back of the camera proudly showcases the articulating screen and to the right of are menu, Fn, playback and delete buttons. There’s also a rotating wheel that operates as a four-way pad. While the camera’s body is magnesium, there’s a soft-touch grip to the right side of the buttons for a thumb to nuzzle into, and the material wraps around the side of the camera to the front grip too.",
    "Take a peek at the ZV-E10’s undercarriage and you’ll find a spring-loaded door covering the single SD card and battery slots. There’s also a standard tripod thread fitting, and on the port-side of the camera is a headphone jack, micro HDMI and a USB-C port under one door, with a microphone port under a separate flimsy flap.",
    "When compared to the A6100, the ZV-E10 weighs 3g less at 393g, and is about 1.5cm thinner too (with a depth of 44.8mm). Handling is fit for purpose when it comes to shooting video for the most part, though the light weight struggles to counterbalance heavier lenses at times.",
    "The articulating screen is a big pro for vlogging, feels sturdy, and means the screen’s protected when the screen isn’t facing outwards. For video shooters who don’t vlog, there’s an argument to be made for the traditional tilting screen on other Sony cameras and the Blackmagic Pocket Cinema Camera 6K Pro, as it makes for a less awkward grip when holding the camera at a low, steadied angle. Nevertheless, the ZV-E10’s fully articulating screen is definitely more versatile.",
    "For photography, the ZV-E10 falls behind cameras with viewfinders when it comes to ergonomics. However, the articulating screen absolutely does the job, albeit in a no-frills way. With the same 921k, 3-inch panel found on the A6100, its aspect ratio is optimized for photos rather than video. The camera also operates with touch-to-focus and Sony’s trademark eye and object tracking, but more on that later.",
    "Out of the box, one way the Sony ZV-E10 stands out is with its live-streaming capabilities. It works with both UVC/UAC support and when matched with Imaging Edge Webcam, an app available for Mac and Windows machines.",
    "Both options eliminate the need for a video capture card, which has become something of a standard software boost across Canon and even GoPro cameras since the pandemic hit. That means in addition to streaming to Twitch and YouTube, the ZV-E10 can double up as a very fancy webcam.",
    "The plug-and-play nature of the UVC/UAC feature can’t be overstated. Dive into the menu, flip on the USB Streaming setting, and the camera is good to go. Just hook it up to a computer and it’s ready for Google Meet, Microsoft Teams or Zoom.",
    "After laboring to turn our Canon EOS R6 into a webcam and deliver a clean feed into our computer (with hit-and-miss results), the ZV-E10 was a breath of fresh air. The main drawback of going this route is a slight delay across audio and video, though.",
    "If you want a more in-sync stream, you’ll want to download Sony Imaging Edge Webcam. This requires a bit more faffing with the settings, but ultimately worked without any headaches too, making the ZV-E10 a great shout for anyone who knows computer connectivity is a big part of what they’ll need their camera for.",
    "The 425-point autofocus system of the Sony A6100 was great back in 2019 – and it’s still impressive at the ZV-E10’s price, pulling focus in just 0.02 seconds.",
    "The hybrid AF system features 425 phase-detect points and delivers 84% coverage, while Sony’s Real-time Tracking and Real-time Eye AF technology (working for both humans and animals) also make a comeback on the ZV-E10.",
    "Real-time Tracking uses Sony's predictive and recognition algorithms, including AI-based object recognition and color, subject distance (depth), pattern (brightness), and spatial information; that's not forgetting face and eye detection.",
    "This means photographers can tap a subject on the viewfinder and the camera will then track it automatically around the frame. If the subject has a face, eye detection is used, until they turn away the camera, after which the AF will revert to Real-time Tracking.",
    "Eye AF has been an impressive feature of many Sony cameras for a few years, and has even made its way onto the brand’s Sony Xperia 1 III smartphone.",
    "The ZV-E10’s Real-time Eye AF was consistent in our time with the camera, even if it didn’t deliver anything we haven’t seen before. In the menu you can choose Auto/Right Eye/Left Eye depending on your preference, and the feature is fired up by default.",
    "For video capture, the camera’s autofocus also impresses, particularly when it comes to object-tracking and face recognition. The AF was able to lock onto our eyes and keep the background nice and soft, even when we walked around the frame. This was consistent, even in mediocre lighting, once again making the ZV-E10 an attractive vlogging camera with few autofocus peers at this price.",
    "With its 24.2MP APS-C CMOS sensor, the Sony ZV-E10 brings back tried-and-tested imaging hardware. With a max ISO of 32,000 and a shutter speed as fast as 1/4000, there’s nothing new about its imaging credentials.",
    "On the plus side, the camera delivers three degrees of SteadyShot electronic stabilization: Active, Standard and off. When matched with the Optical SteadyShot on most of the lenses we tested with the ZV-E10, hand-shake was well compensated for, and pans looked smooth.",
    "While video is captured at 4K, it’s shot with 6K oversampling, made possible by the sensor pixel count. What is a bit of a letdown, though, is the fact the Sony ZV-E10 4K footage caps out at 30fps, like most of the 4K cameras at this price. Meanwhile, Full HD video can be shot at up to 100fps, and this can climb up to 120p when shooting in Sony’s S&Q mode.",
    "The video-centric flex of the ZV-E10 doesn’t stop there. It’s capable of shooting in S-Log 2, 3, and HLG (hybrid log gamma) picture profiles. Dive into the settings and you also have plenty of control over granular video controls, from AF transition speed to Zebra display settings.",
    "Just like the A6100, an NP-FW50 battery (1020mAh) powers the ZV-E10, and Sony claims it’s good for 80 minutes of continuous recording or 440 stills. We were able to get fewer full-res stills, but a little more Full HD video, though our 4K tests fell slightly short of Sony's claims. What’s also handy is that the camera powers up via the USB-C port, so we were able to pack a power bank when shooting out and about, rather than needing pricey spare batteries.",
    "The main thing holding back the ZV-E10 when it comes to day-to-day use is its antiquated menu system. While it would be fine if it supported touch interaction, the amount of scrolling and button pressing it takes to make a simple setting change is a pain, especially when outdoors mid-shoot.",
    "We tested the ZV-E10 with a variety of lenses, including the Sony E 16-50mm f/3.5-5.6 OSS, FE 24-70mm f/2.8 OSS, FE 12-24mm f/4, and the 135mm f/1.8 GM. Handheld in bright to dim scenes, every combination delivered a rich shot with impressive depth, detail, and contrast.",
    "Image noise is well-controlled throughout the sensitivity range on the ZV-E10, even if you opt for higher sensitivities such as ISO 6400. If you're shooting JPEGs we'd recommend switching the camera’s High ISO NR (noise reduction) setting to low, as the 'Normal' setting can be a bit heavy-handed.",
    "Video quality is also excellent when holding the camera still, with footage from the ZV-E10 (shot with 8-bit color depth using 4:2:0 sub-sampling) delivering plenty of detail, while motion is nice and smooth and audio quality is also good. The inclusion of the three-capsule microphone found on the Sony ZV-1, along with the bundled windshield, is welcome for higher-quality backup audio. But if you can wire in some external audio, particularly for interview-type scenarios, you’ll definitely want to.",
    "Noise-handling when shooting video isn’t mind-blowing, and naturally, falls far behind the full-frame competition. For an APS-C sensor though, it’s where it needs to be, with usable footage at up to around ISO 6400 when downsampling from 4K to FullHD. Otherwise, you’d be better off keeping footage at a max of around ISO 4000 in our experience.",
    "The main issue with the ZV-E10 is that, unlike the A6100, it’s video-focused so we have to judge its video credentials more harshly. While the photo-centric A6100 could get away with a pretty trippy rolling shutter, it’s less forgivable on a camera like the ZV-E10. The distortion is significantly worse than that of the Blackmagic Pocket Cinema Camera and comparable to Canon and Panasonic cameras at this price.",
    "If you’re a studio shooter or tend to keep your camera on a tripod, therefore, then the ZV-E10 is absolutely fine. For run-and-gun out-and-about videographers who love an aggressive pan every now and then, it could be a dealbreaker."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Sony ZV-E10 release date and price",
    "11": "Build and handling",
    "18": "Live-streaming skills",
    "23": "Autofocus",
    "30": "Performance",
    "36": "Video and image quality",
    "42": "Don't buy it if..."
  },
  "links": {
    "Canon EOS M6 Mark II": "https://www.techradar.com/reviews/canon-eos-m6-mark-ii-review",
    "Blackmagic Pocket Cinema Camera 6K Pro": "https://www.techradar.com/reviews/blackmagic-pocket-cinema-camera-6k-pro",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii"
  }
}