{
  "source": "https://www.techradar.com/reviews/mspy-parental-control-software",
  "title": "mSpy parental control software review",
  "category": "computing",
  "updated": "2021-09-21T03:47:33Z",
  "author": "mike-williams",
  "summary": "Monitor calls, text messages, SMS and more with this tracking app",
  "verdict": "MSpy excels at monitoring instant messages, texts and how a phone is being used. But if you're after a true parental controls app, something to control screen time, internet access and more, there are far cheaper and more powerful solutions around.",
  "pros": [
    "Logs the content of SMS and instant messages",
    "Location history and geofencing support",
    "Supports viewing browsing history",
    "Can be run without the target user noticing"
  ],
  "cons": [
    "High price",
    "Each device requires a separate subscription",
    "Can't control screen time",
    "Weak app and internet access controls"
  ],
  "article": [
    "MSpy is a hugely powerful phone monitoring app which can report on almost every area of your kid's online activities (and one or two of the offline ones, too.)",
    "Need to monitor calls, for instance? No problem. Looking to check text messages? That's included, too (you can even view deleted texts.) And mSpy's Android app can log conversations on all the top messaging apps and platforms: WhatsApp, Snapchat, Instagram, Facebook, iMessages, Skype, Telegram, Viber and many more.",
    "You're able to monitor your child's browsing history, see their bookmarks and the Wi-Fi networks they've used to get online. The Android app can block access to websites by category, and setting up keyword alerts help you see if they've accessing inappropriate content.",
    "MSpy's app manager keeps you up to date with everything you've installed. On Android, you can also block inappropriate apps, or use a screen recorder and keylogger to see exactly what your kids are doing.",
    "Android-only location features include the option to highlight your device on a map. Geofencing support allows you to define key areas in your child's life (home, school, grandma's house) and get alerts when they arrive and leave.",
    "And the feature list goes on, with options to log incoming and outgoing emails, track your child's contacts, watch their calendar, see the pictures they send and receive, read their notes, and more.",
    "Beware, though: although mSpy tells you a lot about how a device is used, it has very few features to control usage. You can't limit screen time or device usage, and there's no way to block websites or apps by category. It's far more about surveillance than all-round parental controls.",
    "MSpy's monthly billing is a gut-punching $49 for the first month, $70 on renewal. How many devices does that cover, you're asking? Just one. (Sorry.)",
    "Signing up for longer does get you huge savings. The three-month plan is $28 a month for the first term, $40 on renewal; the annual plan is $11.66 a month for year one, $16.66 when you renew.",
    "Still, if you've, say, three devices to protect, that's around $35 a month on even the cheapest introductory deal. Kaspersky Safe Kids can't match mSpy for monitoring, but gives you more conventional parental controls features, for as many devices as you need, and costs just $15 in year one. (And that's the whole year, not per month.)",
    "MSpy's refund policy is less-than-generous, too. You can't just say, I'm unhappy, it doesn't do what I expected: the small print says you'll only get your money back if you have 'technical issues' which Support can't fix. Make sure mSpy is compatible with your devices (click the Compatibility link on the website) and has all the features you need before you sign up.",
    "Installing mSpy is more tricky than usual, as it's not available in the app stores and you must do some extra work to set it up. (The website doesn't make it easy to find the installation steps, but there's guidance in some blog posts, like this one covering Android setup.)",
    "On an Android device, for instance, you must disable Google Play Protect. If you didn't, it would recognize mSpy as a privacy threat and not allow the installation.",
    "(If you're thinking, but isn't turning off Play Protect making the device more vulnerable to malicious apps? Then yes, that's exactly what it does. This isn't a good security idea, but it's necessary to run mSpy.)",
    "Play Protect disabled, the next step is to manually download the app file from an mSpy link, open it and follow the installation instructions.",
    "IOS installations are very different, with their own set of rules. Setup on non-jailbroken devices might only require its iCloud credentials, allowing you to install the app without having physical access to the phone. But that won't work if two factor authentication (2FA) is turned on (you have to enter a verification code on the target device.)",
    "Once setup is complete, log into your mSpy control panel, enter your phone's details (model, phone number and so on) and you should begin to receive details about the device.",
    "Even when mSpy is installed, up and running, the phone user won't see what's happened. There's no mSpy icon on the phone, no notifications or alerts, no sign anything has changed. Even relatively technical kids are unlikely to realize they're now being monitored.",
    "Tracking your child's activities starts on mSpy's web dashboard (a website demo uses sample data to show you how this works.)",
    "A summary page gives you a quick view of what's going on. A useful Activity graph highlights the number of WhatsApp messages, texts and other details captured over the past few days, a simple way to spot heavier-than-usual activity. You get to see which contacts are top of your child's messaging list, their most visited websites and recent locations.",
    "A left-hand dashboard gives you more details on each area mSpy monitors, if you need it: recent calls, pictures sent and received, instant messaging logs and more.",
    "MSpy makes it easy to see what your child is doing on the web. Just tapping the Browser History tab displays the sites they've visited recently, along with the date of the last access and the total number of times they've viewed the site.",
    "A Bookmark tab displays a list of your child's current bookmarks, but this time you just get the URL, with no 'added' or 'last visited' dates.",
    "You can choose to block access to specific websites, but unlike most parental controls apps, there's no way to limit access by category type (Adult, Drugs, Violence and so on.)",
    "That's unfortunate, but it's also a consequence of mSpy's stealthy design. If an app aims to monitor a target device without the user knowing, it can't announce itself by saying 'sorry, all gambling sites are now blocked.'",
    "It's important to understand how your kids are using their phones, so it's good to see mSpy provide a list of installed apps.",
    "Unfortunately, there's no real detail beyond a list of app names. You can't immediately see when an app was installed, for instance, or how often it's used.",
    "Controls over app use are limited to a single Block option, where you can prevent specific apps from being launched.",
    "Standard parental control apps give you many more fine-tuned options. You might be able to limit this app to x hours use on the weekdays, for instance, and y hours at the weekends, while setting different rules for various categories of apps ('no social media after 9pm') and allowing educational apps to be used for as long as they like.",
    "MSpy is designed to run without the target realizing, though, so as with websites, it can't suddenly start telling them what they can and can't use. Simple 'installed apps' lists are the best you'll get.",
    "MSpy logs your device position via GPS, then displays the results in its GPS Locations tab.",
    "By default, it displays these as a plain text list, with the latitude, longitude, nearest address and the location time. But the mSpy dashboard can also display locations on a map via OpenStreetMap, and you can click a link to open the location in Google Maps.",
    "Geofencing allows you to create unlimited allowed or forbidden zones around key locations in your child's life: home, school, sports field, maybe that friend you don't want them to see.",
    "When you're set up, mSpy raises alerts as your child arrives at or leaves a specific zone.",
    "Most of mSpy is about monitoring your child's communications with the outside world, and it generally does this very well.",
    "Choose the messaging app or communications type from the sidebar, and you'll see relevant information. There's the date, number and length of incoming and outgoing calls, for instance. MSpy logs the contact name, date and content of messaging and chat conversations. You get email logging, too, and the option to view calendar events, contact lists, new photos and videos gives you more context to what's going on.",
    "For real in-depth monitoring, you can set up mSpy to take regular screenshots and log every keypress on the device. That tells you much more about what's going on, but it also generates more lengthy reports, and it'll take longer to work through them all.",
    "Fortunately, mSpy has a more targeted feature in its Keyword Tracking. Here, you're able to create rules which raise an alert when mSpy spots a particular word or phrase. In just a couple of minutes you can set up mSpy to look for the word 'suicide' in SMS, say, and 'porn' in instant messages, then send you an email right away: very easy.",
    "MSpy is a capable monitoring phone monitoring app which can tell you all about the messages sent to and from a device, and log many more details about how it's being used. That level of tracking may not be legal for an adult target, though, and mSpy doesn't have the screen time, internet access or device usage control to match the best parental controls apps."
  ],
  "headers": {
    "7": "Plans and pricing",
    "11": "Setup",
    "18": "MSpy dashboard",
    "21": "Web access",
    "25": "App management",
    "30": "Location features",
    "34": "Monitoring",
    "38": "Final verdict"
  },
  "links": {
    "MSpy": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9478181398757124000&xs=1&url=https%3A%2F%2Fwww.mspy.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmspy-parental-control-software",
    "phone monitoring app": "https://www.techradar.com/best/parental-control",
    "Kaspersky Safe Kids": "https://www.techradar.com/reviews/kaspersky-safe-kids-parental-control-software",
    "small print": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9820045558704690000&xs=1&url=https%3A%2F%2Fwww.mspy.com%2Frefund-policy.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmspy-parental-control-software",
    "like this one": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2459906647550024700&xs=1&url=https%3A%2F%2Fblog.mspy.com%2Fhow-to-install-mspy-on-your-kids-android-phone&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmspy-parental-control-software",
    "Google Play Protect": "https://www.techradar.com/news/google-play-protect-aims-to-turn-the-tide-against-androids-malware-problem",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "website demo": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1179726626339089200&xs=1&url=https%3A%2F%2Fdemo.mspy.com%2Fdashboard.html%2F%3Flang%3Den&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmspy-parental-control-software"
  }
}