{
  "source": "https://www.techradar.com/reviews/hisense-u8g-android-tv-65u8g",
  "title": "Hisense U8G Android TV (65U8G) review",
  "category": "televisions",
  "updated": "2021-07-29T15:59:28Z",
  "author": "ural-garrett",
  "summary": "The Hisense U8G is an affordable, feature-packed UHD HDR TV",
  "verdict": "Regardless of whether you consider yourself a hardcore gamer, cinephile or an individual simply looking for a value-packed 4K TV, the Hisense U8G provides a lot of something for everyone.",
  "pros": [
    "Awesome image quality",
    "Google Assistant integration",
    "Reasonable price",
    "Built-in mic with on/off switch"
  ],
  "cons": [
    "Audio quality could be better",
    "Voice controls are pretty wonky",
    "Stands are a bit wide and intrusive"
  ],
  "article": [
    "Hisense has spent the past couple of years making outstanding TVs like the Hisense U80G ULED 8K TV that undercut the big dogs like Samsung, Sony and LG without many compromises. That continues with the new Hisense U8G ULED which the Chinese electronics manufacturer aptly describes as “Great For Everything.” It's a fitting description for the ULED 4K Android TV that’s sure to please everyone from gamers with next-generation consoles to movie lovers and anyone else in-between.",
    "Besides offering a full suite of Dolby features including Vision, IQ and Atmos, the U8G also packs in HDR10+ and native 120Hz panel. All of this is controlled through the Android TV operating system that incorporates both Google Assistant, built-in Chromecast and voice controls with privacy switch.",
    "All that said, if you're looking to purchase a well rounded UHD television that’s feature-packed without spending an arm and a leg you should definitely keep the U8G in mind.",
    "The Hisense U8G comes in two screen sizes - 55 inches and 65 inches - both are available now at major retailers including Amazon and Best Buy. Expect to pay $999 for the 55-inch and $1,249 for those extra ten inches of visual real estate.",
    "Compared to other UHD TVs with similar sizes, the LG Nano 90 costs a bit more with the 55-inch and 65-inch being priced at $1,049 and $1,499. Meanwhile, the Sony X900H is priced similarly to the U8G at $999 for the 55-inch with the 65-inch costing $1,399. Of the three, we think the Sony is a bit of a better value for the money - especially if you're looking for the best 55-inch TV, but at 65-inches the Hisense U8G is very competitive at its price point.",
    "Many have praised Hisense's recent displays for their modern design philosophy, and that will likely continue with the U8G: the legs that extend out fairly far out to the sides and despite keeping the TV incredibly sturdy, this is definitely meant to be the centerpiece. Buyers who sit their televisions on top of furniture like dressers may have to put their space management skills to the test.",
    "That shouldn't be a problem if you have a wide entertainment center but, if not, it's worth noting that the stands are spread out beyond the back of the TV and you'll have to be a bit careful if you’re used to placing devices behind your display.",
    "The good news is that the bezels on the U8G are fairly thin all around and make the TV look fairly thin regardless of viewing angle. At the bottom, the bezel gets a bit thick as that’s where the microphone alongside the mic off/on switch is located.",
    "Behind the display, the TV doesn’t protrude out much and lifting it isn’t too bad considering the U8G weighs under 60 pounds. Moving the TV out of the box to a table wasn’t difficult after screwing in the legs.",
    "Ports are adequate as well. Mainly configured on the left side behind the display, the power cord lays on the opposite side. Four HDMI ports including one eARC, two USB inputs, RF input, RCA composite input and 3.5mm audio sit vertically. Nearby horizontally are ports for digital audio output and LAN.",
    "Gamers who are lucky enough to get their hands on both PS5 and Xbox Series X|S will be happy to know that two of the HDMI ports support 4K at 120Hz while the other two support 4K at 60Hz. This leaves enough room for two next-gen consoles, Nintendo Switch and a selected streaming device for good measure.",
    "The packaged remote control for the U8G doesn’t reach the simplicity of remotes from Roku or Apple TV but it does the job in terms of navigation. There’s also a Google Assistant button as well alongside Android TV software controls. Like many modern remotes, there’s also quick buttons that’ll take users to apps like Netflix, Disney+, Prime Video, YouTube, Tubi and Peacock.",
    "The IR remote does have Bluetooth built-in but it has to be mainly connected through the menu button which seems a bit odd. When the lights are off, however, navigation isn’t difficult due to a backlight. Admittedly, there's nothing special about the remote but it definitely gets the job done.",
    "There have been many complaints about modern TVs that utilize Android TV in regards to responsiveness. For the U8G, there wasn’t much sluggishness or non-responsive moments during testing. Apps including Netflix, Prime Video, Hulu, Disney+ and more booted adequately without any issue.",
    "If you are already a loyal member of the Android ecosystem, setting up the U8G is a breeze. Once logged in through your Gmail account, everything from Wi-Fi to apps are logged in automatically which relieves users of the “new TV” annoyance of re-entering logins and passwords on certain apps. If you're already using Netflix or Disney+ on your phone, Google will use its password-bank automatically following a prompt.",
    "There are also voiceless controls as well due to the U8G’s built-in microphone when not asking to do anything too complex. That's largely a great feature, but if you have multiple smart TVs, Android devices and/or Google Homes, there’s the possibility of erratic moments where Google gets a bit confused. During moments of media controls, voice controls work well for basic playback actions like Stop, Pause, Rewind, Fast Forward and Play.",
    "One of the biggest positives for Android TV is the sheer number of apps spread out between streaming services and games. Of course, users who want to play the large amount of games available on Google Play like Asphalt Racing, Unkilled, Crossy Road and the likes are going to need a compatible gamepad. More so if users want to try their hand at Google Stadia.",
    "Hisense’s ULED technology continues to improve and the U8G is further proof: rich, beautiful colors and deep blacks make shows, films and games look jaw dropping.",
    "Besides offering 4K resolution, the U8G’s native 120Hz screen supports IMAX Enhanced, FilmMaker Mode, Dolby Vision, Dolby IQ, HDR10+/HDR10 and Quantum Dots. Dimming zones have been increased from 180 to 360 alongside a dynamic contrast ratio of 10,000:1 and up to 1,500 nits peak brightness. This means that regardless of viewing angle or brightness of the room one is viewing in, picture quality remains phenomenal.",
    "Built into the U8G is a special anti-glare film as well. As mentioned previously, the U8G is probably the most well-rounded television from Hisense feature-wise, but the excellent picture quality is the main draw.",
    "There are a slew of various picture setting options from brightness to picture modes. Sports lovers with a keen eye for visuals may find some usage out of the various motion enhancement and clearness modes. It’s definitely noticeable during testing as the biggest sports event in the world, the 2021 Olympics, looked gorgeous. Another great sports example is Netflix’s Naomi Osaka documentary which takes advantage of Dolby Vision and HDR10.",
    "Cinephiles may appreciate FilmMaker Mode which disables post-processing while preserving correct aspect ratios, colors and frame rates as intended by the filmmaker. It definitely looks great when looking at older monochrome film or anything before digital cameras took over. This means that classics like A Fistfull of Dollars, Bullitt or even Blaxploitation films like TNT Jackson look amazing.",
    "Though not as gaming-focused as Hisense’s U7G, there’s much for gamers to appreciate with the U8G. Alongside offering 4K with a 120Hz refresh rate, the TV also features a Game Mode Pro which has VRR and FreeSync Premium for improved input lag. Though next-generation consoles from both Sony and Microsoft have yet to truly utilize the full potential power, there are some games that look phenomenal on the U8G. PS5 games like Ratchet & Clank: Rift Apart support 4K/120Hz and it’ll be difficult to go back to 60Hz once players get a chance to check it out. There are more games on Xbox Series X|S like Mass Effect Legendary Edition that really feels as if it enhances gameplay.",
    "For better or worse, audio quality is consistent alongside Hisense’s newer crop of TVs. If users are looking for a louder cinematic experience, a soundbar or speaker system may be the best option. On its own, the U8G built-in speakers offer an average audio experience. Though the TV can get incredibly loud, audio quality does diminish once users go beyond the 20 point range.",
    "Below that volume level in a small to medium room, sound quality is fairly rich when watching a television series or watching a film.",
    "When listening to music on high fidelity music streaming services like Tidal, sound quality is great... if you within a reasonable volume range. There’s some richness in treble and mid-tones while bass sounds nicely deep. Just remember that at higher levels, there’s a level of distortion that some may find uncomfortable."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and availability",
    "5": "Design",
    "13": "Smart TV (Android TV)",
    "17": "Picture quality",
    "23": "Audio performance",
    "26": "Don't buy it if..."
  },
  "links": {
    "Hisense U80G ULED 8K TV": "https://www.techradar.com/reviews/hisense-u80g-uled-8k-tv",
    "Samsung": "https://www.techradar.com/news/samsung-qn85a-vs-q80a-qled-tv",
    "Sony": "https://www.techradar.com/reviews/sony-xh90-kd-75xh9005-4k-tv",
    "LG": "https://www.techradar.com/reviews/lg-nano-90-65nano906",
    "LG Nano 90": "https://www.techradar.com/reviews/lg-nano-90-65nano906",
    "Sony X900H": "https://www.techradar.com/reviews/sony-xh90-kd-75xh9005-4k-tv",
    "best 55-inch TV": "https://www.techradar.com/best/55-inch-4k-tv",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia"
  }
}