{
  "source": "https://www.techradar.com/reviews/amazon-echo-dot-kids-review",
  "title": "Amazon Echo Dot Kids review",
  "category": "smart-home",
  "updated": "2021-09-02T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "A cute design and parental controls make this Alexa speaker suitable for kids",
  "verdict": "The Amazon Echo Dot Kids is a child-friendly smart speaker with built-in parental controls. Simple to use, it offers good value for money thanks to the unlimited access to age-appropriate audible books, skills, and playlists. However, many of the features are available on standard Echo models, which are cheaper, and the sound quality certainly won’t blow you away.",
  "pros": [
    "Two animal designs to choose from",
    "Built-in parental controls",
    "Comes with a year’s free Amazon Kids+ access"
  ],
  "cons": [
    "Most features available with any Echo",
    "Some Amazon Kids+ content unavailable"
  ],
  "article": [
    "Amazon’s Echo range of devices, which features built-in support for Alexa, appeals to adults and children alike, since you can play your favorite tracks and playlists, as well get answers to your burning questions, simply through using your voice.",
    "The Amazon Echo Dot (2020) is the brand’s most affordable smart speaker and is often discounted to as little as $24.99 / £24.99, which makes it a great way to introduce children to Alexa. Now, Amazon has given its newest smart speaker a kid-friendly twist.",
    "The Amazon Echo Dot Kids, suitable for children of three and upwards, is available in either a Panda or Tiger design that brings a cute look to the Echo Dot’s space-age spherical aesthetic. Like all Amazon Echo smart speakers, it supports the Amazon Kids on Alexa parental controls.",
    "The free-to-use service lets you set time limits in the Alexa app that restrict when, and for how long, the smart speaker can be used; the Alexa skills that can be activated on it; and even blocks explicit lyrics when listening to Amazon Music, Apple Music or Spotify.",
    "The Amazon Echo Dot Kids also comes with a one-year’s subscription to Amazon Kids+, which is also available for Amazon Fire Tablets and Kindles and offers unlimited access to a range of age-appropriate audio books, radio stations, and skills and games. However, unlike use on an Amazon device with a screen, it’s only content that’s audible rather than visual that will be available. Once the year’s subscription expires, Amazon Kids+ will set you back $2.99 / £1.99 per month.",
    "The Amazon Echo Dot Kids costs $59.99 / £59.99, which is $10 / £10 more expensive than the standard Amazon Echo Dot. It’s good value for those with children who have been considering subscribing to Amazon Kids+, and it’s also not a lot more to pay to give kids the feeling they have their own device, rather than using mummy or daddy’s.",
    "The Amazon Echo Dot Kids will set you back $59.99 / £59.99 and is available through Amazon. Currently, it isn’t available to purchase in Australia.",
    "The standard Echo Dot is priced at $49.99 / £59.99, making this child-friendly version $10 / £10 more expensive. However, since it comes with a year’s access to Amazon Kids+, which costs $2.99 / £1.99 per month or $99.99 / £79.99 for one year upfront, the Amazon Echo Dot Kids offers good value for money.",
    "The spherical design of the Amazon Echo Dot (2020) was a departure from the previous puck-shape unit, and it certainly got people talking. super-compact, measuring 3.9 x 3.9 x 3.5 inches / 10 x 10 x 8.9cm ( w x d x h) and weighing in at 12oz / 341g, the smart speaker really does fit in the palm of your hand.",
    "The Amazon Echo Dot Kids retains this globe-like shape, with the top two-thirds of the speaker covered in a hard mesh, and the bottom third made of plastic. However, rather than being available in a uniform color, the Amazon Echo Dot Kids speaker adds a cheeky face to the exterior design, with two options available: a Panda or Tiger.",
    "There’s an LED ring at the bottom of the speaker that glows blue when Alexa is listening to a voice instruction, red when the microphone is muted, or yellow when there’s a notification or the speaker has lost its Wi-Fi connection. Below this is a rubber disc designed to protect the surface on which the speaker is placed from scratches.",
    "The top of the speaker is home to the physical controls. There’s a volume control, a button to summon Alexa, plus a mic off button. On the rear of the device is a port for the power cable and a 3.5mm socket, which is handy if you want to connect another music source, such as an old MP3 player.",
    "The Amazon Echo Dot Kids has a single 1.6-inch full-range front-firing speaker and, much like the standard Echo Dot, there’s plenty of vocals sound quality won’t blow you away and while it This tiny-but-powerful speaker is responsible for producing the entire frequency range of sound for the speaker and the results, well... aren’t exactly inspiring.",
    "That said, the microphone array inside is easily good enough, in use. We don’t have any complaints about the Echo Dot’s ability to hear us over any music playing; the speaker was able to process any of our commands perfectly.",
    "The Echo Dot Kids is simple to set up using the Alexa app. We were able to add a profile for each child who would be using the speaker, adding details such as their date of birth, to ensure they would receive only age-appropriate content and responses through the speaker.",
    "When using Amazon Kids on Alexa through a standard Echo speaker, you have to ask Alexa on that particular device to open Amazon Kids. This isn’t the case here: once the device has been set up, child-friendly responses are instantly available.",
    "When we put a range of trivia-related questions to Alexa, while also asking for spellings and definitions, and even a handful of mathematics questions, it was able to answer them with ease and the results were identical to those given by Alexa on a standard Echo Dot.",
    "The Amazon Echo Kids Dot offers a range of child-oriented radio stations, and we were also able to stream songs from Spotify, Apple Music and Amazon Music through the speaker, with explicit language blocked by default. To test this, we asked the speaker to play ‘We’ve Come A Long Way Baby’ by Fatboy Slim, which features some swearing. We were impressed to find that it wasn't possible to play the song. We were also happy to find that voice purchasing is automatically disabled, so you don’t have to fear your kids running up a bill buying from your Amazon account by accident. We also used the Echo Dot Kids to make voice calls to other Echo smart speakers in the same house, as well as Echo speakers that weren’t close by – although for smart speakers outside of the home, we had to approve the contact in the Alexa app first.",
    "Using the Parent Dashboard in the Alexa app, or on Amazon’s website, it was easy to restrict the apps and Alexa skills that could be accessed, as well as set time limits on when the smart speaker would respond. It was even possible to stop the smart speaker from being used to control smart home devices in the home.",
    "It’s the year’s access to Amazon Kids+ that really elevates this speaker above other, more affordable smart speakers. It offers unlimited access to a wide range of Audible books, including a selection of titles covering classics such as Five Children and It and the Lion, The Witch and the Wardrobe, along with traditional fairy tales and even newer hits from British comedian turned author David Walliams. There’s even a series of Minecraft-inspired stories.",
    "In addition, there’s a range of child-friendly Alexa skills from big names such as Disney, Barbie, Nickelodeon and Sesame Street, which allow kids do everything from go on choose your own ending adventures, take part in quizzes, become a DJ, or even sing along with Baby Shark – although this last skill might be one you restrict access to if your ears really can’t cope with hearing the song again.",
    "Alarm sounds, too, can be given a child-friendly twist, so children can be woken up by Olaf from Frozen or be alerted that it’s homework time by a baby tiger. When it comes to sound quality, the Echo Dot Kids offers the same clear vocals whether listening to music, Audible books or playing games, as the standard Echo Dot. And just like the speaker for grown-ups, it doesn’t offer a particularly powerful bass, but you’ll be hard-pushed to find a child that complains the sound quality isn’t good enough.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Amazon Echo Dot Kids price and availability",
    "8": "Design",
    "14": "Performance",
    "22": "Don't buy it if..."
  },
  "links": {
    "Amazon Echo Dot (2020)": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Amazon Kids on Alexa": "https://www.techradar.com/news/what-is-amazon-kids-on-alexa-and-how-do-i-turn-it-on",
    "Amazon Fire Tablets": "https://www.techradar.com/best/best-amazon-fire-tablets",
    "Kindles": "https://www.techradar.com/news/best-kindle"
  }
}