{
  "source": "https://www.techradar.com/reviews/hidemyass-vpn",
  "title": "HideMyAss! (HMA) VPN review",
  "category": "computing",
  "updated": "2021-11-08T19:51:03Z",
  "author": "mike-williams",
  "summary": "Protect your privacy online with this certified no log VPN",
  "verdict": "This VPN is easy-to-use with a sprawling network of servers and an independently audited no logging policy. OpenVPN speeds are good, but they can't match the performance we see from WireGuard-equipped VPNs, and unblocking results are below par.",
  "pros": [
    "Servers in 210+ countries",
    "Responsive live chat support",
    "Unblocks BBC iPlayer",
    "Independently audited no logging policy"
  ],
  "cons": [
    "Doesn't unblock US Netflix, Amazon Prime Video, Disney Plus",
    "No WireGuard",
    "Limited configurability",
    "Support website has some issues"
  ],
  "article": [
    "One of the biggest names in the VPN business, HideMyAss! (HMA) has been protecting its users' privacy for more than 15 years.",
    "The company offers a vast network of 1,080+ servers in 290+ locations across 210+ countries. That's fewer servers than some of the top providers, but many more locations and countries (NordVPN has 5,200+ servers across 60 countries, ExpressVPN has 3,000+ servers across 160 locations and 94 countries).",
    "There's P2P support, but only on a handful of locations, in fact just eight via our Windows app: five in Europe, three in the US.",
    "The service now only supports the OpenVPN protocol (IKEv2 has been dropped from the Windows app, and there's still no sign of WireGuard). It's seriously secure, though, with AES-256-GCM data encryption, RSA-4096 for handshaking and SHA-256 data authentication, while dual kill switches aim to keep you safe if the VPN drops.",
    "The HideMyAss! website proudly proclaims that it works on all your devices, and it just might have a point. Not only are there custom apps for Windows, Mac, Android, iOS and Linux, but there's installation advice to help you manually set up the service on Apple TV, Android TV, Xbox, PlayStation and more.",
    "HideMyAss! supports up to 5 simultaneous connections with its baseline plans. Paying extra allows you to cover up to 10 devices, or you can set up the service on some routers and connect as many devices as you need: it's your call.",
    "The HideMyAss! main pricing page looks short on options with just a couple of plans.",
    "You can get support for up to 5 simultaneous connections for $4.99 a month on the standard annual plan, dropping to only $2.99 over three years.",
    "If you've got lots of hardware to protect, you might want to choose the 10 connection option, but that bumps up the price: $7.99 a month on the annual plan, $6.99 for two years of coverage, or $5.99 for three.",
    "No monthly plan, we wondered? There is, but HMA hides it away on an 'extended' pricing page, presumably because it wants users to buy one of the longer-term plans.",
    "Track down the right page and you'll find an $11.99 monthly billing option. There's also a six-month plan at $8.99, and a two-year plan at $4.99 a month. (The same price as the one-year plan? Maybe that's why it's hidden away on another page.) These appear to support up to 5 connections only, with no 10-device choice.",
    "$4.99 a month is a fair annual price which beats vendors like Hotspot Shield ($7.99) and ExpressVPN ($8.33). Shopping around can still save you a little cash, though. Private Internet Access charges $3.33 a month for its annual plan, and just $2.19 over three years. Ivacy's five-year plan is a tiny $1.33 a month.",
    "If you've got a lot of devices to protect, though, HMA doesn't look like such a good deal. Those low Private Internet Access prices cover up to 10 simultaneous connections, and Windscribe's annual plan, just $4.08 a month, has no device limits at all.",
    "HideMyAss! doesn't support Bitcoin, whatever plan you choose, but you can pay via cards, PayPal, Apple Pay, Alipay and various other methods. (Payment options vary by region, but the website has a helpful guide here.)",
    "A 7-day free trial gives you a decent amount of time to try out the service. Be careful, though – you must hand over payment details, and you're automatically billed for the annual plan when the trial ends, unless you cancel (fortunately, that's easy to do online).",
    "If you buy, and then run into problems, you're protected by a 30-day money-back guarantee. This includes plenty of jargon-packed small print, but there's also an unusually generous extra.",
    "Most VPNs say that they won't refund you if you've ever claimed a refund from them before. That makes sense – they don't want freeloaders claiming over and over again – but it could also be a little unfair, if, say, you're just trying the service again years later to see if it might work for you.",
    "HideMyAss! understands this, and doesn't care how many previous refund requests you've made, just as long as it's at least six months since the last one. Seems much more reasonable to us.",
    "HideMyAss! has so much small print that the Legal section includes a sidebar with no less than 13 separate sections, and many of those are also very lengthy (the privacy policy alone has more than 5,000 words).",
    "This isn't quite as bad as it first sounds. The main reason for the cluster of documents is that HideMyAss! has organized important sections into separate areas, making them easier to find, and most of these are clearly structured and well-written. (If you're allergic to small print and just want the basics, though, check out HMA's no log blog post for a quick explanation.)",
    "The privacy policy explains that there's no logging of originating IP addresses (a possible way to identify you), precise timestamps (when you connected or performed some action), DNS queries, browsing history or transferred data.",
    "There is some general logging of service use, including the date of connection and whether it's AM or PM, and a very approximate idea of transferred data (the service only records whole 100MB blocks, so a 379MB data transfer is logged as 300MB).",
    "HMA justifies this minimal data collecting on the grounds that it helps with troubleshooting, customer service and understanding network capacity, and that makes sense to us.",
    "If you're the skeptical type, though, there's no need to take these words on trust. In August 2020 HMA announced in a blog post that its no logging policy had been audited by security consultancy VerSprite. HMA passed, the company explained, with VerSprite awarding the minimum possible 'low risk' user privacy impact rating.",
    "The HMA site only gives broad details about the scope of the audit, for example talking about it including 'analyses of data, traffic, and storage on both the client and server-side, and the disconnection of user identities with data containing information about online user activity.'",
    "As the report isn't publicly available, there's no way to judge how meaningful the results might be. Still, it's a start, and we have to applaud any VPN which puts itself through this kind of expert independent scrutiny. Hopefully HMA will run further audits in future, this time with results we can read in full.",
    "Signing up for HideMyAss! works much like any other web service you've ever used. Choose a plan, hand over your money, an email receipt arrives and the website redirects you to a 'getting started' page.",
    "In our case, a Download page pointed us directly to the correct app for our Windows device, while also giving us links to Mac, Android and iOS builds, and some pointers on using the service with Linux. This isn't as well-presented as high-end competitors such as ExpressVPN – you don't get the same number of tutorials on setting up the service manually, and there's no link to download the Android APK file for manual installation elsewhere – but it covers the basics well.",
    "The Windows interface includes an animated icon of HMA's cartoon donkey mascot, but look past that and it's much like any other VPN app. It has a list of locations, a big On/Off button, and a Settings dialog with some useful tweaks.",
    "The Location Picker doesn't force you to scroll – and scroll, and scroll – to find what you need. You're able to filter locations by continent or type (streaming or P2P optimized), enter text in a search box, or save commonly used locations as Favorites for speedy access later.",
    "The location names don't have any latency or server load indicators, but there is a Speed Test option which detects your nearest servers and calculates their latencies and download speeds.",
    "HMA's app sidebar contains a small number of configuration options, including a setting to automatically connect to the VPN whenever you access the internet, and to enable the client's two kill switches. Yes, two: if the VPN drops, a system-wide kill switch protects you by blocking internet access, and an optional app kill switch closes down your chosen processes (your browser or torrent client, say).",
    "We tested the kill switch by forcibly closing the Openvpn.exe process and its TCP connection, and monitoring IP leaks when we switched servers. In all cases the client correctly blocked all leaks, preventing our real IP from reaching the outside world.",
    "The app kill switch is unusual, because as well as terminating specific apps if the VPN drops, it also automatically connects to HideMyAss! when you launch those apps. Presumably HMA is thinking, if this app is so important that it must be closed if the VPN drops, then that means it must be protected at all times.",
    "This is a nice idea, and it worked during testing, but it doesn't offer enough control. You might not want to connect to the VPN every time you open your torrent client, for instance, but HideMyAss! doesn't care: once it's on the app kill switch list, that's what will happen.",
    "Even worse, when you close the app, the VPN automatically disconnects. You might also be using the VPN to unblock a streaming site, browse securely or whatever, and want to leave it active, but as before, HideMyAss! doesn't care: these are the rules.",
    "HMA's IP Shuffle feature enables changing your IP address without reconnecting. It's a simple way to reduce the chance of others tracking what you're doing, and might also help you get into a site if you're blocked while using the first IP address HMA allocated to you.",
    "Making this happen is as easy as clicking the Refresh button when you're connected. Alternatively, the app can automatically change your IP at a defined interval (30 minutes, an hour, a day, whatever you like), so you don't even have to think about it.",
    "Whatever route we chose, the app worked perfectly, updating our IP without exposing our real identity as the connection updated.",
    "HMA's Android and iOS apps have a near identical interface to the Windows client, and once you've found your way around one, you'll have no problem using the others.",
    "The iOS version opens with the same animated donkey, On/Off button and status information, for instance. If you're not interested in the technicalities then you don't have to do anything beyond tap 'On' when you need the VPN, 'Off' when you don't.",
    "The location picker is organized a little differently, but still covers all the basics. You can view all or streaming-optimized servers, use the search box to find a specific location, or use the Favorites system to save the locations you use most. The only small wrinkle is the iOS app reports eight less locations than Android (298 vs 290).",
    "A sparse Settings area is mostly about configuring your device to automatically connect whenever you access Wi-Fi, cellular networks or both.",
    "There's also a Personal Privacy page with an option to 'Share app-usage data with 3rd-party analytics tools to improve this app.' HMA turns this on by default, without asking you, which isn't the best approach (we prefer VPNs who don't send this kind of data unless you've specifically approved it). But if you spot the setting, and you don't approve, you can turn it off with a tap.",
    "HMA's Android app has the same easy-to-use frontend as iOS. If you've used another VPN you'll be happily connecting, switching locations and disconnecting right away.",
    "The real highlight here is the Settings page, which is so crammed with stuff that we had to scroll down to work through everything (and that's even in Portrait mode).",
    "There's Auto-Connect when you access Wi-Fi or mobile networks, for instance (exactly the same interface as on iOS). Split tunneling allows you to direct some apps through the VPN, while others use your standard connection.",
    "IP Shuffle switches your IP address after a predefined time. Threat Scan checks any Wi-Fi network for signs of danger. There's help setting up the Android system kill switch, an OpenVPN TCP option to maybe improve connection reliability, and a Contact Support area where you can send a message from inside the app.",
    "We'd like more. WireGuard support would be a big plus here, as with the rest of the range – but overall this is a quality app which is easy to use and offers a lot of functionality.",
    "We measured HideMyAss! speeds from US and UK locations, both with 1Gbps connections, using several performance testing sites and services (SpeedTest's website and command line app, TestMy.net, Netflix's Fast.com and more). We checked the download speeds at least five times from each site, and then we repeated all the tests in an evening session.",
    "OpenVPN results were excellent at 340-350Mbps in the UK, 270-410Mbps in the US. That beats most providers in recent testing, although a few have edged ahead: Hide.me managed 390Mbps, and ProtonVPN hit 400-460Mbps.",
    "VPNs with WireGuard and similar protocols delivered much faster downloads in our testing, though. CyberGhost WireGuard connections reached 760-860Mbps, for example, and NordVPN's Nordlynx delivered 760-880Mbps. But if you're hoping to set up the service on a router, or maybe connect via some third-party app, OpenVPN performance is likely to matter, and HideMyAss! should be more than fast enough for most situations.",
    "Point your browser at the HideMyAss! website and you'll read that the service allows you to \"stream your favorite TV shows from wherever you are in the world using one of our dedicated streaming servers.\" Sounds good, but is it true?",
    "The HideMyAss! Windows client enables filtering its location list to display only streaming servers, and right now there are just six of these: four in the US, one in London and another in Frankfurt. That's not exactly a lot of choice, and we wondered whether that would make it easier for streaming websites to detect and block them.",
    "The server shortage didn't seem to be an issue in the UK, where we could stream BBC iPlayer content from three separate logins and IPs without any hassles.",
    "The US story was disappointing. We couldn't get into Amazon Prime Video and Disney Plus from anywhere. And although HMA unblocked US Netflix for our last review, we had no luck this time.",
    "That's a poor result, but HMA isn't alone. Netflix has been fighting VPNs even harder this year, and plenty of services are blocked right now. But if accessing streaming sites is a must for you, CyberGhost, ExpressVPN, Private Internet Access, ProtonVPN and Surfshark all unblocked every one of our test sites.",
    "The HideMyAss! support site offers a wide range of resources, including setup guides, a searchable knowledgebase, FAQs, a web forum, and 24/7 live chat for anything urgent.",
    "The web content isn't as in-depth or well-presented as some of the competition. ExpressVPN has a host of detailed setup guides, all easily accessible in a couple of clicks from the support page. HideMyAss! doesn't organize its articles quite as neatly, and when you do find them, there's less information, and occasionally some questionable points.",
    "For example, various troubleshooting guides include recommendations for disabling Windows driver signing checks, resetting the Winsock catalog and other technical steps. This isn't necessarily bad advice if you know what you're doing, but it's also seriously advanced stuff with implications for your security and other apps, and we wouldn't expect it to appear in a general installation tutorial for all levels of user.",
    "The HideMyAss! community forum isn't a busy place, but post a question there and it's normally answered by a staff member within a few hours. Replies are generally helpful, and if the problem isn’t solved on the forum, the support team will often create a ticket for you or send you a direct email to discuss the issue further.",
    "If you can't wait, live chat is on hand for swift assistance. We asked about a Windows installation issue, and within minutes, a support agent began giving us a helpful and accurate solution. That works for us, and overall, we think HideMyAss! should be able to help you solve most common VPN issues.",
    "HMA's unblocking performance is below-par, and although OpenVPN speeds are great, they can't match the WireGuard competition. That said, the apps are easy to use, there's a huge choice of locations, and the company's no logging promises are backed by an independent audit. If these are your priorities, give HideMyAss! a try."
  ],
  "headers": {
    "6": "HideMyAss pricing",
    "18": "Privacy and logging",
    "26": "Apps",
    "31": "Kill switch",
    "36": "IP Shuffle",
    "39": "iOS app",
    "44": "Android app",
    "49": "Performance",
    "52": "Netflix and streaming",
    "57": "Support",
    "62": "HideMyAss! review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "annual plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7830041244861541000&xs=1&url=https%3A%2F%2Fwww.hidemyass.com%2Fen-us%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "three years": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3828388521589603000&xs=1&url=https%3A%2F%2Fwww.hidemyass.com%2Fen-us%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "two years": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9912179058599188000&xs=1&url=https%3A%2F%2Fwww.hidemyass.com%2Fen-us%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "three": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7727160963474063000&xs=1&url=https%3A%2F%2Fwww.hidemyass.com%2Fen-us%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "Bitcoin": "https://www.techradar.com/best/mining-rigs",
    "helpful guide here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1295780714607424800&xs=1&url=https%3A%2F%2Fblog.hidemyass.com%2Fen%2Fpayment-options&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "Legal section": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5838744218960059000&xs=1&url=https%3A%2F%2Fwww.hidemyass.com%2Flegal&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "privacy policy": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7905116003381890000&xs=1&url=https%3A%2F%2Fwww.hidemyass.com%2Flegal%2Fprivacy&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6960809709681833000&xs=1&url=https%3A%2F%2Fblog.hidemyass.com%2Fen%2Fhma-is-now-a-no-log-vpn&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "pointers": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1292486905981012000&xs=1&url=https%3A%2F%2Fsupport.hidemyass.com%2Fhc%2Fen-us%2Farticles%2F202724056-Linux-Getting-started&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "ProtonVPN": "https://www.techradar.com/reviews/protonvpn",
    "support site": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8022600811447262000&xs=1&url=https%3A%2F%2Fsupport.hidemyass.com%2Fhc%2Fen-us&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn",
    "community forum": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1140452324221153500&xs=1&url=https%3A%2F%2Fsupport.hidemyass.com%2Fhc%2Fen-us%2Fcommunity%2Ftopics&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhidemyass-vpn"
  }
}