{
  "source": "https://www.techradar.com/reviews/deezer",
  "title": "Deezer review",
  "category": "audio-visual",
  "updated": "2021-09-16T13:39:07Z",
  "author": "olivia-tambini",
  "summary": "Should you subscribe to Deezer in 2021?",
  "verdict": "With more than 73 million tracks under its umbrella, Deezer’s vast catalogue means you won’t be missing out on your favorite artists if you decide to make the switch from Spotify. Offering a simple interface, the French streaming service is an excellent value for money alternative to Spotify if you’re looking for higher-quality streams, but don’t want the expense of a Tidal HiFi subscription – and Sony 360 Reality Audio support just sweetens the deal. Having said that, if CD-quality streaming isn’t a priority then you may be better off sticking with Spotify as a result of its superior music curation – and if it’s hi-res audio that you need, you won’t find it with Deezer.",
  "pros": [
    "CD-quality streams",
    "Good value for money",
    "Support for Sony 360 Reality Audio"
  ],
  "cons": [
    "Sparse interface",
    "No hi-res audio",
    "Social aspects could be improved"
  ],
  "article": [
    "Deezer appears to have been around forever, but if you haven’t taken a look at the music streaming service recently, then it’s well worth checking out in 2021.",
    "The service has really developed over the years, and thanks to Deezer’s embrace of high-quality music streaming and spatial audio formats, it’s a worthy competitor to the most popular platform in the world, Spotify.",
    "A catalogue of more than 73 million songs means that you’re unlikely to miss out on your favorite artists if you do plump for Deezer over Spotify, while it’s well-priced subscription plans mean that there’s a streaming tier for everyone, from families to audiophiles. Best of all, these subscription plans come with a free three-month trial period, giving you the opportunity to really dig into the platform before you commit.",
    "The user interface doesn’t feel quite as intuitive as Spotify or Apple Music, with a rather sterile aesthetic. That being said, Deezer is easy to use and navigate, whether you’re engaging via the desktop browser, desktop app, or mobile phone app.",
    "Like other streaming services, Deezer’s music curation consists of a mixture of curated and personalized playlists. You’ll find playlists organized by music genre and mood, alongside chart-based roundups. In addition, your listening habits will inform algorithmically generated playlists tailored to your tastes.",
    "The latter, while perhaps not as well curated as Spotify and Tidal’s offerings, are pretty good, and the platform’s innovative Flow technology means you can listen to an infinite stream of personalized tracks with just one tap/click.",
    "The audio quality on offer depends on the subscription tier you sign up to: Deezer’s Free subscription plan offers MP3 files at 128kbps, while its Premium tier tops out at 320kbps, matching Spotify’s own Premium tier.",
    "What interests us most, however, is the Deezer HiFi tier. Costing $14.99 / £14.99 / AU$14.99 per month, it allows you to stream songs in CD quality, with 16-bit / 44.1kHz FLAC files at 1,411kbps, which is the same as Tidal’s more expensive HiFi tier. Note, though, that there’s no access to true hi-res audio files with Deezer.",
    "However, Deezer’s HiFi tier does come with access to Sony’s 360 Reality Audio format, via a dedicated app. These tracks have been given the spatial audio treatment, sounding as though every instrument is coming at you from a different angle within a virtual sphere of sound. Tidal offers this, too – but again, it’s more expensive.",
    "Overall, Deezer is a great alternative to Spotify if you’re looking for higher-quality streams, but you don’t want to shell out $19.99 / £19.99 / AU$23.99 a month for Tidal HiFi. A robust music catalogue, decent music curation, simple interface, and support for Sony 360 Reality Audio sweeten the deal. It’s just a shame the company hasn’t made the jump to true hi-res audio yet.",
    "If it does, it could encourage a few more listeners to make the jump from Spotify, especially now that the streaming service is planning its own rival to the Deezer HiFi tier.",
    "UPDATE: Deezer will now offer its HiFi subscribers Deezer 360 Sessions, which are live performances that have been formatted in Sony 360 Reality Audio.",
    "These are recorded using Sony’s spatial audio tech, which records the position of instruments and sounds live, giving you an immersive experience when you listen.",
    "Right now there are 28 tracks in the 360 Sessions playlist, including Dua Lipa, Lolo Zouai, Barrie, Fireboy Dml and Josef. To access them, HiFi subscribers download the standalone 360 by Deezer app.",
    "Deezer is available in more than 185 countries, with “more being added over time”. Like Spotify, Deezer offers a free streaming tier that allows you to shuffle through its 73-million strong catalogue of tracks – although these will be peppered with ads.",
    "The cheapest paid-for plan is Deezer Premium, which costs $9.99 / £9.99 / AU$11.99 per month. Here, you can listen ad-free, plus it allows unlimited skips, and provides access to Offline mode.",
    "If a few people in your household use Deezer, the service’s Family subscription plan allows for up to six individual accounts across up to 13 devices, offering optional kids’ profiles that let you keep an eye on what your children are listening to. A Deezer Family subscription costs $14.99 / £14.99 / AU$17.99 per month.",
    "Deezer HiFi (also known as Deezer Premium+ in some regions) costs $14.99 / £14.99 / AU$14.99 per month, and provides access to CD-quality music in the 16-bit/44.1kHz FLAC codec, as well as tracks in Sony’s 360 Reality Audio format.",
    "There are a number of discounts available on Deezer subscriptions. For example, sign up for an annual subscription and you can save 25% on your bill, while the Deezer Student plan costs just half the price of a Premium subscription while offering all the same benefits.",
    "All of Deezer’s plans are available with a free three-month trial period – except for Deezer Student, which comes with a one-month free trial period.",
    "Deezer is available to use via a desktop app, mobile app, and a flash-based web player.",
    "The desktop app requires Windows 7 or later / macOS 10.10 or later to work, and lets you play, pause and skip tracks via your keyboard, and supports Offline mode and video content.",
    "You can download the mobile app for Android, iOS devices, and Windows 10 mobiles and tablets. Deezer is also compatible with a range of smart watches, smart TV platforms, wireless speaker systems such as Sonos, car interfaces, and the Xbox. That’s not all – Chromecast and AirPlay support means you can send your music to even more devices.",
    "While it’s preferable to use the app, the Deezer web player works in a pinch, offering a stripped-back version of the platform in your browser.",
    "Deezer’s user interface is minimal, with album artwork displayed as tiles on a plain white background. Compared to the likes of Spotify, and even Apple Music, Deezer looks almost sterile, although some users will enjoy the simplicity of its interface.",
    "On the desktop app, you’ll find your favorite artists, daily mixes based on your listening habits, genre and mood playlists, chart playlists, and recommended radio stations.",
    "A sidebar on the left of the screen allows you to toggle between Music, Shows (podcasts and radio), Explore (which allows you to navigate music and podcasts by genre and category) and Favorites.",
    "Beneath the Favorites tab you’ll find your Favorite Tracks (to add a track, just select the heart icon next to its title), Downloads, Playlists, Albums, Artists and Podcasts.",
    "As with most streaming apps, the playback bar itself sits at the bottom of the screen, with a small menu that lets you adjust the audio quality of your music.",
    "The mobile app is similarly minimal, with the sidebar moved to the bottom of the screen; playing a song will bring the playback bar into full-screen, where you can adjust the audio, set a sleep timer (handy, if you fall asleep to your music and don’t want it playing all night long), and a Share button, which comes with the option to share your music as an Instagram Story.",
    "Speaking of social media support, Deezer does allow you to share your listening habits to a variety of apps, and you can follow your friends on the platform. However, unlike Spotify, there’s no way to view what your friends’ are listening to live. Furthermore, since Spotify is the more popular platform, you’re more likely to find your friends on that platform – so, if you’re a social animal then it’s worth considering whether Deezer is right for you.",
    "That’s not a deal-breaker, though. Overall, Deezer feels super-easy to navigate, with a clear layout that makes discovering music very simple.",
    "Deezer states the platform is home to more than 73 million tracks. Compared to other streaming platforms, we didn’t notice any glaring omissions in the artists you can listen to – at least not any that aren’t missing from Deezer’s rivals too.",
    "As well as finding music using the search facility, there are lots of playlists available to scroll through on the app’s homepage, curated by genre and mood. Deezer also recommends the most popular albums and tracks on the platform, new releases, chart toppers, and timely playlists (Monday Motivation, for instance).",
    "Like Spotify, Deezer uses algorithms to recommend music you may enjoy, which results in your Daily Mix, Monday Discovery, Sunday Chill, Friday Releases, and Family playlists, as well as a feature the platform calls Flow.",
    "Flow combines your favorite music, new recommendations, and songs you may have listened to in the past and forgotten about, playing an “infinite” stream of music once you press the play button.",
    "You’ll need to ‘favorite’ at least 15 tracks before the Flow playlist appears on your home screen, but once you have, you’ll have an easy way to listen to music with very little thought required on your part. Unlike Spotify’s For You playlist, however, the music never ends – so you can set it to play and sit back, with your day’s listening sorted in one click.",
    "Deezer’s Free subscription plan offers MP3 files at 128kbps, while its Premium tier tops out at 320kbps, matching Spotify’s own Premium tier.",
    "You have the ability to adjust the audio quality settings and set presets for when you’re listening over Wi-Fi as opposed to using your phone’s mobile data – handy, if you’re keeping an eye on your data usage.",
    "For more discerning ears, there’s Deezer HiFi, which allows you to stream songs in CD quality, with 16-bit / 44.1kHz FLAC files at 1,411kbps. According to Deezer, there are over 70 million tracks available to stream at this standard, which means nearly all of the platform’s catalogue can be heard in CD quality.",
    "Subscribers to this tier also get access to exclusively curated content, including a HiFi Gold playlist series, which sees artists such as Sharon Van Etten, Celine Dion, and Fleet Foxes recommend 20 tracks to listen to with Deezer HiFi.",
    "The difference in audio quality may not be immediately discernible to all ears, but audiophiles will appreciate the bump up in fidelity, improved detail, and overall richer sound – especially if you’re using high-quality headphones with an external DAC or amplifier.",
    "An added bonus of Deezer HiFi is that you get access to the platform’s 360 by Deezer app, which provides thousands of tracks in Sony’s 360 Reality Audio format.",
    "The technology uses 360-degree sphere-mapping, where each individual instrument, vocal line and effect needs to be specifically placed in a virtual sphere. The effect is that it feels as though you’re right at the center of the music, with sound coming at you from all angles.",
    "We tested this out using the Sony WH-1000XM4, and listening to David Bowie’s Space Oddity. Percussion echoed around the back of our head, with strummed guitar panning to our right and Bowie’s vocals front and center.",
    "The format certainly adds a sense of space to recordings – we wouldn’t say it's natural exactly, since you’re rarely afforded the opportunity to sit surrounded by your favorite band as they play. Nevertheless, the wide soundstage means you almost forget that you’re wearing headphones.",
    "360 Reality Audio won’t be a draw for everyone, but if you’re keen to experience your favorite songs in a new way, and you have a pair of decent headphones within arm’s reach, it’s an excellent feature that’s unique to Deezer."
  ],
  "headers": {
    "0": "Two-minute review",
    "14": "Deezer price and availability",
    "20": "Platforms and compatibility",
    "24": "User interface",
    "32": "Music catalogue and discovery",
    "37": "Audio quality",
    "47": "Don’t subscribe if…"
  },
  "links": {
    "music streaming service": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Sony’s 360 Reality Audio": "https://www.techradar.com/news/first-look-sony-360-reality-audio",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Deezer 360 Sessions": "https://www.deezer-blog.com/press/360-sessions/",
    "Sony 360 Reality Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones"
  }
}