{
  "source": "https://www.techradar.com/reviews/bing-search-engine",
  "title": "Bing search engine review",
  "category": "computing",
  "updated": "2021-09-28T16:30:27Z",
  "author": "lindsay-pietroluongo",
  "summary": "Microsoft’s answer to search",
  "verdict": "Microsoft Bing may perform on par with leading search engines, but you’ll need a login and Edge for the most privacy.",
  "pros": [
    "Rewards system",
    "On-page topic updates",
    "Reliable search results"
  ],
  "cons": [
    "Most effective with sign-in and Edge",
    "Minimal features",
    "Vague privacy control"
  ],
  "article": [
    "Bing is Microsoft’s search engine, and it’s most commonly paired with Edge, the company’s browser.",
    "While Bing can hold its own in terms of search results, often returning the same items as other leading browsers, you’ll want to use the rest of the Microsoft world of products to get the most out of it. Here’s what we found.",
    "If you have a Microsoft account (or create one), you can sign in via Bing. When you do, you may notice that the Rewards icon on the top right of the page goes up in number.",
    "You earn rewards by searching with Bing (you get more if you use Microsoft Edge), shopping at the Microsoft Store, playing Xbox, taking quizzes and polls, etc. You can redeem your rewards by doing things like donating to a cause, entering a sweepstakes, or ordering a gift card.",
    "Another feature of Bing that competing search engines don’t tend to have is the ability to add notifications to your homepage. Select a topic, and when something new is published about it, you’ll get a notification that there’s an update on what you’re interested in.",
    "The best way to maintain control over your privacy when you use Bing is to sign in to your Microsoft account when using the search engine – and it’s recommended that you use Microsoft Edge along with Bing.",
    "It’s unclear how much you can see and manage if you use Bing on another browser. At Bing.com, you can click the Three Horizontal Lines menu on the top right of the page, then click Search History and see the option to view and clear your search history. But Microsoft’s privacy page says that you can “clear browse data that we collect when you use Cortana and Microsoft Edge.” So while you may be able to clear your search history with just Bing.com, you may need to use Edge to see and clear the collected search data – which makes a difference.",
    "You can access your privacy controls by going to that link above and clicking Sign In With Microsoft. The Browsing History section talks about how Edge saves information about the websites you visit using the browser, and it shows you how to view and delete that browser history. Again, it doesn’t clarify what happens to your data if you just use Bing.com, even if you’re signed in to your Microsoft account. To be as safe as possible, we suggest using Bing along with Edge.",
    "Bing’s search results can be richer than Google’s. For example, when searching for, “What’s the weather today?” this is what Bing returned:",
    "While this is what Google returned when searching for the weather:",
    "The same happened when searching for “best movies” – Bing’s results were a bit more rich than Google’s and Yahoo’s:",
    "We also tested Bing versus Google when searching for “TechRadar.” Both search engines returned TechRadar.com as the first result, followed by three of the site’s latest headlines, with the option to scroll through more. And both search engines had a TechRadar info box on the right side of the results page. Moving down each page and on to the next, results were almost identical – mostly links to TechRadar’s social profiles, aggregate sites, and reviews.",
    "You can use Bing by going to Bing.com, or you can change your default search engine to Bing. Here’s how you change your default for Safari and Chrome. If you use a different browser that doesn’t offer Bing, you can still use the search engine by going to the dedicated website.",
    "On Safari, go to Safari > Preferences > Search. Then, from the Search Engine drop-down menu, select Bing.",
    "On Chrome, go to Chrome > Preferences > Search Engine > Search Engine Used in the Address Bar. Select Bing from the drop-down menu.",
    "You can also install Bing Search apps for Android and iOS. With the mobile app, you can sign in to your Microsoft account on your computer without using a password.",
    "It’s difficult to fully assess Bing without considering the Edge browser because the two are designed to work together. Edge is a contender in the browser market, especially if you do a lot of online shopping – its e-commerce features are excellent. But even with Bing plus Edge, security features feel limited, and there are other search engines, browsers, and hybrids that are much safer.",
    "That said, Bing’s results are aligned with those from leading search engines (namely Safari and Chrome) and much better when compared to Yahoo. That’s a major improvement from the Bing of years past, which fell under scrutiny for poor, outdated, and even inappropriate search results.",
    "Bing has a couple of extras that other search engines don’t have (or don’t have front-and-center), but the rewards take so much time to accrue and have such high trade-in rates that a lot of users may just forget about them. The on-page updates about your tagged topic are undeniably nice, though.",
    "Most importantly, Bing’s privacy settings are their most powerful when you sign in to your Microsoft account and use the Edge browser ­– and even then, we’ve found that the security features can feel minimal. Since Bing doesn’t have many bells and whistles or search results superior to other (safer) search engines, we’re not sure what its draw and competing differentiator is.",
    "We don’t want to deter you completely, though. Take a look at our article about Bing’s new bots, which may help you with your searches."
  ],
  "headers": {
    "2": "Features",
    "5": "Privacy",
    "8": "User experience",
    "12": "Platforms",
    "16": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Bing": "https://www.bing.com/",
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "browser": "https://www.techradar.com/best/browser",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "privacy page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1179547256228881400&xs=1&url=https%3A%2F%2Faccount.microsoft.com%2Faccount%2Fprivacy&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbing-search-engine",
    "Android": "https://play.google.com/store/apps/details?id=com.microsoft.bing&hl=en_US&gl=US",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1157996803143610600&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fmicrosoft-bing-search%2Fid345323231",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Bing’s new bots": "https://www.techradar.com/news/microsoft-bing-search-might-finally-be-getting-a-little-useful"
  }
}