{
  "source": "https://www.techradar.com/reviews/gator-website-builder",
  "title": "Gator Website Builder review",
  "category": "computing",
  "updated": "2021-05-06T23:18:28Z",
  "author": "mike-williams",
  "summary": "Build yourself a professional-looking website with ease",
  "verdict": "Gator website builder by HostGator provides an easy way to personalize your own website. Plus, you can update your website any time, even after you launch it.",
  "pros": [
    "Excellent editor",
    "Easy to use",
    "Free SSL certificate"
  ],
  "cons": [
    "Limited ecommerce capability",
    "Basic blog"
  ],
  "article": [
    "Gator Website Builder bundles excellent web hosting from HostGator with a user-friendly WebsiteBuillder.com-powered site designer which makes it easy to create a quality online presence.",
    "The service is absolutely stuffed with features, and almost all of them are available in even the cheapest plan. There's unlimited pages, storage and bandwidth, a free domain name, a bundled SSL certificate, access to the Unsplash image library, a responsive design and 24/7/365 support to keep your site running smoothly.",
    "As of the time of writing, Gator comes with three different plans to help your business go virtual. They’re all called ‘Express’ though, which can be a tad confusing.",
    "Express Start costs $3.84 per month. The main difference between it and its bigger brethren is the limits on monthly email campaigns and ecommerce products: three for both.",
    "Express Site is yours for $5.99 per month. It increases your campaign and ecommerce capability by five and ten respectively. HostGator also enables online bookings and offers priority support for this plan.",
    "The top of the line is the Express Store plan for $9.22 per month. As you’d expect from its name, it focusses on ecommerce, and with that in mind, enhances Site’s offering by allowing you to add an unlimited number of products, and also removes any transaction fees (which is 3% for the other plans).",
    "Do note that these prices are promotional for the first year, offering you a 50% discount over the usual price.",
    "HostGator also offer you a 45-day money back guarantee on the hosting fee, should you not be satisfied with their service.",
    "Signing up for Gator Website Builder is simple and straightforward. The interface is familiar, and generally easy to use. A left-hand sidebar enables managing key areas of your hosting (websites, domains), while the opening screen prompts you to create your website, and once you're up and running, gives you a few very basic stats (unique visitors, total visits, page views, bounce rate.)",
    "Tapping the Create A Site link displays thumbnails of Gator's hundreds of templates. There’s a lot to explore, but you can use keywords to narrow down your search.",
    "The editing interface is familiar and straightforward. A left-hand sidebar enables adding various types of content to the site; a toolbar at the top of the screen has a range of essential functions (page navigation, undo/ redo, desktop or mobile views, Save, Preview and Publish options), and the rest of the screen is reserved for the content of your current page.",
    "Gator's pages are initially built from predefined sections. These start with a header and a footer, but you can add others to display particular content types (text, images, videos, image galleries, schedule, a Features, Contact Us, Join My Mailing List section, and more.)",
    "Each section comes in multiple templates, with their own layout and formatting. Sections like Images & Text, Video & Text and Text & Buttons allow you to include further content. Pick whatever most closely matches your needs, and you can add it to the page in a couple of clicks.",
    "You’ll also find Elements which you can drag onto your pages - to help you further customise these templates, or create sections on your own from scratch. There are a good range of elements in most of the key areas, and include multiple button types, live feeds to Twitter and Instagram, various PayPal buttons (Buy Now, Add To Cart, Donate, and Check Out), and a range of social media features (social links, sharing icons, Like buttons, Follow buttons and more.)",
    "Page layouts are generally very flexible. Existing section elements can be moved or resized, and new elements may be dropped onto the page with pixel-level precision.",
    "Clicking any object within a section - a text block, an image, a menu, social media buttons - displays a floating toolbar above it, with actions you can perform. These start with a decent set of standard options, including the ability to add animations (have an image fly in from the left, for instance), use drop shadows, or have the element move with the page. But there are also a good number of more element-specific tweaks to explore.",
    "Add a video gallery, you can set up the number of items on a space, how they're positioned, the entrance and exit transitions, the transition timings, SEO information, and set up any custom element behaviours (display a pop-up image when an element is clicked, for instance.)",
    "Although all sites are advertised as fully responsive, The Mobile Preview section feels pretty limited, only offering an illustration of what your site would look like on a phone in vertical orientation. You can’t appear to be able to rotate it, or even see what it would look like on a larger tablet.",
    "Smart design keeps Gator easy to use. Key functions are available in a click or two, and most of the complicated stuff is tucked away where it won't baffle newbies. Overall, it's a well-balanced editor which has plenty to offer both first-timers and more demanding users.",
    "Adding a blog to your Gator site, and managing it afterwards, is quick and easy.",
    "The process starts by selecting your preferred templates. New blog posts are created using a subset of the standard page editor. There are all the usual text formatting commands, but you don't get access to the main editing widgets, and the Add Element button only allows for the insertion of images, videos, lines, headings and paragraphs. If you want to add a map, or an image gallery, or any of the other components available in the main editor, you're out of luck.",
    "There are plenty of ways to customise how your post looks and behaves on the blog page. You're able to set a title, a cover image, and a summary, as well as assigning tags to help users find related posts, and pin a post to the top of the blog.",
    "There's no option to schedule posts, unfortunately. Blog comments are supported by the Facebook comments system only, which can't be controlled or configured in any way. The blog has one advanced feature in its optional RSS support, but otherwise it's very much about the basics only.",
    "As mentioned above, all of Gator Website Builder plans give you an option to extend your site with a simple web store, but only the high end one offers you all the bells and whistles.",
    "The store supports both physical goods and digital products. You can make the digital download time-limited, or set a maximum number of times a customer can download the same product from a single purchase.",
    "If you need to import a ready-made product catalog, Gator accepts various formats such as Excel, Google Sheets, ecwid, and CSV. If your needs are more modest and you only have a few products to sell, you can input the data manually as well.",
    "There is very little control over how products will be structured and displayed however. Your time will mostly be spent entering product details and configuring key store data (address, preferred currency, and so on.)",
    "Product descriptions are basic, but there is enough power here for many simple sites. You start by entering one or more images, along with some formatted text and a price. There's support for product variants (size, color) and organizing products into categories (shoes, accessories). Setting up and applying discounts should appeal to potential customers, and adding a weight allows the site to automatically calculate shipping rates.",
    "None of this begins to compete in depth and power with specialist e-commerce providers like Shopify, but Gator is undeniably easy to use, and much cheaper. You could manually add three or four products in a few minutes. Shipping and tax calculations (with international support) are built in, PayPal integration enables taking payments right away, and creating a Stripe account gets you card support, too. There’s also an option for Cash on Delivery.",
    "Experienced users won't be impressed, but Gator Website Designer could be a reasonable choice for creating a simple web store.",
    "Gator Website Builder's smartly-designed editor is a great way to quick create professional and good-looking websites. The integrated blog and web store are relatively basic, though, and are unlikely to satisfy demanding or experienced users, but could well be appealing to beginners.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "8": "Setup",
    "10": "Features",
    "19": "Blogging",
    "23": "E-commerce",
    "30": "Final verdict"
  },
  "links": {
    "Gator Website Builder": "https://partners.hostgator.com/c/221109/653754/3094?subId1=trd-us-6723345039576650000&sharedId=trd-us&u=https%3A%2F%2Fwww.hostgator.com%2Fwebsite-builder",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "three different plans": "https://partners.hostgator.com/c/221109/653754/3094?subId1=trd-us-6736414411523400000&sharedId=trd-us&u=https%3A%2F%2Fwww.hostgator.com%2Fwebsite-builder",
    "Express Start": "https://partners.hostgator.com/c/221109/653754/3094?subId1=trd-us-3513541703990415000&sharedId=trd-us&u=https%3A%2F%2Fwww.hostgator.com%2Fwebsite-builder",
    "Express Site": "https://partners.hostgator.com/c/221109/653754/3094?subId1=trd-us-5695241521739093000&sharedId=trd-us&u=https%3A%2F%2Fwww.hostgator.com%2Fwebsite-builder",
    "Express Store plan": "https://partners.hostgator.com/c/221109/653754/3094?subId1=trd-us-4669197230034898000&sharedId=trd-us&u=https%3A%2F%2Fwww.hostgator.com%2Fwebsite-builder",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "blog": "https://www.techradar.com/news/the-best-free-blogging-sites",
    "e-commerce providers": "https://www.techradar.com/news/best-ecommerce-hosting",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "taking payments": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}