{
  "source": "https://www.techradar.com/reviews/tidal",
  "title": "Tidal review",
  "category": "audio-visual",
  "updated": "2021-04-09T10:56:01Z",
  "author": "becca-caddy",
  "summary": "Exceptional sound quality for audiophiles",
  "verdict": "Tidal is the streaming service you need if you care about audiophile-approved listening. It also proves Spotify isn’t the only service with a huge library of music, curated playlists and easy-to-use apps. Anyone serious about music should sign-up for a free 30-day trial to see if you can tell the difference between Tidal’s stellar sound and your current music streaming service of choice.",
  "pros": [
    "Exceptional sound",
    "Music videos",
    "Great interface"
  ],
  "cons": [
    "HiFi is expensive",
    "Playlists not quite as polished as Spotify",
    "No podcasts"
  ],
  "article": [
    "Tidal first launched in 2014, but most of us first heard about it a year later when it was relaunched by Jay-Z at a celeb-studded event in March 2015.",
    "Looks-wise, it’s very similar to Spotify. But there are two key things that make it stand out in a growing sea of music streaming services.",
    "The first is it’s billed as being artist-owned. This means it gets a better deal (although not necessarily a great deal) for musicians, paying them higher than many services per stream.",
    "The second is listeners get a better deal too, thanks to superb CD-quality sound, especially if you’re willing to pay extra for Tidal’s highest-tier premium subscription, HiFi.",
    "Let’s be clear. If you listen to music casually, this isn’t the service for you. Either make do with the free version of Spotify or sign up to Spotify premium or any other music streaming service. However, if you take your listening more seriously, this could be a match made in heaven.",
    "You might notice a slight difference between Spotify Premium and Tidal Premium, but they do offer the same bitrate. Instead, it’s the $19.99/£19.99 Tidal HiFi streaming that makes the most sense and is the most significant jump in quality.",
    "Of course, this will be a high price for some to pay, for others it’s a no-brainer. Especially if you’ve already invested in the audio hardware – like a pair of the best noise-cancelling headphones or one of the best surround sound systems. Tidal is one of the few streaming services out there with lossless and high-res audio files that’ll do your love of music and top-notch audio set-up justice.",
    "If you’re interested, start with the 30-day free trial. You might not notice a difference between Tidal and your music streaming service of choice, but you might notice the difference immediately and realize what you’ve been missing out on.",
    "Of course, this could all change when Spotify HiFi launches – this is rumored to be later on in 2021. But, until then, Tidal is the best option for those who are serious about sound.",
    "In this review we’ll take a fresh look at what the Tidal experience is like in 2021, covering the selection of tracks, whether the audio quality is as good as promised and the extra features that might sweeten the deal and set it apart from mounting competition.",
    "Tidal is a music streaming platform. It allows you to play music from the cloud to a number of different devices.",
    "The service suggests tracks, artists and playlists you might be interested in, as well as allowing you to search for fresh new music. You can also save you favourite playlists, albums and tracks, as well as download them for offline listening.",
    "The difference between Tidal and a service like Spotify is the high quality audio on offer. With Tidal’s HiFi subscription, the audio quality is markedly better than what Spotify Premium provides. This is one of the reasons Tidal is considered a fantastic option for those who take music seriously.",
    "It’s worth remembering that Tidal might be one of the best high-quality music streaming options around right now, but it isn’t the only one. Deezer HiFi remains a top contender for high-res audio and both Amazon Music HD and Qobuz both offer CD-quality listening now too.",
    "Spotify HiFi, Spotify’s upcoming Hi-Res Audio streaming service, is also expected to launch in 2021, which could shake up this space in a big way.",
    "You have two options with Tidal: premium and HiFi.",
    "Unlike Spotify, there’s no free version of Tidal. Instead, you can choose one of the services above first and then try a free 30-day trial before you commit to a subscription fee.",
    "Tidal premium costs $9.99 / £9.99 / $11.99 a month and Tidal HiFi costs $19.99 / £19.99 / AU$23.99 a month. There’s a big leap between the two at double the cost. That’s because with Tidal HiFi you get HiFi sound quality, and access to Tidal Masters – more on that later.",
    "At the time of writing, there are more than 70 million tracks on Tidal – this is the same number you can currently find on Spotify.",
    "There have been times in the past when one service doesn’t have a specific artist, but a competing service does. That means it’s best to check your faves are on Tidal before you commit. This can vary depending on which region you live in, so do your research.",
    "Unlike many other music streaming services, Tidal also has a section specially for videos. At the time of writing, there are more than 250,000 videos on the platform. You can watch many full length shows and concerts, as well as some classic videos, either within the app or cast them to your TV. This is a cool addition, but you won’t find videos from all your favorite artists here.",
    "The Tidal mobile app works on iOS devices running iOS 13 and above, and Android devices running Android 6 and above. The Tidal desktop app is available on MacOS on devices running OS X 10.10+ and above, as well as on Windows devices that are running Windows 7 and above. You can also listen to Tidal via a web player, which works in both Chrome and Firefox.",
    "Tidal Connect also allows you to stream tracks to a range of other devices, including Cambridge Audio and KEF sound systems, as well as within some cars thanks to Apple’s AirPlay and Android Auto. You can visit Tidal Connect to see whether your device is supported.",
    "The Tidal desktop app interface is clean and simple. It has a minimal black and gray colour scheme that’s similar to Spotify and makes the album artwork really stand out.",
    "When you open the desktop app, you’ll see a sidebar down the left edge. Here you’ll find Home, which takes you to the home screen of the app. This features mixes created for you, suggested albums, new tracks and trending music. This is also where you’ll find the Tidal Rising suggestions, which highlights up-and-coming talent – a great option if you feel like algorithmically-created playlists are limiting your listening.",
    "The Explore tab is where you can search for new music via genre or moods and events, like workout, party or relax. There’s then a section called My Collection. Think of this as your old-school music collection. These are things you’ve saved and it’s divided up into sections, including Mixes & Radio, Playlists, Albums, Tracks, Videos and Artists.",
    "On mobile the experience is just as intuitive and simple. Instead of a sidebar, a menu bar along the bottom of the screen does the same job.",
    "One of the differences between the desktop and mobile app is sharing. On desktop, you can share a track, album or playlist to Twitter, Facebook, copy the link or copy the embed code. This is pretty standard. But in the mobile app, you can share directly to Facebook Stories or Instagram Stories. Some people won’t care about this feature, others will love the Stories-worthy image Tidal creates for you out of the artwork for the track you’re listening to, which you can then share instantly.",
    "Spotify is considered the king of creating playlists perfectly crafted for you, but Tidal clearly has a powerful algorithm working behind-the-scenes to make solid recommendations too.",
    "For example, when you first sign up for the service, you’re encouraged to pick three of your favorite artists. This informs your first mix, called your Welcome Mix. Based on only three artists, we weren’t holding out much hope with this playlist, but it was spot on taste-wise and we listened to nothing else for the first morning we signed up.",
    "The more you like and listen to music, the more Tidal will learn about your tastes and generate several playlists called My Mix. Each is based on your listening and focuses on a different genre. These don’t update as regularly as Spotify’s, but tend to do a great job at predicting what users will like. Make sure to hit save if you like a particular My Mix. This way you can save it as a separate playlist before it gets refreshed.",
    "The mix of playlist recommendations and updates doesn’t feel as expansive as what Spotify offers, there also aren’t as many fun themed playlists, like Wrapped or Time Capsule, but it’s not too far off.",
    "Unfortunately, you can’t add local music files to Tidal. This is a bit of a shame but shouldn’t be a dealbreaker for most people. If it is, look at Spotify or Deezer instead.",
    "However, you can transfer your music library and your playlists from other music streaming services to your Tidal library via third-party apps.",
    "There are two types of Tidal subscription and two levels of audio quality on offer.",
    "The first is Tidal Premium, this brings you streaming at a bitrate of 320kbps. That’s the same you have if you’re subscribed to Spotify Premium and select the ‘Very High’ quality option in your settings (this isn’t the default). However, we found that, despite having the same bitrate, Tidal did provide a clearer, richer sound most of the time.",
    "The second is Tidal HiFi. This provides streaming at 1411kbps and uses FLAC. This is an audio format that offers a better way to stream music compared to most other streaming services, which use MP3 or other formats that remove aspects of the original recording to compress the file. This, as you might expect, means they don’t have the same high-res sound performance.",
    "This is where Tidal HiFi is different. You can listen to lossless compressed tracks. This is 4.4 times the bitrate of the highest Standard Definition streams you’d find on other services.",
    "This is kind of like the difference between SD and HD television. The former works just fine, but you’ll notice a real difference in quality if you make the upgrade to higher resolution audio. Put simply, the sound is better and in its purest form. But hold up, it gets even more impressive and immersive than that.",
    "Thanks to a partnership between Tidal and MQA (Master Quality Authenticated), Tidal Masters are available through Tidal HiFi and can stream up to 9216kbps. These are master recordings of certain tracks and albums that come direct from the master source. Essentially, this is the best of the best sound straight from the producer’s studio.",
    "You can tell if a track is part of the Tidal Masters collection because it has a gold ‘MASTER’ label or ‘M’ beside it. Not every track is available to stream in this super high quality. Right now, Tidal says “millions” of tracks are, but nowhere near the 70 million it has in its library.",
    "Masters tracks, albums and playlists are suggested in your Home tab, but there’s also a way to use the Explore section to search for Tidal Masters. Although this doesn’t feel quite as intuitive as it should give these are the crème de la crème of audio tracks. You can also download all of these Hi-Res tracks and save them to your device, but this can take time given their quality and take up a lot of room on your device.",
    "With the HiFi plan, you get a more immersive audio experience thanks to both Dolby Atmos Music (on compatible devices) and 360 Reality Audio, which uses Sony’s spatial audio tech to make it feel like you’re listening to a live performance.",
    "It’s worth mentioning FLAC will never sound quite as good through an average mobile device's headphone jack as it does from a device with more competent audio hardware. That means you might want to upgrade your headphones or sound system to really make the most of Tidal HiFi."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "What is Tidal?",
    "15": "Tidal: pricing and subscription",
    "18": "Tidal: music catalogue",
    "21": "Tidal: platforms",
    "23": "Tidal: app",
    "28": "Tidal: playlists",
    "34": "Tidal: audio quality",
    "44": "Don’t subscribe if..."
  },
  "links": {
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "music streaming services": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "best surround sound systems": "https://www.techradar.com/best/surround-sound-systems",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "Amazon Music HD": "https://www.techradar.com/news/amazon-music-takes-on-tidal-with-hi-res-audio-streaming",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Tidal Connect": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1136139418541107800/https://tidal.com/connect",
    "Dolby Atmos Music": "https://www.techradar.com/news/dolby-atmos-music-everything-you-need-to-know-about-the-immersive-sound-format",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services"
  }
}