{
  "source": "https://www.techradar.com/reviews/alienware-m17-r4-2021",
  "title": "Alienware m17 R4 (2021) review",
  "category": "computing",
  "updated": "2021-12-02T14:29:52Z",
  "author": "jackie-thomas",
  "summary": "Big. Powerful. Beautiful.",
  "verdict": "The Alienware m17 R4 is an extremely powerful gaming laptop with an extremely stylish chassis. Easily able to power all the latest AAA games with no compromises, this is the gaming laptop you buy when nothing but the best is acceptable – which means that the price will probably turn some folks off.",
  "pros": [
    "Blazing fast performance",
    "Stylish chassis",
    "A ton of RGB",
    "Plenty of ports"
  ],
  "cons": [
    "Expensive",
    "Basically no battery life",
    "Bottom-mounted speakers"
  ],
  "article": [
    "While many of the best gaming laptops are slimming down and shedding weight, some like the Alienware m17 are showing that, when it comes to gaming laptops, sometimes bigger is better. In fact, the Alienware m17 R4 takes the chassis of the R3 and just fills it with the faster components to make a monster of a machine.",
    "That means that you’ll get one of the top Nvidia GeForce RTX 3000 GPUs, including the impressively powerful Nvidia Geforce RTX 3070. Add in powerful 10th-gen processors and a blazing fast 360 Hz refresh rate and you’ll be able to run just about any game at the highest settings without any issue.",
    "The price of entry unfortunately is pretty high, however. While our review model went for a pretty hefty $3,359 (about £2,460, AU$4,360), you won't be able to purchase the m17 R4 new with an RTX 3080 installed – likely due to the components shortage. Still, there are very few gaming laptops out there with that kind of price tag, even after you take into account the specs. Of course, you’re also paying for the Alienware design and brand. With that said, for a laptop of this caliber that only focuses on high-end performance, the Alienware m17 R4 is a gorgeous laptop, which you'll just have to pay for the privilege of showing it off on your desk.",
    "This is not exactly a laptop that you're going to be carrying around with you either. It weighs a massive 6.55lb, and comes with a 330W adapter that weighs nearly as much as the laptop itself. And, when you consider the paltry two and a half hours of battery life, the Alienware m17 R4 is a laptop that you'll only be moving in between LAN parties, rather than carrying around in your bag day-in and day-out.",
    "If that's something you're looking for though, the Alienware m17 R4 is probably one of the most luxurious laptops in its class, rivaled only by similarly gorgeous machines like the Razer Blade Pro 17.",
    "The Alienware m17 starts at $2,149 (about £1,570, AU$1,769). That will get you an Intel Core i7-10870H, 16GB of RAM, 256GB of SSD storage and an Nvidia GeForce RTX 3070.",
    "If you want the model we're reviewing here, with an RTX 3080, a 2TB SSD and a Core i9 processor, you're looking at an eye-watering $3,359 (about £2,460, AU$4,360). And, if you want a 4K OLED panel with the same specs, you're looking at $3,579 (about £2,620, AU$4,640) – though that configuration only comes with 1TB of SSD space. However, currently, this model isn't available, likely due to the ongoing components shortage.",
    "We wouldn't recommend going with a 4K OLED display anyway unless you're planning on using this laptop to do some serious photo or video work. And, while the RTX 3080 here is strong, but it's still nowhere near as strong as the desktop version of the card. You're going to have a much better gaming experience sticking with the 1080p display option – whether you go for the 144Hz panel or the 360Hz panel that the laptop we're reviewing comes with.",
    "Either way, this is a premium gaming laptop with a luxury price. You will likely be able to find the same components in a cheaper gaming laptop somewhere. But you won't be able to find one that combines performance and design in quite the same way. Whether that's worth the added expense is up to you, but we can see it going either way.",
    "Alienware has been using its new \"Legend\" design for a few years now, and it's clear why it's stuck around. The Alienware m17 R4 is a gorgeous laptop, and while this design isn't new, it still feels like a rebellion against the edgy gamer aesthetic that has dominated the gaming laptop space for so long.",
    "The model we have for review is the gorgeous Lunar Light colorway, which is white, with a black band around the back where the ventilation is. Along the back vent there is an RGB lighting strip, and it's kind of an iconic look at this point. In between the two giant vents on the back of the laptop, you have a number of ports – namely HDMI, Mini DisplayPort, Thunderbolt, power and the proprietary Alienware Graphics Amplifier port for an external GPU.",
    "There are more ports along the side, too. On the right side of the laptop you get two USB-A ports and a microSD card reader near the front of the laptop. Over on the left there is another USB-A port, along with an ethernet and a combo 3.5mm audio jack.",
    "Having all the display and expansion ports on the back of the laptop is one of the best things about the Alienware m17. It means that when you're gaming plugged in (which will probably be all the time), you won't have to fight against a mess of cables to get the job done.",
    "The lid of the laptop is all white, with only the number '17' and an RGB Alienware logo. This theme is repeated on the keyboard deck, which is all white and is simply stunning. The power button is shaped like the Alienware logo and is RGB, along with the entire full-sized keyboard.",
    "That's right, Dell has taken advantage of the extra space inherent in a 17-inch gaming laptop, and has included a numpad on the right side of the laptop. Numpads aren't quite as handy as there were in the past, but it's nice to have, especially if you do work outside of just gaming – and let's face it, these days our computers are way more important than ever before.",
    "Luckily, the keyboard is nice and comfortable to type on. Travel isn't as deep as it could be, considering that this is a gaming laptop. This doesn't have the mechanical keyboard that something like the MSI GE75 Raider has, but it's definitely still good enough to get some gaming done. Though, pro esports players might want to invest in one of the best gaming keyboards.",
    "Typing on this keyboard is great, but this is a laptop that weighs nearly 7lb, so it's not something that you're going to be using on your lap all the time to type up papers.",
    "The trackpad, though, is probably one of the best we've ever used in a gaming laptop. It doesn't look that big, mostly because the laptop itself is so gigantic, but it's more than big enough to get some gestures done, and clicking it down has a satisfying click that's rivaled only by Razer's laptops.",
    "Fitting with the theme that the Alienware m17 is going for, the display is out of this world. A 17.3-inch FHD panel with a blinding-fast 360Hz refresh rate and G-Sync, you're going to have trouble finding a game that you'll hit that limit on, we promise. It also gets plenty bright at 300 nits, and hits 100% of the sRGB color spectrum.",
    "So, while the display is fast, that speed doesn't come at the expense of image quality. Your games will look crisp, colorful and bright, even while you're hitting frame rates that will have you topping the leaderboards.",
    "The speakers are where things falter a bit, though. To say that the Alienware m17 R4 has space for top-mounted speakers is an understatement, and yet they're still firing down at the surface you're playing on. They sound alright, but they don't sound good enough to have you forego a gaming headset any time soon.",
    "Not that it really matters, though. Because of the level of hardware on offer here, the Alienware m17 R4 gets loud when it's getting pushed. You're definitely going to want to wear headphones when you're gaming here, because while benchmarking or playing games, this laptop can sound like a jet engine.",
    "Now, this Alienware m17 R4 is packed with an Intel Core i9-10980HK, 32GB of RAM and an Nvidia GeForce RTX 3080 – it goes fast.",
    "This is an absolute powerhouse of a gaming laptop, pushing the silicon on offer to its absolute limit, which is probably why that fan gets so loud. In terms of raw specs, the mobile version of the Nvidia RTX 3080 should be close to what the desktop version of the RTX 3070 can do. In practice, that's exactly what we saw with this laptop.",
    "No matter what game we threw at it, ray tracing or no ray tracing, we are able to get extremely solid performance all around. Even in Watch Dogs: Legion, which has trouble running on a lot of full desktop gaming PCs, is able to hit a solid 75 fps with ray tracing on ultra and DLSS on the 'performance' setting.",
    "Then, in Metro Exodus, you're looking at 78 fps with RTX and DLSS on, and 90 fps with RTX off. More than enough performance to play these visually delicious games with all the eye candy enabled.",
    "In fact, every single game we throw at the Alienware m17 R4 is able to get more than 70 fps with all the settings maxed, which is something we've never seen on a gaming laptop – especially when ray tracing has entered the equation.",
    "Alienware laptops are expensive to a fault, as they're kind of a luxury item among gaming laptops. However, with this laptop, you can be sure that you're getting the best performance possible in a gaming laptop right now, even if it gets a little loud while doing it.",
    "The Alienware m17 R4 doesn't last long on battery, there's no getting around that. This is a high octane gaming laptop that doesn't compromise on performance, so expecting all-day battery life is just a recipe for disappointment.",
    "Still, we expect at least a little bit of improvement over the last generation. In PCMark 10, which simulates a variety of real-world workloads, the laptop only lasts 2 hours and 21 minutes.",
    "Then, for media playback, the Alienware m17 R4 only lasts 2 hours and 28 minutes, looping locally-stored 1080p video. Probably enough to get through a movie or a couple of YouTube videos, but it's not exactly a laptop you can just stream video on for hours on end.",
    "Because this is such a premium product, there's not much in the way of bloatware installed on this laptop when you pull it out of the box.",
    "Basically, you're just going to see Dell's support apps, which are used to update drivers and create backups, and two programs: My Alienware and Alienware Command Center.",
    "The former is basically just a hub that will connect you with resources to better understand your laptop. It's basically like a FAQ with a flashy UI. Alienware Command Center, on the other hand, is going to be much more useful for a longer period of time.",
    "This is the app you'll use to customize the Alienware m17 R4 from the inside out. Everything from RGB lighting to performance is controlled here, and you'll even be able to launch your games from this app.",
    "That's about it, it's incredibly simple and lightweight, and that's exactly what we want to see in a laptop that costs thousands of dollars. Plus, any new Alienware m17 R4 you purchase should either come with Windows 11 or have a free upgrade to the new OS."
  ],
  "headers": {
    "5": "Price and availability",
    "9": "Design",
    "22": "Performance",
    "28": "Battery life",
    "31": "Software and features",
    "36": "Don't buy it if..."
  },
  "links": {
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "chassis of the R3": "https://www.techradar.com/reviews/alienware-m17-r3-2020",
    "Nvidia Geforce RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Razer Blade Pro 17": "https://www.techradar.com/reviews/razer-blade-pro-17-2020",
    "best gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "Windows 11": "https://www.techradar.com/reviews/windows-11"
  }
}