{
  "source": "https://www.techradar.com/reviews/benq-x1300i-4k-gaming-projector",
  "title": "BenQ X1300i 4K gaming projector review",
  "category": "audio-visual",
  "updated": "2021-03-09T17:30:30Z",
  "author": "henry-st-leger",
  "summary": "It’s hip to be square",
  "verdict": "BenQ’s cuboid X1300i projector is aimed squarely at gamers, but it has the picture capabilities to make a great home projector for anyone watching TV shows and films, too. The smart platform has some blind spots – most notable the lack of Netflix – but overall the charms and capabilities of this projector make it well worth considering.",
  "pros": [
    "Sharp and colorful picture",
    "Gamer-centric features",
    "Manual zoom"
  ],
  "cons": [
    "No Netflix",
    "Smart platform issues",
    "Not ultra short-throw"
  ],
  "article": [
    "The BenQ X1300i is a savvy foray into gaming projectors from the respected manufacturer, with a clear trade-off of different specs enabling its reasonable price tag.",
    "In a world of next-gen games consoles, and an ever-growing community of players, it makes sense for BenQ to lean into the trend, though does the X1300i deliver where it matters?",
    "We’d say so. The BenQ X1300i offers a max 120Hz refresh rate that should keep games looking buttery smooth, with dedicated game modes to ensure the projector is focusing its energies on only the important processing.",
    "There are three modes for FPS (shooters), SPG (sports) and RPG (role-playing games) that don’t differ hugely, but do tweak the X1300i’s settings in the right direction. Generally, they manage to up the contrast and ensure objects are visible and the frame rate stays consistent – though you won’t get the VRR (variable refresh rate) technology supported by many TVs and games consoles these days.",
    "It’s not a native 4K projector either, meaning it relies on upscaling from HD sources – thankfully it's very capable. You’re not getting a knockout home cinema experience, though, and shouldn’t expect it at this mid-range price.",
    "The boxy design is certainly bold, helping the X1300i stand out from other models, with a honeycomb etching on the front and smart orange trim around the edges.",
    "A hidden HDMI port for BenQ’s streaming stick is a bit limiting for choice, and packs in a platform that very heavily advertises Amazon Prime Video and omits Netflix entirely – but it’s still a relatively painless experience to navigate, and it's easy enough to insert another streamer if desired. As a gaming projector, though, having to use one of those HDMI inputs for a streaming dongle is very restrictive for those wanting to connect multiple games consoles.",
    "The BenQ X1300i projector is available for $1,299 in the US or £1,249 in the UK (around AU$1,700 in Australia) on BenQ.com, Amazon, Best Buy, B&H Photo and Adorama.",
    "The BenQ X1300i is certainly a striking invention. It eschews the traditional low and flat profile of so many beamers for a cuboid shape, white and dotted with vents, with a glossy black face surrounded by an orange trim.",
    "The front of the projector is, sadly, the least visible part of it, meaning its looks go somewhat to waste – as the rest of this cuboid isn’t nearly as fetching. It is a bit different from the competition, though, and this will be less of an issue if set up at the back of the room or from the ceiling. You do have four options for setup, depending on whether you're attaching to the ceiling (near or far projection) or lower down on a counter (near or far projection).",
    "You’ll get a host of manual controls to help with matters, with two distinct dials for zooming, and manual levels for changing the angle of the projection (though there is auto-keystone correction to help out). You will need to use these during initial setup, but you shouldn’t have to fiddle if you keep your projector in the same spot.",
    "The rear of the X1300i packs in two HDMI 2.0 ports, both with HDCP 2.2, as well as ARC (audio return channel) for connecting to a soundbar – though the built-in audio (10W total) will suffice for many. There are also ports for USB, audio out, SPDIFm and RS-232.",
    "The side of the projector also carries button inputs for those without the remote to hand, though the clicker is definitely worth using. It has a sleek shape with curved edges, and should fit comfortably in most hands. Rubber buttons fit into a white plastic casing, with directional inputs, an OK button, and more to control volume, muting, voice assistant, source input, game mode, mirroring, settings, and power. There’s also a dedicated Amazon Prime Video shortcut, which will be useful for some – though you won't even find the Netflix app on the platform, let alone the remote.",
    "It’s worth noting that you need to press ‘OK’ after turning the volume up or down, as the volume bar will stay on the screen indefinitely otherwise.",
    "The smart platform is certainly more advanced than the basic affair we found on the BenQ TK850, though it has a handful of niggling issues. Instead of a formally built-in platform, a BenQ dongle carrying Android TV is plugged in directly underneath the casing, in a secret HDMI input.",
    "It is an odd solution in some ways, as it technically removes a port you might otherwise have been able to use, and the RRP likely includes the cost of the BenQ streaming stick. It’s worth noting that our initial review unit didn’t register the dongle at first, and it had to be disassembled for BenQ to fix it. If you have any existing streaming sticks, though, you will be able to use them without issue.",
    "First off, the X1300i is a native HD model, meaning it has to upscale sources itself to output in 4K resolution. It’s not a native 4K projector, then, but that shouldn’t put you off. The picture quality here is still highly impressive, with only a few bugbears worth mentioning.",
    "The X1300i’s immense 3,000 lumens brightness makes for a vivid picture that’s highly visible even in afternoon daylight. When watching The Favourite, everything from the dusting of powder on a lord’s face to tall windows of Queen Anne’s palace is brilliantly illuminated; the countless candles across the servants’ quarters are atmospheric too, even if they lack the nuanced color and contrast of dynamic HDR, with the X1300i only supporting basic HDR10.",
    "The brightness really does help keep things lively, though. Sitting down to watch Jojo Rabbit, we were in awe of the strong, bold hues across both environment and costumes, from the stark red of a billowing flag to the texture of a creased paper uniform. The brightness really brings out colors in force, especially with HDR sources – covering 98% of the Rec709 color space too.",
    "The flip side of this brightness, though, is that there is some blooming around light sources – pretty unavoidably for a projector, given it doesn’t have the luxury of switching off pixels as with an OLED screen. Shadow detail isn’t excellent either, with the dark hair of wigs or even horses in The Favourite lacking precision – while faces not directly lit aren’t overly visible.",
    "The lack of native 4K also means the X1300i has to upscale its own sources – which it does, competently, even if it can’t compare with the native 4K output of the Samsung Premiere or Vava laser projector.",
    "We also have to discuss the size of the image. The BenQ X1300i can technically output at 100-inch picture, though this isn’t an ultra short-throw model, so you won’t get that if you put it anywhere near the wall. However, at around five feet away you’re getting a sizable and impactful image – and this gaming-designed model is probably imagined for slightly smaller spaces than the biggest home theaters out there.",
    "The X1300i uses two 5W speakers that have three distinct settings – one for RPGs, one for first-person shooters and one for sports games – all tuned by treVolo. It’s not a massive amount of audio output, but matches the average mid-spec 4K TV on this count.",
    "You may want to use a connected soundbar through the HDMI ARC port, though if you’re sitting near the beamer you could also use a pair of wired headphones (something we did happily during our testing). However, the output isn't very impressive on lower frequencies; as we played Doom we could hear the clash of metal pistons, steam, alarms and shrieking demons, but without the heft of a subwoofer to really give it weight.",
    "The main draw of the X1300i, though, is in its gaming features, including low input lag of just 8ms for 120Hz playback. You'll also get three dedicated picture presets, for shooters (FPS), sports (SPG) and role-playing games (RPG), to match the audio presets.",
    "We tested out each mode, and were impressed with the smooth image and lack of image judder, even with fast-moving images. The FPS mode seems to be a little brighter than the others, possibly to help with visibility of distant enemies, but they all achieve a similar level of contrast above the default living room picture setting.",
    "It is a shame that the projector doesn't come with settings to adjust brightness on the fly – we did want something a bit moodier for our FPS games – but many games will allow you address this through in-game settings.",
    "You’ll need a games console capable of 120fps to really make the most of the BenQ’s high refresh rate, such as the Xbox Series S – which might be a good match given neither support native 4K output. The Nintendo Switch, too, is a good pairing, though it will only hit 60Hz in docked mode as slightly lower-spec hardware."
  ],
  "headers": {
    "0": "One-minute review",
    "7": "Price and availability",
    "8": "Design and features",
    "16": "Picture quality",
    "22": "Sound and gaming",
    "28": "Don't buy it if…"
  },
  "links": {
    "gaming projectors": "https://www.techradar.com/news/should-i-buy-a-gaming-projector",
    "games consoles": "https://www.techradar.com/news/best-consoles",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "4K projector": "https://www.techradar.com/best/4k-projector",
    "ARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "BenQ TK850": "https://www.techradar.com/reviews/benq-tk850-4k-projector-review",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "streaming sticks": "https://www.techradar.com/best/streaming-device",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Samsung Premiere": "https://www.techradar.com/reviews/samsung-premiere-lsp9t-projector",
    "Vava laser projector": "https://www.techradar.com/reviews/vava-4k-laser-projector",
    "home theaters": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "FPS games": "https://www.techradar.com/news/best-fps-games",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}