{
  "source": "https://www.techradar.com/reviews/battlefield-2042",
  "title": "Battlefield 2042 review",
  "category": "gaming",
  "updated": "2021-11-22T09:54:55Z",
  "author": "vic-hood",
  "summary": "A war on three fronts",
  "verdict": "If you’re sick of the aggressively competitive nature of first-person shooters like Call of Duty, then Battlefield 2042 could be for you. Battlefield 2042 manages to inject heaps of fun into its epic battles, appealing to both series newcomers and veterans alike. However, the fact that you’re paying full price for only a multiplayer title is a difficult pill to swallow, especially as it currently feels like a solid foundation to be built upon rather than a fully-fledged experience. With EA DICE taking a live service approach to Battlefield 2042, and the game set to evolve over time, we would say it’s perhaps worth waiting to pick it up unless you’re an avid Battlefield fan.",
  "pros": [
    "Battles feel epic",
    "Beautiful and detailed maps",
    "Abundant weapons customization",
    "Portal has a lot of potential"
  ],
  "cons": [
    "Full price for only multiplayer",
    "Hazard Zone feels repetitive",
    "Specialists don’t differ much"
  ],
  "article": [
    "UPDATE: Battlefield 2042's online multiplayer appears to be rife with issues, leading players to review-bomb the game on Steam, with 74% of reviews being listed as 'negative'. Developer DICE have released an initial patch for the game, with two more to come in 2042's first few weeks on sale, but for now many players appear to be languishing with technical difficulties – from stuttering motion to all-out server crashes – and finding the game \"unplayable\".",
    "We imagine the kinks will be ironed out, though it's not a good look for DICE, and builds on growing frustration amongst gamers with the state of day-one releases of AAA games – Cyberpunk 2077, for one – that simply ship in an unfinished state. For our initial review of Battlefield 2042's online multiplayer, though, and a sense of how it plays without technical issues, read on below.",
    "Want to know what the coolest weapon in Battlefield 2042 is? It’s a hovercraft. Sure, there are plenty of guns at your disposal, but nothing quite captures the chaotic essence of Battlefield 2042 quite like charging across a sand dune and taking out a squad of enemy Specialists with clumsy ease.",
    "It’s moments like this that cement why Battlefield 2042 is a game for not only series veterans, but those who want to jump into a first-person shooter that offers as much ridiculous absurdity as competition. Battlefield 2042 doesn’t take itself too seriously, unlike other titles in the genre, and as a result, it’s actually fun to play.",
    "Unlike its predecessors, Battlefield 2042 is an entirely multiplayer title, offering three multiplayer experiences that will either suit your gameplay style, or will leave you a bit bored. Developer EA Dice has tried to create multiplayer experiences for all disciplines, but a $60/£60/AU$99.95 price tag for the standard edition of a solely multiplayer title on PS4 and Xbox One (add $10 on for PS5 and Xbox Series X) is still a hard pill to swallow - especially when you add on the price of the PS Plus or Xbox Live Gold membership needed to play on consoles.",
    "That said, Battlefield 2042 truly feels like the next generation of the series, with stunningly detailed environments, 128-player epic battles played out on huge maps, and Specialists that sound somewhat like human beings. It’s easily the best-looking FPS we’ve seen and it ran smoothly on our PC setup, though we are interested to see how it runs on consoles – something we weren’t given access to during the pre-release review period. All impressions here come from the PC version of the game.",
    "At launch, Battlefield 2042, looks to offer plenty for players to get their hands on, with seven All-Out War/Hazard Zone maps, six classic Battlefield Portal maps to jump into and 10 Specialists to play with, and more promised in future seasons. But it’s unlikely that all its multiplayer experiences will be for everyone and we expect that players will likely gravitate to one over the others, potentially resulting in repetition until new content arrives. Whether these seasonal content drops significantly shake up the game will likely determine the longevity of Battlefield 2042 and, with little in the way of a road map, the path ahead for players is still quite dark.",
    "The bread and butter of Battlefield 2042 is the All-Out Warfare experience. Made up of two revamped fan-favorite modes, Conquest and Breakthrough, All-Out Warfare offers a multiplayer experience that will be familiar to those who have played first-person shooters before and will likely be the best experience for newbies to the series.",
    "Let’s start with our personal favorite, Breakthrough mode. If you want the full effect of the scale of battles in Battlefield 2042 then Breakthrough is probably the best showcase of that. This mode sees teams of 64 players (or 32 on PS4 and Xbox One) broken down into teams of four, going head-to-head as one aims to attack and capture the map as the other tries to defend. But rather than setting everyone loose on some sort of free-for-all, the map is captured by securing sectors until one team secures the majority of the map.",
    "Breakthrough offers a focused battle experience, that had us feeling like cogs in a well-oiled machine as our squad did its part in securing each sector. Breakthrough feels very much teamwork-focused. You’re each part of a bigger push, with the squad dynamic allowing you to feel like part of a team.",
    "Hazard Zone still sees two teams going head-to-head in the same maps as Breakthrough, but, instead of capturing individual control points, the action centers around sectors consisting of several flags. While Breakthrough sees each control point being gradually unlocked, preventing players from simply pushing forward, Conquest opens up the whole map, allowing you to travel pretty much anywhere you please. We found that this gradual sector unlocking in Breakthrough allowed for better pacing, as well as more focus, while Conquest felt like a bit more of a free-for-all.",
    "Perhaps the biggest benefit of Battlefield 2042’s increased player size in All-Out Warfare is that there’s just no letting up. While you won’t constantly run into a plethora of enemies, you will nearly always come across someone wherever you are. Sure, the map has scaled with the player size, but we never struggled to find an enemy or a teammate when on foot, and there are so many players that the action never stops - though this is more true of Breakthrough than Conquest.",
    "But it’s in Battlefield 2042’s “clusters,” as developer EA Dice calls them, that the real fun happens. Clusters are points within the sectors that naturally encourage players to swarm, resulting in big ol’ firefights. The way players gravitate to these clusters feels quite organic – while you’re aiming to capture the sector you may suddenly find yourself exchanging bullets in a pitch-black tunnel, trying to push out the enemy in order to gain ground. These clusters are brilliant and they mean the action is happening wherever you go. At one point we were simply walking to a destination and witnessed a vicious overhead dogfight taking place. It made us feel like part of something much bigger, in the best possible way.",
    "Being a cog in the All-Out Warfare machine gives you more freedom in the choice of your Specialist, and allows for more experimentation in that regard. If you want to try setting up turrets as engineer Boris or to try out Sundance’s wingsuit, it won’t cost you the victory, and between deaths, you can change your Specialist to someone else if the battle (or your intrigue) calls for it. However, the only real difference between Specialists is their unique abilities, as you can use any loadout for any Specialist. It makes Specialist choice feel a bit redundant at times, in Breakthrough and Conquest anyway, but some special abilities lend themselves to certain maps (and in some cases modes) more than others. For example, Mackay can use a grappling hook to pull himself to higher areas that others can’t reach, which proves useful in maps like Discarded where there are plenty of shipping containers to grapple up to for a better vantage point.",
    "We were also a bit disappointed in the weapon selection. While there are assault rifles, marksman rifles and pistols to add to your loadout, the selection isn’t huge. This is somewhat helped by the degree of weapon customization available, allowing you to change your ammo type, scope and more to fit your playstyle. Though, the gadgets and vehicles you have at your disposal, which you can call in at your leisure between cooldowns, help flesh out your armaments. That means you can shake things up by calling in a Ranger robotic dog (we called ours Reginald), to provide more firepower or jump in a helicopter to gun down Specialists swarming a skyscraper roof.",
    "It’s not only the gadgets and player count that make All-Out Warfare feel epic, but the maps help with the immersion, too. Each is vast and stunning, while subtly creating a backdrop for the dystopian world of Battlefield 2042. Whether it’s the sprawling Breakaway, a startling white and vast map set in the tundra of Antarctica or Hourglass, where you see skyscrapers buried by sand dunes against a dim sun, there are moments when we happily stopped to take in the puddles forming as it rained, even if it meant getting sniped. Throw in dynamic weather like tornadoes and sandstorms, and these beautiful battlefields become a different beast, with each offering its own challenges and benefits to learn and strategize around.",
    "While All-Out Warfare offers the ability to blend into the crowd, Hazard Zone is all about tight squad gameplay. Once again, you work in a team of four, but this time you’re working against other squads in an effort to collect data drives and reach an extraction point to gain credits. These credits are then used to purchase weapons and tactical upgrades for your next game.",
    "Hazard Zone is a fun but poorly balanced multiplayer experience. While the tight squad play is enjoyable, forcing you to work together with your teammates to secure victory, the economy of it feels wrong. You start with zero credits and a very basic weapon loadout as a result - a data scanner, an assault rifle and a grenade. To get the credits to buy better weapons, you need to perform well in the matches, by collecting data drives and cashing them in at extraction zones or by killing occupying AI forces that defend the data drives. If you do well, great, you can use credits to buy better weapons next time (which you lose if your mission fails) but if you don’t then you’re stuck with barely any credits and basic weapons.",
    "This means Hazard Zone caters better to more accomplished players, making it hard for newbies to get a foot in the door- they’re at an immediate disadvantage. Less experienced players can gain credits over time, but they’ll almost certainly be taken out by better players, meaning they lose any upgrades they eventually earn. It’s too steep a slope and it risks becoming a haven for only the most competitive of players.",
    "Hazard Zone also risks becoming repetitive, as the formula is simply: get data drives, kill AI (and any other players that come about), get to the extraction point. It’s definitely a tense and enjoyable mode, particularly when you’re one of the final squads left trying to fight for your place on the extraction aircraft (only two squads can escape), but it doesn’t feel like each match differs enough to give it longevity.",
    "Another issue for this mode, at launch anyway, is that in-game voice chat isn’t being implemented for Battlefield 2042 until after launch. So you can only use the in-game text chat or limited ping system to communicate with squadmates if you’re playing solo, which is sure to cause problems - particularly in Hazard Zone which is focused on communication and cooperation.",
    "If Battlefield 2042’s other multiplayer experiences aren’t quite your cup of tea, you can always create your own – literally. Battlefield Portal allows you to build, discover and share your own custom Battlefield sandbox game experiences, with maps, vehicles, classes, weapons, teams and more from plenty of Battlefield games past and present, including Battlefield 2042, Battlefield 1942, Bad Company 2 and Battlefield 3, at your disposal.",
    "You can't create your own map from scratch, but you can tweak an existing map from the franchise by adding rules, items, and event triggers to make your own new experiences – and the experiences can be pretty surreal. For example, during our review session we played a match in which players only had a rocket launcher or a knife in their arsenal. Each rocket launcher only had one rocket, and to get more ammo you had to keep jumping, resulting in a match of jumping soldiers firing explosives at one another; it was actually pretty good fun, though it did eventually grow stale.",
    "But you don’t have to make a goofy game: with content from previous titles available – as well as remastered fan-favorite maps (running in 4K at 60fps) from those titles – you can essentially make a modern version of games from Battlefield’s past, like a Rush on Arica Harbor from Bad Company 2. A nice touch in these remastered maps is that, while they’re visually and, in some places, mechanically improved, they keep the original soundtrack, adding to the feeling that you’re taking a trip back into Battlefield history.",
    "You can make these matches as complicated or simple as you like. While there’s a straightforward step-by-step option for those who simply want to tweak elements like the teams, AI, weapons and maps, there’s also a more advanced option that allows you to set event triggers, projectile speed and make other nitty-gritty adjustments. With so many possibilities in Battlefield Portal, we can’t wait to see the matches that players create.",
    "Fortunately, for those who don’t fancy creating their own matches, you have the option to play the matches others in the community have made – with EA DICE set to throw in some of its own creations too.",
    "Battlefield Portal therefore offers a Battlefield 2042 experience that’s somewhat off the beaten track. It’s built with Battlefield series veterans in mind, for sure, but it also allows for newer players to revisit elements of the series which they may not have had the chance to play. Most importantly though, Battlefield Portal lets you fully embrace the more leisurely side of Battlefield 2042. The other multiplayer experiences balance competition with fun, but Portal can essentially be a playground for those who simply want to take part in ridiculous situations like fighting only with defibrillators.",
    "If you’re someone who’s never really clicked with first-person shooters due to their repetitive and competitive nature, then Battlefield 2042 may be for you. All-Out Warfare’s bombastic battles offer the opportunity to learn the ropes as part of a huge team, while also feeling like you’re playing your part in the (hopefully) victorious effort. But, equally, there’s the opportunity to simply have fun with this shooter. Want to drop a tank on an enemy? You can do that. Want to attach an explosive to the aforementioned Ranger robot dog and send him behind enemy lines? You can do that too (just don’t try both at once, RIP Reginald).",
    "Equally, if you’re an FPS veteran who wants to lead the charge in All-Out Warfare, or turn things up a notch by vacuuming up credits in Hazard Zone before creating a defibrillator vs knife fight in Battlefield Portal, you can do that, too.",
    "Right now, Battlefield 2042 is a sandbox of opportunity, but it risks becoming stale without regular content drops that significantly change things, and offer players more modes than are currently available. At the time of writing, EA DICE has confirmed that Battlefield 2042’s first season, which will add new Battlefield Portal content and a new Specialist, and introduce a Fortnite-like Battle Pass, won’t kick off until some time in 2022, which is quite a while away. Could we see ourselves growing bored of the antics before then? Probably. But equally, with Battlefield 2042 set to be an “evolving” game with live service elements, we could see each season breathing new life into the title. Right now, Battlefield 2042 feels like a solid foundation for EA DICE to build upon, but can it justify its price tag right now? Unless you’re a massive Battlefield or first-person shooter fan, we would say hold your fire for now, and wait for more content."
  ],
  "headers": {
    "7": "All-Out Warfare",
    "16": "Hazard Zone",
    "21": "Battlefield Portal",
    "27": "Verdict"
  },
  "links": {
    "74% of reviews being listed as 'negative'": "https://www.gamesradar.com/battlefield-2042-is-now-one-of-steams-most-poorly-reviewed-games-ever/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "Xbox Live Gold": "https://www.techradar.com/news/xbox-live-gold-deals"
  }
}