{
  "source": "https://www.techradar.com/reviews/vivint-security-systems",
  "title": "Vivint security systems review",
  "category": "computing",
  "updated": "2021-08-26T06:46:24.972Z",
  "author": "jim-hill",
  "summary": "Professional smart home security",
  "verdict": "Vivint offers comprehensive home and business security protection by professionally installing the latest hi-tech hardware. It also offers some savvy smart home integration that its rivals can’t match. It is somewhat expensive because it requires a professional installation and a monthly subscription commitment, but its monitoring service and overall feedback are very positive.",
  "pros": [
    "Scalable solutions to suit any home or business",
    "Includes a lot of home automation",
    "Broad range of HD cameras available",
    "Works well with other products like Nest, Alexa etc."
  ],
  "cons": [
    "You’re bound to a contract for service and financed equipment",
    "Relatively high cost for the hardware",
    "You have to pay for installation and monitoring",
    "If you cancel your contract, you must pay 100% of the cost"
  ],
  "article": [
    "Vivint provides smart home security professionally installed to suit any premises with 24/7 customer care and monitoring. Based in the US, the company employs 11,000 staff and covers North America and Canada. Home automation is a large part of the business and its security offerings can be customized to suit both residential and commercial property.",
    "With a wide range of smart security devices to choose from, Vivint can offer simple surveillance with indoor and outdoor IP cameras or smart sensors and alarms capable of detecting smoke, CO2 and intruders. The same system can automate many aspects of the home too, such as smart locks, lights and thermostats. A basic security package that would suit a small to medium sized business begins at $599 for the equipment and $53.99 per month for 24/7 maintenance and monitoring.",
    "The total cost of a Vivint security system is rather high because it includes more sophisticated equipment than most of its rivals. It also requires a charge for professional installation and an ongoing subscription fee. The starting price for a security package suitable for an SMB is $599 for the equipment, plus a $54 per month subscription fee for the ongoing service. There’s a flat $49 fee for installation. The equipment cost seems high, but you do get to own it all outright unlike with ADT, where the hardware belongs to ADT at the end of the contract. There is a month-to-month subscription available as an alternative to a long contract, but only if the equipment is purchased upfront rather than financed. One cost you might not have thought of is the ‘moving cost’ where Vivint will charge you $129 to reinstall their system at your new address.",
    "This plan includes three door or window entry sensors, a motion sensor, a key fob with a panic button built in and a sophisticated wall panel giving you touchscreen control over all your connected smart devices. You can add many more sensors, cameras and home automation devices to this setup for additional cost, but finance is available to secure these for a small monthly charge. Just contact Vivint through the website to get a free quote. You are entitled to a 30-day money back guarantee whatever you choose.",
    "Vivint is able to offer a particularly feature-rich smart security solution because of its broad range of high-tech hardware. There are separate smart sensors for detecting door and window movement, glass breaking, motion, smoke, CO2, tilting, flooding and freezing. Then there are five different security cameras covering every kind of indoor and outdoor surveillance, plus a choice of two doorbell cameras. There are also smart locks and electronic key fobs, wall panels and a Vivint thermostat available.",
    "As Vivint’s gear uses Z-Wave technology, it is widely compatible with other smart home tech such as the Nest thermostat and Philips Hue lighting. The various touchscreen wall panels available allow you to view footage from the cameras as well as operate all of the products connected to the system. Vivint’s IP cameras are high definition and can be adjusted so that their motion sensors are not triggered by erroneous movement like passing cars and pets. The various sensors connect wirelessly to the Vivint smart hub which has a backup battery and a cellular chip built in. That means if your power and Wi-Fi go down your hub can still communicate and raise the alarm.",
    "Beside detecting and recording break-ins, a Vivint system can deter them with smart lights that come on at set times and cameras and alarms that emit noise to frighten intruders away. The Vivint Doorbell Pro has a red LED ring that illuminates when it detects someone picking up a package left on the doorstep. If that happens, a 65dB speaker will inform the potential thief they are on camera. There’s no high-visibility bell box like ADT has, but there are stickers to warn that your property is alarmed. The Vivint system can be controlled from your phone with an iOS/Android app that has been very highly rated by users.",
    "Vivint is a relatively new monitored security outfit, but it’s already a big one and with 11,000 people on the payroll providing 24/7 support to customers across the US and Canada. Those customers can expect a fast response by trained professionals whenever their alarms are triggered. In the first instance, the customer and their hand-picked key holders will receive a call and/or message from the monitoring center, but if they cannot be reached and the customers authorisation code is not given Vivint will send the first responders.",
    "You can choose exactly what level of support you need, or are prepared to pay for, when you ask for a free quote. You can even choose to self-monitor and save the cost of professional monitoring altogether. The most basic package provides remote access to your security setup via the Vivint Smart Home app and offers smoke and CO2 monitoring with two-way audio support. The basic video monitoring and video storage package begins at $45 per month for one camera. Additional cameras cost $5 more a month with a maximum of six cameras costing $70 per month.",
    "Vivint’s monitoring cannot compete with ADT’s more established monitoring centers, but it does appear to beat ADT when it comes to customer care according to the user feedback on their respective websites. Vivint is unusual in offering medical monitoring with all of its plans, which is a service not generally provided by its rivals.",
    "There are a number of notable monitored security alarm services available in the US to rival Vivint. ADT is a household name in North America and other territories and it offers an even higher level of security and support if required. Like Vivint, it sells and installs the equipment and then asks you to choose a subscription package and sign a 36-month contract. They both offer 24/7 monitoring and maintenance with a fast response from their trained professionals and send the first responders if necessary. ADT goes further though by also sending a private security guard if you choose the top level of service, but it offers little in the way of smart home automation.",
    "Guardian Protection and Brinks Home Security are similar to Vivint in selling a range of security devices that come with a range of monitoring options paid by subscription. Vivint offers a much wider selection of equipment and therefore more features too.",
    "There are also a number of unmonitored security systems available that offer similar equipment without any subscription cost or contract. You monitor the security footage and respond to any triggered alarms yourself. First among these is SimpliSafe, which will sell you all the hardware you need to secure your business and lets you set it up yourself. Their equipment is generally very user-friendly. You can choose to sign up for professional monitoring by SimpliSafe in the countries where it is available such as the USA and UK, but there’s no contract.",
    "Vivint is really leading the way when it comes to kitting out your home or office with smart home security equipment. It has the widest range of devices to choose from and it’s backed up by a 24/7 monitoring and maintenance service that has won awards. The cost is a little high because every system needs professional installation and a monthly subscription, but the feedback for Vivint’s products is generally strong. If you need to secure your home or small business and the idea of also controlling your HVAC and lighting with the same system appeals, then Vivint’s smart home expertise is for you. If you’re only interested in security, there are more affordable ways to achieve it.",
    "We usually like to get hands-on when it comes to testing, but in this case, calling in and installing each security system was not practical. Instead, we compared every aspect of the ten biggest names in home and business security and awarded scores within each category. Totting up the totals and taking into account the various costs provided our overall ratings. However, choosing your own security solution is going to depend on your specific situation, so please read the full reviews before making a decision.",
    "No, Vivint insist on a professional installation and you have to take out a monthly subscription for professional monitoring too. You can of course keep an eye on your own property by using the excellent Vivint app. This app will send notifications straight to your smartphone and let you view full high definition footage from your cameras.",
    "Probably. Vivint’s wireless security devices use a popular protocol called Z-wave to talk to each other and many makers of smart home products use the same thing. Vivint works well with Nest’s cameras for instance and Yale’s smart locks. It can also be voice controlled by Amazon Alexa and Google Assistant.",
    "Yes, the Vivint app makes it easy to arm and disarm your security system from your phone wherever you are in the world. You will receive notifications from your smart hub if the sensors detect anything and because it uses cellular to communicate, you’ll still get messages even if your power and Wi-Fi go down. The app also gives you full control over any other home automation tech you might have installed too. You can, for instance, program your lights to come on and the garage door to open at a certain time."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "7": "Support",
    "10": "The competition",
    "13": "Final verdict",
    "14": "How we reviewed",
    "15": "Can I save money by installing and monitoring the system myself?",
    "16": "Will it work with my current smart home equipment?",
    "17": "Can I operate my Vivint system from my phone?"
  },
  "links": {
    "Vivint": "https://www.vivint.com/",
    "ADT": "https://www.techradar.com/reviews/adt-security-systems",
    "Guardian Protection": "https://www.techradar.com/reviews/guardian-protection-security-systems",
    "Brinks Home Security": "https://www.techradar.com/reviews/brinks-home-security",
    "SimpliSafe": "https://www.techradar.com/reviews/simplisafe",
    "smart locks": "https://www.techradar.com/news/best-smart-locks"
  }
}