{
  "source": "https://www.techradar.com/reviews/leica-sl2-s",
  "title": "Leica SL2-S review",
  "category": "cameras",
  "updated": "2021-03-18T18:52:11Z",
  "author": "amy-davies",
  "summary": "Is it worth investing your readies in the iconic red dot?",
  "verdict": "The Leica SL2-S is a slightly strange proposition. It’s aimed at videographers with a huge range of video-friendly specs, but misses the mark by not including an articulating screen. It works well as a hybrid stills-video shooter, but with its handling quirks and imperfect autofocusing, it won’t appeal to everybody. Still, if you’re keen to get into the Leica brand, this is one of the cheapest ways you can currently do it.",
  "pros": [
    "Good price (for a Leica)",
    "Very sturdy construction",
    "Strong video specs"
  ],
  "cons": [
    "Very heavy and bulky",
    "Expensive (compared to other L Mount cameras)",
    "Autofocusing can be unreliable"
  ],
  "article": [
    "The Leica SL2-S sees Leica’s L Mount mirrorless cameras attempt to break into the mainstream, arguably for the first time.",
    "By reducing the resolution – and the price – it can offer a set of specifications that previous SL cameras simply couldn’t manage. That includes a better low-light performance, with an ISO 100,000 headline spec, and 25fps burst shooting. The latter comes with a pretty major caveat of being available when shooting with the electronic shutter, and without continuous autofocus.",
    "It’s also being marketed towards videographers, with a set of video-friendly specs designed to reel them in. There’s internal 4K 10-bit 4:2:2 recording at 30fps (60fps is also achievable via an external recorder), and other specifications such as dual UHS-II card slots also support its credentials in that area.",
    "Perhaps surprisingly considering this audience, there’s no tilting or articulating screen. The 3.2-inch touch-sensitive screen is pretty lovely, but not being able to face it in any other direction is problematic, especially for vloggers. Brighter news is the super high-resolution viewfinder, which at 5.76-million dots is beaten on the market only by one other camera at the moment (the Sony A7S III, with its 9.44-million dot EVF).",
    "Using the Leica SL2-S is a mixed bag. Some will no doubt love the chunky, tank-like design. It brings with it a good degree of peace of mind – if you’re somebody that likes to use their camera in a variety of 'less than ideal' conditions, you can feel assured that the SL-2-S will go the distance.",
    "On the other hand, unless you’ve got particularly large hands, using the camera is quite awkward. Being so heavy, a second hand is required to stabilize it, and using the joystick can be quite a stretch at a times. This is not only annoying at times, but can lead to missed shots.",
    "Of the shots that you do get, though, you’re treated to good image and video quality. The Leica SL2-S might be lauded for its video credentials, but it’s a good solid all-rounder which also produces high-quality images.",
    "The lower resolution helps with a number of factors and is also more than enough for most shots. Colors and detail are great, while settings such as automatic white balance and all-purpose metering put in a reliable performance. Malleable raw files give you plenty of scope for editing, too.",
    "The Leica SL2-S is a hard one to recommend for a variety of reasons. If you want to spend less but like the L Mount, there are cameras like the Panasonic Lumix S5, while if you want something purely for video, the fixed screen of the SL2-S will rule it out for many.",
    "Still, if you’re keen on the red dot, and want something that's extremely well-built and produces good images in a variety of situations, it’s certainly worth considering.",
    "The Leica SL2-S was announced towards the end of 2020, and went on sale right away. Compared to other Leica cameras it’s actually fairly well-priced, but don’t be fooled into thinking that this is a 'cheap' camera.",
    "For the body alone, it’s $4,895 / £3,945 / AU$7,500. That's a good price compared to the previous Leica SL2, but it’s still significantly more expensive than other L Mount series cameras, such as the Panasonic Lumix S1, which is roughly half the price.",
    "If you've ever shot with a Leica SL2, then you’ll be very at home with the SL2-S. Leica has kept the design virtually identical – it’s a big, bold and chunky affair which won’t be favored by all, especially those with slightly smaller hands. The plus side of it being so big and heavy is that it should be robust enough to withstand a good amount of abuse.",
    "Backing up that idea is IP54 dust- and water-resistance for the aluminum and magnesium alloy body. That means that it should very easily withstand being used in the rain for extended periods.",
    "Using the SL2-S has its quirks, and while it has been designed well in some respects, in others it can be frustrating. It’s difficult to use it one handed, for example, which makes quick changes to something like the focus point, quite tricky.",
    "There were a few different occasions where we couldn’t make changes quick enough to react to the situation, as we first had to free up our second hand. If you have larger hands, though, you might find it less awkward – it's certainly one that's worth trying before you buy.",
    "That said, the SL2'S' dials and buttons themselves are well-made and, on the whole, well thought out. There are relatively few buttons to contend with, with it being fairly logical as to what each one of them does.",
    "To the left of the large screen, you’ll find the buttons that you’ll need to make changes beyond aperture, shutter speed and focus point – which are handled by the dials and joystick.",
    "There’s a 'Fn' button that you can press to access a set of commonly-used settings (which you can customize to your own preferences), while the Menu button will take you on an even deeper dive to adjust less frequently-used parameters. There’s also a play button for viewing your images or video in playback.",
    "One of the best things about Leica cameras – and the SL2-S is not unique in this – is how video and photo settings are separated with different interfaces. That means you can move between the two different sets without having to lose or make adjustments to the other. Very handy indeed.",
    "By default, moving between video and photo is achieved by pressing one of the customizable buttons on the top of the camera, but you can also swipe across the screen to achieve the same result.",
    "You can also use the touch-sensitive screen to make adjustments to settings, or you can use the joystick to navigate around if you prefer. We found it best to use some combination of the two – except when we were wearing gloves, when being able to solely use the physical buttons was a practical bonus.",
    "The SL2-S' screen itself is a 3.2-inch, 2.1-million dot display which looks great, but is fixed in one position. That’s not particularly handy for shooting from awkward angles, and feels like an odd decision for a camera which is being so firmly directed towards keen video-shooters.",
    "It’s accompanied by a 5.76-million dot OLED viewfinder, which is one of the best on the market and is very pleasant to shoot with.",
    "One of the big differences between the Leica SL2 and the SL2-S is the resolution of its full-frame sensor.",
    "At 24.6MP, it’s almost half the resolution of the 47MP SL2. That makes it better-suited for video and low-light work, while also having a high enough pixel count to be more than usable in most ordinary situations. One reflection of this is the improved high ISO sensitivity, which now maxes out at ISO 100,000 (compared to the 50,000 of the SL2).",
    "For those interested in shooting video, the SL2-S delivers a professional level 4K 10-bit 4:2:2 recording at 30fps internally, or at 60fps to an external recorder. There’s also L-log recording available, with two built-in LUTs (look-up tables) already available (Classic and Natural), but with more promised via future firmware updates.",
    "Leica says that the camera simply doesn’t overheat when recording for long periods of time, which is something that has marred other manufacturers in recent times. Integration with Capture One 21 for tethering is also an added bonus.",
    "Another benefit of the lower-resolution sensor is the ability to shoot at 25fps in raw format. You don’t get autofocus between shots at that speed, but better news is the extensive buffer – which when you’re shooting in JPEG, will see the camera keep going until the memory card(s) are full.",
    "Speaking of memory cards, there are two slots here, both of which are UHS-II SD compatible. There's no need to buy expensive or rare cards here, which is something.",
    "The Leica SL2-S is part of the L Mount Alliance, which means that you can not only use Leica lenses, but those made by Sigma, Panasonic and any third-party manufacturers.",
    "Leica says that its own lenses are the best in class (unsurprisingly), with a decent range of primes and zooms already available, and with more planned for the pipeline. Having the flexibility to add in other lenses is a nice bonus though, especially for anybody with a multiple body set-up.",
    "We were only supplied with one lens for the duration of this test; the Leica 50mm f/2. As such, it was hard to test out some of the promised specifications adequately, for example fast-moving subjects at 25fps, which would generally be better suited to shooting from a distance with a longer lens.",
    "That said, the promised extensive buffer performed admirably well – so good, we got bored of holding down the shutter long before the card filled up. The top speeds don’t allow for autofocus in between each shot, but shooting at slower speeds meant that the SL2-S was better able to keep up with reasonably predictably moving subjects.",
    "Sometimes, though, autofocusing can be frustratingly slow, leading to a couple of missed moments. It’s certainly not the same quick speeds we’re used to seeing from the likes of Sony A7/A9 series and Canon’s latest mirrorless models, and it also lags behind the Nikon Z series, too, which is disappointing considering the price of the camera.",
    "If you can get over the SL2-S’s handling and autofocusing quirks, you are rewarded with high-quality images and video.",
    "Despite the lower resolution sensor, there’s still plenty of detail captured in most ordinary situations, especially at lower or normal-range ISOs. Colors are nicely vibrant, displaying a decent amount of realism without going over the top and displaying a good dynamic range.",
    "The all-purpose metering mode generally works well to produce well-balanced images, but if faced with a high-contrast situation, switching to spot metering can be beneficial. The automatic white balance setting copes well with different lighting conditions, including overcast, sunny and artificial lighting to get colors correct and realistic on the whole.",
    "The raw (DNG) files are also nicely malleable, allowing you to extract plenty of detail in the shadows and highlights if necessary.",
    "The SL2-S features in-body image stabilization (IBIS), rated at 5.5 stops of compensation. In practice, this helps to produce sharper images and smoother video footage – although again, it would have been nice to test it with longer lenses which are harder to keep stable than shorter ones.",
    "Images shot at up to ISO 6400 show a good balance of noise-reduction and detail in JPEG images straight from the camera. Going above this produces images which are decent, but we’d stay away from the highest setting of ISO 100,000 unless absolutely crucial to getting the shot. With decent image stabilization and wide-aperture lenses, it’s fairly rare that you’d need to.",
    "Video quality is impressive, as we’d expect it to be, too. Footage is smooth and detailed, and there’s a good range of resolutions and frame-rates available to suit a wide variety of video-makers, from those who do it sparingly all the way up to those who do it for a living. It’s perhaps less appealing to vloggers, not because of the quality, but because of the lack of an articulating screen, which makes shooting to camera more difficult than it might be with other models."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Leica SL2-S release date and price",
    "12": "Design and handling",
    "24": "Specs and features",
    "32": "Performance",
    "35": "Image and video quality",
    "42": "Don't buy it if..."
  },
  "links": {
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Panasonic Lumix S5": "https://www.techradar.com/reviews/panasonic-lumix-s5",
    "Leica SL2": "https://www.techradar.com/reviews/leica-sl2",
    "Panasonic Lumix S1": "https://www.techradar.com/reviews/panasonic-lumix-s1-review"
  }
}