{
  "source": "https://www.techradar.com/reviews/sony-a7-iv",
  "title": "Hands on: Sony A7 IV review",
  "category": "cameras",
  "updated": "2021-10-21T16:07:08Z",
  "author": "mark-wilson",
  "summary": "A worthy successor to a mirrorless classic?",
  "verdict": "It can no longer be classed as an 'entry-level' full-frame camera, but the Sony A7 IV is a truly modern hybrid that largely justifies its price tag. The new 33MP sensor looks a solid performer for both stills and video, and the A7 IV benefits from Sony's class-leading autofocus skills. It's a shame the 4K/60p video mode is only available with a large crop, but otherwise the A7 IV is shaping up to be a rock-solid all-rounder for most hybrid shooters. It might be the only camera you ever need.",
  "pros": [
    "Impressive new 33MP sensor",
    "Class-leading autofocus",
    "Vari-angle screen"
  ],
  "cons": [
    "Price hike from A7 III",
    "4K/60p video is heavily cropped"
  ],
  "article": [
    "The Sony A7 IV has some big shoes to fill – it's the new all-rounder in Sony's full-frame mirrorless camera range, and takes the baton from its classic predecessor, the Sony A7 III.",
    "The A7 IV brings improvements across the board, including a new 33MP sensor, Bionz XR processor and improved video skills. But with a price tag of $2,499 / £2,400 / AU$$4,299 (body only), it's also a lot more expensive than the A7 III was when it launched in 2018. This makes it more of a rival to the similarly-priced Canon EOS R6, than an entry-level alternative to the Nikon Z5.",
    "Despite this price bump, the A7 IV is designed for a similar audience to its predecessor – namely, keen hobbyists and professionals who want to shoot a mixed diet of photos and video. With upgrades like 10-bit video support, the A7 IV is a now an even more powerful hybrid camera.",
    "So does the Sony A7 IV live up to its considerable hype? We spent a few days with one to find out if it's been worth the wait (spoiler: the answer is a largely unqualified 'yes').",
    "The Sony A7 IV will cost $2,499 / £2,400 / AU$$4,299 (body only) when it becomes available to buy in December (or late November, if you're in Australia).",
    "This is a price hike of 20%-30% over the Sony A7 III, depending on which region you're in, which pushes the A7 IV away from its 'entry-level' full-frame heritage.",
    "That may lead many photographers and videographers to think twice before hitting the 'buy' button, particularly as lower-powered but impressive alternatives like the Nikon Z5 are less than half the price.",
    "Still, when you consider the A7 IV's across-the-board upgrades, and its impressive hybrid power, that price tag doesn't seem excessive. Its closest rival is probably the Canon EOS R6 ($2,499 / £2,499 / AU$4,499), which is lower-resolution at 20MP but offers faster 20fps burst speeds.",
    "The Sony A7 IV might look like a clone of its predecessor, but there are quite a few subtle upgrades that collectively make it a much more enjoyable camera to use.",
    "On the top you'll find an improved electronic viewfinder (EVF) with a 3.69-million dot resolution and 120fps refresh rate. While this is now fairly standard at this price, it is a much-needed upgrade and is performs particularly well when you're trying to track moving subjects.",
    "Below the EVF there's a new vari-angle touchscreen. This can swivel around to face the direction you're shooting in, which is a big bonus for solo video shooters. Delve into the menus on this screen and you'll find they also have Sony's latest UI, first seen on the Sony A7S III, which are a major improvement on the labyrinthine menus seen on older Sony Alpha cameras.",
    "In the hand, the A7 IV's grip feels more substantial than its predecessor, but otherwise it'll be comfortably familiar to anyone who's used an Alpha camera before. Beneath the mode dial, there's a new ring that lets you flick between stills, movies and 'S&Q' mode (for recording slow-mo footage and timelapses). There's also a new dedicated red 'record' button for shooting video and a lockable exposure compensation dial.",
    "But elsewhere, everything is where you'd expect, with a nicely-balanced joystick for choosing AF points, a pronounced AF-On button for back-button focusing, and a rear scroll wheel that has a useful resistance to stop you from accidentally changing your shutter speed.",
    "One final bonus on the top of the A7 IV is Sony's Multi-Interface hotshoe. This means you can plug in external microphones like Sony's ECM-B1M and ECM-W2BT without needing any extra cables or a power source. It's another big string to the A7 IV's video-shooting bow, compared to its predecessor.",
    "The Sony A7 IV isn't quite the game-changer that its predecessor was for full-frame mirrorless cameras, but its upgrades bring it close to the Canon EOS R6 – which means it's a fine choice for everyone from wildlife shooters to wedding photographers.",
    "The key to these performance boosts is the Bionz XR processor, which is the same as the one in the Sony A1. The two obvious improvements that this brings are Sony's latest autofocus smarts, and a much-improved buffer depth when burst-shooting.",
    "Because the Sony A7 IV has now jumped to a 33MP resolution, its top burst-shooting speed (10fps) is actually the same as the A7 III. On paper, this is significantly slower than the Canon EOS R6, which can hit top speeds of 20fps when you use its electronic shutter. But the A7 IV's autofocus speeds and buffer do a lot to compensate for this.",
    "We tested its burst shooting skills with a UHS-II card and the buffer is more generous than most people will need. When shooting both JPEGs, the A7 IV consistently hit speeds of 9fps for over a minute. It also managed the same speeds with raw files for the first eight seconds, dropping down to a still-decent 6-7fps after eight seconds. In both cases, it was certainly heading towards Sony's claimed 828 shots (for CFExpress cards) before our memory card filled up.",
    "The likelihood is that you won't need to shoot continuously for that long, because the A7 IV's autofocus skills ensure a very good hit-rate. It has Sony's latest AF system, which means you get Eye AF for humans, animals and birds, in both stills and video. This is a big upgrade from the A7 III, even if it doesn't overshadow the Canon EOS R6 in this department.",
    "The A7 IV is clearly a very capable stills camera, but what about video? It makes even bigger leaps here. For filmmakers who like to color-grade their videos, the jump to 10-bit 4:2:2 color sampling (from 8-bit on the A7 III) is a big one. The maximum video bit-rate has also jumped from 100Mbps to 600Mbps, and you can shoot 4K/30p video using the full width of the sensor.",
    "Perhaps the only slight disappointment is that the A7 IV's 4K/60p mode is only available with a 'Super 35' crop (which is similar in size to an APS-C sensor). Naturally, Sony wants video shooters to upgrade to cameras like the Sony A7S III, but that might still be a slight disappointment to those who wanted a completely uncompromising hybrid camera.",
    "Still, to sweeten the video deal, Sony has included a host of other bonuses on the A7 IV, including a 'Focus Map' (similar to focus peaking, only it uses colored blocks to show you what's in focus) and the popular S-Cinetone picture profile, which mimics the look of Sony's cinema cameras. Like all great hybrid cameras, the Sony A7 IV is just as comfortable shooting videos as it is stills.",
    "If you'd hoped the Sony A7 IV's new 33MP sensor might dramatically improve its image quality from the A7 III, you may be disappointed. That extra resolution is handy for those who like to regularly crop their photos, but in general the A7 IV's improvements are geared towards versatility rather absolute image quality.",
    "More megapixels means smaller photosites on the A7 IV's sensor, of course, so Sony has used image processing to help in areas like low-light performance. We haven't been able to inspect the A7 IV's raw files yet because Adobe Camera Raw doesn't yet support it, but the early signs are certainly promising – if not exactly a major step up from the A7 III.",
    "The exception to this is likely to be the A7 IV's 4K video quality, as it's now able to oversample 4K/30p video from the sensor's 7K resolution (the A7 III, by contrast, had a crop in its equivalent mode). But we'll need more time with the camera's video skills to be definitive about its quality compared to today's rivals.",
    "When it comes to stills, though, the A7 IV is undoubtedly a very capable camera. It's possible to push your sensitivity up to ISO 6400 and achieve very good results, even when light is scarce.",
    "The A7 IV's in-body image stabilization (IBIS), which now claims up to 5.5-stops of compensation, also lets you shoot with shutter speeds as low as 1/10sec and still get pretty sharp results. This is also a potential bonus for those who regularly use polarizing filters, because it allows you to handhold the camera rather than reach for the tripod.",
    "The dream full-frame camera for many people is probably the Sony A7 IV with the Sony A7 III's price tag. But as that doesn't exist, you'll have to weigh up how big an impact the A7 IV's many tricks will have on your photography and video.",
    "Despite the bonus of its excellent autofocus, the A7 IV is likely overkill for beginners or anyone who's dipping their toes into full-frame waters. If you're a hobbyist photographer who rarely shoots video, you'll find better value in the Nikon Z5, Nikon Z6 II or even the Sony A7 III. If size is a consideration, you should also consider the Fujifilm X-T4.",
    "Where the Sony A7 IV comes into its own, or into a very select group of cameras that includes the Canon EOS R6, is as a hybrid camera for almost any shooting situation. Need to shoot some action? It has a seemingly never-ending buffer depth when using a CFexpress card. Looking to shoot some polished 4K video? The A7 IV has 10-bit capture and Eye AF (for humans, animals and birds) in video.",
    "When you think of the A7 IV as two-cameras-in-one (a stills and video workhorse), that price tag doesn't seem quite as painful. Until you start to factor in the temptation of G Master lenses, at least. If that's what you need, then the Sony A7 IV is shaping up to be an excellent alternative to the Canon EOS R6."
  ],
  "headers": {
    "4": "Sony A7 IV release date and price",
    "8": "Design",
    "14": "Features and autofocus",
    "22": "Image and video quality",
    "27": "Early verdict"
  },
  "links": {
    "Canon EOS R6": "https://www.techradar.com/reviews/canon-eos-r6-review",
    "Nikon Z5": "https://www.techradar.com/reviews/nikon-z5",
    "Nikon Z6 II": "https://www.techradar.com/reviews/nikon-z6-ii",
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Fujifilm X-T4": "https://www.techradar.com/reviews/fujifilm-x-t4"
  }
}