{
  "source": "https://www.techradar.com/reviews/network-solutions",
  "title": "Network Solutions review",
  "category": "computing",
  "updated": "2021-07-09T12:29:28Z",
  "author": "mirza-bahic",
  "summary": "Are hosting solutions from this DNS veteran worth a try?",
  "verdict": "Network Solutions is a US-based provider with considerable experience in domain registration trade that is trying to make its way in the web hosting business with its accessible and affordable cloud-based packages. Although everything seems right on the surface, negative reviews from their former customers made us consider what we thought we knew.",
  "pros": [
    "30-day money-back guarantee",
    "Beginner-friendly approach",
    "Customer support is available round-the-clock",
    "Cloud hosting is quite affordable",
    "Refreshingly flexible billing"
  ],
  "cons": [
    "Reviews from former customers are a source of concern",
    "Price can get pretty high quickly",
    "Limited hosting options",
    "Windows servers are not an option"
  ],
  "article": [
    "Network Solutions was launched in 1979 as one of the first companies to provide DNS (domain name system) technology. Since then, it has developed to provide many more services, all related to web hosting. Today they provide “all you need, in one place”, that is: domain names and various hosting options with a whole variety of features and accessible applications. The company is headquartered in the US, with its main office located in Herndon and its data center situated somewhere in North America.",
    "As of 2011, Network Solutions (together with Web.com and Register.com), became an addition to Web.com Group, one of the leading web technology companies that provide services to millions of customers all over the world.",
    "On Network Solutions’ main website we encountered so many pictures of smiling people (think of the Cheshire Cat), that we felt as if we somehow ended up in a toothpaste commercial. Regardless, the website looks nice and feels modern, although it wasn’t too keen on providing us with all the information we hoped to find there.",
    "Network Solutions also has an official blog which corresponds with the main website in style and features plenty of articles. They have published from 2019 onwards, all of them being related to the subject of hosting and written in a beginner-friendly way. When it comes to social networks, they are presently active on Facebook, Twitter, LinkedIn and YouTube, although none of the mentioned accounts has been publishing new content since 2020.",
    "Curiously, a few of their disgruntled (and we assume, former) customers didn’t want to just get mad at, but also get even with the provider, advising others to avoid Network Solutions “like the plague”, which gave us another thing to consider.",
    "With a promise that they will provide web hosting and domain names ”for any business”, Network Solutions presents four different-sized, cloud-based plans, from starter to premium. The least expensive one (labeled as “Starter”) can be yours for $5.69 per month (for a year term) and will provide 15 GB of disk space, ability to host one website and up to five e-mail boxes. To get a free domain name you’ll have to purchase one plan above (the “Essential” one, which is recommended), and to get a free SSL certificate you need to go for the “Premium” plan, making the basic plan feel too bare bones.",
    "Additionally, there are three different WordPress hosting packages, ranging from $7.99 to $18.98 per month.",
    "Network Solutions accepts all major credit cards and PayPal, and for those sceptic about their services there is a 30-day money-back guarantee. However, if you’ve registered a domain name it will not be included in the refund, but you are free to keep it.",
    "Because Network Solutions doesn’t exactly have a myriad of hosting options, picking out a preferred plan shouldn’t be a time-consuming decision. The first thing you’ll need to know is if you want a simpler cloud-based solution or a WordPress-optimized one. For the most part, together with these hosting packages, you’ll be getting email services as well. If not (and you want them), digging a bit more around the website will take you to a few email hosting solutions as well.",
    "When you select a hosting plan, you’ll proceed to the issue of the domain name, with the option to register a new one (for the price of $15) or use an existing one. After this, you’ll be advised to add an SSL certificate (since it is not included with any plan but the “Premium” one) with which the first month of use will be free-of-charge. Here, you can purchase up to 300 certificates, or just click “No, thank you”.",
    "The next step is to check your chart and everything included in it, where you can choose billing cycles for your hosting plan and an SSL (if you purchased it). The billing cycles are surprisingly flexible and provide various options from one month to ten years; and with a domain option you can go for (a baffling choice of) 100 years, which implies an incredible focus on the future.",
    "Before you can begin creating your account with Network Solutions, you’ll go through a few suggested add-ons, all related to the security of your website. Then you’ll have to add your personal data, create a password and select a security question (some of which seem almost obsolete, like “What’s your library card number?”) Fortunately, you can write down your own question and unleash your creative potential (if you want that, that is).",
    "All plans come with a proprietary control panel, which isn’t as user friendly as some industry-standard alternatives, but we managed to find our way around. From there, most of the famous apps can be yours after a click or two (WordPress, Joomla, Durpal and so on) and all developers out there will be glad to hear that a whole variety of website development features are supported as well (PHP5, Python, Ruby on Rails, Java Servlets, Zend Libraries and much more). A number of e-commerce features (and all-inclusive e-commerce solution) are available for purchase, as well as a competent drag-and-drop website builder.",
    "When trying to convince us of the superiority of their services, Network Solutions brings up their “reliable” uptime with the guarantee of 99.9%, live tech support and flexible hosting plans, without any promises regarding the speed. Not knowing what to expect, we tested the speed performance of Network Solutions’ main website using GTmetrix as a tool. It placed the website's speed performance above the average with the conclusive result of B (85%), which is quite good.",
    "We decided to test the uptime of Network Solutions’ main website by using UptimeRobot and see if we're going to take advantage of the guarantees they provided us with. After a month of constant monitoring, UptimeRobot reported a few occasions of downtime, with the longest one lasting for 19 minutes straight. However, the total of downtime was around 42 minutes. This means the total recorded uptime was 99.917% and that Network Solutions managed to deliver on their promises by a whisker.",
    "The first help options you’ll probably notice with Network Solutions are their telephone number (which is advised to be used for urgent matters only) and “Contact us” button that will present you with a few ways to help yourself. Their knowledgebase (titled as “Help Center”) can be browsed with the help of a search box or you can pick out some of the preselected categories. There seems to be a decent number of articles which are mostly written in an easy-to-follow way (often with pictures) and rated by users with a five-star rating system.",
    "If you would rather rely on support agents from Network Solutions’ technical team, you can get in touch with them via support ticket, live chat and telephone, all of which ought to be available around-the-clock.",
    "Network Solutions features a community forum, where its registered users (we assume, since trying to proceed without registration made us hit the dead end) can seek answers to their questions, answer questions from other users or leave feedback for others to see. However, when we tried to register, not a single one from dozens of display names (and some were quite original) was deemed acceptable (the only explanation we got was “Name you entered is already in use”, which doesn’t seem to be the case), so we can’t report anything more than this.",
    "Both WestHost and Network Solutions have more than two decades of experience under their belt and are a part of something much larger than themselves (WestHost being under the wing of UK2 group and Network Solutions a part of Web.com Group). With WestHost you’ll get cheaper hosting, but only before the price renewal, after which your bank account might be struck with an existential crisis. With Network Solutions, however, there should be no surprises, since all of their discounts are based on the length of contract, therefore, the same period equals the same charge.",
    "Bluehost is one of those hosts that will provide their users with everything needed, but may make them do a double take upon viewing the pricing after the renewal. Even so, Bluehost provides a great value for money and offers (unlike Network Solutions) VPS hosting, managed WordPress and dedicated server in addition to basics, so it is better suited for more ambitious users.",
    "HostGator can provide you with everything Network Solutions can and go beyond that, and we are not thinking about hosting types only. The entry-level (adorably named “Hatchling”) plan with HostGator includes a domain name, website transfer, unmetered bandwidth and SSL certificate, all cost-free. In comparison, Network Solutions’ elementary plan has less bonus features to attract new users with.",
    "MochaHost and Network Solutions share a peculiar similarity when it comes to their entry-level hosting packages which are best ignored. Neither of them offers a free domain registration nor many unlimited features. That being said, MochaHost does provide a free SSL certificate (while Network Solutions doesn’t) and Network Solutions provides a one-click installer (which MochaHost, oddly, does not). However, since with MochaHost you’ll be entitled to an insane 180-day money-back guarantee, we would rather go with them.",
    "Since it was founded at the end of the disco era, Network Solutions certainly knows how to get groovy with its hosting packages, offering a great deal of helpful tools to get your website down with a boogie in no time. However, the problematic predominance of bad reviews from their former customers (some of them seem disenchanted, some upset and others are out for blood) on several consumer review websites makes this host difficult to recommend. If you want to give them a chance despite this, don’t let us stop you. On the other hand, if you would like to consider other options first, don’t fail to check out Bluehost and HostGator."
  ],
  "headers": {
    "5": "Plans and pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "18": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Network Solutions": "https://network-solutions.7eer.net/c/221109/1014112/555?subId1=trd-us-6655776515597839000",
    "DNS": "https://www.techradar.com/news/best-dns-server",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Starter": "https://network-solutions.7eer.net/c/221109/1014112/555?subId1=trd-us-6224117820778057000",
    "Essential": "https://network-solutions.7eer.net/c/221109/1014112/555?subId1=trd-us-4423159717852667000",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Premium": "https://network-solutions.7eer.net/c/221109/1014112/555?subId1=trd-us-8248998892181701000",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "email hosting": "https://www.techradar.com/news/best-email-hosting-providers",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "WestHost": "https://www.westhost.com/",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "MochaHost": "https://www.techradar.com/reviews/mochahost"
  }
}