{
  "source": "https://www.techradar.com/reviews/samsung-au9000-tv",
  "title": "Samsung AU9000 TV review",
  "category": "televisions",
  "updated": "2021-12-03T10:41:08Z",
  "author": "simon-lucas",
  "summary": "A mid-range TV that punches well above its weight",
  "verdict": "We knew how accomplished Samsung is at developing and delivering high-performance TVs at realistic prices, and the absolutely 50AU9000 delivers on that promise.",
  "pros": [
    "Composed, convincing 4K images",
    "Fine interface",
    "Good gaming features"
  ],
  "cons": [
    "Humdrum sound",
    "Not overly bright",
    "No Dolby Vision"
  ],
  "article": [
    "The Samsung AU9000 will betray its price-point every now and then – you’ll be struck by a lack of out-and-out brightness, or some especially vague sound, or some visible difficulties when upscaling low-resolution content. But most of the time, you’ll just sit and revel in the brilliantly accomplished images issuing from a screen far more slender than you might have been anticipating.",
    "Samsung has been a major player in the mainstream TV market for ages now, yet the AU9000 still seems like a remarkable achievement at the money. It’s a remarkably slender device, is operated using one of the leading smart TV interfaces, is generously specified and delivers outstanding pictures.",
    "Obviously it’s not perfect at such a low price: sound is the very definition of ‘dull’ and it can act up when asked to do a big upscaling job. But that’s to miss the point of what Samsung has done – serve up a TV that looks, both physically and in terms of its picture quality, considerably more expensive than it actually is.",
    "The Samsung AU9000 is on sale now in 43-inch, 50-inch, 55-inch, 65-inch and 75-inch sizes.",
    "The 50-inch model reviewed here is currently priced at £699 in the UK – although if our experience of Samsung’s previous high-volume models is anything to go by, that price will become more attractive sooner rather than later.",
    "In the United States, you should expect to pay around $969. That’s based purely on exchange rates, of course, because Samsung is the sort of company that likes to alter model numbers for different territories – and as yet we’re unable to confirm what this TV might be called in America.",
    "The same calculation gives an Australian price of AU$1259. It’s not uncommon for Australian consumers to find European products disproportionately expensive but, equally, Korean brands like Samsung are able to keep Australian prices competitive. If and when Samsung confirms this television’s model number for the Australian market, we’ll be able to update this information.",
    "By now, we’re all used to expecting a certain degree of sophistication from Samsung’s television designs, even when the television in question is a midrange, mainstream volume seller. And sure enough, the 50AU9000 is an elegant and understated looker – and, when viewed in profile, looks quite remarkably slender.",
    "It’s the final figure in the Samsung’s 1119 x 645 x 26mm (h x w x d) measurements that’s the most arresting. That depth is consistent, too – so if you decide to wall-mount your TV, it’ll sit almost flush. Samsung, with no apparent sense of hyperbole, calls this design language ‘AirSlim’.",
    "If you’d rather put it on a shelf or table-top, though, it’s supplied with a couple of unremarkable push-and-click feet. They have a little cable management in their rear portions, too, which is useful as long as your cables aren’t too expensive and chunky.",
    "From the front, the AU9000 looks clean enough. The bezel is minimal around the top and sides – and even if the bottom portion is both a bit heftier and doesn’t join the main frame seamlessly at either end, that’s the sort of thing you notice while installing the screen and then never give another thought to. The plastics feel nice enough, even on the rear panel, and as is usual with Samsung there’s an impression of quality construction.",
    "At the rear of the screen there are three HDMI inputs (one of which is eARC-enabled, and all three of which cover the ALLM and FreeSync aspects of HDMI 2.1 specification). Further physical connectivity is present in the form of an Ethernet socket, a couple of USB 2.0 inputs, a CI slot and an aerial post for the terrestrial TV tuner. There’s a digital optical output too, for use with legacy soundbars and so on. Wireless connectivity is present in the shape of dual-band wi-fi and Bluetooth 5.2.",
    "For quite a while, Samsung’s Tizen smart TV interface was obviously and unarguably the best around. In fact, it’s a measure of just how good it is that it remains one of the best interfaces currently available, despite everyone from LG to Hisense upping their smart TV game in response. The Tizen interface incorporated into the AU9000 is clean, logical, comprehensive and a straightforward pleasure to use.",
    "The available content is extensive, with all the worthwhile apps (and plenty that aren’t quite so worthwhile, too) on board. There’s no Freeview Play, admittedly, but every UK broadcaster’s catch-up service is available, alongside the likes of Netflix, Amazon Prime Video, Disney Plus and Apple TV – so whether you subscribe to streaming services or not, you shouldn’t be short of content to watch. And thanks to that Tizen interface, you shouldn’t struggle to find it, either.",
    "Set-up menus are similarly logical, and strike a nice balance between brevity and comprehensiveness. Achieving a picture that scrolls smoothly, defines edges confidently, and is decently bright and detailed, shouldn’t take long. Getting a colour balance you’re convinced by may take just a little longer.",
    "Both remote control handsets are eminently usable. The full-function wand is rather more prosaic in the way it looks and feels, admittedly, and some buttons feel a bit too compact. The stripped-back ‘major functions’ alternative is nicer to hold and use, and will likely be the default choice for most.",
    "That’s unless you want to use Samsung’s Smart Things control app, at least. It’s a clean interface, and performs stably – but it’s quite nosy. Short of inside leg measurement, there’s very little it doesn’t want to know about you, which some folks are guaranteed to find off-putting.",
    "Voice-control is available too. Unsurprisingly Siri isn’t available, but Amazon Alexa and Google Assistant both are. For the deeply obtuse (or for Samsung employees), Bixby voice assistance is available too.",
    "If you’re intending to see the AU9000 perform at its best, then you’ll need to serve it some native 4K content with HDR10+ augmentation – because, as is always the case (and as is always galling) with Samsung, there’s no Dolby Vision dynamic metadata HDR standard on the spec-sheet.",
    "Still, a 4K HDR10+ disc of the impeccable remaster of Kubrick’s The Shining turns out to be the right stuff – and when given the best chance, this Samsung proves an absorbing and accomplished watch.",
    "When written down, edge-lit backlighting and peak brightness of less than 350 nits doesn’t look all that promising in terms of contrast or visual dynamism – but the Samsung outperforms that on-paper specification quite comfortably. There’s decent depth to black tones, and they’re very acceptably detailed at the same time – but what’s even more impressive is the variation and smooth gradation of black shades. Backlighting control is confident too, and even the darkest scenes with minimal lighting resist significant blooming or haloing. And while white tones hardly pop from the screen, they’re clean and equally detailed – so while contrasts are far from the widest you’ve ever seen (even at this unremarkable price-point), they’re convincing nevertheless.",
    "The colour palette, too, is naturalistic and wide-ranging. Skin-tones are convincing, with more than enough fine detail carried over to make the subtleties of a complexion obvious. Kubrick’s trademark primary tones, such as the bright red of the Gold Room lavatories in the Overlook Hotel, are dynamic without being in any way over-driven, while the less glaring tones in the reception area are muted without being dull.",
    "The AU9000 draws a nice smooth edge, keeping a lid on shimmering or doubling of images even when the on-screen motion gets properly testing. One of the trickiest moments of all, right at the start of the film (an airborne camera follows a car up a mountain road from way overhead, while slim blue text scrolls from the bottom to the top of the screen) is handled with real competence – there’s not quite the buttery smoothness that some of Samsung’s pricier televisions will treat you to, but it’s not as if the AU9000 will have you howling with frustration.",
    "Thanks to its Crystal Processor 4K, the Samsung’s also a very adept upscaler of lower-resolution content. Certainly the endless colours and textures of the BBC’s The Great British Sewing Bee enjoy worthwhile variation, and contrasts stay clean and obvious too. There’s a little hesitancy when it comes to edge definition and motion control, but it’s minor enough to be easily ignored. Step down in source quality from there, though, and the results are predictable – softness of image, hesitancy of motion, significant lack of detail. Any 4K TV would struggle with a daytime TV repeat of Murder, She Wrote and the 50AU9000 is no exception.",
    "As far as gaming goes, the news is at least partially good. Each of the Samsung’s three HDMI inputs can cope with the Auto Low Latency Mode and FreeSync aspects of a next-gen console’s specification – latency is down below 10m/s at worst and sub-6.0m/s at best. Add in some complicated processing that intends to mimic a 4K/120Hz refresh rate, and the ability to accommodate the 32:9 aspect ratio some PC games are so enamoured of, and the AU9000 isn’t a bad gaming companion at all.",
    "It’s not uncommon for a mainstream TV to betray its price-point more readily with the sound it makes than with the images it produces. And so it proves with the AU9000.",
    "Samsung’s not very forthcoming about the size and composition of the two drivers fitted to the lower apportion of the screen. It’s prepared to admit they enjoy a total of 20 watts of power, though. And it’s happy to suggest its ‘Object Tracking Lite’ algorithms can coax a meaningful impression of height out of the audio presentation too.",
    "It’s fair to say this last part is a red herring. The point-source of sound from the Samsung is hazy, certainly, but that’s not the same as delivering an impression of height – not at all. And as far as tonality goes, the 50AU9000 sounds tentative and rather flat. It’s game, certainly – wind the volume upwards and it resists hardening or coarsening quite commendably. But really, it’s as far removed from the standard of the images the Samsung produces as these things ever are.",
    "So not for the first time, we find ourselves strongly pushing the idea of a soundbar to bring your sonic presentation up to snuff. Given that the AU9000 is ready to contribute to a ‘Q Symphony’ arrangement with an appropriate Samsung soundbar – that’s when the TV’s speakers join in with, rather than are muted by, an attached soundbar, we’d particularly suggest looking into that option. But in any event, try and keep a little of your budget aside – an inexpensive soundbar is the least these images deserve."
  ],
  "headers": {
    "0": "One minute review",
    "3": "Price and availability",
    "7": "Design",
    "12": "Smart TV (Tizen)",
    "18": "Picture performance",
    "25": "Audio",
    "29": "Don’t buy it if…"
  },
  "links": {}
}