{
  "source": "https://www.techradar.com/reviews/swann-xtreem-security-camera",
  "title": "Swann Xtreem Security Camera review",
  "category": "smart-home",
  "updated": "2021-09-10T11:16:00Z",
  "author": "chris-price",
  "summary": "A versatile, wireless security camera that can be mounted anywhere, indoors or out",
  "verdict": "The Swann Xtreem security camera is a versatile battery-powered home security camera that can be used indoors or outside. It records clear Full HD video, which can be stored locally or online for 24 hours free of charge, and uses heat sensing technology to send fewer unwanted alerts. Swann claims the recharge battery lasts for up six months between charges, but the camera does need to be located reasonably close to a WiFi router for optimum performance.",
  "pros": [
    "Weatherproof housing",
    "Motion and heat sensing option",
    "Free Micro SD recording"
  ],
  "cons": [
    "Requires DIY skills for installation",
    "Only works with 2.4GHz Wi-Fi network",
    "Needs to be close to a WiFi router"
  ],
  "article": [
    "Swann may not be a name that many people are familiar with, but the Australian brand founded in Melbourne has been around for some time and its reputation is steadily growing.",
    "The Swann Xtreem security camera is its latest model and combines a Full HD lens with a not particularly wide 110-degree viewing angle for capturing movement. Storage is provided either via a Micro SD card (a 16GB card is provided with the camera) or via the cloud. Two cloud options are available. Either you can store clips in the cloud for 24 hours for free or pay for Swann’s Secure+ Service subscription service for up to 60 days of rolling clips from $4.99 / £4.95 / AU$6.95 per month.",
    "Swann claims that its True Detect heat and motion sensing technology results in fewer ‘false alerts’ caused, for example, by passing cars or swaying trees. Alternatively, it’s possible to use the software within the app to adjust motion sensitivity depending on your setting. Other features include the option of a siren that goes off when motion is triggered and two-way audio so you can speak to whoever is at your property. It also works with both Google Assistant and Amazon Alexa if you want voice control.",
    "What’s particularly good about this Xtreem model is its versatility. Rather than being mains-operated which limits where it can be mounted, this model boasts a rechargeable battery, which offers up to six months of use from one full charge. It’s also weatherproofed (IP56) which means that it can be mounted outdoors as well as inside. A magnetic base for mounting the device either to the wall or to a flat surface such as a table or bookcase, is also provided.",
    "Costing $179.99 / £179.99 / AU$199.95 there are certainly cheaper home security cameras around, but the Xtreem is a solidly built and well-equipped unit. What’s more, you don’t have to pay an additional monthly subscription charge for storing video clips thanks to a Micro SD card slot and free rolling 24-hour cloud storage.",
    "The Swann Xtreem security camera is priced at $179.99 / £179.99 / AU$199.95 and is available worldwide from Swann.",
    "As we’ve already mentioned, the camera can store videos recorded for 24 hours free of charge. If you want o review them after this, you’ll need to subscribe to Swann Secure+, which costs from $4.99 / £4.95 / AU$6.95 per month and also includes pet and vehicle detection, as well as rich notifications.",
    "There’s certainly nothing flimsy about the Swann Xtreem security camera. A bulky unit, it looks and feels reassuringly well made, tipping the scales at around 0.77lb / 350g. Part of the reason for this is built-in rechargeable battery that provides up to six months of charge. At the front is the Full HD lens while underneath is the motion sensor and the recording and /pairing lights which illuminate red and blue respectively.",
    "On the top of the unit beneath a waterproof cover is the reset button as well as the Micro SD card slot for storage. Underneath you can find a micro USB slot for charging the battery, and a speaker for communicating with people who come to your door or who are in your house.",
    "A screw mount so you can attach the camera to a tripod if you wish, and a powerful magnetic mount that ensure the camera can be used freestanding, and can be easily angled for different locations, are provided. On top of that, two screws and two raw plugs are included for drilling the mounting bracket into the wall as well as double-sided adhesive tape. However, we wouldn’t recommend using the tape to attach the security camera to the wall as it is a particularly heavy unit.",
    "Finally, included in the box are dozens of security stickers in different languages so you can let people know that you have a Swann security camera installed if you so wish.",
    "When it came to testing the Xtreem Security security camera indoors we didn’t have any problems. The picture quality was good and the unit was sensitive enough to record motion. However, using the unit outside proved much more problematic, especially as we moved further away from the house router.",
    "With other security cameras we’ve tested, even at around 100 ft / 30m we’ve been able to stream reasonable quality pictures. Not so with this Swann unit. Signal quality seemed to drop off very quickly which meant that at the back of our house, away from the router located at the front of our property, it wasn’t possible to view images. Instead, we just got the message ‘authenticating’ and the camera wasn’t able to sync with the app at all.",
    "That said, moving the camera much closer to the router (we would recommend 33 ft / 10m or less) yielded excellent results. Despite a reasonably narrow viewing angle of 110 degrees (some units offer 180-degree viewing angle) images were very detailed. Also very useful was the ability to adjust sensitivity to capture movement either close to the camera or much further away. However, this unit doesn’t have the facility to record movement in certain parts of the display only (ie. motion zones) as you can with devices like the Ring Spotlight Cam.",
    "Control, as with most security cameras, is provided via a smartphone app rather than a web interface. Simply download the Swann Security app for your iOS or Android device and scan the QR code on the bottom of the device. This brings up the model within the app and after inputting your details including WiFi code you should be ready to go. To help set up, voice instructions with commands such as ‘Ready for Pairing’, ‘Set up in Progress’ and ‘Connection Succeeded’ are provided.",
    "Certainly, the app is very comprehensive. Perhaps most useful is the ability to set motion detection for different modes – home, night and away. For example, if you are at home all day you might want to switch motion detection off completely, so it doesn’t trigger a recording every time you move around. Conversely, at night you may want higher motion sensitivity levels, such as ‘far’ and ‘maximum’ so the camera records every bit of motion. Other settings include speaker and microphone level adjustments (we would recommend setting them quite high), a do not disturb option so you don’t receive push notifications and a siren option.",
    "Thankfully, scrolling through previous recordings is straightforward thanks to a calendar format that allows you to search by date after pressing the playback button on the bottom of the screen. Alternatively, you can hit the Live View button to see footage from your camera at any particular moment – handy if you want a quick check on your property from wherever you are in the world. Using the app you can also view footage from any other Swann devices you may have in your set up.",
    "Swann says the battery will last up to six months between charges, although this will depend on how often and for how long live view is activated, as well as how often motion is detected. We’re not able to confirm this based on ‘typical use’, as we’ve put the camera through heavy testing in a short period of time for this review.",
    "The battery took five hours to fully recharge, which is disappointing, as because the battery is built-in the camera will be out of action while the battery is charging. We’d prefer to see a swappable battery, as in the Arlo Ultra 2 and the Arlo Pro 4, so that, provided you purchase an additional battery, the camera will never be offline.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Swann Xtreem Security Camera price and availability",
    "7": "Design",
    "11": "Performance",
    "14": "App",
    "17": "Battery life",
    "19": "Don't buy it if..."
  },
  "links": {
    "home security cameras": "https://www.techradar.com/news/best-home-security-camera"
  }
}