{
  "source": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
  "title": "Sony WF-1000XM3 Wireless Earbuds review",
  "category": "audio-visual",
  "updated": "2021-11-22T20:33:29Z",
  "author": "steve-may",
  "summary": "True wireless earbuds still worth buying",
  "verdict": "Top notch design, class-leading noise-cancelling and decent battery life make the Sony WF-1000XM3 True Wireless Headphones a worthy purchase, even if they have been usurped by the WF-1000XM4.",
  "pros": [
    "Efficient noise-cancellation",
    "Inconspicuous looks",
    "Great fun to listen to"
  ],
  "cons": [
    "Struggle with in-flight noise",
    "No LDAC support",
    "Not suitable for sports"
  ],
  "article": [
    "The Sony WF-1000XM3 True Wireless headphones have a lot to live up to: Launched as part of the brand’s lauded 1000X family of noise-cancelling headphones – that includes the award-winning Sony WH-1000XM4 – and the expectation is that these true wireless earbuds will offer superior noise suppression and no small amount of style.",
    "The good news? They don’t disappoint on either count – and that's why the Sony WF-1000XM3 remain one of the best true wireless earbuds money can buy, especially during sales events like Black Friday and Cyber Monday when there are a plethora of deals to pick from.",
    "In November 2019, Sony released a firmware update for the WF-1000XM3 headphones that brings a bunch of improvements, including Amazon Alexa support, volume control via the headset and a visible battery level indication of the charging case in the Sony Headphones Connect app.",
    "You can get slightly better performance if you upgrade to the newest Sony WF-1000XM4, TechRadar's top pick in wireless earbuds, but we genuinely think you'll still enjoy the WF-1000XM3 despite being a few years old at this point.",
    "The Sony WF-1000XM3 are priced at £220 / €250 (Ireland), $230 and AU$399. However, you can get them much cheaper these days, and they're sure to be discounted in the Black Friday deals in November.",
    "Available in both regular black, and a rather stylish champagne silver, they’re roughly a third cheaper than the over-ear WH-1000XM3 model they share technology with. They’re also competitively priced against rival wireless earbuds like the $299 Bose QuietControl 30 that also offer active noise canceling.",
    "If earbuds were only judged on their design alone, the WF-1000XM3 would already win all the marbles: They lack the protrusive bulk of the Sennheiser Momentum True Wireless, and the unapologetic dorkiness of Apple AirPods. Plus, weighing just 8.5g each, they're comfortable in the ear and they look stunning.",
    "The headphones come in a smart rechargeable case, with on-trend copper lid, and are held securely in place with magnets. The case itself doubles as a battery pack, if you need a rescue recharge when out and about.",
    "The belated successors to the WF-1000X, launched back in 2017, they feature a number of improvements to sound quality and noise cancellation. This includes a dual-sensor system in each bud, and the adoption of essentially the same QN1 noise-canceling processor found in the WH-1000XM3 over-ears.",
    "In terms of comfort, the fit of the WF-1000XM3 inspires confidence. Cleverly twisting into place, secured by the structure of your ear, they feel snug and reasonably comfortable (let’s face it; you’re never going to want to spend all day wearing in-ear buds). Importantly, they don’t feel as though they’re likely to drop out as you bop down the street and these are easy headphones to live with - just chuck the charging case in your pocket and you’re good to go.",
    "A wide selection of non-slip rubber and foam earbud covers are supplied in the box, so it’s worth experimenting to find one that offers the best fit/comfort.",
    "There's little missing when it comes to specification: In addition to Bluetooth NFC pairing, there’s Google Assistant support and familiar Sony audio processing refinements, including DSEE HX, which is available to restore subjective detail to lossy streams. There’s also support for hands-free voice calling.",
    "Even better, the partnering Sony Headphones Connect app allows you to make EQ changes, if required (we never deemed it necessary), which is an option that not every headphone includes these days. You can also use the app to prioritize Bluetooth connection over sound quality, but why make the sacrifice?",
    "Much like their full-size stablemates, there’s a selection of physical controls on offer, although the reduced headphone space makes using them a tad more fiddly.",
    "Like the Powerbeats Pro and other high-end true wireless earbuds, a proximity sensor provides wearing detection, so the WF-1000XM3 always know when they’re in use. Take one out and your music will pause, resuming when you put it back in place. A tap of the touch panel will pause or play your tunes.",
    "There’s also a Quick Attention mode available on the right-hand ear bud that was a staple in the over-ear WH-1000X series allowing you to touch the earbud to clearly hear ambient sound. Unfortunately, there’s no on-bud volume control though; that can only be carried out through the app.",
    "The other bad news? There’s no support aptX HD or Sony’s high headroom LDAC Bluetooth extension. The WF-1000XM3 also use a 24-bit audio processor, not the 32-bit silicon found in the WH-1000XM3. Sorry audiophiles, you're going to have to buy the full-size cans if you want all the best features.",
    "Tiny 6mm drivers exude clarity and rhythm; these superb little music makers miraculously conjure a wide, expansive soundstage, with believable spatial detail.",
    "If your commuting vice is podcasts, the mid-range is silky smooth. If you prefer to rock out, they roll with the best of them - guitars have edge, drums are tight and hard. Alternatively, dance and pop mixes sound positively frothy.",
    "There’s some appreciable bass, but no boom. If you want a more pronounced thump, then over-ears are always going to be a better bet.",
    "Of course, the real test for the WF-1000XM3 is their noise-cancelling abilities. To learn more we took them on a noisy commute, and a touristy sightseeing tour, then subjected them to the ultimate test - in flight. The results were surprising.",
    "The WF-1000MX3 employ the same noise-cancelling engine as their bigger brother, but that doesn’t mean they’re directly comparable. Sony told us the QN1e HD noise cancelling processor at work here puts in a comparable performance to that found in the second-gen WH-1000XM2 over-ears.",
    "Where these Sony’s noise-canceling really scored was the everyday commute, be it by train, tram or bus. Noise suppression is high. The headphones are extremely good at eliminating nearby chatter, thanks to dual noise sensors in each bud.",
    "We found it virtually impossible to hold a conversation with Active Noise Cancelling engaged - which is a good thing when you're trying to keep outside conversations on a flight, train ride or day at the office to a minimum.",
    "However, airplane cabin noise proved too much for the diminutive buds. While the WF-1000XM3 were able to reduce the drone of an aircraft in flight, they certainly didn’t eliminate with the same ruthless efficiency of the WH-1000XM3. So while everyday travel is within their reach, we wouldn’t turn to these for a long haul flight.",
    "Bluetooth stability proved consistently good. Sony has positioned the Bluetooth antenna in the pointy bit of the headphone, and uses a new L/R simultaneous transmission system which reduces latency, handy if you’re watching TV on your smartphone. It also improves signal stability, lowers power consumption and lets you connect just one earbud if you need to.",
    "When it comes to battery life, the WF-1000XM3 edges past rivals like the Apple AirPods (5 hours) and Sennheiser’s Momentum True Wireless (4 hours) with around 6 hours of power per charge. If you forgo noise cancelation altogether, you can claim back another couple of hours - but where would be the fun in that?",
    "The charging case has a quick charge mode. Plug in for ten minutes and you’ll get another 90 minutes of juice - perfect if you need a quick boost before a flight - and the case charges over USB-C in about three hours.",
    "In spite of a few minor problems we feel that Sony has knocked the ball out of the park with the WF-1000XM3: Not only are these among the best looking true wireless headphones out there, they combine serious noise cancelling tech with fist-pumping musicality. If you don’t want the inconvenience of carrying full-size cans, they’re a persuasive alternative.",
    "Battery life is above average, and that compact charging case is pretty slick too. On-ear volume controls similar to the PowerBeats Pro would've been nice, but again, that's really not a deal-breaker in our books."
  ],
  "headers": {
    "4": "Price and release date",
    "6": "Design",
    "11": "Features",
    "17": "Performance",
    "26": "Battery life",
    "28": "Final verdict"
  },
  "links": {
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "firmware update": "https://presscentre.sony.co.uk/news/sony-introduces-new-firmware-update-to-wf-1000xm3-truly-wireless-headphones-388203",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Bose QuietControl 30": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/bose-quietcontrol-30-1322718/review",
    "Sennheiser Momentum True Wireless": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-review",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344"
  }
}