{
  "source": "https://www.techradar.com/reviews/iphone-12",
  "title": "iPhone 12 review",
  "category": "phones",
  "updated": "2021-12-02T10:57:08Z",
  "author": "gareth-beavis",
  "summary": "The iPhone 12 is still a solid phone taking great photos",
  "verdict": "It’s easy to dismiss the iPhone 12 as just 'more of the same', especially when you consider the new and compact iPhone 12 mini is also an option, and you can always go for the iPhone 13 series now. However, 5G networks are continuing to roll out across the globe, and the MagSafe addition is a useful addition to the iPhone arsenal – these things, combined with an improved design and screen, mean the iPhone 12 will become more useful the longer you own it. It's no longer the latest iPhone thanks to the iPhone 13, and it doesn’t come with a charger in the box; yes, there are environmental benefits to this, but you may need to factor buying a new charger into the cost of your new iPhone on top of the higher price.",
  "pros": [
    "Colorful OLED display",
    "Future-proofed with 5G",
    "MagSafe is intriguing"
  ],
  "cons": [
    "Cameras are similar to last year",
    "Battery life only okay",
    "Hike in price over iPhone 11"
  ],
  "article": [
    "The iPhone 12 is a more expensive phone than 2019's iPhone 11, with Apple adding $100 / £100 to the price; it does, however, bring a number of new features that make for a more premium handset, including an OLED display, a slightly upgraded camera, a new design and – the big hitters – 5G and MagSafe connectivity.",
    "It's also important to note this is just one member of the iPhone 12 family, which has a record four phones, including the iPhone 12 mini, iPhone 12 Pro and iPhone 12 Pro Max. Ideally, there's an iPhone 12 for anyone – but the phone for nearly everyone may just be the standard iPhone 12, which packs the best parts of the range at a lower price than the Pro models.",
    "The iPhone 12 has stayed in the official Apple lineup even now that the iPhone 13 is out and it takes the place of a slightly more affordable option without the handful of extra bells and whistles in the new phone. This is typical of Apple, which has kept the last year's phones and discounted them as cheaper alternatives, so we expect the iPhone 12 to not just be viable but crucial to Apple's strategy going forward. The phone got more features with iOS 15 and we can count on it getting newer updates for years to come.",
    "Starting with the iPhone 12 headliners, 5G brings faster speeds and more robust connectivity to the new iPhone, but as 5G networks aren't yet fully deployed around the world, coverage is still a bit patchy. When it works, it's incredibly fast – we easily managed 200Mbps on the go – but there are still too many places, even in big cities, where it's hard to get full coverage.",
    "That said, given that many are holding onto their phones for three or four years nowadays, this is a feature that will only become more useful over time – the iPhone 12 can connect to a huge range of 5G frequencies too, meaning that if there’s a 5G signal where you are you should be able to connect to it, whether on sub-6 or mmWave networks.",
    "The new (to iPhones) MagSafe connector on the rear of the iPhone 12 is a really interesting proposition – this magnetic connection tech not only enables you to attach things to your phone, such as a charger or a case, but can also tell what's been connected through a special chip.",
    "MagSafe enables faster and more accurate charging, which is neat in itself – but the magnetic connection opens the door to a new range of accessories (like a wallet clip-on or camera mount) but, just as 5G will become more useful over time, we're pretty certain that the MagSafe accessory range is going to expand massively as third-party manufacturers get their hands on the technology.",
    "That means we could see some cool clip-on accessories like games controllers, photo printers and huge extra batteries coming soon. If these MagSafe mounts turning your iPhone 12 into a proper camera are anything to go by, the sky's the limit.",
    "The performance of the iPhone 12 has been upgraded once again: the A14 Bionic chipset is the most powerful in any smartphone, and the benchmarks bear that out as it annihilates the competition - and weirdly, doesn't get outperformed by the theoretically more powerful iPhone 12 Pro.",
    "The decision to start with 64GB inside is stingy though, and you might start butting up against that barrier in the not-too-distant future if you like taking photos and videos at full resolution.",
    "The iPhone 12 design has been tweaked, with squared-off edges that are highly reminiscent of the iPhone 4 and iPhone 5 from yesteryear, and a new Ceramic Shield front that’s allegedly four times harder to shatter than the iPhone 11 (not that we were willing to drop-test our review sample).",
    "The display has been upgraded too: it’s now an OLED screen, the same tech that’s used on the iPhone 12 Pro, and offers rich colors and deep blacks, as well as bringing true HDR to the mix for compatible content. It sounds like a small thing, but perhaps the slick 120Hz display tech would have been a boon here too; however, you are still getting a sharp and colorful viewing experience on the iPhone 12.",
    "Cameras-wise, you're again getting the 12MP duo of the wide and ultra-wide cameras here. The former is even better in low-light this year, and both can now be used with Night Mode. This feature can improve your snaps in a way that’s genuinely staggering; however, it's also available on the iPhone 11, and we would have liked to have seen it upgraded in 2020.",
    "The video capabilities, including the ability to record in Dolby Vision in 4K, sound impressive, but for most this will be a rarely-used feature. That said, the output is strong to look at and something you'd be keen to share.",
    "Battery life is only average on the new iPhone 12; with heavier use your phone should see you through most of a day – around 17-18 hours at a push. Lighter usage will see you easily sail through to the night, but it's not quite as good as last year's model.",
    "The iPhone 12 feels like it's packed with potential – but Apple is relying on others to make it a success to a large extent. We need to see wider deployment of 5G, and others need to get on board with MagSafe accessories quickly, to really make the new phone an appealing buy. Those things aside, and while the upgrades to the display and design are nifty, the iPhone 12 doesn’t feel massively different to the iPhone 11– and doesn't feel like it outperforms its higher price tag in the same way that phone did.",
    "The iPhone 12 will likely be reduced in the Black Friday deals so it’s worth keeping an eye on the Black Friday iPhone deals popping up, and we’ll be conducting a re-review in the future. However, we’ve updated references within our review to highlight new features that have emerged since our tests to give you a better idea of what you might be buying.",
    "The iPhone 12 release date was October 23, 2020, so the phone has been out a while but you're able to buy it directly from Apple as well as a variety of retailers. The phone's sibling - the iPhone 12 mini - wasn't available until a few months later, but it's still available.",
    "The iPhone 12 price at launch started at $799 / £799 / AU$1,349, which is $100 / £70 / AU$150 more than the iPhone 11 range. That was likely due in part to the cost of adding in a 5G modem, but also because the iPhone 12 mini is grabbing that iPhone 11 price point, starting from $699 / £699 / AU$1,199.",
    "But those prices have dropped now that the iPhone 13 has launched, meaning you can get an iPhone 12 starting at $699 / £679 / AU$1,199 for the 64GB model, and the new price for the 256GB version is $849 / £829 /AU$1,449.",
    "Remember too that you’re only getting the 64GB version of the phone at that starting price, and that’s pretty stingy as a base level of storage in 2021. What will the phone cost in your market? We have the iPhone 12 prices for the US, UK and Australia below.",
    "In the US, you'll be able to get the device on AT&T, Sprint, T-Mobile and Verizon. Note that, in the US, the $799 price is only when you buy the phone SIM-free from those networks – if you want to just buy it unlocked, it’ll cost an extra $30.",
    "Those in the UK are able to buy from EE, Vodafone, O2, Three and a variety of other networks. In Australia, Vodafone, Optus and Telstra all stock the iPhone 12.",
    "What does ‘elevated’ mean to you? If one were to say, the design of something is elevated, would that mean the sides of it were now flat and more ‘industrial’-looking?",
    "Well, if your answer is yes, then you already get the design ethos behind the new iPhone 12. While it’s similar in size and shape to 2019’s iPhone 11 (and actually a few millimeters shorter and thinner), the main difference is to those edges, which are a sharp 90-degree angle rather than the convex, curved sides of the previous iteration.",
    "The iPhone 12 feels sharper to hold in the hand as a result, with the edges of the phone not resting as snugly in your palms, and we certainly wouldn't call it comfortable after a couple of weeks of using it.",
    "If you’ve had iPhones for a fair few years you’ll instantly be reminded of the feeling of using an iPhone 4 or 5, both of which had similarly squared sides, but the larger phone does push it into the hands a touch more.",
    "It’s an interesting design change from Apple, and one wonders if it’s been done to enable a stronger 5G signal (there is a small gap for the mmWave version in the US).",
    "It’s also designed to make the rear of the phone twice as likely to survive a drop, even though it’s using the same glass as on the iPhone 11.",
    "The front of the iPhone 12 features a new Ceramic Shield to further protect it from shattering, with Apple claiming it’s four times less likely to break in a drop, so Apple is going big on durability this year.",
    "A number of drop tests have emerged from around the web testing this new idea, and most show what you might expect: the front glass is stronger than the rear (which appears to crack first when dropped from around head height) and the front screen does indeed seem to be more durable.",
    "We haven't performed any drop tests on our units - mostly because we need them to keep reviewing throughout the year - but it seems clear there's an improvement with the material on the front of the iPhone 12.",
    "None of the above means you can now do without a case or screen protector, as the iPhone 12 isn’t claimed to be unbreakable or unscratchable. Four times less likely to shatter means it can still crack from the ‘right’ (or repeated) drop, and the front display can still get scratched over time if you place it with sharp objects in a pocket, as we found with the iPhone 12 Pro – so if you want to keep your iPhone safe and looking pristine, put a case and/or screen protector on it.",
    "If you’re someone who likes the feel of a ‘naked’ phone, then you’re still going to be running the risk of breakages, albeit a reduced one.",
    "The IP68 rating has been enhanced in 2020, allowing the iPhone 12 to be submerged down to six meters for 30 minutes before things start to get wet inside – more realistically, this means that general, day-to-day water damage is less likely to occur.",
    "One of the most contentious changes with the iPhone 12 doesn’t revolve around the phone itself, but what comes with it. The charging block and EarPods have been omitted from the box, with Apple highlighting the environmental benefits of not cluttering the drawers of millions of people around the world with things they already have (as well as the shipping efficiencies resulting from the boxes being slimmer).",
    "“As part of our efforts to reach our environmental goals, iPhone 12 and iPhone 12 mini do not include a power adapter or EarPods. Please use your current Apple power adapter and headphones or purchase these accessories separately.”",
    "This is what’s listed on the new iPhone page - and it would make sense, save for the ‘current’ Apple power adapter.",
    "As Apple is including a Lightning to USB-C cable, not the Lightning to USB-A connection (USB-A being that ‘stereotypical’ USB connection over the years) the ‘current’ adapter many have won’t be right, so you’ll need to use an old Lightning cable and charger if you buy the new iPhone 12 (which means slower charging) – and if this is your first iPhone, you’ll almost certainly need to pay the extra $19/£19/AU$29 for a charging block you can use.",
    "The iPhone 12’s display is a big step forward for a phone of this price – while 2019 Apple decided that fancy, high-contrast OLED displays were only for those willing to shell out for the Pro, now the Super Retina XDR Display has been brought to the cheaper iPhone 12.",
    "The difference is noticeable, especially when it comes to viewing photos, videos and movies encoded in HDR.",
    "You might not see that much of a difference when just scrolling around the web, but, whether it’s looking at artistic photos on Twitter, sampling HDR content from iTunes or just improving the look of Netflix, the OLED upgrade brings a big jump in image quality.",
    "Day to day it means you’ll have more moments where quality content will really pop out at you. For instance, while many people won’t have access to HDR Netflix on their phone (thanks to it being locked to the most expensive subscription tier) images even in ‘normal’ mode are vibrant, rich and (if you’re viewing the same nature videos we were) startling.",
    "The iPhone 12 has 2532 x 1170 pixel resolution, and the display is sharp and clear and viewable at all angles. The bezels are thinner (although the squared design of the phone means they still look a little thick), and this allows the iPhone 12 to be a little shorter and narrower than 2019’s version, while retaining the 6.1-inch display.",
    "While in the past it’s been easy to criticize Apple for not putting the best display technology in its phones, there’s very little to fault about the new iPhone 12’s screen.",
    "Adding in 120Hz, a faster screen refresh rate that makes for more fluid scrolling on the new iPads, as well as on some Android flagships, would add a level of gloss to interacting with the new iPhone, but otherwise the sharpness, color reproduction and HDR levels look to be pretty good across the board.",
    "According to our testing, the iPhone 12 has a slightly lower brightness than the iPhone 12 Pro - while they've got the same peak screen brightness when showing HDR content, the day-to-day view is slightly darker. Well, we rarely noticed much difference at all side by side, but being less bright will offer slightly better battery life over time, and we found everything visible even in bright sunlight.",
    "The only real question we have here is whether you’ll want HDR on a phone screen – yes, the color reproduction and contrast ratios (the difference between the brightest and the darkest points) is excellent, but in HDR mode some detail can get lost in the ‘majesty’ of the display.",
    "This notion is subjective, and minor in terms of how you’ll use the phone - but it’s worth being aware of if you’re enticed by the notion of HDR on a mobile.",
    "While we’re going to go into the more nuanced upgrades in the iPhone 12 compared to previous models later in this review, there are two key changes for 2020's model that will likely attract your attention.",
    "The bad news is that neither are likely to feel hugely impressive just yet.",
    "The headline feature for the iPhone 12 is that it now supports 5G, and with more compatibility to connect to the speedy 5G networks than many other phones, including the lightning-fast, but limited-range, mmW (millimeter wave) standard in the US... when they’re deployed.",
    "The idea of being able to browse almost instantaneously, download faster and stream in higher quality sounds appealing - but the issue right now is that you can’t access 5G easily outside of large cities – and even then, it’s not complete coverage.",
    "Also, 4G speeds on our current phones are still fast enough for most of us, thanks very much. The experience of streaming Netflix and Spotify is perfectly acceptable, and making things that much faster feels more like a curious luxury than a must-have feature right now. Need for speed? More of a ‘yeah, it’d be alright’ notion for motion.",
    "It’s not easy to add 5G connectivity to a smartphone design – the components are more expensive, and space in the chassis is at a premium.",
    "But while the addition of 5G into the iPhone range might not feel entirely necessary right now, it’s not superfluous by any stretch of the imagination. Firstly, the 5G speeds you can reach when you do make a connection are mind-blowing… we clocked 200Mbps with ease on a train at one point (on the EE network in London, UK), and we downloaded a 110MB audiobook in half a minute, where a 4G connection was struggling at a much lower rate. It's not blindingly fast (around 30Mbps) but it's an improvement over 4G.",
    "We also found that coverage of signal is improving – relying on 5G, we were able to send and receive messages on a portion of our regular train journey that previously was a blackspot for all data. Whether that’s thanks to networks increasing their 5G coverage, or the iPhone’s increased band sensitivity, we’re not sure – but the results were good.",
    "If you think the 5G advantage is all about speed though, you’d be wrong. In one test we had one iPhone connected to 4G in central London, and tried to connect to Spotify to stream some music while on a run. Would it connect? Nope.",
    "We switched to 5G on our iPhone 12, and were able to instantly connect and stream without issue. Now, that’s partly because there are fewer people on this nascent network, but also because 5G allows for multiple connections with less slowdown.",
    "So you can imagine that (when it’s allowed) using 5G at a football game or packed concert will see an end to those occasions where you want to use your phone but data just won’t filter through.",
    "But right now we’re still some way away from that – there needs to be a wider deployment of 5G around the world in order for the superfast dream to be truly realized.",
    "While 5G might be the headline spec for many people looking at the iPhone 12, there’s something else added to 2020’s iPhone that actually has us a little more excited.",
    "It’s MagSafe, the same magnetic, snap-on technology that Apple has previously used on MacBooks to connect the power adapter. Here, the magnets are arranged in a circle under the rear case of the iPhone, enabling the introduction of a range of new accessories that simply click onto the back of the iPhone 12 handsets.",
    "These MagSafe accessories have a small chip inside them that the iPhone is able to read, so it can register what they’re supposed to do. While at launch this feature is limited to cases and a charger from Apple, these accessories are an upgrade on previous years, and when third parties get involved we could start seeing some real innovation with the iPhone that other brands, with less scale, just couldn’t match.",
    "There have been attempts in the past to bring magnetically-attached accessories to smartphones, notably by Essential and Motorola. Motorola’s Moto Mods, in particular, were hugely impressive – being able to clip a game controller, battery pack, speaker or even 5G modem to your phone was a brilliant idea.",
    "But with Motorola’s phones not seeing the widespread adoption the iPhone enjoys, there wasn’t the takeup from third-party accessory makers that this cool idea deserved, and the feature has been quietly discontinued.",
    "But a look at what was achieved with Moto Mods gives us an idea of what we can hope to see from MagSafe: there was a snap-on games controller, a mini projector, an instant photo printer, and a whole new Hasselblad camera accessory that added a huge sensor to your phone.",
    "If we saw such innovation with the Motorola range, imagine what will happen with a similar system that’s on some of the world’s most popular phones.",
    "At launch though, you’re just getting a MagSafe charger from Apple, as well as some cases and snap-on accessories. The charger is neat in that it enables 15W fast wireless charging – that’s twice as powerful as on the iPhone 11.",
    "By ensuring that the charger clicks precisely into place (and boy, it clips firmly), with confirmation through the chip that the charger is safe, Apple has upped the power – when wirelessly charging older iPhones we’ve sometimes woken in the morning to find that our wireless charger had slipped a little when we placed our phone on it, and the phone is nearly out of battery, and that’ll be a thing of the past with the iPhone 12 and MagSafe.",
    "The MagSafe cases are a nice idea – the new iPhone can recognize the color of the case placed on it through that chip, and the screen will glow with the same hue. And while these new cases are £10 / $10 more than Apple’s standard cases, they do bring another advantage: you can charge the iPhone 12 through your case.",
    "For many, that will be a huge plus – having to take a case off a phone every night is a hassle, and eventually it can cause you to just leave it off permanently, which reduces the protection for your shiny new phone.",
    "The camera setup on the iPhone 12 doesn’t appear to be much of an upgrade when you just look at the sensors – there's still the same wide camera (which most would call the regular sensor), and the ultra-wide snapper that allows you to zoom out when you want to get more scenery, or more people, in the frame.",
    "The overall capability of these sensors has been improved though, with the wide 12MP sensor now coupled with an f/1.6 aperture for what Apple says is improved low light photography compared with 2019's iPhone 11.",
    "The results do bear out the claim – low light performance is improved a touch, for brighter shots with more detail.",
    "The main thing that impressed us with the iPhone 11 back in 2019 was Night Mode, and it's back with the iPhone 12 – plus you can now use it with both the wide and the ultrawide sensor too.",
    "Night Mode can detect when light levels are dropping, and you’ll be prompted to hold your phone still for up to 15 seconds, depending on the conditions, to brighten the photo through computational understanding over the exposure of the image.",
    "The results are genuinely startling, with shots taken in complete darkness looking as clear as day – literally. You need to get your framing right and keep the camera very still, though; you’ll find that a degree of blur will creep in if you jiggle the camera too much during the exposure.",
    "However, for the most part, and even with a small amount of motion from time to time, Night Mode brings a level of detail to night scenes that you would have scarcely thought possible.",
    "It definitely works best with the ‘main’ wide sensor though – while in our tests while we found that both could capture some shockingly bright images, Night Mode with the ultra-wide sensor produced more ‘muddy’ pics, which makes sense given it’s not as adept at shooting in low light.",
    "While Night Mode can be startling in its ability to brighten an almost pitch-black scene, though, we would have liked to see more of an upgrade this year. Rather than using it on the ultra-wide sensor, making the process speedier and sharpening the results would have been better to see.",
    "Yes, we’re being rather picky here, but given that Night Mode needs a high degree of patience to make work, it would have been nice to see this feature just made easier to use.",
    "The iPhone 12 does pack another upgrade in the form of the new Smart HDR 3 tech, which is more capable of reading particular scenes – such as those with an abundance of sky – and tweaking the photos to look their best by perhaps highlighting features in the foreground, or lightening certain areas of the scene.",
    "Combined with the main camera’s f/1.6 aperture, it does result in some brilliant snaps, especially in mixed lighting or color conditions.",
    "What’s cool is that you can see the iPhone upgrading and enhancing photos as you’re taking them, brightening and sharpening your otherwise fairly standard snaps, using the Deep Fusion capabilities in the iPhone to enhance the image, pixel by pixel (according to Apple). It’s quite heavy processing, but it does really make your photos sparkle.",
    "We were impressed with the level of detail captured in some pictures, without impacting color and sharpness of the image (even if it does feel a little slow for ‘the world’s most powerful chip in a smartphone’).",
    "The front-facing camera has been given an upgrade, with the 12MP sensor now essentially functioning in a similar way to the rear ultra-wide sensor. The f/2.2 aperture could be a touch faster in our eyes, as night shots sometimes proved harder to take, but at least you can use Night Mode on the front-facing camera too.",
    "Some of the selfies we snapped were pretty good, but some of the lower-light efforts looked grainy or washed out if we didn’t use the front-facing Retina flash to brighten things. That said, the portrait mode photos in low light were probably the most impressive of the bunch.",
    "The portrait mode on the front-facing camera seems to be more effective at finding the edges of hair this year – we didn’t spot any examples where the iPhone 12’s attempts to blur the background yielded a foggy mess around the subject.",
    "If you're a fan of video, that's also been into the shop and given a performance boost. Apple has made a huge deal about the fact that its iPhone 12 range can record video in Dolby Vision on the fly, and can also process it before displaying it in HDR (high dynamic range) quality on the display.",
    "We had a good play with the video quality in different scenarios – and our main takeaway is that Dolby Vision isn't going to be a key reason for many 'normal' folk to buy the iPhone 12.",
    "The HDR-improved results are clearer and more colorful when viewed side-by-side with their non-HDR counterparts, but the difference isn’t that marked.",
    "You're also only able to record at 30fps in 4K, so if you want to make the most of Dolby Vision you'll be better off plumping for the iPhone 12 Pro or Pro Max, which can handle it at up to 60fps, resulting in more buttery-smooth video for your home-made (or professionally-made) movies.",
    "With the iPhone 12 camera, you're left with a sense that Apple has done enough – by improving the sensor on the iPhone 12 a little here and there, the photographic results are a little more impressive, with the Night Mode upgrades in particular doing their job well.",
    "But you might not notice a massive difference in the quality levels between the iPhone 11 and 12 (if you're trying to choose between those two models, for instance); you'll get good-looking, colorful snaps, but it's the iPhone 12 Pro (and especially the 12 Pro Max) that have some of Apple’s best cameras right now before you look at the iPhone 13 range.",
    "It looks like Apple is continuing its trend of making sure the standard iPhone is packing good longevity, with the iPhone 12 seeing improvements to battery life that mean fewer trips to the charger.",
    "Apple's clearly done some work here to ensure that things aren’t quite so, well, dire when it comes to power management, and in our time with the iPhone 12 we found that it lasted well enough on a full charge, especially compared to iPhones of a few years ago. That said, it’s not another leap forward in battery life - it’s comparable to the iPhone 11 at best, and maybe a tiny bit worse.",
    "For instance, we found that we had well over 50% left in the tank when going to bed one night, and that wasn't on a particularly low-use day; however, when you add in moving around, switching between 4G and 5G networks (which a lot of us will do in the short term, at least), and turning on the phone more regularly when on the go, that battery life dropped to around 16-18 hours between charges on a high-use day.",
    "It's odd that Apple has reduced the video playback stamina on the iPhone 12 – stating that it will last 17 hours, rather than the 18 hours offered by the iPhone 11.",
    "In our video rundown test, playing a Full HD video for 90 minutes on loop, we found that the iPhone 12 only lost 8% of its battery, which is up there with some of the best battery life we've seen from an iPhone – but in day to day use we’re not seeing huge performance gains in terms of battery life.",
    "In our lab tests, we certainly saw that the iPhone 12 battery life is compromised by the addition of 5G, lasting around 15-20% less time on the faster network in our rundown test. The latest iFixit teardown test also found that the iPhone design has has to shrink the battery to make way for that 5G modem - so that addition of 5G has come at a fairly hefty cost to the longevity of the iPhone 12.",
    "The A14 Bionic chipset at the heart of the iPhone is promised to be more power-efficient than before, while still achieving some of the best performance stats of any phone on the market.",
    "The improvements to the build of Apple's engine have clearly contributed to maintaining battery life year on year, with the 5nm fabrication process used to create the chipset meaning the transistors are closer together and require less energy to function, so Apple could therefore (potentially) decrease the battery size and still maintain an adequate battery performance.",
    "If you’re going to be heavily using the iPhone 12, as in playing games and browsing the web – so basically firing up the screen and sucking down data, you’ll likely get between seven and 10 hours of use before needing to reach for the charger, which isn’t a terrible result for modern iPhones (although we still long for the day when there’s an easy 24 hours’ use no matter what task you’re running the iPhone through, as many other phones can manage).",
    "It’s not as long-lasting as the competition (as ever), but most iPhone users won’t notice a significant issue when it comes to battery life – it’s on a par with iPhones of 2-3 years ago, although not with the longevity of the iPhone XR and iPhone 11.",
    "There’s also the fact that we’re still living in a different world right now, one where we’re spending more time at home and aren’t commuting into our places of work, where we’d usually heavily use the iPhone 12.",
    "Therefore we’re taking fewer photos, listening to less music on the go, and firing up the motion sensor inside the iPhone less, which is going to have an effect on the battery life too.",
    "When it comes to charging, we'll repeat what we said earlier: you're going to (probably) need to buy a charger for your new iPhone. The cable that comes with the iPhone 12 is USB-C to Lightning, which means you probably won't have a charging block that works with it.",
    "It’s a really odd decision by Apple to switch its phones to USB-C cables before rolling out the necessary charging block. It’s a good thing to have a USB-C cable, because you’ll get faster charging to your iPhone, but only if you’ve got the right charging block, and are willing to pay $19 / £19 / AU$29 for the privilege.",
    "We tested the charging speeds on the MagSafe charger (using an 18W Anker PowerPort Atom PD 1 charger, as we didn’t have access to Apple’s 20W model), and it charged the iPhone 12 to 100% in 160 mins.",
    "After 20 mins the phone was at 28%, and it was half full after an hour, so while a MagSafe charger is good to have on the desk or bedside table for longer charging periods it’s still definitely worth having the Lightning to USB-C cable handy – both that and the MagSafe will plug into the same charging block (as the MagSafe charger also uses USB-C) so you’ll be able to juice up quicker with a physical connection.",
    "First reviewed: October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "17": "iPhone 12 release date and price",
    "23": "Design",
    "39": "Display",
    "49": "5G vs MagSafe – which is the best new feature?",
    "61": "MagSafe: what is it?",
    "72": "Camera",
    "95": "Battery life",
    "111": "Don’t buy it if..."
  },
  "links": {
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "MagSafe": "https://www.techradar.com/best/best-magsafe-accessories",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "new iPhone": "https://www.techradar.com/reviews/iphone-13",
    "proper camera": "https://www.techradar.com/news/these-magnetic-iphone-12-mounts-show-why-magsafe-is-its-biggest-camera-upgrade",
    "iPhone 4": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-4-694980/review",
    "iPhone 5": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-5-1096004/review",
    "Black Friday iPhone deals": "https://www.techradar.com/black-friday/black-friday-iphone-deals-2021",
    "directly from Apple": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7478560415083049000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fshop%2Fbuy-iphone%2Fiphone-12",
    "Motorola’s Moto Mods": "https://www.techradar.com/news/phone-and-communications/mobile-phones/moto-z-modules-motomods-1323022",
    "Apple’s standard cases": "https://www.techradar.com/best/best-iphone-12-mini-cases",
    "The latest iFixit teardown test": "https://www.ifixit.com/Teardown/iPhone+12+and+12+Pro+Teardown/137669",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review"
  }
}