{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-lite-review",
  "title": "Samsung Galaxy Tab S6 Lite review",
  "category": "tablets",
  "updated": "2021-12-05T23:33:23Z",
  "author": "tom-bedford",
  "summary": "Samsung’s most cohesive iPad rival to date",
  "verdict": "The Samsung Galaxy Tab S6 Lite is a well-rounded iPad competitor, and it’s arguably the best non-premium tablet the company has ever put out. It has strengths, from the inclusion of the S Pen to software customization options and a fairly robust and good-looking design. There are some performance issues, however, which could affect the overall user experience.",
  "pros": [
    "Robust design",
    "Plentiful UI customization options",
    "S Pen stylus included"
  ],
  "cons": [
    "Some issues with S Pen",
    "Can be a little sluggish in use",
    "Android not perfectly optimized for tablets"
  ],
  "article": [
    "It’s become something of a cliche to call every new Android slate an iPad competitor, but more so than most the Samsung Galaxy Tab S6 Lite seems like an attempt to break Apple’s stranglehold on the tablet market. From the price to the screen size and various features, the device feels very much like it’s been designed to tempt potential buyers from the iOS ecosystem to the Android tablet one.",
    "The Samsung Galaxy Tab S6 Lite is ostensibly an affordable version of the premium Tab S6, but it doesn’t actually have much in common with that tablet; instead, it seems more like a particularly accomplished member of the Galaxy Tab A line of cheap tablets.",
    "With Prime Day 2021 scheduled for June 21, we could see the Galaxy Tab S6 Lite price reduced, especially with the Tab S7 FE new on the scene - if you're looking to buy the popular S6 Lite, it might be worth waiting until then and checking out the deals.",
    "The key feature of the Galaxy Tab S6 Lite is that it comes with an S Pen stylus (it’s actually the most affordable Samsung tablet to come with a stylus) which is great for doodling, note taking and annotating. You don’t have to pay extra for it, as you do for the Apple Pencil for use with iPads, but Samsung’s stylus misses a few tricks by comparison with Apple’s stylus.",
    "The tablet feels and looks pretty durable, with smaller bezels than the Galaxy Tab A and a solid rear that feels sturdy enough to survive hard knocks. The presence of a 3.5mm headphone jack, which isn’t a guaranteed feature in tablets, will be appreciated by many too.",
    "Stylus problems aren’t the only issue the Samsung Galaxy Tab S6 Lite has – it can also be a little slow to respond, with slight delays when you’re tapping the screen or swiping, and its chipset isn’t great for playing high-end games, or other demanding tasks.",
    "Another problem is that Android, or at least Samsung’s One UI take on Android, just isn’t as good a tablet operating system as iPadOS, although there are features and perks that might make up for this, especially in the stylus department.",
    "None of this affects the Galaxy Tab S6 Lite’s usefulness as a portable entertainment machine though – its display is pretty good for a budget tablet, and it’s also got an aspect ratio that’s better for viewing content than that of many iPads. So if you’re just looking for a portable device for watching movies or TV shows, you could do a lot worse.",
    "So the Samsung Galaxy Tab S6 Lite isn’t the perfect mid-range slate, but there’s still a lot here to like, and if the features on offer here, like the S Pen, good screen and low price, appeal to you, then it’s certainly worth considering as an alternative to the entry-level iPad. If, though, you like a snappy user experience, and a stylus experience that isn’t affected by one or two annoying issues, perhaps an iPad is better for you.",
    "The Samsung Galaxy Tab S6 Lite availability is a little confusing, and it depends quite a bit on where you are. In the US the tablet isn’t available at the time of writing, but we know it’ll be released for $349 for its Wi-Fi only version, and it’s likely an LTE version will be released too. According to Samsung the device will be released ‘Q2’ of this year, which means it should be available by the end of June.",
    "In the UK the tablet is already available, priced at £349 for the Wi-Fi-only model, or £399 if you want LTE connectivity too. Both of these prices are for 64GB storage models, which is the only version available in the UK, while in Australia only 128GB slates are available, at AU$649 for Wi-Fi-only and AU$799 with Wi-Fi plus an LTE connection.",
    "In the regions where it’s available, the Samsung Galaxy Tab S6 Lite can be easily bought on the Samsung website or Amazon, as well as from certain carriers in each region for the LTE version. Some retailers offer the tablet’s ‘Book Cover’ folio case free when you buy the device, so it’s worth shopping around.",
    "The Samsung Galaxy Tab S6 Lite has a glass front with a metal frame and rear, and these materials make it feel hardy, as though it could survive being dropped a few times.",
    "The choice of materials does mean the device is a little heavy though, at 467g – for reference that’s at least twice as heavy as most smartphones. With dimensions of 244.5 x 154.3 x 7mm it’s a fairly average size given its screen diameter, and it’s certainly not laptop-sized – in fact we actually managed to fit the tablet into large pockets on certain items of clothing.",
    "A design feature that may please some is that the bezel which surrounds the screen is pretty slim, compared to those on iPads and Galaxy Tab A slates. The low screen-to-body ratio means the device has a good-size screen without feeling overly large in the hand.",
    "The back of the Galaxy Tab S6 Lite houses the rear camera in the top-left corner (if you’re holding the device in portrait orientation). There’s a 3.5mm headphone jack on the top of the device, a power button and volume rocker on the right edge, and a USB-C port on the bottom edge.",
    "Not all affordable tablets have USB-C ports, as some have micro USB, which is slower for data transfer and charging, so we’re happy to see the inclusion of it here. The audio jack will also please many users of wired headphones.",
    "The Tab S6 Lite comes in Oxford Gray, Angora Blue or Chiffon Rose colors, although not all different colors are available in every region. Our review model was Oxford Gray, as pictured.",
    "The Samsung Galaxy Tab S6 Lite comes with the S Pen stylus in the box, which is a useful addition for drawing, sketching and taking notes. Unlike the full-fat Galaxy Tab S6 there’s no there’s no slot in the body for stowing the stylus, so you have to perch it on the right edge magnetically, although if you get the Book Cover (which we tested the tablet alongside, as you can see in the images), this has a compartment for it.",
    "While the addition of an included stylus may impress some prospective buyers, and certainly changes the way you use your tablet, it’s not perfect – there are some issues, which we’ll get to later in this review.",
    "The Samsung Galaxy Tab S6 Lite has a 10.4-inch LCD screen with a 2000 x 1200 resolution. That’s only 0.1 inches smaller than the non-Lite tablet, but the lack of that slate’s higher-resolution AMOLED panel is one of the sacrifices of this budget tablet.",
    "The screen quality is pretty good for LCD – it’s nice and bright, and easy to view even when you’re outdoors, but the colors sometimes look a bit washed-out compared to displays on other devices, and when we were playing games or watching films the low resolution was sometimes noticeable.",
    "Saying that, depending on the streaming services you watch content on, or your subscription package, this resolution may be all you need, and only those with access to 4K content may find the tablet misses the mark.",
    "In addition, the 5:3 aspect ratio is just a step off 16:9 (it’s 15:9 to be precise), which is the aspect ratio lots of TV shows and streaming movies are broadcast in. This means that when you’re watching content you don’t have prominent black bars at the top and bottom of the screen, as you’ll find on iPads, which tend to have 4:3 displays.",
    "Because of the LCD display tech, the screen shows black as quite bright, which is because LCD creates the shade by displaying all the colors at once, unlike LED panels which simply turn off the LED to get black. The result is that when you’re looking at something dark, for example if you’re using Android 10’s dark mode, the display still appears bright, which isn’t as relaxing for your eyes, and doesn’t seem to save battery much either. This is a problem the Tab S6 Lite has in common with all LCD devices though.",
    "When swiping the screen with the S Pen or a finger we noticed that the screen was a little less responsive than other tablets; it felt like there was more friction or resistance. It’s not exactly clear why this is the case, but it’s likely down to the materials used for the screen or any films applied over the top – either way, it was a bit of a nuisance when swiping to navigate or drawing with the S Pen.",
    "We eventually got used to this, but when using the device alongside an iPad with an Apple Pencil the issue is rather noticeable. Our main S Pen issue, though, was with palm detection. On iPads, when the Apple Pencil is in use the device can detect whether the Apple Pencil, your finger or the palm of your hand is touching the screen, and ignores inputs from the latter – this means you can rest your palm on the screen when you’re sketching or writing.",
    "If you rest your palm on the Galaxy Tab S6 Lite’s display when using the S Pen, however, the device thinks it’s a separate input, and responds accordingly – so you can accidentally draw a line, or change the cropping of a screenshot, or even start navigating the phone by swiping and opening apps. If Samsung wants to offer the best stylus experience on its tablets, it really needs to develop some palm detection technology.",
    "The Samsung Galaxy Tab S6 Lite runs on the Exynos 9611 chipset, made by Samsung itself, which we’ve previously seen in a number of mid-range and affordable phones like the Galaxy A51 and Galaxy A50s. This is paired with 4GB RAM.",
    "The Exynos 9611 isn’t a powerful chipset, but it’s fine if you’re not doing anything too demanding. We found that lower-end and well-optimized games ran smoothly on the device, so we could get through Call of Duty: Mobile matches, but games that were too demanding would be laggy, or frequently crashed the device – PUBG Mobile met this fate just minutes into a match.",
    "The main issue performance-wise is with navigation speed, as there’s a slight delay when swiping between menus, tapping on the screen to type, or opening a new app. Anyone who’s used lower-end tablets or phones will be used to this, as it’s just a symptom of middling specs, but the Galaxy Tab can be a little frustrating to use at times as a result, and, crucially the lower-end iPads don’t have this problem.",
    "This wasn’t a constant nuisance, as the issue only really reared its head when loads of background functions were running or apps were being downloaded, but you’ll never find the Galaxy Tab S6 Lite as snappy to navigate as an iPad.",
    "When we put the Tab S6 Lite through a benchmark test it returned a multi-core score of 1,313 – less than half the Galaxy S20’s 3,061. That’s a pretty low score, and although we don’t have any other tablet scores to compare it to (given that Geekbench, the testing program we used, changed its scoring system in late 2019), we can compare it to smartphones.",
    "The Tab S6 Lite’s speeds only really beat out some super-low-end competition from the likes of Redmi (its Note 8T got 1,158), and even lost to mid-range phones like the Oppo Reno 2Z (1,482). All in all, the Tab S6 Lite’s performance here was pretty poor, which explains games crashing and slow navigation.",
    "As we’ve mentioned, navigation can be on the slow side, and the most obvious sign of this was the face recognition unlocking, which rarely worked before we’d had time to type our password in anyway – and it doesn’t help that you need to hold the tablet unnaturally far from your face in order for this to work.",
    "On the subject of the cameras, the rear snapper is 8MP. It’s unlikely you’ll be doing much photography with this instead of your smartphone, and that’s a good thing, as pictures did look a little dim (and grainy if you made the most of the 10x digital zoom), although not appallingly so.",
    "On the front is a 5MP snapper, which will likely see more use if you do frequent video calls or take selfies. While the hardware is good but not great, the amount of different modes available for selfies will be a pleasant surprise for many.",
    "There’s Live Focus mode, which lets you edit the background of a picture once you’ve taken it, AR Doodle, which lets you use the S Pen to draw over your face in real time, and filter and beauty options too.",
    "There’s also 1080p video recording, both on the rear and front cameras.",
    "The Samsung Galaxy Tab S6 Lite runs Android 10 with Samsung’s One UI laid over the top. This mainly brings a change to the appearance of ‘stock’ Android, although as with all Android forks there are some other changes too.",
    "For example, in One UI all downloaded apps get sent into an app drawer instead of onto the main home page, which makes it easier to customize your homepage by only putting certain apps on it. Samsung devices also have a range of useful widgets that you can put on your tablet’s home pages, like weather, Spotify controls and email previews, so all in all One UI gives you more customization options than most other Android forks.",
    "While One UI’s features work well on tablets, Google has been struggling for years to create a decent tablet operating system, and Android itself still doesn’t work as well on slates as Apple’s iPadOS does. The swipe-down control menu is better laid out in iPadOS, with fewer unhelpful options, and it’s easier to search the device too.",
    "Android tablets to date have typically come up a little short compared to iPads in terms of the user experience, and that’s the case here. There are few unique features to make the tablet experience distinct from a ‘big smartphone’ one, as there are in iPadOS, despite One UI being pretty useful.",
    "On the plus side there are some pretty neat S Pen tricks that are fun to use, all of which are easily accessible from the home screen thanks to a small icon that pops up to the side when the tablet detects that the pen is in use, or via a button on the stylus itself.",
    "These include Create Note, which brings up a small window you can scribble onto, Screen Write, which lets you take a screenshot and annotate it, and AR Doodle, which we’ve already mentioned. The former of these we found especially useful, for making notes on documents we were sent, creating shopping lists when we searched the web for recipes, and creating to-do lists based on messages we received.",
    "Depending on your line of work, these S Pen features may really help your productivity, although as we’ve previously mentioned the lack of palm detection detracts from the experience. It’s also worth adding that the lack of an optional keyboard peripheral at the time of writing (unless you opt for a third-party Bluetooth alternative) means that writing anything longer than a quick note requires you to use the on-screen keyboard, which isn’t as natural to use as a physical one.",
    "We initially planned to write this review on the device itself, but balked at the idea of using the keyboard, with its slight touch delay, for a long-form article.",
    "The Samsung Galaxy Tab S6 Lite is powered by a 7,040mAh battery, which is fairly standard for a tablet of this size – the iPad 10.2’s is a touch bigger, but barely so.",
    "We were impressed by the device’s battery life, as it easily lasted through a day of typical use (by which we mean, watching an hour or so of YouTube video, playing the odd game here and there, and replying to social media messages when needed).",
    "Even when it came to more demanding tasks, like long video calls, we never worried about the impact these would have on the battery life.",
    "Unlike a smartphone, and as with most tablets, the Samsung Galaxy Tab S6 Lite isn’t a device that you feel you have to charge daily to keep it ticking along, unless you’re really pushing it to its limits.",
    "The Tab S6 Lite supports 15W fast charging, which would be on the slow side even for a smartphone, but given the tablet’s power pack is twice the size of those in most handsets, it can take a long time to power-up the device.",
    "This isn’t the kind of device you can just plug in for a quick burst of power here and there, and we found it more natural to charge the device while we used it, rather than plugging it in somewhere and forgetting about it while it powered up.",
    "You might also want to check out the ReMarkable 2 tablet review."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Samsung Galaxy Tab S6 Lite price and availability",
    "12": "Design",
    "20": "Display",
    "28": "Specs, performance and camera",
    "39": "Software",
    "47": "Battery life",
    "53": "Don't buy it if"
  },
  "links": {
    "iPad": "https://www.techradar.com/reviews/ipad-102",
    "Tab S6": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-review",
    "Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "iPadOS": "https://www.techradar.com/news/ipados-release-date-and-news",
    "Samsung website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2173774300649612500&xs=1&url=https%3A%2F%2Fwww.samsung.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsamsung-galaxy-tab-s6-lite-review",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5967868538953735000-20",
    "ReMarkable 2 tablet": "https://www.techradar.com/reviews/remarkable-2-tablet"
  }
}