{
  "source": "https://www.techradar.com/reviews/jmgo-01-ultra-short-throw-projector",
  "title": "JMGO O1 Ultra-short Throw Projector review",
  "category": "audio-visual",
  "updated": "2021-10-14T09:27:43Z",
  "author": "mark-pickavance",
  "summary": "A projector that needs little space",
  "verdict": "The basic functionality of the JMGO O1 is excellent and addresses the classic issues associated with projectors. However, the Android installation has problems and makes using an additonal streaming device a necessity.",
  "pros": [
    "Cheap for ultra-short throw",
    "Low latency for gaming",
    "Bluetooth remote"
  ],
  "cons": [
    "Android app store isn’t Google’s",
    "Lacks Netflix Grade 1 certification",
    "Only 800 ANSI lumens bright"
  ],
  "article": [
    "Video projectors have a number of well-documented issues. The most obvious of which is that to get a big enough display requires the projector to be behind the viewer, allowing the images to be obscured by anything that passes before them.",
    "While mounting the projector to the ceiling helps, the best solution is an ultra-short throw design where the projector sits very close to the wall but still generates a large image.",
    "Ideally, all projectors should be of this type, but the complex optics and precision parts make it unrealistic for cheaper designs.",
    "What customers would like is an ultra-short throw design that doesn’t cost thousands, much like the JMGO O1 we’re reviewing today.",
    "Is this Indiegogo sold device the answer to those that don’t want a giant TV dominating their living space or only part of the solution?",
    "Available through the crowdfunding portal Indiegogo for $699. It supposedly originally was going to cost $1,165, according to JMGO, but it costs less than that now. That translates into 5,423 HKD (Hong Kong Dollars), or £512 UKP, but those prices might not include shipping to your specific global location.",
    "Where conventional projectors have coalesced designs towards what most people expect to see from a video projector, ultra-short throw hardware hasn’t yet reached that consensus.",
    "The JMGO O1 is a very odd-looking device that looks a bit like a space-age memory foam pillow, where the user-facing side is silver, and the wall facing end is an off-white colour.",
    "It’s about the size of a conventional projector, being 31cm wide, 24cm deep and 10cm high. Weighing just 2.3kg, it’s light enough to easily mount to a ceiling without needing structural modifications.",
    "The DLP projection, as this design doesn’t use lasers, is generated in a slot recessed into the top, and strangely the only time you’ll be aware of this is when you got to turn it off using the top-mounted power button, as you will break the beam doing so.",
    "That power button placement makes little sense, and where all the ports are in this design wasn’t given much thought either.",
    "All of the ports are facing the wall, including all the USB ports. It would have been better to have those facing the user, so users could more easily insert and remove local storage.",
    "That aspect could be better, but the usability of the O1 is enhanced by a high-quality remote control included with the projector. Its design is heavily Apple influenced, and because it uses Bluetooth to connect its reliable and works even if it isn’t pointed directly at the 01.",
    "When the projector powers up, it initially projects a basic but workable interface that provides access to the most commonly used features. It enables the user to install and run apps, access contents from USB connected storage or watch HDMI content from a streaming device, Blu-ray player or games console.",
    "For optimising the O1, a settings page provides a means to select the input, adjust the scale and keystone of the projection and a dozen other tweaks. There is even a low-latency mode designed to give gamers the best experience if they’re playing timing-sensitive titles.",
    "We didn’t see anything unexpected in the menu structure, but equally, there wasn’t anything significant missing. The O1 provides the same functionality that we’ve seen from many modern projector designs, but with the added capability to be used extremely close to the projection wall.",
    "JMGO doesn’t provide much information about the internals of the O1, but we managed to dig out a few interesting details. The platform SoC is a quad-core MediaTek MT9669 processor, sporting 3GB of RAM and 16GB of internal storage.",
    "That’s a decent amount of memory for Android and makes for generally a smooth experience when navigating between features.",
    "MediaTek made the MT9669 specifically for video processing, and its MALI-G52 MC1 GPU can decode AVS, AVS2, H.264, H.265 / HEVC, VP-9, AV1 and SHVC 4K60@10bit all in hardware. Audio support for Dolby Atmos and DTS Virtual X is also inherent.",
    "And, while the maximum native resolution of the 01 is 1080p, the SoC can take 4K streams and files and downsample them to 1080p for projection.",
    "Where this design compares a little less favourably to its more expensive peers is that it only has a maximum brightness of 800 lumens. That’s not a level that works well in locations with significant ambient light, and even in a room with blinds, it can be difficult to see details in dark scenes.",
    "At night this should be less of an issue, but the O1 shouldn’t be considered for any location where external illumination could be an issue.",
    "To produce an 80-inch display, a separation of just 10 inches from the wall is required, avoiding the need for a table of significant depth to be used.",
    "The LED bulb has a working life of 45,000 hours, and we didn’t see any obvious way to replace it should it fail. That timescale represents 8 hours a day for fifteen years, making the lack of replacement less of an issue.",
    "One aspect of the O1 that surprised us was the sound system, often a part of projector technology that is overlooked. Internally mounted Dynaudio stereo speakers generate clear and vibrant sound with significantly more bass than we ever expected.",
    "The user experience of the O1 was a mixed one initially, as the firmware on the review machine had several problems that, even after an update, we failed to get fully resolved.",
    "Our hardware was running a variant of Android with an interface called Luna OS, but it's sufficiently close to Android that it can run binaries designed for that platform.",
    "We assume that many of the issues we encountered were down to this Chinese app service, since it appeared to be attempting to connect to servers that aren’t accessible in the West.",
    "The upshot of these issues was that the apps presented on the app store wouldn’t download or install whatever we tried.",
    "It is entirely possible to side-load APK files using a USB memory stick, and we did this successfully to add some test apps, but that won’t keep them maintained like a proper store.",
    "One of the obvious choices for this type of installation is Netflix, but we’d recommend against trying this. JMGO’s FAQ states that “Netflix does not work due to its licensing restriction, even for mirroring.” Not sure if that is technically correct, but it might well be that this hardware doesn’t have the certifications needed to show streamed content in HD resolutions.",
    "What the makers recommend, and we agree, is that the best way to watch streamed content is with a Chromecast or Fire TV stick, since these are certified and streaming from them works well.",
    "You install the VLC application by side-loading it from a USB flash drive and use its enhanced ability to present video files from attached storage. But if you don’t use that feature, then the Android aspect of this device is mostly defunct.",
    "Sending content from a phone or tablet is achieved using Airplay for iOS and EShare for Android hardware. We’d of preferred conventional casting, but these options do work.",
    "The original specification also promised to have inbuilt Alexa functionality, but JMGO informed us that this currently doesn’t work, but an update will add it at some point.",
    "These snags take some of the shine off this device, but many of the limitations can be circumvented by the minor additional expense of a Chromecast or similar gizmo.",
    "There are parts of this projector that we thought were great and others that need some work to reach the necessary polish that retail products should have by default.",
    "It’s also worth considering that JMGO also makes a 01 Pro model that appears to address many of the limitations that hold back the original 01, such as the brightness of the LED.",
    "How useful the O1 is to you will be entirely based on how you intend to use it. Because without other hardware, trying to use it for streaming services is likely to disappoint the buyer. The lack of inherent app support and SD quality streaming undermine the potential of this hardware.",
    "However, if you combine the O1 with a Google Chromecast, Amazon Fire TV stick, any recent Roku box, or a games console and it becomes an entirely different proposition.",
    "It produces sharp and mildly over-saturated images, punchy sounds, and a large screen for only a remarkably short distance from the projection surface.",
    "Due to the relatively low lumen value of 800, we’d strongly recommend buying a projection screen for the O1, as you need the maximum reflective bounce. But conversely, the blacks in dark scenes rarely become grey due to light bleed from more strongly illuminated areas,",
    "For those that want to use the USB ports for media playback the internal media player doesn’t have the codec support you need, but simply installing the VLC player resolves these issues.",
    "It is possible to stream content from local NAS servers, but the O1 doesn’t have any mechanism for two-factor authentication if you use that to protect against unwanted browsing of the contents. Again, there are ways around this, but they’re only for the technically able.",
    "Overall, the JMGO O1 is an interesting piece of projection technology that looks like it was a prototype for the O1 Pro model. But, a significant number of these wrinkles should have been resolved before launch.",
    "Hopefully, JMGO will address these limitations and make the O1 a device worth owning."
  ],
  "headers": {
    "5": "Price and availability",
    "6": "Design",
    "16": "Hardware",
    "25": "In Use",
    "36": "Final verdict"
  },
  "links": {}
}