{
  "source": "https://www.techradar.com/reviews/poly-sync-20-speakerphone",
  "title": "Poly Sync 20 speakerphone review",
  "category": "computing",
  "updated": "2021-10-25T15:59:09Z",
  "author": "joel-khalili",
  "summary": "A nifty little speakerphone, but who is it really for?",
  "verdict": "The Poly Sync 20 is a capable little speakerphone for anyone looking to improve upon the basic audio and microphone quality provided by their laptop. It has a smart design, multiple connectivity options and no dearth of extra features. However, we question why you wouldn’t just opt for a decent headset instead.",
  "pros": [
    "Superior audio and mic than most laptops provide",
    "Strong battery life",
    "Smart aesthetic",
    "Multiple connectivity options"
  ],
  "cons": [
    "Limited use cases",
    "Not excellent for music",
    "A few unwelcome quirks"
  ],
  "article": [
    "The Sync 20 speakerphone from Poly is part of a new range of products designed to cater to the needs of remote and hybrid workers, marking a slight change in direction for the AV hardware firm.",
    "The main purpose of the device is to provide anyone working from a laptop with a way to improve their audio and microphone quality for calls and video conferences. In this respect, the Sync 20 delivers on its promise.",
    "It’s also small, lightweight and easy on the eye, and the company has clearly made an effort to squeeze in a number of additional features (such as a port for phone charging, which means you can essentially use the device as an emergency power bank).",
    "However, a rather large question hangs over the Sync 20: who is it actually for? Although plenty of people are working from home using mid-range laptops with poor speakers, we’d wager that those that care enough about audio quality will already have a capable speaker setup and use a headset (or webcam and microphone combo) for calls.",
    "Further, we’re confused about the emphasis Poly has placed on portability. The carry case that comes bundled with the speakerphone is nice, but we’re struggling to imagine a scenario whereby we’d want to take the Sync 20 out and about.",
    "All this means the device is aimed at a rather limited pool of potential users, filling a small gap in the market somewhere between a consumer-facing wireless speaker, a business headset and a regular computer speaker system.",
    "The Poly Sync 20 comes in a number of different models, which can be difficult to distinguish at first glance. The base Poly Sync 20 differs from the Poly Sync 20+, which comes with a Bluetooth dongle, and these two device categories are divided again into models with either USB-A or USB-C cables.",
    "To complicate matters further, Poly offers special Microsoft Teams versions of both the Sync 20 and Sync 20+, both with either USB-A or USB-C connectivity. This makes for a total of eight different SKUs.",
    "The Poly Sync 20 can be purchased from the official Poly store at a price of $169.95/£161.95. However, bargain hunters will currently find the USB-A version on Amazon for considerably less, at $139.99/£107.79.",
    "The Poly Sync 20+ is slightly more expensive, at $199.95/£202.95 directly from Poly, or $144.24/£138.77 on Amazon.",
    "Whichever package you go for will come with the speakerphone itself, a nice little carry case and, for some reason, a lanyard. If you go for the Sync 20+, you’ll also get the BT600 Bluetooth dongle.",
    "When it comes to design, we have no major complaints about the Poly Sync 20. The combination of grey mesh, black trimming and speckled white plastic underside makes for a device that will look good on most desks.",
    "We were also impressed with Poly’s cable management solution. If the Sync 20 is connected to your device via Bluetooth, the cable can be wrapped neatly into a groove on the underside of the device, and the USB head clipped into a handy receptacle. This means the cable is practically invisible when the Sync 20 is returned to its upright position.",
    "On the front panel, the touch buttons (one of which is programmable) are legible and positioned in such a way that you’re unlikely to make accidental mis-selections. And tucked away on the right side are physical on/off and Bluetooth pairing buttons, as well as a USB-A port for phone charging.",
    "Poly has also taken plenty of care to ensure the Sync 20 is extremely light (360g) and small (less than 20cm wide), and can therefore be transported easily using the case provided.",
    "However, beyond shifting the device from room to room to accommodate a flatmate or family member, it’s difficult to imagine a scenario in which portability will prove all that useful. Owners are unlikely to take the Sync 20 to an office or coffee shop, where it would be impolite to play meeting audio out loud, and much more likely to keep it on their desk at home",
    "Poly has gone out of its way to pack as many extra features as possible into this diminutive device, some of which add real value and some of which feel a little tacked on.",
    "For example, the USB-A port for device charging is a nice touch, meaning you can effectively use the Sync 20 as an emergency power bank (provided the device’s own battery is at medium or higher).",
    "And while the device functions perfectly well without additional software installed, the Poly Sync and Plantronics Hub desktop apps provide a simple way to tune the Sync 20 to your preferences. For example, you can tweak the level of bass or configure the Rocket button to play/pause media, provide a device status update and more.",
    "On the other hand, the dedicated Microsoft Teams button (which only features on some Sync 20 models) seems to serve no other purpose than to bring you back to your open Teams window. A simple Alt + Tab is faster than reaching across your desk.",
    "Further, while it’s handy that the Sync 20 announces when it has connected to and disconnected from a device, and when it has powered down, the volume is set way too high, which can be rather startling if you’re not ready for it. It’s also unclear why the speakerphone isn’t configured to power down automatically as soon as all devices are unlinked.",
    "Although the BT600 Bluetooth dongle that comes with the Sync 20 is the same one that comes with various other Poly products, a single dongle cannot tether to multiple devices at once. This means that if you want to switch between the Sync 20 and a Poly headset, you’ll need multiple dongles plugged into your PC or laptop.",
    "There’s no denying the Poly Sync 20 offers superior audio performance to most business laptops, which means owners will benefit from clearer and richer audio during video calls. Those that struggle with minor hearing impairments will also find the speakerphone is loud enough to make calls a little easier.",
    "The Sync 20 was able to pick up our voice perfectly well from further away than the two meters cited in the documentation and there was no discernible echo. We also found the 3200 mAH battery roughly delivered on the promised 20-hour battery life.",
    "However, we encountered a few unwelcome quirks when testing the speakerphone across multiple video conferencing and collaboration services. Poly says the device is certified for pretty much all the major platforms, but we found that only the volume buttons work reliably on applications other than Teams.",
    "Despite downloading the latest updates for both the Bluetooth dongle and Sync 20, we also found the device doesn’t always play nice with Windows. For example, if you try to turn the volume up or down using the taskbar volume controls or FN commands, the volume bar jitters back and forth in a strange fashion. It’s not a massive problem, but it does compromise the user experience somewhat.",
    "Finally, it’s worth noting that the Sync 20 does not excel when it comes to playing music, even if this isn’t its primary purpose. The speakerphone can deal with ambient tracks played at lower volumes, but at higher volumes and when asked to handle more demanding bass, the Sync 20 falters. So if you were thinking of using this speakerphone as a replacement for a traditional speaker set-up, it’s probably best to think again.",
    "While the Poly Sync 20 will fill a niche for people who prefer not to work or attend meetings with a headset on, the lack of versatility makes it a difficult device to recommend to a wider audience.",
    "The audio and microphone quality are solid enough for video conferencing, but the Sync 20 doesn’t stand up particularly well if you want to play music. And while the smart aesthetic and small footprint allow the speakerphone to sit tidily on your desk, and there are a few handy features, performance quirks detract from the experience.",
    "However, the Sync 20 cannot be accused of failing to deliver on its core promises. If all you need is a small and relatively affordable speakerphone for the home office, you could do worse."
  ],
  "headers": {
    "6": "Price and availability",
    "11": "Design",
    "16": "Features",
    "22": "Performance",
    "27": "Final verdict"
  },
  "links": {
    "hybrid workers": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "video conferences": "https://www.techradar.com/best/best-video-conferencing-software",
    "power bank": "https://www.techradar.com/news/top-portable-chargers",
    "webcam": "https://www.techradar.com/best/best-business-webcams",
    "microphone": "https://www.techradar.com/best/the-best-usb-microphones-2020-the-best-standalone-mics-you-can-buy-today",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "business headset": "https://www.techradar.com/news/best-business-headphones-and-earphones",
    "computer speaker system": "https://www.techradar.com/news/best-computer-speakers",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "official Poly store": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1305965843175218700&xs=1&url=https%3A%2F%2Fwww.poly.com%2Fus%2Fen%2Fproducts%2Fphones%2Fsync%2Fsync-20&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpoly-sync-20-speakerphone",
    "$139.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FPoly-Bluetooth-Wireless-Conference-Phone%2Fdp%2FB08QRCDL76%2Fref%3Dsr_1_4%3Fdchild%3D1%26keywords%3Dpoly%2B20%2Bsync%26qid%3D1634745170%26qsid%3D139-1086115-8726936%26sr%3D8-4%26sres%3DB08M5LWZD3%252CB08QRCDL76%252CB08XBCPX7N%252CB08MTJQSNS%252CB08TF9Z22X%252CB08M5Y8CBX%252CB0899S421T%252CB09666DZMB%252CB07PGKLS1J%252CB00K2RQ94C%252CB07DFQWGYB%252CB07TD94TQF%252CB07YGZL8XF%252CB00DQ5NU76%252CB01H2RBQUG%252CB0775KZTHC%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3258783251207465500-20",
    "£107.79": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fs%3Fk%3Dpoly%2B20%2Bsync%26ref%3Dnb_sb_noss_1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1366376548577880800-21",
    "$199.95/£202.95": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1316828428440224300&xs=1&url=https%3A%2F%2Fwww.poly.com%2Fus%2Fen%2Fproducts%2Fphones%2Fsync%2Fsync-20&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpoly-sync-20-speakerphone",
    "$144.24": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FPoly-USB-Speakerphone-Plantronics-Smartphones%2Fdp%2FB08M5LWZD3%2Fref%3Dsr_1_3%3Fdchild%3D1%26keywords%3DPoly%2BSync%2B20%252B%26qid%3D1634832797%26qsid%3D139-1086115-8726936%26sr%3D8-3%26sres%3DB08M5LWZD3%252CB08QRCDL76%252CB08MT95CHY%252CB08TF9Z22X%252CB08M5Y8CBX%252CB08XBCPX7N%252CB09666DZMB%252CB07WNK4PHW%252CB08TLVZ1VX%252CB08CY2H5BM%252CB08TQZVLR3%252CB083XYYFLQ%252CB0899S421T%252CB08VL5S148%252CB08NPGNMV8%252CB07YLHNZV4%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2326596626407557600-20",
    "£138.77": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FPlantronics-216867-01-Sync-Sy20-m-bt600%2Fdp%2FB08M5Y8CBX%2Fref%3Dsr_1_1_sspa%3Fdchild%3D1%26keywords%3DPoly%2BSync%2B20%252B%26qid%3D1634832690%26sr%3D8-1-spons%26psc%3D1%26spLa%3DZW5jcnlwdGVkUXVhbGlmaWVyPUEzS0NYUkhFSDNRVDI2JmVuY3J5cHRlZElkPUEwODAwMzYyMVBVUTU3SEMyS0xWRCZlbmNyeXB0ZWRBZElkPUEwOTI2ODE5Q1NFWjBKUU4zQzNYJndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ%253D%253D%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-5694128139520702000-21",
    "collaboration services": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}