{
  "source": "https://www.techradar.com/reviews/simplisafe",
  "title": "SimpliSafe security system review",
  "category": "computing",
  "updated": "2021-08-26T06:43:55Z",
  "author": "jim-hill",
  "summary": "An affordable DIY home security system that’s a cinch to set up",
  "verdict": "SimpliSafe is the ideal solution for the renter, homeowner or homeworker looking to protect their property on a limited budget. The simple and elegant smart security devices included in each package are easy to install yourself, while the excellent app makes it possible to monitor the system yourself too. With or without the professional monitoring subscription, SimpliSafe offers a strong first line of defence for your home or home office.",
  "pros": [
    "Discrete and attractive devices",
    "No contract and long 60-day trial period",
    "Easy DIY install — no drilling or wires",
    "Self-monitoring available"
  ],
  "cons": [
    "Fewer features than rivals like Vivint",
    "No home automation features",
    "No touchscreen panel included"
  ],
  "article": [
    "SimpliSafe is a monitored smart security solution that doesn’t require a professional installation, contract or even a monthly subscription if you choose to do the monitoring yourself. A variety of packages are available catering to anything from a small apartment to a home office, or a small to medium sized business.",
    "The Boston based company was launched in 2009 by two Harvard graduates who set out to provide protection for renters after their friend’s apartment was burgled. With the traditional monitored security brands being both too expensive and only dealing with homeowners, they found a gap in the market for their streamlined equipment and flexible pricing. SimpliSafe now employs around 1,300 people and covers both the US and UK.",
    "SimpliSafe’s all-in-one systems are characterized by a sleek and discrete design, which is completely wireless and particularly easy to install. The packages can be adapted to suit your property and the cost can be considerably lower than the competition if you choose to self install and self monitor. Professional monitoring is available for a monthly fee and even this has two price tiers and no contact commitment.",
    "SimpliSafe is able to offer more affordable and flexible prices than its competition thanks to its simple wireless equipment that doesn’t require professional installation. However, technophobes will be relived to hear that SimpliSafe can send a professional to install it for you for a fee of $79. The entry-level package called The Foundation costs just $229 and includes everything you need to secure a small apartment. The top-end package costing $489 is called The Haven and adds further sensors and cameras to cover a larger premises.",
    "You don’t have to pay for a subscription, but SimpliSafe will professionally monitor your security system for $14.99 per month for what it calls the Standard Plan. This means you’ll have professionals based in monitoring centers ready to respond 24/7 when your alarm is triggered, so that you don’t need to do anything. Unlike the traditional brands like ADT who have their own monitoring stations, SimpliSafe outsources to COPS Monitoring, but the level of service should be the same. If you pay $24.99 for the Interactive Plan then you will have more control over your system via the SimpliSafe app..",
    "You can expect a 20% discount on the cost of the hardware if you do take out a professional monitoring plan, reducing the overall cost. SimpliSafe is also very generous in its returns policy, allowing a full 60 days trial period",
    "SimpliSafe offers all of the key features you would expect from a traditional monitored security system with smart sensors, alarms, cameras and a control panel. It is a little more basic than some, offering fewer devices and features than many of its rivals. Vivint, for example has more cameras to choose from and selection of home automation products.",
    "The Foundation package is SimpliSafe’s most basic offering and includes a single door/window sensor, a motion sensor, a base station and wall-mountable keypad. When either of the sensors is triggered, the base station alerts the monitoring team and sends a message to your phone while sounding a loud 95dB siren. The base station communicates wirelessly by cellular so it’s no problem if your wi-fi goes down. And it’s powered by a battery that can last almost a decade in case you loose mains power too.",
    "The keypad for arming and disarming the system can be located near the doorway. If an intruder manages to disable the keypad by smashing it, the alarm will still sound because the brains of the system are housed in the base station which can be concealed. The lights in the base station actually dim in the event of an attack so that it cannot be found too easily.",
    "You can also control the system by the SimpliSafe app for iOS or Android. You will need to subscribe to the Interactive Plan to be able to access all of the system’s features via your smartphone, but these include viewing and saving video from the security cameras, controlling all of your connected devices and setting the alarm. The system is compatible with other smart devices and Amazon Alexa and Google Assistant so you can even use your voice to arm the system. You cannot disarm the system with your voice, so you won’t turn it off by accident.",
    "You can choose one of the more comprehensive packages to protect larger premises or add further devices to add functionality. There’s a key fob, for instance, that has a panic button built into it and another that can be located under a desk. Press this and the alarm is raised without sounding the siren in the base station. And if you are actually being threatened by an intruder and forced into disarming your system you can key in what’s called a Duress PIN. This code, known only to you, will send a covert signal to the authorities.",
    "There are more sensors available for detecting water, smoke, temperature, and glass breaking that can be added at any time, so it’s possible to expand your security system as your household or business grows. There are both indoor and outdoor cameras available with HD resolution, night vision and two-way audio. They are smart enough to tell the difference between a pet and a human too. After all, SimpliSafe is as keen to avoid false alarms as you are. There’s also an auxiliary siren, but there are a few things missing from SimpliSafe’s list.",
    "There is no touchscreen for instance, and no home automation products, though the system is compatible with many third party devices.",
    "Additionally, while SimpliSafe offers both a smart doorbell or smartlock across North America, these features are unavailable outside of this area.",
    "You can monitor your SimpliSafe system yourself, but for added peace of mind, the 24/7 professional monitoring service, provided by an organisation called COPS Monitoring, is also competitively priced. For a starting price of $14.99 per month, a team of professionals will be ready to react to your alarm by messaging you and contacting the first responders if necessary. By adding Video Verification to your monitoring plan, SimpliSafe is able to verify the alarm and send in the police faster. The police will be glad of the video evidence captured by your cameras.",
    "It’s not just break-ins that are monitored. Trained professionals are also looking out for floods, fires and leaks at your property and will react accordingly. Monitoring staff will contact you when trouble is detected and remain on the line until the problem is solved. The more expensive monitoring option is called the Interactive Plan and costs $24.99/month. It allows you to view and store video from your cameras as well as enabling more control of the system via the SimpliSafe app.",
    "SimpliSafe’s customer support is also well regarded with positive reviews by Google, Amazon and the BBB (Better Business Bureau). You can contact them by phone or Email and expect a timely reply.",
    "SimpliSafe represents a more affordable alternative to the traditional monitored security solutions from the likes of ADT, Brinks Home and Guardian Protection. It does not yet have the experience and reputation of those long established brands, but it has a similar reach and level of service. With its more affordable and entirely wireless hardware, SimpliSafe costs far less to buy and install, especially if you do the installation yourself. And unlike with ADT, you own and keep the equipment. It also comes with significantly lower monthly monitoring costs than any of the three traditional security brands while providing the same 24/7 professional monitoring. What you’re not getting with SimpliSafe as are with ADT, is award-winning monitoring and a distinctive bell box to fix to your property.",
    "Vivint is another relatively new company, providing monitored smart home security packages comprising similar wireless devices to SimpliSafe. Vivint’s hardware is a little more sophisticated and includes home automation products. It also insists on professional installation and a monthly subscription so it will always supply a more expensive quote. Vivint’s cheapest subscription costs more than SimpliSafe’s most expensive. Frontpoint is perhaps the closest competitor because it sells similar security devices and also allows DIY installation and self monitoring. This makes them very close in cost too. Both systems are very easy to install and would suit renters as well as houses and small offices.",
    "If you need to secure an apartment, home or small office, SimpliSafe has a package to suit your needs. The attraction is primarily price and the fact that its simple and elegant wireless devices are so easy to self install and relocate when required. The hardware actually looks a little insubstantial compared to more expensive offerings by Vivint and ADT and its monitoring service hasn’t won so many awards, but SimpliSafe’s system has been highly praised in reviews and it certainly works. With the base unit running on a battery that lasts almost a decade and communicating by cellular to a professional response team, you can relax in the knowledge that you have genuine monitored security.",
    "With no professional installation required, no contractual obligation and a long 60-day money-back trial period, it’s worth giving SimpliSafe a try. For the renters, homeowners and home workers with a limited budget for security, we can heartily recommend SimpliSafe as the first step toward protecting your property, be that with or without the monthly monitoring.",
    "We usually like to get hands-on when it comes to testing, but in this case, calling in and installing each security system was just not at all practical. Instead, we compared every aspect of the ten biggest names in home and business security and awarded scores within a range of comparable parameters. Totting up the totals, while taking into account the various costs (and hidden costs) provided our overall ratings. However, choosing your own security solution is going to depend on your situation, which is unique to you, so please read the full reviews before making a decision.",
    "SimpliSafe gives you the option to self monitor and the app makes it very easy to check in on your security cameras and receive notifications from your other sensors. If there is an incident, you can call the emergency services yourself. However, what if you’re asleep, or you just miss the message? SimpliSafe outsources its monitoring to COPS Monitoring, which will not miss a thing. With around the clock monitoring by professionals, you really can leave the security up to them. Perhaps the best thing about SimpliSafe is the way you can choose as you go. There’s no binding contract, so you could just pay for monitoring over the months you’re on holiday.",
    "Yes. Although SimpliSafe was originally conceived as a way for renters in apartments to get monitored security, there are various packages which would also suit home workers and small business. The very flexible nature of SimpliSafe’s packages and payment plans make it ideal for a small business that may be growing and changing. With no screws or wires, it’s easy to move the devices around to suit a change of layout or address.",
    "No, but it is not vulnerable to that kind of robbery. When intruders crash through the door and immediately try to disarm the alarm by smashing it, they are usually looking for the control panel that contains the siren and main electronics. With SimpliSafe, the keypad by the door is just a keypad and the siren and brains of the system are housed in a base unit that can be hidden away. The base unit actually darkens during a robbery."
  ],
  "headers": {
    "3": "Plans and pricing",
    "6": "Features",
    "14": "Support",
    "17": "The competition",
    "19": "Final verdict",
    "21": "How we reviewed",
    "22": "Should I pay for professional monitoring, or can I do it myself?",
    "23": "Can I protect my business?",
    "24": "Is it crash and smash proof?"
  },
  "links": {
    "SimpliSafe": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5184496801013187000/https://simplisafe.com/",
    "smart security solution": "https://www.techradar.com/best/best-home-security-systems",
    "The Foundation": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5527754889509961000/https://simplisafe.com/home-security-shop-packages",
    "The Haven": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1392169559072853800/https://simplisafe.com/home-security-shop-packages",
    "Standard Plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7693861030237186000/https://support.simplisafe.com/hc/en-us/articles/360023809972-What-are-the-service-plan-options-",
    "Interactive Plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8004613698932291000/https://support.simplisafe.com/hc/en-us/articles/360023809972-What-are-the-service-plan-options-",
    "COPS Monitoring": "https://www.copsmonitoring.com/",
    "Video Verification": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9875886397309688000/https://support.simplisafe.com/hc/en-us/articles/360023809972-What-are-the-service-plan-options-",
    "ADT": "https://www.techradar.com/reviews/adt-security-systems",
    "Brinks Home": "https://www.techradar.com/reviews/brinks-home-security",
    "Guardian Protection": "https://guardianprotection.com/",
    "Vivint": "https://www.techradar.com/reviews/vivint-security-systems",
    "Frontpoint": "https://www.techradar.com/reviews/frontpoint-security-systems",
    "reviews": "https://www.t3.com/reviews/simplisafe-security-system-review"
  }
}