{
  "source": "https://www.techradar.com/reviews/xpg-xenia-14",
  "title": "XPG Xenia 14 review",
  "category": "computing",
  "updated": "2021-07-21T15:12:43Z",
  "author": "alex-cox",
  "summary": "A thin, light laptop which almost (almost) gets it right",
  "verdict": "XPG's latest ultrabook is great looking and fast enough, with tight bezels and a fantastic SSD. But it falls just short of being absolutely brilliant.",
  "pros": [
    "Very compact design",
    "Incredibly light",
    "Fast storage"
  ],
  "cons": [
    "Wobbly construction",
    "Lacking graphics",
    "Unsatisfying screen"
  ],
  "article": [
    "You have to hand it to XPG: since entering the laptop market a couple of years ago, the Adata sub-brand has certainly taken a good stab at shaking things up, though neither the previous Xenia 15 or Xenia Xe landed with too much impact.",
    "With the XPG Xenia 14, despite what a little confusing marketing might suggest, it seems to be taking firm aim at the thin-and-very-light market - and, well, we're still waiting for a truly deep impact, but this absolutely makes a bit of a boom.",
    "It's not that the Xenia 14 doesn't achieve a lot. It is extremely thin and, at 2.1lbs, incredibly light, amongst the lightest laptops on the market today. It scores well on appearance, too, with some truly Dell-baiting compact bezels, a large and bright screen, and a subdued, almost-premium chassis design.",
    "Place this next to the likes of the Dell XPS 13, the HP Elite Dragonfly G2, the LG Gram 16, and it'll put in a good showing.",
    "Inside there's a very competent and speedy hardware package, highlighted by a strong 11th-gen Intel processor and XPG's super-fast own-brand SSD, which makes the Xenia 14 feel very responsive on the desktop and gives it big enough biceps to do some seriously heavy lifting.",
    "There are also plenty of ports - often the first things to go when machines focus on compactness - with one of these offering Thunderbolt 4, which offers expansion potential. Speaking of which, XPG's clever, generous internal design makes RAM and SSD upgradeable if you're not afraid of removing a few screws, which isn't the kind of thing you see often at this size.",
    "Sounds great? It does. So here's the other side: there's not one huge thing that lets it down, but the Xenia 14's little foibles mean it lands with less of a major impact and more of a soft thud.",
    "The chassis is slim but it's poorly braced; there's worrying flex in the top shell, and the screen hinge is bouncy to the point of being highly distracting while typing. The screen dimensions may be almost impossibly generous, but the panel itself is slow and can be smeary when trying to move things fast.",
    "As much of an improvement as Intel's Iris Xe graphics are over its previous on-board solution, they're still not good enough for much more than sitting on the desktop. The battery isn't terrible, but it's just OK.",
    "We don't hate the Xenia 14 at all; it's more that its initial wow factor dissipates pretty quickly. If it's priced properly - and it may or may not be, as you'll find out shortly - XPG's undercutting of similarly-sized rivals could make those small sacrifices worth it; if not, it's not hard to find a sharper take on the genre elsewhere.",
    "Bad news here for UK and Australian readers - as far as we can see, the XPG Xenia 14 is (as yet) only available in the US and Mexico. Whether it will eventually make it to other shores isn't yet clear, though XPG does acknowledge it on its international sites so there is at least a chance.",
    "In the US XPG lists this 16GB, Core i7 spec of the the Xenia 14 (due for launch mid-August 2021) at either $1,349.99 or, at time of writing, a reduced price of $1,099.99 in a baffling bundle with a host of gaming accessories, a value we suspect will end up being its actual base price.",
    "At least we hope that's the eventual number. This is no bargain at the more expensive price of the two, which would place it on a par with similar small-bezeled Ultrabooks, most of which have a slightly better build and finish. For $350 less, though, this drops in below similar-sized rivals like the LG Gram 14 and Dell XPS 13, which might make its slightly more rough-and-ready construction worth considering.",
    "Do bear in mind, as well, that if you're willing to make a couple of very slight aesthetic sacrifices and maybe drop a little RAM, a similar machine like the Acer Swift 5 lists around $850 and typically sells for $100 less.",
    "XPG's choice of chassis is not offensive in any way, at least viewed statically. It's a neutral dark grey, impressively thin, with a wide-enough keyboard and remarkably small bezels around its 16:10 screen. It all looks very smart, if not especially premium. There are little irritations here and there - the XPG logo on the lid is upside-down when the screen is open, which is frankly unforgivable - but nothing deal-breaking.",
    "In the hand the Xenia 14 is impressively, perhaps worryingly, light, scraping in under a kilogram at just 2.1lbs/970g. It's also thin enough at 15mm to make it a true Ultrabook, but the way it gets there isn't entirely to its benefit - and may be at odds with any notion of toss-it-in-a-bag portability.",
    "This is apparently a magnesium alloy chassis. Presumably, given the way it feels, that's an alloy of magnesium with plastic. That's not just us being catty, either: the screen is basically not braced at all, so there's a whole raft of flex up top; its hinge is inadequate, which causes the screen to wobble distractingly as you type, and flop around when holding the machine by its base.",
    "Conversely the upper edge of the base is stiff enough that there's not a whole lot of deck flex when you're typing on a desk, but take the Xenia 14 in two hands and it's clear that everything about the chassis has been pared down to the point that it's almost soft.",
    "The XPG Xenia 14 begs forgiveness with its screen design, and almost gets some; those bezels really are minimal, and impressive for a machine at this level. If this is the new standard, we're all for it. The keyboard feels tactile and decent, and the trackpad, too, wins the Xenia 14 more than a few points with its responsiveness and sheer size. It does a decent job of ignoring accidental palm inputs, and can be disabled by double tapping the top-left corner.",
    "Ports are laid out practically, with a pair of USB Type-A ports on either side, a standard Type-C port, and another which doubles as a Thunderbolt 4 port, which is a nice (though expected on this generation of Intel mainboards) extra.",
    "There's also an audio combo jack and full-size SD card reader on the left and an HDMI output on the right, the latter of which is only 2.0b rather than 2.1 - not that you'd really get the benefit from the latter given that XPG hasn't been able to squeeze in any discrete graphics, and this is fully ready to be expanded with all the 4K monitors you can string onto it.",
    "Let's talk about pixel pushing, then. There was some confusion in our review process, as some bright spark in XPG's marketing department decided to write 'Gaming Lifestyle Ultrabook' on the Xenia 14's box.",
    "The press release omits that crucial first word, yet XPG is definitely (incorrectly) selling this on the basis of implied gaming prowess. You may be able to push mild esports titles though its Intel Iris Xe integrated graphics, or AAA titles on Very Low with framerate caveats, but asking any more of it would be pretty laughable. Hopefully any potentially interested buyer will be savvy enough to realise.",
    "We can't fairly judge this as a gaming laptop, because it simply isn't one, so we'll consider it as a work and entertainment machine instead. In that respect the Iris Xe does just fine, offering more than enough power to drive the 60Hz 1920x1200 panel - itself plenty sharp, if a little smeary when pushed with fast-moving images.",
    "Outside of its graphical performance, though, XPG's inclusion of an 11th Gen Intel Core i7-1165G7 running at 2.80GHz (with a hefty boost clock of 4.70GHz and 28W max TDP) is an excellent one.",
    "It's a quad-core chip from late 2020, and one of the highlights here: paired with a default 16GB of DDR4-3200 RAM and XPG's own incredibly swift PCIe 4.0 SSD, it makes the Xenia 14 feel very snappy indeed on the desktop - at least once you've whipped it into shape with the proper drivers.",
    "This is a machine for the unafraid: it's thankfully unfettered by even a single piece of bloatware, but conversely it's entirely up to you to get the most out of it. To that end it is upgradeable, organised neatly inside with space to easily throw in an additional stick of DDR4 and a second M.2 SSD, or even switch out the existing RAM and SSD.",
    "Snappy it may be, but the XPG Xenia 14 also has muscle - though benchmarking it was, to be frank, a struggle. Our testing procedures demand three full runs through each benchmark, a point which 3DMark in particular seemed determined to fight us on; the scores, after battling numerous failed runs and crashes, just serve to highlight the inadequacies of Iris Xe and its still-iffy drivers as anything other than a desktop graphics chipset.",
    "Results in other tests were very reasonable indeed, reaching exactly the sort of mark we'd expect, proving that the quiet of the Xenia 14's cooling is impressive; it's so quiet we could almost hear that chip groaning as it fought its way through the rigours of Cinebench R20, but it did a solid job while remaining quite quiet.",
    "Typically the PCMark test showed off its excellent desktop prowess, and running our battery life benchmark showed that the screen is perfectly adequate for media use - though it also highlighted that the down-firing speakers are loud but overdriven, sounding rather blown out a lot of the time.",
    "The Xenia 14 lasts what we'd call an acceptable, if not outstanding, amount of time. Our battery benchmarks peg it somewhere in the six to seven hour range, though we managed to claw almost eight hours' mild work out of it, testament to the scalability of its CPU.",
    "It's not, by some way, the best battery in its class; the Xenia 14's 53Wh cell gives it far less life than the LG Gram 14's 72Wh battery, for example."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Price and availability",
    "14": "Design",
    "21": "Performance",
    "30": "Battery life",
    "32": "Don't buy it if..."
  },
  "links": {
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "HP Elite Dragonfly G2": "https://www.techradar.com/reviews/hp-elite-dragonfly-g2",
    "LG Gram 16": "https://www.techradar.com/reviews/lg-gram-16-2021",
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "LG Gram 14": "https://www.techradar.com/reviews/lg-gram-14-2020-core-i7-10th-gen-laptop",
    "Acer Swift 5": "https://www.techradar.com/reviews/acer-swift-5"
  }
}