{
  "source": "https://www.techradar.com/reviews/tivo-stream-4k",
  "title": "TiVo Stream 4K review",
  "category": "televisions",
  "updated": "2021-02-12T18:49:17Z",
  "author": "nick-pino",
  "summary": "The TiVo Stream 4K is a slightly slower Android TV-based streamer with a neat recommendation algorithm",
  "verdict": "If it was just a bit more responsive, the TiVo Stream 4K would be a rock-solid Android TV streaming device. It has the features of streaming devices that cost twice as much and a premium remote, but it’s clear where TiVo cut corners to keep the price low.",
  "pros": [
    "Recommendation algorithm",
    "Fantastic remote",
    "Good price",
    "Chromecast and Google Assistant"
  ],
  "cons": [
    "Slow down on menus",
    "Design isn’t very appealing",
    "Soundbar issues"
  ],
  "article": [
    "The TiVo Stream 4K is a breath of fresh air for a brand that relied, largely, on you spending hundreds of dollars per month for a cable subscription.",
    "This new full-on streaming device is capable of playing Netflix, Hulu, Amazon Prime Video and dozens of other services on your TV without requiring you to pay for any extra fees outside of the subscription services themselves. To that end, the TiVo Stream 4K is much, much closer to a Roku than it is TiVo’s long standing lineup of DVRs – and does a better job than you’d expect for the price.",
    "The downside here, unfortunately, is that the TiVo Stream 4K is a bit slower than some other streamers we’ve seen, especially when stacked against more premium models like the Roku Ultra or the Nvidia Shield TV. But its breadth of streaming services and features might make up for the lack of zip if the lack of speed doesn’t bother you.",
    "Powering the TiVo Stream 4K is an ever-so-slightly customized version of Android TV 10 that adds a top row of TiVo recommended content and the TiVo Stream app. The latter is probably the defining feature of the TiVo Stream 4K and while it does a fantastic job of curating content – one of TiVo’s specialties – the process of browsing the app, picking a show and commencing playback is all a bit slower than it needs to be.",
    "Still, given its Dolby Vision and Dolby Atmos playback capabilities and low price tag, the TiVo Stream 4K proves itself to be a solid alternative to the Google Chromecast with Google TV and Amazon Fire TV Stick 4K, and a convincing argument for the future of the brand.",
    "The TiVo Stream 4K was first released back on May 6, 2020 after being announced at CES 2020. Just as it was when it was launched, the TiVo Stream 4K costs $50 – putting it around the same price as the Amazon Fire TV Stick 4K, Chromecast with Google TV and Roku Streaming Stick+. At this price there’s no shortage of competition.",
    "It has two rivals at this price: the Chromecast with Google TV, which offers the best all-around experience, followed by the Roku Streaming Stick+ and Amazon Fire TV Stick 4K. The TiVo Stream 4K is a bit slower than the Chromecast with Google TV and doesn’t have the robust search engine of the Roku Streaming Stick+, but it’s a nice Google-friendly alternative to the Amazon Fire TV Stick 4K which largely hinges on you being an Amazon Prime subscriber to unlock its full potential.",
    "If you’ve ever seen a Chromecast, the TiVo Stream 4K’s form factor will look familiar – it’s a streaming dongle that hangs off the back of the TV and connects directly to an HDMI port.",
    "What separates Google’s streaming puck and the TiVo Stream 4K is the shape and aesthetic. While Google has gone for a smooth, rounded exterior for the Chromecast, the TiVo Stream 4K is big and blocky. It only takes up a single HDMI port in theory, but in practice its large size could make it hard to fit into tighter spaces and cramped cabinets.",
    "In terms of power, TiVo packs a small power adapter into each box that connects to the Stream 4K via a USB-to-microUSB cable. Instead of the power adapter, you could instead use a USB port on your TV to power the Stream 4K, but not every TV’s USB port will output enough power so you shouldn’t depend on that being the case.",
    "Inside the unit, you’ll find a Amlogic S905y2 SOC, 2GB of DDR4 memory and 8GB of storage. The TiVo Stream 4K can use up to 802.11ac Wi-Fi 2.4GHz and 5GHz, but that will be bottlenecked by the processor itself, as we found out. The specs, while serviceable, aren’t exactly cutting-edge but are about what you’d expect for the price.",
    "The real crowning jewel of the TiVo Stream, in our opinion, is the included remote that feels like a miniaturized version of the full-size TiVo remote that comes with the DVRs. It’s a premium, functional Bluetooth remote with a built-in microphone for voice commands as well as shortcuts for Sling TV and Netflix. The feel of the remote in the hand is great and, because the whole system is HDMI-CEC-enabled, you can use the TiVo Stream 4K remote to control your TV as well (as long as it too supports HDMI-CEC). That’s not a huge boon, but it is a nice feature for those of us who already have too many remotes around.",
    "Having a customized version of Android TV gives the TiVo Stream 4K a number of advantages. Chief among them is the organized interface, Chromecast support and Google Assistant. The latter can be summoned by holding down a button on the remote, and it’s definitely one of the major advantages Android TV has over Roku.",
    "Before you’ll see the main interface, however, you’ll have to go through a short setup process that will require you to create a TiVo account if you don’t already have one and enter your Wi-Fi information. This process can either be done by manually entering all the information – or, if you have an Android device handy, through the Google app on your phone in a matter of seconds.",
    "Regardless of which way you get through the basic setup information, your last step will be to start the personalization process by picking your favorite TV shows and movies. You’ll be shown two at a time, and your picks will ultimately change what genres of content you see on the TiVo Stream app and on your homepage.",
    "Speaking of the TiVo Stream app, it’s more than likely going to be your go-to hub for finding new movies and shows. It pulls in all the latest content from every service you currently subscribe to, as well as some you don’t, and it will show you what it thinks you’ll like. The catch is that, in order to get it to play, any icon you click will have to load up the appropriate service first and then start the video – which, as we mentioned, takes awhile.",
    "That said, you certainly can go to the streaming services directly if you don’t want or need TiVo’s recommendations. So far the TiVo Stream 4K supports Netflix, Amazon Prime Video, Vudu, Youtube, Sling TV, Disney Plus and HBO Max. Pretty much every major streaming service is here and accounted for – except Apple TV Plus.",
    "Any content you can’t find on the TiVo Stream 4K’s app can be cast from a Chrome web browser thanks to its Chromecast Built-in functionality, a big win for Android and PC users. The other perk here for folks tied into Android is built-in Google Assistant that can sync with your Google account. It’s not quite as robust as what you’re used to seeing on your phone or on a Google Nest Hub Max, but it has most of the same features.",
    "Let’s get the worst part out of the way first: the TiVo Stream 4K isn’t fast. In fact, jumping between menus often takes a second or two – which may not sound like much, but really adds up when you’re checking every streaming service for something to watch. Despite having what we generally consider fast internet (100+ Mbps) tiles on Netflix could still take a few seconds to populate, as did content on the TiVo Stream app.",
    "The good news is that, when you finally crawl through the menus to find something, it’s going to look good. We spent much of the time with the TiVo Stream 4K watching Dolby Vision content on Netflix and HD TV livestreams from Sling TV.",
    "HD content, for the most part, looked fine on Sling TV: there was a bit of pixelation and jagged edges, both the fault of the player and of the TV, and the guide did sometimes take a second or two to populate with information.",
    "On the other hand, the Dolby Vision content from the TiVo Stream 4K looked especially great with only one or two times that the player dropped resolution mid-stream. The colors seemed slightly subdued compared to the built-in Netflix app on the TV, but it wasn’t enough to be disconcerting.",
    "What was slightly disconcerting, however, was the audio issues we encountered while testing the TiVo Stream 4K. Often, when coming out of sleep mode, the TiVo Stream 4K wouldn’t play sound through the attached soundbar. If we switched to the TV’s built-in Netflix app we’d hear sound just fine, but switch back to the Stream 4K and there’d be no volume. The only fix we could find was restarting the TV and soundbar, reinitiating the HDMI CEC handshake that was likely at fault behind the scenes.",
    "The silver lining to the TiVo Stream’s audio situation is that it supports Dolby Atmos passthrough to a Dolby Atmos soundbar like the Vizio Elevate. We were able to demo One Planet in Dolby Vision and Atmos to friends and family, all of whom were impressed by the immersive spatial audio of Dolby Atmos."
  ],
  "headers": {
    "5": "Price and release date",
    "7": "Design",
    "12": "Features",
    "18": "Performance",
    "24": "Don’t buy it if…"
  },
  "links": {
    "Roku Ultra": "https://www.techradar.com/reviews/roku-ultra-2020",
    "Nvidia Shield TV": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Google Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "Amazon Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Roku Streaming Stick+": "https://www.techradar.com/reviews/roku-streaming-stick",
    "Sling TV": "https://www.techradar.com/reviews/audio-visual/av-accessories/sling-tv-1279011/review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Google Nest Hub Max": "https://www.techradar.com/reviews/google-nest-hub-max"
  }
}