{
  "source": "https://www.techradar.com/reviews/versature",
  "title": "Versature review",
  "category": "computing",
  "updated": "2021-02-17T18:24:55Z",
  "author": "michael-graw",
  "summary": "An inexpensive VoIP service for Canadian businesses",
  "verdict": "Versature is an affordable VoIP provider for small businesses that primarily places calls within Canada. The web interface is slightly outdated but you’ll find plenty of software integrations and helpful data insights.",
  "pros": [
    "Includes phone rental",
    "Excellent data insights"
  ],
  "cons": [
    "Calls to US are not unlimited",
    "Outdated web interface"
  ],
  "article": [
    "Versature is a Canadian VoIP provider that offers inexpensive pricing and flexible plans for small businesses. The company provides complimentary VoIP-enabled phone rentals with a long-term contract and offers key features like call recording and voicemail transcription. Versature also offers integrations with popular business software, so you can use your phone service to drive data insights.",
    "So, is this the best VoIP service for your business? In our Versature review, we’ll cover everything you need to know to decide.",
    "Versature offers a few different plan options depending on how many lines and toll-free minutes you need, and whether you need conferencing services. For phone service only, the Essentials plan offers up to 10 lines and 2,500 toll-free minutes for $23.46 USD per month ($29.99 CAD per month).",
    "If you want audio or video conferencing, you’ll need a Professional or Enterprise plan. The Professional plan costs $27.37 USD per month ($34.99 CAD per month) and comes with 15 phone lines and 5,000 toll-free minutes.",
    "The Enterprise plan costs $35.20 USD per month ($44.99 CAD per month) and includes 20 phone lines and 10,000 toll-free minutes.",
    "One great thing about Versature is that VoIP-ready phones are provided for your business free of charge if you sign up for a 3- or 5-year contract. Professional and Enterprise users also receive one conference room speakerphone in addition to desk phones.",
    "All Versature plans include unlimited incoming and local call minutes, and Professional and Enterprise plans include unlimited calls to the US. If you run over your toll-free minutes for the month, international calls cost an additional $0.05 CAD per minute ($0.04 USD per minute).",
    "Versature has all the essential features you’d expect from a VoIP service, including helpful functions like call recording and voicemail transcription. The service also enables you to set up a custom answering service and dial menu so that incoming callers can reach the right department or extension.",
    "Even better, Versature makes it simple to ensure that incoming calls are always picked up. You can turn on simultaneous ringing so that calls are delivered to multiple phones at once. With the Versature mobile app, calls can also ring on employees’ smartphones.",
    "The platform also supports call queues, so customers are automatically transferred to a hold if your employees are already occupied on the phone.",
    "Our favorite thing about Versature is that the platform makes it easy to get insights into your business operations using your phone data. You can quickly view key performance metrics like how many calls are active at any given time, how many calls are abandoned, and how long, on average, customers are waiting to reach an employee.",
    "These metrics can be shared in a view-only format with your employees using the Versature desktop platform. So it’s easy for employees to know when they’re beating the company’s average service performance or falling behind.",
    "Professional and Enterprise users also get access to the Huddle video conferencing software. This software enables you to host meetings with up to 50 participants with no time limits. It supports video recording, screen sharing, and in-meeting chat, although it falls short on some collaboration features.",
    "For example, there’s no virtual whiteboard that participants can use to mark up a presentation and you cannot co-host meetings to tag-team a presentation.",
    "We found getting started with Versature to be relatively simple. The fact that the company gives out its own phones is a huge plus, since you don’t have to worry about configuring third-party hardware to work with Versature’s service.",
    "The web interface is fairly minimalistic. You can see summary statistics about your phone use on the primary dashboard, and quickly access contacts to launch a phone call. The menu is easy to navigate, but we wished it was easier to dial a number or search for a contact from the dashboard. Unfortunately, there’s no speed dial function to make quick work of calling frequently dialled numbers.",
    "The good news is that you can also take calls on any smartphone with the Versature mobile app (for iOS and Android). We much preferred the mobile experience to the web experience. The focus is on placing calls, not analyzing your past calls, and the app feels much more modern in design.",
    "That said, Versature offers a wide range of integrations for popular business software platforms—so you may not need to use the web interface much at all. You can add Versature to Salesforce, Zendesk Slack, Microsoft Teams, Google Chrome and more to launch phone calls from inside any of these desktop applications.",
    "Versature offers 24/7 phone support in English and French. You can get in touch with the company just by dialing 6-1-1 on any Versature-enabled phone, which is pretty convenient.",
    "Versature has a very detailed online knowledge base that’s packed with tutorials and animations to walk you through using the service’s key features. We also liked that you can sign up to be notified by email anytime Versature’s phone network is experiencing problems.",
    "Versature uses encryption to protect your calls and call recordings. In fact, the service is PCI-compliant and can automatically redact payment information when transcribing voicemails or call recordings to be sent via email.",
    "Video conferences with Huddle are also encrypted. In addition, you can password-protect meetings to keep out unwanted guests.",
    "Still, we were disappointed to find that Versature doesn’t offer two-factor authentication to help protect your online account from being compromised.",
    "Versature can be a good option for Canadian businesses but if your company makes a lot of calls to the US, you might be better served with a service like Ooma Office. Ooma Office doesn’t put a limit on North American calling and it’s plans are cheaper than Versature’s Professional plan. Ooma Office costs just $19.95 USD per month, or $24.95 USD per month if you want voicemail transcription and call recording.",
    "Versature is an inexpensive VoIP provider for small businesses in Canada. The platform provides unlimited local calling and key features like call recording, voicemail transcription, and call queues. We felt the online interface could be improved, but this wasn’t a huge issue given that Versature integrates seamlessly with a variety of business software platforms.",
    "If your business primarily places calls within Canada, this is one of the best VoIP providers for the money."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "14": "Interface and in use",
    "18": "Support",
    "20": "Security",
    "23": "The competition",
    "24": "Final verdict"
  },
  "links": {
    "Versature": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1169916508822806500&xs=1&url=https%3A%2F%2Fnet2phone.ca%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fversature",
    "best VoIP service": "https://www.techradar.com/news/best-voip-service",
    "Essentials plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1076017471432426000&xs=1&url=https%3A%2F%2Fnet2phone.ca%2Fplans-pricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fversature",
    "Professional plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3758795021765443000&xs=1&url=https%3A%2F%2Fnet2phone.ca%2Fplans-pricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fversature",
    "Enterprise plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1373602622726809000&xs=1&url=https%3A%2F%2Fnet2phone.ca%2Fplans-pricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fversature",
    "Ooma Office": "https://www.techradar.com/reviews/ooma-office-review"
  }
}