{
  "source": "https://www.techradar.com/reviews/logitech-streamcam",
  "title": "Logitech StreamCam review",
  "category": "computing",
  "updated": "2021-05-17T11:51:12Z",
  "author": "jess-weatherbed",
  "summary": "A stylish webcam for content creators",
  "verdict": "The Logitech StreamCam may have marketed itself as the perfect webcam for streamers and online content creation, something that it does very well, but it's missing a few key features that it needs to best other products on the market.",
  "pros": [
    "Unique design",
    "Smooth and speedy 60fps video",
    "Rotate for vertical video"
  ],
  "cons": [
    "Footage gets 'noisy' in low light",
    "No detachable USB-C",
    "Lacks variable FOV"
  ],
  "article": [
    "The Logitech StreamCam is the most recently released product in the Logitech family of webcams and has swiftly become a popular choice for content creators and streamers. Looking at the specifications and Logitech’s track record, it’s easy to see the appeal. Performance is top-notch, on par with the Razer Kiyo Pro, but the Logitech StreamCam misses out on a few quality of life features, especially with the unfortunate choice to have the USB-C connection wired into the back of the device. It’s also on the pricey side for a webcam at $169 / £139 / AU$280 which won’t make it the most affordable choice if you’re looking for something to take a few conference calls at work.",
    "The Logitech Capture software is incredibly easy to use for minor adjustments, but you may need to use a different app if you want to make any serious alterations. You can also use the Logitech Capture feed through other programs such as OBS or StreamLabs if you want to keep the adjustments made via the app, rather than using the raw webcam footage.",
    "The output is 1080p at 60 fps, which is noticeably smoother than the typical 30 fps offerings on cheaper models, but deciding if this will be for you entirely depends on your webcam requirements. A lot of conferencing software such as Google Meet don’t allow for 60 fps, or even 1080p quality in some cases so it’s unlikely you’ll see the full benefit.",
    "For platforms like Twitch or YouTube Live, however, you can use the StreamCam to its full advantage. If you are just looking for a high-quality webcam, this is without a doubt one of the best offerings on the market. You really do get what you pay for, especially if you’re looking to create online content or start streaming.",
    "The Logitech StreamCam will set you back $170 (£139, AU$279) when you can actually find one, which has been difficult of late due to the sudden rise in remote working causing demand for good quality webcams to skyrocket.",
    "This is likely more than most would be willing to pay for even one of the best webcams, but Logitech isn't exactly marketing this to the everyday office worker. It has to contend with other models in the streaming industry such as the ever-popular C920, another Logitech offering that has been the reliable (and more affordable) go-to for anyone needing a great quality webcam for streaming, so the high price could put folk off as soon as they load up the page to buy it.",
    "That said, this isn't as pricey as the Razer Kiyo Pro, but it lacks many of the features that this rival product provides such as a variable field of view or HDR settings. You may not use these features for something like work calls, but a wider field of view is especially useful for streaming on platforms like Twitch or Youtube, which makes their absence on the StreamCam a tad disappointing.",
    "The Logitech StreamCam has a uniquely cubic design that isn’t seen in any popular rival products, making it immediately distinguishable among the competition. The design isn’t just a style choice though - the webcam can be mounted either horizontally or vertically, with the latter mimicking the appearance of most forward-facing mobile phone cameras. Grooves are located across the sides of the camera to clip into a ‘U’-shaped casing which allows you to rotate the device quickly if you’re in a situation that needs a swift alteration. That doesn’t mean the vertical recording capability is actually a good feature though, given how little it will likely be used. Outside of apps like Snapchat or TikTok, most video platforms are horizontally optimized so it’s hard to understand why it was included at all. There are also two different styles of mount to choose from, the standard ‘grip’ that stiffly flips out to rest onto the display of a monitor or laptop screen, or a diminutive desktop tripod. The tripod mount compatibility also means the StreamCam will work on larger, standard-sized tripods too, should you need something with a little more clearance.",
    "The camera mount only allows for up-and-down or swivel adjustment, so you’re limited with the angled positioning of the device itself, something that could have been improved with a 'ball joint'-style mount. The device uses a USB-C connection which could also cause a few issues. Not only is the cable wired into the back of the StreamCam, unlike other products that have removable options for flexibility), but not every device has a USB-C port. For those that do, there has been a rise in devices using USB-C connections which means you may have to invest in an adapter or ensure your other devices won’t be fighting for the same connection. The StreamCam is available in solid black or a white and gray combo, with a slightly textured fabric surrounding the lens. This doesn’t appear to have a practical use, but it does make the webcam look more modern and aesthetically pleasing than a traditional bar-style device. If you have a minimal or scandi-inspired setup then this would likely suit your current look.",
    "Where the 4K, 30 fps Logitech Brio wasn’t well-received by the streaming community, the StreamCam offers a more appealing 1080p quality at a smooth 60 fps. This is better for streaming content such as shows and games, but would realistically be completely overkill for anyone who won’t be utilizing its full potential. The raw footage is exceptionally good, with great color balance and autofocus right out of the box. We noticed some unfortunate background noise in the background of recordings even in a well lit room though, so make sure you sit yourself by a good light source if you need to broadcast at full screen. It's also unlikely that this will be picked up on scaled-down video such as gaming streams or conference calls. You can see comparison images below taken on the Logitech StreamCam against the Razer Kiyo Pro and the Logitech Brio where all settings have been reverted back to the factory standard.",
    "We’ve also taken a few comparison shots with the automatic white balance enabled, and a shot in direct sunlight. The original, raw image shows the StreamCam has impressive low light capabilities (minus the speckles of background noise), but we found that the auto-focus feature gets a tad enthusiastic if there isn’t a lot of light in the shot.",
    "You can use the StreamCam alongside broadcasting applications such as Xsplit or OBS as Logitech Capture will appear as a separate active video feed to the device itself, which is useful if you’ve made adjustments to your footage that you want to carry over. You can tweak the exposure and color correction, though using the raw footage in OBS will grant more freedom if you need to make any serious changes. The Capture app also lets you change between various settings such as video resolution (360p/720p/1080p) and framerates (24/25/30/50/60fps), as well as giving the option of automatic face framing that zooms into your face and tracks it across the screen. Overall, this is a great choice of webcam if you have the cash to burn, and a fantastic choice for content creators looking for smoother, high-definition footage during streams and recordings."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and availability",
    "7": "Design",
    "9": "Performance",
    "12": "Don't buy if..."
  },
  "links": {
    "Logitech family of webcams": "https://www.techradar.com/news/best-logitech-webcams",
    "Razer Kiyo Pro": "https://www.techradar.com/reviews/razer-kiyo-pro",
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "C920": "https://www.techradar.com/news/best-logitech-webcams",
    "streaming on platforms like Twitch": "https://www.techradar.com/news/the-best-free-streaming-software",
    "Logitech Brio": "https://www.techradar.com/news/logitechs-new-4k-hdr-webcam-offers-streamers-a-major-upgrade"
  }
}