{
  "source": "https://www.techradar.com/reviews/lenovo-thinkpad-c13-yoga-chromebook",
  "title": "Lenovo ThinkPad C13 Yoga Chromebook review",
  "category": "computing",
  "updated": "2021-06-30T17:51:40Z",
  "author": "john-loeffler",
  "summary": "Pricey, but nearly perfect",
  "verdict": "With the new AMD 3000C-series CPUs, the Lenovo ThinkPad C13 Yoga Chromebook is definitely as powerful a Chromebook as you're going to find. You're going to pay a premium for its best features, but considering it's a Chromebook, that means it may last you for many years to come, and it's still cheaper than some of its closest rivals. If you've got the money and you're willing to invest in a future-proof Chromebook, this might be the one.",
  "pros": [
    "Powerful AMD processor",
    "Garaged Lenovo USI Pen",
    "Outstanding security features"
  ],
  "cons": [
    "Expensive",
    "Less than 10-hour battery",
    "Not the best sound quality"
  ],
  "article": [
    "When it comes to the best Chromebooks, functionality is the name of the game - but while most Chromebooks might sacrifice power for functionality, the Lenovo ThinkPad C13 Yoga Chromebook brings a lot to the table hardware-wise. This powerful, future-proof Chrome OS laptop will last you way longer than competing Chromebooks, more than justifying the price tag.",
    "For a 2-in-1 laptop, the responsiveness of the display is about as good as you're going to get on a Chromebook. Getting a UHD display is going to cost you, but even with a FHD display, there's more than enough to the display to get your work done.",
    "With the new AMD 3000C-series processors - starting with an Athlon 3150C and scaling up to a Ryzen 7 3700C - you'll get more processing power out of this Chromebook than many of it's competitors and probably for several years, making it an excellent laptop to carry you for the long haul.",
    "It's a dream to type on, and the inclusion of a track button right in the middle of the keyboard which along with the trackpad makes for plenty of input options, depending on your preference.",
    "The model we tested wasn't a slouch on the hardware, either. With 8GB RAM, 256GB PCIe NVMe SSD, and Wi-Fi 6 and LTE wireless, no matter where you store your data or work your apps, there's more than enough memory, storage, and processing power to get your work done without any hiccups.",
    "This is an enterprise notebook, so it comes with several useful security features, including Google's H1 security chip and fingerprint reader to unlock the device. There's also a physical webcam shutter to protect your privacy.",
    "These added features and better hardware prices it higher than most of its competitors - even at the entry level configuration - but it's price tag is more than justified given its performance, features, and build quality. If you're looking for a 2-in-1 Chromebook for work that you can keep around for several years, the Lenovo ThinkPad C13 Yoga Chromebook is an excellent investment you should consider making.",
    "The Lenovo ThinkPad C13 Yoga Chromebook is available now in the US, starting at $585 and comes with an AMD Athlon Gold 3150C CPU, 4GB RAM, 32GB eMMC flash storage, and a 13.3-inch full HD (1080p) touchscreen IPS display. It also comes with a 720p front-facing webcam but not a world-facing one and it doesn't come with a garaged Lenovo USI Pen.",
    "On the high end, for $970 you get an AMD Ryzen 7 3700C CPU, 16GB RAM, 256GB PCIe NVMe SSD, and a 13.3-inch UHD 4K touchscreen OLED display. It includes the 5MP world-facing camera with a microphone, a garaged Lenovo USI Pen, and a built-in fingerprint scanner.",
    "The model we tested came in just under that, with 8GB RAM, 256GB PCIe NVMe SSD, a FHD display, and an AMD Ryzen 5 3500C for around $770.",
    "In the UK, the only available configuration features an AMD Ryzen 5 3500C, 8GB RAM, 128GB m.2 SSD, a 13.3-inch FHD IPS display, both front-facing and world-facing cameras, fingerprint scanner, and garaged Lenovo USI Pen for £629.99 (including VAT).",
    "Australia availability hasn't been released yet and neither have planned configurations and pricing, but we have reached out to Lenovo about their plans to release the C13 Yoga Chromebook in Australia and will update this review when we hear back, though it should retail somewhere in the neighborhood of AU$1,099.",
    "The Lenovo ThinkPad C13 Yoga Chromebook isn't the flashiest Chromebook out there and generally keeps to the ThinkPad line's more functional presentation. Considering that this is an enterprise-oriented device, that's probably a smart move.",
    "The display is bright and the bezels are fairly narrow around the top and sides, while the bottom of the display looks a bit chunky, but not aggressively so.",
    "The webcam in the top bezel is your standard 720p and is fine for Zoom meetings and video calls, but it's best feature is the sliding, physical camera shutter for enhanced privacy.",
    "There is also an optional 5MP world-facing camera located just above the keyboard - though by default, there is a pair of far-field microphones for better voice pickup for video calls and conferencing.",
    "The keyboard is the standard tenkey-less design and the keys are well spaced and responsive, making it very easy to type on and get up a good head of steam while writing up reports (or laptop reviews, for that matter).",
    "The trackpad is fairly standard, other than the mouse buttons positioned above the trackpad, rather than at the bottom, to accommodate the track button just above the lowest row of lettered-keys on the keyboard.",
    "The inclusion of a middle mouse button is a nice addition that you don't usually see, though we didn't particularly use it much either.",
    "There are a good number of ports available, including a pair of USB Type-C ports and an HDMI port. There is also a Kensington lock for additional security.",
    "The optional Lenovo USI Pen is your fairly typical garaged stylus for 2-in-1 laptops, though the 2,048 levels of pressure sensitivity is half that of several other competing styluses, but for basic note taking, annotating, and navigation, it's more than sensitive enough to get the job done.",
    "The pen slot on the front of the laptop secures the pen when not in use and charges it as well. According to Lenovo, a 15 second charge will net you about 100 minutes of use, and this was roughly what we experienced.",
    "Though your usage and mileage will obviously vary somewhat, you definitely won't have to worry about running out of juice during a meeting and be stuck without your pen - not more than a few seconds, anyway.",
    "The biggest appeal of the Lenovo ThinkPad C13 Yoga Chromebook for us is definitely in its performance. The new AMD Ryzen 5 3500C definitely impressed us during our benchmark tests and the overall snappy performance of the device during real-world use is a noticeable improvement over other, less-powerful Chromebooks.",
    "We were interested to see the new AMD Ryzen 5 3500C processor in action and how it stacked up against some rival Intel chips running other Chromebooks.",
    "In our Kraken JavaScript test, the ThinkPad C13 Yoga Chromebook scored a 1,060ms, which was 203ms faster than the Intel Core i5-8220Y in the Google Pixelbook Go. Another near rival, last year's Asus Chromebook Flip C436F, scored 1,095ms with an Intel Core i3-1011U. The C13 Yoga Chromebook also bested the Chromebook Flip in our Octane 2.0 test, 37,916 to 36,967.",
    "The C13 Yoga Chromebook and the Chromebook Flip were essentially tied in terms of battery life, each edging just past the nine hour mark. But given the C13 Yoga Chromebook's 51WHr battery compared to the Chromebook Flip's 42WHr one, you can see the extra energy needed to run the C13 Yoga Chromebook's more powerful hardware.",
    "The Pixelbook Go, meanwhile, squeezed about an extra two hours of battery life over the C13 Yoga Chromebook on a smaller, 45WHr battery. While the C13 Yoga Chromebook fell short here, it wasn't by a whole lot and it still managed to get through a full eight hour workday on a single charge.",
    "Given it's better performance over the Pixelbook Go in other areas, it's up to you which of the two metrics are more significant. The C13 Yoga Chromebook does feature fast charging technology, though, and Lenovo claims you can charge 80% of the battery in an hour. This is more or less in line with our experience.",
    "Obviously, several areas of performance are going to reflect the hardware you opt for, but we can confidently say that if you invest the extra money to upgrade the RAM to 8GB or even 16GB, and go with the Ryzen 5 3500C or Ryzen 7 3700C, we expect that this Chromebook will be humming along without a hitch for many years.",
    "Chromebooks don't have the same issues with bloatware that a Windows 10 laptop has, so there's no real worry there. The additional security features are fairly light touch, with the only one you'll probably encounter is the fingerprint scanner to log in to the computer.",
    "Like all Chromebooks, it has complete access to the Google Play marketplace, so every Android app out there is readily available - assuming that you have the necessary privileges. If you are using a Google account managed by your company, your account admin might not let you access certain areas for security reasons.",
    "Likewise, you may or may not have access to the built-in Linux kernel. Assuming you do, however, setting it up is as simple as flipping a switch in the settings, giving you access to even more Linux software tools to go along with those built into Chrome OS and the Android marketplace."
  ],
  "headers": {
    "0": "Two minute review",
    "7": "Price and availability",
    "12": "Design",
    "23": "Performance",
    "30": "Software and features",
    "33": "Don't buy it if..."
  },
  "links": {
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "2-in-1 laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Google Pixelbook Go": "https://www.techradar.com/reviews/google-pixelbook-go-review",
    "Asus Chromebook Flip C436F": "https://www.techradar.com/reviews/asus-chromebook-flip-c436f-review"
  }
}