{
  "source": "https://www.techradar.com/reviews/lypertek-pureplay-z3-20-review",
  "title": "Lypertek PurePlay Z3 2.0 review",
  "category": "audio-visual",
  "updated": "2021-07-21T20:01:27Z",
  "author": "gerald-lynch",
  "summary": "Still the best affordable true wireless headphones out there",
  "verdict": "Lypertek continues to punch above its weight and outside of its pricing bracket with the PurePlay Z3 2.0 true wireless earbuds, a stellar-sounding and well-priced package.",
  "pros": [
    "Excellent sound",
    "Great price",
    "Top-notch battery life"
  ],
  "cons": [
    "Ambient mode is poor"
  ],
  "article": [
    "When we first reviewed the original Lypertek PurePlay Z3 true wireless earbuds (then known as the Lypertek Tevi), we were blown away. We couldn’t believe that a pair of headphones that sounded as good as they did, with the battery life they offered, could be sold so affordably and be the product of a company we’d hardly heard of. They were so good, we made them our headphone product of the year.",
    "Dial the clock forward a couple of years, and we’re now looking at their successors, the Lypertek PurePlay Z3 2.0 true wireless earbuds. They’re very similar to the originals, with a few key improvements, and yet still come in at the same affordable price point the originals did – $99 / £99.",
    "This gets you everything we loved about the original PurePlay Z3 (detailed balanced sound, a whopping 80 hours total battery life from its petite USB-C charging case, and a comfortably fitting bud with physical buttons), and adds wireless charging, a powerful new LDX Audio mode, improved app functionality and a hear through ambient mode.",
    "For the most part, it’s an improvement across the board – LDX Audio adds a well-tuned, full bodied sound for those that want more oomph than the near-reference default, wireless charging works a treat, EQ features respond well to tweaks and battery life remains stellar.",
    "However, app connectivity is patchy at best, and the ambient hear through mode is pretty much useless in comparison to the competition from the likes of Sony’s noise cancelling WF-1000XM4.",
    "And yet, with the price still rock-bottom low, and nothing to detract from the quality standard the originals set out, with a few notable improvements, they remain must-have earbuds, more than a match or headphones two or three times the price. Get them.",
    "The Lypertek PurePlay Z3 2.0 is out now, priced at $99 / £99 (about AU$185). That’s not a penny more than their predecessors, despite a raft of new features being included. And though they don’t feature active noise cancellation, they more than challenge rivals many times the price. That includes the Apple AirPods Pro ($249 / £249 / AU$399) and Sony WF-1000XM4 ($279.99 / £250 / AU$449.95). They are a total steal.",
    "From the outside, not much looks very different about the Lypertek PurePlay Z3 2.0 compared to its 1.0 predecessors, and that’s indicative of the product as a whole in many respects – this is a refinement on that top-notch original, rather than a revolutionary new direction.",
    "Again, you’ll find ovoid, stemless earbuds sitting within a pill-shaped, fabric covered case, complete with a removable carrying strap. Both white and black versions of the PurePlay Z3 2.0 are available, and each features USB-C charging and four LED indicator lights to show battery levels. The earbuds securely fit into the case with a magnetic snap, which will start them charging from the case’s own internal battery – removing them from the case will start the Bluetooth pairing process, and once they’ve been paired once, you won’t have to perform the process again unless you’re looking to pair additional devices with the headphones.",
    "The case (being just a touch too big for a comfortable trousers pocket fit), is quietly attractive, and makes use of its size to fit in a gigantic battery. You’re already getting a solid ten hours of playback from the buds themselves, but there’s an additional 70 hours to be had by recharging them in the fully-juiced charging case. That’s a whopping 80 hours total battery life before you’ve got to plug the cable back into case. And, in a first for the line, there’s wireless charging support too here. These are top-class battery specs, in case you were in any doubt.",
    "In terms of the earbuds themselves, they’re lightweight and comfortable in the ear. Each can be paired with small, medium or large silicone ear tips, or Flexifit foam tip that expands slightly in your ear for a tighter seal and better passive noise cancellation. That’s worth pointing out as, due to the budget nature of the earbuds, there’s no active noise cancellation here. Still, with strong volume levels and a snug fit, ambient noise was very rarely a concern with the PurePlay Z3 2.0. IPX7 waterproofing makes these safe for a quick splash in the shower, though note that the case is not similarly protected.",
    "Both earbuds also feature physical buttons, controlling volume, track selection, play, pause, call response and hear-through mode activation. They’re far more reliable than touch-sensitive buttons (and preferred here as a result), though pushing them without driving the earbuds further into your ear takes some practice.",
    "Internally there is an improvement too, with the introduction of Bluetooth 5.2 support. This allows for SBC, AAC and aptX codecs to be handled without fuzz, with the Qualcomm QCC3040 chipset allowing for improved battery life even to offset the introduction of the afore-mentioned LDX Audio mode.",
    "The original Lypertek Tevi, or PurePlay Z3, excelled when it came to bringing a clear, neutral sound to your ears. Just shy of what we’d consider reference or audiophile quality, they were revelatory when considering their price point. And that base-level, out of the box tuning remains present here. Making use of 6mm graphene drivers, there’s an identical level of clarity to the Z3 2.0, presenting an unbiased sound that favours studio intentions rather than ramping up any individual frequencies. As a result, we’ll point you to our original Lypertek PurePlay Z3 review for a detailed rundown of the out-of-the-box sound of the Z3 2.0.",
    "However, despite it being a preferred way of listening for audio connoisseurs, it’s not always the right tuning for every scenario. What about if you’re down the gym, and want a little more bass? Or generally want a punchier, more-powerful sound, even if that’s at the expense of balance?",
    "That’s where the PurePlay Z3 2.0’s new LDX Audio mode comes in, accessible from the also-new accompanying app. Switching on LDX Audio in the app is a bit like hitting an overdrive button – raising the volume of less-present frequencies (particularly bass tones), widening the soundstage.",
    "It results in a more energetic, dynamic delivery, and one that certainly is a noticeable departure from the stock tuning. They are two very distinct sound profiles, and both have their merits – I found myself switching between the two depending on the listening situation, favouring LDX Audio when out and about, while going for the stock tuning when indoors and intently listening to songs and albums. What neither is lacking in is clarity – the PurePlay Z3 2.0 does well to highlight details, and does well to avoid distorting when even at high volumes. They’re simply a pleasure to listen to.",
    "It’s more of a mixed bag when it comes to new features.",
    "First the good – the LDX Audio mode, as mentioned, is excellent, and is accompanied in the app by an equally-impressive EQ option. As well as a number of presets, from Rock to Jazz, Pop to R&B, there are also presets that favor Bass or Treble response. That’s in addition to two custom slots for your to save your own tunings. They make a noticeable impact, really letting you refine the sound to your tastes.",
    "But other features aren’t as impressive. A \"Hear Through\" mode, which is intended to let you hear more of your ambient surroundings via the earbud mics without interrupting playback, is pretty much useless, not making anywhere near the impact needed to make you comfortably more aware of what was going on around you. A Find my Earbuds feature was similarly patchy, while the app itself sometimes struggled to identify and connect to the headphones at all – even without any nearby wireless devices to potentially cause confusion.",
    "Despite some failings here, it’s hard to be too critical of the PurePlay Z3 2.0 though. Managing to bring more to the table than earlier models (mostly positively too), and still retaining the same price point, they remain an overall improvement to an already-impressive package."
  ],
  "headers": {
    "0": "One minute review",
    "6": "Price and availability",
    "7": "Design",
    "13": "Audio performance",
    "17": "Features",
    "21": "Don’t buy it if…"
  },
  "links": {
    "Lypertek PurePlay Z3": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Lypertek PurePlay Z3 review": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review"
  }
}