{
  "source": "https://www.techradar.com/reviews/odoo-website-builder",
  "title": "Odoo website builder review",
  "category": "computing",
  "updated": "2021-04-30T18:16:01Z",
  "author": "mike-williams",
  "summary": "A website builder you can extend with hundreds of apps",
  "verdict": "Odoo is an integrated website builder with a variety of features designed around the concept of apps to extend the functionality of your site. While it may work well for larger businesses, it can end up being quite expensive for anyone just starting out.",
  "pros": [
    "Numerous integrated business apps",
    "Business-oriented content blocks",
    "Create multiple users to work on one site"
  ],
  "cons": [
    "Can get very expensive",
    "Short on features",
    "Few widgets"
  ],
  "article": [
    "Odoo is a versatile service which offers hundreds of integrated business apps, covering areas including website building, e-commerce, sales, marketing, inventory, accounting, helpdesk and more. That's not as intimidating as it sounds. Individuals, as well as businesses, can sign up for just a handful of apps, and ignore everything else. In this review we're going to focus on Odoo's website builder and a small number of related features, including the Odoo blog.",
    "Odoo's real strength though, is the way you can extend your initial app choice by integrating others as you need them. You might start with a website, for instance, then add the core e-commerce app, eBay, email marketing, whatever suits your requirements.",
    "Odoo’s pricing is based on the number of users. If you want to add someone to your plan so they can help edit your website, it’s going to cost more. What’s unique about Odoo is how you can choose which apps and features you want to pay for - most web builders just list all the features that are included and you purchase everything together. Odoo is more personalized in this aspect. However, costs can add up fast.",
    "If you elect to only get the the main package for a single user with no additional apps or integrations, it’ll cost you $28 (€22.00) per month (new customers currently get a $4 (€4) discount per user). Think of this as the base price. Be aware though that the website builder isn’t part of the main package and costs $24 (€16) per month on top. If you want additional features, you can add those specifically to your plan. Many cost between $12 (€8) and $20 (€16) per month. Some can go as high as $72 (€64).",
    "If you’re interested in exploring what Oddo has to offer, a free 15-day trial gives you time to find out more.",
    "The interface is very organized and easy to use. Launch Odoo's free trial by registering an account with your name, email address, phone number, company name, and size. A company name is important as your account and its URL inside Odoo will be based around it (for instance, ‘Amazon Films’ can access that company’s features via ‘amazon-films.odoo.com'). Odoo doesn't need any payment details for the trial, so once you've filled in the form, the company activates your account in seconds and kick-starts the setup process.",
    "Make your theme selection and it opens in Odoo's web console. This is generally very simple and straightforward, but Odoo does its best to make your life even easier with a simple tutorial - just follow the purple marker as it guides you through your initial web design steps.",
    "Odoo initially opens and displays your website as an active preview, rather than in the editor, and that's probably a good choice. Instead of being immediately confronted with cluttered and widget-packed sidebars, the bulk of the screen is available for viewing your site, and you can click page links or switch between mobile and desktop views with a click.",
    "Click on the Edit button, click in an area where you'd like to add content, and start typing. The sidebar on the right allows you to add content blocks. These start with basic page structures, including titles, banners, various arrangements of text columns and images, and more. But you also have additional specific and complex blocks at your disposal, such as Pricelist, and Call to Action.",
    "Whichever blocks you choose can be dragged and dropped onto the page as required, then moved as necessary. You can only place them in approved areas of the page, but the editor highlights these as you drag the block, so it's easy to see what you can do.",
    "Click on a block or an object within it to activate the sidebar’s Style tab. You’re given a vast amount of customisation options from this menu, as well as from the Option tab, which can help you turn a generic placeholder into something unique.",
    "When it comes to media-handling, you have access to a stock image library, but you can also upload images to your own dedicated Odoo server-based library, or import pictures from URLs, enabling them to be easily reused on other pages.",
    "Odoo's blogging platform requires installing a separate app before it becomes available. Find and install the app and it adds a Blog page to your website. Clicking on New opens a page where you can create your first post. It's all very easy - just enter the title, subtitle and go to work. Odoo’s blog uses its regular website builder editor, which means you're able to include all the same widgets and content blocks as any other page.",
    "Odoo doesn't give you any real control over the post, beyond entering the content. You can't organize posts into categories, for instance. There’s also no way to give a post a custom URL, or schedule it to be automatically posted at some future time. And when it’s online, there's no browser-based comments system. But on the plus side, it looks good, and is easy to use.",
    "Odoo's e-commerce app works in a very similar way. Installing it equips your website with a page called Shop, and the New button gains a 'New Product' option where you can create a page to describe whatever it is you're selling.",
    "At first it doesn't look like there's much else you can do, but that's only because Odoo hides most of its e-commerce power in the Settings dialog, and turns it off by default. Users who think to look there will find some very worthwhile tools, including the ability to create product variants (colour, size, etc), support customer wishlists, sell digital as well as physical content, configure tax and shipping rules, and more.",
    "Odoo’s interface is good, and provides for a lot of customisability, but there are some odd interface decisions which have not changed in years. Its app approach to website building is interesting, but can get extremely pricey the more functionality you add to your site, functionality which can be much cheaper elsewhere.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Getting started",
    "7": "Editor",
    "11": "Media",
    "12": "Blogging and ecommerce",
    "16": "Final verdict"
  },
  "links": {
    "Odoo": "https://www.odoo.com/app/website",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "number of users": "https://www.odoo.com/pricing",
    "main package": "https://www.odoo.com/pricing",
    "additional features": "https://www.odoo.com/pricing",
    "free 15-day trial": "https://www.odoo.com/trial"
  }
}