{
  "source": "https://www.techradar.com/reviews/greenhouse",
  "title": "Greenhouse review",
  "category": "computing",
  "updated": "2021-11-15T11:30:40Z",
  "author": "mike-jennings",
  "summary": "A recruitment tool that aims to make HR fairer and more approachable",
  "verdict": "Greenhouse provides an intuitive and equitable mix of data-driven insights along with a human touch but keep in mind that its recruitment and onboarding products are separated.",
  "pros": [
    "Loads of data options",
    "Great emphasis on equality",
    "Plenty of integrations options"
  ],
  "cons": [
    "Little pricing transparency",
    "Recruitment and onboarding are separated"
  ],
  "article": [
    "Greenhouse is a recruitment platform and Applicant Tracking System that aims to provide scalable and flexible options for businesses that are changing and growing quickly – and for companies that want to emphasize diversity and inclusion.",
    "Those are great ideas on paper, and Greenhouse offers onboarding products alongside its recruitment module – but there's no free product here, so you've got to do your research and make sure you're convinced before you start spending your company's money.",
    "Greenhouse's slate of recruitment features is impressive. Your job adverts can be posted on more than 1000 job sites, with the big names and niche outlets all covered, and Greenhouse provides recommendations on the best sites to use based on industry and historical performance. The app's focus on collaboration means you can easily tag colleagues in comments and share information. Granular control over tasks, workflows, and notifications allows hiring managers to stay in control of the hiring process.",
    "There's a big focus on equality in Greenhouse, too. Your applicants can pre-record correct pronunciations of their names and list their personal pronouns on applications, and you can develop your own preferred attributes for customizable filtering of candidates. Interviewers can access a kit to help them navigate the process accurately and thoroughly, and anonymized screening eliminates unconscious bias. You can see how candidates from different backgrounds handle your recruitment process, add custom questions to your job listings, and filter data by demographic.",
    "You can establish prompts to help your employees at specific points in the process – handy if you have inexperienced interviewers – and well-presented scorecards show crucial candidate data in a straightforward way.",
    "Greenhouse can help your company create bespoke career pages and automated surveys for candidates, and reporting using dozens of data points helps managers analyze the recruitment process.",
    "Elsewhere, Greenhouse has slick mobile apps, integration with Microsoft Teams, Google Meet and Zoom, job boards and interviewer experiences available in multiple languages, and a host of templates for job descriptions, offer emails, and rejection notes. Searches and reports can use loads of filters and options – Greenhouse provides more data than most recruitment packages and makes it accessible.",
    "Greenhouse is fantastic when it comes to integrations, too. This tool has more than 350 built-in integrations that cover every aspect of HR, so you'll be set if you need Greenhouse to work with different apps and tools.",
    "This tool is missing some features, though. Other services have more collaboration options, and the Greenhouse UI can be a bit fiddly and overwhelming for new users. Also bear in mind that you'll have to pay extra if you want access to Greenhouse's onboarding features, like welcome experiences, integration ecosystems and document handling.",
    "Greenhouse differs from rivals like Freshteam and Zoho Recruit by not having a free package. That's disappointing because a free option is often basic but entirely usable by small organizations with modest HR needs.",
    "The Greenhouse Recruitment product is divided into three tiers. The Essential plan offers the site's core functionality, from applicant tracking and task automation to reporting, the vast integration options, and the complete candidate experience. You get advanced anonymization and the essential diversity, equity, and inclusion set of features.",
    "The Advanced plan offers more data configuration and reporting alongside better career page options. The Expert plan adds better security, data, and the top tier of diversity, inclusion, and equity options.",
    "If you want the onboarding package, too then there are two access tiers to pay for. The first has the essential features like a candidate welcome experience and both onboarding plan and reporting modules, while the full option allows you to add better onboarding plans and integration tools.",
    "In terms of actual pricing, though, the Greenhouse website is vague. You'll have to contact the company directly if you'd like to talk to them about which plan is suitable and how much it'll cost for your particular business.",
    "Greenhouse does a good job of balancing a huge amount of data with a more human approach to recruitment, and it works well – Greenhouse has more equitable hiring options and more inclusion features than any of its rivals, and it has superb, detailed reporting too.",
    "Elsewhere, Greenhouse has a good selection of more conventional features and a brilliant range of integration options.",
    "The lack of pricing transparency and the division of recruitment and onboarding means that Greenhouse may not be the most affordable option for your business. But if you care about inclusive hiring, want to work with data, and need a product that will integrate with everything you can throw at it, Greenhouse is well worth your consideration.",
    "We've also featured the best recruitment platforms, best HR software and best background check services"
  ],
  "headers": {
    "2": "Features",
    "9": "Plans and pricing",
    "14": "Final verdict"
  },
  "links": {
    "Greenhouse": "https://www.greenhouse.io/",
    "recruitment platform": "https://www.techradar.com/best/recruitment-platforms",
    "job sites": "https://www.techradar.com/best/us-job-sites",
    "surveys": "https://www.techradar.com/best/best-survey-tools",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "job boards": "https://www.techradar.com/best/free-job-boards",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Freshteam": "https://www.awin1.com/awclick.php?awinmid=18171&awinaffid=103504&clickref=trd-us-1186671504993506600&p=https%3A%2F%2Fwww.freshworks.com%2Fhrms%2F",
    "Zoho Recruit": "https://www.techradar.com/reviews/zoho-recruit",
    "Essential": "https://www.greenhouse.io/pricing",
    "Advanced": "https://www.greenhouse.io/pricing",
    "Expert": "https://www.greenhouse.io/pricing",
    "best recruitment platforms": "https://www.techradar.com/best/recruitment-platforms",
    "best HR software": "https://www.techradar.com/best/best-hr-software",
    "best background check services": "https://www.techradar.com/best/background-check-services-sites-online"
  }
}