{
  "source": "https://www.techradar.com/reviews/box",
  "title": "Box cloud storage review",
  "category": "computing",
  "updated": "2021-05-25T20:46:08Z",
  "author": "mark-pickavance",
  "summary": "Making cloud storage more useful than just storage",
  "verdict": "Box brings to the table a host of tools and options for businesses looking to leverage their data in the cloud. It's packed with third-party integrations and security protections too, although it's less appealing for normal consumers, though everything is reliable and well designed.",
  "pros": [
    "Deep OS integration",
    "Top security protection",
    "Superb admin tools"
  ],
  "cons": [
    "Can get pricey",
    "Limited consumer options",
    "Some feature overlap"
  ],
  "article": [
    "One of the originals in the cloud storage space, Box has been busy doing file syncing and storing way before it was cool and the likes of Apple and Microsoft caught on. As a result, it's packed with oodles of features and options, and is available just about everywhere you're going to need it.",
    "Standing out from the crowd are Box’s business packages that make Box, but it does cater to consumers also. With a focus on syncing files inside of a dedicated folder, and not backing up entire systems and hard drives, and here's the lowdown on it.",
    "Taking the Dropbox approach to cloud storage, Box sets up a specific folder on your Windows or macOS computer, and then keeps all of its contents in sync with the cloud along with any other devices with Box installed. For a solution to back up absolutely everything on your hard drive with OS, settings and all, then look elsewhere as Box has different strengths.",
    "Similar to Dropbox, Box neatly integrates itself with File Explorer on Windows or Finder on macOS. The Box folder lives alongside other key folders on your system, with the choice to have all of your files downloaded for offline access, or to keep them online and transfer them when needed (a handy trick to maximize the free space of your local drive).",
    "The sharing of files and folders is a simple and straightforward task, whether you need to collaborate with other people on something or just for generating a link to be distributed to whoever needs it. Businesses can benefit as Box integrates smoothly with Office 365, Google Workspace, Adobe Creative Cloud among other software packages, and it's really at the business end of the spectrum where Box is the most impressive.",
    "Keeping this in mind, the team management features are par excellence: controlling access to files and folders, seeing who is collaborating on what, checking the use of files and data across an entire country, and so on. For a large company that has a need to manage cloud storage data in complex ways, Box is easily one of the best options out there, while remaining aware that for everyone else, it's not quite as compelling.",
    "The Box interface tends to stay basic and minimal across its multiple apps, but that's not necessarily a negative, as it is definitely polished and straightforward to use, although we would like to see a few more options and features up front rather than hidden behind menus. The software slickness carries through to the mobile apps for Android and iOS too, to easily get at your files from anywhere.",
    "Box really does feel fully integrated into the Windows and macOS operating systems - we really can't give it much higher praise than that. A downside to mention is that there's no way of throttling bandwidth use when you've got a pile of files to transfer. We did find the syncing process speedy and responsive though – as good as we could expect given our internet connection.",
    "The web experience is slick and easily navigated. Pulling up the most recent changes to your files can be done with ease, for example, along with creating a list of favorite locations within your Box folders that can get done with a click. Also appreciated is the auto-delete feature to set some files and folders to go away on a specific date (though you can only access this if you're on one of the paid-for packages).",
    "Additionally, Box interfaces well with third-party apps and plug-ins, blending into the background and feeling like a native feature and not an add-on. In plenty of situations, there isn't really a Box interface as such, which might be a plus or a minus against the service, depending on your perspective. Taken as a whole, the years that Box has had to refine its software offerings definitely is apparent.",
    "Box takes security very seriously indeed – there's AES 256-bit encryption as standard, and if you need full end-to-end encryption (so not even Box can get at your files in an emergency), it's available with an add-on. Two-factor authentication (2FA) is included here as well, which adds another layer of security to your account- even if someone manages to have your username and password.",
    "Each and every file transfer, login and even a Box application installation is tracked and logged, and by the addition of the full Admin console, you get even greater auditing and control options. Anytime a file or folder is accessed, you can be informed by email (so for example, when someone says they read your report, you’ll know that they're being less than truthful). Finally, a full range of compliance and regulatory tools are on offer as well, and it all adds up to a very secure and comprehensive service indeed.",
    "The options are aplenty from Box of paid-for plans to choose from, and that even includes a free tier – provided you can get by with 10GB of cloud storage and a file size limit of 250MB. Upgrade to the Personal Pro plan at a cost of $10/£7 a month with the annual discount, and that increases to 100GB of cloud storage and a maximum file limit of 5GB. However, compared to the competition, it's not particularly appealing when you consider the amount of storage that Apple, Microsoft, Google and Dropbox are providing for less.",
    "The business plans are $7/£5 per user month for Starter (100GB of storage), $20/£14 per user per month for Business (unlimited storage), $33/£23 per user per month for Business Plus (unlimited storage), and $47/£33 per user per month for Enterprise (unlimited storage). Those deals are much better value (you can save more if you pay annually), and 14-day free trials are available across all of them, but keep in mind that they are for a minimum of three users.",
    "Box certainly tailors its offering for the business market, even though it does have a couple of plans for consumers too. It's stacked with collaboration, data compliance and automations, and makes plenty of APIs available in case you need something bespoke. Certainly with one of the more expensive plans, with unlimited storage and useful tools, it's an appealing overall package.",
    "Alternately, for consumers that want to stretch every dollar, that money is arguably better spent elsewhere. Box's apps aren't quite as user-friendly as the ones offered by its rivals, and it gets expensive depending on what you need. While it's a great option for cloud storage and syncing, it's not a great option for everyone."
  ],
  "headers": {
    "2": "Box features",
    "6": "Box interface",
    "10": "Box security",
    "12": "Box pricing",
    "14": "Final verdict"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Box": "https://www.box.com/en-gb/home",
    "file syncing": "https://www.techradar.com/best/best-file-syncing-solution",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Adobe Creative Cloud": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "2FA": "https://www.techradar.com/news/what-is-2fa"
  }
}