{
  "source": "https://www.techradar.com/reviews/lg-xboom-go-pl7-bluetooth-speaker",
  "title": "LG XBoom Go PL7 Bluetooth speaker review",
  "category": "audio-visual",
  "updated": "2021-02-03T13:19:00Z",
  "author": "stephen-lambrechts",
  "summary": "Slick style and great sound at an affordable price",
  "verdict": "If you're after a great party speaker that's suitable for the beach or pool, LG's XBoom Go PL7 more than fits the bill thanks to its great sound, lengthy battery life, water resistance and handy wireless multi link features.",
  "pros": [
    "Punchy sound and sharp treble",
    "Splash-proof",
    "Long battery life",
    "Can be linked to multiple units"
  ],
  "cons": [
    "Only two sound profiles",
    "Can roll over easily",
    "Faint hiss at high volumes"
  ],
  "article": [
    "A direct competitor to the likes of JBL's Flip 5 and Sony's SRS-XB33 portable Bluetooth speakers, the LG XBoom Go PL7 has but one goal in mind: to get the party started.",
    "That isn't just a meaningless statement that could be applied to any speaker, but rather a statement of intent on LG's part.",
    "Apart from its fun multi-color lighting option (a feature shared by the aforementioned Sony speaker), the XBoom Go PL7 actually does bring party-specific features to the table, such as wireless party link and splash resistance.",
    "Along with its punchy Meridian-tuned audio and impressive 24-hour battery life, the LG XBoom Go PL7 is a great all-rounder for informal party situations, emphasizing fun over pin-sharp sound quality.",
    "Of course, the XBoom Go PL7 won't be for everyone – if your likely use case involves sitting in your den listening to classical music while sipping brandy from a snifter, then you're probably better off pursuing the cleaner tonality and acoustics offered by high-end bookshelf speakers.",
    "That said, if your tastes are more Spring Break than Strauss, you'll likely find the LG XBoom Go PL7 to be the perfect little party starter – especially when linked to additional units.",
    "LG's XBoom Go PL7 portable Bluetooth speaker opts for a classic pill-shaped design with a front-facing grill and small flattened base, along with sides that have been chopped off at an angle.",
    "While the PL7's base feels sturdy most of the time, anything less than a perfectly flat surface may see the pill-shaped speaker roll over easily.",
    "Rather than sport a pair of gaping holes at either end, the XBoom Go PL7 has springy caps placed on both sides which also act as passive bass radiators. These end caps, which also boast the color-changing ring lights, will rumble and vibrate depending on how pumping your music is.",
    "Despite its pill shape, we wouldn't recommend swallowing the XBoom Go PL7 – at 245 x 98 x 98mm, it's even larger than some competing Bluetooth speakers, including JBL's Charge 4 (220 x 95 x 93mm), which was already bigger than its sizeable predecessor, JBL Charge 3 (213 x 87 x 88.5mm).",
    "Along the top of the unit, you'll find a set of controls, including a power button, a Bluetooth pairing button, volume – and + buttons, a Play/Pause button and a dedicated button for switching on Sound Boost mode.",
    "USB Type C and Type A ports can be found under a plastic flap on the device's rear, along with an AUX port and buttons for Dual Mode (pairing two speakers together for stereo sound), Multi-Mode (pairing up to 100 speakers together) and for cycling through light brightness levels.",
    "Given the LG XBoom Go PL7 is aimed at party people, it comes as no surprise that the device offers IPX5 water resistance. That means that while you absolutely can splash water on the device (or even rinse it off under a running tap), you should refrain for completely submerging it underwater.",
    "At $129 (£169.99 / AU$259), the LG XBoom Go PL7 is priced a little higher than we'd like for what is essentially party speaker for young people, however, you're likely to find it cheaper if you search around.",
    "One thing that may surprise you about the LG XBoom Go PL7 is that it performs much better in the midrange than it does at lower frequencies. Despite the aforementioned bass radiators on each side of the speaker, and its 30W sound output, the LG XBoom Go PL7 isn't dominated by bass, opting instead to delivering a solid overall audio experience.",
    "This is likely due to the involvement of British sound Meridian Audio, which has lent its digital signal processing (DSP) technology to the device. Sonics are generally impressive on the PL7's Standard audio setting, with sharp treble and punchy dynamics providing a moderately energetic soundstage.",
    "Pleasingly, the PL7 offers a clear emphasis on vocals, which are brought front and center during playback, regardless of your chosen style of music. You also get an additional Sound Boost mode, which brings a little more depth the PL7's audio output, along with significant increase in loudness.",
    "Boasting up to 24 hours of playback on a full charge (without lighting), LG's XBoom Go PL7 is unlikely to let you down in the middle of a party.",
    "That puts it well ahead of many other competing Bluetooth speakers on the market, including the UE Boom 3, which gives you around 20 hours of continuous playback.",
    "Of course, switching on the PL7's lightshow will reduce the battery somewhat, as will playihg the speaker at high volumes.",
    "As mentioned earlier, LG's XBoom Go PL7 supports Wireless Party Link, allowing for up to 100 units of PL7 or PL5 speakers to be linked together – a handy feature that would serve even the biggest of parties.",
    "Additionally, you can achieve a surround sound effect in your living room by pairing up to two PL7 speakers to your LG TV (so long as it's compatible).",
    "In terms smart features, the XBoom Go PL7 offers access to your smartphone's Google Assistant, Amazon Alexa or Siri voice assistant by holding down the speaker's Pause/Play button.",
    "As welcome as the feature is, it's rather sluggish in its execution, sometimes taking several seconds for your phone to register the command.",
    "Additionally, the PL7 is supported by LG's free XBoom app for Android and iOS, though its usefulness is admittedly limited.",
    "You won't find any EQ settings here beyond the aforementioned Standard and South Boost modes, however, it does allow you to have more direct control over the speaker's lighting.",
    "LG's XBoom Go PL7 offers impressive audio and fantastic battery life that will keep the party going for hours on end. The ability to link up to 100 units together is incredible novel, and its water resistance is very welcome.",
    "While the PL7 sounds great overall, we would've appreciated some additional EQ settings that would have allowed us to get a more personalized listening experience. We were also put off by the faint hiss that crops up when the device is played at higher volumes.",
    "LG's XBoom Go PL7 is the perfect portable Bluetooth speaker to take to the beach or your next pool party, offering great audio, long battery life, splash resistance, wireless party link features and even a funky multi-color light show.",
    "Purists will bemoan its lack of EQ customization options, and we weren't fans of the faint hiss sound that happened at high volumes, but the LG XBoom Go PL7 is clearly a speaker that emphasizes fun over everything else. In that regard, it's a winner."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "LG XBoom Go PL7: design and price",
    "14": "LG XBoom Go PL7: audio performance",
    "17": "LG XBoom Go PL7: battery and other features",
    "26": "We liked",
    "27": "We disliked",
    "28": "Final verdict"
  },
  "links": {
    "Flip 5": "https://www.techradar.com/reviews/jbl-flip-5",
    "SRS-XB33": "https://www.techradar.com/reviews/sony-srs-xb33",
    "bookshelf speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "JBL's Charge 4": "https://www.techradar.com/reviews/jbl-charge-4",
    "JBL Charge 3": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/jbl-charge-3-bluetooth-speaker-1324500/review",
    "UE Boom 3": "https://www.techradar.com/reviews/ultimate-ears-boom-3"
  }
}