{
  "source": "https://www.techradar.com/reviews/belkin-soundform-true-wireless-earbuds",
  "title": "Belkin Soundform True Wireless Earbuds review",
  "category": "audio-visual",
  "updated": "2021-02-05T17:11:23Z",
  "author": "jennifer-allen",
  "summary": "Affordable performance comes with some concessions",
  "verdict": "The Belkin Soundform True Wireless Earbuds are an affordable pair of true wireless earbuds that do the job. They offer merely okay audio performance but a comfy fit and a low price means you might be willing to accept that.",
  "pros": [
    "Cheap",
    "Comfy fit",
    "Decent battery life"
  ],
  "cons": [
    "No USB-C support",
    "Controls are fiddly",
    "Unremarkable audio performance"
  ],
  "article": [
    "Belkin is a name we're more accustomed to seeing attached to networking equipment and chargers. In recent times though, the firm has branched out tentatively into the headphones / earphones market with the Belkin Soundform True Wireless Earbuds and Belkin Soundform Freedom True Wireless Earbuds, with the former being the brand’s budget wireless earphones.",
    "Clearly designed for affordability rather than anything else, they won't stick out in your memory, but if you're on a budget and not too worried about audio performance, these do the job.",
    "At only $59.99 / £59.99 / AU$87, they certainly won't break the bank and we've already noticed hefty discounts at third-party retailers like Amazon. These are ideal if you simply need a stopgap between superior true wireless earbuds or if you're not sure whether in-ear headphones are for you.",
    "With a comfy fit and a lightweight design, the Belkin Soundform True Wireless Earbuds certainly feel the part initially. Setup is a breeze too, taking moments to pair up with our devices. IPX5 sweat and water resistance is becoming a commonplace feature, but it means you can use these earbuds for working out, and it beats the Apple AirPods’ IPX4 rating. We didn't need the extra eartips bundled with the earphones, but they were similarly simple to swap in and out.",
    "Where the Belkin Soundform True Wireless Earbuds falter most is the controls. A series of double and triple taps on the small earbuds is fiddly and far from accurate. Invariably, you'll find yourself gravitating to the device they're connected to in order to be able to do anything. Despite a snug fit while wearing them, it's all too easy to dislodge the earbuds through this series of taps.",
    "Similarly, the audio performance isn't great. It's fine. The perfect definition of okay. Music will sound reasonable enough but there's a lack of heart and oomph in there. Of course, this is much less of an issue when listening to audiobooks or podcasts, but for music, you'll wish your favorite track had a little more power going on. A lack of detail and finesse for tracks from Under Pressure to Childish Gambino's Feels like Summer will slowly bug you, making you feel like you're not getting the true experience of such songs. It's all a little subdued with no grand soundstage to speak of, nor great enthusiasm.",
    "And, of course, there's no active noise cancellation here – only noise isolation.They block off some surrounding sound but again, don't expect miracles from such an inexpensive pair of earbuds.",
    "While we're pointing out flaws, there's also no USB-C support for recharging. We're willing to forgo wireless charging support via the case given the low asking price but relying on micro-USB when other earphones of this price manage to include USB-C is an annoyance. It means that recharging takes longer than you'd like, although at least the case and earbuds can offer up to 24 hours of battery life overall. That means you won't need to recharge too often but don't expect speedy refreshes here.",
    "The case itself offers a simple set of four LED lights with each representing how much charge you have left in the case. It's simple and straightforward to glance at.",
    "In a way though, it all feels a little churlish to condemn the Belkin Soundform True Wireless Earbuds too much. They're surprisingly cheap to track down only a few months into their lifespan and that certainly makes them more endearing.",
    "Your mileage will mostly come down to how you plan on using them. Daily runner and love to lose yourself in the magic of music? Treat yourself to something better. You've earned it. However, if you're only an occasional user of wireless earbuds and simply want something convenient, you could do a lot worse than the Belkin Soundform True Wireless Earbuds.",
    "The Belkin Soundform True Wireless Earbuds are available in the USA and the UK now. Priced at $59.99 / £59.99, they've already seen some discounts at third-party retailers such as Amazon. They're also available in Australia via Belkin’s Amazon store, and at the time of writing, cost AU$87.",
    "The earbuds are available in either white or black, so we wouldn't be surprised if one variant ends up cheaper than the other as time goes by.",
    "The Belkin Soundform True Wireless Earbuds have skipped trying to emulate Apple AirPods like so many other earbuds. Instead, they favor a more chunky design that feels a little safer in your fingers.",
    "The earbuds come with spare silicone tips in different sizes so you can find the right fit for you, although we found the standard one was perfect for our relatively small ears. The earbuds are very lightweight and easy to slide into your ears with minimal hassle.",
    "The carrying case is your typical plasticky container but it feels a little heavier than others so at least it feels reasonably robust. Unfortunately, the carrying case doesn't support wireless charging so you'll need to plug it in via micro-USB to do so. Yes, micro-USB. It feels outdated but we guess it does the job, albeit slower than USB-C would.",
    "The Belkin Soundform True Wireless Earbuds offer IPX5 sweat and water resistance which is great if you're working out hard or you're liable to get caught in a rain shower, but won't be up to scratch when swimming or submerged in any way. That's fair enough at this price point, though.",
    "Controls-wise, the Belkin Soundform True Wireless Earbuds uses touch-sensitive controls on the earbuds. It's a somewhat complicated and inaccurate mixture of taps, double taps, and triple taps to get things done. You may get used to it but we won't blame you if you stick to using the controls on the device these are paired with instead. There's voice assistant support at least, which can come in handy if you'd rather say ‘'hey Siri' or similar than tap.",
    "The controls are placed at the top of each earbud so if you're careful in placing the earbuds in, you won't have any issues with accidentally whacking up the volume.",
    "You know when you listen to a great piece of music through equally great speakers or headphones? You feel alive because of how powerful it all feels? The Belkin Soundform True Wireless Earbuds aren't like that. They're the height of ‘okay’. Perfectly adequate in every sense but in that kind of way that makes you glance at the price tag and think 'yup, fair enough'.",
    "Stick The Beatles' Come Together on and you won't feel inspired to unite and enjoy the wonders. Instead, you'll marvel at how the bass isn't particularly powerful but it does the job. Just about. There's no punchiness at all here. Similarly, pick out a track like David Bowie's Under Pressure or Childish Gambino's Feels Like Summer and you won't notice those fine detailed mids. It's all okay but there's no magic.",
    "Fortunately, the Belkin Soundform True Wireless Earbuds are also far from harsh. Nor are they excessively bassy. They're just so solidly middle-of-the-road that you won't feel any particularly strong emotion either way about them. It's all curiously soulless and functional.",
    "Such performance works well when listening to podcasts or audiobooks at least, although we'd have appreciated better performance when taking calls. The latter is a little faint.",
    "The Belkin Soundform True Wireless Earbuds are fairly respectable when it comes to battery life. With promises of up to 5 hours of non-stop playtime, we found that to be roughly the case. The case itself offers up to 24 hours of battery life which is good because you won't want to recharge it too often thanks to that outdated micro-USB connectivity rather than USB-C – and it’s better than the AirPods.",
    "Connectivity is unremarkable, which is exactly how you want it to be. No one wants pairing their earbuds to be memorable – they simply want it to just work. We didn't experience any outages either. It's useful too to be able to use each earbud separately if need be."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Belkin Soundform True Wireless Earbuds price and availability",
    "13": "Design",
    "19": "Audio performance",
    "23": "Battery life and connectivity",
    "25": "Don't buy them if..."
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "earphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Belkin Soundform Freedom True Wireless Earbuds": "https://www.techradar.com/news/belkin-unveils-soundform-freedom-tws-and-boostcharge-pro-wireless-charger",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "podcasts": "https://www.techradar.com/news/best-podcasts",
    "audiobooks": "https://www.techradar.com/best/the-best-audio-book-sites"
  }
}