{
  "source": "https://www.techradar.com/reviews/fitbit-versa-3",
  "title": "Fitbit Versa 3 review",
  "category": "fitness",
  "updated": "2021-06-04T15:02:38Z",
  "author": "sharmishta-sarkar",
  "summary": "With the Versa 3, Fitbit finally adds GPS to its most popular smartwatch",
  "verdict": "With integrated GPS and some design tweaks, the Fitbit Versa 3 is an excellent wearable. Like its predecessor, though, it’s more a fitness tracker than a smartwatch, with very limited productivity apps on offer. What you do get is great battery life, a better display than before, and a plethora of fitness statistics, making this a very compelling and affordable Apple Watch alternative. However, given this is the third iteration of the popular Versa line, it's a little disappointing that Fitbit is still not quite hitting the mark in some areas.",
  "pros": [
    "Beautiful display",
    "Built-in GPS",
    "Lightweight and comfortable"
  ],
  "cons": [
    "Poorly designed side button",
    "Requires Fitbit Premium subscription to unlock advanced features",
    "No offline Spotify support"
  ],
  "article": [
    "Update: In June 2021, Fitbit released a new firmware update for the Fitbit Versa and Fitbit Sense that added new features including audible Google Assistant notifications, new celebration animations and, for some Fitbit Premium users, a tool that detects snoring and ambient noise at night. Original review follows.",
    "The Fitbit Versa 3 finally fixes our biggest gripe about the Versa line of smartwatches. The Versa 3 now comes with integrated GPS to track – in real time – the pace and distance of your walks, runs, bike rides or hikes if you choose to leave your phone behind, which has earned it the top spot in our roundup of the best Fitbits.",
    "While that’s definitely a step up from the Versa 2, as is the larger and truly gorgeous display, there are still little things about the Versa 3 that make it oh-so-frustratingly-close to being one of the best wearables on the market.",
    "Don’t get us wrong – the Versa 3 is a serious contender to be the best fitness wearable on the market, especially given its relatively affordable price tag and the plethora of fitness tracking capabilities it has, which also includes an SpO2 sensor to measure blood oxygen levels while you sleep. However, a lot more useful information is locked behind the Fitbit Premium paywall, and the redesign of the side button has made it frustrating to use.",
    "Instead of a physical button, like there is on the Versa 2, there’s now an indent on the left side of the chassis that’s similar to the inductive button that debuted on the Fitbit Charge 3. Unfortunately, it’s not as well implemented on the Versa 3, and it takes a few tries to find the exact spot you need to press to bring up apps and sub-menus.",
    "Other than that, though, the Versa 3 is a beautiful wearable that does a lot of what the Fitbit Sense can do, with the exception of stress management and advanced heart monitoring. That means it’s cheaper than the Sense, although it is slightly more expensive than the Versa 2 in some markets (it costs the same £199 in the UK as its predecessor). However, built-in GPS, a larger 1.58-inch AMOLED display (the same as the one on the Sense) and an SpO2 sensor more than justifies the slightly higher launch price of $229 / AU$399.",
    "There’s also a lot more fitness monitoring features on the Versa 3, making the on-device interface a lot busier than what was available on the Versa 2 at launch. There are ways to manage them all, but they do take time to get used to.",
    "Despite that, performance is excellent, as we've come to expect from Fitbit devices. Battery life is about six days on a dim screen setting, but it drops to half that if you have the display set to always-on. GPS isn't as pinpoint accurate as on some other bands we've reviewed, but for the average user that won’t matter very much. The heart rate monitor is now a bit more precise than the Versa 2, but without a chest strap to compare, it’s hard to judge exactly how accurate it is.",
    "Alexa is, of course, on board to help you answer some questions that are displayed on the device, and with Google buying Fitbit, a firmware update some time in the future will add Google Assistant to the wearable as well.",
    "There’s still a dearth of productivity apps for Fitbit’s smartwatches but, as we said in our Versa 2 review, these are first and foremost fitness trackers that have a few smartwatch perks.",
    "Fitbit announced the Versa 3, along with the Sense and the Fitbit Inspire 2, at a virtual conference in August 2020. It went up for pre-order the following day and began shipping by late September. The Versa 3 is currently available to buy directly from Fitbit and from major retailers around the world.",
    "Interestingly, in the UK, both the Versa 2 and the Versa 3 are listed for the same price of £199. In the US and Australia, though, the Versa 3 carries a higher price tag than its predecessor, retailing for $229 and AU$399 respectively. That makes the Versa 3 the middle child – it’s no longer the flagship, with the Fitbit Sense taking over that role and costing a lot more at $329 / £299 / AU$499.",
    "Unlike the Versa 2, which had a more expensive Special Edition version available, the Versa 3 comes in just the standard issue in three different colors – two soft gold cases with a Pink Gold and Midnight Blue strap, and a black chassis with a black band.",
    "At first glance the Versa 3 looks identical to its predecessors, but a closer look reveals a few design tweaks that make the new device a bit sleeker. In fact, a change in the color of the aluminum chassis makes the Versa 3 look rather elegant. The ‘soft gold’ case is neutral, but a black option keeps the Versa 3’s universal charm.",
    "The change in chassis color isn’t the biggest design change though; it’s the size of the screen. The display is now a larger 40mm AMOLED panel as compared to the 39mm on the Versa 2, with a higher resolution of 336 x 336 pixels (the Versa 2 is 300 x 300). It’s a bright, crisp and very clear display that looks absolutely stunning even at its ‘dim’ setting at pretty much any viewing angle. The bezels, though, still remain quite thick, similar to the Versa 2.",
    "Navigating through the menus and apps via the screen is also a walk in the park – not once did the screen lag during our testing period, and swiping to bring up different functions works remarkably well.",
    "Another design change is the side button, or rather the lack thereof – and it’s perhaps our biggest complaint about the Versa 3. Instead of a physical button, there’s a capacitive indent on the left side of the watch that, when pressed correctly, sends a short vibration to indicate you’ve activated the smartwatch. It’s located below the lip of the chassis, so you need to feel for it, and finding the exact spot to press is not especially easy. We've been using the Versa 3 for over a month now and we still need a few tries to find the exact spot. Thankfully, you don’t always need to use this “inductive” button to interact with the watch – you can set the watch to wake with a tap on the screen, then swipe to bring up whichever menu you need. That said, there are ‘shortcuts’ (like bringing up Alexa) that can be set on the watch, and these require either a tap-and-hold or double-tap-and-hold action to activate them. And they can be frustrating to bring up due to that button inconsistency.",
    "On the right edge of the watch chassis is a tiny mic and a speaker which, in theory, should allow you to take calls.",
    "Fitbit has also changed the strap mechanism – the same as in the Fitbit Sense – and we think it’s better than the mechanism on the Versa 2. A small button acts as a latch, which when pulled slightly down releases the clasp. It gives the watch a much more streamlined look and makes it remarkably easy to swap out the default sporty strap it comes with.",
    "This silicone strap is also different to the one that comes with the standard edition of the Versa 2. Fitbit calls this new model the \"Infinity Band\", as it lacks a buckle – it’s the same one that ships with the Sense as well.",
    "Another major difference between the Versa 2 and the new iteration is the charger. Instead of the older box-like USB charger, there’s a small magnetic dock that tops up the juice extremely quickly – we went from 64% battery to 100% in under 15 minutes.",
    "The Versa 3, like its predecessor, is also water resistant to 50m/164ft – meaning you can wear it in the shower or head out for a swim with it on your wrist. It can even survive a dip in salt water, although Fitbit recommends you not wear it in a hot tub or sauna.",
    "As a smartwatch, the Versa 3 functions exactly the same as its predecessor. It’s still a pared-back, no-frills experience as compared to something like an Apple Watch, but there should still be enough apps to keep many users happy. For example, a Philips Hue app is available to control smart lights, and there's a map app as well. That said, some apps are geo-specific to the US, UK or other regions, so the range of apps available to you will vary depending on your location. Fitbit Pay, though, should be a convenient option for most countries, with many banks around the world now supporting the cashless payment method.",
    "It's worth reiterating that many of the better Fitbit apps are paid, just as they are on Apple Watch or Android Wear OS devices, so you'll need to pony up if you want some of the expanded functionality they provide.",
    "Fitbit has a decent range of clock faces to choose from, so it should be easy to find something you like... although strangely, switching to a new face takes a while to apply. Amazon's Alexa is also on board to help with quick questions and, if you set up the Alexa app on your phone and sync your Amazon account, you can do a lot more, like set reminders and control your smart home devices. With Google set to buy Fitbit, Google Assistant support is also due to be added, but there's no firm timeline on when that is due to occur yet.",
    "As before, there's Deezer and Spotify music-streaming support available, but if you’re leaving your phone behind when on a workout, the only way to get access to your tunes offline is via Deezer. There’s still no offline Spotify feature, which is certainly quite disappointing.",
    "With a built-in mic and speaker, you should, in theory, be able to take calls, although at the time of writing we were unable to test this functionality. We were able to answer an incoming call, but it seems Fitbit needs to enable this feature so users can use the device’s Bluetooth connection to their phone to speak to a caller (and hear them) by just raising their wrist close to their mouth. Fitbit lists this feature as \"coming soon\" on its website, so we’ll update this review when the company rolls out a firmware update to fully enable it.",
    "As before, you’ll get all your phone notifications on your wrist, and you can choose which apps can push notifications to the Versa 3 in the Fitbit app. Most commonly used messaging apps are supported, including Slack and WhatsApp, along with emails and Uber.",
    "Android users can reply to text via the Versa 3 with a handful of preset messages, but iPhone users don’t have that option. If you're an iOS user and keen on more smartphone functionality from a wearable, then you could consider opting for the Apple Watch SE. Unfortunately, having an onboard mic doesn’t mean you’re able to dictate messages and send them on any platform.",
    "Like the previous iteration, fitness and health are the areas where the Versa 3 shines. Admittedly, it doesn’t have as many health tracking features as the Sense does, but there’s enough here for the average user to stay on top of things, thanks to 24/7 activity and heart monitoring.",
    "There are guided breathing exercises available now, with ways to track your mindfulness and the ability to listen to meditation tracks on the Fitbit app. You can set up hourly reminders to move around a little, set your fitness goals and keep tabs on your sleep quality. The Versa 3 will also monitor your blood oxygen level while you sleep (provided you wear the device to bed), and this can be important in detecting disorders like sleep apnea.",
    "Your daily activities are broken down into step counts, steps taken, calories burned and zone minutes. You can get a pretty good picture on how you’re tracking, but if you want to delve deeper, you’ll need to be a subscriber to the Fitbit Premium service, which costs $9.99/£7.99/AU$15.49 per month. This gives you access to the new Health Metrics dashboard that offers advanced statistics on breathing rate, oxygen saturation and heart rate variability. While you won’t get notifications when your heart rate spikes (like on the Sense), there will be a record of it in case you’re monitoring yourself closely. Like the Sense, the Versa 3 vibrates when you’re moving between heart rate zones – useful when you’re working out and can’t keep looking at the clock face to check your pulse.",
    "There are several workout options to choose from, including circuit training and interval workouts, covering most people’s needs. As mentioned earlier, you can even wear the Versa 3 during a swim, either in the pool or the sea.",
    "And now, thanks to the Versa 3’s onboard GPS, all your outdoor activities can be mapped in real time. The GPS isn’t always very precise and does momentarily drop out, but despite that it’s a huge step up from the Versa 2. Keep in mind that the GPS only gets activated when you select a workout mode manually. Fitbit’s SmartTrack feature – which automatically detects and records movement that’s 15 minutes or longer as exercise – will not activate the GPS. Maps are available on the Fitbit app almost immediately after you’ve ended the exercise, with pace, heart rate and calories burnt graphically denoted as well.",
    "Battery life is another thing Fitbit does really well, far better than Apple or Samsung. Like the Versa 2 before it, the Versa 3 offers up to 6 days of juice on a full charge, with the display set at normal brightness and the GPS being used no more than 2-3 times a week. The more you use the GPS, though, the quicker the battery drains; we measured a roughly 8% drop for 30 minutes of GPS use.",
    "Keeping the screen always-on, though, drains the battery significantly, giving you no more than two days on a full charge. And if you use the GPS combined with the always-on display, you’ll need to charge the battery every day.",
    "When the Versa 3’s battery needs some juice, topping it up is thankfully very quick. As we mentioned earlier, a 15-minute stint on the new USB charger gave us 36% more power.",
    "First reviewed October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Fitbit Versa 3 price and availability",
    "13": "Design and display",
    "22": "Smartwatch features",
    "29": "Fitness and health tracking",
    "34": "Battery life",
    "37": "Don't buy it if..."
  },
  "links": {
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "best Fitbits": "https://www.techradar.com/best/the-best-fitbit",
    "Versa 2": "https://www.techradar.com/reviews/fitbit-versa-2-review",
    "best fitness wearable": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "Fitbit Charge 3": "https://www.techradar.com/reviews/fitbit-charge-3",
    "Fitbit Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2-test",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review"
  }
}