{
  "source": "https://www.techradar.com/reviews/raya-and-the-last-dragon",
  "title": "Raya and the Last Dragon review",
  "category": "entertainment",
  "updated": "2021-03-01T17:00:13Z",
  "author": "tom-power",
  "summary": "Does Disney’s latest animated feature sink or swim?",
  "verdict": "Raya and the Last Dragon has almost everything that you’d expect from a traditional Disney film. Some fans will feel let down by its notable lack of musical numbers and laughs-per-minute humor, but its thought-provoking plot and celebration of Southeast Asian culture offers something unique to Disney’s catalog.",
  "pros": [
    "Animation is on point",
    "Emotional plot tugs at the heartstrings",
    "Cast works well together"
  ],
  "cons": [
    "Humor is hit and miss",
    "Some action sequences are all-too-brief",
    "Lack of traditional songs will disappoint some fans"
  ],
  "article": [
    "Raya and the Last Dragon represents a significant milestone for Walt Disney Animation Studios. With the Covid-19 pandemic impacting the film industry, Disney’s latest animated feature is the first to be completed remotely, with over 900 employees animating, problem solving, and conducting other vital work from home.",
    "It’s a testament to the team’s work, then, that this sudden change in working circumstances doesn’t really show. Raya and the Last Dragon bears the hallmarks you would expect from a Disney production, and its celebration of Southeast Asian culture - albeit set within a dark story by their standards - is another step on the company’s redemptive journey towards greater representation within its movies.",
    "Raya and the Last Dragon takes place 500 years after a potentially world-ending event. Historically, humans lived peacefully alongside dragons, but the emergence of the Druun - a mindless plague born of darkness - threatened to destroy life as they knew it. As the dragons fought bravely to protect humanity, the fabled Sisu (Awkwafina) concentrated her magic into the Dragon Gem - a stone of immense power - and, with a single blast, eradicated the Druun. Those humans who had been turned to stone by the Druun came back to life, but the dragons who had perished did not.",
    "With only one source of dragon magic left in the world, humanity fought over the precious gem, which resulted in the land of Kumandra being divided into five regions. Generations later, after a seemingly harmonious gathering of the tribes - brokered by Heart Lands chieftain Benja (Daniel Dae Kim) - goes wrong, the Dragon Gem is broken into five pieces, allowing the Druun to return. The titular Raya (Kelly Marie Tran) now seeks out Sisu, the last dragon, to rebuild the gem, destroy the Druun for good, and be reunited with her father Benja after the Druun turned him to stone.",
    "As you’d expect from a Disney production, Raya and the Last Dragon looks gorgeous. The movie’s brief 2D segments, much like the tattoo scenes in 2016’s Moana, are as polished as its 3D elements, and add a refreshing change of pace when they are utilized. Raya’s 2D sequences and images are mainly reserved for its historical context, but it works well in separating the present day events from those that took place in Kumandra’s past.",
    "Speaking of Moana, that movie’s water animation effects have been improved further in Raya and the Last Dragon. Given the significance of water as a life-giver in Southeast Asian culture, ensuring that the aquatic flow, ferocity, and reflections in each had to be on point. Thankfully, every river, waterfall, and rainstorm looks as realistic as can be expected.",
    "That extends into the film’s other Southeast Asian values and heritage. For the most part, Raya and the Last Dragon authentically replicates these elements well. Combat styles employed by Raya and adversary Namaari (Gemma Chan), such as Pencak Silat and Muay Thai respectively, have their roots in Malaysia and Thailand, while food items including a take on Thailand’s Tom Yum soup feature heavily throughout. Add in historically accurate clothing, architecture, and traditions - such as the removal of footwear in spiritual places - and Raya and the Last Dragon is a film steeped in Asian culture.",
    "It’s indicative of Disney's strides towards promoting inclusion within its fictional worlds. The utilization of a Southeast Asian Story Trust - composed of experts and Disney’s own employees with roots in that region - and visits to Vietnam and Indonesia, among other Southeast Asian nations, have paid dividends in that respect.",
    "That isn’t to say that Raya and the Last Dragon gets everything right. The movie has drawn criticism from some quarters for its lack of Southeast Asian actor castings, and it’s a valid concern to raise given that the movie is based upon this region. Raya’s cast ultimately sticks the landing - more on this later - but it feels like Disney missed an opportunity, here.",
    "The humor on offer is very hit and miss, too. There are some laugh out loud moments in Raya, but for every one of those, there are two or three jokes that struggle to land. It feels as if the movie’s dark, underlying tone of mistrust and disunity - one that hits close to home thanks to 2020’s worldwide upheaval - took precedence over its lighthearted schtick. Awkwafina’s goofy portrayal of Sisu aside, Raya and the Last Dragon fails to raise more than a smile in most instances.",
    "While Raya’s comedic moments aren’t all that, its cast thrives everywhere else. Tran and Awkwafina’s buddy relationship is a joy, and the juxtaposition between Raya’s cynical worldview and Sisu’s optimism work well in tandem. Chan’s portrayal of the conflicted Namaari, too, is solid, while Izaac Wang and Benedict Wong - as Boun and Tong - provide strong supporting roles. Alan Tudyk is on fine form with his animal roar repertoire for Raya’s armadillo-cum-dog companion Tuk Tuk, and it wouldn’t be surprising if stuffed toy versions of Raya’s steed fly off the shelves, such is his cute demeanour.",
    "Unlike Disney’s other recent original productions, Raya and the Last Dragon doesn’t come packed with musical numbers. That will be a disappointment - or relief - to some, but the lack of traditional sing-along tunes doesn’t hinder the plot. If anything, it helps the story to flow, and James Newton Howard’s score lends plenty of gravitas to emotional scenes and action-based sequences.",
    "Of those action-oriented moments, it’s the choreographed battles that stand out. Raya’s chase sequences are par for the course and all-too-brief, but skirmishes between Raya and Namaari - thanks to those real-world fighting styles - fit seamlessly into Kumandra’s fictional world. One such example plays out during the film’s emotionally charged, action-packed finale, but it ends up taking a backstage role as Raya’s merry band of outcasts attempts to stop the wider Druun threat.",
    "Raya and the Last Dragon utilizes Disney’s tried and tested formula to tell a compelling if clichéd story. Its attempt at cultural representation mostly hits the mark but, while there’s plenty to like about the company’s latest animated feature, some viewers may feel a tad underwhelmed by its lack of sing-along moments, humor, and lengthy action sequences.",
    "Really, though, it’s the film’s emotional core that is its biggest draw. Raya’s themes of working together and building trust, and its resemblance to more mature, old school 2D flicks including The Lion King, feels emblematic of our times. That's because it pedals the line that humanity’s greatest foe is itself, and it’s hard not to take stock of its moral message as the credits roll.",
    "Some viewers may be underwhelmed by that point, but families will certainly enjoy it for what it is.",
    "Raya and the Last Dragon is in cinemas where available, and on Disney+ with Premier Access, from March 5."
  ],
  "headers": {
    "4": "Amazing animation and authentic influences",
    "8": "Misfiring humor, striking set-pieces",
    "13": "Verdict"
  },
  "links": {
    "drawn criticism": "https://www.whattowatch.com/features/disneys-raya-and-the-last-dragon-has-an-east-asian-problem"
  }
}