{
  "source": "https://www.techradar.com/reviews/samsung-qn95a-neo-qled-4k-tv",
  "title": "Samsung QN95A Neo QLED 4K TV review",
  "category": "televisions",
  "updated": "2021-12-03T11:07:19Z",
  "author": "stephen-withers",
  "summary": "Mini LED takes QLED to the next level",
  "verdict": "Samsung’s first foray into Mini LED is a resounding success, with this Neo QLED TV delivering blacks that give OLED a run for its money, and highlights that are free from blooming. A stylish design and comprehensive feature-set make for an impressive 4K TV that’s sure to please.",
  "pros": [
    "Stellar picture quality",
    "Impressive sound system",
    "Superb gaming features"
  ],
  "cons": [
    "No Dolby Vision or Atmos",
    "Freeview Play would be nice"
  ],
  "article": [
    "Voted Best TV for Gamers and Films at the TechRadar Choice Awards 2021",
    "The Samsung QN95A is the company’s new flagship Neo QLED 4K TV for 2021, and the first to embrace a Mini LED backlight. Not to be confused with Micro LED, which is a completely different self-emissive display technology, Mini LED uses a newly-developed backlight that’s much smaller and more efficient, resulting in a significant increase in dimmable zones and thinner panels.",
    "The results speak for themselves, with superb SDR and HDR images that benefit from deep blacks and brighter highlights, all of which are delivered without blooming or loss of shadow detail. The inclusion of quantum dot technology delivers saturated and nuanced colours, and thanks to the Filmmaker Mode these images are also extremely accurate.",
    "Unlike 2020, Samsung is not short-changing its 4K line-up in an effort to push sales of the 8K ranges. So the QN95A boasts an impressive set of features, which is headlined by a well-designed and comprehensive smart platform that includes every major streaming app. There’s also a host of cutting-edge gaming features that’ll please next-gen console owners.",
    "The QN95A doesn’t just look good, it also sounds fantastic thanks to Object Tracking Sound Plus (OTS+), which somehow manages to cram a powerful 4.2.2-channel sound system into the TV’s ultra-slim chassis. This is another triumph of industrial design from Samsung, with a minimalist but elegant shape, solid metal stand, and nearly bezel-less screen.",
    "Given the excellent audio capabilities, it’s a shame there’s no onboard Dolby Atmos decoding for this new Samsung TV, and Samsung’s continued refusal to embrace Dolby Vision remains a source of frustration, but otherwise the only real complaint is a lack of Freeview Play support. However, overall this is a superb new model, and successfully lays down the Mini LED gauntlet.",
    "The Samsung QN95A is the flagship Neo QLED 4K TV for 2021, and comes in a choice of 55-, 65-, and 75-inch screen sizes. The model reviewed here is the 65-inch QE65QN95A, which retails for £2,999 – though it's also available in 50-inch, 55-inch, 75-inch, and 85-inch sizes.",
    "You probably won't get it in the US, given its predecessor, the Q95T, never made it stateside – but you will be able to get it in the UK, and we expect it to come to Australia soon.",
    "The Samsung QN95A continues the elegant and minimalist design ethos introduced last year, with a slim panel and virtually no bezel. Considering there’s a full-array Mini LED backlight and eight speakers behind the panel, it’s a wonder Samsung has managed to squeeze everything into a chassis only 15mm deep.",
    "The stand is easy to assemble and complements the overall aesthetic. It’s also fairly heavy, providing robust and stable support. If you prefer, you can wall mount the QN95A using the optional ‘No Gap’ bracket, with the single cable from the clever One Connect box making installation easy, stylish and tidy.",
    "The One Connect box itself has been slimmed down, and is now sleeker and more elegant. The reduced size also makes it more discreet, allowing the box to be easily hidden away if necessary. The textured matte black finish is another welcome addition, replacing the earlier glossy black boxes, which were a magnet for fingerprints and smudges.",
    "The box houses four HDMI inputs, one of which (HDMI 3) supports eARC. All of the HDMI inputs are capable of handling up to 40Gbps, which means they can accept 4K/120Hz, VRR and ALLM. While not full HDMI 2.1 connections, they offer sufficient bandwidth, making this TV a great choice for next-gen gamers who want to take full advantage of their new console or consoles.",
    "In terms of other physical connections, it’s a fairly standard selection with two USB 2.0 inputs, twin tuners for terrestrial and satellite broadcasts, a CI slot, an optical digital output, and an Ethernet port. There’s also a solid choice of wireless connections, with Wi-Fi, Bluetooth and support for Apple AirPlay 2.",
    "The QN65A comes with two controllers: a standard black plastic zapper, and the new sleek metal Solar Cell remote. This simplified wand is comfortable to hold, easy to use with one hand, and includes all the main controls, plus some dedicated buttons for popular streamers. New this year is a solar panel on the back that recharges the batteries – making it more eco-friendly.",
    "The Samsung QN95A employs the Tizen-powered smart TV platform, and these days it gives LG’s webOS a run for its money in terms of user interface, responsiveness and functionality. There’s a launcher bar along the bottom and a second layer above that provides faster access to additional content. Navigation is a cinch, and there’s even voice control if you prefer.",
    "The app support is the definition of comprehensive, offering access to every major streaming service. That means you can choose between Netflix, Amazon, Now TV, Disney Plus, Apple TV Plus, Rakuten, YouTube, and all the UK TV catch-up services – to name but a few! The only complaint (for UK viewers) would be the lack of Freeview play support, but otherwise it’s an impressive array of TV smarts.",
    "The amount of choice on offer is sometimes overwhelming, but Samsung’s Universal Guide helps users find the content they want by presenting everything via an intuitive interface. The guide then uses AI machine learning to analyse your viewing habits and create a single ‘For You’ page with personalised content to suit your tastes.",
    "The Digital Butler allows for quick and easy connection by automatically scanning for nearby devices, detecting them and representing them using easy-to-understand graphics. There’s built-in Bixby and Alexa, plus you can access Siri via Apple’s AirPlay 2. There’s also the SmartThings app, which allows for quick and simple setup, and a degree of control.",
    "The Samsung QN95A is a Neo QLED TV, making it the first model from the manufacturer to employ a Mini LED backlight. This uses a newly-designed micro layer that contains LEDs significantly smaller than previous generations. These LEDs eliminate the protective packaging and lens around the diode, allowing for thinner panels and increased dimmable zones.",
    "Samsung has previously used a maximum of 480 zones, but we counted 792 zones on the 65-inch QN95A. This increase in zones requires more processing power and improved algorithms, both of which are present on the new TV. The Quantum Matrix system is designed to coordinate the extra zones, while the Black Detail Boost feature increases perceived shadow detail.",
    "The new Neo Quantum Processor boosts the processing power by employing ‘multi-intelligence’ deep learning. Instead of a single neural network, this processor combines up 16 to create a neural analyser specialised for upscaling and processing video. All this added power is designed to deliver the best possible experience, regardless of what you’re watching.",
    "The QN95A supports high dynamic range in the form of HDR10, HLG (hybrid log-gamma), and HDR10+ Adaptive. The latter uses dynamic metadata to adapt the tone-mapping on a scene-by-scene basis, and now employs a sensor to customise the performance based on the ambient lighting conditions in your room. Annoyingly, Samsung still refuses to embrace Dolby Vision though.",
    "There are a number of available picture modes, with Standard as the default, but purists can opt for Filmmaker Mode, which is designed to deliver images accurately and as the content creators intended. The results are certainly impressive, with natural colours, clean whites, deep blacks, bright highlights and plenty of shadow detail.",
    "The Samsung QN95A makes full use of all those extra zones, and the impressive dimming algorithms, to produce the deepest blacks and the brightest highlights without causing blooming or losing details in the shadows. Whether it’s SDR or HDR, the pictures produced by this TV are sure to please, especially once you add in quantum dot with its saturated-but-nuanced colours.",
    "The sophisticated processing delivers impressive upscaling that squeezes every last pixel out of lower resolution content. Of course, once you switch to native 4K the TV can really strut its stuff, allowing you to pick out every thread in the ‘60s fashions of The Queen’s Gambit (Netflix).",
    "The streaming apps all look superb, with detailed 4K images and impressive HDR where available. Only the previously mentioned lack of Dolby Vision disappoints, but at least Amazon shows like The Grand Tour benefit from HDR10+. The Mini LED backlight certainly reveals its HDR strengths during the lunar-based scenes of For All Mankind (Apple TV+).",
    "The film First Man proves a particularly effective demonstration of the dimming algorithms during the sequence where the Apollo command module moves into orbit. The screen goes completely black, before the Moon’s brightly-lit surface gradually appears through the spaceship’s window. It’s a tough scene, but the QN95A handles it with skill, eliminating haloing or other artefacts.",
    "The QN95A also handles the increased colour gamut of HDR10 with aplomb, mainly thanks to the higher colour luminance of quantum dot. Films like Guardians of the Galaxy Vol.2 and Pan, with their deliberately over-saturated colour schemes, really pop off the screen in a vibrant display of primary and secondary colours.",
    "The QN95A can deliver over 2,000 nits in its Dynamic picture mode, and over 1,600 nits in the more accurate Filmmaker mode. This means that for a lot of HDR content the TV doesn’t even need to tone map, but when it does apply tone-mapping this is done correctly, ensuring detail is retained in the darkest and brightest parts of the image, and retaining creative intent.",
    "Finally the Samsung is equally impressive when it comes to motion handling, with 24p content looking smooth, and free of judder or unwanted artefacts. The Picture Clarity motion settings apply frame interpolation, resulting in smoothing, which can be useful with sport, while the LED Clear Motion setting uses black frame insertion, darkening the image, but improving the motion.",
    "The Samsung QN95A uses an LCD panel, which means there’s no danger of screen burn if you engage in extended gaming sessions. It also offers a host of features aimed at next-gen gamers, such as VRR (variable refresh rate), 4K/120Hz playback, and support for AMD Freesync Premium Pro and Nvidia G-Sync compatibility.",
    "Another useful feature is ALLM, which automatically detects a console and selects the Game mode, resulting in a blink-and-you’ll-miss-it 9.2ms input lag. The Game Motion Plus mode is designed to smooth out motion without significantly increasing the lag, and there’s even support for the 21:9 and 32:9 ultra wide aspect ratio options offered by a number of PC games.",
    "In fact, there are now so many gaming options that Samsung has introduced the Game Bar to help you keep track. This useful feature pops up when a game source is detected, providing at a glance all the key gaming information such as HDR, frame rate, VRR, etc. It also shows all the key gaming picture adjustments and settings.",
    "The inclusion of all these features results in a highly enjoyable and responsive gaming experience, with an ultra-low input lag and no screen tearing. Images are sharp and detailed, the HDR really pops, and the motion is smooth and clear. The inclusion of the Dynamic Black Equaliser allows you to adjust the darker parts of the picture, helping you spot dangers lurking in the shadows.",
    "The Samsung QN95A is genuinely impressive in the audio department, thanks to the inclusion of Object Tracking Sound Plus (OTS+). This seamlessly integrates eight speakers into the outer edge of the TV cabinet, creating a 4.2.2-channel system that’s powered by 70W of amplification. The result is a surprisingly large and immersive soundstage, thanks to the addition of top speakers.",
    "However, OTS+ doesn’t just involve more channels – it also analyses the audio signal and aligns sounds with the location of specific images on the screen. This really works, producing an engaging experience with improved directionality and immersion. In addition, the dedicated centre speakers ensure clear dialogue, and the subs add some pleasing low-end presence.",
    "It’s frustrating that despite the inclusion of height speakers, Samsung still doesn’t include on-board Dolby Atmos decoding. But the QN95A can send Atmos back via ARC from its internal apps to a supporting soundbar or AV receiver. Since it also supports eARC, the Samsung QN95A can even pass lossless audio back via HDMI to a supporting soundbar or AV receiver."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and availability",
    "8": "Design",
    "14": "Smart TV (Tizen OS)",
    "18": "Picture quality",
    "30": "Gaming",
    "34": "Audio performance",
    "37": "Don't buy it if…"
  },
  "links": {
    "TechRadar Choice Awards 2021": "https://www.techradar.com/news/sonos-roam-takes-best-bluetooth-speaker-crown-at-techradar-choice-awards-2021",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "Micro LED": "https://www.techradar.com/news/micro-led-tv",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Object Tracking Sound": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Freeview Play": "https://www.techradar.com/news/freeview-play",
    "75-inch": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "One Connect box": "https://www.techradar.com/news/samsung-one-connect-box",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Bixby": "https://www.techradar.com/how-to/what-is-bixby-our-guide-to-samsungs-voice-assistant",
    "Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "HDR10+ Adaptive": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Filmmaker Mode": "https://www.techradar.com/news/filmmaker-mode-to-show-films-as-intended-on-lg-and-panasonic-tvs",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "AV receiver": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy"
  }
}