{
  "source": "https://www.techradar.com/reviews/msi-meg-aegis-ti5",
  "title": "MSI MEG Aegis Ti5 review",
  "category": "computing",
  "updated": "2021-01-29T16:28:40Z",
  "author": "jess-weatherbed",
  "summary": "Claptrap, start the boot up sequence.",
  "verdict": "The MSI Aegis Ti5 is one of the most bizarre-looking PCs available on the market, and the spec options are equally jaw-dropping. However, the high price tag means this unique gaming rig isn't an option for everyone.",
  "pros": [
    "Unique chassis",
    "Unbeatable performance",
    "Crazy specification options"
  ],
  "cons": [
    "Uh, unique chassis",
    "Expensive",
    "Not a lot of USB ports"
  ],
  "article": [
    "The MEG Aegis Ti5 is the latest addition to MSI’s range of gaming desktops, joining the roster for the uniquely designed Aegis product line. The announcement and subsequent launch of the Nvidia GeForce RTX 3000 series of graphics cards meant that we'd been expecting some of the bigger PC hardware manufacturers to release refreshed editions of their desktop collections to take advantage of the newest and most powerful hardware on the market, but MSI has done that with a greater flourish than most.",
    "The MSI Aegis Ti5 is arguably going to be the most uniquely designed prebuild on the market, sporting a look that won't be for everyone. It’s certainly for us though, and while we initially laughed at the robotic-looking features the aesthetic has really grown on us. You're still getting the signature RGB lighting that features in many gaming PCs, but the Aegis stands out against other current desktop builds that mostly seem to follow one of two trends: a stealthy, minimalist case, or a glass-windowed chassis that puts the powerful hardware within front and center.",
    "The RGB lighting is soft, and curves around the PC’s mechanically inspired form. As the lighting is contained behind frosted plastic, you won't be getting the blinding effects that other gaming builds inflict, and it’s actually a lot kinder on the eyes if you keep your computers on your desk.",
    "The entire computer almost feels like an art piece, a love letter to sci-fi, and a blueprint for what gaming PCs could look like in our homes. Of course, this isn't all about appearance, and the Aegis Ti5 is packed full of some scarily powerful tech. The configuration we reviewed has a list of £4,299 (around $5,900, AU$7,650) and comes equipped with an Intel Core i9-10900K CPU and an Nvidia GeForce RTX 3080 GPU; other configurations available with an Intel i7-10700K or a more modest RTX 3070 graphics card.",
    "As the Ampere-powered cards are a recent release, there aren't many pre-built gaming PCs on the market yet to rival the MSI Aegis Ti5. The top-spec Alienware Aurora R11 comes with an Intel Core i9-10900K, 64GB of RAM, and a 2TB SSD with 2TB HDD, but is packing the most powerful graphics card currently on the market, the Nvidia GeForce RTX 3090. This is arguably a better system, and cheaper than the MSI Aegis Ti5 for the (still princely) sum of $4,419 / £3,949 / AU$9,049, but you won't be getting an integrated gaming dial, or the Aegis Ti5’s unique style.",
    "If you want a gaming machine that will get heads turning and will happily play any title you throw at it for the next few years then the MSI Aegis Ti5 is going to be hard to beat. You'll have to part with a lot of cash to get your hands on one, but you're getting a whole lot of PC in return.",
    "The MSI Aegis Ti5 standard prices are listed below for three different configurations.",
    "The shortage of RTX 3000-series cards means they’re subject to inflated prices. In fact, we struggled to actually find the Aegis for sale, and the 'where to buy' section of the MSI website displayed no options during our review process.",
    "At the time of writing Alza is showing a variant for £4,359, while EXCaliberPC in the US has a machine listed for $3,399, though both of these are listed with different storage or RAM specifications to the build we reviewed or listed above. Both of these listings were for the top-tier configuration with a Core i9-10900K CPU and RTX 3080 GPU, but we have no previous experience of using these sites and can't speak for how reliable they are.",
    "Whatever the confirmed regional prices will be, the MSI Aegis Ti5 is incredibly expensive. You're paying for not only some of the most powerful hardware available right now, but also an aesthetic that can't be replicated without some serious case modifications, so while the price is certainly high, it arguably isn't unreasonable considering the build you're receiving.",
    "Let’s not sugar-coat it: the overall aesthetic is either going to be what sets you onto the MSI Aegis Ti5, or pushes you back towards minimalist 'stealth' builds for your future gaming rigs. Personally, we think the new Aegis chassis is a unique twist on existing trends for PC builds, with some great functionality tied into how the computer is designed.",
    "The PC case has some similarities to robots in popular culture, and you'd be forgiven for mistaking this PC for Bastion from Overwatch or Claptrap from the Borderlands games. If you stare at it long enough, you may even hear GlaDOS screaming at you to \"press the button\". The similarity between such beloved characters could be completely coincidental, but there’s something seriously sci-fi about having the Aegis Ti5 chilling out on your desk – you’d be hard-pressed to find a more appropriate pre-built PC to play Cyberpunk 2077 on, that's for sure.",
    "The obvious addition to this new Aegis model is the 'Gamer Dial', a control console that has been built into the front of the case. This dial allows players to switch between different system performance settings, and can be set to display system status info such as CPU temperatures and frequencies. You can also macro games to launch at the touch of a button, and choose between various performance modes for better game optimization.",
    "You can also use the dial to control audio volume and RGB lighting by assigning settings in the installed MSI Dragon Center software, and you can personalize the dial to display images or gifs on the front of the dial itself, something that works well for streaming or content creation. We elected to keep the preinstalled gif of MSI's mascot 'Lucky', as there really was something charming about looking over at our PC to find a cheerful red dragon giving us an enthusiastic thumbs up.",
    "The case is a mix of plastic and metal, which makes it incredibly sturdy. The base of the PC appears to be solid metal which helps with stability, though we're a little disappointed to see a lack of polished aluminum or glass given the price of the Aegis Ti5. The windowless design is certainly a break with the current trend of being able to see directly into the guts of your gaming rig, so this might be a selling point for anyone who loves a futuristic-looking RGB-infused PC, but doesn't want to follow the crowd.",
    "Built into the top rear of the PC is a solid metal handle for easier transportation, something we initially scoffed at but which revealed itself to be a blessing when moving the Aegis Ti5. While the metal base gives the build a nice, solid feel, it also means the computer is unsurprisingly hefty, weighing in at around 37lbs or 17kg. The case also has two foldable arms that sit flush to it when not in use, which can be used to hang cables or headsets. The arms are actually practical if you don't have an existing stand for your gaming headset, but they also make the PC look like some adorable robotic bunny, so this is a win-win in the looks and design department.",
    "Unsurprisingly, given the hardware specifications, you can fire up just about any game conceivable and max out all of the optional graphics settings. The MSI Aegis Ti5 runs like a complete dream on all the recent AAA titles like Cyberpunk 2077 or Assassin’s Creed Valhalla, and you can expect to consistently hit over 60fps with all settings set to their highest available option.",
    "We also ran less demanding games like World of Warcraft: Shadowlands, which has recently added ray tracing. Even with ray tracing enabled, and multiple monitors displaying tabs from Chrome, we were still able to keep a steady 130fps in crowded communal lobbies and raids. This is, of course, also assisted by the frankly ridiculous amount of RAM that comes with the Aegis Ti5 model we were reviewing.",
    "With 128GB to play with you could install a game like Red Dead Redemption II onto the DDR4 RAM itself. This will be a completely unnecessary amount of RAM for most gamers, for whom a more modest 16-32GB would be more than sufficient to run demanding games with a few other applications open – 128GB is firmly in server-running territory.",
    "When it came to Cyberpunk 2077, playing the game on the MSI Aegis Ti5 actually made it live up to our expectations – with both ray tracing and DLSS enabled, everything is buttery smooth and jaw-droppingly beautiful to look at. The Aegis barely broke a sweat running the game either, with a blissfully silent MSI AIO liquid CPU cooler making sure the system remained at satisfactory temperature levels.",
    "A surprising thing to note is that the MSI Aegis Ti5’s unusual chassis is actually a micro-ATX case, and contains an MSI mATX Z490 motherboard. Opening the side panels was fairly straightforward given the case’s complex design, so you'll be able to swap out and upgrade all of the internal components should you need to. Two of the available four expansion slots are taken up by the Nvidia GeForce RTX 3080 graphics card, which gives you a three Display Ports and an additional HDMI to play with, so we had no issue connecting the Aegis to a three-monitor setup.",
    "We're a little disappointed by the number of USB ports on the build – it’s not impossible to live with the seven that are provided, but we found that we needed to connect a powered USB hub in order to connect all our gaming peripherals and charging devices. Two USB-C ports are provided on the Aegis Ti5 though, which is a nice bonus for anyone who uses more modern peripherals or needs somewhere to plug in charging cables."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and availability",
    "10": "Design",
    "16": "Performance",
    "22": "Don't buy it if..."
  },
  "links": {
    "Nvidia GeForce RTX 3000": "https://www.techradar.com/news/nvidia-ampere",
    "Intel Core i9-10900K CPU": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "Nvidia GeForce RTX 3080 GPU": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Intel i7-10700K": "https://www.techradar.com/news/intel-core-i7-10700k-vs-intel-core-i7-9700k-how-does-intels-10th-gen-chip-stack-up",
    "RTX 3070 graphics card": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Alienware Aurora R11": "https://www.techradar.com/reviews/alienware-aurora-r11",
    "Nvidia GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "shortage of RTX 3000-series cards": "https://www.techradar.com/news/the-amd-and-nvidia-graphics-card-shortage-could-continue-until-february-2021",
    "Alza": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6870337032514448000&xs=1&url=https%3A%2F%2Fwww.alza.co.uk%2Fmsi-meg-aegis-ti5-10te-005eu-d6255161.htm%3Fkampan%3Dadw_alza_pla_all_alza_Produkty_c_9046299_TB243o9%26gclid%3DCj0KCQiArvX_BRCyARIsAKsnTxN8gQHWWVo4ZJ9m2V0CL4SuaoGyR2DmwXaQgiyhxpAxqCwexzBLuiMaAhN6EALw_wcB%26layoutAutoChange%3D1&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmsi-meg-aegis-ti5",
    "EXCaliberPC": "https://www.excaliberpc.com/configurator/configure.html?id=742600",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Assassin’s Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "World of Warcraft: Shadowlands": "https://www.techradar.com/reviews/world-of-warcraft",
    "Red Dead Redemption II": "https://www.techradar.com/news/red-dead-redemption-2-pc-release-date-news-tips",
    "micro-ATX case": "https://www.techradar.com/news/computing-components/motherboards/8-best-micro-atx-and-mini-itx-motherboards-923069"
  }
}