{
  "source": "https://www.techradar.com/reviews/trezor-model-t-cryptocurrency-wallet",
  "title": "Trezor Model T cryptocurrency wallet review",
  "category": "computing",
  "updated": "2021-01-28T20:30:29Z",
  "author": "mayank-sharma",
  "summary": "An open-source hardware cryptocurrency wallet that has a number of top features",
  "verdict": "The Trezor Model T is one of the most expensive hardware wallets available, but makes up for its price with premium features, universal support and ease of use.",
  "pros": [
    "Open source",
    "Color touchscreen",
    "Easy to setup and use",
    "Supports over 1600 coins"
  ],
  "cons": [
    "Costlier than its peers",
    "Mobile support for Android-only"
  ],
  "article": [
    "The Trezor from SatoshiLabs is one of the oldest cryptocurrency hardware wallets on the market. First released in 2014, the Trezor Model T is the company's premium offering, designed to suit both HODLers and active traders alike.",
    "The Trezor Model T offers all the features that come with the Trezor One, along with support for newer cryptocurrencies and exchanges such as XRP, Cardano, Monero and more.",
    "Everything about the Trezor Model T, from its hardware specifications to the software that powers it, is released under an open source license, which is a definite plus.",
    "A built-in touchscreen, meanwhile, gives the Model T a premium feel and enables you to enter the PIN and passphrase on the device itself, which is very convenient.",
    "The premium Trezor Model T will set you back by $170 or €160 (roughly £125). In comparison, the Trezor One retails for less than half the price at $55 (or €49).",
    "The closest competitor to the Trezor comes from a company called Ledger. The premium Ledger Nano X costs about $120, while the Ledger Nano S is available for about $60.",
    "The third most popular hardware wallet for cryptocurrency is the KeepKey, which costs only about $50, but doesn’t offer the same features as the Ledger and the Trezor.",
    "By default, the Model T can handle multiple cryptocurrencies, but users can also switch to a Bitcoin-only firmware that has been designed to exclusively tackle Bitcoin operations.",
    "The device also gets exclusive security features such as the Shamir Backup, which can create up to 16 shares that you can use to recover your crypto if something untoward happens to your device.",
    "Another convenience feature is the inclusion of in-wallet exchanges. You can use these to both buy crypto using fiat currencies and convert from one crypto to another, all from within Trezor.",
    "In terms of operating system compatibility, the Trezor works with Windows, macOS and Linux, as well as with Android via OTG support. There’s no support for iOS though.",
    "To get started you’ll have to use one of the four documented mechanisms to get the Trezor to communicate with its browser-based Trezor Wallet app. Trezor Bridge is the recommended option. Once it’s installed you can fire up one of the supported browsers, namely Chrome and Firefox, and head to the Trezor Wallet website.",
    "The wallet website will help you set up the device and manage your crypto. It has native support for Bitcoin, Bitcoin Cash, Bitcoin Gold, Litecoin, Dash, Zcash, Dogecoin and Vertcoin. For everything else you’ll have to rely on a third-party wallet.",
    "The app is fairly intuitive and you can use it to configure two-factor authentication through the Universal Second Factor (U2F) standard. The device can also be used as a FIDO2 security key on supported services as well.",
    "In addition to the web-based Trezor Wallet app, SatoshiLabs is also working on a new desktop app called Trezor Suite, and is currently in public beta.",
    "As soon as the Trezor is connected to its web-based wallet app, you’ll be asked to create a new wallet. As ever, you should always create a backup as soon as you create a new wallet, and jot down its recovery seed to make sure the wallet is recoverable.",
    "The process to send and receive crypto is straightforward. Switch to the Receive tab and generate a receive address in the app, which you’ll then have to confirm on the Trezor Model T as an added security measure.",
    "You can also tap the QR button on the Trezor to view the QR code of the address, which your sender can scan to initiate the transfer. As soon as a payment is received it’ll be listed under the Transaction tab.",
    "To send crypto, first type in the destination address for your transaction or scan the recipient's QR code. The Trezor Wallet app allows you to send funds to multiple recipients in one transaction, which will help you save on transaction fees if you want to make multiple transactions.",
    "You can then insert the amount of crypto you want to send, and the app will display the approximate fiat equivalent as well. The app has four predefined transaction fees, namely low, economy, normal and high. You can choose one of these for your transaction, or use the option to specify a custom fee.",
    "Again, once you press send in the web app, you will be asked to confirm the transaction on the Trezor as well.",
    "Trezor has an extensive wiki that has loads of educational material about Bitcoin, on top of information on the Trezor devices. There’s an extensive FAQ, as well as step-by-step documentation to help users get up and running with the hardware wallet. You can also use the troubleshooter tool to search for answers to common issues on the wiki.",
    "Most of the documentation on the support section is tailored to first time users, but there’s a lot of information for advanced users as well - and developers.",
    "Like many other wallets, you can interact with the developers as well as other users via the r/Trezor subreddit, as well as on Twitter and Facebook. If the existing avenues of support don’t help you resolve your issue, you can call on the support team by raising a ticket.",
    "Trezor is one of the oldest hardware wallets, but it isn’t the only one. One of its strongest advantages over some of its peers such as the Ledger, is that Trezor is open source.",
    "Ledger also uses a proprietary app for mobile and desktop, while Trezor uses its open source web-based wallet. Thanks to its open source nature, Trezor has native integrations inside other wallets such as Electrum, Exodus, Wasabi, and Mycelium.",
    "That said, the Trezor does lose out to its competition in two key areas. For starters, Ledger’s premium hardware wallet, the Ledger Nano X, has a wireless bluetooth connection, which is a lot more convenient than the USB connection on the Trezor Model T.",
    "Also, the Trezor Model T is more expensive than not only the Ledger Nano X, but also several others such as the KeepKey.",
    "All things considered, the Trezor Model T is the best hardware wallet for anyone that wants to HODL crypto. That's because the device can hold a larger variety of crypto than most of its peers and its open source nature makes it more compatible with third-party wallets.",
    "The only real challenger to the Trezor Model T is the Ledger Nano X. However, Ledger recently suffered a data breach that exposed information about thousands of customers. While there is a known flaw that can reveal seeds from the Trezor Model T, the exploit requires physical access to the wallet, making it less severe than the Ledger breach.",
    "With everything taken into account, the Trezor's ease of use, open source architecture and extensive support offering is enough to tip the scales in its favor."
  ],
  "headers": {
    "4": "Price",
    "7": "Interface and ease of use",
    "15": "Transferring funds",
    "21": "Support",
    "24": "Alternatives",
    "28": "Final verdict"
  },
  "links": {
    "Trezor": "https://trezor.io/",
    "wallets": "https://www.techradar.com/news/best-bitcoin-wallets",
    "Trezor Model T": "https://shop.trezor.io/product/trezor-model-t",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "Windows": "https://www.techradar.com/how-to/software/operating-systems/how-to-upgrade-to-windows-10-for-free-1325764",
    "macOS": "https://www.techradar.com/how-to/how-to-download-and-install-macos-11-big-sur",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Android": "https://www.techradar.com/best/best-android-apps-2021",
    "iOS": "https://www.techradar.com/best/best-iphone-apps-2021",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "security key": "https://www.techradar.com/best/best-security-key",
    "Electrum": "https://www.techradar.com/reviews/electrum-cryptocurrency-wallet",
    "Exodus": "https://www.techradar.com/reviews/exodus-cryptocurrency-wallet",
    "Wasabi": "https://www.techradar.com/reviews/wasabi-cryptocurrency-wallet",
    "Mycelium": "https://www.techradar.com/reviews/mycelium-cryptocurrency-wallet",
    "recently suffered a data breach": "https://www.techradar.com/news/crypto-wallet-data-breach-compromises-hundreds-of-thousands-of-users",
    "known flaw": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1890361325409860900&xs=1&url=https%3A%2F%2Fblog.kraken.com%2Fpost%2F3662%2Fkraken-identifies-critical-flaw-in-trezor-hardware-wallets%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ftrezor-model-t-cryptocurrency-wallet"
  }
}