{
  "source": "https://www.techradar.com/reviews/bang-and-olufsen-beoplay-hx",
  "title": "Bang & Olufsen Beoplay HX review",
  "category": "audio-visual",
  "updated": "2021-07-14T13:53:31Z",
  "author": "simon-lucas",
  "summary": "Slightly less turns out to be quite a bit more",
  "verdict": "By the company’s more usual ‘kitchen sink’ standards, the Bang & Olufsen Beoplay HX are a rather understated product – and they’re all the better for it. By concentrating as much effort on performance as on a stylish exterior, B&O has struck a really pleasing balance. But it will cost you.",
  "pros": [
    "Vivid, lively sound",
    "Feel, look and even smell like an uber-premium product",
    "Usefully extensive control app"
  ],
  "cons": [
    "Priced like an uber-premium product",
    "Plenty of very capable (and more affordable) competition",
    "Noise-cancelling can be bettered"
  ],
  "article": [
    "In some ways, the Beoplay HX are a typical Bang & Olufsen product: premium materials, premium construction, premium price. In others, though, they’re a lot less willful than we’ve become used to from the company. The HX headphones don’t prioritize design over performance, and while they’re undeniably expensive, they’re not as stratospherically priced as you might expect.",
    "What this means, then, is that for a fair bit more than you’d pay for any number of extremely capable alternatives, you can buy a pair of Bang & Olufsen active noise-cancelling wireless over-ear headphones that are specified to compete and built to make you feel good about life. The specification is properly up to standard, performance is almost entirely impressive, and less tangible stuff such as ‘pride of ownership’ is sky-high, too.",
    "Bang & Olufsen has always insisted you accept its products on its terms. With the Beoplay HX, those terms are slightly more acceptable than is often the case with B&O.",
    "The Bang & Olufsen Beoplay HX active noise-cancelling wireless headphones are on sale now, and they’re priced at an eye-widening $499 / £449 / AU$839.",
    "Everyone has become accustomed to Bang & Olufsen products being significantly priced, of course. However, in this market there are some extremely well-regarded alternatives from the likes of Bose, Bowers & Wilkins, Sennheiser and Sony, for example, which can be had for no more than $350 / £350 / AU$550. So, the fact that the HX are quite affordable by Bang & Olufsen standards is neither here nor there.",
    "The problem for Bang & Olufsen is obvious. For a company that’s built its reputation on the back of some high-performing products that sport a unique aesthetic, is there room for maneuver when it comes to design? After all, few people are in the market for a pair of over-ear headphones that could be described as ‘mad-looking’. Form is dictated by function just as rigorously here as anywhere else in Consumer Electronics Land, and deviating from the template is likely to alienate way more potential customers than it entices.",
    "So Bang & Olufsen has chosen the sensible path. Which, in this instance, turns out to be giving the Beoplay HX an extremely competitive specification, incorporating high-quality materials and putting it all together flawlessly. Doesn’t sound like rocket science, does it? But by being pragmatic – creating a product that’s remarkable only for its complete lack of visual remarkableness – Bang & Olufsen has served up its most competitive product in quite some time.",
    "On the outside, the Beoplay HX both look and feel expensive. The combination of lambskin, aluminum, memory foam and high-quality plastics results in a pair of headphones whose aesthetic is on the discreet side of ‘opulent’. They’re tactile: every element feels good, and the aluminum control surface on the right earcup is pleasant – as well as responsive – to the touch. At 285g, they’re not burdensome to wear. And each of the three color options (Sand, Black Anthracite and Timber) walk that discreet/opulent tightrope confidently, too.",
    "On the inside, things are equally pleasing. Wireless connectivity is via Bluetooth 5.1 with aptX Adaptive capability. As such, the HX will always balance connection stability and streaming quality to ensure you get the best of both worlds. Sound is delivered via a pair of 40mm full-range neodymium dynamic drivers. Plus, the HX can keep that sound coming anywhere between 30 and 40 hours between charges, depending on how you’re using them.",
    "A USB-C input sits along the edge of the right earcup, for when the B&O eventually need to be charged, along with a 3.5mm input and a power on/off/Bluetooth pairing button. The left earcup, meanwhile, features a button to cycle through your active noise-cancellation options – ‘on’ (the degree of which you’ll have set in the control app), ‘off’ or ‘transparency’. Plus, there’s a button to summon your favourite voice assistant. Each earcup also has a couple of mics.",
    "As well as voice assistance and the physical controls on the headphones, it’s possible to finesse performance using Bang & Olufsen's predictably upmarket control app. Clean, stable and good-looking, it’s where you can choose between EQ settings (or conjure your own, using the stylish Beosonic graphic interface), adjust the level of noise-cancelling, and decide on the sensitivity of the auto-pause feature that kicks in on removing the headphones.",
    "Of course, with the arguable exception of competent control app, and the lavish materials used in their construction, the Beoplay HX don’t really offer anything that a stack of rivals costing considerably less don’t offer too.",
    "This is just as true of audio performance. That’s not to say the Beoplay HX are an underwhelming listen – on a pound-for-pound basis, they’re quite possibly the best wireless headphones Bang & Olufsen has ever made.",
    "Of course, it is possible to impact the Beoplay HX sound in quite a profound way by fiddling carelessly with the EQ settings. Leave them in what Bang & Olufsen considers the default position, however, load up a nice big high-resolution file of Forest of Your Problems by Snapped Ankles, and the HX waste no time in establishing their credentials as a vivid, highly detailed and thoroughly engaging listen.",
    "At the bottom of the frequency range is heat and punch, but nothing is overcooked nor becomes unruly. Low-frequency stuff hits hard, but with admirably straight edges at the start and end of each individual note or hit. As a consequence the HX are a sprightly, front-footed listen. Rhythm management is good and tempos are described confidently – the Bang & Olufsen will happily get the listener’s toe tapping.",
    "At the opposite end of the frequency range there’s substance and bite – but, again, it’s well judged. Even at considerable volume, the HX don’t get hard or shouty where treble information is concerned; the Bang & Olufsen have enough in reserve to make dynamic peaks and troughs obvious.",
    "In between, the HX are a spacious and informative listen. Detail levels are as high in the mid-range as they are elsewhere, so the character and technique of a vocalist is given full expression. Overall tonality is just slightly on the rich side of neutral – but then prospective HX owners will be, too. And while it’s possible to dial that warmth down just a little, a touch of substance goes with it – so we’d be inclined to leave well enough alone.",
    "The soundstage the HX generates isn’t the biggest around, but neither is it in any way cramped or confined. The individual strands of a recording are locked in place securely. There’s a winning sense of unity to the overall presentation here, and although there’s plenty of breathing space for separate elements to stretch out and do their thing, they never sound isolated. The HX are pretty adept where low-level harmonic dynamics are concerned, too – detail levels are high enough to make the smallest note-by-note variations apparent, even when the complete recording gets busy or complicated.",
    "Noise cancellation is a more qualified success. There’s no doubt the Beoplay HX can handle the majority of external sounds effectively, leaving next-to-no trace of a counter-signal in their place. However, there are more effective units out there. If it’s a blanket of silence you’re after, then there are more affordable (and less luxurious) headphones available, whose overall tone may not be quite so obviously affected by adjusting the level of noise cancellation."
  ],
  "headers": {
    "3": "Bang & Olufsen Beoplay HX price and release date",
    "5": "Design",
    "12": "Audio performance",
    "19": "Don't buy them if..."
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "best wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344"
  }
}