{
  "source": "https://www.techradar.com/reviews/monarch-budgeting",
  "title": "Monarch budgeting review",
  "category": "computing",
  "updated": "2021-10-01T04:44:53Z",
  "author": "rob-clymo",
  "summary": "Using the Monarch app you can tame your personal finances on the go",
  "verdict": "Monarch is another addition to the world of budget management apps but it’s got plenty of appeal despite the fact that you’ll need to pay for the privilege of using it.",
  "pros": [
    "Nicely designed",
    "Some cool power tools",
    "Decent value"
  ],
  "cons": [
    "Monthly cost"
  ],
  "article": [
    "Monarch is a budgeting app that’s been developed by a Silicon Valley startup. While it is clearly very early days for the business Monarch has been persuading new users to explore its collection of useful tools, all of which are aimed at helping you better manage your personal finances. The app was initially made available for iOS, but more recently Monarch has developed a version for the Android platform, and that is available right now.",
    "The Monarch personal finance platform has plenty to like within its svelte lines, plus some decent power tools too. Anyone looking to tame their finances and work out a better way of handling money in the future should therefore find it of interest. The Monarch company lineup features one of the original team who worked on personal finance application Mint. That gives you a decent idea of what to expect.",
    "While the Monarch personal finance app is paid-for software it does come with the option of trying it for free for 14 days. Better still, you can explore its features and functions without the need for handing over credit card details during sign up. Once the trial has concluded you’ll be given the option of choosing from one of two different packages.",
    "There’s a monthly plan that costs $9.99 per month while the annual plan is billed as $89.99 annually, which works out at $7.50 per month. This delivers a saving of 25% overall, which therefore makes it the package to head for if you like what you see while you immerse yourself in the trial. Not unreasonably, Monarch points out that its paid-for app means that the software doesn't have to be lumbered with in-app advertising or other promotional offers.",
    "The creators of Monarch have developed the app with the aim of letting users create a detailed financial plan. The idea is that you can use the software to help project how your spending and saving will evolve, based on different financial scenarios. From that you’ll be able to develop more realistic financial goals for your money matters. On initial inspection Monarch appeals because it lets you see all of your finances in one place.",
    "This isn’t unique, but it’s been nicely done in the app, with bank accounts, credit cards, loans and other financial assets featuring in a main dashboard. The extra benefit is you can customize this to meet your needs. Boosting that appeal is the way Monarch can sync with your banks, with a secure connection available to over 11,200 financial institutions. This offers a dynamic overview of your money that should always be up to date.",
    "The Monarch app has been designed primarily for use as an app on mobile devices and, now that there’s an Android edition, those bases are nicely covered. However, it is also possible access Monarch through a web browser on your computer or laptop too. Whichever route you take the designers have done a really good job on the app, with performance proving to be sprightly on all editions.",
    "Monarch has done a similarly fine job with the design flourishes of its app, with a great level of usability making it a breeze to master and control moving forwards. While the core controls are quick and simple to use, there is also a straightforward way of developing a firm financial plan, so you can budget more effectively and plan for the future. Usefully, the Monarch app can give you an up to date review of how the last month’s spending has gone, and how it is impacting your goal timelines.",
    "In that respect the app proves particularly useful if you’re not especially good at managing your money. The syncing aspect of Monarch is a bonus too, and this can also be easily edited so that you can track specific outlay more precisely. Overall then the usability factor is very good.",
    "Even though Monarch is a relatively straightforward app to use there might be a chance you need to call on the support resources that are available. These come in the shape of a dedicated help center page. This is comprised of FAQ’s, a What’s New area, which documents latest developments and improvements to the Monarch app, plus a Contact Us tab that lets you get in touch with the team if you need more help.",
    "There’s a searchable database too, which allows you to type in a term and hopefully find a quick solution to any query. It’s also possible to submit a request via a form on the help page, which includes the option to add an attachment such as a screenshot. There are some really useful how-to articles on the same page, which are worth a look if you’re still learning the ropes.",
    "Monarch manages to tick a lot of boxes if you’re after an app that can help you tackle your personal finances. While it’s still being refined to deliver even more functionality, what is on offer currently justifies the relatively small cost involved to enjoy this software.",
    "The fact that it’s advertisement and hassle free means you should be able to enjoy seamless management of your money, while the planning aspect is a definite highpoint. We love the overall layout, colour scheme and general usability too.",
    "Topping the highlights off with the automatic syncing with your bank accounts feature means that you’re always working with the latest data too. Overall then Monarch is a great little budgeting app that deserves to grow its following based around what’s already on offer here."
  ],
  "headers": {
    "2": "Pricing",
    "4": "Features",
    "6": "Performance",
    "7": "Ease of use",
    "9": "Support",
    "11": "Final verdict"
  },
  "links": {
    "Monarch": "https://www.monarchmoney.com",
    "budgeting app": "https://www.techradar.com/best/best-budgeting-software",
    "personal finances": "https://www.techradar.com/best/best-personal-finance-software",
    "monthly plan": "https://www.monarchmoney.com/pricing",
    "annual plan": "https://www.monarchmoney.com/pricing"
  }
}