{
  "source": "https://www.techradar.com/reviews/beget",
  "title": "Beget web hosting review",
  "category": "computing",
  "updated": "2021-10-01T06:19:08Z",
  "author": "mike-williams",
  "summary": "Budget-friendly host geared towards the Russian market",
  "verdict": "If you wish to host your site in Russia for a couple of bucks per month, Beget is the way to go. It isn’t going to give you all the little extras we usually expect to get with the top-ranked providers, however, you’ll receive everything exactly as promised.",
  "pros": [
    "24/7 technical support",
    "30-day trials for everyone",
    "At least two websites per account",
    "Budget-friendly entry-level packages",
    "Good variety of scalable hosting solutions",
    "Simple setup"
  ],
  "cons": [
    "No servers outside Russia",
    "No website builder",
    "Self-help options for non-Russian users are scanty"
  ],
  "article": [
    "Having been in the web hosting industry since 2007, Beget has grown to be one of the leading providers in Russia. Although it appears unassuming at first, Beget offers a finer variety of hosting-related products than one would expect looking at their official site.",
    "Beget’s head office is situated in Russia’s imperial capital and its second-largest city, Saint Petersburg. In addition to this, they have offices in Kyiv (Ukraine) and Berlin (Germany). If you want to learn anything more about the company, you’re out of luck since its “About” section is as poor as they get. The only relevant information you’ll take from there is that in the past Beget has been cooperating with some big names in the business, such as Intel, Supermicro, Cisco, Juniper, WD, and Seagate.",
    "All of Beget’s servers are located in Russia, presumably in Saint Petersburg. However, since its official site is terribly tight-lipped, we can’t confirm this. On the bright side, the site is easy-to-use and available in both Russian and English.",
    "Because Beget doesn’t offer a blog, we tried to find out more information on its official social media accounts, but the only thing we managed to dig up on Twitter was that Beget is “our hosting provider” (the description says “Your hosting provider” and that’s about it).",
    "Beget’s appears to be posting on social networking sites (Facebook, Twitter, and GitHub) a few times per year at least, but since everything is in Russian, non-Russian speakers will not find this information as important.",
    "While Beget won’t bestow upon you all the bells and whistles one could wish for, everything you’ll get will be exactly as promised, and the price is pretty pocket-friendly to boot. At the moment, it offers seven VPS-like shared hosting packages (ranging from $3.00 to $41.00 per month) and three premium (dedicated server) hosting packages (costing from $16.00 to $41.00 per month).",
    "Even the entry-level plan includes an ability to host at least two websites per account, 4GB of disk space, any number of domains and subdomains, unlimited data traffic, and as many mailboxes and MySQL databases as you wish. You’ll also be supplied with a custom-made control panel, automatic setup for the selected CMS, support for PHP 4/5/7/8, Perl 5, Python, Zend, phpMyAdmin, as well as SSH, and sFTP/FTP access.",
    "All of Beget’s hosting solutions are available for a 30-day trial period, which is something we seldom see these days. During this period, you can decide to pay for your plan at any given moment, and the remaining time will simply be added to the length of your plan. However, if you don’t decide to do so after the free trial has ended and without canceling your hosting plan, you’ll be charged at regular rates.",
    "As for payment methods, Beget accepts credit card payments and that’s it.",
    "Choosing a plan and creating an account with Beget is both swift and simple. After selecting a plan you intend to try out (and hopefully purchase), you’ll be asked to fill out a form containing your full name, email address, phone number, and credit card information. You can also choose between two billing cycles (per month or per year) where going for a year will take an additional 20% off your purchase. Upon registering your account, you should get your login data via e-mail and SMS without further ado.",
    "Beget doesn’t provide any of the popular industry-standard control panels (like cPanel, Plesk, or Direct Admin) but rather a custom-made one. Although it may seem a bit stripped down at first sight (especially if you’re used to standard control panels), Beget’s control panel is surprisingly simple in design and easy to use. From it, you can manage your domain and subdomains, install a CMS, use file manager or FTP, change your account settings, view statistics, seek customer support, and more.",
    "Whichever plan you choose, you’ll get a free domain by default (albeit “.beget.tech”), but you can also register a new one for a reasonable price (going from $2.00 to $28.00 per year).",
    "Choosing the CMS folder (or “install control system”) will offer you a couple of free apps for a quick installation (such as WordPress, Drupal, and Joomla), as well as those you need to pay extra for. If the app happens to be in Russian, be sure to switch it to English manually.",
    "Unfortunately, Beget still doesn’t offer a user-friendly website builder for all of us who would like to create our sites as easily as possible.",
    "It’s also worth noting that with Beget you can get your site transferred for free. All you need to do is to make a request by entering your domain, FTP server, username, and password, and the process should not take more than three business days.",
    "Although Beget barely brags about speed, after performing a check (via GTmetrix) on its official site we were presented with picture-perfect results. The site fully loaded in mere 1.1 seconds, which tops both the average (of 8.1 seconds) and the recommended score (of 3.5 seconds). In addition to this, all other vital speed measuring metrics (such as largest content element, total blocking time, and cumulative layout shift) aced the test leaving GTmetrix no choice but to rate the speed performance of Beget’s site with an A (99%).",
    "Since the word “uptime” was not once mentioned on Beget’s site, nor in the “Terms of Service” section, we had no idea what we should expect in terms of reliability. We used an uptime monitoring tool called UptimeRobot to keep track of the downtime of Beget’s site for two weeks. During this period our trusting tool managed to capture one instance of downtime and one that lasted for 10 minutes straight leading to a total recorded uptime of 99.94%, which is certainly better than we anticipated at the beginning.",
    "Although Beget doesn’t back its users up with a telephone number or live chat, it does provide around-the-clock support via ticketing system and email, and is available both in Russian and English. If you are already their customer, you can reach them via the ticket system in the control panel. If not, the support email address is right there on the site’s header.",
    "As for self-support, Beget supplies its users with lots of how-tos (titled as “Manuals”) that cover most of the basics of hosting a website. The how-tos are backed by suitable screenshots and are quite easy to understand and follow. Although at times their English appears a bit broken, all how-tos we reviewed were fully translated.",
    "Unfortunately, there simply aren't enough of them, so if you happen to face an issue that isn’t addressed here, you'll have to get in touch with Beget’s support staff or find a solution elsewhere.",
    "If you are from Russia, you’re in luck, since in addition to all the options above, you can call Beget’s support staff via telephone, write to them on Facebook and Twitter, and you’ll get a FAQ section and more how-to guides in general.",
    "REG.RU is one of Russia’s leading web hosting providers, and an excellent alternative to Beget. In addition to shared, VPS, and dedicated server hosting solutions, REG.RU also offers reseller hosting and colocation services. Both hosts are budget-friendly, but with REG.RU you’ll get more options in general. For instance, while Beget offers its custom control panel with all packages, with REG.RU you’ll be able to decide between cPanel, Plesk, and ISPmanager. What is more, with REG.RU you can also pick up an easy-to-use website builder, and try its basic version free of charge.",
    "Timeweb is another noteworthy alternative to Beget. Fully focused on Russia’s market, Timeweb provides a fine range of hosting options at an attractive price. However, while Beget seems stronger in terms of performance, Timeweb is a bit richer in terms of features, one of which is a user-friendly website builder.",
    "If having a Russia-based host is not a must, both HostGator and Bluehost are great choices. Both of them will supply you with a wide variety of hosting options, a full list of features, 24/7 support, powerful performance, and all at competitive prices. Although they don’t give free trials with their products (like Beget does), both hosts will provide you with enough time (via money-back guarantees) to decide whether you want to stay or not.",
    "If you are looking for an affordable Russia-based host that values performance over aesthetics, Beget is one of the top options on the market. It provides a sufficiently broad range of easily scalable hosting products that can foster and follow your website’s growth. The support you’ll get along the way is pretty good as well, more so if you’re from Russia.",
    "Otherwise, both HostGator and Bluehost are awesome alternatives."
  ],
  "headers": {
    "5": "Pricing",
    "9": "Ease of use",
    "15": "Speed and experience",
    "17": "Support",
    "21": "The competition",
    "24": "Final verdict"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Beget": "https://beget.com/en",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "dedicated server": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "CMS": "https://www.techradar.com/best/cms",
    "domain": "https://www.techradar.com/news/best-domain-registrars",
    "live chat": "https://www.techradar.com/best/best-live-chat-software",
    "REG.RU": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8375812485791994000&xs=1&url=https%3A%2F%2Fwww.reg.ru%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbeget",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "colocation": "https://www.techradar.com/news/best-colocation-hosting",
    "Timeweb": "https://www.techradar.com/reviews/timeweb",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}