{
  "source": "https://www.techradar.com/reviews/ipad-air-4-review",
  "title": "iPad Air 4 (2020) review",
  "category": "tablets",
  "updated": "2021-06-07T19:52:05Z",
  "author": "james-peckham",
  "summary": "Why go Pro when the Air is this good?",
  "verdict": "The iPad Air for 2020 is a phenomenally well-made tablet that improves upon the last-gen version in a variety of ways, solving issues with that tablet’s dated design and accessories. The jump in price will make this a tougher sell for some, but the iPad Air for 2020 is so impressive that you may have trouble choosing between it and the iPad Pro.",
  "pros": [
    "All-screen design",
    "Lots of power",
    "Adventurous color choices"
  ],
  "cons": [
    "64GB storage is limited",
    "Higher price than last-gen",
    "Selfie camera could be better"
  ],
  "article": [
    "The iPad Air 4 (2020) doesn’t bring anything revolutionary to Apple’s tablet range, but a lot of the features that were previously exclusive to the iPad Pro have trickled down to this far more affordable, and therefore more attractive, device,",
    "While this is a tablet that’s unlikely to tempt power-hungry users away from the iPad Pro, it brings a lot of what makes that series of tablets great to a cheaper device, albeit one that isn’t as cheap as the standard iPad. Finally, the iPad Air 4 (2020) is the middle choice between both extremes of Apple's tablet lineup.",
    "Starting with the obvious bad news, Apple has increased the price of the iPad Air over the last generation by $100 / £100 / AU$120 to $599 / £579 / AU$899. But the extra spec you’re getting here, as well as the improved design, make that an understandable move from the company, and it feels justified.",
    "Like the iPad Pro range the iPad Air 4 comes with an almost all-screen front, and supports the Apple Pencil (second generation); it also has the same squared-edge design.",
    "The iPad Air 4 is powered by Apple’s new top-end A14 chipset, which is also at the heart of the iPhone 12 range. It offers unrivaled power, ensuring that the Air can comfortably perform any task you ask of it, from running demanding apps to streaming high-quality video.",
    "There are two powerful speakers (though there are four speaker grilles) that offer high-quality audio when you’re watching videos or films, and the rear camera has been upgraded to a 12MP shooter.",
    "Everything feels a touch more refined on the iPad Air 4, so much so that it’s now difficult to justify opting for an iPad Pro if you like this design but aren’t desperate for a fast-refreshing 120Hz display.",
    "If you need more storage space or a slightly larger screen you’ll probably want to consider the iPad Pro range; but the iPad Air 2020 is improved in almost every conceivable way, making it hard to overlook if you want a top-of-the line iPad without quite spending top dollar.",
    "Update: iPadOS 15 is coming to the iPad Air 4 in 'Fall' 2021 - September or October time. Changes include widgets that you can reposition, a quick-notes function if you have an Apple Pencil, and changes to multitasking.",
    "The iPad Air 4 release date is confirmed for October 23. You can pre-order the tablet now at Apple’s website, and we expect to see other retailers offering it soon.",
    "The iPad Air 4 price starts at $599 / £579 / AU$899. That's quite a hike over its predecessor, but as we’ve mentioned you’re getting a big specs jump here that arguably justifies the increase.",
    "It’s available in a variety of configurations, with either 64GB or 256GB of storage, and with LTE connectivity or just Wi-Fi – see below for a full list of spec and price options.",
    "For reference, the iPad Air 3 started at $499 / £479 / AU$779 for the Wi-Fi only model with 64GB storage, and $649 / £629 / AU$999 for 256GB.",
    "The design of the iPad Air has a lot in common with the iPad Pro range. The home button has been dropped in favor of an all-screen design to make it more in line with Apple’s Pro products.",
    "And, indeed, the iPad Air 4 feels a lot more premium than the iPad Air 3. That slate was criticized for its dated-feeling design, and it looks like Apple took notice. We’ve used this tablet alongside the new iPad 2020, which sports the more traditional iPad look, and it’s remarkable how much the Air feels different to that tablet thanks to its straight edges and all-screen front.",
    "There are still thick bezels around the outside of the display, as there are on the iPad Pro, but overall it feels like a big step up compared to the design of last year’s Air.",
    "The edges are more-squared, with sharper edges than on previous tablets from the company, and if you’re upgrading from an older device that may take some getting used to, as those edges don’t sit as comfortably in your palm.",
    "That said, we felt we had better grip thanks to this design, and it gives the tablet as a whole a distinct look and feel that’s more in line with the new iPhone 12 family, and iPad Pro range.",
    "There are four speakers, two each on the top and bottom edges, and a lock button at the left of the top edge – this also houses the Touch ID scanner if you want to unlock your slate with your fingerprint.",
    "We found this to work well throughout our testing time – our thumb fell naturally on this spot, so little effort was required to reach the button. On the right-hand edge of the tablet are volume up and down buttons, and there’s a magnetic connector below these to which you attach the Apple Pencil stylus for charging.",
    "There’s a second Smart Connector on the rear side, and you can use this to connect Apple’s Smart Keyboard, as well as other products, to your slate. The iPad Air 4 features support for new accessories, including the second-gen Apple Pencil, which is another significant upgrade.",
    "If you’re looking for a tablet that you can use with a stylus or keyboard in certain scenarios, the iPad Air (2020) has you covered. We found the Smart Keyboard to be great for word processing, while the Apple Pencil is useful if you want to sketch on your tablet, take notes, or just sign documents in your own handwriting.",
    "The Wi-Fi-only version of the tablet weighs 458 grams, while the LTE-ready version is slightly heavier at 460 grams. The dimensions of both models are 247.6 x 178.5 x 6.1mm.",
    "Perhaps the biggest change for the iPad Air 4 is the introduction of color options. Previously, you’ve only been able to get most iPads in one shade, and you’d have to get a case if you wanted to personalize your device, but for this generation Apple is offering a range of colors.",
    "You’ve got the choice of Silver, Space Grey, Rose Gold, Green or Sky Blue – we’re a little miffed that we only got to review the Silver edition of the tablet, as we’re excited to see what the Sky Blue option looks like in real life.",
    "The iPad Air 4 comes in one size, with a 10.9-inch Liquid Retina display – this feels like the optimum size for a tablet to us, as you’re getting a large screen, but one that doesn’t feel gargantuan when you’re holding the device with both hands.",
    "The resolution is impressive at 2360 x 1640, which equates to 264 pixels per inch. We found the screen to be fantastic for watching video, with vibrant colors and a strong peak brightness, so you’ll enjoy a premium viewing experience when watching Netflix or other streaming services.",
    "There are thick black borders around the outside of the display, which means it doesn’t feel as premium as some Android tablets, notably the Samsung Galaxy Tab S7 Plus – however that tablet is also much more expensive than the iPad Air 4.",
    "It’s a typical 60Hz display – you don’t get the benefit of the higher 120Hz refresh rate that Apple has introduced to its top-end iPad Pro range, so scrolling through news articles or your apps won’t feel as smooth as it would on the Pro.",
    "If you’ve yet to use a 90Hz or 120Hz display you won’t miss it here, but it would have been nice to see Apple include it on the iPad Air to make this tablet feel even more premium than it already does.",
    "That said, Apple had to keep some features exclusive to its top-of-the-line slate to justify the price premium – and the screen on the iPad Air 4 is a great size and fantastic quality, and you’ll be happy with it whatever you use this slate for.",
    "The iPad Air 4 has some of the latest and best internals available in a tablet, and on paper it even beats the iPad Pro, with the latest A14 chipset powering the new Air product, where the newest Pro has the previous-gen A13 processor.",
    "We found the A14 Bionic chip to work phenomenally well, with the iPad Air (2020) opening apps in record times and easily handling multitasking and other complex tasks.",
    "We don’t know how much RAM is inside the iPad Air 4 – that’s not a stat that Apple reveals about its new products – but we hope to learn this when someone is able to do a full teardown of the tablet.",
    "On paper, the A14 chipset may sound better than the A12Z that you find in the iPad Pro, and for some tasks that will be the case; however, if you’re multitasking, or need a lot of raw power, the A12Z is the more capable chip, as it has eight cores compared to the A14’s four, and benchmarks show it’s better at those more demanding tasks.",
    "But if you’re not editing video or doing other similarly intensive tasks – or if you’re willing to wait a little longer for your tablet to complete a process – then the iPad Air 4 will be more than adequate.",
    "Your storage options are 64GB or 256GB, and this will be an issue for those who need lots of space but can’t stretch to the price of the more capacious model.",
    "64GB isn’t enough space for most people on a tablet these days – and there’s no microSD support here, so it’s a tough ask to opt for this over a tablet that has 128GB of space or more.",
    "It’s also worth noting that if you’re more of a power user even 256GB may not be enough space; some iPad Pro products offer up to 1TB of space onboard, but it’s not an option on the Air 4, and will be a deal-breaker for some.",
    "The company argues that you use its cloud based storage system to store large amounts of photos, video and other files, but if you expect that you’ll be downloading a lot of apps we’d encourage you to go for the larger option if you don’t want to quickly fill your tablet up.",
    "On the rear of the iPad Air 4 is a 12MP shooter with an f/1.8 aperture which serves as your primary camera, and which also comes in useful when you’re using features such as augmented reality.",
    "It’s unlikely that you’ll be using this camera to take ‘serious’ photos, but it’ll do you just fine if you’re looking to take photos to upload to social media or other apps.",
    "On the front of the tablet is a 7MP selfie camera that we found to be satisfactory, but it isn’t particularly impressive from Apple considering that a lot of Android tablets now offer better cameras for front-facing video.",
    "With many of us making much greater use of video-calling apps in 2020, it would have been a nice touch for Apple to improve the selfie camera here, but it’s the same sensor the company has used in the past.",
    "A minor issue is that the video camera sits at the top of the tablet’s display, and when you’re conducting video calls in landscape orientation that can be an awkward position. We’ve seen Samsung and Amazon address this on their slates by moving their front-facing cameras to the top of the slate when they’re in landscape mode, and it’s something we’d like to see Apple consider doing in the future.",
    "The iPad Air (2020) is running Apple’s latest iPadOS 14 software out of the box, and it’s arguably the best software you’ll find on a tablet – Android isn’t as well-optimized for tablets as Apple’s dedicated software.",
    "All major apps are optimized for the tablet’s display, with just a few options, such as Instagram, not working as well as you’d expect. iPadOS 14 also brings widgets and other new features to the tablet.",
    "If you’ve got an iPhone then you’ll find it easy enough to get your head around iPadOS, but there may be a slight learning curve if you’re coming from an Android tablet.",
    "That said, every app we’ve used in iPadOS software has worked well, and we didn’t come across any issues. This is the most sophisticated, and the most useful, software Apple has created for its tablets, and it’s really impressed us.",
    "We’ve yet to learn how big the battery in the iPad Air 4 is – again, it’s not a spec that Apple often shares – but battery performance seems as good as from previous iPads, and we found we could use the tablet for around 10 hours before having to reach for the charger.",
    "A single charge was good for around nine hours of using standard apps, web browsing and video playback, all over Wi-Fi, and if you’re only using your tablet lightly we’d expect it to last even longer.",
    "According to Apple, the tablet is designed to last for 10 hours of searching the web or video playback over Wi-Fi, and we’d say that’s a fair estimate based on our experience.",
    "If you opt for the LTE-ready version of the iPad Air 4 you’ll likely find the battery drains slightly faster when you’re connected to mobile networks, as using these can be more of a drain than using Wi-Fi.",
    "This isn’t the best battery life we’ve ever seen on a tablet, but it’s still very good, and most users should be perfectly happy.",
    "You get a 20W charger in the box – Apple has stopped including chargers in the box with the iPhone 12 range, but has chosen not to do so here – and you’ll find that can charge up your tablet quicker than an iPad Air 3. We found it was able to charge the tablet from zero to 27% in half an hour.",
    "First reviewed: October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "iPad Air 4 price and release date",
    "13": "Design",
    "25": "Display",
    "31": "Specs, performance and camera",
    "45": "Software",
    "49": "Battery life",
    "55": "Don't buy it if..."
  },
  "links": {
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "Apple Pencil": "https://www.techradar.com/news/mobile-computing/tablets/apple-pencil-everything-business-users-need-to-know-1304017",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "iPad Air 3": "https://www.techradar.com/reviews/ipad-air-2019",
    "Samsung Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review"
  }
}