{
  "source": "https://www.techradar.com/reviews/stripe",
  "title": "Stripe review",
  "category": "computing",
  "updated": "2021-07-26T23:41:17Z",
  "author": "rob-clymo",
  "summary": "Stripe lets you process payments fast and efficiently",
  "verdict": "Stripe is a payment service provider that offers business of all types a bumper selection of tools and payment processing options. However, you’ll get more from it if you’re keen to get under its bonnet and get coding.",
  "pros": [
    "Pay-as-you-go flexibility",
    "User-friendly dashboard",
    "Works well across devices"
  ],
  "cons": [
    "Anti-fraud measures hold payments for 7 days",
    "Non-developers might not see all of the value"
  ],
  "article": [
    "Stripe offers online payment processing for internet businesses and is a relatively new name on the cloud-based payment-processing front, but the provider has swiftly gained many users thanks to its appeal for businesses of all sizes. With its headquarters in San Francisco and satellite offices in key cities around the world Stripe has grown a lot since its launch back in 2011.",
    "What sets Stripe apart from many others who offer payment processing is its keenness to involve people who like to get under the hood of its products and services. It's expanded a lot too, having acquired TaxJar to home in on tax compliance as well as producing a new tool for verifiying user identities for starters.",
    "There’s a real developer feel in the air as you get to grips with Stripe, and while that makes it dynamic and a little more interesting than your average payment processing setup, it can also be a challenging proposition if you’re looking for a simple solution for your business.",
    "Competitor options currently include Sage Pay, PaySimple, Authorize.net, Worldpay, PayPal, Helcim and Clover all of which are worthy of investigation during the ongoing coronavirus crisis.",
    "In its basic form, before you’ve customized it to suit your needs, Stripe currently has an integrated pricing structure. This gives you access to a complete payments platform while also offering pay-as-you-go pricing according to its website. That means costs in the US of 2.9% + 30c per successful card charge (1.4% and 20p in the UK by way of a comparison).",
    "As is often the case however, if you’re a business owner that has a lot of high-volume transactions to contend with then Stripe recommended you contact them in order to get a more tailored arrangement. Stripe is also being expanded all the time and while it is already in many countries, progress is such that it’s becoming even more widely available with well over 120 territories now offering it as a payment processing solution.",
    "Stripe might be based around third-party processing, but it comes with a huge range of options that make it a useful route for business of all sizes. In terms of accepting payments then Stripe has a full suite of options, including online, mobile and also in-person.",
    "The great thing is that you can also accept payments from right around the globe, with Stripe automatically converting the transaction. Keep an eye out for additional charges, though these aren't enough to dissuade you from offering the option altogether. Dig deeper into Stripe’s arsenal of tools though and you’ll find many more useful features, including smart invoicing and subscription management and multi-party payments for platforms and marketplaces.",
    "Stripe feels distinctly as though there are very keen developers leading the push to make it more widely known. Just heading around the Stripe website delivers a feeling of speed, efficiency and the sort of minimalism that allows you to be more productive.",
    "You get a similar experience once you start using Stripe itself, with a dashboard interface that is similarly fast and efficient. Stripe as an experience also functions well across a range of devices, meaning that your customers should be able to pay without hassles, no matter how they prefer to do it.",
    "Stripe is by and large pretty easy to use, and that’s not just for you and your business. Customers who need to transact using Stripe don't need to have an account or sign-up, they just make their payment, it’s as simple as that. If you’re a business and running Stripe then you’ll be able to keep tabs on what’s going on transaction-wise via a cloud-based dashboard.",
    "That also indicates payment processing and when you should get the money from each transaction. Stripe also gets you into this world with ease too, as there is basically just a minor bit of form filling to do initially before you’re up and running. More technically-minded folks though will love its other side, which is full of nuts and bolts developer appeal.",
    "Stripe has certainly done a great job putting together a support infrastructure that has to be one of the best there is in the payment processing arena. Online-wise there is an impressive Stripe Support Center that covers a multitude of topics, and it’s all presented in a clean and easy to digest fashion.",
    "Boosting that is the real bonus of 24/7 staff support, which can be accessed via the Stripe website initially. Adding extra muscle to the support structure is a huge array of documentation, which covers everything and anything to do with Stripe products and services. All told, Stripe doesn’t miss a beat on the support front.",
    "Stripe is a strong and sensible option that should appeal to plenty of businesses that want a great all-round performer when it comes to payment processing. While the fee structure can tend to be a little counter productive if you’re dealing with a lot of smaller transactions, and the fact that Stripe holds on to money after a transaction for 7 days as an anti-fraud measure, the service still has a lot of appeal.",
    "You’ll probably want to have a bit of a grounding in coding in order to really exploit the potential of Stripe, or employ someone with said skills. However, even if it’s used in its most basic guise Stripe is solid, dependable and secure too.",
    "It’s easy to see why some might bypass Stripe in favor of PayPal with its very easy to implement options, but with continual improvements being made to the way it ticks, Stripe looks set to become an even more dominant player in the payment services provider stakes."
  ],
  "headers": {
    "4": "Pricing",
    "6": "Features",
    "8": "Performance",
    "10": "Ease of use",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "Stripe": "https://stripe.com/gb",
    "payment processing": "https://www.techradar.com/best/best-payment-gateways",
    "acquired TaxJar": "https://www.techradar.com/news/stripe-acquires-taxjar-to-help-online-businesses-with-tax-compliance",
    "verifiying user identities": "https://www.techradar.com/news/stripe-launches-new-tool-for-verifying-user-identities",
    "Sage Pay": "https://www.techradar.com/reviews/sage-pay-credit-card-processing",
    "PaySimple": "https://www.techradar.com/reviews/paysimple-credit-card-processing",
    "Authorize.net": "https://www.techradar.com/reviews/authorizenet",
    "Worldpay": "https://www.techradar.com/reviews/worldpay",
    "PayPal": "https://www.techradar.com/reviews/paypal-here-pos-point-of-sale-review",
    "Helcim": "https://www.techradar.com/reviews/helcim-credit-card-processing",
    "Clover": "https://www.techradar.com/reviews/clover-pos-point-of-sale-review",
    "anti-fraud": "https://www.techradar.com/news/new-bank-transfer-fraud-protection-measure-launches-in-the-uk",
    "payment services": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}