{
  "source": "https://www.techradar.com/reviews/garmin-lily",
  "title": "Garmin Lily review",
  "category": "fitness",
  "updated": "2021-02-10T15:51:41Z",
  "author": "cat-ellis",
  "summary": "The Lily is more than just a pretty face, but is it enough?",
  "verdict": "The Garmin Lily is a great-looking watch that's been thoughtfully designed with women in mind, but it's lacking some key features we'd expect to find in a watch at this price point. Smartwatches were once chunky, ugly things, but there are so many slim gender-neutral devices on the market now from the likes of Amazfit and Apple, it's hard to justify paying this much for a watch that looks nice, but does less.",
  "pros": [
    "Attractive design",
    "Bright display",
    "Superb companion app"
  ],
  "cons": [
    "No on-board GPS",
    "No contactless payments",
    "Expensive for its feature set"
  ],
  "article": [
    "The Lily is a smartwatch designed specifically with women in mind, by women. It has a slimmer profile, more attractive face, and thinner band than any of Garmin's previous devices. Unfortunately, despite pushing the company's useful female-focused features to the fore, it's lacking some key tools that we'd expect to find on a modern watch at this price point.",
    "Features like menstrual tracking are available on your wrist by default, and sending an emergency alert to a contact is a simple matter of repeatedly tapping the touchscreen. but it's a real shame that the Lily is missing on-board GPS, which has been a cornerstone of Garmin's devices since the company was founded. There's also no NFC, so you can't use Garmin Pay to make contactless purchases; a real disappointment in a watch designed for everyday wear.",
    "We like the concept of the Lily, but it seems to be a little behind the times. Serious sports watches like the Garmin Instinct and Polar Grit series are seriously chunky and 'masculine', but that's not what the Lily is.",
    "Instead, it's a relatively feature-light smartwatch, which isn't something that market is really missing. Devices like the Apple Watch and Amazfit GTS series do more, and are gender-neutral – attractive and modern, and slender enough to easily slip under a sleeve. They can also be loaded with whichever tools you need, including period tracking. There's simply no need for a gendered smartwach any more.",
    "If Garmin could take the Lily concept (neat, compact and good looking) but add the serious sports-tracking smarts you'd find in the Forerunner series, it would be much more special – even if the price was much higher.",
    "The Garmin Lily launched in January 2021 in the US and UK, and will be released a little later in Australia.",
    "The Lily Classic with an Italian leather band costs $249.99 / £229.99 / AU$399, and the Lily Sport with silicone band costs $199.99 / £179.99 / AU$329.",
    "The Lily is designed as a smartwatch for women, but Garmin hasn't simply gone down the 'pink it and shrink it' route. Instead, it's created a whole new design that's completely different from its previous devices.",
    "There are two options to choose from: the Lily Classic, which has an Italian leather wristband, and the Lily Sport, which has a silicone strap more typical of smartwatches and fitness trackers. Both are available in three colorways (including neutral shades and soft purples), and the bands can be swapped for different options purchased separately.",
    "One of the most obvious differences between the Lily and a typical fitness tracker is the width of its band; it's much narrower (just 14mm) and considerably shorter (designed for a wrist circumference of 110-175mm). Longer bands can be bought online, but only in leather. It's very comfortable, even at night, and we easily forgot we were wearing it.",
    "Another of the Lily's notable features is its surprisingly bright TFT LCD display. The watch's designers have smart use of the 16-shade grayscale palette, with different shades used to separate different on-screen elements, and indicate whether an element is loading.",
    "There's a selection of well designed faces that you can choose from on the device itself, though we would have liked to see an analog option, particularly since you're unable to download more from the Garmin Connect IQ store.",
    "When not in use, the display is particularly attractive, with a patterned metallic design that's a welcome change from the usual blank gray, and makes it look more like a piece of jewelry.",
    "Raising your wrist unlocks the screen, though we found this sometimes didn't work as intended. You can adjust the watch's gesture sensitivity if you run into the same issue, but bear in mind that this will reduce the watch's battery life.",
    "The Lily has a water resistance rating of 5ATM, meaning it can be submerged to depths up to 50 meters for 10 minutes – fine for pool swimming and showering – and is charged via a USB clip. This attaches firmly and doesn't accidentally pivot and lose connection (a problem we've experienced with some other clip chargers in the past).",
    "The Garmin Lily isn't compatible with apps and faces from the Garmin Connect IQ store, but you can pick and choose from a wide range of widgets that are accessible with a tap and a swipe of the screen.",
    "App notifications appear with gentle haptic feedback, and can be checked and dismissed by swiping down. Swiping down also opens the Lily's settings menu, Find My Phone (which is extremely loud), alarm, music player, and do not disturb mode.",
    "Tapping the menu button (indicated with a circle at the bottom of the face) gives you access to activity tracking, and swiping left or right lets you see the hydration widget, your daily activity and health stats, and the period tracker.",
    "Garmin has been making big steps forward in women's health, with the addition of period tracking and, more recently, pregnancy tracking to its app. The Lily pushes these features to the fore, meaning you no longer have to delve into Garmin Connect to log symptoms during your cycle.",
    "The Lily operates on the assumption that you'll always have your phone on you, so although there's no on-board music storage, you can use the Lily to control music playback on your phone, with play/pause and skip buttons, and a display of the current track and artist. It's simple, but works well.",
    "The Garmin Lily can measure deep, light and REM sleep during the night, and you'll be able to see a report of how well you rested in the morning. There's also a pulse oximeter, which checks SpO2 levels during sleep and can be used to perform spot checks. Many similarly priced devices only record SpO2 during sleep, so if you're interested in checking it as a measure of fitness, this might tip the balance in the Lily's favor.",
    "There are abnormal heart rate alerts (both low and high), and if the watch detects that your heart rate is particularly high (as it did after we'd finished an online workout class), it will lead you through a five-minute breathing exercise to lower it.",
    "As mentioned before, one of our main criticisms of the Garmin Lily is its lack of on-board GPS. It does, however, offer connected GPS, which piggybacks on your phone's navigation while you walk, run or cycle. In our tests, this worked well - time and distance are clearly displayed during your workout, and you'll see a map of your workout in the Connect app once you've finished.",
    "There's one big drawback though: any notifications you receive during an activity will appear over your current distance, which can be very frustrating as they take quite a long time to clear.",
    "There are seven timed activities to choose from, which is fewer than most Garmin devices, but covers all the basics. You can take your pick from indoor and outdoor running, indoor and outdoor cycling, free cardio, strength training, swimming, and walking. This isn't a device you'd choose for niche pursuits like alpine skiing or climbing, so this small selection makes sense.",
    "The Lily can store up to 14 days of tracking data, though since many of its features rely on a connection to your phone, your workouts are likely to be synced immediately.",
    "Set up an emergency contact in the Garmin Connect app, and if you run into trouble while you're out, you can send that a notification by tapping the watch's screen repeatedly (no need to navigate through menus or remember a combination of button presses in an emergency). Your contact will receive a text message containing your GPS co-ordinates, which they can open in Google Maps to see exactly where you are.",
    "There's also Livetrack, which allows a friend or family member to follow your progress while you're outside. It works well and produces an accurate map that your contact can follow using Garmin Connect on their own phone. Just remember to turn it off once you're done to avoid draining the battery.",
    "Garmin Connect is a jewel in Garmin's crown; a feature-packed fitness app that gives you as much or as little detail as you like, and receives regular updates that make it even more useful.",
    "Pairing the Lily is simple: just install the app and create an account you don't already have one, then tap 'Garmin Devices' and follow the on-screen instructions, entering the PIN displayed on the watch's face when prompted.",
    "If you decide to invest in the Lily for everyday wear and stick with a more traditional sports watch for workouts, the app has no trouble handling them all; just choose which one will be your primary device, and the app will collate data from all of them in one convenient dashboard. Stats from Garmin smart scales and heart rate monitors will also be listed, giving you a complete picture of your health.",
    "Unlike Fitbit's companion app, there's no need to pay a subscription to unlock advanced features. All your historic workout and biometric data is at your fingertips, so you can easily monitor it for trends that can help you make lifestyle adjustments.",
    "You also get free access to a huge range of workouts to follow. Just tap the 'Training' option, select 'Workouts' and select 'Find a workout' to browse through an extensive catalog of different options that will really push you. You can filter by activity, difficulty, muscle groups, goals (such as building strength, fat loss or flexibility), and duration.",
    "You won't have a Peloton-style instructor shouting encouragement, but you'll be guided through each workout with audio cues and looping video clips showing you proper technique.",
    "There are also training plans available for running and cycling, which will help you achieve goals like working up from couch to 5K, running your first marathon, or riding a century.",
    "You can even log and track the wear of your running shoes, bikes and other gear, so you know when it's reaching the end of its life and should be retired. It's all very well thought out, and clearly designed by people who live for sports.",
    "It's just a shame that the Garmin Lily doesn't put more priority on exercise as well. There's definitely a gap in the market for a serious sports watch that's slim and unobtrusive, but this isn't it."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "7": "Design",
    "15": "Smartwatch features",
    "22": "Fitness tracking features",
    "28": "Companion app",
    "37": "Don't buy it if"
  },
  "links": {
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Amazfit GTS": "https://www.techradar.com/reviews/amazfit-gts-2",
    "purchased separately": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5308099551097825000/https://buy.garmin.com/en-GB/GB/p/734743"
  }
}