{
  "source": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
  "title": "iPad Pro 12.9 (2021) review",
  "category": "tablets",
  "updated": "2021-08-26T13:23:11Z",
  "author": "james-peckham",
  "summary": "The biggest upgrade to the iPad Pro since its inception",
  "verdict": "The new iPad Pro 12.9-inch for 2021 is the best tablet money can buy, with top-end power, a fantastic display, a whole host of new smaller upgrades and an all-round experience that makes it a must-have for both Apple fans and those who want an unrivaled tablet experience. It isn’t for everyone though, on account of its large size and high price tag, and you may be better served by another more portable and affordable tablet, but make no mistake: this is the best of the best.",
  "pros": [
    "Phenomenal power",
    "Fantastic display",
    "Strong battery life"
  ],
  "cons": [
    "An almighty price",
    "128GB storage feels limited",
    "Lackluster color options"
  ],
  "article": [
    "The iPad Pro 2021 is a huge step up for Apple’s best tablet experience, but is it one that you need? If you want the very best tablet that money can buy, and a slate that can achieve almost anything you want a computer to, this is likely to be your perfect purchase.",
    "The iPad Pro 2021 12.9-inch isn’t for everyone. The biggest caveats are that it’s incredibly expensive, and that it’s an overwhelmingly large device for those who don’t need a screen this big.",
    "There is another option you can buy, which addresses both of these issues in part, and that's the iPad Pro 2021 11. This is slightly smaller and costs less than the 12.9-inch model, with a screen that measures just 11-inches across, but in terms of specs it's an identical tablet.",
    "For those who can handle both the physical size and the price tag, though, the iPad Pro 2021 is an outstanding offering that boasts next-gen power, a fantastic display experience, and everything else we’ve come to love from Apple’s very best tablets.",
    "The new Liquid Retina XDR Mini LED display is gorgeous, with max brightness levels unseen on other tablets – this slate can compete with the likes of Samsung’s Galaxy Tab S7 Plus, which felt like a major upgrade for tablet screens just last year. The screen is one of the best for watching movies on, and it'll also suit you well for everyday tasks.",
    "Then there’s the power – much has been made of Apple’s M1 chipset, and this is the first time the company has included its new, own-brand silicon in an iPad. Do you absolutely need it? Probably not, but if you want some truly impressive power that blows every other tablet out of the water, again the latest iPad Pro is a great choice.",
    "You likely won’t appreciate having this much power on tap unless you’re intensively gaming, using power-hungry apps, or pushing the tablet to its multi-tasking limits. This will load apps like YouTube, Netflix and your email faster than before, but in most cases the difference is negligible, and you’ll only really notice when powering up the App Store’s most intensive experiences.",
    "Other upgrades are less important, but there are a few other noteworthy tweaks. There’s a higher-capacity storage variant than ever before at 2TB, a new Center Stage camera feature that keeps you in the frame on video calls, and Thunderbolt 4 support in the USB-C slot. These are all great additions, but they’re overshadowed by the display and chipset’s game-changing upgrades.",
    "Battery life is solid – in our testing we found that the tablet would last for around 10 hours on a full charge. Your mileage will of course vary depending on what you’re doing, but this is solid battery performance that no one should be disappointed by.",
    "All of this comes at a high price, and this is Apple’s most expensive tablet ever. It starts at $1,099 / £999 / AU$1,649, with the price increasing to $2,199 / £1,999 / AU$3,299 for the 2TB model – and you’ll pay more again if you opt for a version with cellular connectivity.",
    "The iPad Pro 2021 is a phenomenal machine that’s a must-have if you’re an Apple evangelist, or if money is no object when you’re buying your next tablet. It isn’t the best tablet for everyone, due to its size and staggeringly high price, but is it the very best tablet money can buy right now? Yes, without a doubt.",
    "Apple’s new iPad Pro 2021 is now available to buy around the globe. You can buy it directly from Apple and a variety of other retailers after it came out on May 21, 2021.",
    "Whether you’ll be able to actually get your hands on one on is a different question. A few days after the May 21 release date, we found orders directly from Apple were taking a few weeks to arrive with estimates of between June 2 and June 9 for delivery.",
    "Apple CEO Tim Cook confirmed before the tablet's release that the company was expecting demand to outstrip supply. That's perhaps due to shortages of the new M1 chip, but Apple hasn't confirmed the exact reasoning.",
    "The iPad Pro 2021 12.9-inch price is high, and it’s higher than the 2020 version of the tablet. It starts at $1,099 / £999 / AU$1,649 for the 128GB-storage version, with the price topping out at an incredible $2,399 / £2,149 / AU$3,549 for the cellular 5G-ready model with 2TB of storage.",
    "That’s notably more expensive than the 2020 iPad Pro 12.9-inch, which started at $999 / £969 / AU$1,649. It’s a big markup, and it’s mostly because the company has noticeably bumped up the specs in this new tablet.",
    "If you’re looking for something cheaper, the 11-inch iPad Pro 2021 has lower specs and starts at $799 / £749 / AU$1,199 which is the same price the 2020 model started at.",
    "The price for Apple’s top-specced 12.9-inch slate is remarkably high, and as we’ve mentioned, you’ll only want this tablet if you want the absolute best iPad on the market.",
    "The iPad Pro 2021 design hasn’t changed much from previous iterations – it’s still a great-looking device with a sleek design that simultaneously feels premium and durable. If you’re looking for a functional yet attractive tablet, you’ll be pleased with what’s on offer here.",
    "It’s important to note that the new iPad Pro is big. The 12.9-inch display means this is a particularly large slate, and many will prefer the smaller 11-inch model, or something even smaller, like the iPad Mini 2019. If you’re happy with a larger design, you’ll also benefit from a larger display, more on which below.",
    "The tablet has an aluminum rear and frame, and the front is glass with a scratch-resistant coating – but you’ll want to buy a case if you want to maximize protection against knocks and scrapes.",
    "There are four speakers, with two on the top of the device and two on the bottom edge. The bottom of the device is also home to the USB-C port, which is also a Thunderbolt port (we’ll look at connectivity in detail later in this review).",
    "The side edges of the tablet are sleek and largely free of interruptions, with the right-hand edge designed to recharge the Apple Pencil (it’s magnetic, so it’ll stick to the side); the volume buttons sit right at the top of that edge.",
    "The tablet comes in a choice of Silver or Space Grey, so your color options here are limited. Both look attractive, but at a time when the company is expanding its color choices for the new iMac with some striking tones, it’s a shame it isn’t giving us the option of a pastel pink or purple iPad Pro.",
    "The iPad Pro 2021 12.9-inch measures 280.6 x 214.9 x 6.4mm, which means it’s a touch thicker than the last-gen tablet, although it isn’t a difference we particularly noticed in everyday use. The Wi-Fi-only variant weighs 682g, while the 5G-ready cellular version is a touch heavier at 685g.",
    "Don’t expect a dramatically different looking iPad Pro here from Apple; instead the company has focused on improving the internals, along with the display.",
    "The display is one area where Apple has noticeably upped its game for the new iPad Pro 2021, with a top-end 12.9-inch screen. If you’d prefer a smaller premium tablet you can buy the 2021 iPad Pro 11-inch, but the screen tech isn’t as impressive on that device.",
    "The 12.9-inch Pro’s display features new Mini LED technology that offers a crisp image as well as improved brightness. The company calls this a Liquid Retina XDR screen, and we’ve found it to provide a great viewing experience.",
    "The peak brightness is arguably excessive at 1600 nits, and we often found the maximum setting to be too much in everyday use. The display also has a 120Hz refresh rate, which means the on-screen image refreshes twice as fast as on many other tablets for a smoother look and feel.",
    "It’s especially effective when you’re scrolling through social media feeds, or playing an intense game and need the image on the screen to keep pace with the action.",
    "The display offers a clear image with great quality – we found this to be a particularly stunning screen on which to watch movies and videos, and it’s just as impressive for editing video, making this an attractive device for content creators.",
    "The resolution is 2048 x 2732, which works out to 265 pixels per inch, which is similar to the quality you’d expect on a top Android tablet like the Samsung Galaxy Tab S7 Plus.",
    "This is one of the best visual experiences we’ve had on a tablet, and if display quality is an important factor in your choice of slate, the iPad Pro 2021 won’t disappoint.",
    "This is where the iPad Pro 12.9-inch really comes alive, delivering quite simply the best performance we’ve ever seen on a tablet. With previous iPad Pros we might have hedged a little here, and said it was among the best-performing tablets but this is a step above what we’ve seen on previous iPads and Android slates.",
    "Apple has included its latest M1 chipset, here, which debuted in the company’s top-end Mac products in 2020.",
    "If you’re a more typical iPad user, you may not notice this power jump in everyday tasks, but the new silicon is designed to make the iPad Pro a powerhouse device for those who need it, such as those who want to make music on their tablet, edit video, draw, or perform other power-intensive tasks.",
    "The new iPad Pro 2021 will run your regular iPad apps every bit as effectively as previous models, but if you’re looking to use more specialist software you’ll likely appreciate the M1 chipset more than those who want to use their iPad for streaming Netflix, for example.",
    "In Geekbench 5, we found it scored an average multi-core score of 7297. That’s a huge gap between the Samsung Galaxy Tab S7 Plus - which TechRadar currently ranks as the best Android tablet - that scored 2,846.",
    "Last year’s iPad Pro 2020 scored around 4,700 during testing so the M1 chip has given that a remarkable step up here, and you’ll notice it when you’re powering up more intensive software on the slate.",
    "You’re getting either 8GB or 16GB of RAM depending on the model you opt for. The 128GB, 256GB and 512GB storage variants get 8GB, while the two highest-capacity models, with 1TB or 2TB of storage, come with 16GB.",
    "We’re reviewing the 1TB and 16GB model, and we’ve found it to be more than suitable for our needs, even for intensive tasks.",
    "2TB of storage is the most we’ve ever seen on an iPad, and that’s impressively high if you want to be filling your slate full of video clips, audio and other files that take up a lot of space.",
    "There’s no microSD support here, so if you opt for one of the lower storage variants you’ll want to bear that in mind. 128GB does seem a touch limited if you’ll be filling your tablet with lots of apps, and media on top, so it’s something to be aware of before you make your purchase.",
    "There’s 5G connectivity on this tablet for the first time, which means you can make the most of next-gen internet speeds if you opt for a more expensive cellular version of the iPad Pro. We found 5G to work well during our testing.",
    "The USB-C slot on the new iPad Pro is the first from the company to also support Thunderbolt connections. That means increased speed – Apple claims up to four times the speed – and it also means a whole host of high-performance devices can be connected to your iPad.",
    "These are mostly peripherals such as high-resolution displays, but it also means you can connect to faster external storage devices and other devices for further tasks.",
    "Moving onto the camera, and you’ll find a capable 12MP rear shooter on the rear of this tablet. It isn’t going to stun you with what it’s capable of doing, but it’s good enough for everyday tasks and we found it useful in a variety of apps.",
    "There’s also a 10MP ultrawide camera for when you need more in the shot, which we also found to be useful enough. There’s also a time of flight sensor on the rear of the tablet, which is used to depth sensing for portrait mode",
    "The front of the tablet features a 12MP camera as well, which is sat along the top bezel of the device. This does prove a touch annoying when the product is in landscape, as the camera is no longer in the center of the display.",
    "A new software upgrade for the iPad Pro 2021 is a feature called Center Stage, which uses the camera to follow you around the room when you’re on video calls. It’s something we’ve seen on Amazon products before, and it works very well here on the iPad Pro.",
    "We found it would track us well, and it crops into an image to ensure that you’re in the center of the image. If you move to go and grab something, but you’re still in frame the camera will follow. It makes you feel a touch more comfortable in video calls, rather than having to keep an eye on your own display to see if you’re in the frame.",
    "Optional accessories are available for the iPad Pro, and the two main highlights are the existing Apple Pencil 2 as well as a new version of the company’s Magic Keyboard.",
    "If you own the Magic Keyboard designed for the 2020 12.9-inch edition of the iPad Pro it should still work with the new model but Apple notes that the new tablet is slightly thicker so the keyboard may not close properly onto the iPad. We haven’t been able to test this out, but if you want the slickest experience you may have to buy the new version of the keyboard.",
    "The Magic Keyboard isn’t cheap at $349 / £329 / AU$549, but it’s a worthwhile addition that makes typing on the iPad Pro more like using a laptop – we wrote the majority of this review on the tablet using the Magic Keyboard, and that was certainly our experience.",
    "The Magic Keyboard keyboard is a touch more cramped than a laptop’s, and the iPadOS software isn’t fully integrated in the way it is on a MacBook, but it’s a good alternative if you can only buy one device.",
    "That said, this keyboard is remarkably expensive. You may want to opt for one of the smart keyboard products that start at $199 / £199 / AU$299 but aren't as high-end and useful.",
    "The Apple Pencil 2 – that’s the model with wireless charging from a few years ago – is also compatible with this tablet, and it’s a great stylus experience if you want the extra functionality of being able to take notes or draw on your tablet’s screen. It’s not included with the tablet though, and it costs $129 / £119 / AU$199.",
    "We’ve yet to learn the exact size of the battery inside the iPad Pro 2021, but the battery life has proved strong during our testing time with the tablet. Some rumors claim the battery is bigger than the one in the 2020 edition, and that last-gen model had a 9,720mAh battery; we likely won’t know for certain until someone breaks open a new iPad Pro and looks inside for themselves.",
    "We found that the iPad Pro was capable of lasting the full 10 hours that Apple claims, with us performing a variety of tasks including web browsing, streaming video, writing in a word processor, gaming, and bouncing around a variety of apps.",
    "We also adjusted the brightness up and down during our testing, and as expected we found that the battery would drop much faster when the tablet was at its maximum brightness.",
    "Unlike with Apple’s iPhone 12 series of smartphones, you do get a charger included in the box with the new iPad Pro 2021. Exactly why Apple has decided to include chargers here but not with its iPhones is currently unclear.",
    "Fast-charging isn’t that remarkable on the iPad Pro 2021, which means it takes a little longer to charge than some Android tablets such as the Samsung Galaxy Tab S7 Plus. Its 18W charging is noticeably slower than Samsung’s top-end tablet, which supports 45W, and we found the tablet was capable of recharging from zero to full in around two hours and 45 minutes using the charger provided in the box.",
    "If you’re looking for solid battery life that will last you a whole working day plus a bit extra, the iPad Pro 12.9-inch should suit you just fine. If you’re running more intensive apps or high-end games you may find that it runs down more quickly, although it should still keep going for close to that 10-hour figure.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "New iPad Pro 2021 release date and price",
    "18": "Design",
    "26": "Display",
    "33": "Specs, performance and cameras",
    "51": "Accessories",
    "57": "Battery life",
    "63": "Don’t buy it if..."
  },
  "links": {
    "iPad Pro 2021 11": "https://www.techradar.com/reviews/ipad-pro-11-2021-review",
    "best tablets": "https://www.techradar.com/news/best-tablet",
    "Samsung’s Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Apple’s M1 chipset": "https://www.techradar.com/news/apple-m1-chip",
    "Center Stage camera feature": "https://www.techradar.com/news/apple-center-stage-camera-feature"
  }
}