{
  "source": "https://www.techradar.com/reviews/avast-one",
  "title": "Avast One review",
  "category": "computing",
  "updated": "2021-10-11T13:08:50Z",
  "author": "mike-williams",
  "summary": "The new name for Avast's consumer security range",
  "verdict": "Excellent all-round protection provided by a range of powerful tools, even in the free version. Paid-for versions add additional security, but for general home users the free version will do everything it needs for all-round protection.",
  "pros": [
    "Free to use",
    "Packed with features",
    "Strong protection",
    "Doesn't slow computer"
  ],
  "cons": [
    "Unclear file warnings",
    "VPN limit"
  ],
  "article": [
    "Avast One is the new name for Avast's revamped and redesigned consumer security range, and combines antivirus, VPN, privacy and security tools to keep you safe online.",
    "Avast One Essential is free, but stuffed with features: antivirus, ransomware protection, anti-phishing and a simple firewall, with apps for Windows, Mac, Android and iOS.",
    "New additions include a restricted VPN (one location and 5GB data a week), simple device speedup tools, and data breach scanning to warn you if your online accounts are breached.",
    "Upgrading to Avast One Individual extends your protection with an advanced firewall, full VPN (unlimited data, 54 locations), anti-tracking, webcam monitoring, a powerful disk cleaner, extra device speedup tools and automatic updates for your apps. The license covers protection for up to five of your devices.",
    "Avast One Family takes all the features of Avast One Individual, and allows you to share them with up to six family members and 30 devices.",
    "Avast One's installer isn't as customizable as the last edition. Previously you could clear a checkbox if you didn't need the firewall, say, or the cleanup tools, and they wouldn't be installed. Now, it's all or nothing.",
    "This certainly keeps life simple, though, and the setup process has improved in other ways. The installer doesn't try to set Avast Secure Browser as your system default, for instance (in fact, Avast One doesn't include Secure Browser at all.)",
    "Avast One Essential doesn't require registration, either, so there's no need to create accounts or hand over any personal information.",
    "The end result was a speedy and hassle-free installation on our normal review system.",
    "We tested Avast One's impact on system performance by running top benchmark PCMark Professional before and after installation. Previously Avast slowed us down a little more than average, but this time we found no measurable difference at all. Absolutely nothing.",
    "That's based on Avast One Essentials and without using any of Avast's speedup tools, either. There are too many variables to make any guarantees, but it's at least possible that installing and setting up Avast One could leave your system faster than it was before.",
    "There was more good news in our self-protection tests ,where we launched a number of attacks on Avast One to see if malware could disable it. These involve attempting to delete files, change Registry settings, stop or disable services, close processes, unload drivers and more, but none of them made the tiniest difference to the package, which continued to protect us as usual.",
    "Avast One has a totally redesigned interface, and that's mostly a good thing. Out go the dark backgrounds, the tabs, the tiles: in comes a light and airy look, with friendly graphics and speedy access to all of One's core features.",
    "Looking to run a scan, connect to the VPN, accelerate your system, for instance? No need to go browsing through various tabs, then try to remember wherever everything is. Just scroll down and there are shortcuts to scans, the VPN and others, and you can run them all in a couple of clicks.",
    "Clicking the Explore button displays a full list of Avast One's features, which does look a little more complicated. But it's easier to understand what's on offer when you can see everything in one place, rather than browsing around a number of tabs. And if you don't understand something - what is 'File Shield', exactly? - clicking the option gets you a simple explanation (the File Shield allows Avast to scan every file you access to make sure it's safe.)",
    "Several options aren't available in the free Avast One Essentials (Webcam Protection, Web Hijack Guard, Driver Updater, more.) Some free apps don't mark these, so you're forever clicking buttons and being told 'can't have that until you upgrade, you freeloader.' Avast highlights options you can't use with a padlock, a smarter approach which makes One Essential much more comfortable to use.",
    "Overall, Avast One's dashboard looks great, is easy for beginners to use, but also makes it simple to discover and access the suite's more advanced features.",
    "Avast One's antivirus features begin with the Smart Scan. Launch this with a click and it runs a 10-15 second Quick Scan for malware, combined with checks for dubious browser add-ons and PC performance issues. (It doesn't look for missing software patches, unlike the previous Avast Antivirus, although you can still do this manually.)",
    "The Smart Scan and Avast's real-time protection should spot most threats, but the package has plenty of other options. There's a Deep Scan (previously called a Full Scan) to check your entire system; a Targeted Scan which examines specific files or folders, and a Boot-Time Scan to check for threats before Windows fully starts. And, if that's not enough, you can create custom scan types to do whatever you like.",
    "There are plenty of configuration options, too. You're able to define what to scan (all hard drives, the system drive only, removable drives, archives, more), how to treat any threats, set scan priority to optimize performance, and more.",
    "On demand scans",
    "The engine supports running on-demand scans in parallel, a level of flexibility you won't always see elsewhere. If you're running a lengthy full system scan, for instance, you're able to run a separate targeted scan on a removable drive you've just connected, and maybe check some recent downloads, all at the same time.",
    "This didn't always work smoothly. Although our normal on-demand scans ended with a reassuring 'we didn't find anything' message, the Scan History page warned that 'your Explorer Scan was unable to scan all files', and 'we suggest scanning again.'",
    "Could that be a problem? We needed to see which files had been missed to decide. But, no - although we think that's really important information, the Scan History page doesn't make it available.",
    "Scan speeds",
    "Scan speeds were average, with Avast Essentials taking 32 minutes to scan 50GB of executable files. That's fractionally slower than Avira (28 minutes) and Kaspersky (29 minutes), but well ahead of Bitdefender (39 minutes.)",
    "We scan the same test data a second time to find out whether an antivirus uses any optimizations. Avast's time dropped fractionally to 27 minutes, similar to Avira's second scan of 24:41. But some apps only scan files if they're new or change, and that makes a huge difference. Bitdefender's second scan of our test data took 27 seconds, and Kaspersky managed 170 seconds.",
    "Avast has a little room for antivirus improvements, but on balance it's a likeable product, easy to use, powerful and configurable, with something for every level of user.",
    "Protection",
    "AV-Comparatives' Real-World Protection Test regularly checks top antivirus products against the very latest malware.",
    "It's a seriously tough benchmark, but didn't trouble Avast. The latest February-May 2021 summary report places the company in an excellent 2nd place out of 16, with a protection rate of 99.9%. To put that in perspective, Kaspersky's 99.5% earned it 11th place, and Avira's 98.9% got the company to 14th.",
    "There's more good news with AV-Test's Home Windows report, where Avast scored a maximum 6/6 for protection in all six tests over the last year. AV-Test has marked Avast down just a little for performance in the past, finding it slowed down the test system a little more than average. Even that's improved recently, though, with Avast also scoring the best possible 6/6 for the three previous tests.",
    "Our own tests began with some simple behavior monitoring checks, where a custom executable uses common scripting tricks to download a malicious file.",
    "Results were mixed, with Avast quarantining our test app immediately for some actions, while allowing others to continue and only detecting an issue when the file hit our hard drive. Bitdefender and Kaspersky are more consistent, blocking all tests, but others have done much worse (Adaware missed all the suspect behavior, although it did detect the files), and Avast was acceptable overall.",
    "The second, more advanced test used a simple ransomware simulator we've developed ourselves. As Avast hadn't seen this before, it wouldn't be able to detect it from a file signature alone, making this a useful test of behavior monitoring.",
    "We launched the simulator and Avast One realized this was something new, and announced that it was being scanned for threats. A positive start? Maybe, but around 15 seconds later Avast told us the simulator was safe, then did nothing at all as it encrypted thousands of user files.",
    "Some antivirus apps perform much better on this test. Bitdefender and Kaspersky not only killed the simulator within a fraction of a second, but they also recovered the handful of files it managed to encrypt (five to ten.)",
    "Our simulator isn't real malware, though, so while we treat successful detections as a plus, we don't significantly penalize apps which fail to detect it.",
    "What's more, this isn't Avast's only ransomware defense. There's another more effective layer available.",
    "Install Avast One and it automatically detects folders with user documents, then adds them to Avast's Ransomware Shield Protect list. Untrusted apps aren't allowed to modify the contents of anything in these folders without permission.",
    "Sounds good, and sure enough Avast correctly added our main user folders to its Protected list. It wasn't so smart at detecting others, though, missing folders containing thousands of documents.",
    "That's a problem, especially as there's no sign of any issue. Avast One doesn't tell you it's running this document search, and unless you happen to click the Ransomware Shield option, choose 'View protected folders' and browse the list, you might never realize Avast has missed something.",
    "If you happen to find the option, though, it's easy enough to understand. We spotted the problem, and added our extra data folders manually in just a few seconds.",
    "Shield fully activated; we ran our ransomware simulator again. This time Avast One raised an alert as soon as it accessed a file, we chose the Block option, and it wasn't able to touch anything on our system.",
    "Once we did, Avast raised an alert as soon as our ransomware simulator or other untrusted apps attempted to access the files, and they weren't able to do so until we gave permission.",
    "This isn't a substitute for correctly recognizing malware in the first place (our ransomware wasn't able to encrypt any documents, but Avast didn't recognize it as a serious threat and allowed it to continue running.) Still, it's a useful extra layer of protection which could work with even the very latest threats. Just keep in mind that it's not a paid feature - you can get it for nothing in Avast One Essentials.",
    "Avast One doesn't just do a good job of detecting malware: it detects and blocks access to malicious websites, reducing the chance you'll get infected in the first place.",
    "This isn't an area where Avast has always excelled excelled in the past, but the company looks to have upped its game. The AV-Comparatives 2021 Anti-Phishing test found it blocked an excellent 96% of test URLs, putting it equal first with Trend Micro, and ahead of Fortinet (95%), Kaspersky (94%), ESET (91%) and Bitdefender (87%.)",
    "We assembled a collection of box-fresh phishing URLs to run our own tests, comparing Avast One with Bitdefender. That delivered a positive result, too, with Avast detecting 67% of threats compared to Bitdefender's 41%.",
    "Avast One doesn't include the Avast browser extensions any more, which means users miss out on one or two useful web-related extras (there's no highlighting of malicious links in your search results, for instance.) We think that apps messing with our browser setup is generally a bad idea, though, and Avast Online Security can still be installed separately, if you need it.",
    "On balance it's a great web protection package, especially as you don't have to buy Avast One Individual to get it: all this web filtering power comes for free in Avast One Essentials.",
    "Avast One Essential includes a simple firewall which monitors your network traffic, and aims to prevent both hackers penetrating your system and malware phoning home.",
    "You can also view a list of apps using your connection, the amount of data they've transferred so far, and manually decide to block them.",
    "Upgrading to the paid Avast Individual apparently gets you more shielding of your system, and detection and user alerts for port scans and ARP spoofing attacks (an exploit which may allow hackers to infiltrate your network.)",
    "Although this sounds reasonable, we're not sure how much functionality it adds to the regular Windows firewall. We're not convinced by all the talk of interaction with the user, either. Norton and Bitdefender's firewalls are still our network favorites, not because they raise alerts and have plenty of tweaks and settings, but because they don't need all that: they do a great job of intelligently managing your network connection all on their own, no manual intervention required.",
    "We noticed that Avast One's Windows app has dropped Wi-Fi Inspector, a handy tool which previously allowed you to view connected devices and highlight vulnerabilities. The Android One Essentials app has a similar Wi-Fi Scanner feature, so the feature hasn't disappeared entirely, but it's a pity it's now Android-only.",
    "Installing the free Avast One Essentials gets you a restricted (but still very useable) version of Avast's HideMyAss!-powered SecureLine VPN.",
    "The major restriction is there's no support for choosing location: the app just automatically connects to your nearest server, wherever it might be. So, you can forget about unblocking streaming platforms in other countries. It's not going to happen.",
    "There's a data limit, too, although that looks relatively generous at 5GB a week. Avast's Phantom VPN gives you a miserly 500MB a month, Bitdefender's VPN offers 200MB a day (6GB a month), even Windscribe's excellent free plan stops at 10GB a month. Proton VPN's unlimited data plan is still top of the free VPN list, but Avast is way better than most.",
    "Speeds were much more ordinary. Our local server managed only 45Mbps, well below average, though enough for browsing and occasional use.",
    "Avast's Windows app has a capable kill switch which correctly blocked our internet access whenever our VPN dropped. We used some very drastic techniques to simulate various problems - turning the router off and on again, crashing the OpenVPN executable - but the app just blocked our internet, displayed an alert, and got us reconnected as soon as possible.",
    "SecureLine can automatically connect whenever you access insecure Wi-Fi. That's handy, but there's a very unusual extra: it can also warn you to connect whenever you visit a banking site, a web store, a 'sensitive' site (adult, gambling, violence, more), or any website login screen. This could save you a lot of trouble if you regularly forget to connect. Bitdefender Premium VPN does something similar with even more site categories and app types (file sharing, P2P), but we've not seen this functionality from anyone else.",
    "Upgrading to Avast One Individual gives you unlimited data and 54 locations to choose from. Download speeds are still below average in our tests, but we've had some unblocking success in previous reviews, including the ability to unblock US Netflix.",
    "The VPN is a great addition to Avast One Essentials, and the 5GB a week data allowance tramples over most of the competition. It's not such a clear picture when comparing paid products, though. Bitdefender's commercial VPN in particular is significantly faster than Avast and did a little better at unblocking in our last tests.",
    "Avast One doesn't include a password manager, but you do get a couple of extra protective layers designed to keep your credentials private.",
    "All versions of Avast One have the option to scan a database of data breaches (provided by dark web monitoring experts SpyCloud) to find out if their account details have been exposed.",
    "Avast One's paid products add breach monitoring, where the app automatically checks new breaches and warns you if your credentials are included.",
    "The paid editions also include Browser Protection, a feature which limits access to passwords stored in your browser. We tried using a couple of NirSoft tools to access our Chrome and Firefox passwords and Browser Protection worked perfectly, spotting the attempt, and blocking access until we approved it.",
    "These features are genuinely useful, but they don't add a great deal of value to the suite. You can already scan data breaches for your details at Have I Been Pwned, and optionally get a notification if they turn up in a new breach. And the most secure way to handle passwords isn't to control how they're accessed in the browser, but not to store them in the browser in the first place. You're far safer with a quality password manager such as Dashlane.",
    "Avast One Essential's Software Updater scans your apps, detecting and listing missing updates. It'll install them, too, although you must manually click an Update button for every app you'd like patched.",
    "Upgrade to Avast One Individual and you get the ability to automatically update all your apps. We tried this, and Software Updater found six available updates, downloaded the patches in parallel, then silently installed them, all in a very few seconds.",
    "This looks good and performs reasonably well, especially the free version. Avira's free Software Updater tells you about missing updates but won't do anything to install them until you upgrade.",
    "Avast One only supports updating 50 common apps, though, compared to 150 for Avira, and hundreds for some of the free patch management competition. Still, it's a useful tool and we're glad to see it included in the suite.",
    "All Avast One users (free and paid) get access to a Clear Browsing Data feature, where you can quickly clear away your browsing history, cache, cookies and more. This works much like every other web cleanup tool you've ever used, but Avast does deserve credit for its wide app support: the module cleaned Chrome, Firefox, Edge, Opera, Brave and even Thunderbird on our test system.",
    "Paying for Avast One Individual or family gets you a number of other interesting and unusual features.",
    "The Sensitive Data Shield (SDS) automatically scans your drive for files which might contain sensitive data - names, addresses, passwords, financial details and more - and prevents other users of your device from accessing them.",
    "VIPRE's Privacy Shield does something similar, but both tools have the same issue: they're not great at identifying which documents are safe, and which aren't. SDS highlighted some files apparently just because they contained our and a few other names, for instance, but ignored others containing our bank account details. You can opt to protect files manually, so Sensitive Data Shield is still a feature worth having, but it's not as smart as Avast thinks.",
    "Web Hijack Guard protects browser traffic from DNS hijacking, a nasty exploit where hackers redirect your traffic to malicious websites. We don't have a test to evaluate this, but DNS attacks are a very real danger, and we're glad to see Avast One is working to keep you safe.",
    "Avast's Webcam Protection controls webcam access to reduce the chance of malware accessing your device. By default, this allows trusted apps to access your webcam, and blocks everything else until you give permission. But you can also up the protection level to Strict Mode (you're asked for permission whenever anything tries to access the webcam), and there's even an option to disable your webcam entirely.",
    "It's a simple system, with well-chosen default settings, and worked perfectly for us. Avast One spotted our custom webcam hijacker when it tried to grab an image, asked us if it had permission, and when we said no, prevented it accessing our hardware.",
    "Avast One's paid versions round off their feature set with a trio of PC maintenance tools.",
    "Performance Boost lists apps running in the software and can selectively optimize them. This effectively freezes a process, preventing it using any system resources. Avast restores the process when you open the app again and it should work as normal.",
    "It's a clever idea and can work well. The problem is figuring out where to use it. The point of 'optimizing' an app is you stopping it running any background tasks, but are you really sure it's not doing something important? Syncing files? Checking for updates? Monitoring your system so it can raise notifications? Avast One gave us clues for processes it recognized, but there weren't many, and it listed many processes which should really be left alone (the backup tool Backblaze, for instance.)",
    "Driver Updater scans your system for missing driver updates, and can download and install any patches in a couple of clicks.",
    "It's easy to use, but also risky. Avast One recommended we update multiple Intel chipset drivers, for instance - a single mistake with any of these could break our PC to the point that it wouldn't boot, maybe even in Safe Mode. Unless your PC is seriously unstable, you're better off leaving the drivers alone.",
    "Avast One does better with its final maintenance tool, Disk Cleaner. As you'll guess from the name, this scans your system for surplus and leftover files, potentially freeing up a significant amount of drive space.",
    "Disk Cleaner did a reasonable job on our test system, finding 8.4GB of data we could safely delete. That beat Windows' own Disk Cleanup, which managed only 5GB, but the free CCleaner did a little better with 9GB.",
    "Avast One's maintenance tools aren't bad, and may help speed up your system. They can't match Avira's System Speedup for features or power, though, and you'll need some knowledge and expertise to get the most out of them.",
    "Overall, there are a lot of good antivirus platforms out there, but Avast One is clearly one of the leaders. It's not simply that there are so many useful protection tools in place, but also that these tools are powerful and do exactly what they need to do.",
    "While there are competitors who can beat Avast One in individual areas, what Avast One really succeeds in doing is bundling a strong set of individual tools into a single suite where everything can work well together.",
    "Even better, this is all available in the free version for home use, with paid upgrades available for those who wish to have more extensive protections in place."
  ],
  "headers": {
    "5": "Getting started",
    "12": "Interface",
    "17": "Antivirus",
    "39": "Ransomware Shield",
    "46": "Blocking malicious sites",
    "51": "Network protection",
    "56": "Avast SecureLine VPN",
    "64": "Password Protection",
    "69": "Software Updater",
    "73": "Privacy extras",
    "80": "Performance boost",
    "88": "Summary"
  },
  "links": {
    "Avast One": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7957908327334387000/https://www.avast.com/en-us/avast-one#pc",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ransomware protection": "https://www.techradar.com/best/best-ransomware-protection",
    "firewall": "https://www.techradar.com/best/firewall",
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "disk cleaner": "https://www.techradar.com/best/pc-optimizer",
    "benchmark": "https://www.techradar.com/best/best-benchmarks-software",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "browser": "https://www.techradar.com/best/browser",
    "Windows": "https://www.techradar.com/news/how-to-download-windows-11",
    "hard drives": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "Avira": "https://www.techradar.com/reviews/avira-2020-antivirus-solutions",
    "Kaspersky": "https://www.techradar.com/reviews/kaspersky-2020-antivirus-solutions",
    "Bitdefender": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "Adaware": "https://www.techradar.com/reviews/adaware",
    "Trend Micro": "https://www.techradar.com/reviews/trend-micro-2020-antivirus-solutions",
    "Avast Online Security": "https://chrome.google.com/webstore/detail/avast-online-security/gomekmidlodglbbmalcneegieacbdmki?hl=en",
    "HideMyAss!": "https://www.techradar.com/reviews/hidemyass-vpn",
    "Windscribe": "https://www.techradar.com/reviews/windscribe",
    "Proton VPN": "https://www.techradar.com/reviews/protonvpn",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Have I Been Pwned": "https://haveibeenpwned.com",
    "Dashlane": "https://www.techradar.com/reviews/dashlane-vpn"
  }
}