{
  "source": "https://www.techradar.com/reviews/amd-radeon-rx-6600",
  "title": "AMD Radeon RX 6600 review",
  "category": "computing",
  "updated": "2021-10-13T13:00:36Z",
  "author": "jackie-thomas",
  "summary": "AMD takes on the RTX 3060",
  "verdict": "The AMD Radeon RX 6600 is everything we want in a 1080p graphics card in 2021. It’s a bit pricier than we would like but given that all graphics cards are too expensive right now, there’s not much to do about that. But if you want an alternative to the RTX 3060, this is it.",
  "pros": [
    "Excellent 1080p performance",
    "Low power",
    "Relatively affordable"
  ],
  "cons": [
    "Can’t really break through to 1440p",
    "Third-party cards are expensive"
  ],
  "article": [
    "The AMD Radeon RX 6600 arrives in a weird time for graphics cards. Both AMD and Nvidia have released some of their best products in a decade, but with a global silicon shortage it's almost impossible to get your hands on anything at a reasonable markup – let alone the price that the manufacturer actually intended.",
    "It's left us wanting for a budget-level graphics card that more people can actually afford and get into their systems, especially folks that have older cards like the GTX 1060 – which is still the most popular GPU in the world.",
    "But until AMD actually launches the card, we won’t know how stock levels are going to hold up, and how long it’ll be before more than, like, five people can get the graphics card at its $329 (around £250/AU$450) MSRP.",
    "At that price, the AMD Radeon RX 6600 could be genuinely worth it, though, especially for anyone that’s still playing games at 1080p, and doubly so if you’re going to be playing games that support AMD’s new FidelityFX Super Resolution technology – which is already helping to improve the performance of huge games like Far Cry 6 and Resident Evil Village just months after AMD has introduced it.",
    "We are in 2021 though, when nothing stays in stock long, and as soon as this graphics card crosses the $500 mark – and it probably will – the value will absolutely start to crumble, especially if it comes between the RX 6600 XT and the RTX 3060, as Nvidia’s lowest-end card handily beats this new AMD graphics card in pretty much every test we’ve run.",
    "The AMD Radeon RX 6600 is available from October 13, starting at $329 (around £250/AU$450) – with prices obviously going up from there, depending on which aftermarket GPU manufacturer you go with. And, just like AMD’s last graphics card, the Radeon RX 6600 XT, there won’t be a reference design available to buy, which means you are going to have to get the GPU through third-party manufacturers like MSI, Gigabyte, XFX or others.",
    "The version of the graphics card we’re looking at now is the Gigabyte Radeon RX 6600 Eagle 8G, which will retail for $419 (around £310/AU$570). That’s obviously higher than AMD’s minimum pricing, but that’s unfortunately just where the graphics card market it.",
    "However, this is a pretty basic version of the GPU – more on that later – and there will probably be much more expensive versions of the AMD Radeon RX 6600 XT with fancy features like RGB lighting, improved power delivery, factory overclocks and more. Make sure you check to see that you’re getting the features that are right for your build, especially if you are going to end up paying hundreds of dollars or pounds more for it.",
    "Like any other graphics card in the AMD Radeon RX 6000 series, the RX 6600 is based on the RDNA 2 architecture, and it’s technically a cut-down version of the same GPU found in the Radeon RX 6600 XT. In this version, you’re getting 28 Compute Units, down from 32 in the 6600 XT. That means you get a total amount of 1,792 Stream Processors and 28 Ray Accelerators, too.",
    "You get the same 8GB of GDDR6 VRAM on a 128-bit bus as the 6600 XT, though it’s just a bit slower, with a peak bandwidth of 224GB/s, which is still more than enough for the 1080p resolution this card is aimed at.",
    "So, this is not a graphics card that AMD is pitching as a high-end showstopper, but one that is pitched towards just playing the latest games at 1080p – which makes sense, as it's still the most popular resolution.",
    "Luckily, even at this price point, you’re getting Ray Accelerators. They’re still the first-generation version of AMD’s version of the tech, which means they’re not quite as good as what you’ll find in something like the Nvidia GeForce RTX 3060, but they’ll still get the job done. Again, there are 28 of them here, one per Compute Unit, which will help offload the computationally expensive process of ray tracing. That of course also means that you can enable ray tracing effects in any game, and it’ll work, though, of course, with a performance cost.",
    "Just like other AMD graphics cards in this generation, you’re also getting the unique Infinity Cache, 32MB of it, which helps speed up memory bandwidth without using the more expensive GDDR6X memory, which helps keep the price a bit lower. This is what helps this graphics card reach its 224 GB/s of memory bandwidth.",
    "These days though, picking out a graphics card is about way more than just what hardware is available – software is becoming more and more important every day. In the past, Nvidia had a huge leg up here, but with its recent graphics cards like the AMD Radeon RX 6600 XT, AMD is really catching up.",
    "For instance, we finally have a strong competitor to DLSS here, with FidelityFX Super Resolution. This works a bit differently than Nvidia’s scaling tech, and is a bit less powerful, but it’s also a lot more open. We’ve already started to see a ton of amazing games support it, most recently Far Cry 6, and it should let graphics cards like the RX 6600 XT push higher resolutions in many games.",
    "And because it’s an open technology, we’ll likely start to see more games start to support it in the near future, as even folks with Nvidia graphics cards will be able to turn it on – whereas, with DLSS, only RTX owners can use the admittedly amazing tech. Theoretically, this means more developers will want to use AMD’s tech, because a wider range of its players will be able to use it.",
    "In our experience, FSR, especially when it’s on the Quality or Ultra Quality preset pretty much maintains the same quality level in-game while massively boosting framerate. So, it’s definitely worth enabling when you get the opportunity, and only serves to stretch the Radeon RX 6600’s legs a bit.",
    "The Radeon RX 6600 also supports Resizable BAR, or as AMD calls it “Smart Access Memory”. This gives your CPU direct access to your graphics card’s memory, which will boost performance in most games. This is a setting that you’ll likely have to go into your BIOS to enable, especially if you’re using the graphics card to upgrade an existing system, so proceed with caution.",
    "But it is a relatively painless process, as far as BIOS tweaks go, so we’d recommend at least trying your hand at it. You can usually find the setting in your BIOS under “PCI configuration” or something similar. But, every motherboard is different, so it might take some digging to find it. But most modern boards and processors support it right now, so you might as well take advantage.",
    "Because AMD isn’t launching its own version of the Radeon RX 6600, and is instead supplying the GPU to graphics card manufacturers, we reviewed a Gigabyte version of the card. And, in many ways, this is the ideal graphics card for this segment of the market.",
    "The Gigabyte Radeon RX 6600 Eagle 8G has a very understated design, with a gunmetal shroud. Though, unlike more premium graphics card designs, both the shroud and backplate are plastic. That’s not a huge deal, because it’s not like you’re going to touch it, and the graphics card doesn’t produce enough heat to need the extra cooling, and it looks like metal from the outside.",
    "There’s also no lighting, which of course will be a pro or a con depending on your aesthetic goals. It does look a little silly in our rig, which is absolutely packed with lighting, but it will absolutely look at home in a more subdued system.",
    "For a card in its performance class, there’s a lot of cooling on offer here too. Even though the PCB is only half the length of the card, this is a full-length graphics card, which means the heatsink makes up the majority of this card’s bulk. Coupled with the fact that Gigabyte went ahead and included a triple-fan setup, this is a graphics card that doesn’t get very hot or very loud.",
    "Due to the fact that it has only one 8-pin power connector, located in the middle of the card, it peaks at 100W of power, which is pretty low by today’s standards. And, with the, frankly, overkill cooling, we haven’t seen temperatures break 60 degrees Celsius, which is basically ice-cold for a graphics card. This is excellent news if you don’t want to mess around with fan curves or anything, as you won’t need to worry about this thing ever overheating.",
    "Finally, this graphics card has the standard array of ports you’d expect, with two DisplayPort 1.4 and two HDMI 2.1. Usually, we’d see three DisplayPorts and one HDMI, but given that this card is aimed at folks that may have monitors that don’t even have a DP input, it kind of makes sense.",
    "**Editor’s Note**",
    "The AMD Radeon RX 6600 has launched at a time where we here at TechRadar are in between offices and most of our testing hardware is sitting in a storage unit somewhere in New York City. As such, we performed all of this testing on our home PC, using the testing for our Radeon RX 6600 XT review for comparison. This isn’t ideal, obviously, but because it’s a low-ish-end graphics card, there won’t be a huge difference in performance with the different CPU. The only thing we’re not so sure about is that we tested using Windows 11 instead of Windows 10, but we’ll be doing backup testing as soon as we get our testing lab up and running to make sure the results are reliable. We don’t expect a massive difference, but we will update this review if there are any meaningful differences that arise when we do our re-tests.",
    "**",
    "AMD is pitching the Radeon RX 6600 as a 1080p graphics card, and generally, that’s exactly what it is. In most of our tests, the graphics card is perfectly capable of handling smooth 60 fps gameplay, even in incredibly complex games like Horizon Zero Dawn and Metro Exodus.",
    "The Radeon RX 6600 does struggle a little bit in Metro Exodus Enhanced Edition, where Ray Tracing is just, like, always on, but that’s to be expected. But even then, we still get 45 fps, which while it’s quite a bit below the 60 fps sweet spot is still more than playable, and should provide a reasonably good experience, especially if you’re on a FreeSync-compatible gaming monitor.",
    "And while this graphics card is just a cut-down version of the RX 6600 XT, it’s a pretty substantial step down. Generally, you can expect about 15% less performance out of the RX 6600 when compared to its XT sibling. But that’s perfect scaling, considering that – at least when it comes to the list price – the RX 6600 XT is exactly 15% more expensive than the RX 6600.",
    "When you look at the RTX 3060, though, things look better for AMD. The AMD Radeon RX 6600 and the Nvidia GeForce RTX 3060 are pretty much on even playing ground. Both graphics cards have games where they excel – like Metro Exodus and Horizon Zero Dawn for the Nvidia card and Dirt 5 for the RX 6600. And given that both of these cards are supposed to be the same price, that’s ideal, and it comes down to which games you’ll want to play.",
    "We still can’t help but wonder where the pricing for this graphics card would have landed if it came out during a time where GPUs weren’t so hard to find. It is an extremely solid 1080p graphics card, which we needed, but at $329 in 2021, we would have hoped that it’d be able to break further into the 1440p world – but that’s just the world we live in these days."
  ],
  "headers": {
    "5": "Price and availability",
    "8": "Chipset and features",
    "19": "Design",
    "25": "Performance",
    "33": "Don’t buy it if…"
  },
  "links": {
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "GTX 1060": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/nvidia-geforce-gtx-1060-1325075/review",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "RX 6600 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6600-xt",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RDNA 2": "https://www.techradar.com/news/amd-big-navi",
    "Radeon RX 6600 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6600-xt",
    "FidelityFX Super Resolution": "https://www.techradar.com/news/we-were-a-bit-too-ambitious-how-amd-is-upping-the-game-with-fidelityfx-super-resolution",
    "Nvidia graphics cards": "https://www.techradar.com/news/nvidia-geforce",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro"
  }
}