{
  "source": "https://www.techradar.com/reviews/anda-seat-kaiser-2",
  "title": "Anda Seat Kaiser 2 review",
  "category": "gaming",
  "updated": "2021-05-12T10:39:47Z",
  "author": "jess-weatherbed",
  "summary": "Professional but pricey",
  "verdict": "The Anda Seat Kaiser 2 is a professional-looking product that would suit a hybrid work/gaming environment well, but the overall build quality is less impressive than other chairs in the Anda Seat range.",
  "pros": [
    "Easy to build",
    "4-D armrests",
    "Supportive ergonomic shape"
  ],
  "cons": [
    "Not built for tall folk",
    "Unsatisfying finishing quality",
    "Material scuffs easily"
  ],
  "article": [
    "The Anda Seat Kaiser 2 is a new addition to the family of Anda Seat high-quality gaming chairs, coming in either an all-black or stylish maroon design. The material on the seat itself is a thick artificial leather that emulates the textured feel of the real deal, described by Anda Seat as a 'premium PVC leather'. The chair frame is supported by molded high-density foam that supposedly aids with ergonomic support, but the thickness of the PVC leather fabric actually makes the Kaiser 2 a little firmer than other products from Anda Seat, despite (we assume) using the same filling material. Given this is a racing-style chair, the previous experience Anda Seat has designing BMW and Mercedes-Benz seats is very apparent in the design. You can get the Anda Seat Kaiser 2 via the Anda Seat website or Amazon for $499.99 / £349.99 / AU$599.99, which places it around mid-market for luxury gaming furniture. Previous models we've reviewed such as the T-Pro 2 and the Spider-Man Edition persuaded us that Anda Seat is capable of making a well-constructed chair worth the asking price, but the Kaiser 2 has sadly lowered our previous expectations a little.",
    "The material itself scuffs more easily than we would have liked in a chair, with small, white tear marks appearing on the seat base after several days of use, despite our reviewer not wearing a belt or anything otherwise metallic. We were unable to replicate this by scratching at the surface however, so this doesn't mean the thick leatherette fabric is by any means delicate.",
    "The website also states that the Kaiser 2 is suitable for anyone up to 210cm tall (or 6 feet 10 inches), but this model is noticeably smaller than other Anda Seat chairs we have reviewed that make the same claims, such as the previously mentioned T-Pro 2. Our reviewer is 168cm (or 5 feet 6 inches) and found that the optional headrest sat too low on the backrest of the chair, making this an unsuitable choice for anyone over mid-height.",
    "For women or teenagers though, this is still a suitable choice of gaming chair if you want something minimalistic that can be easily cleaned, given the PVC seat covering can be wiped down. Other, larger chairs in the Anda Seat range are also often too large for anyone mid-sized or smaller which might make this one of the few products in the lineup that would better fit.",
    "The Kaiser 2 works well as both a traditional office chair and a gaming chair, with the design heavily inspired by typical bucket-shaped 'racing' car seats. Given Anda Seat's legacy this is to be expected of course, and one section of the listing even describes it as having 'BMW leather'. As we mentioned earlier, this is noticeably smaller than other products we've reviewed from Anda Seat, despite being labeled as an 'Extra-large' size. This means that if you're above average height for a man you may find the fit to be a little on the snug side. The same also applies for user weight, though issues may be more down to body shape than hitting the maximum weight capacity of 180kg (396Lbs).",
    "The texture built into the leatherette fabric coating the chair simulates real leather accurately and wipes down with ease in the case of any spillage. We splashed some water onto the seat pad of the Kaiser 2 and nothing soaked into the base of the chair. There were also a lot of uncut or loose stitches on our review sample that let down the quality of the overall product. It was an easy fix to snip the loose threads, but it wasn't an issue we noticed on other models in the Anda Seat range. The PVC leather is also considerably thick, but that didn't prevent small 'pockmarks' from appearing in the base of the seat. We're not expecting this to be immune from any damage of course, but be cautious to remove any belts or metal accessories before using the product.",
    "The overall build quality is fantastic though, with a solid aluminum base and steel frame under the foam chassis to support the user. Assembly was straightforward and took less than 30 minutes to unbox and put together.",
    "The padding within the seat is made from a single large piece of shaped high-density foam and is noticeably firmer than other Anda Seat models. We assume this is due to the thickness of the PVC leather fabric coating the chair, and how that affects your comfort will be down to personal taste. We preferred a softer seat, and the Kaiser 2 provided less ergonomic support than other gaming furniture products on the market. The armrests are 4D, meaning that you can customize their height, position, and rotation, and you can also recline the Kaiser 2 between 90°-160° safely with the knowledge that your weight will be supported. This will allow the user to fully lay down in the chair should you need to, great for napping or relaxing. The handles to control the recline and seat position are easily located on the front underside of the chair so you can reach them while seated, and the motion of controls and adjustments gave us no issues during testing. The construction feels very robust despite the disappointing finish.",
    "The holes located on the backrest intended for the optional headrest pillow are located too low and result in someone of even a shorter stature than the recommended 'extra-large' having issues using it. We wouldn't advise using the headrest pillow or the lumbar support pillow provided by Anda Seat at all actually, as they greatly reduced the overall comfort of the chair due to how firm and bulky they are. This is still a very well constructed piece of furniture despite everything and would make a great addition to a teenagers setup (or anyone between 5 foot 2 inches - 5 foot 9 inches by our estimates), so the Anda Seat Kaiser 2 is still worth a purchase if you need something you can wipe clean and won't fall apart in a matter of months."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Design",
    "7": "Comfort",
    "9": "Don't buy it if..."
  },
  "links": {
    "high-quality gaming chairs": "https://www.techradar.com/news/best-pc-gaming-chair-5-best-chairs-to-game-in-comfort",
    "T-Pro 2": "https://www.techradar.com/reviews/anda-seat-t-pro-2",
    "Spider-Man Edition": "https://www.techradar.com/reviews/anda-seat-spider-man-edition"
  }
}