{
  "source": "https://www.techradar.com/reviews/avaya-j-series",
  "title": "Avaya J Series review",
  "category": "computing",
  "updated": "2021-07-30T13:09:07.746Z",
  "author": "barclay-ballard",
  "summary": "A look at the six VoIP handsets in the Avaya J Series range",
  "verdict": "Great for businesses that can't spare too much desk space",
  "pros": [
    "Straightforward setup",
    "Compact form factor"
  ],
  "cons": [
    "Even at the high-end, it lacks that 'wow factor'",
    "Inconsistent support"
  ],
  "article": [
    "Founded in 2000, Avaya provides businesses with a variety of different products and services in the communications space. As well as managed services, unified communications solutions and contact center tools, the company has become well respected for its VoIP handsets.",
    "Among a number of different devices, Avaya sells wireless handsets, conference phones, hospitality phones, headsets, and room systems. The company’s IP phone range is known as the J Series, or the J100 Series, and is known for its slim form factor, an impressive range of features, and affordable price points. The Avaya J Series may not be as flashy as some other VoIP handsets - particularly when examining the more affordable devices in the range - but the sheer variety is bound to appeal.",
    "The J Series covers entry-level handsets right the way up to higher-end devices, with each one priced appropriately. Businesses will need to carefully examine exactly what kind of features they need before committing but, in any case, the Avaya J Series has several highly-rated devices to choose from.",
    "The Avaya J129 is the entry-level offering within the J Series but still boasts a clean, compact design that is bound to appeal to businesses that may not have that much desk space to spare. The J129 represents a good choice for lobbies, hotels, meeting rooms, or any environment that involves public or walk-up scenarios. It supports SIP telephony capabilities and can be used with Avaya Aura, Avaya IP Office, and other approved third-party call control platforms.",
    "The J129 is well-positioned to meet the needs of small to medium-sized organizations, promising a cost-effective device with good audio performance and a number of productivity-enhancing features. The black-and-white screen and the lack of programmable buttons may disappoint some users, but it is worth keeping in mind that these features are usually packaged with more expensive devices.",
    "Businesses should also be aware that this device is a one-line phone that is only capable of supporting two concurrent calls, so firms with more intensive VoIP needs may have to look elsewhere. Still, the inclusion of three context-sensitive soft keys and display prompts should provide most businesses with the kind of productivity benefits that they need. Users will find it easy to reach the most commonly employed features, including call forwarding, ad-hoc conference calls, call history, and voicemail access.",
    "Users of the J129 can enable Wi-Fi support if they purchase the J100 Wireless Module but it is not currently possible to use a wired connection and the Wi-Fi at the same time. So, all in all, the J129 is unlikely to amaze any customers - but that’s probably not its aim. Instead, Avaya has created an affordable, entry-level phone that gets the basics right.",
    "Moving on to the J139, customers are likely to notice a few impressive additions included with this model. The monochrome display of the J129 has been replaced with a 2.8-inch color screen and as a four-line IP phone, businesses have a little more flexibility in terms of handling a higher call load.",
    "Other noteworthy features of the J139 include high-definition audio, including wideband audio codec, the inclusion of softkeys for everyday functions, and quick access to a recent call log with space for up to 100 entries. Visual cues are also designed to speed up task management through four dual-color red/green LED buttons.",
    "The J139 also has built-in volume boost functionality to support those with hearing impairments, allowing them to use the handset comfortably without the need for a separate amplified headset. In terms of its environmental credentials, the fact that the J139 supports redacted energy consumption is also likely to be admired by many customers. The handset’s Power-over-Ethernet Class 1 design, with built-in ‘sleep mode’ means that the device boasts good energy efficiency credentials.",
    "Again, the J139 is not much to look at and more advanced features are missing, but if businesses want a device that includes all the core VoIP features, and comes with a color screen, the J139 represents a good choice.",
    "Continuing to move up the pay scale of J100 phones, the J159 boasts two screens to ensure that users have access to all the information they need. By leveraging existing investments and accommodating changing business needs, the J159 promises to deliver a flexible architecture that optimizes communications.",
    "This device comes with four softkeys, high definition audio quality, integrated Gigabit Ethernet interface, headset support, and optional Wi-Fi support. This multiline phone also comes with 10 status indicators and supports a secondary Gigabit Ethernet port for PC connections. An impressive 48 administrative buttons should also ensure that users have plenty to keep them busy when they first set up their phone - even if it’s just working out what everything does.",
    "Calendar integration and additional personalization options represent other reasons why businesses may want to purchase the J159 over more affordable models within the J Series range.",
    "Initially, the J169 may seem like a backward step within the J Series range due to its grayscale display but the handset does come with four softkeys, eight buttons with dual LEDs, wideband audio for headset and handset, as well as full duplex speakerphone capabilities. The J169 also supports up to three Avaya J100 expansion modules and accommodates advanced unified communications solutions through Session Initiation Protocol (SIP).",
    "The J169 would make a great handset for salespeople, call center staff and knowledge workers, who would all benefit from the range of features on offer here. Users will gain access to eight buttons with dual LEDs (red, green) and four softkeys, as well as hard buttons for phone, messages, contacts, history, home, navigation cluster, headset, speaker, volume and mute. Additional LEDs for speaker, mute, headset, message and history are also included, as are a further 24 administrative buttons.",
    "Another noteworthy addition to this model is the option of rich, classic, alternate and downloadable ringtones. Although a customizable ringtone may not seem like the most important feature for a business phone to have, the ability to instantly recognize your particular handset in a crowded office could prevent missed calls.",
    "If businesses can handle going back to a non-color screen, then the J169 is worth considering. The handset also supports a wide range of languages, including Arabic, Simplified Chinese, German, Japanese, and a number of others. For businesses that serve multiple markets, this feature may be hugely important.",
    "The Avaya J179 promises a premium desk phone experience, boasting a color display, four softkeys, high definition audio quality, and an integrated Gigabit Ethernet interface. The J179 IP phone also offers headset support and can be used with up to three 24-button Expansion Modules.",
    "As an eight-line phone ideally suited for power users, the J179 comes with all the advanced telephony features you would expect and also promises zero-touch deployment via Device Enrollment Services Support. The latter, in particular, is sure to appeal to businesses that may have experienced implementation challenges previously.",
    "Amazing high-definition audio is one of the standout features of the J179 handset. The wideband audio codec will help members of staff to have more productive conversations with their customers, while Bluetooth connectivity means that they can remain engaged with their clients even when not sat at their desk.",
    "Unusually for many VoIP phones, the J179 comes in a variety of different colors so users don’t have to make do with the same old black or grey desk phone. It’s a minor feature, but it represents a nice touch by adding some personalization.",
    "Representing the top-of-the-line model within the J Series, the J189 is designed to support your power users. It comes with two color display screens, four softkeys, 16 feature keys, and the same high definition audio quality that had become the standard expectation among Avaya VoIP phones. Exploring the two displays in more detail, the larger, higher-resolution five-inch display can be used in split-screen mode to provide even more flexibility for end-users.",
    "Impressively, the J189 offers the option of accessing 96 virtual buttons, so users certainly have a lot of customization options at their disposal. The handset also comes with two USB ports (one USB A and one USB C) and can be augmented by up to two hardware J100 Expansion Modules. Compatibility with Avaya software is also included as standard - such as Avaya Aura and Avaya IP Office.",
    "The Avaya J100 Expansion Module is typically used in settings where call coverage is of the utmost importance and even a single missed call can have significant consequences. The J100 comes with a 4.3-inch, 272 x 480-pixel color display and provides access to as many as 24 buttons for access to additional contacts and functionality. The expansion module can be connected to either the Avaya J169 or J179 IP Phone, with the module inheriting the display properties of the device that it is connected to. Avaya users can connect a maximum of three J100 modules and, as with the corresponding phones, they can be placed in two stand positions as well as a wall-mount position.",
    "Thankfully, call operation features are straightforward when using the expansion module. If users want to make an outgoing call, for example, they simply lift the handset, press the line button that corresponds to the extension number that they want to call, and then put on their best telephone voice. Alternatively, if individuals would rather make a call without lifting the handset, they can press the relevant line button to make a call using the speakerphone. The expansion module also allows for quick access to applications like Contacts, Recents, and Calendar simply by pressing the corresponding button.",
    "For anyone that is unhappy that most VoIP solutions are delivered with a standard look, you’ll be pleased to hear that the J100 Expansion Module allows for the customization of its display. In the settings menu, users can change the background image, the screen saver, the font size, and adjust screen brightness. Although this flexibility may not sound like much, it does let Avaya users have a little more control over their communication hardware.",
    "With all the Avaya phones we’ve reviewed today, they seem to be lacking a killer app - a standout feature that makes it easy for them to differentiate themselves in an increasingly competitive VoIP market. When that is added to reports of inconsistent helpdesk support, the J Series loses some marks against its competitors. That being said, the compact form factor on offer and the reasonable price point means that the handsets are still certainly worth considering."
  ],
  "headers": {
    "27": "Our overall verdict"
  },
  "links": {
    "unified communications": "https://www.techradar.com/best/best-ucaas",
    "contact center": "https://www.techradar.com/best/best-ccaas"
  }
}