{
  "source": "https://www.techradar.com/reviews/stablehost",
  "title": "StableHost review",
  "category": "computing",
  "updated": "2021-01-14T06:01:55Z",
  "author": "mike-williams",
  "summary": "Fairly priced hosting with data centers in the US, Europe and Asia",
  "verdict": "StableHost is a web host provider based in the US, yet international in scope. They might not be able to compete with top-rated giants of web hosting, but with well thought-out plans, transparent pricing policy and user-friendly approach they are definitely worth a look.",
  "pros": [
    "45-day money-back guarantee",
    "Free Let’s Encrypt SSL certificate",
    "24/7 customer support",
    "Fairly cheap dedicated server hosting",
    "One-click installer",
    "Unlimited email accounts"
  ],
  "cons": [
    "Live chat support could be improved",
    "The blog hasn’t been updated in a while"
  ],
  "article": [
    "Based in Arizona (USA), StableHost was established in 2009 by a rather small but passionate team that has since grown to some 15 people today. Privately-owned and with more than a decade of experience, StableHost has specialized in providing powerful, reliable and secure web hosting solutions in all shapes and sizes. They can help you create a personal blog or start a small business all the while supporting much larger enterprise-level businesses. StableHost’s products run from domain registration and basic shared hosting to dedicated servers, VPS and reseller hosting. At the moment, they have multiple data centers in the US, Europe and Asia.",
    "Back in 2018, they became a part of Miss Group, one of the fastest growing hosting companies on the market and a driving force behind many providers and hosting-related brands, such as Miss Hosting, 4 UK Host, Professional Hosting and Funio, among others.",
    "StableHost’s main website design is quite simple (but not simplistic), user-friendly and predominantly colored green, which makes it easy on the eyes. Apart from English language, users are able to select German, Spanish, Swedish and Vietnamese, and as far as we could see the translation is done fully and in a professional way. The only thing that does not meet this criteria is customer feedback at the bottom of the page, but to be fair, pointing out this as a flaw is basically nit-picking.",
    "The official blog stylistically resembles the rest of StableHost’s website and it seems that its only use over the past few years amounted to advertising the company’s products and offering occasional holiday discounts beyond a few updates about the company itself. It appears the blog has been gathering dust since April 2018, so we hoped to find better results in other aspects of their website.",
    "All of the available hosting options are reasonably priced meaning they are affordable enough without the need to compromise on quality. This is particularly true for the shared hosting Starter plan, with which one can get 50% off the price during the first year of usage. This plan starts at $1.75 and will get you both unlimited disk space and bandwidth, and a website builder. The renewal for this hosting plan will cost you $5.95 for a single month, $4.50 per month if you opt for a year, $4.00 per month for two years and $3.50 per month if you settle upon a triennial plan.",
    "If this doesn’t suit your needs there are more ambitious plans as well as other hosting options. Reseller hosting starts at $9.12 per month and it will get you 20GB of disk space and an ability to host up to 10 clients. VPS begins at $9.12 and is recommended as a step forward from shared hosting. Dedicated server hosting costs from $145 to $245 per month if you want all of its full-blown features and don’t care about the cost.",
    "StableHost offers a money-back guarantee that is valid for 45 days after purchase, which is longer than we usually expect. However, this goes for no more than 7 days for dedicated VPS.",
    "You can pay for StableHost’s products with credit cards or PayPal.",
    "Creating a new account and purchasing a plan with StableHost consists of four rather straightforward stages. The first thing to do after choosing a plan is to create a new domain (some names are free for the first year) or transfer an old one. If you want, you can add AlphaSSL for a few extra bucks. The second thing you might notice is that there are more than a few data centers to choose from: Chicago and Phoenix (USA), Frankfurt (Germany), Stockholm (Sweden), Amsterdam (the Netherlands), Valencia (Spain) and two servers in Singapore (Singapore).",
    "ID Protection is listed as an additional free-of-charge service, which you’ll enjoy, they promise, for a lifetime. Additionally, SSH (Secure Shell) access can be yours for additional $2.50 (for life). It should be pointed out that it will come pre-selected, so if you don’t want it, make sure you deselect it before proceeding.",
    "After this, you can select a payment method and continue with providing StableHost with the expected personal information (name, e-mail address, phone number and so forth). The only thing that sticks out is a possibility to choose a preferred currency: USD (US Dollar), EUR (Euro) or KR (Swedish Crown), which is a nice touch.",
    "After making a payment, you’ll enter the fourth (and last) stage of the process, after which your newly-created website should appear (at least in 10 to 20 minutes).",
    "All of StableHost’s plans go with the popular Linux-based cPanel, so you’ll be able to manage all aspects of your website at ease, even if you don't have much prior experience with this control panel. Softaculous comes pre-integrated, so many useful applications such as WordPress, PrestaShop and Joomla are just mouse-click away. And if you prefer, you can use a user-friendly Site.Pro website builder with a drag-and-drop interface that will provide you with tons of themes and templates and an ability to change and customize the design as much as you please.",
    "Speed test provided by GTmetrix and performed on StableHost’s main website presented us with pretty average results. The time it took to completely load the page was 6.7 seconds, which actually looks a bit better when compared to the average result of 8.1. What's more, it required 75 requests, which surpasses the average of 87. However, the conclusive performance score was C (74%), which is exactly the average result.",
    "Considering that StableHost promises 99.9% uptime, we had no choice but to put it to the test. After monitoring StableHost’s main website for more than a month, all with the help of UptimeRobot, we got a stable result. Not a second of downtime was recorded and although there were a few major oscillations in response time, this is unlikely to escalate into a problem.",
    "As far as we can tell, StableHost’s knowledgebase has a decent amount of articles on various topics from technical support to politics. Since technical support is mostly related to the topics of our interest, we inspected further and found an additional division into subcategories covering a broad range of essential topics and potential issues. Most of these articles go directly to the point and offer step-by-step solutions. Some of them offer links to video tutorials as well.",
    "Speaking of these, we should mention that there should be a self-help option on StableHost’s website titled “Video Tutorials”. However, choosing that option will get you nowhere since the link appears to be dead.",
    "When customer service is concerned, StableHost offers all of the expected contact channels: e-mail, ticket, live chat and telephone. The e-mail based support is available around-the-clock for all the users, while the 24/7/365 telephone is reserved for those with high-end plans.",
    "After reading a couple of customer reviews and then trying our own luck with the live chat support, we’ve got an insight into the disreputable reputation it has gained in the recent years. The agent we’ve got in touch was kind in every way, but we didn’t get a straight answer to our question. Instead, we were presented with a link to their article, which we could probably find ourselves. When all is said and done, the live chat support isn’t bad in itself, but it didn’t help us save time.",
    "StableHost is a smaller company than Hostgator, and yet it manages to offer a whole range of hosting choices, customizations and features. Both present a great value for money, offer good performance and a decent (although far from perfect) customer service and feature a generous 45-day money-back guarantee. However, if you are trying to save a buck, Hostgator might be a better option.",
    "Krystal Hosting is a fellow independent host, yet from the UK. Much like StableHost, they offer a free website builder with all of their plans and Let’s Encrypt SSL certificate, but they go a step further with the refund policy. While StableHost’s money-back guarantee is valid for 45 days, Krystal Hosting allows its customers to change their minds for up to 60 days after the purchase.",
    "Bluehost is the master of ease of use and is a difficult web host to compete with. In all fairness, StableHost does give beginners everything they need for a good start. Still, what Bluehost adds to the mix is its enhanced cPanel with an extremely newbie-friendly interface and this should make a buyer’s choice a bit easier.",
    "Just like StableHost, HostRocket is a US-based host offering a variety of hosting-related services, good performance and industry standard cPanel with access to many popular apps. Despite this, its above-average prices and ridiculously expensive “additional” setup fees might take you by surprise, and not in a pleasant way.",
    "StableHost is more than a capable web hosting provider in its own right but it’s hardly a match for bigger hosting companies like Bluehost, Hostgator or Hostinger, which can offer similar plans at more attractive prices. However, if you want to support an independent, honest and quite likeable host with a decent variety of products, enough data centers to choose from and guaranteed stability, give StableHost a chance."
  ],
  "headers": {
    "4": "Plans and pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "StableHost": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8947511600377473000&xs=1&url=https%3A%2F%2Fwww.stablehost.com%2Fweb-hosting.php&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fstablehost",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "Starter plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7929718161197439000&xs=1&url=https%3A%2F%2Fwww.stablehost.com%2Fweb-hosting.php&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fstablehost",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Krystal Hosting": "https://www.techradar.com/reviews/krystal-hosting",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostRocket": "https://www.techradar.com/reviews/hostrocket"
  }
}