{
  "source": "https://www.techradar.com/reviews/anker-charging-dock-for-oculus-quest-2",
  "title": "Anker Charging Dock for Oculus Quest 2 review",
  "category": "vr",
  "updated": "2021-10-04T16:26:39Z",
  "author": "gerald-lynch",
  "summary": "An ingenious solution for the hardcore VR gamer",
  "verdict": "With some smart charging tech and an aesthetic that’s a perfect match for the official Oculus Quest 2 color scheme, the Anker Charging Dock for Oculus Quest 2 is an essential purchase for the most avid virtual reality fans.",
  "pros": [
    "Elegant charging solution",
    "Matches the Oculus Quest 2 perfectly",
    "Adds no extra weight to controllers or headset"
  ],
  "cons": [
    "Doesn’t work well with other accessories",
    "Not great with Oculus Quest 2 Elite Strap with Battery"
  ],
  "article": [
    "There’s no better VR headset out there at the moment than the Oculus Quest 2, thanks to its wireless and wired flexibility, catalogue of virtual reality games and experiences, solid specs and attractive price.",
    "But with two wireless controllers and the headset itself each needing to be topped up with power, keeping the headset ready to go at a moment’s notice can take some management. The Anker Charging Dock for Oculus Quest 2 takes the hassle out of picking up and playing the Oculus VR headset at all times, thanks to its smart charging system and carefully managed power supply. You’ll never have to worry about batteries or charging cables for the headset ever again, and comes highly recommended as a result.",
    "Though it was initially in short supply, the Anker Charging Dock for Oculus Quest 2 can now be picked up easily from most Oculus Quest 2 stockists, including direct from Anker in the US. It’s priced at $98.99 / £98.99.",
    "When it comes to rivals, the Anker Charging Dock for Oculus Quest 2 is out there on its own. Sure, you can buy rechargeable batteries for the controllers, or a battery pack for the headset, but there’s no one-stop solution like this to be found elsewhere.",
    "We would also recommend, however, the Oculus Quest 2 Elite Strap with Battery, an official Facebook accessory. Its strap includes an extra-capacious battery, and its construction better balances the weight of the VR headset. As we’ll explain shortly though, it’s not a great match for this dock due to the way that particular battery strap charges.",
    "It’s hard to find fault with the Anker Charging Dock for Oculus Quest 2, so efficient and elegant is its approach to keeping all your Oculus Quest 2 gear charged and stored safely. It takes a small amount of setting up, but once it’s all put together, you never have to worry about how to keep your devices powered up ever again.",
    "There are a few components to the Anker Charging Dock for Oculus Quest 2. Let’s start with the controllers. The set comes with a special set of rechargeable AA batteries that sit inside your Oculus Touch controllers, as well as a pair of battery covers for the controllers that include wireless charging points. You line connecting points on the batteries up with where the cover slides on, and that part of the puzzle is good to go.",
    "Onto the headset, and Anker supplies you with a tiny USB-C dongle, barely bigger than the connector’s head itself, that plugs into the Oculus Quest 2’s charging port. It has a magnetic component on its outer edge. Plug that into the headset, and that’s sorted, too.",
    "It’s then just a matter of placing the controllers and headset into the cylindrical charging dock itself, which is powered by a USB-C cable connection at the mains. Each controller has a clearly-marked cutaway to slot the Touch wands into, with connector pins to line up the battery cover’s charging points with. As for the headset, that magnetic puck hooks up to a little magnetic charging fob in the dock which snaps into place as the headset is placed down, and slides away as you lift the headset up for use. Each component sits snugly in the dock, and the contact pins are easy to line up with minimal fuss.",
    "Charging times for the headset are a bit slower than what you’d get with the Quest 2’s packed in charger and cable, powering from empty to fully charged in about 180 minutes. Also, the capacity of the controller batteries seems a little smaller than you’d get with regular AA batteries, losing their charge ever so slightly faster. In practice however, you hardly notice this, as it’s so easy to just drop off each element into the dock for a quick top-up when not in use – LEDs on the base turn from amber to green when each component is fully charged, flashing amber if for any reason the connector's haven't lined up properly.",
    "If there’s one small area where the dock falls short, it's for those who use a selection of different cover, grip and strap accessories for the Oculus Quest 2. Anything that may cover the charging ports will render the dock’s powering methods useless, and having to pull the controllers and headsets out of any protective covers to power them up will quickly become troublesome. That’s not Anker’s problem though – it works marvellously alongside Oculus’s own headset design without the interference of third-party add-ons. You can see why it’s an official partner for the VR headset.",
    "However, what’s slightly more frustrating is that the dock doesn’t support charging for another official accessory – Oculus’s own Oculus Quest 2 Elite Strap with battery. The strap, which we also love, is much more comfortable than the provided fabric strap that comes with the headset by default, adding not only extra battery power inside a rear casing area, but a more rigid support that balances the Oculus Quest 2’s weight very effectively. As the strap’s additional battery has to plug into the Quest 2’s main power port, there’s no way to integrate both the Elite Strap battery and the Anker Charging Dock’s magnetic powering method at the same time. While we’ve not got the engineering nous to figure out how to make the two better bedfellows, it’s a shame that Facebook and Anker didn’t communicate options on how to better fix this issue for the power VR gamer."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Two minute review",
    "12": "Don't buy it if..."
  },
  "links": {
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}