{
  "source": "https://www.techradar.com/reviews/nespresso-vertuo-next",
  "title": "Nespresso Vertuo Next review",
  "category": "appliances",
  "updated": "2021-06-24T15:43:36Z",
  "author": "sophie-bird",
  "summary": "The simplest coffee maker we’ve ever used",
  "verdict": "The Nespresso Vertuo Next creates consistently smooth espressos and americanos, and it genuinely couldn’t be easier to use – we just wish Nespresso would build the milk frother into the machine so you can make lattes at the touch of a button too.",
  "pros": [
    "Incredibly easy to use",
    "Good crema on the coffee",
    "Virtually mess-free"
  ],
  "cons": [
    "Pods are expensive",
    "You have to buy a separate milk frother",
    "Recycling the pods could be easier"
  ],
  "article": [
    "The Nespresso Vertuo Next is a stylish-looking machine that creates smooth coffee with a brilliant crema every time. Worthy of a place among the best coffee makers, the Vertuo Next is the easiest-to-use coffee machine we’ve ever tried – all you really have to do is place a pod inside, and press a button.",
    "You can choose between five different cup sizes, and the clean-up takes seconds as this machine is pretty much mess-free. On its own, however, Vertuo Next felt a little limiting to us, because you can only make espressos or Americanos; if you want to make lattes or cappuccinos, you’ll need to splash out on a separate milk frother.",
    "The Vertuo Next heats up quickly though, and consistently delivers barista-style coffee, but you do have to buy official Vertuo pods and recycling the pods isn’t as easy as simply placing them in your household recycling. For ultimate coffee-making convenience, however, you’ll struggle to beat the Vertuo Next.",
    "The Nespresso Vertuo Next is widely available, and is part of Nespresso’s Vertuo line, which uses different pods from its Original line. It’s not the most expensive coffee machine on the market, but it isn’t able to froth milk so you’ll need to factor in the cost of a separate milk frother, if that’s important to you.",
    "The Nespresso Vertuo Next looks expensive with its sleek and slim design, raised logo on the front of the machine, and curved lines. While it doesn’t have the smallest footprint, due to the water reservoir’s position at the back, it’s a stylish addition to your countertop, and is available in a range of colors to match your decor.",
    "When our review machine arrived, it was boxed in 100% recyclable packing - a refreshing change from the mass of plastic bags and foam many other appliances are packaged in. The eco theme doesn’t stop there either, as this Nespresso machine is made from 54% recycled plastic, and the brand says that all of its pods can now be recycled too.",
    "The Vertuo Next measures 5.6 x 16.9 x 12.4 inches / 14.2 x 42.9 x 31.4 cm which makes it nice and slim (although it is, as mentioned, a little long in terms of depth) and easy to store on your kitchen countertops, even if you’re short on space. As long as you have an electric socket, you can keep the Nespresso Vertuo Next pretty much anywhere, as it’s virtually mess-free when you use it, and the water reservoir is removable so you don’t need to keep it close to the sink.",
    "This coffee maker reads the barcode on each coffee pod you place inside so that it can brew the coffee correctly. This also means that you have to use patented Nespresso capsules in the Vertuo Next – the machine isn’t compatible with generic pods. After you’ve placed a capsule inside the Vertuo Next, the machine uses what Nespresso calls ‘centrifusion force’ to spin it at high speeds so that the coffee it produces is smooth and has a good crema on top.",
    "Nespresso’s Vertuo machines, including the Vertuo Next and the Nespresso Vertuo Plus, give you more choice in terms of cup sizes than the brand’s Original line, and you’re able to choose from five different cup sizes, ranging from an espresso up to a 41ml drink. The cup stand on this machine is adjustable so that you can use cups and mugs of different heights.",
    "Making a coffee literally couldn’t be easier: all you have to do is choose a capsule, place it inside the machine, and press the one button that sits on top of the machine. The Nespresso machine then reads the capsule and brews your coffee.",
    "Unboxing and setting up the Nespresso Vertuo Next takes a matter of minutes and is very easy. We tested this machine for a few weeks using a variety of capsules to get a good feel for how well this model operates, and the number of different drinks you can make with it.",
    "First up, if you’re fairly new to Nespresso, it’s worth knowing that the Vertuo Nespresso machines don’t froth milk, so if you want to enjoy drinks like lattes or cappuccinos, you’ll need to buy a separate milk frother – Nespresso will sell you one for $98 / £50 / AU$99, but cheaper models are readily available.",
    "For our first test of the Vertuo Next we made an espresso, using a capsule specifically designed for espressos. Lifting the lid on the machine and placing a capsule inside was easy, and once we’d closed the machine by putting the lid back down and clicking it into place, the Nespresso was ready to go. There’s just one button on the Vertuo Next, so starting the brewing process couldn’t be easier. The espresso the machine produced had a thick, golden brown crema on top. We added sugar to the espresso and gave the drink a stir to see how the crema held up, and found that it reformed almost instantly.",
    "This Nespresso machine can make five different drink sizes, so we wanted to test each of them for accuracy and taste. We next used a Melozio coffee pod, which is medium-strength and makes 7.75 fl oz / 320ml of coffee. The brewing process took 100 seconds from when we pressed to button to when the coffee was ready to drink, and the quantity produced was exactly as the pod promised.",
    "We were pleased to find that there wasn’t any splashing when the machine was working, and it reached 68 decibels on our meter -around the equivalent of ambient office noise. The coffee that the machine produced again had a good crema, and as with the espresso test, the crema on this larger coffee reformed even after we stirred in sugar and added a splash of milk.",
    "When it comes to taste, we think coffee can be a little like perfume - what’s great for one person might be awful for another. However, we tested the Nespresso Vertuo Next for how smooth the coffee tasted, and whether it tasted burnt at all. Every coffee we made was consistently smooth, and while we did find some of the capsules tasted quite bitter, that will likely come down to personal preference.",
    "The Vertuo Next has a removable drip tray that’s easy to clean, and the used pods collect in the capsule holder, which slides out of the machine with ease. We did find that pouring out the used capsules into the recycling bag was sometimes a bit messy, as the pods tend to have dregs of coffee left inside them.",
    "It’s no secret that coffee pods aren’t the most eco-friendly products on the market, but Nespresso stands by its aluminum pod design because it says it’s the best for keeping the coffee fresh. When you buy a Nespresso machine a recycling bag is included, and once it’s full you can either take your used pods to your nearest Nespresso Boutique, take them to a collection point, or ask the delivery driver to collect your bag when they deliver your next order of pods.",
    "First tested: June 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Nespresso Vertuo Next price and availability",
    "4": "Design",
    "10": "Performance",
    "18": "Don’t buy it if…"
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines",
    "Nespresso Vertuo Plus": "https://www.techradar.com/reviews/nespresso-vertuo-plus-review"
  }
}