{
  "source": "https://www.techradar.com/reviews/apple-imac-27-inch-2020",
  "title": "Apple iMac 27-inch (2020) review",
  "category": "computing",
  "updated": "2021-12-02T14:41:44Z",
  "author": "matt-hanson",
  "summary": "A formidable upgrade",
  "verdict": "The Apple iMac 27-inch (2020) offers some big improvements, specs wise, compared to its predecessor, and looks set to be Apple's best all-in-one yet. The upgrades to the webcam and microphones are especially welcome for anyone working from home. However, Apple has stuck with the same design as previous models, and it's about time we saw a new look.",
  "pros": [
    "Improved internals",
    "Same price as last year's model",
    "Can be configured to be very powerful",
    "Improved webcam is great"
  ],
  "cons": [
    "Design is getting old",
    "Just two Thunderbolt ports"
  ],
  "article": [
    "The iMac 27-inch (2020) is a nice turning point for the iMac all-in-one lineup, bringing a number of impressive upgrades both inside and out that will certainly convenience just about anyone to upgrade – even those who haven’t owned an iMac before.",
    "Apple has certainly delivered. The iMac 27-inch (2020) comes with a massive boost in specifications – namely, 10th-generation Intel Comet Lake processors, speedy solid state drives (SSDs) across the board, powerful AMD Radeon Pro graphics cards and bags of RAM. That’s more than enough for professionals, whether they’re back in the office or have permanently transitioned to working from home.",
    "Though for home workers, there’s also a 1080p FaceTime HD webcam and studio-quality microphones for better video calls, which are now an essential part of home working. Those two new features certainly got a workout during our time with the iMac 27-inch (2020), as we had multiple video meetings – and the results were very positive.",
    "Best of all, these features, along with the more powerful components that power them, all come for the same price as the 2019 model.",
    "So, the entry level model sells for $1,799/£1,799/AU$2,799 – the same as the 2019 model’s entry level. If you were eyeing up the 2019 model but didn’t buy it, you can now essentially get a big upgrade for free.",
    "The leap here isn’t so large that it will make the 2019 model feel obsolete, but with the 10th generation processors (which can be configured up to 10 cores, which is a first for the standard iMac), and SSDs, this is a noticeably faster and more powerful device. During our time with it we found that the iMac 27-inch (2020) was fast to boot up, with macOS running fast and smooth. It also handled any benchmark and task we threw at it with ease.",
    "The GPU also gets an upgrade, with the AMD Radeon Pro 5000 graphics cards that come with the device offering a big step up from the Radeon Pro Vega 48 GPUs in the previous iMac, and Apple promises up to 55% faster graphics performance.",
    "However, while we love what Apple has done with the insides of the iMac, things are a little more disappointing on the outside, as Apple has stuck with the same design as previous models – dating back to 2012. This means while the iMac 2020 is still undeniably a stylish looking device (this is an Apple product after all, and regardless of what you think of the company, you have to admit it knows how to make an attractive product), certain aspects of its design are starting to feel dated – especially the thick bezels around the sides of the screen. Apple’s competitors are starting to get pretty good at making stylish and modern all-in-one devices, and if the Cupertino company doesn’t change its iMac design soon, it could find itself being left behind.",
    "However, there’s one aspect of the design that has changed, and it’s a big change at that. The only problem is that it’s an optional extra that costs an additional $500/£500/AU$750. We’re talking about the nano-texture glass finish on the display, which was first introduced in Apple's Pro Display XDR monitor. This prevents glare and reflections showing on the screen no matter what light conditions you’re working in, and the model Apple sent us to review has it.",
    "And, we have to say, it’s excellent. Even with direct sunlight pouring in from an overhead window, we were able to see the screen clearly. The nano-texture glass gives the iMac 27-inch screen a matte-like quality, but it’s genuinely very impressive. It’s a shame you need to pay a lot extra to get it, and for many people, Apple’s asking price will be a bit too high.",
    "Otherwise, the screen remains the same as last year, with a 27-inch Retina 5K display with a 5,120 x 2,880 resolution, along with a brightness of 500 nits and support for the wide color P3 gamut, making it a bright and vibrant display that’s ideal for content creators. Oh, and Apple has added True Tone as well, which tweaks the screen’s warmth depending on lighting conditions.",
    "Overall, Apple has also made some smart changes with the iMac 27-inch (2020), especially to the webcam and microphones, which will really benefit people working from home – and in this current climate, that’s a very wise (and welcome) move.",
    "Many people who are now working from home may find they need a powerful PC, and an all-in-one is a great choice, as they are easy to set up and don’t take up much space. This iMac looks like it could be one of the best all-in-ones for home workers because of its svelte design and powerful innards.",
    "The Apple iMac 27-inch (2020) went on sale the moment Apple announced it, which means you can order one right now through Apple, with physical Apple Stores and Apple Authorized Resellers to follow.",
    "The iMac 27-inch (2020) also continues Apple’s commendable habit of launching new devices for the same price as the previous generation, which means the entry level model sells for $1,799/£1,799/AU$2,799.",
    "For that price, you get a 3.1GHz six-core 10th-generation Intel Core i5 processor with a Turbo Boost of 4.5GHz, 8GB of 2666Hz DDR4 RAM, 256GB SSD and a Radeon Pro 5300 GPU with 4GB of GDDR6 memory.",
    "The mid-range model comes with a 3.3GHz six-core 10th-generation Intel Core i5 processor (with a Turbo Boost of 4.8GHz), 8GB RAM, 512GB SSD storage and a Radeon Pro 5300 with 4GB of GDDR6 memory for $1,999/£1,999/AU$3,099.",
    "Finally, there’s the high-end pre-configured iMac 27-inch (2020), which comes with a 3.8GHz eight-core 10th-generation Intel Core i7 processor that boosts to 5GHz, 8GB RAM, 512GB SSD storage and an AMD Radeon Pro 5500 XT with 8GB of GDDR6 memory for $2,299/£2,299/AU$3,549.",
    "You can also configure the iMac by adding nano-texture glass to the screen (for $500/£500/AU$750 more), along with more RAM and up to 8TB of SSD storage – a huge amount and ideal for digital creatives who need large and fast storage for their files.",
    "The fully kitted-out iMac 27-inch, with a nano-texture screen, a 3.6HZ 10-core 10th generation Intel Core i9 processor (with 5GHz turbo boost), 128GB RAM, an AMD Radeon Pro 5700XT GPU with 16GB of GDDR6 memory, 8TB of SSD storage and 10 gigabit Ethernet (gigabit Ethernet comes as standard) will cost $8,799/£8,799/AU$13,149.",
    "Yes, that’s a huge amount of cash, but that gets you a seriously powerful all-in-one workstation. It’s also more powerful than what most people will need. The good thing here is that you could bump up the RAM to a more reasonable 16GB and add 2TB of SSD storage, for example, and get an iMac that’s more in line with your needs and budget.",
    "And, while even the base configurations of the iMac 27-inch are pricey, they are cheaper than the Microsoft Surface Studio 2, for example, and Apple's all-in-one comes with far better components for the most part.",
    "As we mentioned earlier, the design of the iMac 27-inch remains pretty much unchanged from previous models, except that with the move to SSD storage, the device is slightly lighter. The only other noticeable difference in the design is that the Retina 5K display now comes with nano-texture glass – but that’s an optional extra.",
    "Otherwise, the looks and dimensions of the iMac are the same as previous models, and even the most ardent Apple fan will probably acknowledge that it’s due a bit of a refresh.",
    "The current design has been around since 2012 (and that was a relatively minor tweak from the design used since 2009), and while it’s aged better than other PC designs from that period, it’s starting to look its age in some respects.",
    "The bezels that surround the screen, for example, look particularly outdated these days, when rival all-in-one PCs are using ever more slim bezels that make them look modern and keep the overall size down.",
    "Also, there’s no biometric login. We’re seeing an increasing number of laptops and desktops incorporate fingerprint, iris or face scanning for logging into the operating system. Apple’s iPhone and MacBook devices are market leaders in this respect with TouchID and FaceID – yet this iMac comes with neither, which is a shame.",
    "Also, as with last year, we have to point out that the Magic Mouse 2 that comes with this iMac has a charging port on its underside. This is an annoying choice as it means you can't use the mouse while it’s charging. Simply moving the port would solve this.",
    "The screen is essentially the same as last year’s model, so you get a 27-inch Retina 5K display with a 5,120 x 2,880 resolution, along with a brightness of 500 nits and support for the wide color P3 gamut. This makes it an excellent machine for photo and video editors – and that 5K resolution means you can edit 4K footage without it taking up the entire screen.",
    "The screen also now comes with True Tone technology. Also found in iPads, iPhones and MacBooks, True Tone adjusts the color temperature of the screen depending on the ambient light.",
    "The idea is that this will offer more vibrant colors, while reducing eye strain. We’ve not been terribly sold on True Tone in the past when using MacBooks; while it can make images look nicer in some conditions, it usually ends up making the screen colors a little too warm. If you’re a creative professional who requires color accuracy, you’ll want to turn this option off.",
    "The biggest change to the iMac 27-inch (2020) is actually an optional one – the nano-texture glass. This material scatters light \"at the nanometer level\" in a bid to eliminate reflections and glare when used, even in direct sunlight. The iMac model we were sent actually came with the nano-texture and we were impressed with the results, with a noticeable lack of reflections not matter what type of lighting was used.",
    "We used this iMac in particularly sunny environments (our review coincided with the brief – but very hot – English summer), and while other, more reflective screens suffered in these conditions, the iMac’s nano-texture screen was unaffected, having a matte-like quality to it. We were very impressed.",
    "Paying $500/£500/AU$750 extra for nano-texture might not appeal to everyone, and the standard glass still does a decent job of minimizing distracting reflections, but as nano-texture glass was previously only found in Apple’s high-end (and at $5,999/£5,499/ AU$9,999, extremely expensive) Pro Display XDR professional monitor, the iMac 27-inch (2020) is the most affordable way of getting an Apple device with that screen material.",
    "Apple sent us one of the most powerful configurations the iMac 27-inch (2020) comes in, with an nano-texture screen, a 3.6HZ 10-core 10th generation Intel Core i9 processor (with 5GHz turbo boost), 32GB RAM, an AMD Radeon Pro 5700XT GPU with 16GB of GDDR6 memory and 1TB of SSD storage.",
    "If you were to configure the same device from Apple, it would cost you $4,499/£4,499/AU$6,849 – a pretty hefty chunk of change. That means for the most part, the performance we got with the iMac 27-inch (2020) has been achieved with hardware not too many people will actually have – however, even the base configuration of the iMac looks like it’ll perform very well on paper.",
    "During our time with the iMac 27-inch, we found that macOS Catalina boots and runs quickly, as you’d expect from an Apple device, and that SSD with up to 3.4GB/s data transfer speeds is put to good use. Although with the macOS Monterey now out in the world, expect yours to already come with that upgrade for free.",
    "We ran multiple apps at once, with web browsers full of tabs open, and the iMac 27-inch (2020) didn’t miss a beat.",
    "We tried out encoding a one hour 1080p MKV file to an MP4 using the H.264 encoder with surround sound, and the process took just 13 minutes and 33 seconds, which is certainly impressive.",
    "Next, to give the AMD Radeon Pro 5700XT a workout, we encoded a 2.5-minute, effects-laden DaVinci Resolve project to a 720p, H.264-format video file, and the iMac completed it in an impressive six minutes and 53 seconds, handily beating the iMac 2019, with a Vega 48 GPU, which took nine minutes and 19 seconds to complete the same task. If you’re doing a lot of video encoding, the improved specs of the new iMac are going to save you a lot of time – which means you’re able to complete more projects and that can even have a positive impact on your finances. For professionals, then, the higher spec iMac 27-inch (2020) could be seen as an excellent investment.",
    "Apple claims the iMac offers up to 40% faster 8K ProRes transcoding in Final Cut Pro X, 35% faster rendering with Arnold in Autodesk Maya and up to 25% faster build time in Xcode, and in both our own day-to-day tests and in our benchmark results, we saw a noticeable leap in performance in the new iMac compared to its predecessor.",
    "This is easily one of the most powerful, and best performing, all-in-ones we’ve used, and if you need a PC that can handle complex tasks, like video transcoding, with ease, this is a great choice – though remember we were lucky enough to be using the most powerful version of the iMac.",
    "The iMacs also come with the Apple T2 Security Chip, which offers on-the-fly data encryption, and ensures that any software loaded during the boot process hasn't been tampered with.",
    "The FaceTime HD camera, which is now 1080p, has been put to good use while we used the iMac 27-inch (2020), with a seemingly never-ending series of meetings. Apple claims this webcam doesn't make sacrifices when it comes to low light performance just for the sake of extra pixels.",
    "In fact, the T2 Security Chip will help improve image quality from the webcam, according to Apple, with an Image Signal Processor that controls tone mapping, exposure and face detection as well.",
    "This all sounds good on paper, and in our tests, we found that the webcam delivered very good image quality. We’re used to 1080p webcams in other devices, so we weren’t quite as blown away as we should have been, but for anyone coming from a Mac with an older FaceTime camera, the difference should be noticeable.",
    "There's also a new studio-quality microphone array which, in conjunction with the FaceTime HD webcam, will make sure you're seen and heard in crystal clear quality in meetings and video calls.",
    "We recorded a video for TechRadar using just the webcam and built-in microphones of the new iMac – and the results were very impressive, as usually we’d use an external microphone and webcam. While we’d probably still use those in the future, it’s clear that Apple has invested some time and effort into making the built-in webcam and microphones of the new iMac as good as possible, and it shows – you could happily use them even in content creation – and this means less clutter on your desk.",
    "Also, while the physical speakers of the iMac 27-inch (2020) haven't changed, the T2 Security Chip will handle variable EQ to improve sound quality, including deeper bass.",
    "All these upgrades will be especially appealing to people working from home and who are after a new all-in-one."
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "Price and availability",
    "22": "Design",
    "34": "Performance",
    "50": "Don't buy it if..."
  },
  "links": {
    "Intel Comet Lake": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "Pro Display XDR": "https://www.techradar.com/news/pro-display-xdr-first-look-a-monitor-not-for-mere-mortals",
    "Apple": "https://apple.sjv.io/c/221109/795481/7613?subId1=trd-us-3166993471605279000&u=https%3A%2F%2Fwww.apple.com%2F",
    "Microsoft Surface Studio 2": "https://www.techradar.com/reviews/microsoft-surface-studio-2",
    "macOS Catalina": "https://www.techradar.com/news/macos-catalina-is-here-everything-you-need-to-know-about-macos-1015",
    "macOS Monterey": "https://www.techradar.com/news/macos-12"
  }
}