{
  "source": "https://www.techradar.com/reviews/equalweb",
  "title": "EqualWeb review",
  "category": "computing",
  "updated": "2021-06-22T23:30:58Z",
  "author": "jonas-p-demuro",
  "summary": "A leader in web accessibility solutions",
  "verdict": "In a segment where opaque prices and lack of a warranty are the usual order of business, we are refreshed to see that EqualWeb has upfront pricing, and a $1,000,000 warranty to back up their claims of compliance.",
  "pros": [
    "Transparent pricing",
    "Free tools",
    "Online dashboard",
    "Favorable usable reviews"
  ],
  "cons": [
    "Phone support is optional extra",
    "No pricing on accessibility experts"
  ],
  "article": [
    "EqualWeb makes the bold claim to be “A world leading solution for digital accessibility.” It has its world headquarters in Israel, with a US based office in Manhattan, New York. It has over two decades of experience, working with both the blind and disabled to make digital content more accessible.",
    "EqualWeb has no shortage of notable customers that include Budget Rent a Car, Nvidia, Adidas and Lenovo.",
    "The team at EqualWeb features folks with different backgrounds such as designers, programmers, IT personnel, and marketing experts. They all cater to making a website more accessible for both the blind, and disabled. Also emphasized is that this company prioritizes the security of its clients.",
    "EqualWeb attempts to make its service as easy to use as possible. The journey to website compliance for accessibility starts with the simple step of installing a Google Chrome browser plugin. This plugin can then check for web accessibility issues via an automated algorithm, and determine potential updates to increase the accessibility. EqualWeb indicates that this initial step can locate and identify about 70% of concerns. This method works on HTML pages to bring them up to compliance with WCAG 2.1 requirements. With the scan complete, a visual check list is generated in the sidebar of the Chrome browser, and a remediation widget can start the process of correcting the problems identified.",
    "While in some simpler cases this automated browser plugin may be enough, in other cases more may be needed. For example, after receiving a noncompliance letter, or a lawsuit, a website would need to fix every last issue, and not rely on the automated tools. In those cases, EqualWeb offers its team of accessibility experts, and a Full Remediation package. This is so complete, that at the end of the adjustments, an Accessibility Statement is created to provide notation of the adjustments made to come into compliance. Furthermore, an Accessibility Certificate is made to certify the work done by the inhouse accessibility experts.",
    "The user reviews for EqualWeb paint a solid picture of the product. Repeated reviews emphasize the ease of use, and how easy it is to implement with a single line of code. High marks are also given to the support which is helpful, and the customizable interface. Also reassuring is that there were few criticisms of the service on multiple sites reviewed.",
    "Unlike most of its competition with complete opacity of the prices of their plans, we find the upfront pricing from EqualWeb to be a welcome change. Further adding to the value is that any of the tiers can be sampled on a 7-Day free trial. The entry-level plan, which gets designated as Small has a monthly fee of $39 per month or 20% savings when paid annually. It includes auto remediation via 25 tools that includes an alternate text editor, font adjustments, and an online dashboard. It is suited for a small size website of up to 100 pages, and up to 10,000 monthly visits. The next tier up is called Medium which for $49 a month has a similar feature set and can handle up to 1,000 pages and 100,000 monthly visits making it well-suited for a medium-sized website.",
    "Moving up to the next plan, which is called Large, also has the same features, but can handle a large website of up to 10,000 pages and 500,000 monthly visits. This most popular plan has a cost of $109 monthly with similar savings on an annual basis. At the top tier is the plan that gets called Huge, and for $169 per month it can handle a huge size website up to 100,000 pages and up to 1 million monthly visits.",
    "We also appreciate the availability of free tools which are certainly useful on their own and can be a good starting point to determine to go ahead with a paid plan. Of note among the free offerings is the light accessibility widget, which has no less than 15 features including a text reader, color adjustment, cursor adjustment, a magnifier, and even image descriptions.",
    "A shortcoming is that there is no pricing provided for the inhouse accessibility experts. However, when you use those services, it comes with the $1,000,000 warranty.",
    "Contacting EqualWeb is via the usual methods. This includes a direct email, and a postal address. There is also a US phone number, but it is not toll free.",
    "For all of the plans listed above it includes support via email. The option exists to upgrade to 24/7 email and phone support for an undisclosed price.",
    "EqualWeb’s offering into the web accessibility space is an attractive one, and it’s easy to see why it is a market leader. The positives are the free trial, the ease of installation, the upfront pricing, and the 25 feature tool kit. The negatives to be aware of are the undisclosed pricing of the nonautomated offering, that the phone support is an additional charge, and the lack of a toll free number for support. Overall, EqualWeb has a strong presence in the area of web accessibility for good reason, and is certainly worth a look via the free tools and trial."
  ],
  "headers": {
    "2": "Services",
    "5": "User Reviews",
    "6": "Pricing",
    "10": "Support",
    "12": "Final verdict"
  },
  "links": {
    "EqualWeb": "https://www.equalweb.com/"
  }
}