{
  "source": "https://www.techradar.com/reviews/bisecthosting",
  "title": "BisectHosting review",
  "category": "computing",
  "updated": "2021-05-25T06:09:15Z",
  "author": "mirza-bahic",
  "summary": "Budget-friendly Minecraft server hosting with enough plans to satisfy everyone’s needs",
  "verdict": "BisectHosting offers an outstanding amount of flexibility with its affordably priced plans which makes the service easy to recommend to those searching for Minecraft server hosting on a budget.",
  "pros": [
    "Eight server locations to select from",
    "Feature-packed shared hosting plans",
    "Free backups and DDoS protection",
    "Huge collection of Minecraft-focused packages",
    "3-day money-back guarantee"
  ],
  "cons": [
    "No dedicated IP with “Budget” packages",
    "No support via telephone"
  ],
  "article": [
    "BisectHosting came into existence in 2011 as a child company of Venture Node LLC and was registered in Ohio. Although they have been primarily focused on providing feature-rich yet pocket-friendly Minecraft server hosting services, they managed to cover several other games as well, including Rust, Terraria, 7 Days to Die, Valheim, ARK: Survival Evolved and more.",
    "Besides allowing gamers of the world to unite through a smooth multiplayer experience, BisectHosting also provides other web hosting services such as shared hosting, VPS and dedicated server hosting to those who want to launch their own website. They claim that their server support is “quick and reliable” so every user, a novice or an expert, can feel right at home with BisectHosting. They add that their main aim is to be the best Minecraft server provider across the market, “providing best server hosting at an affordable price.” Although we find their ambition commendable, their competitors shouldn’t be underestimated in any way.",
    "BisectHosting’s main website is a good example of a user-friendly approach done right, where you’ll be able to find everything you need within a reach of a click or two.",
    "All server locations are marked on the map and you can get additional details by clicking on each of them. These include several positions in the USA (Los Angeles, Buffalo, Dallas and Miami), two in Canada (Montreal and Hillsboro) and one each in the UK (London), the Netherlands (Amsterdam), Germany (Limburg), France (Roubaix), Poland (Warsaw), Russia (Moscow), Singapore (Singapore) and Australia (Sydney). All in all, BisectHosting’s network of servers had a smart strategy in mind and it is nothing short of impressive.",
    "BisectHosting’s website features a well-kept official blog which consists of news and updates about their products, for the most part. Alternatively, users can stay up-to-date by following them on Facebook, Twitter, Instagram and Discord.",
    "For those interested in Minecraft server hosting only, BisectHosting offers forty packages in total (a half of which are “Budget” while the other half belongs to “Premium” ones), which is such a considerable amount of choices that we were struck with analysis paralysis straight away.",
    "Even the budget-friendly ones are chock-full of features that are fundamental in Minecraft, including custom JAR support, full FTP access, free MySQL, a free subdomain, free DDoS protection and more. The most affordable “Budget” plan will cost you mere $2.99 per month and provide 1024MB of RAM and support for up to 12 slots, in addition to everything mentioned above.",
    "Apart from Minecraft, there are fitting packages for other popular multiplayer games including: Terraria, Valheim, ARK: Survival Evolved, Left 4 Dead 2, Counter Strike: Global Offensive, 7 Days to Die, Rust, Counter Strike: Source, Arma 3, Garry's Mod and Team Fortress 2.",
    "Besides gaming-focused hosting, BisectHosting offers a few options for those looking to host a website (or several of them) which include shared hosting (that start at $2.99 per month), VPS (from $4 a month) and dedicated server hosting solutions (from $109 a month).",
    "All hosting packages (with the exception of dedicated ones) come with 3-day money-back guarantee. Although it is far below the industry’s standard, at least there is one being actually offered.",
    "As for payment methods, BisectHosting currently accepts credit cards, PayPal, and Paysafecard.",
    "One thing BisectHosting provides all of its users with is an abundance of choice, with something being offered to suit most tastes. Whether you want hosting for a small multiplayer community or a large one, BisectHosting should get you covered with its unlimited slots.",
    "Those who are on the lookout for Minecraft server hosting services can select from Bedrock (mobile) and Java (original) edition, with more pre-designed packages being provided for Java. Whichever you opt for, the following step is to select a plan and check all of its details, such as data center location, billing cycle and add-ons.",
    "If you aren’t hell bent on saving a few bucks, you could go with the most pocket-friendly out of the “Premium” packages, since they come with all features you could wish for without the need to pay extra for each of them. The most noteworthy are: unlimited slots, NVMe SSD space, dedicated IP, daily backups, Sponge installation and modpack updates and installations. Of course, all of “Budget” server features are included in this one as well.",
    "Creating an account with BisectHosting will require you to provide a number of personal details (although nothing out of the ordinary) and since instant setup is one of their key features, your server will be ready to use in the blink of an eye.",
    "All server hosting plans come with a highly modified version of MultiCraft as your control panel, and which variation you’ll get depends on whether you chose a plan from the “Budget” or “Premium” section. Both control panels share the same easy-to-use functionality and will enable fast navigation for Java and Bedrock users alike. Even if you haven't used any version of MultiCraft before, with its user-friendly interface you should be able to swiftly find ways to customize your server by installing modpacks, plugins, server JARs and much more.",
    "In order to fulfil its goal and become one of the best Minecraft server providers out there, BisectHosting should present us with close to perfect performance, even more so since they claim that NVMe or SSDs are used exclusively to run all of their game servers. After testing the speed of BisectHosting’s main website by utilizing GTmetrix as our tool we got somewhat expected and highly satisfactory results. All vital web metrics related to speed performance were well above the average, resulting in near-perfect an A (99%)",
    "Although BisectHosting offers no uptime guarantee, according to the results we got after monitoring it for a month (via UptimeRobot) it should be close to 100%. No major oscillations were recorded in response time and not a single second of downtime on top of everything. Admittedly, one month of perfect performance doesn’t have to be indicative of a whole year, but it sure seems like a good start.",
    "As reported by a large number of their users (and supported by our own first-hand experience) BisectHosting’s customer support team is one of their major selling points. Not only they are at your disposal around-the-clock, but the persons in charge are responsive, resourceful and very respectful in their approach to customers. This “dream team” can be reached via support ticket and live chat.",
    "If you want to be more self-sufficient, you’ll find a major source of information in BisectHosting’s knowledgebase. It currently contains 139 articles in total which are split into ten corresponding categories (Billing Panel, Domain Management, Game Servers, Minecraft Java/Bedrock Servers and so forth). As far as we can see, most of these articles are easy-to-follow and often supplemented with pictures or video tutorials from BisectHosting’s official YouTube channel.",
    "We should give a special mention to their YouTube channel as well, since it is only less than a year old and, yet, it is overflowing with how-to videos which seem to be coming out on a weekly basis.",
    "When placed side by side, Shockbyte and BisectHosting seem quite similar in terms of pricing, features and support, but there are small differences that might be decisive for some users. Shockbyte is more famous for its overall performance (which means high response time, low latency and lag improbabilities), while BisectHosting’s technical team is doing a better job with support for unlimited domains, SSL certificates and backups.",
    "Both Apex Hosting and BisectHosting offer servers of all sizes with a myriad of additional options. However, the cheapest Minecraft server hosting option with Apex Hosting will cost you $4.49 per month (and for the first month only, after which it will rise to $5.99), while with BisectHosting it’s merely $2.99 per month. On the other hand, with Apex Hosting you’ll get a somewhat longer money-back guarantee.",
    "Besides game server hosting, BisectHosting provides a shared web hosting option with a few attractive features and pricing that is a match for Bluehost’s. The cheapest plans with both hosts come at quite an attractive price, which is $2.95 per month with Bluehost and $2.99 with BisectHosting. However, with Bluehost’s plan you’ll get free domain registration, a free SSL certificate and CDN, which is hard to beat.",
    "HostGator is a great alternative both to Bluehost and BisectHosting for all those looking for a simple-to-use yet feature-packed hosting service equally fit for individual users and small businesses. As expected, even with its cheapest plan, HostGator provides users with a wide array of beginner-friendly and useful features (free domain registration, one-click installs, a free SSL certificate, free domain and website transfer, free MySQL and script transfer, and a generous 45-day money back guarantee), so it might be a better choice.",
    "On the question if BisectHosting is likely to make your gaming dreams come alive, we would have to say “yes, probably”. It offers a great diversity with its Minecraft packages, a full set of favorable features, prompt and proficient customer support and all at a pocket-friendly price.",
    "Its web hosting packages are, however, another matter and leave out some of the beginner-friendly bonuses we are accustomed to see with other providers. Newcomers who would like to get some of those benefits are better off with fan-favorites such as HostGator, Hostinger or Bluehost."
  ],
  "headers": {
    "5": "Plans and pricing",
    "11": "Ease of use",
    "16": "Speed and experience",
    "18": "Support",
    "21": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "BisectHosting": "https://www.bisecthosting.com/",
    "Minecraft server hosting": "https://www.techradar.com/web-hosting/best-minecraft-server-hosting",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "DDoS protection": "https://www.techradar.com/news/best-ddos-protection",
    "Shockbyte": "https://shockbyte.com/",
    "SSL certificates": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Apex Hosting": "https://www.techradar.com/reviews/apex-hosting",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "HostGator": "https://www.techradar.com/reviews/hostgator"
  }
}