{
  "source": "https://www.techradar.com/reviews/corsair-virtuoso-rgb-wireless-xt",
  "title": "Corsair Virtuoso RGB Wireless XT review",
  "category": "computing",
  "updated": "2021-06-11T20:42:09Z",
  "author": "ural-garrett",
  "summary": "A new near-perfect gaming headset standard",
  "verdict": "The wired and wireless connectivity options on the Corsair Virtuoso RGB Wireless XT are highly impressive alongside the ability to simultaneously connect both 2.5GHz and Bluetooth aptX HD. Beyond that, it’s an outstanding gaming headset that blends phenomenal audio quality with functionality for those willing to pay the high-price tag. Be mindful of the short battery life and 2.5GHz range though.",
  "pros": [
    "Phenomenal audio and mic quality for gaming",
    "Incredible headphones for general music listening",
    "Beautiful and sturdy build",
    "Dolby Atmos support",
    "Simultaneous connectivity between 2.5GHz and Bluetooth"
  ],
  "cons": [
    "Short battery life - especially when using dual-connections",
    "Short USB-2.5GHz Range",
    "Wireless option not XBox or Nintendo Switch compatible"
  ],
  "article": [
    "The best gaming headsets are beginning to offer near-audiophile quality and feature-sets that rival headphones. Within the $200 - $300 price point, headsets like the SteelSeries Arctis Pro Headset, Audeze Penrose X , and Asus ROG Strix Fusion 700 have created solid points for that argument. Priced at $269.99 (£249.99, AU $350.12), Corsair’s Virtuoso RGB Wireless XT is the definitive statement for what wireless gaming headsets should be in 2021.",
    "There are four connectivity options split between wired and wireless. This includes 3.5mm, USB-C, a 2.5GHz dongle and Bluetooth. The Virtuoso RGB Wireless XT also allows for dual connectivity for both 2.4GHz and Bluetooth, so you can play games on your PC or Playstation 5 while taking mobile phone calls at the same time. Of course, all of that tech wizardry comes in addition to the phenomenal audio quality for gaming alongside music due to the 50mm high-density neodymium speaker drivers, a wide sound frequency range of 20Hz-40,000KHz, Dolby Atmos support and a crispy clear 9.5mm omni-directional detachable microphone. Even if it has some issues, the Virtuoso RGB Wireless XT is a magnificent piece of audio equipment.",
    "The Virtuoso RGB Wireless XT looks attractive, yet it’s built to take punishment. The headset is built with an all-black lightweight machined aluminum that’s sleek but aggressive. Each ear cup also features an RGB lit Corsair logo that’s customizable through the iCue app.",
    "On the bottom of each ear cup, there are some initiative on-headset controls. The right side features volume rocker, wireless and USB toggle and Bluetooth controls. On the left side is where users will find the USB-C port, 3.5mm jack and plug-in for the detachable mic. Sitting cleverly underneath the detachable mic is the mute button. Cleverly enough, the ring of light around the mic tip turns red when the mic is muted and white when on. One cool feature is that even when the mic is turned off, it’ll automatically engage when answering a phone call.",
    "The Virtuoso RGB Wireless XT sits firm and comfortable on your head regardless of how long you’re gaming. Ear cups feature premium memory foam that’s cozy around the ears, despite being breathable, successfully avoiding sweat build-up. The soft textured headband also allows tactile adjustments that feel locked in even during removal. For traveling purposes, the headset comes with a cross-stitched and padded pouch that seals with a magnetic clasp.",
    "When gaming, the Virtuoso RGB Wireless XT really does knock it out of the park in the audio department on PC and Playstation 4/5. If you’re into competitive games like Call of Duty: Black Ops Cold War, the headset provides a real audio advantage. Gunfire, footsteps, ambient sound and communication sound crystal clear while playing. Plus, the detachable mic sounds amazing regardless of in-game communication or general phone calls. More immersive single player games such as Cyberpunk 2077, Resident Evil Village, Last of Us II and Spiderman: Miles Morales also benefit from the immersive sound.",
    "On PC, the headset offers even more immersion through Dolby Atmos support. Trust us, it’s well worth the extra dough. Beyond providing better audio for supported games including Call of Duty: Black Ops Cold War, Metro:Exodus, Gears 5 and Forza Horizon 4, it does improve in other media, whether you’re watching your favorite film or relaxing to some music. Considering Xbox Series S|X is compatible with Dolby Atmos, too bad the 2.4Ghz wireless dongle isn’t compatible. Users there and on Nintendo Switch have to use the 3.5mm configuration.",
    "The Virtuoso RGB Wireless XT works wonderfully with high-fidelity audio services like Tidal. Having that 40KHz threshold allows for a significantly wider range of musicality from enjoying the deep bass of contemporary Hip Hop like J Cole’s “let.go.my.hand” to loud JPop sounds of Chai’s “No One Knows We Are Fun.” More nuanced musical examples including composers John Williams’ “Star Wars Theme” and Yo-Yo Ma offer divine listening experiences. Regardless of genre, the Virtuoso RGB Wireless XT can handle them all effortlessly. Those looking to play with equalizers can do so through either Corsair’s iCue app or Dolby Atmos app for those willing to spend a little extra.",
    "There are two things that hold the Virtuoso RGB Wireless XT from absolute greatness. Though the bluetooth frequency offers standard range, the 2.5GHz only works for around 60ft. While other headsets like the Razer BlackShark V2 Pro allowed us to keep the headset on all around an entire two-bedroom apartment, the Virtuoso RGB Wireless XT barely made it to the kitchen.",
    "Dual wireless connectivity does help alleviate those problems since you can just switch audio output to the device utilizing Bluetooth.",
    "Meanwhile, battery life is fairly below standard at 15 hours between charges when using all the features. With dual wireless connectivity and RGB lighting off, you can swing an extra five hours out of the headset. Charging to full took somewhere in the ballpark of three hours. There’s an accelerometer-based smart-sleep/wake function that can tell when you’ve placed the headset down or on one’s head in an effort to save battery life as well. If you’re the type to use your headset as a general wireless headphone without the mic, Bluetooth aptX HD sounds nearly as good as wired or 2.5Ghz, though the compression is slightly noticeable. If you care less about preserving battery life, the RGB lighting on the side will definitely turn heads in the wild.",
    "Audio quality for gaming, music listening and phone sessions are all top-notch on the Virtuoso RGB Wireless XT. From a PC gaming perspective, the simultaneous wireless connection offers real levels of efficiency between work and play. Sure, the battery could be better and the connectivity range for 2.4 Ghz transmitter is short but more stationary gamers with audiophile tendencies are in for a real treat here."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Don't buy it if..."
  },
  "links": {
    "best gaming headsets": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "SteelSeries Arctis Pro Headset": "https://www.techradar.com/reviews/steelseries-arctis-pro-headset",
    "Audeze Penrose X": "https://www.techradar.com/reviews/audeze-penrose-x",
    "Asus ROG Strix Fusion 700": "https://www.techradar.com/reviews/asus-rog-strix-fusion-700",
    "Razer BlackShark V2 Pro": "https://www.techradar.com/reviews/razer-blackshark-v2-pro"
  }
}