{
  "source": "https://www.techradar.com/reviews/hisense-u80g-uled-8k-tv",
  "title": "Hisense U80G ULED 8K TV review",
  "category": "televisions",
  "updated": "2021-07-16T11:17:43Z",
  "author": "stephen-lambrechts",
  "summary": "Hisense lifts its game with a fantastic 8K debut",
  "verdict": "Leaving behind the image processing issues of previous TV models, Hisense knocks it out of the park with its first 8K television, achieving brilliant visuals and delivering the high-end features expected from flagship TVs in 2021.",
  "pros": [
    "Terrific upscaling",
    "Dolby Vision support",
    "Google OS brings excellent app support",
    "Great Google Assistant implementation"
  ],
  "cons": [
    "Some may find Google OS sluggish",
    "Underwhelming built-in speakers"
  ],
  "article": [
    "We've criticized Hisense in the past somewhat for the occasional image scrambling that can happen on its TVs during fast-paced scenes. Now, though, we're happy to report that this is much less of an issue with the fantastic Hisense U80G ULED 8K TV, which delivered exceptionally smooth motion and picture quality during our tests.",
    "Launched first in Australia, Hisense's 75-inch U80G ULED is the Chinese company's first 8K television, and what a great debut it is. The television offers everything you would expect from a high-end model in 2021, including HDMI 2.1 and eARC support, built-in voice assistant functionality and excellent upscaling.",
    "While the U80G ULED can't quite match the superb black levels of Hisense's own Dual Cell TV, which combines a traditional local dimming system with added precision-bonded LCD layers for color and luminance, it still achieves impressively deep blacks thanks to a full array local dimming system.",
    "Additionally, we applaud Hisense's decision to integrate Android TV over its own VIDAA OS on the U80G ULED, meaning users no longer have to miss out on any popular streaming apps, such as Disney Plus.",
    "That said, Android TV can be quite sluggish at the best of times, and some users may find the OS to drag compared to apps available on other smart TVs.",
    "More positively, the inclusion of Android TV means the U80G ULED offers full support for Google Assistant, allowing you to simply ask your TV for information which is then read back to you and also displayed on-screen.",
    "Admittedly, the U80G ULED's speakers are just okay, not quite living up to the high standard set by Hisense's recent Dual Cell TV, which boasted a built-in soundbar and additional wireless subwoofer. That said, the U80G ULED marks a terrific 8K TV debut for Hisense – one which is quite reasonably priced for its category.",
    "Initially, the Hisense U80G ULED 8K TV will only be available in a 75-inch model, which has been priced at AU$6,999 in Australia. Hisense's 75-inch U80G ULED 8K TV should be available from The Good Guys starting March 22, and the company assures us that 65-inch and 85-inch models are also on the way, set for Australian release later in the year.",
    "At present, we don't have pricing and availability information for other regions, but based on the television's Aussie pricing, its cost should roughly translate to $5,476 in the US and £3,922 in the UK.",
    "In terms of price, the flagship U80G ULED manages to be consistent with some entry-level 8K sets on the Australian market, while also being far more affordable than other top-end 8K tellies.",
    "For instance, Samsung's 75-inch Q800T can be purchased for around AU$6,795, while its flagship Q950T model goes for around AU$10,995.",
    "Make no mistake, Hisense's U80G ULED 8K TV is an attractive telly, sporting a sleek design with a striking speaker grill along its bottom edge and bezels that don't stand out too much.",
    "That said, it's not as flat out gorgeous as some other 8K TVs on the market, such as Samsung's aforementioned Q950T, which has done away with visible bezels and speakers completely (from the front, at least).",
    "Admittedly, Samsung's TV costs a few grand more, so it really is a matter of weighing up how much you're willing to pay for those aesthetic touches.",
    "The U80G ULED sleekness continues on the television's rear side, with smooth, textured plastic covering the back panel. There is a slight waviness to the plastic which hits its thickest along the middle of the TV, indicating that's where the majority of its internal components are housed.",
    "We must give high praise to the U80G ULED's cable management system, which does a great job of hiding unsightly cords behind a detachable plastic panel.",
    "Those who value their privacy will be pleased to know there's a dedicated button along the bottom edge of the telly that will stop the U80G ULED from listening to you via Google Assistant.",
    "While this is indeed a welcome feature, its implementation is rather annoying – the U80G ULED will indicate to you that the TV's mic has been turned off by switching on four bright orange lights just underneath the Hisense logo.",
    "These lights stayed on for several minutes in our tests, leading us to assume they will simply remain on until the mic is switched back on again. Needless to say, the lights were hugely distracting and managed to cancel out the goodwill generated by the feature in the first place.",
    "Thankfully, Hisense nails it when it comes to connectivity on the U80G ULED. It sports four HDMI ports in total, with two HDMI 2.1 compliant inputs (HDMI3 and HDMI4) allowing for 4K/120fps or 8K/60fps – that's sure to please the gamers out there with shiny new Xbox Series X and PS5 consoles.",
    "The HDMI3 port also offers eARC support, meaning users can relay high-end audio formats like Dolby Atmos and DTS:X back to their compatible receivers and soundbars. You also get the standard USB ports, an optical output, an RF antenna input and an ethernet port.",
    "Admittedly, it's likely the U80G ULED's stand will not be to everyone's taste, with a wide stance and triangular feet which protrude both forward and backwards in a rather major way. If you aren't planning on wall-mounting Hisense's new 8K TV, you'll need a cabinet or base with quite a lot of room to stand it on.",
    "Hisense's VIDAA OS has made decent strides in recent years in terms of usability and speed, though has always suffered when it comes to app support. For instance, the Disney Plus streaming app is still unavailable on the VIDAA platform to this day.",
    "Thankfully, this is not the case with Hisense's U80G ULED 8K TV, which has surprisingly opted to go with Google's Android TV platform over its own OS.",
    "This means that while the TV isn't quite as snappy to use as previous Hisense televisions, it makes up for it by offering total app freedom with access to thousands of apps on the Google Play Store. In other words, you should have no problem installing any streaming or catch-up app on Hisense's U80G ULED.",
    "If you want to take your app game even further, you can even pair a Bluetooth controller and install an emulator app to the TV for some instant retro gaming fun if you so choose.",
    "As was mentioned earlier, the Android TV platform brings with it full Google Assistant integration, effectively turning your television into a very large Google Nest.",
    "Want to know what the weather will be like for the rest of the week? Or which movies starring Sylvester Stallone are available to stream? Simply say \"Hey Google\" or \"OK Goggle\" and ask your question. Your answer will be displayed on screen, ready to interact with.",
    "Alternatively, you can also press the Google Assistant button (that's the one with the four colored dots on it) on the TV's remote, forgoing the need to formally address the television whenever you want to make a query.",
    "Speaking of the U80G ULED's remote, we're rather pleased by its size, shape and simplicity. The remote has a prominent directional pad with centered OK button, making it easy to navigate around and make selections on your home screen. You also get dedicated Netflix, YouTube and Google Play buttons at the top of the remote.",
    "The term 8K brings high expectations when it comes to image quality, and we're pleased to say that Hisense absolutely delivers with its first 8K television.",
    "Simply put, the Hisense's U80G ULED 8K TV, which has received official 8K Ultra HD certification, offers pristine visuals with eye-popping, Dolby Vision-enhanced quantum dot colors and excellent brightness.",
    "Thanks to Hisense's new Hi-View Engine PRO 8K processor, we get none of the image scrambling that effected its previous 65SX Dual Cell TV. We ran the U80G ULED through a number of fast-paced and rapidly edited scenes and it never once faltered.",
    "While it's true that there isn't a whole lot of native 8K content out there, we were able to test out a few 4320p YouTube videos at 60fps on the U80G ULED and came away stunned at the vivid colors, crystal clear details and smooth motion on display.",
    "Of course, from an everyday standpoint, the real benefit of owning an 8K television comes down to upscaling. According to Hisense, the U80G ULED's 8K AI Upscaler tech uses advanced deep learning algorithms to adjust and enhance pixels on a frame-by-frame basis, resulting in images which look sharper and cleaner than their native resolution would imply.",
    "While it's likely that the difference in visual fidelity for upscaled 4K content won't immediately stand out to most casual observers, there is a difference if you look closely enough.",
    "Due to having a far greater pixels-per-inch (PPI) count, 8K displays are able to boast pixels that are both smaller and much closer together than a 4K TV, making them much more difficult to individually identify.",
    "In truth, the difference is incredibly minor unless you're sitting very close to your screen, however, there is a general sense of increased clarity for most content, and that will surely become more noticeable as more native 8K content arrives in the future.",
    "During our review period, we tested out a few 1080p films and TV shows on Netflix and came away impressed with the added sharpness and clarity they seemed to possess. We never confused any of it with native 4K content, but it did look pretty close at times.",
    "In terms of black levels, the U80G ULED handled itself as well as can be expected for a TV with full array local dimming. It doesn't quite achieve the near-OLED black levels of Hisense's recent Dual Cell TV, but it comes fairly close, making use of hundreds of backlights across its entire panel to target and light specific sections of the screen.",
    "For the most part, black levels are deep and accurate on the Hisense U80G ULED 8K TV, with only some mild light blooming around the edges of bright objects against dark backgrounds.",
    "While the TV can't hope to match an OLED or Mini LED TV in terms of perfect blacks, it handles itself about as well as Samsung's recent QLED models.",
    "Like most top-end LCD televisions, Hisense's U80G ULED 8K TV experiences some loss of contrast and color saturation when viewed from the side, however we were pleased at how minimal that loss was.",
    "Even from a 45-degree angle, colors remained bright and vivid, leading us to believe that viewing angles shouldn't be of much concern during your next big gathering.",
    "Unfortunately, we weren't able to test live sport on Hisense's U80G ULED, though the TV does specify support for 240Hz refresh rates, meaning you can expect exceptional motion smoothing if you're into that kind of thing.",
    "Additionally, gamers will be pleased to hear that Hisense's U80G ULED offers a number of high-end game specific features, including Game Mode Pro, which will automatically switch on like VRR (Variable Refresh Rate) and ALLM (Auto Low Latency Mode) when a game console is detected.",
    "In terms of audio, Hisense's U80G ULED 8K TV regrettably falls short of what the company achieved with its 4K flagship, the Hisense 65SX. That television impressively included a wireless 4.1-inch subwoofer, which delivered deep, punchy bass.",
    "While it's not realistic to expect every television the company makes from now on to include a subwoofer, we were admittedly taken aback by the U80G ULED's pedestrian speaker setup, offering just two tweeters and two mid-range speakers.",
    "When you consider that Hisense counts Dolby Atmos audio as one of the U80G ULED's selling points, it's a little disappointing to see that high end format delivered to what is essentially a 2.0 speaker setup.",
    "That isn't to say that the Hisense U80G ULED 8K TV's speakers sound bad – in fact, the TV's speakers are able to achieve a decent level of volume without any distortion and audio comes through quite clearly. Just don't expect any dimensionality whatsoever."
  ],
  "headers": {
    "0": "One-minute review",
    "7": "Price and availability",
    "11": "Design",
    "22": "Smart TV and remote",
    "30": "Picture quality",
    "46": "Audio performance",
    "50": "Don't buy it if..."
  },
  "links": {
    "Dual Cell TV": "https://www.techradar.com/reviews/hisense-65sx-dual-cell-tv",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}