{
  "source": "https://www.techradar.com/reviews/rapoo-xw2k-webcam",
  "title": "Rapoo XW2K webcam review",
  "category": "computing",
  "updated": "2021-11-02T09:31:54Z",
  "author": "jess-weatherbed",
  "summary": "Easy on the wallet, not as easy on the eyes",
  "verdict": "The Rapoo XW2K is a budget friendly, no frills webcam that's well suited for folk who just need something to make infrequent calls, but its 2K resolution claims could disappoint some.",
  "pros": [
    "Great wide-angle 85° FOV",
    "The viewing angle can be freely adjusted",
    "Built-in privacy cover"
  ],
  "cons": [
    "Video quality is poor",
    "No detachable USB",
    "Removing packaging is a pain"
  ],
  "article": [
    "The Rapoo XW2K is a budget-friendly webcam that targets users wanting plug-and-play functionality at a higher resolution than most standard webcams that run at 1080p, instead offering 2K quality. You can pick up the Rapoo XW2K on sites like OnBuy or Ebuyer for $41.99 / £49.99 / €59.99 (around AU$75), which is great if you’re looking for an alternative to pricier brands like Logitech webcams.",
    "There are several issues right off the bat, however. Firstly, availability isn’t great, with the only website we saw the XW2K available in the US being Ebuyer, and the device looks very similar to another product in the Rapoo webcam family, the C280, which could confuse potential buyers.",
    "The cable is a USB-A type connection and measures around 60-inches (150cm) in length, but this is fixed into the back of the device so you can’t remove it like you can on more luxury devices like the Razer Kiyo Pro. The camera is mounted on a swivel ball-joint style head that allows for fantastic flexibility on angles, much more so than most of the products on our list of the best webcams that tend to limit movement to a simple up-down motion.",
    "Should you want to, you can also mount the Rapoo XW2K onto a standard tripod as it has the appropriate thread located on the underside of the clip mount.",
    "The Rapoo XW2K has a wide 85° field of view that can capture a large area of your background, but this is fixed and you’ll be unable to change it if you wanted to hide a messy backdrop using a closer shot.",
    "You’ll want to position yourself correctly when you first set up the webcam, though, as it has a fixed focal point with no autofocus. This is likely because it was designed to be simple to operate, but in reality, the lack of adjustment can be frustrating if you feel you’re blurry.",
    "The microphone quality of the Rapoo XW2K is surprisingly good for a webcam, especially given that even the most expensive webcams on the market still struggle to provide clear audio recordings, but while it’s okay for conferencing in quiet environments with little background noise, you’d still want to invest in something more dedicated for audio recordings like a USB microphone or combi-headset if you were considering broadcasting.",
    "The built-in privacy cover is a nice touch, but it actually caused issues when unpacking the device. Out of the box, the lens is covered with a protective film to prevent scratches, but prying it away from the device underneath that film took almost 10 minutes, which feels frustratingly long. The privacy cover is very simple, you just slide it across the front of the camera lens to manually block recordings, but if you’re passionate about security then having it on the device can feel reassuring.",
    "The Rapoo XW2K doesn’t come with any software, so your control over its quality is very limited. It was designed to be something that you could just plug in and use without needing to play around with settings, but in practice, the out-of-box quality doesn’t meet the standards of its namesake. The main issue is that it’s advertised with a resolution of 2K (2560 x 1440p), which would suggest you’re getting a superior image quality over the many 1080p webcams available online, such as the beloved Logitech C920 which is now approaching its 10th birthday.",
    "Despite its age, the Logitech C920 is still one of the best webcams on the market, and while the Rapoo XW2K provides 2K resolution at 30 frames-per-second, the older webcam is still far superior. That doesn’t exactly mean you should dismiss Rapoo if you’re on a tight budget though, as the aging C920 will still set you back $90 / £90 / AU$136, which is around twice the RRP of the Rapoo XW2K.",
    "We compared the Rapoo XW2K to two different Logitech webcams: the Logitech 4K Brio and the Logitech C920, with the idea being that something with a 2K resolution should sit somewhere between the two devices for image quality. As you can see from our tests, this is far from the case, but both of the Logitech offerings are far more expensive, so if you’re wanting a really high-quality product then it’s clear that it won’t come cheap.",
    "Another issue we found was that the sensors of the Rapoo XW2K are relatively poor and struggle in low-light environments. Even when situated in front of a window we were seeing background noise (that ‘static-like’ fuzz), and the image was overly bright and washed out. For a budget webcam, the quality is actually fine, and fares better than some cheap nameless options purchased on Amazon, but it’s difficult to get past expectations set by the 2K resolution.",
    "Realistically, it's the price that will sell you on this, so if you're looking for a cheap, reliable webcam then the XW2K is perfectly serviceable for anyone who needs a camera for infrequent calls, but make sure you have plenty of natural light in your environment."
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "Don't buy if..."
  },
  "links": {
    "Logitech webcams": "https://www.techradar.com/news/best-logitech-webcams",
    "Razer Kiyo Pro": "https://www.techradar.com/reviews/razer-kiyo-pro",
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "USB microphone": "https://www.techradar.com/best/the-best-usb-microphones-2020-the-best-standalone-mics-you-can-buy-today",
    "combi-headset": "https://www.techradar.com/news/best-business-headphones-and-earphones",
    "Logitech C920": "https://www.techradar.com/reviews/logitech-c920",
    "Logitech 4K Brio": "https://www.techradar.com/reviews/logitech-brio-ultra-hd-pro-business-webcam"
  }
}