{
  "source": "https://www.techradar.com/reviews/ninja-personal-blender-and-smoothie-maker-qb3001",
  "title": "Ninja Personal Blender and Smoothie Maker QB3001 review",
  "category": "appliances",
  "updated": "2021-12-03T11:43:33Z",
  "author": "carrie-ann-skinner",
  "summary": "Ninja’s entry-level personal blender effectively blitzes fruit, nuits and ice",
  "verdict": "The Ninja Personal Blender and Smoothie Maker QB3001 is a simple-to-use personal blender that not only pulverizes fruit and vegetables smoothly, but it can also tackle nuts and ice. It’s noisy and offers no way to add ingredients while the blades continue to spin, which means it struggles with sauces and condiments, such as mayonnaise. However, an affordable price makes it ideal for smoothie-lovers on a budget.",
  "pros": [
    "Effectively blends fruit and crushes nuts and ice evenly",
    "Comes with two 16fl oz / 470ml canisters",
    "Compact"
  ],
  "cons": [
    "Not suitable for large quantities",
    "Noisy",
    "No way to add ingredients while blending"
  ],
  "article": [
    "Personal blenders that let you blitz fruit and vegetables in their take-away containers into silky-smooth drinks have become a staple kitchen gadget for many since the introduction of the first Nutribullet in 2012. While Nutribullet may be the most well-known brand when it comes to such appliances, rival Ninja has been snapping at its heels for some time with its own compact on-the-go blenders.",
    "The Ninja Personal Blender and Smoothie Maker QB3001 is the brand’s entry-level personal blender that comes with two 16fl oz / 470ml single-serve cups. Put the ingredients to be blended in one of the cups, screw on the blade assembly, then turn the cup upside down and place on the motor base. Pushing down on the cup will start the blades spinning, pureeing your ingredients.",
    "Ninja doesn’t just produce some of the best blenders on the market, the brand also offers a range of kitchen appliances including air fryers and juicers, making it worthy of consideration for more than just personal blenders.",
    "The Ninja Personal Blender and Smoothie Maker is a slim and compact device with a 700W motor. It also comes with two spouted lids that can be screwed onto the single-serve cups, which means that the contents don’t need to be decanted before being taken with you. Unlike Ninja’s other personal blenders, the Personal Blender and Smoothie Maker QB3001 has just one speed setting – and it doesn’t offer any predefined blending programs.",
    "Simple to use and affordable, the Ninja Personal Blender and Smoothie Maker’s small capacity is best suited to those who want to blend fruit and vegetables into drinks that they can take with them. With no way of adding ingredients while the blade is spinning, it struggles to produce perfectly emulsified condiments, such as mayonnaise.",
    "As mentioned, the Ninja Personal Blender and Smoothie Maker QB3001 is the company’s entry-level personal blender, which comes in at a price of $69.99 / £59.99. It’s available through Amazon, and in the UK it can also be purchased via Ninja’s website. It isn’t currently available in Australia.",
    "Ninja also offers the Nutri-Blender Pro with Auto-iQ, which is called the Ninja Blender with Auto-IQ in the UK. It comes with three programs that last for a predefined length, and is priced at $89.99 / £89.99.",
    "The Ninja Personal Blender and Smoothie Maker QB3001 is a compact blender that hardly takes up any room on a kitchen countertop, measuring 11.8 x 3.9 x 3.9 inches / 30 x 10 x 10cm. It’s lightweight, too, weighing just 2.6lb / 1.2kg, so you’ll have no problems removing it from a cupboard when you want to use it.",
    "Its 700W motor makes it one of the least powerful blending appliances that Ninja offers. That said, we were impressed by the Personal Blender and Smoothie Maker’s effectiveness when it came to blending fruits and vegetables and pulverizing ice and nuts.",
    "The QB3001 comes with two 16 fl oz / 470ml single-serve cups, and a blade assembly that screws onto the cup once the ingredients have been added. There’s just one speed setting, and there are no programs that offer a pre-defined blending time. It isn’t possible to add ingredients to the cup while the blades are spinning, so the blender struggles to make condiments such as mayonnaise, which require ingredients to emulsify.",
    "You’ll find two spouted lids in the box that can replace the blade assembly once you’ve finished blending, so you can take your drink away with you without having to decant it into another vessel first.",
    "The cups, lids, and blade assembly are all dishwasher-safe, which makes for easy cleaning, plus the blender comes with a booklet containing 10 recipes for inspiration.",
    "Considering the Ninja Personal Blender and Smoothie Maker QB3001 is the least powerful appliance the brand offers, we were impressed at how well it blended everything from fruit and vegetables to nuts.",
    "We started by making a banana, pineapple and spinach smoothie. The blender proved super-easy to use. Once we’d added the ingredients to the blending cup, we screwed on the blade assembly, and placed the container upside down onto the base. Pushing down on the canister started the blades spinning, while releasing the canister brought the appliance to a halt.",
    "The Personal Blender and Smoothie Maker QB3001 pulverized leafy spinach and fibrous pineapple together with the rest of the smoothie ingredients to create a nicely aerated, grit-free smoothie in 45 seconds. Since this blender doesn’t come with any timed presets, we checked on the smoothie’s status after 25 seconds, at which point it was still slightly grainy. As such, we continued to blend for a further 20 seconds. Our decibel meter registered 87.6db during this process, which is the same level of noise as experienced when standing 20 feet away from an automatic car wash when it's running.",
    "We were also impressed by its ability to blitz ice and grind whole hazelnuts. Both tests produced evenly crushed ingredients in fewer than 10 seconds – but our decibel meter hit 102db, which is equivalent to listening to music stored on your smartphone at full volume. As such, the Ninja Personal Blender and Smoothie Maker QB3001 is one of the loudest blenders we’ve tested. However, it’s bearable for the short duration the blender would be used.",
    "We were unable to make mayonnaise in the blender since there’s no way to add ingredients – in this case oil in a slow steady stream – mid-blend, with the blades still spinning. Also note that the blending cups don’t feature a pouring lip, since they’re designed to be taken with you, which means the blitzed ingredients often drip down the cup if you choose to decant them.",
    "Finally, to test for leakage, we filled the Ninja Personal Blender and Smoothie Maker QB3001 to max capacity and began to blend. We were pleased to find that there was no leaking at all.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Ninja Personal Blender and Smoothie Maker QB3001 price and availability",
    "7": "Design",
    "12": "Performance",
    "18": "Don’t buy it if…"
  },
  "links": {
    "best blenders": "https://www.techradar.com/best/best-blenders",
    "air fryers": "https://www.techradar.com/news/best-air-fryer",
    "juicers": "https://www.techradar.com/news/best-juicer"
  }
}