{
  "source": "https://www.techradar.com/reviews/urbanista-los-angeles",
  "title": "Urbanista Los Angeles review",
  "category": "audio-visual",
  "updated": "2021-11-11T18:15:44Z",
  "author": "simon-lucas",
  "summary": "The light fantastic",
  "verdict": "The Urbanista Los Angeles may not be the most complete headphones this sort of money can buy where audio quality is concerned, but they’re your only choice when it comes to solar-powered battery charging. For a lot of people, this will be more than enough reason to check them out.",
  "pros": [
    "Zesty, big-boned and entertaining sound",
    "Innovative charging system, epic battery life",
    "Well made and relatively compact"
  ],
  "cons": [
    "Slightly skewed sound",
    "Control app doesn’t do a lot",
    "Priced against some capable opponents"
  ],
  "article": [
    "If you want affordable, good-looking and lively sounding headphones, you should always consider Urbanista. But if you want noise-cancelling headphones that quite conceivably will never ever need charging from an outlet you can only consider Urbanista. For now, anyway.",
    "The Urbanista Los Angeles are based closely on the company’s very decent Miami over-ear headphones, but have a headband which features solar-cell material that draws power from any kind of light source. So where both convenience and eco-credentials are concerned, they’re untouchable. And even if you can’t get beneath a source of light for whatever reason, the battery life is humongous.",
    "Sound quality is good, if a little lop-sided - just like the Miami headphones, the Los Angeles are not shy where bass is concerned. And the price is considerable by Urbanista standards, bringing some very capable rivals into play. But, of course, not one rival has a charging system as satisfying as the one that features here.",
    "The Urbanista Los Angeles are on sale now for $199 / £169 / AU$349.",
    "Unless you count the special Swarovski edition of its Miami over-ear headphones, this is the most expensive pair of headphones Urbanista has ever released, and it means the Los Angeles are lining up against some very well-regarded opposition from acknowledged big hitters like Bose, Sennheiser and Sony.",
    "But then again, no alternative headphones have the unique specification of the Los Angeles, so perhaps ‘opposition’ isn’t quite the right word... Oh and it is worth checking Urbanista Paris as well, to get a bit of va va voom.",
    "One fairly obvious difference aside (and we’ll get to that soon enough), the Los Angeles are dead ringers for Urbanista’s Miami wireless headphones we reviewed earlier this year - except for the colorways (black or sand), which are nowhere near as bright as the Miami options.",
    "In fact, they’re based closely on the Miami both inside and out. So they’re a mercifully compact and discreet design by prevailing over-ear headphones standards, fitting quite snugly on all but the most petite heads, without getting all clampy and uncomfortable about it.",
    "Actually, the Los Angeles feel quite luxurious and indulgent: the earpads are plumply padded and softly tactile, as is the inside of the headband. Every contact point, in fact, is pleasant to the touch. The adjustment mechanism is sturdy, and the articulation of the earcups themselves is nicely damped.",
    "On the outside of the headband, though, the Los Angeles not only break from the Miami template but from the ‘every other pair of headphones’ template too. There’s a broad strip of Exeger’s ‘Powerflyte’ photovoltaic material running along its entire width, and it’s capable of drawing energy from light of any kind - sunlight, the light from a bulb, wherever.",
    "It’s absorbing light and trickle-charging the battery whether the headphones are powered on or not. Urbanista suggests an hour in worthwhile sunshine will translate to three hours of playback - obviously it depends on the weather where you are… but as long as you don’t go off to live in a cave or something, your headphones should never need charging from an outlet.",
    "(And if you do go to live in a cave, the Los Angeles have deeply impressive battery life figures of between 50 hours with noise-cancelling switched on and 80 hours with it switched off. So as long as you don’t stay in there indefinitely, you really should be fine.)",
    "Like the Miami, the Los Angeles feature Bluetooth 5 wireless connectivity (specification which falls into the ‘good’ rather than ‘great’ category) and a pair of 40mm full-range drivers doing the audio business.",
    "There are a smattering of physical controls arranged around the edges of the earcups - on the right earcup there are three buttons, each rather small and all too close together. They take care of ‘power on/off/Bluetooth pairing’, ‘volume up/down’, ‘skip forwards/backwards’, ‘play/pause’ and ‘answer/end/reject call’.",
    "The left earcup, meanwhile, has a USB-C input for charging (should it ever become necessary) and a ‘control’ button, the function of which can be specified in the Urbanista control app. Neither earcup features a 3.5mm socket, though - so there’s only one way to use the Los Angeles, and that’s wirelessly.",
    "The control app itself is bold and pleasantly graphic - but it doesn’t allow you to exercise all that much control. The one feature that’s front-and-centre is a big display that lets you know what’s happening with the battery (and sometimes, by extension, the weather). Is it charging or not? Depends entirely on where you are, really. A far better control option is available via Google Assistant or Siri, both of which can be used to adjust your playback hands-free.",
    "It’s been a while since Bluetooth 5 was the pinnacle of wireless connectivity, but it’s nevertheless more than capable of getting big hi-res audio files on board from the likes of Qobuz and Tidal.",
    "A Tidal Masters file of The Belle of St Mark by Sheila E. reveals almost all there is to reveal about the way the Urbanista Los Angeles go about things - and to a lesser or greater extent, it’s extremely (and unsurprisingly) reminiscent of the Urbanista Miami on which they’re so closely based. Which fundamentally means an energetic, front-foot, and just slightly overconfident presentation.",
    "It’s at the bottom of the frequency range that the Urbanista prove just slightly too pleased with themselves. Bass sounds are deep, impressively textured and detailed, properly controlled where the attack and decay of individual notes or hits is concerned, and pushed altogether too far forwards than is comfortable.",
    "As a consequence they put more pressure on the midrange than is ideal - which is a pity, because the Los Angeles are just as detailed and informative here as they are with the low end. There’s real nuance and character to the way the Urbanista deliver the vocal in this tune, but there’s an ever-present sensation that the singer is on the point of being overwhelmed by the bass sounds she’s attempting to project beyond.",
    "At least the highest frequencies don’t have to struggle against the tsunami of bass, which means all the bite and crunch of this recording’s treble is delivered in full, with a balance that’s just the right side of ‘aggressive’. Even if you like to listen loud (and the Urbanista can unarguably get loud), the top end shines without getting oppressive or hard.",
    "There’s a slight shortage of outright dynamism here too (which may be a by-product of the bass-heavy emphasis), so everything in a recording tends to happen at one level of intensity. Rhythmic expression is in slightly short supply, too. But on the plus side, the Los Angeles can organise a soundstage deftly, and have no problem where straightforward scale and attack are concerned.",
    "So if you prefer a big, bold and quite strikingly vivid presentation from a pair of headphones that seems straight from the ‘everything louder than everything else’ school, you should find plenty to keep you happy here.",
    "Switching on the active noise cancellation doesn’t impact on the overall sound of the Los Angeles too badly, and it most definitely deals with quite a bit of external sound. It allows the bass even more licence to trample over the midrange, though, and in the quieter moments you’ll hear a suggestion of counter-signal as the circuitry does its thing. And the fact that ‘ambient sound’ lets external sounds in but doesn’t reduce the volume of music at the same time makes it less useful than it otherwise would be."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Urbanista Los Angeles price and release date",
    "6": "Design and features",
    "16": "Audio performance",
    "24": "Don't buy them if..."
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Miami headphones": "https://www.techradar.com/reviews/urbanista-miami",
    "Urbanista Paris": "https://www.techradar.com/reviews/urbanista-paris",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "earlier this year": "https://www.techradar.com/reviews/urbanista-miami",
    "Tidal": "https://www.techradar.com/reviews/tidal"
  }
}