{
  "source": "https://www.techradar.com/reviews/adata-xpg-xenia-xe",
  "title": "Adata XPG Xenia Xe review",
  "category": "computing",
  "updated": "2021-02-12T07:12:30Z",
  "author": "joel-burgess",
  "summary": "Should Intel be leaving the laptop making to the lifestyle brands?",
  "verdict": "The XPG Xenia Xe from Adata is the first 15-inch laptop with an 11th Gen Intel CPU we’ve tested. It’s a decent Intel-built unit with new tech like Thunderbolt 4, a 4th generation PCIe SSD and a long battery life. It is, however, a little expensive, has an uninspired chassis design and misses out on the higher resolution screens you usually see on bigger professional devices.",
  "pros": [
    "15-inch display",
    "Fastest storage available",
    "Full work-day battery"
  ],
  "cons": [
    "Keyboard is small",
    "Not the best value",
    "Very vanilla design"
  ],
  "article": [
    "With the ongoing advance of AMD into the laptop processor space, and the loss of Apple's processor contracts, we’re not overly surprised that Intel is keen to start building some more of its own devices. The XPG Xenia Xe is the second 15-inch NUC to come from the blue team, but considering the processor manufacturer isn’t on top of its game in other areas of business, is it stretched too thin to make a successful laptop?",
    "If you’re keen on battery life, bigger screens and the fastest storage around then the XPG Xenia Xe should be up the top of your shortlist for sure. Lasting around 13 hours in 1080p movie playback, it’s one of the longer-lasting professional ultrabooks we’ve tested. It’s also one of the first 15-inch Full HD laptops to get an 11th generation Intel Processor.",
    "Both available models get a generous 1TB allocation of PCIe Gen 4 SSD storage that’ll read and write between 4,000 and 5,000MB/s. At around 1,000MB/s faster than any laptop storage we've seen before, it's a considerable jump over the last generation.",
    "The 11th generation Intel processors give the XPG Xenia Xe a solid base of general processing power that is up 10-20 percent on comparable 10th Gen chips. The new integrated Iris Xe GPU is the star attraction though, allowing playable frame rates on most modern games at 1080p when the settings are dialled right down to 'Low'.",
    "All-up the XPG Xenia Xe is a decent offering, but it’s asking for a bit of a premium compared to a number of its 13-inch competitors. If battery, screen size and speedy storage are the most critical elements for you then this is your perfect laptop, but for many these may not be enough of a drawcard to pull you away from brands you've been ogling for years.",
    "Intel is selling the pre-built NUC M15 to storage providers for customisation and rebranding, so the Adata XPG Xenia Xe i5 and i7 variations may not be the only Intel-built laptops you see in the local market this year.",
    "There are basically two variations of the Xenia Xe you can get your hands on, with both selling in the US and the more powerful iteration will be available in Australia too. Adata has no release plans for either in the UK at this time. The first XPG Xenia Xe has one of Intel’s i7-1165G7 CPUs, 16GB of RAM and an RRP of $1,799 (AU$2,599) while the other features a Core i5-1135G7, 8GB of RAM and comes in a little less at $1,599.",
    "The pricing strategy seems a little weird to us – seeing as you can get a tried and tested Dell XPS 13 (with a higher resolution screen and more portable overall design) for less. The XPG Xenia Xe does at least have a couple of things going for it like a bigger 15-inch screen and a more generous battery, but laptop makers often spout less than realistic battery life scores, so it’s a difficult angle to sell on – especially without much of a reputation in laptop manufacturing to back it up.",
    "The XPG Xenia Xe is a 15.6-inch FullHD professional Ultrabook that has a simple, squarish, aluminium chassis and an inoffensive overall layout. It certainly won’t be winning any design awards, but it looks just premium enough to take to a meeting.",
    "Both the i5 and i7 variants have a 15.6-inch Full HD screen, which was one of the first to arrive with Intel’s 11th generation Ultrabook processors. The larger screen didn’t have much immediate competition at launch, but it’ll only be a matter of months before companies release updates to their bigger screened Ultrabooks.",
    "Normally laptop vendors pair more powerful components with larger screened laptops since customers needing a larger display often require it to do more computationally intensive design or editing work, but the 11th Gen Intel CPUs combined with integrated Iris Xe GPUs are actually powerful enough to do a good portion of more demanding editing work – so it's not a bad Ultrabook processor to pair with a bigger screen.",
    "Unfortunately, it’s a pretty bog-standard 60Hz Full HD display that only just conforms to the sRGB color standards, so it won't actually be all that useful to visual creatives. So who is it for? XPG like to classify this device as ‘Gaming Lifestyle’, which means it’s attempting to sell it to a gaming market that aren’t ready to splash money on a laptop with a dedicated GPU. This would make sense if there wasn’t already a plethora of devices that did exactly this with names like Razer, MSI and Asus behind them.",
    "The keyboard’s keys are a little smaller than they needed to be, which makes them look a little odd and you've got to work a little more to get to them. While this 15-incher opts for a 10-key-less design, the keys at least have a decent level of resistance and were comfortable enough to type on over long periods (once you've acclimatised to the spacing). The trackpad on the other hand was soft and responsive, without much in the way of faults.",
    "One of the few areas where the XPG Xenia Xe is ahead of the game is in connectivity, with a solid array of ports and a full-size HDMI, a rare sight on modern Ultrabooks. The a HDMI 2.0 port is complimented by two Thunderbolt 4 USB Type-C connections, two USB 3.2 ports and 3.5mm headphone jack.",
    "The XPG Xenia Xe does a pretty good job on keeping it all under 1.5cm thick, but it is a 15-inch form factor, so it’s about 3 or 4cm wider and deeper than most of the initial 11th gen. offerings in 2021. It’s also roughly 400g heavier than this group of devices, with a total weight of 1.6kg.",
    "The Intel Core i7-1165G7 is no slouch and the XPG Xenia Xe is a pretty standard expression of this chip. It was a little behind the average in some general CPU benchmarks, but was better at media encoding tasks, which means you’re basically getting what you would expect.",
    "This processor is powerful enough to burn through basically any kind of office work and will even tackle design and photo editing tasks on the go pretty easily. The integrated Iris Xe GPU also adds a decent level of graphical capability to the equation, which means light visual effects work isn’t out of the equation and you should be able to do quick edits using more graphically-intensive software. Adata is keen to highlight the gaming capabilities, which will be on par with all the other devices using 11th generation integrated GPUs. The Intel Iris Xe is the first time playable 1080p frame rates on 'Low' graphics settings in modern games has been achievable using an integrated GPU, so we understand why vendors are keen for this element to be the first things spun out of the hype machine. This laptop seems to have been tuned (at least a little bit) specifically for gaming though, since it consistently delivered slightly higher frame rates than other devices with the same components.",
    "The XPD Xenia Xe features a Gen 4 PCIe SSD, which will boost the read and write speeds to between 4,000 and 5,000MB/s, which is roughly 30 percent faster than the last generation of already stupidly fast PCIe internal drives. Not all new premium laptops in 2021 offer one of these new drives so it’s definitely a bonus here.",
    "Battery life on this unit is another standout feature, netting over nine hours in PCMark 10 Work battery and 12 hours and 59 minutes during 1080p movie playback at 50 percent brightness. It’s still a long way off the MacBook Pro 13’s 19h 1080p movie playback using native movie players, but it’s more than you’d use in an average working day and lasts as long as you would reasonably expect from Windows Ultrabooks."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "8": "Design",
    "15": "Performance",
    "18": "Battery life",
    "19": "Don't buy it if..."
  },
  "links": {}
}