{
  "source": "https://www.techradar.com/reviews/grasshopper",
  "title": "Grasshopper review",
  "category": "computing",
  "updated": "2021-08-20T14:49:15Z",
  "author": "barclay-ballard",
  "summary": "Grasshopper delivers a decent VoIP offering for SMBs",
  "verdict": "A great choice for smaller companies that don't need advanced telephony solutins.",
  "pros": [
    "Fast setup",
    "Very attractive pricing plans"
  ],
  "cons": [
    "Lacking more advanced features"
  ],
  "article": [
    "Grasshopper may not have the big-name appeal associated with VoIP offerings by AT&T or Cisco but that doesn’t mean businesses should discount the service. In fact, smaller firms may decide that Grasshopper's competitively priced plans are exactly what they are looking for.",
    "Originally founded back in 2003, Grasshopper recently received major financial backing when it was acquired by remote access SaaS provider LogMeIn in 2018. The company has used this support to continue delivering top-notch products and has served more than 350,000 customers to date.",
    "A quick look at the Grasshopper blog makes it clear that the firm is targeting businesses that have been forced to enact remote working policies in response to the COVID-19 pandemic. During the crisis, many organizations relied heavily on VoIP platforms and video conferencing suites to maintain business continuity.",
    "For smaller companies that may not have already been paying for expensive digital solutions, the transition to remote or hybrid working may have been more challenging, which is where smaller (and cheaper) VoIP providers like Grasshopper come in.",
    "One of Grasshopper’s primary appeals is its simplicity. The brand ethos is best summarised, in its own words, that “Grasshopper helps you focus on your business.” The platform comes with a small number of essential features, which should keep smaller organizations happy but may leave larger firms in need of flashier options a little disappointed.",
    "Grasshopper also comes with an extremely fast and easy setup. Users simply select their service level, choose their numbers and extensions, download the app, configure their settings and that’s it. Among the features on offer are call forwarding, voicemail transcriptions and automated greetings, but many others, are absent. Video and audio conferencing is available via a third-party service. Still, businesses are unlikely to complain too much given the price.",
    "Unlike most VoIP services, Grasshopper offers its pricing plans at a flat rate. The prices quoted by the company are not per user, so for companies experiencing rapid expansion, the service can work out to be particularly affordable compared to its competitors.",
    "An online support center should help individuals solve the most commonly cited troubleshooting problems, and 24/7 US-based customer support is also available by telephone. The simplicity provided by Grasshopper should mean that there is less potential for anything to go wrong though.",
    "Ultimately, businesses will have to decide whether they need some of the more advanced telephony features that are offered by other VoIP providers or if Grasshopper has everything they require. This VoIP service is relatively simple - unashamedly so - but for some organizations that will be positive, not a drawback.",
    "Grasshopper ensures that simplicity is at the forefront of its VoIP offering right from the get-go. Installation is straightforward, with users simply selecting their desired service level, before choosing up to five local or toll-free numbers. The option of porting an existing number is also available.",
    "Users are then asked to download the Grasshopper app, which is available as either a desktop or mobile version, so users can remain contactable whether they are sat at their desk or on the move. Given that remote work has become increasingly popular of late, it is a huge benefit for employees to be able to access their work number via their smartphone, with callers and recipients being none the wiser.",
    "Once Grasshopper has been downloaded, it’s time for individuals to configure their settings. This shouldn’t be too troubling, regardless of whether you’ve decided to go down the mobile or desktop route, but a 24/7 customer support service is available should any difficulties arise. And that’s it. Grasshopper proudly states that users of its VoIP service should be up and running in just minutes.",
    "Adding a small amount of complexity, Grasshopper users can set up extensions - which will likely come in handy for slightly larger firms. For incoming calls, each extension can be announced through the Grasshopper system before the call is connected, but it is ultimately up to individual users to determine the specific configurations for each extension. For example, time restrictions can be applied to extensions, only allowing, say, weekday calls, and call forwarding criteria can also be applied. Of course, if you’re a sole trader or simply don’t want to bother with extensions, you can opt for the simple, single-number setup.",
    "Although Grasshopper talks extensively about its appeal to smaller businesses, it also claims that its service lets firms “communicate like a bigger company.” Although its feature set is largely focused on calling, there more than a few handy tools to choose from.",
    "For individuals that would rather use a single device for both business and personal calls, the Grasshopper app allows them to make and receive calls on a smartphone or computer, with call recipients presented with a business number - not a personal one. Given that more workers are away from their desks, this is a great way of remaining connected without having to carry a separate work phone around.",
    "Other features include the option of using pre-recorded messages as automatic greetings and call forwarding to ensure that important calls are sent to multiple phones to ensure they are not missed. If a call does go unanswered for whatever reason, voicemail transcription is available to give your employees a clear read-out over a computer or smartphone.",
    "Virtual receptionists are also available for businesses that want to add a more professional touch to their communications. Your virtual receptionist could be either a live human that may not be physically located in your office or an auto-attendant answering system. Particularly for businesses that want to save on labor costs, a virtual receptionist is a great way of directing callers, taking messages and handling greetings.",
    "Although Grasshopper’s aforementioned features are included as standard with its VoIP packages, the company also offers several add-ons. For example, Call Blasting is available for an extra $10 a month, which allows each line (up to a maximum of 15) to be called simultaneously, reducing waiting times and boosting customer satisfaction.",
    "There’s also a professional voice studio available at a cost of $75 per order, where professional voice actors will record slick greetings in either English or Spanish to amaze your callers. Extra numbers can also be purchased on a flexible basis without businesses having to change their plans.",
    "Overall, Grasshopper may not have some of the more advanced telephony features associated with other VoIP services like CRM integration, unified messaging, and video conferencing but the features it does have work well. For most smaller firms that make up the Grasshopper’s target market, the features it provides are likely to be sufficient.",
    "Unlike typical PBX phone offerings, Grasshopper's virtual phone service works on top of your current provider, so there’s no hardware required. As an app is the only thing needed to get set up, Grasshopper is suitable for a wide range of businesses - particularly those with a sizeable number of frontline workers.",
    "The company itself highlights a few key sectors that make up its customer base. The first is healthcare. Using Grasshopper, doctors, nurses, and administrative staff can connect more easily with patients, use automated greetings to direct them to the right department, and use call-management tools to answer more pressing concerns. In addition, custom schedules can be set up for on-call nurses and doctors depending on their work rota.",
    "Franchise owners, meanwhile, can use Grasshopper to ensure that their business continues to run smoothly. International extensions can be used to provide details around business hours and directions, as well as answer customer questions. A local number can also be used to connect with members of the public in your surrounding area, so no matter how large your franchise grows, it always feels local.",
    "Another industry that may benefit from Grasshopper’s VoIP solution is real estate. Employees in this sector are often out of the office - and may look after multiple areas within the same region. With Grasshopper, not only can you ensure that your agents are contactable at all times, but a local business number can be used to demonstrate your knowledge of the area. Customers looking for specific information can also have their call automatically forwarded to the right agent.",
    "Even for professionals that are usually sat at a desk, Grasshopper is worth considering. Consultants, for example, are usually office-based but they are often engaged in meetings and may be visiting client premises. With a VoIP solution, you can ensure that client communications are rarely missed - and when they are, instant responses can be customized to ensure that business is not lost. Plus, Grasshopper’s mobile and desktop apps allow you to switch between taking client calls from your desk or on the go, providing much-needed flexibility.",
    "As more industries allow remote working, having a business number tethered to a work phone will be seen as increasingly old-fashioned. Grasshopper demonstrates how employees from a number of sectors can benefit from being contactable wherever they are.",
    "The main point of difference regarding the pricing of Grasshopper’s VoIP solution is that customers are not charged on a per user basis. Instead, there are three plans to choose between: Solo Partner, and Small Business.",
    "The Solo package comes in at $29 a month and includes one number and three extensions, the Partner offering costs $49 a month and boasts three numbers and six extensions, while the Small Business plan is $89 and includes five numbers and an unlimited number of extensions.",
    "The three plans make it relatively easy for businesses to decide which package is right for them, and there’s the option of signing up for a free seven-day trial (no credit card required). The aforementioned prices make Grasshopper one of the most affordable VoIP providers on the market - particularly for firms that only boasts a small number of employees.",
    "The flexibility of Grasshopper’s pricing is also likely to appeal. In addition to the three payment plans, customers can purchase add-ons for extra features - and a limited number of third-party services can also be tacked on. It’s worth keeping in mind, however, that paying for these extra services (particularly for multiple users) can add up to a significant cost. For businesses that are likely to outgrow the Grasshopper offering, it might make more financial sense to simply pay for a more extension VoIP solution.",
    "With decent customer support and a flat monthly fee, Grasshopper offers a very useful VoIP service for smaller firms. Larger businesses may require a broader feature list - but for organizations that value simplicity and affordability - there aren’t many better VoIP options out there than Grasshopper."
  ],
  "headers": {
    "30": "Our overall verdict"
  },
  "links": {
    "VoIP": "https://www.techradar.com/news/best-voip-service",
    "AT&T": "https://www.techradar.com/reviews/atandt-business",
    "Cisco": "https://www.techradar.com/reviews/cisco-ip-phone-6800-7800-8800-series",
    "LogMeIn": "https://www.techradar.com/reviews/logmein-pro-review",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone"
  }
}