{
  "source": "https://www.techradar.com/reviews/eufy-lumos-smart-bulb",
  "title": "Eufy Lumos Smart Bulb review",
  "category": "smart-home",
  "updated": "2021-07-06T10:00:00.326Z",
  "author": "michael-hicks",
  "summary": "These bulbs keep things simple",
  "verdict": "The Eufy Lumos White Smart Bulb is a solid option for Alexa or Google Home users looking to set up smart home routines. It gets respectably bright without requiring too much wattage and responds quickly to commands, but you won't find the same tuning or color settings as other bulbs.",
  "pros": [
    "Google Assistant and Alexa support",
    "Bright, warm output",
    "Fast response time over wi-fi"
  ],
  "cons": [
    "No color or temperature adjustment",
    "Not compatible with HomeKit",
    "Can be too large for some lamps"
  ],
  "article": [
    "Eufy, by Anker is a brand well-known for tech peripherals such as USB cables and power banks, but it's also turned its sight to smart home devices. As well as offering some of the best robot vacuums and home security cameras, Eufy has also dipped its toe in the smart lighting waters.",
    "The Eufy Lumos Smart Bulb is a basic, reliable LED bulb for people just diving into smart homes. Like most Eufy products, it can rival the market leaders - in this case Philips Hue and LIFX - with affordable, simple-to-use devices.",
    "It has clear instructions on how to set it up, you can use Alexa or Google Home commands and routines to control it, and it doesn't require a hub to use it. Beyond that, it doesn't have any traits that would make it stand out against other great smart bulbs.",
    "We're reviewing the Eufy Lumos White, which lacks temperature or color settings found on other bulbs; you're restricted to brightness settings. At 800 lumens max brightness with a warm yellow tint, it's best suited for lighting smaller rooms while saving on your energy bill.",
    "Surprisingly tall for a bulb at 5.5in/ 14cm, the Eufy Lumos may not fit inside some lamps with a short harp, so be sure to measure yours first. Otherwise, they're responsive and decently affordable, with only some minor app hiccups to worry about.",
    "The Eufy Lumos Smart Bulb will set you back $40 for a two-pack of bulbs – though you may find them on sale for around $30 on sites like Amazon. It's currently only available in the US. For context, two tuneable white smart bulbs from Philips or TP-Link will cost you about $30 at full price.",
    "We're specifically reviewing the Eufy Lumos White (T1011) bulb; Eufy also sells the Eufy Lumos Tunable – which lets you change the temperature of the bulb from warm to cool, as well as the brightness – and Eufy Lumos White & Color – which adds '16 million color options' beyond white. Our review's bulbs are much more limited in features but also more affordable.",
    "As of publication, Eufy's stock of its smart bulbs appears to be limited. We can find the Lumos White bulbs for sale on some sites, but the Tunable and Color versions have proven elusive.",
    "Eufy Lumos White bulbs have a fairly generic design, with a classic spherical top that slots into a white base with 'eufy Lumos White' etched into it. Other bulbs may have more unique designs – like the Nanoleaf Essential's rhombicosidodecahedron shape or LIFX's flat cylindrical form – but Eufy's looks perfectly acceptable and probably will hide behind your lampshade regardless.",
    "A more pressing concern: most smart bulbs we've seen are about 4.5in /11.5cm tall, but the Eufy Lumos bulbs measure 5.5in/ 14cm. If your lamp has a restricted space for the bulb, it may not fit; in fact, I had to buy a new lamp to test this bulb because it truly wouldn't fit inside my current ones. Even if your lamp doesn't have a harp, the bulb may poke above the lampshade, which you may not appreciate.",
    "We'll also note that we've only seen the Eufy Lumos on sale with an E27 screw base. Anyone who needs a Bayonet model likely should look elsewhere.",
    "The Eufy Lumos bulbs are simple to set-up through the EufyHome app - just replace any existing light bulb with the Eufy version and go to your wi-fi settings menu. You'll find your Eufy bulb among your nearby networks, tap it, then go back to the app and wait for it to sync. The bulb also comes with a detailed manual that describes how to connect them to Amazon Alexa or Google Assistant, and some sample features and commands to get better usage out of them. We certainly found it made the setup process painless.",
    "Hitting a max 800 lumens of brightness with just 9 watts, the Eufy Lumos matches the industry standard: we've seen several popular 9.5W bulbs from Philips, Wyze, Hive and Sengled that also hit 800lm. Of course, Philips also sells a 1,600lm white bulb, while Nanoleaf manages 1,100lm with about the same power draw.",
    "In more real-world terms, the Lumos at max power is impressively bright. It can add decent lighting to a small bedroom; or, reduced to lower brightness, it can comfortably illuminate a corner of the room. But to truly light up a large living room, you may want to consider an alternative with more juice.",
    "We'll also reiterate that, because its unusual height could make it poke above a lampshade, it's more likely that the bulb itself will be fully visible. At max brightness, it's just bright enough that your eyes won't like it if you stare directly.",
    "This model is set to a color temperature of 2700K, or 'Soft White' according to Eufy. Some people may prefer a 3000K setting that's more neutral white – or a bulb that lets you switch between them. Personally, we really liked the light's warmth, but want to emphasize that this comes down to personal taste.",
    "Regardless of the brightness setting, the bulb never got overly hot. Touch the bulb, and you'll hardly feel any heat coming off of it. LED bulbs rarely do, but we appreciate that the Eufy Lumos appears to run efficiently. Eufy claims the bulb will only cost you $1.08/year when used 3 hours per day, which we hope (but cannot confirm) is accurate for the sake of our energy bills.",
    "The EufyHome app lets you switch the Eufy Lumos smart bulbs on, even when you're not at home, and adjust the brightness anywhere from 1% to 100%. This change occurs almost instantaneously after selecting the new brightness level, which is very satisfying; other bulbs that rely on Bluetooth often take a couple of seconds.",
    "You can also assign favorite brightness settings so you can activate it with just one tap or schedule periods where the light alternates between on and off every minute, ostensibly to make people think you're home.",
    "They also offer integration with Amazon Alexa and Google Assistant, but not HomeKit, so you can set up any Alexa or Google Assistant routines you want with your new smart bulbs.",
    "On occasions, we noticed that we would change the brightness and nothing would happen; then, after a few seconds, the brightness icon would switch back to the original level before we changed it. This happened in EufyHome, Alexa and Google Home, so it's clearly something to do with the bulb itself, not the apps. It mostly seemed to happen when we changed the brightness multiple times in a few seconds, and never happened when we issued a voice command. We'd argue this connection glitch isn't serious or widespread enough to avoid buying the Lumos.",
    "First reviewed June 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Eufy Lumos Smart Bulb price and availability",
    "8": "Design",
    "12": "Performance",
    "17": "App",
    "21": "Don't buy it if..."
  },
  "links": {
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "best robot vacuum": "https://www.techradar.com/news/best-robot-vacuums",
    "home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Philips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "LIFX": "https://www.techradar.com/reviews/lifx-smart-light-a19a60",
    "great smart bulbs": "https://www.techradar.com/news/best-smart-lighting",
    "Nanoleaf Essential": "https://www.techradar.com/reviews/nanoleaf-essentials-a19-e27-smart-bulb"
  }
}