{
  "source": "https://www.techradar.com/reviews/amazon-eero-6",
  "title": "Amazon Eero 6 review",
  "category": "computing",
  "updated": "2021-12-06T00:13:38.188Z",
  "author": "cliff-joseph",
  "summary": "Another great mesh router from Amazon",
  "verdict": "It’s not the fastest mesh system around, but the Eero 6 is an affordable Wi-Fi 6 upgrade for larger homes that have a lot of computers and smart devices.",
  "pros": [
    "Affordable Wi-Fi 6 mesh system",
    "Easy to set up and use",
    "Covers homes up to 5,000 sq.ft"
  ],
  "cons": [
    "Creates a single merged network (2.4GHz/5.0GHz)",
    "Parental controls and security features require subscription",
    "Only one Ethernet port for wired connections"
  ],
  "article": [
    "Eero isn’t a well-known name compared to the likes of Netgear and Linksys, although the company’s mesh Wi-Fi systems have been available for a few years now. However, it is now owned by Amazon, so you’ll probably see the Eero name popping up at the top of the list if you’re searching for a new mesh system online.",
    "Mesh Wi-Fi systems can be both expensive and complicated to set up, so the aim with the new Eero 6 is firstly to destroy capital letters - it insists on calling the devices ‘eero’ - and also to provide an affordable and easy-to-use upgrade for people who want to improve their home Wi-Fi. And, rather than being ‘version 6’ as the name suggests, the Eero 6 is the first model to introduce the new Wi-Fi 6 technology (aka 802.11ax).",
    "The most notable feature of the Eero 6 is simply that it’s a lot less expensive than most of its Wi-Fi 6 rivals, costing just $279/£279/AU$499 for a three-piece kit that contains a primary router and two ‘extenders’, which together provide dual-band Wi-Fi 6 capable of covering homes up to 5,000 sq.ft in size.",
    "Alternatively, for smaller homes up to 1500 sq.ft, you can just buy the router on its own for £139/US $129/AU $229. It’s only rated as ‘AX1800’, though - which means 802.11ax wi-fi with a top speed of 1800Mbps.",
    "There are plenty of faster mesh systems available - including the tri-band Eero 6 Pro - but the Eero 6 still stands out as being one of the most affordable mesh systems to offer Wi-Fi 6, and that 1800Mbps speed should still be fast enough for basic web browsing and streaming video on most home broadband connections.",
    "The new Eero 6 has a compact, pod-like design that measures just 90mm wide and deep, and 57mm high, so it’s easy to set them all up without taking up too much space.",
    "The main router - referred to as the ‘gateway’ in the Eero app - has a USB-C port on the back for its power supply, along with two Gigabit Ethernet ports for wired network connections.",
    "Just remember that one of the Ethernet ports will need to be connected to your existing modem or router in order to use your Internet connection, so you just have one Ethernet port available for a wired connection on a laptop or games console.",
    "The two ‘extender’ units don’t have Ethernet at all, which is a little disappointing, but is an understandable compromise in order to keep the price down (US customers do have the option of buying a kit with three routers, giving you two Ethernet ports each, although that brings the price up to $349.00).",
    "Amazon has clearly got its eye on the smart-home market, as the Eero supports both Alexa and the Zigbee networking system, so if you have existing smart devices that use the Amazon Home app - such as the popular Echo speakers - it’s easy to transfer them across to your new Eero network.",
    "Since our original review, the Eero 6 has been updated to support Apple’s HomeKit, making it a much more useful device for people with lots of Apple devices in their home.",
    "The Eero app is straightforward and easy to use. There’s a built-in speed test that allows you to check the performance of your new network, and even to monitor the data usage of each device on the network. You can also create a guest network for visitors, and set up schedules to control Internet access for different family members.",
    "However, that ease of use comes at a cost, and other aspects of the app can prove frustratingly limited. The app creates just a single network that combines the 2.4GHz and 5.0GHz frequency bands, and while that helps to keep the initial set-up nice and simple, it may also deter more experienced users who prefer to have separate networks on those two bands.",
    "There’s no ‘QoS’ option - quality of service - that can give priority to devices, such as a games console, that need maximum performance, and while the app does dangle additional features under your nose for parental controls, ad-blocking and security, it turns out that these features require an additional subscription costing either $2.99 per month ($29.99 per year) or $9.99 per month ($99.00 per year), depending on which features you require.",
    "It doesn’t take long to get started with the Eero 6, as the Eero app for iOS and Android can use Bluetooth on your mobile devices to connect to each Eero unit and guide you through the set-up process (the only minor oversight is that the app does assume that you already have Bluetooth turned on).",
    "And, as the app automatically creates a single network that combines the 2.4GHz and 5.0GHz bands you merely need to enter a single name and password in order to quickly set up the new network.",
    "The Eero’s relatively low price means that it’s not the fastest mesh system - in fact, the information provided by Eero simply states “best for Internet speeds of up to 500Mbps” - which is a bit confusing, as that actually refers to the speed of your broadband connection rather than the speed of the Eero itself.",
    "But, as mentioned, the Eero 6 actually supports a maximum speed of 1800Mbps, which is more than adequate for my 100Mbps broadband service. It’s also important to remember that Wi-Fi 6 is about capacity as well as speed, and the Eero 6 is designed to stream data efficiently to up to 75 different devices all at once, which should keep even the most gadget-crazy homes happy for years to come.",
    "The Eero 6 proved perfectly capable of handling our 100Mbps broadband connection, even in the dead-spot in our back office where I normally rely on a PowerLine adaptor to provide a wired network connection for my office iMac. It recorded download and upload speeds of 100Mbps and 11Mbps, which is the maximum that our service supports, and those speeds remained consistent for devices in the same room as the primary Eero router, and also in the back office with one of the secondary extenders.",
    "Steam downloads were also rock solid, maintaining a steady speed of 12MB/s in both rooms. Admittedly, you’re still paying a bit of a premium for the advanced features of Wi-Fi 6, but if you’re looking for an affordable wi-fi upgrade that is suitable for larger homes with lots of connected smart devices then the Eero 6 fits the bill without costing you a fortune.",
    "You might also want to check out the Asus ZenWiFi AX (XT8) review"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Design and features",
    "14": "Performance and getting started",
    "20": "Don’t buy it if..."
  },
  "links": {
    "Mesh Wi-Fi systems": "https://www.techradar.com/news/best-wireless-mesh-routers",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Asus ZenWiFi AX (XT8)": "https://www.techradar.com/reviews/asus-zenwifi-ax-xt8"
  }
}