{
  "source": "https://www.techradar.com/reviews/good-access",
  "title": "Good Access business VPN review",
  "category": "computing",
  "updated": "2021-07-01T08:41:06Z",
  "author": "liam-barker",
  "summary": "An affordable cloud VPN for small to medium-sized business",
  "verdict": "Good Access is an excellent service for small businesses looking to equip their employees with a static IP address using a cloud VPN. The prices are quite reasonable and there's even a free trial available.",
  "pros": [
    "Good value",
    "Static IP standard with all plans",
    "Loads of integrations",
    "Multiple team members can use the same package"
  ],
  "cons": [
    "Bandwidth caps",
    "No Linux support",
    "Limited locations available"
  ],
  "article": [
    "The day-to-day running of businesses is widely conducted using online systems for vital communication between team members as well as storing and organizing important, sensitive information. Naturally, keeping these systems secure and protected is crucial, so finding the best business VPN is a priority.",
    "In our review we'll discuss the features, services, and customer support offered by GoodAccess, which is a cloud VPN gateway that provides static IP addresses to its users. It was developed by Samohyb—a Czech-based VPN solutions company that has been operating since 2009.",
    "Samohyb offers a free 14-day trial for GoodAccess, which you can request by filling out a form consisting of your basic personal/contact details and the number of people your company employs.",
    "If you want to purchase GoodAccess, Samohyb organizes pricing into three plans based on company size, offering the choice of monthly or annual payment installments—with monthly savings if you opt for annual. Prices begin at $1.90 per user.",
    "Currently priced at $29 per month or $228 annually, the Team plan is cheapest and caters for up to 10 team members. It provides 1 TB of monthly bandwidth and basic support. Meanwhile, the Business plan (which currently costs $69 per month or $588 annually) caters for up to 30 team members. It provides 2 TB of monthly bandwidth and priority support.",
    "Finally, the Enterprise plan is the biggest and most expensive—costing $199 per month or $2,388 annually. It’s suitable for businesses of up to 100 team members and consists of 6 TB of monthly bandwidth, as well as 24/7 premium support.",
    "GoodAccess is available to use on your computer (Windows, Mac), and as a mobile app for iOS and Android.",
    "Essentially, GoodAccess is a cloud VPN gateway that provides your online business systems (such as business servers/databases) with a dedicated static (i.e., unchanging) IP address.",
    "This unique address is automatically whitelisted for every business system you have, meaning your team can privately and securely access the information they need from anywhere in the world.",
    "Finally, you can use the main dashboard to add your business systems, as well as invite team members to join GoodAccess.",
    "Samohyb emphasizes that GoodAccess is user friendly and can start protecting your online business systems in five minutes. Here, we evaluate some of its main, stand-out features.",
    "On the GoodAccess website under Integrations, there’s an extensive list of popular and widely used business/online systems (from WordPress to Magento), for which you can (in some cases) directly download plugins to enable integration with GoodAccess.",
    "If this sounds a little unfamiliar, the Good Access website provides step-by-step instructions (for all the systems listed) to guide you through the integration process.",
    "GoodAccess has a user-friendly dashboard for fast and clear navigation, which is particularly useful in the beginning stages while setting up as you can easily add to/manage your team members list, as well as your systems list.",
    "On the left-hand side of the screen, you can readily access other fundamental features like Access Control (which enables you control over how accessible a given system is to your team), the Download function, and Integrations.",
    "Samohyb advertises GoodAccess as the “first affordable SASE (Service Access Service Edge) solution for small and medium businesses worldwide.” Incidentally, SASE essentially means a security framework that enables users to securely access their cloud-based online systems.",
    "Judging from the three plans, GoodAccess seems very much geared towards providing financially accessible cloud VPN protection for small- to medium-sized businesses.",
    "GoodAccess is designed to cater for the way in which many contemporary businesses operate, meaning it supplies encryption for those occasions where team members need to access the internet on an unsecured network, perhaps in a café or airport terminal.",
    "On all the GoodAccess plans (Team, Business, and Enterprise), you can choose from over 18 different worldwide locations (from New York to Tel Aviv) to virtually situate your private gateway access. Samohyb claims to be adding even more locations, based on customer requests.",
    "Furthermore, the most extensive and priciest plan—Enterprise—currently enables you to select from a further six locations, such as Paris and Sydney.",
    "You can use GoodAccess for iOS, Android, Windows, and Mac—meaning you can widely access all your protected business systems with one click.",
    "Samohyb provides its address on the Contact section of the GoodAccess website. Alternatively, you can send the team a message by filling out a short form, which is found underneath the address.",
    "A more in-depth way to receive guidance is by booking a free online session with GoodAccess Guru, which can be done on the website. It’s especially useful for helping with any initial setup problems, such as issues with whitelisting or system integration plugins.",
    "There’s other online support as well. GoodAccess customers (but particularly Enterprise customers) have access to 24/7 support via Samohyb’s live chat or IT ticketing system.",
    "On the Good Access website, Samohyb states that its VPN solutions are used by over 10,000 individuals, and over 1,000 teams. Despite this, it’s difficult to source many customer reviews.",
    "Good Access provides some customer feedback on its website, under References. There’s overall praise for GoodAccess’ user-friendly control panel, its low latency (ability to process lots of data quickly), strong encryption, and easy-to-use access control settings.",
    "We sourced two customer reviews from Capterra and both were positive about the overall user-friendliness, affordability, and reliability of GoodAccess. Although a problem with initial whitelisting is mentioned, it’s stated that this issue was quickly resolved with the help of GoodAccess Guru.",
    "Compared with the starting price per user per month of NordVPN Teams, GoodAccess’ equivalent is $5.10 cheaper. However, NordVPN Teams provides security features GoodAccess lacks, such as a VPN kill switch and two-factor authentication.",
    "Like GoodAccess, Encrypt.me is a VPN service that’s good for small businesses. It’s easy to use and offers similar features, such as a free trial and accessibility across all devices. That said, Encrypt.me notably offers more server locations—over 70 across 40 countries.",
    "Good Access is an excellent starting point for small businesses considering investing in a VPN service for their employees. The fact that Samohyb charges a flat monthly rate for multiple users is certainly a plus and will end up costing your organization mush less than paying per user. However, competing business VPN solutions with more features such as NordVPN Teams may be a better fit for larger outfits. Still though, Good Access offers a free trial which means your organization can test it out to see if it's a good fit for your business before committing to a monthly or even annual plan."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "How it works",
    "10": "Features",
    "21": "Support and customer experience",
    "27": "The competition",
    "29": "Final verdict"
  },
  "links": {
    "best business VPN": "https://www.techradar.com/vpn/best-vpn-for-business",
    "GoodAccess": "https://www.goodaccess.com/",
    "Team plan": "https://www.goodaccess.com/pricing",
    "Business plan": "https://www.goodaccess.com/pricing",
    "Enterprise plan": "https://www.goodaccess.com/pricing",
    "cloud VPN": "https://www.techradar.com/vpn/what-is-cloud-vpn-and-why-is-its-popularity-on-the-rise",
    "Access Control": "https://www.techradar.com/news/best-access-control-systems",
    "Capterra": "https://www.capterra.com/p/208155/GoodAccess/",
    "NordVPN Teams": "https://www.techradar.com/reviews/nordvpn-teams",
    "Encrypt.me": "https://www.techradar.com/reviews/encryptme"
  }
}