{
  "source": "https://www.techradar.com/reviews/echo-flex",
  "title": "Amazon Echo Flex review",
  "category": "smart-home",
  "updated": "2021-06-23T11:31:21Z",
  "author": "cliff-joseph",
  "summary": "The Amazon Echo Flex is a mini marvel",
  "verdict": "Don’t worry about the weak, tinny speaker - the Echo Flex combines a bargain-basement price tag with compact design and useful connectivity features to provide a truly tempting introduction to voice-control technology. And, at this price, you can afford to buy one for every room too!",
  "pros": [
    "Compact and affordable",
    "Dual-band Wi-Fi",
    "Bluetooth and 3.5mm connector",
    "Expandable via USB port"
  ],
  "cons": [
    "Poor sound quality",
    "Limited streaming services",
    "Amazon is listening"
  ],
  "article": [
    "The Amazon Echo Flex is the most affordable way to bring the benefits of Alexa into your home. The compact devices plugs into a mains power outlet, and takes up no more space than some of the smallest smart plugs.",
    "Let’s be clear from the start. It’s not a particularly good smart speaker – it’s far too small for that – but the low cost of the Echo Flex, along with its ingeniously compact and convenient design, means that it can bring Amazon’s Alexa voice-control technology into a wider range of homes than ever before.",
    "There are no cables involved at all, so it’s really handy and convenient if you want to quickly set it up in a bedroom, kitchen or bathroom where you might not want to have cables trailing around and getting in the way. That plug-in design also makes it easy to just unplug the Echo Flex and move it into another room if you want to.",
    "The Amazon Echo Flex also has a Micro USB port on the bottom, which can be used to charge your phone or connect third-party accessories such as a Smart Clock or night light, bringing even more functionality to the Echo Flex.",
    "The only downside is you can only use one attachment at once – so if you have a motion-detecting sensor or night light, you’ll need to switch it out for this one.",
    "The Amazon Echo Flex will set you back $14.99 / £14.99 making it the most affordable member of the Echo speaker range, beating out even the Echo Dot. At the price you could easily afford to have a handful of Echo Flexes (Flexii?) set up and controlling devices all over your home. Unfortunately, the Echo Flex isn't available in Australia at present.",
    "The Echo Flex measures just 72mm high and 67mm wide, and protrudes just 40mm from the wall once it’s been plugged in. Despite its low cost, the Echo Flex supports dual-band Wi-Fi, so it can connect to your home router on either 2.4GHz or 5GHz frequencies. There’s a little pair of microphones nestling at the top of the front panel, with a blue LED sitting between them, which lights up when you recite the ‘Alexa’ mantra to let you know that it is listening.",
    "Right below the LED are two buttons - one of which turns off the microphones when you want a little privacy, while the second button allows you to activate Alexa without saying the name itself (although, of course, you still have to speak to the Echo Flex to get it to do anything, so we’re not entirely sure what the point of that is).",
    "The final detail on the front of the Echo Flex is a little grille for what Amazon refers to as its ‘mini-speaker’. You can tell from the tinny voice that emanates from the speaker grille when you first plug it in that the sound quality isn’t exactly great. It’s fine if you just want to check the weather forecast, but asking Alexa to play some music results in an anemic plinky-plunk sound that reminds me of those old Stylophones from the 1970s (millenials can just Google ‘David Bowie Stylophone’). As such, don't go buying the Flex for its music-playing capabilities, but instead, consider it as a supplementary smart home voice controller.",
    "The Echo Flex installation process is relatively simple - the Alexa app smoothly guides you step-by-step, in no time at all. The app initially uses Bluetooth to pair with the Echo Flex and set everything up, so all you need to do is to enter your Wi-Fi password in order to connect it to your home network. The app then offers advice on ‘things to try’ so that you can get used to Alexa’s wide variety of voice commands, and asks if you want to create a ‘voice profile’ so that Alexa will only respond to your particular voice, or those of other members of your family.",
    "The real strength of the Echo Flex lies in its connectivity. If you want to boost the sound quality for listening to music then you can simply connect the Echo Flex to an external speaker using either Bluetooth or the 3.5mm audio connector tucked over on the right-hand side of the device. We had no trouble connecting the Echo Flex to a portable Libratone Zipp speaker, and it can also use Wi-Fi to connect to multi-room speaker systems from Sonos or other manufacturers (although the instructions for connecting to Sonos speakers do state that this particular feature is still an ‘open beta’, and seems to focus on a handful of models, such as the Sonos Beam soundbar).",
    "And, of course, the Alexa app can be used to control a variety of other smart devices too, including Philips Hue lights, Hive thermostats, a wide range of security cameras, and even Eufy robot vacuum cleaners. But the final stroke of genius is the little USB port on the bottom of the Echo Flex, which provides 7.5W power output that can be used to charge a smartphone or other mobile device, or to connect additional accessories such as the night-light or motion-sensor that Amazon has already developed in conjunction with a company called Third Reality.",
    "These accessories only cost £14.99/$14.99, so the Echo Flex could easily be used to build a low-cost home security system that monitors all the key locations within your home.",
    "The only minor criticism here is that the Alexa app doesn’t support a very wide range of music streaming services. As you’d expect, the app can connect to Amazon Music, along with Spotify and Apple Music, but a Tidal account and the music stored on an iPad required having to switch back to the limited range and sound quality of Bluetooth.",
    "The poor quality of the internal speaker is almost irrelevant, as the real strength of the Echo Flex is that it provides an incredibly affordable and convenient way of bringing the Alexa voice-control technology into your home - or extending an existing Amazon system into even more rooms.",
    "The plug-and-play design is admirable in its simplicity, whilst also providing a useful range of connectivity features - including the ability to connect it to a decent external speaker if you want to. Some people may prefer to resist Amazon’s privacy-pilfering practices, but if you don’t mind having Alexa listening in on your daily routine then the Echo Flex is the perfect introduction to the voice-controlled future."
  ],
  "headers": {
    "5": "Price and availability",
    "6": "Design",
    "9": "Performance",
    "14": "Verdict"
  },
  "links": {
    "smart plug": "https://www.techradar.com/news/best-smart-plugs-and-switches",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Smart Clock": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0874DN1P7%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7050436474076953000-20",
    "night light": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FAll-New-Night-Amazon-Third-Reality%2Fdp%2FB07VDPY2RL%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8420254251654693000-21",
    "Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review",
    "Libratone Zipp": "https://www.techradar.com/reviews/libratone-zipp-2-review",
    "Sonos": "https://www.techradar.com/reviews/sonos-one-review",
    "Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "Philips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "Hive thermostats": "https://www.techradar.com/reviews/hive-active-heating-2-review",
    "security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "robot vacuum cleaners": "https://www.techradar.com/news/best-robot-vacuums",
    "Third Reality": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FAll-New-Motion-sensor-Third-Reality%2Fdp%2FB07VF43BG1%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-7644685443617323000-21"
  }
}