{
  "source": "https://www.techradar.com/reviews/razer-blade-15-2020",
  "title": "Razer Blade 15 (2020) review",
  "category": "computing",
  "updated": "2021-06-23T17:42:07.359Z",
  "author": "jackie-thomas",
  "summary": "Gaming in style with the Razer Blade 15",
  "verdict": "The Razer Blade 15 (2020), while expensive, is more than capable of annihilating any PC game you throw at it, all the while being stylish and well-built enough to actually justify that extra expense for anyone looking for a luxurious gaming product.",
  "pros": [
    "Powerful",
    "Plenty of ports",
    "Nice design",
    "Top-mounted speakers"
  ],
  "cons": [
    "Expensive",
    "Short battery life"
  ],
  "article": [
    "The Razer Blade 15 has become one of the cutting edge gaming laptops on the market, thanks to its pairing of very powerful mobile components with stunning design. With that pairing, it’s no wonder that some consider it the \"MacBook Pro of gaming laptops\".",
    "The Razer Blade 15 2020 continues in the same tradition, hiding inside its Ultrabook-like chassis RTX Super graphics cards and the best Intel Comet Lake-H processors. And, that elegant design manifests most noticeably in an aluminum unibody design (that the line has been known for) that might remind some of a MacBook Pro. That’s not to mention it having one of the best trackpads found on a Windows laptop as well as two large top-mounted speakers.",
    "Like all the previous models, the Razer Blade 15 (2020) does not come cheap. Its base configuration will set you back $1,599 (£1,699, AU$3,399), for an Intel Core i7, an Nvidia GeForce GTX 1660 Ti and a 256GB SSD. Our beast of a review model will cost much more, however, costing a whopping $2,999. Still, if you're after a device that can dominate in the latest AAA games and do it in style, this laptop may be worth it.",
    "If you're looking for a gaming laptop that looks like a premium product, and not like an edgy plaything, the Razer Blade 15 is still the best example of what that could look like - that is if you have the cash for it.",
    "The Razer Blade 15 (2020) is available right now, starting at $1,599 (£1,699, AU$3,399). That intro price will get you an Intel Core i7 processor - which every model has - along with an Nvidia GeForce GTX 1660 Ti, 16GB of RAM and a 256GB SSD.",
    "But, of course, because this is a device that is meant to be one of the top gaming laptops on the market, you can configure this thing to your hearts content, with up to an RTX 2080 Super, a 1TB SSD and a 4K OLED touch display. However, you will have to pay for that privilege, as that configuration will cost you an eye-watering $3,299 (£3,349, AU$6,549).",
    "Now, you can definitely get this level of hardware for less, just take a look at our current favorite powerhouse, the Gigabyte Aorus 17G, which you can get with equivalent hardware for $500 (about £379, AU$690) less, coming in at $2,799 (about £2,270, AU$4,390).",
    "What you're really paying for with the Razer Blade 15, however, is luxury. While the design of the Gigabyte device isn't bad by any stretch of the imagination, the Razer Blade 15 is a gaming laptop you will actually want to show off in public. It's become kind of a cliche at this point to call Razer the Apple of PC gaming products, but that comparison is definitely apparent here.",
    "While we're busy comparing Razer to Apple, the Razer Blade 15 kind of serves as a \"what would the MacBook Pro look like with diverse ports and no Touch Bar?\" On either side of the keyboard you have these giant speakers - which is already a point in the Razer Blade 15's favor.",
    "This isn't, like, a new thing for the Razer Blade, but we just have to reiterate that it does wonders for audio quality. The Razer Blade speakers are still nowhere near as good as a MacBook Pro 16's but they do manage to sound listenable for when you just want to put on some tunes while getting some work done.",
    "We also have to praise just how many ports remain on the Razer Blade 15. You get two Thunderbolt 3 ports, three USB-A ports, a dedicated charging port that's reverse-able, and a dedicated HDMI. Razer is obviously in the business of selling peripherals, and we're happy to report that you won't need to live that #donglelife to use any of them. You can easily plug in a gaming headset, mouse and a keyboard.",
    "Not that you'll even need a keyboard. Don't get us wrong, there's nothing quite like playing the best PC games on a mechanical keyboard, but the chiclet keys on the Razer Blade 15 feel amazing. Key travel is more than deep enough, and the spacing is basically perfect, even for keys on the periphery of the keyboard. We would like to see bigger up and down arrow keys, but that's such a minor complaint that we're willing to look past it.",
    "The touchpad is similarly fantastic - spacious, sensitive and actually feels good to click down. Touchpads on Windows 10 devices are starting to be good, but the Razer Blade is still the best example of a touchpad on a Windows 10 device.",
    "Tying all of this together is the premium unibody design of the Razer Blade 15. Completely built of aluminum, the chassis feels excellent, and despite its thinness, manages to have a display with very little flex. Plus, even when you're typing or gaming vigorously, there is absolutely no flex in either the keyboard deck or the area around the trackpad. The Razer Blade 15 definitely feels like a premium device which kind of dulls the pain of shelling out so much cash. Now, if only more gaming laptop manufacturers could put as much love into their design as Razer does here.",
    "The model Razer provided us with doesn't have the ultra-fancy 4K OLED touch display, instead opting for a 1080p display with a whopping 300Hz refresh rate. But it's not like the display doesn't look good - quite the opposite.",
    "At 300 nits of brightness and hitting 111% of the sRGB color gamut, the Razer Blade 15 display is perfect for some PC gaming, especially when you take that fast refresh rate into consideration. Plus, with the Core i7 processor and RTX 2080 Super, you'll definitely actually be able to hit that 300 fps on pretty much any major esports title.",
    "And, finally, while there is no fingerprint scanner on the Razer Blade 15, you do get Windows Hello facial recognition, thanks to the IR-equipped webcam.",
    "Because the Razer Blade 15 is equipped with the Intel Core i7-10875H and an RTX 2080 Super, it has no problem absolutely chewing through all the latest and best PC games at max settings.",
    "Even one of the hardest games to run right now, Metro Exodus, managed to hit more than 60 fps with ray tracing turned off and everything else at max. But, even with ray tracing enabled, the laptop was easily able to manage 50 fps, which is more than playable, even if it isn't at the golden 60 fps standard.",
    "Even in raw 3DMark benchmarks, the laptop holds its own against laptops that are way thicker, even if it falls behind something like the Gigabyte Aorus 17X - extra portability does come with some sacrifices.",
    "A PCMark 10 score of 5,227 serves to illustrate why these laptops are so popular with folks that don't play a lot of games, too. Tasks like photo and video editing, and even straight-up spreadsheet work, goes a lot faster when you have this level of hardware at your disposal.",
    "It probably won't come as too big a surprise that the Razer Blade 15 doesn't exactly last all day on battery power. With the level of hardware on offer, not to mention the super-fast display, there's a lot of stress being put on the battery at any time.",
    "And, in the PCMark 10 battery test, which simulates a wide variety of everyday tasks, this is reflected in the paltry 5 hours and 3 minutes of battery life. It is enough to get some work done away from your charger, but it's unlikely that you're going to be able to work on the Razer Blade 15 all day without also packing your charger.",
    "Video playback fares slightly better, with the laptop lasting 7 hours and 31 minutes looping a locally stored 1080p video. That number will go down a bit if you're streaming through Netflix or something, but it does mean you can sit and binge for a little while before the Razer Blade dies on you.",
    "Because this is a Razer device, and the green-themed gaming manufacturer obviously wants you to use its peripherals and accessories, the Razer Blade 15 comes with Razer Synapse pre-installed.",
    "On desktop, this software is simply a place to adjust things like lighting and macro assignments, but it serves a different purpose on the Razer Blade 15. On this laptop, you can use it to adjust performance by jumping between different power modes and fan speed profiles.",
    "What's excellent about it, though, is that you can create a seperate profile for both on battery and when you have the laptop plugged in, so you can go all-in on performance when you need to, and just have something nice and quiet for a meeting without having to worry about digging into settings."
  ],
  "headers": {
    "4": "Price and availability",
    "8": "Design",
    "17": "Performance",
    "21": "Battery life",
    "24": "Software and features",
    "27": "Don't buy it if..."
  },
  "links": {
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "Intel Comet Lake": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "Nvidia GeForce GTX 1660 Ti": "https://www.techradar.com/reviews/asus-rog-strix-gtx-1660-ti-oc",
    "Gigabyte Aorus 17G": "https://www.techradar.com/reviews/gigabyte-aorus-17g",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Windows Hello": "https://www.techradar.com/how-to/software/how-to-use-windows-hello-1301455"
  }
}