{
  "source": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
  "title": "iPhone 11 Pro Max review",
  "category": "phones",
  "updated": "2021-12-03T12:32:01Z",
  "author": "gareth-beavis",
  "summary": "It's the biggest and best 2019 iPhone, but does it offer enough?",
  "verdict": "The iPhone 11 Pro Max was the best that Apple could cram into a smartphone in 2019 - the high-end screen, powerful speakers, upgraded processor all support the huge upgrades to the camera. However, this phone is really for the Apple fan or someone that really needs that extra lens or a touch more battery life - the iPhone 11 feels like it offers better value.",
  "pros": [
    "Night mode really shines",
    "Lovely back",
    "Reams of power"
  ],
  "cons": [
    "Design isn't updated",
    "Lack of clear innovation beyond the camera",
    "Most expensive iPhone out"
  ],
  "article": [
    "The iPhone 11 Pro Max was the largest and most powerful phone Apple ever created, taking the very best of its technology and combining it with an upgraded design that includes a new matte back, three cameras designed to rival the best from Samsung, Google and Huawei, and an enhanced battery for greater endurance.",
    "The iPhone 11 Pro Max was, until the iPhone 12 Pro Max came along in 2020, and now that's been outclassed by the iPhone 13 Pro Max released alongside the iPhone 13, iPhone 13 mini, and iPhone 13 Pro. The newest Pro Max phone has some improved specs and cameras alongside a tweaked design from the iPhone 11 Pro Max, but 5G aside it's only incremental updates and not a revolution.",
    "Digging deeper into the iPhone 11 Pro Max camera, we were impressed most with the Night mode: the iPhone 11 Pro Max is capable of turning night almost into day, but doing so while preserving plenty of detail.",
    "We found the newly-added ultra-wide camera to be handy when you want to squeeze in more of a scene (although we didn’t find we needed it that often) and for improving the background defocus effects… although it still wasn’t perfect in our testing.",
    "The design of the iPhone 11 Pro Max will be familiar to most, with the same design language as the previous two models (the iPhone X and iPhone XS), although the matte back feels nice in the hand. The 'Max' size won’t appeal to all, but it does facilitate the large and impressive 6.5-inch OLED display, which offers a brilliant cinematic experience, both visually and through the upgraded stereo speakers.",
    "The camera bump on the rear of the phone feels a little sharp and takes up a lot of space, although if you’re right-handed it stays out of the way when you're going about your daily tasks.",
    "Apple promises that the iPhone 11 Pro Max’s battery will last five hours longer than the XS Max from the previous year, and that claim is borne out in our tests - it particularly excelled when playing back HDR video on the phone, and the 20-hour battery life for multimedia seems accurate.",
    "In day-to-day use we found that this is just about a 24-hour smartphone (assuming you sleep for a portion of that time), and the fast charger that (finally) comes in the box gives you around 20% in 15 minutes, and a full charge in just an hour and a half.",
    "With iOS 13 on board - and now an update to iOS 15 - the Pro Max feels more refined than previous models, and tweaks to the accuracy and range of Face ID make it simpler to use every day, with things like opening a notification when the phone is placed flat on a desk made much easier.",
    "The raw performance of the iPhone 11 Pro Max also impressed, although we did encounter some slowdown in the camera app; however, if you're looking to edit video on the go (and don’t forget this phone can shoot 4K at 60 frames per second, and do it well) then you’ll enjoy the extra grunt on offer.",
    "Overall, the iPhone 11 Pro Max is a real step forward, and was the most advanced iPhone at the time. However, when thinking about what’s truly new here, we weren’t able to single out much beyond the improved camera (especially Night mode) and the slightly upgraded cinematic experience.",
    "If you want to save some money, we’d suggest checking out the iPhone 11 - while we constantly found little nuggets of impressive performance throughout our testing of the 11 Pro Max, we couldn't shake the feeling that this is really only a phone for the Apple fan who wants the best of everything, with no compromises. And for those fans, there's now the iPhone 13 Pro Max or even the iPhone 12 Pro Max if you can find it.",
    "Want to know more? Read on to see our in-depth testing of Apple’s high-end smartphone.",
    "The iPhone 11 Pro Max will likely be reduced in the Black Friday deals so it’s worth looking at the best iPhone Black Friday deals out there. We’ll be conducting a re-review in the future. However, we’ve updated references within our review to highlight new features that have emerged since our tests to give you a better idea of what you might be buying.",
    "The iPhone 11 Pro Max was announced on September 10, 2019 and it came out on September 20 in the US, UK, Australia and a variety of other markets around the globe.",
    "It's no longer sold directly by Apple now that the iPhone 13 range is out, but it's still fairly easy to get from third-party stores. That said, the price might be a sticking point as it was the most expensive iPhone out there at launch and it's still among the priciest now.",
    "Yes, it rivals the cost of some MacBooks in certain territories, but that’s not really a fair comparison - these are different products with different specifications, designed to do very different things. However, it does illustrate how expensive the iPhone 11 Pro Max is.",
    "The iPhone 11 Pro Max price starts at $1,099 / £1,149 / AU$1,899 for the 64GB model. Storage capacity then jumps to 256GB, with an asking price of $1,249 / £1,299 / AU$2,149.",
    "It then goes all the way up to $1,449 / £1,499 / AU$2,499 for the most expensive 512GB model - so if you're not rich enough to swim regularly in a pool of money, it's probably time to get saving.",
    "You’ll have noticed the difference in cost between the UK and US - where previously Apple has been matching the dollars and pounds price tag for its iPhones, this time it's a little different.",
    "In the United States, the standard price of the iPhone 11 Pro Max is the same as that of the phone it succeeds, the iPhone XS Max, but it's risen in the United Kingdom, which is certainly going to irk some buyers there.",
    "Looking for a great iPhone 11 Pro Max deal? Check out the links below for all the best options.",
    "We don’t usually get into assessing the camera so quickly in our reviews, but the main change in 2019’s iPhone range is to the imaging quality on offer.",
    "In terms of hardware, the key difference is the addition of the ultra-wide camera, making it three cameras on the rear of the phone.",
    "These sit proud from the back of the iPhone 11 Pro Max, with the glass square surrounding them matching the color of the phone itself, which helps to minimize the visual impact of three prominent black holes on the rear.",
    "What you’ve got here are a ‘normal’ wide-angle lens, a telephoto lens, and a new ultra-wide one. The telephoto option zooms you 2x closer to your subject, and the ultra-wide-angle lens enables you to cram twice as much of the scene in front of you into the frame.",
    "This is great if you’re trying to get a shot of a group of friends or an animal, but can’t move further back or closer - the iPhone 11 Pro Max will allow you to crop in or pull back without having to move.",
    "All three cameras pack 12MP sensors, which is pretty standard for most smartphones these days, allowing for a good balance between pixel size (to capture more light) and resolution (for capturing plenty of detail).",
    "Video recording has also been improved, with the Pro Max now able to capture 4K at 60 frames per second (fps). This means you’re getting smoother footage thanks to more information being captured, but it’s worth remembering that this will fill up the storage on your iPhone that much quicker.",
    "There's a lot that can be said about the iPhone's - or any modern smartphone's - camera these days, as they pack in so many features, and on the whole you'll struggle to take a poor-quality snap with any of them.",
    "That means any brand trying to make a market-leading cameraphone needs to fill it with features, and that's what Apple has tried to do here.",
    "Night mode",
    "The first is Night mode - previous models from Apple have failed to capture truly impressive photos in the gloom, and other brands have stolen a march here, with Samsung, Huawei, and particularly Google leading the way, offering phone cameras that can almost turn night into day through advanced post-processing of images.",
    "Apple's new Night mode certainly brings it into the conversation - in our eyes, it's the single biggest reason to buy a new iPhone. You'll need to hold the phone steady, or brace it or mount it on a tripod, but if you do you're rewarded with the ability to take pictures with detail that even your eyes can't see.",
    "Depending on the light levels (and whether you're using a tripod or not) the iPhone will ask you to hold still for between 2-5 seconds normally – however, you can manually extend this up to 30 seconds (if the iPhone is in a tripod or leant against a wall) to get ‘fully bright’ scenes.",
    "The results were sometimes staggering - the levels of sharpness and brightness the iPhone can achieve using Night mode have to be seen to be believed.",
    "We say the results were sometimes staggering, because if you introduce any motion the whole picture is ruined. This means that if you're trying to snap some friends dancing, it's not going to work at all, and you'll need to turn off Night mode to get any kind of sharpness (although the pictures are still fairly bright).",
    "Better portrait mode",
    "The other upgrade to the static camera is to Portrait mode: not only is it better at figuring out the outlines of the person, animal or other subject that you want to keep sharp, it's also now able to work at a 'normal' distance, as well as zoomed in as on previous models, thanks to the extra sensor being able to pick up more information about depth.",
    "The results are pretty good, especially when you're snapping people in well-lit, contrasting scenes - in fact, get such shots right and the images can be stunning. You can play with the different lighting modes on offer to hide blemishes, or use the new High Key Mono option to create a more ethereal, stylized picture.",
    "However, when taking some images, hair recognition was still a problem, and the iPhone 11 Pro Max struggled to get the head of a cat fully sharp. Taking pictures of objects should work better, but we found that generally these were a little fuzzy around the edges too.",
    "However, the overall quality of photos, especially compared to the iPhone XS Max of last year, is brighter and sharper as you'd expect. The ultra-wide camera is nice to use if you remember it's there, but the results were slightly distorted in areas, despite Apple's best efforts to solve this with image processing.",
    "Snapping between the camera modes wasn't always smooth, especially with the ultra-wide-sensor juddering a little, and often we'd turn on the camera and be met with a blank preview that only some mode-switching could fix.",
    "We've actually skipped over some of the 'normal' camera mode results of the iPhone because they're just as good as last year - images are generally bright, in focus and full of detail and color. Apple's snaps are less saturated than those from the cameras of some rival brands, and blow up well, displaying lovely levels of clarity.",
    "In the video mode too, things are improved - our sense is that the 4K, 60fps mode is more of a headline feature than a really useful one, but if you're a serious photographer or videographer looking to buy this phone (as the name of the iPhone 11 Pro Max would suggest) then you'll want such features; the detail is richer and - crucially - the exposure is more balanced, meaning you can create better-looking movies.",
    "This feature is really only something that will appeal to the social media elite, those wanting to take truly head-turning footage with an iPhone, and with the onboard editing suite allowing you to alter the color and filters of the entire video directly on your device, there's a lot to enjoy here.",
    "One thing we didn't enjoy was the use of the word 'Slofies' in Apple's marketing - these are just slow-motion videos that can now be captured with the front-facing camera, and you shoot them on all three of the new iPhones.",
    "The results are fine - most users will likely find them entertaining and share-worthy - but it's that name that grates.",
    "Apple might not have changed the design of the iPhone 11 Pro Max on the front (compared to its predecessor, the XS Max) but on the rear things are much improved: there’s a new matte glass back that feels noticeably different in the hand - it’s much less prone to smudges and fingerprints, and feels like an upgrade.",
    "The rest of the design is very similar to what we’ve seen from Apple in recent years: the notch remains, the sides are curving stainless steel and the bottom of the phone houses a Lightning connector and two speaker grilles (for symmetry - only one actually fires sound outwards).",
    "It’s large in the hand, sure, but not overly so - if you’ve used the Plus or Max phones of recent years from Apple you’ll find the 11 Pro Max more than manageable day to day.",
    "The main new design element is one we’ve already talked about: the camera bump on the rear of the phone. It’s sharp on the edges, as it’s made by milling the glass down and rolling it into the rear of the phone. Be warned: don’t put this phone in your pocket with another device, as the bump can easily scratch another screen.",
    "Ultimately, the design of the iPhone 11 Pro Max is pretty much identical to that of the iPhone XS Max - to the point where we managed to factory-reset the wrong phone during the testing process (much to our loud annoyance).",
    "The iPhone 11 Pro Max colors are attractive: midnight green, space gray, silver and gold. The dark green is easily the most attractive in our mind, and the most obvious statement you can make to announce ‘People of the city, I have BOUGHT A NEW iPHONE!’",
    "Although you’ll probably then want to put it in an iPhone 11 Pro Max case to protect it, because it’s really expensive and you don’t want to be explaining to your other half that you’ve ruined it in a week’s time.",
    "Aside from the camera, the iPhone 11 Pro Max screen (we can’t get over how infuriating that name is to write) is one of the main selling points for this high-end, expensive phone.",
    "What you’re getting is 6.5 inches of screen real estate, with an OLED panel that’s once again been refined by Apple. It features True Tone technology to better match the ambient lighting conditions (altering the white balance depending on the lighting situation you’re in) as well as a fluid screen – although not quite as fluid as the higher refresh rates we’ve seen on the iPad Pro, for instance.",
    "The new OLED screen seems to have more of a yellow tinge when you’re viewing white scenes or looking at photographs – these tints aren’t present when images are viewed on a computer screen, for example, so it appears to be and issue with the calibration of the device.",
    "This tint is also noticeable when the 11 Pro Max is held next to the iPhone XS Max from 2018 – but it’s slight, and images don’t look bad when viewed in isolation.",
    "One of the key upgrades here is the ability to play Dolby Vision content - it might not sound like much of a step up from HDR10 (the normal version of high dynamic range playback most phones use to punch up the dark and light parts of the scene and make everything more visually appealing), but it does make a difference.",
    "Watching films feels more immersive - you can see more detail, and overall the video playback is far more cinematic. That’s because the iPhone can usually only display 800 nits of brightness (the metric for how bright the screen can get), which is still pretty good - but when playing a Dolby Vision film things get even more impressive (up to 1200 nits, according to Apple).",
    "If you’ve not got anyone around you, that cinematic feel can be improved by playing sound out of the speakers - Apple has created a virtual surround sound setup, and while it’s not as good as hearing the same thing through a decent pair of headphones, the sound does feel like it’s moving around your ears.",
    "Again, it’s not a new thing for the smartphone industry, but it does show that Apple is still working to offer the best-possible media experience all these years after the release of the iPod.",
    "Apple made a big claim about the improvements to the iPhone 11 Pro Max battery life, pointing to the fact that it would be able to last for five hours longer than the iPhone XS Max.",
    "The reason for this is curious - that’s a big boost in terms of the size of the power unit, without affecting the thickness of the device. Could it be that Apple was intending to unveil the reverse wireless charging feature that was rumored in the build-up to the iPhone 11 launch, but wasn’t able to get it working to the necessary degree?",
    "Well, whether that conspiracy theory is true or not, the battery life on the iPhone 11 Pro Max is strong indeed, and here’s how we fared on the third day of testing...",
    "Taking the iPhone off charge at 7pm, we watched a Dolby Vision-enabled movie for nearly two hours on auto brightness, before using the phone to navigate us home for around 50 minutes (streaming music over Bluetooth at the same time); we also did some messaging and tried to pair a Garmin watch before going to bed just before midnight, at which point the phone was down to around 62%.",
    "Overnight, things were quiet and the standby mode only lost 5-6% battery over seven hours, meaning we started the day with over 50% battery left.",
    "A hard day of testing, which included playing games, watching streamed video, testing the camera and running benchmarks (the latter option there being particularly hard on the battery life) saw the iPhone 11 eventually expire just before 6pm (we didn't turn on battery-saving mode).",
    "That’s a pretty impressive performance, and not an achievement we’d have expected based on the performance of the iPhone XS Max last year - so it seems that Apple’s claims of a more powerful battery are indeed true.",
    "When it comes to powering up this phone, you’ve got two options: there’s wireless charging (which we urge you to invest in: get a wireless charger for the home and office, if you have one, and you’ll never have a battery worry again), or the fast charger in the box.",
    "We tested the iPhone 11 Pro’s charging capability from absolutely flat, and it was rapid indeed: after just 15 minutes it was nearly at 25%, more than enough to get you somewhere in a pinch. The full charge took just 90 minutes, so getting the fast charger in the box certainly makes the high cost of the 11 Pro Max a little more bearable.",
    "Out of the box, the iPhone Pro 11 Max runs iOS 13 but it updates to iOS 15.",
    "iOS 15 offers new FaceTime features with a focus on making it easier to connect to people, while improving the audio and visual quality. 3D audio gives the impression that your recipients are in the same room as you. Voice isolation now focuses on your voice only, and blocks out any other ambient noise. There's also Wide Spectrum, which focuses on you and the environment around you.",
    "There's also SharePlay where you can share music, watch TV shows and movies, alongside sharing your screen, so you can show a recipient how you use a certain app.",
    "Messages also sees substantial improvements with notifications now easily hidden through Focus which recommends which apps you might want to hide at certain times of the day. It's a souped up Do Not Disturb essentially.",
    "Face ID has been improved too: not its accuracy as such, but in terms of the field of view the camera can take in. While the iPhone 11 Pro Max’s front-facing camera isn’t any better at picking up faces than the model from last year, it’s easier to unlock it when sitting at your desk - we didn’t need to pick up the phone to read a message as much as we did with 2018’s iPhone XS Max.",
    "If you’re someone who finds yourself often flipping between Wi-Fi networks or Bluetooth connections, a long press in the relevant toggles in Control Center (those options you get when you drag down from the top-right of the iPhone 11 Pro Max screen) will allow you to choose the network you want.",
    "You’ll notice we said ‘long press’ not ‘hard press’ there - where previous high-end iPhones have used 3D Touch, enabling users to prod the screen harder to open up other menus or fire up the camera, for instance, that technology isn’t used in the new iPhone 11 range.",
    "Instead you’ve got an upgraded haptic engine, where the rumbles under the finger feel even more like a mechanical button when activated, and a long-press system whereby holding your finger on an option will enable other menus.",
    "This feels intuitive very quickly when you start using the iPhone 11 Pro Max, although it does get confusing when you're trying to rearrange icons on the homepage - you’ll need to select from a menu or wiggle your finger to start moving things around.",
    "In terms of raw performance, the iPhone 11 Pro Max is the most powerful iPhone on the market - and one of the most powerful smartphones too.",
    "If you take things down to the raw stats, a quick flick through Geekbench 5 shows a score of 3420 - that makes the 11 Pro Max around 10% more powerful than the iPhone 11, and more than 20% better than the iPhone XS Max from last year.",
    "We believe the Pro handsets have the most RAM of any iPhone, so it makes sense that the overall benchmarking scores are higher.",
    "But these are just numbers - what about the actual performance of the iPhone 11 Pro Max in day-to-day use? Well, you’ll struggle to get to a point where apps start to slow down when you're opening and closing them - you can fire up any number and be able to instantly start using them. The 11 Pro Max is slick under the finger, to say the very least.",
    "The camera is the only area where we’ve seen slight issues with speed: it takes a second to load the app (and as we’ve mentioned, it can sometimes freeze), and when you're taking pictures the ultra-wide camera preview, which shows the zoomed-out shot outside the standard frame, doesn't appear instantly when the shutter button is pressed.",
    "Loading a photo to edit takes a second or two as well, as does saving some of the image manipulations - while we appreciate that there’s a huge amount of processing going on here, we would have expected things to be a little snappier, rather than having to watch a spinning progress wheel appearing from time to time.",
    "There were also occasions where scrolling through a downloaded film to get to a particular scene froze the footage, which was annoying when we were trying to find a brighter scene to test the quality of the display.",
    "However, in general the power of the iPhone 11 Pro Max does extend to its media capabilities. We’ve already talked about the image quality for movies, but the sound quality - even on streaming services like Spotify - is impressive; the sound through a decent pair of headphones felt rich and strong, with more detail in the audio than you might expect from some smartphones.",
    "You might also want to check iPhone 12 Pro vs iPhone 11 Pro.",
    "First reviewed: September 2019"
  ],
  "headers": {
    "0": "Two-minute review",
    "14": "iPhone 11 Pro Max release date and price",
    "22": "Camera",
    "48": "Design",
    "55": "Display",
    "63": "Battery",
    "72": "iOS 13, iOS 14, iOS 15 and performance",
    "89": "Don’t buy it if…"
  },
  "links": {
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "best iPhone Black Friday deals": "https://www.techradar.com/black-friday/black-friday-iphone-deals-2021",
    "MacBooks": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review",
    "smartphones": "https://www.techradar.com/news/phone-and-communications/mobile-phones/20-best-mobile-phones-in-the-world-today-1092343",
    "4K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "cameraphone": "https://www.techradar.com/news/best-cameraphone",
    "iPhone 11 Pro Max case": "https://www.techradar.com/best/best-iphone-11-cases",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-11",
    "wireless charger": "https://www.techradar.com/best/best-wireless-chargers",
    "iOS 13": "https://www.techradar.com/news/ios-13-release-date-features-and-everything-you-need-to-know",
    "iPhone 12 Pro vs iPhone 11 Pro": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-11-pro"
  }
}