{
  "source": "https://www.techradar.com/reviews/samsung-the-terrace",
  "title": "Hands on: Samsung The Terrace review",
  "category": "televisions",
  "updated": "2021-10-01T11:24:59Z",
  "author": "henry-st-leger",
  "summary": "Can this outdoor TV truly brave the elements?",
  "verdict": "Samsung The Terrace is clearly one of the highest-specified outdoor TVs out there, and with Samsung’s smart TV platform and connectivity behind it, it could be a smart buy for those after a good garden or balcony screen.",
  "pros": [
    "Weatherproof screen",
    "QLED panel",
    "Handy accessories"
  ],
  "cons": [
    "Minimal audio",
    "Expensive",
    "Have to wall-mount"
  ],
  "article": [
    "Samsung The Terrace is the first outdoor TV to come from the world’s biggest TV maker, and it’s pretty notable for that reason. This isn’t just a tick-box weatherproof screen that won’t get wrecked if you’re watching football in the rain; it’s also an acknowledgement from Samsung that people like to use their devices outside of traditional living room arrangements – as with the best outdoor projectors too.",
    "We’ve seen Samsung make headway in the situational flexibility of its screens, with lifestyle televisions such as The Frame and Samsung Serif, but making sure a QLED screen is up to the task of braving the elements is something else altogether, and it comes with its own host of problems.",
    "With The Terrace, though, it looks like these problems are relatively well addressed.",
    "Samsung The Terrace is available in only three sizes: 55-inch, 65-inch, and 75-inch. So you won’t get a compact little screen to nail into the side of your shed, but for those wanting to install (with some professional help, Samsung recommends) a capable QLED display into your home’s back wall, with visibility for more than one person, this is the way to do it.",
    "The US model starts at $3,499 / £3,999 / AU$5,199 at a 55-inch size, going up to $4,999 / £4,999 / AU$3,999 for the 65-inch and $6,499 / £6,499 / AU$9,499 for the 75-inch.",
    "Samsung The Terrace looks an awful lot like a regular Samsung TV, just a little bit thicker. The outer bezel and casing have to keep out the worst of the elements, after all, and that means Samsung has opted for a hefty casing that hugs the screen along its rear and edges.",
    "You’ll find a small selection of inputs and HDMI ports at the back, though they won’t be regularly accessible. In order to keep the casing sealed and weather-secure, you’ll want to connect crucial cables during installation (again, probably with a professional) before the rear of the television is sealed in place, hiding those inputs from either yourself or a sudden downpour.",
    "This TV is designed to be wall-mounted too, and you can purchase an additional wall bracket accessory to ensure some flexibility in the exact position of the screen. You can’t, however, place it on a TV stand.",
    "When we tried out The Terrace for ourselves, it was on an outside balcony, with a little cover built over the screen, which is probably a good decision where possible. The screen has an IP55 rating – meaning it can resist dust, rainfall, or even a head-on splash from a hose – but more extreme weather conditions could still cause damage, so some form of cover may be sensible if it’s out in the open.",
    "The Terrace does come with a waterproof cover packed into a handy bag, though, which we imagine sensible TV owners will want over the screen whenever it’s not in use. It even comes with a pocket to stash the remote – though this clicker has a marginally higher level of water resistance (IP56), in case you’re more out in the open than your screen is.",
    "Samsung The Terrace comes with the same Tizen interface as you’ll find on all new Samsung TVs, from The Frame and Serif to flagship 8K TVs or even its ultra short throw projector, The Premiere.",
    "Tizen is a great operating system, packing in broad app support, a clear tile-based icon system on the home screen, and support for voice assistants such as Alexa and Bixby. A dynamically changing ‘Recent’ box in the far-left corner cycles between recently used apps and TV channels, while all Samsung sets come with Samsung SmartThings – which allows your TV to act as the center of your connected home.",
    "A Samsung rep tells us they expect most users to install the TV within the reach of home Wi-Fi for TV streaming, too, rather than relying too much on plug-in devices – all the more reason to have decent app support and a nice, clean UI.",
    "While we only had a short while with The Terrace, its 2,000 nits of brightness are very apparent, ensuring even midday outdoor viewing is powered with a decent blast of light from behind – helped by the Full Array backlighting system, rather than the more meagre edge-lighting used in indoor The Frame models.",
    "Picture settings will vary that brightness output though. While we’d usually try to scare you away from the Dynamic mode, its high contrast images and all-out brightness may serve you best on a sunny day – for a dark evening, though, the Movie mode may be the best-looking option. There’s also an anti-glare layer covering the panel which should help to prevent too much reflection.",
    "It’s worth noting that the built-in speakers output a meagre 20W, which is in line with a standard indoor smart TV. Given you won’t have your living room walls for sound to bounce off, though, you may be at risk of losing even the small impact of these speakers – and there’s a reason Samsung suggests buying the IP55-rated outdoor soundbar accessory, which will set you back an addition $1,199 / £999. This 210W, three-channel speaker has a lot more heft to it, and will be a better bet for group gatherings, whether you’re listening to a Hans Zimmer score or joining in the cheers of a sports match on this outdoor screen.",
    "Samsung The Terrace is clearly one of the highest-specified outdoor TVs out there, and with Samsung’s smart TV platform and connectivity behind it, it could be a smart buy for those after a good garden or balcony screen.",
    "This isn’t an all-weather device, though, and it seems worthwhile using the waterproof cover when not in use, or even trying to keep the screen under a ceiling or awning to give some partial protection from the elements. If rain isn’t spattering the screen and clouding the image onscreen, that can only be a plus, too."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "10": "Smart TV",
    "13": "Picture quality",
    "15": "Audio performance",
    "16": "Early verdict"
  },
  "links": {
    "outdoor TV": "https://www.techradar.com/news/should-i-buy-an-outdoor-tv",
    "best outdoor projectors": "https://www.techradar.com/best/outdoor-projector",
    "The Frame": "https://www.techradar.com/news/should-i-buy-samsung-the-frame-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "ultra short throw projector": "https://www.techradar.com/news/should-i-buy-an-ultra-short-throw-projector",
    "The Premiere": "https://www.techradar.com/reviews/samsung-premiere-lsp9t-projector"
  }
}