{
  "source": "https://www.techradar.com/reviews/halfords-carrera-impel-im-2",
  "title": "Halfords Carrera Impel im-2 review",
  "category": "fitness",
  "updated": "2021-11-02T12:42:44Z",
  "author": "rob-clymo",
  "summary": "The Carrera Impel range offers e-biking for those on a budget",
  "verdict": "Everyone in the UK knows Halfords – it’s the go-to solution for many people looking for an off-the-shelf bike. Like every other company in the business of selling two-wheelers, it's now entered the burgeoning e-bike market, and its latest adult's electric bike offering is the Carrera Impel, which comes in a couple of variants. This is a no-frills meat-and-potatoes e-bike, which might be short on thrills in the design department, but does tick the right boxes if you’re looking for a solid, battery-powered experience. Build quality is generally good, while the bike itself is very rideable thanks to Shimano gears and Tektro stopping power on the im-2 model we tried. While it might leave a little bit to be desired on the looks front, the understated appearance of the Carrera Impel is actually part of its charm. It’s not too heavy either, unlike many e-bikes, and delivers a decent experience across the ride spectrum. That makes it perfect for everyday commuting through to longer treks our into the countryside. We like it.",
  "pros": [
    "Quality Shimano gearing",
    "Beefy Tektro brakes",
    "Not too heavy"
  ],
  "cons": [
    "Looks cheap and cheerful",
    "Rudimentary power delivery",
    "No mudguards included"
  ],
  "article": [
    "If you’re on the lookout for a hybrid-style e-bike that won’t break the bank, but delivers simple-but-effective battery-powered assistance, then you could do a lot worse then the Halfords Carrera Impel.",
    "With a price that starts at just over £1,000 (about $1,400 / AU$1,800) it’s affordable compared to many rivals and, despite a few compromises on the quality front, comes with a very decent array of component parts on the im-2 version we’ve been trying. Gears are from Shimano, while brakes are Tektro. The fit and finish is generally pretty good while the weight of the Carrerra Impel isn’t bad either.",
    "Admittedly, the paint scheme and graphics keep the e-bike in the second division, but this is also a good thing if you have to leave your wheels in less than desirable locations from time to time. If you buy it in its most basic version, without any mudguards, the Carrera Impel does a good job of quickly blending in with its surroundings. And low-key is good when it comes to reducing the steal appeal of any e-bike.",
    "Overall, the Carrera Impel is a solid enough option if you want nothing more than a basic e-bike.",
    "Released in 2021, and available in the UK only, the Carrera Impel e-bike starts at £1,099 (about $1,500 / AU$2,000) for the single-speed im-1, or £1,299 (about $1,800 / AU$2,400) for the geared im-2.",
    "Bundled editions, where you can add mudguards or get the benefit of deals on bike racks as part of the package are worth investigating too.",
    "For context, our current top-rated electric bike, the Cowboy 4, currently sells for around twice the price.",
    "There are two variants of the Carrera Impel Electric Hybrid Bike on the Halfords website, with the non-geared im-1 and geared im-2 editions offering a maximum range of 50 miles using power from a 250W hub motor. There’s an im-3 too, which has a range of up to 75 miles, though the beefier battery seems to be the only discernible difference between this and the im-2.",
    "All models are available in small/medium or medium/large and, this being Halfords, you can choose to have your bike built for you at a local store and pick it up without additional cost. Alternatively, pay £30 (about $40 / AU$50) and it can be delivered already assembled. There was very little to do with our review bike, save for lifting it out of the box, setting the handlebars at the right angle using an Allen key, and attaching the pedals. Adjusting the saddle is easily done via a folding lever.",
    "There are bundled editions too, so if you’re thinking of riding this bike in the winter then it’ll be prudent to invest in one with mudguards. Our test example arrived minus the mudguards, but we think it actually looks quite cool sans any wet weather protection. Not very practical for winter, but funky all the same.",
    "The stripped-down look leaves you expecting it to be lighter than it is, and although it still weighs in at around 19.8kg, the Carrera Impel feels nicely balanced and not impossible to lift when necessary. It’s a shame there’s no flip-down stand though, so you’re always looking for somewhere to prop up the bike.",
    "The overall design though does underline that this is an e-bike at the more budget end of the spectrum. It doesn’t look cheap per se, but there are elements of the styling that let it down a touch. Perhaps the least effective design flourishes are the graphics, which contrast quite nicely with the dark metallic hue of the frame but aren’t executed well enough to turn heads. That’s no bad thing either though, especially if you want your e-bike to blend in with the other bikes in, say, a station storage area or mid-town public cycle rack.",
    "Aside from the so-so styling, the design is workmanlike and the component parts are designed to get the job done. There are Shimano gears (nine to choose from, in fact), with a handlebar-mounted changing mechanism that just works. No fuss, no bother.",
    "The disc brakes are Tektro, although they're mechanical rather than hydraulic, indicating another element of compromise to keep the asking price down.",
    "Meanwhile, the powered bit of the bundle comes via a combination of a frame-mounted 367.2Wh battery pack (which has been made to look like it’s an integral part of the design) and a rear-wheel-mounted Hyena hub motor. Both components are also quite low-key areas of the design, which again makes the Carrera Impel a very understated e-bike.",
    "Elswhere, there’s a comfy enough saddle that does the job nicely, even on longer runs. The pedals, however, look decidedly low-budget and although they have reflectors incorporated they’re one of the most obvious tell-tale signs that the Carrera Impel carries compromises in its design.",
    "Nevertheless, sitting on the Carrera Impel for the first time and the overall impression is a good one. The design features a rigid frame, but the tyres are chunky enough to provide a little bit of leeway on harsh surfaces and that saddle is quite forgiving. We also found the super-sticky feel of the handebar grips reassuring too, althought the on-board computer is a little uninspiring – we’ll get to that in the Performance section. Front and rear lights and a bell are included however.",
    "The Carrera Impel im-2 e-bike offers fairly unsurprising performance, which isn’t to say the bike lacks appeal. In fact, during our time with it, we found it very impressive.",
    "It's powered on by pressing a button on the top of the computer. However, this is a bit of a weakness of the Carrera Impel because the computer is small and rather hard to see during regular use. Mounted on the left handlebar, it offers three different power settings and these are certainly easy to use. Combined with those nine manual gears, which can be selected using the levers on the right handlebar, the combination is very effective at getting you from A to B.",
    "Power coming from a rear hub always offers a refreshing push up hills, which is the main appeal of owning an electric bike. However, the Carrera Impel im-2 e-bike is also pretty good if you choose to use it as a regular cycle and bypass the electric option altogether. It feels reasonably nimble when you’re picking your way through town, although if you were going to do a long run you’d certainly want to fall back on the battery for help, especially with that near 20kg weight.",
    "Naturally, the Carrera Impel im-2 e-bike is limited to 15.5mph/25kph in line with UK regulations, but get it on a roll and you can easily do more than that without the power engaged. Considering its disc brakes are mechanical, it stops very nicely too.",
    "Adding to the overall appeal is that comfortable saddle, which feels nicer to spend time sitting on than some more expensive rivals we’ve tried previously. The hybrid geometry of the bike means you’re sitting upright and on the bike rather than hunkered down, which makes it a perfect option if you’re looking for an e-bike to spend time pottering around country lanes when you’re not using it for the daily commute or shopping perhaps. It’s a shame there doesn’t seem to be a basket or panniers option for this bike, as it’s definitely got potential for replacing the car if you’re in need of a quick grocery run. Halfords might be missing a trick on the accessories front there.",
    "The Carrera Impel im-2 e-bike does come across as a bit unpredictable with its power delivery, and it’s certainly not as smoothly delivered as on some bikes. However, that’s another compromise presumably caused by the more affordable price tag, and it but can still produce up to 40Nm of torque when needed.",
    "In any case, there are fewer surprises the more you ride it and, eventually, mastering the power delivery of the Carrera Impel im-2 e-bike becomes second nature. We’d like to see the bike computer get some improvements though, in order to offer up a clearer view of speed and mode, but it’s not enough of a problem to put you off the bike altogether. A lack of suspension isn’t an issue either, mainly because of those decent tyres and that nifty saddle. Overall then, the Carrera Impel im-2 is a great option if you’re after an electric bike, but don’t want to break the bank doing it.",
    "First reviewed November 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and release date",
    "7": "Design",
    "17": "Performance",
    "25": "Don't buy it if"
  },
  "links": {
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "Cowboy 4": "https://www.techradar.com/reviews/cowboy-4"
  }
}