{
  "source": "https://www.techradar.com/reviews/catalyst2",
  "title": "Catalyst2 web hosting review",
  "category": "computing",
  "updated": "2021-08-17T15:49:45Z",
  "author": "mike-williams",
  "summary": "Prize-winning managed web hosting provider from the UK",
  "verdict": "catalyst2 is a UK-based web hosting provider offering everything from entry-level shared hosting packages to premium ones, such as fully managed VPS and dedicated servers. With agile 24/7 technical support, strong security, and powerful performance, managed VPS is the real star of the show. However, those looking for something simpler are likely to find catalyst2’s shared hosting solutions a bit stingy on storage space and unfitting for anything but a small website.",
  "pros": [
    "One-click installs",
    "Eco-conscious hosting",
    "A fine selection of hosting services",
    "Over two decades of industry experience",
    "Lots of positive reviews from their customers"
  ],
  "cons": [
    "No website builder",
    "No data centers outside the UK",
    "Pretty large limits on storage space"
  ],
  "article": [
    "The story of catalyst2 began in 2000 when Paul Redpath, its director and founder, launched a small start-up with just a single server. Two decades later, catalyst2 is home to thousands of sites in the UK running on a fully cloud-based infrastructure. The company takes pride (and rightfully so) in winning multiple awards for its services, most notably for being the finest web hosting provider in 2020, as well as the one with the best customer service.",
    "Some of catalyst2’s most notable clients include The Royal British Legion, FareShare, Daylesford Organic, Virgin Care and the list goes on.",
    "catalyst2 has two offices in the UK, with the head one being registered in Belfast (the UK). Their two data centers are also UK-based: one is found in London Docklands and the other one in Reading. Both of them share Tier 3+ infrastructure, which implies the usage of redundant and dual-powered servers, storage, network links, and other IT components.",
    "Although short on showiness, catalyst2’s official site is simple-to-use and well-stocked with information about the company and all of its services. On top of everything, if you explore the “About” section and head for “Our Team” you’ll find a bit about catalyst2’s founder, his right-hand man (and co-director), and see how they and the rest of catalyst2’s team members would have looked like if they were cartoon characters. It is a bit trivial, but a nice little touch nevertheless.",
    "Unsurprisingly, the site is available in the English language only and the prices are displayed in GBP. It also features a blog filled with somewhat short but well-written articles on a variety of hosting-related topics.",
    "If you’re into social networking sites, you’ll find catalyst2 on several of them including Facebook, Twitter, LinkedIn and YouTube. However, some of these accounts are showing no signs of life.",
    "catalyst2 currently provides five web hosting plans, but you can also get three additional packages for premium Windows hosting and another three from premium Linux hosting. The most budget-friendly plan called “Mega Deal” will cost you a mere £11.99 ($16.70) for a full year of hosting and it will supply you with up to one hosted domain and one subdomain, 500MB of disk space, 5GB of data transfer, industry-standard control panel, one-click installs, one FTP account, File Manager, support for a variety of scripts, weekly backups, antivirus, basic spam filtering, and the list goes on and on.",
    "Although the resources with the “Mega Deal” don’t seem like a particularly good deal (yes, we are referring to ridiculous restrictions on storage space), when we take the price into account, the plan starts to look a lot better. Although you usually get to choose between a monthly and an annual billing cycle, with “Mega Deal” only the latter one is available.",
    "Besides this, catalyst2 provides five animal-titled packages (“Squirrel”, “Kangaroo”, “Giraffe” and so forth) for managed VPS hosting, four for email hosting, three for reseller hosting, and three for flexible servers (that is, short-term managed dedicated servers). To learn more about managed hosting, dedicated servers, or other hosting-related services (such as managed AWS, backups, and disaster recovery among others) you are invited to get in touch with catalyst2’s support team.",
    "Although catalyst2 doesn’t provide a free trial, all of its shared hosting packages come with a 30-day money-back guarantee.",
    "As for payment methods, catalyst2 accepts all major credit/debit cards and PayPal.",
    "Given that catalyst2 is best known for its “top-of-the-class” UK-based fully managed VPS solutions, we’re going to try out one of them. However, if you are not quite sure what solution is best suited for your needs, go to “Hosting” and click on “Not Sure!” to get a recommendation.",
    "After submitting a short form including an expected number of daily visits to your site, the number of email accounts you think you’ll need, GB of disk space, type of site you want to create, and your email address, you’ll be contacted by someone from catalyst2’s staff with a couple of suggestions.",
    "Either way, picking out one among many options which catalyst2 offers shouldn’t make you go into overdrive, since everything is displayed in a very clear yet detailed way. All plans also include a free website migration, so if you want to take advantage of this, don't forget to let catalyst2’s team know.",
    "The second choice you’ll be prompted to make is about the operating system (OS) that you want to use on your server, and here you can choose between Linux and Windows options. To make a purchase you are required to create an account with catalyst2, and doing so means that you’ll have to provide plenty of personal and billing information and come up with a strong password.",
    "Depending on the OS you opted for, you’ll be using industry-standard cPanel or Plesk as your control panel, both of which are as user-friendly as they get. As most of catalyst2's packages include a Softaculous one-click installer, dozens of open source web apps (such as WordPress) will be yours in no time.",
    "We should also note that catalyst2 offers support for PHP 7, Perl 5.8, SSI, MIME, and Cron Jobs, but not for some of the equally popular scripting languages such as Python or Ruby on Rails, which seems a bit odd.",
    "Anyhow, on the last note, if you are not particularly tech-savvy and have hoped for a novice-friendly website builder to simplify the creation of your website even further, you’re out of luck, since catalyst2 provides none.",
    "Among the reasons why we should choose catalyst2, this provider describes itself as “fast” and elaborates on this by claiming its server speed is considered “very good” as calculated by serverscores.com. With that in mind, we decided to try out the speed of catalyst2’s main website, as provided by our favorite website performance analytics tool by the name GTmetrix.",
    "The results were as a matter of fact “very good” and concluded with a B (91%) as GTmetrix‘s grade. The site took 7.1 seconds to completely load (which is rather average) and (again) with pretty average 94 requests to do so.",
    "catalyst2 claims to have had 99.997% network uptime since May 2007, and considering that they are utilizing Tier 3+ infrastructure, it should imply at least 99.982% of uptime per year. After closely monitoring catalyst2’s site for two weeks (via Uptime Robot), we failed to record any downtime at all, resulting in a report flaunting an impeccable 100% of uptime. At the same time, there were no significant spikes in response time, showing a stable average of 342.32 milliseconds.",
    "The first among the highlighted reasons why we should pick out catalyst2 in the sea of similar hosts oriented towards managed hosting is their “excellent service” backed by UK-based round-the-clock customer support. To get in touch with this “all-star-team” you can use a telephone number (toll-free for users from the UK), a live chat, a support ticket system, or just send them an email. There are also two separate telephone numbers (one for UK citizens and another one for international clientele) and an email address reserved for sales inquiries.",
    "It’s important to note that with catalyst2 the level of support you’re going to get depends on the hosting package you’ve purchased. Therefore, with simple shared hosting packages you’ll get standard (yet still superb) support, while with premium managed and dedicated server hosting packages you are entitled to premium 24-hour support.",
    "To enter catalyst2’s knowledgebase you’ll have to go to the “About” section and select it from there, although there is already a “Support” section, making it all a bit counter-intuitive. Nevertheless, the knowledgebase is rather robustly packed with in-depth guides covering a wide variety of common issues and concerns.",
    "There is also a service status update page to help you to stay informed on outages and scheduled maintenance.",
    "Both US-based Kinsta and UK-based catalyst2 are well-known for their fully managed hosting solutions with enough variety to meet most needs. However, the similarities end there. While all of catalyst2’s data centers are found in the UK (which makes them best suited for users from the UK), Kinsta has its own CDN with 28 locations across the world (making themselves more appealing to the international market). On the other hand, while Kinsta offers ten different-sized cloud-based managed WordPress hosting solutions, with catalyst2 you can choose between shared, cloud, managed VPS, and dedicated server solutions and most of them will offer a better bang for the buck.",
    "Cloudways is a Malta-based host, one of the most popular choices for fully managed cloud-based hosting, as well as one of the pioneers of cloud hosting in general. In terms of pricing and features, Cloudways overtakes catalyst2 by a whisker. However, since Cloudways is geared towards users with more experience and technical know-how, if you are new here catalyst2 is definitely your safest bet.",
    "HostGator offers similar hosting options to catalyst2, and seemingly at a similar price. However, when the promotional period comes to an end, HostGator might knock your socks off with the sizable price spike, while there are no such surprises with catalyst2. Nevertheless, HostGator’s entry-level plans still look a lot more appealing than those with catalyst2 and for two simple reasons: they put fewer restrictions on its resources and they come with HostGator’s own drag-and-drop website builder packed with a myriad of good-looking templates.",
    "Another fan-favorite host from the USA is Bluehost and in terms of hosting types, features, and available apps it is remarkably similar to HostGator. When we add catalyst2 to the competition, all three hosts look like members of the same gang, however, with Bluehost and HostGator you can register a domain for free (if you subscribe for a year at a minimum), while there is no such opportunity with catalyst2.",
    "Before the conclusion, we would like to mention an abundance of positive reviews about catalyst2 left by both their current and former customers on consumer review sites (such as Trustpilot and HostSearch) and online service sites (such as Serchen and Bark). Among all the impressions a few things seem to stay the same, and those are high praises for the quality of catalyst2’s pre-sales and post-sales support, top-notch services overall, and more bounce for the ounce than one might expect.",
    "Having seen what catalyst2 has to offer, we have to agree with everything mentioned above. That being said, although catalyst2’s shared hosting packages may be a good buy for a small personal or a business site, the shortage of resources can be suffocating for bigger businesses.",
    "If finding a UK-based host is not a must for you, you can get less limited (or unlimited) web hosting packages with pretty much the same features (and a user-friendly website builder) with HostGator and Bluehost. Otherwise, take a look at Unlimited Web Hosting, whose name explains it all."
  ],
  "headers": {
    "6": "Pricing",
    "11": "Ease of use",
    "18": "Speed and experience",
    "21": "Support",
    "25": "The competition",
    "29": "Final verdict"
  },
  "links": {
    "catalyst2": "https://www.catalyst2.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Windows hosting": "https://www.techradar.com/news/best-windows-hosting",
    "Linux hosting": "https://www.techradar.com/web-hosting/best-linux-web-hosting",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Mega Deal": "https://www.catalyst2.com/hosting/web-hosting/",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "email hosting": "https://www.techradar.com/news/best-email-hosting-providers",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "disaster recovery": "https://www.techradar.com/best/best-disaster-recovery-service",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Kinsta": "https://www.techradar.com/reviews/kinsta",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "Cloudways": "https://www.techradar.com/reviews/cloudways",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}