{
  "source": "https://www.techradar.com/reviews/netgear-orbi-pro-wifi-6-mini",
  "title": "Netgear Orbi Pro WiFi 6 Mini review",
  "category": "computing",
  "updated": "2021-12-06T00:12:54Z",
  "author": "mark-pickavance",
  "summary": "Cheaper Orbi Pro with a smaller footprint",
  "verdict": "The new Orbi Pro Mini design takes most of what made the Orbi Pro great and packs it into a more easily deployable package. At a lower price, it could be ideal for small businesses, the retail sector and home workers.",
  "pros": [
    "Easy to deploy",
    "Much cheaper than the Orbi Pro",
    "Four SSIDs"
  ],
  "cons": [
    "No dedicated backhaul channel",
    "Reduced bandwidth over Orbi Pro",
    "Performance could be better"
  ],
  "article": [
    "The popularity of the Orbi line has probably exceeded Netgear's wildest expectations, as it has become something of a go-to for those wanting to deliver a WiFi 6 MESH solution efficiently.",
    "But since the original Orbi Mesh solution launched in 2016, customers have hoped that Netgear might consider delivering something less monolithic and more affordable.",
    "Not all businesses have 10,000 square feet of office space to cover, but many want reliable and secure WiFi for their employees and customers.",
    "Is the new Netgear Orbi Pro WiFi 6 Mini the hardware they want, or just a less impressive version of their flagship Orbi Pro series?",
    "As with the other Orbi solutions, Netgear sells the Orbi Pro WiFi 6 Mini as either a single router or as part of a multi-part package with additional satellites built to provide coverage for a much larger area.",
    "Curiously, at the point of writing, an Amazon Black Friday deal has a single router (SXR30) costing £188.82 ($169.99), but a dual pack with a single satellite (SXK30) is only £181.99 ($195.72). A triple pack with two satellites (SXK30B3) costs £244.99 ($329.99), and extra satellites (SXS30) cost £172.82 ($158.23).",
    "Based on that pricing, the dual pack offers the best value over almost any other package unless you specifically want a router and two satellites.",
    "To put that in perspective, the Netgear Orbi Pro WiFi 6 dual pack (SXK80) is £708.99 ($729.99), making the Mini something of a bargain in comparison.",
    "For our testing, we received the dual pack with a single satellite (SXK30) for this review.",
    "Where this hardware has the edge over the larger and more expensive Netgear Orbi Pro WiFi 6 (SXK80) is in its smaller scale.",
    "Both the router and satellites of the SXK80 are substantial slabs of technology standing some 24.6 cm (9.7 inches) high. And, once mounted high up using the provided brackets, they’re impossible to ignore.",
    "At just 18.9 cm (7.4 inches), the SXR30 router and SXS30 satellite (combined are called the SXK30) are less imposing, even if they have roughly the same oddly rhomboid shaping.",
    "They also use similar, plastic L-shaped wall-mounts attached to the wall before the router or satellite are then screwed onto them. We liked that these don’t merely clip them to the mounts, as it should ensure that they can’t be easily knocked off or stolen.",
    "From the outside, the two parts look practically identical. The only significant difference between the router and satellite is that the four Ethernet ports on the router include a single WAN port to connect to the Internet broadband modem. On the satellite, all four are for distributing a wired network.",
    "As with most MESH wireless configurations, it is possible to extend the network by connecting the satellites using purely wireless communication or by providing a wired backbone.",
    "Where this option differs from the SXK80 hardware is that the Ethernet switch components had link aggregation and 2.5 GbE Ethernet on that design, but those features are both missing from the SXK30.",
    "Therefore, the best backchannel performance of the Mini might be over WiFi since the maximum of a single Ethernet line is just 1Gbit. But, as we’ll see later, for other reasons that might not be a good idea.",
    "That’s a slight change, but the big differences are inside, where Netgear have dramatically reduced the amount of wireless technology available.",
    "Where the SXK80 offered tri-band 4×4 AX6000, the SXK30 is reduced to dual-band and only AX1800 operations. Essentially bandwidth is halved on both 5GHz and 2.4GHz, with not four but two channels on each, and the 5GHz backhaul is now shared with the users and not dedicated.",
    "With less than a third of the potential bandwidth to share around, the SXK30 can’t effectively handle the same number of users as the SXK80 or provide the same coverage.",
    "Because the backhaul doesn’t have a dedicated 5GHz channel, installing an Ethernet line to provide this data pathway is converted as an option on the SXK80 to a practical necessity on the SXK30.",
    "Doing that entirely undermines the purpose of MESH wireless networking, but with the limited bandwidth of the Mini, it might be the best policy.",
    "For that small number, maybe up to 10 users, the performance they will experience will match that of the much more expensive option, as each will only be taking a modest amount of the 1800Mbps available. And, on the SXK80, additional bandwidth can’t be easily allocated to each user even if the overall pool is greater.",
    "Where the SXK80 can handle a building space of up to 18,000 square feet with a maximum of six satellites, the SXK30 can also connect to six satellites but only covers 6,000 square feet. An office or retail space 77ft square is still a good size for a small business unless they have a large workshop or production area.",
    "How this translates into vertical connections is dependent on how the floors are constructed and, if they are concrete, how much metal reinforcement they might contain. But, for a typical European home three vertical floors should be adequately covered.",
    "Like its bigger brother, the Mini uses the Netgear Insight mobile application for configuration and not the Netgear Orbi tool that was designed for older hardware.",
    "There are a few problems with Insight from our perspective, and the first is that for a location where this is the only Netgear equipment, it’s complete administration overkill.",
    "And secondly, to get the truly clever features of this tool requires an additional annual subscription. When you purchase a new device, you immediately get a month free premium subscription. Once that gratis period is exhausted, using the premium features comes with an additional ongoing cost.",
    "The more Netgear hardware you have, the cheaper per device it is, but unless you intend to extensively use this level of management, it is something that you can do without once you are up and running.",
    "Another caveat to Insight is that nothing it does is typically instantaneous. It easily took more than 20 minutes to get our Mini router configured, as at each step, it refers to the centralised control of the Insight servers.",
    "Thankfully a web interface is also available, negating the need for Insight should you not wish to use it.",
    "The web interface might be the best choice, as we had some issues with Insight when we tried to install the router as an Access Point and not a router, which is an option.",
    "Except without it operating as the only router on a network, it has trouble accessing the internet and switching it to AP mode proved to be far from easy. Eventually, we managed to get the hardware to accept that it wasn’t the DHCP server and play with other hardware nicely, but it wasn’t entirely a plug-and-play experience.",
    "Slightly offsetting the pedantic nature of these mechanisms, adding satellites to a router is merely a matter of connecting them within wireless connection range or on the same wired network, and they’ll automatically be found and added. Insight sees the Orbi Pro router and its satellites as a single entity, making that part of controlling them remarkably straightforward.",
    "Another excellent feature is the units ability to support four different SSIDs.",
    "Being able to segment administration, employees, IoT and Guests, as an example, is useful for those that like to give customers internet access or limit the functionality available to some staff.",
    "Being based on similar technology, the performance of the Mini Pro compared to the original Pro is almost identical for individual users. What that statement doesn’t acknowledge is that the number of users that can experience that performance is less because of the limited number of channels and the smaller wireless footprint of the Mini hardware.",
    "Therefore, at close range, connections of over 500mbits per second are entirely plausible. But that’s a single connection at close range, and a second connection at that speed would consume all the bandwidth that 5GHz has to offer (1200Mbit).",
    "Those connecting via 2.4GHz can expect about 150mbits at close range and half this level when further away.",
    "When the 5GHz channel is performing double duty as the backhaul, those connecting through the satellite (5GHz or 2.4GHz) could see their performance halved.",
    "We’ve seen others complaining that this hardware is slow compared with the SXK80, but that’s mostly impacting on those using the satellite and when no wired backhaul is in place.",
    "Even on the SXK800 and its 6,000mbits of potential bandwidth users can only grab the same bandwidth that the router of the Mini delivers if they can bond multiple 5GHz and 2.4GHz channels into a single connection. Most users will be connecting over a single data stream and be bound by the effective limits of the bandwidth each channel offers, even if they’re the only person connecting.",
    "Where single point connection speed is paramount, then the SXK30 probably isn’t the best choice, but then it could easily be argued that wireless networking overall isn’t ideal for this job.",
    "Those that want the fastest possible connection to the servers or internet should consider 10GbE wired connections, as the performance is potentially greater than all the bandwidth in the SXK30, or the SXK80 for that matter.",
    "For a typical ten-person or less office, the SXK30 has enough bandwidth to easily handle most needs, especially if you tie the satellites using wired networking and the building infrastructure isn’t especially challenging for WiFi signals.",
    "We should also say that for those businesses with only 100Gbit or slower broadband connections, the SXK30 isn’t likely to be the bottleneck in any complaints about internet speeds even with its modest bandwidth.",
    "Overall, the performance of the SXK30 isn't wonderful when compared with other WiFi 6 hardware we've tested, but it's reliable and that might be more important to some.",
    "Something is compelling about this equipment, and that’s primarily down to the price.",
    "For businesses with a sprawling building and many simultaneous users, the Orbi Pro SXK80 is still the hardware to use, even if it’s disturbingly expensive.",
    "But, for lockdown home workers and small retail operations, the SXK30 makes economic sense while providing the functionality and control that those deploying it will appreciate.",
    "However, we think that Netgear missed an opportunity with this hardware by not including PoE technology with it.",
    "If the satellite units were connected by a Power-over-Ethernet backbone, then running that cable would also have allowed the placement of the hardware in a location where power wasn’t available.",
    "For home users, the price of these seems like a great deal, but you can also get even better value going with the basic Orbi WiFi 6 (RBK753), offering double the bandwidth for a little more money. Or, the Orbi Mesh WiFi System (RBK353) with the same bandwidth but two satellites included for a very similar price (£199).",
    "In both business and home use, it probably comes down to if you are already invested in Netgear hardware and want to have a unified management solution. For those already using Netgear kit and its Insight management, the SXK30 is a good choice, but cheaper and faster options are available elsewhere for those that aren’t so invested.",
    "You might also want to check out the Asus ZenWiFi AX (XT8) review"
  ],
  "headers": {
    "4": "Price",
    "9": "Design and features",
    "25": "In use",
    "36": "Performance",
    "47": "Final verdict"
  },
  "links": {
    "Asus ZenWiFi AX (XT8)": "https://www.techradar.com/reviews/asus-zenwifi-ax-xt8"
  }
}