{
  "source": "https://www.techradar.com/reviews/blink-outdoor",
  "title": "Blink Outdoor review",
  "category": "smart-home",
  "updated": "2021-12-05T22:49:39Z",
  "author": "esat-dedezade",
  "summary": "A simple, accessible outdoor security camera you can rely on",
  "verdict": "The Blink Outdoor is an easy to use security camera that you can simply set up and forget, thanks to its weatherproof build and very impressive two-year battery life. Powered by AA batteries and bolstered by options for offline storage thanks to the Sync Module 2, it’s an ideal choice for anyone looking to keep an eye on their gardens and other outdoor surroundings.",
  "pros": [
    "Affordable",
    "Clear video quality",
    "Local storage option"
  ],
  "cons": [
    "No person detection",
    "No free cloud storage option beyond initial trial"
  ],
  "article": [
    "Time was, if you wanted a whole home security setup you’d need to run miles of cable through and around your house while sacrificing your spare room to a wall of fuzzy monochrome monitors. Thankfully, those days are long gone.",
    "Today, a variety of wireless security cameras allow much simpler installation and the flexibility to easily move them around and update them as we see fit, and the Blink Outdoor is one of the latest offerings to cross our desks.",
    "A totally wireless and weatherproof camera, it’s designed to be easily mounted outside your home, keeping an eye on anything from your shed to the front garden, and everything in between. Despite running on two regular AA batteries it promises up to a staggering two years of battery life, which sets it apart from competitors from the likes of the Wyze Outdoor Cam, which lasts between three to six months per charge in comparison.",
    "The Full HD camera records footage when motion is detected in its 110-degree field of view, and sends an alert to your smartphone so you can view the camera’s live feed, or simply review the video at a later date if you don’t see the notification at the time, or it’s not convenient.",
    "Other features include Amazon Alexa (but no Google Assistant) support, built-in speakers for scaring off intruders or pesky squirrels, and temperature monitoring smarts. It’s certainly a tempting buy — especially when you take into account the Blink Sync Module 2, which, unlike the Blink Mini, is included in the price. This handy inclusion means that you can connect a USB flash drive to the module to store video content locally if you don’t fancy forking out for a regular Blink cloud storage subscription.",
    "The Blink Outdoor is a compact and effective home security camera, that at $99.99 / £99.99 is best suited to those that want to keep an eye on the exterior of their property but are on a budget.",
    "The Blink Outdoor camera is priced at $99.99 / £99.99 and is available in the US and UK directly from Amazon, or retailers such as Best Buy, Lowes, and Target in the US, or Currys, Very and Argos in the UK. It’s not currently available in Australia.",
    "As the Blink Sync Module 2 is included in the price, the only hardware extra you might want to fork out for is a 256GB USB flash drive, which can be snapped up for around $25 / £25 to unlock the ability to store files locally.",
    "If you prefer online storage, the Blink Outdoor comes with a free trial of its cloud storage plan, after which it’ll set you back $3 / £2.50 per month.",
    "It’s worth noting that you can also buy packs that contain up to four cameras, all of which also include the Sync Module 2, as well as the option to buy an individual camera if you want to expand your setup at a later date.",
    "As with any other security camera, the Blink Outdoor doesn’t try to be flashy or exciting, and nor should it. Its compact, plain black, square design and rounded corners are pleasant enough to look at, while its lightweight build means that you can mount it to practically anything.",
    "Its black color might make it stand out or blend in depending on where you decide to place it, which may or may not suit your needs. Some people might prefer their cameras to be very visible to deter intruders, while others opt for a stealthier approach. Either way, black is the only color the Blink Outdoor comes in.",
    "The camera itself feels sturdy and well-made, while its weatherproof design promises to fend off downpours (though it’s not rated for underwater submersion). During our few weeks’ worth of testing, the Blink Outdoor comfortably shrugged off some of the biggest British summer downpours we’ve ever seen, filling us with confidence in its outdoor durability. The one thing we will add though is that the plastic can get scratched quite easily, not that you’ll need to worry about that once it’s mounted.",
    "An included tool lets you remove the rear panel by loosening a large screw, providing access to the battery compartment and QR code for setting it up. The included stand and screws for wall mounting are simple enough to use and set up for even the most novice of DIYers too. Despite the plastic build of the base, its ball and socket joint is stiff enough to hold any angle you place it in, even if it does creak a little.",
    "The Blink Outdoor provides Full HD colour video which serves up a crisp, clear picture, with more than enough detail to clearly identify individuals. Things automatically switch to infrared vision in low light, which obviously provides a monochrome picture that’s less clear than that found in daylight.",
    "Despite this, the night vision performance is still impressive, and more than enough to comfortably see what’s going on outside, even on particularly dark, overcast nights. Further objects obviously lose some clarity and definition, while things closer to the camera (and its infrared beam) are clearer. Still, the Blink Outdoor is more than capable of offering peace of mind both in the day and at night, and you can be confident it’ll pick up and display any intruders/wildlife clearly.",
    "On that note, the Blink Outdoor’s motion tracking feature works very well too. During our time away from home we used it to keep tabs on our garden, mostly using it to follow our cat’s comings and goings, letting us know he was back for the night rather than having an impromptu sleepover at a neighbor’s house. Given that our garden backs onto an alley, it was also reassuring knowing that any unauthorized entries would be automatically captured (not that there were any).",
    "The only improvement we’d like to see is a geofence that would automatically arm or disarm the motion tracking when we’ve entered the home, to save us from having to remember to manually do this. Also, it would be great to have person-specific motion tracking available, for people who’d prefer to be alerted only when people are detected, rather than animals and other sources of motion.",
    "Lastly, if you’ve got one of Amazon’s smart displays, such as the Amazon Echo Show 10, you can ask Alexa to show you a live view of the camera feed, which works well. If you’re in the Google camp though, no such options are available, due to Blink’s Alexa-only compatibility.",
    "Blink’s app is full of useful features while being simple to use. Initial setup is easy enough by the fact that both the Sync Module 2 and Outdoor camera can be linked to your Blink app simply by scanning the QR codes present on both devices, after which you’ll need to enter your Wi-Fi password to get them connected. Once that’s done, you’re all good to go, with live feeds, notifications, and more.",
    "These extra features offer plenty of different ways to tweak things to your liking. The most basic thing you can and should do is rename the camera itself to something like ‘garden’, which also makes it easier when asking your Echo Show device to bring up a live feed. You can also play around with the activity zones for motion detection, selecting rectangular segments from a grid overlay where motion will be ignored. This is particularly useful for ignoring notification from, for example, a swaying tree, or the area where your cat prefers to nap out and stretch.",
    "You can also play around with the motion sensitivity and retrigger time, as well as setting the length for which clips can be recorded (with 30 seconds being the maximum). When you activate the Blink Outdoor you’ll automatically have a three-day free trial which will automatically save recorded footage to the cloud. After this period expires, you’ll be limited to motion-activated notifications and live view streaming only. Thanks to the included Sync Module 2 however, you can simply plug in a USB flash drive and store videos locally, which is a very useful feature, to say the least.",
    "As we've already mentioned, the Blink Outdoor is powered by two AA batteries, and the brand claims they will last an impressive two years before they need changing. We can’t confirm how quickly ‘typical use’ drains the battery because we’ve put the camera through heavy testing in a short period of time for this review. However, the battery life you get is likely to depend on a number of factors, including how often motion is detected, how many times Live View is activated, and the number of times the two-way microphone and speaker are used.",
    "We were thrilled that Blink even goes as far as two include two lithium batteries with the camera, so you won't find yourself hunting high and low for your own batteries. You could even swap these for rechargeable AA batteries if you want to reduce the number of batteries that end up in landfill each year.",
    "First reviewed: July 2021",
    "You might also want to check out the Blink vs Ring comparison."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Blink Outdoor price and availability",
    "10": "Design",
    "14": "Performance",
    "19": "App",
    "22": "Battery life",
    "24": "Don't buy it if..."
  },
  "links": {
    "security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Blink Mini": "https://www.techradar.com/reviews/blink-mini",
    "smart displays": "https://www.techradar.com/best/best-smart-displays",
    "Blink vs Ring": "https://www.techradar.com/news/blink-vs-ring-what-are-the-differences-between-amazons-cams"
  }
}