{
  "source": "https://www.techradar.com/reviews/motorola-edge-20-lite",
  "title": "Motorola Edge 20 Lite review",
  "category": "phones",
  "updated": "2021-09-10T14:00:04Z",
  "author": "andrew-williams",
  "summary": "Budget specs from a premium range",
  "verdict": "The Motorola Edge 20 Lite is a decent, reasonably affordable 5G Android phone in most respects. It has a large OLED screen, clean software and good day-to-day performance. However, it costs more than the best of the value-packed competition, the camera fumbles its dynamic range processing, and battery life is shorter than expected.",
  "pros": [
    "Punchy and large OLED screen",
    "Has a headphone socket",
    "Clean-looking software"
  ],
  "cons": [
    "Weak/unreliable camera HDR",
    "Surprisingly short battery life",
    "Mono speaker"
  ],
  "article": [
    "The Motorola Edge 20 Lite is the most affordable member of the Edge family, which sits above Motorola’s G-series phones. So while the Edge 20 Lite may seem a budget Android to some, it's not part of a full-on budget line-up.",
    "This only really exhibits in one way in the phone itself. The Motorola Edge 20 Lite has an OLED screen, not the LCD type used in many upper entry-level Androids like this.",
    "There’s a lot of competition from Xiaomi and Realme in this area, and a few of their phones are better value. You could even argue the Samsung Galaxy A32 5G is pretty similar in several ways, and it's a bunch cheaper.",
    "An above average screen is the main Motorola Edge 20 Lite draw, then, but we’d like to see higher peak brightness to make this a true killer display.",
    "Battery life is the real surprise here. A 5,000mAh cell feels like the right size for the Motorola Edge 20 Lite, but on all test days it has struggled. It would be easy to blame the MediaTek Dimensity 720 5G chipset, but the Samsung Galaxy A32 5G has the same processor and lasts a long time between charges.",
    "It’s a bit of a mystery.",
    "Ultimately, the Motorola Edge 20 Lite is a decent affordable 5G phone with fair cameras and a big, good-looking screen. However, it doesn’t hold up well enough against the best of the more affordable competition to earn a full recommendation.",
    "The Motorola Edge 20 Lite is part of the first wave of the expanded Edge range. It’s the cheapest in a trio, costing $415.99 / £299.99 / AU$565.",
    "What do you lose out on? There are no glass backs or metal sides, no zoom cameras or high-end processors here.",
    "The aim is to get you good-quality basics, and 5G mobile internet, without a huge outlay.",
    "The Edge series’s job is to class-up the Motorola brand a bit. We have recommended many of its Moto G phones for almost a decade now, and these Edge ones are a step above.",
    "This isn’t hugely apparent in this lower-end Motorola Edge 20 Lite, though. It has a plastic back and plastic sides. You can tell immediately it’s not a flagship phone. And considering the cost, that's probably okay.",
    "The only thing we can identify that separates it from the no-nonsense Moto G-series phones is thickness. At 8.25mm the Motorola Edge 20 Lite is slightly thinner than most of the cheaper Motos.",
    "Motorola has also done a good job of making the plastic back look like glass. It has a textured top surface and a shimmery light reactive layer that has an effect similar to some matte finish glass phones.",
    "You get to shrug off the slightly chunky feel of a Moto G30, although the Motorola Edge 20 Lite comes with a decent silicone case and we’d think you should use it if you want to keep the bodywork pristine.",
    "There’s no factory applied screen protector here, though, and we’d recommend one. While the more expensive Motorola Edge 20 and Motorola Edge 20 Pro phones have Corning Gorilla Glass screen protection, this one uses another unspecified kind of glass. And it’s likely not as hard or strong.",
    "The Motorola Edge 20 Lite’s outer parts bring no real surprises or stand-out features. It has a reasonably loud speaker, but it uses a single driver on the bottom of the phone rather than a stereo array. It can sound slightly brash at high volumes.",
    "Motorola uses a side-mounted fingerprint scanner rather than an under-screen one. It’s fractionally slower than the fastest around, but we bedded into its rhythm within about 24 hours. The Motorola Edge 20 Lite also has a 3.5mm headphone jack, unlike the higher-end Motorola Edge 20 Pro.",
    "There’s also a Google Assistant button on the left side of the phone. We’ve pressed this accidentally a few times because - again unlike the Edge 20 Pro - it doesn’t have a deliberately harder-to-press mechanism. We didn’t find it goes off regularly in a pocket, though, and that’s the main thing.",
    "Water resistance is rated at IP52, about as low as you can go while still having an IP rating. It means the Motorola Edge 20 Lite should be able to handle light rain, but that’s about it.",
    "The Motorola Edge 20 Lite has a large 6.7-inch OLED display with a 1080 x 2400 resolution and a 90Hz refresh rate. It is a step above the many slightly cheaper LCD alternatives in terms of contrast and color.",
    "OLED screens have self-lit pixels, so the black areas of an image can stay perfectly black even if other parts of the picture are very bright. You won’t notice this all the time, only when in a darker room, but OLED contrast is always valuable.",
    "The Motorola Edge 20 Lite also has deep color saturation, another typical OLED trait. Motorola says it’s intended to fulfil the DCI-P3 color gamut, but to our eyes the ‘Saturated’ display mode seems to overshoot a bit. This is likely because Saturated uses the OLED panel’s native color gamut, the widest range of colors it can display.",
    "Many of you may like this ultra-saturated look, but there’s also a Natural mode. This seems to track closer to the sRGB standard, which renders Google app icons in pastel-like tones. It’s the mode we chose to use.",
    "The Motorola Edge 20 Lite’s OLED screen isn’t nearly as bright as some of the top OLED phones. Peak brightness of well over 1000 nits is quite common these days but this phone goes up to 427 nits according to our colorimeter.",
    "This is just about enough to make the display seem reasonably clear outdoors, but higher brightness would make shooting photos outside on a sunny day a bit more comfortable. Considering the screen is a key draw here, a little extra screen power would have been nice.",
    "The Motorola Edge 20 Lite has three rear cameras. Its primary one has a 108MP Samsung HM2 sensor, the same used in the higher-end Edge 20 Pro. That’s a pretty good start.",
    "Its other cameras are an 8MP ultra-wide with a Samsung sensor and a basic little 2MP OmniVision sensor for depth mapping. This is used in the Motorola Edge 20 Lite’s portrait mode, where the background is deliberately blurred out.",
    "The main camera can take very pleasant photos, with largely natural-looking greens in nature shots and a respectable amount of detail. However, we need to calibrate your expectations. Don’t expect miracles just because the megapixel count is so high.",
    "The Samsung HM2 sensor was basically designed to make the most of these 108MP expectations. It’s a lower-spec sensor than the Samsung HMX, HM1 and HM3 sensors we’ve seen in phones since 2019. Its sensor area is smaller, resulting in lesser light sensitivity, and we don’t think Motorola has absolutely nailed its handling of the hardware either.",
    "Dynamic range is the recurring issue, and the same problem affects the Motorola Edge 20 Pro, perhaps to a lesser extent. Its HDR processing is a bit too lax, resulting in blown highlights in scenes of high light contrast. And, more often, a dull-looking foreground.",
    "The annoying part is the detail is often there. We took a bunch of the more drab-looking Motorola Edge 20 Lite shots into Photoshop, lifted up the shadows, and found plenty of clean-looking detail and color information that the phone’s processing profile does not bring out.",
    "This isn’t the case for all scenes, far from it. In the more even-looking exposures, lifting the shadows just results in exactly the sort of flattened appearance you’d expect from ‘too much’ HDR. But it’s as if the Motorola Edge 20 Lite gives up when HDR is needed most, for sunrises, sunsets, and any time you shoot directly into the sun.",
    "Detail is also not appreciably better than that of a solid 12MP or 48MP camera, and often worse because the fine detail processing sometimes has a painted-on appearance down at pixel level. This is quite common in entry-level and mid-range phones that use a lot of pixel binning, where multiple sensor pixels are combined to create a single pixel in the final image.",
    "There are other predictable image quality issues in indoors lighting and low light. Photos start to lose contrast, clarity and detail more quickly than, for example, the Google Pixel 4a. And while there is a Night Vision low-light mode that brings some of the strength back to the color and improves edge contrast noticeably, it doesn’t have the miraculous kind of effect you get with killer low-light processing.",
    "Once again the Motorola Edge 20 Lite performs at a similar level to decent performers in the $200-250 bracket. But we wish its approach to HDR was more reliable and consistent. As is, the prevalence of bad or unusable photos is a little too high.",
    "The secondary camera, an 8MP ultra-wide, is not particularly impressive. There’s an unmistakable drop in color saturation, and geometric distortion is quite obvious in big chunks of the outer parts of the frame. Contrast also drops and the lens’s limited optics don’t handle stark light contrast - like leaves against a bright sky – too well.",
    "All this stuff is pretty typical of the wide cameras of entry-level 5G phones, but plenty of those are at least a bit cheaper than the Motorola Edge 20 Lite.",
    "The ultra-wide camera does have one neat feature, though. It can focus on objects just a centimeter or two away from the lens. This is why the camera is used for the Motorola Edge 20 Lite’s macro mode.",
    "Few budget phones let you get this close to your subject, and the results are better than the dreadful 2MP macro cameras put into a lot of affordable triple and quad-lens rear camera arrays. However, we don’t find macro shooting particularly fun here. The ultra-wide’s autofocus is slow, so actually getting flowers, berries and bees to look sharp is a bit of a pain.",
    "Xiaomi probably does best in this area, with phones like the Xiaomi Redmi Note 10 Pro. It has a dedicated 5MP macro camera with a more ‘zoomed in’ view. It’s fun to use and is able to capture far more ultra-close detail than the Motorola Edge 20 Lite’s technique of cropping into an 8MP ultra-wide lens.",
    "Finally, there’s the Motorola Edge 20 Lite’s 2MP depth cam. The sensor and lens on this little thing are probably junk, but it’s still useful. A dedicated depth camera lets you take background-blurred photos of any subject, not just people.",
    "Want to shoot videos? The Motorola Edge 20 Lite can handle 4K resolution at 30 frames per second, and up to 60fps at 1080p. This is a typical ceiling for a budget 5G phone, but its stabilization could be better. While it does crop into the view to use electronic/software stabilization, footage still ends up looking a bit juddery when you use the phone handheld.",
    "The Motorola Edge 20 Lite has a 32MP OmniVision selfie camera up front. And after all the complaints levelled at the other cameras, this one comes across pretty well.",
    "It doesn't have autofocus but the depth of field is so wide it doesn’t seem a big issue. Detail in good lighting is solid, if not class-leading, and you can even get decent results in bad light as long as you use the Night Vision mode. It firms up detail well, and it isn’t immediately obvious Night Vision is even an option for the front camera.",
    "The Motorola Edge 20 Lite is a textbook example of how we’d like manufacturers to approach Android. It’s so clean you could mistake it for an unadulterated version of the software, but it does have a few tweaks that give it a character of its own.",
    "For example, there’s Motorola’s long-standing Glance lock screen, which appears when you move the phone or a new notification comes in. There are optional motion gestures to fire up the torch or jump to the camera app. And if you dig a little deeper you’ll find the Motorola Edge 20 Lite’s Styles area. This lets you change system fonts and icon shapes.",
    "There are no third-party app stores, no Motorola fitness apps. The one piece of app bloat is Motorola Notifications, which is basically just there to get you to sign up for Motorola push notifications.",
    "Motorola also says the Edge 20 Lite will get at least two major Android updates, so that's two years’ worth, similar to an Android One phone.",
    "No complaints about the software, then, but the hardware that powers it is arguably less than ideal. The Motorola Edge 20 Lite has a MediaTek Dimensity 720 5G chipset, the same seen in the cheaper Samsung Galaxy A32 5G.",
    "It’s roughly a match for the Qualcomm Snapdragon 480 performance-wise, with slightly better GPU performance in some situations, and that processor is used in Motorola’s lower-end Moto G50. We weren’t able to do some of the testing we usually put Android phones through, because Epic Games currently won’t let the Motorola Edge 20 Lite play Fortnite at all.",
    "It simply refuses to load, showing a ‘device not supported’ error message. This is one of the key reasons to buy a Qualcomm Snapdragon phone instead of a MediaTek one. You’re more likely to run into issues like this with MediaTek, although we expect the Motorola Edge 20 Lite should be able to handle the game okay at medium graphics.",
    "This is an area where value-led brands like Xiaomi and Realme pull ahead. The Xiaomi Poco X3 Pro is far better for gaming, and if you can afford to spend a little more the Realme GT is even better, as it has a flagship Snapdragon 888 chipset.",
    "The Motorola Edge 20 Lite is a bit closer to the Pixel 4a in performance, but it also has 5G. It’s a good step below the Pixel 4a 5G, as that version of the phone has a better processor. Motorola pulls some focus away from the processor by giving us 8GB of RAM and 128GB of storage, both good, but it also needs a slightly better chipset to stand out.",
    "Time for some context. The main issue we’ve run into here is that Fortnite is not supported (yet). Asphalt 9 runs well with some micro-stutters we often see in phones at this level, caused by the game’s dense environments and exuberant use of particle and damage effects.",
    "There’s no obvious lag in Android, and while ARK: Survival Evolved is less than perfectly smooth if you crank up the graphics to their maximum settings, that’s pretty normal at this level.",
    "Our beef with the Motorola Edge 20 Lite isn’t that we’ve come across major performance issues, just that quite a few phones up to $100/£50 less get you very similar results.",
    "We have not had a good time with the Motorola Edge 20 Lite’s battery, and this was a surprise.",
    "Like most of the Moto G-series phones, the Motorola Edge 20 Lite has a 5,000mAh battery, which usually guarantees a solid day of reasonably heavy use. Or even up to two days for those who don’t use their phone too much.",
    "Our results here have been a lot worse. Take the Sunday before we published this review as an example. By 14:30 the Motorola Edge 20 Lite had just 39% battery left. We’d used it to stream a podcast during a run, to watch a YouTube video or two in bed in the morning, and for a WhatsApp video call. Other than that, we’d just streamed some audio via Google Podcasts. And yet it was on the road to a flat battery by early afternoon.",
    "This is a completely different experience to that of the very long-lasting Moto G30 and G50. On other days it has fared better, making it to bedtime, but still only with single figures of battery charge left. This doesn’t match up with our expectations of a 5,000mAh battery at all.",
    "So what’s going on? The obvious difference is the Motorola Edge 20 Lite has a MediaTek processor, while most other Motorolas have Qualcomm chipsets. However, the Samsung Galaxy A32 5G has the same chipset and entirely decent battery life, pointing the finger at Motorola’s power management rather than the chipset itself.",
    "The good news is that if this is a software issue, it may improve with an update. However, we have to review phones based on what they are, not what they might be in future.",
    "Charging speed is notably better than that of some of the cheaper Motos, though. The Motorola Edge 20 Lite comes with a 30W charger. This takes you from totally flat to 23% in 15 minutes, and to 47% in 30 minutes.",
    "You’ll actually see slightly better results if you don’t let the phone die completely. We hooked it up to a power meter and, as usual, the charger feeds it power at a lower rate until it has enough juice to boot up fully.",
    "First reviewed: September 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Motorola Edge 20 Lite price and availability",
    "10": "Design",
    "20": "Display",
    "26": "Camera",
    "45": "Software and performance",
    "57": "Battery life",
    "65": "Don't buy it if..."
  },
  "links": {
    "Samsung Galaxy A32 5G": "https://www.techradar.com/news/samsung-galaxy-a32-5g-release-date-price-specs-and-5g-vs-4g-lte",
    "Moto G30": "https://www.techradar.com/reviews/moto-g30",
    "Motorola Edge 20": "https://www.techradar.com/news/motorola-edge-20",
    "Motorola Edge 20 Pro": "https://www.techradar.com/reviews/motorola-edge-20-pro-review",
    "pixel binning": "https://www.techradar.com/how-to/what-is-pixel-binning-and-how-can-it-help-my-smartphone-photography",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Xiaomi Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "Moto G50": "https://www.techradar.com/reviews/moto-g50",
    "Xiaomi Poco X3 Pro": "https://www.techradar.com/reviews/xiaomi-poco-x3-pro",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review"
  }
}