{
  "source": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-titanium-yoga-review",
  "title": "Lenovo ThinkPad X1 Titanium Yoga review",
  "category": "computing",
  "updated": "2021-11-10T20:54:20Z",
  "author": "john-loeffler",
  "summary": "A powerfully thin - and pricey - business 2-in-1",
  "verdict": "The Lenovo ThinkPad X1 Titanium is the company's thinnest ThinkPad to date and packs a decent amount of power hitched to a gorgeous display and lightweight but durable build. The innovation is costly though, and even entry-level models might price some people out.",
  "pros": [
    "Great display",
    "Incredibly thin and light",
    "Solid performance"
  ],
  "cons": [
    "Expensive",
    "Limited ports",
    "Keyboard not the best",
    "No pen garage"
  ],
  "article": [
    "The Lenovo ThinkPad X1 Titanium Yoga is a powerful business 2-in-1 packed in a seriously slender chassis, with a durable build and a fantastic display. While not quite as light or slender as the Lenovo ThinkPad X1 Nano, it's more portable than most and the 3:2 screen ratio gives you plenty of real estate for notetaking, sketching, and other collaborative tasks.",
    "It isn't without its flaws, however - the first of which is a steep price point. The X1 Titanium Yoga starts at $1,689 / £1,669 / AU$2,735, making it more expensive than other competing 2-in-1s, and the thinness of the laptop all but rules out a pen garage. Though the Lenovo Precision Pen does come with the X1 Titanium Yoga, there's no way to house it within the laptop (though it does attach magnetically to the side), so you'll have to keep track of it as you go.",
    "Speaking of, the limited number of ports can also be a problem for some. Though there are two USB Type-C ports with Thunderbolt 4, you'll likely need one of them for charging at some point, which gives you just one port to work with. This all but guarantees that you're going to need to bring a dock with you. That, together with the pen and a 65W charger, and you start having a bit of mess to wrangle when you're on the move.",
    "If you've got all that handled though, the X1 Titanium Yoga will give you solid performance with a vibrant display with up to 450 nits of brightness that can hold up reasonably well in bright, sunny environments - perfect for getting some work done in a park or at a coffee shop, which we definitely appreciated after being stuck inside for the past year.",
    "The Lenovo ThinkPad X1 Titanium Yoga is available now, with the entry level model starting at $1,689 / £1,669 / AU$2,735. This comes with an Intel Core i5-1130G7 regardless of market, but in the US, the entry level model comes with a 512GB PCIe SSD and 16GB RAM, while the UK's entry level model drops this down to a 256GB PCIe SSD with 16GB RAM, and Australia's starts of with 256GB PCIe SSD and half the RAM at just 8GB.",
    "The Lenovo ThinkPad X1 Titanium Yoga is Lenovo's thinnest ThinkPad yet, coming in at just 0.45 ins (11.85 mm) thick, which is 0.10 in / 13.87 mm less than the X1 Nano. The titanium-carbon-magnesium chassis helps keep things light, though it does lack the feel of an aluminum-alloy build and can feel almost like plastic to the touch.",
    "The underside has some venting for airflow, but not much. Fortunately the X1 Titanium Yoga doesn't get too hot under strain and the heat vents out the back, but given its thinness, there isn't much in the way of real cooling here.",
    "The screen bezels aren't the slimmest we've ever seen, and there is a decent amount of chin on the display, as well as a thicker top bezel to accommodate the webcam. Speaking of the webcam, there is a physical privacy shutter that blocks the camera when its not in use, which should be a standard feature on every webcam at this point, but sadly still isn't the case.",
    "The 13.5-inch display itself is just gorgeous with a crisp 2256 x 1504p (3:2) resolution and up to 450 nits of brightness. The anti-smudge display does a decent enough job keeping fingerprints off it and it is very responsive to the Lenovo Precision Pen, so notetaking and annotating is a breeze.",
    "The top firing speakers are surprisingly robust given the space Lenovo is working with here. Remote meetings sounded great and the audio during our HD video battery test was excellent and can easily fill a medium-sized room.",
    "We really like Lenovo keyboards, so we're a bit disappointed in this one. The key travel is pretty shallow and while we don't feel like it inhibits us while typing, it takes some getting used to, for sure. The X1 Titanium Yoga also has the same keyboard quirk as the X1 Nano in that its Function key is the farthest-left key on the bottom row, which is normally the Control key.",
    "Given how often we use Ctrl and Ctrl+Shift commands, we still have trouble getting used to this key placement. The bright-red track button in between the G, H, and B keys was responsive and didn't get in the way of our typing, while the mouse button placement beneath it at the top of the trackpad is comfortably placed.",
    "The 360-degree hinges can feel stiff, but when using the X1 Titanium Yoga in tablet mode, the display holds tightly to the chassis, making it very comfortable to use. The pen meanwhile has a magnetized side that clips to the top-right of the display, and while we tend to like garaged pens for their convenience, there is no denying that the Lenovo Precision Pen feels much more like an actual pen, so while you lose something on the portability, you gain something on functionality. Just don't lose it!",
    "When it comes to ports, the Lenovo ThinkPad X1 Titanium Yoga had to make to biggest compromise to get it as thin as it is. There are only two USB Type-C ports, a 3.5mm combo jack, and a Kensington lock slot, and one of those USB ports might be taken up by a charging cable. Still, two Thunderbolt 4 ports are better than one - or none - so its an acceptable compromise.",
    "The performance of the Lenovo ThinkPad X1 Titanium Yoga is fairly in line with what we'd expect from a 2-in-1. It can handle the kinds of productivity apps that business users will spend most of their time with when using the X1 Titanium Yoga, but this is not the greatest 2-in-1 laptop for heavy multimedia work.",
    "The Intel Iris Xe graphics are definitely a step up overall, but they are still integrated graphics, so sketching something out in Photoshop works great, but applying a bunch of filters might not.",
    "This is also definitely not something that's going to handle gaming very well, but it's a 2-in-1, so you probably already knew that.",
    "On the plus side, unlike the Lenovo ThinkBook 14s Yoga, the X1 Titanium Yoga is Intel Evo certified, so it comes with the kinds of everyday efficiencies like fast startup that Intel Evo certification implies but really is hard to capture in 3DMark and Geekbench scores.",
    "Still, for a 2-in-1 this expensive, we'd have liked to see a bit more performance from it, especially considering that the 14s Yoga is much cheaper for the same or better internals.",
    "As for its battery life, there is a bit of a mixed bag here, with the battery lasting eight hours one minute in our PCMark10 battery benchmark - which is below Intel's Evo battery life standard of nine hours, but it lasted 10 hours 13 minutes in our HD movie test, so if you averaged the two, you'd be roughly where Intel Evo says it should be. That's pretty impressive considering that the X1 Titanium's battery is only 44.5WHr, compared to the 60WHr battery for the 14s Yoga.",
    "Fortunately, there isn't really any bloatware with the Lenovo ThinkPad X1 Titanium Yoga, as there shouldn't be for a business laptop, much less one as pricey as this. It does come with Lenovo Vantage, which is pretty standard for Lenovo laptops and isn't egregious.",
    "The security features are quite good, which is to be expected from a business laptop, though part of good security is not expecting to be secure, but we could go round and round on that. In addition to the physical privacy shutter over the webcam and the Kensington lock on the side, there is also an IR camera that pairs well with Windows Hello. There's also a fingerprint scanner above the keyboard for an additional layer of security."
  ],
  "headers": {
    "0": "Two minute review",
    "4": "Price and availability",
    "5": "Design",
    "14": "Performance",
    "20": "Software and features",
    "22": "Don't buy it if..."
  },
  "links": {
    "Lenovo ThinkPad X1 Nano": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-nano-review",
    "notetaking": "https://www.techradar.com/news/best-note-taking-app-ipad-pro",
    "Lenovo ThinkBook 14s Yoga": "https://www.techradar.com/reviews/lenovo-thinkbook-14s-yoga-review"
  }
}