{
  "source": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
  "title": "Samsung QN900A Neo QLED 8K TV review",
  "category": "televisions",
  "updated": "2021-11-22T13:26:58Z",
  "author": "stephen-lambrechts",
  "summary": "The QN900A is one of the best TVs we've reviewed",
  "verdict": "The Neo QN900 QLED TV is a stunning TV that sets a new benchmark when it comes to high-end televisions. It's significantly brighter and shrinks down the bezel to almost nothing. While 8K content is limited, Samsung's Multi-Intelligence AI upscaling offers a better picture while we all wait for this resolution to replace 4K. Of course, you're going to be paying big for Samsung's best.",
  "pros": [
    "Exceptional brightness",
    "OLED-like black levels",
    "Near-invisible bezels"
  ],
  "cons": [
    "It'll cost you",
    "Reflective screen"
  ],
  "article": [
    "On the cusp of a new era in TV technology, Samsung's Mini LED-sporting QN900A Neo QLED 8K TV offers stunning picture quality, exceptional color and brightness, terrific sound and outstanding blacks – all in a package that's unmatched in terms of design.",
    "If you're unfamiliar, Samsung's 'Quantum' Mini LEDs are 1/40th the thickness of a regular light-emitting diode, meaning thousands of smaller LEDs can be packed together in a much tighter fashion, allowing for far more accurate dimming zones and black levels that are practically indistinguishable from an OLED to this reviewer's eyes.",
    "Of course, that doesn't mean Samsung's Neo QLED is to able to produce lights and colors at the individual pixel-level like an OLED TV can, only that it does a comparable job when it comes to contrast.",
    "Outside of its new lighting technology, the QN900A excels in terms of picture quality, with an astonishing 8K resolution display that does a brilliant job of upscaling 1080p and 4K content thanks to the AI-based 'Neo Quantum Processor 8K'.",
    "Gamers are bound to love the QN900A, thanks to a number of next-gen ready features, including support for 4K/120fps or 8K/60fps gameplay via HDMI 2.1, Game Motion Plus and AMD FreeSync Premium Pro.",
    "It probably goes without saying that the QN900A's pricing will prove prohibitively expensive for most people – particularly the 85-inch model reviewed here. However, those of you with money to spend who are looking for the current benchmark in top-end televisions will find very little to fault with Samsung's QN900A Neo QLED 8K TV.",
    "With the arrival of its QN900A range, Samsung has essentially stepped into a new television category, giving its already high-end 8K displays a rather significant Mini LED upgrade. Because of this, Samsung's Neo QLED 8K lineup doesn't come cheap.",
    "The QN900A range starts at $4,999 for a 65-inch model (£5,999 / AU$7,579), while larger models see it go up to $6,999 (£7,999 / AU$10,499) for the 75-inch, and $8,999 (£11,999 / AU$13,999) for the 85-inch, which is the one we've reviewed.",
    "We're already seeing deals on Samsung TVs for Black Friday this year, with this QN900A seeing a whopping $1,700 off in mid-November in the US. Check out the best Black Friday TV deals for the latest offers, though, as the discount may not last.",
    "When viewed for the first time, it's hard not to gush over the QN900A's stark minimalism, which aims to make everything but the content you're watching melt away from view.",
    "The first thing you'll notice (or maybe not notice) is the TV's nearly non-existent bezel, which has been reduced to less than a millimeter (0.9.mm) – an achievement made possible by a new and exclusive matrixing technology that's said to shrink the space between where the pixels at the edge of the display end and where the bezel begins.",
    "The next thing you'll probably wonder is where the QN900A's speakers are, as they're not visible from front-on. In fact, the TV's speaker grilles can be found along its left and right edges, housing an 80W 6.2.2 channel system (that's ten speakers in total).",
    "Continuing the trend of aesthetically pleasing design elements is the QN900A's stand, which is slim, flat and centered, meaning you won't need an especially wide surface to place the TV on.",
    "Like all of Samsung's premium televisions for the last few years, the QN900A aims to reduce cable clutter by having a separate One Connect box that houses all but one of the TV's ports.",
    "This is still a convenient alternative to awkwardly plugging several cables into the back of the TV itself (especially if you plan to wall-mount the unit), and the QN900A offers the added bonus of being able to attach the One Connect box directly to the back of the stand if you don't have a good hiding spot for it.",
    "HDMI 2.1 is supported across all four of the TV's HDMI ports, with one also offering eARC support, and there's also 3x USB 2.0 ports, 1x ethernet port, 1x optical output and an RF antenna input.",
    "If there's one design area we can fault, it's that the QN900A's screen can be quite reflective in well-lit rooms. Though the TV boasts an anti-reflection layer, we found it nearly impossible to take a picture of the set's black levels without the light from a nearby window reflecting back at us.",
    "Aside from this, Samsung's QN900A Neo QLED 8K is a television that's class-leading when it comes to design. With bezels that have been reduced to the point of nearly non-existent, speaker grills that are only visible from the side, and a minimalist stand that also provides additional functionality, the QN900A's design is what every TV manufacturer should aspire to.",
    "If you've owned or used a Samsung TV in the last few years, you'll know more or less what to expect from the QN900A's smart Tizen-based OS.",
    "A press of the home button on your remote will see your favorite apps and sources pop up from the bottom edge of the display in a horiztonal line.",
    "Cycling through these will see additional information spring up above the initial row of apps. For instance, hovering over a streaming service like Netflix will present you with a view of your recently viewed shows and movies, allowing you continue directly from your home screen.",
    "All the most popular apps and services are present and accounted for on Samsung's OS, and there's a dedicated Apps tile with further app suggestions which you can install.",
    "Additionally, the QN900A's remote offers a couple of dedicated buttons that allow you to quickly launch Netflix and Amazon Prime Video.",
    "In terms of design, the Neo QLED 8K's remote is quite similar to what Samsung's been offering with its other TVs over the last few years, with one major difference – the new remote no longer needs batteries, with a new panel on its rear that's able to absorb light – both natural and artificial – to keep itself charged up.",
    "The choice to ditch batteries is not only great for the environment, it's also made the remote itself incredibly light in the hand. That said, you will have to get used to placing the remote face down when you've finished using it.",
    "As we mentioned earlier, Samsung Neo QLED televisions sport LEDs that have been reduced to 1/40th of their traditional size, allowing for a huge increase to both brightness and black levels.",
    "As the LEDs are far smaller, they're able to achieve far more precision and less blooming, so the act of seeing bright areas of the screen unnaturally bleed over into darker spots should be greatly reduced or not evident at all.",
    "We kicked things off by watching the stunning documentary series Our Planet on Netflix. Immediately, we were treated to a view of Earth from the moon, with a wide expanse of tiny, glittering stars surrounded by the deep blackness of space. That we could make out these individual specs without light bleeding around them was more than impressive for a non-OLED display.",
    "Skipping forward a bit, we found ourselves viewing a lush, green rainforest against a backdrop of picturesque mountains. The detail here was off the charts, with an intense clarity that looked sensational given its 4K source, proving that there's no real hurry for native 8K content to arrive.",
    "The next thing we booted up was Robert Rodriguez's visually spectacular epic Alita: Battle Angel in Ultra HD. Once again, we were impressed by how sharp and clean the film looked on the QN900A, offering an incredible amount of detail, rich colors and deep blacks.",
    "It's worth mentioning that we did notice some instances of light bleed in one scene near the beginning of the film, in which Alita is looking over her new mechanical body.",
    "In the image below, you'll see some light bleeding from her bright chest plates into the black bar at the bottom of the screen. Of course, we didn't really notice this elsewhere, and it must be said that the highlights in this scene are especially bright. Still, it does show that even with Mini LEDs that light bleeding can still occur.",
    "One of the big selling points of any 8K TV is how well it handles upscaling. and thankfully the QN900A does a great job of making content look crystal-clear without any artificial smoothing. Take the above image of Alita as an example – it's clean and sharp, yet you can still make out its fine, film-like grain.",
    "Taking advantage of Samsung's Multi-Intelligence AI upscaling, the QN900A was consistently able to produce images that looked better than their source. We're not saying that it made any 4K content look like native 8K, but it did make it appear better than Ultra HD when viewed up close.",
    "On 8K TVs, pixels are much closer together, and therefore much more difficult to individually make out than on 4K sets. In our tests, we watched content from a variety of sources, including 480p episodes of Gargoyles on Disney Plus and 1080p episodes or Brooklyn Nine-Nine on Netflix in order to see how the QN900A's upscaling fared.",
    "While there's not a lot that can be done with older standard definition content these days, we were glad to see that it didn't look especially stretched out or fuzzy on this massive 8K screen.",
    "Modern 1080p content, however, looked excellent. Taking into consideration that one FHD pixel is stretched across 16 pixels on an 8K TV, Samsung's AI-powered Neo Quantum Processor 8K chip is necessary to stitch together these additional pixels in a way that's clean and natural looking, without any aliasing or fuzziness to speak of.",
    "While we weren't able to test any 4K/120Hz content during our review period, we did take a look at a number of 8K/60fps test videos and found the QN900A delivered consistently smooth motion with nary a hiccup to speak of (outside of a couple of instances where our Wi-Fi wasn't able to keep up).",
    "Although we were provided with Samsung's new Q950A soundbar for the purposes of our review, we chose to limit our usage of it in an effort to get a better understanding of the Neo QLED's built-in sound offering.",
    "As discussed earlier, the QN900A's speakers have been integrated into the left and right sides of the TV. You won't find audio shouting out of the back of this television, but Samsung's much-touted Object Tracking Sound Pro feature does a good job of bringing depth to whatever you happen to be watching, making it easy to track noises moving from left to right.",
    "While there was some dimensionality to be found here, the telly's built-in speakers couldn't hope to match a real Dolby Atmos-capable soundbar or hi-fi setup when it comes to a providing a truly convincing three-dimensional soundscape.",
    "Despite this, Samsung's top-of-the-line Neo QLED 8K TV offered far better audio performance than we were expecting, with dialogue coming through in a particularly clear and prominent fashion."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Price and availability",
    "9": "Design",
    "18": "Smart TV (Tizen OS) and remote",
    "25": "Performance",
    "38": "Audio",
    "42": "Don't buy it if…"
  },
  "links": {
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "a whopping $1,700 off in mid-November": "https://www.techradar.com/news/this-black-friday-deal-sees-the-best-tv-in-the-world-at-the-cheapest-its-ever-been",
    "best Black Friday TV deals": "https://www.techradar.com/black-friday/tv-deals",
    "One Connect box": "https://www.techradar.com/news/samsung-one-connect-box",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "Ultra HD": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "8K/60fps test videos": "https://www.youtube.com/watch?v=zCLOJ9j1k2Y",
    "Q950A": "https://www.techradar.com/news/samsungs-new-dolby-atmos-soundbar-could-be-its-most-immersive-yet",
    "Object Tracking Sound Pro": "https://www.techradar.com/news/sony-acoustic-surface-audio-vs-samsung-ots-which-tv-audio-tech-is-better",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066"
  }
}