{
  "source": "https://www.techradar.com/reviews/exodus-cryptocurrency-wallet",
  "title": "Exodus cryptocurrency wallet review",
  "category": "computing",
  "updated": "2021-01-28T20:39:02Z",
  "author": "mayank-sharma",
  "summary": "One of the best desktop wallets currently on offer",
  "verdict": "Exodus is a multi-currency, cross-platform crypto wallet that is a strong option for anyone just getting into the crypto space.",
  "pros": [
    "Over one hundred cryptocurrencies",
    "Intuitive interface",
    "Supports all platforms",
    "Updated every two weeks"
  ],
  "cons": [
    "Not fully open source",
    "Custom fees only for Bitcoin"
  ],
  "article": [
    "Exodus is a multi-currency wallet that supports over a hundred cryptocurrencies. The crypto wallet was originally available only on desktop, but is now also available for iOS and Android mobile platforms as well.",
    "Exodus sets itself apart from other wallets with a design focus on people who have never dabbled with cryptocurrencies. It has an easy-to-use interface and its developers spend a great deal of time and effort polishing the UI to make it more intuitive.",
    "One of Exodus’ most popular features is support for a range of different altcoins, as well as Bitcoin. You can also use the wallet to exchange one cryptocurrency for another without any form of registration.",
    "Remember, however, that Exodus is a light wallet that uses Simplified Payment Verification, which means it doesn’t download complete blockchains and instead uses a series of servers to track wallet balances.",
    "Exodus is a cross-platform app available that’s available for Windows, macOS, and Linux. Since it doesn’t demand registration, you can simply download the app and install it to get started.",
    "Note, however, that while its developers maintain that they take all steps to ensure that the app is secure, it doesn’t include two-factor authentication support, and only relies on a password.",
    "Also, unlike some of its peers, Exodus also doesn’t implement a relatively new authentication mechanism known as multi-signature address, which requests permissions from multiple devices before initiating any transfers.",
    "Once you are inside the app, the interface is inviting and fairly intuitive. This is quite a feat since the app is designed to offer both crypto exchange and portfolio management services, and you can use it to store, manage and trade cryptocurrencies from one interface.",
    "The app has a handful of icons at the top of the interface that you can use to navigate through its various functions. For instance, the Portfolio icon gives you an overview of your cryptocurrencies along with relevant information such as the price movement in different time frames for different assets. Then there’s the Wallet section from where you can send and receive any of the supported cryptocurrencies, either by scanning QR code or by using wallet addresses. The Exchange tab allows you to trade between cryptocurrencies.",
    "A fairly new addition is the use of apps. You can think of them as plugins that add more functionality to the wallet, such as the ability to earn interest on your cryptocurrencies.",
    "By default, an empty Exodus wallet isn’t locked. However, the process of securing it begins automatically once you’ve made a deposit in the wallet.",
    "To receive crypto, switch to the Wallet tab, and then first select the cryptocurrency you want to receive. You can also view a price chart of the selected crypto on this page, in case you’re interested, else just click and copy the receive address for your wallet. You can also email this address and even take a screenshot of the QR code, which the sender can then scan from their device.",
    "As soon as you receive the first deposit, Exodus will ask you to password protect your wallet. The app, through its documentation and videos, suggests using a password manager app for this purpose, which we believe is a very prudent advice. Exodus will also display a 12 word phrase that’ll help you recover your password. Again the developers suggest jotting this phrase on a piece of paper for offline storage rather than on your computer.",
    "The process to send cryptocurrency from your Exodus wallet is also pretty intuitive. Just click the send button and enter the address of the public wallet you want to transfer the crypto to. Alternatively you can also hover over the QR code option to either scan the QR code of the receiver from the webcam or either from your screen.",
    "In the same fashion, you can easily exchange your cryptocurrencies. Just head to the Exchange section and use the Exchange and Receive pull-down menus to select the cryptocurrencies you wish to exchange between.",
    "In both types of transactions, Exodus will display the relevant information for maximum transparency. For instance, when sending and receiving crypto, the wallet will display the fees it’ll charge for the transfer at the bottom of the screen. Similarly, it’ll display the value of crypto that’ll be debited from your wallet and the amount of crypto that’ll be added when you’re exchanging between two cryptocurrencies. Exodus receives a fee every time you use it to exchange between cryptocurrencies.",
    "Exodus shares more details about the fees in its extensive support section. The section has lots of articles that are nicely categorized into relevant sections, such as getting Started, Buying Crypto, Exchange, and more. There’s also a search bar to help you find information quickly.",
    "In case your query isn’t answered, you also have the option to send a message to the support team. It’s important to note that Exodus doesn’t provide telephonic support, so if you find a number posted online, it’s most definitely posted by a scammer.",
    "Exodus is a software wallet and a hot wallet for most users who are connected to the internet. This, by itself, makes it less secure than a hardware wallet like the Trezor.",
    "In fact, we believe the wallet developers have had to tone down some of the security provisions that you can find with its peers, so as to not ruin Exodus’ usability. For instance, Exodus doesn’t support two-factor authentication, which is a standard on many of its peers such as Electrum and Wasabi.",
    "Another thing to keep in mind is that, although Exodus is built on many open source components, the wallet in itself isn’t open source. So you’ll have to rely on Exodus’ developers to make sure the app is secure and you don’t get the option to scan the code like you can with Mycelium, for example.",
    "Exodus is a good option, especially for those who are just getting started with cryptocurrencies. The wallet, with its inviting design and intuitive interface, is a good option for managing and exchanging small amounts of cryptocurrencies without getting into the nitty-gritties of the process.",
    "We wouldn’t suggest it for advanced cryptocurrency users, primarily because the ability to set custom fees is currently only restricted to Bitcoin. We’ve also penalized the wallet for prioritizing user experience over security in some quarters. And while it’s a good thing the app gets updated every two weeks, the fact that it isn’t entirely open source will put some people off.",
    "In all fairness, though, Exodus doesn’t aim to please all kinds of users. It’s designed to appeal to beginners and users who don’t mind paying for the convenience of trading and exchanging cryptocurrencies, quickly and without hassle."
  ],
  "headers": {
    "4": "Interface and ease of use",
    "10": "Transferring funds",
    "15": "Support",
    "18": "Alternatives",
    "21": "Final verdict"
  },
  "links": {
    "Exodus": "https://www.techradar.com/reviews/exodus-cryptocurrency-wallet",
    "crypto wallet": "https://www.techradar.com/news/best-bitcoin-wallets",
    "altcoins": "https://www.techradar.com/news/what-are-altcoins-everything-you-need-to-know",
    "blockchains": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "Windows": "https://www.techradar.com/how-to/software/operating-systems/how-to-upgrade-to-windows-10-for-free-1325764",
    "macOS": "https://www.techradar.com/how-to/how-to-download-and-install-macos-11-big-sur",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "crypto exchange": "https://www.techradar.com/best/mining-rigs",
    "password manager": "https://www.techradar.com/best/password-manager",
    "hot wallet": "https://www.techradar.com/news/what-is-a-hot-wallet-for-cryptocurrency-everything-you-need-to-know",
    "Trezor": "https://www.techradar.com/reviews/trezor-model-t-cryptocurrency-wallet",
    "Electrum": "https://www.techradar.com/reviews/electrum-cryptocurrency-wallet",
    "Mycelium": "https://www.techradar.com/reviews/mycelium-cryptocurrency-wallet",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin"
  }
}