{
  "source": "https://www.techradar.com/reviews/lg-gram-16-2021",
  "title": "LG Gram 16 (2021) review",
  "category": "computing",
  "updated": "2021-06-10T05:51:13Z",
  "author": "matt-hanson",
  "summary": "New for 2021",
  "verdict": "The LG Gram 16 (2021) is a fantastic laptop, packing Intel’s latest mobile processors and is incredibly light. Intel Evo laptops are supposed to give us a glimpse of the future of laptops, and with its ultra lightweight design and incredible battery life, in many ways the LG Gram 16 (2021) does that. However, the design is a little boring – we’d like to see future laptops have a bit more style about them. The price is incredibly high as well.",
  "pros": [
    "Extremely light",
    "Excellent battery life",
    "Very good screen",
    "Quiet"
  ],
  "cons": [
    "Expensive",
    "Some bloatware",
    "Design is a bit plain"
  ],
  "article": [
    "The LG Gram 16 (2021) is the latest iteration of LG’s fantastic thin and light laptop range, and not only does it bring cutting edge components with Intel’s 11th generation mobile processors, but it now comes in a new size as well: 16-inches, alongside the 14- and 17-inch variants as well.",
    "As an Intel Evo-certified laptop, the LG Gram 16 (2021) is supposed to offer us a glimpse of the next evolution in laptop design. If that’s the case, then the future appears to be a mix of exciting and boring. Let us explain.",
    "First of all, the LG Gram 16 (2021) is incredibly light, weighing in at just 2.62 pounds (1.18kg). Picking it up, you’ll be seriously impressed with just how light it is. It’s probably the biggest reason to buy the LG Gram 16 (2021), and it’s also the hardest to understand until you physically hold it. But trust us, this thing is light.",
    "It’s also got a new 16-inch screen, which is a nice middle ground between the previous model’s choice of 13-inch and 17-inch displays. If gives you more workspace, but without being too big.",
    "As an Intel Evo laptop, it uses Intel’s latest 11th generation processors, and this means the laptop is nice and speedy in day-to-day use. Windows 10 boots quickly (and you can log in with just a press of the power button, thanks to a built-in fingerprint sensor. It’s a very accomplished laptop in that regard, and it’s ideal for people looking for a work laptop, or something for school. It also packs Thunderbolt 4 ports, so you’re getting support for cutting-edge peripherals and storage. Thankfully, the LG Gram 16 (2021) also comes with plenty of other ports, including full-size USB and HDMI, so older devices can be plugged in without needing an adaptor.",
    "Battery life is also a reason to be excited about the LG Gram 16 (2021) and what it means for future laptops. Lasting well over 11 hours in some of our tests, this is an incredible achievement for a Windows 10 laptop offering this kind of performance.",
    "So, what makes us a bit apprehensive about the LG Gram 16 (2021) being the future of laptops? First the design. It’s straightforward to the point of being a bit boring. We want future laptops to really push at the boundaries of traditional laptop formfactors, and showing us new ways to use them. This laptop, however, doesn’t do that.",
    "It also comes with pre-installed software which often pop-up messages to bug you into buying subscriptions. This is something we’d like to see consigned to the past.",
    "It’s also very expensive, starting at $1,299 / £1,249 / AU$2,398. While its performance, light design and gorgeous screen means that price tag is somewhat justified, we’d rather a future of laptops that’s more accessible to everyone.",
    "But judging the LG Gram 16 (2021) on being the future of laptops is perhaps unfair. In the here and now, this is a brilliant laptop that handles tasks with ease. Its weight means it’s easily portable, and the 16-inch screen is comfortable to work on. Best of all, the battery life means it’ll last throughout a work or school day with ease.",
    "The new LG Gram 16 (2021) is on sale now, with entry-level configurations starting at $1,299 / £1,249 / AU$2,398.",
    "This base model comes with an Intel Core i5-1135G7 processor, 8GB RAM, 512GB storage and a 16-inch screen.",
    "There’s also a version for $1,399 / £1,449, available in some markets, which comes with an Intel Core i7-1165G7 CPU, 16GB of RAM and 256GB of storage. The improved processor and extra RAM appears to be a very good upgrade for the extra money, but it’s a shame you have to settle for half the storage capacity.",
    "In the US, there’s also a model for $1,699, which ups the storage considerably to 1TB.",
    "LG will also release a new convertible 2-in-1 version of the LG Gram 16 (2021), but that will be released in the future.",
    "The 16-inch model is a first for the LG Gram lineup, but the 14-inch and 17-inch versions are still with us, with updated internals as well.",
    "As you’d expect, the 14-inch models sit below the 16-inch in terms of price, starting at $999 (around £800), which puts it in the same price category as the MacBook Air (M1, 2020).",
    "Meanwhile, the LG Gram 17 (2021) costs more, with the base configuration going for $1,799 / £1,549, or AU$2,998 in Australia.",
    "As the name suggests, the main selling point of the LG Gram lineup is its ultra-low weight, and LG claims the LG Gram 16 (2021) is the lightest 16-inch laptop in the world at just 2.62 pounds (1.18kg). That’s almost half the weight of the Apple MacBook Pro (16-inch, 2019), and if that sounds impressive, just wait until you pick it up yourself.",
    "The fact that a reasonably large-screen laptop like the LG Gram 16 (2021) is so effortlessly carried around really is impressive. It can be comfortably held in one hand, and if you pop it in a bag or backpack to carry around with you, you can almost forget it’s there.",
    "It’s an impressive illustration that you don’t have to stick with a 13-inch laptop if you want something lightweight. The LG Gram series, especially the 16-inch and 17-inch models, prove that screen size doesn’t have to be sacrificed for a lightweight laptop. However, perhaps unsurprisingly, the LG Gram 14 (2021) is the lightest of the lineup.",
    "The lightness of the LG Gram 16 (2021) may at first make you think that it feels a bit delicate, maybe even a little cheap. It lacks that reassuring heft of premium laptops clad in aluminum chassis, but that’s a price you’ll pay for this incredibly light design.",
    "Also, just because it feels delicate, it doesn’t mean it is. In fact, the LG Gram 16 (2021) has a full metal body (using the same material found in aircraft material) that passes the MIL-STD-810G military standard for durability. So, it can survive knocks and drops, as well as high and low temperatures, vibrations and dust.",
    "The dimensions are 14.01 x 9.58 x 0.66-inches (355.9 x 243.4 x 16.8 mm), so it’s not the most compact laptop, but it will still easily fit in most bags without issue. The size of the 16-inch laptop also makes its weight even more impressive. Throughout our time with the LG Gram 16 (2021) we kept picking it up and kept on being surprised by just how light it felt – almost as if we couldn’t quite grasp how a 16-inch laptop could weigh so less. It’s seriously impressive.",
    "When it comes to ports, the LG Gram 16 (2021) is surprisingly well-equipped. On the left-hand side is a full size HDMI port, two Thunderbolt 4 USB-C ports, which are also used to power the laptop and charge its battery, and an audio jack.",
    "On the right, are two USB 3.2 ports and a microSD port. It’s a great array of ports, and the HDMI, USB 3.2 and microSD ports in particular are welcome, as it means you don’t have to worry about dongles. It highlights that laptops don’t have to sacrifice ports just to be thin and light.",
    "On opening up the laptop, you’re met with a rather basic look, which some may find a bit boring, but means this is a smart looking device that you could use in meetings or in the office without anyone batting an eyelid. It also means you likely won’t get people coming up and lusting over it, like you may do with a Dell XPS 13 or HP Envy x360 – but if you hand it to them and they see how light it is, we bet many people will fall in love.",
    "The 16-inch screen certainly makes an impact as well. Thanks to the thin bezels around it, and the taller 16:10 aspect ratio, it means it grabs your attention whenever it’s displaying anything. Image quality is great as well, with its 2,56t0 x 1,600 WQXGA resolution, and supports 99% of the DCI-P3 color gamut. This is an industry standard often used by video editors, and it means colors aren’t just bright and vibrant, but they are accurate as well.",
    "The keyboard is a good size, with a satisfying key travel which means it’s comfortable and satisfying to type on. The keys are backlit, which allows you to type in low light levels as well – though unlike gaming laptops, you can’t change the color of the lights behind the keyboard, but that won’t be much of a consideration for most people.",
    "The power button is included at the top of the keyboard, and includes a built-in fingerprint reader. We found it fast and accurate when using it to log into Windows 10 – a big improvement on some fingerprint readers included in Windows 10 laptops.",
    "Meanwhile, the touchpad is large and comfortable to use.",
    "Overall, the design of the LG Gram 16 (2021) is a little on the basic side, which means when it comes to looks, it doesn't really stand out or have an iconic look. However, this is easily overlooked by just how light it is - it's a really impressive engineering feat to get a 16-inch laptop to weigh so little.",
    "The LG Gram 16 (2021) is an Intel Evo-certified laptop, which means it comes with certain specs and features which Intel claims makes it part of the 'next evolution' in laptop design. This means it comes with Intel's 11th generation mobile processors and Intel Iris Xe graphics.",
    "The model we reviewed comes with Intel Core i7-1165G7 CPU, 16GB of RAM and 256GB of storage. The CPU and 16GB of RAM ensures this is a laptop that feels impressively sprightly when running Windows 10.",
    "During our time with the LG Gram 16 (2021), the laptop performed nicely for day-to-day tasks like document creation and web browsing. The taller 16:10 aspect ratio of the screen is a benefit with portrait documents, giving you more vertical space, which means less scrolling. The screen looks great, though it has a glossy finish that means it’s very reflective, which can prove distracting, especially if you’re working in areas with bright lights.",
    "The keyboard feels great in use as well, and overall we were impressed with how the laptop performed. It’s not a device that you’re going to do any heavy video editing on, for example, nor gaming, so we didn’t notice the fans kicking in to keep the device cool.",
    "For general use, then, the LG Gram 16 (2021) is a great choice. For work (including schoolwork), the LG Gram 16 (2021) is a worthwhile investment, especially with its lightweight design.",
    "Photo editing is also good on this thing, thanks to the lovely screen, while the integrated Iris Xe graphics are enough to handle photo editing and video editing for most casual users. If you do a lot of video editing in 4K resolutions and above, however, check out our list of the best video editing laptops for better suggestions.",
    "As an Intel Evo-certified laptop, the LG Gram 16 (2021) has to offer over nine hours of battery, and the good news is that it did just that, with it lasting nine and three quarter hours in our battery tests, which runs a looped 1080p video with the screen at 50% brightness.",
    "This is an excellent result, and means for light workloads, the LG Gram 16 (2021) will easily outlast an entire work or school day. Even on long haul flights, for example, you’ll be able to use this laptop without worrying about charging it.",
    "The results of the PC Mark 10 battery life benchmark were even more impressive, with the laptop lasting 11 hours and 22 minutes. The PC Mark 10 battery life test replicates more intensive workloads, such as video calling, so it’s great to see such an impressive showing here. Considering the spec, getting this much out of a single charge is excellent, and means you can comfortably use the LG Gram 16 (2021) throughout the day (or even several days) without needing to plug it in.",
    "When it does need plugging in, it charges up impressively fast via the USB-C ports. You can use any USB-C charger, then, though some smartphone chargers won’t offer enough juice to charge the battery, instead it’ll just make sure that the battery doesn’t drain any further.",
    "The LG Gram 16 (2021) comes with Windows 10, and it’s overall a good showcase for the operating system. LG has also packed it with quite a bit of pre-installed applications – which people often refer to disparagingly as bloatware.",
    "This software isn’t great, to be honest, and in the best case scenario they sit on your SSD and you rarely – if ever – use them or know they are there.",
    "However, there are some apps that make their presence known – annoyingly so. There’s the Alexa app, for a start. While it allows you to make use of Amazon’s virtual assistant, is also keeps popping up an annoying window asking you to set it up.",
    "While on paper adding Alexa to a laptop is nice, in reality we can’t really see the point of using a virtual assistant on a laptop – you’re already close enough to a keyboard to simply type in what you’re looking for – and in busy environments you don’t really want to be sat there chatting away to your laptop. Also, with Microsoft’s Cortana installed in Windows 10 – it feels a bit overkill to have two virtual assistants you’re never going to use installed on a laptop.",
    "Also, this laptop comes with a McAfee anti-virus trial. This will disappoint anyone who’s bought a new laptop with McAfee preinstalled before. It continues to be a nuisance, continually popping up warnings to say your trial is about to expire, and encouraging you to subscribe.",
    "The built-in anti-virus in Windows 10 is good enough for many people, so having this software nagging you so much can be really frustrating, especially on a laptop that’s so expensive.",
    "The LG Control Center is also included, and that is fine, giving you quick access to certain settings, and allowing you to control how loud the fans are. Not the most useful app, but it doesn’t go out of its way to annoy you, like the McAfee and Alexa apps do."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Price and availability",
    "18": "Design",
    "32": "Performance",
    "38": "Battery life",
    "42": "Software",
    "49": "Don't buy it if..."
  },
  "links": {
    "LG Gram 17": "https://www.techradar.com/reviews/lg-gram-17-2021",
    "Apple MacBook Pro (16-inch, 2019)": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review"
  }
}