{
  "source": "https://www.techradar.com/reviews/libertex",
  "title": "Libertex review",
  "category": "computing",
  "updated": "2021-01-07T21:59:23Z",
  "author": "jitendra-soni",
  "summary": "Forex trading and more with low-cost commissions",
  "verdict": "Libertex offers an easy to use app used by millions of clients worldwide for trading in forex and CFDs.",
  "pros": [
    "Low minimum deposit",
    "Powerful browser-based platform",
    "Zero spreads on all accounts and instrument types"
  ],
  "cons": [
    "Limited learning resources",
    "Only two account choices"
  ],
  "article": [
    "Looking for the best forex trading app? Then Libertex is worthy of your attention. This online trading platform charges flat commissions for every transaction rather than variable spreads, which makes it easier to know how much trading will cost you. On top of that, Libertex offers two powerful trading platforms and a wide variety of assets. Just bear in mind that while Libertex is regulated in Europe, it isn’t available to US traders.",
    "In our Libertex review, we’ll cover everything you need to know to decide whether this trading platform is right for you.",
    "Libertex offers trading in around 250 different markets. That includes 50 different forex pairs as well as dozens of commodities like crude oil and gold and 43 of the most popular cryptocurrencies. Libertex also offers a small range of US stocks and ETFs in addition to 19 global indices, although its variety of stock market assets pales in comparison to traditional stock brokers.",
    "Notably, all of the assets that Libertex offers are traded as CFDs (contracts for difference). Instead of taking ownership of the underlying asset—say, euros when trading the EUR/USD forex pair—you are buying a contract that simply reflects changes in the price of the asset. CFDs are widely used for forex and commodity trading and they eliminate the headaches that come with actually owning foreign currencies outright.",
    "Signing up for a Libertex account is easy and only takes a few minutes. You can sign up using your email address, although you will need to provide personal details like your address and national ID number. Libertex also requires that you verify your identity online in order to comply with international anti-money laundering rules. So, you’ll need to upload a copy of your passport photo page or your driver’s license.",
    "Once your account is set up, Libertex requires a €100 minimum deposit before you can start trading. The platform accepts a variety of payment methods, including bank transfers and credit or debit cards. After that, you can start trading any of the assets available on Libertex.",
    "Libertex is not currently available in the US, although it is available in the UK, Canada, Australia, and most European countries.",
    "Libertex offers two different trading platforms: the proprietary Libertex platform and MetaTrader 4. Both are available for web and mobile, and MetaTrader 4 is available as a desktop app as well.",
    "The Libertex platform enables you to trade any of the assets that Libertex offers, including forex, cryptocurrencies, commodities, and stocks. It offers a fairly comprehensive suite of charting tools that allow you to add popular technical studies and annotate your charts. We also liked that Libertex shows you what fraction of traders are buying an asset as opposed to selling it.",
    "In contrast to the Libertex platform, MetaTrader 4 only offers forex trading. However, it has a much more advanced set of features, including the ability to create your own technical studies and indicators. You can also set up trading signals, which are essentially customizable alerts based on a set of user-defined parameters, and backtest your signals based on historical price data for any currency pair.",
    "There are several key features that distinguish Libertex from other online forex brokers.",
    "Libertex is one of the only forex brokers to charge fixed trade commissions instead of variable spreads. This makes it easier to know exactly how much you’ll pay to trade. The broker’s forex spreads are typically below the industry average. For example, the EUR/USD pair carries a commission of 0.008% at Libertex compared to an average spread of around 0.01% for the industry.",
    "One of the benefits to trading CFDs is that you can easily apply leverage to your trades at Libertex. The broker supports leverage up to 30:1 for major forex pairs, and up to 600:1 if you’re a professional trader.",
    "Libertex offers a free demo trading account with €50,000 in paper money to help you practice trading. The demo account gives you access to the entire Libertex trading platform and offers a chance to try out strategies risk-free.",
    "Libertex is regulated by the Cyprus Securities and Exchange Commission (CySEC), a well-respected financial watchdog. We also like that Libertex is up-front about its privacy policy and that the broker keeps clients’ funds segregated from its own.",
    "Libertex provides 24/5 support by phone, email, and live chat. The company has won a number of awards for its customer support in the past. In addition, Libertex has an online knowledge base where you can find answers to most common account questions.",
    "Libertex is a high-quality forex trading platform, but it doesn’t have the wide selection of currency pairs or alternative assets that some other online brokers offer. For example, CMC Markets offers CFDs for over 300 forex pairs, while IG offers more than 80 forex pairs and thousands of stocks. Importantly, IG also accepts US traders. The main downside to these platforms is that they charge variable spreads that can be up to twice as expensive as Libertex’s fixed commissions for popular forex pairs.",
    "Libertex has established itself as one of the best low-cost forex trading platforms. This online broker offers CFDs for 50 different currency pairs, plus dozens of commodities, cryptocurrencies, and stock indices. It’s also one of the only brokers to charge fixed commissions instead of variable spreads. Libertex isn’t available in the US, but it’s a strong option if you’re based in Canada, Europe, or elsewhere."
  ],
  "headers": {
    "2": "What does Libertex offer?",
    "4": "Getting started",
    "7": "Trading platforms",
    "10": "Features and services",
    "15": "Support",
    "16": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "best forex trading app": "https://www.techradar.com/news/best-forex-trading-apps",
    "Libertex": "https://libertex.com/",
    "CMC Markets": "https://www.cmcmarkets.com/en/",
    "IG": "https://www.ig.com/us"
  }
}