{
  "source": "https://www.techradar.com/reviews/vivaldi",
  "title": "Vivaldi browser review",
  "category": "computing",
  "updated": "2021-08-29T00:14:28Z",
  "author": "lindsay-pietroluongo",
  "summary": "A browsing experience with your own personal stamp",
  "verdict": "Vivaldi is a brilliant browser that you can customize to your heart's content and there's not much it can't do except run on iOS devices.",
  "pros": [
    "Full-featured browser window",
    "Advanced tab management",
    "Considerable data protection"
  ],
  "cons": [
    "Beta features",
    "No iOS support"
  ],
  "article": [
    "Vivaldi is the slim-profile, bold-red browser that covers every aspect of online exploration there is, from search, of course, to personalization, built-in tools, and safety. Essentially, Vivaldi wants you to be able to do anything and everything right from the browser, with as little third-party interference as possible, all while keeping your data super safe and private (even if they don’t know who you are or what you’re up to).",
    "Vivaldi shines when it comes to customization options, but it’s not quite up to speed in terms of its beta products (calendar, contacts, feed reader, and mail). Vivaldi is also not available on iOS, at least not yet, which is a huge drawback for Apple users who don’t necessarily want a different browser experience as they bounce from device to device.",
    "Tab management is a huge component of Vivaldi, and there are so many options here that those alone could fill up an article.",
    "Notably, there are three Tab Stack styles: Accordion, Compact, and Two-Level. This lets you organize your browser tabs in whatever way works best for you, whether you like seeing all of your options at once or you prefer a simplified tab experience.",
    "There’s also a split-screen view mode, where you can see more than one page at once. This is helpful if you need to keep an eye on a page while you focus on another. For example, you may want to keep a chat app or social feed open while you browse or work online.",
    "Command Chains string together browser commands – there are over 200 – and executes them with a single shortcut. If you regularly head online for work, for example, this can automate a workflow to get everything set up and arranged just how you like it.",
    "Other features include ones you’d expect, like a feed reader, page zoom, a reader view (with a minute counter to give you an idea of the length of the content), the ability to set your preferred search engine, and theme customization (dark, light, or personalized). Then there are more distinct features, like note-taking in the sidebar, built-in screen capture, and Vivaldi Translate for full web pages.",
    "Vivaldi also uses Google’s autofill feature, which can fill in your information automatically, like when you’re ordering from a restaurant or shopping online. And if you can’t get what you need from out-of-the-box Vivaldi, it supports many Chrome extensions.",
    "Vivaldi doesn’t profile or track you or collect or sell your data. It can’t see which sites you visit, what you search for, or what you download. Your data is either encrypted or stored just on your machine. The only exception to this is “if requested by legitimate law agencies with a court order.”",
    "Plus, Vivaldi’s built-in ad blocker may help your web pages load faster while keeping ads and trackers away. There’s also a built-in password manager that stores login credentials.",
    "Lastly, Vivaldi uses Google’s safe browsing API, which checks the site you’re on against sites that have malware or phishing flags.",
    "Setting up Vivaldi Mail wasn’t as easy as it first seems. It started off simply: Enter your Google login information. But then it stayed on the “Attempting sign in…” page for so long that it was faster to just nix it and try to deal with it later.",
    "That said, there’s a ton you can do from the browser without opening up settings or using shortcuts, with icons along the left and bottom that offer lots of functionality.",
    "The icons are unobtrusive and put everything you might need in easy reach. On the left, you can see your bookmarks, downloads, history, notes, windows, etc. On the bottom-right, you can perform actions like hiding/unhiding that left-side panel and starting Take a Break, which fades your content and pauses media if you need a time-out.",
    "On the bottom toward the right, you can take a screenshot, tile your pages a few different ways, decide how you want images and videos to behave, and select/deselect a bunch of page actions.",
    "In a way, Vivaldi has almost too many options, particularly when you’re first getting your browser set up. For example, I had the two-level tab option selected but could not figure out how to actually show two levels of tabs, no matter how many I opened. There’s very likely a cure for this, but with so many choices to make in settings, it will take some time to get the browser looking and functioning exactly how you want.",
    "Vivaldi is available on Android, Linux, Mac, and Windows.",
    "Vivaldi has a lot of features that leading browsers don’t have, particularly those that have to do with how you customize your browser. For example, both Google Chrome and Mozilla Firefox lack specialty tab grouping and viewing. And it has more safety features than many browsers offer, thanks to its ad and tracker blocking and its anti-data-collection approach.",
    "Vivaldi gives other leading browsers a true competitor, as it appeals to users of all kinds. Power users can make Vivaldi look and function any way they want, which gives it a real edge for people who carry out their work life online. But casual users will love Vivaldi as well because they can get rid of the bells and whistles and keep things as minimalist as they want. And with serious data-protection features, the ability to keep annoying ads away, and the option to use your favorite search engine, there’s almost no reason not to give Vivaldi a go."
  ],
  "headers": {
    "2": "Features",
    "8": "Privacy",
    "11": "User Experience",
    "16": "Platforms",
    "17": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Vivaldi": "https://vivaldi.com/",
    "browser": "https://www.techradar.com/best/browser",
    "exception": "https://vivaldi.com/privacy/browser/",
    "safe browsing API": "https://www.techradar.com/news/google-chrome-now-warns-you-if-youre-about-to-install-a-dodgy-extension",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "Vivaldi Mail": "https://www.techradar.com/news/vivaldi-40-browser-comes-with-built-in-email",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Mozilla Firefox": "https://www.techradar.com/reviews/mozilla-firefox"
  }
}