{
  "source": "https://www.techradar.com/reviews/htc-vive-cosmos-and-cosmos-elite",
  "title": "HTC Vive Cosmos and Cosmos Elite review",
  "category": "gaming",
  "updated": "2021-03-09T12:34:00Z",
  "author": "nick-pino",
  "summary": "Transforming VR headsets that fit any space and any game",
  "verdict": "The HTC Vive Cosmos and Cosmos Elite are nearly identical PC-tethered VR headsets that can evolve to match the needs of your virtual reality game collection. Both versions use the same 2880 x 1700 resolution LCD display and halo-style headband, but the front faceplate swaps out to allow you to jump from one set of capabilities to another. It’s nice that the Cosmos’ unique modular design allows you to invest less upfront and upgrade as you go, but even the high-end HTC Vive Cosmos Elite isn’t better than the Valve Index.",
  "pros": [
    "High resolution LCD screen",
    "Upgrades to Cosmos Elite",
    "Free Viveport Infinity"
  ],
  "cons": [
    "Cosmos has tracking issues",
    "Cosmos controllers are bulky",
    "Elite uses original accessories"
  ],
  "article": [
    "When it was released in 2019, the HTC Vive Cosmos fell flat. Setting up the VR headset on a PC was tedious and haphazard for most users, and it sometimes failed the basic setup process entirely. But worse still, its state-of-the-art inside-out controller tracking, which used six cameras on the front plate, was ineffective at best.",
    "In short, the original version of the Vive Cosmos wasn’t a VR headset we could wear for very long, let alone one we’d feel comfortable recommending to anyone.",
    "However, after some significant software and firmware updates – plus the new Cosmos Elite faceplate that allows for more precise room-scale tracking – the Vive Cosmos is now a far better headset. Admittedly, it still can’t quite compete with the likes of the Valve Index for next-gen VR or the Oculus Quest and Quest 2 for convenience, but it can competently stand up to the Oculus Rift S.",
    "That’s because, unlike the Oculus Rift S, the Cosmos is the only modular headset on the market. What we mean by that is, it can transform from a basic four camera inside-out tracking headset (that’s the Vive Cosmos Play), to a six-camera headset (the Vive Cosmos), to a full outside-in headset with base stations (that’s the Vive Cosmos Elite), all by switching out the front faceplate. In fact, besides the tracking styles, the headset has the exact same design and specs, which is why we're reviewing them together here.",
    "The bad news? The faceplates will cost you extra – and buying them all will cost you more than if you’d bought a single, multi-purpose headset right off the bat.",
    "With that in mind, the worth of the Vive Cosmos all comes down to what you’re willing to spend up front – on the headset, faceplates and games – and how much more you’re willing to spend further down the road if you want to start with the more simple option and then add bits to it later.",
    "The HTC Vive Cosmos was released on October 3, 2019 and is available now to buy in its base package that includes a six-camera tracking faceplate for $699.99 (£699, AU$1299).",
    "If you want better hand-tracking, the Vive Cosmos Elite is available for $899 (£899, AU$1699) for the headset and faceplate, or $199 (£199, around AU$299) for just the faceplate.",
    "For comparison, the Valve Index is one of the more expensive headsets at $999.99 (£919, around AU$1,425), putting it $100 above the complete HTC Vive Cosmos Elite package, while on the lower end the Oculus Rift S comes in at $399 / £399 / AU$649, around $300 less than the standard issue HTC Vive Cosmos.",
    "HTC is also releasing an even cheaper version of the headset – called the HTC Vive Cosmos Play – that it says will be comparable in cost to other headsets on the market like the Oculus Rift S, but it hasn't had a consumer release yet and looks like it's solely built for enterprise use.",
    "However, something fresh is being teased over at the official HTC Vive Twitter account. It's likely for this tease, given the \"move\" mention, that it's a new tracking extension peripheral, improving movement tracking beyond the wand-style controllers that come with the headset. But there's some speculation it could be a whole new headset, we'll let you know when it's been made official.",
    "Whichever version of the Vive Cosmos you buy – whether that’s the Vive Cosmos Play, Cosmos or Cosmos Elite – the display and the headband that holds the display are the same, so don’t feel like you’re missing out on extra pixels, higher field-of-view or a better refresh rate by buying a cheaper version.",
    "All of the Cosmos family sports a 3.4-inch 2880 x 1700 resolution LCD display that has a refresh rate of 90Hz, and offers a 1440 x 1700 image per eye. That resolution is higher than both the Valve Index (2880 x 1600) and higher than the Oculus Rift S (2560 x 1440), which means you really don’t notice the screen door effect at all.",
    "The downside to the design, however, is that the lenses can’t be moved forward and back like they can with the Valve Index – meaning that the 110-degree field of view doesn’t exactly fill your whole visual area. If you shift your eyes left or right, you’ll see black edges to the picture, which isn't great for immersion. However, there’s almost no light leakage around the nose, so it’s not all bad.",
    "As for the design of the headband itself, HTC decided to use a traditional halo design with a top velcro strap, and a wheel at the back back that tightens and loosens the headset. The result is a very front-heavy headset that puts most of the pressure on your forehead, and can feel slightly unwieldy at times, even if it stays in place.",
    "All the HMDs in the Vive Cosmos family can be lifted up to see the world around you without having to take the whole headset off – which is great if you're someone who occasionally wants to use the computer in between VR games.",
    "Similarly, the headset’s two front-facing cameras feature a passthrough mode that can be accessed by pressing the Vive button twice in any game or app, but if you’re feeling sick or want to see what's happening around you in the real world without taking off the headset, it’s handy to just flip the visor up.",
    "The last part of the design worth covering is the set of connectors that run from the included connector box to your PC – though remember that Vive Cosmos has to be tethered to your PC, unless you buy a Vive Wireless Adapter (not included). On your PC you’ll need an open USB 3.0 port, plus a display port for the headset. The connector box also needs its own power source, so make sure you have extra outlets or a power strip handy.",
    "Usually there’s not much to say about controllers, but the Vive Cosmos is a bit different in that this is the first time HTC has made use of the inside-out tracking kind.",
    "Compared to the original all-black Vive Controllers, the Vive Cosmos Controller has a light up ring that encircles the face buttons and give the front of the controller a bit of heft. The aforementioned buttons include the standard ABXY buttons from an Xbox One gamepad, but also two concave control sticks, a grip button and both a bumper and a trigger. It’s probably the most complicated controller we’ve yet to see in VR – at least in terms of total buttons – and that can make it tricky to handle.",
    "Not only are these controllers unwieldy because of their size, but they don’t do five-finger tracking the way the Valve Index can with its Knuckle Controller. The Cosmos comes close (four fingers if you include your thumb, pointer, index and ring finger) but the end result isn’t as comfortable nor as intuitive as the Valve Index.",
    "To power the controllers you’ll need four (four!) AA batteries, with two for each controller, but the Cosmos seems to optimize the amount of battery life it gets from its power source, and seems to last a few weeks without needing new ones.",
    "When you talk about performance with the HTC Vive Cosmos, you now need to specify which faceplate you’re using – a quirk that no other headset has, for both better and worse. The beauty of having multiple faceplates is that you can swap them out when a game requires more precise tracking, or if you want to move your setup to another room without having to move the base stations with it.",
    "To start, let’s talk about what the Cosmos experience is like with the six-camera inside-out tracking faceplate. This is the one you get with the headset if you buy the base package, and the one you’ll probably see most often in stores and online. With the six-camera tracking faceplate, the Vive Cosmos is a fine, base-tracking-free experience. It’s one you make work in almost any room that has enough light without having to hang tracking units on your wall.",
    "If you’d expect it to be less-than-flawless given the placement of the cameras, however, you’d be right – HTC is clearly using predictive algorithms to take its best guess at where your hands are should they leave the camera’s field of view, but those guesses aren’t always great. It’s inaccurate any time your hands go too far to your sides or behind your back, and there’s a rubber banding effect that happens when your controllers re-enter the field of view, making it hard to play games where constant tracking is crucial. When you're playing sports games like VR Baseball, you don’t really want the controller to suddenly disappear then reappear after the ball has already slid past home plate.",
    "Where the less precise tracking does work, however, is with games that require your hands to be in front of you at almost all times. Space Pirate Trainer, one of the original hits of HTC Vive, plays absolutely fine on the Cosmos with inside-out tracking, as does Beat Saber. That’s because, while your hand might occasionally drift outside the camera’s field-of-view in these games, they don’t require pixel-perfect tracking for you to be successful.",
    "So how do the games look? Well, they’re pretty sharp on the 3K screen. There’s limited screen door effect – though it’s there if you look for it – and at 90Hz, it’s fairly comfortable to play for long periods at a time. That said, how the games perform in terms of latency, ultimately, will depend on which graphics card you’re using.",
    "In terms of recommended specs, HTC suggests using an Nvidia GTX 1060 / AMD Radeon RX 480 or greater GPU, Intel i5-4590 / AMD FX 8350 or greater CPU and at least 8GB of memory. It’s possible to get it working with less – we’ve had it running without issue on a GTX 980 – but you should try to stay within the recommended specs if possible.",
    "Switching to the HTC Vive Cosmos Elite is a significant upgrade – especially in terms of precise tracking. Like the original Vive, the Cosmos Elite uses wall-mountable base stations called lighthouses that track the controllers and the headset using small tracking divots. This allows for room-scale play just like the base HTC Vive Cosmos, but with more accurate tracking.",
    "Using the Cosmos we played a number of ‘classic’ (a term we use loosely here) VR hits like Beat Saber, Arizona Sunshine and Fallout 4 VR. Not all of these games necessarily need the more precise tracking – in fact all of them probably could be played on the base Vive Cosmos – but the extra hand-tracking precision certainly didn’t hurt, either.",
    "The fast and frenetic Beat Saber played pretty well on the Vive Cosmos Elite, with pixel-perfect motion tracking that we didn’t see on the base version of the Cosmos. The space-age environment had nice inky black levels on the headset, and while we could notice some light refraction when we weren’t right in the headset’s sweet spot, it wasn’t too noticeable.",
    "On the other side of the spectrum, Fallout 4 VR on the Cosmos Elite is as big and imposing as it’s ever been but feels just as immersive as we remember. The better resolution of the headset is slightly diminished by the lower-resolution assets in the game, but being able to experience the world Bethesda built in first-person never really gets old.",
    "All that said, remember you’ll have to use base stations and the original Vive controllers to get this level of tracking. It’s somewhat frustrating, to be honest, that HTC didn’t craft a new controller for the Cosmos Elite, and the new regular Cosmos controller isn’t compatible with the Cosmos Elite tracking faceplate and base stations. That feels like a real misstep for a headset that costs upwards of $1,000.",
    "The good news is that, all in all, games worked much better on the Cosmos Elite than they did on the base Cosmos, and look better here than they do on the Oculus Rift S. Going forward we’ll absolutely use the HTC Vive Cosmos Elite tracking faceplate for our VR gaming over the original Cosmos headset, but both pale in comparison to the Valve Index.",
    "Most of the testing we did for this review was done through Steam and Steam VR, one of the biggest platforms for VR games and games in general that you'll use with both HTC's headsets and the Valve Index. That said, the Vive Cosmos also comes with a free six-month subscription to Viveport Infinity, HTC’s curated app store that allows you to download an unlimited number of games and apps per month.",
    "Viveport Infinity is both the name of the service and storefront which you'll pick out games and apps to download for a monthly fee of $12.99 per month or just over $100 if you pay for the plan that renews annually.",
    "While it has over 900 games and apps to choose from, including some big names, unfortunately Viveport doesn’t have every major release on there – there’s no Beat Saber or Tetris Effect, for example.",
    "Instead, games on Viveport Infinity range from some of the first big-budget VR games like Creed: Rise to Glory as well as a few newer hits like Five Nights at Freddy’s: Help Wanted and Fruit Ninja VR from Halfbrick Studios and other indie developers. The collection is pretty broad, and the unlimited buffet of games makes paying for Infinity once the trial runs out pretty tempting.",
    "If you’re not into games as much, Viveport also has educational apps, creative apps and productivity apps, too – so it feels like there's something for everyone. It’s a rich, expanding ecosystem and, for dedicated VR enthusiasts, it offers a lot of content.",
    "The benefit of the Cosmos is its ability to start as an entry-level headset – one that you can pick up without destroying your bank account – and evolve over time to a headset that rivals the best on the market. Pair that with HTC’s Viveport subscription service and you can expect an ever-changing library of fun new titles to try on a headset that truly looks great despite some field-of-view limitations.",
    "That’s more or less the story of the Cosmos at this time and at this price point – it’s a decent portal into virtual reality, but one that comes with a few caveats. Its hand-tracking ability isn’t perfect and its setup process can be hit-or-miss. Some games work without a hitch, while others can break down without pixel-perfect tracking. While other inside-out tracking headsets – like the completely untethered Oculus Quest or Oculus Quest 2 – face similar problems and have a worse resolution, they’re cheaper, less bulky and can be taken with you anywhere.",
    "Of the two HTC Vive Cosmos headsets currently available, the Cosmos Elite is the far better of the two. Even though it uses the original Vive’s controllers and lighthouse base stations, it feels more precise in its tracking and therefore more practical use for most games and apps. That being said, at $899, it’s a lot of money to spend upfront and, because it still uses old hardware, it doesn’t feel quite as modern or robust as the industry-leading Valve Index.",
    "If you love the idea of Viveport and don't mind some tracking issues, the Cosmos will work for you. Otherwise there are better headsets for more money out there, and one or two available for a bit less."
  ],
  "headers": {
    "6": "Price and release date",
    "11": "Cosmos and Cosmos Elite design",
    "18": "HTC Vive Cosmos Controllers",
    "22": "HTC Vive Cosmos performance",
    "28": "HTC Vive Cosmos Elite performance",
    "34": "Viveport subscription",
    "39": "Final verdict"
  },
  "links": {
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review",
    "Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Rift S": "https://www.techradar.com/reviews/oculus-rift-s-review",
    "HTC Vive Twitter account": "https://twitter.com/htcvive/status/1367520221372833794",
    "VR games": "https://www.techradar.com/best/the-best-vr-games",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "Viveport Infinity": "https://www.techradar.com/news/viveport-infinity-unlimited-vr-for-the-price-of-a-netflix-subscription",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}