{
  "source": "https://www.techradar.com/reviews/line2",
  "title": "Line2 review",
  "category": "computing",
  "updated": "2021-05-24T15:34:12Z",
  "author": "barclay-ballard",
  "summary": "Line2 may be simple, but it is also affordable",
  "verdict": "Line2 represents a solid VoIP solution, but the lack of collaboration options may make it unsuitable for many firms.",
  "pros": [
    "Simple setup",
    "Easy to use"
  ],
  "cons": [
    "Lacking more advanced features",
    "Doesn't offer third-party integration"
  ],
  "article": [
    "For businesses that are looking to overhaul their communication tools, the choices available can sometimes seem overwhelming. Looking at VoIP services alone, there is a multitude to choose from, each with its own pros and cons to consider. Line2 is certainly worth taking a look at, as it offers a solid, if simplistic, VoIP service that is well suited to the needs of smaller firms.",
    "Line2 first started offering VoIP solutions to businesses in 2006, aiming to provide outstanding coverage and quality to any device, anywhere in the world. The company was the first to offer the option of using a second phone line on a single mobile phone and today, continues to add new features on a regular basis as customer needs change.",
    "In 2018, Line2 was acquired by J2 Cloud Services, which has enabled the company to boost its reliability (it now promises 99.9% uptime). The other major benefit of Line2’s offering is the speed at which everything can be set up. While it’s true that the Starter plan is lacking some of the more advanced telephony features that are included in some rival VoIP packages, its simplicity and ease of use are hard to beat.",
    "Running a small business is not easy. With competition fierce and finances tight, organizations are often left facing a difficult balancing act regarding whether to invest in new digital tools that could deliver better customer service or stay with their current technological offering.",
    "Fortunately, VoIP services have such a breadth of options available, that there is bound to be a platform that suits your company. In Line2’s case, its VoIP service is certainly aimed at smaller businesses - and its lack of features will probably mean that it is not suitable for companies with a large number of employees. There are no collaboration features or third-party integrations on offer here so if you need those types of features, you are better off looking elsewhere. If all you require is a reliable, intuitive platform to help your staff stay connected, however, then Line2 may be what you need.",
    "The first thing to say about Line2 is that it is not a one-size-fits-all solution to all your communication needs. But for some businesses that is unlikely to be a problem. When exploring Line2’s service offering, it’s easy to see the company’s humble roots - it started out just offering a second phone number to smartphone users via an app. Today, the features on offer remain fairly rudimentary, although all the basic VoIP tools are included.",
    "Essentially, Line2 lets businesses choose from a range of local and toll-free numbers, before selecting a pricing plan that meets their needs. After that, there are a number of customization options for firms to tinker with until they have a service that is tailored just for them.",
    "Because Line2’s service is app-based, your employees can take their business phone line with them wherever they are, as long as they have an iOS, Mac, Windows, or Android device on hand.",
    "As is the case with most VoIP services, recently Line2 has released a plethora of articles and blog posts about how businesses can continue communicating (both with colleagues and customers) even when members of staff are not based in the office. The COVID-19 pandemic has forced many companies to implement remote or hybrid working policies, meaning that VoIP services like Line2 have suddenly gone from flashy accessories to must-have business essentials.",
    "The call quality provided by Line2 has been commended by users, although it is worth keeping in mind that, as with all VoIP solutions, the quality of service that you receive is at least partially dependent on the user’s internet connection. If your internet performance is inadequate, then it really doesn’t matter which VoIP provider you go with.",
    "In terms of the type of customer that might get the most from Line2, freelancers and small businesses may find that Line2 has everything they need from a VoIP service. Larger firms are likely to need additional capabilities.",
    "Starting with the basic features that come with Line2’s offering, businesses will benefit from voicemail transcription, a softphone, SMS messaging, voicemail to email, and electronic fax capabilities. In addition, they’ll also gain access to toll-free numbers, which will come as a huge plus for customer-facing businesses.",
    "Looking into some of these features in more depth, the option of adding an auto-attendant to your call answering process is a nice touch that will add an air of professionalism to your business. With Line2, organizations can use a real-life or virtual auto-attendant to greet callers. In addition, businesses can route calls to different departments, by giving each one its own extension. This means that even small businesses can appear larger than they actually are to current and prospective customers, and make customer service smoother.",
    "Although collaboration is not really Line2’s forte, the app does offer merged calling, which allows multiple people to take part in the same call, with as many as 99 callers accommodated. This means that there is certainly an opportunity for businesses to hold department-wide meetings virtually or discuss developments with clients when they can’t be met in person. Of course, the fact that video conferencing isn’t supported is a disappointment, but there are plenty of free digital platforms that could be utilized to fill this gap.",
    "Call reporting is available with Line2’s VoIP solution, which means that businesses can gain a better understanding of their inbound and outbound calls, view key tracking metrics and monitor call logs to keep an eye on customer needs. Organizations can analyze which calls were answered and which ones were missed and build call reports that can be shared with other team members to support the delivery of better customer service.",
    "Businesses will struggle to find a VoIP solution with a simpler setup process than Line2. There is no hardware involved and the Line2 softphone client can easily be installed, whether you prefer to take calls on iOS, Android, Windows, or Mac devices. Once an individual has installed the app and entered their login credentials, that’s all there is to it.",
    "Although, as we’ve mentioned, integration with third-party apps is lacking, users can sync their contacts with a Google Workplace account or a Microsoft Outlook client. The process is still not particularly smooth, however, and individuals will need to enable the sync feature in Line2 and log in to either their Google or Microsoft account to add new phone numbers.",
    "Looking at the desktop client, users are essentially presented with a virtual version of a regular phone’s dial pad, complete with additional buttons for holding, muting, merging, and transferring calls. Texting is also available through both the desktop and mobile versions of the app, as is faxing - although, individuals must have these emailed to their inbox first.",
    "User administration is also straightforward and all takes place via the admin portal. The “phone system” section is where users will find the option of adding custom greetings and managing their account phone numbers. Overall, while Line2 users won’t find flashy features, this is a VoIP service that is easy to set up and simple to maintain.",
    "Line2 promises three distinct pricing plans: Starter, Growth, and Business. The Starter plan costs $14.99 a month and comes with unlimited calls and texts, basic call forwarding, and the ability to add a local or toll-free number. The Growth plan comes with all that, plus an auto-attendant, and a call scheduler for $9.99 a month. In addition, the Business plan includes call recording, voicemail transcriptions, and advanced reporting for a fee of $24.99 a month.",
    "Although these prices are not particularly steep, given the limited nature of Line2’s VoIP solution, organizations may still find them a little more expensive than they are willing to pay. All the plans do come with a 30-day money-back guarantee, which does allow businesses to try Line2’s service with relatively little risk.",
    "Whether Line2 represents good value for money will ultimately depend on what each business needs from its VoIP solution. The platform could certainly not be called expensive and the option of a money-back guarantee means that smaller businesses might feel as though Line2 is worth taking a chance on.",
    "It’s also worth noting that Line2 does come with the option of creating a custom plan. For businesses that require something a little more bespoke, a custom quote can be received by talking to a company sales representative.",
    "Line2’s VoIP solution won’t be right for every business. Many organizations will be looking for more advanced features - particularly in terms of collaboration. But for the right company, Line2 could be just what is needed. It’s reliable, easy to use, and affordable. For smaller firms, it is undoubtedly worth checking out."
  ],
  "headers": {
    "23": "Our overall verdict"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software"
  }
}