{
  "source": "https://www.techradar.com/reviews/apple-music",
  "title": "Apple Music review",
  "category": "audio-visual",
  "updated": "2021-08-19T12:52:05Z",
  "author": "becca-caddy",
  "summary": "Apple’s streaming service makes serious strides towards becoming a true Spotify competitor",
  "verdict": "Apple Music does a fantastic job at helping you to discover new music. It has a great recommendation engine and a vast library. Recently added Lossless Audio listening and Dolby Atmos support mean it’s happily keeping up with the competition. Although the service has few stand-out features, it’s Apple through and through, offering a great user experience and fantastic integration with other Apple products.",
  "pros": [
    "Massive music library",
    "Can integrate personal music",
    "Spatial Audio and Lossless Audio",
    "Good music discovery"
  ],
  "cons": [
    "Spotify wins recommendations",
    "Podcasts in a separate app",
    "Mobile app a bit clunky"
  ],
  "article": [
    "Apple Music is the tech giant's streaming service. It offers more than 75 million songs in its massive library, as well as music videos and exclusives – to be honest, there isn’t much you won’t find here. Apple Music is geared towards helping you to discover new tracks and artists, whether that’s through recommendations, curated playlists or its 24/7 digital radio stations.",
    "You can also add all the music you currently own in iTunes to the service, so everything is in one place. While you don’t need a house-full of Apple products to use Apple Music, as you might expect, all of your Apple devices – as well as Apple’s smart assistant, Siri – work seamlessly with the company’s streaming service.",
    "Apple Music apps on all devices are slick and easy to use. There isn’t much clutter, although some of the icons on the mobile app feel a little too big for the screen – you’ll get a more superior experience on a desktop or tablet – but this isn’t a dealbreaker; we’re just being picky.",
    "Apple Music is an excellent service and one of the top music streaming services on offer. For some time there hasn't been much to set Apple Music apart from the competition – notably Spotify.",
    "However, as of June 2021, Apple Music's offering includes Spatial Audio with support for Dolby Atmos. The streaming service has also made its catalog of more than 75 million songs available to subscribers in Lossless Audio. These new updates are both available to subscribers at no extra cost – but you will have to turn on Lossless Audio in the latest version of Apple Music, just head to Settings > Music > Audio Quality.",
    "Spotify will soon be launching its own high-fidelity audio service, Spotify HiFi. But both Spatial Audio and Lossless Audio on Apple Music could knock Spotify off the top spot. Let’s take a look at everything the streaming service has to offer.",
    "Apple Music is a music streaming service from Apple.",
    "Launched in 2015, Apple Music primarily focuses on the music you can stream. However, you can also add music you may have ripped from a CD or bought via iTunes, and watch videos. Apple wants Apple Music to be more a “cultural platform” than a music streaming service.",
    "The last time the company revealed official details about the total number of Apple Music subscribers was way back in 2019, when it hit 60 million. By June 2020, that figure was estimated to be 72 million. However, as of March 2021, Spotify has 158 million subscribers, which is a significant difference. But Apple Music doesn’t necessarily need to try to get more subscribers than Spotify; it already has dedicated fans.",
    "Apple Music has constantly been improving and adding new features since 2015, which is refreshing and necessary in such a competitive space. Notable improvements include an upgraded design to the iOS app and a recent announcement that Apple Music will get Spatial Audio with support for Dolby Atmos and the ability to listen to over 75 million tracks in Lossless Audio from June 2021.",
    "This new high-quality audio might not be here yet, but it’s worth mentioning that once it arrives, Apple Music will be on a par with audiophile-grade services such as Tidal and Deezer, which currently offer high-quality audio. And it will provide better quality than Spotify – we know Spotify HiFi is on its way, but we don’t know when or how much extra it is likely to cost users.",
    "While these additions might not shake things up completely, users like services that give them the most bang for their buck. Apple Music is about to do just that.",
    "You can start listening to Apple Music straight away with a free trial, which lasts three months.",
    "Subscription then costs $9.99 / $9.99 / AU$11.99 per month for a standard user and $4.99 / £4.99 / AU$5.99 for students. With these two subscriptions, you can only listen to Apple Music on one device at any one time. Alternatively, you can pay $14.99 / £14.99 / AU$17.99 per month for a family subscription, which is the same as a standard subscription, but up to six people can listen at once, and each family member gets a personal account.",
    "Notably, there’s no free ad-based tier available, as is the case with Spotify. Maybe three months of the proper service as a free trial is a better business decision, but it’s bound to put off some people who might have remained on the free tier for longer than three months and eventually upgrading.",
    "Apple Music streams music at a 256kbps AAC bitrate. It streams at the highest quality by default and reduces it if you’re streaming on the move. Tracks sometimes take a few seconds to play, but they’re crisp and clear – especially if you’re listening with a pair of the best noise-cancelling headphones.",
    "However, all music streaming services are upping their game to bring subscribers better music quality – or at least the option to try it. Deezer and Tidal already offer hi-res audio. Spotify is launching its HiFi service later in 2021, and Amazon Music HD offers CD-quality listening – with better quality soon to follow.",
    "When we first wrote this review, Apple had only recently announced that Apple Music would get Spatial Audio and the ability to listen to over 75 million tracks in Lossless Audio. Now those features are finally here and we've written a guide to get you started: how to turn on Apple Music Spatial Audio and Lossless.",
    "Although many streaming services are following suit with better quality audio, Apple Music does now sound significantly better than some of its competition – and it hasn't charged you any extra for the uplift in quality.",
    "There are more than 75 million tracks available to stream on Apple Music – which, at the time of writing, is more than Spotify. Of course, quality is more important than quantity, but it remains impressive given Apple Music has been playing catch-up for years.",
    "There’s also a range of high-profile exclusives with artists such as Taylor Swift, Drake, Britney Spears and Frank Ocean releasing albums through Apple Music first.",
    "This isn't just about discovering new music, but loving what you have. Apple Music combines what you already have in iTunes, whether that's what you've bought or ripped from a CD, with the streaming service. This is great for bringing all your music together in one place. There's similar functionality on offer from Spotify, but you can't search your library of owned tracks and streaming tracks quite so efficiently; the integration feels seamless with Apple Music.",
    "There are no podcasts on offer within Apple Music – you need a separate app for that – but there are thousands of music videos, as well as non-stop radio stations. This is a welcome human touch and a great way to discover new music.",
    "The three stations – Apple Music Hits, Apple Music 1 (formerly Beats 1) and Apple Music Country – run 24/7 music mixed by DJs on live radio shows. There are some cool shows hosted by musicians, too. Importantly, you can listen to these radio stations for free – you don't need an Apple Music subscription.",
    "It's worth mentioning that, although Apple has made efforts recently to be more transparent about how much artists get from the service, its streaming service has many of the same problems as others in terms of how much it compensates artists – often very little. Big artists who sign exclusives get good deals, but smaller artists don't tend to. For this reason, many people choose to either buy music outright or use services such as Tidal and Bandcamp, which give artists more autonomy and royalties.",
    "You can listen to Apple Music on all kinds of devices including iPhone, iPad, Apple Watch, Apple TV, Mac, HomePod, CarPlay, PC, Android, Sonos, Amazon Echo, Samsung Smart TV, and Google Nest.",
    "You can use Siri, too – this is the reason Apple Music is a good idea if you already use many Apple products and services. You can use your Apple devices to ask Siri to play anything on Apple Music, which is great if you’re already used to using voice commands in your home.",
    "The Apple Music apps have a minimal design across all platforms. The app feels like iTunes, but sleeker and even easier to use. Sometimes, the album or track tiles on mobile feel a bit big – you’ll find a slightly better experience on desktop or tablet, where there’s more screen real estate.",
    "A Listen Now section on the app – which is the same across all devices – is like a personalized dashboard filled with recommendations based on your tastes and listening history.",
    "Browse is where you can find new releases, radio stations and trending songs. This isn’t personalized but a hub for all the fresh, new content you might miss if you only follow recommendations.",
    "There’s also Radio, which is where you’ll find Apple’s three stations, as well as a collection of older shows and non-Apple shows.",
    "Under that, you’ll find your Library. This is where all of the music saved to your device and iTunes are kept, divided up by Artists, Albums, Songs and Music Videos stored at the end. Finally, there’s Playlists. This is where all the playlists you’ve created are stored.",
    "The search bar works well for locating everything on Apple Music, as well as your own tracks. You can even type lyrics in here; Apple Music cares about your at-home karaoke sessions. A lyrics button will appear anytime music is playing, which will display the words of the song across the screen in a large, bold type that scrolls down as you sing along.",
    "On first signing up to Apple Music you’re encouraged to choose your favorite genres, so the service is aware from the outset about the kinds of artists and tracks you’re likely to enjoy.",
    "There’s a big focus on curation and recommendations. According to Apple, although an algorithm powers these recommendations, playlists are sometimes curated by a team of experts.",
    "Stations For You are good recommendation sources, such as radio stations based on artists you love, but there are also playlist themes, such as Influences and Inspired. These will feature tracks from an artist, as well as similar artists and tracks you might not have listened to before.",
    "For example, we played a lot of Death From Above 1979 and Justice during the first few days of testing. Then we were recommended playlists titled ‘Death From Above 1979 and similar artists’ and ‘Justice: influences’, a collection of tracks and artists that influenced Justice’s music – or at least they sound like they do.",
    "Spotify might still have the edge with its super popular customized playlists – we love Discover Weekly – but there’s a lot to love about Apple Music’s recommendations too.",
    "You can download tracks and playlists for offline listening across 10 different devices. The limit for how many tracks you can download is 100,000, which even the biggest music fans are unlikely to need."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "What is Apple Music?",
    "12": "Apple Music: pricing and subscription",
    "15": "Apple Music: audio quality",
    "19": "Apple Music: music catalogue",
    "25": "Apple Music: platforms and apps",
    "33": "Apple Music: playlists and recommendations",
    "39": "Don't subscribe if..."
  },
  "links": {
    "top music streaming services": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "72 million": "https://www.statista.com/chart/8399/spotify-apple-music-paid-subscribers/#:~:text=While%20Apple%20hasn't%20publicly,72%20million%20for%20Q1%202020.",
    "158 million subscribers": "https://newsroom.spotify.com/company-info/",
    "Apple Music will get Spatial Audio": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Deezer": "https://www.techradar.com/reviews/deezer",
    "best noise-cancelling headphones.": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "how to turn on Apple Music Spatial Audio and Lossless.": "https://www.techradar.com/how-to/apple-music-spatial-audio-and-lossless-guide-heres-how-to-turn-them-on",
    "podcasts": "https://www.techradar.com/news/best-podcasts",
    "Apple has made efforts": "https://www.wsj.com/articles/apple-music-reveals-how-much-it-pays-when-you-stream-a-song-11618579800",
    "HomePod": "https://www.techradar.com/reviews/apple-homepod-review"
  }
}