{
  "source": "https://www.techradar.com/reviews/leadpages",
  "title": "Leadpages landing page builder review",
  "category": "computing",
  "updated": "2021-03-29T04:18:27Z",
  "author": "john-faulds",
  "summary": "Easily create landing pages and websites that are guaranteed to convert",
  "verdict": "Leadpages is easy to use, produces great results, and is cheaper than many direct competitors, with more features than most free page builder tools.",
  "pros": [
    "Reasonably priced",
    "Unlimited traffic",
    "Easy to use"
  ],
  "cons": [
    "Limited integrations on the Standard plan",
    "No A/B testing on the Standard plan"
  ],
  "article": [
    "Leadpages is a landing page builder aimed at helping small businesses connect with potential customers and collect leads. It’s often listed as one of the best landing page creators, but it can be used to build more than just pages.",
    "In this Leadpages review, we’ll take a deeper look into what it can be used for, its pricing, features, interface, and support. Basically, everything you need to know to determine whether it’s a good fit for your business.",
    "Leadpages offers three plans—Standard, Pro, and Advanced—ranging in price from $27/month up to $239/month, if billed annually. If you choose to pay monthly, prices increase to between $37/month and $321/month.",
    "The main differences between the plans are the number of sites that can be created, the level of support, and the number of advanced features offered.",
    "On the Standard plan you can only build a single website. The Pro plan lets you build three, and the Advanced plan up to 50. But all three plans allow you to create unlimited landing pages, pop-ups, and alert bars.",
    "All plans come with a 14-day free trial and include free hosting and custom domain names. They also include unlimited traffic and leads, lead notifications, and a large library of templates that are optimized for all devices.",
    "Support ranges from email only, through email and chat, up to priority phone support depending on which subscription you’ve chosen. With the Pro plan you get additional online sales and payments, A/B split testing, and 10 SMS campaigns per month. The Advanced plan also includes integrations with Hubspot, Marketo and Salesforce, sub-accounts (accounts with their own login that are separate from the master account), and 50 SMS campaigns.",
    "At the heart of the Leadpages service is its builder feature. Using a drag-and-drop interface, you’ll be able to create landing pages, websites, and opt-in forms without needing any coding skills. Pages are automatically saved as you build them, and you can preview your work on different devices to see how your content will look on social media platforms.",
    "You’ll be able to edit metadata fields to optimize your pages for search engines, and built-in analytics will show you how well your pages are performing in search. You can also add functionality with a collection of widgets that includes video, calendars, tables, and galleries.",
    "Leadpages’ templates are designed by professionals not only to look good but also to drive conversions. There are more than 100 individual section templates that can be dragged and dropped onto pages, plus a built-in icon library.",
    "Once you’ve got visitors to your landing page or website, you’re going to want to turn them into customers. Leadpages provides a good selection of tools to do just that. SMS opt-in campaigns can be used to gain subscribers. Trigger links embedded in your emails can prompt users to sign up to lists or specified events. And you’ll be able to optimize your pages for conversions using A/B (split) testing, a process that lets you show two versions of the same page to different visitors to see which converts better.",
    "After you’ve created your trial account, you’ll be logged into your dashboard and presented with a list of well-designed landing page templates, sorted by conversion rate (you can also choose to sort by most popular or newest). A similar list of templates is available if you choose to create a full website instead of a landing page.",
    "Once you’ve chosen your template and given it a name, you’ll be able to edit its content with the drag-and-drop builder. Other reviews we’d read of Leadpages found the builder to be sluggish and clunky with a lack of customization options. We found the opposite to be true.",
    "The builder is very easy to use, intuitive and highly responsive in terms of how quickly your edits are reflected on the screen. There’s an extensive list of content sections to choose from, including logos, calls to action, testimonials, and pricing and plans. Each section also comes in several different designs with a large selection of fonts, and you can easily set your own custom brand colors to be applied site-wide.",
    "Leadpages offers support by email, chat, or phone, but the method available to you depends on the plan you’ve chosen. The Standard plan has email support, with the Pro plan adding online chat (available Monday to Friday, 9 a.m. to 5 p.m. CST), and the Advanced plan has priority phone support.",
    "There is a help center on the Leadpages website, with a searchable library of articles and tutorials. There’s also a resources section that contains a blog, podcasts, webinars, and downloadable guides, checklists, and worksheets.",
    "There’s a lot of competition in the landing page creator software market, with Unbounce and Instapage providing two viable alternatives.",
    "Unbounce has four plans ranging in price from $72–$270/month (billed annually) and offers a 14-day free trial. There are limits on conversions and traffic but client sub-accounts are unlimited, and the standard plan provides more integrations than that of Leadpages.",
    "Instapage only offers a single fixed-price plan, which is $149/month (billed annually), and is also available free for 14 days. To gain access to more advanced features, you can sign up for a custom plan, which will be priced based on your unique needs. The standard plan has no limits on conversions or traffic and A/B testing and integrations are also included.",
    "There’s a lot to like about Leadpages. It’s easy to use, produces great results, and is reasonably priced. However, many of its best features, like A/B testing and online payments, are only available on the Pro or Advanced plans. That said, even the Pro plan is cheaper than those of some of the competition.",
    "Leadpages’ effective conversion tools make it a good choice for small businesses aiming to build and grow an online presence. There are other free tools available—like WordPress page builder plugins—that will do a lot of what Leadpages can, but its advanced features are what sets it apart from the freebies. Individual businesses would need to assess whether the additional cost of those features is worth it."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "11": "Interface and in use",
    "14": "Support",
    "16": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Leadpages": "https://www.leadpages.com/",
    "best landing page creator": "https://www.techradar.com/best/landing-page-creator",
    "s": "https://www.techradar.com/best/landing-page-creator",
    "Standard plan": "https://www.leadpages.com/pricing",
    "Pro plan": "https://www.leadpages.com/pricing",
    "Advanced plan": "https://www.leadpages.com/pricing",
    "Hubspot": "https://www.techradar.com/reviews/hubspot-crm-review",
    "landing pages": "https://www.techradar.com/best/landing-page-creator",
    "Unbounce": "https://www.techradar.com/reviews/unbounce",
    "Instapage": "https://www.techradar.com/reviews/instapage"
  }
}