{
  "source": "https://www.techradar.com/reviews/diablo-2-resurrected-review",
  "title": "Diablo 2: Resurrected review",
  "category": "gaming",
  "updated": "2021-09-29T13:46:23Z",
  "author": "gerald-lynch",
  "summary": "The return of the king",
  "verdict": "Whether you’re a newcomer to the Diablo franchise or a die-hard returning fan, Diablo 2: Resurrected’s careful remastering of a classic game makes it the most accessible version of one of the most influential RPGs of all time.",
  "pros": [
    "Classic, addictive gameplay",
    "4K visuals that match original vision",
    "Great gamepad control adaptations"
  ],
  "cons": [
    "Keyboard and mouse play has aged poorly",
    "More punishing than the games it inspired"
  ],
  "article": [
    "What’s left to be said about Diablo 2 that hasn’t already been uttered a thousand times before?",
    "The dark lord of action RPGs, it’s had PC gamers clicking the residents of Hell to death for more than 20 years now, in a never ending quest to find the greatest loot that Blizzard’s classic dungeon crawler can conjure.",
    "Fiendishly addictive, it’s now the subject of a big-budget remaster from Activision Blizzard in the shape of Diablo 2: Resurrected, bringing the game up to date with refreshed 4K visuals, a few quality of life improvements and, for the first time, native support for gamepads and ports to PS4, PS5, Nintendo Switch, Xbox One and Xbox Series X/S.",
    "If you’re reading this review, there’s a good chance you’ve already played the original Diablo 2. Perhaps you’re even still playing it – it retains a vibrant hardcore community, and this new version of the game will respect that by sitting alongside the original, rather than replacing it outright.",
    "So we won’t bore you with what makes Diablo 2 special yet again. If you want a recap, we’ll point you to our friends at PC Gamer, and their original review of the classic version of the game. It is, essentially, the same game at its heart, for better and worse, aside from some new bells and whistles that Resurrected brings along. It’s the same click-kill-loot gameplay loop, the same demonic enemies, the same rush from dungeon to dungeon in a quest to defeat the titular foe and do it all over again to create the perfectly-overpowered build of your chosen warrior class.",
    "No – instead we’re here to discuss what’s new and different about Diablo 2: Resurrected compared to its forefather. And thankfully, some legacy annoyances aside, you’re now looking at what’s easily the definitive version of a hall of famer.",
    "The most obvious difference, naturally, is the fresh 4K lick of paint applied to the visuals. While you can still play at good ol’ 800 x 600 resolution, switching on the fly with a push of a button between vintage and modern graphics settings. The new visuals are lovingly put together – there’s the same implied griminess of the original’s pixelated look, but now with all the detail your imagination used to have to do the heavy lifting for. Dungeons are slick with damp and reflections, furry gargantuan’s shag flicks with each whack of their paws, and fire spells light up enemies and the environment alike. It’s all in keeping with the original aesthetic – that dark fantasy moodiness retained, compared to the slightly friendlier Diablo 3 palette. If playing on a modern console, you have both a 60fps ‘Performance’ graphics option, and a native 4K / 30fps ‘Quality’ option – there’s so little difference in visual fidelity between them that the smoother Performance option is the one to go for.",
    "Eagle-eyed returning players will notice that some of the more sexualized character designs and armors have been edited, too. The Amazonnian warrior, for instance, finally has some armor that will protect her vulnerable bits, sensibly covering her up in a way fitting for a battle-hardened veteran. With allegations of workplace misogyny being directed at Activision Blizzard at the moment, it’s good to see some shift in representation here taking place.",
    "The few gameplay changes that have been made are subtle and, for the most part, suitable.",
    "While a character’s personal loot stash remains frustratingly limited, you’ve now access to a shared stash for all your account’s characters, letting any Amazon, Barbarian or Crusader alike access the same bottomless chest of interchangeable gear.",
    "Gold is now set to auto-pickup by default, removing the micro-management clicks of a resource that you’re never not going to want to pick up. In terms of in-game economy, it’s worth noting that Activision Blizzard has, mercifully, resisted the urge to add micro-transactions or other real-money systems into the game. This is a pure work-for-your-gear endeavor, and though the developers’ hands may have been forced by the decision to support vintage saves (which would have been totally messed up by the inclusion of a new real-world economy), it is welcome nonetheless.",
    "One of the best changes however acts to also highlight one the ways in which time has been least kind to Diablo 2. Resurrected has full gamepad support, whether you’re at a PC or a console, and it works great – the left stick directs your warrior around, and a combination of the face buttons and triggers activate your many skills. It works a charm, taking many of its cues from the excellent console ports of Diablo 3. Playing with the classic keyboard and mouse set-up feels archaic by comparison – the original two-button mouse control scheme is retained, leaving you with only two active powers at any one time. To swap them in and out, you have to hit a function key shortcut – but this doesn’t activate the powers, instead just transferring them to a mouse button ready for a’clicking. It may be in keeping with the old ways, but it’s unnecessarily archaic. I’d take the hotkey system of Diablo 3 or World of Warcraft, however anachronistic, any day.",
    "And that’s perhaps the key takeaway from Diablo 2: Resurrected. This is still that 20-odd year old game, warts and all. It’s just got a new jacket on and some carefully applied concealer from a professional make-up artist team. For the many that believe Diablo 2 to be the holy grail of ARPGs, an unblemished classic, this religious approach to authenticity to the original game will be exactly what they wanted. For those raised on Diablo 2’s inspiration, like Torchlight, Path of Exile or even Diablo 3, some of the intervening years’ innovations will be hard missed. But there remains something hypnotic about Diablo 2, which Resurrected has done well to maintain.",
    "At the very least, it’s a perfect, nostalgia-fuelled stepping stone towards Diablo 4’s ephemeral release date, and an excellent history lesson in a game that’s become the backbone blueprint for so many modern classics that have followed it.",
    "Review code for Diablo 2: Resurrected was supplied by its publisher, Activision Blizzard."
  ],
  "headers": {
    "3": "Remastered and revived, but not replaced",
    "8": "The new, the old, and the stubbornly-unchanged"
  },
  "links": {
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "original review of the classic version": "https://www.pcgamer.com/diablo-2-2000-review/",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors"
  }
}