{
  "source": "https://www.techradar.com/reviews/intuitive-password",
  "title": "Intuitive Password review",
  "category": "computing",
  "updated": "2021-11-28T19:36:28Z",
  "author": "michael-graw",
  "summary": "An affordable, feature-packed password manager",
  "verdict": "Intuitive Password offers a ton of features, including seamless password sharing and a secure messenger. But, your data doesn’t live on your own devices, which raises some serious security concerns.",
  "pros": [
    "Includes unlimited secure password sharing",
    "Extremely flexible organization"
  ],
  "cons": [
    "Your data lives on Intuitive Password’s servers",
    "No way to import data"
  ],
  "article": [
    "Trying to find the best password manager to secure your sensitive data? Intuitive Password is worth a look. This software boasts a number of features we love, including organizational tools, password sharing, password expiration reminders, and one-time-use passwords. In our Intuitive password manager review, we’ll cover everything you need to know about this platform.",
    "Intuitive Password offers four different account tiers. A Basic plan is free, but only lets you store up to 20 passwords and doesn’t support two-factor authentication. An Express plan costs A$2.00/month (approx. US$1.30) and bumps you up to 2,000 passwords, but it still leaves out two-factor authentication and limits you to three tags per password.",
    "The Advanced plan is very attractive at A$5/month (approx. US$3.30). You get unlimited password storage, 10 tags per entry, two-factor authentication, and secure messenger. The Pro plan, for A$7/month (approx. US$4.70), builds on this with premium support, 20 tags per entry, and 100 single-use login codes.",
    "Intuitive Password is one of the most feature-packed password managers we’ve seen. It covers all the basics, including a password generator and browser extensions that let you auto-fill credentials online. But it also gives you the ability to set expiration dates for passwords and will remind you to change them so that you never fall behind on security.",
    "We also loved that Intuitive Password offers unlimited password sharing, even for free users. When you go to share a password, you get a sharing ID and passcode that other Intuitive Password users can use to add the data to their account. Helpfully, passwords you’ve shared or that have been shared with you are held in their own tab within the interface.",
    "We also liked the secure messenger, which Intuitive Password built with teams in mind. Given the prevalence of apps like WhatsApp, this messenger feels a little extraneous. But, it does offer a nice solution for sharing passwords securely without switching to another platform.",
    "Intuitive Password also offers single-use login codes, which can be used in lieu of your master password. This is a major plus for one-time logins on potentially compromised or monitored computers.",
    "Getting started with Intuitive Password isn’t as simple as with other password managers. For starters, there’s no way to import data entries from a CSV or another password manager. You have to manually create each entry, which can be time-consuming if you’ve already used another system for storing passwords.",
    "That said, you can clone data entries, which makes the process go a little faster if you use a single email address for many of your accounts.",
    "Intuitive Password’s browser-based interface is cluttered and confusing. To start, there are menus on three sides of the page. It’s not clear why the platform didn’t follow the same three-column layout as many other password managers, as this would make the user interface much easier to navigate.",
    "Layout decisions aside, we loved the way that Intuitive Password helps you organize your data entries. You can sort credentials into seven different default categories and create additional categories as needed. You can also create sub-folders—for example, under Logins there are folders for General Logins, Network Logins, and more.",
    "You also have leeway in customizing individual data entries. You can’t create fully custom fields, but you can rename existing fields. The notes box for every entry is a rich text editor, which opens up a lot of possibilities. We also appreciated that Intuitive Password supports tags for easy database searching.",
    "Intuitive Password helps protect your account in several important ways. First, it provides a security dashboard that alerts you to weak or duplicated passwords. On top of that, you can set expiration dates for all of your passwords to be reminded to change them.",
    "We loved that Intuitive Password enables you to add a second master password to your most sensitive passwords and data. This ensures that even if someone gets unauthorized access to your account, they’ll need another password to de-encrypt these records.",
    "One big issue we have with Intuitive Password, though, is that all of your data is kept on the company’s servers, not your own devices. This opens up a lot of extra room for hackers to grab sensitive data, including your account login credentials. While Intuitive Password goes to lengths to protect user data, we’d rather they didn’t have it in the first place.",
    "Intuitive Password provides support via email only. The company’s website includes answers to dozens of common questions, as well as a detailed documentation center that effectively serves as a user manual.",
    "If you want a password manager that stores your data on your own device, consider mSecure. This platform is very affordable, charging just $19.99 for a lifetime license. We also like its layout and the flexibility it provides for customizing your data entries. Unfortunately, though, mSecure doesn’t offer any way to securely share passwords within teams.",
    "Intuitive Password is jam-packed with features that make it an attractive password manager for both individuals and teams. We loved that the platform enables you to securely share passwords and offers single-use passcodes.",
    "However, the fact that you can’t import data from another password manager is a major flaw. We also have concerns about the fact that your data is stored with Intuitive Password rather than on your computer. Intuitive Password is overall very good, but these concerns weigh the platform down.",
    "You might also want to check out our Element secure messenger review."
  ],
  "headers": {
    "1": "Plans and pricing",
    "3": "Features and utilities",
    "7": "Setup",
    "9": "Interface and performance",
    "12": "Security",
    "15": "Support",
    "16": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "best password manager": "https://www.techradar.com/best/password-manager",
    "two-factor authenticatio": "https://www.techradar.com/news/what-is-2fa",
    "password generator": "https://www.techradar.com/best/password-generator",
    "WhatsApp": "https://www.techradar.com/best/whatsapp-alternatives",
    "database": "https://www.techradar.com/best/best-database-software",
    "mSecure": "https://www.techradar.com/reviews/msecure",
    "Intuitive Password": "https://www.intuitivepassword.com/en/Home/Overview",
    "Element secure messenger": "https://www.techradar.com/reviews/element-secure-messenger-review"
  }
}