{
  "source": "https://www.techradar.com/reviews/pure-flux-one",
  "title": "Pure Flux One review",
  "category": "fitness",
  "updated": "2021-09-20T14:42:14Z",
  "author": "cat-ellis",
  "summary": "A reliable, thoughtfully designed budget e-bike, but only for shorter city journeys",
  "verdict": "The Pure Flux One is a sturdy, dependable e-bike for short city hops. It's extremely good value, and its practical design means it'll serve you well for short commutes and daily errands. The ride is smooth and comfortable, and it's thoughtfully designed for minimal maintenance. The Flux One isn't a bike for weekend cruising though; its bottle-style cell battery charges quickly, but with a maximum range of just 25 miles you won't want to be away from a power socket for too long. A great bike for the money, but make sure you're aware of its limitations before buying.",
  "pros": [
    "Affordably priced",
    "Low-maintenance design",
    "Smooth, comfortable ride"
  ],
  "cons": [
    "Abrupt acceleration",
    "Only one frame size",
    "Very limited range"
  ],
  "article": [
    "If you're not in the UK, you might not be familiar with Pure Electric, but the company makes some of the best electric scooters around (including our current number one choice, the Pure Air Pro). The Pure Flux One is its first electric bike, and is an easy and affordable way to hop around town without breaking a sweat – though there are a few rough edges that will hopefully be smoothed out with future models.",
    "At £999 (about $1,400 / AU$1,900), the Flux One is one of the most affordable commuter e-bikes around. You can find less expensive models on Amazon (many of dubious provenance) but we wouldn't advice skimping when it comes to a vehicle with a powerful motor that you'll be riding in traffic. Pure is a well established brand with a track record of good customer service including returns, free safety checks, and regular maintenance at service centers.",
    "Like most city e-bikes, the Flux One is a hybrid with flat handlebars, giving a good balance of comfort and manoeuvrability in traffic. The riding position is fairly upright, prioritizing visibility rather than speed, and overall it's one of the most comfortable commuter e-bikes we've tested so far.",
    "We're also fans of the carbon belt drive system, which is far less hassle than a conventional chain for city riding. It won't respond too well to being clogged with mud, but provided you stick to relatively solid surfaces (asphalt, cement, gravel) you'll find there's practically no maintenance necessary. No oiling, tensioning, or worrying about the chain jumping during gear changes.",
    "The ride is smooth and easy on the flat without power assistance, and the motor has plenty of power to help you glide up hills that would normally leave you sweating. However, that power comes in fits and starts; when you switch to a higher power assistance setting, there's a noticeable delay, then an abrupt burst of noisy acceleration before the bike settles into its new mode.",
    "You'll get used to it after a while (and you'll have to, since the drive system has no gears), but it's worth being prepared for. You don't want to accidentally hit the button twice and switch up two power levels at once.",
    "The Flux One's biggest issue, however, is its lack of range. The Samsung cell battery will keep you riding for a maximum of 25 miles when fully charged, which is far less than most other e-bikes we've tested – and less than many electric scooters.",
    "The Pure Flux One might not be perfect, but it's a dependable everyday city bike, and is very impressive for the price. Hopefully the next model will offer a choice of frame sizes and smoother acceleration, but if you're within the height range, it's definitely worth getting to a showroom for a test ride.",
    "The Pure Flux One was released in August 2021, and costs £999 (about $1,400 / AU$1,900). It's available direct from Pure Electric, either online or in one of its showrooms.",
    "At first glance, the Pure Flux One bears quite a resemblance to the Cowboy 4 thanks to its flat handlebars, carbon belt drive system (courtesy of Gates), matt black paintwork and minimal branding",
    "However, while the Cowboy 4 is a luxury machine decked out with extras including built-in lights, fall detection and theft detection, the Flux One is built for everyday city-hopping without extraneous frills. Pure has focused on getting the essentials right, prioritizing comfort and ease of riding – and as a result. the Flux One is half the price of the Cowboy.",
    "There are some issues, though. The Flux One's step-over frame comes in just one size, designed to fit riders between 5'7\" and 6'2\". It's a range that caters to most men, but excludes the majority of women, whose average height is 5'4\" in the US and 5'3\" in the UK.",
    "At 17.5kg including the battery pack, the Pure Flux One is pretty light for an e-bike (sitting in between the 18.9kg Cowboy and the 13.1g Ribble Hybrid ALe) , and the position of the bottle-style battery means the center of gravity is roughly central to the frame, making it easy to pick up and carry.",
    "The battery can be unlocked from the frame using a key. It slides out easily, and can be charged either on or off the bike. Removable batteries like this might not look as sleek as ones integrated into the frame, but the ability to charge without plugging in your entire bike is a real advantage. You can also remove the battery after locking the bike up outside, making it less susceptible to theft and vandalism.",
    "There's a small display and control unit within easy reach of your left thumb, showing the current power mode, plus distance travelled. A button on the top of the unit turns the bike on and off, and arrow buttons on the face allow you to switch between power settings (more on this shortly).",
    "There are no mudguards as standard, which though there are eyelets so you can fit your own. The bike has no integrated lights either (only reflectors and reflective decals) so you'll also need to factor a set of removable ones into your budget.",
    "Although its hybrid design can handle a little riding on loose surfaces like gravel, this is chiefly an e-bike for city riding, and is most at home replacing your car for short commutes and other everyday journeys. We found the ride smooth and comfortable (our reviewer is right in the middle of the recommended height range), and the relatively upright geometry gives you good visibility in standing traffic.",
    "The controls are simple, but thoughtfully designed, with everything within easy reach of your left thumb. Many e-bikes we've tested have power buttons located in slightly odd places, such as the top tube, which can be inconvenient when you're in a hurry to get moving. Here, you can control the power and assistance level without even glancing down.",
    "You don't get a fully fledged trip computer, and unlike e-bikes using drive systems from the likes of Mahle and Shimano, there's no companion app that allows you to customize the bike's settings and plot routes. The display is clearly visible in most lighting conditions though, and shows key stats (speed, battery level, and distance ridden) at a glance.",
    "That's vital info, and you'll want to keep a close eye on the power level because the Flux One has a maximum range of just 25 miles, compared to 40 or even 60 for other entry-level e-bikes. It's also considerably less than many electric scooters, including the Pure Air Pro.",
    "We found there was noticeable delay between pressing the up button, and the bike's motor kicking in, and when it does, the bike accelerates rapidly before settling at its new speed. It's a somewhat jarring experience; it does help you get away quickly at road junctions and traffic lights, but when you only want a little more assistance on a hill, it can be unnerving. The motor is also quite noisy as it whirrs into action, though the noise subsides after the initial acceleration.",
    "It's a quirk that takes a little getting used to (at first we found ourselves accidentally shifting up two power settings at once, thinking our first press hadn't registered) but you'll come to expect it. You'll have to because there are no gears, and powering 17.5kg of bicycle uphill under your own steam is hard work.",
    "That's not what the Pure Flux One is designed for, though. It's not perfect, but this e-bike is robust and thoughtfully constructed for jaunts into town or your daily ride to work. It's excellent value as an everyday commuter bike – just be sure you're aware of its limitations."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Pure Flux One price and release date",
    "9": "Pure Flux One design",
    "16": "Pure Flux One performance",
    "23": "Don't buy it if"
  },
  "links": {
    "Pure Electric": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-5295292438457770000&p=https%3A%2F%2Fwww.pureelectric.com%2F",
    "best electric scooters": "https://www.techradar.com/best/best-electric-scooters",
    "Pure Air Pro": "https://www.techradar.com/reviews/pure-air-pro-2021-electric-scooter",
    "Pure Flux One": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-5434697953272444000&p=https%3A%2F%2Fwww.pureelectric.com%2Fcollections%2Felectric-bikes%2Fproducts%2Fpure-flux-one-electric-hybrid-bike",
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "direct from Pure Electric": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-2020625528107208700&p=https%3A%2F%2Fwww.pureelectric.com%2Fproducts%2Fpure-flux-one-electric-hybrid-bike",
    "Cowboy 4": "https://www.techradar.com/reviews/cowboy-4",
    "Ribble Hybrid ALe": "https://www.techradar.com/reviews/ribble-hybrid-al-e"
  }
}