{
  "source": "https://www.techradar.com/reviews/amazfit-bip-u-pro",
  "title": "Amazfit Bip U Pro review",
  "category": "reviews",
  "updated": "2021-04-30T06:34:14Z",
  "author": "srivatsa-ramesh",
  "summary": "An impressive package on a budget",
  "verdict": "The Amazfit Bip U Pro is a great fitness tracker for its price with over 60 sports tracking modes and plenty of health-related features. However, the stars of the show are the built-in GPS and Alexa smart assistant. The core experience is still similar to the Bip U. The Bip U Pro is arguably the best smartwatch in its price bracket with few rivals to match it. However, Alexa doesn't work as well as we'd hoped.",
  "pros": [
    "Built-in GPS",
    "Fitness and tracking features",
    "Precise sleep tracking",
    "Value for money"
  ],
  "cons": [
    "App sync issue",
    "Notification management",
    "Alexa isn’t very useful"
  ],
  "article": [
    "As the name suggests, the Amazfit Bip U Pro is an improved version of the highly popular Bip U. While retaining everything from its predecessor, it adds a couple of new features without getting too expensive.",
    "The Amazfit Bip U Pro smartwatch comes with a built-in GPS for outdoor tracking and a voice assistant with Amazon Alexa integration. While these two are welcome additions in the cheap wearable space, only the former is reliable.",
    "The Alexa integration adds very little value to the smartwatch experience here. However, Huami has excelled itself with the addition of built-in GPS to the Bip U Pro, which is one of few budget wearables to have this feature. The GPS tracking works well, and gives accurate results.",
    "Apart from these two major additions, everything else is pretty much the same as we’d seen on the Amazfit Bip U. You get the same design language – the two wearables are indistinguishable when placed side by side, and the 1.43-inch LCD color display is bright enough to be clearly readable even on sunny days.",
    "The Amazfit Bip U Pro shines once again when it comes to fitness and health-related features with the inclusion of heart rate, SpO2, sleep, breathing tracking and much more. In terms of tracking, the wearable can track more than 60 sports. As for the smart features, you get Alexa, notification mirroring, music control, and a camera shutter.",
    "Being one of the few smartwatches to offer built-in GPS for Rs 4,999 / $59.99 / £59 (about AU$80) itself makes the Amazfit Bip U Pro one of our recommendations. For anyone who's looking out for a decent fitness tracker with GPS onboard, the Bip U Pro is a good choice. However, those who prefer more smart features will be disappointed.",
    "The Amazfit Bip U Pro was launched in India in April 2021, it arrived a few months before in other markets including the US and UK. It is priced at Rs 4,999 / £59.99 in the UK and $59.99 in the US. The Amazfit Bip U Pro is available in black, green and pink colorways.",
    "The Amazfit Bip U Pro is a budget smartwatch and the design is very minimalistic. In fact, it is the same as the Bip U - including the weight, bezels, button layout, and sensor placements.",
    "The Bip U Pro is available in black, green and pink color options. We’re using the black variant for our review. The wearable is also quite thick, measuring 11.4mm, but not heavy on your wrist at just 31g. You get a pair of pre-attached straps that can be easily swapped with any other 20mm strap. The default strap is made of silicone rubber material and we had no issues wearing it for longer durations. To get the perfect fit the strap offers 14 holes, and the interlocking system makes the watch sit in place firmly.",
    "On the side of the device, you get a button that performs a few operations. For instance, the button is used to wake the screen, open the menu, go back, and a long press function can also be customized on the watch itself. You can choose between activity goals, PAI, heart rate, sleep, workout, history, SpO2, stress, breathing, and much more.",
    "On the back, there is a BioTracker 2 PPG biological optical sensor to measure your heart rate. You also get a SpO2 monitor to track your blood oxygen level. The Bip U Pro is also waterproof to 50 meters, and can track both pool and open water swimming.",
    "The whole body is made up of polycarbonate, and is built well. We have nothing to complain about when it comes to the build quality of the device, especially for the price.",
    "The display is also the same as the Bip U’s, measuring 1.43 inch with a resolution of 320 x 302 pixels. It is a TFT LCD screen that looks vibrant and sharp. You get four levels of brightness control on the watch, and the indoor visibility is great. While it’s not AMOLED, the display is sufficient for outdoor readability as well. Sometimes we wished the peak brightness was a bit higher - but that's not a deal-breaker. It’s also worth mentioning there’s no option to set auto-brightness. In our use case, since we were indoors most of the time, 25% brightness was enough. We bumped that to 75% outdoors, and 100% on some extremely sunny days.",
    "The display is protected with curved Corning Gorilla Glass 3 for additional protection. Even with some rough usage during our review period, we are happy to report the watch had no scratches. Lastly, the touch experience was also very responsive and easy to use throughout the review period.",
    "You can choose different watch faces by long pressing on the home screen. If you are not happy with the options here, you can explore a fine collection of them in the companion Zepp application. You can pick from over 50 watch faces and a few of them are customizable as well. You can also customize and upload an image to create your own watch face.",
    "There’s no always-on display option, so you can keep the screen on max for up to 15 seconds only, but you get an option to wake up on notifications.",
    "Fitness features are the core functionality of the Bip U Pro and this is one area where the wearable shines. The Amazfit Bip U can track over 60 sports including badminton, cricket, swimming, free workout, cycling, rope skipping, rowing, and dance among major ones.",
    "In terms of sensors, you get accelerometer and gyroscope motion sensors to track indoor activity, show step counts, and enable automatic sleep tracking. You get stats for steps taken, the number of times you’ve stood up, calories burnt, distance travelled and your target steps. The selling point of the phone is the built-in GPS for all your outdoor activity tracking.",
    "The BioTracker 2 PPG optical sensor delivers continuous heart rate monitoring. It can also track heart rate during exercise which provides detailed insights. You also have the option to set heart rate interval from one minute to every 30 minutes, or you can completely turn off and measure it manually - which also helps to extend battery life. The Bip U Pro comes with stress tracking, breathing exercise, and the PAI Health Assessment system which gives points based on how active and how regularly you’ve been giving your heart a good workout. It also records heart rate throughout the workout with zones, pace, and cadence.",
    "The SpO2 sensor brings the ability to take blood oxygen measurements which is a nifty addition considering the situation we are going through. However, to make it work, you will need to place your hand on a table, and even a slight moment in hand will fail in securing the score. It works only if your hand is stable. Apart from that, the basic tracking data is pretty accurate and results are represented well on the app as well as the watch. It’s advised not to use the data from the Bip U Pro for any medical treatment.",
    "The steps taken were measured pretty accurately during our usage. We also did a manual 100 step count a few times and we got 98% accuracy, which is impressive. The heart rate measurement was pretty accurate as well and worked like charm every time. All the aforementioned details are shown with more insights into the Zepp application.",
    "In terms of sports tracking, since there was a lockdown and restrictions in place during testing, I could only try out freestyle, walking, running, and badminton modes. A few times, I even left my phone behind and went for a walk in the park to check the accuracy of the GPS on the watch and I’m very happy to report, the tracking was very accurate. GPS positioning might take a few seconds to latch on, but once that’s done, it's easy to map activities. Only once during my usage, I lost the positioning but, a few seconds later it was latched back. Using GPS means the battery will drain quicker, so make sure you check the battery status after you return from any outdoor activities.",
    "Sleep tracking in wearables is one of my favourite features, and the Bip U Pro nails it here with extremely accurate data. It not only tracks your sleep time and awake time, but the app also provides data like sleep stages - deep sleep, light sleep, REM (rapid eye movement), and even offers you a sleep score. The watch is also capable of tracking afternoon naps.",
    "For stress level data, again your hands should be held firmly for about 30 seconds. The data will be shown along with the score, which ranges from 1 to 100 and is divided between relaxed, normal, medium, and high. You can opt for all-day stress tracking or measure it manually. The device also comes with a menstrual cycle tracker for women. Apart from that, you get reminders to stand up and a notification when your daily goal is reached.",
    "In a nutshell, the Bip U Pro is again one of the most featured packed fitness trackers in the budget segment with heart rate, SpO2, sleep monitoring, swim tracking, and built-in GPS - all of which work well. This wearable beats the competition by quite a margin. These modes, activity tracking and the presence of a built-in GPS should satisfy a buyer at this price point.",
    "While the budget smartwatches come with a plethora of sports modes to track, the one area where all of them fall behind is in terms of smart features. With the Amazfit Bip U Pro, Huami, also known as Zepp Health has added a feature that no other wearable in the segment can match: Amazon Alexa voice assistant. While that might sound cool for a budget smartwatch, the actual experience wasn’t that great.",
    "Setting up Alexa on the watch itself is an arduous process. In the Zepp app, you have to go to Profile > Add accounts > Amazon Alexa. Apart from Alexa integration, the app also supports WeChat, Google Fit, Strava, and Relive account integrations - which should come in handy for most of the users. The settings and options on the app are all over the place and we wish Huami had organized it in a better way.",
    "In terms of the usability of Alexa, firstly you can access Alexa by swiping right on the home screen which brings a “Connecting to Alexa” prompt that takes about two to five seconds to change to “Alexa is listening” with a subtle vibration. The smartwatch does come with a microphone to listen to you, but the response will be in the form of text only as the device lacks a speaker. Unlike other Amazfit smartwatches, the Bip U Pro lacks support for offline commands and Bluetooth calls.",
    "In terms of the usability of Alexa, firstly you can access Alexa by swiping right on the home screen which brings a “Connecting to Alexa” prompt that takes about two to five seconds to change to “Alexa is listening” with a subtle vibration. The smartwatch does come with a microphone to listen to you, but the response will be in the form of text only as the device lacks a speaker. Unlike other Amazfit smartwatches, the Bip U Pro lacks support for offline commands and Bluetooth calls.",
    "You can ask very basic questions to the voice assistant and it will respond in the form of text and show up on the tiny screen. I did use the feature to test out how it works, but I am not sure if anyone would use this feature to get some information on their wrist. Apart from this, Alexa can also start a timer, set an alarm, and check the weather. The company also claims the watch can be used to control smart devices. I did try that feature but, all I got back in response was - “I didn't find any smart home devices under my account”, even though I had a few smart bulbs linked to my Alexa account.",
    "When I asked to start a walk or a run, the response I got back was “Tracking runs and walks is available on Echo Buds through the Alexa app on your phone”. Things get even worse when Alexa struggles to establish connectivity - it just says “Network busy” and quits.",
    "At the end of the day, I got frustrated and I didn’t even want to use the feature for anything except setting an alarm for my afternoon nap and setting a timer.",
    "Apart from that, you get notifications from all the apps you choose, but don’t expect a very organized rich notification experience as we’ve seen on some WearOS or even RTOS wearables. The Bip U Pro can hold up to 10 notifications at once, and notifies you of the incoming calls with the option to reject or silent the incoming call. The watch is incapable of displaying emoji. To access the notifications, you can swipe up on the home screen.",
    "While there’s no option to store or access third-party music streaming apps, you can control media on your phone, which you can play/pause, skip forward and back, and control volume. All of these functions worked well.",
    "Other features include detailed weather updates for the next five days. There are other useful tools like World Clock, Alarm Clock, Stopwatch, Find My Phone and Countdown. You also get a to-do list, which can be synced with the Zepp app and Pomodoro Clock, which should be handy for people who work from home and need to focus on work.",
    "The Amazfit Bip U Pro harnesses Bluetooth 5.0 LE and supports both Android and iOS devices; it pairs via the Zepp application which gives you more control over the smartwatch. The app experience isn’t entirely smooth though. The pairing process is straightforward, but once it's connected, you have to put some effort to get the exact menu you’re searching for. This is a hard process as the menus aren’t intuitively organized.",
    "Even when we were using the Bip U Pro with our phone next to it, the app often took a long time to reconnect and sync, as you can see from our screenshots below. Due to this issue, we also missed notifications quite often. This is frustrating because we had the same issue with Bip U and the company hasn’t fixed the issue even after several months.",
    "On the smartwatch, swiping left will bring up shortcuts that bring up activity goals, heart rate, SpO2, PAI, weather, music, sleep, workout, cycle tracking, alarm, and world clock. These can be customized in any order and can be removed altogether. This customization can be done on the watch itself.",
    "On the smartwatch, swiping left will bring up shortcuts that bring up activity goals, heart rate, SpO2, PAI, weather, music, sleep, workout, cycle tracking, alarm, and world clock. These can be customized in any order and can be removed altogether. This customization can be done on the watch itself.",
    "Swiping down on the home screen reveals quick shortcuts which include DND, alarm, brightness, and settings. On the top, you can see the connectivity status, battery level, and time. Pressing the button on the side will bring up a list of menus - Activity Goal, PAI, Heart Rate, Sleep, Workout, Workout History, SpO2, Stress, Breathing, Cycle Tracks, Alarm, Settings, and more.",
    "You also get the auto screen off, screen saver, lit up the screen when a notification arrives, options that can be turned on/off if and when needed.",
    "Overall the UI performance was snappy and I had no issues navigating. One good thing about the watch’s software is that most of the features are added on the watch itself for customization rather than depending on the app all the time.",
    "Huami claims the Amazfit Bip U Pro can last up to nine days with typical usage and up to five days with heavy usage. There’s a 230mAh battery unit packed inside the body, the same as the predecessor Bip U.",
    "Once fully charged, I could get up to five days of usage with notification from apps like Gmail, WhatsApp, SMS, and calls. The watch typically lasted for five days during our testing, which isn’t bad considering we were getting close to 200-250 notifications per day. The usage also included daily workout for about 15 minutes and a bit of walking with brightness set to 75% and heart rate, SpO2 set to manual and sleep tracking enabled.",
    "However, when you take the smartwatch to run or walk with GPS turned on, the battery will drain faster. By playing with some notifications settings and customizing what notifications show up on the watch, you can get slightly better battery life. In a nutshell, you should be able to pull off at least three days of battery life even with the heaviest of usages such as GPS, heart rate, SpO2, and multiple notifications.",
    "Recharging the battery is a straightforward process, the Bip U Pro magnetically attaches to the back of the included charging cradle. The clip fits securely to the back and won’t fall off easily. In our testing, the Amazfit Bip U could go from 0 to 100% under two hours. It‘s also worth mentioning that you won’t be able to open any app/feature while the watch is charging."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Amazfit Bip U Pro price and release date",
    "7": "Design and display",
    "16": "Fitness features",
    "25": "Smart features",
    "35": "App experience and UI",
    "42": "Battery life",
    "46": "Don’t buy it if…"
  },
  "links": {
    "Bip U": "https://www.techradar.com/reviews/amazfit-bip-u",
    "smartwatch": "https://www.techradar.com/news/best-cheap-smartwatch",
    "smart features": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074"
  }
}