{
  "source": "https://www.techradar.com/reviews/epos-i-sennheiser-adapt-260-headphones",
  "title": "EPOS I SENNHEISER Adapt 260 Headphones review",
  "category": "audio-visual",
  "updated": "2021-07-06T14:32:59Z",
  "author": "mark-pickavance",
  "summary": "Cheap but classy headphone design from a trusted source",
  "verdict": "EPOS has combined good functionality with some excellent build quality at a price that most businesses would jump at. But they’re unsuitable for wearing for a full working day, and therefore more suitable for occasional users.",
  "pros": [
    "Affordable",
    "Nicely made",
    "Clear sound",
    "Good battery life"
  ],
  "cons": [
    "Volume control is too granular",
    "Not comfortable enough for all-day wear",
    "Noise-cancelling could be better"
  ],
  "article": [
    "Before we get into the details of this product, we need to talk about those who made it, as that’s a little confusing.",
    "EPOS is part of the Demant Group, described on its website as ‘a world-leading audio and hearing technology group’, but how does that relate to Sennheiser?",
    "EPOS was a business segment of a joint venture between Sennheiser Communications, Sennheiser Electronic GmbH & Co. KG and Demant A/S, and they all decided that these parts should evolve independently.",
    "EPOS’s own-branded product range is expanding, but also continues to sell the current Sennheiser Communications portfolio co-branded as EPOS I SENNHEISER.",
    "And, the Adapt Series are co-branded products that still bears the Sennheiser name, even if you won’t find it on that brand’s website.",
    "Not wishing to bore you any further with the vagaries of board-level marketing decisions, are these headphones affordable, and are they any good?",
    "The Adapt 200 series come in four flavours currently, with the mono 230 and 231 options alongside the stereo 260 and 261.",
    "What differentiates the headsets is that the 230 and 260 (reviewed here) come with a USB-A Bluetooth adapter, where the 231 and 261 have a dongle that is USB-C.",
    "All these designs are inherently Bluetooth, meaning they will work with existing internal laptop adapters and the USB wired connection without the need for any dongle.",
    "UK pricing directly from EPOS is £139 for the 260 or 261 and £135 for the 230 or 231. And US costs are $179 for the 260 or 261 and $169 for the 230 or 231.",
    "Online retailers may have better deals than this, and obviously, Enterprise customers looking to bulk buy should negotiate better pricing.",
    "Once you remove the Adapt 260 from their pull-string bag, first impressions are of a very finely made headset that has been stylised to be almost entirely black. Unlike many business orientated designs, these don’t come in white. It’s black, period.",
    "What makes them look singularly more expensive than they are is that the black plastic that they’re constructed comes in a variety of textures from mirror-gloss to a textured near-matt finish.",
    "This Noire motif is only broken by two incredibly thin rings of silver that separate the driver mounts from the soft ear cushions, and the call control button is tinted in a dark mauve to make it stand out. As a pure design exercise, the Adapt 260 had already exceeded our expectations before it made any sounds at all.",
    "After we’d bathed in its design aesthetic, we noticed a few interesting choices that EPOS made that run counter to what we’ve seen elsewhere.",
    "Specifically, the righthand side of the headset is dominants control, and to achieve this, it is physically larger. The difference is only about 3mm if measured from the outside of the band to the inside of the cushion. That’s enough to place the controls around the right earpiece and squeeze the microphone boom on the inside of the band.",
    "When the microphone arm isn't required, and it can be stowed inside the band with a small retaining divot making it much easier to place inside the carry bag without the boom interfering. The arm also can come out in either direction, making it possible to reverse the control and inputs side.",
    "In addition to the headset, EPOS also included a USB Bluetooth dongle and a USB charging cable that’s USB-A at the computer end and USB-C on the headset.",
    "Using USB-C on the headset is an intelligent choice, as there isn’t a wrong way to insert the cable, and it’s a very positive connection. It also allows those that use a USB-C charged laptop to charge the headset using the same charger.",
    "There are few aspects of these Adapt 260 that we need to discuss under the banner of useability. Let’s start with how easy they are to use.",
    "Using the provided Bluetooth dongle, the headset is automatically connected once you insert that into a running system and power them on. The power button is also the Bluetooth pairing button, so if you need to pair it to a different adapter, you can initiate that process with the same button.",
    "Nearby is the action button, which has various functions depending on what the headset is doing. For example, those using Microsoft Teams can answer a call with it. And, for those crazy enough to be using Cortana, it can fire off that technology ready to do your bidding.",
    "And, the final control is a toggle switch that is mostly intended to change the volume setting. The problem with this not being a dial is that it jumps 10% of the volume setting with each push, making it difficult to configure the perfect settings without using a slider bar in Windows.",
    "When the headset is connected via USB, charging is indicated by a small coloured LED near the power button, and it changes colour according to the battery capacity. Red for less than 20%, purple for between 20% and 60%, and blue for over 60%. When it reaches 100%, the LED turns off, which is the least helpful it could be.",
    "Overall, these aren’t the best controls that we’ve ever used, but for most users, they’re acceptable and won’t take much time to learn.",
    "More of an issue for us was the comfort level of the headset since it has minimal scope for adjustment. The bottom half of the support band twists about halfway up, but this is mostly to allows the earpieces to lie flat. What the band lacks most is any means to change its circumference, or so we thought.",
    "But we’d missed one tiny image on the product notes that indicated that the speaker elements could move in a groove on the inside of the band.",
    "Your writer's head bears an uncanny resemblance to that of Kryton from Red Dwarf, and with the Apapt 260 positioned with the drivers directly over my ears, the top of the band didn’t touch the top of my head. Once I’d adjusted the band, it did fit better but the cushioning on the centre of the band directly on top of my head wasn’t enough to compensate for the curvature of my skull.",
    "Initially, this was bearable, but after wearing these for around three hours, the amount of friction started to make them less than comfortable, and the thought of wearing them for a whole working day wasn’t a pleasant one.",
    "They might fit someone who is technically more human than me better, but the very limited cushioning on the band doesn’t make this design ideal for prolonged use.",
    "We've arrived at the critical part of any headphones review, where we discuss how they sound.",
    "Often with wireless headphones lack bass and have a bias towards the higher frequencies, the exact opposite of the Adapt 260. Bass output is very impressive, considering how relatively small the speakers are inside, but the middle frequencies are a little muddy, and the higher end is frequency clipped somewhat.",
    "It's difficult to determine if the limited upper range is a bi-product of processing for voice clarity, but that looks like a likely scenario. These things said, listening to music on these isn’t a bad experience, but it isn’t one that audiophiles would run to embrace either.",
    "The microphone gives an unambiguous representation with more range than we’d expected, making it ideal for conferencing. However, the noise-cancelling technology needs tweaking somewhat as it doesn’t eliminate all background sounds. For those in a noisy office or industrial environment, those sounds can be heard by those listening remotely, even if it is at a much-reduced level.",
    "Our perception of noise-cancelling in these devices has been recently coloured by reviewing the Bose 700 UC, which given the price of those, might be an unkind comparison.",
    "Probably one of the best features of these, when compared with other Bluetooth headphones, is the battery life, with a quoted talk time of 27 hours.",
    "We didn’t get that much, but it will certainly get you through more than a couple of days of use without needing to recharge. And, a full recharge doesn’t take more than a couple of hours.",
    "Overall, they’re far from perfect, but for the asking price, the Adapt 260 is a remarkable value for money.",
    "Overall, these are particularly good for what seems something of a bargain price.",
    "Maybe they’re not the most comfortable cans we’ve worn, but they’re good in enough ways to easily justify this expenditure.",
    "The strengths of this design are the excellent battery life, Microsoft Teams certification and how they’ve been optimised for UC. With both these standards in play, they should work well with most conferencing applications and softphones without requiring much effort on the part of the user.",
    "The controls are basic but workable, and the clarity of the sound is good enough for a range of uses. They’re not sold as being for music appreciation, though they’re far from being a bad experience for those who like to enjoy background tunes to their working day.",
    "We’d of liked better noise-cancelling and more comfort, but depending on where you intend to use them and for how long, they are more than acceptable for the majority of users."
  ],
  "headers": {
    "6": "Price and availability",
    "11": "Design",
    "19": "In use",
    "30": "Sound performance",
    "38": "Final verdict"
  },
  "links": {
    "Bose 700 UC": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-uc-700-review"
  }
}