{
  "source": "https://www.techradar.com/reviews/asus-chromebook-flip-cm3200",
  "title": "Asus Chromebook Flip CM3200 review",
  "category": "computing",
  "updated": "2021-11-03T21:37:08Z",
  "author": "john-loeffler",
  "summary": "The Asus Chromebook Flip CM3200 offers middling power at an exceptional price",
  "verdict": "The Asus Chromebook Flip CM3 isn't the most powerful Chromebook on the market by a long shot and its compact size can be a double-edged sword, but you can't beat this little 2-in-1 for the price.",
  "pros": [
    "Outstanding price",
    "Compact and portable",
    "Great Display",
    "Respectable battery"
  ],
  "cons": [
    "Underwhelming performance",
    "Cramped keyboard",
    "Limited ports"
  ],
  "article": [
    "The Asus Chromebook Flip CM3200 isn't a very powerful 2-in-1 laptop by any means, but its powerful enough, and comes with some quality features that make it one of the best budget laptops around.",
    "Chromebooks are meant to be affordable and useful devices for general computing needs like web browsing, checking emails, streaming movies, and taking the occasional video call or two from the comfort of your couch or local coffee shop.",
    "By that metric, the Chromebook Flip CM3200 delivers exactly what you'd expect and even offers a little extra. This includes a 2-in-1 form factor, an HD screen with 3:2 screen ratio for more useful screen space on its 12-inch LCD display, and pretty impressive battery life given its size.",
    "Naturally, it's highly portable given its dimensions and weight, but the 3:2 display really makes the Chromebook Flip CM3200 look bigger than it is.",
    "If you're someone with larger hands, though – or even someone with just medium-sized hands, really – than you're going to be reminded pretty quickly of the Chromebook Flip CM3200's smaller size as soon as you go to type on its keyboard for any stretch of time.",
    "The keys are smaller than your standard laptop keys and they are packed in pretty tight as well. That said, there really isn't much you can do with a laptop that's less than 11-inches wide, so the problem is less about the Chromebook Flip CM3200 design than it is a simple lack of physical space.",
    "Younger students using this for school assignments or reports might fare better than we did, though, and it is well-suited for a classroom.",
    "The hinge on the display has enough resistance to keep the screen in a given position, but was easy enough to open and close, or convert into tablet mode for note taking during a meeting.",
    "The review unit we were sent for this review included an Asus USI Pen, which is sold separately for about $69 (about £50 / AU$95), and we were able to comfortably use the Chromebook Flip CM3200 in tablet mode with it.",
    "The performance of the Chromebook Flip CM3200 is objectively underwhelming. It's one of the worst scoring devices when it comes to our Chromebook benchmarks by a healthy margin, so there is no getting around the fact that the MediaTek processor here is not going to be able to do much more than your basic computing tasks.",
    "But, that's really all a Chromebook is meant to do, and in our experience with it, we didn't encounter nearly as many performance slowdowns as we were expecting. We found it was perfectly capable of browsing, streaming, and getting some work done in the cloud without any real issue, so long as we didn't load up on Chrome tabs.",
    "But that's a problem suffered by even some of the best laptops on the market, so it's hard to single out the Chromebook Flip CM3200 for that. The other thing to note is that the battery life on the Chromebook Flip CM3200 was a pleasant surprise with a strong seven hours and 38 minutes in our battery test. This was off just a 32WHr battery, which we weren't expecting to make past the five-and-a-half hour mark.",
    "You can get the Asus Chromebook Flip CM3200 right now in the US for $329 (about about £250 / AU$450). UK and Australia availability for the Chromebook Flip CM3200 is pending, as is its price when it becomes available in those markets. We've reached out to Asus for clarification on those points and will update this review when that information becomes available."
  ],
  "headers": {
    "0": "Asus Chromebook Flip CM3200 two minute review",
    "13": "Don't buy it if..."
  },
  "links": {
    "best budget laptops": "https://www.techradar.com/news/best-laptops-under-dollar500",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361"
  }
}