{
  "source": "https://www.techradar.com/reviews/cardongle-android-pc-client",
  "title": "CarDongle Android PC client review",
  "category": "computing",
  "updated": "2021-05-11T13:30:03.108Z",
  "author": "desire-athow",
  "summary": "A tantalizing device that could change the way Android lives in the car",
  "verdict": "CarDongle is a refreshingly original piece of technology that shows the potential of Android Auto. It is affordable, solidly designed and could be the gateway to a plethora of vehicle-focused apps. That said, we cannot yet vouch for its longevity.",
  "pros": [
    "Affordable",
    "Well designed",
    "Versatile"
  ],
  "cons": [
    "No SIM card",
    "Quality Assurance issues (especially on user interface)",
    "User can easily break USB port"
  ],
  "article": [
    "In-car entertainment is now a mainstream feature found in most vehicles bar the very basic models. Android Auto and Apple CarPlay are only two universally accepted platforms, mirroring the current status quo in the smartphone market.",
    "Google’s Android Auto app has been downloaded more than one billion times to date and it is estimated that more than 100 million cars worldwide have integrated the platform. However, it is not to the taste of everyone and still suffers from a few issues.",
    "While it offers similar functionality to mobile devices, it is often severely restricted with the most common complaint being the lack of video streaming or social media apps (for obvious reasons).",
    "Enter CarDongle, a USB car computer dongle that surfaced on Indiegogo late in 2020 and has raised more than £350,000 (US$ 495,000, AU$ 629,000) to date. It promises to supercharge Android in your car by augmenting the capabilities on your ICE (In Car Entertainment) system and freeing your smartphone.",
    "At the time of writing, CarDongle is available via Indiegogo’s Perk system with prices ranging from $99.99 for the 2GB/16GB model or $119.99 for the the 4GB/64GB model. As always, exert caution as crowd-funding projects do not always end up successfully and backers can be left without support but with a big hole in their pockets.",
    "The CarDongle is cylindrical in shape, a bit bigger than the average adult thumb, with a grey ring at one end and a USB connector at the other. It is made mostly (entirely?) of plastic and looks a lot like an anonymous Android TV stick with USB in lieu of HDMI, a featherweight device that can be easily hidden away.",
    "The outer part of the ring glows orange when firing up and turns to blue when in normal use. The whole body of the device is made of matte polycarbonate plastic which reduces the risk of scratches. We’d recommend you use a USB cable extension to minimize the probability of damage should you accidentally nudge the CarDongle when it is connected to the USB port.",
    "Inside the CarDongle are the innards of an entry level smartphone without the battery, speaker, screen and SIM card. There’s a fanless, passively cooled Mediatek octa-core system-on-chip clocked at 2GHz (with A53 cores), up to 4GB of RAM and 64GB onboard storage. There’s a cheaper 2GB/16GB model but it’s worth spending a bit more. It comes with a microSD card slot (supporting up to 128GB cards), Wi-Fi, GPS, Bluetooth and there’s even a microphone.",
    "The CarDongle is dead easy to use. We plugged ours in, started the car (a Vauxhall Corsa) and Android Auto and that’s about it. Since there’s no SIM card, you will need to connect to a hotspot (likely to be your smartphone) so be wary about data and battery usage.",
    "The home screen is similar to that of a smartphone in landscape mode, with the navigation buttons on the right. Installed applications include YouTube, Netflix, Waze, YouTube Music and more. Note that you won’t be able to watch YouTube videos by default; you will need to actively enable it. Otherwise, only audio will be played back.",
    "While we do not condone watching YouTube while actively driving, it is perfectly acceptable when the car is stationary or when videos are played for other passengers. Not surprisingly, you will also be able to add more applications via Google Play Store; logging into your account is easy.",
    "The manufacturer has promised regular firmware updates to the three-year old Android 9.0 OS but we have to take its word for it. There’s no remote control, no cables and while you can plug it into a computer, it won’t interact with it which seems like a lost opportunity to get what could essentially be a headless PC.",
    "Ditto for the lack of Miracast which could have paved the way for some interesting consumer and business use cases.",
    "CarDongle is a new product that’s innovative enough to warrant a review; the concept is simple and the market is enormous but will it be enough to get a sustainable audience willing to pay for yet another connected device? Only time will tell. Similarly, this being an Indiegogo project, we do not know what the future holds for it, with the pandemic and chip shortages having delayed the delivery of the first batch already.",
    "If you live in the UK, you can get a cheap unlimited 4G SIM card for less than £16 a month and we believe that CarDongle missed a trick here by not converting the device into an optional mobile hotspot. The additional cost of adding the SIM card would have been worth it.",
    "Then there’s the unforeseeable; the original CarDongle (v1.0) suffered from a GPS issue which was unsolvable and needed a significant redesign that yielded a second model known as v1.5. It shows the inherent risks associated with Indiegogo and what the platform describes as work-in-progress projects.",
    "As such, the CarDongle is a true poster child; in Indiegogo’s own words: “Contributing to a campaign is not the same as purchasing a product”, in that you are not buying an off the shelf product and that comes with its own set of pros and cons.",
    "To CarDongle’s credit though, communication with its customers on Indiegogo has been top notch with regular updates and answers to existing and prospective customers."
  ],
  "headers": {
    "4": "Price and availability",
    "5": "Design",
    "7": "Hardware",
    "8": "In use",
    "13": "Final verdict"
  },
  "links": {
    "Android Auto": "https://www.techradar.com/reviews/android-auto-review",
    "Apple CarPlay": "https://www.techradar.com/reviews/car-tech/apple-carplay-1246127/review",
    "CarDongle": "https://cardongle.co/",
    "Indiegogo’s Perk system": "https://www.indiegogo.com/projects/cardongle-usb-car-pc-computer-dongle-for-vehicles#/",
    "Android TV stick": "https://www.techradar.com/best/android-boxes",
    "hotspot": "https://www.techradar.com/news/best-mobile-hotspots-for-3g-4g-and-5g",
    "4G SIM card": "https://www.techradar.com/sim-only/sim-only-deals"
  }
}