{
  "source": "https://www.techradar.com/reviews/dell-g5-15-se-2020",
  "title": "Dell G5 15 SE (2020) review",
  "category": "computing",
  "updated": "2021-12-01T15:06:28Z",
  "author": "john-loeffler",
  "summary": "The Dell G5 15 SE is fantastic value, but does that value come at a price?",
  "verdict": "Dell's G5 15 SE gets a lot of power out of its Ryzen CPU, but its Radeon GPU and the all-plastic build reinforce that this is a budget gaming laptop",
  "pros": [
    "Excellent CPU performance",
    "Very affordable for a gaming laptop",
    "Quick and vibrant display"
  ],
  "cons": [
    "Gets pretty hot under strain",
    "\"Meh\" design",
    "Plastic build feels flimsy",
    "Graphics are good, but not great"
  ],
  "article": [
    "Voted Best Budget Laptop at the TechRadar Choice Awards 2021",
    "Dell is always coming up with interesting variations of its different lines of laptops and the Dell G5 15 SE (2020) is a prime example.",
    "This all-AMD reinvention of the company’s budget gaming laptop line provides excellent value, with fantastic performance from the included AMD Ryzen CPU which surpassed our expectations. Unfortunately, the Radeon GPU is not quite as impressive.",
    "While Dell’s G5 15 line already manages to check the boxes for budget gamers who want to play on the go, the all-AMD configuration of the Dell G5 15 SE (2020) does the near-impossible and keeps the price of entry below $1,000 (about £800, AU$1,400). It offers a lot of value and makes for a solid all-around gaming portable.",
    "Though the G5's overall performance is pretty excellent, something you can thank the AMD Ryzen 7 CPU for, its graphics performance delivered by the Radeon GPU is a bit underwhelming. This will not replace your gaming desktop, and if that’s what you’re looking for, you better search elsewhere.",
    "That doesn’t mean that the visuals are altogether lacklustre. Though the graphics card won’t wow anyone, graphics look fluid and sharp due to the 1080p screen’s 120Hz refresh rate.",
    "Another major drawback is that you're also going to find this laptop getting pretty hot under strain, leaving its underside and keyboard noticeably toasty - but that's why desks were invented.",
    "The only other drawback is the laptop's design leaves something to be desired and its plastic chassis feels pretty flimsy even as the laptop itself is rather heavy. So, yeah, you really don't want to drop this one, it might not make it.",
    "On the plus side, the Dell G5 15 SE's battery life is fantastic for a gaming laptop. While other gaming laptops are dying out before they even finish a movie on Netflix, this one will keep on keeping on for several hours of video or everyday, general use. You can even get a few hours of moderate gaming out of it if you keep your settings tuned for battery life or balance rather than going all-in on performance.",
    "While there might be more powerful gaming laptops in the budget bracket, it’s hard to beat the value that the all-AMD G5 brings to the table. It might not be the prettiest or most powerful system out there, but for gamers looking for a laptop that won't gobble up their entire stimulus check, this is an excellent combo of power and affordability that's hard to pass up.",
    "The Dell G5 15 SE is available starting at $879.99 (about £680/AU$1,270). The entry level model comes with an AMD Ryzen 5 4600H, 8GB RAM, and a 256GB NVMe SSD. It comes with a full HD (1080p) display, but has a standard refresh rate, not 144Hz.",
    "The model we tested will set you back $1,199.99 (about £950/AU$1,725) and there's a higher level configuration for $1,299.99 (about £1,030/AU$1,870) that ups the SSD capacity to 1TB.",
    "There is some limited options for upgrading the laptop's SSD, RAM, Wi-Fi adapter, and battery, so its definitely possibly to pick up one of the more affordable configurations and build it up if you have the hardware laying around or if have more wiggle room in your budget for an upgrade down the road.",
    "When it comes to the Dell G5 15 SE's design, the silvery plastic chassis and prismatic Dell logo on the lid makes it look something like the hood of a car. The best thing that can be said of the design is that it's a gaming laptop that isn't trying to look like a modern stealth aircraft.",
    "Dell is known for its conservative design aesthetics on its machines, and if it weren't for the laptop's weight (5.51 pounds, 2.5 kilos), one could be forgiven for thinking it was one of its enterprise models pulled off the small business page of the site. The giveaway is the LED-backlight on the keyboard and the base of the chassis, which doesn't even try to be sleek.",
    "Picking it up, you can definitely tell it's a budget gaming laptop from the quality of the build materials. The Dell G5 15 SE feels heavier than its 5.51 pound listing lets on - largely because you can't help but feel that a 4- to 5-foot drop is going to put a hurt on this machine.",
    "The plastic on the chassis's base feels a lot more solid than the lid, which gives the impression that the lids plastic casing might pop clean off if you dropped it at just the right angle.",
    "The display's bezels aren't letterbox-sized, but they are noticeable, even if they are pretty easy to forget about. The built-in 720p webcam is positioned above the display where you'd expect and the laptops speakers are on the sides of the chassis toward the front.",
    "There's enough slope to the underside position of the speakers that there's a reduced risk of them being muffled entirely if you set the laptop down on a bed and watched a movie, but its still a disappointing design choice that just won't seem to die with manufacturers.",
    "The keyboard comes with the standard laptop chicklet-keys and includes a numpad for those of us who can't get by without one. The key spacing is pretty-tight given the reduced real estate, so it might take some getting used to if you're coming off using a full-sized keyboard, but its definitely more forgiving than other almost-full-sized laptop keyboards.",
    "The keys are responsive and since this is a gaming laptop, the keys have RGB LED-backlighting that you can control from the pre-installed Alienware system configuration utility. The trackpad is decent enough for non-gaming use or navigating through your Steam library before switching over to a game controller.",
    "And while it's a small thing, the slim LED light ring on the laptop's power connector is a nice feature and definitely makes it easy to identify amid the tangled flagella of black power cords and cables cluttering up our desks.",
    "Overall, we were pretty impressed with the Dell G5 15 SE's performance. It lags behind other AMD Ryzen 7 4800H systems - such as the Asus TUF A15 - in our general use benchmarks, but not by much. It beats out the Alienware m15 R2 on some tests, but where the Dell G5 15 SE seems to run into trouble is with its AMD Radeon RX 5600M GPU.",
    "The laptop gets 45fps on average during our Total War: Three Kingdoms battlefield benchmark on ultra settings, which isn't awful, but its not great either. Meanwhile, the GPU pushes out 42fps on average during our Metro: Exodus benchmark on ultra settings.",
    "This puts it in the ballpark of the Gigabyte Aorus 5, though the Aorus still outperforms in two of our three 3DMark tests - and by quite a bit, too - and the best the G5 could do on Time Spy is fight the Aorus to a draw.",
    "Once you get past the G5's GPU scores though, there's a lot to recommend it in terms of performance against its rivals. The Ryzen 7 4800H CPU packs a lot of processing punch with its eight cores and 16 threads and a frequency boostable up to 4.29GHz. For non-graphics-intensive tasks, it really does shine.",
    "This is also the first gaming laptop to feature AMD's SmartShift technology, which helps the laptop manage the power distribution between the CPU and the GPU to get more power to where the need is greater at any given moment.",
    "We didn't see any GPU performance gains thanks to SmartShift, so there might still be a few kinks AMD needs to work out, but we can't know that until we see other laptops with the technology.",
    "One of the other more noticeable performance issues is the laptop's thermal performance. The laptop gets noticeably hot under strain, both on the underside and on hot spots around the keyboard. This isn't a problem unique to Dell - most budget laptops struggle with this issue - but just because all the other laptops are melting in your lap doesn't give the Dell G5 15 SE a pass.",
    "Overall, the Dell G5 15 SE has a lot of power and puts in a competent performance when it comes to gaming on the higher end, even if it's not going to win the race. It might not need to though - performance doesn't exist in a vacuum, after all.",
    "The Asus TUF A15 might have an edge over the G5 15 SE in our GPU benchmarks, but it also costs several hundred dollars more. The Dell G5 15 SE is all about providing a lot of power at an affordable price, and in this the Dell G5 15 SE succeeds, making it a great value that is hard to ignore for any gamer on a budget.",
    "Gaming laptops aren't known for their battery life, so we were pleasantly surprised with the G5 15 SE's battery performance. In our PCMark 10 battery test, it lasted an average 7 hours and 3 minutes on a full charge and in our movie test, it went for 5 hours and 45 minutes, blowing way past the Aorus 5 which didn't even finish a single playthrough.",
    "While this isn't the best we've ever seen, this is still great for a budget gaming laptop - especially when other gaming laptops we've tested have crapped out after two or three hours away from an outlet. You can feel reasonably confident that its battery will make it through a cross-country flight on a full charge or last through several classes without needing to top off every couple of hours.",
    "It's a Dell laptop, so you know the drill, you're going to have some bloatware to contend with on top of the Candy Crushes and Dropbox offers that Windows 10 typically throws at you. You'll probably spend a good half-hour after getting the Dell G5 15 SE out of the box just uninstalling what you don't want or need.",
    "That's not to say its all junk, though. The pre-installed Alienware Command Center software gives you the ability to customize the keyboard lighting, fine tune the system's performance for specific games, and look over various system statistics, which is genuinely useful.",
    "Though we haven't been able to test the laptop with Windows 11, any Dell G5 15 SE you purchase from the Dell online store should come with the new operating system."
  ],
  "headers": {
    "3": "Two-minute review",
    "10": "Price and availability",
    "13": "Design",
    "22": "Performance",
    "31": "Battery Life",
    "33": "Software",
    "36": "Don't buy it if..."
  },
  "links": {
    "TechRadar Choice Awards 2021": "https://www.techradar.com/news/dell-g15-ryzen-edition-voted-best-budget-laptop-at-techradar-choice-awards-2021",
    "Asus TUF A15": "https://www.techradar.com/reviews/asus-tuf-a15",
    "Alienware m15 R2": "https://www.techradar.com/reviews/alienware-m15-r2",
    "Gigabyte Aorus 5": "https://www.techradar.com/reviews/gigabyte-aorus-5-review"
  }
}