{
  "source": "https://www.techradar.com/reviews/d-link-ax1800-wi-fi-6-usb-adaptor-dwa-x1850",
  "title": "D-Link AX1800 Wi-Fi 6 USB Adaptor (DWA-X1850) review",
  "category": "computing",
  "updated": "2021-12-02T15:30:59Z",
  "author": "cliff-joseph",
  "summary": "Fast and affordable Wi-Fi upgrade for Windows 10 PCs",
  "verdict": "It’s a shame that it only works with Windows 10, but D-Link’s Wi-Fi 6 adaptor is a good upgrade for owners of Wi-Fi 6 routers.",
  "pros": [
    "Convenient, affordable Wi-Fi 6 upgrade",
    "Plug-and-play installation",
    "WPA 3 security"
  ],
  "cons": [
    "No support for Windows 7 or 8",
    "Poor documentation",
    "Dual-band only"
  ],
  "article": [
    "If you want to improve the performance of your home Wi-Fi network then it makes sense to upgrade to a new router that uses the latest Wi-Fi 6 technology (aka 802.11ax).",
    "But, of course, many of us are still using PCs that are only equipped with Wi-Fi 5 (formerly known as 802.11ac), and while your new Wi-Fi 6 router is still backward-compatible with PCs and other devices that use Wi-Fi 5, you won’t get the full benefits of your new high-speed router for those older devices.",
    "That’s where D-Link steps in with its new AX1800 Wi-Fi 6 USB Adaptor (DWA-X1850), which can upgrade your Windows 10 PC to Wi-Fi 6 for £52/$69.99/AU$149.95.",
    "Looking very much like a rather fat memory stick, the Wi-Fi 6 adaptor simply plugs into a USB port on your PC and provides a quick plug-and-play upgrade to high-performance Wi-Fi 6 technology. It does actually have a small amount of memory built into it, which stores the adaptor’s driver software, so you can just double-click on the adaptor in the Windows File Explorer to view and install the drivers.",
    "The adaptor uses a USB-A connector, but our office laptop has both USB-A and USB-C ports, and we found that it also worked with the USB-C port when used with a suitable USB-A-to-USB-C adaptor - although that’s obviously not an ideal set-up if you’re travelling with a laptop.",
    "We were also disappointed to find that D-Link’s website states that Windows 10 is a minimum requirement for using the Wi-Fi 6 adaptor. There are millions of older PCs still running Windows 7 and 8 that could benefit from a Wi-Fi upgrade such as this, so limiting the adaptor to only work with Windows 10 seems a little short-sighted (and there’s no Mac support either).",
    "Undaunted, your intrepid reporter had a shot at using the Wi-Fi 6 adaptor with an old desktop PC running Windows 8, that struggles with slow wi-fi when watching Netflix. We were able to install the drivers for the adaptor, however, the Network Settings panel in Windows 8 told us that the drivers were ‘not available’ when we attempted to switch from the PC’s built-in wi-fi to the new D-Link adaptor.",
    "It is, of course, possible to upgrade an old PC such as this to Windows 10, but Windows 10 costs almost twice as much as the D-Link adaptor itself, so that’s not a particularly tempting option.",
    "Buying lots of Wi-Fi 6 adaptors for multiple PCs could be pretty expensive, but if you have one laptop or PC that you use for gaming or working from home, and which needs the best possible wi-fi performance, then the D-Link AX1800 Wi-Fi 6 USB Adaptor is a fast and affordable upgrade (as long as you’re running Windows 10).",
    "It only takes a few seconds to double-click the Setup.exe file stored on the adaptor itself in order to install the driver software. However, D-Link’s one-page QuickStart guide doesn’t bother to tell you that you need to locate and select the new Wi-Fi 6 adaptor in your PC’s Network Settings in order to switch from your PC’s built-in Wi-Fi to the new Wi-Fi 6 adaptor.",
    "It took us about 20 minutes of clicking through various menus and settings to figure out how to do this, so D-Link needs to provide better instructions for people who don’t have much experience of networking.",
    "As the name suggests, the AX1800 Wi-Fi 6 USB Adaptor supports Wi-Fi 6 with a top speed of 1800Mbps. That’s not going to break any speed records, and the low-cost adaptor only uses dual-band wi-fi on the 2.4GHz and 5.0GHz bands. However, Wi-Fi 6 isn’t just about speed, as it also provides greater reliability than Wi-Fi 5, so it’s still a worthwhile upgrade if you already own a Wi-Fi 6 router. The adaptor also supports the latest WPA3 security features too.",
    "And, after that hiccup during the initial set-up process, the Wi-Fi 6 adaptor worked very well indeed. The performance tests that we normally use with new routers tend to focus on the router’s download speed, but for the Wi-Fi 6 adaptor we needed to concentrate specifically on the speed of the connection between our router and our laptop PC.",
    "Starting with our normal Wi-Fi set-up - using our normal Wi-Fi 5 router and the built-in wi-fi on our office laptop - we recorded connection speeds in the same room as the router, and also in a back office where the Wi-Fi is always rather unreliable. With the laptop in the same room as the Wi-Fi 5 router its built-in Wi-Fi connected at 130Mbps when using the 2.4GHz band, and 780Mbps with the faster 5.0GHz band.",
    "However, those speeds dropped significantly - and rather erratically - when we moved into the back office, eventually providing average speeds of 78Mbps on 2.4GHz, and 585Mbps on 5.0GHz.",
    "The next step was to activate the D-Link Wi-Fi 6 adaptor, and use it to connect the laptop to a new Wi-Fi 6 Atlas Pro router from Linksys. The connection speed on the 2.4GHz band more than doubled, to 286.5Mbps, while the 5.0GHz connection leapt to the maximum 1200Mbps (1.2Gbps) supported by the D-Link adaptor on that frequency band.",
    "And, most importantly, the D-Link adaptor maintained those speeds both in the same room as the Linksys router, and also in our more distant back office - providing a much more reliable Wi-Fi connection than we can normally get from the laptop’s built-in Wi-Fi."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Design and features",
    "8": "Performance and getting started",
    "17": "Don't buy it if..."
  },
  "links": {
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}