{
  "source": "https://www.techradar.com/reviews/xmg-ultra-17",
  "title": "XMG Ultra 17 mobile workstation review",
  "category": "computing",
  "updated": "2021-05-25T13:25:03Z",
  "author": "desire-athow",
  "summary": "XMG’s latest opus is a fantastic laptop but only for a niche audience",
  "verdict": "The XMG Ultra 17 follows in the footsteps of previous desktop replacement laptops. They’re bulky, noisy, expensive and you’d be lucky to get one hour of battery life. Yet, the Ultra 17 gets full marks for what it represents, the summum of what is currently available in terms of hardware, whether you’re a gamer or not.",
  "pros": [
    "Ridiculously fast",
    "Desktop-grade expansion capabilities",
    "2.5Gb Ethernet",
    "Decent price"
  ],
  "cons": [
    "Noisy, very, very noisy",
    "Bulky, very, very bulky",
    "Requires two PSUs"
  ],
  "article": [
    "It’s been only a couple of months since we reviewed the XMG Pro 17 which featured the ridiculously powerful Nvidia GeForce GTX3080 GPU. Fast forward to May 2021 and XMG upped the ante by delivering something which is even faster. The XMG Ultra 17 aims for market domination by combining three of the fastest mainstream components money can buy into one big chassis. But have we reached the limits of what’s physically possible in this form factor?",
    "Our fully configured workstation retailed for 5,977 Euros (about $7,278, £5,141, AU$9,414) at the time of writing with a delivery time of up to 35 days. All this may change depending - of course - on global component shortage and the worldwide shipment kerfuffle that has messed with everyone’s plans. Shipping is free in the EU and for those looking for alternatives in the US, Sager, XoticPC, Eurocom, Prostar, HID Evolution and OriginPC are the better known providers of the Clevo X170KM-G as it is also known.",
    "As has been the case in the past, this is a gaming laptop that has been tweaked to service the needs of a professional audience; only just.",
    "It is huge, with a footprint that’s bigger than an A3 sheet while its thickness (more than 50mm at its thickest, 38mm at its thinnest) is far more than anything we’ve encountered to date. Even more incredible is the weight of the Ultra 17 itself: the laptop comes in at just under 4.7Kg but you will have to add another 2.3Kg to take into account the two power supply units and the cables/rack. That’s all together a whopping near-back breaking 7Kg.",
    "Like the XMG 17, the XMG Ultra 17 is a Clevo part and therefore shares the same design language. The chassis is made of plastic (likely to be ABS) and metal to deliver a balanced product that ticks the box for portability and sturdiness.",
    "The keyboard comes with per-key RGB backlight, N-key rollover and anti-ghosting and - given the size of the beast - it is not surprising that there’s a dedicated numeric keypad. As for the touchpad, it has two soft-touch buttons, with an integrated numeric keypad and a large usable surface area.",
    "Spread around the laptop are two Thunderbolt 4 ports, one USB Type-C port, three USB Type-A ports, a pair of MiniDP connectors, a full size HDMI 2.1 one (capable of hitting 8K), two audio jacks, a card reader, a LAN Ethernet port and two - yes two - power supply ports.",
    "As you might guess there’s a lot of air vents - big and small - to keep the desktop-grade components adequately cool. There’s also a lot of LED lights around, perhaps in places you wouldn’t expect them. They’re all centrally controlled by XMG’s control software and can be disabled if they prove to be too distracting.",
    "XMG picked the best parts available to fill in the Clevo chassis. Our review sample was configured to impress: it came with four 2TB PCIe SSDs (one Samsung 980 Pro and three Corsair MP400, all as separate units), four 32GB Samsung DDR4-2933 memory modules (no 3200 as you can only run a pair of RAM at this speed), Intel’s crown jewel, the Rocket-Lake based Core i9-11900K, and the Nvidia Geforce RTX3080 with a staggering 16GB GDDR6 memory.",
    "The latter is a 165W part designed in the special discrete upgradeable MXM format and is the fastest GPU available in a laptop. It powers a 4K 17.3-inch non-glare display with a rated 400 nits brightness.",
    "The Intel CPU is a 125W model with eight cores, 16 threads and 16MB cache; it is still a 14nm part and is socketed rather than soldered which means that - like the graphics card, you should be able to upgrade it if you need to.",
    "In contrast, the rest of the config is relatively modest. There’s two 280W brick power supply units that power a 97WHr removable battery, an Intel AX200 Wi-Fi 6 module, a powerful 2.1 speaker set (yes, it even has a subwoofer), a 2.5GbE LAN port courtesy of Killer (which is also owned by Intel) and a Creative Super X-Fi UltraDSP audio chip.",
    "This thing is loud, very loud, especially under load. We clocked just over 70dB when putting our improvised sound meter next to the air vent at the rear of the Ultra 17 and about 58dB when recorded from the keyboard. Given that the CPU and the GPU together top out at almost 300W, it is understandable but not everyone will support this sort of ear splitting sound for long periods of time, unless you wear headphones.",
    "As for test results, no surprise here. This thing is a powerhouse, a mighty workhorse that is one of the most powerful laptops we’ve ever tested. The Compute crown still rests firmly on the shoulders of the XMG Apex 15 with its AMD Ryzen 9 3950X but the storage and video benchmarks point to only one winner.",
    "The Ultra 17 delivered outrageous numbers, the best we’ve seen to date, across a number of tests, thanks to best-in-class components fine tuned to deliver maximum performance in a brute force way; no ifs or buts, just pure, raw, unadulterated firepower. Great for a wide variety of use cases, work or otherwise. This is the type of workstation that will get the job done fast, very fast.",
    "XMG bundled Windows 10 Pro - a clear nudge to the target audience - with the laptop but you can swap that either for Windows 10 Home or just remove it altogether to save on the price. We’re puzzled as to why the three Corsair SSD were not configured as a single RAID-0 storage unit, which would make more sense.",
    "We have positive words for the keyboard, the touchpad and the monitor. They were what we’d expect from such a laptop; great feedback and feel for the first one- helped by the massive palmrest, precise and smooth for the second one and decent visual performance for the display with a 16:9 aspect ratio and a matte finish.",
    "Note that while the keyboard itself had nothing much against it, the fact that it sits atop a slab that’s more than 30mm above a desk means that it might not suit everyone. The battery life on that one was shockingly low; it lasted a mere 97 minutes in our test or about 1WHr per minute.",
    "The standard warranty on this laptop is a pickup and repair with no option for next day onsite or accidental coverage. That sort of extensive backup is only available from one of the big vendors. The best you can expect is a three-year warranty with a quick repair option.",
    "You want the absolute best for gaming or work. This laptop has no competitors that we know of. All the big vendors - Lenovo, Dell, HP - dread to pack desktop components into a laptop chassis but Clevo and its partners have managed to do so with aplomb. What makes it even more special is the fact that it challenges the hegemony of desktop PCs and fixed workstation as well.",
    "You want to upgrade. Clevo chassis are, by their very nature, upgradable. With ample wriggling space, a socketed CPU, MXM graphics unit and removable memory, the Ultra 17 is designed to stay functional for a foreseeable future by delaying obsolescence. That, of course, depends wholly on Intel and Nvidia.",
    "You want a portable laptop. At more than 7Kg with the two power supply units, this is hardly a laptop that you can move around. It reminds us of the luggables of yesteryear and the desktop replacement models that were popular at the start of this century (hello ECS desknote).",
    "You can wait a bit longer. It would be logical for Clevo to release a laptop that combines the power of the 16-core 5950X with the best of Nvidia’s mobile portfolio. With a lower TDP and a much higher performance, the successor to the Apex 15 could well be a match made in heaven."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "8": "Hardware",
    "12": "In use and performance",
    "19": "Buy it if",
    "21": "Don't buy it if"
  },
  "links": {
    "XMG Pro 17": "https://www.techradar.com/reviews/xmg-pro-17-2021-mobile-workstation",
    "fully configured workstation": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1408740873655496700&xs=1&url=https%3A%2F%2Fbestware.com%2Fen%2Fxmg-ultra-17-e21.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fxmg-ultra-17",
    "Sager": "https://www.sagernotebook.com/Notebook-NP9672M-G1.html",
    "XoticPC": "https://xoticpc.com/products/xotic-g170km-g-x170km-g#product_info_customize_block",
    "Eurocom": "https://eurocom.com/ec/configure(2,477,0)EUROCOM_SkyZ7R2",
    "Prostar": "https://www.pro-star.com/x170km-g.html",
    "HID Evolution": "https://www.hidevolution.com/evoc-high-performance-systems-x1702f-x170km-g-17-3-uhd-i5-10600k-i7-10700k-i9-10900k-rtx-3080.html",
    "OriginPC": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7522412893974150000/https://www.originpc.com/configurator/new-eon17-x/",
    "Core i9-11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "XMG Apex 15": "https://www.techradar.com/reviews/schenker-xmg-apex-15-mobile-workstation",
    "AMD Ryzen 9 3950X": "https://www.techradar.com/reviews/amd-ryzen-9-3950x",
    "workstation": "https://www.techradar.com/best/best-workstations"
  }
}