{
  "source": "https://www.techradar.com/reviews/teclast-x6-plus",
  "title": "Teclast X6 Plus convertible tablet review",
  "category": "computing",
  "updated": "2021-06-08T09:07:17Z",
  "author": "desire-athow",
  "summary": "A little known challenger to the Surface Pro 7 appears but fails to deliver a killer punch",
  "verdict": "The Teclast X6 Plus is only really worth the premium on lower-priced, equally capable tablets if you want a super-high resolution Windows device. Teclast needs to shave a few more dollars on its price tag to make it the undisputable king of bargain-priced high-res tablets.",
  "pros": [
    "Super display",
    "Good performance",
    "Pleasant design",
    "Good array of ports"
  ],
  "cons": [
    "Problematic Wi-Fi",
    "A bit expensive",
    "Average battery life"
  ],
  "article": [
    "Teclast is one of the few Chinese challenger brands that’s still going strong. Together with its archrival Chuwi, it has rolled out dozens of laptops and tablets over the past few years. One of its latest models is the Teclast X6 Plus, a convertible laptop with a detachable keyboard cover that aspires to go head to head against the Surface Pro 7 but without the price tag. There’s no photo finish between the two for sure but is the Teclast X6 Plus still a bargain?",
    "You can buy the Teclast X6 Plus without the keyboard or active stylus, from popular online Chinese retailer Aliexpress for only $430. Add an extra $50 for the first accessory and $30 for the second one. The usual terms and conditions regarding shipping and local taxes apply.",
    "The power button is located on the top left of the tablet next to a volume rocker. A microSD card slot can be found near the opposite corner. The headphone jack plus a USB 3.0 port as well as another USB 3.0 port, a barrel-type proprietary power port, a microHDMI and a USB Type-C connector are spread over the two shorter edges.",
    "There’s also a magnetic keyboard dock connector, a kickback stand that extends to 135 degrees and two Omnivision cameras (front 2-megapixel and rear 5-megapixel). Everything is squeezed in a super slim 8.5mm chassis that has a footprint barely bigger than an A4 sheet (299 x 230mm) and weighing only 860g.",
    "The X6 Plus came with an Intel Celeron N4100, a bog-standard entry-level quad core processor that performs on par with a seventh generation Core i3 CPU. It is paired with Intel’s UHD600 graphics, 8GB of RAM, a 256GB SATA SSD (the Teclast BD256 SCHA-2280) and surprise, surprise, a Qualcomm QCA9377 Wi-Fi chip which is a departure from the quasi-monopoly Intel has on the market with the AC and AX series.",
    "Also on the list is a 38WHr battery and an optional detachable keyboard cover plus a 24W (12V,2A) brick power supply unit.",
    "At 2880 x 1920 (that’s 5.53 million pixels, 2.67x more than full HD), the 12.6-inch display has a pixel density of 274ppi, which is the highest amongst non-4K displays which tend to reach densities higher than 330ppi. That translates into crisp, razor sharp pictures with an equally impressive colour reproduction even in bright ambient light. For what it’s worth, Teclast claims a color gamut coverage of 121% sRGB and supports Microsoft’s Pen Protocol.",
    "We hit a snag as a number of our benchmarks didn’t run because of issues with Wi-Fi. It is the first time after reviewing hundreds of devices that we encountered this issue and the culprit seems to be the Qualcomm Wi-Fi chip which didn’t like and didn’t want to connect to our 802.11n Wi-Fi router. When it did connect, it was slow and unstable, hardly a convincing act. We’ve reached out to Teclast and they’re looking into it.",
    "Otherwise, the Teclast X6 Plus performed as expected, that is, without any particularly impressive numbers. What surprised us though was the fact that the puny N4100 was consistently ahead of the J4125 and the J4115 which are newer components and theoretically faster.",
    "The RAM and the SATA SSD are more than adequate at the entry level - 8GB/256GB is considered bare minimum these days. The bundled keyboard cover is fairly decent with the right amount of travel thanks to its thicker than average construct. The small touchpad is solid and fairly precise, very responsive to single and double finger swipes.",
    "The target audience for the Teclast X6 Plus is one that looks for a Windows tablet with a very high quality display capable of resolutions beyond 1080p while, at the same time, featuring 8GB of RAM and 256GB storage with a sub-$500 price tag.",
    "The cheapest Microsoft Surface Pro 7 tablet retails for only $615 from Amazon. It is powered by a 10th generation Intel Core i3-1005G1 which is about twice as powerful as the N4100 inside the X6 Plus, better Wi-Fi, enterprise-grade security and much higher battery life. On the other hand, it comes with only 4GB of RAM and half the onboard memory plus a near 50% price premium.",
    "Chuwi’s Ubook X is another potent alternative given that it costs only $390 and carries a very similar specification albeit with a lower screen resolution (2150 x 1440 or QHD). Is it worth it? Probably not. The most compelling alternative however is the Alldocube KNote X Pro which costs far less ($370 with a backlit keyboard) with a more powerful processor. The savings come from lower storage (128GB) and a slightly lower resolution.",
    "Once it solves the Wi-Fi issue, Teclast still has work to do with the X6 Plus in order to elevate it from a nice tablet to a formidable candidate amongst business Windows tablets. There are affordable rivals good enough that may sway punters looking for a higher-than-1080p resolution but don’t want to fork out a significant premium.",
    "In the end, it will hinge on whether the end user considers having almost three times more pixels than on a full HD display being useful or not, especially on a device with entry level components. The next iteration should definitely up the ante without upping the price to reach Surface Pro levels of performance. Swap the processor, add faster PCIe storage, better power management and a side fingerprint reader and Teclast will have a winner on its book."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "4": "Hardware",
    "6": "In use",
    "10": "Competitors",
    "13": "Final verdict"
  },
  "links": {
    "convertible laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "Aliexpress for only $430": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-9461959084296421000&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F1005002717294093.html",
    "Microsoft Surface Pro 7": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07ZF69HXV%2Fref%3Dtwister_B07YQJ9WYB%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2986276188503589000-20",
    "Ubook X": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-1444961377079418000&ulp=https%3A%2F%2Fwww.banggood.com%2FCHUWI-UBook-X-Intel-Gemini-Lake-N4100-Dual-Core-8GB-RAM-256GB-SSD-12-Inch-Windows-10-Tablet-p-1731859.html%3Fcur_warehouse%3DHK%26rmmds%3Dsearch",
    "Alldocube KNote X Pro": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-9935860003759133000&ulp=https%3A%2F%2Fwww.banggood.com%2FAlldocube-KNote-X-Pro-Intel-Gemini-Lake-N4120-Quad-Core-8GB-RAM-128GB-SSD-13_3-Inch-Windows-10-Tablet-With-Keyboard-p-1836360.html%3Fcur_warehouse%3DHK%26rmmds%3Dsearch"
  }
}