{
  "source": "https://www.techradar.com/reviews/focal-celestee",
  "title": "Focal Celestee review",
  "category": "audio-visual",
  "updated": "2021-07-12T20:05:33.181Z",
  "author": "lewis-leong",
  "summary": "One of the best-sounding closed-back headphones",
  "verdict": "The Focal Celestee is one of the best-sounding closed-back headphones you can buy. The headphones have gobs of resolution, impact, and precise imaging. More impressively, the Celestee doesn't punish listeners who have poor quality recordings. However, if you’re looking for soundstage width, you’ll have to find it elsewhere as the Celestee doesn’t project sound very far.",
  "pros": [
    "Amazing detail and imaging",
    "Class-leading build quality",
    "Easy to drive"
  ],
  "cons": [
    "Mediocre soundstage",
    "Heavy",
    "No balanced cable included"
  ],
  "article": [
    "Focal, the renowned speaker manufacturer, jumped into the headphone space several years ago and made an immediate impact on the space. Its line up of open- and closed-back headphones became some of the most recommended headphones for audio enthusiasts.",
    "Most recently, Focal revisited its closed-back offering and discontinued the Elegia in favor of the new Celestee, which we’ll be reviewing here today.",
    "Along with a fresh colorway, Focal has revisited the driver and tuning of its closed-back offering with the Celestee and spoiler alert: it’s excellent.",
    "The Focal Celestee is available worldwide for $999 / £999 / €999 / AU$1,399.",
    "In terms of competition, the Beyerdynamic DT1990 stands out as an excellent value for the resolution and build quality you get for its $599 (£589, AU$1,159) asking price. However, the DT1990 can be fatiguing to those who are treble sensitive. They’re also semi-open back, so they’re not made for an office environment.",
    "The Sennheiser HD820 are one of the best closed back headphones you can buy today but are twice as expensive as the Celestee, but definitely not twice as capable. In terms of value, the Celestee offers a lot compared to the Sennheiser.",
    "That leaves Audeze with its LCD-2 Closed Back, which has incredible bass response but the Celestee is a better balanced headphone with better mids and highs.",
    "The Focal Celestee doesn’t stray from the tried-and-true design of the entire Focal headphone lineup. On the outside, the Celestee sports a new colorway with navy blue and gold accents. It’s definitely more of a polarizing colorway choice compared to the silver and black of the previous Elegia headphone.",
    "The earcups feature a new “honeycomb” design that mimics the design of the open back Focal Clear Mg, but the holes are filled instead of covered by mess to maintain that closed back design.",
    "The build quality of the Celestee is excellent, and some of the best at any price. The headphone is covered in semi-aniline leather that feels premium, but that premium feel does come at the expense of being lighweight: the Celestee weighs in at a hefty 430g, which is significantly heavier than some of its less expensive rivals, but the headband helps distribute its weight across the head and the clamping force is just right.",
    "Included in the package is a well-built hard carrying case as well as a 4-foot long cable, which terminates with a 3.5mm jack with a 6.35mm adapter. It’s a bit disappointing that Focal omitted the balanced XLR cable from its other headphones, but understandable since Focal is positioning the Celestee as a headphone that you can take on the go.",
    "The Focal Celestee features a 40mm 'M'-shaped aluminium magnesium dome driver, which is lightweight while being incredibly strong. This driver gives great sound quality, which we’ll go into in the next section below.",
    "Helping with bass control and impact is the ported Focal logo, which allows air to move behind the driver. This doesn’t allow ambient sound in, which is important for a pair of closed back headphones. In terms of noise isolation, the Celestee is very good, blocking a majority of outside sound and keeping music in. You’ll have no worries using these in a open office environment.",
    "The Focal Celestee has an impedance of 35 ohms and 105dB SPL / 1 mW @ 1 kHz, which means these headphones are extremely easy to drive. They sound good straight out of a smartphone but adding an external DAC and amp elevates the sound quality noticeably. With such high sensitivity, a budget DAC/amp will yield great results and the headphones aren’t picky with amping unlike other audiophile headphones.",
    "The Focal Celestee are one of the best-sounding closed-back headphones you can buy. These headphones offer gobs of detail and incredible imaging, allowing you to precisely pinpoint where each instrument is coming from. Imaging is so good, you can sense instruments behind you.",
    "In terms of soundstage, the Celestee is average with a relatively narrow presentation when compared to open back headphones. The Celestee presents music in a very forward manner, like you’re in the front row of a concert, which some may enjoy. Those looking for an expansive soundstage and laid back sound should look elsewhere.",
    "In terms of tonal balance, the Focal Celestee is warm with a noticeable bump in the bass and sub-bass regions. This helps make music sound impactful and fun but it’s slightly too much for our taste. The more neutral tonal balance of the Focal Clear Mg is absolutely perfect but the stronger bass presence and impact of the Celestee is undeniably fun. Bass has great texture, resolution, and impact. We were impressed how well the Celestee was able to reproduce realistic-sounding kick drums.",
    "Mids are well represented and never drowned out by the tipped up bass. Vocalists sound natural and detailed. We were impressed with how well the Celestee was able to layer instruments, where lesser headphones would struggle, creating a smeary mess. A great example is the soundtrack for The Dark Knight Rises – there are a ton of layers of fast-moving instruments which can sound “fuzzy” if a headphone can’t decay a note quickly enough. The Celestee’s aluminum and magnesium driver does wonders here to keep every layer separate and controlled.",
    "Highs are excellent, providing sparkle without any fatigue. While the bass of the Celestee definitely stands out, it doesn’t stop the mids and highs from sounding excellent as well.",
    "The Focal Celestee is one of the best sounding closed back headphones we’ve heard and while it’s expensive at $999 (€999, AU$1,399), it’s completely justifiable for those looking for one headphone to do it all.",
    "The Celestee is a great choice for those who look for a warmer and more forward presentation. While we wish the soundstage was wider, it’s understandable for a closed back headphone to be more limited in this regard."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and availability",
    "7": "Design",
    "11": "Features",
    "14": "Audio quality",
    "19": "Final verdict"
  },
  "links": {
    "Elegia": "https://www.techradar.com/reviews/focal-elegia",
    "Beyerdynamic DT1990": "https://www.techradar.com/reviews/beyerdynamic-dt-1990-pro",
    "Sennheiser HD820": "https://www.whathifi.com/reviews/sennheiser-hd-820",
    "LCD-2 Closed Back": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5923382031824660000&xs=1&url=https%3A%2F%2Fwww.audeze.com%2Fproducts%2Flcd-2-closed-back&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffocal-celestee",
    "Focal Clear Mg": "https://www.focal.com/us/headphones/for-home/clear-mg",
    "external DAC and amp": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629"
  }
}