{
  "source": "https://www.techradar.com/reviews/realme-pad-review",
  "title": "Hands on: Realme Pad review",
  "category": "tablets",
  "updated": "2021-11-16T13:00:12Z",
  "author": "tom-bedford",
  "summary": "A budget tablet done well",
  "verdict": "The Realme Pad is a welcome addition to the budget tablet market, as it’s an ideal choice for online classes and basic entertainment purposes. It comes with a powerful quad-speaker setup, a sleek design, and offers good battery life. However, it misses out on a powerful processor and fast charging. Even with these letdowns, the Realme Pad is a worthy budget tablet.",
  "pros": [
    "Sleek design",
    "Clean software",
    "Good-looking screen"
  ],
  "cons": [
    "Display attracts smudges",
    "No accessories as of launch",
    "Slow to charge"
  ],
  "article": [
    "The Realme Pad is the popular up-and-coming Chinese tech company’s first attempt to dip its toes into the world of Android tablets, following Nokia and Xiaomi which both recently joined, or returned to, the lockdown-rejuvenated tech category.",
    "The Realme Pad isn’t a rival to Apple's iPad lineup, as it’s a budget slate with a low cost and middling specs, but it is a very well-built budget Android tablet in its own right - and its very existence could mean interesting things for the low-end slate market, which traditionally hasn’t been as competitive as the affordable phone segment.",
    "It seems that the Realme Pad is aimed at students attending online classes or those who prefer watching movies and shows on a screen bigger than a mobile’s, as its display is arguably its best spec - the screen is 10.4 inches across and has a 2K resolution, which means there’s lots of detail in images.",
    "It’s not the perfect display, as it doesn’t support HDR and it picks up smudges very easily, but the resolution and size might make those smaller issues easy to overlook.",
    "The tablet’s four Dolby Atmos-powered speakers emphasize the Realme Pad’s power as a low-cost entertainment device, as they’re loud and sound reasonable, which means watching movies is a treat.",
    "In terms of design, this is a sleek and stylish slate, making it easy to carry around - it seems like Realme took notes from Apple’s recent redesign of its iPad mini. It’s fairly thin, so it can easily slip into your backpack, though we’d recommend picking up a case to protect its frail form.",
    "Oh, uh… a case? That might be a problem. Realme doesn’t sell any accessories right now, and as it’s the company’s first tablet, there aren’t exactly many third-party ones either. It might be worth buying a protective wallet for the thing for when you’re transporting it.",
    "The tablet has a big battery that will last at least one day with heavy usage and could extend up to two days depending on how you treat it. It’s enough for a full day of classes or work, which is handy as the slate has rather slow charging.",
    "Perhaps one of the weakest aspects of the tablet is its performance, as the Realme Pad is slower than a same-price smartphone would be, and we found noticeable stutters even when scrolling through menus, let alone when playing games or using apps.",
    "Sure, there aren’t really any super-fast budget Android tablets, so if you need lots of processing power, we’d recommend shelling out a little bit more for the Huawei MatePad 11 or Xiaomi Pad 5. But that’s why we recommend this as a useful education or work screen - word processing isn’t exactly an intensive process.",
    "So the Realme Pad is a solid, though not perfect, low-cost slate. It’s just a shame the device isn’t more competitive, like the brand’s budget and mid-range smartphones can be, and we’re curious to see how much consumers appreciate Realme’s first jaunt into the tablet sphere.",
    "We've only got the Euro pricing of the Realme Pad right now - that's why this is only tagged as a hands-on review, not a full one.",
    "In Europe, the tablet starts at €239 (roughly £200, $270, AU$370), which gets you 3GB RAM and 32GB storage - that's not much power or space so we'd recommend sticking to the higher-spec versions.",
    "There's a 4GB / 64GB tablet for €259 (about £220, $290, AU$400) and a 6GB / 128GB model for €289 (around £240, $330, AU$450), and if you're going to be using the tablet for work or studying we'd recommend that latter version.",
    "We don't yet know when the tablet will release in the UK or Australia, but a US launch is unlikely given Realme doesn't sell its tech there.",
    "While the Realme Pad isn’t a premium tablet, its design could fool you, because it feels pretty high-end when you hold it in your hand, thanks to its build quality and sleek frame. It’s only 6.9mm thick and weighs 440g, so it’s dainty compared to many other slates.",
    "If you like what Apple has done with its recent iPhones, making them thinner with flat edges and small bezels, you’ll like the look of the Realme Pad.",
    "The tablet has an aluminum body and frame, so it’s pretty sturdy and could probably withstand a drop or two (not that we recommend trying). There’s no IP rating against water or dust though, so keep it safe.",
    "If you hold the tablet in landscape mode, you get the power button at the top of the left edge, the volume rockers at the left side of the top edge, and the hybrid SIM slot is present on the top right. To the right-hand side, you get a USB-C port for charging, and just below that there’s a 3.5mm headphone jack hidden in the corner of the frame.",
    "The front-facing camera is placed on the top bezel of the tablet when you hold the tab in landscape orientation, making it convenient for online classes and meetings. On the back, there’s a silver line passing through the rear camera, and then towards the bottom there’s a Realme logo.",
    "One potential issue could be the single rear camera, which sticks out a fair way from the back of the tablet. It feels at risk if you drop the slate, so… don’t. Or clad the thing in a case.",
    "The Realme Pad is available in grey and gold color options - you’re seeing the Grey variant in this review.",
    "From our time with the tablet, we found it comfortable to hold, even for extended periods of time, thanks to its light build and premium design - it’s also easy to carry around in a bag without taking up too much space.",
    "For now, there are no first-party accessories like a case or a keyboard cover - you will have to find good third-party accessories after you purchase the device, which may be limited at the beginning of the product’s life span.",
    "Just because a tablet is cheap, doesn’t mean its screen looks bad, and the Realme Pad is evidence of this theory… most of the time. The slate has a 10.4-inch LCD display, with a resolution of 1200 x 2000, a peak brightness of 360 nits, and a 60Hz refresh rate.",
    "We were happy with what the tablet had to offer when we were binge-watching shows or attending meetings on it, at least when indoors, though outdoors that relatively low max brightness meant we sometimes had trouble seeing the display. The screen is fairly vibrant, though not to the level that an AMOLED panel would offer.",
    "One other brightness issue we had was that auto-brightness could be slow to respond, and we found ourselves reverting to changing it manually.",
    "There are several modes like reading mode, night mode, dark mode, and sunlight mode. The reading mode is useful if you like to read ebooks on the tablet, as it warms the color hue, while the night mode will lower screen brightness to a minimum of 2 nits - a handy feature if you are a night owl and don’t want to shock your retinas.",
    "Be careful how you swipe on the display though - we found it picked up our fingerprints and left noticeable smudges, which we often needed to wipe away.",
    "Ultimately, if your usage is mainly for classes and entertainment purposes in indoor conditions, the Realme Pad won’t disappoint. While in outdoor conditions, it gets tricky as the screen is very reflective and attracts smudges easily.",
    "Most budget tablets suffer when it comes to performance and tend to feel slow and stuttery - the Realme Pad doesn’t feel as viscous for navigating as some other same-price rivals we’ve seen, but it’s not exactly a powerhouse either.",
    "The MediaTek Helio G80 sits at the heart of the slate, and we haven’t seen this in a tablet before, but it’s been used in phones like the Samsung Galaxy A22 and Xiaomi Redmi 9. It’s a fairly low-end processor, though MediaTek’s chipsets are usually at least passable.",
    "When we put the Pad through the Geekbench benchmarking test, it returned a multi-core score of 1286 - that’s not exactly a high score, sitting below the Samsung Galaxy Tab S6 Lite which got 1313, and in line with the low-cost Moto G30 smartphone which hit 1267.",
    "The performance isn’t awful on the tablet, but it’s not very snappy either. Smaller apps opened quickly, but multitasking quickly got hectic when there were too many apps running in the background. While moving between apps we could notice the slowness of the chipset coming into play, and high-end games brought a cacophony of stutters and lag.",
    "The Realme Pad is available in three variants: 3GB of RAM and 32GB of storage, 4GB of RAM and 64GB of storage, or 6GB of RAM and 128GB of storage. People who just want a streamed entertainment device likely only need the lower model, but if you want more RAM for particular apps, it might be worth bumping up a size.",
    "There is also support for microSD cards of up to 1TB on all three variants. You might run out of space on the 32GB variant pretty quickly if you plan on storing a lot of video files, or even lots of work documents or apps.",
    "The Realme Pad offers a Dolby Atmos-powered quad-speaker setup, with two speakers on each side. The volume went surprisingly loud and the quality wasn’t terrible, though sometimes in voice calls the tone was quite robotic. It’s fit for purpose for streaming, though a decent pair of headphones would be better, especially thanks to the tablet’s 3.5mm jack for wired cans.",
    "In terms of cameras, you get an 8MP front-facing camera which is useful for video calls and meetings, and it did a fine job. While it doesn’t offer sharp videos, it did a good job in terms of field of view, as the lens covers 105 degrees.",
    "The rear 8MP camera is good enough for scanning documents or taking some photos when needed, but it’s not exactly a tool for artistic photography. There’s no flash either, which means it’s hard to take images in dark conditions.",
    "The Realme Pad runs on Realme UI for Pad, which is a clean stock Android experience based on Android 11. There are no obstructive Realme UI additions, which is surprising when you consider that its smartphone Android fork, Realme UI, has a fair amount of bloatware. The tablet comes with quite a few pre-installed apps, but they’re all Google ones that you’d find on any Android device.",
    "Android 11 allows you to multitask between apps using a split-screen, which will come in handy for many. It also comes with Google’s Entertainment mode, which is basically a nexus for various streaming apps, and you also get Kids space with parental controls, so you can hand the tablet to a youngster to entertain them.",
    "The Realme Pad provides a clean software experience but there aren’t too many features and customization isn’t on the level that we’ve seen on the Realme UI on phones - it feels ‘for Pad’ actually means ‘closer to stock Android’. The setup, icons, and settings page are ported over from Realme UI, but little else.",
    "You get a big 7,100mAh battery in the Realme Pad, which is paired with 18W charging.",
    "In our testing period, we managed to get about five to six hours of screen time with extensive use, which is basically a full day for us, but with lighter use we reached a second day of work occasionally. Our standard use included using the Realme Pad for video calls, watching movies, and web surfing.",
    "For charging, there’s an 18W charger included in the box. The tablet takes more than 2 hours and 30 minutes to charge from 5% to 100% - that can be painful in the middle of the day, and depending on what you’re doing, plugging it in won’t actually fully offset power consumption. That is to say, 18W is slow.",
    "Realme has always been a pioneer when it comes to fast charging on phones and we did miss the fast charging on the Realme Pad. While slow charging is common in the budget tablet market segment, Realme could have taken a leap ahead in this department.",
    "First reviewed November 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Realme Pad price and availability",
    "15": "Design",
    "24": "Display",
    "30": "Performance, specs and camera",
    "39": "Software",
    "42": "Battery life",
    "46": "Don’t buy it if…"
  },
  "links": {
    "": "https://www.techradar.com/news/best-tablet",
    "Android tablets": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "Apple's iPad lineup": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "Huawei MatePad 11": "https://www.techradar.com/reviews/huawei-matepad-11-review",
    "Xiaomi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "premium tablet": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Samsung Galaxy Tab S6 Lite": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-lite-review",
    "Moto G30": "https://www.techradar.com/reviews/moto-g30"
  }
}