{
  "source": "https://www.techradar.com/reviews/asus-chromebook-flip-c302",
  "title": "Asus Chromebook Flip review",
  "category": "computing",
  "updated": "2021-11-19T17:57:12Z",
  "author": "kevin-lee",
  "summary": "The premium Chromebook is finally affordable",
  "verdict": "Even after all this time, the Asus Chromebook Flip C302 is still worthy of its premium stature with a dazzling screen, tactile keyboard and a classy design that’s equally as comfortable to use in tablet mode or as a traditional laptop.",
  "pros": [
    "Elegant tablet mode",
    "Gorgeous, vivid screen",
    "Tactile keyboard"
  ],
  "cons": [
    "Middling speakers"
  ],
  "article": [
    "Only when the Asus Chromebook Flip came out that the concept of “premium Chromebook” was fully realized. Though there were a few others in the same class that came before it, Asus’ offering showed the world exactly what a premium Chromebook should look and feel like while still keeping things fairly affordable to most consumers.",
    "Combining a lightweight and svelte chassis with a 2-in-1 form factor that adds to its versatility, a level of performance to match that of flagships like the Google Pixelbook, and a price tag that’s accessible, the Asus Chromebook Flip has set the standard for these higher-tiered devices. It’s why it’s become such a beloved Asus laptop, and still among the best Chromebooks after all this time.",
    "Simply, the Asus Chromebook Flip is not only among your best options out there, if you’re looking for a laptop with a great price to performance ratio.",
    "When the Asus Chromebook Flip first hit the streets, it went for $649 (about £509, AU$926) with an Intel Core m5 processor, 64GB storage and 4GB RAM. That was definitely a huge price tag for a Chromebook. However, because the Asus Chromebook Flip has been available for a while now, you should be able to find some great deals out there.",
    "If you’ve been contemplating getting an HP Chromebook, the HP Chromebook 14 may be marginally bigger and come with an Intel Celeron N2940 processor, Intel HD Graphics 500, 4 GB memory and 32 GB eMMC storage. However, it’s considerably cheaper at $299 (about £234, AU$426).",
    "At the same time, the Acer Chromebook Spin 13 for work goes for around $766 (about £604, AU$1,112) with an Intel Core i3 processor, 8GB of RAM and 64GB of flash storage.",
    "The Samsung Chromebook Plus is unquestionably the biggest rival here, as it goes for about $499 (about £349, AU$725) and comes with an ARM CPU, a sharper 2,400 x 1,600 display and a built-in stylus, though it is fitted with half the storage and memory.",
    "Samsung’s model also comes with a Pro SKU, which has the same Intel Core m3 CPU as the Asus Chromebook Flip, for $599 (about £472, AU$870) – however, again, with only half the storage and memory.",
    "Finally, there’s the Acer Chromebook R13, which also boasts a convertible build, with a full HD display for $369 (£399, about AU$536). Though, the 2.1GHz quad-core chip comes from MediaTek, instead of Intel.",
    "Like the Asus Chromebook C100 before it, the Asus Chromebook Flip is fitted in an all-aluminium chassis, though this time it comes with an anodized finish instead of a brushed texture. Overall, it has a clean, no nonsense look, and folds up to a nearly symmetrical slab of metal.",
    "Luckily, the original Chromebook C100’s long, bar-shaped hinge has been succeeded by the ZenBook Flip UX360’s multi-gear, metal mechanism. These two smaller hinges help this laptop feel less like a toy and also allows it to look like a regular notebook.",
    "Weighing in at 2.6 pounds (1.19kg), the Asus Chromebook Flip is one of the most lightweight Chromebooks around, only 0.3 lbs heavier than the Samsung Chromebook Plus. It’s also one of the first convertible Chrome OS computers you’ll actually want to use in tablet mode, unlike the 3.3-pound (1.5kg) Acer Chromebook R13.",
    "In all, the Asus Chromebook Flip C302 continues in the footsteps of every other unibody laptop inspired by the MacBook Pro in recent years. However, the straight edges, rounded corners and 0.9 inch (2.29cm) slim frame all add up to a smart design that contends with HP and Google’s more premium models, but at a significantly lower price tag.",
    "Portability aside, the Asus Chromebook Flip seems to have been specifically designed for tablet use. Asus has added a clever magnetic clasp that pulls the screen lid tight to the underside of the notebook. It’s an inspired detail that helps the 2-in-1 Chromebook feel like one solid machine rather than a foldable electronic, and we’re surprised this solution hasn’t come sooner.",
    "When you’re not using the Asus Chromebook Flip in tablet mode, it relies on an excellent keyboard that makes it as familiar and comfortable as any traditional laptop. The keys provide a satisfying 1.4mm of crisp key travel that’s been missing in a world of ultra-thin notebooks.",
    "As for the trackpad, we can only say that it’s there and it exists. It offers accurate tracking, but lacks any multi-touch features or two-finger scrolling, which is nothing to write home about.",
    "Having a functioning tablet mode is becoming more and more common in Chrome OS devices as Google is steadily improving the platform’s Android integration. The Asus Chromebook Flip did not originally launch with access to the Play Store, so we had to switch over onto Chrome OS beta channel in order to download apps during our time with the device.",
    "This has since been fixed by Asus, and now the device completely supports Google Play Store Android apps.",
    "Currently, the hybrid Chromebook is fully outfitted to plumb the depths of the Android ecosystem. We booted up our favorite apps just as we would on any Google tablet. To our surprise, the hybrid Chromebook is also furnished with gyroscopes, allowing us to play motion-controlled games like Asphalt 8.",
    "Regrettably, not everything about running Android apps is perfect. Many useful apps that we regularly use on a smartphone don’t scale quite right on Chromebooks, leaving us with very small text on certain apps. Additionally, the Kindle app isn’t available on full screen mode in portrait orientation.",
    "Mobile apps are made with consideration for a touchscreen interface, and at times this doesn’t translate well to the touchpad and keyboard setup of the Asus Chromebook Flip. Of course, it’s easy to switch the hybrid to tablet mode.",
    "We chalk these flaws up to the beta version of Chrome OS we were testing it with, which corrected some problems and introduced new ones during the course of our review.",
    "Despite these issues, we’re thankful we don’t have to search through the beleaguered Chrome Web Store full of knockoff apps and games. Having access to the Play Store gives us that many more useful programs on the Asus Chromebook Flip.",
    "We enjoy using Android apps in tablet mode just as much as sitting down with the Asus Chromebook Flip as a conventional Chromebook for long browsing and writing sessions. The hybridization of Google’s two platforms also finally allows us use mobile apps along with the staple elements of Chrome OS.",
    "First reviewed November 2017",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Pricing and availability",
    "9": "Design",
    "16": "Android apps on tap"
  },
  "links": {
    "Google Pixelbook": "https://www.techradar.com/reviews/google-pixelbook",
    "Asus laptop": "https://www.techradar.com/news/best-asus-laptops",
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "HP Chromebook 14": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/hp-chromebook-14-1317787/review",
    "Acer Chromebook Spin 13": "https://www.techradar.com/reviews/acer-chromebook-spin-13-convertible",
    "Pro SKU": "https://www.techradar.com/reviews/samsung-chromebook-pro",
    "Acer Chromebook R13": "https://www.techradar.com/reviews/acer-chromebook-r-13",
    "Asus Chromebook C100": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/asus-chromebook-flip-1300115/review",
    "ZenBook Flip UX360": "https://www.techradar.com/reviews/asus-zenbook-flip-ux360"
  }
}