{
  "source": "https://www.techradar.com/reviews/poly-voyager-4300-uc-series-headphones",
  "title": "Poly Voyager 4300 UC Series Headphones review",
  "category": "audio-visual",
  "updated": "2021-11-17T11:34:42Z",
  "author": "mark-pickavance",
  "summary": "Poly delivers cultured home working headphones",
  "verdict": "Slick and elegant Bluetooth headphones are most suitable for home workers. Easy to use, quick to charge, these are only let down by a design that isn't comfortable for all wearers.",
  "pros": [
    "High-quality construction",
    "Simple to use",
    "Useful Poly Lens desktop app"
  ],
  "cons": [
    "Thin cushioning",
    "Lacks active noise cancellation",
    "Expensive"
  ],
  "article": [
    "Poly, the company behind the Voyager 4300 UC reviewer here, has an incredible history going back to the 1960s when they created the headsets used on the Apollo moon missions.",
    "Based primarily in San Jose and Santa Cruz, California, the Poly operation employs around 6,500 people in its 75 global offices.",
    "These days the business still makes headsets, but it also offers Business phones, video conferencing hardware and software solutions aimed at connecting people.",
    "Under the Voyager branding, Poly offers a range of wireless headsets and headphones designed for those that use clear and effective communications as part of their daily lives.",
    "The Poly Voyager 4300 UC series are its latest entry-level solution, specified for both home and office users. Are these the ideal Bluetooth headset for home workers?",
    "The Poly Voyager 4300 UC Series headsets come in two flavours, a single monaural 4310 UC headset and the stereo 4320 UC model reviewed here. They also make specific Microsoft Teams versions of these with an extra Teams function button.",
    "They come as both USB-A and USB-C Bluetooth adapters, and a Voyager Office base also allows the units to be stored and charged when not in use. The Voyager Office base can also connect the headset to an existing phone system if that’s a requirement.",
    "The cost of the Poly Voyager 4320 UC reviewed here is £212.95 ($229.95) direct from Poly, and with a charging stand, the price is £230.95 ($249.95).",
    "It’s become common to put Bluetooth headphones in string bags, probably because it reduces the costs associated with other packaging options.",
    "Our Voyager 4320 UC came in one, along with a tiny USB-A BT700 Bluetooth adapter and a USB-A to USB-C cable. The cable is required to charge the headphones, but it can also double to provide a wired link to a computer should you not wish to use Bluetooth.",
    "Handling these for the first time, they feel lightweight (162g) but substantial. Construction appears to be primarily glass-reinforced plastic with very high-quality injection moulding used throughout.",
    "It is also obvious that the designer of these conceived them as both stereo and monoaural from the outset, as almost everything necessary is on the right side of the headset. No controls are on the left, reducing that side to merely a left-side driver.",
    "While this makes the construction of the monoaural models very straightforward, it could also makes these a less compelling solution for those that are left-handed. All the volume controls and the microphone boom are on the right.",
    "Except this ingenious design allows them to be fully reversible, moving the controls and the boom microphone to the left for those that prefer it there.",
    "Adjustment for head size is via notched arms that slide inside the headband. Once you’ve set these to your optimal position, there is sufficient friction that they should move while you are handling the headset away from your head.",
    "Where this unit is slightly lacking is in the comfort department. The top of the band has a cushioned section across the top where the most pressure is applied. Less padding is provided on the drivers, as these are covered in relatively thin sponge protection.",
    "Where we did experience a little discomfort is that the sideways pressure applied by the band trapped the reviewers' glasses between his ear and skull. Those with less beach-ball inspired craniums will probably be fine, but for others, these might prove unsuitable for prolonged use.",
    "Another exciting aspect of this design is that it has a different mix of audio functionality than we’ve seen elsewhere. Its designers focused more on the microphone and its abilities than the reduction in ambient sound on the wearer.",
    "The microphone is part of a noise-cancelling boom with dual microphone acoustic fence technology. That should reduce any environmental sounds propagating to be heard by the other end of a call or conference. However, there is no active noise cancellation in the headphones, so the operator will still hear those sounds.",
    "Because of this choice, these may be more suitable for home workers than those in a call centre, or at least in an office which isn’t exceptionally noisy.",
    "These are remarkably straightforward to use, as Ploy avoided any complicated buttons or controls to confuse the user.",
    "The one can is a single USB-C port that can be used for wired use and to charge the unit, and on either side of this are two small recesses designed to help engage the connections on the optional charging stand.",
    "On the same side are three widely spaced buttons for increasing and decreasing volume and ending or starting a call on the end of the can. Lights around those show the call status of the headset wearer to those nearby, a feature we’d associate more with call centre applications.",
    "Cleverly the mute button is on the flexible microphone arm near the driver end, so fumbling for it shouldn’t be picked up by the mic, and it's easy to find after just a couple of uses.",
    "The power on/off switch doubles for Bluetooth pairing, but you will only need this if you want to use the headset with a phone or system that has Bluetooth embedded in it. Using the provided BT700 Bluetooth adapter, no pairing is required. The headset will automatically connect if powered on when the Bluetooth adapter is inserted into a USB port.",
    "Whenever something significant happens, like the headset powers on or connects to the Bluetooth adapters, a voice informs the wearer what has occurred. From a user perspective, these are very friendly and easy to use.",
    "For extra control over the headset, Poly offers a free-to-download application, Poly Lens Desktop App. Available for both Windows and Apple Mac systems, the application provides a standard mechanism for configuring all Poly hardware, including the 4300 UC Series.",
    "This tool is needed to upgrade the firmware on both the headset and BT700 Bluetooth adapter. And can also set audio limits on how loud the headset can be or how abruptly the volume can change.",
    "It is also possible to upload different languages to the headset that it can use when communicating with the user, overwriting the default US/English.",
    "Alongside the hardware configuration functions, Poly Lens Desktop App also has wellness reminders to tell users when they need to move around or look away from the screen.",
    "For businesses with a significant number of these products deployed and more strategic planning of user protections, a Cloud version of Poly Lens can be purchased, enabling centralised management of these settings.",
    "If the 4300 series has a stand-out feature, it’s undoubtedly the battery management, enabling up to 24 hours of talk-time and up to 47 hours of listening. It takes just 1.6 hours (96 minutes) to recharge fully, and you can get sufficient battery power for 10 hours from just 15 minutes of power connection.",
    "If only used occasionally, they’ll last 50 days in a drawer on standby, making them ideal for infrequent users. All the quoted time figures assume that the headset is used with the BT700 Bluetooth adapter since it uses Bluetooth 5.2 for greater power efficiencies.",
    "For business use, the sound quality is more than acceptable, though the frequency range probably isn’t going to impress hardcore audiophiles.",
    "To our ears, the lower end bass and high treble are clipped, shrinking the overall audio space. That said, this isn’t a bad experience. But it just isn’t one with the richness that music and movie fans would specifically embrace.",
    "The focus of this design is the other person in this conversation, and that’s where the Voyager 4320 UC is an exceptional design.",
    "In our testing, we placed noisy equipment near the wearer to assess how much sound would bleed over to the conversation. The acoustic fence technology Poly uses works remarkably well, negating most of the extraneous sounds.",
    "For home workers, a barking dog or delivery doorbell isn’t likely to be commented on, even if it might distract the wearer.",
    "Even if they weren’t entirely comfortable for our reviewer, for the majority of normal humans, these should be fine with these. As with all headphones, their suitability for all-day wear is a personal thing, and we wouldn't assume to say that everyone would find them comfortable enough for extended use.",
    "If you can wear them all day, the experience is a good one, with very clear and balanced audio and excellent battery life. There are headsets that offer even longer battery lives, but the ability to fast charge these enough for more than a working day of use in just 15 minutes is handy.",
    "Even without active noise cancellation, the Voyager 4320 UC provide clear sound and excellent clarity for anyone at the recipient end of the conversation.",
    "The audio representation to the wearer isn’t spectacular, but it is better than it needs to be for the typical usage.",
    "What might be more of an issue is the pricing. These are more expensive than some of the comparable designs, like the EPOS I SENNHEISER Adapt 260 and the Sony WH-1000XM3. Though, they are cheaper than the Bose 700 UC and Sony WH-1000XM4.",
    "The positioning of the Voyager 4320 UC between these products hints that Poly is looking to draw customers from both ends of this spectrum.",
    "However, the lack of active noise cancelling might undermine customers who work in inherently loud environments.",
    "We conclude that while we liked much of what the Voyager 4300 UC series offered, they’re probably a little overpriced."
  ],
  "headers": {
    "5": "Price and availability",
    "8": "Design",
    "20": "In use",
    "33": "Sound performance",
    "38": "Final verdict"
  },
  "links": {
    "Poly Voyager 4300 UC Series": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4530032862427044400&xs=1&url=https%3A%2F%2Fwww.poly.com%2Fus%2Fen%2Fproducts%2Fheadsets%2Fvoyager%2Fvoyager-4300-uc&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpoly-voyager-4300-uc-series-headphones",
    "EPOS I SENNHEISER Adapt 260": "https://www.techradar.com/reviews/epos-i-sennheiser-adapt-260-headphones",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Bose 700 UC": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-uc-700-review",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones"
  }
}