{
  "source": "https://www.techradar.com/reviews/mackeeper-5",
  "title": "MacKeeper review",
  "category": "computing",
  "updated": "2021-05-11T03:40:34Z",
  "author": "chyelle-dvorak",
  "summary": "A single app for protecting and tuning the performance of your Mac",
  "verdict": "Despite its checkered past, MacKeeper provides a decent level of protection and performance optimization features.",
  "pros": [
    "Fast on-demand virus scan",
    "Built-in VPN",
    "Performance features"
  ],
  "cons": [
    "More expensive than its rivals",
    "Support could be better",
    "Some functions available for free elsewhere"
  ],
  "article": [
    "MacKeeper is a multipurpose app for Macs that will protect your computer from online security threats, improve its performance, and help you reclaim disk space.",
    "The features that MacKeeper offers today make it one of the best antivirus software choices available for Mac users. But it does have a checkered past, and in this MacKeeper review, we’ll find out how its reputation has been turned around as we look at its features, pricing, interface, and support.",
    "The MacKeeper software application has a very simple pricing structure. If you only want to protect one Mac and want to pay by the month, it will cost $10.95/month.",
    "If you choose to purchase a year’s subscription upfront, the cost comes down to $4.45/month (billed annually) and you’ll also be given an extra license to cover another device.",
    "And if you want to protect three Macs, the cost would be $5.20/month for all three, with an extra license thrown in for a total of four covered devices.",
    "With every plan, you get a free checkup of your Mac carried out remotely by one of MacKeeper’s technicians. There is no free trial, but there is a 14-day money-back guarantee.",
    "MacKeeper also offers a support plan called Premium Services, which costs $58/month for 12 months, $68/month for six months, or, if you only want to pay month-to-month, $39.99/month plus a $299 setup fee.",
    "The services include optimizing the speed and performance of your Mac and fine-tuning the system. There is also troubleshooting help for apps on both your Mac and other devices, like phones and tablets.",
    "MacKeeper has five main features: Premium Services, which we mentioned above, antivirus, performance tuning, disk cleaning, and VPN.",
    "MacKeeper’s antivirus software boasts a 99.7% detection rate and can block malware that is specifically designed for Mac computers. It will detect and remove viruses, spyware, adware, and ransomware.",
    "Real-time protection means MacKeeper will block any viruses before you open the files that contain them. Or you can run on-demand scans at any time.",
    "MacKeeper can also be used to safely remove unnecessary files like logs, cache files, and unused languages. The program will locate duplicate files for you, and MacKeeper’s Smart Uninstaller will make sure you’ve deleted everything associated with apps, widgets, and browser extensions.",
    "MacKeeper can also help to speed things up if apps are starting to slow down or if your Mac experiences freezes. MacKeeper will automatically monitor your Mac’s memory and your apps for updates, making sure you always have the latest versions.",
    "MacKeeper also comes with its own built-in VPN that you can use to browse the internet securely. You’ll be able to encrypt your data if you’re ever on public Wi-Fi networks and conceal your browsing history.",
    "The thing that stands out the most about MacKeeper is how easy it is to use. A quick install, and then you’re guided through the process of scanning and protecting your Mac. The user interface is clear and easy to follow, guiding you through what you need to do after the initial scans have been performed.",
    "During the scan, we were prompted to enter an email address to check with the ID Theft Guard, and it returned results showing us the source of a breach and the password that had been compromised.",
    "The left-column menu displays numbers against the items that need attention. Adware Cleaner, Safe Cleanup, and Update Tracker all resolved their respective issues with a single button click. Although, with the Update Tracker, you need to be aware that some updates might require paid upgrades.",
    "The main method of support for MacKeeper is via live chat on the company’s website or in the app itself. But to make sure chat agents can accurately diagnose problems, MacKeeper offers a separate Remote Support app. Once the app is installed, the agent can connect to your computer remotely with a secure ID and password.",
    "Email and phone support are also available, but the support email address isn’t displayed on the company website (we found it via a Google search), and the toll-free numbers are only displayed after you receive an email reply from support.",
    "Not only will MacKeeper protect your Mac from viruses and protect you during online browsing with its built-in VPN, it will also alert you of data breaches and compromised passwords.",
    "It should be noted that, in the past, MacKeeper did have a reputation for reporting fake problems with its free version of the software to manipulate people into paying to get the fixes. The company that owned MacKeeper at the time was even taken to court over this behavior.",
    "MacKeeper is now owned by a different company and is certified by AppEsteem, which aims to verify the safety of apps.",
    "The market for Mac antivirus software isn’t as large as it is for Windows, but two of the big players in the Windows market also offer Mac products too.",
    "Bitdefender Antivirus for Mac offers antivirus protection, a built-in VPN, and a time machine feature if your computer falls victim to ransomware. It costs $19.99/year to protect a single device and $29.99/year for three devices. Prices fall to $58.49 and $77.99 if you pay for three years.",
    "Kaspersky Internet Security for Mac has similar antivirus and performance features to MacKeeper and ranges in price from $20.95 for a year for one device up to $129.95 for two years for five devices.",
    "MacKeeper is an app that packs a lot of useful features into a single package. If you’re the sort of person who likes apps that are simple to set up and can be left to do their job in the background, then you’ll like MacKeeper.",
    "It may not be as cheap as some of the competition, and some of what it offers can be done yourself with a little know-how or with other free apps, but its simplicity and ease of use make it stand out."
  ],
  "headers": {
    "2": "Plans and pricing",
    "8": "Features",
    "14": "Interface and in use",
    "17": "Support",
    "19": "Security",
    "22": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "MacKeeper": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4853060667901232000&xs=1&url=https%3A%2F%2Fmackeeper.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmackeeper-5",
    "best antivirus software": "https://www.techradar.com/best/best-antivirus",
    "one Mac": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1029534444263416800&xs=1&url=https%3A%2F%2Fmackeeper.com%2Fnewbn%2Fbuynow-mk5-web-bday2021-en-ppg&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmackeeper-5",
    "three Macs": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5698397546241098000&xs=1&url=https%3A%2F%2Fmackeeper.com%2Fnewbn%2Fbuynow-mk5-web-bday2021-en-ppg&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmackeeper-5",
    "Premium Services": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2326614383635089000&xs=1&url=https%3A%2F%2Fmackeeper.com%2Fnewbn%2Fbuynow-mk5-web-bday2021-en-ppg&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmackeeper-5",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Bitdefender Antivirus for Mac": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "Kaspersky Internet Security for Mac": "https://www.techradar.com/reviews/kaspersky-2020-antivirus-solutions"
  }
}