{
  "source": "https://www.techradar.com/reviews/corsair-katar-pro-xt",
  "title": "Corsair Katar Pro XT review",
  "category": "computing",
  "updated": "2021-02-12T15:40:24.066Z",
  "author": "john-loeffler",
  "summary": "The featherweight champion of the budget class",
  "verdict": "The Corsair Katar Pro XT is easily one of the best budget gaming mice on the market by matching comfortable design, great functionality, and competitive price. Just don't expect many premium features.",
  "pros": [
    "Very affordable",
    "Max 18,000 DPI",
    "Comfortable design",
    "Super lightweight"
  ],
  "cons": [
    "Few programmable buttons",
    "1KHz polling rate",
    "USB Type-A 2.0",
    "Only one on-board profile",
    "Not as ambidextrous as it looks",
    "Not wireless"
  ],
  "article": [
    "The Corsair Katar Pro XT is easily one of the best gaming mice we've seen recently thanks to its fusion of functionality, comfort, and very low price.",
    "The mouse is available now for $29 (£34, AU$69) from Corsair's website and will roll out to other retailers worldwide in the coming weeks.",
    "While it might not be as feature rich as some other gaming mice – the Razer Viper 8K's ridiculously fast polling rate has definitely spoiled us – the Katar Pro XT still manages to pack a lot into its featherweight build.",
    "With 18,000 DPI max, the Corsair Katar Pro XT is precise enough for all but the most blood-thirsty ranked FPS matches where it's standard 1,000Hz polling rate will hold it back from taking on its more expensive counterparts.",
    "That polling rate is something you'll probably notice since ridiculously light weight (73g) and its paracord USB cable mean it flies across your desk space with ease, leaving teleporting cursors flying across the screen instead of a more smooth and fluid motion.",
    "Given that this is still industry standard for mice of all kinds, we really can't expect a budget mouse to do better than some of its more expensive rivals on that front, which is the story of the Katar Pro XT in a lot of ways: phenomenal for what it is but missing out on a number of features found in gaming mice that are marginally more expensive.",
    "That's not to say it's entirely basic. It features six programmable buttons, so you can program some macros for MOBA and MMO gaming. There is even a button to switch DPI settings on the fly, saving you the trouble of having to go into Corsair's iCue software to make that adjustment.",
    "Taken together, we'd expect to pay much more for a mouse like this, which makes its price easily it's best selling point. You get a great gaming experience out of the Corsair Katar Pro XT without spending a lot money, and so long as you're willing to pass on the truly premium features of other gaming mice, it's hard to go wrong with this one.",
    "The first thing you notice when you take the Corsair Katar Pro XT out of the box is its weight and size - or general lack thereof.",
    "At just over 2.5 ounces (73 grams) and 4.56 x 2.53 x 1.49 inches (115.8 x 64.2 x 37.8 millimeters), this is a much smaller gaming mouse than we'd normally see, which will be a relief for people with smaller hands.",
    "The form factor is ambidextrous but, unfortunately, the extra button layout is not. The two programmable side buttons sit under the thumb of the right-handed user, so a lefty will need to use their pinky or something to click those extra buttons on the side. Considering that the mouse is otherwise completely the same righty or lefty makes the lack of thumb buttons for lefty gamers somewhat disappointing.",
    "The only RGB on the mouse lights up the mouse wheel and the settings for it require Corsair's iCue software to adjust. You should definitely use the software though, since this is where you can customize the different extra buttons you have available.",
    "The 1,000Hz polling rate is the industry standard but considering that this gaming mouse will likely be going up against faster mice, this could put a player at a slight disadvantage during competitive play. It does have 18,000 max DPI and you are able to adjust the DPI precision with a click of a button right there on the mouse.",
    "The lightweight and paracord do definitely help keep it moving fast and not tripping over it's own wire. It doesn't have a wireless option, unfortunately, and the USB plug is a USB Type-A 2.0 which we think should have been a Type-C, but it might take a little while longer before that becomes standard for peripherals."
  ],
  "headers": {
    "0": "Two minute review",
    "14": "Don't buy if..."
  },
  "links": {
    "best gaming mice": "https://www.techradar.com/news/best-budget-mouse-2020-point-and-click-on-the-savings",
    "Razer Viper 8K's": "https://www.techradar.com/reviews/razer-viper-8k-review"
  }
}