{
  "source": "https://www.techradar.com/reviews/hp-elite-dragonfly-g2",
  "title": "HP Elite Dragonfly G2 review",
  "category": "computing",
  "updated": "2021-06-01T13:46:15Z",
  "author": "matt-hanson",
  "summary": "Can HP make lightning strike twice?",
  "verdict": "The HP Elite Dragonfly G2 is one of the best laptops we’ve tested. For business use, there are very few laptops that look as stylish, and even if you’re not looking for a business laptop, the HP Elite Dragonfly G2 is a great purchase, offering a stunning design, great battery life and very good performance. It is expensive though.",
  "pros": [
    "Great design",
    "Comfortable keyboard",
    "Excellent screen",
    "Long battery life"
  ],
  "cons": [
    "Expensive",
    "USB-C ports on only one side"
  ],
  "article": [
    "The HP Elite Dragonfly G2 is a laptop we've been very much looking forward to testing, as its predecessor, the HP Elite Dragonfly, blew us away when we reviewed it last year.",
    "The Dragonfly G2 is the follow-up to that thin and light business laptop, and it promises to be an even more impressive bit of kit. With the Apple MacBook Air (M1, 2020) currently sitting atop our best laptops list, could the HP Elite Dragonfly G2 be the device that puts Windows 10 laptops back in the top spot?",
    "The good news is that this is another stunning laptop from HP, and while it’s primarily designed for business use, it’s stylish enough to appeal to a wide range of users. In fact, there’s very little about this laptop that's explicitly ‘enterprise’, so don’t think that because this a business laptop, it’s got a plain design.",
    "The HP Elite Dragonfly G2 is a 2-in-1 device, which means it can be used either as a laptop or in tablet mode, and its high-resolution (up to 4K) touchscreen looks gorgeous and works brilliantly, offering the kind of versatility that MacBooks don’t.",
    "It runs Windows 10 extremely well, and thanks to plenty of RAM, fast SSD storage and Intel’s new 11th-generation processors, there’s enough power here to ensure that most day-to-day tasks are handled well. There’s no dedicated GPU, however, which should come as little surprise considering how thin and light this laptop is, but it does mean that those looking for a device that can handle graphics-heavy work may want to look elsewhere.",
    "Battery life is also excellent, with the Dragonfly G2 lasting a whole work day in most scenarios, although we noticed that video calls were particularly taxing on the battery. Best of all, you can close the lid to put the laptop into sleep mode, then come back to it a few days later and the battery will still be there – far too many Windows 10 laptops seem to bleed battery life even when not in use, and that’s not an issue here.",
    "What may be an issue for many people, however, is the price. Starting at $1,819/ £1,69 (Australian pricing has yet to be confirmed), the HP Elite Dragonfly G2 is one of the more expensive laptops you can buy right now, and that price tag will put a lot of people off, no matter how good the Dragonfly G2 is in other respects.",
    "The original HP Elite Dragonfly was a pricey laptop, so it's little surprise that the HP Elite Dragonfly G2 also comes with a high price tag, starting at $1,819 in the US.",
    "In the UK, the laptop will start at £1,699, although it doesn’t appear to be available yet. We’ve contacted HP to find out when the laptop will go on sale in the UK.",
    "Availability in Australia also doesn’t seem to clear cut at the moment, but going by those US and UK prices, it will likely retail around the AU$3,000 mark.",
    "As with the previous HP Elite Dragonfly, these prices put the G2 into the ultra-premium bracket, where it's rubbing shoulders with the likes of the Dell XPS 13 and MacBook Pro 13-inch. These are some of the best laptops ever made, so the HP Elite Dragonfly G2 will need to pull out all the stops to justify its price tag.",
    "As many of the best HP laptops prove, the company can make some stunning devices, and the HP Elite Dragonfly G2 is another prime example. It looks gorgeous, with a blue metallic finish and silver highlights, that scream 'premium'.",
    "The two large hinges of the Dragonfly G2 stand out, but in a good way. Highlighted in silver, these chunky hinges allow the display to flip 180 degrees backwards, turning the laptop into a tablet-like device. They feel sturdy and well built, so you shouldn’t have to worry that they will break, no matter how much you use the laptop.",
    "That sturdiness extends to the overall build quality of the HP Elite Dragonfly G2. The metal chassis feels like it can easily withstand being carried around, and even a few knocks and bumps, but at the same time it’s thin and light, weighing less than 1kg. Where metal isn’t used, ocean-bound plastics (reclaimed plastic that might otherwise end up in our seas) often are, which is a nice touch, with the environmental impact of our tech purchases becoming an important consideration for many.",
    "With dimensions of 11.98 x 7.78 x 0.63 inches (304 x 198 x 16mm) the HP Elite Dragonfly G2 impressively thin, but it comes with a decent array of ports that certainly puts the MacBook Pro 13-inch (M1, 2020) to shame. You get two Thunderbolt 4/USB 4 Type-C ports (which are also used for charging), a full-size USB-A port, a HDMI 2.0b port and audio jack.",
    "Having full-sized USB-A and HDMI ports is particularly welcome, especially as HP pitches this as a productivity and business laptop. It means you can plug in older peripherals, or hook the laptop up to a projector, monitor or TV, without needing to carry around an adaptor.",
    "The Dragonfly G2 is also proof that you don’t need to sacrifice connectivity and convenience for a thin and light design. One thing to note, however, is that the USB-C ports are both on the right-hand side of the machine, which means that if you want to charge the laptop, you have to connect it on the left. This won’t always be a big deal, but it can sometimes be a little awkward, and it wouldn’t be an issue if there was a USB-C port on either side.",
    "On opening the laptop, you’re greeted by a gorgeous screen. The HP Elite Dragonfly G2 comes with up to 4K resolution (included in the model we were sent for this review), and as this is a 2-in-1 device, it’s also a touchscreen. It's bright and vibrant, and while 4K may seem a bit over the top for a 13-inch display, it means the image quality is sharp and detailed. The included stylus work well with the touchscreen, helping to make the Dragonfly G2 a versatile device that can be used in more ways than traditional laptops.",
    "The bezels that surround the screen are slim, which keeps the overall size of the laptop down while also giving it a modern look.",
    "Moving down to the keyboard, and the keys are large and easy to hit, with impressively deep travel for a thin and light laptop. It makes for one of the most satisfying typing experiences we’ve had on a laptop, and you should be able to type comfortably on it for hours at a time (as we did when testing it). At no point did we wish we were using a standalone keyboard, which has sometimes been the case in the past.",
    "The touchpad is also nice and large, and did a decent job of keeping up with our demands as we were working. Below the right-hand corner of the keyboard there’s a fingerprint scanner for logging into Windows 10 – it’s a nice feature to have, and we found it generally worked well.",
    "When the Dragonfly G2 is used in tablet mode, the keyboard folds behind the screen. This means it’s not quite as comfortable to hold as a standard tablet, which is also an issue for the original Dragonfly, along with many other 2-in-1 laptops, but the Dragonfly G2 is thin and light enough that it’s still easy to hold in one hand. When the G2 is in tablet mode the keyboard turns itself off, so you don’t have to worry about accidentally pressing the keys.",
    "Overall, the HP Elite Dragonfly G2 is one of the best-looking laptops of 2021. It’s smart and sophisticated, and the kind of laptop you’d be happy to pull out at a meeting.",
    "As this is an Intel Evo laptop, you’re getting the latest Intel 11th-generation mobile processors, and the model we reviewed comes with the powerful Intel Core i7-1165G7, paired with 16GB of RAM.",
    "That’s a formidable combination, and it means that Windows 10 Pro, which comes installed, feels fast and responsive. You can also get an i7-1185G7 and up to 32GB of RAM if you need a really powerful thin and light productivity machine, while there are also models with a Core i3 or i5 chip and 8GB of RAM if you want something a bit more modest.",
    "As we've mentioned, the HP Elite Dragonfly G2 is an expensive laptop that needs to justify its high price, and when it comes to specs, it does just that. The 256GB SSD in our model was fast and speedy, and on the whole, day-to-day tasks were handled very well.",
    "The 4K display looks fantastic, and offers plenty of workspace for Windows 10, despite the smaller screen. It also does a great job of showing off your photos and videos, and while it doesn’t have a dedicated graphics card, the integrated Intel Iris Xe GPU is certainly good enough for photo editing and even video editing, though professionals may require something with a bit more power.",
    "The HP Elite Dragonfly G2 did crash while we were using it, but it recovered quickly, and it seems like it was just a one-off occurrence, which can happen to the best of laptops from time to time.",
    "Sometimes, when performing more demanding tasks such as video conferencing, the fans of the HP Elite Dragonfly G2 would kick in to keep everything cool, but while the noise they produce is noticeable, it's not annoying or distracting.",
    "The built-in Bang & Olufsen speakers are capable of producing room-filling sounds without distortion, and they're certainly some of the better speakers we’ve heard on a laptop.",
    "With so many of us working from home or working remotely these days the quality of a laptop’s webcam is of the utmost importance – and even more so on laptops like the HP Elite Dragonfly G2, which are specifically marketed as business laptops.",
    "While the HP Elite Dragonfly G2's webcam is ‘just’ 720p, it does a fine job; we participated in several video calls, and our footage and audio came across clearly. There’s a dedicated button above the keyboard for turning off the webcam when it's not in use, which is a nice feature for anyone who wants a bit more peace of mind.",
    "One of the most important considerations people have when looking for a new laptop is battery life, and Intel has made a concerted effort to make sure that any laptops that run on its 11th-generation processors, especially those with Intel Evo certification, boast impressive battery lives of nine hours or more.",
    "The good news is that the HP Elite Dragonfly G2 easily blows past that. In our TechRadar battery life benchmark, where we run a looped 1080p video until the battery dies, it lasted a very impressive 11 hours and 30 minutes – more than enough for most long-haul flights.",
    "In the PC Mark 10 battery life test, which replicates standard day-to-day usage, the battery depleted a bit quicker, lasting just over eight hours, but that’s still pretty good going, and it should mean the Dragonfly G2 lasts around a whole work day when unplugged and fully charged.",
    "In our day-to-day use we found the battery life to be generally excellent, and we were able to work for most of the day without worrying about having to plug the laptop in. As we've mentioned, video calls seemed to deplete the battery faster, but on the whole battery life is impressive.",
    "Perhaps best of all, we found that after a day or so of not using the Dragonfly G2, and having closed the laptop but not shut it down, we could open it again and find there was still plenty of battery left. One of our biggest complaints with even the best Windows 10 laptops is how the batteries seem to drain, even when not in use – an issue that Chromebooks and MacBooks don’t suffer from.",
    "We’re pleased to see that HP appears to have addressed the issue here, and it means this is one of the few Windows 10 laptops we’ve tested that would make us confident about relying on Microsoft’s operating system for a full day of productivity tasks. Not bad at all."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "11": "Design",
    "23": "Performance",
    "30": "Webcam",
    "32": "Battery life",
    "38": "Don't buy it if..."
  },
  "links": {
    "HP Elite Dragonfly": "https://www.techradar.com/reviews/hp-elite-dragonfly",
    "business laptop": "https://www.techradar.com/news/best-business-laptops",
    "Apple MacBook Air (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Windows 10 laptops": "https://www.techradar.com/news/best-windows-laptop",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "MacBook Pro 13-inch": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "best HP laptops": "https://www.techradar.com/news/mobile-computing/laptops/what-s-the-best-hp-laptop-904710"
  }
}