{
  "source": "https://www.techradar.com/reviews/hp-omen-15-2021",
  "title": "HP Omen 15 (2021) review",
  "category": "computing",
  "updated": "2021-11-11T15:09:48Z",
  "author": "jess-weatherbed",
  "summary": "It would seem not all Omens are bad",
  "verdict": "Featuring a 165Hz QHD display and the latest GPU and CPU hardware, the HP Omen 15 (2021) is a fantastic budget gaming laptop for content creators and students.",
  "pros": [
    "Fantastic 165Hz QHD display",
    "Strong gaming performance",
    "Great cooling, doesn't run hot",
    "Muted 'gamer' aesthetics"
  ],
  "cons": [
    "Flimsy-feeling chassis",
    "Power button is precariously placed",
    "No USB-C charging"
  ],
  "article": [
    "If you're looking for a powerful gaming laptop that can double as your everyday work or study device then the HP Omen 15 (2021) offers some compelling features at a price that won't break the bank.",
    "Our review sample was provided by Box, a UK-based retailer where you can find the HP Omen 15 (2021) available to purchase. There are a few different configurations available for those who want to optimize areas like graphics, display, and processing power, but regardless of what variant you buy, there are several features that remain consistent.",
    "The number of ports available also makes this a great choice for content creators or streamers, with the inclusion of a built-in SD card reader, a 3.5mm audio port and a Display Port.",
    "The Nvidia GeForce RTX 3060 and RTX 3070 graphics card options available for configuration ensure that this will run just about any game you throw at it, the 165Hz display is perfect for giving you an edge in competitive games and the Omen Gaming Hub software gives you plenty of performance optimization.",
    "There are, of course, some caveats. The chassis has some very noticeable flex to it, likely to keep costs low, so you may find yourself bending the lid or the base if you apply too much pressure. Many laptops have some flex to them of course, so unless you're adamant about buying an ultra-robust device that can really take a beating, this shouldn't cause too many issues.",
    "The HP Omen 15 also manages to keep surprisingly cool, but the trade-off is some having to listen to some fairly noisy fans. Again, this is far from unusual, especially in gaming laptops when running demanding applications, but these were noticeably irritating.",
    "There are beefier laptops on the market for sure, and the muted design of the HP Omen 15 might not win over any die-hard fans of flashy RGB lighting or edgy aesthetics, but it stands its ground as one of the best 'middle ground' devices right now.",
    "Don't look to the new HP Omen 15 as a competitor for big-hitters like the Razer Blade 15 or the Alienware m17 R4. Instead, see it as a feature-packed stepping stone for PC gamers that require portability, or even an ideal hybrid device for students or content creators that can make use of its ports. It might not be the biggest fish in the pond, but it's certainly punching above its pricetag.",
    "The HP Omen 15 (2021) is available in several configurations. Our review unit featuring an AMD Ryzen 7 5800H processor, 16GB of RAM and an Nvidia RTX 3060 graphics card comes in at $1499 / £1,200 / around AU$2,000. You'll find other configurations available depending on your region, including a few Intel variations.",
    "If you need something a little more powerful then you can configure the Omen 15 on the HP website with up to a Ryzen 9 5900HX, and RTX 3070 graphics card and 1TB M.2 SSD storage for $1989.99, but the maximum configuration available on the UK site was a Ryzen 7 5800H processor, RTX 3070 GPU and 1TB of M.2 SSD storage for £1699.",
    "The available RAM option available caps out at 16GB, and the display options are either standard 1080 'FHD' and 144Hz or 1440P 'QHD' (sometimes dubbed 2K) at 165Hz. You can also choose between either a 1-zone white backlit keyboard or upgrade to full 4-zone RGB for an additional $20.",
    "There are more customizations available on the US website than other English-speaking regions we checked, but regardless of what configuration suits your needs, they all feel very fairly priced for what you're getting.",
    "If you hate the typical RGB lighting and edgy designs seen in gaming laptops then the HP Omen 15 will probably leave a good impression on you. When the lid is closed, you'll see a blue/purple shifting foiled logo, but otherwise, this could easily pass for a professional-looking laptop that's suitable to take into the office or to use in college.",
    "The chassis is noticeably flexible, even when the lid is closed. Providing you don't frequently try to squish your device like a large sandwich, this is unlikely to be an issue, but we're wired to think that something bending must mean it's cheap. In this case, the Omen 15 fit's into the 'affordable' category for gaming laptops, so take from that what you will.",
    "The matte black casing is a nightmare for fingerprints, but they'll easily wipe clean. You might find the keyboard and where your wrists lay when typing to be areas where it's especially easy to see any oily residue from your fingers and palms, so don't use any hand creams or moisturizers when using this.",
    "When we open the laptop, it's easy to see where other savings have been made to keep the price tag as low as possible. The display is surrounded by a plastic panel which is a far cry from 'premium', and the hinge is a little on the floppy side, making the screen feel somewhat vulnerable when closing the lid.",
    "Small criticisms on the build quality and cost-saving measures aside, the HP Omen 15 isn't lacking in features, especially regarding ports. On the left is an HDMI port, a USB-A port, an Ethernet port, a 3.5mm headphone jack, a built-in SD card reader, and the port to charge the device.",
    "On the right side you'll find a USB-C port, a Mini-DisplayPort and two more USB-A ports, so you have options to connect the laptop to an additional display (or two if you use both the HDMI and Display Port), as well as the ability to connect a VR headset. You also have enough connections to hook up your favorite gaming mouse and gaming headset, though streamers or broadcasters may prefer to use a USB microphone with a built-in audio jack for headphones.",
    "Additional benefits for creatives looking for an all-in-one solution is that the HP Omen 15 display has 99% sRGB coverage, though we found it to be a little dim in bright environments.",
    "The keyboard's RGB backlighting isn't outrageously bright, and the key colors can be adjusted or switched off using Omen Light Studio. If you opted for the RGB option then you can also set a solid color this way to use in more professional environments.",
    "Typing is pleasant and responsive. You're not getting a Numpad, but the keys you do get are clicky without being loud, and we found them great for gaming and general typing and note-taking. A concern we did find though is that the power button is located to the left of the backspace, which could result in some fairly annoying misclicks that power down the device into sleep mode.",
    "The HP Omen 15 is a smidge on the hefty size, measuring in at 14.1 x 9.4 x 0.9 inches and weighing in at 5.4lbs . The laptop is therefore heavier than the Asus ROG Strix Scar 15 (5lbs) and the Razer Blade 15 (4.73lbs), but we still found it to be very portable, especially as this is a 15-inch laptop rather than a much beefier 16 or 17-inch beast.",
    "The specifications of the HP Omen 15 (2021) mean it can play just about any AAA game you can throw at it, including Cyberpunk 2077 and Assassin's Creed: Valhalla. You won't be breaking any records for framerates, but you can expect at least 30 fps in fully maxed-out settings across really demanding titles like Metro: Exodus, and a satisfactory 50-70 fps in most thematic single-player games.",
    "Thanks to the high refresh rate of 165Hz, the laptop is better suited to competitive shooters and battle royale titles such as Apex Legends and Fortnite, and while the 3ms response speed isn't the fastest on the market, it's more than enough to mitigate any ghosting or motion blur.",
    "Speaking of Apex Legends, with all settings maxed out you'll get around 80 fps on the HP Omen 15, rising to 130 fps on medium. You won't be getting GeForce RTX 3080 performance out of the RTX 3060 GPU, but as an entry-level gaming laptop, this is more than sufficient to play games at an enjoyable quality and framerate. Not to mention of course, that the Nvidia graphics card allows you to take advantage of framerate boosting DLSS on eligible titles.",
    "The HP Omen 15 (2021) configuration we tested fared well on our benchmarks, achieving a single-core score on Geekbench 5 of 1,435 and a multi-core score is 7,980. CineBenchR20 also came in at 4,089, so while these are far from the biggest scores we've seen, they're fantastic for something in this price range.",
    "The fans in the case do their job very well, and we found we could play games with the laptop seated on our lap with minimal discomfort. The obvious caveat is that the HP Omen 15 makes a lot of noise in return.",
    "This is hardly unique to the Omen range, with most gaming laptops struggling to find the balance between keeping internal components cool under stress and whirring the fans so loud that it feels like a jet plane is taking off in the same room, but the HP Omen 15 is especially noisy.",
    "The noise can be heard in the background of the built-in microphone and sometimes on gaming headsets, so make sure you use something like Nvidia Broadcast to help remove any background noise when communicating with teammates or chatting to friends on Discord.",
    "Bang & Olufsen audio is built into the HP Omen 15, which results in some pretty impressive bass for a gaming laptop. It's far from the best we've heard and can be a little tinny at times, but watching movies in bed or blasting tunes while cleaning, it's perfectly sufficient.",
    "Our movie test came back with an average of 5 hours 22 minutes of video playback, which is sufficient for watching a few movies while traveling, and the PCMark 10 'Home' benchmark hit 5 hours 50 minutes. Gameplay usage averages at around 4 hours, though this dips to 3 hours 25 minutes for demanding games.",
    "There are some fairly mixed reports going around regarding battery life on the HP Omen 15 (2021), but we saw these after conducting our own tests so our results are free from any outside influence. As a warning though, people have reported a more unsatisfying range of between 2-3 hours, but we couldn't replicate this ourselves after running our original battery life tests, and that could be restricted to a model using a GeForce RTX 3070 GPU.",
    "It takes about 2 hours to fully charge the laptop, but if you're concerned, keep close to a power outlet so that you don't go AFK in the middle of your Call Of Duty game.",
    "The webcam is about as good as you'd expect for one built into a gaming laptop, that is to say, it isn't very good at all. The 720p 30fps camera struggles in anything less than a bright environment, with plenty of fuzzy background noise even when used in a fairly well-lit room.",
    "It'll suffice for conference calls or remote college attendance, but if you want to start broadcasting or streaming, please consider buying a dedicated webcam for streaming instead. We can recommend both the Razer Kiyo Pro for those with cash to splash, or the trusty Logitech C920 for anyone on a budget.",
    "The built-in microphone is equally disappointing, but it's very unusual for any laptop to have good-quality webcams and microphones built-in, so this is far from unique. The microphone picks up typing on the keyboard and the audio itself is a little lackluster, but you can be understood clearly if you just need minimal functionality."
  ],
  "headers": {
    "0": "HP Omen 15 (2021): Two minute review",
    "8": "HP Omen 15 (2021): Price and availability",
    "12": "HP Omen 15 (2021): Design",
    "22": "HP Omen 15 (2021): Performance",
    "30": "HP Omen 15 (2021): Battery Life",
    "33": "HP Omen 15 (2021): Webcam",
    "36": "Don't buy if..."
  },
  "links": {
    "Box": "https://track.webgains.com/click.html?wgcampaignid=138485&wgprogramid=13045&clickref=trd-us-5837796928236087000&wgtarget=https%3A%2F%2Fwww.box.co.uk%2F",
    "HP Omen 15 (2021) available to purchase": "https://track.webgains.com/click.html?wgcampaignid=138485&wgprogramid=13045&clickref=trd-us-5606928180742956000&wgtarget=https%3A%2F%2Fwww.box.co.uk%2Fhp%2Bomen.htm",
    "Nvidia GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "gaming headset": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "USB microphone": "https://www.techradar.com/best/the-best-usb-microphones-2020-the-best-standalone-mics-you-can-buy-today",
    "Asus ROG Strix Scar 15": "https://www.techradar.com/reviews/asus-strix-scar-15-2020",
    "Razer Blade 15": "https://www.techradar.com/reviews/razer-blade-15-2020",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077-test",
    "Assassin's Creed: Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-test-nl",
    "Razer Kiyo Pro": "https://www.techradar.com/reviews/razer-kiyo-pro",
    "Logitech C920": "https://www.techradar.com/reviews/logitech-c920"
  }
}