{
  "source": "https://www.techradar.com/reviews/raidboxes",
  "title": "RAIDBOXES review",
  "category": "computing",
  "updated": "2021-06-22T19:30:30Z",
  "author": "mirza-bahic",
  "summary": "Plant a tree by hosting your WordPress website with this German provider",
  "verdict": "RAIDBOXES is a superb WordPress-oriented host capable of providing powerful server infrastructure, rapid and reliable performance, user-friendly platform, solid support and all at a reasonable charge. The only thing that left us wanting a bit more from RAIDBOXES were their self-help options.",
  "pros": [
    "Automated backups on a daily basis",
    "Customer support team is available at all hours",
    "Free Let’s Encrypt SSL certificate",
    "Free trial and free WordPress migration"
  ],
  "cons": [
    "No money-back guarantee",
    "Specialized in WordPress hosting only",
    "Knowledgebase could be optimized"
  ],
  "article": [
    "Launched in 2014, RAIDBOXES is a new kid on the block, but a kid who grew up pretty fast. Right from the start its vision was clear, and that is to provide its customers with simple WordPress hosting solutions with superb performance and first-class security. The company is based in Germany, with all of its data centers and a main office located in Münster (Germany). This made them a pretty convenient choice for businesses focused on European customer bases in particular. It came as no surprise that at a certain point they were considered number one WordPress hosting experts in Europe.",
    "It’s also worth noting that RAIDBOXES offers eco-friendly “climate positive” WordPress hosting as an option, where one tree is planted for every website you host with them.",
    "RAIDBOXES’ main site doesn’t stand out much in comparison with those of similar web hosting providers, mixing shades of bright blue with white and utilizing an all too familiar layout. Although not too interesting in its visuals, the website has definitely passed the test of user-friendliness, intuitiveness and overall functionality, and everything you need to know before getting started is just a few clicks away. In addition to English, RAIDBOXES’ site is fully translated into ten languages including German, Spanish, French, Italian, Dutch, Swedish, Portuguese, Polish, Czech and Danish language.",
    "RAIDBOXES publishes its own online magazine available in the same languages as their website. It features an abundance of articles on a broad spectrum of hosting-related topics such as psychology of color, WordPress guides, social media platforms, web design trends and so forth. The blog feels alive and up there with the current trends in the world.",
    "RAIDBOXES has established a solid presence across several social media platforms, including Facebook, Twitter, Instagram, LinkedIn and XING.",
    "RAIDBOXES wants to get you covered, no matter if you are a blogger, freelancer or you want to launch a WordPress business or open a WooCommerce webstore. At present, there are seven pre-designed WordPress plans ranging between €15 ($17.96) and €300 ($359.37) per month. Apart from this, if none of these seem to be up your alley, customers have an option to make a customized plan, which is particularly aimed at large companies and mission critical websites.",
    "At an absolute minimum, “Starter” plan will supply you with 2GB of RAM, one virtual CPU core and 5GB of SSD storage, which is expandable. What is more, you’ll get SSH (Secure Shell) with pre-installed WP-CLI & Git, free SSL certificate and backups performed every night.",
    "Although RAIDBOXES offers no money-back guarantee, there is a free trial and it is available with every plan besides the “Individual” one, which is understandable. The length of the trial depends on the plan you want to test, varying from four to fourteen days.",
    "In terms of payment methods, RAIDBOXES accepts direct debit or credit cards.",
    "Going for an optimal hosting solution with RAIDBOXES should be a simple and clear-cut experience, since all of their plans are presented in a straightforward manner and in great detail. One feature we should note at the beginning is the option of free WordPress migration. In other words, if you already have a WordPress website, it will be transferred by RAIDBOXES’ technical team within two working days.",
    "After choosing a plan, you’ll be offered to start your free trial, for which you’ll have to create an account with RAIDBOXES. First, you’ll have to provide an email address, name, last name and password. On the same page you’ll be prompted to read and study RAIDBOXES’ data privacy policy, DPA (data processing agreement) and terms and conditions. All of these could pop up in German (in our case it did), so if you’re not familiar with it, make sure to change the language on the navigation bar.",
    "After the registration process is complete, you’ll confirm which package you want and decide on all the little details about it. Although a domain name registration is not included in any of the plans, you can get one at a pretty affordable price. RAIDBOXES’ dashboard has a simple and clean design, which makes user experience rather intuitive, and managing all aspects of your account with it should be an easy task. Here you can create new “boxes” (that is, WordPress sites), transfer websites, register a new domain, or launch RAIDBOXES’ email service.",
    "Your newly created and fully-managed WordPress website should appear in a few minutes. Since you are probably using free trial (the length depends on the plan) you won’t be charged right away, but only after the trial period has expired, that is, if you want to continue using RAIDBOXES’ services.",
    "RAIDBOXES promises high-performance, which isn’t too hard to believe since they utilize NGINX servers with server-side caching, PHP 7, HTTP/2 protocol, as well as blazingly fast SSD hard disks. Anyhow, as usual, we tested the speed performance of their main website by the use of GTmetrix. The loading speed of the RAIDBOXES‘ website was above average, although we weren’t exactly blown away by the results we got. The time the website took to fully load was 2.7 seconds, which looks very good in comparison with the average of 8.2. All other core web metrics were rock solid as well, except one. The total blocking time was 295 milliseconds and according to GTmetrix’s recommendations, the result should be 150 milliseconds or less. Taking this, and everything else into account, RAIDBOXES’ main website was rated with a B (86%).",
    "Although RAIDBOXES offers no concrete promises regarding its uptime, the results we got after monitoring its main website during the two-week long testing period were pretty promising. UptimeRobot (the monitoring service we usually use) failed to record even one bit of downtime, presenting us with promising 100% of uptime.",
    "Upon entering RAIDBOXES’ website, you’ll be prompted to ask any questions you might have via their live chat feature. This option is open from 8AM to 10PM (even on weekends and holidays) and is available in English and German. They promise to respond in 5 minutes at a maximum, which was confirmed by our own experience.",
    "Besides this, you can reach them via telephone number or visit their “Help Center” if you would rather find an answer on your own. There you’ll find an awfully modest collection of articles (six of them, to be precise), albeit well-written ones. You are invited to use the search box, but considering the number of available articles there is no real point of doing so.",
    "In addition to this, RAIDBOXES’ site offers access to a “System Status” section where you can get all important updates about the state of their systems and (if need be) report any issues with RAIDBOXES.",
    "RAIDBOXES and Flywheel have raised managed WordPress hosting to the next level by creating an easy-to-use interface, providing a myriad of attractive features and backing everything up by solid customer support. However, the tiniest of Flywheel’s plans (conveniently called “Tiny”) starts at $13 per month, which makes them one of the more expensive options on the market. With RAIDBOXES, a “mini” plan is available for small-sized WordPress projects and it costs €9 ($10.80) for a month, which is just slightly cheaper.",
    "Like RAIDBOXES, Lightning Base chose managed WordPress solutions as its field of expertise. However, since Lightning Base is US-based while RAIDBOXES is based in Germany, this could be a crucial point for a number of their would-be users. Another difference is that with Lightning Base all plans come with standard 30-day money-back guarantee, while RAIDBOXES provides free trials for a period ranging from four to fourteen days.",
    "Although HostGator provides WordPress hosting with a myriad of handy perks, if you want a truly high-end fully managed WordPress, you are better off with RAIDBOXES as your host. For instance, a free migration feature with HostGator is limited to up to three sites (depending on the plan), while with RAIDBOXES it knows no limits.",
    "The same goes for Bluehost, even though it offers a whole variety of useful features with its managed WordPres plans. These include daily backups, free SSL, daily malware detection and removal, additional themes and tools powered by Jetpack, built-in SEO and more. Both Bluehost and Hostgator offer a lot, but RAIDBOXES’ dedication to all-inclusive managed WordPress solutions sets them apart and makes them the most recommendable option out of the three.",
    "RAIDBOXES is an easily recommendable WordPress hosting provider with great value for money and flexible plans that can be tailored to meet most needs. With its free trial, users can familiarize themselves with its easy-to-use interface and try everything out before making a big decision.",
    "However, those who are not too keen on managed WordPress will have to look elsewhere, perhaps by taking a look at what hosts like HostGator and Bluehost have to offer."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "18": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "RAIDBOXES": "https://raidboxes.io/en/",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "WooCommerce": "https://www.techradar.com/reviews/woocommerce",
    "Starter": "https://raidboxes.io/en/tarife/",
    "Flywheel": "https://www.techradar.com/reviews/flywheel",
    "Lightning Base": "https://www.techradar.com/reviews/lightning-base",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}