{
  "source": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
  "title": "iPhone 12 Pro Max review",
  "category": "phones",
  "updated": "2021-12-04T01:42:00Z",
  "author": "gareth-beavis",
  "summary": "Still one of the best big iPhones on the market",
  "verdict": "If you’re looking for one of the best iPhones on the market, the iPhone 12 Pro Max is still worth checking out: it’s powerful, has the longest battery life on an iPhone we tested in 2020 and the camera is top-notch. You'll need to be ready to carry the extra heft, as this is a large iPhone indeed, and the cost isn't to be sniffed at, but we're adding an extra half star for all those iPhone fans that just want the best Apple can bring – the iPhone 12 Pro Max manages to do that rather well.",
  "pros": [
    "Great screen",
    "Longer battery life",
    "Powerful camera"
  ],
  "cons": [
    "Feels almost too large",
    "The most expensive iPhone",
    "Camera not hugely better than the 12 Pro"
  ],
  "article": [
    "The iPhone 12 Pro Max was the biggest iPhone Apple had ever made when it launched and it was easily the best. It was also very expensive at $1,099 / £1,099 / AU$1,849 although it's now a touch trickier to track down as Apple no longer sells it directly.",
    "The design of the 12 Pro Max mirrors that of the other handsets in 2020's iPhone 12 family: there’s a new flat-sided frame, which looks more industrial, and is a little less comfortable to hold than last year's model. It's a whole new look that's actually a bit old, given it debuted in the iPhone 4 a decade ago, but made a comeback in recent iPad Pro models.",
    "While Apple has replaced the iPhone 12 Pro Max in its store with the newest iPhone 13 Pro Max, both phones are the same size, so they share the crown for the company's largest phone. While Apple keeps around older basic models in its lineup, it typically quietly retires the larger versions, meaning you'll be able to find the iPhone 12 Pro Max at other retailers, probably at a discount, but not directly from Apple.",
    "Given how incremental the upgrades are on the iPhone 13 Pro Max, though, we'd still recommend the iPhone 12 Pro Max as a top choice for fans of big Apple phones. The arrival of iOS 15 also adds plenty of new functionality, from improved Apple Maps to more nuanced Messages functionality to watching or listening to media with others via SharePlay.",
    "The iPhone 12 Pro Max is decked out in premium-looking, more muted colors though, and we're fans of the shiny metal rim around the edge (despite the fact that it's a real fingerprint magnet). It gives the big phone a modern and industrial look.",
    "While the iPhone 12 Pro Max is actually only a very small amount bigger than 2019's 11 Pro Max, the bezels around the OLED display have been shrunk to allow Apple to increase the screen size to 6.7 inches – and it's a compelling reason to pick up the new larger iPhone.",
    "Images are clearer and more visible on the larger display, you can see more of a web page or image in daily use – and as a movie-watching machine it's the best iPhone ever. It's one of the best displays on the market, able to render both colorful scenes and more subtle tones with ease.",
    "The headline feature on the new iPhone 12 Pro Max is the camera array: there are three cameras, all upgraded with a better image processor. While the camera block protrudes from the rear of the phone more than on recent iPhones, the main 12MP sensor has been upgraded to capture a lot more light, and enhancements have been made to the image processing too – some of the photos we took were really impressive.",
    "However, the 12 Pro Max wasn't that far ahead of the iPhone 12 Pro's camera performance in our tests, which was surprising – images were, on the whole, clearer and brighter from the 12 Pro Max, but not by a huge amount.",
    "If you're a budding movie-maker, we'd say it's definitely worth looking at the 12 Pro Max – it's packing Dolby Vision recording at 4K and 60 frames per second, so if you’re a content creator looking for a phone that can record high-quality footage, the 12 Pro Max can definitely do that.",
    "HDR will also make your movies look better, with improved brightness and color; however, it can look a little artificial, and clips will take up more storage space on your phone. It's not a feature that most should look to upgrade for.",
    "The 12 Pro Max starts at 128GB of storage, which is the bare minimum we’d expect, as the cameras will fill it up quickly – and with 5G on board you'll be able to download content faster, making it easier to fill up your phone with movies and music too.",
    "5G is the future of mobile connectivity, but it's not in itself a reason to buy the iPhone 12 Pro Max... yet. Many parts of the world still don't have 5G coverage, so many users will find this feature redundant for now. In the next few years connectivity will become much more widespread though, so buying a 5G iPhone is more about future-proofing than enjoying next-gen speeds right now, unless you live in the heart of a major city.",
    "And 5G mostly just brings faster speeds (though it’s faster than even Wi-Fi for most), so you might not feel like that's something that’s missing from your life right now.",
    "Apple has also added the innovative MagSafe tech to the iPhone 12 Pro Max, which enables you to magnetically clip chargers, cases and accessories to your new iPhone. We like this addition, and more accessories are appearing all the time right now; MagSafe will only get better as time goes on, and getting the iPhone 12 Pro Max will future-proof you as more accessories appear on the market.",
    "Along with the larger display, one of the big reasons to go for the iPhone 12 Pro Max is the battery life – it has the biggest battery of all the new iPhone 12 range thanks to having the largest chassis. We easily crested a day of use in our testing, and even on days when we really pushed the battery hard we got to 7:30pm before we needed the charger – if you've read our iPhone 12 Pro review, and have concerns about whether it'll last long enough, we advise moving up to the Max.",
    "If you want the best of all things in an Apple smartphone, the iPhone 12 Pro Max is it. The large and bright display, the enhanced camera, the longer battery life and awesome grunt inside make this a compelling smartphone. If your hands can cope with the extra heft (and your wallet with the heftier price), this is the model to go for.",
    "However, if the Pro Max feels a bit more than you need, or is beyond your budget, the iPhone 12 Pro offers a similar feature set and performance for less (although without the extended battery life) – and the difference between the cameras isn't as marked as we expected.",
    "If you're open to Android then there are also a few other top-flight phones to consider, most notably the Samsung Galaxy S21 Ultra, which at the time of writing tops our list of the best smartphones. You might also want to take a look at the OnePlus 9 Pro, which matches or beats the iPhone 12 Pro Max in many areas while coming in at a slightly lower price.",
    "The iPhone 12 Pro Max will likely be reduced in the Black Friday deals so it’s worth looking at the best iPhone Black Friday deals out there. We’ll be conducting a re-review in the future. However, we’ve updated references within our review to highlight new features that have emerged since our tests to give you a better idea of what you might be buying.",
    "After an October 13, 2020 announcement, Apple confirmed that the iPhone 12 Pro Max would be coming a few weeks after launch; while the iPhone 12 and iPhone 12 Pro were available on October 23, the company opted to release both the iPhone 12 mini and iPhone 12 Pro Max at a later date.",
    "iPhone 12 Pro Max pre-orders opened on November 6, 2020, and you're still able to buy the phone around the world.",
    "The iPhone 12 Pro Max price started at $1,099 / £1,099 / AU$1,849 for 128GB of storage, rising to $1,199 / £1,199 / AU$2,019 for 256GB, and $1,399 / £1,399 / AU$2,369 for 512GB.",
    "It's now no longer available directly from Apple, but you should still be able to find it at third-party retailers with discounts highly likely.",
    "The iPhone 12 Pro Max is big. It remains one of the biggest iPhone that Apple’s ever made, if only by a few millimeters. However, as it also has the new squared edges of the iPhone 12 and 12 Pro Max, aping the brutal, industrial design of the new iPad Pro range, it feels larger in the hand.",
    "That’s not to say this is a bad thing – if you’re not buying the 12 Pro Max because you want a massive iPhone, then you’re kind of missing the point.",
    "Those angular edges mean the phone isn't as comfortable to hold as the more rounded iPhone 11 Pro Max, the curved sides on which folded more softly into the palm.",
    "One of the key characteristics of the Pro Max is the more ‘mature’ colors it comes in – the outside is a shiny stainless steel band, and this, the front accent and the rear of the phone now come in Graphite, Gold, Silver and Pacific Blue.",
    "That shiny outer rim looks fancy, but it’s also a magnet for fingerprints – get ready to polish it a fair bit if you want to keep it looking new and premium.",
    "Given the price tag, you’d expect an expensive-looking phone, and the iPhone 12 Pro Max definitely looks the part, especially in the Gold color we reviewed.",
    "Essentially, the design of the 12 Pro Max is just a larger version of the iPhone 12 and 12 Pro, and despite the size it still fits well in the hand, and it's easy to hit the Siri / screen lock button on the left and the volume keys on the right.",
    "However, there’s one big difference: the three-camera setup on the rear of the 12 Pro Max protrudes much further than on the iPhone 12 and 12 Pro, as there’s a larger sensor underneath to pull in more light (we’ll get to whether that’s worth it in the camera section, but – spoiler alert – it’s not bad at all).",
    "This means that when you’re putting the iPhone 12 Pro Max down on a table, it really rocks from side to side if you’re tapping away on the screen – it’s almost fun to play with absentmindedly, such is the protrusion. It’s really noticeable, and will make most people think about putting a case on the iPhone to just flatten off the bump.",
    "As mentioned, this is the largest iPhone Apple has ever made, with dimensions of 160.8mm x 78.1mm x 7.4mm, and despite being thinner than 2019’s 11 Pro Max, it actually feels slightly larger in the hand, thanks to the square edges.",
    "Be ready for something that might annoy you before you buy: Apple has dropped the charging block and Earpods from the box. You’re now just getting a charging cable at purchase – and it’s USB-C to Lightning, rather than standard USB-A to Lightning cable that Apple’s been putting in boxes for years.",
    "The USB-C cable does charge the iPhone more quickly – but you’ll need to go out and buy a charging block at $19 / £19 / AU$29 from Apple to use it.",
    "It makes no sense for Apple to do this – it says it’s making this move to reduce electronic waste, as everyone has charging blocks and headphones already, but while that’s true barely anyone will have the right block to allow them to use this new cable – it would have made far more sense to do this when Apple had been supplying this charging lead for a few years.",
    "If you don't have the right block, or if you’ve never owned an iPhone before, you’ll need to factor in the cost of a new charging block on top of the already-high price tag of the 12 Pro Max.",
    "The key takeaway: if you want a huge iPhone, and all the benefits that brings, then you’ll enjoy the design of this bigger model – but you certainly won’t be able to reach all around the screen with your thumb.",
    "The iPhone 12 Pro Max has the largest display of any iPhone ever created – that in itself is a good reason to upgrade.",
    "In keeping with new technology that appeared on 2019’s 11 Pro and Pro Max, all the models in the iPhone 12 range are packing OLED displays, and especially at this size it really makes a big difference. Apple is calling this a ‘Super XDR OLED display’, and in layman's terms this translates to a clear, bright and sharp screen with excellent color reproduction.",
    "It's a real upgrade for anyone coming from the older iPhones – the display here is startlingly better, and images really pop with color and detail.",
    "Thanks to the thinner bezels around the new iPhone 12 Pro Max display the screen is able to stretch further to the edges of the device, resulting in a 6.7-inch display compared to a 6.5-inch affair on the 11 Pro Max, and it looks really impressive. That extra screen estate is really noticeable next to last year’s phone, and adds to the sense of immersion when watching movies or similar.",
    "It’s not a huge step forward in terms of brightness – this is a very similar OLED panel to the one we saw on the 11 Pro and 11 Pro Max – but it’s pin-sharp, and streamed or downloaded content looks dynamic on the larger display, with high contrast ratios making things like blockbuster action movies and nature documentaries look incredibly absorbing.",
    "Apple has added the Ceramic Shield to the front of the iPhone 12 Pro Max, as it has with others in the iPhone 12 range – this is designed to make it four times less likely to crack in the event of a drop.",
    "We didn’t test that claim during our review – partly because we don’t want to randomly see if we can smash an expensive phone just to see what happens – but Apple is also claiming the iPhone 12 range is scratch resistant, thanks to a ‘dual ion exchange’ process.",
    "That’s not something we saw in our usage. As with the iPhone 11 Pro Max in 2019, early in our testing small nicks and scratches began appearing on the device. Nothing that’s obvious in daily use, but when the screen is off you can clearly see small nicks and scuffs, despite us not putting the phone in a pocket with razor blades (or even keys and loose change).",
    "If you’re thinking you can get away without a case when upgrading, the hardiness of the iPhone 12 Pro Max has definitely been improved, but it seems it’s still going to show signs of wear and tear if you don’t keep it protected.",
    "The biggest reason to upgrade to the iPhone 12 Pro Max sits on the rear of the phone: it's the camera array. Three 12MP cameras live here – standard wide, ultra-wide and the 2.5x telephoto zoom – and they’ve been upgraded from last year too, with Night Mode available for the ultra-wide sensor as well as the main shooter.",
    "While you might think there's not much difference between the 12 Pro Max and the 12 Pro, Apple has set out to make the Pro Max the choice if you want to have the best camera experience on an iPhone.",
    "It achieves that wholly with the huge new iPhone. The sensor is bigger inside (thanks to the larger dimensions) and that results in a camera that can absorb more light and take brighter, clearer pictures, one that once again nibbles away at the reasons you might have to have a separate camera.",
    "The result is simple: if you want to take the best pictures with an iPhone, you can't look anywhere else but the 12 Pro Max.",
    "Apple has been making a big deal about 'computational photography', with the chipset inside the iPhone 12 range intelligent enough to know what it's looking at and alter the resulting image according. Deep Fusion, which debuted last year on Apple's iPhones, analyses images pixel by pixel to create the best possible result post-capture.",
    "The new Smart HDR 3 capability looks for different scenes when the photo is taken, grabbing multiple exposures and stitching them together intelligently to give you the best picture, while Night mode, which requires you to keep the phone still for a varying amount of time (depending on the conditions) can turn a dark, gloomy setting into a rich and vibrant scene.",
    "There's clearly an upgrade over the iPhone 11 Pro Max from 2019, especially in low light. Cropping in on those images taken in darker scenes shows that there's less noise, and the overall picture looks more vibrant.",
    "Smart HDR this year finds more elements of the picture to improve and enhance, and as a result we took multiple pictures that we'd be pleased to put on the wall, with or without editing – that's always a good sign.",
    "We spent hours taking pictures with the iPhone 12 Pro Max alongside the iPhone 12 Pro and the iPhone 11 Pro Max, and some things became really clear during that comparison.",
    "First, the iPhone 12 Pro Max’s larger sensor certainly lets in more light compared to the iPhone 11 Pro Max, and the vibrancy, clarity and detail in every photo is a real step forward.",
    "However, despite the Pro Max having a larger sensor than the iPhone 12 Pro, we often found little difference between the results of these two phones, which surprised us somewhat.",
    "It’s clear that the 12 Pro Max is superior to 2019's Pro Max, with nearly every image showing a clear brightness, sharpness or just overall quality upgrade – and compared to phones like the iPhone 7 Plus (which we also had to hand), the power of 2020’s camera is startling even when looking at what 2021 offers.",
    "Switching between the three cameras, from a wide to a full zoom, shows little change in the image quality between each, which is another upgrade from last year – images from the telephoto zoom look a little washed out, but the overall consistency between the three is impressive.",
    "Apple has also reduced the ultra-wide camera’s distortion at the edges of the frame, with the corners looking less ‘bendy’ on flat images. It makes you more willing to use the wider camera to still get a decent picture that you’d want to use online.",
    "However, one of the key things that Apple is talking up about Smart HDR 3, the artificially-intelligent ways it can interpret a photo and work out what’s sky, the object in the foreground and what light levels are needed, doesn't always work perfectly – while pictures of people are shown clearly against a brighter background, things like plants can remain a bit dark while the sky is well exposed.",
    "We’re still in love with the editing options on the iPhone for improving the look of your photos. The on-board filters are good in range, and after-shot editing can really add some extra punch to image – these are things we still have a lot of fun playing with.",
    "The addition of the LiDAR sensor on the iPhone 12 Pro and Pro Max is still technology that’s in its infancy on a smartphone, but it adds in the capability to take Night Mode portraits, and the effects are clear and far more vivid. The sensor is also supposed to improve the autofocus speed, but honestly we’ve never really had an issue with the speed there.",
    "We did find that fast-moving images in low-light were hard to capture - such as someone jumping - but that’s not really a surprise, even though we were hoping that the LiDAR would help out here.",
    "Talking of Night Mode, that’s one place where the iPhone 12 Pro Max really shines - the exposure is better-balanced this year. Night Mode can work for up to 30 seconds to really get dark scenes lit up when the lighting is really low and the camera is in a tripod, and at the full 30 seconds we saw a more even picture for the Pro Max, with detail nicely preserved.",
    "You might expect that if you want to use the zoom lens in night mode, that it would actually use that telephoto lens. However, we found that the iPhone is still using the lower-aperture main sensor and digitally cropping the image, rather than using the optical zoom with night mode. It’s designed to get the best picture, and the main sensor is better at absorbing light (f/1.6 over f/2.2) but the results do pack more digital noise.",
    "The other gripe we’ve got is that the selfie portrait mode, using the front-facing camera and has been around for years on the iPhone and is designed to add a background blur to your images for a more professional look, still can’t deal with stray hairs. It really ruins the effect, especially as most of us can’t have beautifully-dressed hair every second of the day. Or, well, ever.",
    "However, the rear-facing cameras deliver a much punchier performance, and are especially impressive in mixed lighting conditions, with natural skin tones and good ability to bring out low-light detail.",
    "The optical image stabilization, where the whole sensor moves to reduce judder when moving, is excellent, and combined with the new ability to record in Dolby Vision (a powerful form of HDR recording, which makes the difference between the darker and brighter elements of the video more pronounced) let’s you make some really clear and vibrant movies.",
    "The videos captured in Dolby Vision have a brighter punch about them, but it can over-expose some areas - if you prefer your movies to be a bit more natural-looking then turning it off can be a good idea (especially if you want to save some storage on your phone, as the iPhone 12 Pro Max’s ability to record movies in 4K HDR at 60 frames per second takes a lot of data.",
    "There’s no doubting that the iPhone 12 Pro Max is one of the best cameras that Apple has ever placed on one of its smartphones, but the distance between it and the standard 12 Pro isn’t as pronounced as we expected. We did get the best snaps on test from the Pro Max, with brighter and more colorful pictures appearing, but it also shows that the computational photography is a huge part of the process here - and that power is present on the 12 Pro and Pro Max in equal measure.",
    "The headline feature of the iPhone 12 Pro Max is the camera, in our opinion, but the biggest changes come in the form of 5G and MagSafe being added to the entire iPhone 12 range.",
    "We’ve already covered our findings in some depth in our iPhone 12 review and iPhone 12 Pro review, and what we’ve seen, in terms of the new features added, is they perform precisely the same on the 12 Pro Max.",
    "In the interests of saving our fingers, we won’t go into the same depth here as we did in those reviews - we’d urge you to go and check them out to get our full thoughts - but here are the key things we found using these fancy new toys on the iPhone 12 Pro Max.",
    "5G",
    "Apple was in a quandary with 5G - should it wait until the technology is mature and well-deployed around the world so most of its customers can connect to this ultra-fast, low-latency network? However, if it waited, it wouldn’t be able to have as much input on how the technology is deployed, and would have to spend more time adapting its phones to it.",
    "Or does it go earlier, put 5G on every new phone and drive it in a direction that it wants, getting people hyped for this new technology… even though it’s not something many people can use, thanks to the 5G infrastructure being a long way from widespread?",
    "It opted for the latter choice, and as a result it’s hard to say 5G is a key reason to buy the iPhone 12 Pro Max. Doing some speed tests proved that you can get some dizzying download rates, with 400Mbps clocked in and around London. Downloads of large apps and media were much more rapid than before, but it’s hard to say that we particularly struggled on 4G - it’s just faster with 5G.",
    "To do any 5G testing, we also had to travel into a bigger city- we hardly live in the countryside, but 5G hasn’t landed where everyone lives, which means for many this will be a redundant feature. Apple has worked so that when 5G does soon roll out where you live, it’ll be a good bonus and your phone will be able to connect to it, but it’s not a massive reason to upgrade just yet - plus, as you’ll see, it does have an impact on battery life.",
    "Magsafe",
    "We’re big fans of MagSafe as an innovation from Apple. If you’ve not heard about it yet, it’s a magnetic ring hidden in the rear casing of the iPhone 12 range, and you can easily clip chargers, cases and accessories onto the iPhone - opening up a realm of possibilities.",
    "In the future, imagine snap-on gaming controllers, projectors, instant photo printers - Apple adding this to its range is going to inspire a number of accessory makers to really augment the iPhone. Already we’re seeing some new cases, car vent mounts and tripod add-ons appearing, making it simple to extend the functionality of the iPhone.",
    "As MagSafe has a chip inside that can communicate with the iPhone itself, it can trust the connected device to not be acting improperly - which means things like the wireless MagSafe charger can deliver a faster wireless charge as the iPhone 12 knows it’s coming from a trusted source and won’t damage the battery.",
    "We also got the chance to try the wallet snap-on, which pops on and off the rear of your phone to give you access to your bank cards. It came off a little easily for our liking, and it’s not ideal that you have to remove it every time you want to pay for something, but it’s another example of innovation.",
    "The range of MagSafe accessories is already growing, and soon we’ll have things like PopSockets that will clip on magnetically to help you hold your iPhone more securely, and that magnet is a far better solution than a stuck-on pad that will lose stickiness over time.",
    "Like 5G, MagSafe is a technology for the future, but a future that looks like it’s appearing in the next few months, rather than years.",
    "iOS 15",
    "The iPhone 12 Pro Max launched running iOS 14 but now supports iOS 15 being the latest version of its software.",
    "We won't spend long on this, as all remotely recent iPhones have the same software, but iOS 15 built upon iOS 14 adding SharePlay, improved FaceTime features, and a new Focus mode for dividing up notifications throughout the day.",
    "Smaller updates between iOS 14 and iOS 15 include things like Apple Fitness Plus, App Tracking Transparency, new emojis, and the ProRAW camera feature that was announced at launch. In all, iOS is the best it's ever been, but you don't need to spend this much to experience it.",
    "Performance",
    "The iPhone 12 Pro Max was the most powerful iPhone we'd tested at launch, and it still performs fantastically. The iPhone 12’s A14 Bionic chipset remains fantastic when it comes to a smartphone CPU, so the 12 Pro Max is arguably still one of the most powerful.",
    "It’s a very close contest between it and the regular Pro, with both packing 6GB of RAM and an upgraded GPU, so you’d expect this device to smash every benchmark when it comes to multitasking and gaming.",
    "It’s important to look beyond the raw numbers though, because it’s how it performs day to day that matters - but most flagship smartphones are capable of handling nearly any app you throw at them these days.",
    "The blistering performance we found in the iPhone 12 Pro Max is the kind of performance one would expect from a phone at this price range, and given the range of apps that now run on the iPhone, from editing media to high-quality gaming, the ability to perform in any scenario is important - and we’ve not seen any evidence of slowdown in our testing.",
    "If you want the iPhone with the best battery life, the iPhone 12 Pro Max is the one to go for. The larger size means that it’s got extra capacity to play with, and it results in the best performance we’ve seen on the iPhone 12 range.",
    "Generally battery life is quite close to the iPhone 11 Pro Max, which we’ve been using for the last year, but a lot will depend on whether you’re using it daily in and out of 5G range, or sitting more sedately in front of a desk at home.",
    "Constant 5G connections were not actually something we could test regularly on the new iPhone, partly due to being currently in lockdown. But like on the iPhone 12 and 12 Pro, we did find some drop-off in the performance of the battery life when using 5G speeds - we saw that a 26-minute YouTube test on 5G took 7% of the battery, where the same test in 4G areas hit only 3% of the battery life.",
    "This is hardly the most scientific of tests though, and was down to not being able to spend long in a 5G spot due to the current conditions - we’ll be giving it a more thorough test soon. However, the findings that 5G is more costly to battery life seem to be appearing on the 12 Pro Max as on other iPhones.",
    "Apple will throttle your 5G speeds at times when it thinks you don’t need it, and mostly when you’re not directly using the phone in your hand (for streaming audio or updating apps, for example) in order to save battery. However, this will still display a 5G sign on the device when this is happening - so you won’t be aware when it’s being purposely slowed to save battery.",
    "The biggest issue we had on the iPhone 12 and 12 Pro, with their smaller batteries, was that they would sometimes struggle to last until the end of the day, especially when not connected to Wi-Fi. The iPhone 12 Pro Max doesn’t have that same issue, even when being used for more resource-intensive tasks.",
    "In fact, on the day we tried our hardest to run the battery down so we could conduct our charging test, we struggled to get it down that quickly. Copious amounts of Spotify, some streaming of 4K HDR content on YouTube, regular web browsing etc still took us until 7:30PM to get to absolute zero - and that was purposely hammering the battery intermittently through the day.",
    "In more regular conditions in mixed Wi-Fi and 4G areas, with some camera use, Spotify on a 90 minute run and some YouTube testing, we found that we lost 60% of the battery in a 20-hour period. That’s a nice and slow descent, and in keeping with previous Plus / Max iPhone performance we’ve seen over the years.",
    "If you do give in to the unfair push from Apple and go out and buy the 20W charger, you’ll get some speedy charging times, as our charge-up test found.",
    "We plugged it in from dead, and we saw the iPhone 12 Pro Max hit 48% battery life in 30 minutes, which is only 2% less than Apple is claiming (and ours was still connected to an Apple Watch at the same time, which would mitigate that finding). The charging speed then slowed rather dramatically, with the final 20% taking a long time to complete.",
    "Apple says that the iPhone will learn your charging habits over time and will apply the last bit of juice when it thinks the time is right, to save the health of the battery, but it means if you want to get as much power in as possible before a night out or the commute home, you’ll be a little limited initially.",
    "Overall, while the battery life of the iPhone 12 Pro Max isn’t perhaps as strong as iPhone models from previous years (and many rumors suggest that the battery inside the new Pro Max is smaller than 2019's model, in order to fit in the 5G modem) it’s definitely the best of all the new iPhones, and if that matters to you, and you can handle the size of this model, you should go for the 12 Pro Max as your next device.",
    "You might also want to check out the iPhone 12 Pro vs iPhone 11 Pro or iPhone 12 Pro vs iPhone 12 Pro Max comparison.",
    "First reviewed: November 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "20": "iPhone 12 Pro Max release date and price",
    "24": "Design",
    "39": "Display",
    "48": "Camera",
    "73": "5G, MagSafe, iOS and performance",
    "97": "Battery life",
    "109": "Don’t buy it if…"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 4": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-4-694980/review",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "MagSafe": "https://www.techradar.com/best/best-magsafe-accessories",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "best iPhone Black Friday deals": "https://www.techradar.com/black-friday/black-friday-iphone-deals-2021",
    "LiDAR sensor": "https://www.techradar.com/news/what-is-a-lidar-scanner-the-iphone-12-pros-rumored-camera-upgrade-anyway",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "App Tracking Transparency": "https://www.techradar.com/how-to/iphone-app-tracking-transparency-how-to-use-the-new-features-in-ios-145",
    "ProRAW": "https://www.techradar.com/news/what-is-apple-proraw-the-new-photo-format-coming-to-iphone-12-pro-explained",
    "iPhone 12 Pro vs iPhone 11 Pro": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-11-pro",
    "iPhone 12 Pro vs iPhone 12 Pro Max": "https://www.techradar.com/news/iphone-12-pro-vs-iphone-12-pro-max"
  }
}