{
  "source": "https://www.techradar.com/reviews/skillshare",
  "title": "SkillShare learning platform review",
  "category": "computing",
  "updated": "2021-09-15T03:27:00Z",
  "author": "jonas-p-demuro",
  "summary": "Thousands of classes available via video streaming",
  "verdict": "SkillShare offers a wide variety of online videos with many focusing on creative content. However, the limited trial and difficulty cancelling, keep it from earning a higher score.",
  "pros": [
    "Free trial",
    "Large video catalog",
    "Smartphone apps for iOS and Android"
  ],
  "cons": [
    "Limited support option",
    "Aggressive sales tactics",
    "Trial is only a single week",
    "Opaque pricing of upper plans"
  ],
  "article": [
    "SkillShare is an online learning platform and was started by Michael Karnjanaprakorn. It was founded in 2010, in New York, NY, and is dubbed “An online learning community for creators.” It claims to have over 35,000 of classes for its millions of members.",
    "SkillShare has a reasonably large course catalog of online videos. The classes focus on a diverse list of topics that fall into three categories: Create, Build and Thrive. The Create category covers a wide range of creation skills, with many subtopics that include Creative Writing, Photography, Web Development, and Film & Video. We spotted video lengths as short as twenty minutes to as long as over nine hours for an Adobe Photoshop CC – Essentials Training Course. We also like that we can see the number of learners that sign up for a class, typically in the thousands for the popular offerings.",
    "Those looking for an even more in depth treatment of the topic can access Workshops. Each of these runs for approximately a month, with examples that include “Learn Food Photography: Capture Your Culinary Creations for Instagram,” and “Create a Daily Meditation Practice: A 28-Day Challenge.”",
    "We have to admit that it was an immediate turnoff to try and sign up for “Free Classes,” and be taken to a sign up page for $13.99 monthly, or an initial offer of $9.79 monthly when we pay for the entire year, for a cost of $117.52. It would be really hard to commit at that point, as we did not even see the first class! There is a 7-day free trial, but credit card info is required so that SkillShare can start charging you after the week unless you remember to cancel it, which at least they do clearly state, although it is truly in the ‘Fine print,’ as seen above.",
    "There are also plans at SkillShare for teams, and there are three tiers offered. The lowest is the Starter Plan, which is designed for teams of two to twenty people. It features unlimited access to over 35,000 classes, capabilities that cover mobile and offline situations, and access to live classes and also monthly workshops. The cost is $139 per learner, per year, with no option given for monthly memberships, or a more limited, and less costly plan for a smaller business with a lower educational budget, for example.",
    "Moving up the tiers, there is the Enterprise Plan, which is designated for teams of over twenty learners. It has all the features of the lower tiered plan, and adds in a Customer Success Manager, which is dedicated to the account, “Custom learning paths & workshops,” and also custom reporting on a frequency of your choosing. On this more robust plan, unfortunately there is no pricing, other than “Custom,” with the need for company contact for the specifics. Additionally, some of the more desirable options, such as “Live Experiences,” and “Custom Curated Learning Paths” need to be added to the plan for an additional cost.",
    "Then there is the Revive Plan, which is designed for teams of over 51 learners, and also for an undisclosed cost. We hypothesize that this plan is less money, as it loses some of the more advanced features of the Enterprise Plan. The list of missing functions includes no dedicated customer service manager, no option to add Custom Curated Learning Paths, and no private community groups.",
    "To say that the support options for SkillShare are limited, would actually be an understatement. First of all, there is no link to a support page. There is a live chat box in the lower right hand corner that appears, but it is for the company's AI bot and there are no humans available to take your support requests. When we choose “Looking for help with my SkillShare membership,” it gives the link to an online portal to submit a request. Requests need to be in one of three categories: general questions, technical issues, and billing questions.",
    "That leaves us without a direct phone number for support, a direct email, a fax number, nor a live chat. Heck, a direct postal address is not given either! However, there is a Teacher Handbook that has multiple topics that range from “Planning Your Class,” “Producing Your Class,” and “Promoting Your Class” among others.",
    "User reviews are generally favorable for the SkillShare app, with it garnering an overall score of 4.8/5 on the Apple store, and a slightly lower, but still solid score of 4.5/5 on the Google Play store.",
    "There are multiple users on both platforms that do point out the breadth of topics, and the ease at which they learned new skills conveniently on their smartphone, and happily ranked it five stars. Some other users are less enamored with SkillShare, with reports on both sites that the videos did not play when offline, or the frustration to cast a video from the phone to a television. Still others, in fairness, a minority of reviews point out the aggressive billing tactics, and their difficulties in cancelling their accounts. In some cases, the issue is that the charges to the credit card continue even after the account is cancelled, and that there is no phone number to even contact anyone for a resolution.",
    "When it comes to online learning platforms, SkillShare certainly has an expansive range of topics. We appreciate the multiple tiers of plans both for individual and enterprise, the smartphone apps for iOS and Android, and the workshops that delve into a topic more in depth. Holding it back are the short single week only trial, the issues with offline streaming, the limited support options, and the user complaints. For those that want this content should take a look, but for the rest, be sure to shop the other options."
  ],
  "headers": {
    "1": "Features",
    "3": "Plans",
    "7": "Support",
    "9": "User reviews",
    "11": "Final verdict"
  },
  "links": {
    "SkillShare": "https://skillshare.eqcm.net/c/221109/298081/4650?subId1=trd-us-7289107587552485000&sharedId=trd-us&u=https%3A%2F%2Fwww.skillshare.com%2F",
    "online learning platform": "https://www.techradar.com/best/best-online-learning-platforms",
    "Adobe Photoshop CC": "https://www.techradar.com/reviews/adobe-photoshop-cc-2021",
    "Starter Plan": "https://skillshare.eqcm.net/c/221109/298081/4650?subId1=trd-us-4655015830403786000&sharedId=trd-us&u=https%3A%2F%2Fteams.skillshare.com%2Fpricing%2F",
    "Enterprise Plan": "https://skillshare.eqcm.net/c/221109/298081/4650?subId1=trd-us-2774571453023191000&sharedId=trd-us&u=https%3A%2F%2Fteams.skillshare.com%2Fpricing%2F",
    "Revive Plan": "https://skillshare.eqcm.net/c/221109/298081/4650?subId1=trd-us-8293539835189057000&sharedId=trd-us&u=https%3A%2F%2Fteams.skillshare.com%2Fpricing%2F",
    "live chat": "https://www.techradar.com/best/best-live-chat-software",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know"
  }
}