{
  "source": "https://www.techradar.com/reviews/oral-b-io-series-9",
  "title": "Oral-B iO Series 9 review",
  "category": "fitness",
  "updated": "2021-07-12T13:54:41Z",
  "author": "cat-ellis",
  "summary": "The smartest electric toothbrush around, if you can handle the price",
  "verdict": "The Oral-B iO Series 9 is a pleasure to use, quietly gliding across each tooth to remove tough plaque, and offering genuinely useful real-time feedback to help ensure you do as thorough a job as possible. You'll get the most out of this brush if you use Oral-B's companion app to monitor how you're cleaning each surface, but the brush itself gives you plenty of guidance if you don't have time to check your phone. This all comes at a cost, and the iO Series 9 is one of the priciest electric toothbrushes around. It has dropped in price substantially since launch though, and can help you develop better habits and technique that should serve you well for years to come.",
  "pros": [
    "Thorough cleaning",
    "Quiet, smooth motion",
    "Real-time feedback",
    "Detailed brushing reports"
  ],
  "cons": [
    "Brush and heads are expensive"
  ],
  "article": [
    "The Oral-B iO Series 9 not only gives an excellent clean, it also makes it refreshingly simple to develop better brushing habits. Feedback can be as simple or in-depth as you want.",
    "If you’re in a hurry, just watch yourself in the mirror and ensure that you maintain a steady colored light while brushing, straying into neither the blue zone (too little pressure) or red (too much). This smart pressure sensor is much more useful than one that simply tells you if you’re pressing too hard, and the way the brush head glides over your teeth makes it easy to cover each surface.",
    "Once you’re done, the brush’s color display will give you a quick heads-up in the form of a frowning, neutral or smiley face, and you can go about your day.",
    "When you want more in-depth feedback on your brushing, connecting the brush to the Oral-B Bluetooth app allows you to get real-time feedback as you move around each section of your mouth. The location detection isn’t quite perfect, but it’s impressive nonetheless, and an effective way of encouraging you to pay equal attention to each part of your mouth. If your dentist often comments that you need to focus more on your molars, it’ll be a real help.",
    "It might seem a little silly at first, but the little face on the brush is genuinely motivating, and the various awards and achievements in the app will give you the same little sense of accomplishment as hitting your Fitbit’s step goal for the day, or filling your Apple Watch’s activity rings. A little bit of positive feedback that helps reinforce good habits.",
    "The chief downside is the iO Series 9’s price; it’s one of the most expensive electric toothbrushes around. However, it’s come down a lot since its launch last year, and you may be able to pick it up for even less during deal events. If you can stomach the cost, it’s easily one of the best electric toothbrushes you can buy.",
    "The Oral-B iO Series 9 was released in 2020, and was originally priced at $300 / £500 / AU$400. That makes it easily one of the most expensive electric toothbrushes around, but it can now be found much more cheaply if you shop around.",
    "Replacement brush heads cost around $35 / £30 / AU$35 for a set of two, which is undeniably steep. You can occasionally find them for a discount on Amazon, so it’s wise to stock up if you do. The iO Series 9 isn’t compatible with heads from older Oral-B toothbrushes.",
    "The Oral-B iO Series 9 is a modern-looking electric toothbrush available in three colors: black, white, and rose quartz. It’s supplied with a magnetic charger that connects to a standard shaving socket, one brush head, and a case to hold spares. You also get a rechargeable carry case, which keeps the brush powered up while you’re away from home. This holds the brush handle, and one head.",
    "One of the iO Series 9’s best features is its color LCD display, which makes it easy to choose your preferred setting, and receive feedback after you finish brushing. While some toothbrushes over-complicate matters, the iO Series 9 is refreshingly simple, with just two buttons on the brush itself. Remove it from the charger to wake it, then use the lower button to select a mode and press the power button to start. There are seven modes to choose from, and the simple menu makes it easy to pick an appropriate one each time you’re ready to start brushing.",
    "When you set up your toothbrush, you’ll be prompted to choose a color for its light. This isn’t just a nice touch of personalization; it also has a practical use. Like most higher-end electric toothbrushes, the Oral-B iO Series 9 has a pressure sensor. However, this is much more useful than the standard red light to indicate that you’re pressing too hard; as well as detecting excessive pressure, it also detects whether you’re not pressing hard enough. Your aim is to keep the light illuminated in your chosen color as much as possible, without straying into red (too much pressure) or blue (not enough).",
    "In use, the Oral-B iO Series 9 is much quieter than an oscillating brush, and glides smoothly from one tooth to the next. Disclosing tablets revealed that we did indeed brush more effectively with the iO Series 9 than our regular oscillating toothbrush, when brushing for the same period of time. We also noticed a subjective difference; our teeth felt smoother after using the iO Series 9.",
    "The brush charges quickly (a quick charge from flat takes around three hours), and the smooth charging puck with no hard-to-clean recesses, and the brush is secured in place magnetically. It works well, but if you’re clumsy first thing in the morning, you might find yourself accidentally knocking the brush off the charger, so be careful where you place it.",
    "Using the app isn’t essential, and you get quick feedback to help improve your brushing with the brush alone. Once you’ve finished, the color display will give you a rating in the form of a smiling, ambivalent, or frowning face depending on how long you spent brushing, and how evenly you applied pressure while doing so. It’s a small thing, but we found we genuinely wanted to earn the approval of that little face.",
    "To get the most out of the iO Series 9, however, you’ll need to download the Oral-B mobile app (available for Android and iOS). Once it’s installed, you’ll be prompted to grant permission for it to access location services (so it can find your brush) and register an account. When that’s done, connecting the brush to your phone is straightforward; just turn it on when instructed during the setup process, and it will be identified automatically. There’s no need to tap in an ID number, as you do with many Bluetooth devices.",
    "With the app open, begin brushing and the app will detect which part of your mouth you’re currently cleaning, which will be highlighted on your phone’s screen. The teeth in the on-screen graphic will gradually change from blue to white, indicating that you’ve thoroughly cleaned each surface. This may take longer than the standard two minutes, depending on the effectiveness of your technique.",
    "The positioning technology isn’t absolutely perfect when it comes to identifying surfaces in deal time, but it’s accurate enough to be genuinely useful, and to help you avoid missing those spots that the dentist always points out.",
    "Once you’ve finished brushing, you’ll be asked to report whether you experienced any gum bleeding, then given a score out of 100, with feedback on how well you covered the inside, outside and chewing surfaces, and how well you managed pressure control on each surface.",
    "You can also earn Fitbit-style badges and awards for effective cleaning, and there are different oral health programs (called Dental Health Journeys) to try. Our reviewer had her braces removed last year, but can imagine the orthodontic program being particularly helpful due to the challenges of brushing around brackets and wires.",
    "The app is fun, and a good way to get a feel for how to improve your brushing, and once you’ve used it a few times to get an idea of how good brushing should feel, we recommend cleaning your teeth without watching the screen to see whether you can get good results by yourself. It’s a challenge, but one that’ll help you develop better technique that’ll set you up for life."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and release date",
    "8": "Design",
    "11": "Performance"
  },
  "links": {
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "best electric toothbrushes": "https://www.techradar.com/best/electric-toothbrushes"
  }
}