{
  "source": "https://www.techradar.com/reviews/nutribullet-blender-review",
  "title": "Nutribullet Blender review",
  "category": "appliances",
  "updated": "2021-01-18T13:17:44Z",
  "author": "emily-peck",
  "summary": "Upgrade your kitchen kit this season with the flexible and fast Nutribullet Blender",
  "verdict": "If you’re already a fan of Nutribullet’s blender technology, then you’ll be pleased to learn that the company has added a traditional jug-style Nutribullet blender to its line-up. New to Nutribullet? Then you’ll be equally impressed at how effortlessly this blender can break down ingredients, pulverising stems, seeds and skins with ease to extract maximum nutrition. The new model doesn’t come with Nutribullet’s iconic bullet cups, instead including a 1.6-litre capacity jug, allowing you to tackle large quantities in one go. High and low speed settings, alongside a pulse function, mean the Nutribullet Blender offers far more flexibility than your standard one-touch personal blender. What’s more, it can handle warm and cold liquids, too.",
  "pros": [
    "Powerful 1,000w motor",
    "Includes a traditional style jug",
    "Suitable for hot and cold ingredients"
  ],
  "cons": [
    "No bullet cups included for on-the-go",
    "No accessories or recipe book included in the box"
  ],
  "article": [
    "Well known for its wide range of powerful personal blenders, Nutribullet now adds the stylish multi-use Nutribullet Blender to its line-up.",
    "This design offers all the benefits of Nutribullet’s blade technology and powerful motor with a traditional blending jug design that can be used for hot and cold ingredients. The control panel features two speed settings and a pulse function, providing plenty of flexibility from crushing ice, breaking down nuts and creating silky smoothies, soups and delicious dips, making for a solid addition to any kitchen top.",
    "At the time of writing, the Nutribullet Blender is priced £99.99 over on the Nutribullet and Amazon websites, making it a well-priced entry point for those looking to get in on the blending action.",
    "Nutribullet’s traditional blending range also offers the Nutribullet Combo, priced £149.99, which is similar in style, but comes with three iconic bullet cups in addition to the jug blender.",
    "Compared to Nutribullet’s entry-level 600 series, the Nutribullet Blender is 400W more powerful at 1,200W, resulting in a smoother consistency when preparing hot and cold ingredients. Similar to Nutribullet’s existing personal blender designs, the Nutribullet Blender comes with a unique stainless-steel extractor blade that’s designed to pulverise ingredients to their finest form for optimal nutrition. However, what this new blender adds is volume.",
    "Sporting a curvaceous design, with a 1.6-litre jug and grey base, the Nutribullet Blender will look attractive on your kitchen work surface. Its jug comes with a lid that features a vented lid cap, which can be easily removed for adding cold (not hot) ingredients mid-blend. There’s also a tamper in the box that allows you to scrape any rogue ingredients towards the blade during a blend; we found this particularly useful for nudging spinach leaves to the bottom of the cup when making a smoothie.",
    "Suction cup feet hold the blender securely in place on the worktop, which is particularly reassuring when the blender is working at its highest speed. We found the easy-pour spout resulted in minimum spillage down the side of the jug when pouring out a smoothie.",
    "Since the Nutribullet’s jug is large, it’s easy to clean with warm soapy water – although note that it is dishwasher-safe. To clean, we simply added a few drops of washing-up liquid and warm water to the blender and ran it on the Low setting for 20 seconds. This helped to dislodge any ingredients stuck behind the blades; we then simply gave it a wash and rinse by hand thereafter to leave the jug perfectly clean.",
    "The Nutribullet Blender features three easy-to-use settings, for low- and high-speed blending, as well as pulsing. The control panel is within easy reach and is foolproof. Note that you can’t use the pulse setting if you’re liquidizing hot ingredients, so this blender is best suited for smooth soups, as opposed to chunky ones.",
    "The Nutribullet Blender’s USP is its ability to “crush ice, blitz vegetables, blend sauces, smoothies, dips and dhals”. A recipe booklet isn’t included in the box, but you can visit the Nutribullet website for recipe inspiration. Choose from detox smoothies, black-bean dips, tzatziki dressings and more.",
    "To discover the effectiveness of Nutribullet’s blade technology, we prepared two snacks in the blender. First, we made a guacamole dip using onions, tomatoes, red chilli pepper, avocado and lemon. We placed an onion in two halves into the jug, along with roughly sliced avocado and chilli, and whole cherry tomatoes. To create a textured guacamole dip we used the Pulse setting, holding it down for around 20 seconds. While the majority of ingredients were finely sliced after this period, the onion didn’t chop as well, with larger chunks becoming lodged around the blade. As such, we’d advise that you begin with onion that’s more finely chopped. Overall, however, the resulting guacamole was delicious, and super-quick to make.",
    "Our next attempt was smoothie using mango, spinach, banana with coconut water. Unlike blenders with pre-set functions, the Nutribullet Blender’s design features manual settings to provide greater control over the results. Placing all the ingredients into the jug, we set the blender running on the High setting for around 30 seconds. We used the tamper to encourage the ingredients closer to the blade – in particular, the spinach leaves that were stuck to the sides of the jug. Obviously, we suggest you do this with the blender turned off, to avoid the contents splashing out of the jug and creating a mess.",
    "In terms of noise, we measured the Nutribullet Blender at 98dB in use through the Decibel Meter app. Although this was a little out of our comfort zone for first thing in the morning, it was worth it for the impressively fast and smooth results."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design and key features",
    "8": "Performance",
    "13": "Don't buy it if..."
  },
  "links": {
    "£99.99 over on the Nutribullet and Amazon websites": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FNutriBullet-1000W-Nutrient-Extraction-Technology%2Fdp%2FB087JXNWYL%2Fref%3Dsr_1_5%3Fdchild%3D1%26keywords%3Dnutribullet%2Bblender%26qid%3D1610288712%26sr%3D8-5%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1356258477291838500-21"
  }
}