{
  "source": "https://www.techradar.com/reviews/idshield",
  "title": "IDShield review",
  "category": "computing",
  "updated": "2021-03-19T17:30:32Z",
  "author": "john-brandon",
  "summary": "The best tool for dealing with problems after they occur, with some major caveats",
  "verdict": "IDShield is a powerful and comprehensive identity theft protection app. There’s no question it has some unique capabilities, chief among them the fact that a licensed private investigator can work to restore your identity on your behalf. The app is a bit more focused on dealing with problems after they occur, however, and not monitoring and blocking problems.",
  "pros": [
    "Experts help restore your identity",
    "Low price"
  ],
  "cons": [
    "Confusing website",
    "Lacks some real-time tracking"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "Our identity in life plays a massive role in what we can accomplish. If you have a clean record, excellent credit, and no criminal background, it does provide a springboard. It’s easier to find employment, purchase a car or home, and even secure a bank loan to start a new business. The problem is that many of us are now spending more and more time online. During the coronavirus pandemic in particular, people are now working remotely and using video chat tools, communicating over Slack, and browsing websites constantly.",
    "If your identity is stolen through no fault of your own, everything can change in an instant. Banks will suddenly turn down loans, employers will see problems when they do a background check. Identity theft protection is now more important than ever.",
    "One excellent option to consider if you are the victim of identity theft, both now or sometime in the future, is IDShield. The product emphasizes fraud intervention on your behalf using licensed private investigators. You grant them the power of attorney to deal with credit agencies and restore your good name. There are several “gotchas” with this approach, namely that any identity theft protection app should focus more on preventing fraud instead of dealing with fraud after it occurs. And, a website that sometimes doesn’t quite explain the terms and features adequately can create some confusion about what the product actually does.",
    "IDShield is certainly one of the most affordable identity theft protection apps we found. The main IDShield plan costs $13.95 per month and includes $1 million of insurance protection to help restore your finances and recoup lost wages, consultations with experts, and credit monitoring through one credit bureau. The next level up from that costs $17.95 per month and monitors three credit bureaus. If you pick the family plan, the cost goes up to $26.95 for one credit bureau and $32.95 for three but protects you, a loved one, and up to 10 of your dependent children.",
    "Those fees are lower than the two most obvious competitors, Norton LifeLock (which has a confusing tiered pricing plan but costs $30 per month for the plan that includes $1 million insurance protection) and IdentityForce, which costs $17.99 for a similar plan. IDShield doesn’t mention any annual plans on their website as a way to save on per month pricing.",
    "Before describing the desktop and mobile apps, it’s important to mention the IDShield website. More than other apps you can download and start using from, say, the Windows Store without analyzing the features too much, identity theft protection really hinges on self-education. The more you know about the identity theft field and how criminals can damage your reputation, destroy your credit, and even impersonate you and commit crimes, the better.",
    "IDShield makes a valiant attempt at relaying some information, but there are several problems. For starters, the main website includes descriptions of what is available in the app, but it’s easy to miss a tiny “see more” option that explains additional features.",
    "Some of the wording is far too generic without really touching on specifics. For example, the consultation feature is described this way, leaving out any specifics: “Our IDShield Licensed Private Investigators will work for as long as it takes to restore a member’s identity to its pre-theft status to ensure that they are not held responsible for the debts created by the identity thief. By performing comprehensive restoration services, consumer reports are returned to their pre-theft status and other records are cleared of the activity created by the identity thief.”",
    "In the app itself, there’s not enough detail explaining what the features actually do. Norton LifeLock does a much better job presenting the options in a dashboard that works more like a wizard. It shows how many steps are left or how many accounts you need to configure.",
    "IDShield emphasizes your credit score too much, and some of the info that is meant to explain features ends up explaining the general concepts of credit monitoring instead. This is true in the desktop app and the mobile apps for iPhone IOS and for Android.",
    "Another interesting discovery with IDShield is that it tends to be a bit light on features, although the one strong area is the consultation with licensed investigators. Again, this is all related to what you can do after the identity theft occurs. The app does monitor credit bureaus for you and can alert you to any credit issues so you can deal with them right away and not let them become insurmountable problems (and a low credit score). However, some of the features are listed multiple times.",
    "On the IDShield website and in a feature comparison document, you’ll see the feature of “unlimited consultation” and “licensed private investigators” listed, but that’s just a different way of explaining the same thing. Another feature related to social media monitoring is also not that impressive since it’s mainly tracking whether you post illicit images, make drug references, or use foul language. It doesn’t monitor whether your account has been hacked.",
    "What is more impressive is how IDShield stays vigilant about your identity. Norton LifeLock does a better job of presenting the tools to help with protecting your identity, but IDShield does add the capability of monitoring when someone uses your address, phone, or other personally identifiable information. The app can track public court records and spot pay-day loan fraud where someone tries to take out a loan using your name and identity.",
    "One small point here is that the app does alert you when a sex offender moves into your neighborhood but doesn’t go the extra step of alerting you when a sex offender tries to steal your identity. That’s a unique feature in IdentityForce that sets it apart.",
    "IDShield has one main competitor, as do all of the identity theft protection apps: Norton LifeLock is the towering giant in the identity protection field, offering a well-designed dashboard that presents each feature clearly and walks you through all of the steps. Using that app makes it easier to see the progress you’ve made in configuring tracking and monitoring. IdentityForce also offers a few extra features including alerts about sex offenders stealing your identity.",
    "Where IDShield really shines is that you can ask experts to resolve credit and identity problems using the power of attorney. Details about what they actually do specifically are a bit scarce, and repairing credit and identity is arguably less valuable than protecting it in the first place. Yet, having a team of people working on a fraud case is helpful. IDShield also tends to cost less per month than other apps if your main goal is protecting your credit.",
    "The main point to make here is that IDShield might need to change its name. If the main claim to fame is related to working with investigators to deal with fraud cases, a better name might be IDRestore. That said, it’s a low cost app compared to the competition."
  ],
  "headers": {
    "4": "Plans and pricing",
    "6": "Interface",
    "11": "Features",
    "15": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "Identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "IDShield": "https://www.idshield.com/",
    "IDShield plan": "https://www.idshield.com/plans-and-pricing",
    "family plan": "https://www.idshield.com/plans-and-pricing",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "IdentityForce": "https://www.techradar.com/reviews/identityforce",
    "feature comparison document": "https://www.idshield.com/sites/idshield/files/files/2020-01/N_SHEET_IDS_CompChart_Web_061419.pdf"
  }
}