{
  "source": "https://www.techradar.com/reviews/canon-maxify-gx6050-3-in-1-color-inkjet-printer",
  "title": "Canon MAXIFY GX6050 3-in-1 color inkjet printer review",
  "category": "computing",
  "updated": "2021-09-07T20:06:26Z",
  "author": "jim-hill",
  "summary": "Maximum features and ink",
  "verdict": "Canon’s sturdy supertank all-in-one comes with premium features and build quality plus enough ink in the box to more than justify the high price tag.",
  "pros": [
    "Appealing design",
    "Low running cost",
    "Touchscreen interface",
    "All-round performance"
  ],
  "cons": [
    "High initial cost",
    "Grainy photo quality",
    "No fax or NFC"
  ],
  "article": [
    "Canon’s latest super tank printers don’t come cheap, but they do come with all of the features an SMB (small to medium sized business) could ask for and a whole lot of ink.",
    "The Canon MAXIFY GX6050 ships with four ink bottles in the box — enough for 6,000 mono and 14,000 colour pages. That really puts the old cartridge-based inkjets to shame and also beats most laser printers in terms of consumables cost per page. The generous amount of ink also explains the high price tag.",
    "At around £460 (about US$636, AU$859) it’s expensive for an A4 inkjet printer, but the cost is further justified by high build quality and luxury features like the touchscreen interface, a 100-sheet ADF (automatic document feed) and dual scanning. It can handle a heavy load with a quoted maximum monthly duty cycle of 45,000 pages and print on a very wide variety of media, including glossy photo paper.",
    "All-in-one printers are usually the office eyesore, but there’s something appealing about this design. The rounded off-white plastic and large windows into the ink reservoirs makes the Canon MAXIFY GX6050 look like a child’s toy. It feels very sturdy and well-built too.",
    "It’s quite large, with room for 250 sheets in the main paper tray, 100 sheets in the rear tray and another 50 sheets in the ADF.",
    "The ink tanks are large enough to hold all of the bottled ink, which means much less down-time compared to the cartridge alternative. Even the paper output tray is more substantial than usual and capable of holding 100 sheets of paper.",
    "There’s a USB Host port conveniently located at the front of the printer with the USB data cable, Ethernet cable and mains cable all plugging in at the back. The control panel with its 6.9cm touchscreen tilts so that it’s easy to operate from any angle.",
    "Being a three-in-one device means the Canon MAXIFY GX6050 can print scan and copy. If you still can’t live without a fax facility, then the slightly more expensive four-in-one Canon MAXIFY GX6070 is the one for you. The mid-range model tested here is still very well equipped with duplex scanning in addition to duplex printing. It has a decent capacity for paper and can print on almost any type of media up to A4 in size. That includes envelopes, labels, heavy paper stock weighing up to 275g/m2 and even light fabric iron-on transfers.",
    "There’s a USB Host port for walk-up printing from a flash memory drive and Wi-Fi is built in. There’s no NFC module, but it is compatible with all of the popular wireless protocols such as Apple AirPrint, Wireless Direct, Mopria and of course Canon’s own PIXMA Cloud Link. It also works with Amazon Alexa and Google Assistant.",
    "At a maximum of 600x1200 dpi, the print resolution is not as high as Canon’s photo printers, because this is primarily an office printer, though it can of course print on photo paper. The scanner resolution is higher at 1200 x 1200 dpi and the print speed of 24 ipm is quite fast when printing black and white pages in simplex mode. The duplex mode is not much slower, but things slow down to 15 ipm for colour prints.",
    "The ADF can process a stack of 100 pages copying them at a rate of around 12ipm. Thanks to the dual scan mode, you can copy both sides of the page automatically. It’s a useful trick that not every all-in-one can do. The only feature missing from our check list is NFC, but that’s unlikely to be a deal-breaker for anyone.",
    "Setting up the Canon MAXIFY GX6050 is as straight-forward as plugging it in and following the on-screen prompts. The touchscreen makes it easy to enter your Wi-Fi password, but an even quicker way to get the printer online is by downloading the iOS/Android companion app and using your smartphone to do it. The app is called Canon PRINT Inkjet/SELPHY and it provides a very intuitive way to operate the printer when scanning and printing via the cloud.",
    "Filling the ink tanks is a satisfying task that you will not need to perform again for another 14,000 colour pages because they’re large enough to hold all of the bottled ink in the box. The bottles have specially designed nozzles so you won’t spill a drop and the large viewing windows mean you can see at a glance how much ink is left in the reservoirs.",
    "To check that the nozzles are aligned and firing correctly, the Canon MAXIFY GX6050 prints out a test page for you, but it is not as thorough as other inkjets. It doesn’t then scan the test page, for instance, but relies on you to examine it.",
    "The tilting touchscreen offers quick and easy access to the printer’s many features and is easy to see from across the office. In every way, the Canon MAXIFY GX6050 is a user-friendly device.",
    "The Canon MAXIFY GX6050 passed all of our tests without any paper jams, misprints, or sheets stuck together. It prints quite quickly in black and white and quite quietly too at 49dB. Monochrome pages of text look consistently crisp and dark, even in draft mode which usually compromises quality for speed. This is probably because the black ink is applied quite liberally in high quality mode, which is great for producing solid jet black objects on the page. Our black test page did not show any of the usual horizontal lines, or greyness that you usually get. For most text-based print jobs, we think draft mode will be fine.",
    "Colour documents and photos on photo paper also appeared clean and unblemished by horizontal lines. However, photos do look grainy, even at the highest print quality. The ink is applied flawlessly, so we can only assume it’s due to the limited print resolution. Canon’s photo printers are able optimise the resolution by spraying multiple droplets over slow moving paper to achieve a resolution of 4800x2400, whereas the Canon MAXIFY GX6050 has a resolution of 600x1200.",
    "Apart from the visible dots, all of our test photos looked vibrant with a natural colour palette that was pleasing overall. Combined with the clean text documents and evenly applied block colours, we’d have to conclude that the Canon MAXIFY GX6050 performed strongly overall.",
    "There’a lot to like about the Canon MAXIFY GX6050. It is well built, easy to use, comprehensively featured and has all-round performance that’s good enough for and home office or SMB. The main attraction of course are those big refillable ink tanks and the generous amount of ink Canon has put in the box. It means you don’t need to think about buying more for a long time and when you do, you’ll be pleasantly surprised by the cost of bottled ink. Yes, it’s a high initial price for an inkjet printer, but you’ll be saving money in the long term."
  ],
  "headers": {
    "3": "Design and build",
    "7": "Features and specifications",
    "11": "Setup and operation",
    "15": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "Canon MAXIFY GX6050": "https://www.canon-europe.com/printers/maxify-gx6050/",
    "inkjet printer": "https://www.techradar.com/news/best-inkjet-printers"
  }
}