{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-book-ion-review",
  "title": "Samsung Galaxy Book Ion review",
  "category": "computing",
  "updated": "2021-06-22T12:25:03Z",
  "author": "matt-hanson",
  "summary": "We test Samsung’s new ultraportable",
  "verdict": "The Samsung Galaxy Book Ion is a nicely designed thin and light laptop that boasts an impressive amount of power, along with some genuinely unique features - though not all of them are successful. It has a stunning 1080p screen and a truly impressive battery life, but it's also very expensive, meaning it won't be for everyone.",
  "pros": [
    "Thin and light",
    "Upgradable RAM and storage",
    "Excellent battery life",
    "Bright and vibrant screen"
  ],
  "cons": [
    "Expensive",
    "Design is a bit corporate",
    "Ugly fingerprint scanner",
    "Screen only 1080p"
  ],
  "article": [
    "The Samsung Galaxy Book Ion is perhaps one of the most interesting laptops made by the company. It’s an impressively thin and light laptop that has a sturdy and premium build quality and design, but it also comes with a few features that its competitors do not.",
    "You see, the Samsung Galaxy Book Ion comes with an additional SSD and DDR4 RAM slot. While thin and light laptops from the likes of Microsoft and Apple seem to go out of their way to dissuade people from opening up their devices, Samsung actively encourages people to open up the Galaxy Book Ion and stick some more RAM or storage inside.",
    "Straight away, this makes it a more flexible and future-proof laptop than close competitors like the Apple MacBook Pro 15-inch and Dell XPS 15. The idea is that if you want to give the Samsung Galaxy Book Ion a bit of a performance boost (or add more space to store files) later on, you can do so relatively easily and cheaply.",
    "It’s a feature we’d like to see more off in thin and light premium laptops. Apple has a dreadful record for making its devices almost impossible to upgrade or fix yourself. Meanwhile, Microsoft does allow for more storage to be added to a few of its devices, like the Surface Laptop 3, but it encourages people to use a specialist vendor to do it – which can prove costly.",
    "Many thin and light laptops also sacrifice ports to keep their overall size and weight down, but thankfully, the Samsung Galaxy Book Ion comes with a decent selection, with a mix of standard USB ports and USB-C and microSD cards, again making it a more flexible laptop for creatives and professionals compared to other thin and light laptops that don’t offer much in the way of ports.",
    "The Samsung Galaxy Book Ion comes in two versions, a 13.3-inch version (the one we’re testing) and a 15.6-inch model, and both of them are very expensive, with the 13.3-inch version costing $1,199/£1,249 (around AU$1,700), and the 15.6-inch version costing $1,299/£1,299 (around AU$1,900).",
    "This means for all its impressive design and innovative features, the Samsung Galaxy Book Ion will be priced out of many people’s budgets. And, for those whose budgets can stretch to the kind of money Samsung is asking for, it means this laptop has to work hard to justify its high price tag.",
    "Design-wise, it comes in a single color – Aura Silver – and features a blue metallic strip along the back. Otherwise, the overall look of this laptop is stylish, but might be a bit too ‘business-like’ for others. Unsurprisingly (this is a Samsung device, after all), the QLED screen looks fantastic, though the 1080p resolution isn’t the sharpest these days.",
    "The keyboard is mainly comfortable to use, if a bit shallow, but we’re not too keen on the big blue fingerprint scanner. It ends up looking a little naff. Meanwhile, the touchbar can also double as a wireless charger for your phone – a pretty neat feature.",
    "Most importantly, the Samsung Galaxy Book Ion does a fine job at handling day-to-day productivity tasks. Powered by a new 10th generation Intel Core i5 processor and 8GB of RAM, Windows 10 and pretty much any application, loads and runs quickly and smoothly.",
    "However, perhaps its most impressive feature is its battery life, which easily breezed past 10 hours in both of our benchmark tests. This makes the Samsung Galaxy Book Ion an attractive laptop for people who need a device that they can use for long stretches without being able to plug in a charger. For professionals and students, it means it can last a whole work or school day and a hefty commute as well.",
    "Overall, the Samsung Galaxy Book Ion is a well-built and dependable laptop with some interesting features – not all of which are successful – and a very good battery life. The high price tag will put many people off, and the subdued design makes it feel like a laptop you can depend on – but not love.",
    "The Samsung Galaxy Book Ion comes in either a 13.3-inch version for $1,199/£1,249 (around AU$1,700), and a 15.6-inch model costing $1,299/£1,299 (around AU$1,900) in the US and UK. It seems like the Galaxy Book Ion isn’t available in Australia at the time of writing. We’re double checking with Samsung to see if (and when) it does release there.",
    "You’ll probably notice that there’s only a small price increase between 13.3inch and 15.6-inch models (just $100/£50). This is because apart from the screen sizes, the two models come with exactly the same spec – 10th generation Intel Core processors, 8GB of RAM and 512GB SSDs.",
    "That means which Samsung Galaxy Book Ion you go for will be based purely on what screen size you’re after. Going for the smaller model (which we’ve reviewed) doesn’t mean you’re missing out on performance, while going for the larger model doesn’t mean you’re going to take a big hit financially.",
    "It’s quite nice to be able to do that. The 13.3-inch model is slightly thinner and lighter, so it’s better suited to people who want more portability. Meanwhile, the larger 15.6-inch screen could be more comfortable to work on for many people.",
    "Both versions are very expensive, however, putting it in the same price brackets as the 13-inch MacBook Pro (2020), Microsoft Surface Laptop 3 (15-inch) and some models of the Dell XPS 15 (2020).",
    "These are some of the best laptops money can buy right now (the Dell XPS 15 is in fact our pick of the best laptop of 2020 at the moment), so Samsung will really need to impress with the Galaxy Book Ion.",
    "When it comes to design, Samsung has shown that it’s mastered the art of creating sleek and stylish devices, be they laptops, smartphones or TVs, and the Galaxy Book Ion doesn’t let the side down.",
    "With dimensions of 12.04 x 7.87 x 0.51 inches (305.8 x 199.9 x 12.95mm) and a weight of 2.14 pounds (0.97kg) for the smaller model, this is one of the thinnest and lightest laptops you can currently buy. It’s thinner and lighter than the Apple MacBook Air, which used to be the benchmark for ultra-thin laptops.",
    "It means this is a laptop that can easily be carried around with you without trouble, and you can hold it in one hand with ease.",
    "The 15.6-inch model is larger and heavier, as you’d probably expect, with dimensions of 14.02 x 8.98 x 0.59 (356 x 228 x 15mm) and a weight of 2.62 pounds (1.19kg).",
    "That extra bulk makes it slightly less portable than the smaller model, but it’s still not going to be too difficult to carry around. Still, if portability is one of your top priorities, you’ll want to go for the 13.3-inch model.",
    "Both models come in a single color option: Aura Silver with a blue metallic strip that runs along the hinge. It manages to look understated, but not bland. However, the silver color, along with the sharp corners, makes the Samsung Galaxy Book Ion look like it’s a business laptop, rather than something sleek and desirable, and that strait-laced design may put off as many people as it impresses.",
    "On opening up the Samsung Galaxy Book Ion, you’re greeted with a keyboard with large keys that makes typing on it relatively comfortable – though the key travel is a little shallow.",
    "One thing we didn’t like about the keyboard, however, is the large blue key next to the right-hand Shift key. This is actually the fingerprint scanner – simply rest your finger on it to unlock Windows 10. However, our problem with it is that it’s rather large and ugly. Its size also means the right-hand Shift key is smaller, and we found ourselves hitting the finger print scanner rather than the Shift key a few times while frantically typing.",
    "It’s an odd design choice, as we’ve seen laptops with smaller, less intrusive, fingerprint scanners; some are even built into the power button or track pad. However, the fingerprint scanner of the Samsung Galaxy Book Ion ends up sticking out like a sore thumb, rather ironically.",
    "It’s not like the larger size makes it more accurate, either. There were multiple instances of it not recognising a fingerprint when trying to unlock it. This is a common problem with Windows 10 laptops, we’ve found. None seem to work as well as the TouchID button on a MacBook.",
    "The trackpad, meanwhile, does the job well enough, but it would be pretty much completely unremarkable if not for a rather interesting feature – it has built-in wireless charging. That means you can place a compatible smartphone on the trackpad, and it will begin charging wirelessly.",
    "In theory it’s a pretty great – and unique – idea. Being able to easily top up your smartphone while using your laptop seems really useful.",
    "However, there are a little niggles with the implementation. You need to turn the feature on by pressing the Fn key and F11. While the feature is on, you’re unable to use the trackpad – which makes sense, as you’ll have a phone on it. However, without a touchscreen, it means you need a separate mouse if you want to still use the Samsung Galaxy Book Ion. If you don’t have one of those, then all you’ll be able to do is use the laptop to watch a film while your phone charges.",
    "Still, it’s good to see Samsung try something a bit different, and we found with the feature turned on, we were able to charge a Samsung Galaxy Note 9 by simply placing it on the trackpad, without having to move it around. We did need to take the phone out of its case, however, for it to work.",
    "One aspect of the Samsung Galaxy Book Ion’s design that’s an unequivocal success, however, is its 1080p QLED screen which looks incredibly bright and vibrant. It can go up to 600 nits in brightness in its Outdoor mode, so even in direct sunlight you can still work comfortably. It also supports HDR, and it’s one of the nicest screens we’ve seen on a laptop.",
    "Probably the only issue we have with the screen (there always seems to be a caveat with every aspect of this laptop) is the 1080p resolution. On the 13.3-inch display this is a perfectly fine resolution, though a higher resolution would lead to an even more impressive image quality. However, when stretched over 15.6-inches, the lower resolution is going to pale in comparison with laptops with similar screen sizes, but higher resolutions, such as the Apple MacBook Pro and Dell XPS 15.",
    "When it comes to ports, the Samsung Galaxy Book Ion offers a good selection despite its thin design: you get two full-size USB 3.0 ports, a standard HDMI port, audio jack and Thunderbolt 3 USB-C port. It also comes with a microSD card reader. It’s good to see a thin and light with this kind or array of ports – all too often svelte laptops sacrifice ports in order to keep their size down.",
    "There’s also a power port for its proprietary charger. Having a thin and light laptop in 2020 using a power charger that can’t be used with other laptops feels a little archaic when even Apple allows its MacBooks to be charged by another laptop’s USB-C charger.",
    "The good news is that you can plug a USB-C charger into the USB-C port of the Samsung Galaxy Book Ion to charge it. However, you do get a pop-up message warning that even plugged in this way, the laptop could lose battery if it uses up too much power.",
    "So, it should be fine for topping up the battery if you’re caught without the real charger, but it may not be enough to keep the laptop charged while you work on it.",
    "Another interesting aspect of the Samsung Galaxy Book Ion’s design is something you’ll not see. It comes with a spare RAM and SSD slots, which allows you to add additional memory or storage, which is a nice feature that allows you to upgrade the laptop without too much expense. However, the process of opening up the Galaxy Book Ion to access these additional slots can be fiddly, and not for the faint-hearted.",
    "With a 10th generation Intel Core i5-10210U processor and 8GB of DDR4 memory (along with a 512GB NVMe SSD), you’d expect the Samsung Galaxy Book Ion to be a decent performer, and that’s pretty much true. In our time with the laptop, it handled day-to-day tasks with ease. Windows 10 boots up fast, and feels snappy and responsive when in use.",
    "Even with several different apps open at once, the Samsung Galaxy Book Ion kept pace without any issues, so for a productivity/business laptop, it does an excellent job. Intel’s 10th gen Core i5 does a lot of heavy lifting here, and it results in a laptop that performs very well considering its thin and light design.",
    "The fact that you can add more RAM later on means this is more future-proof than other thin and lights – though as we mentioned, the 8GB of DDR4 it comes with is perfectly fine for most tasks.",
    "However, the lack of a discrete GPU means this won’t be a laptop you’d want to use for gaming or graphic-intensive creative work. But that’s not what this laptop was designed for.",
    "It’d be remiss of us to not mention the quality of the screen here again. It really is a looker, and if you’re doing a spot of photo editing, or watching the latest shows and movies, then you’re going to be pretty impressed – though that 1080p resolution means 4K entertainment is out of the question.",
    "Throughout our time with the Samsung Galaxy Book Ion, it also kept impressively quiet – a testament to the thermal design of the laptop and the 10th gen processor inside.",
    "Intel’s 10th generation processors are more power efficient than their processors, and not only does that help keep laptops powered by them, like the Samsung Galaxy Book Ion, quiet (they produce less heat, so there’s less need for the fans to kick in), it also helps improve battery lives as well.",
    "So, in our tests, we were impressed by the long battery life. The Samsung Galaxy Book Ion lasted a very impressive 12 hours and 23 minutes in our battery life benchmark test, which runs a looped 1080p video until the battery dies.",
    "While watching videos isn’t the most demanding of tasks, it means the Samsung Galaxy Book Ion can easily last many long-haul flights on a single charge.",
    "In the PC Mark 10 battery life test, which replicates more intensive workloads, such as web browsing and video calling, the Samsung Galaxy Book Ion still managed a very good 10 hours and 56 minutes. So, essentially, the Samsung Galaxy Book Ion will last an entire work (or school) day, and a commute, without needing a charge.",
    "It’s impressive stuff.",
    "When it comes to software, the Samsung Galaxy Book Ion comes with Windows 10 Home installed. Also, as anyone who has owned a Samsung device, such as its smartphones, you’ll be unsurprised to learn that a number of Samsung’s own apps are also preinstalled.",
    "Like on its smartphones, these often replicate existing apps – so you get Samsung Notes, for example, which is essentially a mix between Note Pad and Google Keep.",
    "If you use these apps on your Samsung phone, then you may be pleased to see them here as well. If not, then they are simply apps that you’ll rarely use, and end up taking up space on the hard drive and cluttering the Start menu. Plus, even the biggest Samsung fan will probably find little use for apps such as Samsung Flow or Live Message.",
    "There are also a few maintenance tools like Samsung PC Cleaner which helps you find memory and storage-hogging applications, which does essentially the same job as the built-in Disk Clean-up tool of Windows 10, but it has a more user-friendly interface.",
    "As for the unique features of the Samsung Galaxy Book Ion, such as the wireless charging ability, we’ve covered that elsewhere. They are nice ideas, but they don’t always work smoothly."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Price and availability",
    "18": "Design",
    "39": "Performance",
    "45": "Battery life",
    "50": "Software and features",
    "55": "Don't buy it if..."
  },
  "links": {
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "Surface Laptop 3": "https://www.techradar.com/reviews/microsoft-surface-laptop-3-15-inch",
    "Microsoft Surface Laptop 3 (15-inch)": "https://www.techradar.com/reviews/microsoft-surface-laptop-3-15-inch",
    "Dell XPS 15 (2020)": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "Apple MacBook Air": "https://www.techradar.com/reviews/macbook-air-2020",
    "Windows 10 laptops": "https://www.techradar.com/news/best-windows-laptop",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}