{
  "source": "https://www.techradar.com/reviews/oppo-a54-5g",
  "title": "Oppo A54 5G review",
  "category": "phones",
  "updated": "2021-06-25T13:56:51Z",
  "author": "jennifer-allen",
  "summary": "Well priced and familiarly competent",
  "verdict": "The Oppo A54 5G won't blow your mind, but it's a cheap way to enjoy 5G while still offering a good camera for the price and a decent screen.",
  "pros": [
    "5G support",
    "90Hz display",
    "Decent main camera"
  ],
  "cons": [
    "Internal storage a bit small",
    "Weak secondary cameras",
    "Only one speaker"
  ],
  "article": [
    "Oppo is carving out a good niche in being a reliable Android phone manufacturer for those on a budget. The Oppo A54 5G continues that trend, offering a range of features (including 5G support) at an affordable price so that more of us can enjoy the benefits of things like 5G, a 90Hz screen, and a decent primary camera for less.",
    "There are concessions, of course. The Oppo A54 5G looks like most of the other Oppo phones out there, from the Oppo A53 to the Oppo Find X3 Neo - fine yet not exactly exciting - and two of the four rear cameras are pretty weak.",
    "However, that's understandable given the Oppo A54 5G is only $250 / £219 / AU$400, which makes it a good value way of enjoying a 5G phone that's reasonably competent. While this end of the market is a little more competitive than it used to be, we can't see anyone being disappointed with the Oppo A54 5G at this price.",
    "The phone is available in a choice of two variants - Fluid Black or Fantastic Purple. Move either color scheme slightly in the light and you'll see the color changes a little. Honestly, it's a bit of a gimmick, but a likeable one that distracts you from the otherwise unremarkable plastic build with a matte finish.",
    "Smooth and comfy to hold in your hand, the Oppo A54 5G has some well-placed buttons. To the left-hand side are the volume controls, while the right side offers the power/unlock button, which also doubles as a fingerprint sensor. Even with our small hands, it feels comfortable in our grasp. If you're used to the fingerprint sensor being on the back it may take some adjustment, but you'll appreciate having a cleaner phone back than usual.",
    "The screen is suitably unencumbered and looks great. The 16MP selfie camera is out of the way in the top left corner, and there's plenty of viewing space here with the 6.5-inch display offering a resolution of 1080 x 2400 and the all-important 90Hz refresh rate. Bright and vibrant, it didn't have any issues being clear in bright sunshine either.",
    "On the back, the only things that stand out are the camera lenses, as there's no fingerprint sensor here. They look suitably noticeable and stick out a bit but that's hardly surprising.",
    "When it comes to how well they perform, well, it depends on what your plans are. The 48MP main camera is fairly competent and we had some good results when it came to picking up details, as well as zooming in, despite the lack of optical zoom.",
    "On the other hand, the other lenses aren't so great and you shouldn't expect wonders here. They're not terrible for the price but it's wise to temper expectations and stick with the main camera. As a general all-purpose camera, the Oppo A54 5G is more than respectable enough, and the snappers allow for face unlock too.",
    "As is customary at this kind of price, there's no wireless charging functionality here, so you're limited to USB-C. We found the phone lasted over a day's regular use without any difficulty, which is pretty much exactly what you could want from a daily phone. Stretching it further still is definitely possible, but obviously your mileage will vary depending on how you use it.",
    "Performance-wise, the Oppo A54 5G is decent enough. Like the Moto G50, it's powered by the relatively new Snapdragon 480 5G chipset, but it's held back a little by its 4GB of RAM, which means the likes of high-end games will take some time to load, though once they do they perform well enough.",
    "That's what works well for the Oppo A54 5G. It knows its lane and sticks to it. This isn't a surprising hidden gem at the price but nor is it a waste of money. Instead, it's a safe bet that will provide you with good service for a while to come, right down to its future-proofing 5G support.",
    "The Oppo A54 5G is available for $250 / £219 / AU$400 with a choice of color schemes - Fluid Black or Fantastic Purple. It's available from all the regular third-party retailers as well as directly from Oppo and via selected networks.",
    "It's too early to say whether we'll see discounts, but we suspect one of these models will end up more popular than the other leading to some price cuts.",
    "The Oppo A54 5G feels good in your hand even if its plastic finish betrays the fact that this is a budget 5G phone through and through. It'll still show up every fingerprint going but we're starting to accept that this is just the price you pay for a nice finish - and the finish is nice, shifting color as it does under different light.",
    "The front display is only punctuated by a small punch-hole for the selfie camera, placed tactfully in the top left corner, while the fingerprint sensor is placed on the power button on the right hand side. That might not be as good as a fingerprint sensor embedded under the display, but it's a neater touch than sticking it on the back of the phone.",
    "Instead, on the back, all you have to see is the rear camera array. It certainly sticks out but that's the nature of the beast and no worse than any other phone. Like with all Oppo phones, there's also the Oppo logo on the back, which isn't exactly stylish but it's workable.",
    "On the bottom there's a headphone jack and a measly one speaker. Stick to using headphones here rather than relying on the phone's speaker.",
    "The dimensions of the phone are 162.9 x 74.7 x 8.4mm, with the Oppo A54 5G weighing 190g. It's not a small phone but its design means it feels easy enough to hold. It's worth it for the screen which we'll get into shortly.",
    "As is seemingly customary for budget Oppo phones, there's no water or dust resistance here. So if you have an active (or clumsy) lifestyle this might not be the phone for you, but it's reasonably robust in less volatile situations.",
    "The Oppo A54 5G's display is bright and clear, even in iffy weather conditions and lighting. With a 6.5-inch edge-to-edge display, it's ideal for watching your favorite streaming shows on the move, with the 1080 x 2400 resolution keeping things fairly sharp.",
    "A 90Hz or higher refresh rate is always something we like to see in new phones and it certainly makes things look a teensy bit smoother than a lesser refresh rate provides. Sure, a 60Hz refresh rate probably wouldn't be a deal-breaker, but at this price it's nice to have something to boast about.",
    "We didn't spot any noticeable lag while playing a game and watching videos, and even in bright weather we didn't feel like we were suffering.",
    "Another nod to Oppo sticking to the same format with all its phones is the Oppo A54 5G's placement of the selfie camera. As is the company's way, it's in a punch-hole in the top left corner, neatly out of the way and far from a distraction.",
    "The Oppo A54 5G has a quad-lens camera setup, with its main camera offering a resolution of 48MP and a digital zoom of up to 5x. That's the phone's greatest strength when it comes to photography.",
    "Elsewhere there's an 8MP ultra-wide camera, a 2MP macro camera, and a 2MP depth camera. While the ultra-wide camera isn't bad, the other two are fairly weak and not really worth your time.",
    "There's also a 16MP selfie camera on the front which does the job well enough for selfies and video calls, plus both main and selfie camera provide video at up to 1080p at 30fps.",
    "Simply put, the Oppo A54 5G is ideally suited for point and shoot photography. We headed to our local marina for a big photography session and the main camera did a good job of picking up the definition of the water.",
    "However, switch to the ultra-wide lens and some of that definition is lost. Zoom too far in and the definition was also lost. It's all a balancing act here but at least photos always looked suitably colorful and vibrant, if not as crystal clear as we might like in places.",
    "Digital zoom at 2x isn't bad at all although not perfect, but give 5x zoom a miss. It's hardly surprising but it loses a lot of definition and reminds you why optical zoom is king (and that you'll pay for such a privilege).",
    "Low light photos are similarly mixed. The Oppo A54 5G's night mode isn't bad at picking up images but it sometimes focuses on the wrong parts of the shot, meaning your photo doesn't always look as good as you'd like it to be. If you're snapping for the sake of memories and social media, this probably won't be a big deal though.",
    "Like other Oppo phones, the Oppo A54 5G has plenty of software options including filters and an AI scene enhancement mode which can help matters. The latter's performance very much depends on the scenery you're snapping but it's fun to experiment with.",
    "Powered by the relatively new Snapdragon 480 5G, the Oppo A54 5G has a fast enough chipset to have a bit of oomph in this price range but it's let down somewhat by 4GB of RAM.",
    "That means it's not great at multitasking and it can take time for heavy duty games to load (like Call of Duty Mobile). But once it catches up, there's no real issue here.",
    "In our Geekbench 5 tests, the smartphone achieved a single-core score of 524 and a multi-core score of 1,664. That's not speedy by any means but you won't notice drastic slowdown moving between apps.",
    "The Oppo A54 5G comes with Android 11 overlaid with Oppo's own ColorOS, but it's far from bloated. The only non-standard pre-installed app here is TikTok, so it's ideal if you prefer a streamlined experience that you can customize yourself.",
    "At 64GB, storage is a little low for this price but at least you can expand it via the microSD card slot.",
    "The Oppo A54 5G has a decent sized battery of 5,000mAh. That means it easily lasts just over a day even with fairly heavy use. However, at just 10W charging can be a bit slow, with a full charge taking about 2 hours to complete. There's no fast charging support here and it shows.",
    "There's also no wireless charging support although that's less important at this price, but we do wish the Oppo A54 5G could charge a little faster. On the plus side, adjust the Android software battery saving modes accordingly, and you shouldn't need to recharge so often that it drives you insane.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Oppo A54 5G price and availability",
    "14": "Design",
    "20": "Display",
    "24": "Camera",
    "32": "Performance and specs",
    "37": "Battery life",
    "39": "Don't buy it if..."
  },
  "links": {
    "Oppo A53": "https://www.techradar.com/reviews/oppo-a53",
    "Oppo Find X3 Neo": "https://www.techradar.com/reviews/oppo-find-x3-neo-review",
    "Moto G50": "https://www.techradar.com/reviews/moto-g50"
  }
}