{
  "source": "https://www.techradar.com/reviews/lenovo-legion-7i-2020",
  "title": "Lenovo Legion 7i (2020) review",
  "category": "computing",
  "updated": "2021-04-13T14:12:45.641Z",
  "author": "jess-weatherbed",
  "summary": "A perfect machine for work and play",
  "verdict": "The Lenovo Legion 7i proves that you don't need an RTX 3000 series GPU to pull some punches. With its sleek, well-made chassis and plentiful features, this gaming laptop can sit at the table with machines packing beefier components and still keep pace.",
  "pros": [
    "144Hz display, 240Hz models available",
    "Solid chassis and great build quality",
    "Quiet fans that keep their cool"
  ],
  "cons": [
    "Some may find the design a little bland",
    "Mediocre battery life"
  ],
  "article": [
    "The Lenovo Legion 7i is a fantastic gaming laptop that blends a professional aluminum design with some seriously impressive gaming performance. The device wouldn't look out of place amongst business-orientated machines like the HP Elite Dragonfly or the MacBook Air. This could be an issue for anyone looking for something with the typical 'gamer' aesthetic, and there are certainly quirkier-looking machines available for a similar price – though we wouldn't discount the Legion 7i on its appearance. It's also worth mentioning that it rocks the brightest RGB lighting we've seen on a laptop for some time. Turning this off will certainly keep up a more business-like appearance should you need it. While Lenovo isn't quite unanimously associated with gaming hardware in the way Alienware is, the Legion range of laptops, desktop computers and peripherals has actually done very well for itself against more notable rivals like the Razer Blade 15 and the Asus ROG Zephyrus M15.",
    "There's been a plethora of laptops released with the latest Nvidia GeForce RTX 3000 series mobile GPUs in recent months, but that doesn't mean the 2080 Super is any less capable of providing knockout performance. Coupled with a 10th gen intel i7-10875H, our review model handled just about every task we forced it through, from several chrome tabs and multitasking apps, to playing demanding AAA titles and first-person shooters with a silky smooth framerate. The configuration we tested will cost around $2,450 / £1,780 (about AU$3,200), but there's a selection of different specifications to choose from if you're fussy about personally optimizing for the best gaming experience. It was satisfyingly quiet and cool when playing demanding titles too, so if noise is a concern this is more suitable than many other laptops we've tested. In all, don't overlook this because just because the new RTX 3000 series mobile GPUs are available – the Lenovo Legion 7i still managed to impress us despite the older hardware, and would be a fantastic choice for anyone looking to buy a new gaming laptop.",
    "The configuration we tested retails for around $2,450 / £1,780 (about AU$3,200), which places it firmly in the 'expensive' category for gaming laptops regardless of budget, though we've certainly seen bigger pricetags. Despite the cost, we don't think the Legion 7i is overpriced for what you get, so if you're looking to purchase one it'll be money well spent. For that, you're getting Nvidia GeForce RTX 2080 Super MaxQ graphics and an Intel Core i7-10875H processor, a combination that is more than capable of handling demanding games and programs without fuss. This configuration also had 16GB of RAM, a 1TB SSD and a 144Hz display, though some models come with a 240Hz if competitive titles are your focus. There are also different variants available that can cater to your needs, such as a lower powered i5-10300H, GTX 1660 Ti version for $1,550 (around £1,150 / AU$2,050) with a teeny 256GB SSD, or a beefed up i9-10980HK with 32GB of RAM for $3,200 (around £2,350 / AU$4,200). Versions available will vary by region, but there appears to be plenty of selection globally so you likely won't have an issue finding a spec that matches your lifestyle or wallet. It can get a little confusing with the amount of choice available though, so make sure you read the product specifications on the listing carefully to avoid disappointment.",
    "The Legion 7i follows the popular current trend of creating 'hybrid' gaming laptops that tone down the traditional aesthetic in favor of something that could pass as a business device if required. As many working professionals may choose to use a laptop over a desktop, it makes sense to appeal to a market that doesn't want to shell out the cash for two separate machines. The slate gray aluminum chassis is exceedingly modern, a classy exterior that wouldn't look out of place on a high-end ultrabook. That is, of course, if you don't look too hard at the huge vents across the sides and rear, and the glaringly bright RGB lights that shine through them. Seriously, these are some of the brightest lights we've seen on a gaming laptop for some time, so if you're into that then you can't go wrong with this. The lights also backlight the keyboard and shine through the 'Y' of the Legion emblem on the back of the display.",
    "The light effects can thankfully be turned off, or at least tastefully altered in the pre-installed Legion Vantage software, so if you're not wanting to host a small disco while you're at work this genuinely does look like a great professional device when it needs to. The 15.6-inch display is 1080p resolution with extremely slim bezels, aiding in the modern aesthetic of the device. There's a slight notch located at the top that contains a 720p webcam, which, honestly is a decent webcam considering this is a gaming-focused laptop. We doubt you'd want to use it as your primary streaming camera, but it's more than suitable for video calls. There's even a tasteful built-in privacy cover if you're worried about that sort of thing. The touchpad is pleasant to use should you need it, and thankfully very responsive so while we're hoping you won't be using it to try and game with, any daily tasks can be completed without a mouse or frustration. It's positioning is slightly to the left of normal laptops though, and we did find that our palm would graze the surface when trying to use the 'WASD' in games, so we would recommend turning it off in favor of using a mouse while actually playing anything.",
    "The aforementioned display is also available in either 144Hz or 240Hz options, which won't make a difference to anyone who isn't on the higher ranking end of competitive games, but it's certainly worth mentioning to stop anyone dropping extra cash on a feature they won't need. 144Hz is perfectly fine for everything outside of games like Fortnite or Apex Legends, and the jump to 240Hz won't be noticeable for most even if you do play multiplayer FPS. The keyboard is decent – it won't be blowing anyone's mind, but it's responsive and reasonable tactile. It's a shame that a mechanical keyboard couldn't have been included, but it stands to reason that the 'hybrid' style of the Legion 7i would be ruined if you had to fill in spreadsheets in an office while sounding like a Gatling gun. A bonus to buying a gaming laptop for use at work is that they rarely have the same aversion to ports that many modern ultrabooks do. You're getting a USB-C port with Thunderbolt 3 support and a standard headphone jack located on the left, while the right side includes one USB 3.1 Type-A port. On the rear of the laptop there are two more USB 3.1 ports, an HDMI connection, an Ethernet jack, and the power connection.All of the rear connections are clearly labeled on the top, so you can lower the screen slightly and plug in without turning the device around, a nice touch for anyone who fumbles with cables.",
    "The Lenovo Legion 7i might look well suited to an office, but it's an absolute beast of a gaming laptop – business in the streets and AAA titles with smooth fps in the sheets if you will. It handled just about every game we threw at it without complaint, delivering great frame rates on most AAA titles even when whacxked up to full graphical settings. Something we noted during testing is that it ran a lot cooler than many other gaming laptops we've been testing recently, and when the fans kicked in it didn't sound like a small jet was taking off on the desk. The underside was even cool enough to rest the device on your lap should you need to, but do bear in mind that any gaming laptop will run hotter than standard machines. Despite the Max-Q graphics being a watered down version of the standard RTX 2080 Super mobile GPU, the Legion 7i actually performed better than some RTX 3000 series laptops in our benchmarking results, achieving a commendable 65 fps running Metro Exodux on high and 71 fps on Total War: Three Kingdoms.",
    "We also used it to play a few FPS titles such as Valorant and Apex legends, and while the performance certainly couldn't make us better at the game, it did provide the best environment possible with 200+ frames per second achieved even with the graphics on high at 1080p. If you wanted to have a play around with various performance modes then the preinstalled Lenovo Vantage software we mentioned earlier also allows for quick switching between optimizations, as well as some overclocking potential. This would be a good choice for creatives who don't want to splurge on both a gaming laptop and a workstation of some kind, with the RTX 2080 Super GPU being more than enough to power most Adobe apps and other various programs for video editing, 3D rendering and more. That isn't to say it's the best option available, as workstation devices exist for a good reason, but if you're constricted by budget then the Legion 7i should see you through just fine.",
    "If you've used gaming laptops before then you'll already have the bar set rather low, but for anyone who isn't familiar with the power draw required by these devices – prepare to have your expectations lowered. The Legion 7i managed three hours and 11 minutes on the PCMark battery test, with the TechRadar looped movie test coming in at two hours and 16 minutes. In fact, most of the games we tried out barely made it to the 90 minutes mark, so if you're wanting a device that you can use to play games remotely then this probably isn't it. We've certainly seen worse battery life results when reviewing gaming-orientated laptops, but this feels lackluster all the same. If you need something professional looking to play games on short train journeys then this is still an option, especially as devices with larger batteries tend to adopt the chunky 'angry gamer' look, but you'd be lucky to make it through a full match of many competitive titles."
  ],
  "headers": {
    "0": "Two-minute review",
    "2": "Price and availability",
    "3": "Design",
    "6": "Performance",
    "8": "Battery life",
    "9": "Don't buy it if..."
  },
  "links": {
    "HP Elite Dragonfly": "https://www.techradar.com/reviews/hp-elite-dragonfly",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Razer Blade 15": "https://www.techradar.com/reviews/razer-blade-15-2020",
    "Asus ROG Zephyrus M15": "https://www.techradar.com/reviews/asus-rog-zephyrus-m15-gu502",
    "Nvidia GeForce RTX 3000": "https://www.techradar.com/news/the-new-nvidia-rtx-mobile-gpus-are-here-and-we-put-them-to-the-test",
    "Nvidia GeForce RTX 2080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Max-Q graphics": "https://www.techradar.com/news/nvidia-unveils-max-q-for-thinner-and-more-powerful-gaming-laptops",
    "RTX 2080 Super mobile GPU": "https://www.techradar.com/news/nvidia-geforce-rtx-super-mobile-gpus-are-here-to-provide-superpowered-gaming-laptops",
    "Valorant": "https://www.techradar.com/how-to/how-to-get-a-valorant-beta-key",
    "Apex legends": "https://www.techradar.com/reviews/apex-legends-review"
  }
}