{
  "source": "https://www.techradar.com/reviews/minisforum-u850-mini-pc-workstation",
  "title": "Minisforum U850 mini PC workstation review",
  "category": "computing",
  "updated": "2021-03-10T05:39:37Z",
  "author": "desire-athow",
  "summary": "A tiny powerhouse that packs a very substantial punch and a 2.5G LAN port",
  "verdict": "The Minisforum U850 surprised us with that extra 2.5G LAN port and an assortment of unexpected features. That said, it is by no means a bad product but there are faster products available for the same price or cheaper from Minisforum, with the exact feature set.",
  "pros": [
    "Windows 10 Pro",
    "Extra 2.5G LAN port",
    "Wi-Fi 6",
    "Up to 64GB RAM",
    "Toolless cover",
    "Space for two 2.5-inch SATA storage devices",
    "Two year warranty"
  ],
  "cons": [
    "No card reader",
    "No Thunderbolt port",
    "Slower than the cheaper U820 or the X400"
  ],
  "article": [
    "Mini computers have witnessed a bit of a revival during the pandemic as holed up households discovered the benefit of having a small computer that often costs less than a laptop, is far more powerful and can be hooked up to the lounge TV for gaming and video conferencing. The Minisforum U850 is a step above your usual mini PC in that it comes with a number of work-friendly features that put it squarely in the business PC/workstation category.",
    "The U850 costs $649 direct from Minisforum in the tested configuration (Core i5-10210U, 16GB RAM, 512GB SSD). Save $60 by going for the older but paradoxically faster Core i5-8259U and another $40 by halving the onboard storage capacity. Other Minisforum mini PCs we’ve tested include the Elite H31g with a discrete GPU and the S41 stick PC.",
    "The Minisforum is the first toolless mini PC we’ve tested. The top cover can be removed to offer easy access to the internal components; this is done - within seconds - by pressing its two corners. An empty expansion bay that can house two 2.5-inch SATA devices is immediately into view, with a wireless radio card, two memory modules and an M.2 SSD drive further inside the chassis.",
    "Otherwise, it sports the usual looks of a pint-sized workstation computer. Plenty of vents and rubber feet to help air circulation, a mix of plastic and metal for cost, durability and power dissipation and above all, the usual 5/5/2.5-inch configuration (127 × 127 × 53.1mm).",
    "As for ports and connectors, there’s plenty of them in the front and at the back: there’s no card readers or Thunderbolt 3 ports, something we’d expect in this price range. Otherwise, it’s pretty much spot on: five USB ports (including one Type-C), a Type-C power connector (no data), a full size DisplayPort, HDMI 2.0, one audio connector, one reset button and one microphone plus two Ethernet ports (one Realtek-powered Gigabit, one 2.5G from Intel).",
    "You will be able to run three 4K monitors natively and Minisforum bundled a 65W brick power adaptor with a Type-C connector, two cables and a VESA mounting bracket.",
    "The U850 comes with a 15W processor, the Intel Core i5-10210U, which is usually found in laptops but thanks to economies of scale, is a common component in desktop machines as well. It has four physical cores, eight threads and integrates an Intel UHD graphics subsystem",
    "Minisforum pairs it with two 8GB Kingston DDR4 memory modules to benefit from a performance boost thanks to the dual-channel configuration. The company has confirmed that the device will take two 32GB RAM modules to offer 64GB system memory. There’s also a single M.2 2280 512GB Kingston PCIe x3 SSD plus an Intel AX200 WiFi 6 card with Bluetooth 5.1. All in all, a highly integrated, tightly assembled product.",
    "Outside of edge cases, the Minisforum U850 will be great for most tasks that do not require a lot of grunt power. The combination of plenty of memory, decent compute capabilities and a fast storage subsystem produced a capable device that will be equally at ease in an office environment or elsewhere. Its fan does kick in, albeit not in a very dramatic way, to effectively cool down the system.",
    "Note that the U850 comes with a two year warranty and Windows 10 Pro, which sort of indicates the sort of audience it is gunning for. Minisforum has also confirmed that the device is compatible with Ubuntu for those looking for a more open operating system.",
    "Let’s start with the most obvious one: the U820 is a better choice than the U850. The 8259U that powers the former will be faster, in most use cases, than the 10201U because it can remain at higher frequencies thanks to its higher power envelope (28W vs 15W). Its Iris graphics subsystem is also faster than the standard UHD graphics and that’s not even accounting for the $60 difference in favor of the U820.",
    "Then there’s this X400, a monstrous workstation that comes with an AMD Ryzen 3 Pro 4350G, a quad core behemoth that obliterates everything in that price range. It lacks the extras the U850 comes with but for anyone looking pure unadulterated firepower without the bells, this is probably a better buy at $649.",
    "Looking outside of the Minisforum portfolio, there’s plenty of capable rivals if you can put aside the four obvious advantages the U850 offers: space for two extra SATA storage components, two year warranty, an extra 2.5G LAN port and WIndows 10 Pro.",
    "The TBao MN27 is the bigger brother of the MN25 which we tested last year and was awarded an Editor’s choice. The 16GB/512GB combination costs only $480 at Banggood, $170 less than the similar configured U850. It runs on AMD’s Ryzen 7 2700U so will be marginally faster on compute performance and significantly speediner on graphics.",
    "We liked the U850 but feel that, within the Minisforum portfolio, is probably an average run-of-the-mill product. Don’t take this as a criticism of this workstation PC for it would be a travesty to do so; instead, consider it as a praise for Minisforum’s exceptionally strong set of products.",
    "With the U820 and the X400, it currently stands out of the busy line up of Mini PC manufacturers by offering two year warranty as standard, newer processors (AMD and Intel) and Windows 10 Pro by default. That said, the lack of Thunderbolt ports and, to a lesser extent, of a card reader is a bit of an embarrassment."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "6": "Hardware",
    "8": "Performance and in use",
    "10": "The competition",
    "14": "Final verdict"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "business PC": "https://www.techradar.com/news/best-business-desktop-pcs",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "U850 costs $649": "https://store.minisforum.com/collections/intel%C2%AE-core%C2%AE-series/products/minisforum-u820-u850-mini-pc?variant=37581009060001",
    "Elite H31g": "https://www.techradar.com/reviews/minisforum-elitemini-h31g-mini-workstation-pc",
    "S41 stick PC": "https://www.techradar.com/reviews/minisforum-s41-hdmi-thin-client-pc",
    "4K monitors": "https://www.techradar.com/news/best-4k-monitors",
    "U820": "https://store.minisforum.com/collections/intel%C2%AE-core%C2%AE-series/products/minisforum-u820-u850-mini-pc?variant=37581008404641",
    "AMD Ryzen 3 Pro 4350G": "https://store.minisforum.com/products/minisforum-x400-mini-pc?variant=37385023619233",
    "MN25": "https://www.techradar.com/reviews/tbao-mn25-amd-ryzen-mini-workstation-pc",
    "$480 at Banggood": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-9634397399774052000&ulp=https%3A%2F%2Fwww.banggood.com%2FT-Bao-TBOOK-MN27-AMD-Ryzen7-2700U-16GB-DDR4-512GB-NVME-SSD-Mini-PC-Desktop-PC-Radeon-Vega-10-Graphics-2_2GHz-to-3_8GHz-DP-HD-Type-C-Trial-4K-Output-Dual-WiFi-p-1754053.html%3Fcur_warehouse%3DCN%26ID%3D47184%26rmmds%3Dcategory"
  }
}