{
  "source": "https://www.techradar.com/reviews/ring-video-doorbell-4",
  "title": "Ring Video Doorbell 4 review",
  "category": "smart-home",
  "updated": "2021-12-02T14:49:59Z",
  "author": "esat-dedezade",
  "summary": "A feature-packed smart doorbell with hassle-free installation",
  "verdict": "The Ring video Doorbell 4 is a feature-packed doorbell that delivers clear video footage with plenty of opportunity to tweak alerts and features to your liking. Its simple installation and long-lasting battery life make it an ideal choice for users who don’t want to deal with the hassle of a wired installation. Its subscription service (required for video recording) and incompatibility with Google Assistant devices might however be deal breakers for some.",
  "pros": [
    "Easy installation",
    "Clear video quality",
    "Feature-filled app"
  ],
  "cons": [
    "No free video storage",
    "No Google Assistant support"
  ],
  "article": [
    "Ring is synonymous with video doorbells, having been part of the smart home market since 2013, and acquired by Amazon in 2017. Since then, Ring has also launched a range of home security cameras and has become one of the go-to brands for amart security in the home.",
    "The Ring Video Doorbell 4 is the brand’s latest battery-powered video doorbell and is an incremental update on its predecessor, the Ring Video Doorbell 3 Plus. As before, it stores four seconds of video captured before motion detection was activated (known as pre-roll), to help you identify exactly what triggered the alert, but with the Doorbell 4, the video is in color rather than black and white.",
    "The Ring Video Doorbell 4, which can be battery-powered or connected to existing doorbell wiring, has a Full HD camera with a 160-degree field of view. We found the Full HD color video the doorbell captures looked detailed and clear, while night vision means video recorded after dark is also easy to see, although it’s in black and white rather than color.",
    "When pressed, the Video Doorbell 4 will send a notification to the Ring app on your smartphone, and you can login and view a real-time feed from the doorbell’s Full HD camera through the Ring app. A two-way microphone and speaker means you’ll also be able to converse with whoever is on your doorstep.",
    "The accompanying app lets you tweak features to your heart’s content, though you’ll need to subscribe to Ring Protect (from $3 / £2.50 / AU$4 per month), if you want the ability to review the footage at a later date.",
    "The Video Doorbell 4 works seamlessly with Alexa devices and can beam video footage straight to an Echo Show. The catch? It won’t work with Google Assistant-powered tech.",
    "The Ring Doorbell 4 also continues to support 2.4GHz and 5GHz Wi-Fi - two different Wi-Fi frequencies to allow it to connect to a wider variety of routers in a more stable way. This should bring an end to the connection issues that have plagued some users, in particular those with slower broadband. At $199.99 / £179 / AU$329, this isn’t the cheapest video doorbell on the market. However, if you’re firmly in Alexa’s world and want a hassle-free, reliable wireless camera-laden doorbell, the Ring Video Doorbell 4 is a great performer that won’t let you down – though you’ll need to take the (admittedly affordable) cloud storage payments into account if you want to use it to its full potential.",
    "The Ring Video Doorbell can be yours for $199.99 / £179 / AU$329 and is available directly from Ring or from online retailers including Amazon.",
    "If you sign up for Ring Protect – a premium service that unlocks video recording, viewing, and sharing – then you’ll have to fork out an additional $3 / £2.50 / AU$4 a month for the Basic plan (which covers one Ring device), or $10 / £8 / AU$15 for the Plus plan, which supports unlimited devices.",
    "The Ring Video Doorbell 4, like most other video doorbells, is a chunky beast, measuring in at 5.1 x 2.4 1.1 inches / 12.8 x 6.2 x 2.8cm (HxWxD). If this is your first smart doorbell you’ll be taken aback by its overall size and thickness. While it sounds like we’re being negative, we’re not – the large body means that in addition to a camera, it can also comfortably house a gargantuan 6040mAh battery. Besides, it’s not like you’re carrying it around with you in your pocket.",
    "Size aside, the design is rectangular and utilitarian, which we’re personally more than happy with. It has to be said though, compared to the ultra sleek, futuristic looks of something like the Nest Doorbell (battery), Ring’s portfolio is starting to look a little clunky. Having said that, you can spruce things up by ordering different coloured faceplates to match your outside decor. At the time of writing, you’re eligible for a free faceplate which you can redeem after purchase, which is a nice touch.",
    "Functionality-wise, you’ll need to remove a star-shaped security screw with the included screwdriver to be able to pop off the faceplate, revealing the battery within. A simple lever press is all it takes to pop out the battery, which can then be charged via Micro USB (sadly not USB C). As long as you don’t lose this screwdriver then this system is quick and hassle-free, and you won’t find yourself needing to do it that often anyway, given the impressive battery life (more on that in a sec).",
    "The last thing to note regarding the design is the plastic build, which can get scratched very easily. Ordinarily, this obviously wouldn’t be a problem, but we moved house during our review of the Ring Video Doorbell 4, and the non-replaceable black plastic camera surround picked up numerous scratches while being transported in a rucksack with other loose items. That’s obviously a mistake on our part, but it’s something worth mentioning.",
    "When it comes to actually installing it, even the most casual of DIYers should have no problem. A selection of screws are included to cover different lengths and wall materials, and there are clear video instructions online. We used the included corner mount to provide a better angle due to our side-wall setup, but either way, it’s a simple matter of screwing the mount or doorbell directly into a wall or, if you prefer, a door. An electric screwdriver makes the job much faster.",
    "The mounting screws are hidden by the plastic front cover, which can itself only be removed with the screwdriver we mentioned earlier. It’s as good a security setup as we can expect to see, but it’s not entirely invincible. The day we moved house, for example, we realized the security screw was packed up in a random box we had no chance of locating. Instead of abandoning the Ring, I simply pulled on it, and with a fair bit of force, it came free, with the mounting screws still in the wall, which I then removed with a screwdriver. This was only possible, mind, because of the corner adaptor. If you screw the Ring directly into a wall, then it’s pretty much impossible to pull off. Either way, no security measures are ever fool proof, and we can’t see many thieves looking to steal a doorbell that will clearly record their nefarious antics anyway.",
    "The Ring Video Doorbell 4’s 1080p camera delivers crisp, clear video in daylight, easily and comfortably letting you see the outside world and the people that approach your door. Its 160-degree horizontal viewing angle provides generous side coverage, which may or may not be required for your needs.",
    "At night things are predictably less clear when the infrared night vision kicks in, which is the case for all security cameras. Still, while everything is softer, you can still clearly make out people and faces when they approach, making it a more than viable home security solution.",
    "The built-in microphone and speaker are also solid, letting you clearly talk to a visitor without strain on either end. We still find this sort of interaction a little impersonal and jarring, but it’s nice to have the option, especially if, for example, you’re elderly and would rather not open the door to everyone.",
    "As we’ve already mentioned, the doorbell also offers a pre-roll function, which stores four seconds of video before motion is detected, to help you identify the source of the alert.",
    "When it comes to the actual response time (aka the time it takes for you to know someone’s at the door after they’ve pressed the button), you might be a little disappointed at first. Traditional wired doorbells offer an instant ring, while wireless doorbells like Ring have a few seconds of delay, while they wake up from low power mode and transmit their signal. The reality is that a few seconds makes no real difference, but it does take you a few days to get used to the fact that you don’t need to sprint to the door in case the ringer has left. You can actually hook the Video Doorbell 4 to an existing wired setup if you prefer, but it sort of negates the point of buying a wireless model.",
    "The Ring Video Doorbell 4 has a feature-rich app that lets you view and adjust all sorts of settings, in addition the standard feature that shows you who’s at the door when it rings. You can also choose to view the live feed at any point, as well as set up alerts for motion detection.",
    "It’s worth noting that if you want to store video to review at a later date, you’ll need to subscribe to Ring Protect, which is priced from $3 / £2.50 / AU$4 a month. While it’s not particularly expensive, it’s something to consider if you’d rather not have another subscription added to your list of monthly outgoings. Without the ability to record footage, the Video Doorbell 4 won’t really be using its full potential, as it’ll be nothing more than a doorbell that lets you see who’s there when it’s rung, but nothing more.",
    "Ring Protect also provides access to some handy features including people detection, which saves you from being alerted each time a tree branch gets a little over excited in the wind. You can also define specific Motion Zones. These blue zones are a great way to cut down on the number of notifications you receive as you won’t be alerted to any movement that takes place outside of them. If you’re on a busy street, for example, you can limit the motion alerts purely to anything between your front door and the end of the driveway, so that pedestrians and passing cars can be ignored. Combined with the option to only receive motion alerts for people as opposed to any object, you can tailor the Video Doorbell 4’s settings to your exact needs.",
    "In terms of playing nice with other devices, Alexa users will have no problems, with the Ring skill reliably informing you when there’s someone at the door. Amazon Echo Show users have the additional benefit of being able to see a live view of who’s at the door too. Google Assistant fans are out of luck though, which could be a dealbreaker if you’re firmly in the Google camp. You can play around with some IFTTT workarounds if you like, but for most people, this is an extra step that’s far from intuitive or ideal.",
    "Ring says the battery should last six months to a year between charge. We weren’t able to fully test these claims, and we used the doorbell heavily during testing so we don't have a realistic reading of battery depletion. How quickly the battery drains will depend upon how many times the doorbell is pushed, how many times motion is detected and how often live view is activated.",
    "We found the battery took around eight hours to recharge using the bundled USB cable, and the batteries are swappable so, providing you purchase an additional battery, the doorbell won’t be out of action when it needs recharging.",
    "First reviewed August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Ring Video Doorbell 4 Price and availability",
    "9": "Design",
    "15": "Performance",
    "20": "App",
    "24": "Battery life",
    "26": "Don't buy it if..."
  },
  "links": {
    "video doorbell": "https://www.techradar.com/best/best-video-doorbells",
    "Ring Video Doorbell 3 Plus": "https://www.techradar.com/reviews/ring-video-doorbell-3-plus-review",
    "Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-10-review"
  }
}