{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-smarttag-plus",
  "title": "Samsung Galaxy SmartTag Plus review",
  "category": "phones",
  "updated": "2021-08-25T14:38:10Z",
  "author": "jennifer-allen",
  "summary": "Convenient tracking for Samsung owners",
  "verdict": "The Samsung Galaxy SmartTag Plus is a cheap way of tracking anything you want to attach it to. That's providing you have a Samsung Galaxy phone already and want to embrace the ecosystem.",
  "pros": [
    "Long battery life",
    "Compact size",
    "Can control smart home devices"
  ],
  "cons": [
    "Only works with Samsung phones",
    "Not the lightest of tags",
    "Less water resistance than some"
  ],
  "article": [
    "If you're prone to forgetting various things from your wallet to your keys or even your bag, the Samsung Galaxy SmartTag Plus is almost certain to be instantly appealing to you. It's a device you attach to your precious item, so you can use its Bluetooth Low Energy (BLE) chip to help you track it down if the worst happens.",
    "It's pretty cheap too at only £39.99/$39.99 for the Samsung Galaxy SmartTag Plus, or £29.99/$29.99 for the lesser Samsung Galaxy SmartTag that lacks ultra-wideband support (meaning it doesn't offer spatial and directional tracking).",
    "We're focusing on the Samsung Galaxy SmartTag Plus here, but whichever you choose it's compact and practical. Providing that is, you already own a Samsung Galaxy smartphone.",
    "That's the main catch to the Samsung Galaxy SmartTag Plus - it exclusively works with Samsung phones. If you own a different Android phone, you're out of luck.",
    "If you want the full benefits, which includes the ability to use your phone's rear-facing camera to guide you towards the SmartTag, you'll need one of the latest Samsung phones such as the Galaxy S21 Ultra, Galaxy S21 Plus, Galaxy Note 20 Ultra, or Galaxy Z Fold 2 or above to use the feature.",
    "That's a bit limiting for some, but those who are able to use the Samsung Galaxy SmartTag Plus will appreciate it. It's small and lightweight, albeit not quite as small as a Tile tracker, and it takes seconds to set up.",
    "Using a CR2032 battery, it promises a battery life of about a year too, with IP53 water resistance meaning it'll deal with a splash or two along the way.",
    "Besides being the tag to attach to your easily misplaced bag or keychain, you can also use the Samsung Galaxy SmartTag Plus to deal with much of your smart home. It's possible to use the button on it to switch on your Philips Hue lamps, for instance, which we found very convenient.",
    "Arguably, we ended up using this facility more often than tracking down misplaced phones or other items.",
    "You'll need to use the SmartThings app for setting things up, but it's reasonably intuitive and offers well thought out features such as being able to encrypt your phone's offline location.",
    "That's what works so well for the Samsung Galaxy SmartTag Plus - simplicity. It's really not complicated at all while still being quite practical. It's the kind of thing you could give to a tech novice and they'd still be able to set it up within a few minutes. Most of the setup simply requires downloading the SmartThings app and creating an account, with the actual time with the Samsung Galaxy SmartTag Plus itself being fairly limited.",
    "Of course, only working with Samsung Galaxy phones is a big limitation, but one that's somewhat logical given how many manufacturers are focusing on tying people into their respective ecosystems. If you already own a Samsung Galaxy smartphone, it simply makes sense to stick with the name here. Just give it a swerve if you're committed to a different brand.",
    "The Samsung Galaxy SmartTag Plus is available for $39.99/£39.99 (around AU$55), with the cheaper Samsung Galaxy SmartTag available for $29.99/£29.99 (roughly AU$40). There's currently no availability in Australia.",
    "The main difference between the two is that the SmartTag Plus has ultra-wideband connectivity to go with the Bluetooth connectivity, and it uses your phone's rear-facing camera to help guide you towards the SmartTag, providing you have one of the latest Samsung Galaxy phones, that is.",
    "In the case of the Samsung Galaxy SmartTag, you can buy it for a little bit less than the recommended price if you shop around at third-party retailers, but don't expect discounts to be huge yet.",
    "Different colors are available including black and denim blue for both models, and oatmeal for the standard SmartTag.",
    "The Samsung Galaxy SmartTag Plus measures 40.9 x 40.9 x 9.9mm. It has sleek rounded edges that feel good in your hand and means you won't have to worry about any sharp edges damaging anything.",
    "Weighing about 14g, it's slightly heavier than some Tile units but we're quibbling here. You won't complain about any extra bulk at all. It feels fine and looks good on your keychain or even your dog's collar if that's where you need it to go.",
    "One side of the Samsung Galaxy SmartTag Plus has a button that you tap to interact with it, while the other side is solely devoted to the Samsung logo which is suitably hidden away. The tracker uses a CR2032 battery which should last about a year before it needs replacing. A hole allows you to attach it to a key chain or whatever else you need to stick it on.",
    "In terms of ruggedness, the Samsung Galaxy SmartTag Plus has an IP53 rating for water resistance, so it should be fine if it gets dripped on but it isn't fully waterproof.",
    "Setting up the Samsung Galaxy SmartTag Plus takes a matter of minutes. Downloading the SmartThings app if you haven't already is the main time consuming portion. Once that's done, you're a couple of taps away from the tag being paired up with your smartphone.",
    "Options are varied yet clear. Tapping the View Map button shows you exactly where your SmartTag Plus is located along with a bevy of other useful options. A tap of Search Nearby brings up a strength meter which helps you figure out how close you are. It would almost feel like a game if not for the fact that you'll probably be quite keen to track down your misplaced item sooner rather than later.",
    "A Ring button means the Samsung Galaxy SmartTag Plus can emit a noise to help you find it a bit faster. The noise is pretty loud too so you won't have trouble finding it, even if it's hidden under a pile of stuff.",
    "The range is pretty good too, and it works both ways. If you've lost your phone but have your Samsung Galaxy SmartTag Plus, you can double squeeze the button to set off the alarm on your phone until you find it.",
    "Although, in our tests, the Samsung Galaxy SmartTag Plus didn't quite meet the estimates from Samsung of 390 feet (120 meters). About 250-300 feet (75-90 meters) works admirably though, which should be fine for most users.",
    "However, the Samsung Galaxy SmartTag Plus isn't just limited to tracking. It also helps with smart home automation. It's possible to use the button to control a lot of your smart home, such as your lighting system or even your thermostat.",
    "You can assign different actions for if the button is being pressed or held, so there's a bit of flexibility here, and we found it particularly useful when walking into a dark room.",
    "Samsung promises that the Samsung Galaxy SmartTag Plus's CR2032 battery will last users about a year before it needs replacing. Obviously, we haven't got a year to test that theory out but it sounds reasonable.",
    "In the meantime, users can check the battery life via the SmartThings app, which has a battery life notification that uses an admittedly vague 'Sufficient' banner to tell you it's just fine.",
    "When it does come to replacing the battery, you just need to pry the case off with a screwdriver or coin then pop the battery out. It only takes a couple of minutes and it's far from complicated. That should be sufficient for everyone.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Samsung Galaxy SmartTag Plus price and availability",
    "16": "Design",
    "20": "Performance",
    "27": "Battery life",
    "30": "Don't buy it if…"
  },
  "links": {
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review"
  }
}