{
  "source": "https://www.techradar.com/reviews/linkedin-learning",
  "title": "LinkedIn Learning review",
  "category": "computing",
  "updated": "2021-09-15T03:27:40Z",
  "author": "jonas-p-demuro",
  "summary": "Grow your in-demand skills",
  "verdict": "LinkedIn Learning is an outgrowth of the popular professional networking service. While the price of the single choice of plan is not the cheapest, for those looking to improve their professional skills to enhance employment possibilities, this platform is an easy to recommend choice.",
  "pros": [
    "Free month trial",
    "Annual savings option",
    "Nice previews of content",
    "Available completion certificates",
    "Smartphone apps to learn anywhere"
  ],
  "cons": [
    "Limited support options",
    "Single tier plan",
    "Price",
    "Limited content offerings"
  ],
  "article": [
    "While most folks are aware of LinkedIn, the online professional networking site with a staggering 774+ million members that began in 2002. However, there is also a subsidiary of LinkedIn that focuses on online learning, known as LinkedIn Learning (it was previously known as Lynda.com). It currently has in excess of 16,000 courses, with a focus on “In demand skills.” Among the organizations that use LinkedIn Learning are Estee Lauder, TomTom and NBC Universal.",
    "LinkedIn Learning has a fairly expansive catalog of streaming online videos that focuses on topics to improve skills for work. The content is also available in seven languages. The learning here is also interactive, unlike some competitors, with online quizzes and exercise files available for assessment of the new knowledge gained via the platform.",
    "Another plus is the integration with the LinkedIn platform. An example of this are the certificates obtained from completing LinkedIn Learning courses get added to your LinkedIn profile, increasing marketability of the learner when it comes time for a new position.",
    "There is also some flexibility built into the LinkedIn Learning platform. The options range from shorter content, to longer and more comprehensive reviews of a subject. Also, there are possibilities for audio only, and offline viewing of content to offer a convenient format for learning. Some users report that they learn the content while going out for a jog!",
    "Topics cover the gamut of business issues, with the three major categories: Business, Creative and Technology. In the Business category, subtopics cover Business Analysis and Strategy, Finance and Accounting, and Professional Development among the thirteen subtopics. LinkedIn Learning indicates that the courses are taught by expert instructors who are industry experts. Perusing the instructors of the popular courses, we can confirm that many are authors, and speakers at live events.",
    "The course catalog can be browsed by the general topics and subtopics, or by a search. For example, we searched Management, and found content for “Become a Project Manager,” “Managing Others Effectively,” and a twelve plus hour course on how to “Become a Six Sigma Yellow Belt.” We also appreciate that clicking on the course, even without a subscription or even a login opens a short preview of the course to decide if it is worth pursuing (think of it as a movie trailer to decide on the film). For those who prefer to read and scan, there was also a transcript of what was said on the preview.",
    "LinkedIn Learning takes the ‘Simpler is better’ approach to plans, in that there is really only a single one. One the one hand, this simplifies the choice, and avoids the agony of choosing the best tier for your needs, but this only leaves a single, ‘Take it or leave it’ choice. There is also a generous, whole month trial to decide prior to purchase, LinkedIn Learning even promises to remind you 7 days prior to the free trial expiring.",
    "For those that go ahead to purchase a subscription, the only real choice is to subscribe monthly or annually. The monthly cost is $29.99 per month when taken on a month to month basis, or $19.99 per month when the plan is paid on an annual basis, for a 33% savings.",
    "The above plan is for an individual. There are also enterprise plans offered, which require contact with the company for pricing details. The website states that over 13,000 organizations worldwide use LinkedIn Learning.",
    "While the Sales Department for LinkedIn Learning gets a prominently displayed toll free number, the Support Department does not get the same treatment. There is a support link, and it takes you to the page above. From here, a Support Ticket can be generated. There is also a prompt to “Sign In” for better support, although it is not clear what the actual benefit is. There are also some predone help topics, as seen above, that include things such as “Billing Information for LinkedIn Learning.”",
    "We are missing direct phone support, a chat box, and a direct email. We also did not find any eBooks, whitepapers, or streaming videos for help.",
    "LinkedIn Learning gets high marks on its user reviews. On the Apple App Store, it gets a rating of 4.8/5, with over 77K rankings. Confirming this high score, on the Google Play Store, its rates at a similarly lofty 4.7/5 with over 50K scores.",
    "Multiple five star reviews talk about the convenience of the education on the go, the convenience of syncing of the video between the website and the app, and the efficient learning process via the videos. However, a minority of the reviews do point out some issues, such as they expected a higher quality video studio. Also, a few folks had some login issues, complain that the videos have to stay in internal storage and not a memory card, and some crashes from instability issues.",
    "LinkedIn Learning is an extension of the popular LinkedIn professional networking service. We find that the service’s pros include the certificates for your LinkedIn page upon completion, the relatively lengthy month-long trial period, the well done video previews of content, and the notably high ratings of the smartphone apps.",
    "The areas to be improved are the single tier only plan, the higher monthly cost, the predominantly focus on business content, and the limited support options.",
    "For those that want mostly business video streaming content, LinkedIn Learning is definitely worth a look as a learning platform."
  ],
  "headers": {
    "1": "Features",
    "6": "Plans and pricing",
    "9": "Support",
    "11": "User reviews",
    "13": "Final verdict"
  },
  "links": {
    "LinkedIn": "https://www.techradar.com/news/linkedins-new-service-could-be-the-tool-to-book-your-next-freelance-gig",
    "online learning": "https://www.techradar.com/best/best-online-learning-platforms",
    "LinkedIn Learning": "https://linkedin-learning.pxf.io/c/221109/449670/8005?subId1=trd-us-8055803803265650000&sharedId=trd-us&u=https%3A%2F%2Fwww.linkedin.com%2Flearning%2Fme",
    "monthly": "https://linkedin-learning.pxf.io/c/221109/449670/8005?subId1=trd-us-1257177488306456800&sharedId=trd-us&u=https%3A%2F%2Fwww.linkedin.com%2Flearning%2Fsubscription%2Fproducts%3FupsellTrk%3Dlil_upsell_defensibility-hero_subscription%26lipi%3Durn%253Ali%253Apage%253Ame_index%253Bw5PLQrYTS0eOZyy0UqW1bg%253D%253D%26trk%3Dtrk_default_learning%26upsellOrderOrigin%3Dtrk_default_learning%26upsellTrackingId%3DEZLopok4RwSoIVX9L6eELw%253D%253D%26destRedirectURL%3Dhttps%253A%252F%252Fwww.linkedin.com%252Flearning%252Fme%253Ftrk%253Dtrk_default_learning%26lipi%3Durn%253Ali%253Apage%253Ame_index%253Bw5PLQrYTS0eOZyy0UqW1bg%253D%253D%26licu",
    "annually": "https://linkedin-learning.pxf.io/c/221109/449670/8005?subId1=trd-us-3988855538107454500&sharedId=trd-us&u=https%3A%2F%2Fwww.linkedin.com%2Flearning%2Fsubscription%2Fproducts%3FupsellTrk%3Dlil_upsell_defensibility-hero_subscription%26lipi%3Durn%253Ali%253Apage%253Ame_index%253Bw5PLQrYTS0eOZyy0UqW1bg%253D%253D%26trk%3Dtrk_default_learning%26upsellOrderOrigin%3Dtrk_default_learning%26upsellTrackingId%3DEZLopok4RwSoIVX9L6eELw%253D%253D%26destRedirectURL%3Dhttps%253A%252F%252Fwww.linkedin.com%252Flearning%252Fme%253Ftrk%253Dtrk_default_learning%26lipi%3Durn%253Ali%253Apage%253Ame_index%253Bw5PLQrYTS0eOZyy0UqW1bg%253D%253D%26licu"
  }
}