{
  "source": "https://www.techradar.com/reviews/xmg-pro-17-2021-mobile-workstation",
  "title": "XMG Pro 17 2021 mobile workstation review",
  "category": "computing",
  "updated": "2021-04-01T11:39:18.177Z",
  "author": "desire-athow",
  "summary": "An astounding piece of technology with the world’s fastest graphics card",
  "verdict": "The XMG Pro 17 2021 mobile workstation is a magnificent piece of technology with the RTX3080 Max-Q as the crown diamond. It should have been paired with a top of the range 45W AMD processor but we’ll gladly take the Intel one. Just be aware of the caveats with regards to support and pricing.",
  "pros": [
    "Absurdly powerful graphics card",
    "Compact",
    "Maxed out configuration",
    "Plenty of ports",
    "Good input peripherals"
  ],
  "cons": [
    "No Thunderbolt 4",
    "Exposed ports can hurt!",
    "No AMD option",
    "Can be noisy at times but that’s expected",
    "Limited after sales support",
    "Cheaper options elsewhere"
  ],
  "article": [
    "2021 has been an exceptional year in computing so far. Not only because of the issues with the global semiconductor supply chain that have dramatically altered availability of parts as demand has risen sharply but also because old technological rivalries have gone up a notch. Amidst all this, German company XMG has unveiled a mobile workstation that doubles as a gaming laptop (or vice versa), the XMG Pro 17 2021, that is equipped with one of the fastest graphics cards in the world.",
    "We configured the XMG Pro 17 2021 at the time of writing and it retailed for €3,749.01 including taxes but excluding shipping. That’s just under £3,220, just over US$4,480 or a smidgen above AU$5,770. The device is delivered free in the EU with a lead time of up to 20 days. Bear in mind that these are special times and variations in demand and supply will affect both pricing and availability of products. Our unit came with a pair of Samsung 2TB 970 Evo solid state drives but these were not available when we priced it ; we used the Corsair MP400 instead. This laptop is also known as the Schenker Key 17.",
    "It’s been a mere nine months since we reviewed the XMG Apex 15 mobile workstation which was and still one of the most powerful laptops in the market with 16 cores. Back then, XMG dished out a full blown, larger-than-life laptop that was, at its thickest, 33mm thick. Fast forward to 2021 and the Pro 17, despite featuring a larger display (17.3-inch vs 15.6-inch) is actually far thinner at just 19.9mm. It is also much lighter at 2.3Kg although its actual footprint (396 x 265mm) is understandably larger.",
    "As expected, this is a Clevo chassis, the PC70DS and is therefore a gaming laptop in disguise (and in search of a new audience) with a polycarbonate matte plastic finish combined with aluminum, great for dissipating excess heat. It lacks the sort of tight integration you might find in the likes of the MacBook Pro or the Dell XPS 15 but that’s not necessarily a bad thing given that “right to repair” laws are becoming the norm across the European market and UK.",
    "As for the laptop, there’s a plethora of ports given the size of the beast: two USB ports and a Gigabit Ethernet LAN on the right, a HDMI 2.1 port, mini DisplayPort, barrel-type connector and Thunderbolt 3 (instead of 4) at the back, a card reader, an additional powered USB port plus two audio connectors on the right.",
    "Note that the exposed USB ports have pointed edges that could potentially rip through skin, just be careful when handling them. As you may guess, there’s a lot of vents around the laptop to help with air circulation and cooling.",
    "Lift the lid and you’re greeted with five stickers, a reasonably laid-out keyboard, a large touchpad with two physical buttons and an integrated fingerprint reader and - most importantly - a dedicated numeric keypad. (ed: Note that XMG has confirmed that the stickers are included in the packaging for retail customers, not stuck on the laptop, something that other vendors should absolutely follow).",
    "The screen is a 17.3-inch 4K matte monitor that XMG says has a brightness of 400nits and is colour calibrated. It also provides 100 percent coverage of the extended Adobe RGB color gamut, which is good news for video editing and photo pros looking for color accuracy. We love the fact that it has a thin bezel",
    "The centrepiece of the XMG Pro 17 is not its CPU but its GPU, the Nvidia GeForce RTX3080 Max-Q, an obscenely powerful part that comes with a staggering 16GB GDDR6 dedicated video memory. It is not the fastest mobile GPU around; that title goes to the RTX 3080 Mobile but the latter runs hotter. XMG deliberately chose the Max-Q in order to fit it in a thinner and more temperature-constrained chassis. The addition of 16GB memory is a clear nudge towards the professional audience it aims to attract. Creative software is notoriously hungry for both system and video RAM and this workstation has tons.",
    "There’s two 32GB Samsung DDR4 3200MHz memory modules that’s paired with an eight-core Intel Core i7-10870H Comet Lake CPU, one that has 16MB cache, a 45W TDP and runs at up to 5GHz. One wonders why no AMD part was chosen; after all, AMD has the Ryzen 7 4800U, 4800H and 4800HS that are competitive with this Intel processor. That would be a question for Clevo, XMG’s OEM.",
    "Also part of the bundle is a pair of 2TB Samsung 970 Evo solid state drives (unavailable at the time of writing), Sound Blaster Atlas audio technology, an Intel AX201 WiFi 6 wireless card and a 73Whr battery powered by a 180W power supply unit that, for once, doesn’t weigh more than 1Kg.",
    "The laptop lasted a rather surprising 170 minutes, that’s nearly three hours, which considering the hardware configuration of the XMG Pro 17 is a boon. Sure, no gaming was involved but it’s nonetheless a big change from the 58 minutes the XMG Apex 15 lasted. Since this is a mobile workstation, it comes with Windows 10 Pro.",
    "The 4K display is gorgeous and delivers very good black levels paired with a high-contrast display. Note that the Pro 17 can power a 8K monitor (thanks to the HDMI 2.1 port that it comes with) plus two other 4K monitors: that’s a staggering 58 million pixels for those who love numbers.",
    "The keyboard is - as one would expect - excellent given its gaming origin. Putting the adjustable RGB per-key backlight and multi-level adjustable brightness, it delivers what XMG calls a clearly defined keystroke that lacks the sort of punchy feedback some users might prefer and has less of a clicky noise and more of a thump one. Subjectively a better option for those looking to do some quiet gaming. The touchpad has a large gliding surface and is precise enough for our taste.",
    "As for the performance, the RTX3080 Max-Q delivered stunning video/graphics related numbers as expected. In comparison, the rest of the components were good without being spectacular. The 6-core Ryzen processor in the MagicBook Pro (AMD) offered comparable storage subsystem numbers but lagged by only 20% in PC Mark and Geekbench.",
    "Although you won’t be able to easily buy the XMG Pro 17 laptop in the US, you will be able to purchase similar models from the likes of Xotic, Avadirect, Pro-Star and Hidevolution. Note that only the last vendor offers the 4K display as an option.",
    "The XMG Pro 17 that we tested has been configured with premium parts and this is reflected in the pricing. However while it is an exceptional product, there are two things that we’d urge potential customers to consider.",
    "Firstly, the fact that XMG doesn’t have the same after sales support coverage as Lenovo or Dell. The latter for example can offer up to four year warranty (including international support) and accidental damage, something that smaller boutique vendors simply can’t match.",
    "Secondly, there are cheaper options around (at least at the time of writing) from rival niche European vendors but it is worthy to note that XMG was the only one that had the said configuration in stock, ready to ship.",
    "So where does that leave us? We’d love to have an AMD version of this workstation but this will depend on Clevo. Intel reigns supreme in its portfolio with only four AMD SKU’s - including the XMG Apex 15 - compared to nearly 100 for Intel."
  ],
  "headers": {
    "1": "Price and availability",
    "2": "Design",
    "8": "Hardware",
    "11": "In use",
    "15": "Final verdict"
  },
  "links": {
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "XMG Pro 17 2021": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4145791710621737500&xs=1&url=https%3A%2F%2Fbestware.com%2Fen%2Fxmg-pro-17-e21.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fxmg-pro-17-2021-mobile-workstation",
    "XMG Apex 15 mobile workstation": "https://www.techradar.com/reviews/schenker-xmg-apex-15-mobile-workstation",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "4K monitors": "https://www.techradar.com/news/best-4k-monitors",
    "Xotic": "https://xoticpc.com/products/sager-np8770s-clevo-pc70ds#product_info_customize_block",
    "Avadirect": "https://www.avadirect.com/Clevo-PC70DS-D-17-3-Core-i7-NVIDIA-GeForce-RTX-3080-Max-Q-Graphics-Gaming-Laptop/Configure/13956996",
    "Pro-Star": "https://www.pro-star.com/pc70ds.html",
    "Hidevolution": "https://www.hidevolution.com/evoc-high-performance-systems-x1702f-x170km-g-17-3-uhd-i5-10600k-i7-10700k-i9-10900k-rtx-3080.html"
  }
}