{
  "source": "https://www.techradar.com/reviews/seotestingcom",
  "title": "SEOTesting.com review",
  "category": "computing",
  "updated": "2021-04-09T10:47:00Z",
  "author": "brian-turner",
  "summary": "Expand on Google Search Console data for insights",
  "verdict": "One of the simpler SEO tool platforms out there, but still very useful for website owners and small businesses, though not so much for SEO agencies or larger businesses.",
  "pros": [
    "Easy to use and understand",
    "Tests and reports",
    "Useful suggestions",
    "Good for website owners"
  ],
  "cons": [
    "Needs a Google Search Console account",
    "Not comprehensive enough for SEO agencies"
  ],
  "article": [
    "SEOTesting.com aims to offer one of the best on-page SEO analytics tools, by providing not just a representation of information from your Google Search Console (GSC) account, but also SEO testing and query analysis to help you optimize pages.",
    "That’s the claim, anyway, so we put it through it paces over a week in order to test it out.",
    "SEOTesting.com offers a very simple and uncomplicated pricing structure. The Single Site plan allows you to sign up for a single website for just $19 a month. The Team plan allows you to cover up to 5 websites for $50 a month, while the Agency plan allows you to use up to 20 websites for $150 a month.",
    "Obviously, pricing per website becomes more cost-effective the more websites you sign up for. However, each plan provides the exact same features which is refreshing, meaning there’s no having to subscribe to expensive plans on the basis of features – you are only charged according to website volume.",
    "However, while the quoted prices are for an on-going monthly basis, with no subscription lock-in, you can contact SEOTesting.com to see if you can arrange a cheaper annual plan if that might suit you better.",
    "Additionally, you can change your plan at any time. And if you need more than 20 websites covered, you can contact the company for a custom quote.",
    "SEOTesting.com requires you to have your website registered with Google Search Console (GSC), which is Google’s webmaster tools platform to help website owners gain better insights into their websites. GSC is a good tool, but SEOTesting.com offers more than just a pretty way to represent your data.",
    "There are a number of specific features available, with a couple dedicated to SEO testing and split testing, in which you use the GSC data in your dashboard to see how these affect your rankings and/or traffic.",
    "There’s a lot more to this service, though, with a wide range of reports available that aim to help you better optimize your pages. For example, you can identify your top performing queries and pages, but also those which have low click through rates. Automated suggestions are made on how to improve some of these, and they are actually useful.",
    "There are also content ideas provided, to help provide new keywords, identify related longtail keywords, and more.",
    "You can also track changes to your site, add annotations to help you remember specific changes, and there is even a rank tracking tool – though you have to add keywords individually and there’s no apparent option for bulk import from an existing list.",
    "The SEOTesting.com interface is simple and easy to navigate, and because there are fewer tools to use than with major SEO platforms it’s easier to find what you need. There’s the obvious negative that bigger rival platforms offer many more tools – but also the positive that the toolkit that SEOTesting.com provides remains narrow and focused, making it much more likely you’ll actually use many of the tools available. It's also a lot cheaper.",
    "We found some of the reports especially useful, not least suggestions for low-CTR keywords and pages. Not only did it identify under-performing pages, but also made practical and helpful recommendations on what to change. Because updates to GSC happen daily, it means you can then track any positive or negative outcome from such changes.",
    "The caveat, of course, is that results may take a while to visibly impact Google, but at least you have a way to track these. The annotations tool could be especially good for ensuring you do have a clear record of what you changed and why, so you can reference any changes directly.",
    "Although SEOTesting.com is relatively easy to use, there is still a lot of good documentation in the user dashboard to help get fresh users started out. These link to articles on the SEOTesting.com blog, which are clearer laid out and easy to read.",
    "There’s also a live chat box always present in the dashboard so you can reach out for help or just ask questions when you need to. There are also additional email alerts that let you know when GSC has updated, when reports have run.",
    "The internet is swamped with SEO tools, with names such as Ahrefs and SEMrush providing comprehensive SEO tool platforms that do pretty much everything any SEO could ever ask for.",
    "However, SEOTesting.com isn’t aiming to compete with those directly, but instead with similar on-page SEO analytics tools such as Jetoctopus, which also aims to provide a better overview of your data using a combination of GSC, log data, and direct crawling. Even then, both tools focus on different areas, and SEOTesting is something of a niche player by focusing mostly on how to get the best from working with GSC data.",
    "We began this review with low expectations – Google Search Console is already a useful tool, so simply republishing its data didn’t sound a great help. SEOTesting.com, though, not only represents the data to provide key insights, it also provides additional support tools such as keyword suggestions and rank tracking that work directly from GSC data, as well as the ability to run split testing.",
    "Even better is that this was a SEO tool we could get really useful insights from and make changes according to them. The positive and negative is that the limited range of tools means that you can get the most from what you have, but will be missing essentials for more aggressive SEO campaigns.",
    "The result is that although SEOTesting.com can’t compete with the big-name tools such as Ahrefs and SEMrush, it doesn’t need to as it still manages to provide a very useful niche service. The caveat is that it’s not going to be useful for big business or most SEO agencies due to the limited toolkit.",
    "Even then, at the current price point, what there is could prove to be an invaluable and accessible platform for use with personal websites, as well as by webmasters and small business owners who want to be able to be hands-on with SEO without having to spend too much.",
    "Overall, it’s a nice little SEO tool that comes at an inexpensive price – if that’s all you need."
  ],
  "headers": {
    "2": "SEOTesting.com: Pricing",
    "6": "SEOTesting.com: Features",
    "11": "SEOTesting.com: Interface and use",
    "14": "SEOTesting.com: Support",
    "16": "SEOTesting.com: The Competition",
    "18": "SEOTesting.com: Final Verdict"
  },
  "links": {
    "best on-page SEO analytics tools": "https://www.techradar.com/best/onpage-seo-tools",
    "Ahrefs": "https://www.techradar.com/reviews/ahrefs",
    "SEMrush": "https://www.techradar.com/reviews/semrush",
    "Jetoctopus": "https://www.techradar.com/reviews/jetoctopus"
  }
}