{
  "source": "https://www.techradar.com/reviews/the-luften-manual-standing-desk",
  "title": "The Lüften manual standing desk review",
  "category": "computing",
  "updated": "2021-11-30T16:30:25Z",
  "author": "anthony-spadafora",
  "summary": "A pneumatic standing desk with a floating look that’s sure to turn heads",
  "verdict": "The Lüften is a unique manual standing desk that features a pneumatic lift system with two columns at the center of the desk to give it a floating look. It may be a bit more expensive than the competition but it’s built by hand using Swiss steel, German components and recycled materials.",
  "pros": [
    "Sleek design",
    "Large work surface",
    "Base sold separately",
    "Raises and lowers quickly",
    "Free shipping and 5-year warranty"
  ],
  "cons": [
    "Expensive for a manual standing desk",
    "Cable management system isn’t a cable tray"
  ],
  "article": [
    "Being more active while working from home or at the office is a great New Year’s Resolution for those looking to burn off a few of those holiday pounds and one of the best ways to do this is with a standing desk. Sitting at an office desk and staring at a computer screen all day can have negative effects on your health which is why more people are turning to standing desks to help break up their workdays.",
    "If you’re considering upgrading to a standing desk, one of the first things you’ll need to decide is whether you want an electric or manual standing desk. While electric standing desks can be raised and lowered with the push of a button, they can also be noisy and need to be close to an outlet when in use. Manual standing desks on the other hand can be the perfect solution for those that want to keep things simple while also eliminating cable clutter.",
    "Based in Grand Rapids, Michigan, The Standing Desk sells a number of electric and pneumatic standing desks that are designed by expert furniture makers in Germany, made with the highest tolerance steel from Switzerland and built by hand in Michigan. Today we’ll be taking a look at build quality, assembly process, features and usability of the company’s Lüften pneumatic standing desk to help you decide if it’s the right upgrade for your home workspace or office.",
    "The Lüften is available directly from The Standing Desk for $765 at the time of writing. While this may seem expensive at first, keep in mind that the company provides free shipping and a 5-year warranty in case you run into any problems down the line. You can also purchase the Lüften Base by itself for $515 if you already have a tabletop you want to use as well as a cable management kit for $29.95. The Standing Desk even sells lockable castors for only $8.95 for those that want to be able to roll this standing desk around their office or workspace.",
    "Right off the bat, the Lüften standing desk sets itself apart from other manual standing desks due to its low visual profile that makes the desk appear like it’s floating. While most electric standing desks feature either “T” or “L” shaped legs on either side, both of the Lüften’s legs are positioned in the center and towards the back of the desktop.",
    "The desktop made from recycled wood substrate is quite spacious with a width of 60-inches, a depth of 30-inches and a thickness of 1.25-inches. The Standing Desk offers several different work surface finishes to choose from including dover white, graphite twill (black), neutral twill (light gray) and urban oak. There is also a Formica strip around the edges of the desktop to protect it both during shipping and while in use.",
    "Unlike other manual standing desks that feature a hand crank or a handle which protrudes out to adjust their height, the Lüften’s black handle is quite discrete and tucked away neatly on the underside of the desk. Squeezing the handle toward you allows you to raise or lower the desk and we found the company’s claim that “The Lüften lifts and lowers in 3 seconds” to be true during our tests. The desk itself can be lowered all the way to 27.75-inches or raised to 45.25-inches though the optional casters do add an additional 1.5-inches to its height.",
    "The Lüften’s base is made from powder-coated Swiss steel as we mentioned before and is very sturdy. The twin columns that hold up the desktop are connected to the underside of the base using bolts and you can also attach castors to the underside of the base. The Lüften’s base is even available in black, grey or white in case you want it to match the color of your desktop though you can go for a two-tone design instead like we did with a black base and a white top.",
    "The Lüften arrived in two boxes with one box containing the desktop and the other containing the two columns, base, top plate, Boden cord clip, instruction manual, two Allen wrenches and all of the bolts and screws needed to put the desk together.",
    "To begin putting the desk together, you first need to remove the traveling screws from both columns and put them someplace safe as you will need them to prevent the columns from moving while in transit. From here, you need to attach the top plate to both columns using eight flat head screws.",
    "Once the columns are connected to the top plate, you then need to attach it to the desktop using a Phillips head screwdriver. The base then needs to be bolted onto the columns using an Allen wrench and eight hex socket cap screws.",
    "As this is a pneumatic standing desk, the handle used to lift and lower it is attached to one of the columns with a Boden cord. The handle needs to be screwed onto the front of the desk and the Boden cord is secured to the underside of the desktop using the provided Boden cord clips.",
    "Overall, assembling the Lüften wasn’t too difficult though you’ll likely need another person to help you flip the desk over once it’s complete due to the fact that the base is quite heavy. Compared to other manual standing desks, the assembly process was a lot simpler than with the Ergotron WorkFit-D though not nearly as easy as putting together the Vari Standing Desk.",
    "After we finished assembling the Lüften, we first tested it out using a Chromebook though we also added the Dell 27 Video Conferencing Monitor later as the desk is capable of supporting between 40-50lbs.",
    "Since this is a manual standing desk that in all honesty looks a bit more like a table (in a good way) than some of the other desks we’ve reviewed, we figured this kind of setup would be perfect for a shared workspace in an office where employees might be hot desking or moving around more frequently. With a laptop and a monitor on the desk, we had no trouble adjusting its height from a sitting to a standing position and there was plenty of room left on the desktop for a laptop stand and some other useful business accessories.",
    "The Standing Desk also sent TechRadar Pro one of its Cable Management kits which we affixed to the back of the desk. However, unlike with the cable management trays offered by other furniture makers, this one is more like a cable sleeve used to tidy up cables running from the desk to the floor. The design is also quite nice and its links resemble the vertebrae of a spine.",
    "While it was perfect for use with a laptop and a single monitor, we ended up using this under-desk cable management tray from Amazon during our second round of testing which we were easily able to affix to the underside of the desk using some wood screws.",
    "For our second round of testing, we placed a small form factor desktop PC on the Lüften along with an ultrawide monitor from LG, a mechanical keyboard and a Nest Hub. As we had multiple devices that needed to be plugged in, using a cable management tray allowed a power strip to move up and down with the desk without us having to worry about anything coming unplugged. Even with a large monitor and a desktop PC on it, the Lüften was still able to lift and lower quickly and the desk remained sturdy while in use.",
    "If you’re interested in the design of the Lüften but want an electric standing desk as opposed to a manual one, The Standing Desk also sells the Ändern Electric which features one center column instead of two for $702 at the time of writing. However, if you have your heart set on a manual desk, Vari and Ergotron offer two that we looked at previously.",
    "The Vari Standing Desk costs $595 and unlike the Lüften, its top and legs are only available in one color, white. While this desk lacks customization options, assembly is a cinch and you only need to screw in the four legs as Vari’s rowing-lift mechanism comes pre-built and attached to the underside of the desktop. Another plus is that the review model we tested came with a cable management tray pre-attached to the back of the desk with holes on either side for running cables. It’s worth noting that due to the unique design of Vari’s Standing Desk, the desktop protrudes out slightly when raised.",
    "Another more expensive option than the Lüften worth considering is the WorkFit-D Sit-Stand Desk from Ergotron. This desk costs around $900 and you will need to find a reseller to purchase it. The WorkFit-D has a lever on the right side of the desk which is used to raise and lower it and this desk uses integrated brake locks to prevent tipping or sway. Despite its higher price, you’ll also need to purchase a cable management tray separately if you want to attach a power strip to the desk.",
    "The Lüften is one of the most unique manual standing desks on the market today. It’s floating design will likely turn heads at the office or in your home and the solid-steel base gives the desk a sturdy feel even with the columns at the center instead of on either side. The large work surface is another plus and the optional castors give you a bit more flexibility when using the Lüften in a larger space.",
    "The only real downside to this desk is its more expensive price but unlike with larger furniture makers, all of The Standing Desk’s products are built by hand by three people at the company’s Grand Rapids facility and its entire team is made up of around 10 people. The company also uses higher quality materials and provides free shipping as well as a 5-year warranty. If you’re looking to upgrade to a manual standing desk and want to support a small business at the same time, the Lüften just might be for you.",
    "Looking to upgrade your home office setup? We've also featured the best office desk, best standing desk and best office chairs"
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "8": "Setup",
    "13": "In use",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "standing desk": "https://www.techradar.com/news/best-standing-desk",
    "office desk": "https://www.techradar.com/best/best-office-desks",
    "The Lüften": "https://thestandingdesk.com/luften-standing-desk/",
    "Lüften Base": "https://thestandingdesk.com/shop/luften-base-silver/",
    "Ergotron WorkFit-D": "https://www.techradar.com/reviews/ergotron-workfit-d-sit-stand-desk",
    "Vari Standing Desk": "https://www.techradar.com/reviews/vari-standing-desk",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "Dell 27 Video Conferencing Monitor": "https://www.techradar.com/reviews/dell-27-video-conferencing-monitor-s2722dz",
    "laptop stand": "https://www.techradar.com/best/laptop-stand",
    "business accessories": "https://www.techradar.com/news/the-best-business-technology-and-productivity-gadgets",
    "Cable Management": "https://thestandingdesk.com/shop/cable-management/",
    "under-desk cable management tray": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08VYBL973%3Fpsc%3D1%26ref%3Dppx_yo2_dt_b_product_details%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5705706328279188000-20",
    "desktop PC": "https://www.techradar.com/news/best-business-desktop-pcs",
    "ultrawide monitor": "https://docs.google.com/document/u/0/d/1OLd9TeL74rAmBAUZ-nn-dczqcpe0RUUrFYM8N971LLY/edit",
    "mechanical keyboard": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011",
    "Ändern Electric": "https://thestandingdesk.com/the-andern-electric-standing-desk/",
    "WorkFit-D Sit-Stand Desk": "https://www.techradar.com/reviews/ergotron-workfit-d-sit-stand-desk",
    "best office desk": "https://www.techradar.com/best/best-office-desks",
    "best standing desk": "https://www.techradar.com/news/best-standing-desk",
    "best office chairs": "https://www.techradar.com/best/best-office-chairs"
  }
}