{
  "source": "https://www.techradar.com/reviews/muse-s",
  "title": "Muse S review",
  "category": "fitness",
  "updated": "2021-01-27T15:00:47Z",
  "author": "cat-ellis",
  "summary": "A 'brain sensing' wearable that's an excellent meditation aid, but not perfect for sleep tracking",
  "verdict": "",
  "pros": [
    "Calming guided meditations",
    "Real-time bio feedback",
    "Simple to use"
  ],
  "cons": [
    "Cumbersome at night",
    "App is battery-intensive"
  ],
  "article": [
    "The Muse S is a soft, sensor-packed headband designed to help improve your wellbeing by teaching you to meditate effectively, and monitoring your sleep patterns overnight. Each session is accompanied by gentle spoken guidance and sounds, and at the end you'll see a report showing how calm you were throughout.",
    "The original Muse and Muse 2 were designed specifically for meditation, and although it’s also designed for sleep tracking, mindfulness is still where the Muse S shines.",
    "Settle the headband in place, open up the Muse app on your phone, and you can take your pick from a huge range of guided meditation sessions, The band's various sensors (which we'll discuss further below) detect brain activity and movement, and changes in the sound effects give you real-time feedback. The effects grow louder if you move or your mind wanders, and quieten down when you recover your focus. It's simple to use, each session takes only a few minutes, and it makes for a pleasant and rewarding experience.",
    "Unfortunately the sleep tracking isn't quite so refined. That's partly due to the design of the device itself. While the headband is easily adjustable and very soft to the touch, it does take some getting used to (more so than a watch), and the power unit that sits in the center of your forehead can occasionally be knocked if you turn over during your sleep.",
    "We appreciate the relaxing soundscapes, which allow you to fall asleep to nature effects that respond to bio-feedback and instructor-led visualizations to help you forget the day's worries. However, the app is also power-hungry, which isn't an issue for short meditation sessions, but can be a problem at night if your phone isn't plugged in.",
    "A smartwatch or under-mattress tracking device might not give you such detailed analysis in the morning, but will be less obtrusive overnight.",
    "The Muse S is a great way to develop a regular mindfulness practice, particularly in these stressful times, but given the choice we'd be inclined to sacrifice the sleep tracking tools and opt for the more affordable Muse 2 unless the S is on special offer.",
    "Unlike the Muse 2, which features a slim, rigid band that's secured behind your ears like a pair of spectacles, the Muse S is made from soft cloth, with central control/battery unit that sits on your forehead.",
    "This unit is charged via a micro USB cable. You'll need to juice it up regularly if you're using it for sleep tracking, but battery life has improved dramatically compared to the Muse 2, which could only keep running for five hours on a single charge.",
    "On the band's inner surface you'll find a set of sensors, including EEG to monitor brain activity, PPG for heart rate monitoring, and pulse oximetry for blood oxygen saturation, The control unit also contains a gyroscope and accelerometer to detect movement.",
    "You'll need to use your phone's speaker or, better yet, a set of earphones for the app's audio. We recommend sound-cancelling earbuds so you can concentrate fully on your meditation.",
    "The app walks you through the process of adjusting the band and settling it on your head. If you have long hair you might find it easiest to tie it back before getting started. You’ll also be given lots of guidance on what to do if the sensors can’t establish a connection, including using a little water to dampen your skin, but we had no issues at all in testing.",
    "Before each meditation or sleep session, you’ll be prompted to sit still and close your eyes while the sensors are tested. Moving about (even just moving your eyes) can interrupt this process, but after a minute or so you'll be notified that it's complete.",
    "There are different types of meditation to choose from, including mind, heart (which focuses on lowering your heart rate), body (concentrating on maintaining good posture and staying still), breath, guided meditations, and simple sessions on a timer.",
    "These aren’t all included with the initial app installation, and need to be downloaded separately, but this is understandable; the APK would be huge if every sound file was packaged up.",
    "You can choose different ‘soundscapes’ for your meditation, including rainforest (our favorite), beach, desert, city park, ambient music, campfire, and campfire music. As you meditate, you’ll notice the sounds become softer or louder. Quiet sounds indicate that you’re doing well (staying still, keeping calm, lowering your heart rate, or whatever the goal of your session. Heart meditation is also accompanied by a drum beat, representing your heart rhythm.",
    "The 'mind' sessions are very similar to meditation classes we’ve taken face-to-face; bring your attention to your breathing, and don't try to stop thinking, but allow any thoughts and distractions to happen without dwelling on them. It can be an effort to regain your concentration when the sounds start to intensify, but you're encouraged not to judge yourself for it.",
    "When you’re particularly calm, you’ll hear a bird chirp in the background. Once you’ve completed your session (signified by a gentle chime), you’ll be presented with a timeline showing how calm you were throughout, and when any bird sounds occurred. You can earn badges for staying calm for a certain period of time, or triggering a particular number of birds.",
    "Gamifying mindfulness might seem counter-productive, but it's actually quite motivating to have a goal to aim for, and a good encouragement to come back to the app day after day.",
    "While we enjoyed the Muse S for meditation, it isn’t something we’d want to wear regularly at night. It’s harder to forget about than a watch or a device like the Withings Sleep Analyzer, which simply slides under your mattress.",
    "The concept is a good one, and we enjoyed the various soundscapes that you can choose from (including ocean rhythm, soothing piano, and river walk). Set a timer for how long the sound should play, and the Muse S will begin tracking your sleep once the soundscape is finished.",
    "There are also guidances, where different speakers talk you through a visualization or inspiration session, helping take your mind off your daily worries. The sound effects are co-ordinated with feedback from the band's sensors. For example, in the Beach Walk visualization, the frequency of notes reflects your heart rate.",
    "A lot of data is transmitted and processed as you sleep, and we found that the app was quite power-hungry, so we strongly recommend keeping your phone plugged in overnight so the battery doesn’t run down after a few hours.",
    "If you’re a side-sleeper, the headband may move a little during sleep and lose connectivity briefly. We contacted Muse for advice on maintaining a good connection between the device and our phone, and the company’s support staff recommended making sure device location services are set to improved accuracy, and advised wearing the band for one or two minutes before starting a session so the signal can settle down.",
    "In the morning you'll receive a detailed report of your sleep. This includes sleeps stages. The fact that the Muse S is forehead-mounted means that, unlike most sleep tracking devices, it can detect whether you’re sleeping on your back, front, left or right, and record your stillness throughout the night. Otherwise the data is very similar to what you'd get from a wrist-based sleep tracker.",
    "Your sleep stages, heart rate and other stats are represented on clear graphs, and you're given an overall score based on these factors, plus the time you spent asleep."
  ],
  "headers": {
    "0": "One minute review",
    "7": "Design",
    "13": "Meditation",
    "19": "Sleep tracking",
    "26": "Don't buy it if"
  },
  "links": {
    "Muse 2": "https://www.techradar.com/reviews/muse-2-review",
    "Withings Sleep Analyzer": "https://www.techradar.com/reviews/withings-sleep-analyzer"
  }
}