{
  "source": "https://www.techradar.com/reviews/andaseat-jungle-pro-gaming-chair",
  "title": "AndaSeat Jungle Pro Gaming Chair review",
  "category": "computing",
  "updated": "2021-03-16T16:49:32Z",
  "author": "rosario-blue",
  "summary": "A high-quality ergonomic experience on a budget",
  "verdict": "The AndaSeat Jungle Pro gaming chair is good value for money whilst remaining high quality. It has five tilt settings that make it versatile for other uses than gaming, and while the memory foam lumbar and neck support is very good, but the size won’t suit larger players.",
  "pros": [
    "Value for money",
    "Memory foam neck and lumbar support cushion",
    "Five different tilt controls"
  ],
  "cons": [
    "Not a great fit for larger gamers",
    "2D height arm rests, not 4D"
  ],
  "article": [
    "The AndaSeat Jungle Pro Gaming Chair is medium-sized, stylish, ergonomic, and a good choice if you’re on a budget and don’t want to skimp on quality.",
    "It’s relatively straightforward to set up, but it might be handy to have someone around to help you with certain parts of the setup. Attaching the seat to its stand can be difficult as the chair is quite heavy; this of course depends on your own physical strength. Due to this, the time to set it up will vary from person to person.",
    "The material is a high quality PVC leather, and feels strong and sturdy. It's damage resistant, which is perfect if you’re a pet owner saddled with a furry friend who loves to destroy your property for sport. It’s also gratifyingly easy to clean.",
    "It is also available in red, so if you prefer a bit of color on your gaming chair, you have that option.",
    "The AndaSeat Jungle Pro Gaming Chair is normally priced at $349.99 (around £250, AU$450), but at the time of writing it's on sale on the company’s website for $299.99. It’s also available on Amazon for $279 (around £200, AU$360). The red version is a little more expensive at $299.99 (around £225, AU$400). The price of gaming chairs of this quality can often start from around $450 and up, so it’s definitely on the budget side.",
    "The Jungle Pro is fully adjustable, reclining between 90 and 160 degrees, and there are five different angles that you can lock it to. It can also rock back and forth with pressure. This makes it great for a number of different uses: reading, napping, resting, work, and of course, gaming. You’re almost guaranteed to find an angle that works for you.",
    "The seat height can be adjusted to a maximum of 200cm. The Jungle Pro has a high back rest but is not suited to anyone over six foot. It has an ergonomic design and great memory foam lumbar and neck support cushions which are also adjustable and removable. This is especially good for people with back pain or a disability that affects their neck and lower spine.",
    "The arm rests do not offer very much; you can only adjust their height. If they were four-dimensional, they’d make the chair near-perfect, as you could match the various tilt positions better.",
    "As with the cushions, the seats are also memory foam. While the seat is relatively deep, it isn’t wide enough for larger gamers, and it can only take up to 120kg of weight. If you’re looking for a gaming chair that is wider and gives you the option to sit cross-legged, if that’s your thing, then this is not the best option for you.",
    "Its swivel is 360 degrees, so if you enjoy a little spin with a dash of nausea, or your setup is arranged in such a way that allows for room to maneuver around your work or gaming space, then this is great.",
    "Speaking of “work or gaming space”, this is a great chair for both work and play. It looks professional enough to use in any Zoom call or other online conferences or meetings, and still maintains a classic gaming chair look."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don’t buy it if…"
  },
  "links": {
    "AndaSeat Jungle Pro Gaming Chair": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1731220859184815600&xs=1&url=https%3A%2F%2Fwww.andaseat.com%2Fproducts%2Fandaseat-jungle-series-premium-gaming-chair%3F_pos%3D1%26_sid%3D9d227f656%26_ss%3Dr&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fandaseat-jungle-pro-gaming-chair",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fgp%2Fproduct%2FB081H1KYHF%3Fpf_rd_r%3DMRDGR9BY1D898XKGG8D3%26pf_rd_p%3D6e878984-68d5-4fd2-b7b3-7bc79d9c8b60%26pd_rd_r%3Daa953495-66a6-4994-9e1a-a903a437d7e6%26pd_rd_w%3DpgXFY%26pd_rd_wg%3D4r7IZ%26ref_%3Dpd_gw_unk%26th%3D1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1341786371653475300-21",
    "$299.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fgp%2Fproduct%2FB07ZQKNDS2%3Fpf_rd_r%3DMRDGR9BY1D898XKGG8D3%26pf_rd_p%3D6e878984-68d5-4fd2-b7b3-7bc79d9c8b60%26pd_rd_r%3Daa953495-66a6-4994-9e1a-a903a437d7e6%26pd_rd_w%3DpgXFY%26pd_rd_wg%3D4r7IZ%26ref_%3Dpd_gw_unk%26th%3D1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-7781554970253478000-21",
    "wider and gives you the option to sit cross-legged": "https://www.techradar.com/reviews/anda-seat-fnatic-edition"
  }
}