{
  "source": "https://www.techradar.com/reviews/pure-air-pro-electric-scooter",
  "title": "Pure Air Pro (2020) electric scooter review",
  "category": "appliances",
  "updated": "2021-06-03T11:47:47Z",
  "author": "tom-bedford",
  "summary": "A reliable electric scooter that's a good choice for beginners",
  "verdict": "The Pure Air Pro feels safe to drive, and for most people that’s enough. Its design is solid and it’s IP65 rated, so it’ll survive a variety of conditions, and between its suspension and various speed modes it’s easy to feel in control of the scooter. The thing does cost a little more than its competitors though, and it’s heavier than them too so it can be hard to lift when you’ve folded it up.",
  "pros": [
    "Sturdily built",
    "Feels safe to drive",
    "Plenty of lights"
  ],
  "cons": [
    "A little pricey",
    "Heavy to carry",
    "Battery life might not be enough for all"
  ],
  "article": [
    "Given electric scooters are a rather new technology, some people can feel a little uncertain driving them, and that’s probably why Pure created the Air Pro electric scooter – it seems made for people who otherwise wouldn’t feel confident on the vehicles.",
    "This isn't Pure's newest electric scooter, and the Pure Air Pro (2021) brings a few key improvements to this 2020 model - as well as a lower price tag. If you're on the market for a new scooter, it's definitely a more tempting buy. There's also a non-Pro and entry-level Go version in the 2021 generation.",
    "Pure is one of the biggest sellers of electric scooters and bikes in the UK, and the Air Pro (2020) was the first scooter it put out under its name. Saying that, it feels like this scooter was made from lessons gained from all the big scooters that have come out so far.",
    "The Pure Air Pro is sturdily built – it's IP-65 rated to protect from water and dust, it’s made of sturdy materials so it rides smooth, and it can easily be folded down to make it transportable – although it’s worth saying it’s pretty heavy, so it won’t necessarily be easily portable for everyone.",
    "The Air Pro rides really well though – its acceleration is subtle so you’ll never go shooting out from green lights, the brakes feel sturdy enough to stop you quickly, and its suspension prevents you from getting shaken as you ride. In fact, it's one of the smoothest rides we've tried.",
    "The main issue with the Pure Air Pro is that it costs a little more than some competing vehicles, from the likes of Xiaomi others, so the price might be hard to swallow for first-time riders. However this money buys you peace of mind when travelling, which is hard to put a price tag on.",
    "Some may find the battery range a little low, as it's on the smaller side of average, but not everyone will mind, especially given it takes about half the time to charge as most of its competitors.",
    "Overall the Pure Air Pro feels like a great entry-level scooter as it ticks all the legal boxes, will last you a long time, and feels sturdy and comfortable to ride.",
    "The Pure Air Pro cost £679.99 (about $890 / AU$1,230) when it went on sale in early August 2020, but can now be picked up for £599 (roughly $785, AU$1,090) on the Pure website.",
    "At that price, the Pure Air Pro sits roughly in the mid-ranged price category for electric scooters. It costs roughly the same as Ninebot Segway's top scooter, and is slightly pricier than both the Xiaomi M365 Pro (£589.99, or about $750 / AU$1,100), and the SoFlow S02 ( £550, or about $700 / AU$990).",
    "If you want the safely and reliability of the Pure Air Pro but the price is too much for you, it’s worth pointing out Pure confirmed to TechRadar a non-Pro cousin is coming soon, so it may be worth waiting for that.",
    "The Pure Air Pro is a fairly conventionally-designed electric scooter. It comes in two colors, gray and black, and we tested the former.",
    "The scooter has dimensions of 115cm x 50cm x 120cm, which makes it quite big but easy enough to get a secure footing on. Is handlebars feel the appropriate height too. The board has a maximum weight of 120kg, which should accommodate most people as well as heavy backpacks.",
    "On the bottom of the board is the charging port and kickstand - this is fairly easy to open by flicking it to the side, and supports the scooter well. The board also has a grippy decal over it.",
    "The Pure Air Pro has wheels that are 10 inches across, a little bigger than the 8-inch average, so it’s a bit more suited to uneven ground or cobbled floors, and they’re air-filled instead of solid which means you won’t feel every bump in the road.",
    "Pure made a point in how waterproof the Air Pro is, which can be important for scooting in wet-weather conditions. The whole vehicle is IP-65 rated, which indicates it’s totally dust-proof and protected from low-pressure water jets from any angle, and the insides of the thing is designed to be as water resistant as possible.",
    "In fact, the tech inside the scooter can be replaced by hand, so if your battery gives out or you need to change it, you can do it yourself without sending the scooter in (if you feel up to it, of course).",
    "The handlebars are fairly average size, as we said, and wide enough too that they’re comfortable to hold. On the left bar is the bell, and on the right is the display you use to control the scooter settings.",
    "The display has three buttons – one turns the lights off and on, another changes the riding mode, the final one turns the scooter on and off (and can also be used to change the distance viewed). The display is backlit, which should help people riding at night.",
    "Below the display is the button you press to drive – it’s slightly smaller than that on some other scooters we’ve tested, so might take getting used to for people who have used other scooters, but we didn’t have any problems with it.",
    "The Pure Air Pro has a light on the front and another on the back, as well as reflectors on both sides. In short, it’s decked out enough to ensure you’ll be visible when riding after dark.",
    "You can fold the Pure Air Pro down using a catch on the front, with a clasp on the back wheel letting you keep it folded. This lets you carry it onto public transport or reduce its size so you can pop it in your house",
    "The folded dimensions are 115cm x 50cm x 50cm, so it’s quite a bit shorter when folded but not tiny. At 17kg the scooter is very heavy though, given most scooters weigh 10-14kg, and we’d imagine some might have trouble transporting it when folded.",
    "In fact, unless you’re looking at a top-end scooter (as they often have huge batteries and motors), this might be one of the heaviest scooters you look at. Suffice to say, carrying this frequently will constitute quite a workout.",
    "In addition there’s no-where on the scooter that you could easily tie a lock around, so it might not be safe to leave outside depending on where you live.",
    "As with all electric scooters, the Pure Air Pro’s time between charges really depends on how fast you’re driving, and faster speeds will cause the battery to drop quicker.",
    "Pure estimates that in ‘Eco’ mode, the slowest you can travel in (which we’ll describe in more detail later), you’ll be able to travel about 36km, but in the fastest mode you’re looking at 30km or less.",
    "Battery life depends on more factors than just speed, such as hills and how frequently you stop, but those estimates are on a flat plane.",
    "We’d concur with the Eco mode number, as the battery stayed fairly strong at this speed, but when we were driving as fast as possible the power did drop pretty quickly. In fact, we’d guess you’d need to be pretty canny with your driving to get it to last even 30km in this mode.",
    "Depending on your commute and regular journeys, the distance between 30km and 36km might be moot, and if you only need to go 25km or less every day you’ll find the Pure Air Pro fine for purpose. It might not suit those looking to regularly travel long distances though, and there are other scooters that last longer.",
    "If the comparatively low battery life irks you, it might be offset somewhat by the charging speed, as Pure says it’ll power up in just four and a half hours - that’s roughly half as long as most other scooters take to power up. So you won’t need to keep this beast powering up overnight every time you want to use it, as a quick burst before and after you get in will suffice.",
    "A power cable is included with the scooter that plugs into the board of the vehicle - it’s very easy to set up.",
    "The Pure Air Pro has three riding modes: Eco, which takes you at 15kmph (9.3mph) and preserves battery longest, Mid, which goes up to 20kmph (12.4mph) and High which takes you to the scooter’s top speeds of 25kmph (15.5mph), which is also the UK legal limit for scooters.",
    "Well, you can get faster than 25kmph on hills thanks to gravity, but the scooter won’t help you get there, so it’s still legal. That top speed is below the max speed on some other scooters, but since the UK law forbids faster scooters (unless you’re on private property), it makes sense that Pure would put the hard limit.",
    "On quieter streets Mid feels perfect, but when you ride on busier roads you'll need to move to High to keep apace with cyclists and traffic. We're not sure Eco is best for any kind of environment, unless you're looking for a particularly leisurely pace.",
    "The Pure Air Pro feels smooth to ride, more so than some other scooters we’ve tested, and you can feel much safer on the road as a result. We’d guess this was the result of the air-filled tyres, the sturdy build. and some fair suspension too.",
    "Acceleration on the Pure Air Pro is slower than on some other scooters, but this is a good thing, as rapid acceleration from ‘go’ can be very dangerous - it’s hard to keep control when you’re shooting off forward after standing still. Thanks to the slower acceleration we always felt safe starting from scratch or just speeding up on straighter pieces of road.",
    "You do need to kick off a few times with your foot before the accelerator works, as with all scooters, and this can be frightening on a busy road. The minimum speed for this to work on the Air Pro is pretty low though, so you won't find yourself kicking too much before scooting off.",
    "The brake felt very secure , and when we squeezed it tight we stopped pretty quickly, but it was perhaps less useful as a tool to modulate speeds, as we had to grip it quite hard to get it to work. We found it easier just to remove our finger from the accelerator ahead of time to slow speeds, rather than press the brake near to where we needed to stop.",
    "We were impressed by the noise of the Pure Air Pro - or, the lack thereof. It was very quiet, even when going at top speeds or up hills - in fact, we wouldn’t have noticed it at all if it wasn’t on our list of things to test out on the scooter. Your neighbors certainly won’t be annoyed if you buy this scooter.",
    "It goes without saying, some of the quirks of electric scooters are here as expected. Holding the accelerator button for long stretches of time can give you a sore thumb, and you can very easily feel wobby when stretching out an arm to indicate a turn, but no electric scooters have solved these issues yet.",
    "Generally though, we felt supremely safe and comfortable on the Pure Air Pro, more so than on some other scooters, and would recommend it to tentative riders.",
    "When we tested the Pure Air Pro the scooter didn’t have a tie-in app, but the Pure Electric app launched since.",
    "Scooter apps are really handy – they can let you check the charge of your vehicle while you’re not riding it, view stats for your individual and collective journeys on the thing, remotely lock the scooter and get it warmed up before a journey, depending on the scooter and app in question.",
    "The Pure Electric app lets you check the speed you're travelling at (only useful if you're actually moving, obviously), the remaining battery and the potential range you've got left. You can also toggle the lights and lock the scooter."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Pure Air Pro price and release date",
    "11": "Design",
    "21": "Portability",
    "25": "Battery",
    "32": "Riding",
    "42": "App",
    "45": "Don't buy it if..."
  },
  "links": {
    "electric scooters": "https://www.techradar.com/best/best-electric-scooters",
    "Pure Air Pro (2021)": "https://www.techradar.com/reviews/pure-air-pro-2021-electric-scooter",
    "Pure website": "https://www.awin1.com/awclick.php?awinmid=17069&awinaffid=103504&clickref=trd-us-1237197273789752800&p=https%3A%2F%2Fwww.pureelectric.com%2Fproducts%2Fpure-air-pro-electric-scooter",
    "Xiaomi M365 Pro": "https://www.techradar.com/reviews/xiaomi-m365-pro-electric-scooter-review"
  }
}