{
  "source": "https://www.techradar.com/reviews/panasonic-eh-na67-hair-dryer",
  "title": "Panasonic EH-NA67 hair dryer review",
  "category": "appliances",
  "updated": "2021-10-12T14:07:14Z",
  "author": "carrie-ann-skinner",
  "summary": "The unusual design doesn’t detract from the fast drying times",
  "verdict": "The Panasonic EH-NA67 hair dryer is powerful and fast when it comes to drying locks, while also ensuring your scalp doesn’t overheat. It’s comfortable to use, plus the built-in nanoe technology ensures shiny tresses after every blow dry. However, the unusual design won’t appeal to everyone and it’s bulky, too.",
  "pros": [
    "Fast drying speeds",
    "Stops the scalp burning",
    "Shiny hair every time"
  ],
  "cons": [
    "Unusual design",
    "Bulky",
    "Lacks a premium feel"
  ],
  "article": [
    "When it comes to hair care appliances, Panasonic is one of the most well-known brands on the market today. With more than 80 years of experience, it’s no surprise the company can give salon brands such as GHD, and newcomers such as Dyson, a run for their money with models that are loaded with technology but that come in at a more affordable price.",
    "The Panasonic EH-NA67 is the brand’s latest hair dryer, building on the EH-NA65 with the inclusion of an oscillating quick-dry nozzle. Evenly distributing the air flow from the hair dryer, the EH-NA67 reduces hot spots on the hair and the scalp.",
    "Like the EH-NA65, the EH-NA67 uses ‘nanoe technology’, where tiny water particles – which Panasonic claims offer 1000 times more moisture than ions (another hair hydration technology) – penetrate the hair cuticle to restore moisture balance, subsequently reducing frizz and heat damage.",
    "As such, the EH-NA67 sports the same unusual design as the EH-NA65, with a nanoe outlet that forms a hump on top of the barrel – it reminds us of the cockpit section on the exterior of an aeroplane.",
    "Just like its predecessor, the hair dryer has four temperature settings, three speed levels and a cool-shot function. The 2000W hair care appliance also comes with a diffuser and a concentrator nozzle, along with the quick-dry nozzle, ensuring you can create everything from bouncy curly styles to sleek, smooth tresses.",
    "At $149.99 / £99.99, the Panasonic EH-NA67 is a mid-range hair care appliance that can dry hair quickly, while still maintaining shine and reducing frizz for less than similar models from GHD and Dyson. If you’re on a limited budget, it’s certainly worth considering.",
    "The Panasonic EH NA67 is priced at $149.99 / £99.99 and is available in the US and the UK from Panasonic and online retailers such as Amazon.",
    "As we’ve already mentioned, Panasonic offers the EH-NA65, too, which comes with a quick-dry nozzle that doesn’t oscillate. This model is available worldwide and will set you back $99.99 / £69.99 / AU$229.99.",
    "As mentioned, the Panasonic EH-NA67’s unusual design with a hump on the top of the barrel means it’s a relatively bulky hair care appliance, measuring 9 x 3.5 x 7.9 inches / 23 x 9 x 20cm (h x w x d). However, it weighs 1.2lb / 547g, which is lighter than we expected. In fact, we didn’t suffer any arm-ache at all when drying shoulder-length hair.",
    "Just like its predecessor, the hump on the barrel has been accented in a different color to create a design feature, although this time it’s a cool gold tone rather than a rose gold hue.",
    "The hair dryer offers 2000W of power in the UK alongside four temperature settings and three speed levels. However, the US model comes with only three temperature settings, two speed levels, and is 1875W. Both versions include a cool-shot button that delivers a blast of cold air to set your style.",
    "The Panasonic EH-NA67 comes bundled with three attachments: a concentrator nozzle, diffuser, and an oscillating ‘quick-dry’ nozzle. The latter has a plastic section inside the nozzle that swings from side to side to ensure the air flow is evenly distributed. This avoids any one area of the scalp from becoming overheated and scalding as a result. Those who don’t have a mirror conveniently located next to a power outlet will still be able to dry their hair and see what they’re doing, thanks to the EH-NA67’s 9ft / 2.7m power cord. Plus the hanging loop, often found on salon hair dryers, is an added bonus.",
    "Happily, the Panasonic EH-NA67 lived up to its claims of how quickly it dries hair. Using the hair dryer at its hottest temperature and fastest speed setting, we were able to take below-shoulder-length fine hair from damp to completely dry in 3 minutes and 34 seconds. Drying hair on the lowest temperature setting increased this duration by 1 minute and 34 seconds.",
    "Attaching the ‘quick-dry’ nozzle, and using the hair dryer on the fastest and hottest setting, knocked a further 30 seconds off the drying time. In addition, the oscillating nozzle meant we certainly didn’t feel any area of our scalp becoming overly warm during the drying process. However, the swaying motion did cause the hair dryer to judder slightly in the hand. We also found that the length of the nozzle added to the hair dryer meant we had to hold it further away from our hair than is usual, which was slightly uncomfortable.",
    "On all settings, hair was left looking shiny and smooth, with very few fly-away strands. Overall, the EH-NA67 was comfortable to hold in both the left and right hand (we switched hands, depending upon the side of the head being styled). However, since the hair dryer is identical in design to the EH-NA65, we accidentally hit the cool-shot button on several occasions while adjusting our grip of the unit to dry the hair’s roots.",
    "In terms of noise, on the fastest speed setting the EH-NA67 registered 76db on our decibel meter. This puts it middle-of-the-range when it comes to noisy hair care appliances, and is equivalent to the noise made by a vacuum cleaner. However, since it’s likely to be on for only a few minutes at a time, it doesn’t bother too much.",
    "The hair dryer is also easy to keep dust- and lint-free, thanks to the removable filter.",
    "First reviewed: September 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Panasonic EH-NA67 price and availability",
    "8": "Design",
    "12": "Performance",
    "17": "Don't buy it if..."
  },
  "links": {
    "hair dryer": "https://www.techradar.com/best/best-hair-dryer-5-hair-dryers-for-smooth-and-shiny-styles",
    "EH-NA65": "https://www.techradar.com/reviews/panasonic-eh-na65-hair-dryer-review",
    "vacuum cleaner": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}