{
  "source": "https://www.techradar.com/reviews/narwal-t10",
  "title": "Narwal T10 review",
  "category": "appliances",
  "updated": "2021-09-07T14:01:33.008Z",
  "author": "nick-rego",
  "summary": "A whale of a time",
  "verdict": "The Narwal T10 robot vacuum is certainly one-of-a-kind in the market. With its large water tanks and great mopping skills, it’s excellent to have around the house to mop up after small spills or just tackle your entire house. Where things fall a bit is with a very temperamental app, as well as poor carpet vacuuming skills. For its price point, there’s still a bit of work that needs to be done to make the Narwal T10 a solid recommendation.",
  "pros": [
    "Good mopping ability",
    "Large water tanks",
    "Sleek design"
  ],
  "cons": [
    "Poor performance on carpet",
    "Buggy app",
    "No scheduled cleaning"
  ],
  "article": [
    "The Narwal T10 really does stand out amongst the sea of robot vacuums. While others may tout great vacuuming skills with a mopping feature added on, it seems that the T10 is a great mopping robot with a vacuuming feature added on.",
    "That’s not to say that the T10 isn’t a good vacuum cleaner, but it definitely does struggle in certain situations, particularly if there’s carpet involved. The absence of a roller brush underneath the vacuum means that stuff that’s stuck in your carpet – even low pile ones – will most likely remain hidden deep in the carpet fibres, as the T10’s suction power isn’t enough to pull it out. On hard floors the situation is much better, so if you live in a space that’s devoid of carpeting or area rugs, you’ll do just fine.",
    "The flagship feature of the T10 has to be its mopping ability, where Narwal have intelligently decided to remove the water tank from the robot itself and place it on the base station. What’s more, there’s two massive tanks here – one for clean and one for dirty water, making the T10’s massive base station a huge plus point.",
    "The actual mopping is also a refreshing change from what we’ve seen on other robots, who often just drag a miserable damp cloth after them in the hopes that this will clean up floors. The T10 puts a fair bit of elbow grease into its scrubbing, and experimenting with the number of passes and moisture levels will soon hit a sweet spot for your cleaning needs.",
    "Where things do fall a bit short - apart from carpet cleaning – is with the companion app, which can really be a bit of a stretch to get used to. There’s also no way to schedule for a cleaning or mopping cycle, which is a huge oversight on Narwal’s part; one we hope the company will soon address in a future software update.",
    "The Narwal T10 is available directly from Narwal’s website, priced at $1,099.",
    "By comparison, you can get an iRobot Roomba i7 robot vacuum and the Braava Jet m6 mopping robot bundled together for $945. However, that would mean having to charge and clean two separate devices, which is extra work. The T10’s high price tag is justified, given that it’s got a much larger cleaning capacity for mopping, it cleans itself, and does better mopping than other models we’ve tested.",
    "The Narwal T10 resembles a soft ‘D’ design rather than the normal circular design we’ve become accustomed to for robot vacuum cleaners. Towards the back of the robot is a LIDAR sensor that the robot uses to map its surroundings, in addition to an in-built laser mapping algorithm. The front soft bumper protects the robot from slamming into objects or furniture, and also helps it map out obstacles to avoid in the future.",
    "Lift the hood of the T10 and you’ll see just two buttons – one for turning on the vacuum and another to quickly pause or terminate the current cleaning task. You’ll also find the 0.1-gallon dust bin here, as well as a hidden brush cutter that lets you clean the filters and detangle any caught fibers or hair.",
    "Flip the unit over and you’ll see the cleaning brushes attached to the T10. The side brushes scoop up and funnel any dirt into the main suction path of the T10, and these too can be replaced when they’re worn out.",
    "The most obvious difference here is the lack of a brush roller on the T10. This means that while the T10 is great for scooping up dirt on hard floors and surfaces when it comes to dirt lodged in the fibers of a carpet, the T10 won’t be able to lift these out. That’s one of the sacrifices you’ll have to make here, as an additional roller brush would probably make the mopping module smaller or less effective.",
    "For mopping, you simply tug out the cleaning module and snap-on two triangular pads in its place. The pads themselves have several twisted fibers on them, and you get two additional cleaning pads in the box. While the T10 will wash the pads during cleaning and dry them off, it’s a good idea to remove the pads from the robot and wash them properly by hand as well, simply because we found that the T10’s washing skills to not be adequate enough to remove stubborn dirt from the pads.",
    "The base unit for the T10 is one of the biggest we’ve seen for a robot vacuum, and you’ll want to make sure that there’s enough space for it wherever it’s being set up. Inside the base station, you’ll find two large 1.1-gallon tanks – one for clean water and one for dirty water that is siphoned in while the mopping pads are being cleaned. The tanks are durable and easy to take out, and can be cleaned or refilled without any complications. Say goodbye to filling tiny trays with water – this massive tank capacity means that you can go through several cleaning cycles before the robot reminds you to add in more water or clean the dirty water tank.",
    "The base station also has two buttons and an LED screen that shows the status of the current cleaning cycle. You can ‘eject’ the robot from the base station to quickly change between the cleaning and mopping attachments, as well as start or end a cleaning cycle. You can also recall the robot to the base station wherever it is in the house, which is another handy feature. There’s also a simple child lock feature that you can enable to stop curious hands from accidentally starting a cleaning cycle.",
    "What we really like about the base station from a design perspective is that it almost entirely hides the T10 inside when not in use, so there's no risk of anything tripping over it.",
    "Bundled with the T10 are an extra set of pads and side brushes, as well as a magnetic stripe that you can put down in places you want the robot to avoid. There are also two packs of detergent sheets (20 sheets in each pack) which you dissolve in the clean water tank. The sheets last for quite a while, and Narwal sells them at a very reasonable $19.99 for a pack of forty sheets. For best results, it's recommended that you use these detergent sheets rather than trying to add in regular floor cleaner or other cleaning agents.",
    "Set-up was relatively simple, just download the app and go through the steps to connect the T10 to your home Wi-Fi network so you’ll be able to track its progress and maps. While the app did display both our 2.4GHz and 5GHz Wi-Fi networks, we only had a successful connection when we paired it with our 2.4GHz network. We did have to attempt several times to pair the T10 to our network, and after two reboots of the robot, it finally connected.",
    "Before the Narwal T10 can begin cleaning your floors, it'll need to map your home. Most cleaning robots will do this automatically during their first cleaning cycle, but we actually prefer that the T10 does this first. We found the robot vacuum quickly scooted about our home discovering each room and corner, before going back to its base station. The process took about ten minutes for our 600 sq ft apartment, and once the unit returned to the base station we could kick off a cleaning cycle.",
    "Our test apartment consists of tiled floor with one large medium pile rug in the living room under the couch. We started off with the vacuum module attached, so that we could clean up the area of dirt and debris before mopping.",
    "As expected, the T10 did a good job on the tiled areas. It was able to pick up our scattered bits of cereal, crumbs under bar stools, and sand trekked in near the front door. One thing we did notice is that the turning radius of the T10 tends to be a bit wider than other robots, so there are going to be missed spots in some areas, especially near corners.",
    "Where the T10 does struggle is with area rugs. Our medium pile rug had some sand and oatmeal scattered into it, and the T10 was able to pick up about 90% of it. But any that had fallen deep into the fibers of the rug was not picked up, and this is the unfortunate side effect of not having a rotating brush underneath.",
    "In another test apartment that was carpeted, we saw a similar performance from the T10. It was able to pick up most surface dirt and sand, but had to do a second pass in order to pick up more stubborn debris. Even after multiple passes, we could still feel some sand in the carpet. Turning up the suction power on the T10 helped slightly but at the end of the day the absence of a rotating brush underneath means that any dirt that’s hiding deep in your carpets or rugs is going to remain there unless you manually vacuum it out.",
    "The bin is quite small, and depending on the size of your cleaning space will need to be emptied out after every one or two cleaning cycles. The robot will audibly tell you when the bin needs cleaning, but it’s good practice to just empty it out anyway after you’ve finished cleaning. The filter in the bin can be removed for washing and proper cleaning, but you should replace it every few months as recommended by Narwal.",
    "When you need to mop, simply swap out the vacuum module for the two triangular pads, press the start button on the base station, and the T10 takes care of the rest. The base station first sprays clean water onto the pads, after which the robot will head to the room that’s furthest from the base station and start mopping. The logic behind this is so that the dirty pads aren’t dragged over already-cleaned surfaces.",
    "What makes the T10 so unique is that after about five minutes or so of mopping, it will return to the base station to clean itself. Yes, you heard that right – it cleans the pads before resuming its mopping duties. Again, water is sprayed onto the pads which rotate inside the base station and rub against small grooves to dislodge dirt.",
    "The dirty water is then sucked up into the dirty water tank, and fresh water is sprayed onto the pads to resume cleaning. The whole process takes a few minutes to finish before the T10 is off again on its mopping duties, and is actually quite fascinating to watch. The noise level from the washing and sucking up of the dirty water can be a bit loud, but is brief. To top it all off, after the final pad washing and the mopping cycle is complete, air is blown onto the pads to dry them out and prevent mold.",
    "Despite this unique self-cleaning mechanism, you’re going to want to pull off the pads from time to time and wash them properly by hand. Even after a cleaning in the base station, the pads were still quite dirty, so you’ll want to make sure that the pads are properly cleaned every few cycles.",
    "The actual mopping capabilities of the T10 are quite good. It lifted a surprising amount of dirt from our floors, and the dirty water in the tank was proof of this. The pads themselves do a decent job of getting stains off, though dried and stubborn stains or sticky substances may prove a bit of a challenge. We spilled some maple syrup on the floor and let it dry out a bit, and the T10 was able to get most of it off, but a sticky residue remained after the floors had been left to dry.",
    "Time-wise, we found that the T10 was on the slightly slower side both for vacuuming and for mopping. In vacuum mode, the T10 took about 40 minutes to clean the entire space, while mopping took around 55 minutes in total. We’d definitely recommend turning on the T10 and leaving your house for a bit while it cleans in peace. We’d had other robots vacuum the same space in as little as 25 minutes, and still be just – if not more – effective at swallowing up dirt and dust.",
    "You’ll want to download the Narwal app in order to properly use and configure the T10, or you’ll be missing out on a lot of features.; for example we were able to specify how many times an area was to be mopped, as well as how damp we wanted the pads to be. Selectively mopping or vacuuming a room is as easy as tapping on the room in the app, and pressing Start. What you can't do however, is mop a small area by drawing it in the map - you have to mop the entire room instead.",
    "Unfortunately, Narwal’s app needs a lot of work to be as slick as other manufacturer offerings. You can section off different areas of the map to mark off different rooms, but you’re limited to only eight preset names, which might not work for larger homes (the app appends a number to rooms of the same type). You can create no-mop and no-sweep zones to keep away from rugs for mopping, but making these zones can be very fiddly and involved a lot of zooming in and moving things around in the app due to overlapping elements. There is also no way to schedule a cleaning cycle, which is a criminal oversight for a robot vacuum. Smart assistant integration is also missing here, which we’re hoping will come with a future app update.",
    "One benefit of the T10 is its massive 5800 mAh battery, which means that it can run for longer cleaning cycles than other robot vacuums. Narwal pegs the battery life at around three hours per charge, though it doesn't specify whether this is in vacuuming or mopping mode.",
    "We found that the T10 was more than able to vacuum and then mop our 600 sq ft apartment in a single charge, which took a little under two hours to accomplish. If you've got a larger space, the robot will return to the base station to recharge before resuming its cleaning duties. Recharge time to a full battery is about two and a half hours, so you don't have to wait too long to have the T10 rolling around your house again.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Narwal T10 price and availability",
    "7": "Design",
    "17": "Performance",
    "29": "App",
    "31": "Battery Life",
    "33": "Don’t buy it if…"
  },
  "links": {
    "robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "vacuum": "https://www.techradar.com/news/best-vacuum-cleaners",
    "iRobot Roomba i7": "https://www.techradar.com/reviews/irobot-roomba-i7"
  }
}