{
  "source": "https://www.techradar.com/reviews/lexmark-mc3326i",
  "title": "Lexmark MC3326i review",
  "category": "computing",
  "updated": "2021-06-17T20:00:44Z",
  "author": "jim-hill",
  "summary": "Compact laser with a large appetite",
  "verdict": "This compact and robust all-in-one office printer churns out professional-looking pages securely and speedily, but it’s not the most cost-effective option",
  "pros": [
    "Solid build quality",
    "50-sheet ADF",
    "Vivid print quality",
    "High duty cycle"
  ],
  "cons": [
    "No NFC or Bluetooth",
    "Single side scan only",
    "High running cost",
    "Slow touchscreen"
  ],
  "article": [
    "The Lexmark MC3326i is a modest multifunction laser printer aimed at the small to medium sized business. But despite its size, this all-in-one has sufficient capacity for toner and paper to satisfy a busy office and Lexmark suggests a maximum monthly duty cycle of a staggering 50,000 pages.",
    "With its steel-frame construction and robust security features, it certainly looks competitive in its class and at around £359 (US$506, AU$657), the Lexmark MC3326i will appeal to anyone with a low budget and high print load. There are a few features missing, however, and the ongoing consumables cost is something to consider, so let’s take a closer look.",
    "The Lexmark MC3326i is a little smaller than other laser AOIs offering the same functionality, but at nearly 20kg, it’s no lighter. That solidity inspires confidence in the build quality, especially when you learn about the integrated steel frame and long-life imaging components used in its construction. This printer comes with a four-year guarantee upon registration.",
    "The main printer section is almost a neat cube with a cut-away corner where the small touchscreen display is angled upwards for your convenience. The 50-sheet ADF (automatic document feeder) and flatbed scanner sit on top of this. If you only need a printer then the CS331dw print-only device is considerably smaller.",
    "At the rear are connections for an Ethernet cable and USB data cable with a USB Host port conveniently located beside the front panel display.",
    "Above the main paper tray is a slot for loading single sheets of paper such as headed stationary or envelopes for one-off print jobs.",
    "Part of the front panel levers open to reveal the four large toner cartridges inside. High capacity cartridges capable of yielding 3,000 black and white pages, or 2,500 colour are available for this model, but be warned that the bundled cartridges can only manage 750 monochrome or 500 colour pages.",
    "The MC3326i is Lexmark’s latest entry-level laser all-in-one and comes with most, but not all of the features found on the average office printer. It can duplex print, but not duplex scan, it has Wi-Fi built in, but not NFC or Bluetooth. There’s a touchscreen, but it doesn’t tilt and it can print on most media types up to A4, but it cannot handle paper heavier than 176gsm. When we tried a sheet of card, it got stuck inside.",
    "The ADF is quite large and capable of copying a stack of 50 A4 sheets, but it can only copy one side, unlike many of its competitors. The scanner bed is A4 in size and 600 x 600 dpi in resolution, which is as expected. It works very well as a fax machine too.",
    "It’s not the fastest laser printer out there, but at 22ppm (pages per minute) in simplex mode, it leaves most inkjets behind and it’s not much slower in auto duplex mode. The first page out time is given as 10.6 seconds, although we found it often took much longer. This device’s dual core 1GHz processor and 512 MB memory combination could be the limiting factor here.",
    "Lexmark has strong security features on all of its printers and with this one, you can set a PIN that must be typed in to access it, or to collect your own print job at the machine. The output bin can hold 100 sheets of paper, while the main input tray can hold 250 sheets.",
    "Setting up the Lexmark MC3326i can be done via the touchscreen interface, but you can also use a companion app for iOS or Android called Lexmark Mobile Assistant. For some reason, this is separate to the app called Lexmark Print, which you will also need to download if you want to print and scan using your smartphone. The app support here is not as strong as Lexmark’s competitors.",
    "The 2.8in (7.2cm) colour touchscreen is on the small side and there is some delay in registering each button press so you need to patient with this one. It is presented at a convenient angle, but it would be easier to read if it were able to tilt. The main paper tray is easy to load and the single-sheet multipurpose tray that some printers lack is also an advantage. However, you have to load this slot more carefully for the printer to be able to take hold of your envelope, or whatever you are inserting.",
    "The Lexmark MC3326i passed all of our performance tests with flying colours — and very vivid colours they are too. Maps and line diagrams appear sharp with bold colouring and hard edges.",
    "Even photographs, which most laser printers handle poorly, appeared bright and clean. What the Lexmark MC3326i does best is churn out page after page of perfectly crisp monochrome text. At 22ppm, it’s not especially fast (the Xerox VersaLink B600 prints at 55ppm), but it is consistent. It’s also a little louder than some printers at 50dB when in full swing.",
    "Part of the appeal is the darkness the characters, which makes you wonder how much toner you’re using up and we should point out that the running cost here is higher than its competitors at around 3.3p per mono page and 15.8p per colour page.",
    "The Lexmark MC3326i looks and feels like a multifunction printer that’s built to last, while the quality of its printed pages are beyond reproach. And while the key features are present, such as a touchscreen, PIN security and ADF, it’s a pity it can’t scan both sides of the page or print on stiff card. It prints very well, but the ongoing consumables cost is higher than its rivals, so we recommend the Lexmark MC3326i with some reservations."
  ],
  "headers": {
    "2": "Design and build",
    "7": "Features and specifications",
    "11": "Setup and operation",
    "13": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "Lexmark MC3326i": "https://www.lexmark.com/en_us/printer/21758/Lexmark-MC3326i",
    "laser printer": "https://www.techradar.com/news/best-laser-printer",
    "Xerox VersaLink B600": "https://www.techradar.com/reviews/xerox-versalink-b600dn"
  }
}