{
  "source": "https://www.techradar.com/reviews/shockbyte",
  "title": "Shockbyte review",
  "category": "computing",
  "updated": "2021-10-27T15:47:36Z",
  "author": "mirza-bahic",
  "summary": "Kickstart your Minecraft server with an amazing host from Australia",
  "verdict": "Shockbyte is an Australia-based host specialized in game server support with an emphasis on Minecraft, although it provides servers for Rust, ARK: Survival Evolved and Valheim as well. Among many of its competitors, Shockbyte stands out with a whole array of features, dirt-cheap packages and promises a smooth multiplayer gaming adventure with no latency nor downtime.",
  "pros": [
    "100% uptime guarantee",
    "Customer support is available at all times",
    "Easy-to-use control panel",
    "Unlimited disk space with all packages",
    "Very budget-friendly options"
  ],
  "cons": [
    "A bit stingy 24-hour money-back guarantee",
    "Customer support could use some improvement"
  ],
  "article": [
    "Shockbyte came into existence in March of 2013 with a mission to make server hosting for games like Minecraft “easy and affordable” to everyone looking for an action-packed adventure or simply to upgrade their gaming skills. Headquartered in Victoria (Australia), Shockbyte has been regarded as one of the pioneers and top server hosting providers for the titans of multiplayer gaming like Minecraft, Rust, ARK: Survival Evolved and a few others.",
    "Although initially focused on Australia, Shockbyte is present on three continents today: Europe (the UK, Germany, France and Poland), Asia (Singapore) and North America (the USA and Canada).",
    "The visual style of Shockbyte’s main website corresponds with the style of game that played a major role in making them famous. Even Shockbyte’s staff has been transformed into much-appreciated pixelated Minecraft-like characters, which is absolutely amazing. The same fate befell Shockbyte’s official blog which is packed with various articles Minecraft fans are sure to find quite interesting. The blog itself seems active enough, with a few articles coming out every month.",
    "As for social networks, they are currently present on Twitter, Facebook, Instagram, Twitch, Discord and most notably YouTube, since it’s supplied with superb step-by-step video tutorials many users will surely find helpful. Since Twitter and Facebook function as support channels as well, if you are a fellow-user, feel free to reach out to them at any sign of trouble.",
    "To make your gaming dreams come true, Shockbyte offers twelve different plans (most of them are named after different blocks of resources from Minecraft), three of which are premium (“Spartan”, “Zeus” and “Titan”).",
    "All plans include a 100% uptime guarantee, protection against DDoS attacks, 24/7 support and a free subdomain. The number of GBs of RAM you’ll get and a number of slots (which is actually a recommendation, since the number is unlimited with all plans) depends on how deep you are willing to dive into your pockets. The most pocket-friendly pan is labeled as “Dirt”, it costs $2.50 per month and comes with 1GB of RAM and 20+ slots. On the other end, the most expensive one starts at $40 a month and includes 16GB of RAM and use of NVMe SSDs, which should be six times faster than a regular (SATA) SSDs.",
    "If none of the pre-designed plans meet your needs, you can create a custom one, which is always a good choice to have.",
    "At this moment, there are two free trials provided with all Minecraft server hosting plans. One is “45 Days of the Enjin Advanced” plan, which will allow you to create a Minecraft server website with features such as donation store, vote for diamonds and much more. The other one is “30 Days of Buycraft Premium”, which is the best-known webstore solution for Minecraft servers.",
    "Instead of a standard 30-day money-back guarantee (most of the other hosts have spoiled us with), Shockbyte provides one valid for 24-day only, so make sure you test them as soon as you can and notify the support, if needed.",
    "As for methods of payment, Shockbyte accepts credit/debit cards, PayPal and Paymentwall.",
    "It doesn’t matter if you are looking for a network server for a couple of gamers or you want to gather a group of 10 or more, ShockByte will get you covered. Plenty of plans are on the offer and starting with any of them is as easy as it can get. If you are not here because of Minecraft (which is the website's favorite), few other games are available (Rust, ARK: Survival Evolved and Valheim) and two of them should be coming soon (Hytale and Arma 3).",
    "If Minecraft is what you want, you can choose between classical PC and Bedrock edition (which is a better choice for cross-platform gameplay). Since all plans are presented in an easy-to-understand way, opting for one should pose no problem. After this, you’ll proceed to your cart, where you’ll be asked to select a billing cycle, currency, server location, and decide if you want a dedicated IP (which will cost you $5) or server management services (which go for $15 per month). This service ensures that ShockByte’s technical team will install and configure all plugins, mod packs and customer jars for you. However, since ShockByte provides a convenient one-click installer, you can save up some money and do it on your own without a hitch.",
    "To finish your purchase, if you don’t have an account with ShockByte already, you’ll have to create one by filling out a familiar form with your personal data (nothing out of the ordinary). We advise reading Terms of Service through and through, since a large number of complaints customers had with ShockByte’s services could have been avoided only if they have done so.",
    "Thanks to the instant setup feature, after the payment is complete your server should be up and running in less than a minute. The control panel ShockByte includes within its Minecraft plans is known as Multicraft, which is an easy-to-use and one-stop-solution for all aspects of your Minecraft server. The control panel for Rust and Ark are based on Multicraft, so you shouldn’t have much trouble finding your way around.",
    "With ShockByte’s one-click installer you can make use of any of forty different modpacks (including Forge, Feed the Beast, ATLauncher, Technic Modpacks, Vanilla and so forth). The same goes for a variety of plugins, which can be installed via the “Plugin List” feature in the control panel or you can manually upload them via FTP. All in all, as soon as you familiarize yourself with Multicraft, you’re ready to embark on a great adventure.",
    "Shockbyte utilizes NVMe SSDs, which implies their speed should be six times faster than standard SSDs and twelve times faster than HDDs, which is lightning fast. With the speed performance of Shockbyte’s servers in mind we tested the performance of their main website, which should be using SSDs at a minimum. After checking it out with GTmetrix (our speed testing tool of choice), we received pretty good news. The overall score wasn’t picture perfect, but was close enough with an A (94%).",
    "Since Shockbyte provides a top-of-the-class 100% uptime guarantee covered by SLA, can you expect your server to run round-the-clock without a trace of downtime? Not exactly, but you should be compensated accordingly for every five minutes of downtime, which should slightly ease the pain of being kicked out of the game while you were getting rid of your existential dread by punching a tree. To test this out, we monitored the uptime of their main website without rest for a month by using UptimeRobot as our tool. Not surprisingly, not a single second of downtime was found on our record, thus justifying Shockbyte‘s confident 100% uptime guarantee.",
    "As there is no rose without a thorn, neither is Shockbyte a host without a fault, particularly when it comes to its customer support, it seems. After investigating what Shockbyte’s users think of them, the most complaints were linked to responsiveness of their support team, so we were compelled to check this out for ourselves. Already prepared to wait a while, we threw them a couple of questions via chat and got our reply in a little over 30 minutes, which is not too bad. However, we are pretty aware that someone with a more complex issue might be less fortunate than we were.",
    "In addition to live chat, Shockbyte’s technical team can be reached via support ticket. Since its support isn’t famous for being lightning fast, you can kill time by exploring their self-help options, which are (actually) commendable. Besides the YouTube channel, there is a FAQ section and a comprehensive knowledgebase with more than 200 articles, 167 of them dedicated to Minecraft.",
    "Both Apex Hosting and Shockbyte employ Multicraft as their control panel to ensure an intuitive user experience. Both hosts offer a wide variety of different-sized plans, a broad network of server locations around the globe, a full range of mods and plugins, free backups and much more. However, while Apex Hosting uses SSD hard drives to provide blazing-fast, lag-free servers to its customers, Shockbyte goes a step further and throws in cutting edge NVMe SSDs which should outperform a regular SSD by a sixfold.",
    "Bisect Hosting is another popular option and one that, much like Shockbyte, allows its users an impressive amount of flexibility with their plans. In terms of options and features the two of them are remarkably similar, however, the most budget-friendly option with Bisect Hosting starts at $7.99 per month, while it’s mere $2.50 per month with Shockbyte. Hence, if you are looking to save a few bucks, go with Shockbyte. If you are looking for a host to launch your website with, Bisect Hosting can also help you with that, since they are offering shared, VPS and dedicated server hosting. On the other end, Shockbyte is fully focused on Minecraft server hosting.",
    "An excellent alternative to Bisect Hosting, if Minecraft server hosting is not the thing you search for, would be hosts like HostGator and Bluehost. Both of them are one of the most popular choices for newcomers and webmasters alike, with their myriad of hosting options, features and available add-ons. On top of everything, they both provide money-back guarantees, so you can see everything for yourself without a need for concern.",
    "Shockbyte is a rock-solid provider we would recommend to anyone looking to rent servers to host their Minecraft games on the electronic highway. In addition to being beginner-friendly, simple and swift to set up, Shockbyte offers a whole range of features with all of its packages, which are (on top of everything) fit to suit every pocket. Therefore, go and kickstart your Minecraft server with Shockbyte, but if you change your mind along the way, be sure to do it within 24 hours.",
    "However, if you are simply on a lookout for a host to set up your website with, take a look at HostGator and Bluehost, because they have a bit of something for everyone."
  ],
  "headers": {
    "4": "Plans and pricing",
    "10": "Ease of use",
    "15": "Speed and experience",
    "17": "Support",
    "19": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Shockbyte": "https://shockbyte.com/",
    "server hosting providers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "twelve different plans": "https://shockbyte.com/games/minecraft-server-hosting",
    "DDoS attacks": "https://www.techradar.com/news/best-ddos-protection",
    "Dirt": "https://shockbyte.com/games/minecraft-server-hosting",
    "Apex Hosting": "https://www.techradar.com/reviews/apex-hosting",
    "Bisect Hosting": "https://www.techradar.com/reviews/bisecthosting",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}