{
  "source": "https://www.techradar.com/reviews/ring-video-doorbell-pro-2-review",
  "title": "Ring Video Doorbell Pro 2 review",
  "category": "smart-home",
  "updated": "2021-12-02T14:26:53.126Z",
  "author": "luke-edwards",
  "summary": "The premium Ring Video Doorbell Pro 2 could be the one to rule them with so many useful new features",
  "verdict": "The best video doorbell yet from Ring crams in security smarts, new wider angle views, stunning quality, colour night vision and more.",
  "pros": [
    "Wider angle camera to see more",
    "Superb high-quality 1536p video",
    "3D motion detection"
  ],
  "cons": [
    "Pricey",
    "Wired only"
  ],
  "article": [
    "The Ring Video Doorbell Pro 2 can barely be called a doorbell now as it's so, so much more. This is a home security system, a personal front door concierge, and a delivering aide all in one. Sure, the price isn't low for Ring’s top-of-the-range smart doorbell, but then the features that go with that help to justify the outlay - in fact, it's one of the best video doorbells you can buy right now.",
    "The successor to the Ring Video Doorbell Pro, this model features a wider 150-degree square field of view so you can see more, and that's done in higher-quality resolution, day and night. As you’d expect, the video doorbell sends an alert to your smartphone when the doorbell has been pressed, letting you see and speak to whoever is on your doorstep, even if you’re not at home.",
    "The doorbell will trigger an existing chime in your home, if you have one - if not and you want to hear a sound inside your home when the doorbell is pressed, you’ll need to purchase the Ring Chime ($29.99 / £29.99 / AU$59) or Ring Chime Pro ($49.99 / £49.99 / AU$79), or if you have an Amazon Echo smart speaker or smart display, such as an Echo Show 10, you can set that up to play a sound when the doorbell is pressed.",
    "It'll also notify you of any motion detected on your driveway, but thanks to features such as 3D Motion Detection and Bird's Eye View, you should receive fewer unwanted notifications due to better accuracy.",
    "This model looks premium and works in a way that justifies the steeper-than-most price. So if you think features like pre-roll video that show people walking to your door, or alerts to your Amazon Echo device, are useful then this is worth it for you.",
    "But if you just want a video doorbell that does the basics there are alternatives out there, both from Ring and other manufacturers, that could save you money and still cover your needs.",
    "So read on to find out all you need to know from this Ring Video Doorbell Pro 2 review.",
    "The Ring Video Doorbell Pro 2 sure isn't cheap at $249.99 / £219 / AU$399.99 - although it is the same price the Ring Video Doorbell Pro was when it launched. As a longer-term investment in both security and alerts, this justifies its cost.",
    "This isn't quite the top-end model from the company, despite cramming in all the best features that are on offer from Ring - that honor goes to the Ring Video Doorbell Elite, which will set you back $349 / £349 AU$499.",
    "That said, there are a lot of other options from Ring with something in most people's budgets; from the entry-level Ring Video Doorbell Wired, which costs $59.99 / £49 / AU$119 to the battery-powered Ring Video Doorbell 4 at $199.99 / £179 / AU$329.",
    "Whatever model you go for they are best when run in conjunction with the Ring Protect plan. Prices start from $3 / £2.50 /AU$4 per month or $30 / £24.99 / AU$40 for a year - but you do get a 30-day free trial included with the doorbell. This provides online storage so you're able to review video after it's happened for up to 30 days. While this might not be needed by everyone, for those using this as a security system too, it's an invaluable investment. It also means you unlock lots of other features to help reduce unwanted motion alerts, which require that to work, too.",
    "The higher-end wired-only Ring Video Doorbell Pro 2 really does look premium with its metallic finish that feels solid and looks attractive. It's got the same rectangular shape as its predecessor with the camera in the top half with the button just below. An LED ring around the button lights up when the bell is rung so the person on the doorstep knows your attention is being summoned. It also makes a noise, the volume of which you can control, so the person waiting is alert it has rung.",
    "The unit measures 4.49in x 1.9in x 0.87in /11.4 x 4.9 x 2.2 cm (h x w d) and comes in that Satin Nickel finish but also has other faceplate options but these are only yours if you email in a redemption request after you buy it – so a bit of hassle then.",
    "This is wired only, meaning no battery option, but you can go for hardwired or plug-in. While the former option means you can easily wire this into a current doorbell, the latter is ideal for anyone without the wiring in place who wants to plug this into a wall socket. Yup, you'll still likely need to drill to get it through the doorway, but it can be easier than wiring in for some instances. That said, all the tools for a basic installation are there in the box ready for you.",
    "Unlike many of the other models, this also features dual-band Wi-Fi which means you should be able to get a far better connection which can equate to quicker notifications. For a home with a solid front door, built on stone frontage, that Wi-Fi boost could make all the difference – especially if your router isn't close to the front door.",
    "After the doorbell has been physically installed, the software set-up is relatively easy. Download and install the Ring app, follow the steps on screen to connect it directly to your Wi-Fi and you're up and running. There will be diagnostics of your Wi-Fi and suggestions made to help, should that be an issue for you.",
    "Color night-vision isn't new to this model but it's a feature that's appreciated as it means a clearer view of those at your door at night. It uses ambient light in the camera’s field of view to apply a simulated color to the image and provide more detailed footage. Of course, if you have a porch light, this isn't such a requirement for genuine door knockers, but for security, where someone might stand further back, it's a welcome addition.",
    "The overall quality is high though, with that new square 150-degree field of view which offers an impressive 1536p quality video. This means that you can not only see wide, side to side, as with older models, but you can now see a lot further top to bottom. This, crucially, means it's easier to see if there is a package at your door, or not. Ideal if it's something valuable that you may want to get right home for.",
    "Motion detection is another advanced area on this model with 3D Motion Detection and Bird's Eye View. The 3D addition uses radar which is able to detect a person up to 30 feet away while Bird's Eye View overlays an overhead map and uses that with person detection to show a track of where that person is walking. In reality, these features don't add much that you will play with, but they can help make alert detection that much more accurate. So when you adjust motion zone settings, like areas and sensitivity, it can mean you end up with fewer false alerts.",
    "The pre-roll on this model works well, showing you a short color clip of the person approaching your door before they actually press the bell. This six-second loop isn't that clear but it can be really helpful as you can see the person where they might otherwise hit the bell and run, leaving you missing who it actually was.",
    "The Ring app is a refined bit of software that works well across smartphones, be they iPhone or Android. The key here is that everything is very simple to use on the surface, giving you a notification that can take you to the video in a single screen press. You can even get pre-roll ahead of time, showing the black and white video in the top corner. But underneath that simplicity, there is a lot of power to play with.",
    "The ability to adjust motion detection on several levels is what makes this really great. If you don't like false alerts then it's worth spending a little time at setup getting this right. Firstly you can set zones, blanking out detection at street level for example, so cars and passers-by don't trigger an alert, only people approaching your door will do that.",
    "Sometimes you may still get a false positive in which case you can turn down the sensitivity too. Person detection is another useful option, which you can turn on to make sure nothing else, like a pet, sets it off. Ultimately this can all be played with until you have it just right and that means when you get an alert you know it's real.",
    "One feature we would like to see added is package detection, a feature the rival Arlo Video Doorbell offers. While Ring can alert you to people only, it doesn't do this for your deliveries, which might not get picked up if the person dropping them off isn't detected.",
    "Like all Ring video doorbells, the Doorbell Pro 2 works with Amazon smart speakers so you can opt to have an Echo speaker in your home to announce that someone is at the door (when the doorbell has been pressed) or that motion has been detected, and if you have an Echo Show you can see a live feed from the doorbell on its screen rather than picking up your smartphone.",
    "In the US, the Video Doorbell Pro 2 also benefits from Alexa Greetings, which sees Amazon's voice assistant answer the door and take a message if you can't get to the door yourself. Although there's no word on when these features will be made available to Ring Video Doorbells in other regions.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Ring Video Doorbell Pro 2 price and availability",
    "11": "Design",
    "15": "Performance",
    "20": "App",
    "26": "Don’t buy it if..."
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Ring Video Doorbell Wired": "https://www.techradar.com/reviews/ring-video-doorbell-wired-review",
    "Ring Video Doorbell 4": "https://www.techradar.com/news/ring-video-doorbell-4",
    "Arlo Video Doorbell": "https://www.techradar.com/reviews/arlo-video-doorbell-review",
    "Alexa Greeting": "https://www.techradar.com/news/alexa-can-now-answer-your-ring-doorbell-and-take-a-message-if-you-cant"
  }
}