{
  "source": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
  "title": "Microsoft Edge review",
  "category": "computing",
  "updated": "2021-08-10T01:03:46Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Your new go-to browser for online shopping",
  "verdict": "Microsoft Edge works well and looks even better, especially if you need to bookmark pages and notes or do some serious online shopping.",
  "pros": [
    "Excellent online shopping features",
    "In-line Collections that pop up over your page",
    "Attractive navigation and search results"
  ],
  "cons": [
    "Settings can be complicated",
    "Security features feel limited"
  ],
  "article": [
    "Edge is Microsoft’s latest browser, and it looks its best when you use it as it was intended to be used: by running Bing, which is Microsoft’s search engine. This is how you’ll get Edge’s richest features, the ones that revolve around online shopping.",
    "If you switch to using Google or Yahoo as the default search engine, you’ll miss out on all of those components that help you save money, find deals and compare prices. And since you can’t easily switch back and forth between your search engine like you can on a browser like Safari, it’s best to pick one and stick to it.",
    "With Edge, you can browse on multiple devices and sync your favorites, passwords and settings across all of them. There are a ton of features, too, especially for productivity and online shopping.",
    "Productivity features",
    "Online shopping features",
    "Additional features",
    "Compared to other browsers, Edge’s security features seem a bit lacking. They do cover the essentials that you may be most interested in, though:",
    "InPrivate tabs and windows: Your browsing and search data (cookies, history, temporary internet files) are not saved on your device once you’re finished browsing.",
    "Kids Mode: Browsing mode just for kids with built-in protection and custom designs. There’s also news curated for kids ages 9 to 12.",
    "Microsoft Defender SmartScreen: Protect against phishing or malware websites and keep the browser from downloading harmful files.",
    "Tracking prevention: Detect and block trackers, and determine the trackers you want to block.",
    "Edge has a lot of password-protection features, too. The browser can create and store strong passwords for you in its password manager. You’ll also get reminders if you’re using the same password on a lot of sites, so you can change them if you want the most protection possible. You’ll even be notified when Edge detects that your credentials are compromised.",
    "You can customize what a page will look like when you open a new tab. There are three options:",
    "Inspirational: This has imagery that takes up a large part of the header",
    "Information: Your feed is front-and-center",
    "Focused: Completely minimalist with just icons for your top links",
    "Microsoft Edge uses the Bing search engine as its default, but you can switch it to Google or Yahoo if you prefer. However, Microsoft Edge looks best with Bing when compared to the other search engines. And Bing looks best on Microsoft Edge, too – it’s not quite as attractive when you use Bing on, say, Safari. It’s clear that Edge and Bing are made to go with one another (they’re both Microsoft products, after all).",
    "Microsoft Edge is available on supported versions of Android, iOS, MacOS and Windows. It has a mobile app, too.",
    "Edge is more feature-rich and customizable than Safari, and since it uses the Chrome Web Store, you can theoretically outfit it in the same way you would Google Chrome.",
    "Overall, Edge just looks nicer than many other browsers. Unlike Chrome and Safari, the navigation menus in Edge are less obtrusive, putting your search results in the forefront and everything else available but pared down.",
    "There are also three ways to search right from the main search bar – via text, voice or image – and the bar at the top of shopping results is super useful (this isn’t a Bing thing, by the way, it’s specific to Edge).",
    "Edge is feature-packed but pretty easy to get the hang of. Ironically, the hardest feature to learn was the one that’s promoted the most: Collections. It took a while to figure out what Collections were and then set them up and add to them. The feature is still sleeker than something like Bookmarks in Safari, though, which makes you open a new tab just to edit and organize your saved links. With Collections, you can do everything from a pop-up over whatever page you’re on.",
    "Edge has a lot of settings that you can work your way through to get the browser looking and functioning exactly the way you want. If you’re a bit tired of too-simple-to-be-useful browsers, Edge may be a great – and great-looking – alternative. And if you do a lot of online shopping (or any, really), it’s the best way to go, even if you use another browser for all of your non-shopping time online."
  ],
  "headers": {
    "2": "Features",
    "6": "Privacy",
    "12": "User experience",
    "17": "Platforms",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "Edge": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-8429159734000458000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fedge",
    "browser": "https://www.techradar.com/best/browser",
    "Bing": "https://www.techradar.com/news/bing-receives-a-microsoft-flavoured-rebrand",
    "Kids Mode": "https://www.techradar.com/news/microsoft-edge-is-getting-even-safer-for-some-users",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome"
  }
}