{
  "source": "https://www.techradar.com/reviews/ring-video-doorbell-wired-review",
  "title": "Ring Video Doorbell Wired review",
  "category": "smart-home",
  "updated": "2021-07-07T10:05:38Z",
  "author": "carrie-ann-skinner",
  "summary": "Is Ring’s cheapest video doorbell worth buying?",
  "verdict": "The Ring Video Doorbell Wired is one of the most affordable smart doorbells on the market. Simple to use, this mains-powered doorbell offers the same clear audio and video found on other Ring doorbells, in a smaller, more discreet body. Some compromises have been made to hit the low price point – it can’t trigger an existing chime if you have one, for example, but for those on a budget, it’s a good option.",
  "pros": [
    "Ring’s cheapest Video Doorbell",
    "Works with Amazon Echo smart speakers",
    "Records clear video and audio"
  ],
  "cons": [
    "Only available as a wired doorbell",
    "Installation means any existing chime in your home won’t sound",
    "No free video storage"
  ],
  "article": [
    "The Ring Video Doorbell Wired is the tech giant’s most affordable video doorbell to date, so you can see and speak to anyone on your doorstep without breaking the bank. The Ring Video Doorbell is also the brand’s smallest video doorbell to date and is certainly one of the best video doorbells on the market right now.",
    "The doorbell will send a notification to the Ring app on your smartphone when someone presses the button, and you can login and view a real-time feed from the doorbell’s camera through the Ring app. A two-way microphone and speaker means you’ll also be able to converse with whoever is on your doorstep.",
    "Unlike other Ring Video Doorbells, this one has to be wired in place of an existing doorbell; there’s no option to have it battery-operated, and installation bypasses any existing chimes you have in your home, so they won’t be triggered when the doorbell is pressed. Instead, you’ll need to purchase the Ring Chime ($29.99 / £29.99 / AU$59) or Ring Chime Pro ($49.99 / £49.99 / AU$79) if you want to hear an audible alert in your home.",
    "The Ring Video Doorbell Wired has a Full HD camera with a 155-degree field of view, which is slightly narrower than that of other Ring Video Doorbells and those from competitors like Arlo and Google. We found the Full HD color video the doorbell captures looked detailed and clear, while night vision means video recorded after dark is also easy to see, although it’s in black and white rather than color.",
    "To keep the price low, the Ring Video Doorbell Wired does lack some features found on the more expensive Ring Video Doorbell 3. For example, it only supports 2.4GHz Wi-Fi rather than 5GHz as well.",
    "The doorbell is fully integrated with Alexa, which is to be expected considering Ring is an Amazon-owned company. You can choose to have any Amazon Echo’s in your home announce when the doorbell is pressed or motion is detected. You can also use the smart speaker to converse with anyone on the doorstep, and if you have an Echo Show, you can view the doorbell’s live feed on its screen.",
    "At $59.99 / £49 / AU$119 it’s one of the cheapest video doorbells on the market, and while you will need to factor in the monthly £2.50 / $3 / AU$4 cost of subscribing to Ring Protect to get the most out of it, it’s a great way to get a smart doorbell on a budget.",
    "The Ring Video Doorbell Wired will set you back $59.99 / £49 / AUS$119, making it the most affordable video doorbell Ring offers",
    "As with all Ring Video Doorbells, you’ll need to subscribe to Ring Protect if you want to store video captured by the doorbell securely online for up to 30 days. Prices start from $3 / £2.50 / AU$4 per month or $30 / £24.99 / AU$40 for a year – you do get a 30-day free trial of Ring Protect included with the doorbell.",
    "However, you will also need a Ring Chime if you want to hear a sound in your home when the doorbell is pressed unless, as we've already mentioned, you connect it to an Amazon Echo in your home.",
    "Ring says that, in order to make installation as simple as possible, when setting up the Ring Video Doorbell Wired you’ll need to bypass any existing doorbell chime you have, so you’ll need the Chime if you want to get an audible alert when the doorbell is pressed.",
    "There are two models of compatible chime available: the Ring Chime, which costs $29.99 / £29.99 / AU$59 and the Ring Chime Pro, which doubles as a Wi-Fi extender, and is priced at $49.99/ £49.99/ AU$79.",
    "Ring’s smallest video doorbell measures 3.98 x 1.8 x 0.88 inches (10.1cm x 4.57cm x 2.24cm) and has an all-black design. The camera lens and the doorbell button, which is surrounded by an LED ring, are in the center of the doorbell. The LED ring emits a constant white glow, and flashes blue when the doorbell is pressed. There’s an interchangeable faceplate that surrounds the edge of the doorbell, but unlike other Ring Video Doorbells there are no other colored faceplates in the box; if you want to customize the look of your smart doorbell, they’re available to buy from Ring’s website for $14.99 / £13.99 / AUS$25.",
    "A security screw secures the faceplate to the body of the doorbell, and can only be removed with a unique type of screwdriver, which is included in the box. This reduces the likelihood of anyone attempting to remove the doorbell. If the doorbell is stolen, Ring promises to replace it free of charge as long as you can provide a crime reference number.",
    "While the doorbell itself will make a sound, we found we were unable to hear this in our house, and as mentioned the way the doorbell is wired means any existing chimes you have in your home are bypassed, so in order to hear a sound in your home when the doorbell is pressed, you’ll need to purchase the Ring Chime ($29.99 / £29.99 / AU$59) or Ring Chime Pro ($49.99 / £49.99 / AU$79). These plug into a power socket and connect to the doorbell over Wi-Fi, and play one of a selection of different tones when the doorbell is pressed, .",
    "The doorbell does require a little bit of DIY to install. If you’re using your existing doorbell wiring, and if you have an existing chime in your home, you’ll need to install a jumper cable in the chime which will stop it triggering. You can then unscrew your existing doorbell, attach the wires to the Ring Video Doorbell Wired, and screw the new doorbell in its place. If you don’t currently have a wired doorbell, Ring sells a plug-in adapter that allows you to power the doorbell from a power socket for $24.99 / £19.99 / AU$35.",
    "With the doorbell installed you can download the free Ring app, which is available for iOS and Android, create an account and follow the instructions to connect the doorbell to your home Wi-Fi.",
    "Like all video doorbells, the Ring Video Doorbell Wired is simple to use. It’ll send a notification to your smartphone when the doorbell is pressed, and if you have Ring Chime connected, you’ll hear a tone in your home. Tap the notification to see a real-time feed from the doorbell’s camera and converse with whoever is on your doorstep using the microphone and speaker. The doorbell will also alert you if motion is detected, even if the doorbell hasn’t been pressed. Again, you can tap the notification to view the live feed from the camera.",
    "We found that there were just a couple of seconds between us tapping the notification and the live feed being displayed on our smartphone screen. The 155-degree field of view is narrower than those of other Ring Video Doorbells, and there’s a slight fisheye effect to the footage. However, we were still able to get a clear picture of our driveway, although it wasn’t possible to see a full-length view of anyone standing on our doorstep. The video and audio from the live stream were clear, and we found that conversing with anyone on the doorstep felt natural, with very little distortion. The doorbell also records footage after it’s been pressed or has detected motion, so if you're unable to view the live feed at the time of an alert, you can review the video at a later time, provided you’ve subscribed to Ring Protect.",
    "If you have an Amazon smart speaker in your home, you can connect it to the Ring Video Doorbell Wired, and Alexa will announce when the doorbell has been pressed, or if motion is detected. You can also use the smart speaker to converse with whoever is on your doorstep or, if you have an Echo Show, you can view a live feed from the doorbell on its screen, rather than picking up your smartphone.",
    "The Ring app is easy to use, showing a snapshot of the most recently-detected motion from any Ring device you own as soon as you open the app. Tap any of these snapshots and you’ll be given two options: the ability to stream a live feed from the doorbell, or a timeline of any doorbell presses and motion detections. You scroll backwards through this timeline to review these alerts; and if you subscribe to Ring Protect, the doorbell will also take a still image at set intervals throughout the day, stitching them together so you can see what's happened between motion detection and doorbell presses. You can also use the History option from the main menu to view any motion detection or doorbell presses back as an individual clips.",
    "There are plenty of settings that you can configure to reduce the number of unwanted alerts you get: People Only mode, which won’t notify you about motion created by vehicles, animals or wind; and Motion Zones, where activity outside of these areas isn’t stored by the doorbell. You can even set a schedule for when the doorbell should and shouldn’t alert you about motion it’s detected.",
    "If you find that the Ring app takes more than a few seconds to load the doorbell’s live feed, try downloading Rapid Ring from your app store, which is a stripped-down version of the app. This can’t be used to set up the video doorbell, but it can be used alongside the original app to reduce lag when launching the live feed."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Ring Video Doorbell Wired Price and availability",
    "12": "Design",
    "17": "Performance",
    "20": "App",
    "23": "Don't buy it if..."
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells"
  }
}