{
  "source": "https://www.techradar.com/reviews/trend-micro-2020-antivirus-solutions",
  "title": "Trend Micro Antivirus solutions review",
  "category": "computing",
  "updated": "2021-02-25T18:29:30Z",
  "author": "mike-williams",
  "summary": "Easy-to-use, accurate antivirus and top-notch browsing protection",
  "verdict": "Trend Micro offers top-quality detection rates and excellent anti-ransomware, but it's missing some of the features you might expect from a security suite (firewall, webcam protection, backup), and the tools you get instead are often underpowered.",
  "pros": [
    "Excellent protection results in testing",
    "Capable URL blocking",
    "Effective anti-ransomware layers",
    "Easy to use"
  ],
  "cons": [
    "Limited configurability",
    "Can't add devices to a license",
    "Above-average impact on system speed",
    "Aggressive detection technology means more false positives"
  ],
  "article": [
    "Trend Micro's consumer security range follows a very familiar pattern, with a single Windows-only antivirus product, a more powerful internet security suite, and a high-end product with extra functionality and support for Windows, Mac, Android and iOS devices.",
    "The baseline Antivirus+ Security offers simple antivirus protection, antiphishing and malicious URL blocking, while Trend Micro's Pay Guard aims to keep your banking transactions safe from snoopers.",
    "A one year, one PC license costs $30 for year one, $40 on renewal. Paying for two years up-front extends the introductory discount, costing $60, and renewing at $65. That's decent value, but you'll get more billing flexibility with some of the competition.",
    "Bitdefender Antivirus Plus starts a little cheaper, covering one device for $20 in year one, $40 in renewal. But its licenses can cover up to ten devices for three years, and that means big savings (a three device, three-year license costs just $84 initially, $120 on renewal.)",
    "Trend Micro Internet Security protects up to three PCs and throws in parental controls, optimization for your social media privacy settings, and PC cleanup and maintenance.",
    "It's priced at $40 for year one, $80 on renewal, or you can pay $60 up-front for a two-year license, then $125 when you renew.",
    "This looks a little expensive for what you're getting, and there's still no option to add more devices to the standard three.",
    "Trend Micro Maximum Security covers up to five devices, which can now include Macs, Android and iOS devices, as well as PCs. Oh, and it adds a password manager, too.",
    "Pricing is reasonable at $40 for the first year, $90 on renewal. The two-year subscription is better value than the rest of the range, too, at $60 for the first term (the same as Internet Security), $140 on renewal.",
    "Trend Micro Premium Security is a new suite which supports ten devices and adds an unlimited VPN, alerts if your details appear in a data breach, and 24/7 tech support and 'emergency assistance', for example including remote assistance to remove a virus.",
    "It's not significantly more expensive, either, at $70 in year one, $130 on renewal. But if you don't need support for all that hardware, Norton 360 Deluxe supports up to five devices, includes a VPN, dark web monitoring, firewall and 50GB backup space, but is only $40 in year one, $105 on renewal.",
    "There's another complication, too. Premium Security isn't yet available everywhere - it's not listed on the UK site, for instance, although we did find it in North America and Australia. Check your regional Trend Micro site to see what's available to you.",
    "Getting started with Trend Micro Antivirus+ Security is easy. There's a trial build available, installation is largely automatic, and you don't even have to provide your email address to try it out. (You're prompted to enter your email address at the end of the process to get product news and updates, but this is optional. We left the box blank, and the installer didn't complain.)",
    "The Trend Micro Antivirus+ Security installation grabs more system resources than most, with more than 1GB of data and executable files, a further 1GB in an Installer folder, seven background processes and assorted other drivers.",
    "(These files aren't always removed, either. If you've tried Trend Micro on a PC before, look for a ProgramData\\Trend Micro Installer folder. You may find a gigabyte or more of the original setup files. Bear that in mind if you try and then uninstall the trial, too - check for and manually remove its leftovers.)",
    "To measure any performance impact, we ran top benchmark PCMark Professional before and after installing the package.",
    "The results showed a 4% drop in score, probably not enough to notice, but still more than vendors like Avast (3.2%), Avira (1.7%), Bitdefender (1%) and Kaspersky (0.6%.)",
    "AV-Comparatives' October 2020 Performance Test includes more speed checks, but broadly confirms our findings, with Trend Micro placed a disappointing 14th out of 17.",
    "We completed our initial checks by simulating the type of attacks malware might use to try and disable Trend Micro's protection, including deleting files, killing processes, stopping services, unloading drivers and more. The results were, well, mixed.",
    "We managed to damage the package enough that its interface refused to load, even after a reboot - we didn't have as much as a system tray icon, and Antivirus+ no longer displayed any notifications.",
    "It appears we'd only broken the user interface, though. The core security engine remained intact, and still detected and blocked all types of threats. If this happened in real life, our security wouldn't have compromised, and we found that reinstalling Antivirus+ Security fixed the problem and restored normal operations.",
    "Trend Micro's Windows interface has a friendly and appealing look. There are large, animated icons, a big scan button, a clear description of your security status, along with text captions and tooltips to make it clear how everything works. You can even customize the console with a new background image.",
    "Checking the Settings dialog revealed the same focus on clarity, with nothing too intimidating present. Instead of the usual technical jargon, options are spelled out in detail and in plain English, like \"Prevent programs on portable drives from launching automatically\" or \"Check if programs try to make unauthorized changes to system settings which could threaten your security\".",
    "Experts might wish for more low-level control, but if you're normally left baffled by at least some antivirus settings, Trend Micro's simplified approach could be a refreshing change.",
    "Trend Micro Antivirus+ Security's Scanning options are straightforward. You're able to run quick, full or custom scans, where you can specify particular drives or folders to check. There's very little control over any of this, and no Avast-like ability to add other scan types and define precisely how they work. But it's easy to use, and if you're not the type who normally delves deep into antivirus settings, you'll probably be happy enough.",
    "You're able to scan files from their right-click Explorer menu, too, although with some restrictions. We noticed that Antivirus+ Security doesn't support simultaneous scans, and the Explorer 'Scan with Trend Micro' option is greyed out when you're running a scan from the main console.",
    "That's probably not something you'll notice often, but it's still a potential nuisance, and not an issue you'll get with more flexible products (Kaspersky apps are able to run multiple scans simultaneously, each in their own window.)",
    "Antivirus+ Security scanned our 50GB of test executables in just 16 minutes, much faster than most of the competition, but we didn't notice any 'scan only new and changed files'-type optimization to improve its subsequent performance. So, while Bitdefender's lengthy 39-minute scan dropped to under 30 seconds on the second run, Antivirus+ Security took the same 16 minutes, no matter how many times we scanned it.",
    "Trend Micro's protection doesn't stop with real-time behavior monitoring and on-demand scanning. Folder Shield, an anti-ransomware layer, watches your Documents, OneDrive and Pictures folders, as well as any connected USB drives, and alerts you about any attempt to modify files by trusted processes. You can add more folders, as necessary.",
    "Folder Shield isn't a new idea – Windows 10's Controlled Folders feature is a more basic version; Avast's Ransomware Shield is similar – but it's a welcome extra layer of protection which could block even brand-new undiscovered ransomware.",
    "AV-Comparatives' real-world protection test is a tough benchmark which pits 17 top antivirus engines against some of the very latest malware. Trend Micro had stellar results in the latest July-October 2020 report, one of only three products to block 100% of test threats, earning the company an excellent third place.",
    "A fluke? Not at all; Trend Micro's performance is very consistent. The earlier February-May 2020 report also reported it blocking 100% of threats, again putting it in third place.",
    "If there's an issue here, it's the number of false positives, with Trend Micro raising more than most of the competition. Kaspersky blocked 99.9% of threat in the February-May test with zero false positives; Trend Micro blocked 100%, but raised 63 false alarms.",
    "This suggests Trend Micro may be achieving its accuracy by lowering the bar for what it considers malicious behavior. That means it stops more threats, but may also block many legitimate apps, which could translate into a lot of extra hassles in real-world use.",
    "Not all labs report the same issue. AV-Test's Home User Windows tests for the year December 2019-October 2020 awarded Trend Micro a maximum 6/6 for protection in every test, and found it gave fewer false positives than average.",
    "We've seen Trend Micro's false alarms in our own tests, so there does seem to be an issue here. It may vary considerably depending on your applications and how you use your system, though, so don't let this put you off trying the product; it might not be an issue for you in real-world use.",
    "To get a more complete idea of Antivirus+ Security's abilities, we put the program through some tests of our own.",
    "As we expected, there were no file detection issues, and the engine detecting and blocking even the latest malicious binaries.",
    "We also run some more interesting behavior tests, where test binaries perform some very suspicious actions (run a command shell, which launches wmic.exe, which fires up PowerShell with a one-line command to download a malicious file, for instance.)",
    "Antivirus+ Security performed well, jumping on many executables and closing them based on behavior alone, before the file could be downloaded. That's more aggressive than some - Total AV waited for the downloaded and blocked it, but ignored the behavior and left the executables untouched - and perhaps explains why Trend Micro can raise more false positives. But we feel it's good news overall, as blocking suspect behavior as well as known dangerous files should protect you from even brand new and undiscovered threats.",
    "Our toughest antivirus test pits the review product against our own custom ransomware simulator. As we've written this ourselves, Trend Micro wouldn't be able to detect the threat from its file signature, and could only rely on behavior monitoring.",
    "Many antivirus products fail this test, but Trend Micro achieved another big success. Not only did it kill the process after only three documents had been encrypted, but it also recovered those documents in full, ensuring we didn't lose any data at all.",
    "That puts Trend Micro alongside Bitdefender and Kaspersky as the only vendors with products that both blocked our test threat and recovered any lost files. As an example of how important that might be, Norton AntiVirus Plus also detected and killed our simulator, but not before it managed to trash 57 documents, all of which were unrecoverable: oops. Stopping ransomware isn't just about the initial detection; speed and document recovery matters, too, and Trend Micro is one of the top contenders in both areas.",
    "Trend Micro Antivirus+ Security includes several levels of browsing protection.",
    "Trend Micro's Social Networking Protection uses browser extensions to display a 'risk rating' of links on popular social networks, for instance (Facebook, Twitter, LinkedIn, Pinterest, Weibo and more.) But there's also automatic checking of URLs before they're accessed, and even if a page passes that test, its content is scanned by the core Trend Micro engine.",
    "AV-Comparatives' Anti-Phishing Certification Test 2020 only benchmarked the performance of six vendors, but Trend Micro still came out on top, blocking an excellent 95% of phishing sites. The other contenders were Bitdefender (94%), Avira (91%), Kaspersky (90%), and AVG and Avast (86%).",
    "Normally we try to cross-check these results by running automated URL checks of our own, but Antivirus+ Security didn't allow our test app to run, presumably because it was connecting to so many malicious URLs. It seemed very accurate from the small amount of data we were able to view, though, and although having our app closed was inconvenient, it's another sign of Trend Micro's engine paying close attention to behavior.",
    "There's another URL filtering plus in its configurability. While other antivirus typically only allow you to turn URL blocking on or off, this one has a 'protection strength' slider which you can turn up to block sites more aggressively, or down to reduce false alarms.",
    "Trend Micro's Pay Guard aims to provide a more secure environment for carrying out online banking, shopping and other sensitive transactions, making it more difficult for malware to monitor or log what you're doing. This is also a familiar idea, but Trend Micro implements it a little differently.",
    "While Bitdefender Safepay and similar packages create their secure environment within a custom hardened browser running on a separate desktop, Antivirus+ Security uses your default browser (as long as it's Chrome, Firefox, Edge or IE) with its most secure settings.",
    "This isn't as isolated from other apps. Keyloggers and screen capture tools weren't able to capture what we did in Safepay, for instance, but had no problem recording all our Pay Guard activities.",
    "Pay Guard is easier and more convenient to use, though. It can be set up to launch automatically when you access sensitive sites, maybe your bank and credit card companies. And it does offer useful security benefits, opening in a private browsing window, with no extensions loaded, and no trace of your transactions left when it closes.",
    "Trend Micro Antivirus+ Security has a surprise bonus tool in its spam filter, a feature normally reserved for security suites. It's not easy to find, though - it's disabled by default and not highlighted on the main dashboard - and you may not even realize it exists unless you find the right area of the Settings dialog and click the appropriate checkbox.",
    "After enabling the feature, we began to realize why Trend Micro wasn't shouting about it. It's not a network level, system-wide filter, for instance; it only works with Outlook, scanning POP3, SMTP and Exchange messages",
    "Performance wasn't great for us, either, with the filter regularly flagging a large number of legitimate emails as junk. You can address this by adding trusted addresses to an Approved Senders whitelist, though, or maybe reducing the filter strength. It's also possible you'll see better results, as these depend very much on the type of email you get. Take the trial, see how it does.",
    "Trend Micro has produced a user-friendly antivirus with excellent anti-ransomware abilities, but experts might be frustrated by the lack of advanced features and configuration options.",
    "Trend Micro Internet Security extends the Antivirus+ product with parental controls, social media privacy tools and a handful of PC maintenance and speedup features.",
    "The suite's main selling point is its extended license, covering up to three PCs for only a little more than Antivirus+ Security: $40 for one year, $80 on renewal, or $60 for a two-year license, rising to $125 when you renew.",
    "That looks a little underpowered to us, for what you're getting. Bitdefender Internet Security has many more features - firewall, password manager, webcam protection, more - but it's fractionally cheaper, covering three devices for $35 in year one, $80 on renewal.",
    "You can extend Bitdefender licenses to cover up to ten devices over three years, too, potentially saving even more. Trend Micro Internet Security is normally a three device, one or two-year deal. (Confusingly, some regions are more flexible than others. Trend Micro's UK plans allow you to buy a cheaper one device Internet Security license; the US plans only support three.)",
    "Still, if Trend Micro Internet Security has everything you're after, Bitdefender specs may not matter very much. What's really important is exactly what its new features can do, and that's what we wanted to find out.",
    "Trend Micro's Family feature is an interesting parental controls tool which tries to offer a little more functionality than you'll get with many other suites.",
    "Content filtering enables blocking websites by their content type, for instance. A long list of well-chosen categories gives you plenty of control over how the system should work. You don't just get a single checkbox to block or allow all websites classed as 'Adult', for instance - you can opt to block pornography and erotic links, but allow sites covering sex education or with swimsuit pictures.",
    "More general tools include options to prevent users accessed sites which Trend Micro hasn't rated. You can have unsuitable images filtered out from search engine results, or even block access to search engines entirely.",
    "A Time Limit section enables choosing when internet access is allowed for this device, and your chosen user account. (Every family member can have their own user account on the same PC, and you're able to set different restrictions for each, or maybe no restrictions at all.)",
    "The Scheduling screen is a grid covering every hour of the day, and every day of the week, and you're able to block internet access for whatever hour-long slot you like.",
    "A separate option allows limiting device use to a set number of hours per day.",
    "Interestingly, you can also block access to specific applications by schedule. Add an app and initially it's blocked at all times, but you can freely tweak that to, say, only allow it to be launched at weekends.",
    "There's a significant limitation here, in that Trend Micro Internet Security doesn't cover mobile devices. If your child has access to a phone, or a tablet, they can switch devices whenever they hit any enforced limits on the PC.",
    "But if you can live with that, Trend Micro's parental controls tools give you fractionally more features than you'll see with some competitors, and are a worthwhile addition to the suite.",
    "Trend Micro claims its PC Health feature can 'fix common problems and get everything running at top speed', but it doesn't take long to realize that might be a little, well, unrealistic.",
    "Trend Micro Internet Security automatically checks your PC Health when you run a regular antivirus scan, or you can choose to run a separate scan. Either way, the process doesn't take long, and within seconds we were looking at our results in five categories.",
    "A 'Security Vulnerabilities' section lists missing program updates, though only from Microsoft and Adobe; Avira's Software Updater also covers updates for Chrome, Firefox, Opera, Java, TeamViewer, Paint.Net and other popular tools.",
    "The Vulnerabilities section apparently also looks for poorly configured Windows firewall and user account settings. It warned that our system had 'unsecure Internet Explorer security settings', but didn't tell us what they were, so we ignored the alert. (We wouldn't allow any app to change our security settings without more detail on what it was planning to do.)",
    "A 'Potentially Incompatible Programs' section warns you of apps which might interfere with Internet Security or 'affect the performance of your computer.' It found nothing to report on our system.",
    "The 'Reduce Computer Startup Time' section displays startup programs which Trend Micro thinks could be disabled (or launched later) to reduce boot time. Or, that's the idea; Task Manager reported 20 startup programs on our system, but Trend Micro had no suggestions on what to do with any of them.",
    "The 'Regain Disk Space' section handles all your system cleanup tasks, and reported a total of 3.34GB to clean up across four categories: Temporary Application Files, Windows Update History, Temporary Web Browser Files and Temporary Windows Files.",
    "That's a good total, beating even what CCleaner could find on the same system, but, again, there's very little detail. The app claimed it could delete 2.47GB of 'Temporary application files', for instance, but didn't tell us what they were, so we had no way to check whether we needed these files or not.",
    "Finally, a 'Clean Privacy Data' feature can apparently remove personal data from 'web browsers, instant messaging applications, media players and Windows.' Sounds great, but as it found absolutely nothing at all on our test system (and it didn't in our last review, either), we're left wondering how thorough it is.",
    "PC Health promises a lot, but fails to deliver in almost every area. You'll get better results with the best-of-breed PC maintenance freeware, such as CCleaner. Or, if you're an experienced user and you'd like your security suite to have some real speedup power, check out Avira Prime. Its system cleaner is one of the few we've seen that can stand up to the stand-alone competition.",
    "Trend Micro Internet Security enhances your privacy with three main tools.",
    "Privacy Scanner includes options to check the privacy settings of your web browsers, and your Facebook, Twitter and LinkedIn accounts. These are available from the main Trend Micro interface, but for some reason they launched Internet Explorer rather than Chrome, our default browser.",
    "Privacy Scanner is also available from Trend Micro's free Chrome and Firefox browser extension, so we installed that instead. This detected when we were logged in to Facebook, Twitter and LinkedIn, and was then able to scan our account settings for issues.",
    "The Scanner offered 8 recommendations for Facebook (changing who could see our posts, who could see posts we'd tagged, and so on) 3 for Twitter and 1 for LinkedIn. A 'Fix all' button automatically changes all settings to give the maximum privacy, or we were able to change individual account settings as required.",
    "This could be handy as a way to highlight weak privacy settings, but with Privacy Scanner still supporting IE, and ignoring Edge, it looks like it really needs an update.",
    "Trend Micro's Social Networking Protection is a simple feature which highlights risky links in social media feeds, web search results and other web pages.",
    "This feature is enabled by default in Internet Explorer, Firefox and Chrome, as long as you install Trend Micro's extensions.",
    "This worked well when we tried it, highlighting safe URLs in reassuring green, and dangerous links in alarming red. Although we didn't test this feature in depth, Trend Micro's engine does a good job of blocking URLs, so we expect it will be just as accurate.",
    "Trend Micro's final privacy feature, Data Theft Prevention, aims to stop confidential information from ever leaving your PC.",
    "The idea is that you create a list of information you don't want to share without permission: credit card or bank account details, addresses, telephone numbers, whatever they might be. Trend Micro then monitors outgoing connections and alerts you to any attempt to send those details.",
    "While this sounds great, it only works with unencrypted connections. If an app connects using HTTPS, Data Theft Prevention won't be able to monitor what's going on.",
    "There's no harm in setting it up, and the feature might prevent some basic malware from stealing your personal details. We wouldn't rely on that, though, and Data Theft Prevention really doesn't much to the suite.",
    "Trend Micro Internet Security doesn't make any huge mistakes, but it doesn't provide any compelling reasons to buy it, either. The feature set is small, and although there are a few original touches, most tools are average at best.",
    "If you've already decided you're buying a Trend Micro product, and Internet Security's feature set suits your needs, check out the trial anyway. It will make you a little safer, and it's fair value if you're covering more than one device.",
    "But if you're not already committed to the company, there's probably nothing in Trend Micro Internet Security that will change your mind, and you'll be better off with something else.",
    "If Trend Micro hasn't satisfied your security needs so far, maybe Trend Micro Maximum Security will do the trick.",
    "The big addition is multi-platform support, with apps available for Android, iOS and Mac.",
    "There's another welcome touch in a password manager, while a small Vault tool enables using password-protected folders to prevent others viewing your most confidential files.",
    "This doesn't have quite the power you might expect from a high-end suite. There's no configurable firewall, for instance, and no webcam or microphone protection.",
    "Trend Micro Maximum Security isn't significantly cheaper than the competition, either. A one year, five device license costs $40 for the first term, $90 on renewal; Bitdefender Total Security 2021 is priced identically, and you can cover up to ten devices for only fractionally more ($45 in year one, $100 on renewal.)",
    "Is Maximum Security really worth the extra? We installed it to find out.",
    "With the ability to cover five devices with a single Maximum Security license, its multi-platform support could be the highlight of the package.",
    "The Mac build covers all the core features you need, and more: antivirus, browsing protection, a spam filter, parental controls, social networking protection, the Privacy Scanner to check your social network account settings, and the ransomware-blocking Folder Shield.",
    "It doesn't have some of the Windows extras - Pay Guard banking protection, any equivalent to PC Health's cleanup tools - but is a decent package overall.",
    "The Android app is better than most, with equivalents to most of the features in the Windows edition, and a number of mobile specific tools (a Privacy Scanner highlighting apps which can access your personal data, an app locker, a Secret Snap feature to capture a picture of unauthorized users trying to access your device.)",
    "You're only interested in mobile antivirus? That's impressive, too. AV-Comparatives' Mobile Security Review 2020 placed it equal first with Bitdefender in a field of nine, the only apps to detect 100% of threats, and with no false positives.",
    "Trend Micro's iOS app can't match the Android edition, but it still outperforms many competitors, with malicious website blocking (including a secure QR code scanner), parental controls, private browsing, and tools to block ads and trackers and alert you to unsafe wireless networks. Works for us.",
    "Trend Micro's Vault is a very simple tool which enables creating password-protected encrypted containers for storing sensitive files.",
    "Choose your preferred password, open the vault and it displays a widget on your desktop. Drag and drop your most confidential files onto the widget and they're moved there. Close the vault and they're inaccessible to anyone who doesn't know the password.",
    "Reopen the vault later and you can access it from Explorer, then open, edit and save documents more or less as usual. (The process is slower than usual, thanks to the encryption overhead, but there's nothing unacceptable.)",
    "So far, so very similar to a lot of other encryption tools. But Vault does have one slightly surprising extra. If your computer is lost or stolen, report this on the Trend Micro website and it'll be sealed. Even if the thief knows the password, they won't be able to open the vault until the computer is reported found.",
    "Trend Micro's Password Manager got off to a good start on our review system, scanning and offering to import any stored logins for Internet Explorer, Chrome and Firefox. (There are separate options to import credentials from LastPass and Kaspersky Password Manager.)",
    "A couple of clicks took us to the Trend Micro Password Manager extension page in the Chrome store. The 2.5/5 star rating didn't impress, and an Updated date of July 2019 suggested problems aren't going to be fixed in a hurry, but we installed it anyway.",
    "The product can complete login pages and assorted other forms, with data types including your name, birth date, email address, phone number, physical address and credit card details, and secure notes.",
    "Basic password health checks include alerts for weak and duplicated passwords, potentially very useful information.",
    "All this is easily accessed from the browser extension. Enter a new login and the extension asks you if you'd like to save it. It can save multiple logins for the same site, if necessary, and you're prompted to choose your preferred account whenever you visit the page.",
    "Overall, this is a reasonable mid-range password manager. It may not have secure password sharing, two-factor authentication or the more advanced tweaks you'll see with the market leaders, but it's better than the password managers you'll usually get with a security suite.",
    "Trend Micro Maximum Security leaves out many features you might expect from a high-end security suite, like a firewall, backup or webcam protection. Its multi-platform support and five-device license puts it ahead of the lesser packages, though, and the suite is also easy to use, with an accurate engine, quality URL blocking and some capable mobile apps. If its feature set matches your needs, take the 30-day trial for a spin, see how it works for you."
  ],
  "headers": {
    "12": "Setup",
    "21": "Interface",
    "24": "Antivirus",
    "28": "Folder Shield",
    "30": "Protection",
    "36": "Malware tests",
    "40": "Ransomware test",
    "43": "URL filtering",
    "48": "Pay Guard",
    "52": "Spam filter",
    "55": "Final verdict",
    "61": "Parental Controls",
    "70": "PC Health",
    "80": "Privacy Scanner",
    "85": "Social Networking Protection",
    "88": "Data Theft Prevention",
    "92": "Final verdict",
    "101": "Multi-platform",
    "107": "Vault",
    "111": "Password Manager",
    "117": "Final verdict"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Antivirus+ Security": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2373025207201355000/https://www.trendmicro.com/en_us/forHome/products.html#t2",
    "Trend Micro Internet Security": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1401551995225356800/https://www.trendmicro.com/en_us/forHome/products.html#t2",
    "Trend Micro Maximum Security": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9049389088541846000/https://www.trendmicro.com/en_us/forHome/products.html#t2",
    "Trend Micro Premium Security": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1905963381774619600/https://www.trendmicro.com/en_us/forHome/products/antivirus-plus.html",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Home User Windows tests": "https://www.av-test.org/en/antivirus/home-windows/manufacturer/trend-micro",
    "Anti-Phishing Certification Test 2020": "https://www.av-comparatives.org/testmethod/anti-phishing-tests",
    "CCleaner": "https://www.techradar.com/reviews/piriform-ccleaner-professional",
    "Mobile Security Review 2020": "https://www.av-comparatives.org/tests/mobile-security-review-2020"
  }
}