{
  "source": "https://www.techradar.com/reviews/amazfit-gts-2e",
  "title": "Amazfit GTS 2e review",
  "category": "fitness",
  "updated": "2021-03-19T12:25:34Z",
  "author": "cat-ellis",
  "summary": "Impressive features for a modest price, particularly when it comes to fitness",
  "verdict": "The Amazfit GTS 2e is a compact smartwatch that gives you an awful lot of features for the money. With a bright OLED display, good battery life and a raft of impressive workout tracking tools, it's easily one of the best fitness trackers in its price bracket.",
  "pros": [
    "Bright, vivid touchscreen",
    "Strong fitness tracking features",
    "Value for money"
  ],
  "cons": [
    "No contactless payments",
    "Unhelpful PAI fitness score"
  ],
  "article": [
    "The Amazfit GTS 2e is a slightly lower-specced version of the Amazfit GTS 2, which we reviewed in December 2020. It’s a capable smartwatch and fitness tracker, though missing a few key features of its more expensive sibling - notably NFC for contactless payments, and the ability to answer phone calls via Bluetooth.",
    "Its bright OLED display sets it apart from many other watches in this price range though, and its impressive battery life (up to 24 days) makes it a practical choice if you can make do without those missing features.",
    "The GTS 2e’s range of health monitoring tools are impressive though, with accurate blood oxygen saturation, sleep, and all day heart rate monitoring, and stress checks throughout the day - all presented neatly in the Zepp companion app.",
    "Fitness tracking is well implemented too, comparing well with the best Fitbits. It offers on-board GPS, a wide range of activity presets, automatic activity detection, and a wide range of metrics to review post-workout. Figures were generally in line with those from the similarly-specced Garmin Vivoactive 4S, and data can be synced with third-party apps like Strava automatically.",
    "It’s a shame that the PAI fitness score calculated by the Zepp app isn’t more useful. It’s intended as an overall measure of fitness, but there’s little information about how it’s calculated, or what steps you should take to improve and maintain it.",
    "It's excellent value for money though, with a specs list comparable to a considerably more expensive device like the Fitbit Versa 3.",
    "The Amazfit GTS 2e launched in January 2021 for $139.99 / £119 (about AU$180). At the time of writing, that’s roughly the same price as the Fitbit Charge 4.",
    "The Amazfit GTS 2e is very similar in size and shape to the Apple Watch 6, albeit without the Digital Crown. Instead, the crown button of the GTS 2e simply serves to unlock the watch and select the current menu option; all other controls are managed using the touchscreen.",
    "It's available in black, green and purple, with a comfortable silicone band, aluminum alloy band, and buckle fastening. The charger is magnetic, and sticks easily to the back of the device (no need to plug in small cables).",
    "The 1.65-inch HD AMOLED screen is super bright, and we found it easy to read in all lighting conditions. The face is customizable; lots of extra options can be downloaded through the app, or you can create one using your own photos. Most designs can be set to always-on mode, though doing so will come at the expense of battery life.",
    "Setup is straightforward. First, charge the watch and install the Amazfit Zepp app on your phone, then create an account (if you don’t already have one). Scan the QR code presented on the watch’s face to connect the two - there’s no need to type in a confirmation code, as on some other fitness trackers. You’ll then need to perform a firmware update, and the watch is ready to use.",
    "The Amazfit GTS 2e has a pretty impressive raft of smartwatch features, though there are some limitations to be aware of.",
    "You can choose to receive app notifications and incoming call alerts on the Amazfit GTS 2e, but you can’t respond to text messages, and unlike the original Amazfit GTS 2, you can’t use Bluetooth to answer phone calls. Nor can you make contactless payments using NFC.",
    "You can’t store music on the GTS 2e for offline playback, but you can use it to control music already playing on your phone, which is useful during workouts. Basic play, pause, forwards and back controls are available, and the responsive touchscreen makes them easy to use.",
    "Offline voice controls allow you to perform many common tasks hands-free - once it’s set up in the watch’s settings, just rotate your wrist so a blue ‘listening’ icon appears at the bottom of the watch face, then say a command like ‘Start outdoor running’, ‘Open music’ or ‘Turn on flashlight’. The voice recognition worked well in our tests, and the fact that you don’t need to tap a button to unlock the watch first makes it extra practical.",
    "The watch’s wellbeing functions are particularly impressive. For example, it monitors blood oxygen saturation, and offers all-day heart rate monitoring, with warnings for unusually high heart rates. You can take an SpO2 (blood oxygen saturation) reading at any time. You will be prompted to place your arm horizontally on a table or desk, keep the watch’s face upright, and remain still.",
    "In our tests, the SpO2 score from the Amazfit GT 2e was almost exactly the same as that from the Apple Watch 6 (95% and 96% respectively). Over time, the Amazfit watch will build up a graph of your measurements so you can track changes over time without using your phone, which is a handy feature that allows you to check in on your wellbeing at a glance.",
    "Stress is measured throughout the day, and is calculated based on your heart rate variability. This is the most common way of measuring stress, and is different to the spot measurements taken by the Fitbit Sense, which measure electrodermal activity.",
    "Sleep tracking is one of the Amazfit GTS 2e’s best features. The watch is comfortable to wear at night thanks to its soft band and slim profile. When it was first released, the watch only differentiated between light and deep sleep, but it can now identify REM sleep as well.",
    "At the end of the night you’re given a score based on when you fell asleep and woke up (bedtimes are configurable within the app), your proportions of light and deep sleep, time awake, and sleep breathing quality. These measurements are accompanied by advice on how to improve your sleep quality, which is tailored to your results. You can also opt to receive a breathing quality score (which is currently in beta).",
    "The Amazfit GTS 2e can track outdoor running (both road and trail), treadmill training, indoor and outdoor cycling, pool and open water swimming, elliptical training, skiing, dance, combat sports and water sports, with an additional ‘free training’ mode for any activity that doesn’t have a dedicated mode.",
    "The device is easy to operate on the move; double-pressing the crown button opens the menu of workout options, with a simple swipe and tap serving to start and pause the current activity. You can only cancel or end the activity by swiping up or down on the screen while paused, which is near impossible to do accidentally. Alternatively, you can use offline voice controls to activate and manage workout tracking, which also works well.",
    "There’s also automatic activity detection, which will increase the frequency of heart rate measurements if you begin workout out, but won’t activate GPS.",
    "In our tests, it established a GPS lock quickly, though you can also start your workout before it does, and the watch will make up the missed section when it gets a lock.",
    "We compared the results with those gathered by a Garmin Vivoactive 4, and found the mapping almost identical. Garmin’s map uses color-coding to show your pace along the route, but the Zepp app gives you your splits below, so it’s a minor quibble. You can sync your activity data with third-party apps including Strava.",
    "The GTS 2e also records your heart rate throughout the workout (complete with zones), pace, cadence and altitude. The pace recorded by both the Amazfit and Garmin was nearly identical, but heart rate appeared to be lower on the GTS 2e. The heart rate zones were also slightly different, but this is because Garmin uses set numbers for all users, while Amazfit’s heart rate zones vary depending on your age, which is more useful for training.",
    "Our only quibble is that the graph for heart rate shows no trend line, and you’re not given an average heart rate.",
    "The Amazfit GTS 2e uses the company’s Zepp app, which is available for iPhone and iOS. It's not as attractive or intuitively laid out as the equivalent Fitbit app, but still puts all the essentials within easy reach.",
    "Pulling up a pane from the bottom of the screen will reveal quick controls for managing your device (including customizing the display, setting the vibration mode and opening the app store), while the rest of the app is dedicated to fitness and wellbeing stats.",
    "All your health and workout stats are imported to the app automatically, where they're pooled together with data from any other Amazfit products you own, such as smart scales or Zenbuds sleep-tracking earbuds.",
    "The Zepp app will award you a ‘PAI’ score (Personal Activity Intelligence) score based on your heart rate throughout the course of a week - whether you’re inactive, walking, or working out. Your score is calculated using this data, together with your age, gender, maximum heart rate, resting heart rate, and response to exercise, and your objective is to keep it consistently above 100.",
    "It’s an interesting idea, but somewhat vague. You're advised to do activities that raise your heart rate, but not given a specific degree of exertion or time to aim for. By contrast, Fitbit’s Active Zone Minutes metric, which encourages you to spend a certain period of time each week in different heart rate zones, is transparent and easier to understand.",
    "It's a shame that there's no menstrual cycle monitoring in the Zepp app at the time of writing. This is a feature both Fitbit and Garmin have been working to expand in recent years, and would be a useful addition."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Price and availability",
    "7": "Design",
    "11": "Smartwatch features",
    "20": "Fitness features",
    "27": "Companion app",
    "33": "Don't buy it if"
  },
  "links": {
    "Amazfit GTS 2": "https://www.techradar.com/reviews/amazfit-gts-2",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "best Fitbits": "https://www.techradar.com/best/the-best-fitbit",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Fitbit Charge 4": "https://www.techradar.com/reviews/fitbit-charge-4",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Garmin Vivoactive 4": "https://www.techradar.com/reviews/garmin-vivoactive-4",
    "smart scales": "https://www.techradar.com/best/best-smart-scales",
    "Zenbuds": "https://www.techradar.com/news/smart-hearables-go-beyond-the-music-at-ces-2020-here-are-the-best"
  }
}