{
  "source": "https://www.techradar.com/reviews/hp-zbook-studio-g7-review",
  "title": "HP ZBook Studio G7 review",
  "category": "computing",
  "updated": "2021-01-25T22:07:56Z",
  "author": "ural-garrett",
  "summary": "A powerhouse laptop for both creatives and gamers",
  "verdict": "From heavy media editing for creatives to higher-end PC gaming, the HP ZBook Studio G7 can handle a lot of heavy tasks. Despite getting a little too hot on the lap under heavy load and fan that’s pretty loud at peak levels, this is a well rounded laptop that’s stylishly sleek and solidly built.",
  "pros": [
    "Attractive and rugged design",
    "Solid battery life",
    "Keyboard and touchpad feel amazing",
    "Powerful enough for creatives and gamers",
    "Spectacular external speakers"
  ],
  "cons": [
    "Can get a bit too hot",
    "Incredibly noisy fan at times"
  ],
  "article": [
    "On the surface, it’s not too difficult to confuse HP’s ZBook Studio G7 and ZBook Create G7. Both feature a sleek 17.mm thin aluminum chassis, identical port and keyboard layout, phenomenal Bang & Olufsen speakers and 15.6-inch screen size featuring an 87 percent screen to body ratio. That’s where the similarities end. While the Create G7 is a 4.23 lb mobile workstation catering to professional creatives, HP describes the lighter 3.8 lb laptop as a device for corporate creatives.",
    "Regardless of tasks including heavy video and photo editing, music creating and gaming, the ZBook Studio G7 is up for anything. Solid battery life, serious durability and great external speakers make this laptop fairly versatile. If you’re looking for a hard-working mobile workstation that balances powerful performance with sturdy chassis made from lightweight materials the HP ZBook Studio G7 is definitely worth a look.",
    "There are three configurations available for the Studio G7. The lowest $1,869 (£TK, AU$TK) trim features a 4-core Intel Core i5 processor, 16GB RAM, Nvidia Quadro T1000, and a 256GB NVMe SSD. The highest tier $2,464 configuration includes a 6 core Intel i7, a 4K anti-glare screen and double the storage capacity.",
    "We have a $3,758.64 configuration that’ll be available for purchase soon online through HP. It’ll net users a 6-core Intel Core i7 processor pumping out 2.71 Ghz, Nvidia Quadro RTX 3000 with 6GB VRAM, 32GB of Ram, 15.6 inch FHD screen and 1TB NVMe SSD for storage. The Studio G7 regardless of trim is a cheaper alternative to the significantly more powerful Create G7.",
    "HP has taken the redesign seriously enough to replace the standard HP logo with a slick Z with a Power Ranger-looking font on the top cover. The reflective material works well with the Z’s unibody chassis made out of aluminum. Out of the box, the Studio G7 feels good in our hand as the laptop has a 22% smaller footprint than the last ZBook.",
    "Considering the powerful components housed within the Studio G7, it almost feels like an Ultrabook. A natural saltin material is smooth to the touch and also doesn’t leave any smug marks.",
    "Hefty, yet light enough to hold, the Studio G7 was designed to pass Mil-Spec testing. This laptop can take a serious beating and runs fine after several short drops on hardwood floors.",
    "Something does seem off about the ventilation. Next to the lock slot and single USB-A port is a single side vent alongside outside the bottom fan vents. This means under heavy load, the Studio G7 can get really hot in the lap, even when fans sound as if they are working overtime. After prolonged periods, some may find the laptop a bit uncomfortable if it’s not on a table.",
    "The Studio G7 has an SD card slot with a cover that may be difficult to remove, especially if you have short fingernails. Above that lies a mini DisplayPort 1.4, two USB-C ports with Thunderbolt and a separate power port. Though many laptop makers are moving to USB-C for charging, it’s great to know that one doesn’t have to make sacrificial decisions over port management.",
    "Once open, the HP ZBook Studio G7 makes a more grand impression. Expect smooth finger movement and tactile presses with one or fingers. Keyboard lighting only has three options, which isn’t nearly enough, but that’s the extent of the laptop’s key layout. Lying down or sitting up, general typing or long Adobe Suite sessions remain comfortable. Typing is also enjoyable even for long periods of time. An option for a fingerprint reader is available and is fairly accurate.",
    "The display has smaller bezels than the last Zbook did. The 15.6-inch screen features a HP Sure View Reflect Privacy Panel that looks absolutely amazing during photo and video editing alongside gaming. Colors pop out and look vibrant on the screen regardless whether we’re indoors or outside in the sun.",
    "HP also took the recent Covid-19 pandemic into consideration for the design of both ZBook configurations. According to the laptop maker, the laptop can stand up to 1,000 cycles of wiping with commonly available household disinfecting wipes.",
    "The Studio G7 packs a lot of power within its lightweight package. If HP’s goal was getting corporate creatives on board, it’s done it. Adobe Suite is fast and fluid. Editing on Premier is a speedy process from slapping videos on the timeline panel to fast export speeds.",
    "The HP ZBook Studio G7 can also handle high-res DSLR photos without breaking a sweat in Lightroom and Photoshop. Speaking of fast export speeds, it works like a charm on Media Encoder. Editing smaller videos at 1080p is a breeze The Studio G7 handles multiple tracks layers on Ableton Live like a champ, as well. Multitasking between creative software and multiple Google Chrome tabs feels fluid. That extends to gaming performance as well.",
    "For those looking to get some gaming in between Premiere editing sessions, the Studio G7 does offer respectable gaming at 1080p. In Total War: Three Kingdoms the Studio G7 holds an average 40 fps on ultra settings at 1080p and even a higher 147 fps average with lower settings at the same resolution.",
    "Metro Exodus provided impressive results as well. On lower settings, the survival first person shooter manages 125 fps at 1080p. Ultra settings with the same resolution yields an 37.67 fps average and a bit less with ray tracing enabled. For more recent releases like Cyberpunk 2077, performance averages 60 fps on recommended settings (mostly mid-to-low range) with a slight drop if ray tracing was enabled.",
    "Gears 5 provided a locked 60 fps on higher settings at 1080p. Other resource intensive games like Death Stranding, Control and Doom Eternal run well too. Users looking to try virtual reality can be rest assured of admirable performance as HP calls both the Studio and Create G7 the world’s smallest 15 inch notebook that’s VR ready. Those looking for something more gaming ready may want to look into the Create G7.",
    "Regardless of the power packed behind the smaller form Studio G7, battery life is just adequate and on par with its Create G7 sibling, which also houses a 6-Cell 83 WHr battery. During the PC 10 Battery Life test, the laptop bottomed out at 7 hours and 52 minutes. Meanwhile, the looping Guardians of the Galaxy test provided lesser results.",
    "The Studio G7 ran out of juice at 7 hours and 11 minutes during that benchmark test. During general usage, this is enough battery life for a full work day or bi-coastal flight from a single charge. Charging is fairly quick with the battery reaching 100 percent in less than a few hours.",
    "Audio wise, special care and attention went to the outstanding internal Bang & Olufsen speakers. Made up of four speakers including two tweeters and two woofers, the sound quality is magnificent. Watching video, listening to music, video editing or gaming, the internal audio quality the Studio G7 provides is exceptional.",
    "Volume wise, they can get loud without sounding blown out. Despite the increased peak volume levels, the sound is precise and clear. With a bandwidth between 150 Hz to 20kHz, the speakers have plenty of range. Highs are crisp while bass are strong. According to HP, the speakers feature smart technology that protects the speakers from being blown or damaged due to over-excursion. Listening to music through VLC media player with the volume at 125 percent didn’t lead to any pops either.",
    "Compared to the last ZBook iteration, the 720p webcam is a bit smaller. Despite the size, video and photos look decent in various light conditions.",
    "Like many HP laptops, the Studio G7 does come packed in with HP Support Assistant app. Users needing help with system diagnostics, hardware maintenance, troubleshooting and customer support among other probable needs have a good step. Anything beyond that, individuals have a great three year limited warranty and service offering including three years of parts and labor."
  ],
  "headers": {
    "0": "Two-minute review",
    "2": "Price and availability",
    "4": "Design",
    "12": "Performance",
    "17": "Battery Life",
    "19": "Software and features",
    "23": "Don’t buy it if..."
  },
  "links": {
    "ZBook Create G7": "https://www.techradar.com/reviews/hp-zbook-create-g7-2020-review"
  }
}