{
  "source": "https://www.techradar.com/reviews/nikon-nikkor-z-mc-105mm-f28-vr-s",
  "title": "Nikon Nikkor Z MC 105mm f/2.8 VR S review",
  "category": "cameras",
  "updated": "2021-08-13T06:11:25Z",
  "author": "amy-davies",
  "summary": "An excellent macro lens that's also handy for portraits",
  "verdict": "We had to wait quite a while for a native Z-mount Nikon macro lens, and then two came along at once. The 105mm f/2.8 VR is the more advanced (and more expensive) of the two, but it provides stunning results for lovers of close-up photography. With a useful focal length for portraits and other subjects too, it's also quite a flexible option.",
  "pros": [
    "In-built stabilization",
    "Excellent bokeh",
    "Advanced coatings"
  ],
  "cons": [
    "Somewhat large and bulky"
  ],
  "article": [
    "We've been waiting quite a while for Nikon to add native Z mount macro lenses to its line up, and now two have come along at once. The Nikkor Z MC 105mm f/2.8 VR S, which we're testing here, was launched at the same time as the more affordable Nikkor Z MC 50mm f/2.8.",
    "Although both offer macro capabilities, both are aimed at different audiences. While the latter is intended as a cheaper, smaller, and lighter all-rounder option for a wide variety of different uses, the higher-quality, more expensive and larger 105mm is targeted more squarely at those for whom macro is a particular passion.",
    "Intended to be used with full-frame cameras such as the Nikon Z7 II (below) or Nikon Z6 II, 105mm is a classic focal length for macro and close-up work. But it should also double up nicely as a short telephoto offering, making it well-suited to other scenarios such as portraits.",
    "Although relatively compact for its type, weighing in at 630g and measuring 140mm in length and 85mm in diameter, the 105mm is by no means lightweight or small. It’s unlikely you’d think of it as a 'walk-around' lens, but rather one you'd pack for a specific purpose or reason.",
    "That's not to say that the lens is unwieldy or cumbersome, as it matches up quite well with the larger models in Nikon’s Z series line up. But it would pair less well with the APS-C models such as the Nikon Z50 or the newly announced Nikon Zfc however.",
    "It’s useful to compare it with the Nikkor 105mm macro F-mount (DSLR) lens, which although slightly smaller (116mm in length, 83mm in diameter), is heavier than the Z-mount option, at 750g. It’s also worth noting that if you wanted to use that F-mount lens with a Z-mount camera, you’d have to also consider the size and weight of a Z-mount adapter, which would add significant bulk.",
    "Designed to be used by professionals and advanced hobbyists, the 105mm f/2.8 features extensive sealing around the mount and all moving parts, with the intention of keeping dust and moisture out. Photographers can feel confident using the lens in less than perfect weather conditions, with a fluorine coating on the front element working well to repel water, dust and dirt. A lens hood is also included in the box, which as well as helping to reduce flare, also keeps other contaminants – and fingerprints – away from the lens element.",
    "In terms of the lens construction, there are 16 elements in 11 groups. This includes three ED (extra-low dispersion) elements, one aspherical element, and elements with Nano Crystal and ARNEO coatings (Nikon's anti-reflective coating), which are designed to reduce problems such as ghosting and flare. A nine-bladed aperture also enables perfectly rounded and pleasing bokeh (out of focus areas) when shooting at the maximum f/2.8 aperture.",
    "Like some of the larger and more advanced lenses in Nikon’s Z mount line-up, the 105mm f/2.8 features an OLED display. With this you can see various settings by pressing the display button just next to the window. You can rotate through the various options with multiple presses of the button, to display aperture value, focusing distance and magnification ratio.",
    "A second button, marked L-Fn, can be customized via the camera’s main control menu. There’s an extensive array of options to choose from here, including metering, AF-on, subject tracking, switching on raw shooting and plenty more besides. Further operation customization is provided by a small control ring towards the front of the lens – with this you can elect to adjust aperture, exposure compensation or ISO without having to touch the controls on the camera itself.",
    "Towards the mount-end of the lens, you’ll find the 'A/M' (automatic / manual) switch and the focus limiter. The latter restricts focusing to the closest capabilities of the lens, which in this case is just 0.29-0.5m, which can make focusing quicker as it'll prevent the lens from hunting outside of this scope.",
    "The large ring in the centre of the lens is used for manual focusing. You can either manually focus full time by switching the 'A/M' switch to 'M', or you can perform a manual override of autofocusing, particularly if you want to fine-tune focusing. You'll find that the need to override manually is relatively limited, as the autofocusing does an excellent job in the majority of situations. But there are plenty who find manual focusing to be a preferable way of working with macro subjects.",
    "Shooting macro on mirrorless bodies is particularly advantageous thanks to features like focus peaking, both through the viewfinder and displayed on screen. It’s worth switching focus peaking on in the main menu to assist you when manually focusing, with a variety of peaking colors available depending on your preference.",
    "Autofocusing is quiet, quick and smooth, particularly in well-lit situations. That makes the Nikkor Z MC 105mm f/2.8 VR S excellent for using in discreet situations, such as photographing insects and small animals, as well as being fantastic for recording video, too. The lens uses an internal focusing system, which means that the front element does not move when it's focusing. You can add a filter to it (62mm thread) and it will stay locked in position.",
    "In low-light conditions, particularly when paired with the older mirrorless bodies like the Nikon Z6, the lens' autofocus can slow down a little. Despite that, the results are absolutely terrific. This is mostly thanks to the built-in vibration reduction (VR) system.",
    "With macro photography, that can be beneficial for shooting in locations such as woodlands, when it’s not necessarily night time, but light isn't in abundance either. Anyone shooting indoors in the evening or in low light can also benefit from it, as some of the above gallery examples show (all low-light images taken handheld at ISO 64).",
    "With VR you can use lower ISOs and faster shutter speeds than might otherwise be necessary without it – we’ve been able to get away with shutter speeds as slow as 1/8 sec and still have usably sharp results.",
    "Speaking of sharpness, the 105mm f/2.8 VR S lens displays the same kind of excellent sharpness we’ve grown accustomed to seeing from Nikon’s S series lenses for the Z-mount. At f/2.8 (the widest aperture), the centre of the frame is impressively sharp. At the edges there is some slight blurring, but it’s only what we’d expect from a fast prime lens such as this.",
    "Some very minimal vignetting can be seen on occasion, particularly when shooting certain subjects that make it more obvious. For busy scenes or those that fill the frame completely, it’s not something that you'll notice too often.",
    "Sharpness remains excellent throughout the majority of the aperture range, dropping just a little at f/11 and again at f/16 – this is really only noticeable when examining very closely, and again, is entirely what we’d expect.",
    "Overall this is a fantastic lens that lovers of macro will be pleased to see making an appearance in the Nikon Z line. Being useful for other subjects, particularly portraits, makes it a great addition to a variety of different types of photographers, too."
  ],
  "headers": {
    "21": "Don't buy it if..."
  },
  "links": {
    "Nikon Z7 II": "https://www.techradar.com/reviews/nikon-z7-ii",
    "Nikon Z6 II": "https://www.techradar.com/reviews/nikon-z6-ii",
    "Nikon Z50": "https://www.techradar.com/reviews/nikon-z50",
    "Nikon Zfc": "https://www.techradar.com/news/nikon-zfc-release-date-price-specs-and-features"
  }
}