{
  "source": "https://www.techradar.com/reviews/roidmi-nano-p1-pro-handheld-vacuum-cleaner-review",
  "title": "Roidmi Nano P1 Pro handheld vacuum cleaner review",
  "category": "appliances",
  "updated": "2021-03-05T10:51:33Z",
  "author": "gerald-lynch",
  "summary": "A powerful compact vacuum cleaner suitable for small jobs",
  "verdict": "A compact design makes for a the surprisingly-powerful Roidmi Nano P1 Pro very portable, but also means it suffers in some key cleaning areas.",
  "pros": [
    "Compact tube-like design",
    "Strong suction",
    "Charges over USB-C"
  ],
  "cons": [
    "Small bin",
    "Shape makes it awkward to reach some areas",
    "Only one suction head fitting"
  ],
  "article": [
    "Regularly spilling crumbs? Kids make a mess in the back of the car? Into debris-deploying arts and crafts? Then the super portable Roidmi Nano P1 Pro vacuum cleaner may be for you – providing you don’t expect it to do any bigger clean up jobs.",
    "Tube-like in shape, the battery-powered, handheld Nano P1 Pro has a compact design with a flip-up nozzle that makes it well suited to cleaning up a keyboard or around skirting boards. Charging over USB in just a couple of hours, it’s surprisingly powerful too, especially when activating its boost suction mode.",
    "However, its size has some drawbacks, necessitating only a very small dust bin, while the single nozzle option and slightly awkward cylindrical shape make it unfortunately difficult to use in the tight corners you’d expect it to be best suited for.",
    "The Roidmi Nano P1 Pro is available now, priced £119 (which is around $170 / AU$215 when converted directly). European retailers have quite wide availability of the vacuum cleaner (Amazon is currently your best bet), but global markets may have to look into imports if the Roidmi Nano P1 Pro takes your fancy.",
    "Can a vacuum cleaner be cute? And should it make you hungry when staring at it? I ask because the Roidmi Nano P1 Pro is so compact it looks like it could be a buddy of R2-D2, while its Pringles tube shape and size gives me a serious case of the munchies.",
    "Available in black or white (we reviewed a black model), the majority of the handheld vacuum cleaner is finished in matt black with a glossy black logo wrapping around its edge, and a textured strip around the back for better grip of its smooth, round surface. Above the textured area you’ll find the USB-C port for charging, and above that is a small LED flashlight which activates when in use for lighting up darker corners of your home. The vacuum cleaner also comes with a lanyard attached, should you wish to hang it somewhere, while a coin-sized lock on the bottom releases a small dust filter for cleaning.",
    "Around the front is the circular power button, with an LED ring that fits around it to indicate on/off and battery levels. Holding the button turn it on or off, while another push when in use will activate a higher-powered suction mode.",
    "The top third of the Roidmi Nano P1 Pro is made of a clear transparent plastic, and its here where you’ll find the suction nozzle and dust bin. The suction nozzle is cleverly folded away under a hinge that flips up to reveal the brush when lifted, bringing the vacuum cleaner to a smoothly-wedged point for cleaning. It’s a smart way of protecting the head when in transit, and for keeping the overall footprint of the device nice and tidy when stored away.",
    "This transparent section twists off to reveal the opening for the dustbin, which is held in place with a rubber stopper. It’s only a small bin, with a capacity of 0.1 litres, so don’t expect to clean up major mess disaster zones, and note that the way the bin is removed makes it difficult to avoid getting some of the crud inside on your fingers. Both the bin and the dust filter can be cleaned with water safely, providing they’re both left to fully dry before being replaced.",
    "As we’ll get to in a moment, it’s unfortunate that only one nozzle option is available for the Roidmi Nano P1 Pro, being the one built into the device. And note that while a USB-C cable is included in the box, you’ll need to hook it up to your own charging plug, with a full charge taking about 2 hours and 30 minutes to complete.",
    "Depending on your needs, the Roidmi Nano P1 Pro can be quite an effective little cleaning tool. Despite its size, it’s surprisingly powerful, with its boost mode not far off the performance you’d see from the lowest power setting of a full-size cordless vacuum cleaner. It won’t match a Dyson on a standard power setting, let alone something like the V11 Outsize’s full-power mode, but it’ll get the job done for quick clean ups, meaning you shouldn’t underestimate it just because of its size.",
    "The bigger issue (or smaller, depending on your perspective) is however the bin size itself – it’s a trade off of the design’s small nature. It’ll fill up very quickly if you’re using the vacuum cleaner regularly. More frustrating is the nozzle design – the funnel through which debris is sucked isn’t all that big, and can easily get clogged, and bigger pieces of dirt, like spilt cereal, can get stuck. The nozzle design has an unusual profile too, with its deceptively wide head making it difficult to squeeze into tighter corners, as well as not making it clear as to where exactly to point it in order to appreciate the full force of the suction power.",
    "Being able to swap in a narrower nozzle would have helped enormously. With its length restricted by your reach, don’t expect to hit too many high corners without a step ladder either. As such, it’s a cleaner best used as a quick duster, or to give a jacket a tidy up, or to run along skirting boards.",
    "Battery power is surprisingly good though. You’ll get around 30 minutes from a full charge on the standard power setting. And considering this should only be used for smaller clean up jobs, that’s more than enough time to save you always hunting for the power cable."
  ],
  "headers": {
    "0": "One Minute Review",
    "3": "Price and Availability",
    "4": "Design",
    "10": "Performance",
    "14": "Don't buy it if..."
  },
  "links": {}
}