{
  "source": "https://www.techradar.com/reviews/oukitel-wp15-rugged-smartphone",
  "title": "Oukitel WP15 rugged smartphone review",
  "category": "phones",
  "updated": "2021-08-24T17:11:14Z",
  "author": "desire-athow",
  "summary": "A handset that will divide opinions but can’t be criticized for trying new things",
  "verdict": "The WP15 is a truly unique smartphone; those even considering buying it will be acutely aware of its specificities. It is a one-pound smartphone that is one-inch thick and can do 5G that is capable of many tricks and at a price that’s actually quite competitive.",
  "pros": [
    "Massive battery",
    "5G connectivity",
    "Good performance",
    "Excellent price"
  ],
  "cons": [
    "No wireless charging"
  ],
  "article": [
    "Oukitel plans to succeed with a big battery smartphone when others before it, most notably the weird looking Energizer Power Max P18K Pop and its 18Ah battery, have failed. While Energizer had the biggest battery we’ve seen on a smartphone, it never went on general sale while the WP15, at least, reached that goal without resorting to any crowdfunding shenanigans.",
    "With a 15.6Ah battery, 5G connectivity, IP68/MIL-STD-180G rating, this is a versatile smartphone that could easily double as an affordable all-weather mobile hotspot for busy outdoor teams, albeit one not likely to challenge dedicated 5G hotspots like the Netgear Nighthawk MR5200 5G WiFi 6 portable mobile hotspot router.",
    "Throw in a very attractive price tag and some high-resolution camera sensors and you end up with a truly unique smartphone that - for the right audience and scenarios- will be a Godsend. On the other hand, its size will divide opinions as you’re essentially getting a smartphone paired with a portable battery charger and glued to a shockproof casing.",
    "The competition is already there - the just announced Ulefone Power Armor 13 has a smaller 13Ah battery and 4G (rather than 5G) but has a flurry of accessories including a wireless charger and an endoscope.",
    "The WP15 is available from AliExpress for just under $300 at the time of writing. The price doesn’t include local taxes and delivery companies may add an additional levy. As always, caveat emptor if you plan to buy this smartphone from China.",
    "First, let’s address the elephant in the room; the WP15 is the biggest and heaviest smartphone we have handled to date, although it doesn’t have the largest footprint. At 178.2 x 86.2 x 23.8mm for a weight of 485g (that’s more than one pound in weight), it feels like a brick but its V-shape design combined with the usual 8-side form factor makes it a bit easier to hold.",
    "Oukitel, like most other rugged smartphone vendors, has adopted a conservative design with gunmetal-colored metal and black rubber, giving it the looks of a device that hails from an intergalactic spaceship. There’s some extra precautions - like reinforced rubber corners - added to prevent damage to the screen.",
    "The bottom of the phone is host to a rubber flap that hides a Type-C USB port and a lanyard connector loop.",
    "On the left of the WP15 is a customizable button and a SIM tray while the other edge contains a fingerprint reader that doubles as the power button as well as a volume rocker.",
    "At the rear are three sensors (a 48MP Sony IMX314, a 2MP one and a 0.3MP one) plus four LEDs arranged in a weird V Shape. The 6.5-inch HD+ display is covered with an oleophobic layer and surrounded by a thick protective rubber frame and has a teardrop 8MP selfie camera sensor bang in the middle.",
    "While the 15.6Ah battery is the unique selling point of the WP15, the rest of the specification is not actually that bad. Most notably, it uses a 5G-capable Mediatek Dimensity 700 which is paired with 8GB of RAM and 128GB eMMC storage.",
    "Wireless connectivity includes NFC, Bluetooth 5.0 and Wi-Fi 5. Note that the phone is charged using a 9V,2A (18W) power supply unit with OTG capabilities which means that you can use it to power other devices as well.",
    "The WP15 runs on Android 11 and like all Mediatek-powered smartphones has a number of dedicated apps: GameMode optimizes the device for, well, gaming (not that the WP15 is a gaming beast, far from that), System Manager is a utility suite that seeks to tweak the handset for optimal performance while ChildMode allows the administrator to offer a secure, limited area. Toolbag offers nine tools (Compass, SoundMeter, Protractor etc) while Smart Panel allows you to switch quickly between apps.",
    "As for sheer performance, the WP15’s Dimensity 700 SoC was generally inferior to other devices running on Mediatek’s Dimensity 800 platform. That can be explained by the different core configuration (two large cores supported by six smaller ones rather than four large and four smaller cores) as well as the lower number of graphic cores which impacted compute and video performance overall. Note that the WP15 can run two 5G SIM simultaneously.",
    "Buy it if:",
    "You want the biggest battery around",
    "The 15.6Ah battery on the WP15 will be useful not only to keep the smartphone running longer but also act as an emergency battery charger for other devices thanks to its reverse charging feature. Shame it doesn’t do wireless charging.",
    "If you want a reasonably priced 5G rugged smartphone",
    "It is one of the more affordable rugged 5G smartphones on the market as well, which is not a bad place to start. As long as you can live with its bigger-than-average girth.",
    "Don’t buy it if:",
    "You don’t want a big phone",
    "The WP15 is a huge smartphone, one of the biggest we’ve seen and we truly understand that it won’t appeal to a lot of folks. Just bear in mind that you could buy it in lieu of a 5G mobile hotspot and get something far more versatile.",
    "You want rock-solid after sales support",
    "Oukitel and most of the Chinese rugged smartphone retailers have been very coy about future firmware and OS upgrades. Likewise, warranty is patchy at best with returns."
  ],
  "headers": {
    "0": "Two minute review",
    "4": "Pricing and availability",
    "5": "Design",
    "10": "Hardware",
    "12": "In use",
    "14": "Should I buy the Oukitel WP15?"
  },
  "links": {
    "Energizer Power Max P18K Pop": "https://www.techradar.com/reviews/energizer-power-max-18k-pop",
    "mobile hotspot": "https://www.techradar.com/news/best-mobile-hotspots-for-3g-4g-and-5g",
    "Netgear Nighthawk MR5200 5G WiFi 6 portable mobile hotspot router": "https://www.techradar.com/reviews/netgear-nighthawk-mr5200-5g-wifi-6-portable-mobile-hotspot-router",
    "AliExpress": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-1308167799353747500&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F1005003008124411.html%3Fspm%3Da2g0o.productlist.0.0.220d2d66B0DSZA%26algo_pvid%3D928be062-b7e8-490d-97a0-9c005855cc15%26algo_exp_id%3D928be062-b7e8-490d-97a0-9c005855cc15-0",
    "caveat emptor": "https://www.techradar.com/news/world-of-tech/want-to-buy-tech-from-online-chinese-retailers-read-this-first-1324890",
    "battery charger": "https://www.techradar.com/news/top-portable-chargers"
  }
}