{
  "source": "https://www.techradar.com/reviews/identityprotectcom",
  "title": "IdentityProtect.com review",
  "category": "computing",
  "updated": "2021-03-18T21:41:52Z",
  "author": "john-brandon",
  "summary": "A somewhat predictable Identity Theft app with a few interesting extra features",
  "verdict": "Despite the weird name, IdentityProtect.com is a powerful identity theft protection app that adds some interesting features beyond what you’d expect. It costs a bit less than other products with similar features, such as the $1 million theft protection insurance (for the premium plan). The app doesn’t provide too much detail about the theft protection field and doesn’t have the brand name recognition of competing apps, but it does offer a compelling alternative.",
  "pros": [
    "Low cost",
    "Interesting extras"
  ],
  "cons": [
    "No name recognition",
    "Average website"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "A stern-looking man is staring at you. He has his glasses dangling in his hand, a frown on his face, and his hand is on his hip. His expression says it all - why have you not been using theft protection? Your life is in his hands. Your future will be dictated by him alone.",
    "While that sounds like a parental scolding, it’s actually a mascot of sorts for IdentityProtect.com. (The company refers to itself that way, instead of Identity Protect. It’s perhaps a reminder that we’re talking about online identity theft here.) On their homepage, the stern-looking man greets you in a way that’s intended to make you want to register for an account but might make you snicker instead. It doesn’t help that the IdentityProtect.com website uses other stock images - one guy is giving a thumbs-up holding a smartphone with a superimposed product logo.",
    "And yet, the product itself is sound. There are quite a few extra features that are not as common with other apps, and the pricing model is attractive for budget-minded consumers.",
    "Unlike Norton LifeLock and many other identity theft protection apps, IdentityProtect.com doesn’t mess around with complicated pricing plans. There are two total. The Basic plan for $12.95 per month includes one credit bureau and $100,000 of identity theft protection insurance. The Ultimate plan costs $19.95 per month and includes $1 million in protection and alerts from three credit bureaus. Norton LifeLock costs about $10 more for the premium plan. The cheapest identity theft product we’ve found is Complete ID, which requires a Costco membership and costs only $8.99 for Executive members (or $13.99 per month for Business members).",
    "IdentityProtect.com also offers business plans that range in price from $39 per month for 10 employees up to $149 per month for a company with 100 employees. It’s a bit odd, actually, to offer these plans because identity theft protection is a highly personal topic - akin to health insurance or a retirement plan. It’s a way for employers to offer the app as another benefit, but it also seems like a tacked-on payment option without any real benefits.",
    "Many of the identity theft protection apps use a dashboard interface with tabs at the top of the screen to help you find the sections for dealing with identity theft issues. IdentityProtect.com is no different and has a bit of a dull and boring interface that doesn’t inspire creative thinking when it comes to resolving credit problems or if your bank account is hacked. It’s clear, clean, and consistent with a professional polish but does not provide the wizards or dashboard interface of Norton LifeLock (one of our top picks in identity theft protection for everything except price).",
    "At first glance, IdentityProtect.com seems to offer a standard set of features. You can see alerts about your credit, bank account changes, and track your credit score. With the Basic plan, you have access to one credit bureau and with the Ultimate plan you gain access to three agencies. Fairly standard stuff. The product website doesn’t mention whether you can call in and resolve issues with the help of an investigator or tech support personnel. The only references are to helping with fraudulent claims but not any notes about hotline numbers.",
    "However, there are a few extras beyond what we’ve found with other apps. For starters, included with the Ultimate plan is an alert when someone tries to open a checking account in your name. The app claims to have features that help remove unwanted email and unwanted postal mail. The social media monitoring is somewhat common with other apps, and once again we wish it would alert you to account hacking and not just reputation problems. (For example, the app will warn you if there is too much swearing or drug references in your feed.)",
    "There’s a sense that IdentityProtect.com is a somewhat middle-of-the-road product with average features and average pricing. It's cheaper than some apps like Norton LifeLock (which costs about $30 per month for the premium plan) but not as inexpensive as Complete ID or IdentityForce. If you pick the Basic plan for IdentityProtect.com, it includes only $100,00 of theft protection insurance. The app doesn’t mention a hotline you can call to resolve issues with your credit by talking to a licensed investigator. It’s all fairly predictable.",
    "That said, it’s the extra features that might make IdentityProtect.com more appealing for some. If you really need to see alerts about a fraudulent checking account or will benefit greatly from trimming down on your email or snail mail, maybe IdentityProtect.com is a perfect fit. It’s not an expensive product, has many of the standard features most of us need, and the interface is solid if unremarkable. We wish the app included more information about identity theft on their website to educate both current and potential customers. We also wish the app made it more obvious if there is an investigator you can call to help you resolve credit issues."
  ],
  "headers": {
    "4": "Plans and pricing",
    "6": "Interface",
    "7": "Features",
    "9": "The competition",
    "10": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "IdentityProtect.com": "https://www.identityprotect.com",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "Basic plan": "https://www.identityprotect.com/protection-selection.asp",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "Ultimate plan": "https://www.identityprotect.com/protection-selection.asp",
    "business plans": "https://www.identityprotect.com/protection-selection.asp",
    "Complete ID": "https://www.techradar.com/reviews/complete-id",
    "IdentityForce": "https://www.techradar.com/reviews/identityforce"
  }
}