{
  "source": "https://www.techradar.com/reviews/sony-xperia-5-iii",
  "title": "Sony Xperia 5 III review",
  "category": "phones",
  "updated": "2021-08-20T13:44:54Z",
  "author": "jon-mundy",
  "summary": "Sony’s enthusiast smartphone line tones things down a little",
  "verdict": "The Sony Xperia 5 III successfully scales things back from the lavish Xperia 1 III, with comparable performance and almost equal photographic potential wrapped up in a more compact body. Battery life is even better, too. It’s still lacking in a few fundamental areas, however, and those omissions sting all the more in light of flagship pricing.",
  "pros": [
    "Potent performance in a compact form factor",
    "Balanced, nuanced triple-camera system",
    "Excellent battery life"
  ],
  "cons": [
    "No wireless charging",
    "Design hasn’t moved on",
    "Quite expensive given some of the omissions"
  ],
  "article": [
    "Following hot on the heels of the Sony Xperia 1 III, Sony’s best smartphone in years, comes the Sony Xperia 5 III. It’s ostensibly the same phone in a smaller and significantly cheaper package.",
    "It boasts a similar elongated design that prioritizes landscape media content above all else, benefits from the exact same top-level performance, and contains virtually the same flexible triple–12MP camera system.",
    "However, there are a number of areas where the Xperia 5 III doesn’t quite match up to its big brother. The design isn’t quite as sharp, the haptics are of lesser quality, there’s no wireless charging, and its display doesn’t even hit QHD let alone 4K levels of sharpness.",
    "None of which is particularly problematic in light of the Xperia 1 III’s sky high price tag. But the Sony Xperia 5 III also seems quite expensive in its own way. For around the phone’s $949 / £899 (roughly AU$1,300) price tag, you’ll be able to find plenty of other phones that don’t cut the same corners.",
    "In day to day use, however, few of these elements matter all that much, and the Xperia 5 III is a joy to use. Its 6.1-inch 120Hz display is a fluid delight, and its camera system is a hands-on photographer’s dream.",
    "Meanwhile, the Sony Xperia 5 III’s more compact dimensions make its unusual aspect ratio less of an issue than it is with the Xperia 1 III. It’s much easier to use one-handed.",
    "Battery life is a particular strength here, with a cell that’s surprisingly the exact same size as the Xperia 1 III’s. We’re used to compact phones coming up short on stamina, but not so with the Xperia 5 III.",
    "Add in a top notch audio provision, and you have a media-enthusiast-oriented phone that’s just a little more approachable than the Xperia 1 III, if not quite the advancement from the Sony Xperia 5 II that we had hoped for.",
    "The Sony Xperia 5 III has experienced quite a delay from its April 2021 announcement. It’s now set for a September launch, which would mark a slightly ludicrous gap of five months.",
    "Prices are set at $949 / £899 for the default model, which comes with 128GB of internal storage. That works out at around AU$1,300, though it’s unlikely to ship in Australia judging from Sony’s launch practices of late.",
    "There’s also a 256GB option available in certain territories, but not the US or UK. It’s also worth pointing out that this price marks a considerable price bump for UK buyers, with 2020’s Sony Xperia 5 II costing $949 / £799 at launch.",
    "In terms of direct rivals, the Sony Xperia 5 III’s pricing places it alongside the iPhone 12 Pro and the OnePlus 9 Pro.",
    "If the Sony Xperia 1 III felt familiar, then the Sony Xperia 5 III is liable to instigate a major bout of déjà vu.",
    "Sony’s current full-sized flagship phone took the Xperia 1 II’s boxy design and added a smart matte finish that subtly distinguished it. It’s a shame the Xperia 5 III, as a compact alternative, doesn’t repeat the trick. Instead, Sony has stuck with the same slightly rounded edges and shiny finish as the Xperia 5 II before it.",
    "This is still a distinctively handsome, unusually tall and thin phone though, distinguished by an extra-skinny 21:9 display and a non-regulation forehead and chin. As before, there’s a very good reason for those extended top and bottom bezels.",
    "The top one contains the Sony Xperia 5 III’s selfie camera, meaning there’s no need for a display notch. They also enable the rare provision of front-facing stereo speakers, which sound decent - if not quite as full and spacious as the Xperia 1 III’s.",
    "Despite the presence of a flat display and the accompanying side-bezels, the Xperia 5 III is extremely narrow, and thus easy to wield in one hand. We were comfortably able to reach a good two thirds of the display with our holding thumb, and even those with smaller hands will find it quite manageable.",
    "Relative height aside, the Sony Xperia 5 III is that rare Android phone that belongs in the compact flagship phone category. It’s no iPhone 12 Mini, but it does pack its powerful innards into a 157 x 68 x 8.2mm body that weighs a mere 168g.",
    "Despite its understated poise, we do get the sneaking sensation that Sony has cheaped out just a smidgen with some of the Xperia 5 III’s design. Aside from that barely-altered construction, its haptics don’t feel as tight and nuanced as you might expect from a phone of this price. They’re certainly not in the same league as the Xperia 1 III’s, and they don’t match the similarly priced OnePlus 9 Pro’s either.",
    "Both of Sony’s latest flagship phones have aluminum frames, but as stated, the Xperia 1 III’s is flatter and more angled at the corners, with an alluring matte finish. Here those edges are rounded and shiny, which doesn’t look or feel as good.",
    "There’s a dedicated two-stage shutter button on the right hand edge, but it lacks the clearly defined texture of the Xperia 1 III’s. You still get a fingerprint sensor stashed within an elongated power button, however, as well as a dedicated Google Assistant button.",
    "That fingerprint sensor is speedy and reliable, though still a little too sensitive to accidental presses. We would quite often fish the phone out of our pocket to find that we’d have to tap our passcode in following too many authentication attempts. It’s an issue with the Xperia 1 III too.",
    "We’re glad to see that Sony hasn’t ditched the 3.5mm headphone jack from the top of the phone. There aren’t many phones at this end of the market that have stuck with this audiophile-friendly feature.",
    "The flat front of the phone also gets covered in Gorilla Glass 6 rather than the Xperia 1 III’s Gorilla Glass Victus, which means it’s slightly less resistant to scratches and cracks.",
    "It’s good to see a comprehensive IP65/IP68 dust/water resistant rating make a return, though. This means that the phone has been put through more stringent tests than most, including water jets alongside the usual full immersion.",
    "The Sony Xperia 5 III’s display is as familiar as its design. It’s another 6.1-inch OLED, together with a 1080 x 2520 (FHD+) resolution for a total 449 pixels per inch.",
    "No, that doesn’t match the 4K majesty of the Sony Xperia 1 III, nor even the intermediate QHD standard of virtually every other Android phone of this price. But it’s questionable how much value there would be in packing so many pixels into a 6.1-inch space.",
    "When stacked side by side with the Xperia 1 III in Sony’s Standard mode, it’s an altogether warmer display, though it gets equally bright. Like its big brother, you also get an optional Creator mode, which provides more faithful color reproduction for movie content.",
    "And that movie content looks great on this flat, unbroken, ultra-wide 21:9 canvas. This is where Sony’s unorthodox approach to smartphone screens really pays off, especially with the company’s cinematic color science on board.",
    "In general use we preferred to stick with the crisper tones of Standard mode, with Creator mode set to engage automatically when appropriate content appears. While it suits media content, it felt a little too warm and flat when zipping through menus and apps, so it’s good to have the option of the best of both worlds.",
    "As with the Xperia 5 II, you also get a rapid 120Hz refresh rate. You’ll need to activate this in the settings menu, as is often the case. But once you do, scrolling through web and app content proves delightfully fluid.",
    "Of course, in last year’s model, this 120Hz refresh rate was an important distinguishing factor from the Xperia 1 II. With the Xperia 1 III gaining this feature, the smaller device no longer has any bragging rights in the display department.",
    "The Sony Xperia 5 III inherits its triple–12MP camera system from the Sony Xperia 1 III. All that’s missing is the more expensive phone’s time-of-flight (ToF) sensor for judging depth.",
    "As a result, much of what we said about the Sony Xperia 1 III’s camera holds true here. This isn’t top of the range when it comes to the point-and-shoot experience, but those who like to take their time composing shots with considered manual tweaks will find a powerful tool here.",
    "At the heart of the Xperia 5 III’s camera setup is a 12MP f/1.7 aperture 24mm wide-angle shooter. That low megapixel count, coupled with a fairly large 1/1.7\" image sensor, produces chunky 1.8µm pixels that don’t need to rely on image processing tricks like pixel binning to secure fine detail.",
    "The pay off for this is a very speedy, unencumbered shooting experience. It also enables the Xperia 5 III to switch into a rapid-fire 20fps burst mode.",
    "Speed and precision really is the name of the game here. Sony’s Dual PDAF technology enables quick, reliable lock on to a subject’s eyes. That even includes animals, as we confirmed when snapping a curious squirrel in a local park using the zoom lens.",
    "The lack of the Xperia 1 III’s 3D ToF sensor is relatively inconsequential, though we did observe that the Xperia 5 III wouldn’t lock onto a subject’s eyes in low light conditions where the Xperia 1 III would. It clearly can’t see in the dark quite as well.",
    "Accompanying that main sensor is a 12MP f/2.2 16mm ultra-wide and a 12MP telephoto. It’s good to see three such balanced sensors here, all of which capture a similar cool tone. But it’s the latter sensor that’s been commanding the headlines.",
    "Like the Xperia 1 III, the Xperia 5 III’s telephoto sensor comes with a pair of zoom lenses that rapidly switch according to your requirements. You can flip between an f/2.3 70mm lens and a f/.2.8 105mm lens at the press of a virtual button. Or, to put that in simple point-and-shoot terms, between a 2.9x zoom and a 4.4x zoom.",
    "This is purported to be faster than the approach of Sony’s rivals, which have to switch between two entirely separate telephoto cameras for such a variable optical zoom effect. But in practical terms, there’s nothing particularly special about it, and indeed the Samsung Galaxy S21 Ultra and the Xiaomi Mi 11 Ultra take superior zoomed shots. 4.4x shots, in particular, lack the detail of the other lenses.",
    "In general, though, image quality is very good indeed. As with the Xperia 1 III, you might find Sony’s more naturalistic color science to feel a little drab or flat next to Samsung’s and Apple’s. But we appreciate the the attempt to show what’s there and little else.",
    "Sony continues to have a slight issue with night shots - or at least the messaging around night shots. There’s no dedicated Night mode here, as such, but the phone will pick out more suitable settings in the default Basic shooting mode.",
    "Muddying the waters is a separate Auto mode that tends to more aggressively adjust for such challenging conditions. Perhaps Sony should have just included a dedicated Night mode, like everyone else, and been done with it.",
    "Especially given that the Xperia 5 III doesn’t take night shots as clearly as some of its more image-processing-heavy rivals. Again, the shots taken here often look more natural and ‘as seen’, but they can also be quite drab and noisy. A similar thing is true of the significantly more expensive Xperia 1 III, of course.",
    "For those willing to dive into the camera app’s pro settings, you’ll find that you can take full control over everything but the aperture. There isn’t another stock camera app that places more high-grade photographic variables at your fingertips.",
    "The 8MP front camera isn’t the best we’ve seen, tending to smooth out skin and overexpose highlights. But it’s adequate for taking reasonable selfies and shooting those increasingly vital video calls.",
    "The Sony Xperia 5 III runs on the same Snapdragon 888 chipset that powers the Sony Xperia 1 III, albeit with 8GB of RAM rather than 12GB.",
    "In practical terms, we’d challenge you to pick out any difference between the two phones. This is a seriously fast and smooth operator.",
    "It’ll run any game you can throw at it on high or even maximum settings, including the demanding likes of Genshin Impact. App loading speeds are rapid, as is jumping into the camera app through the shutter button and hopping between open apps in the app switcher.",
    "We recorded an average Geekbench 5 multi-core score of 3,539, which is roughly the same as the Sony Xperia 1 III following recent firmware updates. This is also around the same score as rival devices like the OnePlus 9 Pro - which is unsurprising given the shared internals.",
    "The Sony Xperia 5 III performs very much like a full-sized 2021 flagship phone, in other words, despite its relatively petite dimensions. But then, you’d expect as much given the price.",
    "Sony’s take on Android 11 is similarly fast and fluid. The Japanese tech giant doesn’t go in for heavy re-skins or extensive bloatware these days. There are third party pre-installations for Netflix, Amazon Prime Video, Amazon Shopping, Facebook and LinekedIn, but most of those are quite defensible.",
    "So too is a shortcut to a three month Tidal trial. Sony is really pushing its immersive 360 Reality Audio provision in the Xperia 5 III, and that’s compatible with the high-resolution music service. You’ll really want a compatible set of Sony headphones to make the most of it, though.",
    "Sony’s UI also lays on tweaks to allow for and capitalize on the Xperia 5 III’s extra-tall display. Double tap the Side Sense bar on the right hand edge, and you’ll gain access to a one-handed mode, app shortcuts, and Sony’s split-screen multi-window facility.",
    "The latter runs two apps simultaneously, one on top of the other. It’s a powerful, fast, and surprisingly intuitive feature.",
    "When it comes to storage, there are both 128GB and 256GB models out there on the market, though only the 128GB variant seems to be on offer in the US and UK. It would have been nice to have the extra storage capacity as an option - even $200 / £200 phones come with 128GB these days - but at least there’s a microSD card slot for expansion purposes.",
    "Perhaps the biggest boost the Sony Xperia 5 III has received over the Xperia 5 II is to its battery life. Where the previous model packed a 4,000mAh cell, the Xperia 5 III bumps things up to a healthy 4,500mAh.",
    "Indeed, that’s exactly the same capacity as the Sony Xperia 1 III with its larger, sharper 4K display. Together with the more efficient Snapdragon 888, we were expecting good things from the Xperia 5 III’s battery life.",
    "We weren’t disappointed. At the end of a long 15-hour day of moderate usage (4 hours of screen-on time but no heavy gaming or video watching), we found that the Xperia 5 III had around 50% left in the tank. A more intensive day, with over 5 hours of screen-on time and plenty of pictures, took us down a little below 30%.",
    "We should note that we had that 120Hz display mode active for more or less the whole time through all of this. It’s quite conceivable you could eke out a full two days if you dropped to 60Hz and didn’t hit the media or camera too hard. Though of course, that wouldn’t be exploiting what the Xperia 5 III is best at.",
    "In real life terms, we were never once made to sweat over the Xperia 5 III’s remaining juice levels. It consistently got us through to bed time, typically with plenty to spare.",
    "Which is a good job, as the recharging process is a bit of a disappointment. For one thing, you only get a 30W charger in the box. That’s the same as the $1,300 / £1,199 Xperia 1 III, but then we were pretty disappointed there too.",
    "This relatively weedy 30W charger will get the Xperia to 50% in around 30 minutes, whereas something like the OnePlus 9 Pro with its 65W charger will get you to full in the same time.",
    "Perhaps an even bigger let-down is the lack of wireless charging. Pretty much every other mainstream $949 / £899 smartphone features such a provision as standard, as do a fair few cheaper phones, such as the £749 Xiaomi Mi 11.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Sony Xperia 5 III price and release date",
    "12": "Design",
    "25": "Display",
    "32": "Camera",
    "47": "Specs and performance",
    "57": "Battery life",
    "65": "Don't buy it if..."
  },
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Sony Xperia 5 II": "https://www.techradar.com/reviews/sony-xperia-5-ii-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "iPhone 12 Mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review"
  }
}