{
  "source": "https://www.techradar.com/reviews/planethippo",
  "title": "Planet Hippo review",
  "category": "computing",
  "updated": "2021-10-05T06:25:14Z",
  "author": "mike-williams",
  "summary": "Cheap prices may draw you in, but is there anything else worth sticking around?",
  "verdict": "If you are bargain-hunting in the UK, Planet Hippo is definitely worth a look. Its entry-level plan is absurdly cheap yet as limited as they can get, and the performance is nothing to write home about. However, if you can spare the extra cash, its advanced hosting solutions seem like a pretty good deal.",
  "pros": [
    "Instant setup",
    "30-day money-back guarantee",
    "Both cPanel and Plesk are available",
    "Decent variety of hosting options",
    "Plenty of one-click installs",
    "Very pocket-friendly pricing"
  ],
  "cons": [
    "No website builder",
    "The entry-level plan is extremely limited",
    "The official website looks unfinished"
  ],
  "article": [
    "Launched in 2006 by Jeremy Rose and Darren Lavender, Planet Hippo is a UK-based web hosting company that offers shared, email, reseller, and VPS hosting solutions, as well as SSL certificates and domain registration services. Therefore, whether you are looking for a novice-friendly hosting solution for a personal project or something a bit more advanced to boost your business, Planet Hippo has got you covered.",
    "The company is headquartered in its city of origin, Oswestry (the UK), and all of their data centers are situated in the UK (although the exact number of them and their location remain unknown) together with their customer support staff. Besides being one of the fastest-growing companies on the UK market (in its heyday), Planet Hippo became the first provider in the UK to offer cloud Energy Management capabilities to their customers through a partnership with Cisco Energy Management.",
    "Planet Hippo’s official site is not only minimalistic but also especially secretive when it comes to information about the company itself. Not only did we find the “About” section totally empty, but all our efforts to trace the origin of Planet Hippo’s name ended in total failure. We still find their mascot in the shape of a cartoonish-looking hippopotamus kind of cute though.",
    "Although bare-bones, Planet Hippo’s site offers plenty of details about its products, which is at least something that deserves a compliment. The site should be available in a few languages besides English (as shown in the language section), however, when we tried to switch to other languages we (you’ve guessed it) failed miserably.",
    "Much the same as its “About” section, Planet Hippo’s official blog is still filled with nothingness. The same has been true about their social media accounts since 2018, the last year anything was published in.",
    "If you are looking for a UK-based host with low-priced packages, Planet Hippo is sure to show up among the search results. The entry-level (WordPress and ecommerce optimized) shared hosting plan is cheap as chips at £1.00 ($1.40) per month and the others follow a similar pattern.",
    "However, cheaper isn’t always better and great bargains often come with great restrictions as well. With Planet Hippo’s cheapest plan you’ll get to host a single website, unlimited data transfer, 1GB of web space, one email account, one MySQL database, but no backups nor a free domain registration. Going for the plan above will get you a free domain (.co.uk) and backups, but they will come at an additional cost.",
    "If you can spare £7.99 ($11.10) per month, “Unlimited” (true to its name) will provide you with unlimited everything, one free domain (this time .com), and free daily/weekly/monthly backups.",
    "With VPS plans users can choose between Linux and Windows operating systems, where the Windows plans come a bit more expensive. The reseller plans come with cPanel as your control panel, which means you’re stuck with Linux. All of them are rather reasonably priced and if you want something even simpler than shared hosting, there are four email hosting solutions to choose from.",
    "All Planet Hippo’s plans include a “non-quibble” money-back guarantee and for most of them, it is valid for 30 days.",
    "Prices are listed in GBP and users can pay via all major credit cards (including MasterCard, Visa, and Maestro) and PayPal.",
    "Although with Planet Hippo there is no lack of choice when it comes to solutions for small to mid-sized businesses, picking out one shouldn’t take long. All of their plans are properly presented with all relevant information about them.",
    "After choosing a plan, you’ll be prompted to decide what to do about the domain name: pick out a new one, transfer an existing one or leave it where it is by updating your nameservers. Although there are no free domain names with the entry-level plan, opting for a UK-based domain (.co.uk, .org.uk, .me.uk. and so forth) comes at an affordable price, £4.49 ($6.20) for a year in our case.",
    "After this, you can select a billing cycle (annual, biennial, or triennial), go through quick domain configuration, insert a promo code (if you have one), and start creating your account with Planet Hippo. For this, you’ll have to give them your full name, both email and physical address, and your telephone number (all in all, nothing out of the ordinary), create a password, fill in all the billing information and (finally) make a purchase.",
    "Planet Hippo promises an instant setup with all its plans and as far as we can tell, they are likely to deliver on their promises.",
    "From the WHMCS client management platform you can manage your account, browse other products, check out announcements, consult the network status page, search the knowledgebase or get in touch with the technical support team. To use the service you’ve just purchased, you’ll have to navigate through the Services tab to go to your control panel. In case you purchased one of the shared hosting plans, you’ll get industry-leading cPanel. If you decide on a VPS solution, you get to choose between cPanel and Plesk, both of which are perfect examples of user-friendliness.",
    "All shared hosting solutions are optimized for WordPress and ecommerce, so you can get them in a few clicks via Softaculous one-click installer. Unfortunately, Planet Hippo doesn’t offer a website builder, although their knowledgebase suggests it was available at some point with premium plans.",
    "After testing the speed performance of Planet Hippo’s official site we were unimpressed, to say the least. The loading time was actually quite good, 3.9 seconds in total, and that’s about it when it comes to the good stuff. Two out of three vital web metrics (total blocking time and largest content element) showed a failure of epic proportions resulting in F (28%) as a final grade.",
    "However, since we tested Planet Hippo’s site, this result is more relevant for those seeking a simpler hosting solution, while with VPS and reseller packages all this could turn into a completely different story.",
    "As for uptime, Planet Hippo guarantees 99.9% of it. According to the SLA, for every minute of downtime that exceeds the promised percentage, the customer can get credit worth anything from 2% to 100% of the amount they’ve paid. Unfortunately for Planet Hippo, during our two-week-long uptime test (via UptimeRobot) of their official site quite a few cases of downtime were recorded (six, to be exact) resulting in a total of 99.78% uptime, which doesn’t meet what they promised.",
    "If you find yourself in need of a helping hand, the simplest way to find one on Planet Hippo’s official site is to contact them by choosing the “Contact Us” option on the sites’ footer. The following page will provide you with an option to reach Planet Hippo’s pre-sales support staff via ticket and email address, and they promise to answer all tickets within one hour. However, registered users are given a few more options through the WHMCS UI: a 24/7 live chat, and a UK-based phone number available during office hours.",
    "If you prefer finding solutions all by yourself, Planet Hippo’s knowledgebase should suffice. It contains close to 300 how-tos that are split into 16 specific categories, and interestingly enough you’ll find loads of them related to email hosting issues and concerns. However, we know that quantity does not equal quality and this is true here. Some of the how-tos seem too simplistic while others are completely out-of-date (yes, we mean you, “Outlook 2010 issues”).",
    "Although both Bluehost and Planet Hippo offer fine budget-friendly solutions aimed at beginners, Bluehost can supply you with everything Planet Hippo can and much more. Besides shared, reseller, and VPS solutions, Bluehost also offers managed WordPress and dedicated server hosting as well as a wide array of hosting-related services. In addition to this, its entry-level package is less suffocated with restrictions and you’ll even get a free domain if you subscribe for a full year.",
    "Much like the hosts above, HostGator is a budget-friendly choice geared towards beginners and webmasters alike. Its range of products is similar to what Bluehost has on offer, although its entry-level plan is slightly superior. It puts no limits on bandwidth nor disk space, gives one free domain, free website transfer, free SSL certificate, free drag-and-drop website builder, and even some sweet free ads credit. However, since both HostGator and Bluehost are US-based, if you want a host from Europe (or from the UK in particular), Planet Hippo might be a smarter choice.",
    "Certa Hosting and Planet Hippo share both homeland and hometown, but what else? Besides Certa Hosting offering bare metal servers as well, their product range is pretty similar. However, whereas Planet Hippo’s plans are more on the low-cost side, Certa Hosting provides more powerful performance and superior customer support.",
    "tsoHost is another grand UK-based alternative to Planet Hippo and one that can provide its users with dedicated servers as well. Going at £3.99, tsoHost’s entry-level plan is more expensive than the one you would get with Planet Hippo. Nevertheless, tsoHost provides slightly greater value-for-money by adding one free domain, 100GB of storage space (SSD), up to 100 mailboxes, “fuss-free” one-click installs, and daily backups into the deal.",
    "To answer our question about Planet Hippo, is there anything besides cheap prices for you to stick around? Well, it’s complicated. If this is going to be your first website ever, professional or personal, the entry-level solution has more limits than some of the ones you can get for free (yes, we are thinking about Infinity Free). That being said, if you require advanced types of hosting, give them a try. All of Planet Hippo’s solutions include a money-back guarantee, so if you have a change of heart you won’t lose anything but your time.",
    "For those who are unwilling to take a chance or simply want a US-based host, both HostGator and Bluehost are amazing alternatives."
  ],
  "headers": {
    "5": "Pricing",
    "11": "Ease of Use",
    "17": "Speed and experience",
    "20": "Support",
    "22": "The competition",
    "26": "Final verdict"
  },
  "links": {
    "Planet Hippo": "https://www.planethippo.co.uk/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "SSL certificates": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "domain registration": "https://www.techradar.com/news/best-domain-registrars",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "Unlimited": "https://www.planethippo.co.uk/web-hosting/",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "ecommerce": "https://www.techradar.com/news/best-ecommerce-hosting",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "knowledgebase": "https://clients.planethippo.co.uk/index.php?rp=/knowledgebase",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Certa Hosting": "https://www.techradar.com/reviews/certa-hosting",
    "tsoHost": "https://www.techradar.com/reviews/tsohost"
  }
}