{
  "source": "https://www.techradar.com/reviews/bose-soundlink-revolve",
  "title": "Bose SoundLink Revolve review",
  "category": "audio-visual",
  "updated": "2021-11-01T15:04:54Z",
  "author": "lewis-leong",
  "summary": "An excellent 360-degree speaker for the home",
  "verdict": "The Bose SoundLink Revolve is an excellent choice for those looking for a true 360-degree listening experience. Yes, it’s expensive, but it also sounds great. The biggest issue is that the Revolve lacks dust and waterproofing, which means it’s not a speaker you want to take with you to the beach.",
  "pros": [
    "True 360-degree sound",
    "Beautiful design and build",
    "Detailed and expansive sound"
  ],
  "cons": [
    "Only 30ft (10m) range",
    "Charging dock not included",
    "Not fully water or dustproof"
  ],
  "article": [
    "The Bose SoundLink Revolve aims to solve the main problem with most wireless speakers: despite their convenience, they're usually directional, sounding their best in one specific spot. Bose (and others) have attempted to fix this with 360-degree sound technology.",
    "The Bose SoundLink Revolve continues the company’s history of excellent build quality and sound and crams it all into a cylindrical speaker you can take with you on the go. The speaker bears a striking resemblance to the company’s excellent Bose SoundLink Mini II speaker, but in a different form factor.",
    "And while the Revolve is starting to show its age – this review was originally penned when it launched in 2017 – it remains a capable little unit. If you need more heft and extra battery power, we'd direct you towards the Bose SoundLink Revolve+.",
    "One negative point we'll mention straight away is that the IPX4 rating on the SoundLink Revolve means the speaker will survive splashes but probably not a dip in the pool or a trip to the beach.",
    "That’s a big drawback, especially for an original price point of $199 (£199, AU$299); but, if it’s any consolation, the speaker at least sounds better than much of the fully waterproof competition.",
    "[Update: Bose has unveiled two new Bluetooth speakers for 2021: the Bose Soundlink Revolve II and the Bose Soundlink Revolve+ II.",
    "The successors to the Soundlink Revolve and Revolve+ portable speakers, the new models are nearly identical to the brand's popular speakers, albeit with a few important upgrades.",
    "The new Revolve II now comes with a 13-hour battery life, a modest upgrade from its predecessor's 12-hour charge. Meanwhile, the battery life of the Revolve+ II has been increased from 16 to 17 hours.",
    "Both Bluetooth speakers have been given an IP55 rating, increasing their water-resistance, and adding protection from dust.]",
    "The Revolve takes the design of its predecessor the SoundLink Mini II and stretches it into a cylindrical shape that slightly resembles the Dalek robots from Dr. Who.",
    "It features a strong aluminum housing which comes in either silver or black and features a rubberized base and buttons. The Bose SoundLink Revolve feels extremely well made, and should put up with being tossed in a bag with keys and knick knacks (for example).",
    "On top of the Revolve speaker you’ll find buttons for controlling every feature of the unit, including volume, playback, Bluetooth 4.0, aux and power. Bose’s multifunction button controls everything from music playback to activating voice assistants like Siri and Google Assistant. The SoundLink revolve works great as a speakerphone for taking calls – something lacking on one of this speaker's well-regarded contemporaries, the UE Wonderboom.",
    "The microphone on the Bose SoundLink Revolve is located on top of the speaker, so it's able to hear your voice from any direction.",
    "On the bottom of the speaker you’ll find four pins for an optional charging dock and a threaded tripod mount. It’s disappointing that Bose didn’t throw in the $30 (£19.95) charging dock for free like it does with the slightly cheaper SoundLink Mini II, which costs $180 (£170, AU$300). While it might seem odd to have a tripod mount, it offers more flexibility for getting the Revolve perfectly positioned in your home.",
    "Bose also lets you pair two Revolve speakers to use for stereo or amplification, a neat feature that's becoming more and more common these days. This will work up to a range of 10m.",
    "Pairing for this feature can be done on the device itself, but it's more convenient to use the Bose app. You have the option of using the speakers in stereo or mono, depending if they're in the same room or not.",
    "On the inside the Revolve features a dual passive radiator setup running up the sides of the speaker to fill out the lower end of the audio spectrum. Mids and trebles are handled by a downward facing transducer, which uses a deflector plate to distribute sound equally in all directions.",
    "Bose claims that this driver configuration allows the speaker to create a full 360-degrees of sound around the speaker, and without any audio blindspots.",
    "The biggest reason go to with the Bose SoundLink Revolve over one of its flat-faced rivals is if you want omni-directional sound. With it, you can move around and experience the same sound wherever you are. This is great for parties, for example, so everyone can have the same listening experience no matter where they’re sitting.",
    "In terms of volume, the SoundLink Revolve does a great job of pumping music loudly in all directions. That said, if you place it at the center of the room, the speaker lacks some bass response – though that can be remedied by placing the speaker near walls to help reflect sound and increase the bass response.",
    "Overall, the Bose SoundLink Revolve's sonic performance is excellent, especially when compared to one of our other favorite 360-degree speakers, the UE Wonderboom. Where the Wonderboom sounds strained, the Bose plays loudly and effortlessly.",
    "Bass response also sounds richer and more controlled than the Wonderboom, which features a mid-forward sound. However, you should take into account that the Wonderboom is half the price of Revolve.",
    "Compared to the aging SoundLink Mini II, the SoundLink Revolve sounds almost as good but can’t match the expansive soundstage and instrumental separation of the Mini II – though, admittedly both speakers sound very good and you’ll be hard pressed to notice the difference unless you listen to them side by side.",
    "Compared to the Bose SoundLink Color II, the Revolve features more detail and bass response. The 360-degree sound makes the Revolve more suited to listening outdoors than the directional sound of the SoundLink Color II. Both the Color II and Revolve are IPX4 rated, which means they’ll survive splashes but you won’t want to dunk either speaker in the pool.",
    "Compared to the competition, the Revolve's battery life is average for a speaker of this size, lasting 12 hours at moderate listening volumes (the Revolve+ improves on this marginally, with a 16-hour battery life). Be careful about charging the speaker the night before a big event as it also takes the speaker a ridiculously long 4 hours to fully charge when empty. It would have been nice to see Bose jump to USB-C for faster charging, but it's not a deal breaker.",
    "The Bose SoundLink Revolve is an excellent sound speaker for users looking for true 360-degree sound. It’s great for sharing music during a party or for moving around the room without losing audio fidelity. However, the Bose SoundLink Mini II sounds slightly better and is slightly cheaper to boot.",
    "On the debit side, it’s also not fully dust or waterproof so you’ll want to think twice before bringing the Revolve to the beach.",
    "For half the price, the Wonderboom is a great speaker that is completely dust and waterproof. While it can’t match the audio fidelity or features of the Bose, it's still great for on-the-go listening. If bass is your game, the JBL Charge 3 is an excellent fully waterproof speaker that sounds great, but is big and heavy along with it."
  ],
  "headers": {
    "9": "Bose SoundLink Revolve: design",
    "18": "Bose SoundLink Revolve: performance",
    "25": "Final verdict"
  },
  "links": {
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "Bose SoundLink Mini II": "https://www.techradar.com/reviews/bose-soundlink-mini-ii",
    "Bose SoundLink Revolve+": "https://www.techradar.com/reviews/bose-soundlink-revolve-plus",
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Bose Soundlink Revolve II and the Bose Soundlink Revolve+ II": "https://www.techradar.com/news/bose-upgrades-its-popular-bluetooth-speakers-with-boost-to-battery-life",
    "UE Wonderboom": "https://www.techradar.com/reviews/ue-wonderboom",
    "Bose SoundLink Color II": "https://www.techradar.com/reviews/bose-soundlink-color-2",
    "Wonderboom": "https://www.techradar.com/reviews/ue-wonderboom",
    "JBL Charge 3": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/jbl-charge-3-bluetooth-speaker-1324500/review"
  }
}