{
  "source": "https://www.techradar.com/reviews/bandzoogle-website-builder",
  "title": "Bandzoogle website builder review",
  "category": "computing",
  "updated": "2021-06-26T19:47:06Z",
  "author": "chyelle-dvorak",
  "summary": "A web hosting platform that's ideal for musicians",
  "verdict": "The great thing about Bandzoogle is that it’s aimed specifically at musicians. There’s a built-in music player and themes built into the templates that make it easy for people to buy music or subscribe to your website. Many of Bandzoogle’s features are available to all plans, including the theme designer tools, templates, purchasing options, and custom editor.",
  "pros": [
    "Numerous ways to selling music",
    "Easy to sell merchandise or tickets",
    "Artistic pre-designed pages",
    "Includes SEO for musicians"
  ],
  "cons": [
    "No free option"
  ],
  "article": [
    "Bandzoogle is a great web hosting provider if you’re aiming to reach a specific audience. Built for musicians, Bandzoogle includes many features that make it easy to showcase your talents, with professional-looking templates designed for artists, along with an easy set up process, including font and colour options, giving users the ability to create a truly unique online presence.",
    "Bandzoogle also allows users to make unlimited sales without charging any commission, which is great for musicians who anticipate making large sales in the future. So if you’re looking for your own website to sell all of your singles and albums, Bandzoogle offers the platform you need.",
    "It’s unfortunate that Bandzoogle doesn’t include a pared down free plan you can use for an unlimited time, so if you want to give it a shot, you’ll have to sign up for the 30 day free trial (on the plus side, no credit card details are needed - just your email address and a password, and you’re good to go). You’ll still have the opportunity to cancel your trial at any time, should you decide it’s not the right platform for you.",
    "All plans include a large number of themes, a built in music player (where you can easily upload your music), and access to a free domain name.",
    "Bandzoogle’s plans are Lite, Standard, and Pro. They can all be trialed free for 30 days. You have the option of paying annually or monthly - forking out the lump sum each year essentially gets you two months free.",
    "The cheapest plan is Lite, costing $9.95 per month (or the equivalent of $8.29 per month when paid annually). It provides space for 10 pages, 10 soundtracks, and 100 photos. You’ll have access to all of the themes to build your website, SSL security, and basic selling tools. You also have access to promotional tools such as a mailing list (for up to 100 subscribers), an Electronic Press Kit, SEO tools and a tour calendar. This plan is great for bands who are just starting out.",
    "Next up is Standard. $14.95 per month (or the equivalent of $12.46 per month when paid annually), gives you 20 pages, 50 soundtracks and 500 photos. In addition to selling music downloads with 0% commission, like the Lite plan, sell merch is now possible. You can also increase your mailing list to 1,000 fans.",
    "Bandzoogle strongly recommends the Pro plan, which is the most expensive of the three at $19.95 per month (or the equivalent of $16.63 per month when paid annually). Everything becomes unlimited with this plan: pages, soundtracks, photos, subscribers. You can work with custom fonts, add video headers, you’ll be inundated with a myriad of selling tools such as ticket sales, a tip jar, product bundling, discount codes, the ability to sell video and media files, inventory tracking, and more - the list is impressive. The pro plan is an excellent platform for bands who are already established.",
    "Once you start the free trial, you’ll immediately have access to all of the pre-designed themes. Browse through them, check their large previews, and select the one that best reflects your band and its style (they’re broken down into categories such as Rock, Classical, Urban, etc to help narrow down your search).",
    "During the creation process, you can add your own header image and band logo if you have one, but there’s no pressure: you can add this at any time later on. The same applies for all other initial steps: you can skip them all (adding content, setting up a blog, creating a photo gallery, etc), and insert them at a later time.",
    "Populating your website with content is a very straightforward affair. Click on ‘Add a section’ to choose from the list of options displayed during the creation process.",
    "You have the ability to add as many sections as you need, across multiple pages, thereby creating an enticing resource for your fans, and if you have experience of other more traditional website builders, you’ll find Bandzoogle very easy to get to grips with.",
    "Even the blog section offers all the basics you’d expect, including categories, comments, and being able to schedule your posts.",
    "Unsurprisingly, the features that stand out the most are options for selling music, merchandise, and tickets. Everything you need as an artist is easily available, so if you’re looking for a template that’s ready to go, you can customise the colours, fonts, and photos to create a website that highlights your style. SEO options are generated automatically from the content on your page, making it easy for Google to pick up the right keywords.",
    "The largest competitors to Bandzoogle are Wix, Bandvista, and Mymusicstream. Bandvista has very similar pricing to Bandzoogle, and also doesn’t include a free plan. Bandvista also includes a music player and options to sell merchandise, but its templates aren’t quite as professional looking and modern as Bandzoogle's.",
    "Bandzoogle is a great web hosting option for anyone in the music industry who wants to sell albums, merch, and tickets to shows on a personalised website.",
    "Instead of building your website from scratch, this easy to customise web host makes building a website a breeze. You won’t need to spend time learning HTML or other programming languages. All of the templates are creative and built for music-enthusiasts. It’s also easy to transfer your domain over to Bandzoogle if you already own one. Bandzoogle promises fast page loading, so music fans won’t get stuck while waiting to download a soundtrack. Because it’s music-specific, the built-in SEO will help Google recognise key terms from your website, making it easier for people to find your band online.",
    "Overall, Bandzoogle is a helpful tool for anyone in the music industry looking to create their own website.",
    "You might also want to check out more of our website hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "8": "Getting started",
    "10": "Features",
    "14": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "Bandzoogle": "https://bandzoogle.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "Lite": "https://bandzoogle.com/pricing",
    "SEO tools": "https://www.techradar.com/news/best-seo-tool",
    "Standard.": "https://bandzoogle.com/pricing",
    "Pro plan": "https://bandzoogle.com/pricing",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Bandvista": "https://www.bandvista.com/",
    "Mymusicstream": "https://www.mymusicstream.com/"
  }
}