{
  "source": "https://www.techradar.com/reviews/xgimi-halo",
  "title": "XGIMI Halo+ review",
  "category": "televisions",
  "updated": "2021-10-01T11:23:31Z",
  "author": "emma-flint",
  "summary": "An enhanced on-the-go cinematic experience",
  "verdict": "Built on the foundations of already impressive technology, the XGIMI Halo+ delivers the same superb sound and visual qualities as its predecessor. Only this time, the Halo+ has ironed out the issues of the past, namely its indoor quality.",
  "pros": [
    "Lightweight portability",
    "An array of features",
    "Crisp, bright visuals"
  ],
  "cons": [
    "Better suited to Android devices",
    "Aggressive autofocus",
    "Loss of shadow detail in bright light"
  ],
  "article": [
    "The XGIMI brand is already synonymous with delivering specialty tech, with the Halo+ being no exception. Few competitors can beat the package of features this upgraded model boasts.",
    "As with the earlier Halo model, released in 2020, the Halo+ remains a small, lightweight system housed within a highly stylish gray and black unit. Its size makes it ideal for on the move viewing, though its inconspicuous design works well in any sized home.",
    "Indoor viewing is at the heart of the Halo+ design, with the previous Halo projector having been criticized for failing to deliver the same outstanding quality when moved inside. The primary issue was the lighting, especially during darker scenes. However, the Halo+ has vastly improved the issue. Still, there’s a notable difference in detailed grays depending on the ambient light of the room.",
    "The improvement is thanks to the 900-lumens brightness, though, as with the Halo, this drops slightly when running on battery alone. Without mains power, the lumens output is 700.",
    "Having raised the bar yet again, it’s unsurprising that the Halo+ is priced at $859. Although more costly than other portable projectors, including its predecessor, it’s still much more affordable than most other 4K projectors currently on the market.",
    "What really helps the Halo+ stand out from its earlier model is its low-latency gaming mode – it was one of the biggest problems the original Halo faced. But with this new mode, the lag drops to just 26ms, making for a more seamless gaming experience.",
    "Another improvement that many will be happy to note is that Netflix is now native to the unit. This was, arguably, one of the main drawbacks of the previous model; now you simply visit the GooglePlay Store and install the app. You’ll also be able to install Disney Plus, Shudder, and various other entertainment apps, just as before.",
    "But the real question is whether the Halo+ fares better compared to indoor projectors.",
    "Although the Halo+ delivers crisp visuals, it sometimes struggles when used in any condition other than almost total darkness; uncontrollable ambient light isn’t a friend to this unit. That being said, once the Halo+ is set up in its ideal conditions, both indoors and as an outdoor projector, it promises an experience that most casual theater lovers will enjoy. If, however, you want an experience that rivals the visuals of the cinema, the Halo+ will struggle to compete with the likes of the Optoma UHD38, which delivers 4,000-lumens brightness.",
    "Nevertheless, the Halo+ is virtually unrivaled when it comes to other portable projectors, making it ideal for those who want sublime features with the convenience of portability.",
    "As previously mentioned, the Halo+ retails at $859 for US customers. For those in the UK, the cost will be £849, while Australian users can expect a $1,299 price tag. You can purchase it straight from the XGIMI website, or from Amazon.",
    "Contemporary elegance is at the core of the Halo+ aesthetic, just as with the Halo. In fact, much of the design remains unchanged, except for the autofocus keystone, which has moved towards the bottom of the unit. The end result is a modest, unassuming projector that complements any decor.",
    "Simplicity was the keyword of previous Halo reviews, and it’s a theme that continues with the Halo+. Not just in looks, but with its in-built controls too, offering only play/pause, and volume control without its remote. This does mean that the remote control is still extremely crucial to your viewing pleasure. However, the remote does boast greater accessibility, such as voice control, which makes general navigation that little bit easier.",
    "Little else has changed when it comes to its weight and size, with the Halo+ still making use with small tripods a tricky affair. For easy, hassle-free use, it’s best to use the XGIMI stand you can buy alongside the projector, or its small built-in stand. If you want to use a tripod, a larger one is advised to ensure stable viewing. In all honesty though, additional equipment isn’t necessary.",
    "What a lot of users will be concerned about is streaming, specifically the inclusion of Netflix, which we can confirm has now been included. XGIMI listened to previous feedback and has adapted to ensure the Halo+ improves and enhances what the Halo introduced.",
    "Of course, if you don’t want to stream from the unit itself, you can connect different media via an HDMI and USB port at the back.",
    "The positives continue with the Halo+, though as with the Halo, there’s still the lingering issue of poor shadow detail.",
    "The improved 900-lumens help, but the Halo+ still benefits from near total darkness; this issue was most notable in horror films, such as Conjuring: The Devil Made Me Do It.",
    "Still, when brighter scenes took place, the Halo+ was exceptionally crisp, even during the day. And in an optimum viewing environment, the shadow details were sharp, with darker scenes feeling immersive. Arguably, this is what makes the Halo+ such an important upgrade from the Halo: there’s more detailed grays, even when projected to a larger scale (the largest we tested out was 120inch before imagery became slightly fuzzy).",
    "If getting the right screen size is an issue, the Halo+ still includes its invaluable Autofocus Keystone Correction. The moment the Halo+ starts up, it scans the area projected on and sizes accordingly, though it also gives you the option to adjust the focus manually. Although a brilliant feature, it’s highly sensitive, with the slightest knock to the unit causing the autofocus to kick in again. This is less than ideal when in the middle of a film or game."
  ],
  "headers": {
    "0": "Two minute review",
    "10": "XGIMI Halo+ price and availability",
    "11": "Design and features",
    "16": "Picture quality",
    "20": "Don't buy it if…"
  },
  "links": {
    "earlier Halo model": "https://www.techradar.com/reviews/xgimi-halo-portable-projector",
    "outdoor projector": "https://www.techradar.com/best/outdoor-projector",
    "Optoma UHD38": "https://www.techradar.com/reviews/optoma-uhd38-4k-projector"
  }
}