{
  "source": "https://www.techradar.com/reviews/silicon-power-us70-gen4-ssd",
  "title": "Silicon Power US70 Gen4 SSD review",
  "category": "computing",
  "updated": "2021-02-11T23:57:25Z",
  "author": "mark-knapp",
  "summary": "Value royalty, but not the king",
  "verdict": "The Silicon Power US70 is a fantastic drive that offers an affordable entry into the speed domain of PCIe 4.0 SSDs, but it’s not the fastest or even the cheapest offering these speeds.",
  "pros": [
    "Economical PCIe 4.0",
    "Capacity advantage",
    "Endurance"
  ],
  "cons": [
    "Economical looks",
    "No speed king",
    "Undercut by PNY"
  ],
  "article": [
    "The number of PCIe 4.0-based M.2 SSDs on the market is rising, and they’re not all budget breakers anymore. While there are savage speedsters like the Samsung 980 Pro and the WD Black SN850, there are now more affordable options that balance high speed with high value, and that’s exactly what the Silicon Power US70 does.",
    "The Silicon Power US70 offers up to 2TB of storage for $320 (about £235, AU$420). It’s not the cheapest SSD, but you won’t find too many that offer this kind of speed in this price range. The Samsung 870 QVO offers affordable capacity with a 2TB model for $249 (£189, AU$279), but that SATA-based SSD doesn’t come close to PCIe 3.0 SSD speeds, let alone PCIe 4.0. Silicon Power’s pricing also keeps it well below the cost of Samsung and WD’s premium drives, as a 2TB SN850 costs $450 and a 2TB 980 Pro costs $430. Silicon Power also stays well below the 1TB options for those drives.",
    "Of course, the lower pricing comes with a trade-off – the Silicon Power US70 isn’t as fast by a long shot. The 2TB Silicon Power US70 puts up respectable sequential speeds at 5,002MB/s for reads and 4,256MB/s for writes. The Samsung 980 Pro and WD Black SN850 leave it behind with up to 30% faster speeds. Samsung’s random speeds also outstrip the US70 considerably, especially in random reads, where it more than doubles the US70’s performance.",
    "But if the Samsung 980 Pro and WD Black SN850 are the sprinters, then the US70 is the marathon runner. We’d almost expect to see another trade-off in endurance given that the US70 is offering a lot of storage at a more budget-friendly price, but Silicon Power actually rates the US70 for 1,800 total drive writes, which makes for 3,600TBW on the 2TB model. That’s triple the endurance of the 2TB 980 Pro and SN850, both of which offer 1,200TBW.",
    "Given the pricing, anyone balancing their budget for speed and capacity may think about choosing one of the faster drives at a lower capacity than the US70, but a faster drive may only prove to be faster while it’s mostly empty. SSDs tend to slow down considerably as they fill up and have less space available to use as a high-speed cache. Our friends at Tom’s Hardware report the US70 uses a third of its available space as a cache, so the 2TB drive is likely to keep cruising along at its full speeds when filled with a large amount of data that would make a faster 1TB drive slow down considerably.",
    "The US70 sits in a fairly stable position, but it does have some direct competition. Though we have yet to test either, both the Seagate FireCuda 520 and Corsair MP600 offer similar speeds, endurance, and pricing (though both are a bit more expensive at the time of writing). There’s also the PNY XLR8 CS3040, which is the same price while offering slightly faster speeds and equivalent endurance, though, again, we haven’t tested this drive."
  ],
  "headers": {
    "6": "Don’t buy it if…"
  },
  "links": {
    "M.2 SSDs": "https://www.techradar.com/best/best-m2-ssd",
    "Samsung 870 QVO": "https://www.techradar.com/reviews/samsung-870-qvo-2tb-v-nand-ssd",
    "Tom’s Hardware report": "https://www.tomshardware.com/reviews/silicon-power-us70-m-2-nvme-ssd-review"
  }
}