{
  "source": "https://www.techradar.com/reviews/hp-omen-30l",
  "title": "HP Omen 30L review",
  "category": "computing",
  "updated": "2021-07-15T05:46:44Z",
  "author": "mark-knapp",
  "summary": "Sleek and powerful gaming",
  "verdict": "The HP Omen 30L fits in some high-end hardware into a bit of a tight space. It keeps the performance up, but doesn’t have many options for improving thermals beyond increasing the noise if they start to become a problem.",
  "pros": [
    "Elegant looks",
    "Fair pricing",
    "Standardized parts"
  ],
  "cons": [
    "Limited cooling options",
    "No front USB-C"
  ],
  "article": [
    "The HP Omen 30L is a slightly slim beast of a gaming PC that can pack some seriously fast components into a narrow and elegant chassis that shows them off. This gaming PC comes in a variety of configurations that don’t come cheap but do offer a fair value. The HP Omen 30L line starts at $1,699 for a modest 11th Gen Core i7/RTX 3060 Ti model and jumps up to $2,999 for a model that squeezes in an RTX 3090. Configuration options also allow for a lot more granular control over the hardware included and therefore the final price.",
    "Curiously, our exact test configuration isn’t one HP appears to make available even through customization, but the closest configuration to our test unit comes with an Intel Core i9-10850K and an RTX 3080 alongside ample storage and RAM for $2,229 (about £1,580, AU$2,890). That’s a fairly compelling price when compared to another powerful option like the $2,919 (about £2,070, AU$3,780) Alienware Aurora R10 Ryzen Edition with a similar storage and RAM configuration alongside an RTX 3080 and Ryzen 9 5900.",
    "And, given issues with graphics card availability, it could be hard to build your own comparable system for less. HP also manages to stay below the prices of more boutique-style builds like the iCUE Infinity Gaming PC, which starts at roughly $2,470 (£1,749, AU$3,200) for a model that has a 10th-Gen Core i7, half the RAM, and a RTX 3060 instead of a 3080.",
    "The HP Omen 30L has a stylish look to it. From the front, it has the cold feeling with a semi-transparent tempered glass panel that shows off the HP Omen logo at the top and a single ring light on the front intake fan near the bottom. Coming around the side of the HP Omen 30L, you get to see the interior lit by internal RGB lighting. Our test model also includes RGB memory modules to really keep the light-show going.",
    "There’s a decent smattering of ports available on the computer, including two USB-A ports on the front of the case alongside a combo headset jack and a dedicated mic-in port. Unfortunately, there’s no USB-C port on the front of the case. We also notice a hint of noise in the signal to the headset port on the front, with a faint static always present and a hiss that links perfectly to our mouse movements (tested both with our wireless mouse’s receiver inserted in a USB port next to the headset jack and connected to a USB on our monitor). Thankfully, the noise level is low enough to easily be drowned out.",
    "HP touts this as its “most customizable gaming PC [it’s] ever made,” and it offers tool-less access through the removable glass side panel. But taking a look inside, this doesn’t look like a PC that’s easy to do much customization with. To start, there’s not a lot of extra, unoccupied space, especially when it comes to custom cooling. There’s only one fan slot at the front and top of the case, and the rear exhaust slot only has space for a single small fan (90mm, from the looks of it). The hard drive cage is also squeezed in at the front of the case. A standardized motherboard and power supply may be the main components allowing some customization. But even that motherboard lacks extra PCIe slots for expansion cards beyond the installed graphics card.",
    "Fortunately, there’s plenty of performance available from the HP Omen 30L without going deep into after-market customization. In our regular suite of benchmarks, the HP Omen 30L performs in line with what we’d expect from its components. With settings dialed down, it can offer blistering speeds at 1080p, and it can keep cruising even at 1080p with Ultra settings even in demanding games like Metro Exodus. We even see it deliver over 100fps on average in Metro Exodus with its RTX setting in benchmarks. That said, for 1080p gaming, it’s important to dial up graphics settings in order to get the most out of this type of configuration, as we’ve seen the Alienware Aurora R10 Ryzen Edition speed ahead even with its Radeon RX 6800 XT when the graphics card isn’t doing the brunt of the work.",
    "Playing through some casual CS:GO, we generally see the fps counter clocking in over 300 without the system resource monitor even showing the CPU or GPU at close to 100% utilization. Throughout our testing of Cyberpunk 2077 at 1080p with graphics all dialed up and RTX enabled, the HP Omen 30L maintains a steady framerate often close to 90fps with occasional dips to around 70fps, but never noticeably lower than that.",
    "We were a little worried about cooling performance. The single intake fan is doing some heavy lifting given the components inside, and the 10-core CPU is cooled only by a 120mm radiator. Though the liquid cooling system for the CPU regularly turns into a jet engine noise-wise, the system holds up its performance even through extended play sessions. Our PCMark 10 test also sees the processor hold a sustained boost clock around 4.9GHz and keep thermals steady . That said, we tested in a controlled environment, and it could start to struggle in a hot room. We also notice what seems like coil whine, but really only when the system is spitting out 500-1,000 frames per second, as it does in the 3DMark Night Raid benchmark."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Don’t buy it if…"
  },
  "links": {
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Alienware Aurora R10 Ryzen Edition": "https://www.techradar.com/reviews/alienware-aurora-r10-ryzen-edition",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458%5C",
    "iCUE Infinity Gaming PC": "https://www.techradar.com/reviews/icue-infinity-gaming-pc"
  }
}