{
  "source": "https://www.techradar.com/reviews/erply-point-of-sale-pos-review",
  "title": "Erply point of sale (POS) review",
  "category": "computing",
  "updated": "2021-07-23T16:21:45Z",
  "author": "nikki-trailor",
  "summary": "Are its extensive features enough to make Erply POS your POS system of choice?",
  "verdict": "While small businesses may not have use for all of Erply’s features, this popular POS system sets itself up well to support businesses of all sizes with growth.",
  "pros": [
    "Extensive features",
    "Can customise for bespoke business needs",
    "Demo available",
    "Training available",
    "Free trial available",
    "Plenty of online user guides",
    "Versatile software and hardware integrations"
  ],
  "cons": [
    "Complex setup",
    "Complex to train staff on",
    "Technical support not available 24/7",
    "Lack of support for lower-tier plans"
  ],
  "article": [
    "Erply is the POS system of choice for hundreds of thousands of businesses around the world. Could it be right for your team too?",
    "This powerful, cloud-based POS works on a range of devices both online and offline. It also integrates with many popular hardware solutions and has its own Erply API. It’s designed to be flexible and customizable for all types of retailers and franchises. Extensive features combined with both online and offline functionality make Erply POS a scalable solution that can grow with your business.",
    "In our review of Erply POS system, we look at its impressive feature list to see if it’s still one of the best POS systems on the market.",
    "Erply has four different pricing tiers, each targeted at different business models. It offers a 60-day trial of all plans, so you can see if it works for your business without paying any hefty set-up fees. It has reduced its prices in the last couple of years to make its product more accessible, and it now provides better value.",
    "Tier 1",
    "The first tier is for small shops that don’t need inventory and costs $19 per month on annual billing. It includes two user accounts, one POS license, a POS mobile app, email receipts, and a basic CRM. With this plan, users only have access to limited email support.",
    "Tier 2",
    "The next tier up costs $39 per month and is designed for ecommerce, with Shopify integrations available. It also comes with stock taking, inventory, and warehouse management functionality.",
    "Tier 3",
    "For high-volume retailers or small multi-store retailers, Erply’s $69 per month plan has POS and inventory management capabilities.",
    "The POS has an inventory license, and there is an inventory database, advanced reporting, a gift card and store credit system, a customer-facing display, and an advanced customer database.",
    "Tier 4",
    "The top-level tier is the Enterprise plan, which is aimed at franchises and large multi-store enterprises. Erply provides a customized quote for all enterprise customers and hands-on support throughout the setup and customization process. Get in touch with them for the best quote for your business.",
    "The feature list for Erply is quite impressive, which makes it easy to adapt to your business setup.",
    "Erply POS is hardware agnostic, which means that it’s compatible with all the most popular card readers, scales, cash drawers, scanners, customer displays, and printers. This versatility makes it a great choice for businesses that already have hardware in place or that don’t want to be tied to a specific brand.",
    "The inventory management system is an excellent tool for tracking everything that you sell across all your stores or warehouses. Detailed reports can show you everything from how many units you have to how long stock has been taking up warehouse space. You can use the system to easily transfer stock between stores and can even create location-dependent pricing lists.",
    "Erply is compatible with big-hitters like Shopify, QuickBooks, Magento, and WooCommerce.",
    "While Erply has tried to make the user interface clear for businesses and their customers, the extensive features make it overwhelming on the backend. That's in comparison to point of sale brands like Square or Lightspeed, who are known for their clean, minimalist designs.",
    "With Erply POS though, inventory and warehouse management can be tricky to master. A demonstration from the support team at Erply can be incredibly helpful.",
    "That said, for customers and customer-facing staff using the POS system, it’s fairly intuitive. With a bit of patience and help from customer support, the backend functions are also manageable, and it’s worth persevering to use Erply to its fullest potential.",
    "Support with Erply is limited when you compare it against other companies who have 24/7 support, unfortunately. This has been noted in customer reviews online, to which Erply have responded with updated support hours. Nonetheless, with its extensive features, it’s not the easiest system to get your head around, so a bit of extra support would go a long way here.",
    "Users of the à la carte pricing plans only have access to limited email support. There are user guides and case uses on the Erply website, each with easy-to-follow instructions and screenshots, but we’d like to see better live support options.",
    "That said, enterprise customers can receive full training, set-up, and personalization support to get their business up and running with Erply. Regular check-ins are included, and the support team will even help optimize your workflow.",
    "All data transfers, including payments, are encrypted to protect both your business and your customers. Erply uses data centers in the same region that their customers operate, unless requested otherwise. All data is backed up in real time in two locations, to ensure that important information is kept secure.",
    "NCR Silver is the most comparable POS to Erply, but it comes with a big price tag, and its hardware options are less flexible. However, NCR Silver does have impressive features and offer 24/7 support, making it the better choice for brands that need a little hand-holding.",
    "Shopify POS is a strong competitor but is less diverse than Erply, as it is aimed purely at ecommerce businesses. However, Shopify does offer an affordable Lite plan, so it is worth looking into for ecommerce brands that don’t need Erply’s extensive features.",
    "Erply is an impressive POS system with features to make it both customizable and scalable.",
    "The pricing and scalability make it a great option for ecommerce businesses and small shops with their eyes set on growth. However, we’d like to see a bit more support and would recommend it only if you’re prepared to spend the time getting to understand how it works.",
    "For enterprise businesses and large franchises, it presents great value with the support available. We also like the advanced reporting, the offline and online capabilities, and its compatibility with different hardware."
  ],
  "headers": {
    "3": "Erply POS: Plans and pricing",
    "13": "Erply POS: Features",
    "17": "Erply POS: Interface and in use",
    "20": "Erply POS: Support",
    "23": "Erply POS: Security",
    "24": "The competition",
    "26": "Final verdict"
  },
  "links": {
    "Erply": "https://erply.com/uk/",
    "best POS systems": "https://www.techradar.com/news/the-best-pos-system",
    "Shopify": "https://www.techradar.com/reviews/shopify-pos",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-pos-point-of-sale",
    "Square": "https://www.techradar.com/reviews/square-pos-system-review",
    "Lightspeed": "https://www.techradar.com/reviews/lightspeed-point-of-sale-pos-review",
    "Erply have responded with updated support hours": "https://erply.com/uk/erply-offers-extended-support-hours-to-help-growing-businesses/",
    "NCR Silver": "https://www.techradar.com/reviews/ncr-silver-point-of-sale-pos-review",
    "Shopify POS": "https://www.techradar.com/reviews/shopify-pos"
  }
}