{
  "source": "https://www.techradar.com/reviews/dotster",
  "title": "Dotster review",
  "category": "computing",
  "updated": "2021-08-27T05:06:43Z",
  "author": "mike-williams",
  "summary": "A great platform for domain registration and simpler websites",
  "verdict": "Dotster is a US-based web hosting provider that spent most of its formative years as a domain register before extending its range of services. Although its line of products is pretty limited, Dotster promises a superb performance, 24/7 support and three well-structured plans with some unlimited features (a few freebies as well) at a bargain price.",
  "pros": [
    "Budget-friendly pricing",
    "Round-the-clock customer support",
    "Unlimited storage with all plans",
    "Free drag-and-drop website builder"
  ],
  "cons": [
    "Product range is pretty limited",
    "vDeck is the only available control panel",
    "Setting up an account could be simpler"
  ],
  "article": [
    "Launched in 1998 in Vancouver (Canada), Dotster began its success story as a domain registrar. A couple of years later they would extend their services to web hosting solutions that are mostly aimed at bloggers, start-ups and small businesses overall. They claim their mission is to provide “powerful and reliable” hosting-related services with all the online tools one would need to start or expand a booming business, and all that without breaking the bank.",
    "As a testament to its success, Dotster nowadays serves over three million customers and the number continues to grow. They also exist as a part of Endurance International Group (EIG), an industry giant which also owns a large number of other hosting companies such as HostGator, Bluehost, HostNine, HostMonster, Arvixe and the list goes on.",
    "Dotster currently hosts its servers in Burlington (Massachusetts, the USA) and the data center is equipped with HVAC and fully redundant power systems. To become a green web hosting provider, Dotster started buying renewable energy credits that equal 150% of the consumption of server energy, which not only negates their carbon footprint but also creates an extra 50% of it. In this way, every one of Dotster’s customers is a part of a larger endeavor to make life on Earth a bit greener.",
    "Dotster’s official site is simple in style and consequently simple enough to use, although it isn’t exactly brimming with information about the company and its services. As with the majority of similar US-based providers, the site is available in English language only and the pricing is shown in USD.",
    "If you're wondering about their presence on social networking sites, you can find Dotster on Facebook and Twitter, although both accounts have remained in deep sleep since 2020.",
    "Trying to strike a balance between the quality and price tag (while focusing on low cost), Dotster offers three differently sized shared hosting plans. Their knowledgebase suggests that VPS packages were available as well, but none of them are presently on the display.",
    "The cheapest one out of the three shared hosting plans is called “Basic” and it goes for $3.75 per month. However, this is the introductory price, which means that it is valid for the first term of service only. After this period expires, it will be automatically renewed at a regular rate. Nevertheless, this plan will get you the ability to host one website, use unlimited disk space, scalable monthly bandwidth, ten MySQL databases, five FTP logins, unlimited subdomains and an SSL certificate from Let's Encrypt.",
    "Free domain registration is also included with every package, however, it applies for a limited number of domain names and is valid for the initial term only.",
    "Dotster provides a 30-day money-back guarantee with all of its plans. Yet, if you have received a free domain name, it is non-refundable.",
    "Supported methods of payment with Dotster include all major credit cards, PayPal and check/ money order (which must be written in USD).",
    "After picking out a preferred plan, you should select a billing cycle you want to stick with (you can choose to be billed every 12, 24, or 36 months) and click on “Buy Now”. This will forward you to a simplistic domain registration screen on which you’ll have to pick out a new domain whether you want it or not. To use an existing one or transfer it from another register you’ll be forced to get in touch with Dotster’s support staff and hope they’ll be helpful enough.",
    "In any case, if you’re registering a new domain, quite a number of them are available, some going for a mere $2.99 and others, the premium ones, costing as much as $5000 per year.",
    "Here, you should keep an eye on every little detail about your purchase since Dotster employs many of the usual upselling tactics such as add-ons (and pre-checked ones) to make a better sale. Because of this, the sign-up process can lead to confusion, so you better stay vigilant since it should not take long after all. After confirming your choice, you’ll be required to input your personal (and billing) information, read through the terms of service and make a purchase.",
    "Unless you’ve purchased a VPS hosting plan (which you couldn’t, since they became unavailable not long ago), you are stuck with vDeck as your management GUI. While it’s not on a par with cPanel or Plesk, vDeck is neither the black sheep of the control panel family. Its user interface is pretty straightforward and seems simple enough to operate, whether it involves installing some of the popular apps (such as WordPress) or managing your emails databases and FTP transfers.",
    "Dotster also provides three “smart” website builder plans, the smallest of which \"Starter\" costs $1.99 per month but is limited to six-page websites only. All three plans provide a user-friendly graphical editor with an SSL certificate, support for blogs, social media sharing, contact management and lead capture forms, and if you go for higher-tier options you’ll get even more attractive features.",
    "Although Dotster’s official site remains silent on the subject of speed, after checking out its performance (via GTmetrix) we were pleasantly surprised with a very promising result. The page fully loaded in 5.3 seconds, which is better than the average, although not the most desirable result. However, all of the vital web metrics (largest contentful paint, total blocking time, and cumulative layout shift) were picture perfect resulting in an A (95%) as a final grade.",
    "When it comes to uptime, Dotster guarantees 99.9% of it with all of its hosting packages (that is, all three of them). Upon monitoring the uptime performance of Dotster’s official site (via UptimeRobot) for two weeks, we got a report revealing 100% of uptime. Although the response time varied from day to day, it was still rather fast (267 milliseconds on average) and not a single second of downtime was recorded at all. All in all, both in terms of speed and stability, Dotster seems to be off to a good start.",
    "If you insist on staying as independent as possible, there are several options with Dotster, including a FAQ section, a knowledgebase and video tutorials. The FAQ section is short and goes directly to the point. The knowledgebase comprises more than 500 articles split into 15 categories (Domains, Websites, Files, Database, WebsiteBuilder and so forth). Although articles themselves seem easy-to-follow, navigating around the knowledgebase is not as easy, partially due to the sheer number of featured articles. Hence, the search box should be your time-saver.",
    "Dotster’s video tutorials section is visually unappealing but can be of great help, especially for newcomers. However, if you would rather come in contact with someone from Dotster’s customer support staff, you can do it through a few channels: a 24/7 telephone number, live chat, ticket and e-mail. If you find it more convenient, you can also reach them via Facebook and Twitter, since interaction with the customers is apparently the only remaining purpose of these two accounts.",
    "We also must point out that most of the negative feedback (on Trustpilot, Web Hosting Geek and WHTop) from Dotster’s former (and obviously dissatisfied customers) was about ineptitude and inefficiency of their customer support, as well as their website.",
    "Although we don’t share the same experience, we find their feedback noteworthy, particularly if having strong customer support is one of your top priorities.",
    "Like Dotster, GreenGeeks is a host that is respectful of the environment, but one with data centers in Canada, the USA and the Netherlands, which makes them more attractive to the wider audience. In contrast, all of Dotster’s servers are based in the USA. In addition to shared hosting, GreenGeeks offers more advanced types of hosting including VPS and reseller hosting. Therefore, if you predict that your business will see constant growth, with GreenGeeks it will have more space to do so.",
    "If you are looking for a cheap and cheerful international host offering a wide variety of hosting options and features backed by powerful performance and responsive 24/7 support, look no further than Hostinger. In addition to a worldwide network of data centers (which promises speedy performance), Hostinger can do everything Dotster can, and do it better.",
    "Another noteworthy host from the USA is HostGator and, much like Hostinger, it can provide you with everything Dotster can and much more. Although Dotster’s unlimited resources are a great thing to have, HostGator’s set of features (including free domain registration, free website transfer, free website builder and 45-day money-back guarantee) can’t be beaten.",
    "Another excellent US-based alternative to Dotster is Bluehost, a pretty popular and well-rounded host that offers full scalability, 24/7 customer support and affordable pricing. That being said, what might surprise you both with Dotster and Bluehost (and unpleasantly so) are price spikes after the renewal.",
    "In summary, Dotster is not without its flaws, but it is far from a bad host nonetheless. It has been part of the industry for a considerable number of years and its shared hosting solutions are equipped with most of the industry-standard features. However, they fail to offer anything that would set them apart among many similar long-standing hosts.",
    "With hosts like HostGator, Bluehost, and Hostinger you will get more hosting types, features and options in general, and all that at an equally attractive price. Still, if you want to create a blog, a simple site, or a small yet fully-furnished online store without needing to worry about restrictions on storage space, e-mail addresses, or monthly bandwidth, Dotster might be a good choice."
  ],
  "headers": {
    "5": "Plans and pricing",
    "10": "Ease of use",
    "15": "Speed and experience",
    "17": "Support",
    "21": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "Dotster": "https://www.dotster.com/",
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostNine": "https://www.techradar.com/reviews/hostnine",
    "HostMonster": "https://www.techradar.com/reviews/hostmonster",
    "Arvixe": "https://www.techradar.com/reviews/arvixe",
    "green web hosting": "https://www.techradar.com/web-hosting/best-green-web-hosting",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "Basic": "https://www.dotster.com/hosting",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Starter": "https://www.dotster.com/website-builder",
    "GreenGeeks": "https://www.techradar.com/reviews/greengeeks",
    "Hostinger": "https://www.techradar.com/reviews/hostinger"
  }
}