{
  "source": "https://www.techradar.com/reviews/logitech-circle-view-doorbell",
  "title": "Logitech Circle View Doorbell review",
  "category": "smart-home",
  "updated": "2021-06-29T21:32:26Z",
  "author": "christian-de-looper",
  "summary": "If Apple made a video doorbell...",
  "verdict": "The Logitech Circle View Doorbell is a good choice for those that want a HomeKit-enabled doorbell. Simple to set up and use, there’s no third-party app needed - it can be accessed and controlled from the Apple Home app. It captures clear footage both during and the day and at night too. However, to get the most out of it, it relies on having a HomeKit hub in your property, so if you don’t own an Apple TV 4K, a HomePod, or an iPad that doesn’t travel with you, it’s not one for you.",
  "pros": [
    "Good image quality",
    "HomeKit Secure Video support",
    "Solid design"
  ],
  "cons": [
    "Only works with HomeKit",
    "No battery-powered version"
  ],
  "article": [
    "The Logitech Circle View Doorbell doesn’t offer all the bells and whistles and smart home support that you’ll get from some rival video doorbells, but what it does do, it does well.",
    "It’s not a 4K doorbell, and there are certainly plenty of options that have crisper video on the market -- but it’s 1600 x 1200 resolution is still more than detailed enough for most situations. Like all of the best video doorbells, it sends a notification to your smartphone when someone either presses the doorbell itself, or is visible in its 160-degree field of view, so you can then converse with whoever is on your doorstep.",
    "However, where it differs from most of its rivals, is that the doorbell only works with HomeKit -- so there’s no third-party app you have to deal with. Instead, the Home app on an iPhone or iPad is used to set up and viewing the doorbell’s live feed.",
    "It supports HomeKit Secure Video, which means if you want to go back and review footage after it’s happened, you’ll need an iCloud storage subscription of 200GB or above, which costs $2.99 per month, and have a HomePod, Apple TV, or iPad set up as a Homekit hub - you’ll also need one of these if you want to receive notification from the doorbell when you’re not connected to your home Wi-Fi network too.",
    "The Logitech Circle View Doorbell isn’t the device for non-HomeKit users, but if you live within the Apple ecosystem and want support for HomeKit Secure Video, then it’s a great choice.",
    "The Logitech Circle View Doorbell costs $199.99 and is currently only available in the US from the Logitech website and other electronics retailers, including Amazon and Best Buy. You can opt to install the doorbell device yourself, or professional installation costs another $100 on top of the cost of the doorbell.",
    "As we’re already mentioned, the doorbell uses Apple’s HomeKit Secure Video to store footage recorded by the camera, so if you want to go back and review any videos for up to 10 days after they’ve been recorded, you’ll need an Cloud subscription of at least 200GB, which costs from $2.99 per month.",
    "The Logitech Circle View Doorbell isn’t the flashiest video doorbell out there, but it still has a relatively sleek and stylish design that should look great outside any door.",
    "The Circle View Doorbell is a similar size to rival Arlo Video Doorbell and Nest Hello, so it’s definitely noticeable outside a home, however that may be a good thing, as it means that guests will immediately know where the doorbell is when they get to your home. On its own, the device measures around 4.68 inches tall, 1.65 inches wide, and 1.1 inches deep, however when you install it, you’ll do so with a base plate that may make it a little deeper.",
    "The video doorbell is built largely from plastic, but it doesn’t feel cheap. On the front of the Circle View Doorbell, you’ll get an illuminated button towards the bottom, along with an LED light for color night footage, and the camera module towards the top.",
    "On the bottom of the doorbell can be found a MicroUSB port, which can be used to power the doorbell in a pinch, and if you don’t have a way to wire the doorbell into your existing setup. It’s pretty frustrating that Logitech is still holding onto MicroUSB here -- I get that the preference is that it’s wired using the included accessories rather than through the port, but it’s 2021 and no company should be building devices with the long-outdated standard.",
    "The device also comes with base plates to install it flush on a wall, or at an angle, which is a nice touch and means that you should be able to install it in a way that works with your setup. You’ll also get all the wiring components that you’ll need. It’s also important to note that this camera only comes in a wired option -- there’s no battery-powered Circle View Doorbell yet.",
    "When it comes to set-up, Logitech offers a number of tutorials and walkthroughs for installing your doorbell, and they’re really easy to follow. If you know where the chime is in your home, and you feel comfortable with a screwdriver, you should be able to install the doorbell yourself without any issues.",
    "Perhaps more important than the installation, of course, is the quality of the camera and how it works with the rest of your smart home setup. This is where the Logitech Circle View Doorbell shines.",
    "The camera on the Logitech Circle View has a 160-degree field-of-view, and records footage at a resolution of 1600 x 1200, in a 3:4 ratio so you can see the full length of anyone on your doorstep, including any packages at their feet. It’s not quite as wide of a field-of-view as the standard Circle View security camera, but it should still be wide enough for most use, and will easily be able to record most of what’s in front of your door.",
    "It’s one of just a handful of video doorbells that has so-called ‘color night vision’. This really just means that it uses an LED light to illuminate a scene at night rather than using infrared ‘night vision’, which can result in lost detail. We were impressed with the quality of the video recorded in low-light, and the LED will turn on automatically when the doorbell detects motion. The only issue with this setup is that the light is relatively bright, and may be uncomfortably so for some that approach your door.",
    "On test, the Circle View Doorbell reacted quickly to motion, and very quickly to the button being pressed. If you can’t find a way to wire the doorbell into your existing chime, it may not matter if you keep your phone or an Apple Watch on you -- as we found notifications appeared instantly on our smartphone whenever the button was pressed.",
    "We found the Logitech Circle View Doorbell was able to produce relatively detailed video. It’s not a 4K camera, and you shouldn’t expect one -- but the video quality is more than adequate for most users.",
    "Footage from the Doorbell is stored in iCloud, so you will need a subscription with 200GB of space or more, if you want to review any of this footage for up to 10 days after it happened. As we’ve mentioned already, you’ll also need HomePod, Apple TV, or iPad set up as a HomeKit hub, too. However, without HomeKit Secure Video, you can still use the camera and stream footage from it whenever you want - you just can’t keep recordings of that footage.",
    "The app experience of the Logitech Circle View is one of the best things about it -- for a niche audience. If you’re not an Apple HomeKit user, this device is not for you. That’s because there is no app for the Circle View Doorbell -- the device is built for Apple Home, and only works with the Home app.",
    "That means that once you’ve physically installed the Circle View Doorbell, you’ll need to set it up in the Home app on your iPhone, iPad, or Mac, and for the best experience, you should have a Homekit hub, which will allow you to get notifications about your doorbell when you’re not home. It’ll also ensure you can access features such as identifying if the source of motion is a person, animal, or vehicle and facial recognition, which can identify visitors using people tagged in the Apple Photos app. On top of that, there’s also the ability to set activity zones so you only get alerts about motion in these areas. If you have a HomePod, you can also set it to chime when the doorbell’s button is pressed, too.",
    "It doesn't, however, support the new Thread standard that’s supported by the new Apple TV 4K and the HomePod Mini -- but even without Thread, we found the device to be responsive and quick.",
    "If you’re an Apple Home user, the overall software experience by the Circle View Doorbell is excellent. It’s pleasing you don’t have to download and use third-party apps.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Logitech Circle View Doorbell price and availability",
    "7": "Design",
    "12": "Performance",
    "19": "App",
    "23": "Don't buy it if..."
  },
  "links": {
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "HomePo": "https://www.techradar.com/reviews/apple-homepod-review",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "iPad": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "Arlo Video Doorbell": "https://www.techradar.com/reviews/arlo-essential-video-doorbell-wire-free-review",
    "Nest Hello": "https://www.techradar.com/reviews/nest-hello",
    "Thread": "https://www.techradar.com/news/what-is-thread-and-why-do-your-smart-home-gadgets-need-it",
    "HomePod Mini": "https://www.techradar.com/reviews/apple-homepod-mini"
  }
}