{
  "source": "https://www.techradar.com/reviews/instant-pot-pro-crisp",
  "title": "Instant Pot Pro Crisp review",
  "category": "appliances",
  "updated": "2021-12-03T11:48:27Z",
  "author": "helen-mccue",
  "summary": "A multi-cooker and air fryer in one easy-to-use appliance",
  "verdict": "The Instant Pot Pro Crisp is the most expensive Instant Pot you can buy, and for the money, you’ll get a versatile multi-cooker that can replace several other kitchen appliances including an air fryer. There are 11 customizable programs to choose from and it’s simple to operate. But it doesn’t have preset programs for different meals and working out the perfect cooking times does require a bit of trial and error.",
  "pros": [
    "Safe and easy-to-use steam release",
    "Inner pot has silicone handles and is oven, stovetop, and dishwasher safe",
    "No need for a separate air fryer"
  ],
  "cons": [
    "Takes up a lot of storage space",
    "The most expensive Instant Pot available",
    "No recipe book or cooking charts included"
  ],
  "article": [
    "Since its launch in 2010 Instant Pot has developed a cult following of loyal multi-cooker fans who swear by the benefits of this one-pot multi-function cooking appliance. And with several versions now available, it is sometimes difficult to tell what distinguishes one Instant Pot from another.",
    "The Instant Pot Pro Crisp is the brand’s top-of-the-range model, and is one of only two designs that come with an air fryer lid. This means you can air fry, bake broil (grill) and roast as well as all the usual multi-cooker functions like pressure cook, slow cook, steam and sauté, and makes it a contender for our best Instant Pot list.",
    "The most expensive Instant Pot currently available, it's a slight upgrade on the Instant Pot Duo Crisp. They both have the same eleven cooking functions, same 8 quart/ 8-liter capacity, and the same accessories included in the box. However, the Instant Pot Pro Crisp comes with silicone handles on the cooking pot for easy lifting, and has a number of features to make releasing the steam and pressure much simpler.",
    "The Pro Crisp also has a bigger LED display screen that features a cooking progress bar, plus there’s a dial for easier time and temperature customization. The air fry function means there are two separate lids to store, so it’s bulkier than a standard multi-cooker, but it benefits from several extra cooking functions and you’ll save storage space by not having a stand-alone air fryer.",
    "In terms of performance, like all Instant Pots, it’s easy to create delicious meals in this appliance and the large capacity means it’s ideal for larger households. The lack of a recipe book and cooking charts means you’ll have to head to the app or online for recipe inspiration. But with an army of loyal fans, there’s no shortage of cooking suggestions online.",
    "The Instant Pot Pro Crisp will set you back $249.99/ £249.99 and is available directly through the Instant Home website in the US or Instant Brands in the UK. It’s not currently on sale in Australia.",
    "It’s one of only two Instant Pot multi-cookers that are available with air fry lids and as detailed above it features some upgrades that make it more expensive than the otherwise similar Instant Pot Duo Crisp, which is also available in Australia and costs $199.99/ £179.99/ AU$299.99.",
    "With its black finish and larger LED display screen the Instant Pot Pro Crisp certainly looks more premium than the more affordable Instant Pot Duo Crisp. While the large 8 quart/ 8 liter capacity is great for feeding a crowd, it does impact the overall size. This chunky multi-cooker measures in at 14.17 x 14.24 x 14.78 inches/ 36 x 36.2 x 37.5cm (h x w x d) and with the air fryer lid on it’s even taller. It weighs 26.2 lbs./ 11.88 kg so it’s a bit cumbersome to lift in and out of a cupboard and is designed to stay on the countertop.",
    "As we’ve already mentioned, it comes with a standard multi-cooker lid for pressure cook, slow cook, sauté, sous vide, and steam. This lid automatically seals for pressure cooking when you lock it into position and there’s a simple switch on top to vent the steam. For bake, broil/ grill, roast, dehydrate, and air fry you have to switch to the air fryer lid which contains a heating element and turns the multi-cooker into a mini oven.",
    "Each cooking mode has customizable time and temperature settings with the option to engage a keep warm function at the end of cooking, which will keep food warm for up to ten hours. Additionally, there’s a delay start timer so that you can throw all your ingredients into the pot and set it to start cooking at a specified time, so that your meal is ready when you get home.",
    "In the box, you get an air fryer basket, a multi-functional rack, grill/ dehydrating tray, and protective pad/ storage cover. Everything excluding the base of the multi-cooker and the air fryer lid is dishwasher safe for easy cleaning.",
    "To test out how well the Instant Pot Pro Crisp can cook a variety of dishes, we started with a slow-cooked beef chili. The sauté function allows you to brown meat and onions in the pot before slow cooking and keeping everything in the same pot means there’s minimal mess and clean up.",
    "It took just over four and a half minutes to preheat to the correct temperature to sauté and while the meat browned nicely, the stainless-steel cooking pot isn’t non-stick so there was some sticking. Thankfully this didn’t matter as any stuck residue was released from the pot during the six-hour slow cook. The end result was a flavorsome meaty chili with a temperature of 167 F/ 75 C.",
    "It took us several attempts to figure out the best way to steam broccoli, the instruction manual states that the steam release switch should be set to vent when using the steam program. During our first two attempts, it didn’t get further than the preheat stage before it had completely boiled dry and we had to abandon the test.",
    "Finally, we set the steam release to ‘seal’ - programmed it for one minute and after preheating for just over four minutes, it completed the one-minute cook and we then flicked the switch to vent which took just 30 seconds. The broccoli was a little too al dente and so we would cook it for longer next time, but it had finally worked and we figured out that the steam release needs to be set to ‘seal’ for this program.",
    "It’s also worth noting that the multi-functional rack provided with the Instant Pot isn’t suitable for steaming vegetables, so we had to put the broccoli in a metal tray on top of the rack, but this worked fine.",
    "We didn’t have any issues when pressure cooking a Thai red curry, after browning chicken legs using the sauté function it took just 20 minutes on high pressure to make a delicious curry with succulent meat that was falling off the bone. The pressure cook function took six and a half minutes to pre-heat and just two minutes to release the pressure at the end of cooking.",
    "The pressure release is the noisiest part of the process coming in at 77dB, which is equivalent to a toilet flushing, and one of the noisier Instant Pots we’ve tested. The lid reached 140 F/ 60 C during cooking, but the sides and handles all stay cool enough to touch.",
    "To get some advice on cook time and rice to water ratios we headed to the Instant pot website where we found a useful cooking chart for rice. It advises a 1:1 ratio of rice to water for brown rice and past experience tells us that this is 1:1 by volume not weight. We set the pressure cooker to 22 minutes and after a four and a half minute preheat and one minute quick pressure release, the total cook time was 27.5 minutes. The rice was nicely cooked but a little sticker than we would prefer. There was also some sticking to the base of the pot, although after a short soak it wasn’t tricky to clean off.",
    "We tried out the air fryer by making chunky fries, we added 1 tbsp oil to 17 oz/ 500g raw potato cut into fries and put them into the air fry basket. 24 minutes later (22 minute cook time plus 2 minutes to preheat) we had lightly crisped and golden fries. The Instant pot prompts you to give them a shake halfway through the cooking time. The fries were nicely cooked and much faster than oven cooking.",
    "First reviewed: October 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Instant Pot Pro Crisp price and availability",
    "7": "Design",
    "11": "Performance",
    "20": "Don't buy it if..."
  },
  "links": {
    "best Instant Pot": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "Instant Pot Duo Crisp": "https://www.techradar.com/reviews/instant-pot-duo-crisp-and-air-fryer"
  }
}