{
  "source": "https://www.techradar.com/reviews/incus-nova",
  "title": "Incus Nova review",
  "category": "fitness",
  "updated": "2021-10-13T11:22:44Z",
  "author": "cat-ellis",
  "summary": "Track detailed running and swimming stats (with cycling coming soon)",
  "verdict": "The Incus Nova is a multi-purpose tracking device for runners and swimmers (with support for cyclists and triathletes coming soon). It doesn't replace your sports watch; it's more like a personal coach, capturing data on your form and offering practical feedback to help you avoid injury and improve your times. It's more expensive than a single-purpose product (such as a footpod or a device that attaches to a swim cap), but its position at the top of your spine provides accurate results based on data from both sides of your body, and although it requires a specially designed harness, singlet or T-shirt, it's lightweight and unobtrusive to wear. If you want to improve your form by aren't yet prepared to invest in one-on-one coaching sessions, it's an excellent tool with great potential for the future.",
  "pros": [
    "Detailed running analysis",
    "Can be used alongside a watch",
    "Practical advice on form",
    "Simple to set up and use"
  ],
  "cons": [
    "Syncing is slow",
    "Requires special clothing",
    "More expensive than a footpod"
  ],
  "article": [
    "The Incus Nova is a wearable fitness tracker designed for runners, cyclists, swimmers, and triathletes, which sits in a specially designed holder at the top of your spine. You only need one device to track all three sports, as it can monitor different metrics for each, and can be swapped between different types of clothing.",
    "At the time of writing, Incus Nova supports running and swimming, but support for cycling will be coming in a future update. Here, we've reviewed the Core Run bundle, which includes the device itself, plus a harness that can be worn over a running T-shirt, and access to run analytics in the Incus mobile app.",
    "Some of the metrics it provides are pretty standard, including pace and cadence, but its location means it can also measure acceleration and impacts per stride, contact time, and flight time. Devices like the Garmin Running Dynamics Pod promise to measure the same stats, but aren't as precise due to not being positioned directly int the center of your body, and can't be used for different sports.",
    "The results are very interesting, and include analysis to help you understand what they mean and how you can improve your form to help you run more efficiently. It can help you identify problems that you might otherwise be unaware of (if your form starts to degrade as you become fatigued, for example) and in our tests, we we found it useful for seeing how different pairs of running shoes affected our form.",
    "It doesn't track heart rate, but because it's not wrist-worn you can wear your regular running watch at the same time. The main downside, in our experience, is that it takes a very long time to sync with your phone. Data is processed in the cloud quite quickly, but transferring it all via Bluetooth is time-consuming.",
    "The Incus Nova isn't cheap, and costs much more than a footpod, but if you value accuracy and want some extra help to run more efficiently and avoid injury, it's well worth considering – particularly if you enjoy other sports as well.",
    "The Incus Nova is available direct from Incus in various sports-specific bundles, ranging from £199.99 (about $270 / AU$370) to £499.99 (about $680 / AU$930). That's approximately the same as an entry-level running watch like the Garmin Forerunner 55.",
    "If you're only interesting in swimming or running, you can pick up a single-sport bundle including the Incus Nova device, a garment to hold it, and the appropriate analysis data in the Incus app. There are also multi-sports sets, including one for triathletes ready for when Incus adds cycling to its set of supported activities.",
    "You can also pick up clothing designed to accommodate the Incus Nova, including a vest, a T-shirt, and a tri-suit starting at £49.99 (about $70 / AU$90).",
    "The Incus Nova is a lightweight teardrop-shaped device made from semi-transparent plastic. It's quite small, fitting easily in the palm of your hand. It's worn in a specially designed piece of clothing (such as a T-shirt, singlet or tri-suit) with an elasticated mesh pouch at the back of the neck that holds it securely in place.",
    "Its body contains a set of colored LEDs that indicate its current status: green for switched on, yellow for syncing data, blue for tracking an activity, and red for charging. These are clearly visible when you're wearing it, which makes it quite conspicuous, but helps with visibility when running at night.",
    "The device also contains a vibration motor, which activates when it's turned on and when you begin or finish tracking an activity. There's a single power switch on one side, and a connector on the back for its proprietary charging cable.",
    "Before we start, it's important to note that we tested the Core Run bundle, but the Incus Nova is a multi-sport device that can also track swimming (with cycling coming soon). If you're a cyclist, swimmer or triathlete, you'll get a full set of analytics data for each additional sport to help you understand and improve your performance.",
    "To get started, you'll first need to install the Incus Cloud app (available for Android and iOS) and create an account. It's the same process you'd go through with any fitness tracker, and doesn't take long. Make sure the device is fully charged, follow the on-screen instructions to connect it to your phone via Bluetooth, and you're ready to run.",
    "The Core Run bundle comes with a harness-style holder for the Nova, which slips on over your regular running top. It's comfortable while you're running and has the added benefit of some strategically placed reflectors for extra night-time visibility. The Incus Nova itself helps further on that front, illuminating blue while in use.",
    "It's certainly not discrete, but this isn't a tool you'll be using on every single run. Instead, it's more like a coaching tool, which you can use to spot-check your form and monitor progress over time.",
    "There's no need to fiddle with the device after it's switched on and fitted into your top. Just tap the play button to begin recording, and run as normal. The device will vibrate to let you know that it's working (an unusual sensation). Once you're done, tap the stop button. It really is that simple.",
    "When you've finished a run, you'll be prompted to enter a few details about your perceived exertion, any aches and pains (which you can add by tapping on a graphic of the human body), and type in some notes if you wish. There's no need to rush this, because your stats will take a long time to sync.",
    "That's no fault of the hardware; it's simply because the device records so much data. A run of approximately 5K will capture over 7MB, which needs to be transferred to your phone and then uploaded to Incus's servers for processing. In our experience it's best to leave it running while you get a drink and perhaps take a quick shower.",
    "When it's complete, you'll be presented with a map of your run (captured using the Incus Nova's connected GPS), followed by a detailed analysis of your form. This is divided into one-mile splits, which allows you to see whether your form changed throughout the duration of your run, and perhaps worsened as fatigue began to set in.",
    "The available stats are:",
    "Rather than raw figures, the Incus Cloud app presents all of these stats in clear charts and graphs that are easy to interpret, and you can tap an information icon for a detailed breakdown of what each metric means. The app also provides you with some tips on how you can improve your form (such as thinking about shortening your stride and softening your landing to improve ground contact time).",
    "These tips are useful, but aren't tailored depending on your running form, which is a shame; it would be useful if the advice provided changed depending on your stats, so you could get more detailed feedback as your running form improves.",
    "It's very interesting data though, and not something that can be readily measured by a watch. We also appreciated the way your tracked runs are presented in a calendar, so you can easily look back and review how your form has changed over time as you've adapted your running style.",
    "We also found the stats very interesting when it came to comparing the effects of different pairs of running shoes. For example, we noted that a pair of road shoes with a carbon insole really did result in a springier form with more flight time than a pair with only foam in the midsole.",
    "There's definitely scope for change though, and purchase of an Incus Nova bundle includes lifetime updates, so you'll get any new features as soon as they're available.",
    "Overall, the Incus Nova is a handy training tool for serious runners who want to learn to work more efficiently, but aren't yet ready to invest in time with a coach. We expect that it will really come into its own for multi-sports use though, and that's where having a single device for all three sports will really come into its own."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and availability",
    "9": "Design",
    "12": "Performance",
    "27": "Don't buy it if"
  },
  "links": {
    "direct from Incus": "https://www.incusperformance.com/collections/incus-products",
    "Garmin Forerunner 55": "https://www.techradar.com/reviews/garmin-forerunner-55",
    "Android": "https://play.google.com/store/apps/details?id=com.incusperformance.incuscloud&hl=en_GB&gl=US",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1571363940115369500&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fjm%2Fapp%2Fincus-cloud%2Fid1469191566"
  }
}