{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
  "title": "Samsung Galaxy S21 Plus review",
  "category": "phones",
  "updated": "2021-12-05T23:55:17Z",
  "author": "mats-karlsson",
  "summary": "A slightly larger version of the Samsung S21, but is it for you?",
  "verdict": "The Galaxy S21 Plus is a superb phone on its own merits, but it offers little that you don't get with the regular, and cheaper, Galaxy S21, apart from its larger screen. But if screen size is a deal-breaker for you, and you're happy to pay a bit more for the extra real estate, then you'll be plenty satisfied with the middle sibling in the S21 family.",
  "pros": [
    "Gorgeous new design",
    "Great performance",
    "Powerful camera"
  ],
  "cons": [
    "No microSD support",
    "Expensive",
    "No charger in the box"
  ],
  "article": [
    "Why buy a Galaxy S21 Plus when you could go for the cheaper Galaxy S21, or the all-singing, all-dancing, Galaxy S21 Ultra? It's a fair question, and it’s one that has a simple answer: buy the S21 Plus if you’re after a phone with a larger screen and battery than the Galaxy S21, but don't need all the bells and whistles – mostly photographic – of the Ultra.",
    "Samsung has now established the Ultra versions of its Galaxy S flagships as the devices to buy if you want all the latest and greatest tech that the Korean electronics giant can offer, which leaves the Galaxy S21 Plus in a slightly awkward position, with the extra money you're paying over the 'standard' S21 getting you little more than a larger screen and a more powerful battery.",
    "Is the S21 Plus worth the extra $200 / £180 / AU$300 compared to the S21? Maybe, but it depends on what you need.",
    "And, strange as it may seem, you're actually getting some inferior specifications with this year's S21 Plus compared to last year's Galaxy S20 Plus. While the 6.7-inch screen here is significantly bigger than the 6.2-inch display on the S21, it's no longer QHD+ resolution, with Samsung dropping to Full HD+ for both this handset and the S21.",
    "However, we’ve found this isn’t a major issue, as when we're talking about screens of this size the higher resolution isn't particularly noticeable. This is still a phone with an awesome, bright AMOLED screen, which also offers a smart dynamic refresh rate of up to 120Hz.",
    "There's also no microSD card support on the Samsung Galaxy S21 range, which is something that may put off those who value having the option to add to their phone's built-in storage.",
    "On the camera side, essentially nothing has changed since last year, but that isn’t a problem if you’re upgrading from an older phone than one of the Galaxy S20 range. You're getting an ultra-wide and main camera that are both 12MP, plus a 64MP zoom lens.",
    "It's a great camera array, and we've ranked both this and the Galaxy S21, which has the same setup, among our very best camera phones, but you won't need to upgrade to the S21 Plus for the photography experience if you already own the S20 Plus; and if you also want the absolute-best camera phone from Samsung, you'll be looking at the Galaxy S21 Ultra.",
    "There are plenty of rumours already about the Samsung Galaxy S22 as well, although there’s no confirmation of a release date just yet.",
    "Overall, then, the Samsung Galaxy S21 Plus is designed for those who want the same mix of affordability and features that the Galaxy S21 offers, but in a larger package. It's not for those who want the very best from Samsung, but if you need a larger screen than the Galaxy S21 then you’ll enjoy this handset.",
    "The Samsung Galaxy S21 Plus will likely be reduced in the Black Friday deals so it’s worth looking at the best phone Black Friday deals out there. We’ll be conducting a re-review in the future. However, we’ve updated references within our review to highlight new features that have emerged since our tests to give you a better idea of what you might be buying.",
    "The Samsung Galaxy S21 Plus was announced on January 14 alongside the Galaxy S21 and Galaxy S21 Ultra at the company’s virtual Unpacked event, with Samsung unveiling its 2021 flagship range a month or so earlier than in previous years.",
    "The Samsung Galaxy S21 Plus release date was January 29, 2021 in most regions, including the US, UK and Australia. That means you can now buy this handset in all three countries, as well as in other major markets.",
    "The Galaxy S21 Plus price officially starts at $999 / £949 / AU$1,549 for the 128GB and 8GB of RAM variant of the phone. There’s also a 256GB / 8GB version, and that costs $1,049 / £999 / AU$1,649.",
    "That price is notably cheaper than the Galaxy S20 Plus launch price, particularly in the US – that phone launched for $1,199 / £999 / AU$1,649 in 2020. This is mostly because the company has opted for Full HD+ display rather than a higher-resolution QHD panel – we’ll dive into that more below.",
    "The Samsung Galaxy S21 Plus has also dropped in price a bit since launch, with the phone being available from around $800 / £720 / AU$1,350 in some stores as of July 2021, with the RRP reduced to £799 in the UK.",
    "Unlike with the Galaxy S20 series, all the phones in the Galaxy S21 range are 5G-ready – there's no cheaper 4G-only version of the S21 Plus, but you are future-proofed with super-fast connectivity where it's available, if you have a compatible data plan.",
    "The design of the Samsung Galaxy S21 Plus is where we see the most obvious differences compared to last year's S20 Plus; the S21 Plus, along with the standard S21 and the S21 Ultra, has been given a radically new design language.",
    "In our opinion the phone pictured throughout this review, in purple with a camera module in a gold finish, is the best color to show it off. The phone is also available in black, white, gray, pink and red.",
    "The screen is a 6.7-inch AMOLED display, and it’s completely flat, so you’re not getting curved edges at the left and right of the display, as on previous models. Some may miss from a design perspective, but we’re not sure that many people will notice or mind – and doing away with curved edges on screens can mean fewer accidental presses.",
    "The back of the handset is clad in glass, something that gives the Plus model a slightly more premium feel than the standard S21, the back of which is clad in a glass/plastic hybrid that Samsung imaginatively calls ‘Glasstic’. As on that phone, though, it’s a matte finish, which gives the phone a sober, sophisticated look and feel.",
    "This is a phone that, despite its size and weight, still feels comfortable in the hand. Most users will find it easy enough to reach the on/off and volume buttons, although if you have smaller hands, or if you prefer smaller handsets in general, you’ll be happier with the S21.",
    "On the bottom edge of the handset are the SIM card slot, USB-C port and speaker grille, and on the right side are the power button and volume controls. If you hold down the power button, the phone does not switch off (that feature is instead hidden in the drop down menu), but instead launches Samsung’s Bixby smart assistant.",
    "How important is the screen resolution on a smartphone? We raise the question because, somewhat controversially, Samsung has dropped the resolution of the S21 to Full HD+, down from the QHD+ resolution from last year's S20 Plus.",
    "However, on a phone screen – even a Plus-sized one – the difference isn’t going to be noticeable to most people most of the time, and the lower resolution saves on battery life as well as helping to keep the price down.",
    "The pixel density is enough for the screen to look razor sharp, and while you might notice a difference if you’re coming to this phone from the S20 Plus – perhaps when watching a HD movie – this is still a very good screen.",
    "In particular we’re fans of the dynamic display refresh rate of up to 120Hz, with the phone intelligently adjusting the refresh rate depending on what you’re doing. If you’re playing a game, for example, the refresh rate maxes out at 120Hz for super-smooth graphics and gameplay, while if you’re just checking a web page or listening to a podcast, the refresh rate is reduced so as not to drain the battery unnecessarily.",
    "Unlike with the aforementioned differences in resolution, if you haven’t used a phone with a 120Hz screen before you’ll certainly notice the difference, and you’ll be impressed. Animations and scrolling are so smooth that it can feel as though you're scanning the pages of a book or magazine rather than looking at a smartphone screen.",
    "Another welcome screen upgrade is to the in-display fingerprint scanner, which is 70% larger than on last year’s phones and so easier to find with your digit. However, we found it to be temperamental when it came to actually recognizing our print and unlocking the phone, and we often had to key in our pin code to effect entry.",
    "The camera setup on the Samsung Galaxy S21 Plus is essentially the same as on last year’s S20 Plus. That’s just fine with us, as the cameras on the S20 Plus are excellent, and this year Samsung has made improvements on the software side.",
    "Starting with the hardware, you’re once again getting a 12MP main and 12MP ultra-wide cameras, and a 64MP telephoto snapper with 3x hybrid zoom.",
    "That telephoto zoom isn’t going to be as impressive as the S21 Ultra’s dual telephoto shooters that are capable of up to 100x zoom. Instead, this offers up to 30x digital zoom but the results aren’t impressive at its maximum zoom.",
    "That said, we found that images up to 10x zoom are still usable on social media or when sharing with friends.",
    "The 10MP selfie camera on the front of the phone isn’t as impressive as its rear-facing counterparts, but it does everything you need it to do well. We were able to snap some nice-looking selfies, and just as importantly, in a time when we’re increasingly relying on video calls both for work and social meet-ups, video quality from this camera is good too.",
    "Another new feature here is Director's View mode, which allows you to take pictures with the front and rear cameras at the same time. The idea is that bloggers and other content creators can capture reaction shots of themselves at the same time as shooting their primary footage, and edit these together, and we found it worked well.",
    "Those software improvements include some tweaks to Single Take mode, which is a setting Samsung enables you to capture a variety of photos and video using all three cameras at the same time.",
    "This now has a new slow-mo mode, and as before we found Single Take is particularly useful when taking pictures of unpredictable pets as you’ll be greeted with a variety of results from a single press of the camera shutter.",
    "You can also record in 8K resolution at 24 frames per second for video with a very high level of detail, although the footage is a bit too cropped for our taste. More useful are the 4K at 30 or 60fps options, and Full HD at 30, 60 or slow motion at 240fps.",
    "The Galaxy S21 phones were among the first phones to launch with the Qualcomm Snapdragon 888 (in the US market) and they were the very first to sport the Exynos 2100 (Samsung's own chipset, which powers the phones sold in markets outside the US).",
    "We’ve only tested the Exynos 2100 version of the S21 Plus so far, and it seems to bring a significant jump in performance compared to previous generations of Samsung chips.",
    "In the past, Exynos processors have tended to be a step or two behind the Qualcomm tech, but that gap seems to have narrowed this year. In Geekbench 5, our Galaxy S21 Plus returned a multi-core score of 3170, and a single-core result of 1035. That’s basically on par with the Exynos-powered standard Galaxy S21, which isn’t surprising, as the two phones share most of their components and features.",
    "Benchmark tests don’t always tell the full story of course, but like the S21, the S21 Plus feels faster in everyday use than its predecessors, handling demanding jobs such as multitasking and running multiple apps in split-screen mode effortlessly.",
    "The Galaxy S21 Plus is packing 8GB of RAM. If you want more than that you’ll need to opt for the S21 Ultra, which comes with 12GB of RAM in its basic configuration but is also available with 16GB of RAM, but 8GB should be enough for most people.",
    "What’s likely to be more problematic for a lot of potential buyers is the lack of a microSD card slot. Expandable storage is one of the great advantages that Android phones have over Apple's iPhones but it’s another area where Samsung has cut corners this year.",
    "You’re stuck with the built-in storage, and the cheapest model of the S21 Plus comes with 128GB, which is pretty miserly by modern smartphone standards, and even more so when you don’t have the option to expand on that. You can upgrade to the 256GB model for an extra $50 / £50 / AU$100, but that’s still not a massive amount, especially if you’re going to be shooting a lot of video.",
    "The Galaxy S21 Plus runs Android 11 with Samsung's One UI 3.0 interface. We've found it to work well, but just be aware that it may take a while before you can get Android 12 on this phone, even though the new operating system is already out. Samsung can be a little slow when it comes to rolling out new versions of Android.",
    "The Samsung Galaxy S21 Plus has a 4,800 mAh battery – that’s 800mAh bigger than the battery in the Galaxy S21, and 200mAh smaller than the one in the S21 Ultra. In real terms, that means you'll get slightly longer life than the S21, and around the same as the Ultra.",
    "Battery life is a strong point for Samsung, and once again we’re impressed by how much use we can get out of this phone from a full charge. With moderate use, but with the phone constantly on, we managed to keep it going for a little over 48 hours.",
    "With typical use you can easily manage a whole day and a whole evening before you need to recharge, and even if you’re a heavy user of power-thirsty applications you can still manage a whole working day.",
    "We should note, however, that we didn’t notice much difference compared to last year's S20 Plus, so don’t upgrade expecting to see a big improvement here.",
    "Samsung has followed Apple in choosing not to include a charger in the box, with the thinking being that most people will have a USB-C charger at home. If you don’t have one you’ll need to factor in the extra expense of buying one on top of the price of the phone.",
    "Samsung has dropped the price of its charger to $19 in the US, but in other markets they’re still pretty expensive so it’s something to be aware of.",
    "Some people may find this annoying, but on balance we’d say this is a positive step from Samsung in terms of cutting down on e-waste, and most people are likely to have a suitable smartphone charger already.",
    "Support for the 45W chargers that worked with the S20 series has been dropped this year – Samsung says it’s improved the 25W charging capabilities of its new phones, so 45W charging didn’t offer that much more of an advantage.",
    "We haven't tested that claim specifically, but charging is pretty speedy, and the wireless Qi charging also works well. The S21 Plus can also be used for reverse charging, so you can charge your Galaxy Buds or other Qi-compatible accessories by placing them on the back of the phone.",
    "First reviewed: February 2021",
    "You might also want to check out the Samsung Galaxy S21 vs Samsung Galaxy S20 comparison."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Samsung Galaxy S21 Plus release date and price",
    "17": "Design",
    "23": "Display",
    "29": "Camera",
    "38": "Specs and performance",
    "46": "Battery life",
    "55": "Don't buy it if..."
  },
  "links": {
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "best camera phones": "https://www.techradar.com/news/best-cameraphone",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "best phone Black Friday deals": "https://www.techradar.com/black-friday/black-friday-phone-deals-2021",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Samsung Galaxy S21 vs Samsung Galaxy S20": "https://www.techradar.com/news/samsung-galaxy-s21-vs-samsung-galaxy-s20"
  }
}