{
  "source": "https://www.techradar.com/reviews/asus-rog-phone-5",
  "title": "Asus ROG Phone 5 review",
  "category": "phones",
  "updated": "2021-05-27T16:16:15Z",
  "author": "david-lumb",
  "summary": "The Asus ROG 5 is the best gaming phone that appeals to non-gamers too",
  "verdict": "The Asus ROG 5 is the best gaming smartphone you can buy with design features and software perks that augment the playing experience. Incremental improvements on its predecessor make it a superior choice that make the phone appealing to non-gamers as well, from its good screen to great speakers to unseen internal refinements that let its 65W fast charging juice the phone from zero to almost full in under an hour. It’s still a pricey handset with notable camera shortcomings compared to rival flagships, but the ROG 5 is a recommendable alternative to top Android phones if you don’t mind its few flaws.",
  "pros": [
    "Remarkable performance",
    "Neat built-in gaming features",
    "Great display and speakers"
  ],
  "cons": [
    "Still no telephoto lens",
    "‘Gamer chic’ looks might be too much for some",
    "Large, heavy and dense"
  ],
  "article": [
    "The Asus ROG 5 is one of, if not the, best gaming phones out there. But it’s also one of the best phones for enjoying any type of media given its great display, extensive battery life and charging speed, and excellent speakers. There are some upgrades on its already-powerful predecessor - and they even found a way to get a 3.5mm jack back in.",
    "The phone’s few shortcomings, like its limited camera suite, haven’t been radically improved to come to parity with standouts like the Samsung Galaxy S21 range. But they get fewer and fewer with every new ROG phone, and the Asus ROG Phone 5 has managed some quality-of-life advantages over other Android phones to the point that it’s competitive with non-gaming smartphones – so long as you don’t need the best camera smartphones.",
    "Asus has also hit a nice balance in the visual design of the phones, which has dialed back its ‘gamer chic’ angled plastic in the earlier ROG phones to more modest lines racing across the back cover of the ROG 5.",
    "Where its predecessor the ROG 3 (there is no ROG 4; we explain why below) had a see-through window on the rear peering into the phone’s internals, the aesthetic tithe to ‘gamer expression’ in this ROG generation is a light-up panel on the back – which either illuminates a ROG logo or, in the pricier ROG 5 models, has a small OLED screen to display whatever you want.",
    "Yes, the ROG 5 is the first Asus phone to have three models: the standard version, the Asus ROG 5 Pro, and the Asus ROG 5 Ultimate. The latter two have slightly better specs and those small OLED displays on the rear cover to flex your gamer cred. They’re aesthetic upgrades, but also the only way to get one of the highest-performance gamer phones out there. To wit: the ROG 5 Ultimate packs 18GB of RAM.",
    "What you actually get with so much RAM isn’t clear, and even Asus described it as more of a flex – a “mix of extravagance and ROG flair,” as a company spokesperson described it to TechRadar – than a noticeable upgrade while playing games, though they expect you’ll be able to keep more games and apps open at once.",
    "But even the baseline Asus ROG 5 packs refinements that should draw attention from mainstream Android users. Thanks to some rearranged internals, the phone recharges its 6,000mAh battery in under an hour with its 65W in-box charger. Its side USB-C port is easier to access than its predecessors to recharge while watching media or gaming. Its speakers are better than ever. And who doesn’t love a 3.5mm jack?",
    "And that doesn’t even touch the peripherals. Did we I mention the new version of the AeroActive Cooler 5 fan (included in the box for Pro and Ultimate) has trigger buttons?",
    "The ROG Phone 5 is the best version of the ROG phones yet, and while it might not convince consumers who need what it can’t provide – great zoom or low-light photography – it’s still a contender for a great all-around phone with powerhouse specs.",
    "The Asus ROG 5 was announced on March 10, 2021, with staggered availability for its three models. The standard version started availability in some regions later in March, the Asus ROG 5 Pro went on sale in April, and the Asus ROG 5 Ultimate will start being available in May – but only in limited numbers. While availability for all models may vary by region, the Ultimate will be sold everywhere, but will be in short supply.",
    "The Asus ROG 5 is now on sale in the US, but only in a single configuration – the highest – 16GB RAM and 256GB of storage for $1,000, which is on sale on Asus' site.",
    "A quick note on naming: yes, the Asus ROG 5 is the direct successor to the Asus ROG 3 released in 2020. The company decided to skip ‘ROG 4’ given some cultures’ reticence to the number four.",
    "The Asus ROG 5 standard price starts at €799 (around $950 / £684 / AU$1,233) for 8GB of RAM and 128GB of storage, €899 (around $1,069 / £769 / AU$1,367) for 12GB RAM and 256GB storage, and €999 (around $1,188 / £855 / AU$1,541) for 16GB RAM and 256GB storage.",
    "The Asus ROG 5 Pro will cost €1,199 (around $1,426 / £1,027 / AU$1,849) for 16GB RAM and 512GB storage, putting it around the same price as the Samsung Galaxy S21 Ultra. The Asus ROG 5 Ultimate’s price tag will be €1,299 (around $1,545 / £1,112 / AU$2,004) for 18GB RAM and 512GB storage.",
    "The Asus ROG 5 comes in black in most regions, although there is a white variant that looks a lot like the ROG 5 Ultimate (below) released in some areas. The Asus ROG 5 Pro comes in a single black hue with its programmable OLED screen on the back cover. The Asus ROG 5 Ultimate has its own white color with blue accents and monochrome OLED screen.",
    "The Asus ROG Phone 5 has a largely similar design as its predecessor, the ROG 3: a black rectangle (or white, if you get the Ultimate version) with the buttons and ports in the same places. There are several improvements, of course – for instance, the back cover’s RGB-lit ROG icon is now filtered through blocks that make it look 8-bit – but most are less noticeable.",
    "There’s a volume button rocker above a power button on the right side, with capacitive touch buttons on the extreme top and bottom edges of the right side that act as shoulder buttons. On the left side is the USB-C port that’s been in the ROG series since its inception, but this time around, instead of another cable port there’s a capacitive strip to connect to accessories. And since that’s shallower than a port, it makes the rubber plug (to keep out dust and sand) easier to pop out.",
    "That’s symbolic of the ROG 5’s small but noticeable quality-of-life improvements: the 6.78-inch display is slightly larger than the ROG 3’s thanks to smaller top and bottom bezels, more responsive shoulder buttons than in the ROG 3, and of course, the 3.5mm headphone jack. Don’t expect improved materials, though: the back cover is still plastic, with a bit of a cheaper feel than glass that we’d hold against Asus if this wasn’t a growing trend in flagship phones to cut costs (we see you, Samsung Galaxy S21).",
    "(Just...put the phone in a case or secure the phone when setting it down. It will slide at the slightest incline. Trust us.)",
    "A bigger change is the back cover’s design. Gone is the ROG 3’s cut-out window into the heat sink; there’s still a ROG logo on the standard ROG 5 (albeit with a blocky filter that makes it look retro 8-bit) that lights up in programmable patterns, much like gamer-chic light-up components inside a PC desktop build. In the Pro and Ultimate versions, the logo is swapped for a small (about 1-inch) OLED panel which can display a symbol or message of your choice.",
    "While RGB and OLED panels certainly scream ‘gamer aesthetic,’ they’re a far cry from the first ROG phone which had such deep grooves zig-zagging across the back cover it looked like an incognito Decepticon. These flourishes were tamed over the ROG phone generations, and the minimal lines seen today are the culmination of a more mainstream look, with a geometric but rounded camera block at the top of the back cover.",
    "Other things haven’t changed from the ROG 3: for instance, the ultrasonic shoulder buttons haven’t shifted in placement or function (they still have , though we’re told there’s a greater density of sensors that are placed nearer to the edge, making them more responsive, at least in theory. In practice, we simply found the ROG 5’s shoulder buttons easier to use, map, and enjoy in gaming.",
    "The phone has four microphones placed equidistant around the phone – at the top, bottom, right side, and next to the camera block on the back – to pick up voice from most angles, no matter how the phone is held or what accessories are clamped on.",
    "For our money, there’s one thing the ROG 5 does better than anyone else in the smartphone business: speakers. The dual 12x16mm front-facing speakers with Dirac HD sound are pretty spectacular, projecting overlapping layers of audio: if you set the ROG 5 down and walk around it, you’ll hear a far more balanced mix of sound from both speaker sources than any other phone (and especially those with single and/or bottom-firing speakers). There may be phones with more particular audio tuning – the iPhone 12 Pro, for instance, seemingly favors a mix that makes dialogue easier to hear at the expense of background noise – but the ROG 5’s sound can fill a room, and you won’t cover the speakers while you’re gaming.",
    "That’s the broad design of the Asus ROG 5, but there are slight differences between the standard, Pro, and Ultimate versions – read on for those:",
    "By and large, the Pro and Ultimate versions don’t have much over the standard Asus ROG 5 aside from better specs and a couple design changes. If you want the best mobile gaming experience, you’ll need to pay for the pricier versions of the phone.",
    "Specs-wise, the standard ROG 5 caps out at 16 RAM and 256GB storage. The Asus ROG 5 Pro comes in one configuration: 16GB RAM and 512GB storage. For the best specs in this generation, the Asus ROG 5 Ultimate has 18GB of RAM and 512GB storage. None of them can upgrade their physical storage, as there is no microSD slot.",
    "Design-wise, both of the pricier versions ditch the plastic rear cover for a classier glass back, and also drop the RGB panel for a small (around 1 inch) OLED screen that can display a customizable message or logo.",
    "The Pro and Ultimate have one more thing the standard version doesn’t: a pair of touch sensor strips on the back of the phone that operate like extra buttons. They’re long yet narrow, and honestly much more difficult to hit reliably than the ultrasonic shoulder buttons. They’re reachable with your ring or pinky fingers, just subtle to the touch, with little width or texture to guide your fingers.",
    "But otherwise, all three phones are identical: same display, same Snapdragon 888 chipset and Adreno 660 GPU, same 6,000mAh battery and 65W charger in the box.",
    "The differences in RAM do affect the phones’ benchmarks, but as for performance, we can only compare the standard ROG 5 we tested with 16GB RAM and the ROG 5 Ultimate with 18GB of RAM (we were not sent the ROG 5 Pro for review). Predictably, they performed nearly identically, though the standard version curiously performed better on a multi-core Geekbench 5 benchmark: 3732 for the ROG 5 standard versus 3678 for the ROG 5 Ultimate. At this level of RAM, 2GB is apparently negligible.",
    "There’s a gaping hole here, of course: how do the 8GB of RAM and 12GB of RAM configurations’ gaming capabilities match up against the top-tier 16GB and 18GB phones we tested? Regrettably, we can’t answer that right now, but if and when we get our hands on a lower-spec phone, we’ll refresh this section. The least we can say is that the advantages of the pricier Pro and Ultimate versions seem to be wholly cosmetic.",
    "The Asus ROG 5 has a 6.78-inch Full HD Plus (2440 x 1080) AMOLED display with HDR10+ certification – it’s capable of displaying sharp visuals and vibrant colors. The front-facing camera is located in a thin black bar, a classy move to avoid a notch.",
    "The picture is crisp, and the only nitpick we could bring was that images lose clarity in deep shadow or very dark patches. Naturally, the ROG 5’s Full HD Plus display doesn’t produce as sharp of a picture as phones with displays having higher resolution – like, say, the WQHD Plus (3200 x 1440) screen on the Samsung Galaxy S20 Plus. Overall, the ROG 5’s display is as good as if not better than nearly every other flagship smartphone out there (the iPhone 12 Pro has just a bit of a clarity and color balance edge on it).",
    "The real benefit for gamers, of course, is the 144Hz refresh rate, which makes browsing the internet a smoother experience than typical 60Hz displays, not to mention much smoother gameplay when playing games that support higher frames-per-second rates.",
    "The screen has a 300Hz touch sampling rate, responding to finger presses far faster than most phones – the Samsung Galaxy S21’s screen samples at 240Hz, for instance.",
    "The Asus ROG Phone 5 packs a modest array of cameras for its price range, notably missing a telephoto lens for zoom photography. While its high-megapixel main lens does manage to take sharp enough images to crop-zoom, it’s not a replacement for the kind of magnification that the Space Zoom-packing Samsung Galaxy S20 and S21 feature.",
    "Still, the Asus ROG 5 has casual photography covered with its triple rear cameras: a 64MP main shooter, 13MP 125-degree field of view ultra-wide camera, and a 5MP macro lens. There’s a 24MP front-facing camera that works just fine.",
    "The ROG 5 takes decent photos in daylight, capturing a vivid range of colors and a decent level of clarity, though it’s handily outclassed in the latter by top-tier phones like the iPhone 12 Pro and Samsung Galaxy S20 Plus (the phones we tested against). And while the Samsung phone won out overall in distance photography thanks to its Space Zoom, the Asus ROG 5 actually outperformed the iPhone 12 Pro at maximum (8x) zoom in daylight conditions, producing images with less blur and more true-to-life balance of light and shadow.",
    "The Asus ROG 5 is capable of good depth of field effects, producing decent background blur, though its portrait mode isn’t quite on the level of top-tier flagships. The low-light performance is respectable, though better with ambient light, and you may have to wrestle with the camera to switch focus (like if you’re trying to secure depth-of-field.",
    "The ROG 5 can shoot up to 8K video at 30fps, 4K video at 60fps (or 30fps with the ultra-wide camera), slow-motion video in 4K at 120fps, and take still photos while shooting video.",
    "The ROG series of phones has improved the rest of its kit to be more appealing to the average consumer, but they’ve always focused on gaming, and the ROG 5 is the best gaming phone yet. That may be fainter praise than in prior years when it had more competition, but the new handset still has the best hardware and software for gaming in phones today.",
    "If you got to know the Asus ROG 3, not much has changed: the phone still has roughly the same combination of hardware and software. There’s two ultrasonic buttons on the top and bottom of the right side that, when the phone is rotated sideways, become shoulder buttons. They’re responsive and easier than prior ROG phones to map to whatever game you’re playing, though you’ll have to pull out the ‘Game Genie’ overlay menu (swipe from the left side) to manually turn on and place the activation area that the buttons trigger.",
    "The Armoury Crate software is fairly unchanged - it’s still a repository for all your games, though there’s even more ways to customize how your phone runs for each particular game. The performance-enhancing X-Mode returns as well, though we didn’t notice a significant increase in Geekbench 5 benchmark scores when it was activated with default settings- instead, it seems to benefit more by tinkering to maximize performance.",
    "There’s new functionality for the phone’s mid-gaming software, too: Game Genie has a more understandable mapping interface, and there’s a new esports mode that disables distracting notifications and any macro software (which you can set up in the in-game Game Genie menu, admittedly) to keep the playing field even.",
    "As far as accessories, one has gotten a big change: the AeroActive Cooler 5 now has two physical buttons that function mode like the underside paddles on pro console controllers. While novel and delectably clickable, they’re not easily reachable, so they’ll work better for occasional actions like crouching or jumping - save the frequently-needed fire and reload actions for your shoulder buttons.",
    "There’s a refined version of the Kunai 3 gamepad built specifically for the ROG 5 - even if it looks identical to the older model built for the ROG 3, there’s no interoperability, meaning you’ll have to buy a whole new one if you pick up the new phone. It works just like it always did: slide the ROG 5 into the special case (and its USB-C plug) and you’ll be able to slide each half of the Kunai pad on to each side, Nintendo Switch style.",
    "The Kunai 3 can only work with games that support it, and some you’ll have to map each button to whatever on-screen area you need, an onerous but not agonizing process. Thankfully, this is automatically done for some games like Dead Cells, which I could pick up as easily as if I’d just loaded it up on the Nintendo Switch - a serious bonus. But for titles like Call of Duty: Mobile, individually mapping buttons one by one was tiresome but not terrible. Unfortunately, it was impossible to get the controller to invert the Y-Axis for the right ‘look’ joystick as this reviewer prefers to do, which was a dealbreaker for the Kunai - but thankfully, most gamers aren’t cursed with this idiosyncratic gaming quirk.",
    "Overall, it’s no surprise that the Asus ROG 5’s hefty specs, fantastic display, game-assisting hardware and software, and respectable battery life combined for a better gaming experience than on any other phone on the market right now.",
    "The Asus ROG 5 packs top-tier specs and gets top-tier performance, making it competitive with 2021’s best smartphones like the Samsung Galaxy S21 range in terms of sheer muscle. Whatever we put the phone through, from switching apps to browsing the web to watching media to playing games for long sessions.",
    "The one variable between the different Asus ROG 5 versions is RAM and storage: the standard version starts at 8GB of RAM but you can get it in 12GB and 16GB configurations, all in the latest LPDDR5/UFS 3.1. We should be clear that Asus sent us the 16GB RAM version, and it hummed through everything - which is to be expected when paired with its powerful processor.",
    "But given the configuration with the top RAM selection for the standard ROG phone is about the same price as the Samsung Galaxy S21 Plus, our current best smartphone, this is a competitive set of specs that gets results: the ROG 5 with 16GB of RAM achieved a multi-core Geekbench 5 score of 3732, handily beating the S21 Plus with 8GB of RAM’s 3170 score.",
    "The ROG 5 starts with 128GB of storage, which is a baseline for most 2021 Android phones, but can be expanded to 256GB - but despite the brightly-colored SIM tray on the bottom of the right side of the phone, there is no expandable storage via microSD. The ROG 5 Pro has 512GB of storage, as does the ROG 5 Ultimate.",
    "The Asus ROG 5 runs Android 11 out of the box, with the usual – but still appreciably minimal – Zen UI overlay that’s attractive and simple. and includes the Armoury Crate gaming software out of the box along with ROG’s particular gamer-chic wallpapers that rev into action when X-Mode is activated. The phone is 5G-capable, but only sub-6 frequencies – there’s no mmWave connectivity.",
    "The Asus ROG 5 has the same 6,000mAh capacity as the battery in its predecessor, though it’s been redesigned internally to achieve better charging performance. Instead of a solid 6,000mAh unit, the ROG 5 has two 3,000mAh batteries placed on either side of the center-CPU, which allows the phone to recharge faster with both units charging at the same time, refilling over two-thirds (4400mAh) of the battery in 30 min using the 65W in-box charger, by Asus’ reckoning.",
    "Splitting up the CPU also reduces heat - up to 46% lower temperature generation while charging the battery to full, Asus claims. And in casual play sessions - say, twenty minutes of Call of Duty: Mobile matches - the phone did stay pretty cool, with only the metal frame warming up a bit after the session.",
    "Asus introduced a neat feature in the Asus ROG 3, and it returns here: slow charging. Instead of wearing down your battery faster using the top charging speed, you can have it fill up at a slower rate, like if you were plugging it in overnight. If you want to recharge your phone as fast as possible, that 65W charger isn’t just for show: we started at 6% battery life and shot up to 75% in half an hour, rounding on 90% in 45 minutes and a full charge not long thereafter.",
    "If you’re going to charge overnight, there’s a new feature called scheduled charging that lets you enter a wake-up time, and if the phone is plugged in, it will start charging to top off right around the time you select. It’s pretty sensical, and once again allows those concerned about the longevity of their battery life to cut down on unnecessary charging cycles. You can also set a cap of 80% or 90% if you don’t want the phone charging all the way up.",
    "You can also use bypass charging, which allows you to simply plug in the phone to power your gaming sessions - and don’t refill a mAh more. Why? To avoid building up extra heat, and given your ROG 5 might already be warm after long gaming sessions, this is a nice option to have.",
    "There’s also a new ultra-durable battery mode, which is to preserve as much power as possible while still leaving the phone functional – mostly by dialing back the phone’s performance. When the mode is active, its CPU and GPU run at a lower clock, the display’s refresh rate is lowered to 60Hz, the touch input is lower, and background processes are restricted. It’s just the essentials to eke out even more life from the battery.",
    "First reviewed: March 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Asus ROG Phone 5 price and release date",
    "15": "Design",
    "25": "ROG 5 vs ROG 5 Pro vs ROG 5 Ultimate",
    "32": "Display",
    "36": "Camera",
    "41": "Gaming: hardware and software",
    "49": "Specs and performance",
    "54": "Battery life",
    "60": "Don’t buy it if…"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "ROG 3": "https://www.techradar.com/reviews/asus-rog-3",
    "Asus' site": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1276792943649607700&xs=1&url=https%3A%2F%2Fstore.asus.com%2Fus%2Fitem%2F202105AM210000001%2Fphones-ASUS-ROG-Phone-5---6.78%25E2%2580%259D-FHD%252B-2448x1080-HDR-144Hz-Display---6000mAh-Dual-Cell-Battery---64MP%252F13MP%252F5MP-Triple-Camera-with-24MP-Front-Camera-%25E2%2580%259316GB-RAM---256GB-Storage-5G-LTE-Unlocked-Dual-SIM-Cell-Phone&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fasus-rog-phone-5"
  }
}