{
  "source": "https://www.techradar.com/reviews/monoprice-dark-matter-27",
  "title": "Monoprice Dark Matter 27-inch gaming monitor review",
  "category": "computing",
  "updated": "2021-09-14T16:19:03Z",
  "author": "michelle-rae-uy",
  "summary": "Speedy display and HDR goodness for the budget-conscious",
  "verdict": "The only thing that’s better than the Monoprice Dark Matter 27-inch gaming monitor’s decent HDR for a price that’s hard to beat is its 240Hz refresh rate. However, it does skimp on a lot of gaming-related features, and if you’re all about the frills, this may not be for you.",
  "pros": [
    "Rock-solid high refresh rate",
    "Well implemented HDR",
    "Good price"
  ],
  "cons": [
    "Design could be better",
    "No frills",
    "No USB-C"
  ],
  "article": [
    "On the outside, the Monoprice Dark Matter 27-inch gaming monitor may not impose its will the way one of those curved ultra-wide monitors would. But, that doesn’t mean it should be overlooked as it has a lot to offer the right gamer.",
    "What’s on the inside is what sets this gaming monitor apart. Well, that and its price. Instead of packing in every feature possible, Monoprice stripped this monitor down to the bare necessities, prioritizing speed and image quality (most notably with its HDR) in addition to keeping the price down.",
    "This makes the Monoprice Dark Matter 27-inch ideal for Esports gamers who don’t care about all the extras and want to get right into the action.",
    "At $299 (about £220, AU$420), the Monoprice Dark Matter 27-inch gaming monitor is a fantastic value for economizing gamers. Unfortunately, while there are plenty of more fully-featured or better-looking displays out there, finding one for that price with a similar focus on speed is next to impossible.",
    "The Alienware AW2720HF, also a 240Hz monitor but with a little more pizzazz, may get close in price when Dell runs one of its many sales. However, it usually goes for $599 (£579, AU$899). At that price point, you may as well jump up to something with a higher resolution like the Samsung Odyssey G7, which offers a 1440p resolution at 240Hz for $676 (£499, AU$999).",
    "Sadly, the Monoprice Dark Matter 27-inch is currently only available in the US at the time of writing.",
    "The Monoprice Dark Matter 27-inch’s budget-level cost clearly shows in its design. The only indication that it’s meant for gaming appears on the back. It comes in the form of two thin red plastic lines that streak diagonally along with some angular etched lines reminiscent of cheaper gaming laptops. Unfortunately, it’s not an aesthetic that will please fans of RGB.",
    "Its stand is a little more unusual in that it stands on three legs to keep it steady, as opposed to a flat base that many monitors have. It’s also a bit easier to move around, something we’ve come to appreciate since the display can’t swivel. Thankfully, it can tilt up 20 degrees and down 5.",
    "While the front of the monitor is pretty unremarkable – just an LED in the lower right indicating power, it at least has very thin bezels at the top and both sides. The panel itself is an IPS-type AHVA (Advanced Hyper Viewing Angle). And, as the name suggests, we’re able to see the screen very clearly no matter how close we get to the 178-degree viewing angle.",
    "The port selection will satisfy most gamers at least, featuring a DisplayPort, two HDMI ports, a USB port meant just for servicing at the factory, and a headphone jack. However, the two HDMI connections are not the same, with one being HDMI 1.4 and the other being 2.0.",
    "Why is this important? The HDMI 1.4 standard has a smaller bandwidth and can only support a 60Hz refresh rate. Monoprice has designated this slower port as HDMI1, which honestly doesn’t make sense. If you’re pushing hard to advertise that fast 240Hz refresh rate, wouldn’t it make sense to give that the top spot? To make things even more confusing, the manual indicates HDMI1 to be the faster 2.0 port.",
    "We ended up spending a lot of time troubleshooting, only to eventually realize that the manual had it backwards. Well, either that or Monoprice’s quality control department needs its own quality control.",
    "Lastly, we should mention the rocker switch that sits behind the right side of the monitor and is meant for navigating the on-screen menu. Using the switch itself is a cinch and getting around the menu is easy enough. It would have been nice to have an app that could adjust all those settings on-the-fly, a feature found on many gaming monitors, even cheaper ones. Still, you can access everything outside of the resolution and refresh rate.",
    "Performance is where the Monoprice Dark Matter 27 shines. The 240Hz refresh rate and 1ms response time makes games buttery smooth, even when a game’s point of view is moving around so much that it’s hard to keep up.",
    "Running through Night City in Cyberpunk 2077 feels like running through a real dystopian city. And, keeping track of the action in Rocket League is incredibly easy since there’s no lag or stuttering. On the UFO Lagom test, the little UFO glides across our screen without so much as a glitch.",
    "Though the panel’s resolution is just 1080p, it looks beautiful. It has an almost 100% sRGB color gamut and a 1000:1 contrast ratio so colors look vibrant, rich and deep enough. Add in HDR400 and the visuals just pop off the screen.",
    "In Cyberpunk 2077, the different environments have more depth to them with darker areas being more visible and brighter areas not overblown. HDR400 might be Vesa’s lowest level of HDR certification, but it’s well implemented here – much better than some of other displays we’ve tested that advertised HDR capabilities. What’s even more impressive here is that while getting a monitor with a higher level of certification will typically come with a drastic increase in price, Monoprice has been able to keep the cost down.",
    "The one additional feature Monoprice included with the monitor is AMD’s FreeSync technology for anyone sporting an AMD graphics card. With everything that the company has packed inside the Monoprice Dark Matter 27-inch gaming monitor, it’s easy to forgive those minor lapses in design.",
    "After all, where else will you get such a speedy display for such a low price?"
  ],
  "headers": {
    "0": "Two-minute review",
    "19": "Don’t buy it if…"
  },
  "links": {
    "gaming monitor": "https://www.techradar.com/news/best-gaming-monitor",
    "ultra-wide monitors": "https://www.techradar.com/news/ultrawide-monitor",
    "Alienware AW2720HF": "https://www.techradar.com/reviews/alienware-aw2720hf",
    "Samsung Odyssey G7": "https://www.techradar.com/reviews/samsung-odyssey-g7",
    "AMD graphics card": "https://www.techradar.com/news/amd-graphics-cards"
  }
}