{
  "source": "https://www.techradar.com/reviews/getresponse",
  "title": "GetResponse email marketing software review",
  "category": "computing",
  "updated": "2021-10-20T13:56:11Z",
  "author": "michael-graw",
  "summary": "Harness the power of this leading email marketing platform",
  "verdict": "Getresponse is an excellent choice if you need both email marketing and webinar hosting. The platform may be pricey, but it delivers thanks to automated workflows and a flexible email designer.",
  "pros": [
    "A beginner-friendly email marketing platform",
    "Excellent customer service"
  ],
  "cons": [
    "No two-factor authentication",
    "No “free forever” plan"
  ],
  "article": [
    "If you’re looking for the best email marketing software available today, we highly recommend considering GetResponse. This popular software provider offers a wide range of marketing solutions, with everything from email marketing and webinars to inbound marketing automation and powerful analytics.",
    "In our complete GetResponse review, we take a closer look at the platform. We analyze every aspect of its features, subscription options, usability, and support to help you decide whether it’s the right option for your needs.",
    "GetResponse offers a range of subscription options. A 30-day free trial is available with all plans, and discounts are available with 12-month (-18%) and 24-month (-30%) subscriptions. Note that all prices quoted here are for a contact list size of 1,000 or fewer. Expect to pay more if you have more contacts.",
    "Prices start from just $15 per month for a Basic subscription, which includes email marketing tools, unlimited landing pages and automation templates, full autoresponder functionality, and unlimited lead funnels.",
    "Upgrading to the Plus plan (from $49 per month) adds webinars with a maximum of 100 attendees, up to five automation workflows, and up to five sales funnels. The Professional plan (from $99 per month) is even more powerful, adding web push notifications, paid webinars, and unlimited automations.",
    "Finally, there are custom solutions available for those with high-end requirements. You can access things like transactional emails, larger webinar audiences, account migration support, and single sign-on (SSO).",
    "GetResponse comes with some of the best marketing features that we’ve seen.",
    "The email marketing tools available have to be seen to be believed. You can benefit from a suite of attractive email templates, an excellent drag-and-drop builder, autoresponder tools, intuitive list management features, and much more.",
    "GetResponse offers various inbound marketing automation tools, allowing you to create streamlined workflow automations that save you and your company time and money. The drag-and-drop workflow builder is excellent and can be used to complement your email marketing campaigns.",
    "You can also create high-quality, attractive landing pages through the platform’s native landing page builder. Use these to add substance to your email marketing campaigns, encouraging promising leads to take specific actions.",
    "The built-in webinar creation tool is something that few email marketing platforms offer. With this, you can host unlimited webinars, store recordings, and engage with prospective customers in an effective manner.",
    "To get started with GetResponse, simply create a new account by entering your name, email address and a new password. This will give you access to a 30-day free trial, and you don’t have to enter any payment or credit card information.",
    "Next, you will go through a short questionnaire asking about your goals, the type of marketing you plan on doing, etc. Complete this to access the GetResponse management dashboard, where you can start creating your first campaign.",
    "The dashboard itself is intuitive and easy to find your way around. The menu in the top left lets you move quickly between modules, and it shouldn’t take more than a few minutes for you to feel comfortable.",
    "One thing that stands out here is the excellent email builder. You can drag and drop different elements into the required positions. Add your own content, ensure that the design is consistent with your brand, and use the test and preview tools to check that everything works as it should.",
    "Customer service is one thing that GetResponse does exceptionally well. For starters, live chat support is available 24/7, even if you’re not an existing customer. Phone support is notably absent, but email support is available in eight different languages, including English, Spanish, French, and Russian.",
    "Alternatively, you can take advantage of the comprehensive help center to solve problems yourself. Here, you will find a broad range of resources covering everything from onboarding to the finer technical aspects of using GetResponse. There’s also a training webinar designed to help you familiarize yourself with the platform in the shortest amount of time possible.",
    "GetResponse is an industry leader in the email marketing space, but that doesn’t mean that it’s the right option for everyone.",
    "Constant Contact is one popular competitor, and it’s especially ideal for those who need a simple, beginner-friendly platform without too many advanced features. Prices start at a competitive $20 per month, and the email marketing tools are complemented by the platform’s excellent landing page builder.",
    "Another option worth considering is MailChimp. It has been providing industry-leading email marketing solutions for over two decades, and its service continues to improve every year. It has an excellent “free forever” plan and streamlined integrations with a suite of third-party platforms.",
    "All things considered, there’s a reason that GetResponse is often touted as the number-one email marketing platform in the world. It’s affordable, offers a great free trial, and has some of the best features available.",
    "The drag-and-drop email builder is extremely beginner-friendly but remains a powerful option for creating highly customized emails. Customer service is also excellent.",
    "The bottom line is that if you’re looking for a competitively priced email marketing program that’s backed by a suite of other tools, you must consider GetResponse."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Features",
    "11": "Interface and in use",
    "15": "Support",
    "17": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "best email marketing software": "https://www.techradar.com/best/best-email-marketing-software",
    "GetResponse": "https://www.dpbolvw.net/click-6361382-10831463?sid=trd-us-5583134946174261000",
    "Basic subscription": "https://www.tkqlhce.com/click-6361382-14331756?sid=trd-us-4588091863115054600",
    "landing pages": "https://www.techradar.com/best/landing-page-creator",
    "Plus plan": "https://www.tkqlhce.com/click-6361382-14331756?sid=trd-us-1094536114601256200",
    "webinars": "https://www.techradar.com/best/best-webinar-software",
    "Professional plan": "https://www.tkqlhce.com/click-6361382-14331756?sid=trd-us-6407328954900959000",
    "Constant Contact": "https://www.techradar.com/reviews/constant-contact",
    "MailChimp": "https://www.techradar.com/reviews/mailchimp"
  }
}