{
  "source": "https://www.techradar.com/reviews/msi-radeon-rx-6700-xt-gaming-x",
  "title": "MSI Radeon RX 6700 XT Gaming X review",
  "category": "computing",
  "updated": "2021-04-14T21:15:00Z",
  "author": "bill-thomas",
  "summary": "A great Radeon RX 6700 XT, but wow its expensive",
  "verdict": "While the MSI Radeon RX 6700 XT is an excellent graphics card, the extremely high price tag makes it almost impossible to recommend, and it will be even harder to recommend it after graphics card availability starts to normalize.",
  "pros": [
    "Excellent performance",
    "Stays cool",
    "Looks nice"
  ],
  "cons": [
    "Obnoxiously expensive",
    "May be too large for some cases"
  ],
  "article": [
    "As the great graphics card shortage of 2021 continues, cards like the MSI Radeon RX 6700 XT Gaming X are revealing just how dire things have become. Because, if all were normal, this is a graphics card that would cost only a bit over the $479 (£419.99 about AU$620) that the AMD Radeon RX 6700 XT launched at.",
    "Instead, due to a combination of tariffs and supply issues, the MSI Radeon RX 6700 XT Gaming X retails for $789 in the US, which is more than $300 more than the AMD version of the card. And while MSI's version of the GPU is faster than AMD's reference design, it in no way justifies the higher price of the card.",
    "Out of the box, the MSI Radeon RX 6700 XT is at most 4% faster than the reference version of the GPU, in Metro Exodus at 1440p. That gap narrows down to just 1 fps at 4K, which is basically just equal performance. So, unless you're going to be overclocking, there's basically no reason to shell out the extra cash for the MSI Radeon RX 6700 XT.",
    "Unlike the beefier cards in the MSI Gaming X lineup like the RTX 3080 or RTX 3090, however, the MSI Radeon RX 6700 XT Gaming X still just features a dual-fan cooling configuration. MSI did beef up the cooling a little bit with a much thicker heatsink, which increases the graphics card profile to 2.5 slots, up from the 2 slots of the reference RX 6700 XT. Power delivery is also a bit more robust here, with two 8-pin PCIe power connectors, rather than the 6+8-pin power connectors of AMD's version.",
    "Of course, that does mean that the MSI Radeon RX 6700 XT will take up a significant amount of space in your PC case. The graphics card is 10.98 inches long and 5.15 inches thick, which means some folks that are trying to build a super compact PC might run into some trouble. Make sure you measure your PC case so you know whether or not this beast will fit in there.",
    "This should lead to better overclocking potential, but it's best to temper your expectations here. The two extra power connectors will add a little more wiggle room for GPU voltage, but it won't be enough to make a huge difference or make that added $300 worth it.",
    "Luckily, the graphics card does look pretty amazing. On the back there's a sleek black metal backplate, bearing the MSI Dragon logo. Over on the side, the heatsink is mostly exposed, other than an MSI-branded fin on the side. And, of course, there's plenty of RGB lighting, just like every other graphics card in the MSI Gaming X lineup.",
    "The lighting will be found both on the MSI logo on the side of the graphics card, and on accents in between the fans on the front of the shroud. You can control this lighting through the MSI dragon software, too, which will also allow you to tweak with your other graphics card settings.",
    "As for ports, you get three DisplayPort and one HDMI 2.1 port, so pretty standard fare. We do kind of wish that there was a USB-C port, especially for folks who want to utilize the 12GB of GDDR6 memory for creative workloads like Blender and Adobe Premiere.",
    "But that's not really what this graphics card is for. This is primarily a GPU meant for gaming, which means nothing matters if it can't deliver the frames.",
    "We're primarily looking at 1440p gaming performance, mostly because that's where this graphics card shines. There's also a giant '1440p' logo on the front of the retail box, so that's where it really needs to deliver.",
    "Luckily, it delivers 1440p gaming performance in spades. The only games that the MSI Radeon RX 6700 XT didn't deliver better than 60 fps at 1440p are Red Dead Redemption 2 and Metro Exodus with ray tracing enabled. And, really, those are extremely hard to run, especially at the settings we use for benchmarking.",
    "For Red Dead Redemption 2, we crank up every setting that's not multi-sampled anti-aliasing (MSAA). If you want a flawless 60 fps with those settings, you're going to want to get an RTX 3080 or the like – if you can find one.",
    "And as for Metro Exodus with ray tracing, well, AMD graphics cards are not quite up to snuff for that kind of workload yet. And the beefier cooler and slightly improved power delivery aren't going to change the fact that the AMD Radeon RX 6700 XT isn't exactly the best ray tracing card.",
    "You can turn the tech on, but we wouldn't advise it unless you're on a 1080p panel. Most people are still using a 1080p display, though, and at that resolution the MSI Radeon RX 6700 XT is an absolute beast.",
    "In games like Dirt 5 and Assassin's Creed Valhalla at 1080p, the MSI Radeon RX 6700 XT can easily hit 120 fps. It does drop a bit in Metro Exodus and Red Dead Redemption 2, but it still gets framerates above 60 fps, so you're pretty much golden at that resolution.",
    "But unfortunately, it all comes back to the price. No matter how good this card looks and performs, it doesn't justify the huge price increase, even if it's not entirely MSI's fault. Right now, we're in a situation where you should probably just buy the first graphics card that you find in stock, but that situation won't last forever.",
    "If and when prices get back to normal, the MSI Radeon RX 6700 XT will still be nearly twice the price of AMD's version of the card, and it means we simply can't recommend it."
  ],
  "headers": {
    "0": "Two-minute review",
    "18": "Don't buy it if..."
  },
  "links": {
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "AMD Radeon RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/msi-geforce-rtx-3090-gaming-x-trio"
  }
}