{
  "source": "https://www.techradar.com/reviews/elementor",
  "title": "Elementor website builder review",
  "category": "computing",
  "updated": "2021-04-26T02:27:22.460Z",
  "author": "chyelle-dvorak",
  "summary": "An excellent website builder plugin that eases WordPress page creation",
  "verdict": "Elementor lives up to its reputation for being one of the best WordPress add-ons on the market. Many of its templates and widgets are available for free, and it provides a cleaner interface to speed up the creation process.",
  "pros": [
    "Includes live page editor",
    "Works as a front-end page builder",
    "Numerous editing tools",
    "Great customisability"
  ],
  "cons": [
    "Can be confusing for beginners"
  ],
  "article": [
    "Instead of using the tools and templates included in WordPress, Elementor aims to help you create something different, showing you the outcome of your design as you assemble your page. This WordPress plugin doesn’t require previous HTML or CSS coding knowledge and it pairs easily with any WordPress theme. It includes helpful navigators, menus, which makes it straightforward and easy to understand.",
    "Elementor includes both free and paid versions. The free version includes over 30 different template options that will help your website look more professional, over 40 widgets to choose from and a built-in page editor. As far as website builder plugins go, Elementor has lots of options to pair with your WordPress themes.",
    "The paid options come with more templates and more detailed website features across several different plans. The Essential package costs $49 per year, can be used on a single website, and includes over 300 Pro templates (which offer more detail than the free options), over 90 widgets, and over 10 website template kits.",
    "The Advanced plan costs $99 per year and lets you install it on up to three websites, while the Expert plan covers $199 for up to 25 websites. More professional businesses might eye Studio ($499/year) or Agency ($999/year) which include VIP live chat support, and expand the number of websites Elementor can be used on to 100 and 1,000 respectively.",
    "The nice thing about the free version is that it still includes Elementor’s drag and drop creation tools, which helps make website building fast and easy. However, if you are looking for something more detailed, Elementor Pro comes with more features and support, meaning it might be worth splashing out a little extra, especially if you want to build and manage more than one website.",
    "Just like any plugin, Elementor is installed via your WordPress Dashboard. Its interface is clean and easy to figure out. When you create a new page, you’re now given the option to “Open with Elementor”. The traditional WordPress tools are then replaced by Elementor’s.",
    "Front and centre are two main buttons. A dark red + one (‘add a new section’) and a dark grey folder one (‘add a new template’).",
    "These pages are made up of sections, within the sections are columns, and inside those columns are widgets.",
    "Elementor has various widgets, elements, and settings to choose from, and you’re able to choose between a pre-designed page or start building your own. The drag and drop feature of the interface allows you to choose what you want from the left column, then drag over to any section on your web page.",
    "Do note that you can’t access any of Elementor’s templates, be they for pages or blocks, without setting up an account with them first. However this process is free and easy: all they need from you is your email address and a password.",
    "As you build your website, Elementor allows you to see everything during that process. Instead of working on a website and guessing what the end result will look like, you can add features and see the updates live. Every change is exactly as it looks. This is a huge advantage over the traditional WordPress editor which almost always requires you to ‘Preview’ your page to see the outcome.",
    "Some sections, like headings let you edit the text directly on the page, while text boxes need to be filled in via the sidebar on the left.",
    "That sidebar is contextual. It’s where you can see all available widgets, for instance, but select an item on the page, and it will change to reflect the tools available for the item you clicked on. For example, if you selected a button, the sidebar is where you’ll be able to customise it, changing its title, colour, action, link it to a URL, etc.",
    "The number of tools at your disposal is quite impressive, from the basics like alignment, to more advances features such as motion effects, and responsive rules. You can design some truly unique pages.",
    "Elementor comes with over 150 pre-designed SEO friendly pages, which can be extremely helpful if you’re looking for a style that’s quick, professional, and already put together. 40 of these are available in the free version, but they’re not so easy to find as they’re interspersed throughout the list. You can’t really miss the ones that need to be paid for, as they have a ‘Pro’ label top right of their thumbnail, but you have no alternative but to scroll through the list to locate the free ones.",
    "It’s clearer with the widgets: only the Basic 10 are free. As you’d expect, the more interesting ones, such as Accordion, Social Icons, and Menu Anchor, are located in the Pro section, and need a yearly plan to be used.",
    "Regarding templates, it’s also possible to upload some from third party clients to use in Elementor, giving you even more variety if you’re looking for a specific design, but want to use the platform’s drag and drop features.",
    "As you build your page, you’ll notice how useful this drag and drop capability is: want to move a section, column or widget around? Just drag it to its new location. It’s really that simple. Column widths can be altered by dragging them. It’s all very intuitive, and it’s not hard to achieve pixel-level precision.",
    "There are many different website builder plugins available - with Divi Builder, Beaver Builder, and SiteOrigin Page Builder just a few.",
    "One of Elementor’s top competitors, Divi Builder lets you work from a front-end interface (seeing exactly how it will look on your website) as well as working through the code. However, Divi Builder doesn’t include a free option, only a 30 day free trial - with the yearly subscription for Divi Builder is $89, but includes unlimited websites. Elementor’s free option allows you to try its templates and start building your website right away, without having to sign up for a yearly subscription.",
    "Elementor is one of the highest-rated website building platforms available, and it’s easy to see why. With its helpful front-end page builder, live editor, and wide variety of pre-designed templates, Elementor is a helpful tool for creating your own professional website. The front-end builder approach makes it easy to see the changes you’re making to your website as you edit, rather than blindly working your way through WordPress and hoping for the best, making even the free option an ideal partner for anyone looking to build a site."
  ],
  "headers": {
    "1": "Plans and pricing",
    "5": "Interface",
    "10": "Features",
    "18": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "Elementor": "https://elementor.com/",
    "WordPress plugin": "https://www.techradar.com/best/best-wordpress-plugins",
    "WordPress theme": "https://www.techradar.com/news/best-wordpress-theme",
    "free version": "https://elementor.com/pricing/",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Essential package": "https://elementor.com/pricing/",
    "Advanced plan": "https://elementor.com/pricing/",
    "Divi Builder": "https://www.elegantthemes.com/gallery/divi/"
  }
}