{
  "source": "https://www.techradar.com/reviews/benq-gv30-projector",
  "title": "BenQ GV30 projector review",
  "category": "audio-visual",
  "updated": "2021-09-20T07:59:35Z",
  "author": "rhys-wood",
  "summary": "A great-sounding projector that’s just too dim to recommend",
  "verdict": "What the BenQ GV30 gets right, it gets fantastically right. The build quality of this 720p beamer is superb, and while that resolution isn’t super high, the image quality remains sharp and readable. Throw in great sound with a strong bass profile and you’ve got a real winner of a projector… right? Sadly, not quite. At just 300 ANSI lumens, the GV30 is nigh unusable in bright environments, and its poor battery life practically begs for the device to be plugged in at all times.",
  "pros": [
    "Superb build quality",
    "Sharp image",
    "Great, bassy sound"
  ],
  "cons": [
    "Poor battery life",
    "Low brightness",
    "Relatively pricey"
  ],
  "article": [
    "The BenQ GV30 projector certainly leaves a strong first impression, at least at first glance. Before you even get to switch the device on, you’ll find that it comes in a nifty, high-quality carry case, which is easily unzipped to reveal the projector and its components inside.",
    "We’re simply in love with the shape and build quality of the GV30. It’s sturdy, and just the right amount of weight for a portable projector without feeling cheap or underdeveloped. The same can be said for the magnetic swivel, which the GV30 effortlessly clamps in and out of, where it can be rotated on a 135-degree axis to help find the right viewing angle for you.",
    "This superb build quality carries over to the remote, which has to be one of the best we’ve used for a projector. It’s simple to understand with clearly defined buttons, and the tactile feedback offered when pressing them is more satisfying than it has any right to be.",
    "Unfortunately, results when switched on are more mixed, as it seems like there’s a caveat to almost everything positive about the GV30. Even the steadfast build quality has a trade-off in that the side panel feels needlessly awkward to open with the included rubber pick.",
    "Image quality is sharp and clear, and the GV30 makes the most of its otherwise limited 720p resolution. And thanks to the effective auto keystone, the projector can reliably adjust to find the best viewing angle most of the time.",
    "Sadly, the quality of the image is accompanied by one of the GV30’s biggest drawbacks – the dreadfully low brightness. At just 300 ANSI lumens, the GV30 is largely unusable in bright environments. A Daytime mode preset does help, by adding some artificial brightness to the image, but only ever so slightly. You will certainly want to use this projector in a darkened room for best results.",
    "Thankfully, the GV30’s prospects improve exponentially in the sound department. The clear sound profile means that your content is perfectly hearable even at low volumes, and the added bass lends weight to more intense or impactful scenes. The bass isn’t too muddy, either, and avoids distorting the overall sound even when turned up to a reasonably high degree. As such, the GV30 isn't one of the best projectors, but it is a decent choice in this regard for casual home theater viewing.",
    "The BenQ GV30 portable projector is launching on September 15 for $599 / £499 (around AU$679), which puts it in the range of other portable projectors like the Optoma ML750e which features in our best portable projectors buying guide.",
    "We’d say the price is a bit steep for a 720p projector, especially with a brightness as low as 300 ANSI lumens. However, a sharp 720p image, great sound quality and a surprising wealth of available apps certainly go towards making the GV30 a more attractive purchase.",
    "Put simply, we love the physical design of the GV30. It has a pleasingly round design that complements the included magnetic swivel. This allows users to position and rotate the beamer as they’d like, which makes viewing on walls and ceilings as easy as adjusting its position on the swivel, with a total radius of 135 degrees. The magnetic connection is strong, too, so it won’t easily be removed without deliberate force being applied.",
    "The projector is rather compact, too, measuring just 4.7 x 7.7 x 7.3 inches (12 x 19.6 x 18.5 cm), and weighing roughly 3.5 lbs (1.6 kg). While the GV30 is bulky enough to make moving it around the house potentially a bit of a hassle, its relatively small form factor keeps it from becoming too cumbersome.",
    "The GV30 doesn’t have much in the way of connectivity, but it’s enough to get the job done depending on your viewing preferences. It features one HDMI and USB-C port on the exterior, as well as a 3.5mm headphone jack and a port for the power adapter. By removing the side panel, you have access to a slot for the (included) QS01 HDMI streaming stick. This was a pain to remove via the included rubber pick, but you likely won’t have to do this process more than once.",
    "The streaming stick provides access to a range of apps you can use to view online streaming content. Powered by Android TV, the amount of apps on offer is actually quite impressive. While Netflix is missing – a common sight on projectors – the GV30 more than makes up for it with Google Play Store support, which will allow you to download apps like Prime Video, Disney Plus, Crunchyroll, Apple TV, ITV Hub, Peloton and more.",
    "For audiophiles, Spotify, Amazon Music and YouTube Music are also available to download, and the GV30 is perfect for these apps given its clear, bassy sound profile.",
    "Unfortunately, the GV30’s battery life falls well short of what we’d expect from similarly priced beamers. At just two and a half hours, you might not even be able to get through an entire movie on a full charge. You certainly wouldn’t be able to watch any of the Lord of the Rings movies when the GV30 is unplugged.",
    "Compare this to the Viewsonic M1+, which is an even smaller projector than the GV30. The M1+’s battery life more than doubles that of the GV30 at six hours from full charge. Now, it is possible to extend the GV30’s battery life using Eco and Low Power battery modes, but each will dim the display even further below that 300 ANSI lumens count at full brightness, which is not ideal.",
    "We wouldn’t want to force you into permanently having the GV30 plugged in, though. While this is where the beamer operates optimally, you lose the portable element that the GV30’s compact form factor is perfect for. We definitely recommend investing in a power bank if you haven’t done so already, as this will greatly extend how much the projector can be used wirelessly.",
    "At 720p and with a 24-bit color depth, the GV30 doesn’t have the sharpest image quality, nor is the display the most colorful. However, it certainly does the best with what it has. Despite the relatively low resolution, the image quality appears clear enough to be displayed at any angle, though we do recommend keeping the screen size in the 50-80 inch range, if possible, for best results.",
    "We’re happy to report that the display’s sharpness extends to text. That’s great news if you watch films and TV shows with subtitles enabled, whether out of necessity or as a preference. It makes foreign subbed movies like Parasite and The Raid much more watchable, too.",
    "As the lumen count is already so low with the GV30, movies and shows with consistently vibrant color palettes fare much better. Animated shows like The Simpsons and Rick & Morty display fantastically on the GV30, and as such is perfect for binge watching shorter-length cartoons.",
    "Things begin to fall apart, however, when you start to watch darker films and shows. Even shows with relatively brighter colors like Marvel’s What If…? struggled with the darker colors. Typically, the edges of the screen were especially hard to make out. In our testing, this carried over to grittier shows like The Mandalorian and The Walking Dead, which were nigh unwatchable in brightly lit environments.",
    "But even in optimally dark conditions, you’ll struggle to get a truly perfect image with the GV30. The GV30 maxes out at just 300 ANSI lumens, which is well below average for a model of its price. For the sake of comparison, the cheaper Anker Nebula Solar portable projector is 400 ANSI lumens, and we even found that to be dimmer than we’d have liked."
  ],
  "headers": {
    "0": "One-minute review",
    "7": "Price and availability",
    "9": "Design and features",
    "17": "Picture quality",
    "22": "Don't buy it if..."
  },
  "links": {
    "best projectors": "https://www.techradar.com/best/4k-projector",
    "best portable projectors": "https://www.techradar.com/news/best-portable-projectors",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Amazon Music": "https://www.techradar.com/reviews/amazon-music-hd",
    "YouTube Music": "https://www.techradar.com/news/youtube-music-everything-you-need-to-know",
    "Viewsonic M1+": "https://www.techradar.com/reviews/viewsonic-m1-mini-projector",
    "Anker Nebula Solar": "https://www.techradar.com/reviews/anker-nebula-solar-portable"
  }
}