{
  "source": "https://www.techradar.com/reviews/tile-mate-tile-slim-and-tile-sticker-2021-review",
  "title": "Tile Mate, Tile Slim, and Tile Sticker (2022) review",
  "category": "phones",
  "updated": "2021-10-19T08:18:10Z",
  "author": "hamish-hector",
  "summary": "A tracker for every item",
  "verdict": "Tile Mate, Tile Slim, and Tile Sticker are three great trackers that are sure to fit almost every use case you could imagine. With their three-year battery life and IP67 waterproof rating, they should help you keep track of your stuff in rain or shine. Whether you’re using an Android or iOS device, these Tiles are a great option for you.",
  "pros": [
    "Support on iOS and Android",
    "High find rate",
    "Designs for different uses"
  ],
  "cons": [
    "Non-replaceable battery",
    "Shorter range than other trackers",
    "No ultra-wideband tracking"
  ],
  "article": [
    "The new Tile Mate, Tile Slim, and Tile Sticker are great tools for keeping track of your stuff no matter what smartphone brand you use.",
    "Their 250ft BlueTooth range and loud ringers should help you locate any lost item in your home, and the Tile network’s over 90% success rate at returning missing items to their owners means you know your most important belongings will almost certainly make it back to you.",
    "Thanks to new features like the Lost and Found QR code printed onto the Tile Slim and Tile Mate – as well as the growing support of services like Amazon Sidewalk in the US – hopefully that success rate will get even higher with Tile's latest devices.",
    "It’s a shame the battery isn’t replaceable in any of these trackers, but the three-year-long life guarantees you’ll get plenty of use out of them before you need a replacement.",
    "You won’t get the ultra-wideband tracking of Apple's AirTags, but they cost less and the ringer is more than effective enough to locate the Tile Mate, Tile Slim, and Tile Sticker if they’re within 250ft of you.",
    "You can pick up the Tile Mate, Tile Slim, and Tile Sticker from Tile’s official store, as well as a handful of third-party vendors across different regions.",
    "The 2022 Tile Mate costs $24.99 / £19.99 / AU$34.95, the Tile Slim sells for $34.99 / £29.99 / AU$44.95 and Tile Sticker is $29.99 / £24.99 / AU$34.95.",
    "The Tile Mate, Tile Slim and Tile Sticker share (almost) all the same features but offer different designs based on their intended use case.",
    "The Tile Mate is a chunky square with a hole in one corner so you can use it as a keyring, and is sturdy enough to be dropped inside a bag. The Tile Slim is the same size as a credit card (and about as thick as two cards pressed together) making it a perfect fit for your wallet or passport case. The Tile Sticker is a small circular tracker with adhesive on the back so you can stick it to your headphone case or a TV remote.",
    "All three trackers have a life of up to three years thanks to their non-replaceable battery.",
    "Once you’ve registered one of these trackers to your account, you’ll be able to locate it using the Tile app on your iOS or Android smartphone. If the item is within 250ft of you, the tracker should start ringing to help you locate it.",
    "If it's further away, the Tile tracker will be registered as lost. The Find Far Away function should pin your Tile’s last known location on a map, and its location can be updated by the Notify When Found option. This feature uses Tile’s global network of users and various network extenders (such as Amazon Sidewalk in the US) to update your Tile’s location as other users pass by.",
    "A new addition to the Tile Slim and Tile Mate is a QR code stamped on the back with the words 'Scan me if found'. When you mark your Tile as lost, you can add basic contact details that will be given out when someone scans the QR code.",
    "This should allow good samaritans to return your lost item even if they aren’t part of the Tile network or have the Tile app.",
    "All of the trackers have an IP67 water and dust-resistant rating. This means that they can be submerged in up to one meter of water for up to 30 minutes. Heavy rainfall and the odd puddle shouldn’t get in the way of finding your stuff.",
    "Last but not least is one of our favorite features: the reverse track. If you have a Tile tracker but can’t find your linked smartphone you can double-tap the Tile logo on the Mate or Slim (or a side button on the sticker) to have your phone ring. This is a really handy tool when your phone has fallen down the couch cushions and you have no clue where it could be.",
    "From our own experience, the Tiles are genuinely a time saver and offer huge peace of mind when you’re worried you’ve lost your wallet or house keys. On several occasions, the trackers made getting out the door with everything we needed a much more painless experience than it might have been as we could very quickly find whatever we needed without having to search around aimlessly.",
    "The ringer is loud to hear it from the other end of the house and while we had the odd connection issue, closing and reopening the app took seconds and we were able to find our stuff in no time.",
    "As for items lost outside the home, a Tile representative told us that over 90% of the time a tagged possession was returned to its owner after it was marked as lost. We expect the addition of the QR code and Tile’s growing network support with partners like Amazon will boost these up even more, but for now 90% is still great."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Price and availability",
    "7": "Design and features",
    "16": "Performance",
    "19": "Don't buy it if..."
  },
  "links": {
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Amazon Sidewalk": "https://www.techradar.com/news/what-is-amazon-sidewalk-and-how-will-it-impact-iot",
    "Apple's AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "headphone": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340"
  }
}