{
  "source": "https://www.techradar.com/reviews/dell-xps-17-2021",
  "title": "Dell XPS 17 (2021) review",
  "category": "computing",
  "updated": "2021-12-02T14:39:14Z",
  "author": "jackie-thomas",
  "summary": "The big XPS is back",
  "verdict": "The Dell XPS 17 is an incredibly powerful laptop that is easy to carry around due to its thin and lightweight design. However, the high price and lack of legacy ports may stop some folks from going all-in on this luxurious laptop.",
  "pros": [
    "Excellent performance",
    "As beautiful as ever",
    "Thin and light",
    "Great keyboard"
  ],
  "cons": [
    "Expensive",
    "Not enough ports"
  ],
  "article": [
    "There’s been no other line of laptops that has competed with the MacBook Pro as consistently or for as long as the Dell XPS series of laptops. While the smaller models marry performance with portability, the Dell XPS 17 has always been about providing as much power and screen real estate as possible for the people that need a little extra to handle their workload.",
    "The Dell XPS 17 (2021) is no different. The kind of internals that our review model comes equipped with is about as robust as you can expect in a Windows laptop at the moment. From its 11th-gen Intel Core i7 to 32GB of RAM and a discrete Nvidia GeForce RTX 3060 graphics card, this can go head-to-head with powerful desktop PCs. Yet, it’s also surprisingly thin for such a behemoth, as its chassis measures just 0.77 inches thick.",
    "Of course, all that power comes at quite the premium. At $2,949 (about £2,130, AU$4,020), our configuration is not an ideal option for everyone. If heavy video editing or graphic design is not part of your everyday workload, there are plenty of other notebooks out there that are probably a better fit. Even if you want something specifically for gaming, you can find one that’s cheaper, like the Razer Blade with similar specs.",
    "The Dell XPS 17 is for the creative professional on the go that wants an extremely powerful and versatile PC, but one that's stylish and won't look out of place in an office. However, its thinness does end up being kind of its bane in that regard, as the port selection isn't quite what you may want to see.",
    "The Dell XPS 17 2021 is available starting at $1,549 (£1,649, about AU$2,110). That configuration will get you an 11th-generation Intel Core i5-11400H, 8GB of RAM, a 512GB SSD and a 17-inch 1200p display.",
    "Of course, you can upgrade basically every component to a more powerful version, and we would definitely recommend you do so. That base configuration is good enough for everyday computing, but there's no reason to pay extra for a 17-inch laptop if you're not using it for some kind of heavy lifting.",
    "You can push it all the way up to $3,749 (£3,899, AU$6,998), which will net you the Intel Core i7-11800H, 32GB of RAM, a 4TB SSD, an Nvidia GeForce RTX 3060 and a 4K touch display. Though, in the UK and Australia, the SSD storage caps out at 2TB instead of 4TB.",
    "That's one beefy laptop. The configuration listed to the right will be a little more accessible, costing $2,949. That 4TB SSD in the totally maxed out version might be nice, but it's really not worth the extra $800 tacked onto the price – especially since you can upgrade the SSD later.",
    "For most people, we'd recommend trimming down the RAM to 16GB and the screen to the FHD option from the model we reviewed. Unless you're doing heavy video editing work you're not really going to notice the difference in performance. Making those two changes brings the price down to $2,399 (about £1,730, AU$3,270) which is much more competitive with similarly specced laptops.",
    "This probably isn't super surprising, but the Dell XPS 17 is a gorgeous laptop. All silver with a Dell logo on the back of the screen, it looks like the MacBook Pro competitor that it is. And, unlike the MacBook, it has this soft finish on the deck of the laptop that makes the laptop much more comfortable to work on.",
    "The 17-inch size of course also allows for the XPS 17 to have much more space on the keyboard deck, and it's kind of surprising how Dell put it to use here. Instead of putting a full keyboard with a numpad, like many laptops in this size class, Dell instead puts a standard laptop keyboard in and surrounds it with speakers instead.",
    "That means that the Dell XPS 17 has a very similar design to the MacBook Pro in this regard, and we absolutely love it. There are absolutely folks that are going to want a full keyboard, but the speakers that Dell was able to put in here sound fantastic.",
    "Even when listening to super bass-heavy music like Kittie's \"What I Always Wanted\", the speakers are clear and can keep up with the crunchy guitars and screams.",
    "They're still not better than having some PC speakers or headphones to listen to music, but at least it's not going to butcher your music like some other Dell laptops do – looking at you Dell XPS 13.",
    "The display is also simply incredible. Dell sent us the 4K touch version, and while the OLED Dell XPS 13 is still better – it is OLED after all – this is still one of the best laptop displays we've used.",
    "The display hits an average of 464 nits of brightness and covers more than 100% of the sRGB color spectrum. This makes the display excellent for media work, though it still falls short of the 99% DCI-P3 color spectrum that would make it a truly professional-grade display.",
    "But even though Dell didn't really expand the keyboard beyond what it is on the Dell XPS 15, it's still a well-spaced and comfortable keyboard. Travel is nice and deep and all the keys are easy to reach.",
    "The only thing that kind of sucks is the smaller up and down arrow keys – though that will only affect you if you're spending a lot of time in Excel or Google Sheets.",
    "For a 17-inch laptop, the Dell XPS 17 is incredibly small. It measures just 0.77 inches thick and weighs just 5.34 lbs (2.42 kg), which makes it easy to throw into your backpack and carry to work – something that's definitely nice to have when you consider the high amount of power that this laptop has to offer.",
    "The thinness of the XPS 17 does have one downside, though, and that's ports. All you get is four Thunderbolt 4 ports, an audio jack and an SD card slot: the laptop straight up isn't thick enough for anything else to fit on the chassis.",
    "So, while we would rather there be at least one USB-A or HDMI port, we totally get why Dell couldn't fit those ports on the Dell XPS 17. Still, it's something you should be aware of when considering this laptop.",
    "You can upgrade the Dell XPS 17 as well, which should let you save a bit upfront. All you need to do to open it up is remove 8 hex screws on the bottom of the laptop and pry off the bottom of the case.",
    "It's a bit of a pain the first time around, but you should be able to get into the laptop sooner or later. Once you're in there, you can easily upgrade your RAM and system storage, and the Dell XPS 17 will support up to 64GB of RAM.",
    "Because the Dell XPS 17 is packed with an 11th-generation Intel Core processor and an Nvidia GeForce RTX 3060, it probably shouldn't be super surprising that it absolutely chews through most workloads.",
    "The dedicated GPU here makes it able to hold its own in games, easily averaging around 52 fps in Metro Exodus at 1080p with everything at Ultra. Turn down a few settings, and you're going to be able to get a solid 60 fps experience out of even the most demanding games at 1080p. But that's not really what the Dell XPS 17 is for.",
    "Instead, where this laptop really shines is in creative workloads, where that 4K display can really shine. Whether you're working in Adobe Premiere, Photoshop or Blender, you're going to save more time on this laptop than with the latest MacBook Pro, and that's largely thanks to the CUDA cores in the RTX 3060 here.",
    "Combine the powerful discrete graphics with the RAM and the powerful, high-wattage H-series processor and this is a laptop you can use to edit video in 4K on the road without making it a total exercise in frustration.",
    "With the amount of high-powered hardware and the 4K display here, it's probably not surprising that the Dell XPS 17 isn't going to be winning any awards when it comes to battery life.",
    "This laptop was able to get a bit over 7 hours in the PC Mark 10 battery life test, which simulates various real-world applications. That's not terrible by any means, but these days it's fairly common to find a laptop that will get you through a full 8 hour workday on a single charge.",
    "But we don't think that's super important here. It's not like the Dell XPS 17 is going to die in a couple hours, and this is definitely a laptop most people are probably going to be using while plugged into a wall working anyways.",
    "Unfortunately, even when we've all been working from home more often and need to use our laptops for more and more video meetings, the Dell XPS 17 only has a 720p webcam. It's definitely not the worst we've used, and if you're in a well lit room, you can still get plenty of detail out of the camera.",
    "It gets the job done, basically, but you might want to invest in a webcam if you're going to be using this laptop while plugged into a monitor anyway.",
    "Luckily, the built-in microphone fares much better. Our voice comes through nice and clear, and we didn't need to reach for a standalone mic in any of the many meetings we took on the Dell XPS 17.",
    "Because this is a Dell, it's loaded up with an assortment of software. Most of this will stay out of your way, and will only be necessary when you need to update or connect to your phone. However, it is also equipped with a trial of McAfee, which we had to remove, as we kept getting popups asking us to buy a subscription.",
    "But once you get that out of there, and replace it with one of the best antivirus programs, the laptop is pretty good at just letting you do your thing.",
    "The Dell XPS 17 also has both Windows Hello through the webcam and a fingerprint scanner, so you can use whichever kind of biometric login you're most comfortable with.",
    "Both are extremely quick to unlock in our experience, and the fingerprint scanner is the same button that turns the laptop on, so you don't have to move your hand too much just to start using the laptop."
  ],
  "headers": {
    "4": "Price and availability",
    "9": "Design",
    "23": "Performance",
    "27": "Battery life",
    "30": "Camera and microphone",
    "33": "Software and features",
    "37": "Don't buy it if..."
  },
  "links": {
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Dell XPS 17": "https://www.techradar.com/reviews/dell-xps-17-2020",
    "Nvidia GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "Razer Blade": "https://www.techradar.com/reviews/razer-blade-pro-17-2021",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "best antivirus programs": "https://www.techradar.com/best/best-antivirus"
  }
}