{
  "source": "https://www.techradar.com/reviews/garmin-instinct-solar",
  "title": "Garmin Instinct Solar review",
  "category": "fitness",
  "updated": "2021-03-10T15:26:05Z",
  "author": "cat-ellis",
  "summary": "The Garmin Instinct Solar's modest design hides one of the most practical sports watches around",
  "verdict": "The Garmin Instinct Solar might not be the most attractive multi-sports watch around. but it just might be the most practical, with incredible battery life thanks to its Power Glass lens, which keeps it topped up in daylight. It's not just a re-release of the 2018 Instinct either, with a new blood oxygen sensor and customizable power modes added to an already very impressive specs sheet.",
  "pros": [
    "Exceptional battery life",
    "Well designed interface",
    "Great range of activities, including triathlon"
  ],
  "cons": [
    "Plastic case looks a little cheap",
    "Black and white display"
  ],
  "article": [
    "The Garmin Instinct Solar is one of the best running watches around, and is incredibly tough and practical if you don't mind its no-frills looks.",
    "Garmin has been indulging in a little sun-worshipping over recent months, releasing a slew of new solar smartwatches, including some updates to existing models. The Garmin Instinct Solar, as the name suggests, is a new version of the 2018 Instinct, with the benefit of frankly incredible battery life thanks to regular solar top-ups plus some other enhancements under the hood.",
    "The Instinct Solar might not be the most stylish GPS running watch around, but it’s just so useful, you'll be hard pressed to find a more practical companion for running, cycling and hiking off the beaten path.",
    "Packed with training and navigation features, and with incredible battery life courtesy of Garmin’s Power Glass, which keeps it topped up in daylight. Looks aren’t everything, and the Instinct Solar is a pleasure to use – clearly designed by people who are passionate about sport and the great outdoors.",
    "The Garmin Instinct Solar was released in July 2020 for $399.99 / £340 / AU$549. Several special editions were released later in the year, including the Tactical Edition, Surf Edition, and Camo Edition, all of which cost $449.99 / £399 / AU$799.",
    "The Garmin Instinct Solar’s body is crafted from rugged fiber-reinfoced polymer, with a silicone strap supplied as standard (easily changed via quick-release pins). It’s a very practical, tough design, but it’s unmistakably plastic, and perhaps not smart enough for everyday wear away from the tracks, trails, lakes and sea.",
    "At 53g it’s a mere 1g heavier than the 2018 Instinct, and its case is identical – at 45mm in diameter it’s not excessively wide, but at 15.3mm thick it’s somewhat chunky on the wrist.",
    "Unlike some solar-charged watches, which use photovoltaic material in the face, Garmin’s devices use a technology called Power Glass, which harvests energy without sacrificing the look of the watch. Power Glass isn’t quite as tough as sapphire glass, and Garmin advises against covering it with a screen protector, but it’s still pretty robust and resistant to knocks and scratches.",
    "The display is a monochrome memory-in-pixel affair, which some users may find off-putting (no bright colors here), but is necessary for that frankly ridiculous battery life. It also has the advantage of being always on, with a backlight accessible via a quick tap of the top left button. You can easily customize the strength of the backlight through the watch itself, or the Garmin Connect app. The lens’s matt finish means it’s easy to read in direct sunlight, which is important for obvious reasons.",
    "Our review unit was the standard edition Instinct Solar (which comes in Black, Tidal Blue, Orchid, Sunburst and Flame Red), but there are also several special editions on the way later in 2020.",
    "These are Tactical, which features with night vision goggle compatibility, Jumpaster (a tool for experienced skydivers), and a stealth mode that cuts out all wireless communications; Surf, with tidal data and a dedicated surfing activity mode; and Camo.",
    "So far, the only difference between the Camo and standard editions seems to be a camouflage patterned case and strap. We’d be surprised if it doesn’t have some more interesting features at launch though, considering it costs the same as the other special editions.",
    "Setting up the Garmin Instinct Solar is simple, but even if you live in a sun-soaked paradise you'll need to give it an initial charge using the supplied cable. Like most modern Garmin fitness trackers, the Instinct Solar charges via a small USB cable that plugs into the rear of the case. It’s a design that we prefer to the older-style clips (still used by Fitbit), as it holds more securely and is less likely to become dislodged during charging.",
    "Once it's juiced up, install the Garmin Connect app (available for Android and iOS) and either log in with your Garmin account or create a new one. Making a new account takes a little while, as you'll need to enter some basic physiological data (height, weight, age, activity levels and so on) but it's a worthwhile investment. This account will be a one-stop shop for all your fitness info, and will present data from all your Garmin devices in a single dashboard.",
    "Sign into the Garmin Connect desktop website too, and take a look around; it's where you'll manage more advanced tools like route creation.",
    "Open the mobile app, tap the menu button at the top left and scroll down to 'Garmin Devices'. It will detect your new Instinct Solar and allow you to connect. You'll need to type in a PIN displayed on the watch's face to verify the connection.",
    "Garmin says that the watch can keep running indefinitely in power saving mode, with no need to plug in at all, but this kind of performance is only achievable with at least three hours of direct exposure to sunlight per day; we checked with Garmin and were told that you won’t see that kind of performance if you spend all your time indoors or live somewhere particularly cloudy but you’ll still be able to keep going weeks between charges.",
    "You’ll need to dedicate a chunk of time to studying the manual, but the interface is amazingly clear considering the sheer number of features packed in. That’s largely down to the intuitive display we described earlier, with a small circular cut-out (known in Garmin’s literature as the ‘dial screen’) that shows different icons, showing you what the top right button will do at any particular time. It’s the same as that of the original Instinct, but the extra battery settings mean it’s more useful than ever here.",
    "The dial screen can also serve different purposes on the home screen. It displays the date by default, but can also be used to show the current temperature, calories burned, a notification count, and even the phase of the moon. Any information you want to see at a glance.",
    "The Garmin Instinct Solar isn’t just an Instinct with Power Glass, there are also several improvements inside the case. These include an SpO2 sensor to estimate changes to your blood oxygen saturation overnight, and a customizable battery-saver modes so you can prioritize the features you use most often.",
    "The current solar intensity level is displayed as a small graph on the watch's main face, and it's remarkable seeing the battery indicator barely budge for over a week. It speaks volumes that battery life is displayed in days rather than as a percentage.",
    "There’s a wealth of activity tracking options (including some unexpected ones like stand-up paddleboarding and hunting), but the running features are where the Instinct Solar really shines, with profiles for outdoor running, treadmill running, indoor track running and trail running.",
    "It’s good to see that there’s also a triathlon mode, accessible through the cycling activity options – something even the best running watches often lack.",
    "We’ve stuck to the great outdoors so far, but one of our favorite features is the Navigate function, which lets you follow courses created by you, or other Garmin users, with turn-by-turn directions. It’s a great way to explore new areas, or discover paths less trodden closer to home.",
    "The Instinct Solar offers all-day heart rate monitoring, and we found the results recorded during our workouts to be accurate compared with a chest band, without any unexplained spikes or drops.",
    "We enjoyed experimenting with the Virtual Trainer tool, which is useful for solo training sessions, and helping you understand what a particular pace feels like. Just set a preferred pace for your ‘partner’, and the watch will show you at a glance who is leading, just like a pacer in a race. An excellent tool if perceived exertion is your preferred pacing method.",
    "Activities can be paused and resumed with a quick tap of a button (which you’re unlikely to hit automatically) but actually ending your activity and syncing it to Garmin Connect requires several presses, reducing the likelihood that you’ll accidentally stop tracking before you’ve finished your workout – a problem we’ve sometimes encountered with less robustly designed fitness trackers, particularly those with touchscreens.",
    "Buttons can also be locked, which we’ve found is great for ball sports like tennis and squash where they’re more likely to take an accidental knock. We had no trouble with accidental presses while skipping and doing floor exercises - and the watch remained comfortable throughout.",
    "Unsurprisingly for a Garmin device, navigation is excellent, with GPS/Galileo/GLONASS helping ensure you’re covered pretty much anywhere on Earth. There’s also a thermometer, altimeter and compass. We’d never recommend using a smartwatch as your sole means of finding your way when exploring the countryside, but it’s certainly convenient, and means you won’t need to dig out your map and compass regularly.",
    "Garmin Pay is available, but much like Fitbit Pay, this only works with a small selection of banks in the UK, where we performed our tests. A disappointment, but not one specific to the Instinct Solar.",
    "As is typical with Garmin watches, we found the haptic feedback a little too strong – with app notifications enabled, a lively WhatsApp conversation can leave you feeling like there’s an angry wasp inside the case – but you can easily pick and choose your notification settings through the Garmin Connect app, which offers a choice of vibration, audio, or no notifications at all. Notifications can be disabled at night.",
    "As mentioned earlier, like all Garmin fitness trackers and smartwatches, the Garmin Instinct Solar links up to the Garmin Connect app. There's just one key difference: tap the menu button, select 'Garmin devices' and select your Instinct Solar, and you'll be able to check how much sunlight your watch has been catching recently.",
    "During a video briefing, Garmin told us that although it won't be as potent as direct sunlight, illumination from a window will still keep the battery topped up. If your graph is looking very flat, make sure your cuff is pushed out of the way.",
    "At a glance, you can see your current heart rate, step count and approximate calories burned. Scroll down a little and you'll get some interesting insights based on the previous day's numbers, including stress level based on changes in heart rate) and Body Battery. This \"measures the amount of energy reserves you have throughout the day\" and rates it out of 100, with a higher number representing a more full battery.",
    "It's similar to Polar's Nightly Recharge figure, and essentially shows how well you're balancing rest and activity, helping you see whether you've got a good workout in you, or you should spend some time taking it easy.",
    "The app's real appeal is its activity tracking, which you can find through the menu at the top right. Here you can view recent runs, bike rides, swims and cardio sessions together with accurate GPS maps.",
    "You'll also get accurate graphs representing elevation (we suspected one of our usual routes had a lot of false flats, and it was heartening to see that we weren't imagining it), plus an ambient temperature measurement courtesy of the Instinct Solar's in-built thermometer. It's a feature we rarely see in fitness trackers, but it's a very welcome one considering the huge impact weather can have on training.",
    "There's plenty of useful biometric data at your disposal as well, including heart rate (and heart rate zones), cadence and stride length. It's all set out plainly, with none of the odd proprietary names some companies use (we're looking at you, Fitbit).",
    "If you like the sound of the Instinct Solar's feature set, but aren't so keen on its looks, you might be interested in the TrueUp feature, which lets you sync data from multiple activity trackers and pull it all together in Garmin Connect.",
    "We’re in an unusual position of switching between trackers frequently for testing purposes, but it would also be handy if you want to keep a more stylish tracker for daytime use and switch to the chunky Instinct Solar for workouts. Just try not to leave it in a dark drawer.",
    "First reviewed July 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Garmin Instinct Solar price and release date",
    "5": "Design",
    "12": "Garmin Instinct Solar setup",
    "19": "Garmin Instinct Solar fitness tracking",
    "31": "Garmin Instinct Solar companion app",
    "41": "Don't buy it if"
  },
  "links": {
    "running watches": "https://www.techradar.com/best/running-watches",
    "solar smartwatches": "https://www.techradar.com/news/garmin-launches-solar-smartwatch-that-lasts-up-to-24-days-between-charges",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Android": "https://play.google.com/store/apps/details?id=com.garmin.android.apps.connectmobile",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5959412311250608000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fgarmin-connect-mobile%2Fid583446403%3Fign-mpt%3Duo%253D4",
    "Garmin Connect": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1415627457644564000/https://connect.garmin.com/",
    "best running watches": "https://www.techradar.com/best/running-watches"
  }
}