{
  "source": "https://www.techradar.com/reviews/anycubic-photon-mono-x",
  "title": "AnyCubic Photon Mono X review",
  "category": "computing",
  "updated": "2021-06-01T19:09:46Z",
  "author": "ali-jennings",
  "summary": "Take the step from FFF to SLA",
  "verdict": "AnyCubic's latest Photon Mono X is a large scale LCD-Based SLA 3D printer. Not only does it offer one of the largest print areas for this style of machine, but coupled with the new Wash and Cure unit available separately or in a bundle, this combination offers a huge technological leap forward for home and small business SLA printing.",
  "pros": [
    "Incredibly cheap",
    "Produces a high-quality print",
    "Large capacity print area"
  ],
  "cons": [
    "Resin is still messy",
    "Resin vat doesn't pour smoothly",
    "Some print layering on close inspection"
  ],
  "article": [
    "Compare prints from an FFF (fused filament fabrication) and a SLA (Stereolithography) 3D printer and you'll instantly see why model makers, jewelry designers, engineers and even dentists look to SLA as their printer technology of choice.",
    "There's no doubt that the SLA technology enables prints that are a level up from what is achievable by a standard FFF printer, but that quality comes at a cost.",
    "Surprisingly that cost is no longer financial, with the likes of the AnyCubic Photon Mono X coming in at considerably less than a grand. The real issue with SLA is the resin used as the 3D printable material. Why? Well, resin is messy, and at present, there's no way around that.",
    "Once you print your SLA model, it needs to be cleaned and cured, and while AnyCubic hasn't come up with a one-stop solution, they have created a bundle with the resin printer and washing station.",
    "The two machines complement each other perfectly and aim to streamline the usually messy process of washing and curing.",
    "Both the LCD-based SLA printer and the wash and cure machine follow the same design style, making them a perfectly matched pair. Setting up both on the work surface and it has to be said that they look great with the bright yellow protective shield and only the simple touch screen LCD on one and dial on the front differentiating the look of the bases.",
    "The design is simple and straightforward, helped in part by the excellent AnyCubic set-up guide that truly reflects the machines function.",
    "The printer's design is simple, with the main print area and resin vat at the top covered by the large yellow UV protective screen, then on the front of the base is the touch screen LCD that enables you to navigate all the settings.",
    "Power, USB and on / off switch are all located on the sides and back. It's all very neat and simple.",
    "Likewise, the Wash and Cure follows a similar design ethic. The main washing and then curing station, once the tub is removed, are on top with a button to switch between wash and Cure with a dial used to adjust the timings.",
    "The design is smart, simple and in using highly effective.",
    "The UV light used by resin printers is dangerous to human eyes, and therefore the print area must be covered by some protective shield.",
    "AnyCubic has come up with a simple lift on and off solution, it's not the most elegant solution that I've seen, but there's no faulting its effectiveness.",
    "It may be simple, but sensors detect whether the shield is in place or not; if not, the machine will sit idle until the shield is in place.",
    "Software for 3D printers is essential to the success of the print, and here AnyCubic has designed a relatively simple and easy to understand solution.",
    "The AnyCubic Slicer Software enables all the adjustment, supports model splitting, slicing and previews you could need.",
    "While SLA printer is generally faster than their FFF equivalents, the Mono X picks up the pace with Print speeds up to 3x faster than the Photon.",
    "Looking inside the machine, you can see that AnyCubic has carefully looked at the robustness of the design with dual linear rails and solid lead screw to help reduce the risk of layer shift.",
    "At the heart of the machine is the new matrix UV light source that delivers 4K resolution for higher detailed prints. The 8.9-inch Monochrome LCD enables short layer exposure times, helping to boost those print speeds and detail.",
    "A feature that is becoming increasingly popular is Wifi and App integration, and here the AnyCubic App Remote control offers a convenient way to monitor prints and their progress.",
    "Using UV to expose prints is a technical process, and any fluctuations in temperature can affect the success of the print. Within the machines base is a complex cooling system to help regulate the machine and extend its usable life.",
    "Finally, what makes the Mono X stand out is the size of the print area. AnyCubic has designed the printer and resin vat in such a way to maximise the print area while keeping the amount required in the vat to a manageable amount.",
    "AnyCubic has a reputation for providing solid 3D printers that require only the slightest set-up. Set-up of the Photon Mono X case follows AnyCubic's usual slick approach, remove the packaging, set the printer on a level surface and switch it on.",
    "Once powered up, the four screws around the build plate are loosened before being attached to the vertical column.",
    "Then the resin vat is then bolted in place, and it's just a case of following the brief instructions on screen, making sure the build plate is flat and then tightening the screws. You're now ready to print.",
    "The process takes less than five minutes, even for an inexperienced 3D printer.",
    "AnyCubic supply a single print cube sample for you to test the printer, this takes around an hour to print, and the quality is instantly impressive.",
    "The build plate is held to the vertical axis with a single large screwing knob, undo this, and the build plate easily slides off.",
    "This plate is covered in resin which is not the nicest stuff, so best transferred straight into the wash and Cure.",
    "The wash and Cure machine features a large Tupperware style tub with a drop in metal cage and an agitator at the bottom.",
    "Over the month or so of testing, I found that dropping the whole plate into a water solution with detergent did a great job cleaning the prints up.",
    "If you can get hold of it, then Isopropyl Alcohol, about 5 litres, is an ideal solution. Recently the price of this has rocketed as people use it for hand sanitiser, but the price is coming back down, so expect to pay around £20 for 5l.",
    "Washing the prints in the Wash and Cure takes 2 minutes in Isopropyl and 10 minutes in water and detergent. The Isopropyl wash gains a far superior clean and finish.",
    "Once the print is washed, everything is removed from the wash and Cure and set aside while the washing tub is removed and the curing disc and mirror installed.",
    "The curing disc is essentially a platform where the print sits as it's subjected to direct UV rays.",
    "But, before the curing process, the prints need to be extracted from the build platform using the provided scraper. The extraction is a challenge first, but once you get the knack, the prints pop off with a bit of effort.",
    "Once the print is free, it's then placed onto the curing disc; yellow shield popped over the top, Cure selected on the front and the curing time. Curing times vary, but 2 minutes does most prints with a little more for larger prints. Once cured, the print should be set aside to finish hardening.",
    "The hardening process depends greatly on the environment.",
    "I've tested quite a few of these LCD SLA printers last year, and all have produced excellent results. However, they're not as straightforward as FFF printers, and you do need to invest time to ensure the best quality print and success rate.",
    "The Photon Mono X makes things as simple as possible, and after the first print success, I looked at printing a selection of my 3D models.",
    "Importing into the Photon Software was easy enough to navigate all the functions and features, density, position and punching holes for drainage etc.",
    "The only issue I found was with the supports, as the auto support feature was a bit random, and it took a few goes to even out the support amounts.",
    "Eventually, I found adjusting the settings and got the desired result; after this, the models started printing without issues.",
    "Checking over the models after they printed, and the quality is excellent. Lines and surfaces are smooth, and while you can see some small blips on the edges, these are small and easily removed.",
    "Overall the print quality is exceptional, and comparing a print from this against an FFF 3D Printer and the print quality difference is easy to see. Layer markings are far less defined, and you can print much more complex models.",
    "Printing out a series of test models and the quality was universally good.",
    "However, there are a few notes to the prints. Firstly supports are key to the success of your prints, so spending time ensuring that there are enough of them and that they're all in the right place is essential.",
    "While the applications auto supports are good, the settings need quite a bit of adjustment to get them right.",
    "When it comes to support removal, they're best removed after washing and before curing; the resin plastic is extremely hard once cured.",
    "Next, after each print has finished, I found it's essential that you scrape the vat base to check that it's free of hardened plastic residue.",
    "Probably the most important thing to do is to sieve the resin every three to four prints to take out the flecks of plastic that can form in the resin, it's a messy business, but once you've done it a few times, it is relatively quick and easy.",
    "It's also worth doing this if you leave the resin sat in the vat for more than 24hours. More than 48 hours in the open and I found the resin should be disposed of.",
    "The AnyCubic Mono X with the Wash and Cure is a phenomenal LCD-based 3D printing kit.",
    "While small print sizes limit other similar LCD-based SLA 3D printers, the Mono X brings print sizes that we're come to expect from FFF and higher-end SLA printers.",
    "There is little to fault when it comes to ease of set-up and use, and you can get up and running with your first print within an hour of opening the box.",
    "While, for the most part, it's plane sailing, there are a few quirks and a step learning process compared with FFF printing.",
    "Firstly, the build plate level is incredibly important; if you're just a little out, you won't succeed. Likewise, it's worth checking the resin for bits after each print, either by straining or using the scraper for fishing bits out. Again if there's any hard residue in the resin Vat, then the build plate will not lay flat, and your print won't work.",
    "Next, resin printing gets better with experience, and the more you use the software and learn the best way to apply supports, the more success you will have.",
    "Tilting models, adding rafts and supports is all required to gain the best results, but there's also an element of experimentation which for those new to resin printing, means that there's a steep learning curve.",
    "Ultimately, once you learn to work with the resin, keep things clean and work out a logical workflow, there's little that can go wrong.",
    "The result for the initial mess and experiments is more than worth it; the quality of the prints is exceptional, being as close to injection moulded as you can get from home.",
    "If you want to take the step from FFF to SLA, I would highly recommend the Photon Mono X."
  ],
  "headers": {
    "5": "Design",
    "11": "Features",
    "22": "Set-up overview",
    "27": "Wash and cure",
    "38": "Performance",
    "52": "Final verdict"
  },
  "links": {
    "3D printer": "https://www.techradar.com/best/best-3d-printers",
    "AnyCubic Photon Mono X": "https://anycubic.sjv.io/c/338476/1101384/14022?subId1=trd-us-6643332002592035000&sharedId=trd-us&u=https%3A%2F%2Fwww.anycubic.com%2Fcollections%2Fsales%2Fproducts%2Fphoton-mono-x-resin-printer"
  }
}