{
  "source": "https://www.techradar.com/reviews/pagofx-money-transfer",
  "title": "PagoFX money transfer review",
  "category": "computing",
  "updated": "2021-05-17T20:26:17Z",
  "author": "rob-clymo",
  "summary": "Move money with ease using the PagoFX transfer app",
  "verdict": "This Santander-backed money transfer app boasts some neat features for making quick and easy money transfers. It also benefits from bank-level security and appeals thanks to transparent pricing, all of which makes it a solid option for sending money overseas.",
  "pros": [
    "Quick and easy",
    "Competitive rates",
    "Business account available"
  ],
  "cons": [
    "Limited availability at present"
  ],
  "article": [
    "PagoFX is a relatively new money transfer app from this fintech startup, which has subsequently got the backing of Banco Santander, leading to its public unveiling in April of 2020. The aim of the package is to offer quick and easy transfer of funds, which in the first two months of its launch could be done without any fees at all due to the coronavirus pandemic.",
    "The good news is you don't need to be a customer of Santander in order to make use of PagoFX and while it is currently targeting users in the UK the plan is to roll out the package to countries across the European union in the not too distant future.",
    "Indeed, Belgium and Spain are two countries to join the list recently. Alongside its ease of use and low-cost transfers, PagoFX can be used via your smartphone, there’s bank-level security in place and solid customer support, all of which comes as part of the package.",
    "Using PagoFX is all about simplicity and its creators seem to have stuck to that way of thinking when it comes to the pricing. All you need to do, if you’re in the UK, is use a debit card to send your funds overseas and get the value of mid-market FX rates, along with a low transparent fee. When it was first launched PagoFX had fees waived, but that was more to do with the coronavirus pandemic than anything else.",
    "Currently, fees for transfers to the likes of the Eurozone, Norway or Sweden come in at 0.70% of the amount you send. Moving money to the US, on the other hand, attracts a fee of 0.80% of the total sent. There is a dedicated page on the PagoFX website that gives a complete breakdown of the costs associated with sending money to a raft of countries, and as with any transfer service, this is well worth investigating first, before you proceed.",
    "The PagoFX app was first unveiled during the coronavirus pandemic, which meant that anyone using it from the launch base of the UK could make transfers abroad for the first two months of operation without fees. Since then the app has been evolving and looks set to be made available to additional European countries this year, with plans afoot to add it to around 20 markets over the course of the next four years.",
    "Currently, users can make international payments in selected currencies from the UK to countries including the Eurozone, Poland, Switzerland, Norway, Denmark, Sweden, the Czech Republic and also the USA. Santander seems quite keen to push PagoFX to business users too, and has options to let the likes of SMEs register for a dedicated business account.",
    "You’ll need to enter and validate company information and go through some other security checks. Following completion of that you’ll be set up with a business account, which Santander claims ‘will allow small businesses to make international payments with confidence’. It’s not as though this can’t be done already using competitor products of course.",
    "Given that PagoFX is the product of a banking institution you can expect the app to perform as it should, with the added benefit of bank-level security ensuring that it’s both safe and secure to use. PagoFX is also authorized and regulated by the Financial Conduct Authority, or FCA in the UK, which regulates the services provided by financial firms. This means that you can be reassured that there is the backup of full protection in case any payments fail, or there is a problem with a specific transaction.",
    "Santander is obviously already well-versed when it comes to moving money around both within one country and internationally too. Therefore, its PagoFX package has been designed to work without hassle and it benefits from having a quick though comprehensive verification process. Better still, Santander has pledged to make sure every cost is shown upfront, plus there are no hidden fees either.",
    "The benefit of this is that you can make use of the service without having to worry whether or not you’re going to get stung with additional costs further through the transaction. We’re also keen on Santander’s ability to process real-time foreign exchange rates with ease too. The app, meanwhile, is perfectly serviceable and works in straightforward fashion.",
    "While PagoFX is, in essence, a money transfer app that has been developed by a team of fintech people, the obvious benefit of it being backed by Santander is that you get the beefier levels of support. Judging by the overall opinions shared by users the support seems to be consistently good and dependable too.",
    "On top of that, using PagoFX as a service, and getting to know how the app ticks, is all pretty straightforward so should require the minimum of help to get a transfer completed. Nevertheless, it's ways good to know that support is there should you need it.",
    "PagoFX could be seen by some as Santander’s chance to muscle in on the lucrative money transfer market, which increasingly has been dominated by fintech outfits. These businesses are lean and mean, and that can be good for a competitive market but not so great for older and larger financial institutions like Santander.",
    "This move, launching PagoFX as a dynamic and cost effective way for individuals and businesses users to move money easily, is sensible enough. The app, which is available for iOS and Android users does exactly what it says on the tin so there’s nothing to grumble about on that front. While the service is still limited in terms of where you can use it from there’s plenty of promise, although PagoFX is also up against plenty of stiff competition."
  ],
  "headers": {
    "3": "Pricing",
    "5": "Features",
    "8": "Performance",
    "9": "Ease of use",
    "11": "Support",
    "13": "Final verdict"
  },
  "links": {
    "PagoFX": "https://pagofx.com",
    "money transfer app": "https://www.techradar.com/best/best-money-transfer-apps",
    "debit card": "https://www.techradar.com/news/best-mobile-payment-app",
    "PagoFX website": "https://pagofx.com/support/calculating-costs/",
    "international payments": "https://www.techradar.com/best/best-money-transfer-apps",
    "SMEs": "https://www.techradar.com/news/why-smes-need-cyber-security-protection-just-as-much-as-enterprise",
    "bank-level security": "https://www.techradar.com/best/best-personal-finance-software",
    "foreign exchange": "https://www.techradar.com/best/best-money-transfer-apps"
  }
}