{
  "source": "https://www.techradar.com/reviews/razer-kaira-and-kaira-pro-for-xbox",
  "title": "Razer Kaira and Kaira Pro for Xbox review",
  "category": "gaming",
  "updated": "2021-03-31T17:20:58Z",
  "author": "nick-pino",
  "summary": "A Turtle Beach alternative with RGB lighting and a great microphone",
  "verdict": "The Razer Kaira and Kaira Pro are solid, mid-range headsets custom-built for the Xbox Series X and Xbox One. They offer a powerful (and detachable) noise-cancelling microphone and colorful RGB lighting, but their plastic construction and so-so audio performance prevent them from overtaking the new Xbox Wireless Headset as our favorite Xbox Series X headset.",
  "pros": [
    "Super comfortable",
    "RGB lighting",
    "Great microphone"
  ],
  "cons": [
    "Plastic construction",
    "Can’t run them wired",
    "Limited range"
  ],
  "article": [
    "Razer might be known as one of the premier PC peripheral manufacturers, but the company’s not afraid to dabble in console accessories, too. Just take a look at the new Razer Kaira and Razer Kaira Pro Gaming Headsets for Xbox. With built-in Xbox Wireless support, the headsets work natively with the whole suite of Xbox consoles – from Xbox One to the new Xbox Series X – adding one more headset to gamers’ arsenals.",
    "Despite what their names might suggest, the only difference between the Razer Kaira Pro and the regular Kaira is that the former supports Bluetooth 5.0 while the latter does not. That means the Kaira Pro can connect to PC, Macs and mobile phones over Bluetooth, but both require a separate dongle to connect to the Razer Headset Setup for Xbox app on PC for full customization options.",
    "Thankfully, the headsets have an exceptional detachable microphone that sounds great and the side RGB lighting definitely has a strong visual appeal. Plus, thanks to their foam earpads, they’re also pretty comfortable as well.",
    "Otherwise, however, there’s nothing really special about them: their 50mm drivers sound fine, but not amazing; the construction is lightweight but also mostly plastic. Those aren’t exactly deal-breakers – and even help to make the Razer Kaira a decent alternative to rival headsets from Turtle Beach – but they prevent the Kaira and Kaira Pro from winning top accolades and a spot on our list of the best Xbox Series X headsets.",
    "Razer released both the Kaira and Kaira Pro in November 2020, right around the same time as the launch of the Xbox Series X and Xbox Series S consoles.",
    "In terms of price, you’re looking at $99 (£99, AU$169) for the Razer Kaira that only supports the Xbox Wireless connection and $149 (£149, AU$259) for the Razer Kaira Pro that supports both the Xbox Wireless connection and Bluetooth.",
    "While that’s a great price for a wireless headset, it puts the Razer Kaira squarely up against the new Xbox Wireless Headset from Microsoft, which we absolutely loved for its stellar audio reproduction capabilities. The Razer Kaira Pro feels a decent value as well, but we feel that other headsets like the Steelseries Arctis 9X offers more for just a little more money.",
    "The Razer Kaira is pretty sleek… for a gaming headset. With a black and green color scheme and RGB lighting on the sides of the earcups, it’s definitely got that gamer aesthetic – so much so that you wouldn’t want to wear it anywhere else outside of your house – but it’s not an awful look by any stretch of the imagination.",
    "In terms of construction, the Razer Kaira is mostly plastic with the exception of a thin metal band that runs through the bridge of the headset. What that means is that the bridge is fairly sturdy, but the joints themselves are plastic and are more likely to be prone to snapping. That’s not exactly what you want to hear when you’re buying a $149 headset, but that’s what Razer went with here.",
    "The good news is that, because it’s mostly plastic, it’s a fairly light headset at only 293g for the regular Kaira and 330g for the Razer Kaira Pro. That lightweight design, alongside the memory foam padding and cloth earpad coverings, really makes the headsets soft and comfortable to wear for an extended period of time.",
    "Speaking of the earcups, each one comes with its own set of controls. On the left you’ve got a mic mute switch, volume wheel and power button; on the right you’ve got the Xbox pairing button, chat/game volume balancer and the Bluetooth pairing button (exclusive to Kaira Pro).",
    "The only port on the headset is for a USB-C charging cable that you can also use to connect the headset to your PC for firmware updates – but that’s it. There’s no 3.5mm audio jack on either headset, which means you can’t run them wired.",
    "Last but not least, there’s the detachable, ambient noise-reducing microphone that makes you sound great. To detach, all you need to do is pull on it, and then you can reattach at any time by simply plugging it back in.",
    "In terms of tonal balance and overall audio quality, the Razer Kaira and Kaira Pro lie somewhere in the middle of the spectrum. To wit, the headset doesn’t focus much on treble or bass and instead homes in on the mids to make dialogue come through crystal clear. The result is a headset that sounds fine, but not dynamic, spacious or full of detail.",
    "We played a few different games with the Kaira Pro including Star Wars Jedi: Fallen Order from Xbox Game Pass and competitive shooter staple, Overwatch. In both cases we were able to hear some nice details in the ambient sounds and a few positional audio cues, but everything lacked a level of precision we’ve heard on other headsets.",
    "For music and movies, the Kaira and Kaira Pro are good but not great. You’ll notice that focus on the midrange that you’ll hear when paired with consoles and even a little bit of bass response, but it’s lacking details you’d hear with a pair of proper over-ear headphones.",
    "The good news is that, while their audio reproduction skills aren’t great, they do make you sound great to others thanks to Razer’s HyperClear Cardioid microphone. The mic does an exceptional job picking up your voice and radically reduces the amount of ambient noise that comes through on the other end. To put it to the test we called someone with music playing in the background. The person on the other end, surprisingly said they couldn’t hear anything besides our voice coming through the mic.",
    "While the microphone was a particular highlight, the Kaira’s battery life is just so-so. Razer says the Kaira can get up to 20 hours of playback if you turn off the RGB lighting – something you’ll need the Razer Headset Setup for Xbox app to do – you’ll most likely get around 15 hours or less. Worse, because there’s no real battery indicator over Bluetooth, you can’t see how much battery the headset is down to until you start hearing low-battery warning beeps.",
    "Speaking of beeps, if you connect the headset to both your console and a Bluetooth device, it’s possible that you’ll hear them beep incessantly. Despite being charged and connected over Bluetooth, the Razer Kaira Pro would give us a warning beep every minute or so to tell us that something wasn’t right when paired to both devices. As it turns out, because our Xbox was in the living room and the PC was in the office, the headset beeps to let you know that you’re nearly out of range – which, apparently, is only about 20 feet or so.",
    "This is a common problem with other Razer devices, according to the Razer Forums, and has even been noted in other reviews. Of course, not everyone is going to be affected by this problem – as long as you keep whatever Bluetooth device you have connected close to the Xbox and the headset you should be fine – but it’s an annoying caveat."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "7": "Design",
    "13": "Performance",
    "20": "Don’t buy them if…"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "best Xbox Series X headsets": "https://www.techradar.com/news/best-xbox-series-x-headsets-the-top-xbox-series-x-gaming-headsets",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Wireless Headset": "https://www.techradar.com/reviews/xbox-wireless-headset-review",
    "Steelseries Arctis 9X": "https://www.techradar.com/reviews/steelseries-arctis-9x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Razer Forums": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-2861113335039849000&sharedId=trd-us&u=https%3A%2F%2Finsider.razer.com%2Findex.php%3Ftags%2Fbeeping%2F"
  }
}