{
  "source": "https://www.techradar.com/reviews/oneplus-nord-2-review",
  "title": "OnePlus Nord 2 review",
  "category": "phones",
  "updated": "2021-07-28T12:40:34Z",
  "author": "james-peckham",
  "summary": "The latest cheaper handset from OnePlus",
  "verdict": "The OnePlus Nord 2 is an exciting addition to the mid-range phone market, with some high-end specs and a great experience so far. Whether this will be the best phone at this price point remains to be seen, but so far it seems like a top choice.",
  "pros": [
    "Strong performance",
    "Fantastic fast charging",
    "A good camera experience"
  ],
  "cons": [
    "Only 90Hz screen",
    "Lacklustre design",
    "No IP rating"
  ],
  "article": [
    "Historically, OnePlus has been about making high-end phones for a lower price than the competition. The same can’t be said for the latest OnePlus 9 series, but the OnePlus Nord 2 is taking on that mantle.",
    "The mid-range phone market is an extremely competitive space, with great options from the Google Pixel 4a to the Samsung Galaxy A52 5G, but the OnePlus Nord 2 features specs that allow it to hold its own in that space.",
    "In fact, the OnePlus Nord 2 is one of the very best phones in this segment of the market. It features some impressive specs including a 50MP main rear camera, 65W fast-charging and a 6.43-inch 1080 x 2400 display with a 90Hz refresh rate.",
    "That screen offers a good experience, although some will be disappointed that the company hasn’t stretched to a 120Hz refresh rate here. That said, it offers good picture quality at a suitable size for many people.",
    "One odd quirk is that the company has moved to a MediaTek chipset for the very first time, but it was seemingly the right decision, as we’ve found it offered improved performance when compared to the original OnePlus Nord.",
    "The other highlight of the OnePlus Nord 2 is strong battery life, as we found it would always last a full day of usage even when we were pushing the phone to its limits. If you find it doesn’t, there’s also 65W fast charging that sees your phone go from 0% to full in just 30 minutes.",
    "The OnePlus Nord 2 doesn’t have any game-changing features, but as a total package it offers a top experience that many will enjoy considering its lower price than a lot of other phones right now.",
    "So if you’re looking for a cheaper alternative to a flagship, you should consider the OnePlus Nord 2 alongside the tough competition (such as those phones mentioned above) and note that it has a great camera experience, strong battery life and more going for it.",
    "The OnePlus Nord 2 isn’t available everywhere you can buy OnePlus phones, as it’s mostly restricted to Europe (including the UK) and India. If you live in the US or Australia, you won’t be able to buy this phone.",
    "It is on sale in the UK now from a variety of retailers, including John Lewis, Amazon, Three and O2.",
    "In the UK, the OnePlus Nord 2 costs £399 (about $550, AU$750) with 8GB of RAM and 128GB of storage. If you want 12GB of RAM and 256GB of storage you’ll find the price increases to £469 (about $650, AU$875).",
    "The OnePlus Nord 2 isn’t a big departure from the brand’s first mid-range phone (the original OnePlus Nord), but the design has changed in a couple of ways. This is still a solidly built smartphone, although some may find the design a touch lacklustre.",
    "The rear of the handset is made of glass, and it feels smooth under your finger. The camera elements jut out slightly from the rear of the phone, but that’s a trend you’ll find on most modern smartphones.",
    "The rear of the device is protected by Gorilla Glass 5 while a new camera module design, inspired by the OnePlus 9, sits on the top left.",
    "The OnePlus Nord 2 doesn’t feel particularly big, and it sits in your hand well. It weighs 189 grams, and it’s 8.2mm thick.",
    "The left edge features the volume rocker, and the opposite edge is home to the silence switch (a feature unique to OnePlus phones in the Android space) and the power button. That silence switch allows you to cycle through either a silent mode, a vibrate mode or having your phone on full volume. The bottom edge of the phone features the USB-C port as well as a speaker and the SIM card tray.",
    "It isn’t waterproof - there’s no IP rating here - so we wouldn’t recommend submerging this handset in water.",
    "The phone is available in Gray Sierra, Blue Haze and Green Wood as its three shades. Not all regions will get all three shades though, with Green Wood sadly only designed to be available in India.",
    "We’ve pictured the Blue Haze version of the phone throughout this review. OnePlus has a unique shade with Blue Haze, and while not everyone will like it, between the three available options there should be something suited to most people.",
    "The OnePlus Nord 2 features a 6.43-inch 1080 x 2400 resolution AMOLED display with around 409 pixels per inch and a 90Hz refresh rate. That means the image will be smoother than some other phones around this price, but it won’t be as slick as the screen you’d find on the OnePlus 9 Pro or some other top android phones.",
    "That may be a touch frustrating for anyone moving from a 120Hz phone, but that’s a rare scenario. It’s likely your current handset has a 60Hz screen, and in that case you’ll notice this bump in refresh rate even though it won’t be the absolute top experience.",
    "Otherwise, the display on the OnePlus Nord 2 is a great experience, and it includes a good in-screen fingerprint scanner. We found this to work quickly, and this isn’t always a feature you’ll find on phones at this price point.",
    "The device sports slim bezels on the sides and a thicker bezel on the top and the bottom. On the top left, you also get the camera cutout which blends nicely, and you will hardly notice it once you start using the device. The viewing angles are good, but the outdoor readability is just average.",
    "The AMOLED screen is flat, and it’s very similar to the one we’ve seen on the original Nord. But, OnePlus has worked on MediaTek’s open resource architecture (DORA) and it has added some AI-centric features like AI Resolution Boost, and AI Color Boost, which brings up more vibrant colors.",
    "This works well and you can see the difference while playing videos. OnePlus says that AI Color Boost is compatible with YouTube, MX Player, and VLC, while the AI Resolution Boost is compatible with YouTube, Snapchat, and Instagram.",
    "The OnePlus Nord 2 also supports HDR playback and additionally supports HD streaming on apps like Amazon Prime Video and Netflix.",
    "The rear of the OnePlus Nord 2 features three camera elements, with the main focus being the 50MP Sony IMX766 primary sensor with an aperture of f/1.88 and optical image stabilization (OIS).",
    "The same sensor is also seen on the OnePlus 9 Pro’s ultra-wide camera. This is followed by an 8MP ultra-wide lens (f/2.25), and a 2MP mono lens (f/2.4). For selfies, the Nord 2 sports a 32MP single-lens camera, which might seem like a downgrade from the dual selfie cameras on the Nord, but OnePlus has used a better sensor here 一 the Sony IMX615, which is quite impressive.",
    "The OnePlus Nord 2 has a very capable main camera that not only shines in the daylight, but offers excellent performance in low-light with night mode as well. The main camera can shoot images without much noise and produces excellent colors.",
    "The saturation level, dynamic range, and white balance are all on point. The HDR mode does a great job as well here and we’d urge you to take images with HDR on so that all images are eye-popping and of course, social media-worthy.",
    "The Nord 2 uses AI technology to recognize 22 different scenes automatically such as food, indoor or animals, and adjusts the color and contrast level to suit. You also get AI video enhancement for video recording, which improves color and contrast in recordings.",
    "While the Nord 2’s daylight performance is very good, it takes a huge leap when it comes to low-light scenarios. With night mode features turned on, the Nord 2 captures excellent images without losing much detail, and retaining colors and highlights.",
    "While the images still bring a bit of noise, this is by far the best low light performance we’ve seen around this price. Overall, the night mode is worth checking out if you are getting the device. It is also worth mentioning that the night mode takes about five seconds to capture the photo, but the wait is worth it as you can see from the images in this review.",
    "Not only that, but the phone also captures surprisingly good images with 2x and 5x digital zoom 一 while it misses out on a macro sensor, the 5x zoom did help capture some decent close-ups.",
    "The 8MP ultra-wide-angle camera brings a broader view and it does a good job during the daytime but struggles with details and color at night. Lastly, the 2MP mono lens can take black and white pictures which are best served in the day 一 but, we don’t see you using this feature very often.",
    "Selfies are handled by a 32MP Sony IMX615 - that’s the biggest front camera sensor on any OnePlus phone yet - and we found the results to be satisfactory. You can also choose how much bokeh you need with a slider.",
    "Lastly, in terms of video shooting, the OnePlus Nord 2 can go up to 4K at 30fps, though the chipset is capable of handling 4K at 60fps. In terms of quality, the phone did perform well and the OIS made the whole process smooth and enjoyable.",
    "In a nutshell, the OnePlus Nord 2 has a great set of cameras that offer excellent all-around performance 一 day, night, selfies, and videos. If you’re looking for a versatile shooter, this could be it.",
    "For the first time in the company’s history, the OnePlus Nord 2 doesn’t feature a Qualcomm processor. Instead, OnePlus has opted for the MediaTek Dimensity 1200-AI chipset, which is an exclusive to the brand.",
    "It may be an exclusive chipset, but it’s very similar to the Dimensity 1200 chipset that you’ll find in other phones from brands like Realme.",
    "If you’re wondering how the Dimensity 1200-AI is different from the Dimensity 1200, here is what OnePlus told us. MediaTek opened up the 5G AI platform (5G Open Resource Architecture/DORA) and OnePlus has worked on the DORA platform to improve the camera and display performance and add more features to the phone.",
    "In terms of day to day performance, the Nord 2 is a smooth operator. We did not face any issues with the performance of any apps while we were using the phone. The Dimensity 1200-AI is a capable chipset that works exceptionally well, and purely for CPU performance, the Nord 2 beats the Nord and the OnePlus Nord CE hands-down.",
    "This won’t perform as fast as a top-end phone, but it’s still suitable for every task you’ll likely want a smartphone to do. You may just sometimes be waiting for a couple more seconds for apps to load.",
    "We found that in Geekbench 5 the phone scored 2,808. That is notably higher than the Galaxy A52 5G’s 1,623 and the Google Pixel 4a 5G’s 1,565. It’s important to note here that OnePlus has recently confirmed it has been throttling certain apps on its recent smartphones - and that’s the case on the OnePlus Nord 2, too.",
    "It has since said it will soon offer an option to turn this off - expect that in Android 12 - but in the meantime you should be aware that some apps may offer better performance because of the throttling. OnePlus refers to this as “performance optimizations”, and it’s unlikely you’ll find this causes you any issues in day to day use but it’s worth being aware of it.",
    "You’ve got the option of 6GB, 8GB or 12GB of RAM in the OnePlus Nord 2. In the UK, you can only buy the top two variants, and you’ve got the choice of 128GB or 256GB of storage as well.",
    "There’s no microSD support here - OnePlus has never offered this in its smartphones - so if you’re expecting to need lots of space on your phone, we’d recommend opting for the 256GB model. The phone is also 5G-ready, so it’ll work with next-gen internet if you have a compatible contract.",
    "A few days before the launch of the OnePlus Nord 2, OnePlus in a forum post said that the company is working on integrating the codebases of its own OxygenOS with Oppo’s ColorOS, as part of a merger between the two companies. OnePlus also told us this is a change that you will likely not even notice since it’s happening behind the scenes - well, that’s not the case with the new OxygenOS 11.3 on the OnePlus Nord 2, but that’s not a bad thing.",
    "OxygenOS is still one of the best software experiences you can get on an Android. OxygenOS 11.3 feels like a mix of the OxygenOS we knew from previous OnePlus devices and some features from ColorOS.",
    "The merger should also mean faster updates - which is exactly what OnePlus needs right now as it is struggling to keep up with update timelines, thanks to its numerous phone launches. The majority of the user interface, fonts, animations and first-party apps remain the same as previous versions. However, the camera app is now Oppo’s. The settings app has been revamped too, but you’d notice this only if you look closely or compare it to other OnePlus devices.",
    "Some of the major changes are as follows: changes in personalization, privacy, display, storage, tools, battery settings and notification UI elements. But OnePlus has retained many of its own software features as well, like a FPS meter, do not disturb, heads-up notifications, mistouch prevention, graphics optimization, and the ability to prioritize signals to a game to reduce latency.",
    "The OnePlus launcher is also still one of the fastest and simplest launchers we’ve used.",
    "While some changes are noticeable, some are done under the hood, and overall we did like the new OxygenOS experience on the OnePlus Nord 2, and this is by far the most stable version of the software we’ve tested on a OnePlus device in a long time. We did not encounter any bugs, glitches, or sluggishness during the review period.",
    "OnePlus has also confirmed the OnePlus Nord 2 will get two major Android updates and three years of security updates. One of the main reasons for the merger with Oppo’s codebase is to provide faster software updates, and if OnePlus sticks to its promise and provides updates on time, that will make things more exciting for enthusiasts.",
    "Overall, the OxygenOS experience on the OnePlus Nord 2 feels a bit different, but largely the same as ever. With Android 12 coming soon, all the eligible OnePlus devices will be merged with the new codebase, which could also mean a more polished software experience.",
    "There’s a 4,500mAh battery inside the OnePlus Nord 2, and it’s highly likely that this will be enough to keep your phone running through a full day from a full charge. We’ve found the battery life on the OnePlus Nord 2 to be solid.",
    "Each day of usage has seen us have at least 15% left over at the end of a full day of usage. If you’re a particularly heavy user, you may stray over that edge but OnePlus has included a variety of top features to keep you charged up.",
    "In our testing, the phone was notably weaker in terms of battery life when using the handset at full brightness. We’d recommend sticking to the automatic brightness mode if you’re struggling with the battery.",
    "A big upgrade from OnePlus for this handset is the introduction of 65W fast charging, which we found to work fantastically well when you’re in a rush to pump up your phone as quickly as possible.",
    "If your phone is totally drained, you’ll find this will recharge your handset to full in just under 30 minutes. That is OnePlus’ claim, and we found that to be true in practice as well.",
    "There isn’t wireless charging on the OnePlus Nord 2, which may be a disappointment to some. But this isn’t a common feature at this price, so it’s unlikely you’ll find a smartphone at a similar cost that can do wireless charging.",
    "OnePlus is also including a charger in the box with the OnePlus Nord 2, which isn’t the case for all smartphone manufacturers anymore. This means you’ll be all set up to use the 65W charging right away.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "OnePlus Nord 2 release date and price",
    "11": "Design",
    "19": "Display",
    "26": "Camera",
    "38": "Specs and performance",
    "47": "Software",
    "55": "Battery life",
    "62": "Don’t buy it if…"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Samsung Galaxy A52 5G": "https://www.techradar.com/reviews/samsung-galaxy-a52-5g-review",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "OnePlus Nord CE": "https://www.techradar.com/reviews/oneplus-nord-ce-5g#performance",
    "since said it will soon": "https://www.techradar.com/news/oneplus-confirms-a-major-nord-2-and-oneplus-9-problem-will-finally-get-fixed",
    "Android 12": "https://www.techradar.com/news/android-12-news"
  }
}