{
  "source": "https://www.techradar.com/reviews/backblaze",
  "title": "Backblaze cloud backup review",
  "category": "computing",
  "updated": "2021-06-23T09:36:34Z",
  "author": "mark-pickavance",
  "summary": "Backblaze backs up as much data as you've got",
  "verdict": "Backblaze focuses on what it is best at, cloud backup. While the service misses at some things, it should certainly be near the top of your shortlist if you want a comprehensive, no-limits, secure backup of the data for your home or business computers.",
  "pros": [
    "Unlimited cloud backup",
    "No file size limits",
    "Straightforward operation",
    "Affordable pricing"
  ],
  "cons": [
    "One computer per licence",
    "Basic web interface",
    "No full disk image backup",
    "No support for network drives",
    "No support for file sync between computers"
  ],
  "article": [
    "Backblaze started in 2007 to backup a friend’s computer online. Fast forward to the present, and it is in 175 countries, in excess of 50 billion files backed up, encompassing over 1 exabyte (that's a million terabytes in case you were wondering) of data stored. In other words, it is a serious data player for cloud backup.",
    "BackBlaze also operates another service called B2, which it describes as an \"enterprise-grade, S3 compatible storage used to store and serve data while improving companies' cloud OpEx vs. Amazon S3 and others\"",
    "This is reassuring when signing up for Backblaze, which has a choice of paid-for packages for personal and business users. In other words, if you've got data that needs backing up, Backblaze will do it for you. A major advantage of this service is that it offers unlimited cloud backup, so your cloud locker can expand indefinitely as the amount of data you've got keeps on growing.",
    "Backblaze does not bother you with the details of your backup plan, just that it is occurring: when you initially install the desktop client, it doesn’t require you to select files and folders, but rather just grabs all the files and folders it considers important and starts transferring them to your Backblaze cloud backup.",
    "By default, Backblaze copies everything for an ISO, DMG (Mac disk image), a virtual drive, system files or executables. You have the option to exclude other file types if you wish, but unless exclusively told to ignore them, it will include all other file types. We find it very simple and straightforward, and you can rest easy that your entire computer can be recovered if needed.",
    "We consider it a set-it-and-forget-it solution: Backblaze is there to help you recover data such as if your hard drive catastrophically fails or your laptop fails to boot. However, realize that Backblaze is not for syncing files between computers, or getting at your music and video files in the cloud. You can include external hard drives and (on a business plan) servers in your backups, but networked drives can't be included.",
    "Backups can be continuous, once a day, or initiated manually. Some extra variety with those timescales would be nice, but we expect the majority of users will leave it set to continuous backup mode. It's worth noting that while you can backup an unlimited amount of data, you are restricted to one computer for each Backblaze account, and mobile devices aren't included.",
    "Backblaze will backup older versions of files and deleted files for 30-days. For an additional charge, this can be extended for up to 1 year.",
    "The Backblaze desktop client targets simplicity over power or flash. The options of the Backblaze package are limited, so the software doesn't have to do much except focus on the job at hand- to make sure that your files are getting continuously backed up in the background.",
    "There is an option to exclude certain files and folders from a Backblaze backup, but it could be more straightforward. Considering you get an unlimited amount of space in the cloud, it's easier to just let Backblaze backup everything, just in case. Transferring data from an entire computer to the web is potentially a lengthy process, but the speeds Backblaze managed were impressive. You can also choose to pause or throttle the upload process if you think Backblaze is taking up too much bandwidth to override the automatic throttling.",
    "Like the desktop client, the web interface is also cut down and minimal, letting you review backed up files and restore them if needed. There's also a mechanism for sharing stored files to others that are exclusive to the web interface. Unfortunately, in terms of web functionality, Backblaze falls short of Dropbox, Google Drive or iCloud when it comes to sharing files.",
    "In the advent of a system failure or loss, files can be downloaded for free, or Backblaze will put them on a 256 GB Flash drive ($99) or physical USB 8 TB hard drive ($189) for an extra fee and FedEx them to you. While it may not do much beyond suck up all the files on a computer and let you restore them, Backblaze does these core jobs very well.",
    "Backblaze gets high marks from a security perspective: not only can you enable two-step authentication on your account, but you can also rely on AES 128-bit encryption and an SSL connection to avoid your data being intercepted as it travels through the internet. While it's not full end-to-end encryption, it's certainly safe enough for most users.",
    "There is also the option to set up a private encryption key, known only to you, which adds an extra layer of protection to your data, for those worried about Backblaze staff prying into their affairs. The downside of this is that Backblaze can’t help you if you forget the key, and you need to share it with Backblaze if you ever need to restore your data.",
    "You can try Backblaze for free for 15 days without giving up any credit card information, but there's no free tier (as you would expect as you're getting unlimited cloud backup). Personal plans cost from $6 a month, though you can sign up for a year for $60 (the equivalent of $5 a month) or for two years for $110 ($4.58 a month). To enable access to deleted and old file versions to be kept for an entire year is an additional $2 monthly charge.",
    "Business customers get the same pricing, although you can contact Backblaze directly for different quotes for backing up multiple computers and servers, and on putting more of your data in the cloud for long-term storage (to replace tape backups). It's refreshing to see this sort of flexible pricing, but it does make it more difficult to compare Backblaze against competing services.",
    "Backblaze has a large user base, and even some fans, and it's easy to see why – if you want to back up everything from one computer and its external drives, simply and securely, without spending too much, then it's hard to beat. We appreciate that there are no limits on file sizes and no limits on the amount of data you can send to the cloud.",
    "Just be certain you know exactly what Backblaze is before you part with any cash: it's not for syncing files between computers or getting easy access to your files through a web browser. It's a comprehensive, set-it-and-forget it backup solution for protecting your data should the worst happen, and at that task it provides a great solution."
  ],
  "headers": {
    "3": "Backblaze features",
    "8": "Backblaze interface",
    "12": "Backblaze security",
    "14": "Backblaze pricing",
    "16": "Backblaze verdict"
  },
  "links": {
    "Backblaze": "https://xvtelink.com/go/backblaze?offer=3monthsfree&a_fid=744&data1=trd-us-1353303102214581500",
    "cloud backup": "https://www.techradar.com/news/the-best-cloud-storage",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "iCloud": "https://www.techradar.com/reviews/apple-icloud",
    "sharing files": "https://www.techradar.com/best/best-ways-to-transfer-files-online"
  }
}