{
  "source": "https://www.techradar.com/reviews/apple-airtag-review",
  "title": "Apple AirTag review",
  "category": "phones",
  "updated": "2021-05-05T14:07:12Z",
  "author": "carrie-ann-skinner",
  "summary": "Can Apple’s location tracker rival Tile?",
  "verdict": "The Apple AirTags are an invaluable and easy-to-use tool for reuniting you with your misplaced possessions. They’re simple to set up and use, and the Precision Finding feature can help you quickly locate misplaced items. Apple has paid plenty of attention to privacy to ensure the location trackers can’t be misused, too. However, there’s no denying that they’re a costly accessory, especially if you want to attach one to keys or bag straps.",
  "pros": [
    "Good for finding misplaced items",
    "Precision location with iPhone 11 and above",
    "Compact, lightweight and waterproof"
  ],
  "cons": [
    "Expensive if used with accessories",
    "Doesn’t work with Android",
    "AirTag can scuff easily"
  ],
  "article": [
    "Apple’s long-awaited location-tracking device, AirTag has finally been made official, and while it may be small, it’s likely to prove invaluable if you’re a serial loser of keys, wallets, and the like.",
    "As well as emitting an electronic beep when you can’t locate a tagged item, if an AirTag is paired with an iPhone 11 or above you can get accurate directions to the item using the Find My app. Called Precision Finding, the feature utilizes the iPhone’s accelerometer, camera, and gyroscope to provide on-screen directions, your current distance from the AirTag, and haptic feedback when you get close to locating it.",
    "Apple’s Find My device network can also be harnessed to help reunite you with an AirTag that you deem lost rather than misplaced: just put the AirTag into Lost mode, and if another device in the network passes by the AirTag, you’ll get an anonymous update on its location. You can also assign a phone number to a lost AirTag, so if it’s found by a member of the public they can tap it using their iPhone or any NFC-enabled device to display the phone number and get in touch with you.",
    "Apple has also put a lot of thought into privacy, and has put several measures in place to ensure that AirTags can’t be misused. This means you can’t activate an AirTag on behalf of someone else, and your iPhone, iPad or other iOS devices can identify if an unknown AirTag is travelling around with you, alerting you that the owner can see your location. On top of that, the AirTag will draw attention to itself by playing a sound if it’s been separated from its owner for a long period of time but still moves location.",
    "If someone borrows an item of yours to which an AirTag is attached, and they’re getting an unknown AirTag alert, they can choose to pause these alerts for a day, or indefinitely if the AirTag is registered to an Apple ID that’s a member of your family sharing group.",
    "The disc-shaped tracker can be slipped into a wallet or bag, but if you want to attach it to keys or other items you’ll have to purchase an optional key fob or loop that it slots into; however, these will set you back the same price, and in some cases more, than the AirTag itself, meaning an AirTag certainly isn’t the most affordable location tracker on the market. And, like many Apple products, it only works with iOS devices.",
    "However, if you’re regularly forgetting where you left your keys or wallet, or just want the peace of mind that you could quickly find a misplaced item, then an AirTag will be a sensible purchase.",
    "A single Apple AirTag costs $29 / £29 / AU$45; you can also purchase a pack of four for $99 / £99 / AU$149. AirTags can be pre-ordered now, and will go on sale on April 30.",
    "As mentioned, if you want to attach an AirTag to keys, bikes or other items you’ll need to purchase an optional key fob or loop – these come in silicone or leather, with prices starting from $29 / £29 / AU$45.",
    "Third-party brand Belkin makes a couple of officially licensed AirTag holders that are available alongside Apple’s own accessories at the Apple and which cost a bit less, and we expect to soon see more third-party accessories appearing on Amazon and elsewhere.",
    "At about the size of a quarter or a £2 coin, the AirTag is extremely compact – it measures 1.26 x 1.26 x 0.31 inches / 3.19 x 3.19 x 0.8cm and weighs just 0.4oz / 11g. The stainless steel disc has a removable plastic cover, which secures the CR2032 battery that powers the AirTag, and a built-in speaker, which will emit a sound if the Find My app on an iPhone, iPad or Mac is used to identify its location.",
    "There’s no clip or tag on the AirTag as standard, but it can be slipped into a bag, wallet or coat pocket. If you want to attach it to keys or other items, optional key fobs and loops in leather and silicone can be purchased from Apple, or from third-party brands like Belkin.",
    "The AirTag has an IP67 rating, so it’ll survive an accidental dunk in a deep puddle or the bath, and it’s also eligible for Apple’s free engraving service, so you can add text, numbers and emojis to the smooth plastic cover, making it easier to identify which AirTag is which if you have several of them. However, we found that over just a few days of use both sides of the AirTag have become scuffed as we’ve used it.",
    "Apple hasn’t specified the Bluetooth range of AirTags, but we believe that it supports Bluetooth 5.0, which is the latest version of the technology, as that’s built into the iPhone 12, and it has a range of 800 feet / 240 meters.",
    "Like most iPhone accessories, the AirTag proved extremely simple to set up. Once we’d removed the packaging, the AirTag emitted a short beep, and was immediately recognized by our iPhone. We were able to assign a name to the AirTag, and it was assigned to our Apple ID, showing up in the Items tab. It was also very simple to slip the AirTag into the leather key fob and loop accessories, enabling us to attach them to our keys, and the strap of a bag.",
    "Tapping the AirTag from the items list in the Find My app brings up several options, including Play Sound. We found that it took a few seconds for Find My to connect to the AirTag and emit three cycles of five electronic beeps, which registered 64db on our sound meter – loud enough that we could hear it from beneath the pile of cushions under which we’d buried it on the sofa.",
    "The short cycle of electronic beeps lasts just seven seconds, which is long enough to locate something in the same room or the one next to it, but didn’t suffice when we were upstairs and our ‘misplaced’ item was downstairs. In this instance, we had to tap the Play Sound option four times before we were able to get close enough to the AirTag to hear it.",
    "This is where the Precision Finding feature can help. This uses Ultra Wideband radio technology to identify the distance and direction your iPhone is from the AirTag, and display this information on-screen and through haptic feedback to help you locate the AirTag.",
    "On the whole, we found that the on-screen distance, which is displayed in feet or meters, and the directions, did make it faster to find our (deliberately hidden) AirTag. However, our tests were conducted in a home with cavity walls, which often affects the reliability of Bluetooth connections between devices such as headphones and smartphones, and we found this to be the case with the Precision Finding feature, too.",
    "For example, when we left the AirTag in the garden and moved inside, our iPhone 12 initially failed to establish a connection with the AirTag and asked us to move to a different location. As we moved closer, it managed to connect to the AirTag but the Signal was weak. It eventually connected to the AirTag when it was 21ft / 6 meters away.",
    "When we placed the AirTag in our front garden and walked across the street until we were 30ft / 9 meters away, our iPhone formed a connection with the AirTag almost instantly and was able to guide us to it, without losing signal.",
    "As we’ve already mentioned, if you’re out of Bluetooth range of the AirTag, Apple’s Find My device network can help identify the location of your Key Finder. We found when we left the AirTag in a busy town center and returned home, making it as lost, it took just 30 minutes for a passing iPhone to update us on the AirTag’s location.",
    "We were also able to ask Siri to find an AirTag, which started the cycle of short electronic beeps, but to use Precision Finding, Siri prompted us to open the Find My app.",
    "Apple’s AirTag is powered by a CR2032 battery, and Apple says it will last more than a year before it needs replacing – that’s based on causing the tracker to emit a sound four times a day, and one instance of using Precision Finding per day.",
    "We can’t yet test these claims of course, and there’s no battery level indicator, so we weren’t able to gauge just how much our heavy testing depleted the battery.",
    "The battery is easy to replace: you hold the AirTag with the colored side down, place two fingers on the metal side and twist to the right to pop off the metal cover, exposing the battery.",
    "First reviewed: April 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Apple AirTag price and availability",
    "10": "Design",
    "14": "Performance",
    "23": "Battery life",
    "26": "Don't buy it if..."
  },
  "links": {
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review"
  }
}