{
  "source": "https://www.techradar.com/reviews/arlo-pro-4",
  "title": "Arlo Pro 4 review",
  "category": "smart-home",
  "updated": "2021-07-28T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Arlo’s first 2K camera that doesn’t require a hub",
  "verdict": "The Arlo Pro 4 offers detailed color footage during the day and at night thanks to its built-in spotlight. The weatherproof camera works battery-powered or wired in, and offers plenty of AI-based features that can identify the cause of a motion alert, even tracking the subject so they’re always in shot. Unlike its predecessors, the Arlo Pro 4 can connect directly to your Wi-Fi rather than requiring a SmartHub, but this means you lose out on local storage and HomeKit support.",
  "pros": [
    "Good image quality",
    "No hub required",
    "Integration with Alexa and Google Assistant"
  ],
  "cons": [
    "Expensive",
    "No free video storage",
    "HomeKit support only with hub"
  ],
  "article": [
    "Arlo was one of the first brands to enter the home security camera market in 2014, and since then it has launched a number of Wi-Fi-connected security cameras year after year, leading to an extensive range. In fact, many of its models are among the best home security cameras you can buy right now.",
    "With each iteration, Arlo has offered improvements to the resolution and added handy features that reduce unwanted alerts, making each camera feel like a real step-up on the previous model, and ensures they feature in our best home security cameras round-up. However, with its most recent launch, the Arlo Pro 4, this isn’t the case. On paper, the Arlo Pro 4 appears to be an incremental update, since many of its features – such as the resolution and the AI-powered features – are already present on the Arlo Pro 3.",
    "There is one change, though, which is significant: the Arlo Pro 4 camera can connect directly to your home Wi-Fi network, just like Arlo’s Essential range of more affordable home security cameras. As a result, there’s no need for a SmartHub, which makes the camera more affordable at $199.99 / £220 / AU$295.",
    "The Arlo Pro 4 records 2K resolution color footage during the day and at night, thanks to the built-in spotlight. Offering a 160-degree field of vision, if the camera detects motion, it will push out an alert to your smartphone, so you can view the camera’s feed in real-time. It also stores the video clips in a secure area online (providing you’ve subscribed to an Arlo Smart plan), and these clips can be reviewed at any time for 30 days after being recorded.",
    "The Arlo Pro 4 comes with a three-month free trial to Arlo Smart, but the lack of SmartHub means there’s no local storage option. So, if you want to view videos after they’ve been stored, you’ll need to continue with the Arlo Smart subscription, which will set you back $2.99 / £2.49 / AU$4.49 per month.",
    "Arlo Smart offers more than just online storage for video clips, however. It also provides a number of AI-based features designed to reduce unwanted alerts – such as being able to identify whether motion was down to a person, animal, vehicle, or some other source, and the ability to create zones so notifications are pushed only when activity is detected in these areas.",
    "Just like other Arlo home security cameras, the Pro 4 is weatherproof and can be powered via the mains or a rechargeable battery, which Arlo claims will last up to six months before it requires charging. The camera is also compatible with Alexa and Google Assistant, although for HomeKit support, it will need to be connected to a SmartHub, which costs $99.99 / £179.99 / AU$290.",
    "While the camera is more affordable than other Arlo Pro and Arlo Ultra models, it’s an expensive home security camera compared to the rest of the market. That said, if you’re looking for a camera that can record detailed footage without the need for a base station, or you’d like to upgrade from an Arlo Pro 2 or earlier model – which only records video in Full HD – then it's worth the investment.",
    "Prices for the Arlo Pro 4 start at $199.99 / £220 / AU$295 for a one-camera kit, which is available worldwide through Arlo’s website and other online retailers including Amazon.",
    "In the US and Australia, a two-camera kit priced at $379.99 / AU$558 (around £275) is also available, while a three-camera kit is available in the US and UK for $549.99 / £569.99 (around AU$750). Australia is the only territory that has the option of a four-camera kit, which comes in at $1,038 (around $770 / £560)",
    "As mentioned, the Arlo Pro 4 offers a three-month free trial of Arlo Smart, which enables you to securely store videos captured by the camera online and access features that help to reduce unwanted alerts. Once the trial expires, continuing the subscription will set you back from $2.99 / £2.49 / AU$4.49 per month, depending on the number of cameras you have.",
    "The Arlo Pro 4 looks identical to the Arlo Pro 3 and Arlo’s other home security cameras, comprising a glossy white plastic body that can be removed in one piece, and a black front that houses the 160-degree camera lens and an LED spotlight. The button on the bottom of the Arlo Pro 4, which sits next to the connector pins for a magnetic charging cable (for hardwiring the camera), allows you to remove the casing to reveal the rechargeable battery. At 3.5 x 2 x 3 inches / 8.9 x 5.2 x 7.8cm (h x w x d), it's a relatively compact home security camera.",
    "A weatherproof unit, the Arlo Pro 3 comes with a magnetic stand that can be mounted to a wall, or it can be used free-standing. However, since the camera can be easily detached from this mount, an optional screw mount is provided on the back of the camera. Note that this type of mount isn’t included in the box; it’s an optional extra and will set you back $19.99 / £12.99 / AU$39.",
    "As mentioned, the Arlo Pro 4 connects directly to your Wi-Fi network, doing away with the need for a SmartHub. In fact, we found the Arlo Pro 4 super-easy to set up. We simply followed the step-by-step instructions in the Arlo, which included entering the Wi-Fi password, scanning a QR code displayed in the app, and updating the firmware for the camera.",
    "On test, we found the footage recorded by the Arlo Pro 4 to be clear and detailed, while the 12x zoom allowed us to focus in and check small details in the video. The footage was recorded in color both during the day and at night, provided we set the spotlight to trigger when motion was detected in low-light conditions.",
    "While the 160-degree field of view created a slight fisheye effect on the video, we found it didn’t detract in terms of clarity, plus the addition of HDR support meant we were able to see minute details even when the sun was shining brightly, or dark shadows were being cast.",
    "We were able to set the camera to automatically zoom in when it detected motion, and track the source of the activity. However, we found that when using this feature, the footage wasn’t as clear as usual due to the fact the image had been zoomed.",
    "On test, the Arlo Pro 4’s ability to identify whether a person, animal, vehicle or other source was the origin of a motion alert was extremely effective. There were two instances where washing hanging on the line was mistaken for a person, but on enabling motion zones in the camera’s field of view (another option offered through Arlo Smart), this was no longer an issue.",
    "The built-in spotlight and siren can both be triggered automatically when motion is detected, as well as being controlled manually. The two-way talk function proved useful, allowing you to converse with anyone in the camera’s field of view; it was clear and without distortion, even when the weather was windy, thanks to built-in noise cancellation.",
    "The Arlo app has a simple interface that's clear and easy to navigate. On opening, you’ll see a list of the Arlo security cameras installed in your home, with a snapshot of the most recently recorded motion next to each one.",
    "From here, you can quickly adjust settings for each camera, including the speaker and microphone volume, triggering the siren or the spotlight, and even setting up geofencing (shared via your smartphone), so that the camera will turn on or off based on your location.",
    "The Library tab offers up past footage in chronological order, while the Mode tab allows you to control how a camera behaves when you're home or away. You can pair the camera with Amazon Alexa, Google Assistant or Apple HomeKit – although, as we’ve already mentioned, the latter requires connection to a SmartHub. This ensures you can view footage from the camera on your TV, or on a compatible smart display, as well as use the camera in some home automations.",
    "As mentioned, you’ll need an Arlo Smart subscription for video storage and smart features such as object detection. The camera comes with a three-month free trial, after which costs are from $2.99 / £2.49 / AU$4.49 per month. This is similar to security camera plans from the likes of Ring and Google.",
    "Arlo claims the battery in the Arlo Pro 4 will last between three and six months. We can’t confirm how quickly ‘typical use’ drains the battery because we’ve put the camera through heavy testing in a short period of time for this review. However, the battery life you get is likely to depend on a number of factors, including how often motion is detected, how many times Live View is activated, whether the spotlight or siren are triggered, and the number of times the two-way microphone and speaker are used.",
    "The Arlo Pro 4’s batteries are swappable, so rather than having the camera out of action while a unit is charging, you could purchase a second battery with which to replace it. We found that it took around three and a half hours to recharge the battery using the bundled USB cable and power adapter.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Arlo Pro 4 price and availability",
    "11": "Design",
    "14": "Performance",
    "19": "App",
    "23": "Battery life",
    "25": "Don't buy it if..."
  },
  "links": {
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Arlo Pro 3": "https://www.techradar.com/reviews/arlo-pro-3",
    "Arlo Pro 2": "https://www.techradar.com/reviews/netgear-arlo-pro-2"
  }
}