{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-6",
  "title": "Xiaomi Mi Smart Band 6 review",
  "category": "fitness",
  "updated": "2021-08-26T09:01:51Z",
  "author": "cat-ellis",
  "summary": "Impressive health and wellbeing features, but falls down when it comes to workouts",
  "verdict": "If you're in the market for a cheap fitness tracker, the Xiaomi Mi Smart Band 6 is well worth adding to your shortlist. It might look unassuming at first glance, but it boasts some impressive features you'd expect to find in a much more expensive device (such as all-day stress tracking and a pulse oximeter), and its screen is exceptionally bright, vivid and responsive. When it comes to workouts, we found its connected GPS disappointing, and the band wasn't always particularly comfortable, but for casual use it's a great alternative to a Fitbit that offers a lot more than you might expect.",
  "pros": [
    "Lightweight",
    "Affordable",
    "Excellent display"
  ],
  "cons": [
    "No on-board GPS",
    "Workout data inaccuracies",
    "Uninspiring design"
  ],
  "article": [
    "The Xiaomi Mi Smart Band 6 (also known as the Mi Band 6) is a neat little fitness tracker that looks unassuming at first glance, but makes up for that with an impressive bevy of tools for monitoring your health and fitness.",
    "Its design is almost identical to that of the Xiaomi Mi Smart Band 5 released last year, with the notable exception of the display, which is now even brighter and clearer, making your daily stats easy to check at a glance.",
    "On the features front, there's an overall emphasis on general wellbeing rather than simply workouts, with all-day stress monitoring (plus breathing exercises if things are starting to get on top of you), a pulse ox sensor with the ability to perform spot checks, and period tracking all available with a tap and a swipe.",
    "There are dozens of workout modes to choose from (both indoors and out), and heart rate tracking proved impressive in our tests.",
    "Unfortunately, there are some downsides. The fact that there's no on-board GPS is no surprise at this price point, but the connected tracking proved inaccurate during our test runs, tacking 500m onto the distance of a pre-measured 5K jaunt. It's also not the most comfortable device for long-distance runs, as the band is tricky to fasten tight enough to prevent small, distracting movements.",
    "These quibbles won't be an issue for more causal users though, and if you're looking for an affordable Fitbit alternative that offers more than simple step-tracking, the Mi Smart Band 6 could be just the ticket.",
    "The Xiaomi Mi Smart Band 6 was released in Europe on March 2021, and costs €49.99 (approximately $60 / £40 / AU$80), and will be released in India on August 30 2021 for Rs 3,499. It's available to buy direct from Xiaomi, and from approved retailers. In India, it will be available from Amazon.",
    "That makes it one of the cheapest fitness trackers from a major brand, and means you're getting a lot of features for your money.",
    "As you’d expect at this price point, the Mi Smart Band 6 is a no-frills fitness tracker, with a slim silicone band and long, narrow. In fact, it’s almost identical to its predecessor, with the exception of its brighter, crisper screen. The case is fractionally longer (47mm rather than 46mm), but the two are practically indistinguishable.",
    "It’s available in six colors (black, orange, yellow, olive, ivory and blue), and if you’re fond of your Smart Band 5, you’ll be pleased to learn that the similarities in design mean you can re-use your favorite strap with the new device.",
    "Unfortunately, we found it’s not the most comfortable device around. Despite the Mi Smart Band 6’s slender case and strap. The buckle’s pin-and-hole design makes it tricky to get a good, firm fit, which means it’s liable to move ever so slightly mid-workout.",
    "The touchscreen is responsive though, with a resolution of 152 x 486 pixels that makes text and icons super sharp and clear. It’s shaped like a running track (rectangular with round ends – a shape also known as a discorectangle or obround if you want to get technical), which is intended to maximize the usable space.",
    "There’s a variety of faces to choose from, many of which can be customized with shortcuts, such as a quick link to your preferred workout type so you can begin tracking with a tap.",
    "It has a water resistance rating of 5ATM, meaning it’s suitable for showering, swimming and snorkelling at depths up to 50m. Just make sure you remove it before taking part in any high-speed watersports.",
    "When it comes to everyday use, the Xiaomi Mi Smart Band 6 has some impressive features you’d expect to find in a much more expensive device. These include blood oxygen tracking (complete with spot-checks), stress monitoring (using changes in heart rate), sleep tracking, breathing exercises, and period tracking.",
    "There’s no on-board storage for music, which isn’t surprising for such a compact device, but you can use the Mi Smart Band 6 to control your phone’s media playback, saving you the trouble of digging it out of your pocket. Just make sure you give it the necessary permissions during setup.",
    "You'll receive smartphone notifications on your wrist (though there's limited room for lengthy texts), but unsurprisingly for a device this affordable, there's no ability to reply to texts or take calls. Nor can you issue voice commands; there's no Alexa or Google Assistant here and, more to the point, no microphone.",
    "Sleep monitoring worked well enough in our tests, closely aligning with those from a much more costly Polar device. The Mi Smart Band 6 doesn’t measure REM sleep, but it tracks deep and light sleep effectively enough to determine how many sleep cycles you experienced, and any waking periods during the night.",
    "It’s worth bearing in mind that features like sleep tracking and all-day stress monitoring take a toll on battery life, though. Xiaomi claims the watch can keep running for up to 14 days with normal use, but enabling the bells and whistles could trim that by around half. That’s still a respectable measure for a fitness tracker (most Fitbit devices only last 7-10 days between charges), but could be disappointing if you’re expecting longer.",
    "The watch features connected GPS (before you start a workout you’re warned that it won’t track unless there’s a connection to your phone), but in our tests it wasn’t particularly accurate. For example, although it appeared correctly drawn out in the app, our regular 5K route (as measured on a map) was recorded as over 500m longer than the true distance – a worrying large margin of error.",
    "This may have been an issue with our phone, but the watch’s pace measurement was off as well, occasionally failing to register variations.",
    "Auto-pause works well though, halting tracking after just a few seconds while you wait at pedestrian crossings, and workouts are ended and saved by holding an icon on the screen, so there’s no risk of you accidentally cancelling tracking mid-run.",
    "There were a few smaller annoyances. For example, the watch will buzz gently with each mile or kilometre, but also when you hit step goals or trigger a PAI alert, leading to notifications so regular, it’s impossible to know what they mean without glancing at the screen.",
    "PAI is a score that represents your overall cardiovascular health, and is calculated using changes in your heart rate. Exactly what the number means in real terms is rather vague, but with regular exercise you should see it rise in line with your improving fitness.",
    "Heart rate measurement was accurate though, very closely matching that from the Polar Ignite 2, with no unexpected spikes. Both watches also produced almost identical results for heart rate training zones. If you train using time and heart rate rather than distance, the Smart Band 6 could be a great little tool.",
    "The Mi Smart Band 6 connects to the Mi Fit app, which has a refreshingly clean, uncluttered design and is easy to navigate. Linking the watch is a simple matter of setting up a Mi Fit account with some basic data (name, age, height, weight, gender), then tapping ‘Profile’ and selecting ‘Add device’. A small firmware update was necessary with our review unit, but this didn’t take long.",
    "If any of your friends own Xiaomi fitness trackers, you can connect your accounts by scanning a QR code within the app, Instagram style. This allows you to see their activity and sleep data, but sadly that’s where the social functions end. Unlike Garmin Connect, for example, there’s no ability to take part in group challenges and earn badges.",
    "A large part of the app is dedicated to tracking activities using your phone rather than a watch. Tap ‘Walking’ , ‘Running’ or ‘Cycling’ and the app will begin monitoring your workout accordingly, using your phone’s GPS and pausing tracking when you stop for a moment. Not particularly useful if you have a dedicated watch, but handy if you only own a Xiaomi smart scale.",
    "In an unusual move, most of the customization options for the Smart Band 6 are only accessible through the device itself. The app is limited to reviewing your fitness and wellbeing data, but this is no bad thing, and avoids the reams of menus that often clutter fitness apps associated with sports watches and trackers.",
    "First reviewed April 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Xiaomi Mi Smart Band 6 price and release date",
    "8": "Xiaomi Mi Smart Band 6 design",
    "14": "Xiaomi Mi Smart Band 6 smartwatch features",
    "19": "Fitness tracking",
    "25": "Companion app",
    "30": "Don't buy it if"
  },
  "links": {
    "Xiaomi Mi Smart Band 6": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1254574765922349300&xs=1&url=https%3A%2F%2Fwww.mi.com%2Fglobal%2Fproduct%2Fmi-smart-band-6%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fxiaomi-mi-smart-band-6",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Xiaomi Mi Smart Band 5": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-5",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "direct from Xiaomi": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1355209973080066600&xs=1&url=https%3A%2F%2Fwww.mi.com%2Fglobal%2Fproduct%2Fmi-smart-band-6%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fxiaomi-mi-smart-band-6",
    "from Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.in%2Fb%3Fnode%3D26954202031%26tag%3Dtech0e7-21%26ascsubtag%3Dtrd-us-9013776245980769000-21",
    "Garmin Connect": "https://www.techradar.com/how-to/garmin-connect"
  }
}