{
  "source": "https://www.techradar.com/reviews/dynabook-portege-x30l-j-13r-business-laptop",
  "title": "Dynabook Portege X30L-J-13R business laptop review",
  "category": "computing",
  "updated": "2021-09-22T16:14:11Z",
  "author": "desire-athow",
  "summary": "A solid performer that comes with a few interesting tricks but will it be enough to sway buyers?",
  "verdict": "The Dynabook Portege X30L would make its forebears proud. Although it is not as light as expected, it does come with some features that will appeal to its target audience. It is not the cheapest nor the fastest but it does provide a decent alternative as long as you ignore the pathetic battery life.",
  "pros": [
    "Reasonably priced",
    "Fast charging",
    "Ethernet port",
    "Full-sized HDMI port",
    "Privacy mode"
  ],
  "cons": [
    "Bloatware",
    "No vPro option",
    "Overactive fan",
    "Both Thunderbolt ports on same side",
    "Poor battery life"
  ],
  "article": [
    "The Portege has a long history of innovation in the world of ultra compact business laptops and while the Toshiba brand that is associated with it is gone, Dynabook, its successor, promises to keep the product line ticking. The Portege X30L-J1337 (otherwise known as the X30L-J-13R in the UK) is an ultraportable business laptop that weighs just over 1Kg. It faces some tough competition from established brands such as Lenovo, Dell and HP as well as rival brands like MSI, Acer, Asus and Gigabyte.",
    "Part of the challenge is to differentiate itself from other ultra portable laptops that have gone down the same route and use identical hardware, leaving only design, after sales support and price as the only major differentiators. But plucky Dynabook scores well with a 3-year onsite warranty bundled as standard and a nice balance between features, pricing and performance. The only sore point is the battery life.",
    "The Dynabook Portege X30L-J-13R sells for as little as $1,549 at online US retailer Provantage with Windows 10 Pro, an Intel Core i7-1165G7, 16GB of RAM and 512GB onboard storage. A slower model, the Portege X30L-J1331, is also available with an Intel Core i5-1135G7, half the memory and half the onboard storage for $1,218 from Dynabook direct. In the UK, Currys PC World Business sells the latter for just over £863 excluding VAT. Note that Dynabook also offers a built-to-order version that offers up to 32GB of RAM, a 1TB SSD and a whopping 4-year on-site limited warranty, one extra year compared to our test sample. There’s no vPro option though (Intel Core i7-1185G7).",
    "In comparison, at the time of writing, the slightly heavier Dell XPS 13 costs $1309 with a 4-year warranty and a 17% discount using the coupon code SAVE17. HP’s Elite Dragonfly is the nearest in terms of size and shape but costs 44% more. As for Lenovo, the superlative ThinkPad X1 Nano was the second most expensive at just over $2,000 with a, ahem, 90-day lead time.",
    "Dynabook inherited the dark blue color (also known as Mystic Blue) and the subdued design philosophy of the Portege brands. Nothing flashy or out of the ordinary other than the Dynabook branding and an oval ring around the power button (and the blue Dynabook AccuPoint pointing stick).",
    "As expected for a laptop of this price (and standing), magnesium alloy is the main material for the chassis which allows it to be so lightweight but on the other hand gives it a bit of flex, which is an intrinsic characteristic of that material.",
    "Dynabook says that the laptop has a starting weight of 906g, that’s 1.996lb (one pound is 454g). Ours stood at 1.033Kg, 14% heavier than claimed. The display is a matte affair, with a full HD resolution and a 13.3-inch diagonal. There’s a HD webcam that sits atop with a privacy shutter and a pair of microphones.",
    "On the left side of the Portege are two USB-4/Thunderbolt 4 ports, a HDMI connector and a full size USB 3.2 Gen 1 port plus an audio port. On the opposite side, is a full size Gigabit Ethernet connector, a microSD card slot and a USB 3.2 Type A connector.",
    "The bottom of the laptop is - as expected - secured by a number of screws - which means that it is serviceable, something you’d expect from any business laptop worth its moniker. There’s plenty of slits to allow for air to circulate and cool the components inside.",
    "Three rubber parts ensure that there’s a slight gap between its base and any surface on which it sits. Likewise, the hinge that links the display to the base of the laptop hides a dozen or so cooling holes on the back of the Portege.",
    "At 306 x 210mm and up to 18mm thick, it is comfortably on an A4 sheet which means that the keys are not mashed.",
    "Our test sample was equipped with an Intel Core i7 processor (the i7-1165G7), a quad-core model with Intel Iris Xe graphics, 16GB of LPDDR4 RAM (8GB soldered and 8GB added on and a 512GB M.2 PCIe SSD (the Kioxia KBG40ZNV512G).",
    "Connectivity is handled by an Intel AX201 wireless chip which offers Wi-Fi 6 and Bluetooth 5.1 while the whole thing is powered by a 53WHr, 4-cell battery and a 65W USB-C fast charging power adapter. Shame it’s not a GaN model as it is significantly bigger than some we’ve seen recently.",
    "The one big surprise we got when reviewing the laptop was the poor battery life. Our test - as a reminder - is nothing taxing. Push the brightness to 100%, play a 10 hours video from YouTube (which implies connectivity) and move the “power mode” slider all the way to best performance.",
    "With its 52.67WHr battery, the Dynabook laptop reached 262 minutes, in other words, each minute of activity consumed 0.20WHr of battery power. That’s a lot, about 50% more than the equivalent Honor MagicBook (Intel Core i7-1165G7), which achieved 430 minutes with a 56WHr battery.",
    "As expected, the fan kicked in overdrive during some taxing benchmarks (e.g. Cinebench). Oddly enough, the Core i7 on the Dynabook performed worse than the same processor in the Honor MagicBook which might point to some throttling issues. The storage subsystem is also weaker than expected, dispatching test results that are below expectations.",
    "The screen comes with an ePrivacy filter which can be activated via the FN + D key combo. It restricts the viewing angle significantly and is useful when out and about. Brightness and overall quality of the screen are on par with similar-priced rivals: crisp with accurate color reproduction and a high-enough resolution that allows you to enjoy your spreadsheets in full view.",
    "The keyboard is backlit, is responsive and a joy to clack away on. It is noisier than expected and its travel is enjoyable; no mushiness observed. As for the touchpad, it hosts the fingerprint reader and is responsive enough to match the best out there.",
    "Last but not least, there’s some bloatware (Iolo, Winzip, ExpressVPN) on this Windows 10 Pro laptop, which is rather unexpected.",
    "Buy it if:",
    "You want plenty of ports",
    "With a full size HDMI port and an Ethernet connector, this Portege laptop is ready to go roaming everywhere.",
    "You want a light, well balanced business laptop",
    "The Dynabook is probably one of the lightest and most powerful business laptops around. It is a great all rounder overall.",
    "Don’t buy it if:",
    "You want a long battery life",
    "Sadly, based on our testing, the Portege behaves significantly worse than the competition when it comes to off-the-grid performance. Which is a real shame."
  ],
  "headers": {
    "0": "Two minute review",
    "2": "Pricing, availability and competition",
    "4": "Design",
    "11": "Hardware",
    "13": "Performance and in use",
    "19": "Should I buy the Dynabook Portege X30L?"
  },
  "links": {
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "online US retailer Provantage": "https://www.provantage.com/dynabook-pcr10u-03v002~7DYTO00X.htm",
    "Windows 10 Pro": "https://www.techradar.com/news/windows-10-pro-vs-windows-10-home-all-the-differences-explained",
    "$1,218 from Dynabook direct": "https://us.dynabook.com/computers/laptops/portege/X30L/X30L-J1331",
    "Currys PC World Business": "https://www.awin1.com/awclick.php?awinmid=1599&awinaffid=103504&clickref=trd-us-7813712050554543000&p=https%3A%2F%2Fbusiness.currys.co.uk%2Fcatalogue%2Fcomputing%2Flaptops%2Fwindows-laptop%2Fdynabook-port%25C3%25A9g%25C3%25A9-x30l-j-10e-13-3-core-i5-1135g7-8-gb-ram-256-gb-ssd%2FP272948P%3Ffrom%3Dcategory",
    "Dell XPS 13": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1557534624094345000/https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/xps-13-laptop/spd/xps-13-9305-laptop/smx139w10p1c1500",
    "Elite Dragonfly": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-8687130553693023000&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fshop%2Fpdp%2Fhp-elite-dragonfly-max-notebook-pc",
    "ThinkPad X1 Nano": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-3817530472533806600&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Fp%2Flaptops%2Fthinkpad%2Fthinkpadx1%2Fthinkpad-x1-nano%2F22tp2x1x1n1",
    "Honor MagicBook": "https://www.techradar.com/reviews/honor-magicbook-14-2021-intel-edition-laptop",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn"
  }
}