{
  "source": "https://www.techradar.com/reviews/lexar-play-1tb-microsd-card",
  "title": "Lexar Play 1TB microSD card review",
  "category": "computing",
  "updated": "2021-05-05T19:41:10Z",
  "author": "desire-athow",
  "summary": "Another microSD card maker joins the prestigious 1TB club",
  "verdict": "The Lexar Play 1TB is the latest to join the 1TB group but it does so with a whimper rather than a bang. Its rather strange behaviour in our real life tests combined with average pricing mean that it misses out on the top spot.",
  "pros": [
    "Five year warranty",
    "Fast in synthetic tests"
  ],
  "cons": [
    "Perplexing real life performance",
    "More expensive than rivals"
  ],
  "article": [
    "It’s been nearly two years since we reviewed our first 1TB microSD card, the Micron C200, since then there has been a steady trickle of similar sized memory cards. Silicon Power, Sandisk Extreme and now Lexar with its Play 1TB card. It has been billed as the “perfect mobile memory solution for media entertainment” with a maximum claimed speed of 150MBps.",
    "Lexar has been around for more than a quarter of a century and was acquired in 2017 by Longsys, a Chinese company. Since then it has expanded its portfolio to support external SSDs (like the SL200), internal ones, flash drives, RAM modules and memory cards.",
    "The 1TB Lexar Play microSDXC card is available from Amazon for only $179.99 with a five-year limited warranty.",
    "As a catch-all memory card, the Play will be good enough for most tasks that do not require either endurance (e.g. CCTV or dashcams) or very high write speeds (e.g. for 4K or 8K video recording). This memory card is categorized as a Class 10/U3/V30/A2 one which means it will be good enough for full HD video capture. Note that its operating temperature is between zero and 70 degrees centigrade; quite a broad range!",
    "All benchmarks were carried out using the internal adaptor-less microSD memory card reader of my trusty Dell Latitude 7490. Your speeds may vary should you use a dedicated Type-C microSD card reader for example.",
    "While the Play performed admirably when it came to synthetic benchmarks (it performed within the expected range on AS SSD, AJA, Crystal Disk Mark and ATTO), our only real life test - transferring a single 10GB file - proved to be quite a challenge.",
    "The Play only managed a paltry 352 seconds, in other words, hitting just over 28MBps, a fraction of what the other synthetic benchmarks had reached. The disparity was similar regardless of whether we used an adaptor (Lexar’s or a 3rd party one), a docking station or the laptop’s card reader and is not something we noticed in any other memory card that we’ve tested. Looking at the transfer graph, we could see it see-sawing which may be an indication of some abnormality.",
    "A closer look to the numbers provided by Lexar revealed that the internal testing were achieved “when paired with Lexar Multi-Card 2-in-1 USB 3.1 Reader or Lexar Professional Multi-Card 3-in-1 USB 3.1 Reader marked with Rev B, or visit the Lexar website or contact Lexar Technical Support to update reader firmware”.",
    "Note that it doesn’t come with any applications; one easy way to enhance its appeal would have been to bundle a subscription to either a cloud storage or a cloud backup service. A 1TB memory card is barely bigger than the average pinkie fingernail so losing it and/or the data on it can be devastating especially if you use it for business.",
    "Lexar does offer a nifty free data recovery tool for Windows and Mac. It supports about fifty image, document, video and audio file types, offering accidental deletion, accidental formatting, file system header corruption and last partition recovery.",
    "You won’t be able to use it to recover files lost due to low-level formatting, overwritten or encrypted data/files.",
    "There’s a handful of 1TB microSD cards out there and the cheapest one right now is the Sandisk 1TB Ultra that costs $159.99, while it wins on price per capacity, it loses out when it comes to speed as it belongs in the U1 rather than the U3 category. Silicon Power’s “Superior” brand is next up at $164.99 with a U3 rating with Sandisk’s two other 1TB cards, the Extreme and the Extreme Pro retailing between $200 and $300 with much higher performance and - dare we say - endurance.",
    "Note that there’s a bunch of fake 1TB microSD cards that are on sale at Amazon for absurdly low prices. I don’t know why the world’s largest online retailer doesn’t crack down immediately on that blatant violation of the terms of services but until then, avoid these at all costs.",
    "Which brings us to another interesting question, is it worth actually buying a 1TB card? Well, yes and no. Yes if you want the absolute highest capacity on a card - prices were expected to fall further but the current disruption in supply chain and shipping means that it is unlikely to happen at all. Prices won’t go down further. No, you shouldn’t buy these cards if you want the best value for money.",
    "At the time of writing and if you are in the US, the most affordable microSD card per unit storage from a reputable, trusted party is Pioneers 256GB microSD card, one whose price per TB hovers just under $90 ($89.80 to be more precise). In other words, you can get about 2TB worth of storage (or eight 256GB cards) for the price of one Lexar Play 1TB card.",
    "So there we have it, the Lexar Play 1TB performs on par with the rest of the competition (i.e. within error margins) when it comes to read/write speeds bar the weird, abnormally low file transfer session, That means price is likely to be the main determinant in your purchasing decision.",
    "Storage capacities on microSDXC cards are unlikely to grow beyond 1TB unless someone - like Sandisk - decided to introduce an intermediary capacity (as they did with a 400GB card as a stepping stone between 256GB and 512GB products).",
    "2TB seems to be a bridge too far and with the likes of Samsung seemingly happy with the current status quo at 512GB, one can expect 1TB to be the top capacity for the foreseeable future."
  ],
  "headers": {
    "2": "Pricing and availability",
    "3": "In use",
    "11": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "Micron C200": "https://www.techradar.com/reviews/micron-1tb-c200-microsd-uhs-i-card",
    "Silicon Power": "https://www.techradar.com/reviews/silicon-power-1tb-microsd-card",
    "Sandisk Extreme": "https://www.techradar.com/reviews/sandisk-extreme-1tb-microsdxc-card",
    "SL200": "https://www.techradar.com/reviews/lexar-sl200-1tb-portable-usb-ssd",
    "1TB Lexar Play microSDXC": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLexar-microSDXC-Compatible-Smartphones-LMSPLAY001T-BNNNU%2Fdp%2FB08T8LL7G8%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1011864626863929000-20",
    "dashcams": "https://www.techradar.com/best/best-dash-cam",
    "Dell Latitude 7490": "https://www.techradar.com/reviews/dell-latitude-7490",
    "docking station": "https://www.techradar.com/news/the-best-laptop-docking-stations",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "data recovery": "https://www.techradar.com/best/best-data-recovery-software",
    "microSD card": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards"
  }
}