{
  "source": "https://www.techradar.com/reviews/flickrpro",
  "title": "FlickrPro review",
  "category": "computing",
  "updated": "2021-05-01T19:25:41.063Z",
  "author": "jonas-p-demuro",
  "summary": "Photo backup and much more",
  "verdict": "FlickrPro offers to store an unlimited number of images with its single monthly paid plan. Add in the ease of use, and the tagging options for a winning combination.",
  "pros": [
    "Handles images and videos",
    "Single paid tier",
    "Includes Pixsy image theft monitoring",
    "Expansive video format support",
    "Support for image copyrighting",
    "Cross platform support"
  ],
  "cons": [
    "Free account limited to 1,000 images",
    "Lacks image editing functions",
    "Limited format support"
  ],
  "article": [
    "FlickrPro is likely on any computer user’s list of photo sharing and backup sites. This is hardly surprising as this service was started back in 2004. It is currently owned by SmugMug since 2018. It boasts over 100 million users that rely on it as they have uploaded tens of billions of images which lets it lay claim to be “The world’s largest photographer-focused community.”",
    "Flickr offers both a free tier, and a paid tier known as the FlickrPro plan. While the free tier was previously more generous in its photo storage, in 2018 updates were made that made it less attractive. Also, while there was a previous requirement to have a Yahoo! Account to use Flickr, this is no longer the case.",
    "The Flickr Free account is a decent place to start, but most shutterbugs are likely to quickly outgrow the storage limit of 1,000 photos or videos. For most folks this is not likely to occupy much storage space, but at least the max limit of 200 MB per image, and 1 GB per video could occupy quite a bit of space and is not seriously limiting. The other significant limitation of the free tier of Flickr is that it is ad supported. In short, the free tier of Flickr is not going to be enough for most users.",
    "The better option is a FlickrPro account, which is the only paid tier available, and makes the choice of an upgrade from free to be pretty simple with a “One size fits all” approach. The first benefit is that the storage is unlimited, and also, that the images are at full resolution. The other benefit of the Pro account is the use of Flickr ad free, and also visitors to your account will also enjoy no ads. Additional benefits are the Advanced Stats to see how images are trending currently, and also historically to see the popular images over time. There is also Premier Support so that the paid users get priority when help is needed.",
    "Not only is the image uploading unlimited, but FlickrPro has a tool to facilitate the process, known as AutoUploadr. This tool allows the user to upload an entire photo collection from a variety of sources, such as a smartphone, a computer, or a hard drive. It can also work with online storage sources, such as Adobe Lightroom, or Dropbox.",
    "While there is only a single paid tier of the FlickrPro plan to choose from, there is a choice in the pricing. The simplest option is the monthly plan, which has all the features including the unlimited storage for $6.99 (GBP 5), and is taken monthly without a contract. The first option for a discount is to sign up for three months, which costs $18.99 (GBP 14), which is a modest 9.4% savings as it brings the effective monthly cost down to $6.33 (GBP 5) if we divide it out. The better deal is to sign up for the year for $60 (GBP 43), which gets billed annually, and brings the effective monthly cost down to $5 (GBP 4), a better savings of 28.5%. Each plan auto-renews, which is convenient and helps to not lose previous images, but users should be aware that it is also non-refundable.",
    "Flickr can be used via a web browser on the PC, or via smartphone apps for the Android and iOS platforms.",
    "While some photo and video storage services are just cloud storage, FlickrPro has a plethora of partner agreements in place to enhance the deal. Unfortunately, most of them are more time limited trials of other services, but most should be of interest to photographers.",
    "For example, members get 1 free month of access to PHLEARN, a course catalog for Photoshop and Lightroom courses, and subsequently 35% off. As FlickrPro does not have image editing functions, users will appreciate the offers for a two month trial of the Adobe Creative Cloud Photography, and 35% off of Capture One photo editing software. There is also a limited plan from Pixsy to fight image theft which will protect up to 1,000 images with 10 takedown notices.",
    "FlickrPro supports a few image formats, although the list is somewhat limited. When it comes to images, the list is only JPEG, PNG and non-animated GIFs. Unfortunately, this leaves out RAW images that are popular with pro photographers. Any other image that gets uploaded will be converted to the JPEG format.",
    "The format support is much more expansive on the video side. The supported list includes MPEG, MP4, MOV, AVI, WMV, 3GP, M2TS, OGG and OGV which is sure to please most.",
    "Staying consistent with dropping the “e” is the Uploadr to get the image to Flickr. After the image is uploaded, the user is prompted to add multiple categories of information to the image. This then makes it easy for folks to find the image. There is also an opportunity to add a description to the image, along with tags, and to identify the people in the image. If the image is part of a series of images from the user, then it makes sense to add it to an album. The image can also be added to a Flickr group, such as Macro Monday, Travel Photography, and Hardcore Street Photography- among thousands of choices. We also appreciate the option to copyright an image.",
    "FlickrPro offers a strong entry into the cloud storage space of image and video storage, combining the social aspect for sharing the content. While the free tier is pretty limited, and we wish it supported more image formats natively, we can still see why this service is so popular. FlickrPro excels at the unlimited storage, with a dedicated software tool, the cross platform support, and the ease of use especially with tagging images. Taking this all into account, we can easily see why this service enjoys such popularity."
  ],
  "headers": {
    "2": "Free vs paid",
    "5": "Plans and pricing",
    "7": "Hey there, partner",
    "9": "Get with the format",
    "11": "The Downlow on the Uploadr",
    "12": "Final verdict"
  },
  "links": {
    "FlickrPro": "https://www.flickr.com/account/upgrade/pro",
    "photo sharing": "https://www.techradar.com/best/best-cloud-storage-for-photos",
    "FlickrPro plan": "https://www.flickr.com/account/upgrade/pro",
    "Flickr Free account": "https://www.flickr.com/photos/tags/free/",
    "AutoUploadr": "https://help.flickr.com/about-the-auto-uploadr-in-the-flickr-app-HkFc2moyQ",
    "Adobe Lightroom": "https://www.techradar.com/reviews/adobe-photoshop-lightroom-cc",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "monthly plan": "https://www.flickr.com/account/upgrade/pro",
    "three months": "https://www.flickr.com/account/upgrade/pro",
    "for the year": "https://www.flickr.com/account/upgrade/pro",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Adobe Creative Cloud Photography": "https://www.techradar.com/reviews/adobe-creative-cloud"
  }
}