{
  "source": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
  "title": "Amazon Echo Show 10 review",
  "category": "smart-home",
  "updated": "2021-06-23T11:16:46Z",
  "author": "carrie-ann-skinner",
  "summary": "The latest Echo Show 10 is Amazon’s most advanced smart display yet",
  "verdict": "With a new rounded look and a rotating 10.1-inch screen, the latest Echo Show 10 is the most intuitive smart display Amazon has made. Video calls are smooth and crisp, and now the camera automatically pans and zoom so you’re always in the center of the frame – and it’ll even double as a home security camera. On the downside there’s still no YouTube app, Alexa can’t alter settings for you, and smart home routines still require the Alexa app.",
  "pros": [
    "Large, clear, responsive touch screen",
    "Display can rotate 360 degrees",
    "13MP camera can be used for home security"
  ],
  "cons": [
    "Expensive",
    "No YouTube app",
    "Audio is bass heavy"
  ],
  "article": [
    "The latest Amazon Echo Show 10 smart display is unlike any other Amazon smart display as it can follow you around the room when you move. So the screen and camera are always within your gaze, whether you’re following a recipe, making a video call, or watching Netflix.",
    "The Echo Show 10’s 13MP camera pans with the screen, and also zooms automatically when you’re on a video call, making sure you’re front and center of the picture at all times. The camera can also be used for home security, with its live feed available through the Alexa app any time you want to check in on your abode.",
    "Amazon offers three different sizes of its smart display, with the Echo Show 10 sitting alongside the Echo Show 5 (second generation) and the Echo Show 8 (second generation), which has the same 13MP camera that pans and zooms as the Echo Show 10, but in our eyes the Echo Show 10 is the best smart display Amazon currently offers.",
    "You can also watch Prime Video and Netflix through the 10.1-inch screen, or listen to a host of music streaming services on the Show’s powerful bass-heavy speaker. The screen quality won’t blow you away, but it's sufficient for watching from a distance.",
    "The rotating display isn’t the only thing that’s new when it comes to Amazon’s largest smart display, it’s got a new look too. In keeping with the rounded design of the latest Echo and Echo Dot, which were announced at the same time as the Echo Show 10, the Show’s angular look has been ditched in favor of a cylindrical base with the 10.1-inch display attached to the front.",
    "Like all Amazon Echo devices, Alexa is built in and offers a hands-free way to set timers, shop online, follow recipes, get your burning questions answered and get the lastest weather and news. As well as an audible response, the Amazon Echo Show 10 will offer up extra information on screen, too: ask for the weather forecast, for example, and it’ll announce the day’s temperature while on screen an hour-by-hour breakdown, along with the wind speed and real-feel temperature, is displayed.",
    "Previous iterations of the Amazon Echo Show 10’s have had a ‘voice first, touch second’ approach. This is still the case with the newest model, although the reliance on voice has been reduced somewhat. Swipe left from the home screen and you’ll find shortcuts for making calls, announcements and drop-ins, as well as for playing music and video services, setting routines and controlling smart home gadgets.",
    "The Show 10 can act as a Zigbee hub for your smart home gadgets so you can get several to work together at the same time, although these routines can only be set up through the Alexa app.",
    "When you’re not directly interacting with Alexa, you can choose what’s displayed on the screen: slideshows of pre-set illustrations or photos from your Amazon and Facebook accounts, or useful information such as upcoming events, weather forecasts, sports scores, popular recipes or reminders.",
    "At $249.99 / £239.99 / AU$ 399.99 it’s the most expensive smart display Amazon sells, but it’s certainly the most intuitive. The fact the camera can be used to keep an eye on your home, and the video calling experience has been improved, means it’s now more than just a way to access Alexa.",
    "The Amazon Echo Show 10 is priced at $249.99 / £239.99 / AU$399.99, making it the most expensive smart display Amazon offers. It’s a little pricier than the previous Echo Show, which was launched in 2018, but only by $20 / £20 / AU$50.",
    "The Echo Show 10 is Amazon's top-of-the-range smart display, but it also offers two others; the Echo Show 8, which will set you back $89.99 / £79.99/ AU$129, and its smallest smart display - the Echo Show 5, which costs $89.99 / £79.99 / AU$129.",
    "The Amazon Echo Show 10 is a complete departure from previous models when it comes to looks. Measuring 9.9 x 9 x 6.7 inches (25.1 x 23 x 17.2cm), the newest Echo Show fuses the cylindrical shape of the Amazon Studio, although it’s not as tall, with a 10-inch display that’s attached to the front. The rounder design is also in keeping with the aesthetic of the most recent Amazon Echo and Amazon Echo Dot, and it’s got the same mesh fabric that comes in either charcoal or white.",
    "The round base of the Echo Show 10 holds dual, front-firing tweeters and powerful woofer encased in a wraparound grille, along with a motor that allows the smart display to rotate so its 10in screen is always facing you. We found this to be handy, particularly in the kitchen as we could always keep an eye on the recipe we were preparing. On the bottom of the cylindrical speaker is a power socket, as just like other Echo smart speakers and displays, it needs to be plugged in at all times.",
    "The 10.1-inch HD display has a 1280 x 800 resolution (the same as that of the smaller Amazon Echo Show 8), and can be tilted up or down so it’s at the best angle to be seen no matter where it's positioned. It’s not quite as crisp and clear as the screen found on many 10-inch tablets when viewed close up, but from a distance, it will suffice. The Adaptive Brightness feature automatically brightens or darkens the screen based on the ambient light in the room, although you can manually override this using the brightness controls by swiping the top of the screen. If you’re using the Echo Show 10 as an alarm clock, the Sunrise effect option will display dawn-type lighting 15 minutes before an alarm goes off.",
    "The Amazon Echo Show 10 also features a 13MP wide-angle camera in the top right-hand corner, which can be used for video calls to other Echo Show devices or Skype calls, and also doubles as a home security camera, allowing you to view a live feed from the Alexa app on your smartphone.",
    "On the top of the screen are physical buttons for volume, muting Alexa, and a privacy shutter for the camera, should you not want the smart display watching your every move. When activated the shutter also switches off the rotation feature. However, unlike the smaller Echo Show 5 and Echo Show 8, the Echo Show 10 doesn’t have a micro USB port for charging other devices or a headphone socket for private listening.",
    "The big draw of the new Amazon Echo 10 is that it can follow you around the room so that the screen is always in view, and you’re always on camera when you’re on a video call. The Echo Show 10’s camera identifies when a person is in its field of view, and sets data points representing shapes, edges and colors, which are used to rotate the screen into the correct position when the person moves. If there’s more than one person in the room, the Echo Show 10 positions itself so it’s at an angle that’s comfortable for the majority of people in the room. For those worried about privacy, Amazon stresses that the processing of these images is carried out on the device, rather than online, and none of the images captured by the camera are stored.",
    "We’ve been testing the Echo Show 10 for a few days now and we’re extremely impressed with the rotating screen. Not only does the screen rotate very smoothly, with no jerking or juddering, but it takes just a second after uttering “Alexa” for the screen to reposition itself within our gaze. Similarly, when watching Prime Video on the smart display, as soon as we moved and were no longer facing the screen, it automatically moved so the display was back within our gaze. During testing, we deliberately moved around the kitchen, where the Amazon Echo Show 10 is located, often and sometimes in quick succession, but the smart display didn’t struggle to keep up at all, following as smoothly and as quickly as when we were only moving occasionally.",
    "Amazon says the brushless motor that enables the device to rotate is \"completely silent\", and we can’t disagree with this statement – we couldn’t hear the motor at all when the device was moving throughout all of our testing, even when there was no background noise at all. In fact, we had to position our ear as close to the Echo Show’s speaker as possible to hear the faintest hint of a sound.",
    "The motion feature is switched on by default, but if you find the thought of Echo Show 10 following your every move a little creepy, you can switch it off completely by swiping down from the top of the screen.",
    "The screen will rotate whether you’re listening to music, watching videos or making requests to Alexa, but you can choose to only have it rotate during activities such as video calls, watching videos or following recipes, or set it to only move when you tell it, by using phrases such as “Alexa, follow me” or “Alexa, turn right/left”. When you first set up the Echo Show you can adjust the maximum angle by which the device can rotate, which is handy if its positioned against a wall or there are objects next to it that would bump into when rotating. You can reset this at any time from the Settings Menu.",
    "While we found the rotating display useful when following recipes and catching up with our favorite shows on streaming services, it really came into its own for video calls. Using Alexa to chat with family and friends that also have Echo Show devices, we found the Echo Show 10 smoothly panned and zoomed so we were always in the center of the frame, just like the Facebook Portal does.",
    "We put the Echo Show 10 through heavy testing by making several video calls to various friends and family, using Amazon's drop-in function with other Echo Show devices in the same household, as well as calling Echo Show’s outside of our home and using Skype to video chat with others on smartphones and PCs. Many of the recipients of the video calls exclaimed how clear and detailed the image from the Echo Show 10 was, which is a testament to its 13MP camera. The Echo Show 10 kept us in the center of the frame when we moved but did not reposition for small movements such as tilting our head or stretching our arm. We also made several video calls from the Echo Show 10 with two people in the frame, and as Amazon promised when one person walked off during the call, the camera didn’t follow as the other person was still talking. It kept the remaining caller in the cent",
    "The Echo Show 10’s camera can also double as a home security camera if you don't already have one. Amazon says you can view the live feed from the camera on another Echo Show, or via the Alexa app on your phone, and ask Alexa to rotate the Echo Show 10 so you can see around the room.",
    "You’ll need to switch Home Monitoring on the Echo Show 10 first - you can do this from the Settings menu, under the camera section. To view a live feed from the Echo Show’s camera on your phone, open the Alexa app and select cameras from the top. Tap your Echo Show from the list and a live feed will be displayed on screen. We found the video was clear and detailed and we were able to swipe left and right on our phone screen to get the Echo Show 10’s camera to rotate, allowing us to see different areas of the room. The two-way talk was clear without distortion too. The Echo Show 10 also displays an alert on screen when the camera’s live feed is being viewed, so you’ll always be aware if someone is watching it.",
    "You can also use another Echo Show in your home to view the Echo Show 10's live camera feed. Just ask an Amazon smart display to \"show me the...\" followed by the name you've given the Echo Show 10. You can zoom into the picture on whatever Echo Show you're viewing the camera feed on, but you can't swipe to make the Echo Show 10 rotate.",
    "A wide range of music services can be played through the Echo Show 10’s dual 1-inch front-firing tweeters and powerful 3-inch woofer. Apple Music and Podcasts, Deezer, Spotify and TuneIn are all supported alongside Amazon Music, and the voice integration of all of these services is smoothly executed.",
    "The audio is bass-heavy, although an equaliser lets you adjust the levels if you want room-filling sound without the thud. At full volume there was no distortion, and as the screen moves the tweeters move with it, so no matter which way the screen is facing you get the same clear sound.",
    "A Bluetooth connection also means you can link the Echo Show 10 to your smartphone or tablet, and play music stored on your device through the smart display’s speaker.",
    "You can watch both Amazon Prime Video and Netflix on the smart display, and while it’s not the sharpest screen we’ve seen, the quality is fine if you just want videos running in the background while you’re cooking, doing the housework or just pottering about – this is never going to be your main screen. Music videos are provided by Vevo, but there’s no YouTube app – instead, Alexa offers up videos from WikiHow when you ask it “How to tie a tie” or “How to chop an onion”.",
    "Amazon’s Silk browser and Firefox are installed on the Amazon Echo Show 10, so you can view websites and play videos from YouTube this way, but it’s long-winded, and somewhat at odds with Amazon’s ‘Voice first, touch second’ approach, as it requires several taps on the display. BBC iPlayer in the UK, and Hulu in the US can also be viewed this way.",
    "Alexa is built into the Amazon Echo Show 10, and can do everything it can on other Echo devices, from setting timers and answering questions to providing the day’s news, weather and sports scores, while also offering up extra information on-screen. For example, as well as reading recipes from BBC Good Food aloud, the Amazon Echo Show 10 will display the ingredients and steps on the screen, and you can scroll through these. Where Alexa struggles is with opening menus and settings – it can load the main settings menu if you ask it to, but it can’t go deeper into the menus.",
    "Similarly, while the Echo Show 10 can act as a Zigbee smart home interface enabling smart home gadgets from different manufacturers to work together, you’ll need to set up the automations, known as Routines, using the Alexa app on a smartphone or tablet, rather than from the smart display itself."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Amazon Echo Show 10 price and availability",
    "12": "Design",
    "17": "Performance",
    "27": "Music and video",
    "32": "Alexa smarts",
    "34": "Don’t buy it if..."
  },
  "links": {
    "Echo Show 5 (second generation)": "https://www.techradar.com/news/amazon-echo-show-5-2nd-generation-vs-amazon-echo-show-5-2019-which-smart-display-should-you-buy-on-prime-day/reviews/amazon-echo-show-5-2nd-generation",
    "Echo Show 8 (second generation)": "https://www.techradar.com/reviews/amazon-echo-show-8-2nd-gen",
    "best smart display": "https://www.techradar.com/best/best-smart-displays",
    "Prime Video": "https://www.techradar.com/reviews/amazon-prime-review",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Amazon Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "Facebook Portal": "https://www.techradar.com/best/should-i-buy-a-facebook-portal-a-look-at-facebooks-smart-display-range",
    "Vevo": "https://www.techradar.com/news/software/applications/vevo-ios-app-adds-mini-player-will-scan-your-itunes-for-recommendations-1244686",
    "BBC iPlayer": "https://www.techradar.com/news/bbc-iplayer-to-be-re-invented-by-2020",
    "Hulu": "https://www.techradar.com/reviews/hulu"
  }
}