{
  "source": "https://www.techradar.com/reviews/mountain-everest-max",
  "title": "Mountain Everest Max review",
  "category": "computing",
  "updated": "2021-07-28T13:17:55Z",
  "author": "jess-weatherbed",
  "summary": "Ascending to the top",
  "verdict": "Expensive? Certainly, but we wouldn't say this innovative gaming keyboard is in any way overpriced. The customization options offered by the Mountain Everest Max are truly amazing, allowing you the freedom to set up a personalized peripheral that suites your exacting needs.",
  "pros": [
    "Creative modular design",
    "Intuitive control center",
    "Solid build quality"
  ],
  "cons": [
    "Software can be fussy",
    "Keycaps are 'meh'",
    "Lackluster lighting"
  ],
  "article": [
    "It's unlikely that you would have heard of the Mountain Everest Max before in the gaming keyboard market, but you should definitely keep your eyes on this fledgling peripheral brand – if everything coming out of Mountain is as innovative and well made as this keyboard then we look forward to seeing what else it can brew up over the coming years.",
    "The Everest Max is the result of a successfully backed Kickstarter campaign, a fully customizable modular keyboard where it feels like every aspect of the design has been planned by the PC enthusiast community. Prices start at $270 / £214 / AU$429 for the full kit, though you can buy the base keyboard (dubbed the Everest Core) for $130 / £130, and even a completely blank version suitably named the Everest Core Barebone for those of you in the keyboard modding community.",
    "You may have already noticed a theme here. Mountain loves to leave its customers with an insane amount of choice and flexibility, which certainly shines through when you delve into the product box. While the keyboard is the main event, there are four drawers built into the packaging that contain the additional modular accessories: a media control center, an ambidextrous Numpad, a USB-A to USB-C / USB-C to USB-C adapter and a keyboard customization kit.",
    "The modular accessories are a great enough addition, but the customization kit really goes the extra mile. You get a set of eight magnetic adjustable feet to control the position of the Everest Max, a replacement Esc keycap to switch out the company's branded one if you wish, a handy keycap removing tool, and five different styles of hot-swappable Cherry MX key switches to experiment with. The review unit we tested came with a full set of linear red switches, though there are blue, brown, silent red, and silver Cherry MX versions available at point of purchase.",
    "The keycaps themselves are a tad disappointing, being very thin and prone to smudging. The RGB lighting that shines through also isn't especially bright so you'd do well to invest in your own set of high-quality PBT keycaps to really improve the experience. HyperX pudding keycaps would help the dim key backlighting and feel spectacular if you're in need of suggestions.",
    "The overall build quality of the Mountain Everest Max itself really is spectacular though. There's a concern with modular peripherals that parts may feel cheap or flimsy. but after swapping things around and making adjustments to the setup it never once felt unstable or poorly aligned. The connections for the accessories are snug, clicked in tightly enough for peace of mind but not so tight as to need brute strength to separate.",
    "This means that you can move the keyboard around your desk with all the accessories attached if you need to clean or adjust your layout, and everything won't wall apart the moment you move its positioning. The Numpad can be placed on either the left or right-hand side (or even omitted entirely, though if this isn't something you would use then the full-fat product may be wasted on you), and you can switch the orientation by flipping it over and sliding the USB-C connection across to your desired placement.",
    "You also get four macro keys on the Numpad that can be customized with your own images and programed for pretty much anything you need, with full OBS integration for streamers. This is of course similar to what's provided by the Elgato Streamdeck, albeit in a much smaller size. The buttons themselves are not as present to press as those on a Streamdeck either, with a much stiffer and less responsive click, but the fact that they're included at all and work as well as they do is nothing short of a blessing for PC gamers and content creators.",
    "The media control center is similarly full of features, though a few things do fall flat. You can customize the default image that appears when your PC boots up, but if you actually use the dial then this will vanish, with no clear way of getting back to the default screen. The image itself will also be segmented which isn't apparent in the Basecamp software which might annoy perfectionists looking to display a completely round picture.",
    "There are lighting effects you can choose from too, with options such as 'Yeti' replacing the image with...you guessed it, a Yeti, and dual-colored falling animation running through the RGB keyboard. Bizarrely, if you head into the Basecamp software and change the lighting color or animation then you can no longer access the option to change lighting animations on the hardware itself, and a few presets like Yeti vanish entirely from the software.",
    "You can also adjust the brightness of the backlighting itself, but the brightest setting isn't mindblowing and only affects the keyboard lighting, so if you find the macro keys are a tad too bright (which they can be, in contrast to the rest of the keyboard lighting) then changing the brightness won't help.",
    "The display dial can also allow you to monitor your system, giving you a live feed of things like CPU usage percentage, and this does appear to be fairly accurate when checked against what was showing on the PC itself. All the available control on the dial are very responsive and beyond lighting options disappearing, we didn't experience any issues.",
    "There's also a wrist rest, not too luxurious but certainly not cheap feeling either. It has a slim layer of plush foam so it's more comfortable than the typical hard plastic ones you'll find on some products, but it's not as fancy as what you'll get on the Razer Huntsman V2 Analog keyboard.",
    "The Basecamp software is where things fall down a smidge, but not to a point where it should put you off buying the Everest Max if everything you've read so far has your fingers switching. It's not particularly pleasant to look at, and there are a few integration issues that we mentioned regarding the display dial. If you've experienced using software such as Razer Synapse then this is certainly no worse.",
    "Considering Mountain is a fresh face in an already competitive market, we're extremely impressed. The sheer functionality of the Everest Max makes going back to any other keyboard difficult. We'll be keeping it on our desk for sure, and that's despite using some of the best gaming keyboards on the markets and a Stream Deck daily, which should speak for itself. Keep an eye on Mountain – we have a good feeling about what else it could bring to the table."
  ],
  "headers": {
    "0": "Two minute review",
    "15": "Don't buy this if..."
  },
  "links": {
    "Mountain Everest Max": "https://mountainggshop.com/products/everest-max?variant=34560404619397",
    "best gaming keyboard": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703"
  }
}