{
  "source": "https://www.techradar.com/reviews/vaultpress",
  "title": "Automattic VaultPress backup review",
  "category": "computing",
  "updated": "2021-04-28T03:03:47Z",
  "author": "alexis-james",
  "summary": "Ensure your site is in safe hands with Automattic VaultPress backup",
  "verdict": "From the celebrated Automattic team comes a WordPress backup plugin that is easy to use and provides peace of mind.",
  "pros": [
    "One-click restore feature",
    "In-depth support",
    "Virus and malware scanning"
  ],
  "cons": [
    "Can’t customize daily backup time",
    "Unlimited backups for top tier only"
  ],
  "article": [
    "As the brains behind the popular WordPress content management system, it follows that Automattic has designed one of the platform's most powerful backup plugins available, VaultPress.",
    "Now an integral part of Automattic's Jetpack suite, which also includes SEO and social media sharing tools, VaultPress (rebranded as Jetpack Backup in the latest versions of Jetpack) offers key backup protection for your website. In this Automattic VaultPress Backup review, we'll outline its uses, pricing models, and how it compares to the competition.",
    "Since VaultPress is part of Jetpack, it makes sense that its pricing structure is also interwoven with the overall cost of the plugin subscription.",
    "All users are entitled to a 14-day money-back guarantee, granting peace of mind that there will be no issues getting a refund should the package not be the right fit. What's more, if you opt to pay annually, you'll get a 20% chunk off the price.",
    "The entry package starts at just under $5 a month, with its Backup Daily plana giving users unlimited site storage, one-click restore functionality, and automated daily backups.",
    "Go up a level, and for $11.97, you'll be able to access anti-spam, a daily automated scan, and comment and form protection features, along with unlimited video hosting with the Security Daily plan. And, for just under $50 per month, the Complete plan (including a ton of growth and marketing tools) comes with real-time scans and backup, and an unlimited backup archive that can restore site versions from as far back as users want, far surpassing the 30-day archive limit of the lower-cost plans.",
    "Note that subscriptions can only be aligned with a single WordPress site, and are not designed for multisite WordPress installations.",
    "With Vaultpress’s daily and real-time backup and syncing, users will be able to post new content on their website knowing that every word, image, setting, and revision is saved. Users are required to input FTP, SFTP, or SSH data when first setting up VaultPress, after which everything is set up and good to go.",
    "Should the worst happen and your site encounter an issue that can only be fixed by reverting the site to a previous version—or if you’d simply like to revert to a former version for strategic or aesthetic reasons—you'll be able to effortlessly flip back to a previous version with the click of a button via the Backups tab (more on exactly how below).",
    "There are plenty of reasons why VaultPress was integrated into Automattic’s highly-regarded Jetpack package, none less so than the fact that its ease of use means it slots in nicely alongside the California company’s trusted range of WordPress plugins.",
    "It’s true that users not entirely familiar with FTP or SSH settings may need a little initial help setting up VaultPress, but help is at hand via various support channels, and, once installed, the experience is slick, intuitive, and requires minimal fuss, with all site content backed up and stored on VaultPress's secure servers.",
    "Take the example of restoring a backup. Simply locate the exact version you want (listed by date and time), and hit the restore button. You'll then be given the option to customize what to include in the restore, including database, themes, plugins, and uploads. Once you've made your selection, click Prepare Backup. When it's ready to go, you'll be asked to confirm the restore before breathing a sigh of relief when you see your site back up and running.",
    "The VaultPress FAQs page is sufficiently in-depth to resolve the majority of sticking points that users may encounter when first using the plugin, or even when deciding whether or not to use it.",
    "You’ll discover why the plugin is now powered by Jetpack, where backups are stored, and what versions of WordPress that VaultPress supports. The help page includes tutorials on installation, as well as tips on how to restore your site, migrate to a new host, and secure your site after a hack.",
    "For anything not covered, simply hit the Contact VaultPress button at the bottom of the page, and you'll be put in touch with a reassuringly-named Safekeeper, who'll be able to help with your query by email. For a quicker response, make sure to contact the team from your VaultPress Dashboard. Priority email support is included for all plan levels.",
    "VaultPress will not only save your content, but the plugin is also designed to proactively scan your website and alert you to any potential security risks. VaultPress will continually scan your site during the day, scouting for malware, suspicious code, or dangerous files. Should anything be found, you'll be alerted by email, and a suggested fix provided.",
    "As well-received as VaultPress generally is, there are some potential drawbacks worth highlighting. Daily backups are scheduled automatically and can't be customized, which isn’t ideal for those who have an optimal backup time in mind. UpDraftPlus, for example, is one alternative that supports scheduled backups as well as on-demand backups",
    "And with unlimited backups restricted to the top Jetpack plan, users seeking out more than a 30-day backup will be required to pay top dollar. An alternative like BlogVault—which stores up to 90 days of archives on its lower-tier plans—might be preferred for those who need lengthier backups. For those on a tighter budget, there are also free backup services, including BackWPup and the aforementioned UpDraftPlus.",
    "As always, it’s a good idea to shop around and find out what backup services will best suit your website needs and budget. But there can be no doubt that with this product from Automattic—one of the most celebrated names in the business and responsible for millions of WordPress-powered websites—users can rest assured that by using VaultPress (and the rebranded Jetpack Backup) their site is in very safe and capable hands."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "9": "Interface and in use",
    "12": "Support",
    "15": "Security",
    "16": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "backup plugins": "https://www.techradar.com/best/wordpress-backup-plugins",
    "VaultPress": "https://vaultpress.com/",
    "Jetpack": "https://www.techradar.com/reviews/automattic-jetpack-seo",
    "Backup Daily plana": "https://cloud.jetpack.com/pricing?source=vaultpress.com",
    "Security Daily plan": "https://cloud.jetpack.com/pricing?source=vaultpress.com",
    "Complete plan": "https://cloud.jetpack.com/pricing?source=vaultpress.com",
    "WordPress plugins": "https://www.techradar.com/best/best-wordpress-plugins",
    "FAQs page": "https://help.vaultpress.com/faq/",
    "help page": "https://help.vaultpress.com/",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "UpDraftPlus": "https://updraftplus.com/",
    "BlogVault": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1225117240171567600&xs=1&url=https%3A%2F%2Fblogvault.net%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvaultpress",
    "BackWPup": "https://backwpup.com/"
  }
}