{
  "source": "https://www.techradar.com/reviews/fitbit-ace-2",
  "title": "Fitbit Ace 2 review",
  "category": "fitness",
  "updated": "2021-03-11T11:19:24Z",
  "author": "damien-mcferran",
  "summary": "The Fitbit Ace 2 is a fitness tracker to keep kids active, while parents stay in control",
  "verdict": "Built with the intention of making sure your young ones are as active as possible, the Fitbit Ace 2 improves on the previous model with a more eye-catching design, better screen and improved water resistance. To top it all off, it's slightly cheaper than the original, too.",
  "pros": [
    "Colorful design",
    "Changeable straps",
    "Swim-proof"
  ],
  "cons": [
    "Feels a bit cheap",
    "Somewhat expensive",
    "App can be fiddly to set up"
  ],
  "article": [
    "2018's Fitbit Ace was the company's first stab at unlocking the potentially lucrative market for kids' fitness trackers, and was a pretty successful offering – even if it was quite expensive compared to other basic fitness trackers on the market.",
    "The company has returned with a redesigned Ace 2, which shakes off the existing connection with the Fitbit Alta and becomes its own thing.",
    "The core features are retained, but we've got better water resistance, an improved charging system and a lower overall cost, as well as things like animated watch faces that are sure to appeal to the young ones and make it the best Fitbit for kids.",
    "It's worth noting that Fitbit has now announced the Fitbit Ace 3, but it's an incremental update from the Ace 2, with new animations and games being the main changes.",
    "It'll also be possible for kids to decorate the Ace 3 with new accessories, but the fundamental features remain the same, so if you're sticking to a budget, the kids won't be missing out on much if you opt for the older device.",
    "The Fitbit Ace 2 was launched in June 2019 in the US, UK and Australia. It costs $69.95 / £69.99 / AU$129.95, making it slightly cheaper than the original Fitbit Ace or most other Fitbits, but pricier than many basic fitness trackers from other brands.",
    "2018's Fitbit Ace may have been aimed at kids, but it was actually based on the company's adult-oriented Fitbit Alta, so it could hardly be claimed that it was built from the ground-up with younger users in mind.",
    "Fitbit has changed its approach this year, and the Ace 2 is clearly designed with children as its main focus; as a result, the age range has dropped from 8+ to 6+.",
    "While the original Ace had a metal body, the Ace 2 is essentially a plastic pebble set within a soft, rubber-like strap. This strap – which fully encases the unit and protects it from bumps and drops – is entirely interchangeable and comes in two different color schemes: Watermelon / Teal and Night Sky / Neon Yellow.",
    "The straps look playful and appealing, and the whole design is certainly a lot more kiddie-friendly than the rather austere original.",
    "The downside is that if you've got a child who is fast approaching their teenage years, they may be a little self-conscious wearing this unit. And at least with the original Ace, you could swap out the strap for a larger one as your child grew older.",
    "It's also a shame that the main body of the device is made from plastic rather than metal; 2018's model felt reassuringly robust and premium, whereas this update comes across as a little cheap and nasty in comparison.",
    "Having said that, in terms of comfort there were no complaints from our seven-year-old test subject; she found it comfortable to wear and easy to put on and take off. Outside of the unit's touchscreen – which we'll come to later – the only other input on the Ace 2 is a button on the left-hand side which turns the display on and off.",
    "The first Ace was shower-proof but not swim-proof, and that's something that Fitbit has solved with this sequel. It can be submerged in up to 50 meters of water without issue, so now there's no reason to have to take it off, even when your child is in the bath or at a swimming lesson.",
    "The Ace uses a monochrome OLED screen to display information such as the time, date, total steps for the day and total active time. The screen also displays notifications, so your child is constantly being updated on their progress; the little animations that play out given them the incentive to keep active.",
    "You can also use the Fitbit app to transfer a special watch face to the unit; our personal favorite is 'Sprout', which displays a plant pot that contains a flower which slowly grows as your child builds up their step count throughout the day.",
    "The screen on the original Ace wasn't touch-enabled, and instead, the unit relied on 'taps' for interaction via its built-in accelerometer. The Ace 2 has a touch-sensitive screen which makes a world of difference; there's far more control over the on-screen information now.",
    "There's still not a tremendous amount of stuff to do on the Ace 2 itself, but the ability to swipe rather than tap buttons massively improves interaction. You can set alarms and timers, as well as swipe through your current step count and other health-related goals."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Fitbit Ace 2 availability and price",
    "6": "Fitbit Ace 2 design",
    "14": "Fitbit Ace 2 display"
  },
  "links": {
    "Fitbit Ace": "https://www.techradar.com/reviews/fitbit-ace",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Alta": "https://www.techradar.com/reviews/wearables/fitbit-alta-1317934/review",
    "best Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Fitbit Ace 3": "https://www.techradar.com/news/fitbit-reveals-new-smartwatch-and-you-can-pre-order-it-today"
  }
}