{
  "source": "https://www.techradar.com/reviews/efilecabinet-review",
  "title": "eFileCabinet review review",
  "category": "computing",
  "updated": "2021-01-19T15:15:12Z",
  "author": "michael-graw",
  "summary": "Powerful document management with automated workflows",
  "verdict": "eFileCabinet is a versatile document management software to help keep your business organized. The platform is expensive, but it offers standardized folder templates, easy file sharing, excellent security, and automated workflows.",
  "pros": [
    "Seamless file sharing",
    "AI-based workflows"
  ],
  "cons": [
    "Expensive",
    "No document editing"
  ],
  "article": [
    "eFileCabinet is simply one of the best document management software platforms around. eFileCabinet offers granular control over security, file sharing, versioning, and more. AI features help you automatically categorize your files, and optical character recognition enables you to search any data inside scanned files. The only downside to eFileCabinet is that it can be expensive, especially if you have a lot of users or need integration add-ons.",
    "In our eFileCabinet review, we’ll help you decide whether this document management platform is right for your business.",
    "eFileCabinet offers three pricing options. The Advantage plan costs $55 per user per month if billed annually and includes 1 TB of storage along with all of eFileCabinet’s essential features. However, you’re limited in what add-ons you can purchase, so the eFileCabinet isn’t very extendable with the Advantage plan.",
    "The Business plan costs $99 per user per month if billed annually, and includes 5 TB of storage for your business. This plan includes side-by-side document previews and integrations with Microsoft OneDrive and Google Drive. It also enables you to purchase add-ons for Salesforce integration, single sign-on, automated workflows, and email integration.",
    "The Unlimited plan costs $199 per user per month billed annually. This plan includes all of eFileCabinet’s add-ons plus unlimited document storage.",
    "eFileCabinet is packed with features to help employees share files, manage documents, and streamline workflows.",
    "One of the best things about eFileCabinet is how simple it makes file sharing. With this software, you can instantly share files with anyone, inside or outside your organization. There is no limit to the number of guest users you can have working on documents inside your account, regardless of your plan. Plus, you have control over editing permissions and can opt to receive notifications for when a shared file is downloaded.",
    "Notably, eFileCabinet also enables you to request files from other users or guests. When making a file request, you can create multiple document fields and decide whether they’re required or optional. You can also preset the upload location for files so that they are automatically uploaded to the folder where they belong.",
    "One of the ways that eFileCabinet helps keep your business organized is with folder templates. With folder templates, you can create standardized directories with pre-named folders. For example, you could build a template in which a parent folder contains 12 sub-directories, each with the name of an individual month.",
    "The advantage to this system is that every file you create or receive has a home. In addition, it’s easy to standardize folder structures for all of your employees across your business. That makes it easier to share and locate files and eliminates the potential confusion that comes from every employee creating their own filing system.",
    "Business and Unlimited users have access to automated document workflows, which is a powerful way to streamline your business. One application that eFileCabinet highlights is to automatically name and file an incoming document based on the presence of certain keywords in the document itself. You can also use workflows to split form fields into searchable subcategories, which makes your document searches even more powerful.",
    "eFileCabinet’s web platform is generally very easy to navigate, with a three-panel design that enables you to view your entire folder directory, the files within a selected folder, and a preview of an individual file. There’s also a search bar for quick document searches and a favorites panel for easy access to your most-used folders.",
    "However, it’s worth noting that you cannot edit documents inside eFileCabinet. This is a little disappointing, especially when you just need to make simple changes to a Word document or form. That said, you can save unlimited file versions, which is nice for working on projects with lots of revisions.",
    "eFileCabinet also offers mobile apps for iOS and Android. One notable thing about the mobile apps is that they enable you to take photos of any paper document and instantly upload them to the eFileCabinet cloud.",
    "eFileCabinet offers support by phone, email, and live chat from 7 am to 6 pm Mountain Time, Monday to Friday. You can purchase 24/7 phone support as an optional add-on (price by quote only). eFileCabinet also has an online knowledge base that includes very detailed user guides for most of the software’s key features.",
    "eFileCabinet hosts your documents in the cloud and takes security seriously. All files are encrypted at rest and your connection to the cloud is encrypted with SSL. Two-factor authentication during login is also a standard feature.",
    "In addition, administrators have a significant amount of control over the software. You can set password complexity requirements, opt into IP address whitelisting, or limit login times. Administrators also have access to complete activity logs for all users.",
    "The only security feature we missed was the ability to set download limits on shared files. eFileCabinet also offers quick-access URL links to documents, which, although convenient, are not very secure.",
    "There’s a lot to like about eFileCabinet. But if it doesn't have the features or integrations your business needs, consider Dokmee or DocuWare. Dokmee is designed for enterprise businesses, and workflow automation is standard. DocuWare offers additional mobile tools and compliance features, along with a whopping 500 integration options. Both platforms offer pricing by quote only, but expect them to be more expensive than eFileCabinet for medium-sized businesses.",
    "eFileCabinet is a powerful document management software with a lot of good features for small and medium-sized businesses. The platform makes it easy to standardize file organization across your business and to automatically organize files using AI-based workflows. It also has robust support for file sharing and governance. Although eFileCabinet is expensive, the degree to which it can streamline your business may well be worth the cost."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "11": "Interface and in use",
    "14": "Support",
    "15": "Security",
    "18": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "eFileCabinet": "https://www.efilecabinet.com/",
    "best document management software": "https://www.techradar.com/best/best-document-management-software"
  }
}