{
  "source": "https://www.techradar.com/reviews/on-cloudultra",
  "title": "On Cloudultra review",
  "category": "fitness",
  "updated": "2021-04-09T15:25:47Z",
  "author": "fergus-scholes",
  "summary": "On's first ultra shoe is comfortable, supportive and responsive",
  "verdict": "The On Cloudultra manages to pretty well replicate the nimble feel of a lighter weight road running trainer, while offering enhanced support and comfort, making it well suited to longer runs. The ride is responsive and the sock-like upper (with integrated tongue) grips your foot nicely. It’s a brilliantly executed shoe, only let down by the outsole, which we found to be on the slippier side on wet urban surfaces.",
  "pros": [
    "Great support for your foot",
    "Generous comfort for longer runs",
    "Responsive feel",
    "Good right out of the box"
  ],
  "cons": [
    "Lack of traction on wet surfaces",
    "Not easy to quickly slip them on"
  ],
  "article": [
    "Straight out of the box, the On CloudUltra are good to go for long runs without any niggles or breaking in period. With generous cushioning, they're comfortable yet not cumbersome or unresponsive, somehow maintaining a precise feeling. At 295g, they're sufficiently lightweight, and have a generous heel to toe drop of 8mm.",
    "The upper is on the stiffer side, but not in a bad way – it adds further to the supportive nature of the shoe. As On’s first ultramarathon specific shoe, they're a great first effort that will work well for many runners.",
    "Released on 4th March 2021, the Cloudultra is a brand new shoe in On’s lineup. At a cost of $179.99 / £160 / AU$269.95, they're far from cheap, but then again, other comparable ultra running trainers do tend to be similarly priced.",
    "The On Cloudultra has a fully featured spec list to provide that extra level of comfort and protection required for runs of 50km and above. The bigger stack height, 8mm heel to toe drop and supportive upper mean you’re as well equipped for the rigors of an ultra as possible.",
    "Instantly noticeable are the double layer of CloudTec in the midsole – the distinctive holes that offer both comfort and a springy take off – as well a generous helping of Helion superfoam, On’s EVA foam that promises more energy return and cushioning. So, in theory, these have the necessary features for a comfortable ultramarathon trainer.",
    "Adding to their performance is the Speedboard sandwiched between the upper and the midsole – On claims this piece of thermoplastic helps give forward propulsion, and it doubles up as a rockplate.",
    "The outsole uses On’s Missiongrip rubber and features moderate lugs which are neither aggressive or minimal, sitting nicely in the middle to be suitable on a wide range of terrain.",
    "The upper is made from a durable and breathable sandwich mesh upper. It’s perforated, and reinforced with lightweight TPU (a protective and flexible plastic) with integrated tongue for a sock-like fit. On's all-new FlipRelease tool allows lace slackening in an instant if your feet swell up and you need some additional space in the toe box area.",
    "The ride of these in reality does indeed match up to the theory. There’s a generous amount of cushioning for those longer runs, but without feeling remotely spongy or clumsy, and you feel nimble and precise on your feet too. The ride of the shoe has been really well executed, and they’re comfortable right out of the box.",
    "Turning to the outsole, On have used their own Missiongrip rubber which, it must be said, has something to be desired. In the dry, traction is fine. But in the wet, we found the grip wasn’t good, particularly in an urban setting, on cobbles, bricks, paving slabs and manhole covers.",
    "Whether this is the Missiongrip itself or a possible lack of surface area in contact with the floor – due to the wide channels and grooves on the outsole – is hard to say, but they are slippy in the wet. Lugs are average, so on trails you should be fine on average terrain as well as smoother terrain.",
    "It’s also worth noting that some parts of the sole aren’t covered in Missiongrip – namely the central channels between the Clouds – leaving the softer EVA foam midsole exposed. It’s therefore likely that with repeated use on technical terrain, pebbles or loose rocks for example, it could more easily be damaged and lessen the life of the shoe compared to other trainers that have complete outsole coverage.",
    "The upper is ever so slightly stiff, but this doesn’t impact comfort, it actually makes your foot feel well supported and protected. It’s nicely breathable thanks to perforations, but not too large so debris will still be kept out.",
    "Unlike most shoes, the tongue isn’t an independent piece of material, rather it’s a continuous piece of material integrated with the rest of the upper liner, with a sock-like fit around your ankle. This offers some additional support, helps to keep annoying debris from getting into the shoe, and means there’s no slipping of the tongue off to one side.",
    "The one downside of this is they’re less quick and easy to slip on and off, because the space that your foot enters the shoe via is a set diameter. Albeit there is 10% spandex offering some stretch, it is still a two-handed job, with one hand acting as a shoehorn at the back as you wiggle your foot into the shoe – otherwise it’d be impossible to get on.",
    "On the lower part of the laces, you’ll notice a small plastic tab, a new system from On called the FlipRelease. By flipping it around 180 degrees, it releases the laces to give more room to the lower part of your foot, without needing to undo from the top and feed slack down. We didn’t find this particularly useful while running, but if stopping for a water break, it would be a quick way of offering some respite to swollen feet.",
    "All in all, both upper and sole are great, with good design, quality materials and craftsmanship, combined in a great looking package."
  ],
  "headers": {
    "0": "Two-minute review",
    "2": "Price and release date",
    "3": "Design",
    "8": "Performance",
    "17": "Don't buy it if"
  },
  "links": {
    "On CloudUltra": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1531258119410840000&xs=1&url=https%3A%2F%2Fwww.on-running.com%2Fen-us%2Fproducts%2Fcloudultra&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fon-cloudultra"
  }
}