{
  "source": "https://www.techradar.com/reviews/keenow-vpn",
  "title": "Keenow VPN review",
  "category": "computing",
  "updated": "2021-01-26T19:02:10Z",
  "author": "sead-fadilpasic",
  "summary": "A good VPN service with average speeds",
  "verdict": "Keenow VPN unblocks a bunch of geo-restricted services, allows torrenting, has nice apps, supports unlimited VPN connections and lets you request a refund within 30 days of payment. However, its download speeds are nothing special, some of your data is logged and there are certainly cheaper VPN solutions on the market.",
  "pros": [
    "Unblocks Netflix, BBC iPlayer",
    "Unlimited simultaneous connections",
    "Virtual router option",
    "No-questions-asked 30-day money-back guarantee",
    "Supports torrenting"
  ],
  "cons": [
    "Average speeds at best",
    "Some logging",
    "There are cheaper VPNs"
  ],
  "article": [
    "Keenow is a VPN and proxy service that aims to to bring internet anonymity and freedom to netizens all over the world.",
    "The VPN service was developed by Keen Media Group, a team of IT professionals from various countries, united in an effort to “overcome web censorship”.",
    "Pricing starts with a one-month plan at $9.95/month, followed by a six-month option at $6.95/month, and finally a one-year subscription at $5.79/month. You can choose whether you want to pay via a credit card, PayPay or cryptocurrency.",
    "Regardless of the plan, you’ll be able to run as many simultaneous VPN connections as you’d like, as long as you stick to the fair usage policy.",
    "Keenow may not have a traditional free trial, but its risk-free no-questions-asked 30-day money-back guarantee is certainly tempting for anyone cautious about giving their money to just any VPN provider.",
    "Keenow has a lot to offer, although it falls down in a few key areas. For instance, the level of data logging is higher than, say, ExpressVPN, and it charges more on a monthly basis than NordVPN, Surfshark, or CyberGhost, all of which offer longer subscription terms and higher discounts.",
    "Fans of popular streaming services everywhere rejoice! Keenow can help you access Netflix, BBC iPlayer, Hulu and more, even if the content isn’t available in your current location.",
    "The company behind Keenow VPN is called Keen Internet Technologies Ltd and is headquartered in Israel. In the provider’s FAQ section, we also learn that the VPN service was developed by Keen Media Group, a team of IT professionals from various countries, united in an effort to “overcome web censorship”.",
    "It has over 300 servers (you can see their uptime on the server status page) in more than 50 countries, including Moldova, Turkey, Cyprus, Russia, Saudi Arabia, United Arab Emirates, Israel, China, Colombia, Mexico, India, and others. None of the servers are virtual, which means all of them are physically located where indicated.",
    "Keenow’s Privacy Policy details that the provider keeps “bandwidth usage log of data transmitted (upload and download) during your VPN and Proxy sessions”, “a time stamp when you connect and disconnect to our VPN service or Proxy servers”, as well as “the IP address used by you to connect to our VPN or Proxy servers.” It adds that the company doesn’t monitor or store any of the data sent or received over the VPN tunnel.",
    "To make sure all your private information remains private with its platform, Keenow uses the OpenVPN and IKEv2 connection protocols with up to AES-256 encryption. There’s also a Stealth mode for unblocking content in China, which seems to obfuscate the VPN traffic. According to the customer agent we talked to, WireGuard support is in the works as well.",
    "Torrenting and P2P traffic are supported but only on the provider’s New York and Netherlands servers.",
    "The Windows app is equipped with a special feature called Virtual Router, which allows you to set up a new VPN WiFi network from your device and protect multiple devices with Keenow’s VPN platform. Simple and easy-to-follow instructions on how to make this happen are available on the website.",
    "Keenow has easy-to-use apps available for Windows, macOS, iOS, Android, Android TV and Amazon Fire OS. Other platforms are supported through manual installation and include Chrome OS, PlayStation, Xbox, Roku, Smart TVs, and several types of routers.",
    "Its Android app was rated by 28 users (out of 10,000+ who installed it), who gave it a median score of 3.0 stars (out of 5). The app was last updated on January 29, 2019. The provider’s iOS counterpart was last updated on September 20, 2020, and so far has no reviews or ratings.",
    "If you need assistance, you can get in touch with customer support directly via email, contact form, or support ticket, and there’s even a handy Troubleshooting Wizard in the clients’ area that works via a chat bot.",
    "The website is a great source of information on anything concerning Keenow’s platform. There's a special section devoted to setup instructions, app user guides and an FAQ section with troubleshooting.",
    "You can also make contact via the provider's Facebook page and Twitter profile.",
    "Keenow is super-easy and beginner-friendly as it has apps for all the major platforms. All it takes is a few clicks to get you up and running and even manual installation is easy thanks to the detailed instructions on the website.",
    "Wanting to test the provider’s download speeds, we first connected to a server in Bulgaria, which was one of the closest to our physical location. It delivered an average speed of 12.26Mbps on a 64Mbps testing connection. We then carried our tests a bit further away, to the UK, where the speeds were a bit lower: 9.34Mbps.",
    "It was then time to cross the Atlantic ocean and test a server in the USA. We picked New York, and only got 2.77Mbps, which is enough for browsing but may cause problems for streamers.",
    "Finally, we decided to check in on a server in Hong Kong, which delivered just 1.64Mbps.",
    "Keenow does what it’s supposed to: it hides your identity online and gives you access to various geo-blocked services.",
    "On top of this, it has user-friendly native apps, allows unlimited simultaneous connections, supports torrenting and has a generous money-back policy.",
    "The main flaws that keep it from competing with the industry’s top players are its average download speeds and data logging practices that not everyone will feel comfortable with."
  ],
  "headers": {
    "2": "Price",
    "5": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "9": "Privacy and encryption",
    "13": "Support",
    "18": "Speed and experience",
    "22": "Verdict"
  },
  "links": {
    "Keenow": "https://www.keenow.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "proxy": "https://www.techradar.com/best/proxies",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "server status page": "https://status.keenow.com/",
    "Privacy Policy": "https://www.keenow.com/legal/privacy.html",
    "Android app": "https://play.google.com/store/apps/details?id=com.keenowvpn.android&hl=en_GB&gl=US",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1305190238453443800&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fae%2Fapp%2Fkeenow-vpn-premium-plan%2Fid1318027680",
    "email": "mailto:support@keenow.com",
    "contact form": "https://clients.keenow.com/panel/submitticket.php?step=2&deptid=1",
    "support ticket": "https://clients.keenow.com/panel/submitticket.php",
    "setup": "https://www.keenow.com/setup/",
    "app user guides": "https://www.keenow.com/setup/keenow-apps/",
    "FAQ section with troubleshooting": "https://www.keenow.com/free-smart-dns-faq/",
    "Facebook page": "https://www.facebook.com/Keenow.Unblocker",
    "Twitter profile": "https://twitter.com/KeenowUnblocker"
  }
}