{
  "source": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
  "title": "Bose QuietComfort 35 II review",
  "category": "audio-visual",
  "updated": "2021-11-22T19:25:52Z",
  "author": "lewis-leong",
  "summary": "Smart noise-cancelling headphones for voice assistant diehards",
  "verdict": "The Bose QC35 II shows why the company is so popular amongst travelers with class-leading noise cancellation and balanced sound. They may not be the most detailed or exciting-sounding headphones but they will sound great to most listeners. The addition of Google Assistant is a nice addition but not a must-have.",
  "pros": [
    "Class-leading noise cancellation",
    "Balanced, but soft sound quality",
    "Incredibly comfortable"
  ],
  "cons": [
    "No auto play/pause",
    "No instant mute",
    "Plastic build, plain design"
  ],
  "article": [
    "The Bose QuietComfort 35 II was a great pair of wireless noise-cancelling headphones for its time - and remain one of the best despite being usurped by the newer Bose Noise Cancelling Headphones 700 and Bose QuietComfort 45.",
    "While it's now a few years old, the QuietComfort 35 II offer both wireless operation and active noise cancellation as well as built-in support for Google Assistant.",
    "With Google Assistant onboard, you can simply press and hold a button to interact with Google without yelling, “OK Google.” The headphones will also read back notifications to you so you don’t have to dig in your pocket or bag for your smartphone.",
    "Overall, we feel the QC35 II NC remain a solid recommendation for travelers and commuters, especially if you can nab a pair during Black Friday or Cyber Monday when they're typically $100 or more off their regular retail price.",
    "The Bose QC35 II NC look exactly like the previous generation headphone save for the new Google Assistant button located on the left earcup. The headphones come in black or silver and its design is ... well, stiflingly generic. This makes them perfect for modest business class travelers, but less perfect for those who like their headphones to make an impression.",
    "Also disappointing is its plastic build, which is nice for saving weight but feels extremely cheap especially compared to luxury headphones like the Master & Dynamic MW50, which bathes your head with lambskin leather and aluminum.",
    "Thankfully, the plastic build doesn’t affect the headphone’s ability to take punishment as it feels very solid. The headphones also come with a hard case for traveling, which is nicer than the pouches that many headphone makers opt to include.",
    "The plastic build does help the QC35 II NC in terms of comfort and we were impressed by just how comfortable the headphone was to use for extended periods. Although plastic doesn’t feel as nice as metal, it does wonders in weight savings which travelers will love on long flights.",
    "The pads Bose use in the QC35 II NC are amazing, as they block out a ton of ambient noise even when noise cancellation is switched off. This is great if you want to preserve battery and listen with noise cancellation off.",
    "Similarly, controls on the headphone are simple and effective: You have a power and pairing slider on the right earcup as well as buttons for volume up/down and playback. The left earcup houses just one button for Google Assistant, though you can remap the button to toggle noise cancellation levels using Bose’s Android or iOS app.",
    "Google Assistant is the Bose QC35 II NC’s headline feature and it works well for the most part. Throughout our testing, we were impressed by the speed and accuracy of Google Assistant and how well the headphones were able to pick up our voice even on a crowded train and coffee shop.",
    "Before you power on the headphone for the first time, you’re prompted to download the Bose app for your phone as the headphone will require using the app for many features like toggling noise cancellation, remapping the Google Assistant button, updating firmware and more.",
    "The app is simple and worked well though we suffered some connectivity issues from time to time on Android where the app wouldn’t detect our headphones. Restarting the app would fix this so hopefully Bose will continue working on its mobile app to be more stable.",
    "Using Google Assistant with the Bose QC35 II NC works just like it would on Google Home. You can ask it to read headlines, add reminders, or myriad other questions. The Assistant will also read you your notifications as they come in, which is nice but may be redundant if you have a smartwatch already.",
    "In short, the addition of Google Assistant is nice to have but is by no means the reason you should buy the Bose QC35 II NC: buy this headphone for its excellent noise cancellation, balanced sound, and incredible comfort.",
    "Where Bose fall short is simple things like automatically pausing your music when you take off the headphones. There’s also no instant-mute feature like on the Sony WH-1000XM2 where you can put your palm over an earcup to hear what’s going on around you. This feature is a godsend to travelers who need the ability to hear the airport PA quickly. It’s disappointing Bose doesn’t include these features when the budget Plantronics BackBeat Pro 2 has both.",
    "Bose’s forte is active noise cancellation and it shows with the QC35 II NC. Switching on noise cancellation is like walking into a quiet room after being on a busy city street. The headphone does an excellent job of drowning out everything from the rumble of a train, cars driving by and even voices.",
    "There’s still some pressure we felt with noise cancellation turned on but it wasn’t bad. (However, those sensitive to noise cancellation pressure may not like them.) The headphones do an excellent job of blocking out ambient noise even with noise cancellation turned off, which is a testament to Bose’s earpad design.",
    "In terms of sound, the Bose QC35 II NC is good, but not class leading. While tonal balance is relatively neutral with a slight mid-bass bump, the sound is somewhat soft when compared to competitors like the Sony WH-1000X M2 (previously the Sony MDR-1000X). This means dynamic range is a bit limited and makes for a somewhat dull presentation. Resolution is good but not great and sound stage is about average.",
    "Most listeners will find the sound quality of the Bose great if taken in isolation. Audiophiles will want to go with the Sony WH-1000XM3 or Sennheiser Momentum Wireless 2 instead.",
    "Battery life is rated at an excellent 20 hours with noise cancellation turned on and listening at moderate volumes. We found this rating to be spot on and you won’t have to worry about charging these headphones in the middle of a flight. However, the battery is not removable like the B&O Beoplay H9 so bring a microUSB charging cable and a battery pack just in case.",
    "If you want to save some battery life, you can listen in wired mode with noise cancellation still on, which is a nice option to have. It’s annoying that Bose chose to use a 2.5mm to 3.5mm cable - which means finding a replacement won’t be as easy - but it's not a deal breaker by any means.",
    "Bose took the already-excellent QC35 and updated with Google Assistant. The headphone is identical in every way save for the new Google Assistant button. This means you still get the class-leading noise cancellation Bose is known for, good sound quality, and incredible comfort.",
    "The Google Assistant works well on either Android or iOS and provides a similar experience to using a Google Home. The headphones will also read back your notifications, which may be redundant for smartwatch users. Google Assistant is nice to have but is by no means the reason you should buy this headphone.",
    "Taken as a whole, the Bose QC35 II NC is an excellent headphone for travelers and commuters. Bose has found a good balance of features that will satisfy most mainstream listeners. Audiophiles however, will want to check out our roundup of the best headphones for the very highest sound quality."
  ],
  "headers": {
    "4": "Design",
    "10": "Features",
    "16": "Performance",
    "22": "Verdict"
  },
  "links": {
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "Bose QuietComfort 45": "https://www.techradar.com/reviews/bose-quietcomfort-45",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Master & Dynamic MW50": "https://www.techradar.com/reviews/master-dynamic-mw50-wireless",
    "Google Home": "https://www.techradar.com/reviews/google-home",
    "Sony WH-1000XM2": "https://www.techradar.com/reviews/sony-mdr-1000xm2-wireless-headphones",
    "Plantronics BackBeat Pro 2": "https://www.techradar.com/reviews/plantronics-backbeat-pro-2",
    "Sony MDR-1000X": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/sony-mdr-1000x-wireless-headphones-1327770/review",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Sennheiser Momentum Wireless 2": "https://www.techradar.com/reviews/sennheiser-momentum-2-on-ear-wireless",
    "B&O Beoplay H9": "https://www.techradar.com/reviews/bo-beoplay-h9",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340"
  }
}