{
  "source": "https://www.techradar.com/reviews/ipad-mini-2019",
  "title": "iPad mini (2019) review",
  "category": "tablets",
  "updated": "2021-06-11T13:47:41Z",
  "author": "matt-swider",
  "summary": "The only small tablet you should consider",
  "verdict": "The iPad mini 2019 is Apple’s most totable iPad, and it’s deceptively powerful for its small size. It has a bright 7.9-inch display that works with the Apple Pencil and a chipset that smokes the small tablet competition. Its price is equally deceptive, costing more than the larger iPad 9.7. For its asking price, we would have loved to have seen an 'iPad Pro mini' and Apple Pencil Gen 2 support, but it’s hard not to love this charming little tab.",
  "pros": [
    "Perfect size to tote around",
    "Works with the Apple Pencil",
    "Surprisingly powerful specs"
  ],
  "cons": [
    "Unchanged, bezel-heavy design",
    "Uses the older Apple Pencil",
    "Costs more than the iPad 9.7"
  ],
  "article": [
    "Update: Apple has unveiled iPadOS 14, the newest version of its operating system designed for iPads, and explicitly confirmed the iPad mini (2019) models will get it. So if you choose to buy this tablet, know that you'll get to download this software when it's released later in 2020. To know everything that's coming, visit our iPadOS 14 page here.",
    "The iPad mini 2019 is the iPad mini 5 that you've been waiting for Apple to deliver, and it's everything you've wanted – as long as you didn't want a dramatic upgrade.",
    "With Amazon Prime Day 2021 scheduled for June 21 and 22, we could see some discounts on the iPad Mini (2019) so if you're considering buying it, you could save cash by waiting a short while.",
    "It's Apple’s most satisfyingly totable iPad and proof that things won’t change very much when serious small tablet competition is nowhere to be found in 2019.",
    "The familiar 7.9-inch display feels perfectly sized to grip in one hand and operate with two, just as it did when the iPad mini 4 released nearly four years ago. Almost nothing has improved on the outside.",
    "Beneath the bright display, however, Apple tweaked the iPad mini 2019 to work with the first-generation Apple Pencil. It’s so easy to quickly pick up this tablet, flick open the Smart Cover and instantly scribble some notes. It’s portable and carefree to use and then simply toss in a bag.",
    "This pint-sized iPad is deceptively fast, too, thanks to its iPhone XS-class chipset. The small screen lends it to more read-and-watch functionality than write productivity, but it can handle Adobe Lightroom editing just as well as the iPad Air 2019 from a performance standpoint.",
    "We’ve also been impressed with its battery, netting us slightly better results than Apple’s promised 10 hours of battery life in our tests. It’s coupled with fast-charging capabilities so you don’t have to wait forever to juice up this version of the iPad mini once it’s fully drained.",
    "But it’s also deceptively expensive. It actually costs more than the larger iPad 9.7 due to its superior fully-laminated screen, markedly faster chipset and convenient quick charging tech. Apple’s “small” is still a medium when it comes to iPad pricing.",
    "Its bezel-heavy design and lack of second-gen Apple Pencil support mean it’s not the scaled-down version of the iPad Pro we were hoping for in 2019. Instead, it’s a minor, but overdue upgrade that brings the charming iPad mini into modern times.",
    "iPads have traditionally run on the same iOS as iPhones, but in September 2019 Apple released an offshoot of iOS 13 for its tablets, called iPadOS.",
    "This new operating system helps turn iPads from large iPhones into impressive mac-esque work stations, with functions like gesture controls and improved markups. Check out our iPadOS hub for everything you need to know about the new operating system.",
    "Update: iPadOS 15 is coming to the iPad Mini (2019), Apple has confirmed. This update to the operating system brings changes to multitasking, widgets, the Notes app and more, and adds an app library.",
    "The iPad mini may be smaller than the competition, but it's not the cheapest iPad you can buy – that honor goes to the newer iPad 10.2 (2019) which starts at $329 / £349 / AU$529 and is often on sale for even cheaper.",
    "The new iPad mini starts at $399 / £399 / AU$599 / AED 1,599 for a 64GB Wi-Fi-only version. The top-end model is quite a lot more at $679 / £669 / AU$1019 / AED 2,729. That version comes with 256GB of storage and a cellular connection.",
    "Remember, accessories like the Smart Cover and fast charging USB-C-to-Lightning cable will pad your bill, but everything is less expensive than the iPad Air (2019) and significantly cheaper than the iPad Pro 11 and iPad Pro 12.9.",
    "Apple doesn’t have a foldable phone yet, but if it did, we’d hope it folded out into the iPad mini 2019. We found its 7.9-inch screen to be the perfect size to carry the iPad one-handed and reach our thumbs across the entire on-screen keyboard with two hands.",
    "There's very little new here, though, and that leads to two schools of thought on the design. The first is the contrarian view: that Apple hasn’t bothered to change its 'blown-up older iPhone' design. It’s undeniable dated. The second way is that Apple didn’t need to change it.",
    "People love the iPad mini series, and for good reason. It’s lightweight at 300g (0.66 pound) and perfectly portable, so it’s easy to toss in a bag without much care. You can take it almost anywhere, which is the opposite way we feel about the iPad Pro 12.9 sometimes.",
    "But, the 'iPad Pro mini' this is not, and that opens this tablet up to good bad and ugly attributes: the age-old 3.5mm headphone jack and reliable Touch ID home button remain (good), only the less refined first-generation Apple Pencil is compatible (bad), and bezels remain thick around the screen (ugly).",
    "It has a bright, fully-laminated Retina display, same as the iPad mini 4. From a technical explanation, it means the protective glass is wafer-thin and the screen digitizer is pressed up against it, unlike the thicker glass and resulting gap seen in the iPad 9.7 screen. And from a practical standpoint, it means drawing with the Apple Pencil feels more natural, like you’re drawing directly on the screen.",
    "New to the iPad mini series is a wide P3 color gamut to display more shades of color and True Tone Display technology. True Tone adjusted the white balance to match our environment, so outside in the park, the screen was bluer and, transitioning inside the in the TechRadar office, we saw a faint yellow tint that was easier on our eyes."
  ],
  "headers": {
    "13": "Price and release date",
    "16": "Design and display"
  },
  "links": {
    "iPadOS 14": "https://www.techradar.com/news/ipados-145",
    "iPadOS 14 page here": "https://www.techradar.com/news/ipados-145",
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "iPad mini 4": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-mini-4-1303873/review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPad Air 2019": "https://www.techradar.com/reviews/ipad-air-2019",
    "iPadOS": "https://www.techradar.com/news/ipados-release-date-and-news",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15",
    "iPad Air (2019)": "https://www.techradar.com/reviews/ipad-air-2019",
    "iPad Pro 11": "https://www.techradar.com/reviews/ipad-pro-11",
    "iPad Pro 12.9": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones"
  }
}