{
  "source": "https://www.techradar.com/reviews/vivo-x60-pro",
  "title": "Vivo X60 Pro review",
  "category": "phones",
  "updated": "2021-11-23T08:24:06Z",
  "author": "tom-bedford",
  "summary": "Vivo's top 2021 smartphone",
  "verdict": "With a good-looking design, well-rounded camera array and slick user interface, the Vivo X60 Pro is a solid jack-of-all-trades Android phone. However, it launched at the same price as some higher-spec contemporaries, making it harder to recommend.",
  "pros": [
    "Smooth UI experience",
    "Useful selection of cameras",
    "Appealing design"
  ],
  "cons": [
    "Price is too high",
    "Font bugs",
    "Weaker specs than rivals"
  ],
  "article": [
    "Vivo’s main line of 2021 smartphones is the X60 range – this was technically launched in late 2020 in China, but its global rollout was in 2021. Of the four phones in the series, the Vivo X60 Pro is the only one coming to most regions.",
    "This is a top-end smartphone, with a price that matches the likes of the Samsung Galaxy S21 and Xiaomi Mi 11; in the specs department, though, the Vivo X60 Pro doesn’t quite rival those top-end powerhouses, which is why we can’t score it higher.",
    "That’s not to say this is a bad phone, by any means, and it’s hard to find any major faults with the Vivo X60 Pro – there were a few user interface issues that we’ll detail in the Software and Performance and Specs sections, and its battery life wasn’t quite as strong as we’d like, but neither of these issues ruins the experience of using the phone.",
    "In fact, there’s lots about the phone we found ourselves liking. It has a good-looking design, with an understated rear and a screen with gently-curving edges that we found ourselves admiring from time to time.",
    "The user interface is slick too, thanks to both its design and a 120Hz display that makes navigating the device snappy and smooth. And while the photo quality isn’t groundbreaking, the Vivo X60 Pro’s camera combination of main, ultra-wide and telephoto is something of a rarity, so that alone is enough to celebrate.",
    "Where the Vivo X60 Pro falls down is in comparison with the competition – it costs the same as Samsung and Xiaomi’s smartphones, but doesn’t compete well enough. The handset doesn’t have the top chipset available to it, its cameras are good but not great, and the battery life and charging speed leave a lot to be desired.",
    "If you find the Vivo X60 Pro in the sales for a lower-than-launch price you should consider buying it, as it’s a great Android phone – it’s just hard to recommend at the list price, with the Samsung Galaxy S21 and Xiaomi Mi 11 overshadowing it.",
    "The Vivo X60 Pro launched for £749 / AU$1,099 – that converts to about $1,200, though Vivo doesn’t sell its smartphones in the US.",
    "For some context, at launch the Xiaomi Mi 11 cost exactly the same as the Vivo in both the UK and Australia for its 128GB storage version, and the Samsung Galaxy S21 cost $799 / £769 / AU$1,249 for the same – we weren’t kidding about the prices being similar (well, except in Australia for the Samsung phone).",
    "At 179g the Vivo X60 Pro is a fairly lightweight phone, which might make it appealing to some compared to the myriad super-sized smartphones that proliferate this price tier. It measures 158.6 x 73.2 x 7.9mm, so it’s quite thin when put beside competing phones too.",
    "The phone has a USB-C port, as well as a volume rocker and power button on the right edge, but there’s no 3.5mm headphone jack – sorry, wired headphone fans. All the buttons felt within reach for us, and we found the handset pretty easy to use one-handed.",
    "The display and rear of the phone are coated in glass, while the frame is aluminum; it looks and feels very sleek, although it might not be as durable against drops and knocks as a plastic device.",
    "On the back is a rectangular camera array housing the three rear snappers – this doesn’t stick out too far, and doesn’t affect the ‘pocketability’ of the phone at all.",
    "The phone comes in a choice of two colors: Shimmer Blue, a paleish pearlescent shade, or Midnight Black – the phone pictured through this review – and which looks distinctly navy-blue to us. Whichever color you opt for, this is a good-looking phone with an understated design.",
    "The Vivo X60 Pro has an average-looking screen for a phone of its price, but with how good the displays can look on this kind of handset, that’s not a bad thing. It’s a 6.56-inch panel that curves gently at the edges, and is broken up by a cut-out for the front-facing camera at the top edge. The bezels around it are unobtrusively thin.",
    "In terms of tech specs, you’re looking at 1080 x 2376 resolution, or FHD+, which is generally average for a smartphone though a little behind the Xiaomi Mi 11 or Samsung Galaxy S20, both with 2K displays. It’s AMOLED, with support for HDR10+, so colors are bold and bright.",
    "That’s a solid array of tech specs, though the screen lacks the high resolution or bespoke display features that phones from top competitors like Xiaomi, Samsung and Oppo offer.",
    "The screen refresh rate is 120Hz, as on most modern premium phones, which means the image updates 120 times per second, where the ‘standard’ that older and budget phones use is 60Hz. This makes motion look smoother when scrolling or playing games, though it drains battery quickly - if you want, you can drop to 60Hz, or choose a smart-switch mode which jumps between the two depending on your task.",
    "The Vivo X60 Pro packs four cameras, one on the front and three on the back. On the rear, the main camera is a 48MP f/1.5 snapper, and we were generally impressed by its performance. Photos looked bright, with lots of detail, and the lens’s built-in gimbal stabilizer is really effective at countering the effects of shaky hands on a photo.",
    "For better or worse, however, the overall quality of a particular image felt very dependent on the whims of the post-processing. Close-up snaps looked great, with photos of food and other objects looking bright and bold, but the AI software wasn’t as handy at ‘fixing’ wider shots of parks or skylines, which had a reduced dynamic range as a result. Still, they didn’t look bad, and a quick spin through a photo-editing app could easily improve them.",
    "If we had one issue with the main camera, it’s that darker areas of otherwise-well-lit snaps were ‘crushed’ to black or near black making it harder to see details in these areas and leaving them looking murky compared to vibrant areas elsewhere in the image.",
    "The second rear camera is a 13MP f/2.5 telephoto camera for zoom shots, which enables optical zoom up to 2x, and we’re pleased to see such a snapper here, as many flagship phones omit such a lens. Photos taken with this camera looked good, resembling non-zoomed photos in terms of vibrancy and detail, although with the same blacks-crushing issues as mentioned above.",
    "You can zoom beyond the optical limit up to 20x digital, and while snaps we took towards the long end of the range were too blurry to be usable, we often took good-looking photos in the 5x-10x range.",
    "Finally on the rear there’s a 13MP f/2.2 ultra-wide camera, with a much wider field of view than the main snapper. Photos taken with this were a little darker than their main-camera counterparts, but we were pleasantly surprised by the relative lack of distortion which often afflicts this kind of photo.",
    "An issue we found with a couple of the cameras, for which the software is probably to blame to some degree, is that they struggled to handle exposure. For some shots, bright lights or the sky were blown out, more so than you’d normally expect even on an average camera phone.",
    "The front-facing camera is a 32MP snapper with a f/2.5 aperture. Selfies looked vibrant and bright, and the high resolution lets you crop in to re-frame a shot. Portrait mode on this camera was frankly horrid though, as the automatic beauty features were far, far too overzealous in washing over textures and features – stick to ‘standard’ selfies.",
    "Video recording goes up to 4K resolution at 60fps, and while that spec may seem standard for a smartphone, it’s here that the main camera’s built-in gimbal stabilizer rears its beautiful head. Videos we recorded look incredibly smooth, no matter how jittery our hands were (or whether we were moving), perfect for action reels or post-coffee tests. Just note that the aforementioned gimbal stabilization is disabled if you turn the recording specs up to full.",
    "Beyond standard photography and videography, the Vivo X60 Pro has a few useful features including a fairly effective night mode, slow-motion and time-lapse video recording, and a moon photography mode that we sadly didn’t get the opportunity to test.",
    "Powering the Vivo X60 Pro is Qualcomm’s Snapdragon 870 chipset, which is a powerful processor that we’ve seen in a few mid-range and low-cost handsets, but it’s the phone’s biggest weakness compared to its rivals. Most top-end phones, and lots of mid-range ones too, use the Snapdragon 888, the most powerful processor available to Android phones at the time of the X60 Pro’s launch.",
    "As a result, the Vivo phone is powerful, but not as powerful as other phones that cost this much money – and if processing power is a priority for you, there are many cheaper phones that offer more of it.",
    "When we ran the device through a benchmarking test it returned a multi-core score of 3,381 – that beats out other Snapdragon 870 phones like the Poco F3 (3,369) and Moto G100 (2,875), but doesn’t match up to Snapdragon 888 handsets like the Realme GT (3,508), Xiaomi Mi 11 (3,569) or OnePlus 9 (3,654).",
    "In practice, we found the Vivo X60 Pro fairly snappy in use, especially for gaming, with freezes or lagging fairly rare when playing top titles. Depending on how you use your phone, and which games you play (and at what graphical or performance settings), you may find you don’t need the top processing power the Snapdragon 888 provides over the 870.",
    "There’s a game optimization mode, as many phones have, which channels maximum processing power to the game you’re playing, and mutes notifications while you’re playing. We found that this didn’t turn off swipe navigation, though, so when tapping controls at the top of the screen we’d sometimes accidentally swipe down and bring up the notifications list. Also, enabling this mode doesn’t automatically mute notifications by default – you have to do that yourself.",
    "We didn’t rate the X60 Pro’s speakers – music played through them sounded a little tinny and flat. You might not mind this when playing a quick game, but you might want to use headphones for listening to music or watching a movie.",
    "Like most Android phone makers, Vivo uses its own Android ‘fork’ that it lays over the top of Google’s software – Vivo’s is called Funtouch.",
    "Funtouch 11, a version of Android 11, brings mainly cosmetic changes to the user interface, but compared to lots of custom UIs it’s pretty similar to ‘stock’ Android, and there’s also no real bloatware. We found the phone’s software lovely and clean, and navigating the interface felt smooth and fluid, especially thanks to the high display refresh rate.",
    "We did notice one weird bug though. As with most phones, you can change the UI font, and there was a major bug in one of the pre-installed fonts (i.e., not a third-party font that we installed). When using this font, there was always a large gap in the text after punctuation, breaking up sentences with weird spaces. It’s not clear why this happened, but we’d expect pre-installed customization features to work better than this.",
    "One useful aspect of Funtouch is that it has better horizontal-screen functionality than most UIs, and you can scroll through menus when holding the phone in this orientation, which isn’t a common feature of Android phones – it’s useful for certain productivity and business functions.",
    "Another feature we appreciated was the customizable dynamic effects – for example, you can change the animation that appears when the phone is charging or when you input your fingerprint, and choose ambient light effects that appear on the curved edge of the screen when you’re playing music or receiving a notification. It’s not a game-changing feature, but it’s a cool addition that not all phones have.",
    "The Vivo X60 Pro has a relatively small battery compared to lots of its premium rivals – at 4,200mAh, it’s 300mAh less than the batteries in the OnePlus 9 or Oppo Find X3 Neo, two contemporaries, and we were never totally sure if the phone would last us a whole day of use or not.",
    "If we kept the phone in our pocket throughout the day, only using it for the occasional text or to stream music, we generally made it to bedtime with some juice left in the tank. But with more intensive use – say, a couple of games of Call of Duty: Mobile during the day plus some photography, social media and more, we’d often find battery anxiety kicking in.",
    "As with most phones, the Vivo X60 Pro has a battery-saver mode that reduces battery drain by turning off background syncing, limiting data consumption to 4G speeds, turning on dark mode and more, and this ensured the phone would definitely survive a day. But if you use your phone heavily, or easily get the battery jitters, you might find this phone isn’t ideal for you.",
    "Charging is at 33W, which pales in comparison to the Mi 11’s 55W, or the 65W of the OnePlus 9 series and Realme GT, although the Samsung Galaxy S21 is even slower at just 25W.",
    "While that’s a fair charging speed, which will see the battery charged from empty to full in just over an hour, fast-charging is becoming an expected feature on premium phones, and the Vivo device misses out.",
    "First reviewed July 2021",
    "You might also want to check out our Vivo X60 review"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Vivo X60 Pro price and availability",
    "9": "Design",
    "14": "Display",
    "18": "Cameras",
    "28": "Performance and specs",
    "34": "Software",
    "39": "Battery life",
    "44": "Don't buy it if..."
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Poco F3": "https://www.techradar.com/reviews/xiaomi-poco-f3",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Oppo Find X3 Neo": "https://www.techradar.com/reviews/oppo-find-x3-neo-review",
    "Vivo X60": "https://www.techradar.com/reviews/vivo-x60-india"
  }
}