{
  "source": "https://www.techradar.com/reviews/linksys-velop-wifi-6-ax4200",
  "title": "Linksys Velop WiFi 6 AX4200 review",
  "category": "computing",
  "updated": "2021-04-29T09:42:56Z",
  "author": "cliff-joseph",
  "summary": "Smart design, and speedy performance help the Velop to stand out in the crowded mesh market",
  "verdict": "Wi-Fi 6 mesh systems are still pretty expensive, but the Velop AX4200 is competitively priced, and provides admirable performance and ease of use.",
  "pros": [
    "Impressive Wi-Fi 6 performance",
    "Easy to use app",
    "4x Ethernet and 1x USB ports"
  ],
  "cons": [
    "Expensive",
    "Defaults to single, merged network",
    "Limited parental controls"
  ],
  "article": [
    "The attractive design and ease-of-use of Linksys’ Velop range of mesh networking systems has made it a popular choice with many home users who need to improve their home Wi-Fi. Linksys first added a Wi-Fi 6 model to the range last summer, but that model was pretty expensive, so it has now released a more affordable model called the Linksys Velop WiFi 6 AX4200.",
    "There are actually three models available - albeit with slightly confusing model numbers. Linksys claims that each Velop router - known as a ‘node’ - can cover areas of up to 2,700sq.ft, so you can buy a single node (model number: MX4200) for £229.99 ($249.99, around AU$410), and that will be fine for most small and medium-size homes with just one or two bedrooms.",
    "Larger homes, or homes that have thick walls that may block the Wi-fi Signal, can step up to the two-pack kit (MX8400) that we review here for £399.99 ($349.99, around AU$700), while owners of luxurious mega-mansions can opt for a three-pack (MX12600) that comes to £599.99 ($499.99, around AU$1,000). That’s still fairly expensive, of course, but Wi-Fi 6 is leading edge technology, and the tri-band Linksys Velop WiFi 6 AX4200 is still competitive when compared to other Wi-Fi 6 systems such as the Netgear Orbi WiFi 6.",
    "The new Linksys Velop WiFi 6 AX4200 sticks with Linksys’ familiar design, with those distinctive - and rather chunky - white plastic towers that stand 244mm high, and 114mm wide and deep.",
    "That means you’ll need to find a spot with plenty of room for each node, but that will also ensure that the internal antennae have lots of breathing space to fire off their high-speed Wi-Fi in all directions.",
    "As the name suggests, the Linksys Velop WiFi 6 AX4200 supports the latest Wi-Fi 6 technology - aka 802.11ax - with tri-band Wi-Fi providing a top speed of 4.2Gbps.",
    "That’s far faster than most home broadband services, so the Velop will handle 4K streaming video, music, or online gaming with no trouble at all. Each node has four Gigabit Ethernet ports for games consoles or other devices that may prefer a wired connection, and there’s also a USB port for connecting a USB storage device so you that can share it with other people on your network.",
    "The Linksys app is easy to use and provides a number of useful features, such as the ability to create a guest network, to temporarily block Internet access for individual devices, or to create a weekly schedule to limit access for the kids on school nights. You can prioritise your network bandwidth for devices, such as a gaming PC, that need top performance, and the app even has a ‘channel finder’ that can scan for other nearby networks and adjust the Velop’s Wi-Fi channels to reduce interference.",
    "The app does have some noticeable limitations, though. Parents can block Internet access for their children’s devices, but there are no filters to block access to unsuitable web sites or content, and the app simply expects you to type in the web addresses of several million dodgy web sites by hand. Another important limitation is that the app automatically merges the frequency bands to create a single network, but doesn’t provide an option to create separate networks on the 2.4GHz and 5.0GHz bands, which is something that more experienced users might require.",
    "The Linksys Velop WiFi 6 AX4200 does get full marks for ease of use, though. The Linksys app explains that you’ll need to use an Ethernet cable to connect one of the nodes to your existing broadband router in order to use its Internet connection, and then uses Bluetooth to connect to the node and set up your new network for you.",
    "It gives tips on where to place any additional nodes in order to get the best Wi-Fi reception, and then just asks you to provide a name and password for your new Velop network.",
    "We had the new mesh network up and running in a matter of minutes, and were impressed by its performance too. Devices in the same room as the first Velop node registered a connection speed of 110Mbps per second, and Steam downloads of 12.5MB/s - which is in line with the speeds from our normal router.",
    "However, our normal router can’t reach our back office, so we always have to rely on powerline adaptors to provide a wired connection for our office computers. But picking up my laptop and walking down the hallway to the office didn’t faze the Velop at all. It smoothly handed the wi-fi signal over to the second node that we placed in the hallway by the office, and maintained those speeds without any interruption at all.",
    "So while a super-fast Wi-Fi 6 mesh system such as this may be overkill for smaller homes, it will be ideal for owners of larger homes or buildings with thick walls that hamper wi-fi reception."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Design and features",
    "9": "Performance and getting started",
    "14": "Don't buy it if..."
  },
  "links": {
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Netgear Orbi WiFi 6": "https://www.techradar.com/reviews/netgear-orbi-wifi-6",
    "powerline adaptors": "https://www.techradar.com/news/the-best-powerline-adaptors"
  }
}