{
  "source": "https://www.techradar.com/reviews/epos-h3-review",
  "title": "EPOS H3 review",
  "category": "gaming",
  "updated": "2021-05-06T08:44:39Z",
  "author": "adam-vjestica",
  "summary": "The EPOS H3 is a terrific all-rounder",
  "verdict": "The EPOS H3 is an extremely comfortable headset that delivers well-balanced and detailed sound. Though it’s primarily designed for gaming, we found ourselves reaching for the H3’s to listen to our favorite songs, which is a testament to just how great they sound. If you’re looking for a wired headset that delivers in every area that matters – audio quality, comfort and crystal-clear communication – the EPOS H3 won’t let you down.",
  "pros": [
    "Clean and crisp audio",
    "Incredibly comfortable",
    "Sleek design"
  ],
  "cons": [
    "Massive microphone",
    "Volume wheel is finicky"
  ],
  "article": [
    "The EPOS H3 are slightly more expensive than similarly-specced gaming headsets, but they deliver on three core areas that make them a compelling purchase: they’re incredibly comfortable to wear, equipped with an excellent microphone and deliver a pleasingly rich and detailed sound signature that’s perfect for spatial audio.",
    "There are a few design quirks that we don’t like, however. The non-detachable microphone prevents these headphones from being anything but an “in-home” pair, and the flush volume dial isn’t the most intuitive method we’ve ever used. The low-end frequencies might be a touch too light for some, too.",
    "The competition from wireless headphones also means that wired headphones aren’t as much of a no-brainer as they were before. However, the versatility offered by being able to connect to anything with a 3.5mm headphone jack – Nintendo Switch, PS5, Xbox Series X and more – is certainly welcome.",
    "The EPOS H3 are a fine pair of headphones, then, and yet another top contender for gamers to mull over in a market that has improved substantially in quality and selection in recent years.",
    "The EPOS H3 cost $119 / £109 / AU$179 and was released on April 20, 2021. It sits just above the sweet spot of being under $100, but it’s a great all-rounder for those who want a gaming headset that also excels in other areas.",
    "Unfortunately for the EPOS H3, competition is fierce at this price point with more wireless headsets offering great sound quality and desirable features, such as Bluetooth connectivity with two devices. The Xbox Wireless Headset is still our pick for Xbox Series X and Xbox Series S owners, but the EPOS H3 has the advantage of working on every platform.",
    "An evolution of the GSP 300 series, the EPOS H3 sports an all-black design (a white variant is also available) and is made of premium materials that give it a durable feel and comfortable fit. The earcups initially seemed rather small when we first unboxed the headset, but once they were on, they fit snugly around our rather large ears without any pain or pressure being applied. We also found that the top headband didn’t cause any discomfort, even after wearing them for hours when grinding through Outriders.",
    "It’s easy to get a good fit with the EPOS H3 headset, too. The stainless steel slider in the headband has a satisfying click whenever you adjust it to a new notch, and the earcups have a dual-axis hinge that helps create a good seal over your ears no matter your head or face shape. We particularly enjoyed the leatherette and softer material found on the earcups, which are made from nice and responsive memory foam. These features make the EPOS H3 one of the comfiest gaming headphones we’ve worn for quite some time, and we had no qualms about being a bit rough with them due to the headphone’s solid construction.",
    "A large microphone sits on the left-hand side of the EPOS H3 headset, and there’s a volume dial on the outside of the right earcup. The volume dial is flush with the housing, which means you’ll need to use your index and middle fingers to turn it properly. It’s easy enough to adjust, but it’s hard to find exactly the right level due to the design. We also noticed that when the volume wheel is turned all the way down, the sound still comes through, which is odd and pretty annoying if you just want complete silence.",
    "So the EPOS H3 are lovely to wear, but how do they sound? In a word: clean. That might sound like a boring description, but audiophiles will know that headphones that deliver a “flat” sound present the source material as it’s intended, which is what we want. The problem is, when it comes to gaming in particular, having a flat sound can be counterintuitive.",
    "The EPOS H3 were designed with a custom speaker system that takes full advantage of sound design in games that relies on delivering a tricky mix of low frequencies for explosions and spectacular set pieces, but without masking the midrange and higher frequencies that give life to the virtual world’s we love to get lost in. The end result is a sound signature that really hones in on every detail, but thankfully packs enough of a punch that makes you sit back and smile when the on-screen action gets particularly hectic.",
    "We were noticeably impressed by the way the EPOS H3 handled spatial audio, which always benefits from headphones that don’t muddy the higher frequencies with too much bass. When playing Dirt 5, which has native Dolby Atmos support, we were genuinely surprised when the exhaust backfired during a gear change, as it sounded as though it literally happened behind us. We were also frequently reminded about finer audio details that we often forgot about in some of our favorite games, like hearing the convincing sound of rainfall in Forza Motorsport 7 or the creak of wooden boards in Sea of Thieves as the waves crash against the hull.",
    "With an impedance of only 20 Ohms, the EPOS H3 headset is also easy to drive, which means you should have plenty of volume to work with. We did find that the volume dial, which we were not the biggest fans of, only really had a tangible effect towards the top end, so it can be a bit fiddly to find the right volume level you desire.",
    "Another area where the EPOS H3 excels is communication. The headset’s bi-directional microphone works admirably, and we were told we consistently sounded clear when in a party chat, with background noise rarely interfering.",
    "The microphone is effortless to use, too: simply pull it down to activate, which is made clear thanks to a subtle click, and flip it back up to mute. There’s a slight flex to the boom arm, but we found that unlike some microphones we didn’t have to waste any time trying to determine the best position for our voice to be heard clearly.",
    "Despite the excellent performance, we do wish the microphone was slightly more discrete, though. It dominates the profile of what is a rather sleek and fetching pair of headphones and puts us off from ever wearing these cans outside. We’d love to see if EPOS can improve the design in future models but keep the quality we’ve come to expect.",
    "The advantages of being a wired headset means the EPOS H3 works on basically anything with a 3.5mm headphone jack. The two-meter-long braided cable is the ideal length when you’re plugged into the PS5 DualSense or Xbox Series X controller, and you also get a splitter cable for PC."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "EPOS H3 price and release date",
    "6": "Design",
    "9": "Audio performance",
    "13": "Microphone quality and compatibility",
    "17": "Don’t buy it if…"
  },
  "links": {
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "gaming headset": "https://www.techradar.com/news/the-best-budget-gaming-headsets",
    "Xbox Wireless Headset": "https://www.techradar.com/reviews/xbox-wireless-headset-review",
    "box Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "GSP 300": "https://www.techradar.com/news/sennheiser-gsp-370-is-a-comfy-wireless-gaming-headset-with-a-100-hour-battery-life",
    "Outriders": "https://www.techradar.com/reviews/outriders-review",
    "Dolby Atmos support": "https://www.techradar.com/news/hear-the-difference-the-best-dolby-atmos-xbox-series-x-games",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-review",
    "PS5 DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Xbox Series X controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020"
  }
}