{
  "source": "https://www.techradar.com/reviews/knownhost",
  "title": "KnownHost review",
  "category": "computing",
  "updated": "2021-10-11T09:57:17Z",
  "author": "mirza-bahic",
  "summary": "Is KnownHost known for the right reasons?",
  "verdict": "KnownHost is an established US-based web hosting provider known for its first rate, yet reasonably priced and wholly managed hosting products. It may not be the most budget-friendly solution out there, but it does present us with a high level of quality.",
  "pros": [
    "30-days money-back guarantee",
    "99.99% uptime guarantee",
    "Charge-free automatic backups",
    "Customer support is available day-and-night",
    "Free website migrations",
    "Three “world-class” data centers to choose from",
    "Broad range of hosting options and features"
  ],
  "cons": [
    "Choosing a plan can be a bit confusing",
    "They don’t support Windows hosting",
    "Website builder isn’t provided"
  ],
  "article": [
    "Established in the USA, KnownHost has been in the web hosting business since 2006. Today they are known for their comprehensive set of diverse hosting solutions which should be able to cover the needs of the majority of businesses. They operate hundreds of servers in data centers scattered across the globe. These can be found in Amsterdam (the Netherlands), in Seattle, Dallas and Baltimore (all of which are in the USA). Another thing they have an abundance of is their ambition, since they claim to grow every day and continue to do so.",
    "Another ambition of theirs (and a praiseworthy one) is to reduce their carbon footprint to a minimum by powering their facilities by green energy. With this in mind, KnownHost joined the US Environmental Protection Agency's Green Power Partnership and continued raising the awareness of its users on the issue of environmental protection. To paraphrase their words, KnownHost aims to be a better company not only for their customers, but for the environment as well.",
    "KnownHost has an official blog and a rather competent one, with articles coming out on a weekly basis. Some of them function as tutorials, others deal with news and updated info, and a few of them delve into the field of psychology and try to answer questions such as “How to overcome bloggers block?” Entries like this are the highlight of the blog, as they inspire users while keeping them informed about all the challenges they will encounter along the way.",
    "In addition to the blog, KnownHost provides KnownHost Public Wiki, which consists of how-to articles on the topic of setting up and managing VPS, which is nice to see.",
    "Their LinkedIn, Facebook and Twitter accounts are alive and active on a week-to-week basis at the very least.",
    "Although KnownHost is best known for its managed hosting services, other options are not far behind when it comes to quality, reliability and budget-friendly pricing. These options include shared, reseller, VPS, WordPress, managed (and unmanaged) cloud hosting, dedicated servers and additional cloud services. All of these solutions have enough different-sized plans to fit most needs and offer flexible billing cycles where you can choose whether you want to be billed on a monthly, semi-annual, annual or triennial basis.",
    "The simplest shared hosting plan starts at $3.47 (originally $8.95) for a month and will support up to one domain, five e-mail accounts and two MySQL databases. In addition, this package includes 5GB of storage on cloud, unmetered bandwidth, an SSL certificate (and you’ll get one with each domain with KnownHost) and (optionally) the Patchman (a malware “killer”).",
    "With all of its hosting plans KnownHost will offer you an “unconditional” 30-day money-back guarantee, which is nowadays a must-have for all providers that want to keep up with the industry standards.",
    "Payment methods that KnownHost accepts are rather regular fare: credit cards and PayPal.",
    "There are a few things one should know before deciding to go with one of KnownHost’s solutions, so let’s start with the good ones. If you already have a website, KnownHost will migrate it to their server charge-free. If this is your first website, there are no additional (or hidden) setup fees and it should be up & running in a flash. However, if you were specifically looking for a Windows hosting, you’ll have to look elsewhere, since all of KnownHost’s hosting solutions are Linux-based.",
    "If you are not certain which hosting plan is perfect for you, don’t hesitate to get in touch with KnownHost‘s support team since they are more than willing to lend a hand. When you select a hosting type, you’ll be presented with a few various-sized plans with their most prominent traits highlighted. If you scroll further down you’ll see all of their features, as well as additional information about performance, control panel, security, supported applications and more.",
    "After choosing a plan, you’ll be prompted to create your account with KnownHost and provide quite a bit of personal information (you can even add a fax number – remember those?), choose a billing cycle, payment method, set a password and proceed to a checkout. In addition, you can include a few add-ons (such as premium backups) for an extra cash and decide if you want to be a part of KnownHost’s mailing list.",
    "When they promised an instant setup, they weren’t exaggerating and since cPanel is one of their key features, creating your new website should be as painless as possible. If for whatever reason you’re not sure about the cPanel, KnownHost supports WHM and DirectAdmin, so there is a choice. Popular one-click installer Softaculous is included, so all well-liked apps will be at your disposal in a flash, WordPress included.",
    "Considering that KnownHost promises an “ultra-high performance”, we have been compelled to check what GTmetrix had to say about that. After performing this test on KnownHost’s main website we were blown away with the results. The page loaded completely in 1.5 seconds, which is just a fragment of the average result of 8.1. At the same time, it took 52 requests, which looks rather good compared to the average of 98. In conclusion, GTmetrix rated the speed performance of KnownHost’s main website with an A (99%), which is one of the best results so far.",
    "KnownHost promises all of its users an “unparalleled” uptime of 99.99% and (according to UptimeRobot) it delivers on that promise. During the monitoring period of one month our tool failed to capture a single moment of downtime. Although there were a number of oscillations in response time, these were not the reason for concern.",
    "KnownHost takes pride in having completely on-shore customer support. This implies they were not ready to compromise the quality of their support for the sake of saving money by outsourcing it to the countries where the cost of labor is cheaper. Their “outstanding” support team is always on duty, which means it’s available 24/7/365. There are several ways to contact them and they include e-mail, ticket and live chat.",
    "As for self-help options, they include a knowledgebase (labeled as “KnownHost Public Wiki”) and a community forum, which is something we don’t see often enough. The knowledgebase is packed with a variety of articles and pretty well organized. The guides among the numerous articles are sorted by the level of difficulty to help users find those which are best suited for them and their needs.",
    "The support forum provides additional information on hosting-related topics and most questions are answered either by other users or by the members of KnownHost’s support team.",
    "Both HostGator and KnownHost are US-based hosts with a whole variety of hosting solutions on offer. While KnownHost focuses primarily on managed hosting packages, HostGator divides its attention to all types of hosting equally. However, when entry-level shared hosting plans are at play, both hosts offer a good deal of options.",
    "Hostinger is another KnownHost’s opponent and one that is tough to beat. During the sales, Hostinger‘s hosting packages go as low as $1.39 per month and the price covers an SSL certificate as well as managed WordPress. This is hard to compete with, price-wise at least. However, KnownHost operates from three global data centers and provides a perfect speed performance and a 99.99% uptime guarantee.",
    "In recent days, Bluehost started offering managed WordPress hosting, which is one of the things KnownHost is best known for. Even so, KnownHost has more than 15 years of experience, three worldwide data centers and thousands of satisfied customers as a testament to their value. Therefore, if 100% managed WordPress hosting is what you need, KnownHost is the right choice. Otherwise, you can’t go wrong with any of them.",
    "Leaseweb is another web hosting provider with a network of global data centers suited for all kinds of businesses, although it is a Netherlands-based one. However, those who want a more flexible billing cycle will have to go with KnownHost, since Leaseweb hosting solutions are available only for an annual subscription.",
    "Finally, is KnownHost known for the right reasons? Yes, and the ones we want to emphasize are: all-embracing feature-rich hosting plans that can meet the needs of all types of businesses; top-notch speed performance and an uptime of 99.99%; and a competent on-shore customer support available round-the-clock. However, the lack of Windows-based hosting options and a website builder might make some users look away. If you are one of them, be sure to take a look at Hostinger, HostGator and Bluehost, before making a definitive decision."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "18": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "KnownHost": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4387065037619297300&xs=1&url=https%3A%2F%2Fwww.knownhost.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fknownhost",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "managed hosting": "https://www.techradar.com/web-hosting/best-managed-web-hosting",
    "shared": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "reseller": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Hostinger": "https://www.techradar.com/reviews/hostinger",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Leaseweb": "https://www.techradar.com/reviews/leaseweb-hosting"
  }
}