{
  "source": "https://www.techradar.com/reviews/wickr-encrypted-messaging",
  "title": "Wickr encrypted messaging review",
  "category": "computing",
  "updated": "2021-11-29T17:30:28Z",
  "author": "lindsay-pietroluongo",
  "summary": "Secure encrypted messaging for businesses",
  "verdict": "Wickr offers fast, encrypted messaging for individuals and groups, with savvy privacy features that give you added control over your conversations and getting started is free.",
  "pros": [
    "Easy setup",
    "Can be used anonymously",
    "Messages can be set to auto-expire",
    "Per-device message history"
  ],
  "cons": [
    "Few personalization options",
    "Limited features with free tier",
    "Costly paid tiers",
    "Small user base"
  ],
  "article": [
    "Wickr is an anonymous and fully end-to-end encrypted messaging app. While there are a lot of communication apps out there, they don't all have the advanced security features for calling (both voice and video), collaboration, file-sharing and especially messaging that Wickr offers.",
    "This higher level of security makes the app a viable option for enterprise and government agencies that have to adhere to compliance requirements. It can be used by more traditional businesses, too, if there's a need to keep communication between employees, customers, and/or partners protected. This is especially useful with modern work setups, as hybrid work environments and remote employees mean that teams are often dispersed far and wide.",
    "With the Direct Messages feature, you can invite someone you know by email or add them by username, and then talk with them one on one.",
    "If you want to create a chat space and control a conversation as a moderator, you'll use Rooms. You can add up to 500 members. Rooms have a few extra features beyond chatting, too. You can send encrypted files, share your location and use quick responses like \"sounds good\" and \"thank you.\"",
    "The Search function lets you search pretty much everything – conversations, files, messages, and rooms.",
    "When you add Wickr to a new device, your conversation history won't sync and appear on that device; future conversations will appear there, though.",
    "When you receive a message, whether it's a DM or in a Room, you have to click to unlock it (this is the default setting). This gives you an extra layer of privacy, which can be useful if someone walks into your office and you don't want them to see what was just sent, for example. You can toggle this feature off in Settings.",
    "You can delete individual messages, too. If you delete your own message, it'll be removed universally; if you delete someone else's message, it'll only be removed from your app.",
    "There are also options to have DM messages expire everywhere: Expiration Timer and Burn-On-Read Timer. With the Expiration Timer, the message will be gone a certain duration after being sent. With the Burn-On-Read Timer, the message will disappear after a set duration once it's read. For both timers, you can choose from preset durations or customize the duration.",
    "When you open the app for the first time, you'll be greeted by a welcome page, where you can quick-create an account. You don't have to use any identifying information to create an account, not even an email address. If you want to, you can add some information to your profile later, like an avatar image or a phone number. Linking your phone number to your account can make it easier for people to find you.",
    "After signing up, you'll get a tour that will show you around Wickr. This is brief, and it's a good way to see which features are where and what they can be used for.",
    "If you know the username of the person you want to connect with, you can search the Wickr directory to start a direct message or add that member to a group. Or, if the person you want to converse with doesn't have a Wickr account yet, you can invite them via email. If you're using a mobile app, like Wickr for iOS, it can search your contacts for people who have a Wickr account.",
    "In mid-2021, Wickr was acquired by Amazon and added to Amazon Web Services (AWS), a collection of inexpensive and scalable cloud computing tech.",
    "On the Download page, you'll see the different platforms available, and the one that matches the device you're on will be clickable. You can download Wickr for Android, iOS, Linux, Mac, Windows and Chromebooks.",
    "Wickr is available as both a free and paid service and which tier you end up choosing depends on the security features your organization requires.",
    "The Basic tier allows for up to 10 registered users and includes limited storage, up to 30 days data retention and secure voice/video calls up to 70 people. The Silver tier costs $4.99 per user per month and adds limited group/security controls, unlimited storage, unlimited users, 2FA and support. The Gold tier costs $9.99 per user per month and allows for up to 5GB file transfers with a 99.99% uptime SLA. Finally, the Platinum tier costs $25 per user per month and adds SSO, dedicated onboarding, 24/7 support and other compliance features.",
    "There are a lot of encrypted messaging apps out there to choose from. For example, Signal has many of the same features as Wickr, but you can also send animated stickers and set custom wallpapers, making it more palatable for casual use than professional needs. Overall, some of Wickr's competitors are more versatile, especially when you compare a totally free service to Wickr's payment tiers.",
    "Many of Wickr's features are standard for an encrypted messaging app – DMs, group chats, video calling, and file/location sharing can be expected. However, what makes Wickr stand out are its self-destructing messages, which have useful options like timers and settings for what happens to a message when it's read versus un-read.",
    "It's also a sleek and simple app, which is a benefit if you don't care about animations, stickers, wallpapers, and the like. For business professionals, particularly those who work for a more traditional company than a creative one, that's an advantage. No cutesy distractions popping up, with the exception of emoji, and you still have the option to share files as needed.",
    "One drawback of Wickr that can make it difficult to connect with others is that it has a much smaller user base than something like Signal or WhatsApp. But since it's so easy to create an anonymous account, this isn’t likely to get in the way, especially if your organization wants employees, partners, etc. to start using Wickr. While another hurdle may be cost, especially for larger companies with multiple users, it's free to start, and it can be tested before a decision to pay is made.",
    "We've also featured the best encrypted messaging apps, the best online collaboration tools and the best video conferencing software"
  ],
  "headers": {
    "2": "Features",
    "5": "Privacy",
    "9": "User experience",
    "12": "Platforms",
    "14": "Plans and pricing",
    "16": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Wickr": "https://wickr.com/me/",
    "encrypted messaging": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "encrypted files": "https://www.techradar.com/best/best-encryption-software",
    "AWS": "https://www.techradar.com/news/aws",
    "Download": "https://me-download.wickr.com/#/version/me",
    "Basic": "https://wickr.com/product-tiers/",
    "Silver": "https://wickr.com/product-tiers/",
    "Gold": "https://wickr.com/product-tiers/",
    "Platinum": "https://wickr.com/product-tiers/",
    "SSO": "https://www.techradar.com/best/best-identity-management-software",
    "Signal": "https://www.techradar.com/reviews/signal-encrypted-messaging",
    "WhatsApp": "https://www.techradar.com/reviews/whatsapp-encrypted-messaging",
    "best encrypted messaging apps": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "best video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software"
  }
}