{
  "source": "https://www.techradar.com/reviews/activpn",
  "title": "ActiVPN review",
  "category": "computing",
  "updated": "2021-02-16T15:17:36Z",
  "author": "sead-fadilpasic",
  "summary": "A decent VPN, when it works",
  "verdict": "ActiVPN offers nice speeds on some of its VPN servers, but is otherwise plagued with problems that might make you think twice about signing up. Many of the servers fail to connect which, combined with a lack of native clients, makes for a less than user-friendly experience. The main saving grace is that purchasing a subscription won't break the bank if you commit to a multi-year plan.",
  "pros": [
    "Cheap long-term plans",
    "Solid speeds on some servers",
    "Accepts Bitcoin"
  ],
  "cons": [
    "Doesn’t unblock Netflix, BBC iPlayer",
    "Some servers don’t work",
    "Missing no-logs policy",
    "No free trial or money-back guarantee",
    "The website is awfully slow",
    "No native clients"
  ],
  "article": [
    "ActiVPN is a small provider of VPN services with roughly 6,000 active users. It offers access to 65 distinct servers, designed to hide your identity online and unlock geo-restricted content.",
    "The vendor has three subscription plans of varying lengths, with its longest two-year package costing the least, at only $2/month (charged upfront at $61.88).",
    "Regardless of the plan you opt for, you’ll be able to simultaneously run the VPN connection on up to 5 devices. None of the plans are recurring, which is handy if you accidentally forget to cancel a recurring payment.",
    "Unfortunately, there isn’t any sort of a trial or money-back guarantee, so if you realize you’re not perfectly satisfied with the service, there's not much you can do. The only way to test the service out at minimal cost is to sign up for quite an expensive one-month plan at $11.88.",
    "Accepted payment methods include credit/debit cards, PayPal, and even Bitcoin for an added level of anonymity.",
    "ActiVPN has its positive aspects, but can hardly compete with the industry giants.",
    "It costs as much as Surfshark, but doesn’t have its simple native clients nor thousands of servers. And it's cheaper than CyberGhost but has absolutely no money-back guarantee, compared with this rival's lenient 45-day returns policy.",
    "Neither can ActiVPN compete with the likes of NordVPN and ExpressVPN, which offer the most well-rounded and feature-rich VPN experiences.",
    "One of the reasons many users seek out a VPN is to gain access to localized content libraries from popular streaming services like Netflix and BBC iPlayer. Unfortunately, this isn’t a feature offered by ActiVPN, at least where these two platforms are concerned. HBO and YouTube work as expected, though.",
    "The provider is based in France and offers access to 65 servers in 32 countries, including in Panama, Tunisia, Romania, Cuba, and others. However, we had little luck connecting to some of these locations.",
    "ActiVPN ensures top online privacy for its clients through the use of the impenetrable AES-CBC 265 and PKI RSA 2048-bit encryption system. Together with the standard selection of VPN protocols: OpenVPN, L2TP/IPSec, and PPTP, this encryption guarantees bullet-proof security, allowing you to access censored content even in a tightly-controlled region such as China or Saudi Arabia.",
    "We have also noticed that ActiVPN has different types of servers, some being marked as “paranoid”, which we presume means they provide an additional level of security, albeit perhaps with some potential losses in terms of download speeds.",
    "Interested in what data is and isn’t logged by this provider, we tried to find its Privacy Policy but had no luck. The only thing similar document that exists is the Privacy Report which only includes one sentence: “ActiVPN has not received any National Security Letters or FISA court orders, nor has been subject to any gag order by a FISA court”.",
    "Whether or not P2P activities are allowed with this VPN is difficult to tell, as there’s no mention of this anywhere on the website. However, we did manage to dig something out using Google search. It directed us to a page in French - titled “Conditions Générales d’Utilisation du Service”, which can be translated into English as “Terms of Service”, where we were told that “Les usages du type peer to peer sont strictement interdits”. In other words, using this VPN for P2P traffic is “strictly forbidden”.",
    "Coincidentally, this is where we also learned that the provider keeps connection logs for one year.",
    "There are no native clients but the service can be manually set up on Windows, Mac, Android, iOS, Linux, PlayStation and select routers.",
    "We did our best to follow the instructions from the very modest FAQ section during the Windows setup process but our efforts were made slightly difficult by the fact that the screenshots were in French.",
    "Should you require more personal assistance, you can fill out a contact form on the website and wait for a response. The website states one will arrive within a maximum of two business days, but the “average response time is 0 hours and 34 minutes”. There’s no email or online chat option, let alone a phone line.",
    "Additional avenues for contact include Twitter, Facebook, and LinkedIn. For some reason, the Google+ link is still hanging out on the website next to these three, despite the service having shut down in April 2019.",
    "ActiVPN is far from the easiest VPN we've put to the test, as it requires manual installation and entering your VPN credentials when connecting to a server for the first time. After a while, it can become a bit frustrating, especially if half of the servers end up not connecting at all.",
    "We tested access to the provider’s VPN servers using a testing connection with download speed of 63.75Mbps. It took us some time before we could find an actual working server but those that did function delivered solid speeds. For instance, a server in France gave us 34Mbps, another in Morocco delivered 15.90Mbps, and one in the US 7.81Mbps. Servers in the UK did not work, unfortunately.",
    "ActiVPN delivers decent speeds on its working VPN servers, offers Bitcoin support and its two-year subscription is nice and cheap. In almost every other area, however, this service fails to compete with the market leaders.",
    "With rival services, you get access to thousands of servers, all the P2P and geo-restricted streaming content you want, native apps for all the major platforms (and then some), a detailed no-logging policy, as well as a generous money-back guarantee if things don’t work out - none of which ActiVPN provides."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "10": "Privacy and encryption",
    "15": "Support",
    "19": "Speed and experience",
    "21": "Verdict"
  },
  "links": {
    "ActiVPN": "https://activpn.com/en/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Privacy Report": "https://activpn.com/en/a_propos/privacy_report/",
    "Conditions Générales d’Utilisation du Service": "https://activpn.com/fr/wiki/CONDITIONS%20GENERALES%20D%20UTILISATION%20DU%20SERVICE/?",
    "FAQ section": "https://activpn.com/en/a_propos/faq/",
    "contact form": "https://activpn.com/en/a_propos/contact/",
    "Twitter": "https://twitter.com/activpn",
    "Facebook": "https://www.facebook.com/ActiVPN1337/",
    "LinkedIn": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1212065042341831200&xs=1&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Factivpn%2Fabout%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Factivpn"
  }
}