{
  "source": "https://www.techradar.com/reviews/powera-enhanced-wireless-controller-for-nintendo-switch",
  "title": "PowerA Enhanced Wireless Controller for Nintendo Switch review",
  "category": "gaming",
  "updated": "2021-04-07T13:22:04Z",
  "author": "andrew-williams",
  "summary": "The third-party Switch controller with a thousand faces",
  "verdict": "The PowerA Enhanced Wireless Controller is a stripped-back Nintendo Switch controller in the mold of an Xbox pad. It doesn't feel quite as good as a first-party gamepad, but saves you some cash if the Nintendo Pro Controller price is a turn-off.",
  "pros": [
    "Plenty of themed pad designs",
    "Good-enough build quality",
    "Fair input lag"
  ],
  "cons": [
    "No rechargeable battery",
    "No rumble",
    "Not hugely cheaper than first-party at RRP"
  ],
  "article": [
    "The PowerA Enhanced Wireless Controller is one of the better third-party pads for the Nintendo Switch. You are most likely to buy one because you want a full-size controller but cannot stomach the $59.99/£54.99 cost of the Nintendo Switch Pro Controller.",
    "Many of you should stick to the first-party pad. It costs only $10 more (with the PowerA coming in at around £40/$50) has better-quality buttons, rumble, NFC and a rechargeable battery.",
    "The PowerA Enhanced Wireless Controller For Nintendo Switch is no dud, though, and you’ll often be able to find a few of the many design variations of this pad selling way below the original price online.",
    "That breadth of designs may be part of the appeal too, particularly if you’re buying for someone a little younger who loses their mind at the sight of a pad that looks like a Pokéball.",
    "PowerA sent us the Apex Legends version of the Enhanced Wireless Controller to try out. Highlights include solid-enough build quality, a respectable D-pad and comfortable extra buttons that can be mapped to act like any of the main buttons.",
    "This offers a hint of the functionality of a much more expensive pad, although you can’t swap around the primary button mappings as you might with a Joy-Con or Switch Pro Controller.",
    "You have to use AA batteries, there’s no rumble. And while latency is fine on Switch, the PowerA Enhanced Wireless Controller does not work well if you try to use it with your phone instead, in our experience.",
    "8BitDo makes some pretty compelling alternatives to the PowerA Enhanced Wireless Controller. But you can do much worse, and this pad is a solid fit for those who tend to mostly use their Switch in handheld mode, but need a pad for occasional docked sessions. And one that doesn’t cost an uncomfortably large chunk of the money you initially spent on the console.",
    "The PowerA Enhanced Wireless Controller’s marketing relies heavily on tie-ins. Sure, you can get plain color pads, but the branded ones get more attention.",
    "This Apex Legends version is one of the less eye-catching PowerA makes. There are stacks of Pokemon Enhanced Wireless controllers, Animal Crossing designs, Mario ones and more.",
    "These front plates are not hot-swappable, and the colors of buttons and fonts vary between models too. The Cuphead Enhanced Wireless Controller uses a lot of orange plastic, for example, so wouldn’t look quite right with another fascia on top anyway.",
    "Low weight is one of the first things you’ll notice after picking up the PowerA Enhanced Wireless Controller. It weighs 159g without batteries, almost 100g less than the Switch Pro Controller and Xbox Series X pad (without batteries).",
    "Your initial assumption may be this is because PowerA uses cheap, thin plastics. But it is largely thanks to the PowerA Enhanced Wireless Controller's lack of rumble motors.",
    "These sit in the pad handgrips in other controllers of this shape. Those grips are empty here, so while the PowerA Enhanced Wireless Controller feels a lot like an Xbox pad, the weighting is different.",
    "Low weight is good for kids, and fatigue-free play, but here a significant amount of the weight makes the pad seem to want to tip away from your grip, not into it. This is because the batteries sit at the back.",
    "However, that there is an obvious reason for the pad’s low weight is reassuring. The PowerA Enhanced Wireless Controller’s plastics are not actually flimsy, and there’s no creaking from torsion as you wrench the pad around in your hands.",
    "This does not mean the PowerA Enhanced Wireless Controller’s build is perfect. The two analog sticks have rubberized surfaces, and feel eerily similar to the Xbox Series consoles' sticks, but all of the other buttons and controls use simple plastics. First-party pads tend to use slightly different materials for the A/B/X/Y buttons, because the feel of them is so important.",
    "The PowerA Enhanced Wireless Controller’s face buttons feel slightly basic, and have more hollow feedback than those of a top-price pad.",
    "Still, the D-Pad is solid and should seem a big upgrade if you love 1-on-1 fighters, but hate playing them on Joy-Cons.",
    "The PowerA Enhanced Wireless Controller has two additional buttons on the back, one on each grip.",
    "These provide some of the functionality of a much more expensive console controller and help mask that you can’t customize the button layout as much as you might on a Nintendo Pro Controller.",
    "You long-press a button at the center of the rear until the front LED shines white. Press one of the primary buttons, then one of the back ones to make it copy its input.",
    "The PowerA Enhanced Wireless Controller doesn’t have multiple profiles to let you quickly swap between mappings for different games. But this process only takes a few seconds and the buttons are positioned right under your middle fingers. It's one of the pad's best features.",
    "The PowerA Enhanced Wireless Controller misses out on a few important extras found in the Nintendo Switch Pro Controller. There’s no rumble at all and no NFC, used to scan Amiibo toys.",
    "We can live without NFC, but the lack of any rumble seems a shame when the rival 8BitDo Pro 2 has rumble motors. Sure, that pad doesn’t have the more refined HD Rumble of the Nintendo Switch Pro Controller, but a totally rumble-free controller may feel a little too inert to some of you.",
    "The PowerA Enhanced Wireless Controller also uses AA batteries rather than a rechargeable cell. PowerA says you’ll get up to 30 hours of use from a pair. This will, of course, depend on the quality of the batteries you use. PowerA bundles a pair of OEM Duracells.",
    "If you use a lot of batteries you might want to consider buying a quality set such those from Eneloop, which hold charge about as well as a non-rechargeable battery.",
    "The PowerA Enhanced Wireless Controller also lacks a USB connector. You could argue it doesn’t need one, as there’s no battery to charge. But this would also let you use the pad with a cable, wired up.",
    "Input lag is not that simple to test. It’s the gap between you pressing a button and the Switch’s on-screen reaction.",
    "We wanted to see if the PowerA Enhanced Wireless Controller has worse latency than the standard Joy-Cons, so we used a 240fps camera to see if there’s a noticeable difference.",
    "We judged this by counting the frames between a full depression of the button and the first frame of animation when switching between items in the Switch menu. It’s not as precise a way to measure latency as hooking up an LED to the controller’s circuit (giving a clearer visual cue of a button press), but we’re here to get an idea about the relative difference in responsiveness, not absolute figures.",
    "The Joy-Con input kicked in on-screen after 32 frames, suggesting an input lag of 133ms. The PowerA Enhanced Wireless Controller took 40 frames, suggesting an input lag of 160ms. In real-world terms, this means the PowerA might be two frames behind the Joy-Cons in a 60fps game or a single frame in a 30fps game.",
    "We didn’t find the PowerA Enhanced Wireless Controller’s latency distracting, or noticeable, but third-party pads like this do tend to have slightly greater input lag.",
    "Things take a turn for the worse if you try to use the PowerA Enhanced Wireless Controller as a pad for your phone. We tried it with two Androids, and the lag was unbearable. The pad’s front LEDs also continued to flash in sequence, suggesting it remained in pairing mode even when connected, which may be the source of the issue.",
    "We also tried the PowerA Enhanced Wireless Controller with a Mac, and it worked perfectly, offering the same sort of responsive feel you get when playing on your Switch."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Design: the pad of a thousand faces",
    "11": "Build quality: mixed results",
    "19": "Remappable buttons",
    "23": "Missing features",
    "28": "Input lag vs Joy-Cons",
    "35": "Don’t buy it if..."
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch Pro Controller": "https://www.techradar.com/reviews/nintendo-switch-pro-controller"
  }
}