{
  "source": "https://www.techradar.com/reviews/oclean-x-pro-elite",
  "title": "Oclean X Pro Elite review",
  "category": "fitness",
  "updated": "2021-08-24T11:57:21Z",
  "author": "cat-ellis",
  "summary": "A powerful, whisper-quiet sonic toothbrush let down by an awkward mobile app",
  "verdict": "The Oclean X Pro Elite is a thoughtfully designed electric toothbrush with a powerful motor that's whisper-quiet even on its highest settings. Its color touchscreen is responsive (even when used with wet hands), and makes it easy to pick your preferred mode and intensity. Despite being near silent when used with your mouth closed, it's a powerful performer, and cleans as thoroughly as a Sonicare brush thanks to its rapid vibrations and small brush head that easily reaches tricky-to-access areas. Unfortunately, it's let down by a mobile app that's unnecessarily complicated, and adds far more options than are practical for routine oral hygiene. There's no real-time brushing feedback either, despite the handle having an accelerometer to track its location. Overall, it's an excellent brush when used without your phone, but connecting it to the app detracts from the experience.",
  "pros": [
    "Extremely quiet motor",
    "Responsive touchscreen",
    "Thorough cleaning action",
    "Affordably priced"
  ],
  "cons": [
    "Far too many options in app",
    "No real-time brushing feedback",
    "No shaver socket plug"
  ],
  "article": [
    "The Oclean X Pro Elite is an excellent sonic electric toothbrush – well designed and astonishingly quiet. In fact, it’s barely audible when used with your mouth closed, even on its highest power settings. The handle has a sleek design, and its touchscreen menus make choosing your preferred option a breeze, even with wet hands.",
    "It’s affordable too – one of the cheapest smart toothbrushes you can buy today – and replacement heads are reasonably priced too (particularly when bundled with a sterilizing unit).",
    "It’s a shame we can’t heap the same praise on the Oclean app, which overwhelms the user with an abundance of options that over-complicate what should be a simple daily routine. The number of options is dizzying, the brushing instructions are excessively complicated, and the ability to create your own custom brushing plan (taking your pick from up to 32 intensity settings) just isn’t necessary with all the presets available.",
    "Although the brush handle contains an accelerometer to track its position as you clean your teeth, the app doesn’t present this data in real time, so you can’t adapt your brushing technique on the fly as you can with a high-end Oral-B or Philips brush. This information is synced with the app once you’ve finished brushing so you can act on it next time, but it’s not as useful as seeing a map of your teeth that updates as you clean each quadrant.",
    "The Oclean X Pro Elite works extremely well by itself, and is easy to recommend as a premium electric toothbrush if you’re not interested in the ‘smart’ features. If you’re really interested in getting detailed feedback on your brushing, however, there are better options around.",
    "The Oclean X Pro Elite is usually priced at $99.99 / £75 / AU$141, but at the time of writing is discounted to $79.99 / £56 / AU$106, making it one of the cheapest smart electric toothbrushes around.",
    "That price will get you the brush, plus one head. Bundles with additional heads and a sterilizing unit are also available for only a little more, so it’s well worth checking these out. Extra heads start at $9.99 / £8 / AU$15 for two (down from $15.99 / £8 / AU$23).",
    "Our review model also came with a carry case for the brush handle and two heads, which is sold separately for $12.99 / £10 / AU$19 (down from $19.99 / £15 / AU$29).",
    "The brush is available in one color: a tasteful light gray, with a slightly textured surface, which provides a little extra grip for wet hands. On the handle is a single button, which serves to turn the brush on and off, plus a large color touchscreen that allows you to switch between modes by swiping and tapping. The screen also shows a timer while you brush, though this can be tough to see while you’re holding it, even in a mirror.",
    "The Oclean X Pro Elite’s charging base is excellent. Most electric toothbrushes have a recess in the bottom, which fits onto a pronged base, and had a tendency to collect water and toothbrush residue unless you’re utterly meticulous about drying your brush after each use. The bottom of the Oclean X Pro Elite brush handle is completely flat, with nowhere for gunk to build up, and the charger has a soft silicone cup that holds it securely in place, and can be easily removed for cleaning.",
    "Unfortunately, there’s no cable or adapter for charging your brush from a bathroom shaver socket – only a USB connector. It seems like a strange omission considering how carefully the rest of the setup has been designed.",
    "The Oclean X Pro Elite also comes with a magnetic mount so you can attach your brush to your bathroom tiles. It’s secured to the wall firmly with an adhesive pad, but won’t keep your brush charged. It’s just a way to keep it out of the way between charges if you’ve no room for the base by your sink.",
    "Unlike most of the other electric toothbrushes we’ve tested, the Oclean X Pro Elite doesn’t come with a travel case, and if you buy one separately, it’ll only be to protect the brush; the case doesn’t serve as a power pack to keep the brush charged on the move like that of the Philips Sonicare DiamondClean 9000, or the Oral-B Genius X.",
    "The first thing you’ll notice about the Oclean X Pro Elite is that it’s quiet – even quieter than the Oral-B Series 9. In fact, it’s barely audible with your mouth closed, which might lead you to believe that its action is less powerful than noisier brushes. That’s not the case, though – the X Pro Elite is capable of vibrating up to 42,000 times per minute on its highest setting.",
    "This is a smart toothbrush with its own mobile app, but it works perfectly well by itself. There are four modes to choose from on the brush handle (clean, sensitive, massage, and white), and you can pick an intensity setting (from one to four) plus a duration. It’s a simple system, and the brush’s touchscreen makes it easy to pick your preferred options.",
    "In our tests, we preferred the ‘white’ mode on a moderate intensity, which gave a thorough clean – as proven by use of disclosing tablets after use. Even on this relatively high setting, the brush remains whisper quiet, so you won’t disturb anyone in your household who’s sleeping while you’re in the bathroom.",
    "Overall, it’s a well designed brush that’s a pleasure to use. Unfortunately, we can’t say the same for the smartphone app.",
    "The Oclean app is available for iOS and Android, and is simple to set up; just register an account and click the link in the confirmation email. Although it’s not mentioned in the brush’s manual, we found that we had to keep the brush in its charging base while it was pairing; otherwise the brush would turn off before the process had finished. After this, we had no further Bluetooth issues.",
    "Once your brush is paired, you’ll find yourself presented with an app that’s attractive, but overwhelming, and packed with unnecessary features (including the ability to pick a background wallpaper to match your bathroom).",
    "Whereas the brush handle offers a perfectly reasonable selection of brushing modes and intensities, the app complicates matters with dedicated ‘plans’ to suit different oral hygiene needs. There’s a staggering array of 12 different presets to choose from, including standard cleaning, gentle teeth spa, newbie whitening, and braces cleaning.",
    "If you find all the options overwhelming (which is quite likely) tap ‘Smart push’ and you’ll be prompted to enter some details about your teeth and lifestyle, which the app will use to recommend a particular setting. Our tea-drinking habit resulted in a recommendation of newbie whitening.",
    "If you find all the options overwhelming (which is quite likely) tap ‘Smart push’ and you’ll be prompted to enter some details about your teeth and lifestyle, which the app will use to recommend a particular setting. Our tea-drinking habit resulted in a recommendation of newbie whitening.",
    "Now things get really complicated. These plans don’t simply affect the intensity, duration, and type of vibrations produced by the brush – they also come with specific instructions to follow, advising you which surfaces to brush for how long. It’s clear what ‘right palate side’ and ‘left cheek side’ mean, but ‘your dedicated zone’ is something of a mystery. These steps aren’t shown on the app’s screen as you brush, so you’ll need to follow them on your phone’s screen, changing to the next one each time the brush vibration changes.",
    "Still not satisfied with the options available? You can also create your own plan, choosing how long you want to spend cleaning each quadrant of your mouth, and taking your pick from 32 intensity settings.",
    "The brush handle includes an accelerometer that monitors its position in your mouth as you clean, but unlike smart toothbrushes from Philips and Oral-B, the Oclean app doesn’t show this data in real time. Instead, the info syncs with the app after you’ve finished, and presents you with a map of your brushing efforts, together with a score. Remember this info, and you should be able to achieve a better rating.",
    "This system is a little strange. Despite only achieving a score of ‘middle’ for both pressure and coverage area, with ‘great’ for duration, we were given an overall score of 89 and a rating of ‘excellent’. It’s worth delving into your results though, because tapping the question mark icon beside ‘coverage’ shows you exactly which surfaces you reached, and which you missed (areas highlighted in red being insufficiently cleaned).",
    "The Oclean X Pro Elite seems to be more picky than Oral-B and Philips brushes when it comes to covering all your teeth surfaces, which may be beneficial if your dentist tells you that you often miss a particular spot.",
    "Overall, we preferred using the brush by itself, without the app. It’s an excellent piece of hardware (its powerful but near-silent motor is superb), and gives you all the options you need on its touchscreen. It’s certainly comprehensive, but we feel the app adds little extra value."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "8": "Design",
    "13": "Performance",
    "17": "Mobile app"
  },
  "links": {
    "Oclean X Pro Elite": "https://www.oclean.com/products/oclean-x-pro-elite",
    "electric toothbrush": "https://www.techradar.com/best/electric-toothbrushes",
    "Philips Sonicare DiamondClean 9000": "https://www.techradar.com/reviews/philips-sonicare-diamondclean-9000",
    "Oral-B Genius X": "https://www.techradar.com/reviews/oral-b-genius-x"
  }
}