{
  "source": "https://www.techradar.com/reviews/echelon-stride",
  "title": "Echelon Stride review",
  "category": "fitness",
  "updated": "2021-09-21T14:47:15Z",
  "author": "dave-aubrey",
  "summary": "A beginner-friendly treadmill designed to keep you motivated",
  "verdict": "The Echelon Stride treadmill and companion Echelon Fit app subscription make for an excellent way to motivate yourself to exercise as a beginner to intermediate runner. It has a minimalist design that makes it easy to start your workout quickly, or you can link the Echelon Fit app and follow along with one of dozens of workout videos for motivation. The folding design is a stroke of genius, and makes some other minor quirks completely forgivable. This treadmill is ideal for those with limited space for workout equipment and a new yearning to get moving again.",
  "pros": [
    "Simple interface",
    "Excellent folding design",
    "App connectivity"
  ],
  "cons": [
    "App subscription is expensive",
    "Not ideal for experienced runners"
  ],
  "article": [
    "The Echelon Stride isn't the cheapest treadmill on the market, and the app subscription model certainly doesn't make the full package any more affordable, but it's one of the most portable and streamlined. If you're inexperienced when it comes to workout equipment or running in general, the treadmill itself looks very inviting with very little confusion, and the companion app does a great job of introducing you to how you should be exercising safely.",
    "The fact that the treadmill's arms fold down to give it a total height of around 10cm is amazing, but the ability to stand it on its end against a wall is what really wins the day. Even aspiring runners with limited space will be able to find a walkway where they can lay this down during their workouts, but if you're a heavy-footed runner you might find the neighbours disagreeing with your exercise decisions during an intense session.",
    "While there are more affordable treadmills, the Echelon Stride makes a compelling case for itself simply down to the fact it can be folded away, and the robust app functionality which does an amazing job of making you feel like you're part of a fully-fledged exercise community right out of the gate. If that sounds like the motivation you need to get moving, then the Echelon Stride might be for you.",
    "The Echelon Stride was released in August 2020, and can be purchased for $1,299.99 / £1,599 (about AU$1,800) direct from Echelon, though there are also finance payment options available. Smart shoppers will be able to find this treadmill considerably cheaper when sales and offers are available on select websites.",
    "The Echelon Fit app subscription costs $39.99 / £39.99 (about AU$55) per month, or slightly less if you pay up-front for the full year.",
    "Design is where the Echelon Stride excels. This treadmill is minimalist to avoid any kind of confusion. The left side of the handlebars has just two buttons for increasing or decreasing the incline you're running on, while the right side adjusts for speed. In the center you have simple Start, Stop, Program, and Mode buttons. In practice, you can limit yourself to just Start, Stop, and the buttons on the handlebars, giving you easy access to quick exercise, but there are also shortcut buttons on the display to jump to set inclines or speeds.",
    "While the simplicity of the interface is a minor triumph for anyone who is a mild technophobe, it is the portability and folding mechanics of the Echelon Stride thatstands above all its other features. The handlebars and dashboard fold down to give the treadmill a total height of around 10cm when flat on the floor, and there's a handle at the rear of the treadmill, just underneath the belt. You can essentially deadlift this handle from the floor, lifting the treadmill until it rests on the front end so you can lean it against a wall.",
    "Having the treadmill in this position does make me slightly nervous, but it feels very stable, and only a purposeful action will cause it to come back down to lie flat.",
    "If you have limited space, the ability to prop the treadmill up against a wall is wonderful, as it never has to be a permanent fixture - though for safety it might be best to find a way to fasten the treadmill to the wall when stood up. The front end also has wheels, facilitating easy lifting and pushing the device around your room - though it is still considerably heavy at the front, with a total weight of 70.8kg, meaning you certainly shouldn't attempt to move it up a flight of stairs without professional help.",
    "All of these design decisions put function before aesthetics, but in spite of that, the Echelon Stride is a very attractive machine. The underside isn't so pretty when placed against a wall, but the sleek dark design means it's not distracting in any home. If there is a complaint to be made about the design, it's that the lever mechanism to fold down the arms of the treadmill requires a firm press. Make sure to wear shoes when doing that.",
    "Once the Echelon Stride is plugged in and ready to go, getting started with a basic run where you set your own pace is incredibly simple, and the available shortcuts on the dashboard make it even easier to set up a more dynamic experience. The belt has a slightly soft feel under the feet, so even heavy-footed runners should find themselves running comfortably and free of shin splints. If you're looking for a walk with a high incline or a machine for a comfortable, lengthy jog, the Echelon Stride is ideal.",
    "But it's not perfect for all situations. When the treadmill rams up the incline, it can feel unsteady as it adjusts, and I found that while running on an incline, the noise from my footsteps were much louder – and yes, my neighbours did bang on the wall at least once. Adjusting the incline mid-run quickly became something I actively tried to avoid doing, which isn't what I wanted.",
    "The motor on this treadmill isn't the strongest with just 1.75HP, and experienced runners who are looking to use this machine heavily, with lengthy, swift runs or sprints, will probably find themselves disappointed by a max speed of 12mph and a max incline of just 10%.",
    "While I found the Echelon Stride very comfortable, I can already see that for particularly tall or large users, this is going to feel like a tight fit. The handlebars are not incredibly wide, and the deck is not particularly long, so those with a wide frame or long legs will end up feeling underwhelmed. This won't be a problem for a majority of users, but if you find yourself in one of those situations, this might not be the product for you.",
    "Still, despite all of the grumbles, this is a very performant and mostly quiet treadmill – at least while running with no incline. If you're looking for something not too loud for either long walks or jogs with the occasional sprint, then this ticks all of the necessary boxes.",
    "The Echelon Fit App is what sets this treadmill apart from other brands. This subscription-based app provides dozens of hours workout videos with a variety of hit songs that you're guaranteed to recognise. There are classes for a variety of Echelon devices which will see the app link to the treadmill via Bluetooth, and while the app blocks the dashboard of the device the information will be available on the screen.",
    "The workout videos always include charismatic and charming hosts who will push you to exercise along with them, and you can pick between interval runs, long-distance runs, consistent jogs, or whatever else you wish.",
    "Even though the app links to the treadmill and can control when the Echelon Stride starts and stops, it will leave all control of speed and inclines to you, so you never get pushed out of your comfort zone.",
    "The Echelon Fit App was a wonderful companion on my Echelon Stride journey, but due to the fact that I would be manually adjusting the settings on the treadmill anyway, a similar effect can be achieved simply by looking for a YouTube series. While this is a great way to motivate yourself to exercise more and push your limits, there are more cost-effective ways of achieving the same goal.",
    "For either a monthly cost of $39.99 / £39.99 (about AU$55), or slightly less if you pay up-front for the full year. the Echelon Fit App subscription is costly, but absolutely worth trying for one month just to get you into the habit of using the Echelon Stride regularly."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and release date",
    "5": "Design",
    "10": "Performance",
    "15": "Echelon app subscription",
    "20": "Don't buy it if"
  },
  "links": {
    "direct from Echelon": "https://www.pjtra.com/t/8-12142-101987-179883?sid=trd-us-9890419622662408000&website=194177&url=https%3A%2F%2Fwww.echelonfit.com"
  }
}