{
  "source": "https://www.techradar.com/reviews/baishancloud-cdn",
  "title": "BaishanCloud CDN review",
  "category": "computing",
  "updated": "2021-03-22T19:22:36Z",
  "author": "mike-williams",
  "summary": "A Chinese CDN with some of the most helpful, hands-on customer service around",
  "verdict": "BaishanCloud isn't as configurable as some, but its mainland China presence is a big plus, and we love the way the company treats customers as partners, working with them to set up the CDN and get it working properly.",
  "pros": [
    "Large network includes 500+ locations in mainland China",
    "Can help you set up and configure the service",
    "Powerful security and video streaming features",
    "Instant purging"
  ],
  "cons": [
    "Pricing isn't publicly available",
    "Dashboard has a handful of translation issues",
    "Not as configurable as the top CDNs",
    "Little English-language documentation"
  ],
  "article": [
    "Note: Since our review, BaishanCloud informed us that it has now completed the English language localization of its dashboard, and made a full English user guide available.",
    "BaishanCloud is a leading Chinese cloud services provider which offers a host of industrial-strength security and performance products.",
    "The company's content delivery network (CDN) has a strong focus on China, with more than 500 PoPs spread across the country (even a giant like Amazon CloudFront has edge locations in only four Chinese cities.)",
    "The rest of the world isn't forgotten, either, as BaishanCloud has 100+ PoPs in other locations around the world.",
    "The company uses its own TCP optimization and intelligent routing technologies to power your traffic around its networks, and each edge server apparently has 'several terabytes of hybrid hard drive and hundred gigabits of RAM.' Maybe even more important, cache purging sees stale content removed in seconds, ensuring your site and visitors stay up-to-date (a speedy CDN isn't much use if it's still serving content you updated 30 minutes ago.)",
    "Enterprise-level extras include a comprehensive Web Application Firewall which intelligently analyses web traffic to detect and block malicious bots, cross-site scripting exploits, directory traversal trickery and a bunch of other common exploits. It's also customizable, and experienced users can create new rules of their own, as well as introducing custom CAPTCHAs and other challenges to help separate automated attackers from genuine visitors.",
    "BaishanCloud's video capabilities are impressive, too. Not only does the service support video-on-demand and live streaming via protocols including HLS, HDS, MPEG-DASH, HTTP-FLV, HTTP-TS and even RTMP (yes, really, there's much more to RTMP than Flash), but smart analysis of the video structure aims to achieve near instant playback, and adaptive bitrates reduce the chance of buffering when network conditions change. There's even an option to add customizable watermarks to your broadcasts, an easy way to copyright your content.",
    "As you'll guess from its lengthy list, BaishanCloud sells itself on power and functionality, not by trying to win you over with the lowest possible headline prices. If you're looking for something simple and ultra-low budget to accelerate a basic blog, this probably isn't the service for you (check out a vendor like Bunny, instead.)",
    "Unfortunately, we can't tell you exactly what BaishanCloud does charge, because the company hasn't made that public. We asked for more details, though, and it told us: 'We encourage potential customers to contact us for detailed pricing depending on the type of traffic and country/region. The lowest fee is $500/month for small businesses if less than 5 TB for non-dynamic traffic.'",
    "For comparison, Google Cloud CDN starts at $0.08 per GB for North American traffic, plus cache filling and request charges, so a similar $410-$420 (the precise figure depends on your setup, check out the price calculator for more.)",
    "Serve CDN traffic to China, though, and Google's charges leap to $0.20 per GB, or more than $1,000 per month. You're likely to get a much slower service, too, as Google and most other CDNs don't have any edge locations in mainland China, while BaishanCloud has more than 500.",
    "There's not enough information to give a proper verdict on BaishanCloud's pricing, then, but this looks generally comparable to other top names, and its Chinese mainland service just might be a real bargain (but to be sure, you'll need to ask the company yourself.)",
    "If you'd like more certainty, though, just ask for a free trial. The company will give you an idea of pricing, set up the service to suit your needs and give you a chance to run detailed performance tests.",
    "Sign up with most CDNs and the setup process is all down to you. The company dashboard might try to point you in the right direction, but it'll be your responsibility to browse the menus, figure out the options you need, and set them up appropriately. And if you have problems, your provider probably won't even realize until you contact support.",
    "Larger CDNs often do things differently, though, and BaishanCloud is a great example.",
    "Request a free trial and the company assigns you an engineer who then works with you to understand your needs, help you set up the system, come up with a workable test to confirm it's delivering what you need, then tune BaishanCloud's configuration to deliver the best results.",
    "This doesn't mean you've nothing to do, far from it. BaishanCloud needs to understand your requirements in real depth, and that means there's plenty to talk about.",
    "For example, the company's Onboarding form asks for more information on your business, origin details (server to accelerate, origin name, protocol and ports to use, geographic location), caching rules (file types to be cached, how to handle HTTP error codes, what to do with query strings), advanced settings (token authentication, referer or IP-based access control), traffic control (estimated bandwidth requirements, peak bandwidth), and more about the type of tests you'll be running on the system.",
    "While some of this requires real technical knowledge and thought ('please specify the custom cache key here', the form asked in one place, without further explanation), this is only a means to pass your requirements on to the BaishanCloud engineers. If you don't understand something, leave it blank, make a best guess or ask a question. The engineer reads this, sets up the service appropriately, or comes back to you with questions if he needs more detail.",
    "If you don't need this level of hand-holding, or the initial setup doesn't quite suit your needs, that's okay too. The onboarding process is an easy way to get started, but once the service is working, you can fully control BaishanCloud's setup from its dashboard just like any other CDN.",
    "BaishanCloud's dashboard has a comfortable, familiar look and feel. It opens with useful performance stats including bandwidth highs and lows, average hit rates and a configurable chart showing CDN traffic over time. A left-hand sidebar includes options to reconfigure an existing CDN setup, add new domains, view more in-depth reports or look at the logs. It's all very clear and straightforward.",
    "An alert at the top of the screen displayed an update message, listing new dashboard features in its most recent version ('added white themed skin, 'added back-to-origin traffic and back-to-origin request counts, and so on.) That's not something we recall seeing with any other CDN, but it's an excellent idea, and ensures you'll hear about new features as soon as they appear.",
    "Initial setup works much like any other service. Provide your domain name (mydomain.name), origin (cdn.mydomain.com) and preferred protocol (HTTP, HTTPS or just use the same as the origin protocol), BaishanCloud allocates you with a URL you can use with a CNAME record (mydomain.com.trpcdn.net) and deploys your setup within a few minutes.",
    "There are useful options to fine-tune caching rules. A simple CDN might allow setting a single default expiry time for all cached objects, for instance (1 minute, 30 minutes, 1 hour and so on.) BaishanCloud supports creating separate policies referring to file extensions, paths, directories, or use regular expressions to make precise selections; expiry times can be anything from one second to two years; and you can choose to ignore or accept the origin's own caching rules (no-cache headers or the origin's own TTL.)",
    "Other features are a little more basic. The CDN can cache objects based on an entire query string (example.com/pic.jpg?with=query) or ignore it, for instance. StackPath CDN has a more flexible Custom mode in the interface, where you can enter specific query strings you'd like to use as a cache key, but ignore everything else.",
    "Similarly, BaishanCloud's access control page has some useful options to block or allow access by IP or referer, but we've seen more options elsewhere. Microsoft Azure CDN and others allow blocking by country direct from the dashboard, for instance, while G-Core Labs CDN even allows blocking dependent on the user agent.",
    "There is real flexibility here, including the ability to customize the request headers to the origin, and any responses (you can overwrite existing header values or use new ones, for instance.) But although there are simple tooltip-like descriptions of some settings, you're mostly left to figure out the more advanced features for yourself. BaishanCloud doesn't have the level of in-depth English language documentation we see from the top CDNs. (The API is well covered, but there's very little on the dashboard tools.)",
    "We noticed a few translation issues with the interface, too, including a Chinese language error message during setup. That only happened once, but it's still a small concern. If a potentially business critical web service warns you of a problem, then you need to understand that warning immediately.",
    "Although we spotted a few potential problems here, keep in mind that they won't necessarily be issues for everyone. BaishanCloud's approach of working with you to understand your needs and configure the CDN means you might not have to spend any time setting it up yourself, and if you do run into trouble, you could always just ask support. (Bi-lingual support agents are available 24/7 and you can get a reply within a few minutes.)",
    "BaishanCloud also told us it was working to fix any translation issues, and is currently writing new English language documentation for its latest portal. That's good to know and we've no doubt it's true, but it doesn't completely address the issue. We expect a service provider to provide support documents for an updated console before it goes live, not at some point afterwards.",
    "If you're unsure whether BaishanCloud is right for you, the best approach is to ask for a free trial. The company will help you set it up, and you'll get a week or two to see how the service works, properly test site speeds and confirm it has the configurability you're after.",
    "BaishanCloud does more than any CDN we've seen to get you up and running, and its huge mainland China presence tramples over most of the competition. Demanding users might need more configuration options, though, and we'd like to see at least some website documentation on the service dashboard."
  ],
  "headers": {
    "7": "Pricing",
    "13": "Getting started",
    "20": "Features",
    "31": "Final verdict"
  },
  "links": {
    "BaishanCloud": "https://www.intl.baishancloud.com",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "Amazon CloudFront": "https://www.techradar.com/reviews/amazon-cloudfront",
    "RTMP": "https://en.wikipedia.org/wiki/Real-Time_Messaging_Protocol",
    "smart analysis": "https://en.wikipedia.org/wiki/Group_of_pictures",
    "Bunny": "https://www.techradar.com/reviews/bunny-cdn",
    "Google Cloud CDN": "https://www.techradar.com/reviews/google-cloud-cdn",
    "price calculator": "https://cloud.google.com/cdn/pricing#pricing-calculator",
    "StackPath CDN": "https://www.techradar.com/reviews/stackpath",
    "Microsoft Azure CDN": "https://www.techradar.com/reviews/microsoft-azure",
    "G-Core Labs CDN": "https://www.techradar.com/reviews/g-core"
  }
}