{
  "source": "https://www.techradar.com/reviews/chromecast-with-google-tv",
  "title": "Chromecast with Google TV review",
  "category": "televisions",
  "updated": "2021-12-02T14:45:03Z",
  "author": "nick-pino",
  "summary": "Chromecast with Google TV is an incredible value 4K HDR streaming device",
  "verdict": "The Chromecast with Google TV doesn’t reinvent the wheel for streaming devices, but it does offer a convenient, easy-to-use and fully featured option for people who don’t want to spend more than they have to on the latest streaming hardware.",
  "pros": [
    "4K HDR with Dolby Vision",
    "Google Assistant built in",
    "Comes with a remote",
    "Good selection of apps"
  ],
  "cons": [
    "Slow to load at startup",
    "Can’t be powered by all TVs",
    "Google TV UI is uninspired",
    "No Google Stadia support"
  ],
  "article": [
    "Google's Chromecast with Google TV (2020) is a revelation – it fixes something that wasn't broken, and improves a nearly perfect technology in a tangible way. And it's all thanks to the remote and Google's 'new' software, Google TV.",
    "Combined, the two offer a massive uptick in usability over previous Chromecasts that required you to use your phone or tablet to Cast content rather than giving you an on-screen interface to interact with.",
    "But now that Google has added a dedicated TV interface that you control with a remote, you have instant access to most of the major streaming services, including Disney Plus, HBO Max and even the streaming app of its biggest competitor, Amazon Prime Video. On top of that, there are a number of apps that have been carried over from Android TV, Google TV’s predecessor, that bring games and productivity apps to the streamer.",
    "The result is a retooled streaming device that might resemble its predecessors, but which offers a whole new experience that’s more user-friendly for folks who are used to using a remote control and an easily navigable interface.",
    "The Chromecast with Google TV is available in three colors (Snow White, Sunrise Peach and Sky Blue) starting on September 30 2020 in the US, and is available to pre-order on the Google Store in the UK, Australia, Canada and most of mainland Europe.",
    "In terms of price, you’re looking at $49 / £59 / AU$99, which makes it $20 more than the Chromecast (3rd Gen) and $20 less than the Chromecast Ultra. It’s not as good a deal in the UK or Australia – especially when you can get an Amazon Fire TV Stick 4K for £49 / AU$69 – but the price is still lower than, say, the Android TV-based Nvidia Shield that costs nearly three times as much.",
    "The new Chromecast with Google TV, then, fits in neatly as the middle child in the Chromecast family: it can stream 4K HDR with Dolby Vision, making it better than the basic Chromecast, but isn’t capable of streaming games like the Chromecast Ultra. Not having Stadia is unfortunate, but not a deal-breaker.",
    "For the last three years Google has stuck to a hockey-puck shape for its Chromecast devices, and it’s done so again for the Chromecast with Google TV. The latest design is slightly more elongated than before, but by and large it’s pretty similar to its predecessors.",
    "Again you'll connect the Chromecast to your TV via an attached HDMI cable (which, thankfully, uses the latest spec, HDMI 2.1) and draw power from either a wall outlet or via a USB port on your TV… if you’re lucky.",
    "We actually plugged the Chromecast into the back of a new Vizio V-Series TV, and were informed that it couldn’t draw enough power from the set’s USB port. This could be frustrating for anyone who doesn't have many remaining free power outlets in the vicinity of their entertainment center, but most people won’t be bothered by plugging the Chromecast into the wall.",
    "Unlike the Chromecast Ultra, there’s no Ethernet jack on the Chromecast with Google TV, which means it will only work over Wi-Fi. According to Google you’ll be able to buy a USB-C to Ethernet adapter for the Chromecast with Google TV, but one isn’t included in the box.",
    "On a more positive note, this new-and-improved Chromecast does come with a Bluetooth/IR remote. The plastic zapper is a bit on the flimsy side, but it comes fully stocked with a circular keypad, a volume rocker on the side and eight front buttons. If your TV supports HDMI-CEC you can control the volume of the TV with the Chromecast remote, and even power-down both the TV and Chromecast when you’re done watching.",
    "Because this is the first revamped Google TV product it does, of course, have a Google Assistant button on the remote that you can use to summon the eponymous virtual assistant – which we’ll talk more about in the next section.",
    "As you’d expect from a product with ‘Google TV’ in its name, the new Chromecast really caters to the Android audience out there: you’ll use your Google account as a login for the device, and you’ll then have access to Google Assistant, YouTube/YouTube TV (if you have an account), the Play Store, Google Photos, and Nest devices if you have them.",
    "Interestingly, this isn’t the first Android TV-based device to incorporate Google Assistant – Sony TVs have been using it for years, and it’s even used by the new Nvidia Shield – but it does feel right at home here. For those concerned about privacy, Google Assistant only turns on when the button on the remote is pressed, and you can outright disable the service when logging in with your Google account at startup.",
    "Tapping into your Google account will also populate the main screen of the Chromecast’s UI with relevant and recommended content. If you’re familiar with Android TV, this will all look super-familiar to you, but for the uninitiated it’s a veritable smorgasbord of content compiled from different sources. For example, on our home screen we have Captain America: The First Avenger (most likely because we binged the Marvel movies in order) and Parks and Recreation, among other comedies and sci-fi films.",
    "Scroll down a bit more from your recommended content row and you’ll find Netflix-esque rows of content that are grouped together by genre, a row of recommended videos from YouTube and finally trending shows and movies. Move from the For You tab and you’ll find separate areas for movies, shows, apps and your own library that, unless you frequently buy movies from Google Play Movies and TV, could be quite barren. There’s also a Live TV section, but that will only appear if you subscribe to YouTube TV. (Google does include a free trial inside the box, but you’ll still have to pay for it once the trial ends.)",
    "When you select something to watch, you can either immediately start watching it or add it to your Watch List so that you can find it again later. Google TV also uses a thumbs up / down system to help you improve the recommendations it makes. Last but not least, there’s a halfway decent built-in search feature that can show you several ways in which to stream a certain movie or show, but it’s not nearly as robust as Roku’s built-in search engine.",
    "The interface isn’t revolutionary and can feel a bit basic, but those are really our biggest complaints about it so far, otherwise Google TV seems easy-to-use and gets the job done.",
    "In terms of app support, all the main players are here including Netflix, Prime Video, Hulu, Sling, HBO Max and Disney Plus, plus over 6,500 lesser known apps that Google TV has inherited from Android TV. The only major missing app here are is Apple TV, which is a bit disappointing considering it doesn't support AirPlay, either.",
    "Chromecast with Google TV performs admirably and rivals the performance of its competitors. Google hasn’t been explicitly clear on what’s going on inside the hardware at a system level, but regardless of whatever SoC it’s chosen to use, we've seen very few points that the Chromecast dipped in performance - especially once we chose which content we wanted to watch.",
    "In fact, the only real slowdown we noticed was at startup when the Chromecast was first populating the UI for the first time - which took a few seconds but wasn’t a substantial time suck. What’s impressed us is that the hardware seems to work both near the router and far away where there’s less signal, and seems to be just fine with less bandwidth… not that we’d recommend trying it if you plan on watching 4K HDR content.",
    "Speaking of, the Chromecast with Google TV can stream in 1080p or 4K HDR with support for the HDR10+ and Dolby Vision formats - all of which we’d recommend testing out at some point as they look downright great. For audiophiles, the new Chromecast supports DTS, Dolby Audio, Dolby Digital Plus and Dolby Atmos formats, but like the HDR formats you’ll need a compatible TV and/or sound system to actually hear them.",
    "Watching both Dolby Vision content and regular HD SDR streams looked fine on our TV, though you shouldn't expect the streamer to do any heavy lifting in terms of upscaling or post-processing. What you see is what you get.",
    "To get streams in their maximum resolution and high-end formats we recommend using the remote to use Chromecast’s native Google TV app, as that's where you're most likely to find it. However, if you just want content fast, you can use the Chromecast with Google TV like a regular ol’ Chromecast by Casting from your web browser, iOS or Android device which, as ever, is incredibly convenient.",
    "The only real limitation we’ve come across at the hardware level is that the Chromecast with Google TV doesn’t yet support Stadia. That’s not likely to be a deal breaker for everyone, but it is a minor caveat for folks looking for the all-singing, all-dancing streaming media player that can play the latest games.",
    "In terms of software, yes, sometimes you might notice a bit of slowdown on the main screen, but mostly the user interface is fast and responsive. Google Assistant can be hit-or-miss in terms of search results (queries like \"Who plays Captain Kirk?\" return convoluted, and sometimes inaccurate, results) but most times it works as expected."
  ],
  "headers": {
    "4": "Price analysis and release date",
    "7": "Design",
    "13": "Features",
    "20": "Performance",
    "27": "Don't buy it if..."
  },
  "links": {
    "Chromecast (3rd Gen)": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Chromecast Ultra": "https://www.techradar.com/reviews/chromecast-ultra",
    "Amazon Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Nvidia Shield": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "Marvel movies in order": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order"
  }
}