{
  "source": "https://www.techradar.com/reviews/lifx-clean-review",
  "title": "LIFX Clean review",
  "category": "smart-home",
  "updated": "2021-08-06T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "A smart light that can disinfect surfaces and items",
  "verdict": "The LIFX clean is a smart light bulb, which illuminates and can be controlled via a smartphone app. In addition, it can emit High Energy Visible (HEV) light onto items such as keys, wallets and even your smartphone to kill any bacteria present on their surfaces. While it responds instantly when controlled via the app or Alexa, it’s expensive – and the bulky bulb may not offer as neat a solution as rivals.",
  "pros": [
    "Can emit HEV light to kill bacteria",
    "Wide range of color and white tones",
    "Compatible with Alexa, Google Assistant and HomeKit"
  ],
  "cons": [
    "Expensive",
    "Bulky"
  ],
  "article": [
    "LIFX launched its first smart lighting product in 2014, and has continued to add to its range of the best smart lights, making it a worthy rival to Philips Hue and Nanoleaf. The LIFX Clean is one of its top-of-the-range smart bulbs – the A19, or the A60 if you’re in the UK.",
    "Designed to replace your existing light bulbs, the LIFX Clean offers all of the smart features you’d expect. This includes the ability to use your phone to switch it on or off, or to brighten or dim light. However, it builds on these existing features by including tech that allows you to disinfect items and surfaces on which the light is shone.",
    "When set to a Clean Cycle, the LIFX Clean emits a High Energy Visible (HEV) light – a blue-hued light with a wavelength of around 405nm – that can kill bacteria including E coli and S aureus. The bulb needs to be placed in a side lamp or pendant light fitting that points directly at the area/item you wish to clean. The bulb can be used in this mode anywhere between 2 and 12 hours, and the closer it is to the item you’re disinfecting, the more effective its bacteria zapping abilities will be. Unlike UV light, which can also be used to disinfect items and surfaces, exposure to HEV light is considered safe for humans and pets.",
    "The LIFX Clean is available in an E27 screw fitting, and in the US and UK, in a B22 bayonet fitting as well. When not being used to disinfect your home, the LIFX Clean can illuminate in up to 550 billion different shades of color and white, to ensure you can achieve the perfect ambiance for your room at any time. It connects directly to your home Wi-Fi network and can be controlled using the LIFX app, even when you’re not at home. If you use an iPad or iPhone, then HomeKit integration means it can be controlled via the Apple Home app, too. The LIFX Clean is compatible with Alexa and Google Assistant, so you can use voice commands as well as your smartphone to control it.",
    "At $69.99 / £69.99 / AU$89.99, it’s the most expensive smart light bulb LIFX offers. However, for those looking for a smart lighting solution that also provides a means to disinfect their home or anyone who already owns LIFX smart bulbs and is looking to add more, it’s worth the hefty investment.",
    "The LIFX Clean is priced at $69.99 / £69.99 / AU$89.99 and is available from LIFX direct or online retailers including Amazon. It’s the most expensive single smart light bulb LIFX sells.",
    "The LIFX Clean builds on the features of the LIFX A19, known as the A60 in the UK and Australia, with an option to disinfect surfaces and items. The original A19/A60 will set you back $49.99 / £54.99 / AU$69.99",
    "The LIFX Clean is an individual smart light bulb designed to replace an existing incandescent bulb. As mentioned already, it’s available with an E27 screw fitting, and in the UK and Australia, a B22 bayonet option too.",
    "Sporting a more angular design, as opposed to the traditional rounded shape of incandescent light bulbs, the LIFX Clean measures 4.6 x 2.5 x 2.5 inches / 11.6 x 6.4 x 6.4cm (h x w x d). As such, it's a little larger than a traditional light bulb, which may see it protrude from smaller lampshades on side lights. The metal fitting sits on the bottom of the bulb, with a white plastic body and a frosted plastic top from where the light illuminates.",
    "The LIFX Clean is an LED bulb, with brightness measured in lumens, as opposed to the watts of incandescent bulbs. It offers 1,200 lumens of light, the equivalent of the light given off by an 80W incandescent bulb, which makes it one of the brightest smart light bulbs on the market.",
    "The LIFX Clean is a color smart light bulb and can be tuned to glow any of 550 billion different shades of color and white. So expect a rainbow of colors and white light ranging from 1,500 Kelvins (a really warm amber hue) to 9,000 Kelvins (a shade so cool, it’s almost blue).",
    "We found the LIFX Clean extremely simple to install. Once we’d replaced our existing incandescent bulb with the LIFX Clean, we downloaded the LIFX app and then followed the instructions on-screen to pair the bulb with our Wi-Fi network.",
    "We set up the LIFX Clean through the app using an iPhone, which was super-simple thanks to HomeKit support: we simply scanned the QR code on the quick-start guide and we were ready to go.",
    "On test, we found the LIFX clean responded instantly when switched on or off using the LIFX app or Alexa. It was simple to adjust the color or tone of white light using the color wheels, which are displayed after tapping the light in the device list. Like many of the best smart lights, the Clean can also be dimmed or brightened using the slider in the centre of the color wheel.",
    "You can also set schedules, so the smart light automatically illuminates in a specified color, at set times. We were particularly impressed by the range of fun lighting effects that can be applied to the LIFX Clean, and any other LIFX bulbs you have installed in your home – such as flickering like a candle, strobing and even adjusting the color and brightness in time to music.",
    "We found the Clean Cycle was easy to activate, using the icon featuring three stars next to the bulb’s name. The HEV light can be set to shine from anywhere between 2 and 12 hours, and it's possible to schedule it, too, meaning it can disinfect your room while you sleep. However, in our experience, the LIFX Clean was best placed in a pendant light hanging from the ceiling, or in a desk lamp that can be angled, as opposed to a traditional side lamp where the bulb will illuminate upwards.",
    "The LIFX app is simple to navigate and ensures that switching the LIFX Clean on or off, and adjusting the brightness or color can be completed in one or two steps. When you launch the app, you see a list of LIFX lights installed in your home and the room to which they’ve been assigned. You can either switch the individual bulbs on or off using the slider next to them or use the slider next to the group name to control all of the lights in a particular group. Tapping the group or bulb name will bring up a color wheel, allowing you to pick the hue you want the bulb to illuminate.",
    "Swiping right from the main screen will bring up the effects that can be added to the bulbs while swiping left will display any schedules created, and allow you to edit these or create new ones.",
    "As we’ve already mentioned, the bulbs integrate with Apple HomeKit. As such, you can use the Apple Home app, rather than the LIFX app, to control them via an iPhone or iPad. Although note that some functionality, including the Clean Cycle, is only available through the LIFX app.",
    "The LIFX app also lets you connect the LIFX Clean with Alexa and Google Assistant, enabling you to use voice commands to dim or brighten the bulb, apply lighting effects, or even turn it on or off.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "LIFX Clean price and availability",
    "7": "Design",
    "13": "Performance",
    "16": "App",
    "20": "Don't buy it if..."
  },
  "links": {
    "best smart lights": "https://www.techradar.com/news/best-smart-lighting"
  }
}