{
  "source": "https://www.techradar.com/reviews/idrive-compute",
  "title": "iDrive Compute review",
  "category": "computing",
  "updated": "2021-10-12T09:51:17Z",
  "author": "daniel-blechynden",
  "summary": "Advanced cloud computing solutions from a newcomer to the market",
  "verdict": "iDrive Compute is a newcomer to the cloud computing space, but an in-depth analysis of its VPS solutions shows that it’s right up there with the best in the industry.",
  "pros": [
    "Extremely flexible VPS solutions",
    "Competitive prices across the board"
  ],
  "cons": [
    "Phone support isn’t available 24/7"
  ],
  "article": [
    "With the best VPS hosting, you can host a website, take advantage of powerful cloud computing, and do much, much more. There are numerous options available, including the increasingly popular iDrive Compute.",
    "In our iDrive Compute review, we take a closer look at this US-based cloud computing and VPS service provider. By analyzing its main features, prices, and more, we deliver the information you need to make an informed decision about whether this provider could be useful for you.",
    "iDrive Compute offers a selection of subscription options, with both annual and monthly payments available. At the lower end of the spectrum sits a range of shared CPU plans, which start at $5 per month for 1 GB of RAM, 40 GB of storage, and 1 TB of bandwidth. Annual payments are also available, with a special price of $6 for the first year ($60 for subsequent years).",
    "Then there are the much more advanced shared CPU plans. The most expensive option comes in at $320 per month and includes 64 GB of RAM, 1280 GB of storage, and 12 TB of bandwidth.",
    "Alternatively, you might like to go for one of the CPU-optimized or memory-optimized dedicated CPU plans. Once again, there are numerous options available. CPU-optimized VPS starts at $40 per month for 4 GB of RAM, 25 GB of storage, and 6 TB of bandwidth.",
    "Meanwhile, memory-optimized plans start at $60 per month. This gets you 8 GB of RAM, 120 GB of storage, and 10 TB of bandwidth.",
    "Pay-by-the-hour subscriptions are also available across the board, although the lack of any free trial is a little disappointing. Additional fees can occur if you exceed your allocated resources, with additional bandwidth coming in at $0.01 per GB.",
    "Although it’s a relative newcomer to the cloud computing market, iDrive Compute offers an impressive selection of advanced features.",
    "One standout feature is iDrive Compute’s advanced infrastructure. All servers feature modern processing units and fast NVMe storage. You will be able to choose from a range of Linux distributions, as well as customize and scale your plans as required.",
    "Another interesting feature of the service is iDrive Compute’s selection of data center locations. At the time of writing, centers were available in 20 different locations spread across the United States. And the company plans to add international locations in the future.",
    "With iDrive Compute’s flexible block storage solutions, you can add or remove storage space with the click of a button. Storage volumes can also be transferred between VPS instances, and multiple volumes can be attached to the same instance for additional flexibility.",
    "To get started with iDrive Compute, you will first need to create a new account. One thing to note here is that you need a business email address—personal addresses such as @gmail.com or @hotmail.com aren’t accepted. As of October 2021, There is no longer a requirement for business email to signup for IDrive Compute",
    "Once you’ve signed up, you will be taken to your account dashboard, which is intuitive and easy to navigate. Add new VPS instances via the Instances menu on the left of the screen, select your desired distribution, and get started. Other management options include SSH key, firewall, and user permissions.",
    "IDrive Compute’s customer service is decent, but it does have a few flaws. Technical support is available via phone (6:00 am to 11:30 pm PST, Monday to Friday), online ticket submission, email, and live chat.",
    "We tested the live chat and received a reply almost instantly. However, it is worth noting that our questions weren’t answered very well. Instead, it seemed like we got a generic copy-paste answer, which is a little concerning.",
    "Along with the live support channels, there are various video tutorials and an in-depth FAQ section. The video tutorials stand out as excellent, covering various aspects of setting up and managing your VPS instance in an easy-to-understand manner.",
    "For starters, iDrive Compute’s servers are held in modern data centers featuring all the security measures you’d expect, including 24/7 video surveillance and biometric access controls. Protect your server with a range of tools, including a configurable firewall, SSH keys, and advanced user access controls.",
    "On top of this, iDrive Compute provides advanced infrastructure to help you comply with various regulations, including HIPAA, SEC/FINRA, SOX, and GDPR.",
    "One of the leading alternatives to iDrive Compute is Google’s Compute Engine, which enables you to create powerful virtual machines based on Google’s cloud infrastructure. This platform offers highly versatile solutions backed by the reliability and advanced features that come with one of the world’s largest digital ecosystems.",
    "Alternatively, you might like to go for a more sophisticated option like Hostwinds, which offers a range of VPS website hosting solutions. This is a great choice for those who plan to host a website on their VPS server, as it includes a range of specialized management tools.",
    "Although iDrive Compute is a newcomer to the cloud computing space, it offers an excellent selection of VPS solutions. Its prices are competitive, and the flexibility and scalability on offer are impressive, to say the least.",
    "On top of this, the platform offers excellent security integrations, helping you to comply with the relevant legislation and regulations. The customer service is impressive as well, even if phone support is limited to US business hours.",
    "All things considered, we’d recommend using iDrive Compute if you’re looking for an advanced enterprise-level cloud computing solution."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "11": "Interface and in use",
    "13": "Support",
    "16": "Security",
    "18": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "best VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "iDrive Compute": "https://www.idrivecompute.com/",
    "shared CPU plans": "https://www.idrivecompute.com/pricing.htm",
    "dedicated CPU plans": "https://www.idrivecompute.com/pricing.htm",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Linux distributions": "https://www.techradar.com/best/best-linux-distros",
    "business email address": "https://www.techradar.com/news/best-email-provider",
    "firewall": "https://www.techradar.com/best/firewall",
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know",
    "Google’s Compute Engine": "https://cloud.google.com/compute",
    "virtual machines": "https://www.techradar.com/best/best-virtual-machine-software",
    "Hostwinds": "https://www.techradar.com/reviews/hostwinds"
  }
}