{
  "source": "https://www.techradar.com/reviews/audio-technica-at-lp120xbt-usb",
  "title": "Audio-Technica AT-LP120XBT-USB review",
  "category": "audio-visual",
  "updated": "2021-02-03T11:26:00Z",
  "author": "simon-lucas",
  "summary": "An affordable turntable that makes playing records as painless as can be",
  "verdict": "Bringing ultimate convenience to the world’s most inconvenient audio format without reducing sound quality at the same time, the Audio-Technica AT-LP120XBT-USB does more than you might expect – and in some style.",
  "pros": [
    "aptX Bluetooth streaming and integrated phono stage",
    "Makes digital copies via USB output",
    "Detailed, easy-going sound"
  ],
  "cons": [
    "Not the most dynamic-sounding turntable around",
    "Wireless performance sounds a little closed-in"
  ],
  "article": [
    "Audio-Technica established its vinyl credentials many years ago, and the AT-LP120XBT-USB is the company’s latest attempt to bring a bit of 21st century modernity and convenience to the venerable format.",
    "And at $299 / £289 / AU$749, it’s trying to democratize turntable technology as much as possible.",
    "At first glance, the AT-LP120XBT-USB looks the part – it owes more than a little to the legendary Technics SL1200/SL1210 where aesthetics are concerned. But as well as all the DJ bits and bobs (like pitch control and super-responsive direct drive motor), this Audio-Technica turntable has an integrated, switchable phono stage, a USB output and wireless aptX Bluetooth connectivity. All of which makes it a fair bit more adaptable than your average record player.",
    "It’s very nearly a plug’n’play arrangement – all you need to do when it first comes out of the box is put the aluminum platter on, fix the cartridge to the tonearm and the hinges to the dust-cover, and you’re good to go. (If you're a total turntable novice, check out our guide on how to setup a record player for more information).",
    "You can go in any one of a few directions when it comes to your turntable setup. You could hard-wire the deck using the bundled RCA cables, and switch its integrated phono stage on or off depending on the sort of system you’re wiring to. Or connect wirelessly to an audio system, a Bluetooth speaker or some wireless headphones using the aptX Bluetooth function. Or simply make digital copies of your records and play them back via any music device you fancy.",
    "In any event, you’ll be treated to a warm, detailed sound that carries plenty of detail and knits the individual strands of a recording together in the most lifelike and convincing manner – a sound, in fact, that reminds you of exactly while the vinyl format refuses to die.",
    "No, it’s not the punchiest or most dynamic record player you can buy for $300 / £300 / AU$750 or so – but that misses the point somewhat. If you want to drag your vinyl experience into the modern world, this is how to do it – and that's why we think the AT-LP120XBT-US deserves a place among the best turntables of 2021.",
    "The Audio-Technica AT-LP120XBT-USB is on sale now, priced at $299 / £289, while in Australia it’s a rather disproportionate AU$749 – which is puzzling, when you consider that the US price converts to roughly AU$420.",
    "There are any number of very decent turntables at this sort of money, of course – but they’re simply record players, with none of the Audio Technica’s flexibility or (let’s face it) convenience.",
    "Where like-for-like products are concerned, this pricing pitches the AT-LP120XBT-USB above Sony’s well-regarded PS-LX310BT – but the Audio Technica does add a USB output, plus a great deal of paraphernalia to excite any budding DJs.",
    "No two ways about it, the AT-LP120XBT-USB (which from now on we’ll be calling the ‘120’ for the sake of both brevity and sanity) is designed to evoke the classic Technics SL-1200/SL-1210 DJ turntable everyone knows and loves.",
    "At this sort of money, of course, you can’t expect the bombproof build of a Technics deck – but at 8kg, the 120 is hardly a featherweight.",
    "It’s mostly made of plastic, but it’s robust where it counts: the heftily damped, rubberized feet offer both isolation from external vibration and a degree of self-leveling, and the platter is of die-cast aluminum.",
    "The DC servo direct-drive motor no doubt contributes to the weight too. Start-up is instantaneous, and all the manual controls – start/stop, speed selection and so on – feel well-damped and sturdy. In the approved Technics manner, the 120 plays at 33.3 or 45rpm – or, if you press both speed selector buttons at the same time, 78rpm too.",
    "There’s not a lot of scope (or, indeed, demand) for design flourishes where record players are concerned, so consequently the 120 doesn’t feature any. The DJ-related bits and bobs – quartz-locking +/- 10% pitch control, stroboscope, target light, big start/stop button and so on – are all present and correct, of course, and the 231mm tonearm is S-shaped in the traditional Audio-Technica manner.",
    "The counterweight, anti-skate mechanism and hydraulic lift control all feel more than adequate, and the 120 is supplied with a very acceptable AT-VM95E cartridge that bayonets onto the tonearm in seconds. Fundamentally, then, it’s ‘turntable-with-professional-pretentions’ business as usual.",
    "It’s hardly business as usual at the back of the deck, though, where there’s quite a lot more going on than is generally the case.",
    "As well as the usual input for mains power, stereo RCA outputs, and grounding post, there’s a switch marked ‘phono/line’ – the 120 has a switchable phono stage, so it will slot easily into systems of all types. There’s also a USB output, allowing it to connect to a computer in order to make digital copies of vinyl records. Any suitable software can be used, though Audio-Technica recommends Audacity, which is a) free for Mac and PC, and b) simple and effective.",
    "In addition to these physical connections, the 120 has a button with the ‘Bluetooth’ symbol beneath the tonearm. The Audio-Technica features aptX Bluetooth, for wireless connection to speakers, headphones and the like – which confirms the 120 as a far more flexible and all-around more adaptable device than most wired record players.",
    "The charm of the 120’s extensive connectivity, of course, is that it's possible to hear it any number of ways.",
    "Received wisdom says it will sound best when hard-wired into a system using its stereo RCA outputs – Audio-Technica thoughtfully supplies some cables, complete with earthing lead, in the packaging.",
    "If your system doesn’t have sufficient amplification to make a turntable audible (a ‘phono’ input, in other words), just switch the 120’s integrated phono stage to ‘on’ and away you go. If your system has phono amplification of its own, though, it’s possible to compare and contrast this with the 120's phono stage to find out which you prefer.",
    "In any event, though, the sound of a hard-wired 120 is almost entirely gratifying. With the lavish 30th anniversary reissue of Pixies’ Bossanova spinning, many of the traditional vinyl virtues are to the fore.",
    "Low frequencies are warm and weighty in the celebrated vinyl manner, but pretty well-controlled at the same time – bass sounds start and stop with reasonable accuracy, rather than slurring into uniformity.",
    "At the opposite end, the 120 isn’t the most treble-happy turntable we've ever heard, but it nevertheless summons respectable bite and attack. In the midrange, Black Francis’ vocals, whether he’s crooning or screaming, are nicely detailed and integrated into the overall performance seamlessly.",
    "‘Timing’ (the way individual elements of a recording relate to each other and cohere into a unified performance), is often held up as one of the unarguable strengths of the vinyl format, and there’s no doubt the 120 delivers the record in well-integrated fashion. There’s a lack of outright dynamism to the Audio-Technica’s presentation that can let ‘composure’ slide into ‘matter-of-fact’ -ness rather too easily, but overall its presentation is just on the right side of ‘serene’.",
    "Disconnecting the cables and putting the 120 on a shelf far from the system it’s linked to is almost satisfying enough to make up for the step down in sound quality that comes with a wireless connection.",
    "When streaming Boards of Canada’s Music Has the Right to Children via aptX, the Audio Technica loses just a touch of low-end positivity, and the previously explicit soundstage becomes just a touch hazy. Timing is still satisfying, though – almost as satisfying as the sight of a record player connected only to the mains yet doing its thing regardless.",
    "The digital copies the 120 makes via its USB output are closer in character to the sound of its wireless, rather than wired, performance. The USB also seems keener to spotlight vinyl surface noise than any of the other outputs – but, nevertheless, the facility to make digital copies of hard-to-find, easy-to-damage records is not to be downplayed.",
    "Kent Records’ On the Soul Side compilation, for example, is a treasure-trove of rare recordings that have never made it onto Spotify or the like – but making a digital copy means it is just as easy to listen to, wherever and whenever you like, as anything else available via music streaming services."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Audio-Technia AT-LP120XBT-USB price and release date",
    "10": "Design",
    "16": "Connectivity",
    "19": "Audio performance",
    "30": "Don't buy it if..."
  },
  "links": {
    "turntable": "https://www.techradar.com/news/best-turntables",
    "Technics SL1200/SL1210": "https://www.techradar.com/news/technics-upgrades-its-famous-dj-turntable-with-the-sl-1200-mk7",
    "record player": "https://www.techradar.com/news/best-turntables",
    "how to setup a record player": "https://www.techradar.com/how-to/how-to-set-up-a-turntable",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "best turntables of 2021": "https://www.techradar.com/news/best-turntables",
    "Audacity": "https://www.techradar.com/reviews/audacity",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "music streaming services": "https://www.techradar.com/best/the-best-music-streaming-services-2021"
  }
}