{
  "source": "https://www.techradar.com/reviews/edx",
  "title": "edX learning platform review",
  "category": "computing",
  "updated": "2021-09-15T03:26:14Z",
  "author": "jonas-p-demuro",
  "summary": "Changing the world through education",
  "verdict": "edX offers university level content that can be applied towards a number of certificates and degree programs. While the price may keep some folks away, the in depth learning attracts folks by the millions.",
  "pros": [
    "Leading university content",
    "Free courses",
    "Micro degree offerings",
    "Smartphone apps for both platforms"
  ],
  "cons": [
    "Limited support options",
    "App shortcomings",
    "High cost of degrees",
    "Lack of more casual content"
  ],
  "article": [
    "Not a newcomer to the online learning space, edX has been in the business for almost a decade, tracing its origins to 2012. Unlike some other platforms in the space that “Crowdsource” the content, edX has partnered with leading colleges and universities to offer university quality lectures for adult learning. These institutions of higher learning include the likes of Harvard University, Boston University, University of California Berkeley, and the Massachusetts Institute of Technology (MIT).",
    "Overall, edX claims over 3,000 courses, offered by 160 partners, and 15,000 instructors. There have been a staggering 35 million users that have enrolled in 110 million courses, with 1.4 million verified course certificates issued.",
    "edX excels at more serious content, essentially college level and quality classes that you would find at a major university. This is because the classes are in many cases taught by university professors at leading institutions of higher learning. The level of classes range from those that could be a certificate program, to graduate level education.",
    "Those looking for some more casual content, such as a weekend cooking class, are not likely to find it here. Rather, the courses are organized by college departments, with specialty divisions. For example, under the Computer Science Department, we have areas such as Azure, Blockchain, and HTML. This all gets organized similar to a college course catalog.",
    "The real strength of edX is that it is content suitable for a college degree. Rather than having to search online for a university that offers the appropriate content, the expansive course catalog makes it easy to find the best content, and to then sign up for just the course itself, or as part of an online degree, either fully, or to be applied to a formal degree at the college.",
    "Unlike some other online learning platforms, edX does not offer a monthly subscription plan for the content that for one price you can watch all the videos you want. We won’t get too upset with this, as for any of the courses that we did find, there was an option to enroll in the course at no cost, a great way to essentially audit a college level program. This strategy is also useful to find out more about the course before committing further.",
    "Then there is the option for a professional certificate, which is a series of courses on a specific topic to acquire a new skill or credential, such as to update a CV, or gain a promotion. The topics are varied, such as Computer Science Essentials for Software Development from PennX (University of Pennsylvania), which is four courses, is designed to take 4 months at 7 to 9 hours per week (but is self-paced is another schedule works better), and is currently on sale for a cost of $536.",
    "For those looking to build an even more comprehensive skill set, there are both MicroBachelor and MicroMaster programs. These are designed to provide a deeper learning experience on a specific topic. There are a list of companies that recognize this learning such as Volvo, Walmart and Adobe, and also this learning can be applied to a formal college degree to accelerate getting a master’s or bachelor’s degree via the applied credits. An example is the MicroMaster’s program in Cybersecurity, offered by RIT. It consists of five graduate level programs, and is instructor led designed to be completed over 10 months, currently on sale for $1436.",
    "Finally, there are fully online master’s degrees offered in a range of subjects. For example, there is the online MBA offered by Boston University consisting of 6 modules, designed to be completed in two to three years, at a cost of $24,000.",
    "Just a comment on that last price. While $24,000 is quite expensive compared to some other online streaming platforms, realize that this is more than reasonable as a graduate degree can easily run into a six figure price tag.",
    "Support is available at edX, but the options could be more comprehensive. Missing contact options include a direct phone number, let alone a toll free number. We also did not find a fax number, or a direct email. We also did not find a contact portal, nor videos, or an online community.",
    "The help is rather more automated. There is an extensive FAQ, and a box to ask a question, which then takes the user to the appropriate section of the FAQ. There is also a chat box that is summoned by clicking on the icon in the lower right hand corner of the screen, but the chat that opened up was chatbot only. After attempting requests for a direct phone number, or a live person, and only being given links, it is certainly difficult to get in touch with anyone. After a while, we did get the option to email edX, but a direct email was not provided, and it had to be submitted through the chat box portal.",
    "edX has apps available on both smartphone platforms. On the Apple side, the app has a rating of 4.7/5, with generally favorable reviews, although some point to shortcomings with playing content offline, and a sparse interface. On the Android app, the app has the identical 4.7/5 rating, with deficiencies in being able to choose the video quality, and the website interface being superior.",
    "edX is a popular platform, with content across a variety of subject matters. We can see why users are pleased with the certificate and degree offerings, the high rating of the smartphone apps, and the free courses offered. The misses cover the bugs in the smartphone apps, the lack of more direct support options, and that there is no casual content. In the final analysis, edX offers compelling content for more serious learning."
  ],
  "headers": {
    "2": "Features",
    "5": "Plans and pricing",
    "10": "Support",
    "12": "User reviews",
    "13": "Final verdict"
  },
  "links": {
    "online learning": "https://www.techradar.com/best/best-online-learning-platforms",
    "edX": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9034341970981359000&xs=1&url=https%3A%2F%2Fwww.edx.org%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fedx",
    "Computer Science Essentials for Software Development": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2520150795802915300&xs=1&url=https%3A%2F%2Fwww.edx.org%2Fprofessional-certificate%2Fpennx-computer-science-essentials-for-software-development&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fedx"
  }
}