{
  "source": "https://www.techradar.com/reviews/iphone-xs-max-review",
  "title": "iPhone XS Max review",
  "category": "phones",
  "updated": "2021-09-30T20:44:51Z",
  "author": "gareth-beavis",
  "summary": "Apple's big, aging iPhone is still top quality",
  "verdict": "Apple finally delivers an iPhone with a huge screen, and for movie-watching, game-playing fans the iPhone XS Max is an exciting new addition to the range. It certainly costs a lot, but if you can get past the price (which many won't be able to) the XS Max offers up a super, supersized experience.",
  "pros": [
    "Screen great for gaming & movies",
    "Camera is a strong offering"
  ],
  "cons": [
    "Price: most expensive iPhone ever",
    "Size can make it tricky to handle"
  ],
  "article": [
    "The iPhone XS Max (pronounced 'Ten S Max') was the largest smartphone Apple had ever released when it launched in September 2018. With a 6.5-inch display, hardly any screen bezel, and the now-iconic top-screen notch, it was a dominating presence in the hand.",
    "Sure, it's no longer one of Apple's latest phones after being superseded by the iPhone 11 range in 2019, the iPhone 12 range in 2020, and lastly the iPhone 13 lineup in 2021. Among those is the iPhone 13 Pro Max, the latest big iPhone which has stretched out to a 6.7-inch display in the same-sized frame, and improved the cameras and specs to boot.",
    "While no longer the biggest and fastest iPhone out there, the iPhone XS Max is still an impressive piece of kit: It's fast, has great cameras, and longer-lasting battery than most of Apple's lineup. And after being on the market for a few years, you can pick it up for a bargain now.",
    "Just don't expect to pick it up from Apple directly: the tech giant dropped the iPhone XS Max from its stores to simplify the product range, but it's still available from retailers and carriers – and at a significantly lower cost than when it launched.",
    "While the iPhone XS Max was the largest and most expensive iPhone at launch with its 6.5-inch display, it's been surpassed in both size and cost by premium Android flagships. The phone still dominates your pocket, which was a bold statement from a firm that had resisted expanding its phones' screen sizes to the same enormous degree as its Android rivals.",
    "For those who crave more screen for video and gaming on the go, the expansive display of the iPhone XS Max (and newer iPhone 12 Pro Max) are a welcome part of Apple’s lineup, while those wanting a premium experience without the supersized dimensions can take comfort that it’s launched alongside the smaller iPhone XS – though if you want small, the iPhone 12 mini is the tiniest iPhone in years.",
    "And while it misses out on the iPhone 12 Pro Max's truly impressive night photography, the iPhone XS Max retains nearly all the perks inherited by its replacement. For a lower cost, you're still getting a plus-sized iPhone with the best iOS has to offer (with all the perks of iOS 14) and a great display for binging media.",
    "Update: Apple has released iOS 15 and confirmed that the software will come to the iPhone XS Max. Highlights of iOS 15 include the ability to include Android users on FaceTime calls, additional details in Apple Maps, statuses for Messages, and much more. Simply open the Settings app and go to General > Software Update to upgrade for free.",
    "Watch our 48-hour review of the iPhone XS and iPhone XS Max video below",
    "Apple no longer sells the iPhone XS Max, but when it did, it charged a lot. Luckily, you can still find the handset at other retailers, carriers and networks.",
    "As we've already hinted, this is a premium phone with an even more premium price tag. The iPhone XS Max started at $1,099 (£1,099, AU$1,799) for the 64GB model, which is $100 (£100, AU$170) more than the iPhone XS.",
    "If you want more internal storage, the 256GB iPhone XS Max price was $1,249 (£1,249, AU$2,049), while the most expensive 512GB version will set you back a staggering $1,449 (£1,449, AU$2,369).",
    "At the time of launch, there was no mainstream smartphone that costs more than the 512GB iPhone XS Max did at launch, putting it in a league of its own in terms of pricing. Now, there are even more expensive mainstream phones but this is still a lot of money for a handset.",
    "Plus, the launch of the iPhone 11 and 12 families have brought the price down. At the time of our latest update to this review, the handset with 64GB of storage cost around $600, £600 or AU$800.",
    "That said, it's getting increasingly hard to find new models of the iPhone XS Max, so if you really still want to buy it you might have to settle for a refurbished handset. Of course, the price of those is even lower.",
    "The iPhone XS Max design is deceptive. Pick it up, and the rounded sides of the handset make it feel noticeably thick.",
    "The result is a phone that doesn't sit as comfortably in the hand as it could, and considering the size and cost of the XS Max it's a phone you want to be able to securely hold. This is only half the story though.",
    "We compared the iPhone XS Max to a number of phones during our in-depth review, including the Samsung Galaxy Note 9 (6.4-inch screen), OnePlus 6T (6.41-inch) and Sony Xperia XZ3 (6-inch), and the iPhone felt thicker, and less planted in the hand than all of them.",
    "The funny thing is though, the iPhone XS Max is thinner than all of those phones at just 7.7mm.",
    "The reason for this is simple: tapered edges. The Samsung, Sony and OnePlus all taper their rear edges, giving the impression of a thinner device while also allowing them to sit a little better in the curvature of your hand.",
    "The iPhone XS Max has a totally flat back that's a little more awkward to hold, and we found that a tactfully-placed pinkie finger on the underside of the phone was a must for one-handed use.",
    "What's more impressive is that the XS Max manages to squeeze a huge 6.5-inch display into a body that's a touch shorter and narrower (at 157.5 x 77.4mm) than the iPhone 8 Plus, which only boasts a 5.5-inch display.",
    "While the iPhone XS Max does feel a little chunky in the hand there's no questioning the fact that you're getting a huge amount of display real estate crammed into a form factor which does a good job of keeping it usable.",
    "The steel frame around the outside and the new formulation of glass on the front and rear – which is tougher than the glass on the iPhone X – give the iPhone XS Max a supremely premium look and feel, while its resistance to dust and water has also been enhanced.",
    "Apple has upped the protection to IP68, enabling the iPhone XS Max to be submerged to a depth of up to two meters for 30 minutes without suffering any ill effects. Apple claims it's tested the protection in a number of liquids, including salt water, chlorinated water, milk, wine and beer, although we wouldn't advise purposefully exposing the handset to any of these.",
    "It's worth noting that Apple's warranty, like those of all phone manufacturers, doesn't cover 'liquid contact' damage, which means if the liquid resistance does fail on the iPhone XS Max you won't be covered.",
    "There's no headphone jack on the iPhone XS Max. The port is now totally dead after Apple killed off the iPhone 6S and iPhone SE post-iPhone XS launch (the last two handsets with the 3.5mm jack that were available from the firm's site), which means you get a centralized Lightning port alongside speaker and microphone holes on the base of the iPhone XS Max.",
    "There's a pair of Apple EarPods with a lightning connector in the box with the iPhone XS Max, but if you plug this into the lightning port on the base of the phone you can't connect the charging cable to it at the same time.",
    "Thankfully, the iPhone XS Max also supports wireless charging, so if you have a charging pad to hand you can top the handset up while listening to a wired set of headphones.",
    "The power/lock key is on the right side of the XS Max, and is easy enough to hit with thumb or forefinger, while the volume keys sit below the physical mute switch on the left of the handset.",
    "Hold the power/lock key down and you'll bring up Siri, which means turning off the iPhone XS Max requires you to hold down the power and volume up keys until an on-screen prompt appears.",
    "The SIM card tray continues to be located below this key, but there's a new feature inside the iPhone XS Max (and XS). The handset is dual SIM enabled, with an eSIM embedded inside the handset.",
    "This allows you to insert a SIM from the carrier of your choice, and then enable the eSIM on a different plan or carrier. It's worth noting that not all carriers support eSIM technology, and availability varies by region, so make sure you check before signing up to anything.",
    "Overall though, Apple hasn't moved far from the design of the iPhone X with the iPhone XS Max, other than to stretch it a little. There is, however, a new color option over the X.",
    "Apple introduced a new gold finish for both the iPhone XS Max and XS, and it's a little richer than the more subtle gold finish option for the iPhone 8 and 8 Plus. If you find the gold a bit too much, the iPhone XS Max also comes in Silver and Space Gray."
  ],
  "headers": {
    "9": "iPhone XS Max price and availability",
    "15": "Design"
  },
  "links": {
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "Sony Xperia XZ3": "https://www.techradar.com/reviews/sony-xperia-xz3-review",
    "iPhone 8 Plus": "https://www.techradar.com/reviews/iphone-8-plus-review",
    "killed off": "https://www.techradar.com/news/the-iphone-se-and-iphone-6s-are-dead-and-thats-not-good-for-the-iphone-se-2",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review"
  }
}