{
  "source": "https://www.techradar.com/reviews/instant-pot-duo-nova",
  "title": "Instant Pot Duo Nova review",
  "category": "appliances",
  "updated": "2021-12-03T11:50:12Z",
  "author": "helen-mccue",
  "summary": "A simple and affordable Instant Pot available in multiple sizes",
  "verdict": "The Instant Pot Duo Nova is another variation on the classic multi-cooker from this ever-popular brand. This model is one of the more affordable Instant Pots and depending on where you buy it, there are various size options to choose from, making it a versatile choice for lots of different size households. We found it easy to use for slow cooking and pressure cooking as well as sauteing and steaming but you’ll need to experiment with timings to get the perfect dish",
  "pros": [
    "Simple interface",
    "Dishwasher safe lid and pot",
    "Lid automatically seals for pressure cooking"
  ],
  "cons": [
    "Metal exterior and lid can get very hot",
    "Cooking pot doesn’t have handles",
    "Steam rack not ideal for most vegetables"
  ],
  "article": [
    "Ever since the first Instant Pot launched in 2010, this multi-cooker brand has continued to be a firm favorite with a loyal following, and with a varied range of easy-to-use models to choose from it’s easy to see why.",
    "On the face of it, the Instant Pot Duo Nova is very similar to the Instant Pot Duo, with the same selection of one-touch programs, but it benefits from a steam release valve that automatically closes when you close the lid, making it even easier to use and securing it a place on our list of the best Instant Pots.",
    "Additionally, the quick steam release switch is separate from the steam valve, and ensures you can force the pressure to be released in a safer way. There's also a progress bar on the LCD display screen to indicate the cooking status but these are minimal differences and this is reflected in the similar price tags.",
    "The Instant Pot Duo Nova has 15 one touch preset programs covering off the main foods you’re likely to cook in the multi-cooker, as well as various manual settings for the different functions. But it has far fewer preset programs than you’ll see on some other Instant Pots such as the more expensive Instant Pot Duo Evo Plus, which has 48 customizable presets.",
    "The main functions available are pressure cook, steam, slow cook, saute and keep warm and it also doubles as a rice cooker and yogurt maker, ensuring the Instant Pot Duo Nova can replace several other kitchen appliances making it versatile and good value for money. With different sizes available, this is a useful multi-cooker no matter what size your family or household.",
    "We found the Instant Pot Duo Nova very easy to use and we created some delicious meals using the pressure cook and slow cook functions, but for steaming and rice cooking we needed to experiment a bit with times and settings to get the best results.",
    "Although there are cook times and plenty of recipes available online, they don’t always work the same for all the Instant Pot models. They’re a good starting point but you’ll need to be comfortable with a bit of trial and error in the first few weeks of using any Instant Pot.",
    "The Instant Pot Duo Nova will set you back $119.99/ £119.99/ AUS $299 and is available on Amazon in the US and the UK. In Australia, it can be purchased through Corelle Brands.",
    "This is the price for the 8-quart / 7.6-liter version. It's also available in a 6-quart/ 5.7-liter capacity for $89.99 / £99.99 / AU$269, while in the US and Australia you can pick up a 3-quart / 2.8-liter version for $79.99 / AUS189 (around £58)",
    "Depending on which size you buy, the Instant Pot Duo Nova is one of the most affordable Instant Pot available, aside from the Instant Pot Duo, but it still has all the main functions we’ve come to expect from an Instant Pot.",
    "With a familiar design, the Duo Nova is instantly recognizable as an Instant Pot and as we’ve said in previous reviews, multi-cookers are not the most attractive of the kitchen counter appliances. Having said that, the stainless-steel finish gives it a reassuringly robust look.",
    "We reviewed the 8-quart/ 7.6-liter model which measures 14.5 x 13.5 x 14.8 inches/ 36.8 x 34.3 x 37.6cm (h x w x d) and is a similar size to other large capacity multi-cookers we’ve reviewed, but as we've already mentioned it’s also available as a 6-quart/ 5.7-liter option, and in the US and Australia, there’s a smaller 3-quart/ 3-liter version available if you have a small family or you’re short on space.",
    "Multi-cookers do take up a good chunk of counter space but on the flip side, this Instant Pot will replace lots of other appliances and therefore take up much less space than if you had a separate slow cooker, rice cooker, steamer, yogurt maker, and pressure cooker.",
    "It’s pretty simple to figure out the settings and get cooking shortly after removing it from the box and the preset programs are a good starting point for common foods and meals. There’s no recipe book or cooking charts included though, so you’ll have to head to the website or app for these. We found plenty of slow cook and pressure cook recipes but it can be tricky to find exact guidance for more simple tasks like steaming and cooking rice.",
    "When pressure cooking, choose between low and high pressure and for all other programs there are three settings to choose from: less, normal or more - with a table in the instruction manual detailing what each setting is designed to achieve. It’s also simple enough to adjust cook times using the plus and minus buttons on the front so you can customize each setting to suit your requirements.",
    "If you’re a fan of the ‘set it and forget it’ style of cooking, the handy keep warm function means your food won’t go cold if you do actually forget about it. The delay start button allows you to postpone cooking for up to 24 hours, but be sure not to leave anything perishable in the pot if you’re using this function. It comes with a steam rack, but this is only really useful for larger foods, smaller vegetables will fall straight through the rack into the water below which is frustrating.",
    "We used the Instant Pot Duo Nova for several recipes to try out its performance across different functions. First up, slow cooked chili, the sauté function comes in handy here, allowing you to brown your meat and soften onions in the Instant Pot instead of having to use a separate pan or stove top. Despite the pot not having a non-stick coating there was no sticking during the sauté stage. We slow cooked our beef chili for six hours on the ‘more’ setting and the result was a delicious meaty chili with soft beef. The Instant Pot beeps to alert you that cooking has finished and the temperature of the chili at the end of cooking was 176 F/ 80 C. The chili wasn’t thickened to our liking but by switching back to saute it was easy to reduce it to the perfect consistency. During slow cooking the handles and sides all stayed cool, the lid reached 113 F/ 45 C which isn’t too warm to touch.",
    "To cook brown basmati rice, the manual suggests the Multigrain preset, but we had to dig around on the website for some suggested rice to water ratios. In the end, we went with a 1:1 rice to water ratio but after cooking the rice was still a little al dente. The heat up process took 13 minutes and the cooking time was 20 minutes. After cooking we waited a further 10 minutes before using the quick-release pressure. The total time was 43 minutes from start to end which is a bit lengthy but as you’re not required to watch it like you would on the stove, it’s definitely more convenient. During the pressure release, our decibel meter registered 75db, which is equivalent to a toilet flushing, and one of the noisier Instant Pots we’ve tested.",
    "The steam function uses pressure cooking to steam and again, we struggled to find a good recommendation for timings and plumped for four minutes with one cup of water in the bottom of the pot. The steam rack provided isn’t great for this purpose and some of the broccoli pieces fell through the gaps. Preheating took five minutes and after the four minute cook time we used the quick release pressure button so that we could get the broccoli out immediately. Some of the larger florets had a good texture but the smaller ones were overcooked.",
    "For a speedy Thai red curry, the manual pressure cook function was our choice. As with the chili ,we used the saute function to brown chicken legs before adding all the other ingredients and pressure cooking on high for 20 minutes. Add to that the seven-and-a-half-minute heat up time and we were pleased with the fast cooking time which produced perfectly cooked chicken that fell off the bone with a temperature of 198 F/ 92 C. The pressure release was a slightly louder 79dB and while the sides of the pot and all the handles stayed cool, the metal part of the lid reached a high temperature of 187 F/ 86 C.",
    "First reviewed: September 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "7": "Instant Pot Duo Nova price and availability",
    "10": "Design",
    "16": "Performance",
    "20": "Don't buy it if..."
  },
  "links": {
    "Instant Pot Duo": "https://www.techradar.com/reviews/instant-pot-duo-v2-7-in-1-electric-pressure-cooker-review",
    "best Instant Pots": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "Instant Pot Duo Evo Plus": "https://www.techradar.com/reviews/instant-pot-duo-evo-plus-60-review"
  }
}