{
  "source": "https://www.techradar.com/reviews/huawei-band-6",
  "title": "Huawei Band 6 review",
  "category": "wearables",
  "updated": "2021-05-18T10:46:35Z",
  "author": "ammara-rounaq",
  "summary": "A solid budget fitness tracker with a few software issues",
  "verdict": "The Huawei Band 6 is a good option if you’re in the market for an affordable fitness tracker. It’s easy to use, lasts almost ten days on a single charge and packs a bunch of excellent fitness features. Where it falters is smartphone pairing and data syncing, which can be slow and inaccurate. With the superior Huawei Watch Fit available for just a little more cash, it’s not the best value either.",
  "pros": [
    "Comfy and lightweight",
    "Great display",
    "Fitness features"
  ],
  "cons": [
    "Finicky app sync",
    "Limited watch faces",
    "No GPS"
  ],
  "article": [
    "Budget fitness bands are getting more and more popular, and Huawei is ready to take on this fierce market with its latest Band 6. Sporting a tall AMOLED screen, a two-week battery life and a string of useful fitness and health features, Huawei’s Band 6 is primed to be an appealing alternative to Xiaomi’s Mi Band and the AmazFit Bip U Pro.",
    "In many ways, the Band 6 feels like a slightly trimmed-down version of the Huawei Watch Fit without the built-in GPS. It looks like a slimmer Watch Fit that packs in a familiar tall AMOLED display on the front but in a more compact and lightweight form factor. It also has the same 9-10 days of battery life like the Watch Fit, which has been a consistent strong point in Huawei wearables.",
    "The Band 6 runs Lite OS, which has most of the fitness and health tracking suite found on Huawei’s more expensive wearables. It’s also hindered by the same software limitations, such as not being able to share data with third-party apps like Strava, and restricted customization. That being said, Lite OS comes into its own with its simple and easy to use UI.",
    "You can track a wide array of workouts on the Band 6 that are easily accessible from the menu. There’s also plenty of health tracking baked in, including all-day heart rate, stress, and SpO2 monitoring as well as sleep tracking. For analytics you can access basic information on the watch or move to the Huawei Health app to get detailed breakdowns and charts on your performance.",
    "This is where the Band 6 runs into issues. Pairing the Band 6 to a smartphone can be a finicky process. When it does pair, data sync can be slow and we often saw inaccurate data being synced to the app, requiring several sync refreshes. This finicky connection can also sometimes mess up route tracking for outdoor walks or runs since the band relies on your smartphone’s GPS to map your route.",
    "Another minor gripe is the push notifications on the Band 6 that can sometimes be delayed. When they do appear on your notifications panel, the messages are truncated, requiring you to pull out your phone to view the full message.",
    "Considering its price, the Huawei Band 6 is an attractive fitness band that packs in a lot of features. But consumers are spoiled for choice in this price range and given the fact that Huawei already has a great affordable fitness tracker in the Huawei Watch Fit - which costs just AED 100 more - we’re not sure where the Band 6 sits in Huawei’s entry-level fitness tracker line-up, and would recommend going for the Watch Fit over the Band 6.",
    "You can get your hands on the Huawei Band 6 for £59.99 / AU$139 / AED 229 (about $85) from Huawei Experience stores, as well as online and select third-party retailers. It’s available in four colors: Graphite Black and Forest Green, which come with a dark gray watch body; and Amber Sunrise and Sakura Pink, which come with a gold-hued watch body.",
    "For that price, you could also get your hands on the Amazfit Bip U Pro, which comes with a built-in GPS. For a little more, you can get the excellent Huawei Watch Fit, which looks similar to the Band 6 but has superior features and performance.",
    "At first glance, the Huawei Band 6 looks like a skinny Huawei Watch Fit but with a more compact and basic design. The polymer watch body has a metal texture finish around the side and a matte plastic finish at the bottom where it houses its sensors.",
    "The rubber straps are narrow with a soft and smooth texture that feels pleasant against the skin. It doesn’t accumulate dust and is easy to wipe off when your wrists get sweaty. You won’t be able to swap straps with the Band 6, which is understandable at this price point.",
    "The Band 6 is also very light, which makes it super comfy to wear all day, and it doesn’t dig into your skin, which is a plus. It’s also water-resistant up to 50 meters so you’ll be able to take it for a dunk in the pool, and won’t have to take it off during a quick shower.",
    "There’s a tall 1.47-inch AMOLED display on the front that’s vibrant and responsive, though not as sharp and smooth as the display on the Huawei Watch Fit. We loved the tall aspect ratio on the Huawei Watch Fit and it's a smart design choice on the Band 6, as it keeps the band’s form factor compact while still displaying a good amount of information.",
    "The Band 6’s highlight feature is its versatile suite of fitness and health tracking that’s found on almost every Huawei wearable these days. There’s also a three ring activity system similar to Apple’s activity rings that lets you set goals for calories burned, time spent standing, and exercise hours.",
    "From walking, running, cycling and swimming to belly dancing, dart throwing and skating, the Band 6’s 90+ workout modes can track a wide array of activities. All you have to do is swipe through the list of workouts from the band’s menu, tap start and the band gets going. There’s automatic workout detection if you don’t want to go through the menus, which works almost every time.",
    "The band tracks real-time heart rate during workouts that comes in handy to identify if you’re hitting your target heart rate zones. Workout results fare well from an accuracy standpoint but real-time and resting heart rate often showed a few bpm higher when compared to the Garmin Venu and the Apple Watch SE.",
    "When you’re done with a workout, you can view a basic summary on the band itself or use the Huawei Health app to view detailed information and charts. It’s a solid fitness app that displays your data in a visually appealing way. It contains a decent amount of information and helpful tips on how to get your numbers in a healthy range.",
    "The only problem here is the smartphone pairing and app sync process, which can be slow and fiddly. The Band 6 can take a few tries before it pairs with your phone and firmware updates or pending data syncs can take several minutes, which is frustrating. On top of that, we encountered issues every now and then when the app would show incorrect or different data than what we saw on the band. The issue fixes itself after a couple of forced re-sync efforts but given how slow that process can be, it's fairly annoying.",
    "Other notable features include breathing exercises, stress monitoring and all-day SpO2 monitoring that gauges your body’s overall conditioning and can help point to potential problems down the road. There’s also sleep tracking on board that works great, and we especially love how that data is displayed in detail on the companion app.",
    "The Band 6 is not a smartwatch, and is light on that front features-wise. Push notifications from your phone have a limited length, requiring you to pull your phone out. Other than that you can set alarms, view weather conditions and control music playback.",
    "As with most Huawei wearables, battery life is a strong boon on the Band 6. The band’s minimal Lite OS utilizes power efficiently and is able to eke out a week and a half out of its 180mAh battery. That’s a lot more battery stamina than what you’d get from other fitness bands in this price range.",
    "With heavier use involving multiple workouts a day and all-day heart rate and SpO2 monitoring enabled, your mileage might dip. But with light to moderate use you can consistently get around 10 days of battery stamina on a single charge - falling a little short of Huawei’s two-week battery life claims.",
    "The Band 6 uses a proprietary two-pin cradle that attaches magnetically at the back of the Band 6. Charging is a zippy affair taking just under an hour to juice up from zero to full."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Pricing and availability",
    "9": "Design and display",
    "13": "Fitness and health tracking",
    "20": "Battery life",
    "23": "Don’t buy it if…"
  },
  "links": {
    "Budget fitness bands": "https://www.techradar.com/best/best-cheap-fitness-trackers",
    "Xiaomi’s Mi Band": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-6",
    "AmazFit Bip U Pro": "https://www.techradar.com/reviews/amazfit-bip-u-pro",
    "Huawei Watch Fit": "https://www.techradar.com/reviews/huawei-watch-fit",
    "Amazfit Bip U Pro": "https://www.techradar.com/reviews/amazfit-bip-u-pro",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074"
  }
}