{
  "source": "https://www.techradar.com/reviews/tcl-20-pro-5g",
  "title": "TCL 20 Pro 5G review",
  "category": "phones",
  "updated": "2021-06-20T13:08:07Z",
  "author": "tom-bedford",
  "summary": "A premium design, though middling specs",
  "verdict": "The TCL 20 Pro 5G doesn’t have competitive specs, but substitutes that for a great design, and it’s a trade-off that works. While we found its battery life wanting, found its charging speed too slow, and can imagine some people disliking its 60Hz display, in our opinion the good looks of the phone, its display technology and the smart selfie camera more than make up for the shotcomings.",
  "pros": [
    "Captivating design",
    "Good-looking display",
    "Impressive selfie camera"
  ],
  "cons": [
    "Slow charging",
    "Battery life isn’t fantastic",
    "‘Only’ 60Hz display"
  ],
  "article": [
    "TCL isn’t exactly a huge name in smartphones, and you probably know it more for its TVs and soundbars, but in the last few years, it’s made a bigger push into the mobile market. The TCL 20 Pro 5G is the top phone of its family, part of the second generation of devices since TCL started using its own name on its phones.",
    "Launched alongside the TCL 20L and 20L Plus, and just after the 20 SE and 20 5G, this is probably the most premium phone TCL has put out under its own name, though there’s not much competition for that title.",
    "Most worthwhile mid-range phones offer premium specs but with corners cut, usually in the design department; we often see powerful phones with ugly bodies, or great camera phones with cheap-feeling plastic shells.",
    "The TCL 20 Pro 5G, however, does something a bit different; it doesn’t fully stand out in terms of most of its specs, with a processor and camera that are just ‘fine’, but it has a captivating design and some impressive display technology which makes it worth considering.",
    "The back of the phone has a really pretty finish, which looks vibrant when it catches the light. The cameras meanwhile are flush with the back, so the phone feels smooth to hold, a fact helped by the curved-edge display.",
    "There’s also an extra button on the phone - don’t worry, it’s not one of those annoying Google Assistant keys, but a button you can map to whatever function you want. We ended up finding it very useful, for example for turning on the flashlight at a moment’s notice.",
    "Thanks to some of TCL’s television smarts, content viewed on the phone’s display is automatically upscaled to improve contrast and brightness, which makes this a step above some other phones at its price point for watching movies or TV.",
    "Our final point on ‘looking good’ is that you look great - well, you do when you’re taking a picture with the phone’s selfie camera, at least. While we weren’t exactly captivated by the handset’s main snappers, the front-facing one was a surprising highlight.",
    "The TCL 20 Pro 5G’s main failings are mostly in things it misses. The phone doesn’t have fast charging, so you’ll be waiting ages to power it up. The display is also only 60Hz, despite the proliferation of 120Hz phones, which might put prospective customers off.",
    "Oh, and we were a little disappointed by the phone’s battery life - while it’s not ‘bad’ by any means, it’s definitely not great either, and the TCL 20 Pro 5G didn’t always last the whole day under heavy use.",
    "So this is a good phone, but perhaps one that falls short of ‘great’ if you’re looking for a top all-rounder. If all you want is a great-looking phone with a lovely display, especially one at a mid-range price point, this is certainly worth considering. If there’s any particular feature you care a lot about though, like the processing power or cameras, you might find the phone is only okay in that department, so another phone might be better suited.",
    "The TCL 20 Pro 5G is definitely coming to the UK and US; we don’t know about Australian availability just yet, though some TCL 10 phones were launched there, so it’s possible.",
    "In the UK, the phone costs £499, which is a mid-range price. That converts to about $690 / AU$900, though exact prices in those regions will probably differ at least slightly from that.",
    "At this price, we’d compare the TCL 20 Pro 5G to the Motorola Edge, costing £549 / $699 (about AU$1,015), a phone which has a lot in common with the TCL phone, including a 6.7-inch curved display and a focus on design.",
    "The TCL 20 Pro 5G has a fairly big body, so some might struggle to reach the side buttons, but we didn’t have that trouble. The edges of the display are curved, though, making the phone pretty comfortable to hold.",
    "There’s a USB-C port and 3.5mm headphone jack on the phone, as well as a power button and volume rocker on the right edge, and a custom button on the left. You can choose what this button does when it’s pressed, double-tapped or held, and we found it really useful to map common functions to it.",
    "The back of the phone looks pretty great, with its turquoise glass shell sparkling in the light. There’s also a gray version of the phone but we can’t attest to how that looks; photos don’t really pick it up, so it’s really something you need to see to understand.",
    "Unlike many smartphones with camera bumps, the lenses on the TCL 20 Pro 5G are flush with the back of the phone, which is partly why the phone feels smooth to hold. It weighs 190g, and is 9mm thick, so has a fairly average build size, but the lack of a camera bump makes the handset feel more slender.",
    "What’s the IP rating of the TCL 20 Pro 5G? It doesn’t seem to have one, so probably don’t take it for a swim.",
    "The TCL 20 Pro 5G has a 6.7-inch AMOLED screen, broken up by a cut-out for the front-facing camera in the top-center. The edges of the display are curved, as we’ve said, which is a pretty premium feature for a phone of this price, though one not everyone likes.",
    "The resolution is FHD+, but the refresh rate is only 60Hz, which might disappoint some people as even budget phones in 2021 can get 120Hz. Some people don’t care about screen refresh rate though, which is likely something TCL is banking on.",
    "We found the screen to be quite good-looking, as AMOLED tech lends itself to bold colors and top contrast, but the icing on the cake is TCL’s NXTVISION technology borrowed from its TVs. This digitally upscales content, making games and videos look HDR, and tweaking images viewed, to make them better-looking.",
    "There’s an in-screen fingerprint scanner which isn’t guaranteed at this price point, and we found it was generally pretty snappy to use.",
    "While you might not notice the change if you pick up the TCL phone, when comparing titles side-by-side with another handset you can see the improvements.",
    "The TCL 20 Pro 5G has four rear cameras; this isn’t the phone’s strongest department, but they’re totally fit for purpose.",
    "There’s a 48MP f/1.7 main, 16MP f/2.4 ultra-wide, 5MP f/2.2 macro and 2MP f/2.4 depth-sensing camera. On the front, we’ve got a 32MP f/2.45 snapper.",
    "We’ll start with the selfie camera, because that was our favorite of the snappers - we were pleased with the results of these photos as they had good dynamic range and a fair amount of detail - Portrait snaps handled the artificial Bokeh blur well too, though sometimes the subject looked a little over-sharp.",
    "Snaps from the main camera missed this color diversity and lacked contrast, which may be why we weren’t as enthusiastic about the results, though the pictures weren’t terrible. We tested the camera a lot in a woodland area, and found the pictures didn’t capture the varying hues of different types of wood or foliage too well.",
    "Pictures taken on the ultra-wide camera looked very dark, which isn’t as much of a problem in well-lit environments as it is for lesser-lit places - we took a few wide shots that looked a little too dim for our liking. Some outdoor ones were fine though.",
    "The macro camera was fit for purpose, though again it needs good lighting conditions to work perfectly. 5MP is higher-res than lots of other macro cameras on phones at this price point, so if you like your close-up shots this could be a decent choice, but the phone lacks the top lenses of the best macro-photography handsets like the Xiaomi Redmi Note 10 Pro.",
    "Videography works up to 4K on both the front and back camera - few selfie-snappers get this high-res video recording, so if you like sharp footage of yourself, that’s something worth considering. We found the phone handled video recording well, not getting too warm even after a few minutes of 4K recording.",
    "There are a few extra photography and videography modes on the TCL 20 Pro 5G, though most of them are ones you’ll get on most smartphones: portrait, panorama, light painting, night mode, pro mode and more. Most of these work just as well as on other handsets, but we’ve got to highlight light painting, which felt a little simpler, and therefore easier-to-use, than on some other phones.",
    "Keeping the TCL 20 Pro 5G ticking is the mid-range Snapdragon 750G chipset from Qualcomm, which we also found in the Samsung Galaxy A52 5G. It’s one of the better mid-tier processors we’ve tested, as benchmark tests show.",
    "We use the Geekbench 5 test, and the phone returned a multi-core score of 1911 - that puts it as beating the OnePlus Nord (1877) and Motorola One 5G (1822) but not the Motorola One 5G Ace (1999). Those are all powerful as non-premium phones go, so beating most of them here is a testament to the TCL 20 Pro 5G’s power.",
    "We took the phone for a spin in a few games, and found it snappy most of the time, with little lag and few stutters, and it generally ran the top graphics too. The one exception was Call of Duty: Mobile, which suffered from the occasional freeze for some reason.",
    "That chipset is paired with 6GB of RAM and 256GB of storage - that’s a lot of space for a phone at this price point, as not all devices go that high. There’s no expandable storage though.",
    "A feature of the phone that TCL is keeping very quiet on, is the fact that it’s 5G-compatible - you totally wouldn’t guess from the name. So this phone will let you access the next-gen form of connectivity, and there are two SIM slots in the phone too, for an improved range of coverage.",
    "The TCL 20 Pro 5G runs Android 11, with TCL’s user interface (UI) laid over the top. We want to like this UI, as it makes menu icons look big and colorful, but it also brings loads of extra apps which clutter up your home screen.",
    "Boot up the phone and you’ve got icons for Booking.com, an app that’s solely used for assigning the functions of the side key (that’s what the Settings menu is for, TCL), an option for Game Box (the game optimization mode which automatically launches when you boot up a game), and more. It’s a little intimidating to see the home menu look so cluttered as soon as you turn on the phone, especially as lots of the ‘apps’ are just shortcuts to the settings menu.",
    "Other than that, TCL UI is fine - we like how the app drawer automatically categorizes your apps, so you can easily scroll down to ‘Media’ or ‘Google’ if you want.",
    "Thanks to the processor and RAM, scrolling through the menus and opening apps is super snappy - it’s easy to forget this isn’t a high-end phone when you’re just doing everyday activities.",
    "With a 4,500mAh battery, you’d expect the TCL 20 Pro 5G battery life to be fairly impressive - that’s a decent size for a power pack. However our experiences don’t reflect that.",
    "The phone’s battery life was fine for light to medium use - so if our activity through the day was scrolling through social media, listening to music here and there, and maybe taking one or two pictures, it’d last the day. But heavier use, like frequent gaming or taking lots of photos or videos, ensured we’d need to power up the phone to get through the whole day.",
    "Even with medium use, we’d often find ourselves plugging the phone in through the day, simply out of fear of it running out. This could be assuaged, however, with the battery saver mode, which is perhaps one of the most impressive we’ve seen in a phone - it dramatically reduced the rate of battery drain.",
    "If battery life isn’t great, it’s the charging speed that’s actively bad, as the phone powers up at 18W. Given that even cheap phones can reach up to 65W, and mid-range and premium phones sometimes go even higher, 18W is embarrassing - it takes about two hours to power the phone to full with it.",
    "There is a charging feature you may not expect though - the TCL 20 Pro 5G has wireless powering, at 15W. While that’s even slower than 18W, cord-free powering tends to be glacial compared to wired, so the speed is easy to forgive - and the presence of this premium feature on a mid-range phone is slightly surprising."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "TCL 20 Pro 5G price and availability",
    "14": "Design",
    "19": "Display",
    "24": "Cameras",
    "32": "Performance and specs",
    "37": "Software",
    "41": "Battery life",
    "46": "Don't buy it if..."
  },
  "links": {
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Samsung Galaxy A52 5G": "https://www.techradar.com/reviews/samsung-galaxy-a52-5g-review",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Motorola One 5G": "https://www.techradar.com/reviews/moto-g-5g-plus-review",
    "Motorola One 5G Ace": "https://www.techradar.com/reviews/motorola-one-5g-ace-review",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}