{
  "source": "https://www.techradar.com/reviews/canva-website-builder",
  "title": "Canva Website Builder review",
  "category": "computing",
  "updated": "2021-04-26T13:30:23Z",
  "author": "steve-paris",
  "summary": "A somewhat different approach to website creation",
  "verdict": "Canva offers an unusual website creation tool which has its advantages, but is also lacking in a lot of areas.",
  "pros": [
    "Good range of image editing tools",
    "Nice flexible customisation",
    "Free plan, and free trial"
  ],
  "cons": [
    "Not a responsive design",
    "No blogging or ecommerce facility",
    "Hard to know which templates and media are actually free"
  ],
  "article": [
    "We’ve explored Canva Video, Canva's video editing feature a while back, an interesting and unusual way to create and share videos online, but would you believe that this highly versatile company also offers a website builder service? Well, they do, and we’ll be exploring it in detail here.",
    "In order to use Canva, you must create an account, but all they need from you is your name and an email address to set one up. Once logged in, go to the website creation section of Canva’s website and you’ll be presented with 162 templates, which you can narrow down not by category, but by their principal colour. It’s a little unusual, but it appears to be your only option, aside from scrolling through them all. You also have the choice of starting with a blank website, should you prefer.",
    "As you click on various templates, you’ll notice that some state that they are “Free to edit and download” while others are “Included in Canva Pro”. Sadly, there’s no way to find out which are which aside from clicking on them. Don’t worry too much though: if you’re testing the service out, you can still select and experiment with a ‘Canva Pro’ template - you’ll just have to pay for it prior to publishing it.",
    "Once you’ve chosen the one you like, you’ll enter the editing process proper.",
    "The interface is broken down into sections. The main one shows the currently selected page. You have thumbnails at the bottom, representing all your site’s pages, to the right are available pages for the selected template, and on the far left is a sidebar, giving you access to all the tools you need to customise your website.",
    "You’ll notice that just because you chose a particular template, you’re actually not restricted to it: you’re able to choose another template and add one or more of its pages to your project, allowing you to design something truly unique.",
    "All placeholder text and images can be altered or replaced. Click on a text box and relevant editing tools appear at the top, allowing you to change the font, size, colour, alignment, etc. You can apply different styles, or even place your text on a curve. There are also animation options to make your selection appear on the screen in a particular way (the premium effects have a small crown logo on their thumbnail).",
    "When it comes to images, you have a host of tools to alter, modify and otherwise improve them, straight from within the application. These range from basic image adjustment tools such as brightness, contrast, saturation, etc, to 20 filters whose intensities can be altered, to a long list of effects.",
    "Every item (aside from background images) can be repositioned wherever you need them to be with an easy drag and drop.",
    "This is where you get to add more items to your pages. The Uploads stores all the personal media you’ve uploaded, be it photos, video or audio. Photos grants you access to thousands of stock images (not all of them are free though: some come with a fee attached to them - more on this later).",
    "The rest of the sidebar is pretty self explanatory. There’s a category to add Elements like lines, shapes, animated stickers, and the like, Text lets you add additional text boxes to your pages, or specially designed text effects to add a little extra pizzazz, Audio is where you get background mood music, Videos is a selection of stock clips, and Background are stylistic images. There’s also an app section where you can embed Google Maps, Instagram, and many more.",
    "There’s a nice feature which allows you to share your creation with others, allowing them to edit and otherwise collaborate with you on your work.",
    "When it comes time to publish your design, Canva offers an interesting list of choices, including turning all your pages into a single scrolling page, or adding a navigation bar for visitors to click through each of them, for instance. There are four choices open to you which you can preview one after the other if you like, to help you select the one that works best for you.",
    "You’ll notice that contrary to most website builders available nowadays, Canva’s offering aren’t responsive, meaning the design doesn’t alter depending on the screen your site is viewed on (be it from a desktop, tablet or phone), which makes the service feel somewhat behind the times.",
    "This section is also where you’ll find how much you’ll have to pay before you can publish your creation, depending on how many premium stock images, videos, or templates you’ve used. This is the case if you’re working with the free plan.",
    "Should you elect to go with Pro for $12.99 (£11.99) per month, or $119.99 (£99.99) per year, all the premium templates, and stock media are available at no extra charge. You’re also given 100GB of online storage (quite a jump from the 5GB for the free plan) to store your own media.",
    "The Enterprise plan is aimed at the professional company and is made to accommodate a team of designers. As such, that plan will cost $30 (£24) per month per person, and includes the ability to add your own logos, colours and fonts to your design palette, a workflow so designs can be approved prior to publishing, for instance, and you even get unlimited online storage.",
    "Of note, both paid plans can be tried free for 30 days, and classrooms and non-profits can use Canva for free.",
    "Canva has some interesting features. We liked the ability to collaborate with others for instance, as well as some of the text options, and all the image editing tools on offer. The fact the service is free to education establishments and charities is very generous, and you can design good looking pages with it. But there’s no blogging tool nor ecommerce facilities - the service isn’t designed that way, and the fact the end result isn’t responsive is disappointing."
  ],
  "headers": {
    "1": "Getting started",
    "4": "Template editing",
    "9": "The sidebar",
    "11": "Sharing and publishing",
    "18": "Final verdict"
  },
  "links": {
    "Canva Video": "https://www.techradar.com/reviews/canva-video",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "website creation section": "https://canva.7eqqol.net/c/221109/619765/10068?subId1=trd-us-1662238035525610000&sharedId=trd-us&u=https%3A%2F%2Fwww.canva.com%2Fwebsites%2Ftemplates%2F",
    "free plan": "https://canva.7eqqol.net/c/221109/619765/10068?subId1=trd-us-1071909884871196400&sharedId=trd-us&u=https%3A%2F%2Fwww.canva.com%2Fpricing%2F",
    "Pro": "https://canva.7eqqol.net/c/221109/619765/10068?subId1=trd-us-1429347710779430700&sharedId=trd-us&u=https%3A%2F%2Fwww.canva.com%2Fpricing%2F",
    "Enterprise plan": "https://canva.7eqqol.net/c/221109/619765/10068?subId1=trd-us-1250667411558783700&sharedId=trd-us&u=https%3A%2F%2Fwww.canva.com%2Fpricing%2F"
  }
}