{
  "source": "https://www.techradar.com/reviews/logitech-mx-master-3-mouse",
  "title": "Logitech MX Master 3 mouse review",
  "category": "computing",
  "updated": "2021-06-23T20:35:21Z",
  "author": "michelle-rae-uy",
  "summary": "Still the ultimate mouse for productivity and creativity",
  "verdict": "The Logitech MX Master 3 is still the top mouse for productivity and creative tasks. In fact, it does it better – inheriting its predecessor’s best qualities like app-specific customizations and multi-device connectivity while also being smaller, sleeker, lighter, and somehow more streamlined.",
  "pros": [
    "App-specific customizations",
    "Supported app library is extensive",
    "Multi-device connectivity",
    "Excellent tracking on most surfaces",
    "Long battery life",
    "Excellent steel wheels"
  ],
  "cons": [
    "May be pricey for some",
    "Right-handed users only",
    "Rubber palm and side grips are an acquired taste"
  ],
  "article": [
    "Logitech has done it again with the Logitech MX Master 3. Those familiar with this line know that it makes all the other non-gaming mice look like they’re just doing the bare minimum, and we’re glad to see its latest installment continue that tradition.",
    "This time around, however, necessary tweaks have been made. The Logitech MX Master 3 is sleeker, smaller and lighter – with an even better scroll wheel and improved connectivity. It makes its predecessor, the Logitech MX Master 2s – a mouse that’s already impressive in its own right – seem like a clumsy, hulking ogre.",
    "Essentially, Logitech took everything that’s amazing about the Master 2s and stuffed them in a better package while making improvements along the way. That makes the Logitech MX Master 3 an even better mouse than its predecessor. Considering that the Master 2s received our much-desired 5-star rating, that’s saying a lot.",
    "Those unwilling to spend more than 50 bucks or quid on a great mouse may want to seek alternatives. The MX Master line remains at its $99/£99 price point – unless you’re in Australia, in which case the Logitech MX Master 3 comes at AU$20 more than the Master 2 at AU$169.",
    "If you’re torn about the price, we get it. There’s a lot of capable mice out there for much less. In fact, many of the best mice are half the price of the Master 3 – but none of them can really match its feature set, which makes it worth the price tag.",
    "Those are the only noteworthy aspects of the Logitech MX Master 3. The ergonomic design is also worthy of its time in the spotlight, with a nice bump at the palm rest for added support and all its buttons – all eight of them – within effortless reach of your fingers. The bump here isn’t as pronounced as that on the Master 2s, sadly, and that’s perhaps the result of Logitech attempting to make it sleeker. However, it still offers enough support to avoid fatigue, especially to palm grippers.",
    "The rubberised finish of the palm and side grips are even more noticeable on this mouse for better gripping, though those who aren’t used to that might find it a bit odd to the touch in the beginning. What is nice to the touch here are the improved middle and side scroll wheels. Logitech has given them a refresh with a notched machined steel build that offers a much quieter, more premium-feeling tactile feedback. These wheels are so great, in fact, that they actually make those of the Master 2s feel cheap and inelegant.",
    "Another design improvement is the placement of the side buttons. Where the Master 2s had them behind the side scroll wheel, with one button on top of the other, the Master 3 has them under the scroll wheel set side-by-side. This configuration makes them much more accessible and less confusing to use.",
    "Again, the Master 3 is slightly smaller, sleeker, and more lightweight than its predecessor. At 4.92 x 3.32 x 2.01 inches and 4.97 ounces, the difference might not seem big on paper. However, it is noticeable during use. We’ve become used to the Master 2s, as we’ve been using that as our main mouse for work for a few years now. However, we’d happily trade that in for this new model, as it’s much easier on the wrist and hand.",
    "A couple of nice little extras are its charging port and cable. While the Master 2s comes with the pesky micro-USB port and cable, this model has upgraded to USB-C, which means a faster charging time. It also means you have one less cable to deal with if you already have USB-C cables on hand for your other peripherals.",
    "Both battery life and DPI on the Logitech MX Master 3 remain the same at up to 70 days and 4000 DPI respectively, but those are more than enough for mouse users and definitely better than what most non-gaming mice offer. It uses the same Darkfield high precision technology in its sensor, giving it the same high performance as the Master 2s, and has inherited the Smartshift technology, which lets it automatically shift between free spin mode and click-to-click mode by detecting the current application or window you have open.",
    "However, there are two things the MX Master 3 does better than its predecessor – scrolling and connectivity. According to Logitech, the new middle scroll wheel is 87% more precise and is capable of scrolling up to 1,000 lines in a second. It has proven to be a fraction of a second faster during our tests. With the respective scrolling speed of both mice set to the maximum and the Smooth Scrolling setting enabled (done on the Logi Options app), it’s about 20% faster on average when on freespin.",
    "In terms of connectivity, it’s a much more seamless experience. We’ve had problems with the MX Master 2s when assigning one of two Bluetooth connections to a new device if it’s been previously connected to a different device. Basically, we’ve had to either sever that connection or reset the mouse. Perhaps thanks to a firmware update, that issue has eventually resolved itself. But, the thing to note here is that this hasn’t been an issue with the MX Master 3 out of the box.",
    "Meanwhile, the third connectivity option by way of an advanced 2.4 GHz USB dongle remains impeccable and long-ranged.",
    "Finally, its button assignments and customizations are worth mentioning. They’re a boon to most folks who use most of their work tackling computer tasks, whether that means doing a lot of research, typing and having several browser tabs open at the same time or editing a stack of high-resolution images or videos.",
    "The Logi Options app will let you assign actions to all the buttons except the left and right ones, and makes those re-assignments app-specific. In Photoshop, for example, you can set the side buttons to toggle brush opacity or brush hardness while setting the side scroll wheel to zoom and the gesture button to save. This helps save you time and makes your photo editing workflow a lot more seamless, as well as reduces the strain on your wrist and shoulders as you’re moving them less.",
    "What’s more, the list of apps supported is extensive, which means that it’s not just creative pros who can take advantage – though sadly, Lightroom is missing. With such apps as Microsoft Office, Excel, Google Chrome, Microsoft Outlook, and even Zoom and Microsoft Teams supported, even office cogs and students will get a lot of use out of this mouse."
  ],
  "headers": {
    "17": "Don’t buy it if…"
  },
  "links": {
    "Logitech MX Master 2s": "https://www.techradar.com/reviews/logitech-mx-master-2s",
    "best mice": "https://www.techradar.com/news/computing-components/peripherals/what-mouse-10-best-mice-compared-1027809"
  }
}