{
  "source": "https://www.techradar.com/reviews/descript",
  "title": "Descript audio and podcast platform review",
  "category": "computing",
  "updated": "2021-10-07T09:44:29Z",
  "author": "abigail-opiah",
  "summary": "For the ultimate Podcast audio editing experience",
  "verdict": "A well thought out, affordable tool that houses all aspects of podcast making in one software. It is great for recording, editing and creating audiograms for English-speaking podcasts and has a fairly good transcription offering that significantly cuts down the workload of traditional manual speech-to-text methods.",
  "pros": [
    "Affordable",
    "Free version available",
    "Easy to use",
    "Lots of tutorial videos",
    "Remote recording option"
  ],
  "cons": [
    "Overdub only available to Pro users",
    "Only available in English",
    "Transcription not 100% accurate"
  ],
  "article": [
    "Descript is a collaborative audio and video editor that includes features such as transcription, screen recording, publishing, full multitrack editing, and even offers some AI tools.",
    "A podcaster’s holy grail, the editing tool allows its users to not only record, edit and mix but also transcribe audio. Descript offers both an online web-based solution and a desktop application and additional benefits include remote recording and filler ward removal, plus overdub for the editing feature.",
    "The screen recording feature instantly transcribes audio, with Descript offering a web link that grants collaborators access to comment and edit when it comes to group work.",
    "The overdub feature allows users to create a text to speech model of their voice, which can be published as audiograms for a range of purposes, including marketing on social media.",
    "Descript offers a free plan for screen recording, but with a limited editing offering and transcription is limited to a single usage.",
    "The company’s Creator plan, at $12 a month, unlocks unlimited projects, screen recording, ten hours of transcription every month as well as watermark-free video export.",
    "For those likely to require more than a basic editor tool, Descipt's Pro plan comes in at $24 a month, offering everything the Creator plan provides but extends the transcription limit to 30 hours a month. This plan also unlocks the overdub feature.",
    "There is one more plan, called Enterprise, that offers everything the other plans have, with the addition of onboarding and training, invoicing, Single Sign On (SSO) and a security review feature.",
    "Descript also offers reduced rates for Enterprise customers, students, educators, and non-profit organizations.",
    "One feature that sets Descript apart from many other podcast apps is its interactive tutorial project that includes a series of quick lessons to help users get the most out of the collaborative editor. This includes tutorials on editing audio and video, screen recordings, or transcribing meeting notes.",
    "To get started on Descript, the platform requires users to download the software and create an account. The signup process is followed by a short survey designed to gauge how the platform will be used.",
    "With regards to the screen recording tool, Ctrl + Shift + 2 allows users to start and stop recording. Not only does it capture video from the desktop, but off webcams too.",
    "The screen recorder appears as a separate window from the main Descript editing app.",
    "With the editing tool, the user can remove unwanted sounds - such as “ums” and “ahs” - from screen recordings with a single click. In regards to errors in the transcription produced by Descript, once the desired audio has been imported, there is a glossary that frequently used words can be added to so that the software recognizes it in the future.",
    "However, this is not as useful for audio files that have already been transcribed before putting certain words or names in the glossary; the user will still have to manually change each mistake.",
    "With that being said, this tool does cut down the time it would usually take to manually transcribe audio by a significant amount - and even more so once the use becomes accustomed to all the keyboard shortcuts.",
    "In terms of measuring the transcription accuracy, with Descript’s use of Google Cloud’s Speech-to-Text technology, we would compare it to that of Amazon Polly or Balabolka’s free software.",
    "Once you create a new project, Descript’s video/audio drag and drop feature is not your only option. There is also the option of recording audio on Descript, which the software can simultaneously transcribe. It will give you the option to add inline notes, comments and speaker labels when a new voice is introduced in the recording.",
    "Descript recently launhed overdub 3.0 voice cloning tech that delivers quality voice overs for quick corrections to podcasts and screen recordings, simply by typing in the correction. This fundamentally changes how people record their content.",
    "It's new studio sound feature eliminates the need to have an actual studio to record pro-sounding audio for your podcast (even with just a laptop mic), thanks to its one-click noise removal and audio enhancement features.",
    "For auto-leveling, loudness normalization, room tone, ducking, and a full suite of creative and quality effects like compression, EQ, Reverb, and more, Descript also launched its full effects suite for audio pros.",
    "There has also been a few improvements to Descript's script-based editing feature, which includes new inspector, script track duration, minimap, resize word gap, and timeline improvements.",
    "Descript also tweaked its media collaboration and sharing offering that now offers screen recorder with transcripts, faster exports, instant editing, and customization of the thumbnails on videos shared. It also allows you to publish video page analytics with view counts.",
    "Descript boasts that it offers an entirely new way of working with audio, unlike similar platforms such as Audacity, GarageBand or Adobe Audition. By our own admission, we would have to agree.",
    "Among those listed above, Descipt presents a near enough full package, across all plans. Even the Descript free plan lets you build and edit the basics, which for some - is more than enough.",
    "Only those on a Descript Pro plan or Enterprise account will have access to Overdub custom voices. This is because uploading existing recordings to train your Overdub Voice requires manual voice identity verification.",
    "For voice identity verification purposes, Pro users are required to read Descript’s training script to ensure that the voice being created belongs to the user.",
    "Overdubbing involves listening to a pre-recorded passage and recording new audio over the top, making mixing tracking much smoother. In some ways, it resembles multi-tracking features found in audio editing tools such as Adobe Audition.",
    "In order for Descript Pro users to qualify for Overdub training, they must record a consent statement, and an overdub main training script (for 10 minutes at least). This is in order to pass the voice verification process, so no sharing your Pro or Enterprise account with friends and family - it simply will not work.",
    "Descript works well, it is easy to use and the user interface is neat, well put-together and clear to understand.",
    "With regards to the protection of data, the company claims to store users’ information on its servers to allow offerings such as live collaboration and full history of projects. Descript promises that your personal data is not used for marketing purposes.",
    "What would elevate this tool would be availability in multiple languages, not just in English.",
    "The transcription element, like other transcription software, would also benefit from the ability to automatically remove errors from already transcribed text once the corrected word is added to the glossary provided.",
    "English-speaking podcasters, print journalists and students - this could be the tool for you!"
  ],
  "headers": {
    "4": "Pricing",
    "9": "Screen recording features",
    "13": "Edit and transcribe",
    "18": "New features",
    "23": "Competitors",
    "25": "Overdub",
    "29": "Final verdict"
  },
  "links": {
    "Descript": "https://www.descript.com/",
    "transcription": "https://www.techradar.com/news/best-speech-to-text-app",
    "text to speech": "https://www.techradar.com/best/best-text-to-speech-software",
    "marketing on social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "webcams": "https://www.techradar.com/best/best-business-webcams",
    "Audacity": "https://www.techradar.com/reviews/audacity",
    "GarageBand": "https://www.techradar.com/reviews/pc-mac/software/audio-software/virtual-instruments-software/garageband-for-ipad-1-0-944486/review"
  }
}