{
  "source": "https://www.techradar.com/reviews/eizo-flexscan-ev3895",
  "title": "Eizo FlexScan EV3895 review",
  "category": "computing",
  "updated": "2021-11-11T14:49:24Z",
  "author": "jeremy-laird",
  "summary": "Epic but pricey productivity in a 38-inch package",
  "verdict": "Eizo’s new 38-inch ultrawide monitor combines and big, beautiful 38-inch IPS panel with outstanding connectivity, but lacks both HDR and a high-DPI experience",
  "pros": [
    "Both USB-C and KVM functionality",
    "Really build and engineering",
    "Great for multi-tasking"
  ],
  "cons": [
    "No HDR support",
    "Relatively low pixel density",
    "Pretty expensive"
  ],
  "article": [
    "The new Eizo FlexScan EV3895 isn’t the first 38-inch nearly-4K ultrawide monitor on the market. Not even nearly. But it is unusual in being aimed fairly squarely at the professional productivity market if not actually at content creation pros.",
    "Arguably, there are good reasons why we haven’t seen a 38-inch, 21:9 curved panel in this part of the market. The panel curvature isn’t necessarily a clear benefit when it comes to productivity as opposed to, say, gaming immersion. Likewise, the 3,840 by 1,600 native resolution is a bit twixt and between, falling short of full 4K and so limiting native workflows to 1080p, or at a pinch 1440p.",
    "The large panel size of 38 inches also translates into relatively low pixel density, which isn’t optimal for font rendering, general image sharpness and detail or productivity in terms of desktop real estate. A ‘conventional’ 16:9-aspect 32-inch or 27-inch 4K monitor offers more pixels, better pixel density and the potential for more desktop space depending on your scaling preferences. It’s also worth noting that the Eizo FlexScan EV3895 is a pure SDR rather than HDR panel.",
    "Of course, bona fide HDR content creation panels are very specialized and hugely expensive devices, so the lack of even entry-level HDR support probably won’t be a deal breaker for more generalized productivity. Moreover, Eizo has carved out quite a niche in the pro display market, so if the inherent limitations of the panel format aren’t an issue - indeed if what you actually want is a display of this size and shape but with proper color fidelity - the Eizo EV3895 makes for a compelling proposition on paper. That’s especially true when you factor in a broader feature set that includes USB-C connectivity with both power delivery and networking support, plus KVM switch functionality.",
    "Priced at around $1,899 in the US and £1,554 in the UK, the Eizo FlexScan EV3895 is pretty toppy for a 38-inch 3,840 by 1,600 pixel display. In fact, it’s the most expensive we’ve seen. That could be problematic given it lacks HDR support. However, the EV3895 counters with a feature set that really delivers in productivity terms, including USB-C with power delivery and LAN passthrough, plus KVM switch support. It’s not the cheapest option out there. But if you want the EV3895’s specific capabilities, it might still make for decent value.",
    "The Eizo FlexScan EV3895 conforms to Ezio’s signature design and engineering ethos. In other words, it’s sober suited and light on visual thrills and frills but heavy on quality and practicality.",
    "The fully adjustable stand feels robust and nicely engineered and the chassis is a typically high quality item. The height adjustment is a particular highlight, delivering a range of 20cm via a clever and smoothly operating mechanism.",
    "At the heart of the Eizo FlexScan EV3895 is a 38-inch IPS panel with 3,840 by 1,600 pixels, translating into a pixel density of 111DPI. For the record the curvature of the panel is a gentle 2300R.",
    "Eizo rates the EV3895 at 1,000:1 for static contrast, 300 nits maximum panel brightness (there’s no HDR support) and 5ms response times. The panel is native 8-bit color with 14-bit LUT and what Eizo characterizes as maximum color space coverage of sRGB. DCI-P3 coverage is pegged at a claimed 94 percent coverage.",
    "Panel aside, the EV3895 offers excellent connectivity. The USB-C port combines DisplayPort Alt mode for full 60Hz refresh at native resolution with 85W of charging power and pass-through to both the integrated gigabit LAN port and three USB-A ports.",
    "An integrated KVM switch allows you to connect to two further PCs and share a single keyboard and mouse. Further connectivity comprises a pair of HDMI 2.0 ports, plus a DisplayPort 1.4 socket. All told, it’s a very comprehensive package from a productivity perspective.",
    "Given the modest 300 nit panel brightness rating, the Eizo FlexScan EV3895 is punchier and more vibrant than you might expect. While it’s a resolutely SDR rather than HDR monitor, colors have plenty of pop and the IPS panel’s inherent contrast is decent, albeit not as good as the best VA monitors in that regard.",
    "Overall, it looks similar to other monitors based on what is almost certainly a 38-inch curved panel from LG. On the upside, that means it looks natural and accurate. The downside involves the modest pixel pitch. 3,840 by 1,600 pixels is pretty generous from a pure desktop real-estate perspective.",
    "And the 111DPI pixel density means that running at 100 percent scaling should be comfortable for most people. But a high-DPI experience this clearly is not. If you want really crisp fonts, for instance, this is not the monitor for you. Likewise, even still images are clearly not as sharp and detailed as you’d experience on, say, a 27-inch or 32-inch 4K display.",
    "Of course, the wide aspect makes the Eizo FlexScan EV3895 great for viewing multiple documents or apps in parallel. Combine that with the KVM switch and you have real multi-taking power.",
    "As for color accuracy, it’s worth noting that this is not one of Eizo’s higher-end ColorEdge models aimed at serious content creation pros. The 94 percent coverage of the DCI-P3 color space, for instance, isn’t hugely impressive. Likewise, the EV3895’s OSD menu offers relatively limited color and calibration options compared to those full ‘pro’ ColorEdge models.",
    "While gaming isn’t high on the list of this monitor’s priorities, Eizo has included a pixel overdrive in the OSD menu for improving speed and response, though the subjective difference that makes to panel performance is, at best, slight. Still, this is a reasonably rapid monitor that will deliver a pretty lovely gaming experience if set that task. It is, after all, a 38-inch near-4K IPS monitor.",
    "As a productivity package, the Eizo FlexScan EV3895 is mostly convincing. While the panel aspect and resolution is more familiar in a gaming a home computing context, there’s certainly plenty of screen real estate on offer for running multiple apps or documents in parallel.",
    "The KVM switch likewise means this monitor makes for something of a multi-tasking masterclass. The full USB-C functionality with power delivery and LAN passthrough only adds to the Eizo FlexScan EV3895’s productivity proposition. It’s also a very nicely built and engineered screen.",
    "If that’s the case in favor of the EV3895, the argument against largely comes down to cost, especially if you don’t need the KVM functionality. There are numerous monitors based on the same or similar LG IPS 38-inch panel that will match or even exceed the EV3895 image specifications, including adding basic HDR support into the mix, for less money, such as the LG UltraWide 38WN95C and 38WK95C. Several similar SDR panels like the Viewsonic VP3881 and HP Z38c undercut the EV3895 by some margin.",
    "Indeed, the Dell UltraSharp U4021QW offers even more screen and more pixels for about the same money. Of course, none offer quite the same honed, high-quality productivity package. But in pure value terms, and in traditional Eizo fashion, FlexScan EV3895 is a little pricey."
  ],
  "headers": {
    "4": "Price and availability",
    "5": "Design and features",
    "11": "Performance",
    "17": "Verdict"
  },
  "links": {
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "documents": "https://www.techradar.com/best/best-document-management-software"
  }
}