{
  "source": "https://www.techradar.com/reviews/ulefone-armor-11t-5g-rugged-flir-smartphone",
  "title": "Ulefone Armor 11T 5G rugged FLIR smartphone review",
  "category": "phones",
  "updated": "2021-06-29T19:13:35Z",
  "author": "desire-athow",
  "summary": "The first 5G smartphone with a thermal imaging camera",
  "verdict": "A worthy successor to the Armor 10 and Armor 9, the Armor 11 follows in the paths of its predecessors and delivers a very solid rugged handset with a truly useful feature without a wallet-shattering price tag if you can look past its HD+ screen resolution.",
  "pros": [
    "Solidly built",
    "FLIR camera",
    "Great price",
    "Excellent performance"
  ],
  "cons": [
    "No microSD card slot",
    "Camera sensors are more exposed to scratches",
    "Low screen resolution"
  ],
  "article": [
    "Thermal imaging is quickly becoming a favourite feature for top-of-the-range rugged smartphones. FLIR, now Teledyne FLIR after its acquisition by Teledyne Technologies, has now been rolled out on half-a-dozen rugged handsets from Cat, Blackview, Doogee and Ulefone. The latter sent us its latest flagship - the Armor 11T - that not only sports one of these Predator-style cameras but can also run on a 5G network.",
    "At the time of writing, the Ulefone Armor 11T retails for just under $500 from online Chinese retailer, Banggood, with free shipping and the option to pay via Klarna in four interest-free payments. Note that you may be charged extra for taxes depending where you leave. There’s also a 15W Qi Wireless charger (RRP $40) and a multifunctional protective case ($30) for those who want to accessorize the device.",
    "Ulefone chose a fairly conservative design for its newest flagship, a far cry from the unconventional Armor 10 with its larger-than-average body and the Armor 9 and its back-to-basic design. There’s fewer edges, screws and no flaps to protect the USB Type-C port on the bottom edge. It looks tidier and the overall product is marginally smaller than its predecessors at 164 x 82 x 14mm for a weight of just under 300g.",
    "The front of the smartphone has a centrally-located teardrop camera notch under an oleophobic screen; the 6.1-inch display is covered by a Gorilla Glass 5 layer. The octagonal shape of the Ulefone Armor 11 will protect the display corners, the more fragile part of the component, better.",
    "Next to the connector on the bottom edge is a dual-SIM tray, one that forgoes the usual microSD card.",
    "A bright orange textured button - which can be customized - is located on the left edge while two volume buttons, the power button and a fingerprint reader are found on the opposite side.",
    "The rear side contains five camera sensors, two of which are dedicated to thermal imaging camera unit, and are found next to a flash LED on a protruded area, probably not the best idea if you want to avoid scratches on a rugged smartphone. Ulefone’s logo and a “powered by Flir” inscription can also be found on the back.",
    "The Armor 11T is a hybrid of its two predecessors, the Armor 10 and the Armor 9. From the former, it borrows the processor (MediaTek Dimensity 800), the memory (8GB LPDDR4X), the storage (256GB UFS 2.1), a 2-megapixel depth sensor, a 5-megapixel macro lens and the 16-megapixel front facing camera. From the latter, the FLIR Lepton thermal sensor.",
    "Surprisingly, Ulefone chose not to use a full HD+ display opting instead for a HD+. There are pros and cons to going for a lower resolution; cheaper and lower power consumption. On the other hand, pictures are likely to be slightly more blurry although that will depend on the user’s sight. The pixel density of the 11T’s screen stands at 282ppi, a third less than the older Armor 9. Elsewhere, there’s a 5200mAh battery (worse than its predecessors), Wi-Fi 5 connectivity plus NFC.",
    "Inside the box of the Armor 11T is a tempered glass, a 18W power supply unit and a bright red, 1M long USB cable plus an audio adaptor and two small rubber flaps (that can be easily misplaced) to cover the USB port.",
    "Running on Android 11, Ulefone’s newest device performed admirably well on synthetic benchmarks, scoring some of the best numbers we’ve seen on 5G rugged smartphones so far, across a number of tests covering compute, storage and graphics. Somehow, despite using the popular Dimensity 800, it came ahead of its rivals making it a great mobile platform. Could Google’s newest iteration of Android OS be the cause?",
    "Although you can wirelessly charge the device (up to 15W), there’s no indication on the body of the Armor 11T that this is possible and it’s a real shame. Having a flapless Type-C connector is a double-edged sword, you swap convenience for the risk of short circuiting your device if you plug a cable in a wet port: be aware of the risks.",
    "As expected, Ulefone’s FLIR maverick shares the Mediatek software roster with its rivals. There’s the useful Easy Launcher/Child Mode user interface that restricts/simplifies the features of the smartphone. Also part of the kit is the ubiquitous Toolbag which includes single-use apps that, in theory, should appeal to DIYers and outdoor enthusiasts.",
    "We have reviewed a grand total of three 5G rugged smartphones to date. The Blackview BL6000 Pro, the Oukitel WP10 and the predecessor of the Armor 11T, the Armor 10. They were all released towards the end of 2020 and none of them have a thermal imaging camera.",
    "There are plenty of other FLIR-equipped 4G smartphones if 5G is not a priority for you; there’s the Armor 9 ($420), our editor’s choice, the Blackview BV9900 Pro (also $420), the Cat S62 Pro and the Blackview BV9800 Pro ($330).",
    "A worthy successor to the Armor 10 and Armor 9, the Armor 11 follows in the paths of its predecessors and delivers a very solid rugged handset with a truly useful feature without a wallet-shattering price tag. That is, if you can live with the HD+ display, a real turn down on a high end smartphone despite the obvious advantages that it brings to the target audience.",
    "We’re also not a big fan of the overall ABS plastic finish, especially on the back. True, it gives it a Lego-like finish but it looks very much out of character for an outdoor, rugged, IP68-rated smartphone. We’d much rather have a rubber, textured finish that’s more likely to sustain scratches and falls."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "7": "Hardware",
    "10": "Performance and in use",
    "13": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "rugged smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "Ulefone Armor 11T": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-1411831887916452600&ulp=https%3A%2F%2Fwww.banggood.com%2FUlefone-Armor-11T-5G-FLIR-Thermal-Imaging-Camera-IP68-IP69K-Waterproof-8GB-256GB-48MP-Camera-Android-11-6_1-inch-NFC-Wireless-Charge-Dimensity-800-Rugged-Smartphone-p-1852485.html%3Fcur_warehouse%3DHK%26ID%3D62878306246444%26DCC%3DUS%26currency%3DUSD",
    "Qi Wireless charger": "https://www.techradar.com/best/best-wireless-chargers",
    "Blackview BL6000 Pro": "https://www.techradar.com/reviews/blackview-bl6000-pro-5g-rugged-smartphone",
    "Oukitel WP10": "https://www.techradar.com/reviews/oukitel-wp10-5g-rugged-smartphone",
    "Armor 10": "https://www.techradar.com/reviews/ulefone-armor-10-5g-rugged-smartphone",
    "Armor 9": "https://www.techradar.com/reviews/ulefone-armor-9-flir-rugged-smartphone",
    "Blackview BV9900 Pro": "https://www.techradar.com/reviews/blackview-bv9900-pro-rugged-flir-smartphone",
    "Cat S62 Pro": "https://www.techradar.com/reviews/cat-s62-pro-rugged-smartphone",
    "Blackview BV9800 Pro": "https://www.techradar.com/reviews/blackview-bv9800-pro-rugged-smartphone"
  }
}