{
  "source": "https://www.techradar.com/reviews/rapoo-xw180",
  "title": "Rapoo XW180 review",
  "category": "computing",
  "updated": "2021-09-01T17:38:15Z",
  "author": "jess-weatherbed",
  "summary": "Value over video quality",
  "verdict": "The Rapoo XW180 webcam has an attractive design and price tag, though you may need to make some adjustments to get it to run at an acceptable quality.",
  "pros": [
    "Great wide-angle 80° FOV",
    "Tripod compatible",
    "Petite, lightweight design"
  ],
  "cons": [
    "Video quality is poor",
    "No detachable USB-C",
    "Disappointing lack of features"
  ],
  "article": [
    "The Rapoo XW180 certainly has the looks of one of the best webcams on the market – its design resembles a compact version of the Logitech Brio, with rounded corners and a glossy face covering the lens and sensor. It's an attractive piece of kit that should complement a business environment, all while being small and lightweight enough to throw into your laptop bag between uses.",
    "Better yet, it's highly affordable. The Rapoo XW180 retails for £39.99 / €49.99 (around $55 / AU$75) which makes it cheaper than some of the cheapest brand named webcams on the market such as the Logitech C310 (£45 / €60 / $50), though it would appear availability is restricted to Europe at this time.",
    "The cable is a USB-A type connection and measures around 60-inches (150cm) in length, though this is fixed into the back of the camera and can't be removed like in the aforementioned Brio, which might cause issues if you need to transport the webcam around frequently.",
    "The omnidirectional microphone built into the Rapoo XW180 is surprisingly good for a webcam, especially given that even the most expensive webcams on the market still struggle to provide clear audio recordings, but it's a stretch to say that the quality is enjoyable to listen to when compared to something like a dedicated USB microphone or combi-headset.",
    "You're getting 1080p resolution at 30 frames-per-second (or FPS), which is more than adequate for smooth video across most applications like Microsoft Teams or Zoom where your maximum resolution and framerate can't exceed that anyway. A glaring issue the Rapoo XW180 does have, though, is that the image quality is undersaturated and far too bright, washing out the subject of any color or features, as you can see in the image above.",
    "You can adjust this in certain applications by heading into the settings, but the Rapoo XW180 doesn't come with its own webcam hub software so any alterations you make won't carry over to each application. After lowering the brightness and increasing the saturation we managed to get the video quality to look more pleasant, so decent quality is certainly achievable with some work, but the out-of-box footage leaves a lot to be desired.",
    "The Logitech C920 currently sits pretty in the number one spot as the best webcam on the market despite there being better options available thanks to its affordability for the quality you get at $90 / £90 / AU$136, which is around twice the RRP of the Rapoo XW180. By comparison, you're actually getting a pretty good deal by going with the XW180 if you just need a webcam that can outperform the on built into a laptop device, and while it doesn't quite keep up with the C920's quality, it does have a few small advantages.",
    "A major one is that the head of the Rapoo XW180 can rotate a full 360 degrees, as well as slightly pivot up and down thanks to a ball-joint style mount for the camera lens. The fact that the webcam can be maneuvered gives it a leg up over many of the popular Logitech webcams on the market that come with a fixed camera, especially if you need to angle your shot to hide a messy background.",
    "The Rapoo XW180 also has a surprisingly wide 80° field of view which can include a great deal of your background within the shot. This can be advantageous if you need to do any presenting or if you use sign language to communicate through the webcam, especially as many webcams have a tighter FOV that only frames the user from the shoulder up.",
    "We compared the Rapoo XW180 to three different Logitech webcams: the Logitech 4K Brio, the Logitech C920 and one of the most affordable offerings, the Logitech C310. The C310 is more expensive than Rapoo's offering and inferior in almost every way, restricted to 720p and with a 60° FOV that unflatteringly zooms right into the subject's face.",
    "A bizarre thing we noticed was that most of the conferencing applications like Google Meet and Streaming software like OBS actually detected the Rapoo XW180 as a CyberTrack H7, an entirely different webcam. This didn't affect anything outside of the name, but it's still confusing if you're switching between different recording devices. You can use the XW180 with Windows, macOS, Chrome OS and even Android devices, so it's unlikely that it won't work on your hardware even if the name of the device is incorrect on certain applications.",
    "Deciding if the Rapoo XW180 webcam is suitable for you is mostly a matter of context. It doesn't really fair too well with the most important job a webcam has – to provide great quality video for broadcasting – so it's unlikely to win over anyone looking for a device for Twitch or YouTube. But it has a lot of utility in the form of that rotating head, and you can even connect it to a standard tripod for a better viewing angle, something not often found on affordable devices.",
    "Realistically, it's the price that will sell you on this, so if you're looking for a cheap, reliable webcam and you're not too bothered about true-to-life color (and you're happy to make a few adjustments to the brightness) then the XW180 is perfectly serviceable."
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "Don't buy if..."
  },
  "links": {
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "Logitech Brio": "https://www.techradar.com/reviews/logitech-brio-ultra-hd-pro-business-webcam",
    "USB microphone": "https://www.techradar.com/best/the-best-usb-microphones-2020-the-best-standalone-mics-you-can-buy-today",
    "combi-headset": "https://www.techradar.com/news/best-business-headphones-and-earphones",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "Logitech C920": "https://www.techradar.com/news/best-logitech-webcams",
    "CyberTrack H7": "https://www.adesso.com/product/2k-hd-auto-focus-webcam-with-built-in-dual-microphone-tripod-mount-and-privacy-shutter-cover/"
  }
}