{
  "source": "https://www.techradar.com/reviews/fujifilm-gfx50s-ii",
  "title": "Fujifilm GFX50S II review",
  "category": "cameras",
  "updated": "2021-09-17T04:17:55Z",
  "author": "sharmishta-sarkar",
  "summary": "That medium format ‘look’ for a relatively affordable price",
  "verdict": "Fujifilm’s upgrade to its relatively affordable 50MP GFX camera doesn’t look very impressive on paper – no 4K video, only 3fps continuous shooting speed – but some significant changes both inside and out have made this the first 50MP stabilized shooter from Fujifilm, with the cheapest price tag for a medium format camera. Along with its impeccable image quality, it’s easy to fall in love with this camera. However, its relatively sluggish autofocus (as compared to other mirrorless cameras), meager 3fps burst rate and lack of 4K video could deter some users.",
  "pros": [
    "Relatively affordable",
    "Exemplary image quality",
    "Impressive image stabilization"
  ],
  "cons": [
    "Lacks 4K video",
    "Relatively sluggish AF",
    "Slow subject tracking"
  ],
  "article": [
    "The Fujifilm GFX50S II might look very different from its predecessor, but it inherits that same large sensor that made us fall in love with the original GFX 50S. Like the older model, the GFX50S II hasn’t been designed for speed junkies or video, instead it harnesses the power of a medium format sensor, combines it with some very steady in-body image stabilization (IBIS), to then produce some stupendous stills.",
    "That IBIS, for the first time in a GFX body, is rated for a very impressive 6.5 stops of compensation for camera shake. That’s a half stop more than the GFX100S that was announced only in March 2021. It’s a very beneficial upgrade for anyone shooting handheld, particularly in low-light situations with a camera that can get heavy with some GF lenses.",
    "Admittedly a full-frame mirrorless camera like the 65MP Sony A7R IV can offer similar results to the GFX50S II with far more features (like video, speed and accuracy) and at a lower price point, but sometimes (sensor) size truly does matter. The sensor in the GFX50S II is about 1.7x bigger than a 35mm full-frame chip – meaning there’s better light-gathering abilities, and thus a superior low-light performance and excellent dynamic range that few full-framers can match. Combined with the sharp glass of the GF lenses, it’s a recipe for some remarkably good images.",
    "Fujifilm has done right by adopting the GFX100S body for the 50MP version. It offers a very familiar setup for photographers coming from any other system, with a traditional DSLR-like control layout and handling. Moreover, Fujifilm’s camera menu system has also evolved over the years, becoming a lot more user-friendly and easy to navigate.",
    "The lack of 4K video is disappointing, especially since it’s available on the GFX100S, but several photographers can still manage with 1080p resolution. Even the meager 3fps burst speed feels antiquated in the spec sheet of a camera launching in 2021, but the GFX50S II wasn’t designed for sports or wildlife photography. Fujifilm has even brought over the contrast-detect autofocus from the older model over the Mark II, but the algorithms have been improved. While AF is comparatively sluggish to other modem mirrorless cameras, it has a pretty good acquisition speed as compared to older medium format cameras. Face- and eye-detect AF are also on board, although subject tracking can be a bit hit-and-miss and very slow.",
    "While the GFX 50S was already an ‘affordable’ camera (for a medium format shooter of course), the Mark II is cheaper still, and that makes it a lot more accessible for more mainstream photographers. The price alone – particularly if you opt for the single-lens kit – makes it a compelling alternative to high-resolution full-framers for photographers who don’t need the blitzing-fast performance the smaller sensor formats offer.",
    "At launch, Fujifilm slapped a price tag of $3,999 / £3,499 / AU$6,499 for the body alone. A kit bundled with the GF 35-70mm f/4.5-5.6 WR lens will also be available for $4,499 / £3,899 / AU$7,299 – a package that offers very good value if you’re a first-time GFX user.",
    "While those prices aren’t what we’d call ‘cheap’, the camera is remarkably affordable for a medium format model, and is cheaper at launch as compared to the GFX 50S at $6,500 / £6,199 back in early 2017. If you take into account the other 50MP medium format cameras like the Hasselblads, you’ll be shelling out something like $6,500 / £6000 / AU$11,500 for the 907X 50C or X1D II 50C.",
    "Fujifilm has decided to stick with the same 51.4MP sensor that was used in the original GFX 50S, and that’s not a bad thing. You’re still going to get impeccable image quality, with shallow depth of field no matter the focal length. However, that also means you’re still only getting contrast-detect autofocus, which is slower than phase-detect AF, but Fujifilm claims that upgrades to its AF algorithms have made a difference.",
    "While the GFX50S II gets the latest X-Processor 4 imaging engine – which does improve AF performance over the older model – there’s still no 4K video capabilities in the Mark II. That’s a limitation of the older sensor, and you are still restricted to the 3fps continuous shooting speed that we saw in the Mark I.",
    "While the lack of 4K video and a meager continuous shooting speed is a little disappointing, Fujifilm has made up for it by improving the in-body image stabilization (IBIS). The 5-axis IBIS system – which wasn’t available on the older GFX 50S – is rated for a whopping 6.5 stops of correction for camera shake, a half stop improvement over the GFX 100S and the best IBIS rating of any GFX camera to date.",
    "Thanks to the addition of the IBIS module, the GFX50S II can now boast a Pixel Shift Multi-shot function. This produces 200MP images by capturing 16 RAW images as the sensor shifts by 0.5 of a pixel – the final composite image isn’t produced in-camera though, and needs to be done in post using Fujifilm’s Pixel Shift Combiner software.",
    "While the IBIS and the multi-shot mode are the biggest gains the GFX50S II has over its predecessor, there are a few other smaller features that have been added to the Mark II – mostly upgrades that Fujifilm has added to its arsenal in the years since the launch of the GFX 50S. For example, a lossy RAW compression option is now available in addition to the existing lossless compression, as well as focus bracketing added to the existing list of bracketing options – both brought over from the GFX100S.",
    "Rounding up the feature set for the GFX50S II is the collection of 19 Film Simulations presets, including the Nostalgic Neg that debuted in the GFX100S earlier this year.",
    "Physically, the original GFX 50S and the Mark II are very different. Fujifilm has used the GFX 100S body for the new GFX50S II, giving it a more DSLR-style control layout. This would make it easy for anyone moving away from a different system to adapt to the GFX50S II quite quickly.",
    "Unlike the original GFX 50S, which has slightly cramped dials on the top plate, there’s just the traditional mode dial and the electronic viewfinder (EVF) on the Mark II, with a 1.8-inch LCD display to the right of the viewfinder. The display can be set to show virtual dials, a histogram or a full set of shooting parameters. There’s even a little light button to illuminate the display.",
    "Speaking of the EVF: the older GFX 50S had a removable eye-level viewfinder that could be replaced with an optional tilting EVF. However, the EVF on the Mark II is fixed, like in the GFX 100S and has the same 3.69 million dot resolution as before. Despite the shared resolution, Fujifilm has opted to use a different OLED panel in the Mark II that drops the magnification from the 0.85x on the GFX 50S to 0.77x in the new body. While it would have been nice to have higher magnification, the EVF is sharp and you can have a lot of shooting information displayed on there if you wish.",
    "Complementing the EVF on the rear is the 3.2-inch 3-way tilting touchscreen – the same used in the GFX 50S and GFX 100S – that’s very responsive with full functionality available on that panel. The button layout on the rear of the Mark II is a lot more intuitive – the exact same setup as in the 102MP sibling. This makes it easy to come to grips with the interface, even for anyone who’s never used a medium format or Fujifilm camera before. Practically every button can be customized, even the Quick Menu. If you’ve ever been daunted by the idea of using a medium format camera, Fujifilm has now made it a lot more user friendly with its last two offerings.",
    "However, the Quick Menu button on the Mark II still sits on the ridge of the thumb rest (as in the GFX 100S) and may cause accidental presses if you aren’t too careful. During our time testing the camera, though, we had no issues with accidental presses on the Q button.",
    "Like the GFX 100S body, the GFX50S II also sits in the hand comfortably, with a beefy grip that distributes the weight well, even when a hefty lens has been attached. At 900g, it’s no lightweight, and the camera can feel heavy after prolonged handheld use, but it’s a far cry from the larger bodies such as the GFX 100. Like the GFX 100S, there’s an index finger indent to make the grip more ergonomic and the thumb rest on the rear is deep too.",
    "Having inherited the body from the GFX 100S, the GFX50S II also inherits the same NP-W235 battery that’s rated for about 460 shots per full charge. Dual SD card slots, 3.5mm jacks for mic and headphones, a USB-C port for charging and transferring files, a mini HDMI port and a PC sync port round up the camera body.",
    "The GFX50S II performs remarkably well for a medium format camera. It’s easy to compare with other mirrorless cameras on the market, most of which offer speedier performance at lower prices, but it is important to keep in mind that medium format cameras are very different beasts.",
    "They’re not really known for topnotch autofocus performance, but Fujifilm has harnessed the power of the X-Processor 4 engine, while also updating the AF algorithm, to speed things up a little. Because it still uses the same contrast-detect AF as before, however, AF acquisition is a little slower as compared to the 102MP GFX cameras that have the advantage of the hybrid AF with phase detection. And that also means it’s slower than most other modern mirrorless cameras. Despite that, the GFX50S II is no slouch. Autofocus is still relatively snappy and very accurate.",
    "Face and eye detection are on board and work quite well, provided your subject is squarely facing you or at least one eye is well lit. However, eye detection works effectively only on S-AF mode, and suffers a lot when trying to track in continuous shooting mode.",
    "It’s again very tempting to compare the performance of the GFX50S II with that of other mirrorless cameras, but that would be an unfair comparison. That said, it is disappointing that the GFX50S II misses out on a 4K video upgrade, despite inheriting the latest image processor from its 102MP sibling. Footage is still captured at 1080p resolution at a maximum frame rate of 30fps. You can’t fault the quality though.",
    "You’re also stuck with the same 3fps continuous shooting speed as its predecessor, so it won’t be winning any medals in the sports or wildlife photography arena. However, Fujifilm has adjusted the buffer memory on the camera, which has gone from 25 JPEGs in the 50S to ‘unlimited’ in the Mark II, and up to 31 compressed RAW files (up from just 13). Moreover, the camera stays fully operational while saving images, allowing you to continue shooting if necessary.",
    "The low burst rate, however, contributes to a lot of rolling shutter effect (where lines appear at angles) when using the electronic shutter.",
    "A battery rated at 460 shots is quite competitive for a mirrorless camera, but this number is conservative. Depending on the shooting conditions and duration, you can easily squeeze upwards of 550 shots from a single charge.",
    "What’s really impressive about the GFX50S II, though, is its image stabilization system. The IBIS is rated at 6.5 stops of shutter speed advantage, but in real-world shooting conditions you are likely to get more like 5 stops – this is because IBIS ratings are measured for just pitch and yaw and the number is a best-case scenario. Even then, 5 stops is remarkable. Handheld shooting with the GFX50S II is a joy, despite it feeling heavy after long use. We were able to capture some great results at 2 seconds shutter speed at base ISO handheld with the GF 30mm f/3.5 R WR lens (as you can see from the image above).",
    "It’s extremely difficult to find fault with the results produced by a medium format body. Because of its slightly slower AF performance, the GFX50S II is going to be the remit of portrait, still life, architecture and landscape photographers. That’s because of the advantages that a medium format sensor offers.",
    "Combined with Fujifilm’s excellent quality GF optics, the level of detail you get from the large sensor is very high, and tonality is sensational. The bigger photocells on the sensor means great light-capturing capabilities, which in turn translates into superb low-light performance and excellent dynamic range. We took a few underexposed test shots and there was a huge latitude to play with. It was extremely easy to bring out details in shadows and highlights without impacting the image quality.",
    "The low-light performance of the camera means noise control is also really quite good here. Even at high sensitivity like ISO 3200, noise is very well controlled, with not a trace of grain. Even images captured at ISO 6400 are clean. Step up to ISO 8000 and you will start to see a bit of grain creep in, but the images are still usable, as long as you don’t intend to enlarge and print or crop too much.",
    "With Fujifilm’s Film Simulations on board, there’s plenty of in-camera creativity to play with. Colors are excellent, even in the standard preset, but you can opt for brighter colors and more saturation by using the Velvia/Vivid (which is what we used for most of our sample images). Its lack of video and speed aside, the GFX50S II scores big in our books on picture quality alone."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Fujifilm GFX50S II price and availability",
    "8": "Fujifilm GFX50S features",
    "14": "Fujifilm GFX50S II build and handling",
    "21": "Fujifilm GFX50S II autofocus",
    "24": "Fujifilm GFX50S II performance",
    "29": "Fujifilm GFX50S II image quality",
    "33": "Don't buy if..."
  },
  "links": {
    "GFX 50S": "https://www.techradar.com/reviews/fujifilm-gfx-50s-review",
    "GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review"
  }
}