{
  "source": "https://www.techradar.com/reviews/core-balance-massage-gun",
  "title": "Core Balance Massage Gun review",
  "category": "fitness",
  "updated": "2021-07-05T13:55:41Z",
  "author": "rob-clymo",
  "summary": "The Core Balance massage gun is an affordable option for tackling muscle pain",
  "verdict": "We’ve been left feeling impressed by the Core Balance Massage Gun. While it’s clearly not serious competition for those more expensive devices promoted by professional footballers, the Core Balance Massage Gun is a great little entry-level unit that offers decent value. We love the varied intensity of the power settings, and there’s a massage head to suit most, if not all muscle pain and fatigue issues. It could do with one or two tweaks in the design department, with a better fitment of said massage heads being the main moan. Nevertheless, this has proved to be a family favourite, tackling the aches and pains of everyone in the household.",
  "pros": [
    "Reasonably good value",
    "Good selection of massage heads",
    "Decent storage box included"
  ],
  "cons": [
    "Massage heads have a tendency to drop out",
    "Core controls could be better"
  ],
  "article": [
    "Muscle pain is a common problem that doesn't just affect fitness fans that might have overdone it while out on a run or down at the gym. Muscle aches, pains and general fatigue can be a problem for anyone, which is where a device like this comes in. The Core Balance Massage Gun is an affordable, entry-level ‘gun’ style gadget that comes with a selection of interchangeable heads designed to tackle the issue.",
    "It’s a self-contained handheld gizmo that packs a surprisingly potent amount of power from its rechargeable built-in battery. With a selection of modes that work in tandem with the different shaped massage heads, the unit is a simple-but-effective aid for combating muscle pain, minor strains and general fatigue. It’s handy for everyone from fitness enthusiasts through to home workers who’ve spent too long sitting at their laptops.",
    "At the time of writing, the Core Balance Massage Gun costs £59.99 (about $80 / AU$110), which the manufacturer says is a 60% off the usual recommended retail price, but will stick for the foreseeable future. It launched in January 2021 is currently only available in the UK.",
    "Core Balance has done a very nice job with the design of this massage gun. It arrives in a plush padded box, which once unzipped reveals everything you need to take on those aching muscles. Our review model was finished in grey with teal flourishes, but the unit is also available in just grey, or grey with blue highlights.",
    "The box contains the gun along with everything else needed, including a selection of six different heads of varying shapes and sizes, along with a power adapter and a small bag of replacement seals. These can be slipped over the pointy bit of the head that is inserted into the gun when they’re eventually needed, as presumably these wear over time.",
    "Holding the massage gun itself proves to be a very tactile experience, with a smooth ergonomically-friendly feel that’s clearly been well though out. While the unit does initially seem quite heavy it’s not unwieldy, and the weight is actually beneficial for helping to hold it steady in use and also to focus better on any problem areas. There’s a power button on the back of the gun, which you can reach with a thumb or finger.",
    "A ring of small lights around this indicate the amount of charge available on one side, while the other highlights the intensity rate of the massage being dished out by the unit. Core Balance has kept the design and usability simple by letting you use the same power button to skip up through the five power settings. You can’t skip back down though. You subsequently need to hold the button in to power off, which during initial use proved a little confusing as we inadvertently cranked the gun up to its maximum Pro level. Practice makes perfect.",
    "After fully charging the Core Balance Massage Gun, we selected a head suitable for soft tissue massage and gave it a whirl. It delivers percussion massage, which at the slowest speed allows the oscillating head to lightly pummel the problem area. There is, of course, the full range of five different speeds available, which as you crank it up delivers the power in increasingly vigorous massage fashion. The Core Balance can produce a maximum of 2400 revolutions per minute, delivering an amplitude of 11mm, which is the aspect of the vibration that lets the unit get into those problem areas.",
    "One thing we did experience though was the vagueness of the head attachment process. The manual indicates that the head you choose just needs to be slotted into the gun using a push-fit technique. However, it never seemed to be as precise as we’d have liked, and occasionally heads would vibrate loose and drop out. We’ve consulted the manual several times and feel sure we’re doing it right, but it’s an irritation nonetheless.",
    "Once you’ve got past that issue though the Core Balance Massage Gun is impressive and it’s certainly easy to use. The very basic manual explains what each attachment head does. There’s a fork head for Achilles, neck and spine work, a flat head that’s suitable for all muscle groups while the large ball head can be used for medium muscle groups such as thighs. Meanwhile, the small ball attachment is aimed at medium and small muscle groups, including calves. The nifty air cushion head is ideal for sensitive tissue or joints and, finally, there’s a bullet head that can be called upon to tackle deep tissue.",
    "Depending on your problem area we found that the Core Balance Massage Gun worked well, although quite how well is hard to determine when it comes to actual results. The gun definitely made a difference with sore areas. For example, it seems to be very good for tackling something like calf muscle soreness after a long run, as well as upper back and neck fatigue after lengthy sessions on the laptop.",
    "We also found it beneficial for sore feet and simply relaxing on the sofa, with the occasional dab on those everyday aches and pains that we all get. You’ve got to be careful not to overdo it, although the unit switches off automatically after 10 minutes anyway.",
    "You’re supposed to use the Core Balance Massage Gun on clean dry areas, covered by clothing, which is reasonable given the way you can’t wash any of the components. You can wipe the heads over with a damp cloth and that’s about it. Quite how the device will look over time remains to be seen. Nevertheless, given the price point this is a neat health and fitness accessory that might tempt you to move on up to bigger and better rivals.",
    "First reviewed July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "2": "Price and release date",
    "3": "Design",
    "7": "Performance",
    "14": "Don't buy it if"
  },
  "links": {
    "Core Balance Massage Gun": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9218902339323675000&xs=1&url=https%3A%2F%2Fwww.corebalancefitness.co.uk%2Fpercussion-massage-gun.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fcore-balance-massage-gun",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361"
  }
}