{
  "source": "https://www.techradar.com/reviews/shellscom",
  "title": "Shells.com desktop-as-a-service review",
  "category": "computing",
  "updated": "2021-04-23T13:03:00.149Z",
  "author": "stuart-davis",
  "summary": "Convert a variety of low-spec devices into fully functional desktops",
  "verdict": "The reasonably priced Shells.com DAAS is sure to be popular among casual and professional users.",
  "pros": [
    "Selection of reasonable payment plans",
    "Quick and easy registration process",
    "Access to a variety of desktop environments featuring a mix of software and apps",
    "Fast support response"
  ],
  "cons": [
    "Reliance on up-to-date operating systems and stable internet connection"
  ],
  "article": [
    "Shells.com is a desktop as a service (DAAS), enabling access to cloud-generated desktop environments. It provides the opportunity to transform a variety of old and low-spec devices into fully functioning desktop computers, and the cloud-generated desktops are integrated with a variety of applications for such uses as word processing, coding, and music production.",
    "Keep on reading to find out why Shells.com is rated amongst the best virtual desktop services.",
    "Shells.com offers three payment plans, suitable for different budgets and user expectations. The best choice of plan depends on the number of cores, amount of disc space, and RAM you require.",
    "The Shells Lite plan is priced at $4.95/month and offers access to a choice of desktop environments powered by a single processor, with 40GB of storage and 2GB of memory. However, access is restricted to under 10 hours per month.",
    "There is the option of an annual subscription to the Shells Basic plan at the price of $9.95/month. This allows unlimited use of a cloud-based environment powered by a single processor, with 40GB of storage and 2GB of memory. Alternatively, you can pay the stand-alone monthly price of $11.95.",
    "Finally, there’s the offer of a cloud-based computer that “can do it all” with the Shells Pro plan for the monthly price of $36.95, given an annual subscription. This allows for the remote access of a system powered by four processors, with 160GB of storage and 8GB of memory. Again, there is a choice of month-by-month payment, with the price standing at $39.95.",
    "Each of the payment plans can be canceled within seven days for a full refund.",
    "Shells.com enables you to create a virtual machine via the cloud, with a choice of operating systems to transmit to your physical device. You are provided with one credential to access the Shell account and another to administer your chosen operating system.",
    "You can view a list of the generated virtual desktops after logging in via the Shells.com website. A new shell may then be chosen from a regularly updated list of operating system distributions. The current choices include Ubuntu Desktop 20.04 LTS, Android, and Microsoft Windows 10 Pro.",
    "A range of pre-installed applications and other software can be accessed after logging in to your preferred desktop environment. As an example, you can use Libre Office Writer to create word-processed documents in Ubuntu. Specialist programs such as VScode, FL Studio, Audacity are also integrated.",
    "The desktop interface is transmitted via the Shell.com cloud directly to your device of choice, allowing you to draw on the processing power of the remote server. However, your computer must have a compatible web browser and be able to run the dedicated Shell application.",
    "Operation of the desktop features and selected programs depends on the device you’re using. For example, you can connect a keyboard and mouse to your smart TV so that it functions as a standard desktop computer. There’s also an on-screen menu, providing the option to switch to 4K resolution and zoom in or out.",
    "The main support section of the Shells.com website provides the answers to a variety of questions. There’s also a dedicated “Learn with Shells” section, including quick how-tos and in-depth tutorials. The instructions are quite clear and easy to follow.",
    "Live support is accessible via the Shells.com website. When you submit a question you’ll be sent links to articles of relevance, but if the articles aren’t of any help then you can leave a message for the Shells.com team. For the purposes of this review, we sent one about an installation issue. A response was received the same day; with details of an app update and working download file being provided.",
    "Complete with firewalls and end-to-end encryption, the Shell environment is ideal for testing tasks and software that might otherwise incur the risk of irreparable damage to your physical device. You can keep your device connected to Shells.com around the clock, meaning that tasks can be completed in the background and overnight.",
    "The integrated snapshot feature allows the user to reverse any changes and restore the desktop to a previous state. And the operating system can be rapidly reinstalled in the event of a major error.",
    "The feature-packed Amazon WorkSpaces is one of the most popular rivals for the title of best DAAS. However, its standard pricing is higher than that of Shells.com: you must pay $21/month to get unlimited use of a cloud-based environment powered by a single processor, with 10GB of storage and 2GB of memory.",
    "Citrix Managed Desktops are also widely trusted and well suited to the remote workforce. The range of desktop environments can be connected to devices running Android, Windows, and iOS. There is some variation in pricing, depending on the number of users, features, and licenses you wish to have. The integration and virtualization of popular collaborative and communication tools make Citrix a good business choice.",
    "The reasonably priced and feature-packed Shells.com is a great choice for everyday users and specialized professionals. Designed for ease of use, it can be quickly and easily connected with a wide range of devices. The complementary inclusion of free daily back-ups covering up to seven days is a nice touch, helping Shells.com to stand out from some well-established rivals."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "10": "Interface and in use",
    "12": "Support",
    "14": "Security",
    "16": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Shells.com": "https://www.shells.com/l/en-US/",
    "best virtual desktop services": "https://www.techradar.com/best/virtual-desktop-services",
    "Shells Lite plan": "https://www.shells.com/l/en-US/pricing",
    "Shells Basic plan": "https://www.shells.com/l/en-US/pricing",
    "Shells Pro plan": "https://www.shells.com/l/en-US/pricing",
    "Amazon WorkSpaces": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5631543441223115000&xs=1&url=https%3A%2F%2Faws.amazon.com%2Fworkspaces%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fshellscom",
    "Citrix Managed Desktops": "https://www.citrix.com/products/citrix-managed-desktops/"
  }
}