{
  "source": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
  "title": "Ratchet and Clank: Rift Apart review",
  "category": "gaming",
  "updated": "2021-06-10T14:38:38.969Z",
  "author": "vic-hood",
  "summary": "Getting into the nuts and bolts of Ratchet and Clank: Rift Apart",
  "verdict": "Ratchet and Clank: Rift Apart is brilliant, fast-paced fun that doesn’t take itself too seriously. Rift Apart manages to retain the charm and humor that we loved about the original titles, while balancing this with new characters that offer endearing vulnerability. But while the latest Ratchet and Clank makes great use of the DualSense controller’s haptic feedback and audio, we wish it utilized PS5 audio more and were frustrated by the number of bugs. Despite adding some new, welcome features, it often feels like Rift Apart plays it a bit too safe, meaning it doesn’t quite achieve that ‘wow factor’.",
  "pros": [
    "New characters have depth",
    "Haptic feedback adds immersion",
    "Traversal is fast-paced",
    "Charming and humorous"
  ],
  "cons": [
    "PS5 Audio utilization disappointing",
    "A fair few bugs",
    "A lack of optional missions"
  ],
  "article": [
    "Among the more ‘serious’ titles that we’ve seen hit PS5 this year, Ratchet and Clank: Rift Apart is a breath of fresh air. The beauty of Rift Apart, as with preceding Ratchet and Clank titles, is that it doesn’t take itself too seriously, and isn’t afraid to inject some wit and silliness into a fast-paced adventure. It’s a clever ploy, as it means that when an emotional gut-punch is delivered, you’re taken entirely by surprise.",
    "It’s a fine line to walk, juggling a light-headed family adventure with emotional depth, but Rift Apart does it wonderfully, introducing new characters who balance their comic relief with an endearing sense of vulnerability. It makes the introduction of new playable protagonist Rivet that much easier to digest – quite the feat when you consider we’ve grown accustomed to the two-man team of Ratchet and Clank, the long-time heroes of the series.",
    "But it’s the rapid (almost nausea-inducing) traversal options that are the star of the show. Ratchet and Clank: Rift Apart will see you rocketing through deserts, rail grinding through rifts and scaling walls through a variety of stunningly realized planet environments. DualSense support adds an extra layer of immersion to these environments, with haptic feedback letting you feel each bit of terrain and the controller’s built-in speaker allowing you to hear each pew-pew of your gun.",
    "But while Ratchet and Clank: Rift Apart is undoubtedly fun, and is sure to get your adrenaline pumping, it can at times feel like developer Insomniac Games has played it a bit safe with the iconic duo’s latest outing. Oftentimes, Rift Apart can feel a bit too reminiscent of the first Ratchet and Clank, with one optional mission in particular feeling rehashed. What’s more, the mind-blowing rift sequences we were expecting aren’t as often as we would like, making Rift Apart more of a standard Ratchet and Clank game than what we had expected.",
    "We just hoped it would push the limits a little bit more than what it does, given it's a PS5 exclusive, making better use of PS5 audio, introducing more varied environments and really hammering the rift sequences. We were also disappointed by the number of bugs that we encountered, which made Rift Apart less fluid than we would have hoped.",
    "Despite these issues, we thoroughly enjoyed Ratchet and Clank: Rift Apart. And, if you’re a Ratchet and Clank fan, then you probably will too.",
    "Ratchet and Clank: Rift Apart sees the iconic duo trying to chase down Dr. Nefarious through a series of cross-dimensional worlds, following an unfortunate incident with an (aptly named) dimensionator, which causes rifts to inter-dimensional rifts to open within worlds. It’s in one of these other dimensions that we meet Rivet, a female Lombax and the second main playable protagonist of Rift Apart.",
    "Rivet’s introduction is pretty seamless, she plays exactly like Ratchet, with even weapons, upgrades and armor being shared between the two, and so the only key difference from playing as Ratchet is Rivet’s personality – which is considerably more hardened than Ratchet’s.",
    "The dimensional and protagonist split in Rift Apart keeps things fresh, but at times can make the storyline feel a bit staggered. As you progress, you’re continually offered two levels to pick from – one where Rivet takes center stage and one where Ratchet does – but it means that you’re constantly jumping between the two and can’t entirely grasp onto one story arch wholeheartedly. That being said, everything does converge quite neatly eventually. Once you find your footing with the story, which in theory isn’t particularly hard to grasp, you’re golden.",
    "While the story’s premise isn’t overly original, there are some neat twists throughout, and the characters help to take it to the next level. Those who have already played previous games in the series will know of Ratchet’s quest to find the Lombaxes, but it's particularly moving to find that he has finally found another Lombax, only to have them split into different dimensions. What we also found particularly endearing is that Insomniac isn’t afraid to highlight character’s vulnerabilities –allowing us to connect with them more. However, that’s also why the jump back and forth between protagonists can be frustrating, as it makes that gradual connection feel a bit disjointed at times.",
    "But while Rift Apart does have these heartwarming moments, it still keeps the charm and humor we loved from the original series. Much of it is silly, but the dryness of it means it’s always enjoyable. Rift Apart perfectly walks the line between kid fare and a game for adults, so there’s something there for everyone.",
    "Undoubtedly Rift Apart’s best feature is its traversal. Players can utilize the dimensional rifts that appear in the world to pull themselves to out-of-reach areas, with some larger rifts in the world even leading to pocket dimensions where collectables can be found. Rifts are not only practical, proving very handy when it comes to combat, in some cases allowing you to quickly zip behind an enemy and attack them from behind.",
    "While rifts are useful, it’s the game’s pair of hover boots that really make traversal fun. Once you unlock them, you can speed around the world, making use of speed boosters on the floor to really get some extra momentum. There are some worlds where you can really make use of the boots and it makes exploring these environments much easier.",
    "Chaining up Rift Apart’s traversal options will really see things kicked into gear, though. Running along, hitting a speed boost, shooting up an environmental ramp and landing on a rail grind feels fluid and satisfying. We just wish there were a few more instances of this in the game.",
    "Combining this super-fast traversal with combat feels even better. Rift Apart introduces a bunch of new weapons, including a topiary weapon that causes enemies caught within its sprinkler to turn into shrubs. But there are also some updated takes on previous weapons from the series, like Agents of Doom and Buzz Blades. While there are plenty of weapons to play with, we do wish we had more ridiculous weapons like the Groovitron from Ratchet and Clank (2016), which caused those within its range to break out into dance.",
    "As in previous series entries, you can upgrade your weapons at Ms. Zurkon’s shop using Raritanium, a mineral you find throughout the world. In addition, weapons can level up the more they’re used, allowing you to choose more upgrades and making weapons more powerful. You can also buy more weapons at the shop using the iconic Bolts you find in the world. While armor can’t be bought, as in some previous series entries, you can pick parts of it up on your journey, with a complete suit offering a buff against a certain enemy type – plus it makes Ratchet and Rivet look extra cool.",
    "Different weapons and armor are better suited to different enemies, but generally Rift Apart isn’t going to present you with a huge challenge. There are a variety of difficulty modes so you can up the challenge if you fancy it but, generally, it means that you can actually enjoy the story and missions without getting frustrated and throwing in the towel. After all, Ratchet and Clank are a family-friendly duo.",
    "What we did find frustrating was the number of bugs we encountered, with enemies falling through the world and making missions impossible to complete without restarting from the last checkpoint, or the music disappearing completely. There is a launch day patch due to roll out to Rift Apart though, which we hope will iron these issues out.",
    "In addition, while we enjoyed Rift Apart’s worlds, we wish there was more of an incentive to explore them outside of collectibles. We hoped there would be more optional missions to undertake, but there were very few. One, in particular, felt like a bit of a rehash of a similar mission from Ratchet and Clank (2016).",
    "Ratchet and Clank: Rift Apart is a PS5 exclusive and we can see why – this isn’t a game that would have run smoothly on PS4. But, saying that, we did play on Fidelity mode, which is 4K at 30fps. Thanks to the PS5’s super-fast SSD, Rift Apart still feels fluid at this frame rate – while looking stunning in 4K. However, both a Performance Mode and Performance Mode with Ray Tracing are also available. Both these modes allow Rift Apart to run at 60fps, with Performance Mode with Ray Tracing allowing for ray-tracing at the cost of resolution, and Performance Mode allowing for 60fps at a “lower resolution”, with temporal injection set to make the visuals look almost 4K.",
    "We found that playing in Fidelity mode gave us the best of both worlds and we never found the game’s fluidity to suffer. However, once we tried Performance Mode, we were more aware of the lower frame rates in Fidelity Mode. It really depends on whether you want a more fluid experience at the cost of visual or whether you want a better-looking game that's a bit less fluid.",
    "Rift Apart also benefits from its DualSense controller support. The latest Ratchet and Clank utilizes haptic feedback, allowing you to feel the difference between terrains and varying speeds. This adds to Rift Apart’s immersion, especially in one sequence when you can feel one character’s individual legs hitting a glass floor. When combined with the DualSense’s built-in speaker, which will pew-pew each time you shoot, it makes for a fantastic experience that only the PS5 can offer.",
    "However, we were a bit disappointed with the use of adaptive triggers, which are meant to offer two types of shooting options per weapon depending on how far the trigger is pulled down. Most of the time, we couldn’t quite get it right, as the biting point between the two didn’t feel particularly clear. We also wished Rift Apart utilized PS5 3D audio better, as we didn’t feel that it matched the spatial audio experience found in Returnal or Resident Evil Village. It could be because Insomniac’s focus was on making the DualSense audio better – which Insomniac has done – but it is a bit disappointing nonetheless.",
    "What is impressive is the range of accessibility options Ratchet and Clank: Rift Apart offers. You can toggle combat and traversal assists, alter screen effects and visuals, simplify controls and even alter your HUD and camera settings, plus much more.",
    "Ratchet and Clank: Rift Apart is perfect for those who want a light-hearted, action-adventure that harks back to the days of early PlayStation platformers. We would have loved to have seen Insomniac Games play it a bit less safe, and utilize some PS5 features better, especially given Rift Apart is a PS5 exclusive with a hefty price tag, but we still thoroughly enjoyed our time surfing inter-dimensional worlds."
  ],
  "headers": {
    "6": "A new member of the family",
    "11": "Gotta go fast",
    "19": "The power of PS5",
    "24": "Verdict"
  },
  "links": {
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village"
  }
}