{
  "source": "https://www.techradar.com/reviews/helcim-point-of-sale-pos-review",
  "title": "Helcim point of sale (POS) review",
  "category": "computing",
  "updated": "2021-07-15T14:58:08.350Z",
  "author": "daniel-blechynden",
  "summary": "A powerful Helcim POS system backed by a great range of add-ons",
  "verdict": "Although it’s far from the most popular POS system on the market, Helcim’s 15 years of industry experience, excellent tools, and competitive prices make it an option that’s hard to overlook.",
  "pros": [
    "Excellent management tools",
    "Designed for small business",
    "No monthly fees"
  ],
  "cons": [
    "E-commerce fees are a little high",
    "Hardware is expensive"
  ],
  "article": [
    "With the best POS system, business owners can transform existing devices, such as smartphones and tablets, into advanced transaction management systems.",
    "Payments can be accepted in seconds, and usually you get the benefit of built-in features like inventory management, transaction history, analytics, and other integrations.",
    "Canadian brand, Helcim POS, is one of the world’s more popular POS systems, styling itself as a \"point of sale system for small retail businesses\".",
    "In our Helcim POS review, we take a close look at how useful Helcim's POS offering is for SMBs. We provide information about everything from the platform’s prices to its main features to help you decide whether it’s the best option for your business.",
    "Firstly, it’s important to note that Helcim charges no monthly fees. But you will have to pay $199 per unit if you need to use a Helcim card reader, and you will be charged transaction fees on top of this.",
    "Helcim POS uses a model that’s quite common among POS software providers. It takes the payment processing fee charged by major credit card companies like Visa and MasterCard and adds a small margin that represents its profits.",
    "The exact fees that you pay will vary according to your customer makeup and the fees charged by the various credit card companies.",
    "You can expect to pay anything from 1.5% + 8¢ to 3% + 8¢ on every retail transaction. Helcim takes 0.3% + 8¢ on retail payments, but this increases to 0.5% + 25¢ on online and manually keyed transactions.",
    "If you do decide to use Helcim, you will benefit from an impressive range of tools that go above and beyond simply enabling you to accept payments. Indeed, the company recently added new easy-to-deploy QR codes, as well as contactless and self-service checkout options.",
    "Inventory management",
    "The inventory management tools are excellent. They are designed to help you keep track of every item in your catalog. Discover which products are selling best, set up automatic alerts for low inventory levels, and ensure that your store runs smoothly at all times.",
    "Analytics, Reporting & Insight",
    "You will also benefit from the analytics tools, which present data that you will be able to use to make informed decisions about your business. This includes in-depth reports about sales trends, best-selling items and combinations of items, and transaction sizes.",
    "Fraud Prevention",
    "To protect your business against transaction risks, Helcim POS comes ready with a Fraud Defender. Fraud Defender stops transactions from questionable accounts by checking for suspicious payment activity. As of February 2021, Helcim have automated this feature for all Helcim POS users.",
    "Employee Management",
    "We were impressed by Helcim’s employee management portal, which enables you to create and manage employee profiles and permissions. With this, you can allocate different employees’ different responsibilities, ensuring that people only access the parts of your system that they need to.",
    "Getting started with Helcim is quite a drawn-out process.",
    "Although there are no initial sign-up fees, you will have to enter many personal and business details, including your operating name, business registration type, tax ID number, and information about your transactions or expected transactions.",
    "Similarly, you can expect to spend some time setting up your Helcim account. You will need to connect bank accounts and payment equipment, create employee profiles, and configure business settings before you can start processing transactions.",
    "Fortunately, the user interface is quite intuitive. Virtually everything that you will need can be accessed via the menu to the left of the screen. Initially, you will also benefit from a few valuable tips to help you get started.",
    "For starters, Helcim POS system has an excellent Support Center containing information about virtually everything that you will need to know.",
    "Discover new resources by browsing the cleverly designed categories, or simply use the search bar to find exactly what you want with the click of a button.",
    "On the live support front, things are also positive. All users can send an email inquiry or speak with a Helcim Guru via a US toll-free phone number.",
    "As a reliable POS service provider with years of experience, Helcim naturally has great security across the board. All users are protected by powerful firewalls that include both intrusion detection systems and intrusion prevention systems.",
    "Ongoing server monitoring is used at all times, and suspicious activity is dealt with immediately. On top of this, all data is backed up to external servers, effectively eliminating the risk of customers losing important information.",
    "User data is also protected by 256-bit AES encryption, which ensures that the data is secure both during transmission and while at rest on Helcim’s servers.",
    "This enables the company to boast Level 1 PCI-DSS compliance, the industry standard for companies working with sensitive payment and personal information.",
    "Helcim POS is built for small businesses across multiple industries. In fact, they claim to process \"billions in transactions every year for thousands of merchants across 800 industries.\" They also list specific POS information for the following industries:",
    "For true customisation, Helcim's Developer API is ideal. Their full payment gateway API lets you add payments to your app or online store and easily pull out the customer data that's most relevant to you. Developers have over 80 API actions to choose from to help create a truly custom POS experience for your business.",
    "As with most modern POS providers, Helcim POS also works across devices. It is Mac and Windows compatible. So, your customers can easily pay for your services whether you are using the Helcim app on desktop, mobile or tablet.",
    "If you business has multiple locations, you might even wish to use all three at once! Thankfully, Helcim POS can handle that, and will sync all your payment data through the cloud. Naturally, this also allows you payment flexibility for mobile and pop-up sales events too.",
    "If you’re looking for a low-fee POS service provider for your retail business, Helcim POS is a great option. However, its ecommerce fees are a little high.",
    "For businesses that mainly sell online, we recommend using Square ecommerce. The majority of transactions will come with a 2.6% + 10¢ fee, which is up there with the best in the market. Additionally, Square POS is an extremely popular and trusted option.",
    "Lightspeed POS is another popular choice, particularly among those looking for an all-in-one business management system. It enables you to use iPads to receive payments, boasts cloud-based data management, and comes with extra analytics, loyalty programs, and other tools.",
    "You might not see Helcim at the top of the most popular POS system lists that often, but it’s a great platform that’s comparable to the major industry leaders nonetheless.",
    "It boasts a suite of tools to help you accept payments and manage your business, has competitive credit card processing rates, and is backed by excellent customer service.",
    "On top of this, the user interface is versatile and powerful yet intuitive and easy to use. All things considered, you would do well to use Helcim for your business, especially if you mainly process retail sales."
  ],
  "headers": {
    "4": "Helcim POS: Plans and pricing",
    "8": "Helcim POS: Features",
    "17": "Helcim POS: Interface and in use",
    "21": "Helcim POS: Support",
    "24": "Helcim POS: Security",
    "28": "Helcim POS: business customisation",
    "32": "The competition",
    "35": "Final verdict"
  },
  "links": {
    "best POS system": "https://www.techradar.com/news/the-best-pos-system",
    "Helcim POS": "https://www.helcim.com/retail-point-of-sale/",
    "Fraud Defender": "https://support.helcim.com/article/general-resources-fraud-preventing-chargebacks-and-fraudulent-online-orders/",
    "Square POS": "https://www.techradar.com/reviews/square-pos-system-review",
    "Lightspeed POS": "https://www.techradar.com/reviews/lightspeed-point-of-sale-pos-review"
  }
}