{
  "source": "https://www.techradar.com/reviews/beats-studio-buds-review",
  "title": "Beats Studio Buds review",
  "category": "audio-visual",
  "updated": "2021-10-25T14:45:10Z",
  "author": "nick-pino",
  "summary": "The best-sounding Beats earbuds... with a few caveats",
  "verdict": "The Beats Studio Buds are easily the best-sounding earbuds Beats has ever made. They’re comfortable to wear and they sound great, plus they support active noise cancellation. Unfortunately, their call quality isn't great and they're missing Apple's H1 Wireless Chip.",
  "pros": [
    "Great sound quality",
    "Comfortable to wear",
    "Active Noise Cancellation"
  ],
  "cons": [
    "ANC could be stronger",
    "Lackluster call quality",
    "No H1 Wireless Chip"
  ],
  "article": [
    "The Beats Studio Buds have been Apple’s worst-kept secret. Star athletes have been wearing them around town, while photos and technical documents about them leaked months in advance; pretty much everyone knew about these earbuds well before their announcement.",
    "And yet, we’re still shocked by just how good they are.",
    "The Beats Studio Buds are rock-solid true wireless earbuds with active noise cancellation and support for Apple’s Spatial Audio with Dolby Atmos format. They sound great, with a lively sound quality that elevates the highs and lows of your music, and feel supremely comfortable to wear for long periods of time.",
    "They're not without some drawbacks, though. Chief among them is their lackluster call quality and lack of an H1 Wireless Chip. Battery life with either ANC or Transparency mode turned on is a little short at only five hours (15 hours with the case), and their noise cancellation isn’t exactly class-leading, either.",
    "That said, these are our favorite Beats earbuds since the Powerbeats Pro elevated the workout earbud form factor in 2019, and offer a decent alternative to the crowned new king of true wireless earbuds, the Sony WF-1000XM4.",
    "The Beats Studio Buds dropped on June 24, 2021 for $149.99 / £129.99 / AU$199.95. That puts them well below the price of any Apple AirPods that have been released to date – especially the Apple AirPods Pro with active noise cancellation that will set you back $249 / £249 / AU$399 – and we like them more than the standard issue AirPods.",
    "However, you might want to pay more for Apple's flagship earbuds – the Apple AirPods Pro – if you're planning on using your earbuds with a number of Apple devices, but the Beats Studio Buds are a surprisingly good value for their price.",
    "Unlike the last true wireless earbuds from Beats, the Beats Powerbeats Pro, the Beats Studio Buds come in a case that's almost as sleek and small as the earbuds themselves. The case is egg-shaped, not unlike that of the new Google Pixel Buds Series-A, and features a single USB-C port on the bottom and a status LED on the front.",
    "Pop it open and you’ll find the earbuds themselves. To pull them out, you pinch on the outer control panel and pull them up. The control panel is raised, and that helps the buds slip firmly into the ear without any over-ear hooks or a fin that pushes against the outer ear. The buds then sit almost flush with the ear, and while you won’t be able to wear them to sleep (they stick out a bit too far for that), they’re still supremely comfortable.",
    "In terms of water-resistance, the Studio Buds are rated IPX4, making them sweat-resistant but not waterproof. That means you certainly can take them to the gym for a quick workout, however, without the earhooks they're a little less secure and the lack of outright waterproofing means that they're certainly not something you should be bringing out to the beach with you.",
    "Inside the box, all you’ll find are a USB-C to USB-C charging cable and additional eartips. Disappointingly, all of the included eartips are silicone instead of foam – and they only come in two extra sizes – but you should have everything you need to get a proper seal.",
    "Beats designed the Studio Buds to work with both Apple and Android phones with just a tap. All you need to do is open the case near either device and you’ll see them pop up on your screen, ready to pair.",
    "Now, that's because the Studio Buds are running a proprietary wireless chip that's not exactly the W1 or H1 Chip we've seen in other Apple earbuds. That's both refreshing for Android owners who haven't been catered to as well in recent years by the Beats brand since its acquisition by Apple and a bit of a disappointment for some Apple users who enjoy features like multipoint pairing with other Apple devices and hands-free Siri.",
    "While that last bit is pretty disappointing, the benefit of the Buds' wireless chip is that it enables Bluetooth 5.2, and support both Find My in iOS and Find My Device in Android. That’s good, because the earbuds themselves are pretty small and, if you get the all-black color, can be pretty easy to misplace if they accidentally drop behind the bed… not that we’re speaking from experience.",
    "Once you’ve got the right fit, it’s time to turn the earbuds on and give them a listen. For our testing, we paired them with an iPhone 11 Pro and turned on Apple Music, which now supports Spatial Audio with Dolby Atmos and Lossless Audio.",
    "While you won’t be able to get the full effect of Lossless Audio with the Buds (Bluetooth compression ruins the lossless nature of the music), you can still use them to play songs with Spatial Audio, and it sounds great. Unlike previous Beats earbuds and headphones that blasted you with thumping bass, the Studio Buds have a lively sound quality that elevates both the high and low end of the mix. The result is toe-tapping, head-bobbing music that doesn’t fatigue you, but engages you for long periods at a time.",
    "As for the noise-cancelling aspect of the earbuds, it’s a great inclusion, and performs moderately well, although Beats still has some work to do to catch up with the likes of Sony and Bose, each of which has years of experience tinkering with the design, processor and noise cancellation algorithm, to make its Buds keep the maximum amount of noise out of your ears.",
    "To that end, it feels like the Studio Buds will be a great office companion – keeping the dull roar of office conversation to a minimum, but likely struggling to be heard over the jet engine on an airplane or the ear-shaking rattles of a subway car. Of course, thanks to lockdown restrictions it’s been a while since we’ve been on either, so that’s something we’ll have to put to the test in the future.",
    "Our other slight issue is that both the battery life and call quality leave something to be desired. They’re only good for five hours per charge, or 15 hours with the case, when you have either ANC or Transparency mode turned on, which isn't awful and certainly falls in line with other noise-cancelling earbuds, but it falls short of class-leaders like the WF-1000XM4 that offer eight hours per charge and another 12 in the case for a total of 20 hours before you need to go back on the charger.",
    "The call quality, similarly, isn't great. It's good enough when you've got them on walking around the house, but take them outside where you've got wind, traffic and other background noise and you'll quickly wish you were wearing another pair of earbuds.",
    "Lastly, they also don’t support wireless charging, which isn’t a deal-breaker, but can be a minor inconvenience if you already have a charging pad setup for your other devices. The good news is that the Studio Buds do support fast-charging, and can get one hour of playback time from just five minutes on the charger."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Price and release date",
    "7": "Design",
    "14": "Performance",
    "21": "Don't buy them if..."
  },
  "links": {
    "Star athletes have been wearing them around town": "https://www.techradar.com/news/beats-studio-buds-has-lebron-james-revealed-the-rumored-wireless-earbuds",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Beats Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "Android phones": "https://www.techradar.com/best/best-android-phones"
  }
}