{
  "source": "https://www.techradar.com/reviews/mochahost",
  "title": "MochaHost review",
  "category": "computing",
  "updated": "2021-10-27T15:43:23Z",
  "author": "mirza-bahic",
  "summary": "Appealing eco-friendly host from the US that may draw you in with its lifelong discount guarantee",
  "verdict": "MochaHost is a likable US-based web hosting provider whose product catalog offers a whole array of hosting-related services capable of meeting various needs. Backed up by a decent performance, 100% uptime guarantee & generous money-back guarantee as well as 24/7 customer support, MochaHost is certainly worth a try. Its cheapest plan is, however, another story.",
  "pros": [
    "A daring 100% uptime guarantee",
    "Complimentary website builder that comes with every plan",
    "Eco-friendly approach to hosting",
    "Free website migration (but with a restriction)",
    "Unbelievable 180-day money-back guarantee"
  ],
  "cons": [
    "Automated backups are not included",
    "Main website feels outdated",
    "The cheapest shared hosting plan is awfully limited"
  ],
  "article": [
    "The story of MochaHost began in 2002 when its future founders perceived a profound need for quality web hosting companies on the market and decided to launch one of their own. Founded in San Jose, MochaHost’s key objective was to strike a balance between “top-of-the-line” services and a pocket-friendly price and, at the same time, cover everything from personal blogs to large businesses.",
    "Today their main office is situated in New York and they seem to be focusing on the domestic market, since all of their data centers are found there, specifically in Chicago. MochaHost chose to name a few features of their data center and these are: UPS backup, diesel generators, tape libraries, day-and-night monitoring, security alarms and hand scanners.",
    "Paying a visit to MochaHost’s main website feels like going back into the past (straight into the early 2000s), both in a good and a bad way. At first it looks a bit overwhelming with all the information it provides and these being written in letters so small it hurts eyes. However, it does provide a lot and we did find our way around rather swiftly. In addition to English, there are several versions of the site in different languages: German, French, Spanish, Italian and Portuguese, and a conversion tool that supports 42 separate currencies.",
    "MochaHost’s website features a blog done in the same (outdated or retro) fashion and filled with informative articles, the latest updates and how-to guides. These guides are written in informal style and feel casual, familiar and friendly yet helpful at the same time. As for social networks, you can follow MochaHost on Facebook and Twitter, although they don’t seem to be particularly active during the last year.",
    "Fortunately, they are notably active when it comes to supporting the safety of the environment, providing and promoting green hosting and eco-friendly approach in general.",
    "Deciding to save the best for the last, we would like to mention MochaHost’s mascot, which seems to draw inspiration from the same source which inspired the idea for the company’s name. Why would a fellow coffee lover name a company after his favorite brand isn’t much of a mystery, but the name of their mascot (or what we like to call it: a cup of brown joy) certainly is. Perhaps it is a heroic “Mochaman” or a cape-less everyday hero called “Coffeehead” who emanates the power of coffee all over the place, filling everyone with caffeine-induced enthusiasm. Whatever it is, since it somewhat resembles the “infamous” Office Assistant going by the name of Clippit (which all who were around at the beginning of 2000 must remember), we are going to call it “Mochitt”.",
    "Even at first glance we can be certain that one thing that MochaHost doesn’t lack are the hosting options on offer. There are three plans at a minimum for each hosting type they provide: shared hosting, managed WordPress hosting, reseller hosting, VPS hosting and for dedicated hosting solutions. Shared, VPS and dedicated servers are available both for Linux and Windows, and the packages dedicated to the latter (as expected) are a bit pricier. Their most budget-friendly shared hosting plan is labeled as “Soho” and it currently starts at €1.58 ($1.94) per month. This plan should bring you a “blazing fast performance”, unlimited disk space, traffic, e-mail and webmail boxes, and an SSL certificate “for life”. However, a free domain registration is granted with two upper grade plans only, as well as a one-click installer.",
    "MochaHost offers a 180-day money-back guarantee, which seems too good to be true. To some extent it is, since it offers a refund only for unused hosting fees based on standard monthly pricing for the package in question. Predictably, this excludes domain registration and other add-ons.",
    "In addition to this, there is a risk-free 30-day guarantee, with which you can get a full refund of your hosting fees if you decide to quit within 30 days after the purchase.",
    "MochaHost accepts more than a few payment methods, including all major credit cards, PayPal, bank transfer and Skrill.",
    "One of MochaHost’s features we would like to highlight is a thing known as a “lifetime discount guarantee”. What it essentially means is that the price you paid for your hosting package will never change. In other words, if you got a discount price in the beginning, you are free to keep it till the end, which is a great news for all deal hunters out there. Anyhow, it’s refreshing not having to keep price hikes in the back of your mind.",
    "Although there is a free website migration policy, it is unfortunately restricted to those whose hosts have equipped them with an industry standard cPanel. If you’re not one of the lucky ones, you’re on your own.",
    "When creating an account with MochaHost, the first step is to select a hosting type, operating system and a plan, and there are a whole lot of them. The next step is choosing a billing cycle, and this is where you’ll be presented with details about the price and the plan’s most prominent features. There, you can choose if you want to be billed every month, three months, six months, a year, two years or three years, which is refreshingly flexible.",
    "One add-on is suggested and it is the “E-mail Spam Filter” which you can include with your purchase for €2.45 ($3.01) for each month. If you choose anything below the six month billing cycle, here is where you’ll notice additional setup fees of €4.10 ($5.03), which is not much but it is worth mentioning nevertheless. After this, you can add another couple of recommended add-ons and proceed to checkout.",
    "To finalize the creation of your account (and your order) you’ll be required to provide MochaHost with a number of standard personal information. Then you’ll set a password, choose a preferred payment method and complete your purchase.",
    "Although MochaHost provides a decent number of control panel options (cPanel, Easy Web Panel, WHM and Plesk), if you decided to get “Soho” (the cheapest plan), you’ll be denied one-click WordPress installers, which is simply unfortunate. The drag-and-drop website builder they provide is easy to use even for those who are a far cry from webmasters, but those with “Soho” won't get it.",
    "Since MochaHost employs enterprise-level data centers (SAS 70 Type II certified, to be specific), we expected nothing less than a flawless speed performance. Fortunately, after examining the speed of MochaHost’s main website with the much appreciated help of GTmetrix, that’s pretty close to the results we got. Loading the site took mere 1.5 seconds, which looks even better in comparison to the average result of 8.1 seconds. And after taking all metrics into account, GTmetrix rated the speed performance with an A (92%), which is pretty near perfect.",
    "MochaHost guarantees an incredible 100% of uptime, and promises to give credit or provide a month of free service to all those who experience any downtime. The type of compensation users are entitled to depends on the duration of this inconvenience. In any case, this isn’t something you should be overly concerned about, since an uptime test (provided by UptimeRobot) that monitored MochaHost’s main website for a month revealed a sum of 19 minutes of downtime, which equals a 99,95% of uptime. Luckily, for this, we are entitled to some credit to help us cope with the downtime our website experienced.",
    "Like most established web hosting companies of this trade, MochaHost takes the question of customer support rather seriously. In addition to its conventional knowledgebase, MochaHost also features a “Support Portal'' which is packed with step-by-step guides and a range of tutorial videos among other things. The guiding voice is awfully robotic and monotonous in a sleep-inducing way, but it is also helpful, brief and goes straight into the heart of the matter.",
    "Although MochaHost's knowledgebase is filled with a sufficient number of useful articles that are nicely organized into all relevant categories, the letter font is microscopic. Going through the articles felt like trying to decipher a package insert for a prescribed medication.",
    "Besides this, you can get in touch with MochaHost’s support team by live chat, support ticket and toll-free telephone (which is available via callback). Of all available support methods, only chat is available around-the-clock.",
    "Both MochaHost and MilesWeb try to cover all their users' needs and still give them a lot of bang for the buck. They are both major players, MochaHost specifically in the US and MilesWeb on the Indian subcontinent. However, while MochaHost leaves an impression of an honest provider with transparent pricing and price-lock with its lifetime discount guarantee, MilesWeb and its dubious marketing practices may feel like being on a shaky ground.",
    "HostGator is MochaHost’s fellow US-based rival with data centers found within the borders of the USA. With a full range of hosting options and features, competent support and pricing, both of them can offer a bit of something to fit everyone’s needs. However, since HostGator offers one-click installations (WordPress included) with all of its plans (even the entry-level one) and MochaHost doesn’t, newcomers should check out Hostgator first.",
    "Although Leaseweb has been around longer, MochaHost is still able to provide more pocket-friendly packages. Leaseweb is more aimed at bigger businesses, while MochaHost has hosting solutions that would attract users with simpler needs as well. In addition, MochaHost lays down an incredible 180-day money-back guarantee, while Leaseweb offers none.",
    "Bluehost and MochaHost are both suitable for newcomers and veterans alike, although neither host is without its flaws. With MochaHost’s cheapest plan you won't get as many valuable features as with Bluehost. On the other hand, unlike Bluehost, MochaHost won’t surprise you with price spikes after the initial period, thanks to its lifelong discount guarantee.",
    "Although not without flaws, MochaHost is a likable host with a full range of hosting options, decent number of features and some rather unique selling points. A lifelong discount guarantee, an unlimited SSL certificate, a 100% uptime guarantee and green-powered hosting are all good to have, and together with a remarkable 180-day money-back guarantee, you are well-advised to put them to the test with no concerns.",
    "The only thing you could (and should) skip without a hitch is a shared hosting plan called “Soho” since its existence seems almost pointless. By going for the next plan and paying a little bit more, you can get a much better deal. Alternatively, if you really want to save for the rainy days, you can make yet another step ahead and check out entry-level plans from other hosts like HostGator and Bluehost before making a definitive decision."
  ],
  "headers": {
    "6": "Plans and pricing",
    "10": "Ease of use",
    "16": "Speed and experience",
    "18": "Support",
    "21": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "MochaHost": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2910328745047510500&xs=1&url=https%3A%2F%2Fwww.mochahost.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmochahost",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "managed WordPress hosting": "https://www.techradar.com/news/best-managed-wordpress-hosting",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "Soho": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1277953957913552600&xs=1&url=https%3A%2F%2Fwww.mochahost.com%2Fwebhosting.php&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmochahost",
    "MilesWeb": "https://www.techradar.com/reviews/milesweb",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Leaseweb": "https://www.techradar.com/reviews/leaseweb-hosting",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}