{
  "source": "https://www.techradar.com/reviews/nexvoo-nexpod-n109",
  "title": "Nexvoo NexPod N109 review",
  "category": "cameras",
  "updated": "2021-04-08T16:00:10Z",
  "author": "mark-pickavance",
  "summary": "Simple to deploy conferencing camera",
  "verdict": "The Nexvoo NexPod N109 offers easy to manage AI-controlled camera for group conferencing. But as it only offers 1080p video and digital zooming, some cheaper 4K webcams can look better to those admiring the stream from a distance.",
  "pros": [
    "Driverless",
    "Can be powered by USB",
    "Powerful speakers",
    "Cheap-ish"
  ],
  "cons": [
    "Lacks remote management",
    "Video quality issues",
    "No remote included"
  ],
  "article": [
    "We recently reviewed a personal conferencing device from Nexvoo, the Nexpad, and now we bring you the NexPod for meetings that have better attendance than just one person.",
    "The NexPod comes in two versions, the high end 4K capable N149 and the 1080p N109 that we are covering today.",
    "This device is meant to sit at the end of a meeting table and provide a digital window into that world for those connecting remotely. And, so everyone can concentrate on the purpose of the meeting, it contains AI to manage the camera controls.",
    "With many equivalent products trying to cut a slice of the enlarged conferencing pie, is the NexPod N109 a smart enough option to grace your conference table?",
    "The Nexvoo NEXPOD™ N109, costs $249 directly from the makers here.",
    "Its 4K camera brother, the higher resolution N149, costs $399, almost twice the price.",
    "At this time, the Nexvoo products are only available direct from the makers, and therefore the quoted price is fixed.",
    "These devices seem to fall into a narrow spectrum of design possibilities depending on if they are meant to be used in conjunction with a TV or not. Those that tend to be short and wide and those like the N109 are tall and narrow.",
    "The immediate concern is that if you wish to use this with a TV is where to put it, since standing 275.5 mm high (10.85 inches) it would obscure the picture if the TV weren’t elevated above this level.",
    "In the box is the N109, a 1.8m (5.9 ft) USB cable that is USB-A at the computer end and USB-C at the N109. And, also with ours was a Nexvoo branded power adapter, which turned out to be unnecessary since the unit will work with the power it gets from USB.",
    "We assume the PSU might be helpful if you have a laptop with limited USB voltages or reduce the battery consumption of a portable device.",
    "Getting the N109 operational is merely a matter of plugging it into a suitable computer and running a conferencing tool, like Zoom, Skype or whatever.",
    "To those tools, the N109 appears as a camera and speaker combination, and control from the computer side is minimal. Some applications allow video quality choices, but many do not.",
    "The bottom 60% of the N109 is the speaker cover, and the drivers mounted under this are quite powerful, we noted. It would need to be a very long meeting table for the sound not to be clearly audible to everyone in the room, and most users will undoubtedly dial the volume back in most circumstances.",
    "On top of the column are some touch-sensitive controls that can adjust volume, including mute and a button to enable/disable the AI camera control.",
    "Visual colour cues are provided as to the status of the N109 with an illuminated band between the upper and lower sections and two LEDs just below the camera.",
    "The band is white when the device is first powered, blue in standby mode and red if the microphone is muted. The top LED shows green if the camera is on, and the bottom LED is blue if the microphones are on and red if muted.",
    "This overlap in LED functionality is a bit odd, and it would have been better had they just made the band video related, and a single LED for audio.",
    "For those wondering how they control what the camera looks at, those aren’t manual mechanisms on this device.",
    "If the AI is on then, it will decide what to zoom into or pull back from based entirely on the amount of movement and who is speaking. When it isn’t enabled, the full 110 degrees of vision is presented in the direction that the N109 is facing.",
    "The thinking here is that if it messes up, you can at least disable it.",
    "There are similarities between how the N109 works and other conference cameras we’ve seen recently.",
    "Most use an ARM processor to process the images in real-time and determine where the interest should be focused.",
    "If no one is speaking, the full field of view is presented. Once someone starts to talk, the system determines which of the heads is the speaking one and brackets the shot on them.",
    "And, once they stop or someone else talks, the system will either move to them or back to the group shot.",
    "How well this works can be something of a lottery. In testing, we experienced one person speaking, but the system picked the person seated alongside them for ‘star billing’.",
    "No AI system is infallible, but we’d hate to be using this and discover it assumed we were part of the wallpaper, literally.",
    "What’s important to realise about the zoomed shots is that the camera cannot move or optically zoom, so what you see is merely is a cropping of the video image. And, as the full image is only 1080p resolution at best, these close-ups might look decidedly soft if you record the meeting.",
    "We also ran into some problems was in respect of the video resolution that N109 claims to offer.",
    "Confusingly the Nexvoo website lists 4K video as a feature of this device, But we’re convinced that’s a typographical mistake as the included small Quick Start Guide states that it is capable of FHD 1080P at 30 fps or HD 720P at 30 fps.",
    "But the deeper we looked revealed that those numbers don’t tell the whole story.",
    "Using Zoom as an example; the only video controls available are to enable HD and original aspect ratio. Ticking HD resulted in a recording that was only 720p (1280 x 720), and the framerate was only 25 fps. Without this option ticked, quality dropped to 640 x 360, again at 25 fps, and that was a different aspect ratio than the 720p capture.",
    "Assuming either we’d made some issue or that Zoom didn’t deliver the full potential of the product, we switched to Microsoft Teams (Desktop Application) and recorded video with it.",
    "The results were perplexing, as the file was in 1080p, but the video looked like 640 x 360 (360p), and the framerate was only 8fps.",
    "In a final attempt to discover the truth, we launched the Windows 10 Camera App, and which recorded video in a wide range of resolutions that included 1080p, 768p, 720p, 480p, 448p, 360p and 240p, all in 30 fps.",
    "We're unsure why Zoom and Teams ignored the best quality the camera can do, but buying this device and assuming 1080p recordings might be an unwise assumption.",
    "It is indeed a 1080p camera, but getting that quality recorded from some conferencing tools might be a challenge. At the time of writing, no guidance is provided on the Nexvoo website.",
    "We have no complaints about the sound recording. It’s only a mono track on the recordings, but it is very clear, and the system doesn’t suffer from any playback echoes.",
    "This device is much cheaper than many of the sound-bar style conferencing solutions we are seeing, but most of those have 4K cameras.",
    "A device that offers the same 1080p camera and the tower form factor is the Logitech Conferencecam Connect, a product that typically costs $499. But for the extra money, the Conferencecam Connect comes with a remote that can control the camera focus and wireless screen mirroring.",
    "A cheaper alternative to the Logitech is the PTZOptics HuddleCamHD GO, another tower camera with the same 110-degree FOV, costing $299. Not as cheap as the Nexvoo NexPod N109, though it comes with a remote.",
    "For those looking for an even cheaper option, Tenveo has a Conference Room Camera that offers 1080p on a pan and tilt head and a remote for just $219. That model doesn’t zoom, but the Tenveo’s TEVO-VHD3U costs $279 and has an optical 3X zoom, avoiding digital zoom blockiness.",
    "Most conference cameras around the price of the N109 don’t have AI to control the camera. Instead, they usually offer manual control via an included remote control.",
    "If the AI works flawlessly, it is preferable, but on occasion, being able to control it might also be helpful.",
    "Conceptually the NexPod N109 looks like a practical device, even if video performance is only marginally better than a typical laptop webcam.",
    "What it has going for it is that the angle of the view and height above the table has been optimally set to provide a good view if the N109 is placed at the end of a long table.",
    "Therefore, it’s effortless to deploy for those who aren’t Film and TV graduates and would just like their streamed meeting to be straightforward.",
    "The AI that’s been used works most of the time, and if it takes an odd dislike (or like) to an attendee, it can be shut down quickly with a single button press.",
    "The major weakness of this design is the 1080p camera, a resolution that is lower than most budget mobile phones offer on their rear sensor.",
    "As this video is destined to be streamed, that wouldn’t normally be an issue. But it becomes one once the AI is made active and the system uses digital zoom. Then you end up with people talking at 480p, 360p or even 240p. 4K cameras have much more leeway to make this approach work since the zoomed versions will often be 1080p or 720p.",
    "If you can live without the AI-controlled zooming, a good quality USB webcam and some external speakers could offer a similar experience for less.",
    "What Nexvoo badly needs to do is better explain what to expect with this product with the various streaming solutions and also provide some FAQ support via its website.",
    "Corporate customers expect to have this information handy when making a purchasing choice, and it is all but invisible on the Nexvoo website."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design",
    "21": "In use",
    "38": "Competition",
    "44": "Final verdict"
  },
  "links": {
    "here": "https://nexvootech.com/teampod-by-nexvoo-n109/"
  }
}