{
  "source": "https://www.techradar.com/reviews/proscenic-t21-air-fryer-review",
  "title": "Proscenic T21 air fryer review",
  "category": "appliances",
  "updated": "2021-04-16T11:36:23Z",
  "author": "carrie-ann-skinner",
  "summary": "A smart air fryer that can be controlled via Alexa",
  "verdict": "The Proscenic T21 air fryer is expensive, but it can bake, grill and roast as well as air-fry, producing evenly browned chicken wings and fries faster than a conventional oven. Wi-Fi connectivity enables remote control through your phone, while Alexa integration means you can use voice commands to whip up a batch of fries.",
  "pros": [
    "Easy to clean",
    "Speeds up cooking time",
    "Connects to Wi-Fi and can be controlled from your phone"
  ],
  "cons": [
    "Bulky and takes up a lot of countertop space",
    "Results weren’t evenly browned",
    "Recipe app only works if air fryer is connected to Wi-Fi"
  ],
  "article": [
    "The T21 air fryer is the first kitchen appliance from Chinese brand Proscenic, whose focus until now has been cordless vacuum cleaners. Sporting a squared-off design, favored by rival air fryer, Instant Vortex, its sleek black exterior looks smart. As well as air-frying, the Proscenic T21 can bake, grill and roast, too. It can even keep any dish cooked in the air fryer warm for up to two hours once cooking is complete.",
    "The air fryer uses hot air to cook everything from fries to chicken wings, with the concentrated heat resulting in cooking times that are far shorter than those of a conventional oven. You’ll need to add a little oil when cooking items in the T21, but according to Proscenic, it’s around 80% less than that used when deep-frying, which makes it a much healthier option. Its 5.8 quart / 5.5 liter capacity makes it suitable for larger families.",
    "Cooking time and temperature can be manually controlled, while eight handy presets with set temperatures and times include options for cooking fries, pizza, shrimp and even cake.",
    "The Proscenic T21 can also connect to your home Wi-Fi network, and using the app you can remotely switch the air fryer on or off, adjust the temperature and cooking time, choose a preset, and even schedule a turn-on time (although, of course, you’ll need to have left the food in the cooking basket ready to go). On enabling the Alexa skill, you’ll even be able to use your voice to control the Proscenic air fryer.",
    "The Proscenic T21 is priced at $119.95 / £119.99 / AU$269, and is available worldwide from Amazon and Proscenic’s own website in the US and UK.",
    "This is the first air fryer from a brand that has its roots in cordless vacuum cleaners, and is priced in the region of the Instant Vortex Plus air fryer from multi-cooker behemoth, Instant Pot.",
    "The Proscenic T21 air fryer is slightly smaller than rival Instant Vortex Plus, but measuring 12.4 x 12.4 x 12.8 inches / 31.4 x 31.6 x 32.6cm (h x w x d), it takes up plenty of countertop space. A 5.8 quart / 5.5 liter capacity means it holds slightly less than the Instant Vortex Plus, but it could easily accommodate the usual quantity of fries and chicken wings we use for testing air fryers.",
    "The T21 sports a similar square shape to its rival, with a square frying basket, too. The basket sits in a plastic holder, and the two sections must be clipped together before being inserted into the air fryer. To separate the two for ease of serving, simply press the button on the top of the basket’s handle. Both the crisper basket and the basket holder are dishwasher-safe, so easy to clean, while any splashes or smudges on the black plastic exterior can be wiped down with a damp cloth.",
    "As we’ve already mentioned, alongside the ability to air-fry, the Proscenic T21 can bake, grill and roast. The LED display offers touch controls to adjust the temperature and time, and includes eight presets for cooking everything from fries and pizza to cake, bacon and even steak. A keep warm function maintains a temperature of 170F / 76C for up to 120 minutes, with the air fryer reaching a maximum temperature of 400F / 204C and can cook for up to one hour at a time.",
    "The T21 comes with a recipe booklet that includes a handful of recipes, but connecting to the app via Wi-Fi provides access to many more. Note that there’s no search facility, though; instead, you’ll have to scroll through categories such as meat, deserts and vegetables.",
    "The Proscenic T21 air fryer didn’t disappoint with its cooking skills, but it didn’t wow us either. The homemade fries, which required 1tbsp of oil for 1.1lb / 500g according to the recipe booklet, were evenly browned and looked appetizing enough, but they didn’t deliver the desired crunch on biting into them. It was a similar experience with chicken wings; they were browned – although not to the caramel color achieved by the Instant Vortex Plus – but the skin wasn’t crisp. The meat was still succulent, however.",
    "Like many of the best air fryers, the T21 did speed up cooking times: the chicken wings were ready in under half their usual time; but the frozen fries took slightly longer than the 15 minutes we anticipated. The latter required an extra five minutes to become evenly browned and crisp.",
    "The audible and visual alert on the completion of cooking is handy, although we were disappointed by the lack of a reminder to turn or shake the food partway through cooking (this ensures items are evenly browned). There's also a delay function that means you can set the air fryer to start cooking at a set time, but the food will need to be left in the frying basket.",
    "Like most air fryers, the T21 does make noise during cooking, measuring in at 66db through our sound-monitoring app. This is the equivalent of a washing machine running its spin cycle, so although acceptable, the Proscenic is the loudest air fryer we’ve tested to date. Note that the front of brushed stainless steel frying basket did become as hot as 30C during testing, so we’d advise using this kitchen appliance in an area with plenty of space, to avoid accidental contact during use."
  ],
  "headers": {
    "4": "Proscenic T21 price and availability",
    "6": "Design",
    "10": "Performance",
    "14": "Don't buy it if..."
  },
  "links": {
    "Instant Vortex": "https://www.techradar.com/reviews/instant-vortex-air-fryer",
    "best air fryers": "https://www.techradar.com/news/best-air-fryer"
  }
}