{
  "source": "https://www.techradar.com/reviews/people-trail",
  "title": "People Trail review",
  "category": "computing",
  "updated": "2021-03-21T10:00:53Z",
  "author": "jacob-parker",
  "summary": "A simple background check tool with a handful of unique features",
  "verdict": "Utah-based People Trail is a handy tool that you can use to perform comprehensive background checks on potential hires.",
  "pros": [
    "Unique social media search tool",
    "One-time searches and business partnerships available"
  ],
  "cons": [
    "Pricier than some competitors",
    "No gun and vehicle ownership searches"
  ],
  "article": [
    "Founded in 1994, Utah-headquartered People Trail is one of the best background check services you can use today. This fast and easy-to-use platform enables you to quickly find out if a prospective employee has any felonies or misdemeanors on their record. The company holds accreditation from the Professional Background Screening Association (PBSA) and can even check traffic offenses and civil case records for you.",
    "As you’ll find out in this People Trail review, the service sets itself apart from the crowd with extra social media searches and by adding a human element to each background check. This approach enables People Trail to develop customized solutions for each business it partners with.",
    "There are multiple ways to access People Trail’s background checks. First off, you can partner with the service and perform dozens of checks every year, covering every hire you make. Pricing for subscribers is available by quote only. To get a figure, you’ll need to indicate the size of your company and the approximate volume of background checks you need annually in a phone call or via a quote request form.",
    "Alternatively, you can purchase a standard background check package and perform a one-time People Trail record search. These vary from the basic $19.95 Bronze package to a top-of-the-line $59.95 Gold search service. More expensive People Trail packages come with extra verification procedures and additional database searches. Custom and social media background checks are also available.",
    "People Trail is packed with features, but you’ll only get access to those included in the specific package you purchase. The Bronze plan, for example, comes with a basic AIS criminal database primary name search without verification. By contrast, with the Gold package, your search will be verified and People Trail will also sweep additional databases including the FBI Most Wanted List and OFAC Terrorist Watch-List.",
    "No matter which standard People Trail plan you go for, you’ll get social security number verification along with address history vetting.",
    "People Trail’s Social Media Background Check package has its own, independent feature set. It includes searches of major platforms—such as Facebook—along with automated hate speech, bullying, and obscene language detection.",
    "The People Trail site interface is simple and easy to get the hang of. Requesting a background takes just a couple of minutes. Once you’ve decided which package to use, add information about the person you want to request a check on.",
    "After you’ve provided details such as their date of birth, social security number, and phone number, you can submit your form and then pay for the check. Depending on the type of search you’ve requested and how the relevant data is stored, your report should be delivered to you by email within 72 hours.",
    "If you run into any issues or have any questions about the People Trail system, you can turn to the company’s detailed knowledge base. Here, you’ll find sample reports, case studies, and compliance advice. Go over these resources carefully to ensure that you request the right type of background check for your industry.",
    "In case you can’t find the answer you’re looking within People Trail’s knowledge base, you can reach out via phone or email and staff members are on hand during standard MST working hours.",
    "According to the business’s privacy policy, People Trail keeps its site secure by periodically examining log files for faults or failures. The company states that all confidential information it stores and transmits will be encrypted, but doesn’t go into detail about the precise protocols used.",
    "Although People Trail isn’t overly forthcoming regarding security details, there’s no reason to question the company’s credentials as it has a certification from TruSecure, a well-known security and compliance service.",
    "Instant Checkmate is a background check service that’s in direct competition with People Trail. It’s a better option if you need extra information such as vehicle and gun ownership licenses. However, Instant Checkmate does charge a monthly subscription rather than a one-time fee, so it’s not as suitable for single checks.",
    "If you’re looking for a more affordable premium background check provider, you might want to consider ClearChecks. The top-tier ClearChecks ClearHire Complete package is $39.99, nearly $20 cheaper than People Trail’s $59.95 Gold package. Both plans offer many of the same core features such as a 7-year county criminal record search and international watch list sweeps.",
    "There’s plenty to be said in favor of the People Trail background check service. The platform is trustworthy, extremely easy to use, and has a quick report turnaround. One of the standout parts of the People Trail service is that the company can uncover important records other services would miss, such as social media hate speech."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "7": "Interface and in use",
    "9": "Support",
    "11": "Security",
    "13": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "People Trail": "https://www.peopletrail.com/",
    "best background check services": "https://www.techradar.com/best/background-check-services-sites-online",
    "Bronze package": "https://www.consumercredentials.com/pricing/",
    "Gold search": "https://www.consumercredentials.com/pricing/",
    "Social Media Background Check package": "https://www.consumercredentials.com/social-media-background-check/",
    "Instant Checkmate": "https://www.techradar.com/reviews/instant-checkmate"
  }
}