{
  "source": "https://www.techradar.com/reviews/dispostable-temporary-email",
  "title": "Dispostable temporary email review",
  "category": "computing",
  "updated": "2021-07-02T14:30:36Z",
  "author": "daniel-blechynden",
  "summary": "Anonymous temporary email",
  "verdict": "Despite its overly simplistic user interface and absolute lack of advanced tools, Dispostable is a useful tool for those looking for a basic anonymous temporary email address.",
  "pros": [
    "Very simple and easy to use",
    "No sign-up required"
  ],
  "cons": [
    "Anyone can access any inbox",
    "No advanced tools or management features"
  ],
  "article": [
    "With the best secure email providers, you can send sensitive information in a safe and secure manner. There are numerous options on the market, but the industry leaders share a few important features—some form of encryption, anonymous signup, zero-access policies, and strong privacy tools.",
    "In our Dispostable review, we take a close look at this temporary email service. By analyzing the company’s pros, cons, main features, and more, we aim to help you decide whether or not it’s a good option for your business.",
    "Dispostable is 100% free, forever. You won’t ever be asked to upgrade to a premium subscription, and all tools can be accessed without spending a cent. On top of this, the platform won’t force unwanted ads on you, which is a nice change from most similar free providers.",
    "In saying this, it’s important to note that Dispostable doesn’t offer any advanced tools or features. It only provides very basic anonymous email services, which are quite useful if you don’t want to use your normal email address to sign up for a service or receive a message from someone.",
    "Dispostable enables users to generate and use temporary email addresses. It’s a very simple platform, and anyone can access any inbox by simply entering the address. As a result, it’s not the best choice for those dealing with sensitive or private information.",
    "Unfortunately, there are few noteworthy features to speak of. Email management and organization tools are virtually non-existent, and you can’t do much more than view and delete messages.",
    "Although the platform states that messages will be deleted after two days (if unread) or two months (if read), this doesn’t appear to be a hard and fast rule, Luckily, it’s very easy to manually delete emails, by simply hitting the small trash can icon next to a message in your inbox.",
    "To get started with Dispostable, you simply need to select a temporary email address, enter it on the site’s homepage, and follow the prompts to access the associated inbox. Then, use this email address for whatever purpose you require and wait for your email to arrive.",
    "The inbox itself is very basic, but it’s easy to navigate and contains the base-level tools you need to receive anonymous emails. There’s a neat button at the top of the page that you can click to ensure new messages are continuously scanned for. With this clicked, you will be notified as soon as a new email arrives.",
    "To access a new message, simply click on it. You will need to pass a reCAPTCHA test to verify that you’re human, and then you will be able to view the message and its content. Once again, though, things are quite simple.",
    "There aren’t any tools to help you organize your messages, and anyone with your email address can access them. Due to this, it’s a good idea to get into the habit of deleting your messages as soon as you’re finished with them.",
    "Unfortunately, Dispostable provides little in the way of customer support. There’s a small Contact button on the bottom of every page, but this simply links to an email address. You can reach out to the team via email, but phone and live chat are completely absent.",
    "There aren’t any self-help guides, tutorials, or other resources, either, which isn’t great. However, the platform is very simple, so we really don’t think that you will have too many problems.",
    "Dispostable provides no information whatsoever about its security practices. This is a little concerning, particularly for those who want to use it to receive sensitive information.",
    "There is a small message at the bottom of each page that states that unread messages will be deleted after two days and read messages after two months. However, this didn’t actually appear to be the case, as we came across numerous messages that were up to 12 months old. Because of this, we would suggest manually deleting emails once you’re done with them to reduce the risk of a privacy breach.",
    "Although it’s touted as a secure email provider, Dispostable’s service is quite limited. It’s useful for receiving one-time messages that you don’t want to be sent to your normal email account, but that’s about all.",
    "If you’re looking for a true secure email service, ProtonMail is right up there with the best we’ve seen. It boasts a great selection of features, including end-to-end encryption, a zero-access guarantee, and self-destructing messages.",
    "GuerrillaMail is another neat option for those looking for anonymous temporary email addresses. It offers a similar service to Dispostable, but it’s available in 15 languages, and messages are automatically deleted after just one hour.",
    "All things considered, Dispostable provides decent anonymous email services, but it certainly doesn’t offer anything too fancy. It enables you to receive messages to a temporary email address, but there aren’t any advanced tools or features to speak of.",
    "On top of this, Dispostable provides absolutely no information about the security practices it employs. Support is limited, and anyone with an inbox’s address can access your emails. Really, there’s nothing here that’s unique to the platform or that makes it stand out above its competitors.",
    "The bottom line: Dispostable is a fully functional temporary email platform, but it doesn’t offer anything more than the absolute basics. There aren’t any issues with using it if that’s all you need, but don’t expect to be able to do anything more than receive and read emails."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "7": "Interface and in use",
    "11": "Support",
    "13": "Security",
    "15": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "best secure email providers": "https://www.techradar.com/best/best-secure-email-providers",
    "Dispostable": "https://www.dispostable.com/",
    "ProtonMail": "https://www.techradar.com/reviews/protonmail-secure-email",
    "GuerrillaMail": "https://www.guerrillamail.com/"
  }
}