{
  "source": "https://www.techradar.com/reviews/amazon-echo-wall-clock-review",
  "title": "Amazon Echo Wall Clock review",
  "category": "smart-home",
  "updated": "2021-06-23T11:17:22Z",
  "author": "gerald-lynch",
  "summary": "Count down the seconds with Amazon’s Echo Wall Clock",
  "verdict": "The Amazon Echo Wall Clock is a solid timepiece – just don’t expect it to be much more than that.",
  "pros": [
    "Easy to set-up",
    "Inoffensive design",
    "Works as advertised"
  ],
  "cons": [
    "Relatively few features",
    "No speaker or mic"
  ],
  "article": [
    "Not content with filling your house with Echo speakers and Fire TV Sticks and Cubes, Amazon’s connected ecosystem has recently expanded to take in other sorts of household goods. From literal TVs to microwaves, one of the more intriguing Alexa-enabled gadgets is the Amazon Echo Wall Clock.",
    "Helping to visualize your Alexa-set timers and alarms, it’s a physical extension of what Amazon’s voice helper can do.",
    "But is there much that can be added to a wall-hanging timepiece by linking it to other web-connected gadgetry? It appears not – though that’s not to dissuade the Alexa-loving masses from giving it a look.",
    "UPDATE: Amazon recently launched a Disney Mickey Mouse Edition of the Amazon Wall Clock featuring the iconic animated mouse on the front, with Mickey’s arms doubling as the clock hands that rotate around the clock face to indicate the hours and minutes. It's available now in the US and UK priced at $49.99 / £49.99.",
    "The Amazon Echo Wall Clock is available now, priced at $29.99 / £29.99 / AU$49. There’s very little other than regular clocks to compare that pricing to, and with a clock as much a design piece as a functional item, prices vary widely. But, over an average, basic wall-hanging clock, the Echo Wall Clock does represent a bit of a mark-up.",
    "As we've already mentioned, in the US and UK, there's also a Mickey Mouse edition that's priced at £49.99 / £49.99. Unfortunately, this version isn't currently available in Australia.",
    "Have you ever seen a clock? Yep, we thought so. The Amazon Echo Wall Clock looks just like one, too. There’s very little in the way of frills or design flourish here – about the size of a dinner plate, it has white numbers placed on a black face, with white hands and a white plastic frame. Note that it doesn’t have a clear plastic cover over its face, so you might find it gets a bit dusty on the inner lower edge over time.",
    "Powered by four AA batteries (which should last a few months at least), the Amazon Echo Wall Clock sets itself apart through its use of LEDs. 60 light notches sit around the edge of the face, marking seconds and minutes, which light up when you set a timer on a connected Alexa device, and count down by dimming accordingly. There’s also a blue-ish light above the ‘6’ on the bottom edge of the clock to note connectivity. A pairing button on the rear aside, and that’s it.",
    "Sensibly, then, it’s a clock first, and a gadget second. By being about as generic in style as is imaginable, the Amazon Echo Wall Clock will suit practically all decors.",
    "Despite an early connectivity glitch that caused Amazon to temporarily halt sales of the Echo Wall Clock shortly after its release, the Echo Wall Clock now works like a charm.",
    "Pop the batteries in, say to your Alexa device “Alexa, set up my Echo Wall Clock”, and you’ll be prompted to push the pairing button on the rear, which triggers its Bluetooth connection. The clock then sets its hands to the correct time automatically, including taking daylight savings time into account.",
    "And that’s it – you’re good to go. There’s a screw and plastic anchor included for wall mounting in the box too – just make sure you’ve paired the clock before attaching it to your wall.",
    "It’s worth noting, however, that the Amazon Echo Wall Clock is currently only compatible with Amazon’s own Echo speaker line. If you’ve got a Sonos One, or a Fire TV Stick with voice control, for instance, they won’t be able to get the clock working properly. So if you don’t have an Amazon-branded speaker, you’re out of luck here.",
    "It tells the time – do you really need a clock to do much more than that? No, but the Amazon Echo Wall Clock has at least one more trick up its sleeve. Ask your Amazon Echo speaker to set an alarm, and the paired Echo Wall Clock will light up its LEDs to match the timer in seconds and minutes. Once an alarm is up, the whole ring of LEDs around the clock face will pulse with white light.",
    "The clock can track a second timer too, with the longer timer’s light trailing the faster one around the edge of the clock.",
    "That’s it – but it’s also all it ever claimed to do, and it does it well enough. There’s a slight delay between sending the command to your Alexa speaker and seeing it visualised on the Wall Clock, which may frustrate those tracking, say, short bursts of exercise. But for the majority of people, it’ll work just fine.",
    "Apart from those with hearing impairments however, it’s hard to see who will benefit from the additional visual elements of the Echo Wall Clock. As it has no mic or speaker of its own, it can’t stand alone in a room, and so will likely be placed near an Amazon Echo speaker. And as the speaker offers audible feedback for timers as they complete anyway, a flashing clock might just prove to be overkill.",
    "The Amazon Echo Wall Clock does exactly what it says on the tin – it tells the time, and visualises timers set by an accompanying Amazon Echo speaker device.",
    "If that’s all you need, then job done – it nails it, being easy to set up in seconds, and making for a neat Echo accessory.",
    "But it’s hard to not feel like a little more ambition here would have benefited the device. Perhaps a mains-powered clock, that doubles as a standalone Echo Speaker? Or perhaps not – the Echo Wall Clock does all it needs to, and perhaps anything else would make for something akin to those bizarre two-in-one toaster radios that were once chic.",
    "Still, this is early days for the expanded Amazon Echo ecosystem, and we’re looking forward to the increasingly adventurous products that will likely follow in its wake."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "9": "Performance",
    "17": "Verdict"
  },
  "links": {
    "Echo speakers": "https://www.techradar.com/news/the-best-alexa-speakers",
    "Fire TV": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Cubes": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "literal TVs": "https://www.techradar.com/news/first-look-jvc-fire-tv-edition-4k-hdr-tv",
    "microwaves": "https://www.techradar.com/news/amazons-next-shipment-of-alexa-devices-includes-a-new-amazon-echo-dot",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020"
  }
}