{
  "source": "https://www.techradar.com/reviews/hoka-one-one-bondi-x",
  "title": "Hoka One One Bondi X review",
  "category": "fitness",
  "updated": "2021-12-03T15:13:52Z",
  "author": "matt-kollat",
  "summary": "The carbon-propelled Hoka One One Bondi X is a chunky yet snappy long-distance running shoe",
  "verdict": "The Hoka One One Bondi X marries comfort with responsiveness to create the ultimate Hoka running trainer. This max cushioned shoe features an embedded carbon plate for extra propulsion and enjoys going the distance. It might not be the lightest of running shoes, but despite the heft, the Bondi X won’t weigh you down. It could be a bit cheaper, though.",
  "pros": [
    "Responsive ride",
    "Mesh upper is comfortable",
    "Looks snazzy"
  ],
  "cons": [
    "A bit chunky and heavy",
    "Expensive"
  ],
  "article": [
    "The max-cushioned Bondi X is a bulky running shoe, but despite the size, it provides a snappy ride thanks to the embedded carbon plate, a new addition to the Bondi line. The full-size moulded EVA midsole is just the icing on the cake and further enhances the responsiveness of the shoes.",
    "The mesh upper also received an update, and now uses 'hotmelt 3D yarns' to reduce weight and increase ventilation in the shoes. However, wearing the Bondi X feels familiar and reminiscent of Hoka shoes of the past, particularly the Carbon X 2 and Rocket X. In a good way, of course.",
    "The larger-than-life look of the Bondi X might put off some of the more diehard runners; people either love or hate Hoka’s chunky running shoes. Fans of the brand will appreciate the vibrant colours and funky looks of the shoe, though.",
    "The Hoka One One Bondi X was released in September 2021 and is available to buy now at Hoka and selected third-party retailers such as sportsshoes.com for a recommended retail price of $200 / £180 / AU$349.95.",
    "The Bondi series has always been one of the more whimsical franchises in the Hoka lineup and the Bondi X carries this ethos in its design. The chunky bottom unit dominates the view; it’s wider than your average Hoka, but features the original cushioning and curvy lines we expect to see in Bondi shoes.",
    "The sizeable foam underfoot not only provides a safer platform to land on but also something to look at, too. The silhouette of the compression-moulded EVA midsole – the main supplier of that ‘mega cushioned’ feeling – is visible on the side of the shoes. Just follow the blue line and you’ll find it.",
    "The 3D Hotmelt yarns-infused breathable mesh upper is said to allow more airflow in the shoes which is great as the Bondi X was designed for long-distance training. The upper felt familiar and reminiscent of previous – and well-loved, may I add – Hoka models: not too tight but firm enough to keep the shoes strapped to your feet without any issues.",
    "The 5mm heel to toe drop places the Bondi X firmly in the midway point between racing flats and high stack racing shoes with a massive 10-12mm drop. This further reinforces the neutral runner nature of the Bondi X and helps you devour the miles with ease (the carbon plate helps too – more on that later).",
    "Compared to its predecessor (the Bondi 7), the men’s version of the Bondi X is ever so slightly lighter, while the women’s version is a tad bit heavier. From a practical standpoint, such a minor difference won’t translate into a significantly different running experience and even with the reduction in weight, the Bondy X is not a light running shoe per se.",
    "Compared to Hoka’s top racing shoe, the excellent Carbon X 2, the Bondi X is softer and wider; more forgiving, one might say. It’s less performance-oriented and aimed at people who like to sneak in a cheat mile or two when they head out to longer training sessions.",
    "One thing we haven’t covered yet in detail is the inclusion of the carbon plate in the Bondi X. Previous version of the shoe didn’t include this feature and to be fair, it’s still a bit unclear why Hoka added it as there are already two carbon enhanced running shoes in its repertoire already (the Carbon X 2 and the Rocket X).",
    "That said, the Bondi X benefits greatly from the inclusion of this modern racing shoe staple. The Early stage Meta-Rocker mechanism might not be as soft as performance running shoes (the Adidas Adizero Adios Pro 2 jumps to mind), you can still feel the snap of the carbon plate as it propels you forward. This makes the Bondi X an ideal choice for those who want to go – run, even – the extra mile.",
    "The best thing about the carbon plated Bondi X is that it grants access to a feature previously only available in performance running shoes. It democratises the carbon plate, so to say, making it available to people who aren’t chasing PBs every time they go out for a run, but who might still appreciate a little extra help, especially when running form starts falling apart after 10 miles or so.",
    "As mentioned above, the Bondi X is not a light running shoe, but I doubt anyone would find the weight obtrusive in this case. Everything in the bottom unit, including the Meta-Rocker, the EVA midsole and even the cushioning, works together in unison to help runners keep going mile after mile.",
    "In conclusion, the Hoka One One Bondi X is a near-perfect long-distance trainer for people who don’t mind wearing stylish running shoes. Adding a carbon plate to an otherwise non-performance-oriented running shoe was a risk but one that paid off nicely here. If you’re happy to pay the premium price, you won’t be disappointed with the Bondi X."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and release date",
    "4": "Design",
    "9": "Performance",
    "15": "Don't buy it if"
  },
  "links": {
    "running shoe": "https://www.techradar.com/best/best-running-shoes",
    "Hoka": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1293272011784090000&xs=1&url=https%3A%2F%2Fwww.hoka.com%2Fen%2Fgb%2Fbondi-x.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhoka-one-one-bondi-x",
    "sportsshoes.com": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5185831931026567000&xs=1&url=https%3A%2F%2Fwww.sportsshoes.com%2Fhoka-one-one-bondi%2F%23fttt&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhoka-one-one-bondi-x"
  }
}