{
  "source": "https://www.techradar.com/reviews/xiaomi-poco-m3-pro-5g",
  "title": "Xiaomi Poco M3 Pro 5G review",
  "category": "phones",
  "updated": "2021-08-06T14:31:13Z",
  "author": "david-nield",
  "summary": "5G and battery life are the highlights",
  "verdict": "The Xiaomi Poco M3 Pro 5G is a decent deal for the price, we think – it's not the best budget phone we've seen this year, and nor is it the worst. If you want something that's very affordable with 5G and impressive battery life, it's worth checking out what this phone has to offer.",
  "pros": [
    "Won't cost you very much",
    "Respectable performance",
    "Comes with 5G"
  ],
  "cons": [
    "Lots of competition",
    "Average camera quality",
    "Software could be better"
  ],
  "article": [
    "The purpose of Xiaomi's Poco sub-brand is to offer the best possible components for as little money as possible: these phones have consistently impressed us in terms of the amount of bang you get in return for your buck, and the Xiaomi Poco M3 Pro 5G is the latest to try and tempt consumers with a value-for-money proposition.",
    "Of course just about every smartphone maker in the business is competing in the mid-range and budget categories now – even Apple, famed for its fondness for premium, luxury gadgets – has its iPhone SE (2020) and its iPhone XR.",
    "Nowadays, opting for a budget phone doesn't involve as many compromises and trade-offs as it used to, as processors, camera sensors and everything else have improved over time.",
    "However, even in a market saturated with affordable, decent-spec'd phones, the Poco M3 Pro 5G is still worthy of your attention. It has a nice big screen, it has 5G connectivity (as you've probably gathered from the name), and it has better-than-average battery life. If those three features are important to you, get this on your shortlist.",
    "The top configuration of the Poco M3 Pro 5G can be yours for under £200 (around $275 / AU$375), and that's seriously cheap – the very best flagships can cost five times that, or even more.",
    "With that in mind you have to expect some compromises, and this handset certainly has some: both the camera and the overall performance are adequate and not much more than that, so you're going to have to weigh up what's most important to you.",
    "It's also worth noting that apart from a few design flourishes, this is exactly the same phone as the Redmi Note 10 5G, also from Xiaomi. We don't pretend to fully understand Xiaomi's business and marketing strategies, but if you prefer the stylings of that particular handset and the current pricing suits, that's perhaps worth thinking about as an alternative to this.",
    "As we'll explain below, it's really a case of getting what you pay for with the Xiaomi Poco M3 Pro 5G: it doesn't really offer any surprises, but you get a solid smartphone and 5G connectivity in return for not much money, and for a lot of people that's going to be a deal that they're interested in.",
    "You can get the Poco M3 Pro 5G in the UK direct from the Poco website: you'll pay £179 (roughly $250 / AU$335) for the 4GB/128GB version and £199 (around $275 / AU$375) for the 6GB/128GB version (the more expensive one is worth it).",
    "At the time of writing the prices are reduced to £149 and £179 respectively, making this an even better deal, but we can't say how much longer that will last.",
    "As with previous Poco phones, while the Xiaomi Poco M3 Pro 5G is available more widely in Europe, it won't be coming to the US or Australia.",
    "There isn't much to write home about when it comes to the design of the Poco M3 Pro 5G – it's about as standard as smartphones come in terms of its aesthetics, except perhaps for the rather large Poco logo swatch that wraps around the rear camera, up in the top left corner around the back of the device. It might put you off if you prefer a more minimalist look, but we didn't mind it.",
    "Cool Blue and a rather bright Poco Yellow are your color choices besides the more subtle Power Black that our review unit came in – if you want to stand out from the crowd then it's good to have the other two options available.",
    "It feels like a fairly cheap phone when you pick it up, with a lot of plastic to it and not much heft, but it doesn't feel badly put together or disappointing in terms of its actual build quality. The back panel, frame and screen all fit together well enough.",
    "It's worth bearing in mind that the glossy back of this phone tends to attract a lot of fingerprints, at least in the black color, so if you want your handset to be always looking its best then you're going to have to wipe it down regularly (or maybe just wear gloves whenever you use it). The dimensions of the handset are 161.8mm x 75.3mm x 8.9mm, and it weighs in at 190 grams.",
    "Wired connectivity and charging is provided via a USB-C port, next to a speaker at the bottom, and there is a 3.5mm headphone jack up at the top for your wired headphones. There's no waterproofing or dustproofing here, while the fingerprint sensor is placed under the power button on the right of the phone as you look at it – not an approach we really like, as it means the button has to be sunk into the frame.",
    "If you're listening, phone manufacturers, we prefer a raised power button that you can find easily without looking, and an in-screen fingerprint sensor (or even one on the back) that's big enough to actually read your entire fingertip. Still, it's not a major complaint, and overall the Xiaomi Poco M3 Pro 5G offers about as much style and design flair as you would expect at the budget end of the market.",
    "The display is often where budget phones look like budget phones, but to be fair to the Poco M3 Pro 5G, the 6.5-inch LCD screen that we've got here isn't too bad.",
    "It runs at a respectable resolution of 1,080 x 2,400 pixels, it has a decent refresh rate of 90Hz, and it manages okay in terms of brightness as well. You really do need to be somewhere near the top of the brightness setting most of the time, but if you are then colors pop and details are sharp throughout.",
    "All that said, you're in no way going to mistake this for a top-end or even mid-range display panel – if you like a display that really packs a punch, you might want to consider going for a phone with an OLED panel (like the OnePlus Nord 2, to pick one example). That'll cost you extra though, so as always it's a question of which features you want and how much you're prepared to pay to get them.",
    "The bezels around the screen are nice and thin – something even the cheapest phones can manage nowadays – and the only interruption on the front is a single punch-hole for the selfie camera to stick out of. It'll do as a design approach until manufacturers figure out how to get a decent quality camera working under the screen.",
    "From flicking through photos to browsing the web, the display on the Xiaomi Poco M3 Pro 5G stands up, though it's not always the smoothest when scrolling, despite that 90Hz refresh rate (the low-powered internals are probably to blame here). It's a decent size, and it's fine for movies and gaming too – though there's no HDR processing, so the darkest and lightest areas of the picture can occasionally lose detail.",
    "The rear camera on the Xiaomi Poco M3 Pro 5G is okay in most situations but not much more than that. It comes with a triple-lens 48MP wide + 2MP macro + 2MP depth configuration, so you don't get anything in the way of ultra-wide or telephoto zoom here.",
    "On the front there's a single-lens 8MP wide camera, which will do the job for your selfies but isn't going to stand up to any kind of challenging conditions.",
    "You can get some decent photos from this phone, if the light is good and you've got a steady hand, but some of the ones we took tended to be a bit dim in places – at times the HDR seemed to be a bit erratic, but you can always turn it fully on or fully off instead of having it set to auto.",
    "When HDR is enabled, the camera usually does a good job of balancing light and dark. Some details came across as blurred and smudged, though color reproduction was usually fine, and shutter speed was pleasingly fast. The macro mode didn't prove to be much use, though close-ups are handled perfectly well most of the time.",
    "Low light proves challenging for the Poco M3 Pro 5G – you can get some usable photos in the evening, if there is a bit of light available, but in general there are more misses than hits. The camera is usually one of the giveaways when you're spending less on a smartphone, and that proves to be the case here: if you want smartphone photos that you can rely on, then it might be worth investing in a more expensive handset.",
    "Video from this phone tops out at a 1080p resolution and 30 frames per second, and like the photos, the results are passable without being particularly impressive. Think quick shots for sharing on social media rather than images and videos you're going to treasure for a long time to come.",
    "Clicking around the web, other users have got better results from the Xiaomi Poco M3 Pro 5G's camera than we did, so we don't want to mark it down too much in this department. It's possible that some software tweaking is needed to get the best results from your snaps here, either on the phone itself or after you've transferred the images to another device.",
    "For what you're paying, the Poco M3 Pro 5G comes with a set of specs that we can't really complain too much about: specifically, a MediaTek Dimensity 700 5G chipset, 4GB or 6GB of RAM, and 64GB or 128GB of storage (which you can expand via the microSD card slot). We've seen super-cheap phones try and get by on even lower specs, so it's good to see a handset that goes beyond the bare minimum.",
    "It's not a whole lot beyond the bare minimum though, so be prepared for the occasional stutter or spot of lag – not in a way that ruins the user experience particularly, but just in a way that lets you know you're not using the Samsung Galaxy S21 or the iPhone 12. It will likely run all of the apps and games you want it to, but brace yourself for longer loading times and an extra few milliseconds when switching between apps.",
    "If you do have the option in your part of the world, we'd recommend going for the 6GB and 128GB configuration (it's the spec our review unit came with) – for a phone this affordable, that's a surprisingly good option, though it does of course add to the price (which is one of the key selling points of this device in the first place).",
    "It's the MediaTek chipset that really gives the Poco M3 Pro 5G away as a budget phone, though as we've said it copes fine with day-to-day tasks. It's certainly a step up from the cheaper Xiaomi Poco M3.",
    "You're no doubt wondering how these specs translate to Geekbench 5 scores: the answer is 431 for single-core, 1,284 for multi-core and 1,325 for OpenCL. That's some way short of the similarly spec'd and similarly priced Realme 8 5G, but it's close enough that you're unlikely to notice much of a difference when you're actually using it.",
    "Considering how the phone is priced – around double the very cheapest phones on the market, and half the price of some of the best mid-rangers – the performance levels are around where you would expect.",
    "It's worth mentioning the 5G connectivity that's on board here – it's right there in the name of the phone – which adds an extra level of future-proofing to your purchase. 5G is by no means ubiquitous yet, but it is rolling out at a steady pace in most parts of the world. We're glad that it's included here, though at this point only the very cheapest new phones don't have it, so it's not the huge bonus that it used to be.",
    "Software duties are well handled by Android 11 and the usual Xiaomi MIUI skin (MIUI 12 in this case). We're not the biggest fans of MIUI, with its collection of unnecessary bonus apps and rather overdone design choices in certain places, but it's not terrible – you might get along with it perfectly well (and as this is Android, you can always install an alternative launcher anyway).",
    "Like many budget phones, the Xiaomi Poco M3 Pro 5G offers very good battery life – the combination of less vibrant screens and less powerful hardware means there isn't as much of a draw on the battery, which here has a 5,000mAh capacity.",
    "In general we found the phone going well into two days of use (without much in the way of gaming or making demands from GPS), and if you're careful then you're only going to have to put this on charge every other night.",
    "You don't get any wireless charging though, and the wired charging rate tops out at 18W – if you want super-speedy charging then you're going to have to invest in a more expensive phone. For some people this won't be a problem, and when you're shopping at this sort of price point, you have to expect some corners to be cut along the way.",
    "In terms of movie watching, streaming videos over the web at maximum brightness and a low volume eats up around 8% of the battery every hour, so you're looking at around 12-13 hours in total. Again, that's more than you can expect from a lot of phones, so it's something to put in the pluses column if you're considering this.",
    "If you're only occasionally going to pick up your phone and you're happy to turn down the brightness, then you can squeeze out even more time between charges.",
    "There are also battery saver and ultra battery saver modes in the settings, which will seriously restrict background activity and keep your phone lasting longer, in return for a few trade-offs – these make the handset even more appealing in terms of battery life.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Xiaomi Poco M3 Pro 5G price and availability",
    "11": "Design",
    "17": "Display",
    "22": "Camera",
    "29": "Specs and performance",
    "37": "Battery life",
    "43": "Don't buy it if..."
  },
  "links": {
    "these phones": "https://www.techradar.com/reviews/xiaomi-poco-f3",
    "impressed us": "https://www.techradar.com/reviews/xiaomi-poco-x3-pro",
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "Redmi Note 10 5G": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-5g",
    "the Poco website": "https://www.po.co/uk/buy/product/poco-m3-pro-5g?gid=4212500004",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Realme 8 5G": "https://www.techradar.com/reviews/realme-8-5g-review"
  }
}