{
  "source": "https://www.techradar.com/reviews/technics-eah-az60",
  "title": "Technics EAH-AZ60 review",
  "category": "audio-visual",
  "updated": "2021-12-03T12:09:15Z",
  "author": "simon-lucas",
  "summary": "Technics is moving in the right direction",
  "verdict": "Not the most complete true wireless earbuds you can buy, and far from short of competition, but the EAH0AZ60 demonstrate Technics is moving in the right direction.",
  "pros": [
    "Confident, informative sound",
    "Exhaustive control app",
    "Well-made and comfortable"
  ],
  "cons": [
    "Better options exist where rhythmic certainty is concerned",
    "Too many capable rivals to list"
  ],
  "article": [
    "It’s a confident or foolish company that enters the mid-range true wireless fray. Happily, Technics is the former, and where the EAH-AZ60 are concerned, it has every right to be.",
    "The plus column is a long one, and covers quite a few aspects. Fit, first and foremost, is good – the earbuds are a good shape, light and come with quite the widest selection of eartips we’ve seen so far. So getting them comfy, and having them stay that way, is simple. Ergonomics are great – the touch controls are sensitive and can be customized in the control app, which is extremely thorough. Or there’s (very responsive) voice control available, too.",
    "And there are many positives to the way the Technics sound. They’re a punchy and assertive listen, with plenty of detail available and a nicely unified, coherent overall sound. Their noise cancellation is good, and doesn’t interfere where the sonic signature is concerned. It’s really only a lack of rhythmic conviction when compared to the best of their numerous rivals that costs them that final half-star.",
    "The Technics EAH-AZ60 are on sale now, and in the United Kingdom they’re priced at £199. In the United States they go for around $229, while in Australia they’re marked up at around AU$379.",
    "At this price, they’re on the coattails of some of the best true wireless earbuds around. Sennheiser’s great-sounding Momentum True Wireless 2 can be yours for a similar cost, while Bose’s QuietComfort Earbuds deliver all the quiet and comfort the model name promises for not much more. And, of course, $279.99 / £249 / AU$379 buys you a pair of The Best True Wireless In-Ear Headphones Currently Available (according to, oh, everyone): the Sony WF-1000XM4.",
    "The long and short of it is this: The competition is fierce and the Technics has its work cut out.",
    "As far as the design goes, Technics took the welcome step of reducing the bulk of these wireless earbuds relative to the EAH-AZ70W (its first entry in the premium true wireless in-ear market). The EAH-AZ60 are more ergonomic in shape, lighter (7g per bud) and smaller (26 x 23 x 28mm) – and those three facts, taken along with the fact the package includes seven differently sized pairs of eartips, means the Technics are a cinch to get comfortable and will stay that way for easily as long as the battery lasts.",
    "Battery life, while we’re on the subject, is an OK-but-hardly-dazzling 25 hours. That’s your best-case scenario, when listening to the standard Advanced Audio Coding (AAC) codec content with active noise cancelling (ANC) switched off – between seven and eight hours from the buds themselves and a little over two charges held in the slender little charging case. Go to town (in performance terms, at least) by streaming using the LDAC codec with noise-cancelling engaged and you’re looking at more like 16 hours – four-and-a-bit from the earbuds, and the rest from the case.",
    "Wireless connectivity is via Bluetooth 5.2, which we’re always happy to see, and naturally enough there’s support for the sub-band codec (SBC) as well as AAC and Sony’s hi-res LDAC. There’s no sign of aptX, though, let alone aptX HD — and that’s a pity.",
    "Control freaks will enjoy the options here, though. Amazon Alexa is built in, and Siri is available, too. The four-mic-per-bud array here is every bit as good at receiving instructions as it is at delivering decent call quality or assessing ambient conditions as they relate to the active noise-cancellation circuitry. Like the mics, each earbud features a capacitive touch surface which gives swift and reliable control of the most obvious functions: play/pause, volume up/down, skip forward/backward, answer/end/reject call, wake Siri and ‘switch between noise-cancelling and ambient sound.",
    "It’s possible to customize those controls in the expansive yet rather unglamorous Technics Audio Connect app. It’s also where you’ll find five-band EQ adjustment, where you can adjust the level of noise cancelling and ambient sound (which gives external sound a boost), ask your earbuds to emit a chirp in case you’ve temporarily misplaced them, enable multi-point connection, you name it… “thorough” doesn’t really do the earbuds justice.",
    "Quite often a product – especially earbuds – will reveal their essential character quite quickly. The Technics EAH-AZ60 immediately let you know how confident they are.",
    "There’s more to them than that, of course, but on a fundamental level these earbuds sound assertive, positive and self-possessed. A quick pass through Belle and Sebastian’s Nobody’s Empire allows them to make their case almost entirely: they lay out a coherent soundstage, they don’t scrimp on even the finer details and they are unarguably in charge of the tune.",
    "This front-foot attitude is carried over into their tonal balance (assuming you haven’t been fiddling with the EQ levels, anyhow). The low frequencies are robust, hefty and carry plenty of well-controlled momentum, while at the opposite end of the frequency range the treble is bright and shiny but never hard, not even at a high volume.",
    "In between, there’s more than enough space in the mid-range for a singer to comfortably do their thing, and enough detail revealed to make it obvious what that particular thing is. It may seem redundant to talk about powers of communication when discussing a product like this, but there are enough true wireless earbuds around that simply don’t communicate. These Technics do, and pretty explicitly.",
    "They’re dynamic, too. They can handle the straightforward variations of Leafcutter John’s Yes! Come Parade With Us and the more subtle harmonic dynamics of Sampha’s (No One Knows Me) Like the Piano. The intentions of a musician, a singer or a band are really never in any doubt.",
    "It’s with the rhythm-dependent aspect of music that the EAH-AZ60 come up a little short when compared to the best alternatives at this price. They don’t seem capable of the same rhythmic certainty of their best rivals, and end up sounding rather less musical as a result. Heard in isolation, there’s not too much to criticize where rhythmic expression is concerned, but swap them for Sony’s all-conquering WF-1000XM4 and they sound just slightly mechanical and less than deft. It’s a marginal difference, but it’s a difference nevertheless.",
    "They’re effective at noise cancellation, though – not quite on a par with Bose’s almost-eerily quiet QuietComfort Earbuds but they’re among some strong second-tier alternatives. Dial up the ANC to 100% in the app and the outside world is near enough banished. And without skewing the sound of your music, either."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and release date",
    "6": "Design",
    "11": "Audio performance",
    "18": "Don't buy them if..."
  },
  "links": {
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Momentum True Wireless 2": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-2-review",
    "Bose’s QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "EAH-AZ70W": "https://www.techradar.com/reviews/technics-eah-az70w"
  }
}