{
  "source": "https://www.techradar.com/reviews/fitbit-luxe",
  "title": "Fitbit Luxe review",
  "category": "fitness",
  "updated": "2021-06-28T11:01:00Z",
  "author": "cat-ellis",
  "summary": "Small and sleek, the Luxe is a great choice for gym-going cardio fans",
  "verdict": "Small, sleek and polished both inside and out, the Luxe is one of the best Fitbits to date. Without on-board GPS, its run tracking isn't perfect, but its biometrics (particularly heart rate monitoring) are impressive, making it a great choice for gym-goers. It's great for everyday motivation as well, keeping you on track with healthier habits. Fitness trackers work best when worn every day, and this is one that you'll genuinely want to.",
  "pros": [
    "Sleek, attractive design",
    "Bright, crisp AMOLED display",
    "Impressive heart rate monitoring"
  ],
  "cons": [
    "Small screen limits visible data",
    "Fitbit Premium required for full experience",
    "SpO2 monitor not yet activated"
  ],
  "article": [
    "The Fitbit Luxe is essentially a high-end version of the Fitbit Inspire 2 – more polished in every way, and with a few welcome extra features (plus more to come soon). Its small display presents some limitations, but is bright, crisp and attractive.",
    "This is a fitness tracker rather than a fully-fledged smartwatch like the Fitbit Versa 3 or Fitbit Sense, so we wouldn’t expect it to offer features like the ability to make calls from your wrist or use Fitbit Pay to make contactless purchases. Instead, the Luxe is all about monitoring your wellbeing encouraging healthier habits (both physical and mental), which it does with aplomb.",
    "In everyday use, the Luxe performs admirably, providing accurate step and heart rate tracking, with the day’s stats accessible with a flick of your finger, and more in-depth data available in the Fitbit app. Heart rate monitoring is particularly impressive, even during intense workouts, closely matching that from a dedicated sports watch for responsiveness and accuracy.",
    "There's no on-board GPS, which means relying on either the Luxe's accelerometer or your phone's GPS, neither of which is optimal, but the main drawback of the Luxe is that its screen is just so compact that it's not possible to see much data at once – to view any historical stats, you'll need to dive into the apps.",
    "If GPS is a deal-breaker for you, it's worth considering the Huawei Watch Fit Elegant. Like the Luxe, it has a stainless steel case and vivid AMOLED display, and it’s substantially cheaper too. However, Fitbit’s user experience is more refined, and together with its mature smartphone app, could give the Luxe the edge.",
    "The Fitbit Luxe was announced April 2021, and is due to start shipping on July 1 2021. It costs $149.95 / £129.99 / AU$199.95 for the standard edition with a silicone band, and $199.95 / £179.95 / AU$299.95 for the special edition with the gold colored Gorjana link bracelet.",
    "That puts it nicely in between the Fitbit Inspire 2 (which launched at $99.95 / £89.99 / AU$179.95) and the Versa 3 smartwatch (which costs $329 / £299 / AU$499).",
    "The Luxe also comes with a free one-year trial of Fitbit Premium, which you can activate as soon as you’ve paired the device with your phone.",
    "The Luxe is one of Fitbit’s smallest fitness trackers, with the slimline design that harkens back to the original Fitbit Flex released in 2013.",
    "It follows the same 'Biologic Industrial Design Language' as the Fitbit Inspire 2, Versa 3 and Sense, with ergonomic lines designed to suit the curves of the human body. In fact, its design very closely resembles the Inspire 2 – but there are some important differences.",
    "First of all, while the Inspire 2 has a plastic case, the Luxe uses stainless steel, in black, gold and silver. This is matched by a stainless steel buckle, giving the Luxe a smarter overall look.",
    "There are also more band options for the Luxe, which is available in two versions: one with a silicone band, and one with a gold-toned stainless steel link bracelet by jewelry designer Gorjana. The latter has a distinctly feminine look, but unlike the Garmin Lily, which has a similar jewelry-inspired look, the Luxe isn’t specifically aimed at women, and its silicone bands come in Lunar White, Orchid, or Black. Additional bands are sold separately.",
    "Our test unit had a silicone band in Lunar White, which was extremely comfortable, even at night. Many modern fitness trackers (including Fitbit’s latest designs) use a soft buckle and tang in place of a traditional fastening for added comfort, particularly while sleeping, but the Luxe’s small stainless steel buckle was impossible to feel. The tracker’s small size meant it never dug into our wrist during workouts, as larger sports watches can sometimes do.",
    "The most striking thing about the Fitbit Luxe, however, is its screen. Whereas most of Fitbit’s smaller fitness trackers (including the Inspire 2 and Charge 4) have a monochrome OLED display, the Luxe’s display is a full color AMOLED with a 206 x 124 pixel resolution, and it looks fantastic. It’s also responsive, which is hugely important for a device with no physical buttons.",
    "Watch faces can be customized through the companion app, with lots of attractive options to choose from (including analog and digital designs) that make the most of the bright, colorful display. All of these show the time at a glance, but some also offer additional stats, including your current heart rate, step count, and calories burned so you can view them without swiping. The range is already impressive, and Fitbit may well add more faces over the coming months.",
    "The face’s small size does present a few limitations (you can only see a small amount of data at once, and graphs are out of the question) but it’s vivid and crisp, with smooth animations and scrolling.",
    "If you’ve used a Fitbit before, you’ll be familiar with the overall experience; the Fitbit Luxe is simple to use, with an interface that makes tracking your activity and wellbeing as simple as possible. However, before you take it on your first workout, it’s worth taking a moment to customize a few settings.",
    "There are only six slots for workouts on the Luxe (by default these are walk, run, swim, cycle, general workout, and treadmill) and these can’t be altered from the device itself. Instead, you customize the available options to suit your preferences within the Fitbit app. Within the app, swipe left on a workout you don’t use to remove it, then tap the plus icon at the top right to add something you prefer.",
    "As mentioned above, we appreciated the tracker’s small size, which meant it never dug into our wrist during activities like yoga – and unlike some other trackers we’ve tested recently, the Luxe didn’t mistakenly count steps during a spin class.",
    "The Luxe can detect some exercise types and begin monitoring them automatically through SmartTrack, which is particularly useful for picking up incidental exercise that you might not think to track manually.",
    "Heart rate measurements taken from the wrist can always be affected by ‘noise’ from general movement, and particularly from gripping motions, and optical heart rate monitors will never be as accurate or responsive as a chest strap that measures the electrical signals as your heart contracts. Those factors aside, the Luxe performed surprisingly well, with results almost exactly matching those from a Garmin Vivoctive 4S. Average and maximum heart rates recorded by the two devices were within 2bpm of one another, and there were no unexpected peaks or troughs.",
    "When it comes to workouts in the great outdoors, it’s possible to log runs using only the watch’s accelerometer, which is OK for casual social runners, but for increased accuracy you’ll need to connect to your phone’s GPS. This gives more precise readings, though they’re still not as accurate as those from a watch with its own GPS receiver; the Fitbit tends to smooth out your route, underestimating the actual distance.",
    "As with all Fitbits, you’ll see goal animations when you achieve certain targets (such as steps), which helps provide an incentive to keep going, and is great if you need a little nudge to keep up your healthier habits. It’s also possible to connect with friends and challenge one another to hit the most steps during a day (for example). Many devices from other brands offer a similar feature, but the popularity of the Fitbit platform makes it much more likely you’ll know a fellow user against whom you can pit yourself.",
    "It’s a shame that you can’t see more historic data on the watch, such as how many days you’ve attained your steps goal this week, or a graph of your heart rate throughout the day. This is a limitation of the small display.",
    "The small size of the Luxe’s screen means most of its customization options are only accessible through the app. As we’ve already mentioned, watch faces and workout menu settings are both configured here, and the app also allows you to choose which health alerts are sent to your Fitbit Luxe. These can include reminders to move, take a moment for mindfulness, stay hydrated, and (a new addition to the app during the pandemic) wash your hands. These are all disabled by default, so you won’t be bombarded by distractions.",
    "The color screen means that the Luxe has slightly less impressive battery life than its cousin, the Inspire 2. Fitbit estimates that it will last five days in normal use before needing a charge, and in our experience that was roughly accurate. Thankfully, charging is easy; the Luxe is supplied with a USB charger that connects to the rear of the device securely using a magnet, and doesn’t shift and disconnect easily.",
    "Once you've worn the Luxe to bed for three nights to calibrate it, you'll start receiving a sleep score each morning, based on your duration and quality of sleep.",
    "Battery life is likely to take a further dip once the Fitbit Luxe gets its first big update. The Luxe has a sensor for blood oxygen saturation (SpO2) – a feature that the Inspire 2 lacks – which we anticipate will drain power faster overnight. This sensor isn’t enabled at launch, but will be activated via a future firmware update. It’s also possible that the Luxe will gain other features in the coming months. Fitbit has a track record of rolling out additional faces and tools for its devices post-launch – and that’s before we consider the frequent updates to its mobile app.",
    "The market for fitness trackers is increasingly crowded, but Fitbit’s well developed smartphone app sets it apart from the competition.",
    "The app pools data from all your Fitbit devices in one place, so if you have a smart scale like the Fitbit Aria Air, your weight and body composition data will be synced as well, so you can see how changes to your lifestyle have affected your body over time.",
    "To get the most out of the app, you’ll need a Fitbit Premium subscription, so it’s good to see that the Luxe comes with a year thrown in, which you can activate as soon as you’ve connected the watch to your phone (a simple process that takes only a minute if you already have a Fitbit account).",
    "This grants to access to more historical insights, including heart rate variability, skin temperature, and SpO2 over time. After 30 days of using the device, Premium users can also use the app to generate a Wellness Report that can be exported as a PDF to share with a doctor, family member, or friend.",
    "In a similar vein to apps like Fiit and Apple Fitness Plus, the Fitbit mobile app gives you access to a range of instructor-led workouts and mindfulness sessions. These are all pre-recorded rather than live and interactive, but Fitbit is broadening its offering with frequent new additions.",
    "Some classes and sessions are available free to all Fitbit users, but others (including meditation with Deepak Chopra and restful soundscapes) are only accessible to Premium subscribers. This is worth bearing in mind when considering the cost of the Luxe long term.",
    "First reviewed June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Fitbit Luxe price and release date",
    "8": "Design",
    "16": "Performance",
    "28": "Companion app",
    "35": "Don't buy it if"
  },
  "links": {
    "Fitbit Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Huawei Watch Fit Elegant": "https://www.techradar.com/reviews/huawei-watch-fit-elegant",
    "Garmin Lily": "https://www.techradar.com/reviews/garmin-lily",
    "smart scale": "https://www.techradar.com/best/best-smart-scales",
    "Fitbit Aria Air": "https://www.techradar.com/reviews/fitbit-aria-air",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus"
  }
}