{
  "source": "https://www.techradar.com/reviews/coros-vertix-2",
  "title": "Coros Vertix 2 review",
  "category": "wearables",
  "updated": "2021-09-14T16:10:56Z",
  "author": "jamie-carter",
  "summary": "A sports watch with super-long battery life for long off-road adventures",
  "verdict": "This high-end adventure smartwatch review boasts the longest battery around in an excellent design and finds GPS, GLONASS, Galileo and Beidou GPS satellites for more ultimate accuracy. It’s also got MP3 playback on board, but its offline mapping underwhelms.",
  "pros": [
    "Offline mapping",
    "140 hour battery life",
    "GPS, GLONASS, Galileo and Beidou",
    "Links to Bluetooth earphones",
    "Compatible with Insta360 cameras"
  ],
  "cons": [
    "Maps lack labels or navigation",
    "Uses proprietary charge cable",
    "Huge size",
    "No music streaming"
  ],
  "article": [
    "The Coros Vertix 2 is best described as a smartwatch designed for running and the outdoors – not just for running and cycling, but also hiking, climbing and mountaineering. You may have thought that Garmin has the ‘rugged GPS sports watch’ niche tied up with the Garmin Fenix 6, but the Vertix 2 is a worthy contender, albeit with some slightly underwhelming headline features.",
    "It’s relatively expensive at US$699.99 / £599.99 / AU$1,127. No-one is going to be buying the Coros Vertix 2 on a whim, but it’s a brilliantly designed product with an excellent build quality, and features galore.",
    "Chief among these is its dual-frequency GNSS chipset, which enables to pinpoint your exact position using five separate satellite constellations (GPS, GLONASS, Galileo, Beidou and QZSS), with unprecedented accuracy. That's particularly important in places like valleys and gorges, end even more so if you’re climbing a vertical rock face that might otherwise have limited visibility of satellites or physically block or reflect the signals.",
    "In practice, does that really matter? It’s debatable, but either way the downside of that ‘all systems on’ mode is battery life, which is why the Coros Vertix 2 offers extra-long battery life – up to 140 hours, in fact, though in our real-world test using just GPS it lasted well over a week. It's unfortunate, then, that when it comes to recharging it you have to go and find its short cable fitted with a proprietary connector.",
    "How does the Coros Vertix 2 compare with the original Vertix? Well, this new iteration has a slightly bigger, higher resolution display (and thus a slightly bigger physical size and 15g extra weight), a thin film coating on the bezel to add more ruggedness and corrosion resistance, and it works down to -22°F/-30°C.",
    "However, the biggest addition to the Vertix 2 is offline mapping, complete with free downloads. The display is just about large enough to follow and is great for context, but there are no labels or names. Or turn-by-turn navigation. In short, it’s not as good as on the Garmin Fenix.",
    "Sure, the quoted battery life is awesome, but don’t get too lost in that headline figure of 140 hours. After all, you’re going to be playing music (it plays MP3s and pairs with Bluetooth earphones), or using maps (and therefore the screen). All you need to know really is that the Coros Vertix 2 isn’t going to unexpectedly run out of power during heavy use.",
    "You also get short, quiet beeps and pleasant haptic buzzes that help make the Coros Vertix 2 sound and feel like the high-end and hugely enjoyable product it undoubtedly is. Is it better than the Garmn Fenix? If battery life is the most important thing to you, then sure.",
    "A follow-up to the original Coros Vertix from 2019 and a heavier duty watch than the Coros Pace 2, the Coros Vertix 2 was released on August 17, 2021 for $699.99 / £599.99 / AU$1,127. It ships with a 26mm silicone band in two colours: Obsidian and Lava. Nylon bands are also available.",
    "Climbers should know that the Coros Vertix 2 can also be attached to a carabiner, which will soon be available for an additional fee.",
    "The Coros Vertix 2 is an incredibly solid, rugged, well-made product. It measures a chunky 503 x 503 x 15.7mm and weighs 89g, a little more than its predecessor thanks to its use of a 1.4in 280 x 280 pixel touchscreen display. That’s fitted with super-strong sapphire glass within a scratch-resistant titanium case that sports a thin film coating for extra corrosion resistance. There’s a textured silicone rubber band that’s fairly wide and, on our review sample, a dull orange color. It’s big on the wrist. Really big.",
    "How does the Coros Vertix 2 compare with the original Coros Vertix from May 2019? Well, this new iteration is waterproof down to 100m/328 feet – oddly a third less than its predecessor – and operates in colder temperatures (down to -22°F/-30°C). However, the biggest difference is the Coros Vertix 2’s all-satellite dual-frequency GNSS chipset that finds your exact position using either/or GPS, GLONASS, Galileo, Beidou and QZSS. That should do it.",
    "Inside are a slew of sensors, from the usual navigation watch essentials like a barometric altimeter accelerometer, compass, gyroscope and thermometer to the more activity-focused optical pulse oximeter, optical heart rate sensor and an electrocardiogram (ECG) sensor.",
    "The Coros Vertix 2 also comes with a cute and incredibly solid flight case. It’s a nice accessory and adds more rugged appeal, but we don’t really get why it needs more protection. Isn’t it tough enough already?",
    "We love the way it’s controlled. On the side is an excellent large digital dial that has to be fully rotated to allow the user access. It’s squeezed between two other buttons, one of which dims the screen on demand. On the rear is a slot for attaching the magnetic charging cable.",
    "Sadly, the watch uses a proprietary connector to recharge, which will put some off. After all, who wants to go hiking with a special USB cable you had better not lose? It’s a frustrating inclusion on an otherwise nicely designed product.",
    "One thing endurance athletes should know is that the Coros Vertix 2 lacks support for the ANT+ connectivity standard, which means no support for smart trainers and power meters. They’re a bit old hat, but still.",
    "After a slick unboxing from that flight case, it’s a cinch to set up the Coros Vertix 2; you just download the Coros app and scan a QR code that appears on the watch itself. Pairing complete, there’s some personal details to enter – including heart rate zones – and you’re ready to run/walk/swim etc.",
    "In fact, the activity modes supported by the Coros Vertix 2 are jaw-dropping in their number. We counted 27, which include open water and flatwater, as well as pool swimming, indoor and outdoor rowing, and windsurfing.",
    "On the app’s front page are basic data for steps, heart rate, sleep etc, a page that lists statistics and thumbnail maps for all workouts, a page for the Coros EvoLab (a sports science platform that takes seven days of runs to calibrate) and a page for tweaks like changing the watch face (nine to choose from), adding GPX files (a standardized file format containing latitude and longitude coordinates) and setting up which app notifications appear on the watch (email, calls, WhatsApp, Instagram, Twitter etc).",
    "All the data collected can be funnelled into a slew of third-party fitness apps: Apple Health, Strava, TrainingPeaks, Running Quotient, Adidas Running, Relive, Final Surge, Runalyze and WeRun. You can also pair it with the Stryd Sensor ‘footpod’ power meter.",
    "We found that it took about 10 seconds before the app automatically synced data with our watch via Bluetooth. However, you can also hook it up to your home Wi-Fi network to send its data to the cloud (you enter the Wi-Fi password via the Coros app).",
    "New for this iteration is control of Insta360 cameras, specifically the Insta360 One R 1-Inch Edition (one of the best action cameras) and the Insta360 One X2 (one of the best 360 cameras), which is a bit of a surprise. It basically means that you can use the Coros Vertix 2 as a remote control.",
    "Another new addition is both MP3 playback and the chance to (stupidly easily) pair some Bluetooth headphones. While welcome, the Coros Vertix 2’s internal storage stretches only to 32GB while the drag-and-drop manual adding and refreshing of MP3 files won’t appeal much to most users (it’s only got three tunes included by default). However, the presence here of Wi-Fi suggests that streaming services could soon become available.",
    "Like the original, the Coros Vertix 2 is very clearly aimed at mountain athletes; hikers, mountain climbers, trail runners, downhill and cross-country skiers, ski touring, and snowboarders. There are distinct activity modes for each, but the star of the show should surely be its new offline mapping support.",
    "The trouble is, it feels like an early access feature. It has both color landscape (global) and topographic (by region) maps, which can be viewed together, but the maps lack labels. No street names. No river names. Its small size and use of pale colours makes it tricky to follow.",
    "You can zoom in on a map using the digital dial on the side, and pan around the screen using your fingers (even when gloved), but not while you're following a GPX route. We downloaded one from the MapMyRun website (sadly Strava routes are off the menu), opened it with the Coros app, then synced it with the Coros Vertix 2. All a bit manual, but it works well enough.",
    "Choose the Navigation option on the watch and it then overlays it onto its existing map layers. You can customize the map style you see, whether you follow the course in reverse, and toggle whether you get alerts if you go off-course. But that’s not navigation. You can see elevation profiles from GPX files, but nothing else – not even metrics from your run or hike. So trail runners won’t get lost, but nor will they get any insight into their activity.",
    "It all seems like a rather bolted-on and half-baked feature. It’s great that topographic map downloads are free from Coros website and everything works offline, but if you were paying for its mapping you’d probably feel short-changed. It’s also a shame that you need a computer and must physically tether the watch via its charging cable to get new maps onto your watch, though we are talking here about multi-gigabyte files.",
    "Of the myriad activity modes, the most used are obviously going to be its run, indoor run, track run, its various swim and biking modes, and gym cardio, each of which can be customised so you only see what data on the watch you want to see.",
    "We took the Coros Vertix 2 for a series of hikes and runs and it found satellites in no time, and tracked our heart rate, speed and cadence, but we did find we’d set our targets too high, and consequently constantly got harangued by beeps and haptic buzzes. However, everything can be reset and/or switched off. We did also find that if you pause it while it’s tracking you – while you stop for lunch, for example – you only have 20 minutes before the Coros Vertix 2 begins a countdown into power-saving mode.",
    "At any time you can scroll through a list of metrics that can include everything from steps, floors, calories and recovery time to heart rate, sleep time, temperature and data on the sunrise and sunset times (but not moonrise and moonset, which is a shame). Every widget can be clicked into to get a seven-day picture while the app records long-term trends.",
    "For mountaineers with one eye on altitude sickness the SpO2 sensor shows your blood oxygen saturation, but only when you get above 2,500m.",
    "The ECG feature is a little odd, asking the user to put their other hand physically across the watch, after which a 60-second haptic countdown begins. However, all you get is a heart rate variability (HRV) score and a comment on your stress status. So not really an ECG at all, then.",
    "If there is one major reason to upgrade to the Coros Vertix 2 it’s battery life. While the original Vertix could keep running for 60 hours in full GPS mode, the Coros Vertix 2 ups that to an epic 140 hours.",
    "However, it’s important to understand the differences between its three GPS modes; Standard GPS, All Systems On and All Systems + Dual FREQ On. Standard GPS claims a whopping 140 hours by communicating with GPS satellites only. All Systems On talks to all five satellite constellations (GPS, GLONASS, Galileo, Beidou, QZSS), which reduces battery life to 90 hours – a shade more than the Garmin Enduro. All Systems + Dual FREQ On (also known as GNSS) adds more accuracy and takes the battery life down to 50 hours. UltraMax mode ups the battery life to 240 hours by only switching-on GPS for 30 seconds in every 120 seconds, though it only works in Run, Trail Run, Mountain Climb and Hike modes. Coros also tells us that the Coros Vertix 2 will work for 60 days on a single charge.",
    "After a week with at least one activity tracked per day – a few runs, plenty of hikes, all on standard GPS mode – the Coros Vertix 2 was still showing a 60% charge. Helpfully, there’s a battery page that displays estimates of how many hours of GPS use remain, as well as how many days until it needs recharging based on how you’ve used it since the last charge. Ours clocked in at 15 days.",
    "First reviewed September 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Coros Vertix 2 price and release date",
    "10": "Coros Vertix 2 design",
    "17": "Coros Vertix 2 setup and app",
    "24": "Coros Vertix 2 offline mapping",
    "29": "Coros Vertix 2 fitness tracking",
    "34": "Coros Vertix 2 battery life",
    "38": "Don't buy it if"
  },
  "links": {
    "GPS sports watch": "https://www.techradar.com/best/running-watches",
    "Garmin Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Coros Pace 2": "https://www.techradar.com/reviews/coros-pace-2",
    "Coros Vertix": "https://www.techradar.com/news/cortos-vertix-is-a-garmin-fenix-competitor-designed-to-go-up-mountains",
    "Stryd Sensor": "https://www.techradar.com/news/best-running-gadgets",
    "Insta360 One R 1-Inch Edition": "https://www.techradar.com/reviews/insta360-one-r-1-inch-edition",
    "best action cameras": "https://www.techradar.com/news/best-action-camera",
    "Insta360 One X2": "https://www.techradar.com/news/insta360-one-x2-is-a-waterproof-successor-to-the-best-360-camera-you-can-buy",
    "best 360 cameras": "https://www.techradar.com/news/best-360-degree-camera",
    "Strava": "https://www.techradar.com/how-to/use-strava",
    "downloads are free from Coros website": "https://uk.coros.com/maps/#/",
    "Garmin Enduro": "https://www.techradar.com/news/garmins-new-smartwatch-has-a-huge-battery-top-features-and-an-eye-watering-price"
  }
}