{
  "source": "https://www.techradar.com/reviews/docebo-learning-suite",
  "title": "Docebo learning suite review",
  "category": "computing",
  "updated": "2021-09-17T14:30:46Z",
  "author": "jonas-p-demuro",
  "summary": "Learning powered by AI",
  "verdict": "Docebo is an enterprise focused learning app, which counts notable Fortune 500 companies among its clients. However, frustrations with seriously buggy apps, opaque pricing, and limited support options make it difficult to recommend.",
  "pros": [
    "Smartphone apps for iOS and Android platforms",
    "Notable clients",
    "Free trial & demo",
    "User forum via Docebo Community"
  ],
  "cons": [
    "Very opaque pricing",
    "Limited support options",
    "Low rated apps",
    "Few specifics on the website"
  ],
  "article": [
    "Docebo is a software as a service (SaaS) learning management system that was started in 2005 in Macherio, Italy by its founder, and current CEO Claudio Erba. It has grown into a global company of over 450 employees, with worldwide offices including in the US.",
    "Docebo had an IPO on the Nasdaq in December of 2020, and currently has over 2,000 customers across over 90 countries including Amazon Web Services, Thompson Reuters, and Walmart.",
    "Docebo focuses on the enterprise market, rather than educational settings to provide education to a company’s workforce. Here Docebo can “Create and manage content, deliver training, and measure the business impact of your programs,” and it does this via a modern, tech focused “AI-based Learning Suite.”",
    "Under the Docebo Suite umbrella are multiple products:",
    "This Docebo Suite is focused on enterprise applications, and according to the company for places that have 300 employees, or more. Such a process that is amenable to this is onboarding where this platform can be suited for e-learning, with a goal for staff retention. This is done by making the process “Social and interactive,” rather than just a series of numbing lectures. Docebo is also designed to scale fully, so that your business will not outgrow it as it moves to the next level.",
    "A significant downside is that the pricing for Docebo is completely opaque. We can certainly be respectful that deployments of products like this are unique, but we would like to see a starting point for the pricing, and an idea of the possible tiers. However, company contact is required, typically by filling out the contact form that requires a business email and a phone number so that needs can be assessed and a custom quote can be created.",
    "The alternate method is the chat box in the lower right hand corner of the screen, and we also tried this method. While we were prepared to explain that we wanted the pricing for this review, while the chat did indicate if we wanted to talk about plans, it asked us multiple times for a business email, and we had no opportunity to explain further, so we would consider this a miss.",
    "A third option provided is a toll free number to speak to one of Docebo’s experts to get plan pricing. There is an offer of a free trial, although the length is not specified, and there is also a free demo.",
    "The support for Docebo could be characterized as comprehensive, but not direct. For the comprehensive piece, there is plenty of well done contact, with information on all types of relevant topics, such as “Creating a New User,” “Creating and Managing Learning Plans,” and “Managing E-Commerce Transactions” among the lengthy list of topics. Users can also browse by the topic.",
    "Unfortunately, if your question is not covered by one of these predone topics, there is no obvious way to get in touch, as we did not find an email, chat, phone number, or support portal to ask a direct question. There was a button to “Talk to an expert now,” but when we pressed it, no direct contact happened, and we were just redirected to another page, with options to “Get a demo,” or “Start a free trial,” which hardly answered any questions that we had. We never like to see a direct phone number for sales, but then no direct phone number to support the product afterwards.",
    "Users also do have the option to connect with fellow users via the Docebo Community. This is a user forum with hundreds of queries, and thousands of replies. We also like the upcoming virtual conference.",
    "Docebo has smartphone apps for both the Android and iOS platforms. This is generally a good starting point to support both smartphone platforms.",
    "On the Android side, on the Google Play store, the app is awkwardly named “Go.Learn” with a period in the middle of the name. Users give it a lukewarm 3.6/5 stars, with a little over 1500 reviews. Drilling down, multiple frustrated users complain of frequent crashes that result in a white screen, lost passwords that can’t be retrieved, and login credentials that are not saved.",
    "To be fair, we also looked at the iOS version of the “Go.Learn” app which goes by the same name. The rating is actually a lower one at 2.1/5 stars, with over 250 reviews. Here, there are also complaints of a blank page when starting up the app, frequent crashes when it does work, and a clunky UI. There are also issues with the password not saving.",
    "Looking across reviews of both versions of this “Go.Learn” app, it is safe to say that it needs more development to enhance stability and usability.",
    "Docebo takes a fully modern, and AI approach to education for employees. The pros include the list of notable clients, a free trial, the enterprise focus, and the social approach to learning. The cons are significant with totally opaque pricing, limited options for direct contact, few specifics of the service, and low rated smartphone apps. Overall, it is hard to give this service a higher recommendation, and while some Fortune 500 companies use it, users should carefully assess the options before going with this platform."
  ],
  "headers": {
    "2": "Features",
    "5": "Plans and pricing",
    "8": "Support",
    "11": "User reviews",
    "15": "Final verdict"
  },
  "links": {
    "Docebo": "https://www.docebo.com/",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "e-learning": "https://www.techradar.com/best/best-online-learning-platforms",
    "free demo": "https://www.docebo.com/products/learn-lms/schedule-demo/",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know"
  }
}