{
  "source": "https://www.techradar.com/reviews/aura-mason-luxe-review",
  "title": "Aura Mason Luxe review",
  "category": "cameras",
  "updated": "2021-11-18T22:36:48Z",
  "author": "andrew-williams",
  "summary": "One of the best digital photo frames you can buy right now",
  "verdict": "The Aura Mason Luxe is a classy photo frame with an unusually good display. It’s far less reflective than a tablet, but offers the pixel-rich sharpness of one, to make your photos look their best. There’s even a cosy social side to Aura’s platform that brings back some of the warm and fuzzy photo-sharing we remember from the early days of social networks.",
  "pros": [
    "Excellent photo sharpness",
    "True-to-life color",
    "Easy to use",
    "Software has a fun social side"
  ],
  "cons": [
    "Only mid-grade display contrast",
    "Brightness isn't fully customizable",
    "Relies on always-on Wi-Fi connection"
  ],
  "article": [
    "The Aura Mason Luxe is one of the best digital photo frames money can buy. It’s surprisingly smart, and elegant enough to avoid the slightly fusty feel that photo frames have gathered over the years. And most important of all, it makes your images look fantastic.",
    "Its high-resolution display takes cues from Apple’s iPad, using the same size and pixel density as the classic 9.7-inch Apple tablets. You need a macro camera lens to see any pixellation in the Aura Mason Luxe, and it makes holiday snaps and family photos look pristine. This is the updated version of the original Aura Mason, which we loved back in 2020.",
    "There’s a social side to this frame, too. You can invite friends and family to add photos to your frame, and they don’t have to be in the same house to do so — 1,000km away from your Wi-Fi network is fine thanks to the way Aura’s photo frames work. Members of this network can 'like' photos, turning it into a micro social network, minus all the hatred and misinformation.",
    "The Aura Mason Luxe’s initial cost is high, but there’s no subscription model here, no further fees to pay down the road. We do have a few minor issues, though. This photo frame can handle video, but we had issues getting it to actually play properly. And while there’s a clever auto brightness mode, we’d appreciate the ability to tweak it, as the Mason Luxe can appear just a little bright for a photo frame at times.",
    "As we go into more detail on the Aura Mason Luxe, we’ll start with the positives before digging more into those little issues.",
    "The Aura Mason Luxe is a modern-looking digital photo frame. We can imagine people who have never seriously considered getting a frame buying this one.",
    "For example, there’s no flip-out stand here. The Aura Mason Luxe’s solid blocky design gives the frame itself enough stability to stand on its own. It can sit portrait or landscape, and feels pretty secure doing so. No alteration of its angle is possible, but has a classic slightly upwards photo frame tilt.",
    "The frame itself is ridged plastic. And in the 'Pebble' finish of our review sample, little darker and lighter flecks give it a granite-like appearance. There’s a lighter Sandstone version, too.",
    "While the feel isn’t quite what you may hope for having read about 'meticulous craftsmanship for a striking sculptural effect' on the Aura website, it does the job of making the Aura Mason Luxe look distinctly different to a smart display.",
    "This digital photo frame has stand-out quality where it really matters: the screen itself. It’s a 9.7-inch LCD with 1525 x 2048 pixels. The pixel density is extremely high for something you’re unlikely to get that close to. And even if you get your eyeball right up to the screen itself, you’ll be hard pressed to notice any pixellation.",
    "Feed the Aura Mason Luxe high-quality images and they look almost perfectly reproduced. This isn’t just an effect of the resolution. Color is strong, too. We pulled up a color test chart image and compared it to the reproduction on a color-calibrated display. The Aura Mason Luxe interpretation looked very similar, with no obvious undersaturation in the deepest reds, greens and blues.",
    "The one slight weakness is in black level because, as far as we can tell, the Aura Mason Luxe uses an IPS panel. These offer wide viewing angles but only moderate contrast. In some of our test images with mixed bright and very dark sections, black areas can look less deep than they might elsewhere.",
    "Still, the Aura Mason Luxe is meant to be an easy and casual way to show your photos at home, and this screen basically nails it.",
    "The brightness of the screen also adjusts automatically based on the amount of ambient light in the room. If you turn the lights off to go to bed, the Aura Mason Luxe will enter a 'sleep' mode to avoid unwanted power use and glow in the corner of your living room.",
    "It would be neat to be able to adjust the relative brightness level, as the Aura Mason Luxe can look slightly bright compared to some rivals. It sits half-way between a printed photo and a Smart Display. However, this is where one aspect of LCD displays usually considered a 'negative' becomes a benefit. There’s brightness loss when viewed from an angle, so that little extra hit of display power is unlikely to be distracting if, say, the Aura Mason Luxe is in your peripheral vision while watching TV.",
    "The screen’s top layer has a semi-matte finish rather than the full matte expected, but we only noticed this when trying to pick up glare off a nearby window. While glare is possible, you won’t see your reflection in the Aura Mason Luxe. This semi-gloss approach seems to offer the best balance of color 'pop' and practicality.",
    "So how do you actually get your photos on the Aura Mason Luxe? Here’s where things get a bit interesting.",
    "It doesn’t operate with a chunk of memory that you fill when photos are in Bluetooth or Wi-Fi range. The Mason Luxe is constantly connected to Aura’s servers, which dish out photos as required.",
    "You use the Aura app to choose photos to add, and the whole process is pretty quick and seamless. Aura says you have 'unlimited' space for media, and the app lets you invite other people to send their own photos to the frame. They can use the app, or a bespoke email address – handy for any relatives who are not big smartphone users.",
    "Within in the app you can change how often the image switches, from 15 seconds to 24 hours, and folks you have invited to add photos can comment on and 'like' your pics. These are shown in a simple Activity Feed screen.",
    "This sort of thing could come across deeply naff, or a way to create a social network no-one asked for. But Aura’s execution of it is actually rather sweet, allowing for the sort of interactions people had on Facebook before it became the 10th circle of hell. Will many people interact with your Aura Mason Luxe if you’re the only one to own such a gadget? Perhaps not, but that’s hardly Aura’s fault.",
    "You can also control the photo frame in a limited way using touch bars on the Mason Luxe itself. We’ve left the protective strip stickers on our photos here to show you where they are. Swipes across the top cycle between photos. Flicks on the side bring up info on image dates and locations, taken from the EXIF info. A double tap on the side 'likes' the image – handy if a friend sends you a holiday pic right from the beach and is keen for some non-Instagram appreciation.",
    "A photo frame you might choose to leave running all day raises the question of power consumption. But according to our testing, the Mason Luxe actually uses less than Aura claims. It says its frames use 10W when awake, 2W when asleep. However, in a room with what we consider normal living room lighting, the frame only actually draws around 4.5W, according to our power meter.",
    "Extrapolated across a year, the Mason Luxe active for 16 hours a day, this means it will use approximately 26kWh. At 13c per kWh, a rough average for the price of energy in the US at the time of review, this frame will cost you around $3.40 to run for a full year.",
    "We also saw nothing too worrying in Aura’s privacy policy. Such things are always subject to change, but Aura says it does not “sell or share your photos or other personal data with other companies” or “use any of the content of your photos to target advertising, sell you things, or otherwise be nosy or creepy.”",
    "Want the bad bits of the Mason Luxe? There are just a couple.",
    "We had trouble getting video to work on the Aura Mason Luxe. Clips up to 30 seconds are supported and Aura says anything that should play on your phone will work on the frame. There’s even a speaker on the back for audio playback.",
    "However, a lot of videos we took didn’t show up in the app, and others that did either would not play back smoothly on the frame, or caused the Aura app to crash. We’re yet to get a video to play properly on the Mason Luxe, despite trying both clips taken with a test phone and downloaded sample videos formatted using the widely supported H.264 format.",
    "There’s also a potential issue for the future over how the Mason Luxe operates. It relies entirely on Aura’s servers, so if the company goes out of business and its servers are retired, the photo frame will mostly likely stop working.",
    "Switch your Wi-Fi off and the Mason Luxe can continue to cycle through a series of images, suggesting it has at least a small amount of internal storage. But after switching it off and turning it on again, it simply shows a connection failure screen. Such issues affect many areas of tech these days, but it seems more relevant in smart home gadgets, where a lot of the companies are smaller and younger."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Design and photo quality",
    "16": "How the Aura Mason Luxe works",
    "22": "Power consumption and usability",
    "30": "Don't buy it if..."
  },
  "links": {
    "Aura Mason": "https://www.techradar.com/reviews/aura-mason"
  }
}