{
  "source": "https://www.techradar.com/reviews/xgimi-halo-portable-projector",
  "title": "XGIMI Halo portable projector review",
  "category": "televisions",
  "updated": "2021-10-01T11:16:33.685Z",
  "author": "mark-knapp",
  "summary": "The ultimate home theater on the go",
  "verdict": "When it comes to portable projectors, there are few more capable than the XGIMI Halo. It has impactful sound, a battery that can last through a movie, and unrivalled brightness. But take it indoors, and it’ll get majorly outshined by the competition.",
  "pros": [
    "Bright on battery",
    "Great portability",
    "Complete package of features"
  ],
  "cons": [
    "Dark scene issues",
    "Software letdowns",
    "Aggressive autofocus"
  ],
  "article": [
    "The XGIMI Halo is a specialty product, and as a portable projector – even an outdoor projector – it may be unrivalled for the complete package of features and capabilities that it offers.",
    "The compact Halo comes in a slick design that’s small enough to slip into a backpack and stylish enough to blend in with the decor at home, even if it’s best utilized away from the living room.",
    "At $799, this XGIMI Halo won’t stand out as a budget product, though it’s actually on the affordable end for native 1080p projectors. There are a few other portable 1080p models on the market, but they pale in comparison to the Halo’s 800-lumen max brightness (which, admittedly, drops to 600 when running on battery).",
    "The XGIMI Halo raises the bar with a movie-ready battery life, dual 5-watt speakers, and a capable Android TV operating system that is quick enough to get the job done – though it shows a little bit of sluggishness and lacks native Netflix support for now. We don’t see many portable projects that can stack up, and that may be what lets XGIMI command a relatively high price for a portable model. Meanwhile, for those on a tighter budget, the XGIMI Mogo Pro is very similar in specification – just a bit dimmer.",
    "That said, the XGIMI Halo won’t be the best option as a home theater projector. While it compares favorably against portable projectors such as the Nebula Solar Portable and Nebula Capsule II, it doesn’t stack up well against the types of projectors that are expected to stay put in one location. Optoma’s HD146X and HD28HDR, for example, both cost less but can hit 3,600 lumens with a 1080p picture, with the latter even doubling as a gaming projector that can run at a 120Hz refresh rate for fast-paced play.",
    "This does put the XGIMI Halo in a bit of a bind. Theater enthusiasts may not be satisfied with the brightness and picture of the Halo, especially because of somewhat distracting video noise in dark scenes. Meanwhile, casual viewers who want a projector they can pop-up at home, in their yard, or on camping trips may be just as satisfied with a more affordable, slightly dimmer option. But, for anyone who needs flexibility and wants the best projector that can fit that need, the XGIMI Halo will prove a worthy choice.",
    "The XGIMI Halo is available now for $799 in the US, £729 in the UK, and AU$1,399 in Australia. You can find it on XGIMI.com or Amazon.",
    "For higher-specified models, you may want to consider the XGIMI Horizon, an HD beamer with a $1,099 / £1,099 price tag – or the Horizon Pro 4K projector for $1,699 / £1,699.",
    "The XGIMI Halo is an elegant piece of technology. Even if it’s built out of hard plastics, the color scheme and shape can almost pass for something more premium in build, particularly with the grille design wrapping around the front and sides of the device.",
    "There’s a small downside to its simplicity, though. The projector itself only has four built-in controls: pause/play, volume up, volume down, and power on/off. This means you’ll absolutely need to keep track of your remote control to manage everything else like navigation, settings, and focus. The remote is fairly typical for Android TV devices, bearing a strong resemblance to that of the BenQ X1300i projector.",
    "The entire unit takes up incredibly little space for something that packs in so much. It measures just 113.5 x 145 x 171.5mm, roughly half the size of a typical shoe box. In that space, XGIMI has fit a Full HD DLP projection system, an autofocus sensor, a pair of Harman Kardon-tuned 5W speakers, a battery, and all the smarts necessary to run Android TV along with Wi-Fi and Bluetooth connectivity. The whole device weighs just 1.6 kilograms, making it readily portable, though the external power supply is a bit larger and adds more weight if taking it on the go. The Halo’s weight can make it a little tricky – but not impossible – to set up on a smaller tripod, though it has a small stand on the bottom to help you find the right angle without one.",
    "You don’t need any extra gear to use the Halo properly, either. Just get it set up with a Google account for Android TV, and it can stream content it pulls directly. The speakers pack a nice punch and are loud enough to fill a small room. The cooling system is almost inaudible, too, and easily drowned out by the speakers. With the Halo’s internal battery, you don’t even need to connect the XGIMI Halo to the power outlet to run it.",
    "XGIMI’s implementation of Android TV isn’t quite perfect, though. Netflix won’t run on it, which could be a complete deal-breaker for some. The same was once true for Amazon Prime Video, but XGIMI has since fixed that omission, showing that it isn't just ignoring the issue.",
    "A second issue is just that the Android OS is a tad slow here. It’s not painstaking, but compared to Google’s latest Chromecast, XGIMI’s software just isn’t as snappy and feels especially slow when it comes to Google Assistant, taking more than a second to start listening.",
    "When you do want to step outside of the built-in streaming apps, the XGIMI Halo features an HDMI 2.0 port on the rear as well as a USB 2.0 port. You can also opt to use other speakers or headphones by connecting them to the rear 3.5mm jack or pair them via Bluetooth.",
    "The XGIMI Halo’s battery is a serious one. In our testing, we were able to get over 2 hours of playback before the projector switched into low-battery mode, and it continued running for 2 hours and 48 minutes before shutting itself down. It’s definitely got enough juice for a movie away from the power outlets, just maybe not Avengers: Endgame. It is a little annoying that the operating system doesn’t clearly indicate the percentage the battery is at, though.",
    "Much like the rest of the package, the XGIMI Halo’s picture quality is excellent, but not without its flaws. While plugged in, the projector’s 800 lumens are plenty bright for dark room while projecting an image upwards of 80 inches, and we find they can even hold up with some 60W overhead lights on in the room as long as we’re watching something with mostly bright visuals (like King of the Hill or Bob’s Burgers) and staying underneath a 40-inch screen size. Unplugged, the projector drops to 600 lumens, which is still good for a large image in a dark room. It works modestly outdoors, too, though streetlights can put a damper on visibility.",
    "The XGIMI Halo uses an LED-lit DLP system that produces a sharp and vibrant image. At 1080p, the grain can start to show up when stretching the picture to larger sizes, but even projecting over 75-inches, it hasn’t been glaring. The colors really pop in brighter scenes, as we saw in Bladerunner 2049, which definitely helps give the XGIMI Halo some pizzazz for the casual home theater setting. We don’t notice any odd artifacts in the brighter colors either.",
    "It’s when the scene gets dark that the XGIMI Halo, like many other projectors, has more trouble. The projector struggles a bit with shadow detail, and that’s made worse by some very visible dithering – which is when the projector rapidly switches between two colors or brightness levels in order to try and reproduce a shade that it can't natively reproduce. It's the equivalent of switching a light switch on and off to get a median brightness, and here can look like there's a pattern squirming across the screen.",
    "This dithering is most noticeable in dark scenes when there are large areas of mostly uniform color.",
    "In movies and TV, it’s not terribly distracting, since our focus will generally be on lit areas of the shot, but that sense of motion created by the dithering is far more distracting in games. It can also be an issue in shots with tons of detail, as the hard edges and shadows in more intricate shots have that dithering going on all over just on a smaller scale. This effect is also less noticeable when the picture is smaller, say 55 inches or less.",
    "The XGIMI Halo is designed to help get you the best picture possible, almost automatically. It comes with auto-focus enabled out of the box, as well a dynamic focal length compensation feature that’s meant to adjust the focus in response to how the lens shifts as it heats up.",
    "The projector also supports automatic vertical keystone adjustment along with manual control for both horizontal and vertical keystone, up to 40 degrees, and digital zoom to shrink the image. Throughout our testing, we never notice issues with our manual focus changing during use.",
    "However, the automatic features will occasionally shift the focus about while we’re watching, which is particularly distracting, and it doesn’t always seem to land on a perfectly in-focus picture. It may be that the speakers are vibrating the device enough to think it needs to fix the focus. The keystone and zoom are digital, though, so the projector is still shining a dark gray wherever the picture isn’t."
  ],
  "headers": {
    "0": "One minute review",
    "6": "Price and availability",
    "8": "Design and features",
    "16": "Picture quality",
    "24": "Don't buy it if…"
  },
  "links": {
    "outdoor projector": "https://www.techradar.com/best/outdoor-projector",
    "projectors": "https://www.techradar.com/best/4k-projector",
    "home theater projector": "https://www.techradar.com/best/4k-projector",
    "Nebula Capsule II": "https://www.techradar.com/reviews/anker-nebula-capsule-ii-mini-projector",
    "gaming projector": "https://www.techradar.com/news/should-i-buy-a-gaming-projector",
    "Horizon Pro": "https://www.techradar.com/reviews/xgimi-horizon-pro-4k-projector",
    "BenQ X1300i projector": "https://www.techradar.com/reviews/benq-x1300i-4k-gaming-projector"
  }
}