{
  "source": "https://www.techradar.com/reviews/pc-mac/software/utilities/keepsolid-vpn-unlimited-1325618/review",
  "title": "VPN Unlimited review",
  "category": "computing",
  "updated": "2021-05-11T11:44:00Z",
  "author": "mike-williams",
  "summary": "Fast and powerful protection from this popular VPN provider",
  "verdict": "This VPN has great WireGuard speeds and unblocks Netflix with ease, but if you'll regularly hit the five device limit, its painfully inflexible device management system will be a major hassle. There's still a lot to like here, though, so take the trial anyway, and see what you think.",
  "pros": [
    "Excellent WireGuard performance",
    "Unblocks Netflix, iPlayer, Disney+",
    "Very fast email support",
    "Bitcoin supported"
  ],
  "cons": [
    "Some kill switch issues",
    "Relatively few servers",
    "Access limited to specified devices",
    "Didn't unblock Amazon Prime Video for us"
  ],
  "article": [
    "New York-based KeepSolid's VPN Unlimited is a capable VPN service with some unusual features that you won't always find elsewhere.",
    "The network looks a little small at only '500+ servers' (ExpressVPN claims over 3,000, NordVPN 5,400+), but they're widely spread across more than 80 locations, with the most recent additions including Libya, Serbia, Costa Rica, Bosnia and Herzegovina.",
    "P2P is supported, though only at five locations: Canada, France, Luxembourg, Romania and the US (California).",
    "Protocol support includes OpenVPN, IKEv2 and the speedy WireGuard. There's a further protocol bonus in the company's own KeepSolid Wise, which redirects traffic through the TCP 443 and UDP 33434 ports to theoretically make it more difficult to detect and block.",
    "KeepSolid suggests Wise is ideal for users in China, Iran, Saudi Arabia and anywhere else which takes a dim view of VPNs and actively tries to block their use. It has to be worth a try, but if it doesn't work, there are other providers who offer detection blocking ideas of their own (VyprVPN's Chameleon, IPVanish's 'Scramble').",
    "A 'DNS Firewall' is a web filtering system which blocks access to malicious and phishing domains, and enables blocking websites by content type (adult, gambling, social networking and so on.)",
    "The service has impressively wide platform coverage, with downloads for Windows, Mac, Android, iOS, Linux, Windows Mobile and Apple TV, a handy collection of browser extensions for Chrome, Firefox, Opera and Edge, and setup instructions for routers, Kodi, Chromecast and more.",
    "VPN Unlimited supports up to five devices on a standard account, but this is a little more complicated than usual. While other providers typically support five simultaneous connections from any combination of devices, VPN Unlimited has five 'slots' which are allocated to particular devices or browser extensions (a Windows client and Chrome extension on the same system will fill two slots) as you connect them.",
    "Once those slots are filled, you won't be able to connect with any new devices until you log in to the website and delete one of the old devices. Oh, and if you run out of free devices, or you replace several, you can only delete one active device a week, potentially a major hassle.",
    "Suppose you're using all your slots, for instance, but then upgrade three devices at the same time. You're only able to delete one of the old devices per week, which means it'll be two weeks before you can use all your new hardware with the VPN.",
    "KeepSolid does have a solution – sort of – in that you're able to buy further slots at extra cost. How generous. (Keep in mind that Windscribe, Surfshark and Zenmate have no limits at all.)",
    "Topping the recent improvements list is the extended unblocking performance, and the company now claims support for an additional 17 services: HBO Now, Disney Plus, ESPN+, Fubo TV, TNT, Popcornflix, CBS, Channel4/All4, Tubi, Pluto TV, Philo, Hotstar, Vudu, Mubi, Showtime, Starz, Peacock.",
    "Elsewhere, support for two factor authentication (2FA) should improve the security of your account. And if you run into technical problems with that, or any other part of the service, KeepSolid has a web knowledgebase with troubleshooting advice, and a support team is on hand 24/7 to answer your questions via ticket and email.",
    "KeepSolid's monthly plan covers up to five devices for $9.99, dropping to $5 a month if you pay for a year up-front. That's fractionally above average, and you'll find better annual deals with the likes of CyberGhost ($3.99 a month), Hide.Me ($3-$3.75) and Private Internet Access ($3.33.)",
    "The company previously offered a three-year plan for an appealing $2.78 a month, but unfortunately, that's been ditched. The only additional option is a lifetime VPN plan for a one-off $199.99, That's the equivalent of $16.67 a month if you only use it for a year, $5.56 if you keep it for three years, $3.33 over five years - you get the idea.",
    "While lifetime plans sound good in theory, the reality is usually very different. Right now Ivacy offers five years of service for just $80, for instance. Even if that's $120 on renewal, you'll need to be using VPN Unlimited for more than ten years before it even starts to save you money. There's no way to be sure the company will be the best service for you, by then, or even whether it'll still exist, and on balance we wouldn't recommend committing to any more than the annual plan.",
    "KeepSolid VPN is now also available as part of a package called MonoDefense, which is essentially the VPN bundled with the password manager Passwarden. Upgrading to MonoDefense costs $10.99 billed monthly (an extra $1), $5.83 on the annual plan (a $0.84 premium), or $299.99 for the Lifetime option (that's a $100 hike.) We're not looking at Passwarden here, but for comparison, the excellent Dashlane bundles a password manager and simple VPN for $3.33 on its own annual plan.",
    "Whatever your preferred option, VPN Unlimited supports paying by card, PayPal and Bitcoin. Unusually, there's a 10% discount for using PayPal, for example cutting the cost of the one-year plan from $5 to $4.50.",
    "VPN Unlimited protects your privacy by using only the strongest VPN protocols. No legacy PPTP or L2TP options here: your main options are WireGuard, OpenVPN and IKEv2.",
    "The apps also offer KeepSolid's own Wise technology. This takes the core OpenVPN protocol, scrambles and obfuscates it a little, and maybe routes it a little differently to a regular connection. While this might reduce speeds, it could help you bypass VPN detection and blocking systems used in countries like China, allowing you to connect from almost anywhere.",
    "There's more good news in the app's ability to automatically connect to the VPN whenever you access an untrusted network, ensuring you're always protected.",
    "The Windows and Mac apps also benefit from a kill switch to block your internet if the VPN drops. (The Windows kill switch doesn't work exactly as it should, but we'll talk more about that later.)",
    "The Windows client has gained a 'Stop DNS Leak' setting since our last review, too, and it does its job well. We ran checks at IPLeak, DNS Leak, DNS Leak Test and others, and found no sign of DNS, WebRTC or other data leaks.",
    "The VPN Unlimited website places a 'Zero-log policy' first in its list of features, and for once you don't have to dig your way through a jargon-packed Privacy Policy to find out more - a very readable No Log VPN page explains (almost) all.",
    "The company explains that there's no logging of browsing history, connection times, metadata, downloads, server usage, data content or IP addresses (the server must store your connection IP address to communicate with you, but that's deleted when the session ends.)",
    "The service stores your geographic location, OS version, language and type of connection, but these are also deleted when you close the VPN connection.",
    "VPN Unlimited also logs your device names or codes, unique identifiers which allow the company to enforce its device limits (it can't restrict usage to five specific devices unless it can identify those devices when they connect.)",
    "That's a little more revealing than it sounds. VPN Unlimited didn't just create some cryptic ID for our Windows system, it used a combination of the computer name and the name of our Windows user account. If there's no logging of activity, that can't help anyone connect an internet action to your KeepSolid account, but we're still a little uncomfortable about a third-party holding that level of information about our devices.",
    "These smaller concerns aside, there's no sign of VPN Unlimited taking any logging liberties with your personal data. We'd like more reassurance than words on a website, though. Other providers are increasingly going through third-party audits to verify their no-logging claims – TunnelBear has annual independent audits of its apps, infrastructure, website and more – and we hope VPN Unlimited will do the same, very soon.",
    "We use multiple speed test services and apps to assess VPN performance, including SpeedTest.net, the SpeedTest command line client (for simplicity), Netflix' Fast.com, TestMy.net and more. We run each test five times with at least two protocols in UK and US locations, repeat the full test set in morning and evening sessions, then examine the data and calculate median speeds.",
    "UK OpenVPN speeds varied considerably at 85-490Mbps on a 1Gbps connection, but WireGuard was excellent at 500-520Mbps in the best session.",
    "Our US location tested IKEv2, but results were disappointing at just 40-50Mbps on a 600Mbps connection. OpenVPN was better, though still behind the UK at 140-150Mbps, but switching to WireGuard saw speeds leap to 380-390Mbps.",
    "There are some surprisingly low figures here - we're unclear why IKEv2 connections should be quite so slow, for instance - but it's possible some of these were due to temporary testing issues. Of course you don't have to use IKEv2, either, and what's clear is that switching to VPN Unlimited's WireGuard connections can deliver excellent performance, comparable with some big names (CyberGhost's US WireGuard speeds hit 350-450Mbps, Hide.me's 390-420Mbps) though still lagging a little behind the best (StrongVPN reached 590-600Mbps, ExpressVPN's Lightway protocol reached 490-630Mbps.)",
    "A good VPN doesn't just give you a new virtual location, it ensures that your identity is sufficiently undetectable that it gets you access to all kinds of geoblocked content.",
    "To get a feel for a VPN's unblocking abilities, we normally connect to up to three of its UK and US servers, then check to see whether BBC iPlayer, US Netflix, Amazon Prime Video and Disney+ allow us access to their content.",
    "The VPN Unlimited apps simplify the process of server selection by highlighting recommended iPlayer, Netflix, Disney+, Amazon Prime and other locations on their regular server lists. That's far more convenient than the average VPN, where you might have 10 or more US servers to choose from, but must try them all, one after the other, until you find which (if any) works with your preferred content provider.",
    "The system got off to a great start when we connected to the UK server recommended for accessing iPlayer, and it worked just fine. We logged in twice more, but all three IP addresses got us access.",
    "US Netflix is the gold standard for content unblocking, but again, VPN Unlimited passed all tests without difficulty.",
    "Amazon Prime Video didn't work for us, with the site detecting the VPN and locking us out. But VPN Unlimited ended on a high note, getting us in to Disney+ on all three attempts.",
    "These are fair results, and we've found Amazon Prime Video can defeat many VPNs (Hide.me, HideMyAss and IPVanish all failed during testing.) Others are more successful, though, and in our most recent tests, CyberGhost, ExpressVPN, Hotspot Shield, Ivacy, NordVPN and Surfshark each unblocked all of our test sites.",
    "VPN Unlimited supports torrents, at least in theory, but the company isn't exactly enthusiastic about it. A support site FAQ asking 'is BitTorrent allowed on all servers?' is answered with a distinctly grumpy: 'The primary use of KeepSolid VPN Unlimited is not to download torrents, but to offer online security.'",
    "That's not all, with the answer going on to warn that: 'There are limited cases when our technical team has to subside connection speeds due to torrenting.' Presumably this means cut, or throttle, one or more user's speed.",
    "That compares poorly with VPNs who promise they'll never throttle connections. It also leaves us wondering how VPN Unlimited would know they have 'subsided' connection speeds 'due to torrenting.' Is VPN Unlimited monitoring user connections to identify the protocols they're using? If so, that's another black mark when compared to the top competition.",
    "Even if you're unconcerned about that, there's more bad news in torrent support across the network. VPN Unlimited supports P2P on just a small fraction of its locations; five in total. They're well positioned for North American and European customers (Canada, USA, France, Luxembourg, Romania), but users elsewhere in the world may see disappointing download speeds, and it's another torrenting hassle you don't see with the best of the competition.",
    "VPN Unlimited tries to sound a little more encouraging in other areas of the site, but with mixed results. The main torrent page begins with a faintly disbelieving 'even though downloading torrents is illegal in some countries, in a present-day reality it still remains popular', for instance, but goes on to claim: 'KeepSolid VPN Unlimited is your perfect tool for hiding your IP address while torrenting.'",
    "We're not so sure about 'perfect', but tests showed the service worked as advertised: we had no issues downloading torrents from the five specialist locations, but when we tried a couple of others, our client refused to connect to any peers. We saw no other hassles from trying to use P2P on an unapproved server, which is good news (when we tried using P2P with Norton VPN, it closed our connection immediately.)",
    "If torrents aren't your top priority, or maybe you never use them at all, this might not matter much. VPN Unlimited supports them, and you can protect torrent downloading whenever you need to do so. But if torrenting is a priority on your VPN shopping list, VPN Unlimited may not be the best choice.",
    "VPN Unlimited was easy to set up, and followed much the same rules as you'll see with any other service you buy online. Choose a plan, hand over your email address to create an account, download and install the client. Simple.",
    "Manually setting up OpenVPN GUI or other OpenVPN-compatible apps is more of a challenge. Unlike most VPNs, KeepSolid doesn't have a single archive with all the OVPN configuration files you need. Instead you must generate them, one by one, from the website.",
    "The company also requires that you generate different OVPN files for each device, as they have separate logins. Oh, and if you're using them with OpenVPN GUI, or anything else which displays the file name, you'll want to rename every one, as KeepSolid uses a naming convention which is, well, inconvenient (try 3237FF6D3B9A7C7A7015B20312CEEB45_bg_openvpn.ovpn, for instance, rather than Belgium.ovpn for VyprVPN).",
    "This isn't quite as dumb as it sounds. The standard OVPN files used by other providers leave you needing to manually enter your username and password to connect, or store them within your app. KeepSolid's more customized files automatically include your credentials, ensuring you'll never have to enter a login on any device. Still, manually generating files one-by-one is a tedious task, and life would be much easier if KeepSolid updated the system to allow multiple server files to be set up in a single operation.",
    "The VPN Unlimited Windows client opens with a world map indicating its various locations, and an arrow indicating the location of your current IP.",
    "Although this looks good, you can't zoom in, pan around, click a location to log in, or perform any other useful actions. It's just a simple static image, and doesn't begin to match the truly excellent IPVanish map interface.",
    "The real action takes place in a more conventional server list. Locations are organized alphabetically, each one with a Workload icon to help you make the best choice. There are separate lists for specialist servers (streaming, torrents), and a Favorites list for your most commonly used locations.",
    "If you need more performance information, an optional Ping Test took only 3-4 seconds to run on our test system, and added a ping time for each location.",
    "Scroll down, find a server which appeals, and you can connect and disconnect with a click. The client gets extra points for using standard Windows notifications to let you know when your traffic is protected, and when it's not.",
    "A Settings box includes several useful options. You can manually switch protocols between WireGuard (now out of beta and working well), OpenVPN, IKEv2 and KeepSolid's own Wise UDP and Wise TCP.",
    "A DNS leak feature reduces the chance of your DNS requests being sent outside the tunnel.",
    "A Trusted Networks option enables building a whitelist of networks where the VPN will be deactivated. If you only use a VPN to protect your activities on public wireless hotspots, for instance, you could automatically turn the VPN off at home, or anywhere else you're sure that you are safe.",
    "Elsewhere, there's a basic Run on Startup option to run the client when Windows starts (but you can't define a startup connection), and a Password Protection feature which asks for your account password when it starts, preventing others using the VPN.",
    "The major feature here is the kill switch. This should block internet access if the VPN connection drops, reducing the chance of any data leakage. At least, that's the theory.",
    "To test the feature, we connected to a VPN Unlimited server, and tried terminating the processes managing our OpenVPN and WireGuard connections, and manually closing various TCP connections used by the client.",
    "The client managed the basics well. Whether we killed OpenVPN.exe or shut down an IKEv2 connection, a notification warned us of the problem, the client automatically reconnected, and all systems were go in a few seconds. Our traffic was never left unprotected.",
    "While that simulates the most realistic real-world issue, a quality app must also be able to handle all kinds of other odd issues - the OpenVPN.exe process crashes, someone turns off the router, the VPN service stops, whatever it might be. We include these and other situations in our tests to see if the app keeps you safe, even in strange situations the developer might not have considered.",
    "These tougher tests highlighted one vulnerability, when we closed TCP connections that the client uses to communicate with the VPN Unlimited Windows service. An alert warned us that the connection was lost, but this appeared behind our current window, so was easy to miss. And although the kill switch was enabled, it hadn't kicked in, so our traffic was now unprotected.",
    "VPN Unlimited's kill switch does a good job of protecting you from the most common issues, then, but there's at least a theoretical risk of it failing, and there's clearly more work to do before it's truly bulletproof.",
    "Much like the Windows client, KeepSolid's Android VPN app opens with a world map showing its various locations. But unlike the Windows map, the Android version is dynamic – genuinely useful, rather than just basic eye candy.",
    "You can zoom in and out with this map, for instance. Drag to pan around. Tapping one of the location markers displays its name, tapping again gets you connected, with a line flying from your current location to the new one to show the route. Maps still aren't our preferred way to navigate any VPN client, especially on a mobile screen – there's too much zooming in and out to access some servers – but this app has at least tried to make it work.",
    "Tapping the location name at the bottom of the screen displays the more standard country list. This works much like the Windows client: a workload figure highlights the least and most-used servers, ping times are available if you need them, and there's a Favorites list to store your most commonly used locations. Torrent-friendly and recommended streaming servers are highlighted, or you can view all the best streaming servers on a separate tab.",
    "A relatively sparse Settings dialog starts with an option to change protocols. There's more choice than you'll usually see in a mobile app, though, with OpenVPN or KeepSolid's Wise option (in either TCP or UDP forms), IKEv2 and the best performer in our speed tests, WireGuard.",
    "The app doesn't have a built-in kill switch, unfortunately. You can set up one manually via Android's system settings, but that's not as convenient as being able to manage the setting locally.",
    "Welcome bonus options include the ability to automatically connect for insecure networks or disconnect for trusted networks, an App Exceptions feature which enables defining apps which won't use the VPN (similar to the split tunneling feature you'll see elsewhere), and KeepSolid's DNS Firewall to block access to malicious websites.",
    "Put it all together and KeepSolid's Android app is a likeable tool, and better designed in some ways than its Windows offering. It's still mostly about the basics, though, and we've seen more powerful Android apps available elsewhere.",
    "KeepSolid's iOS VPN app follows the same basic interface and operating rules as its Android cousin.",
    "A world map allows you to zoom in, pan around and select individual locations. It works, and it looks good, but as ever with map interfaces, it's a cumbersome way to operate a VPN, especially on a small screen.",
    "A conventional list is more straightforward to use. You're able to scroll directly to the options you need, view server loads and ping times to identify the best choices, or save locations as Favorites for speedy recall later.",
    "A Settings pane enables switching protocols as required. You can choose between OpenVPN, IKEv2, WireGuard, and KeepSolid's own Wise TCP and Wise UDP. That kind of choice is unusual for an iOS VPN app.",
    "Auto-connection options allow users to have the app connect to the VPN when you access all, or just untrusted, wireless networks.",
    "As with the Android app, there's no built-in kill switch.",
    "Overall, KeepSolid's iOS app left us feeling much the same as the others in the range. It's capable, it does the job, and the WireGuard support is welcome, but it's a little short on low-level tweaks and functionality, and there are better VPN apps around.",
    "Connecting to a VPN through an app will usually direct all your system traffic through the tunnel. That's great for protection, but it could also cause trouble, for example if some of your applications don't work with the VPN, or there's a noticeable drop in performance.",
    "KeepSolid's Chrome, Opera and Edge extensions work as proxies, only protecting your browser traffic. That's not great for privacy, but it could be all you need for website unblocking, and a browser-based interface makes it very convenient to use.",
    "The Chrome extension looks good and is easy to operate. It opens by displaying your current location and IP address; you can connect to the fastest server with a click, or choose another as required.",
    "The extension only has the most basic of location pickers. There's no server workload data, no ping times, no Favorites system, just an alphabetical list of country names and a Search box. Still, there's no doubt that keeps it easy to use.",
    "There's a similar stripped-back look to the Settings box, where you'll find only two significant options: WebRTC leak protection, the ability to use KeepSolid's stealthy Wise protocol, and a setting to automatically connect when your browser launches.",
    "These are useful features, but some rivals give you much more. Hotspot Shield's Chrome extension allows you to choose which server to connect to when your browser starts, and the ability to define whether individual websites are accessed through the VPN, or not. It also throws in basic ad, cookie, tracker and malware blocking, for free.",
    "Would the Firefox extension give us any extra functionality? We installed it to check, and found that the answer was no. In fact, it is identical to its Chrome cousin in every detail. (Full marks for consistency, even if we would have liked more power.)",
    "KeepSolid's add-ons aren't bad, then, but they have no significant feature surprises which might win you over, and a shortage of updates (the last Chrome version is more than a year as we write) suggests this isn't changing any time soon.",
    "VPN Unlimited's first line of support is its web knowledgebase, where you'll find various installation guides and a scattering of FAQ pages.",
    "These articles are often short on detail and poorly structured. For example, the guide on how to use the Windows client wastes space explaining what menu items like 'Leave feedback', 'Check for update' and 'Support' mean, and pointing you to website links so you're able to buy more stuff. But it can't find the time to properly cover the available protocols or suggest when and why you might want to change them.",
    "That's a pity, because there is useful content elsewhere, like this protocols primer and a basic protocol comparison. But these are only rarely referenced from the manuals and other documents, making it far more difficult to find the information you need.",
    "The support site claims to offer live chat support, and pointed us to a couple of links. But one just opened the New Message window of our email client, while the other opened a contact form, prompted us to enter our details and question, and explained that the support team would get back to us via email.",
    "Although email support will never be as convenient as the live chat available with providers like ExpressVPN, KeepSolid gets as close as we've ever seen, with a helpful and accurate response arriving within minutes of posting our question. A fluke? Nope. It was the same story for our last two reviews. We would still like to have live chat as an option, but if email responses can be this speedy, it's not a significant issue.",
    "KeepSolid offers excellent performance for a fair price, and apps that run on almost everything. It's short on servers, the device management is annoying, and the Windows kill switch needs work, but if you can live with those hassles, it's well worth a look."
  ],
  "headers": {
    "13": "VPN Unlimited plans and pricing",
    "18": "Privacy",
    "23": "Logging",
    "29": "Performance",
    "33": "Netflix and streaming",
    "40": "Torrents",
    "47": "Manual setup",
    "51": "Windows client",
    "66": "Android app",
    "73": "iOS app",
    "80": "Browser extensions",
    "88": "Support",
    "93": "VPN Unlimited review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "five locations": "https://keepsolid.pxf.io/c/221109/347470/5159?subId1=trd-us-6660417555195278000&sharedId=trd-us&u=https%3A%2F%2Fwww.vpnunlimitedapp.com%2Fhelp%2Ftorrents",
    "setup instructions": "https://keepsolid.pxf.io/c/221109/347470/5159?subId1=trd-us-6927907062430755000&sharedId=trd-us&u=https%3A%2F%2Fwww.vpnunlimitedapp.com%2Fdownloads%2Fwindows",
    "Windscribe": "https://www.techradar.com/reviews/windscribe",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "Zenmate": "https://www.techradar.com/reviews/zenmate",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "monthly plan": "https://www.vpnunlimited.com/pricing",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Hide.Me": "https://www.techradar.com/reviews/hideme-vpn",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "lifetime VPN plan": "https://www.vpnunlimited.com/pricing",
    "Ivacy": "https://www.techradar.com/reviews/ivacy",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Passwarden": "https://www.techradar.com/reviews/passwarden",
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "annual plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4412956587028450300&xs=1&url=https%3A%2F%2Fwww.dashlane.com%2Fplans&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpc-mac%2Fsoftware%2Futilities%2Fkeepsolid-vpn-unlimited-1325618%2Freview",
    "VPN protocols": "https://www.techradar.com/vpn/vpn-protocols-and-which-is-the-best-to-use",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "No Log VPN page": "https://keepsolid.pxf.io/c/221109/347470/5159?subId1=trd-us-6598551110288625000&sharedId=trd-us&u=https%3A%2F%2Fwww.vpnunlimitedapp.com%2Fhelp%2Fmore-about-vpn%2Fbest-no-log-vpn",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn",
    "main torrent page": "https://www.vpnunlimited.com/help/torrents",
    "WireGuard": "https://www.techradar.com/vpn/what-is-wireguard",
    "Android VPN app": "https://www.techradar.com/vpn/best-vpn-for-android-our-5-top-choices",
    "iOS VPN app": "https://www.techradar.com/vpn/the-best-vpn-for-iphone",
    "browser": "https://www.techradar.com/best/browser",
    "how to use the Windows client": "https://keepsolid.pxf.io/c/221109/347470/5159?subId1=trd-us-6944573573976825000&sharedId=trd-us&u=https%3A%2F%2Fwww.vpnunlimitedapp.com%2Fhelp%2Fmanuals%2Fhow-to-use-on-windows",
    "this protocols primer": "https://keepsolid.pxf.io/c/221109/347470/5159?subId1=trd-us-1361080498745540000&sharedId=trd-us&u=https%3A%2F%2Fwww.vpnunlimitedapp.com%2Fhelp%2Fvpn-protocols",
    "basic protocol comparison": "https://keepsolid.pxf.io/c/221109/347470/5159?subId1=trd-us-1244444670920373500&sharedId=trd-us&u=https%3A%2F%2Fwww.vpnunlimitedapp.com%2Fhelp%2Fvpn-protocols%2Fcomparison"
  }
}