{
  "source": "https://www.techradar.com/reviews/garmin-vivoactive-4",
  "title": "Garmin Vivoactive 4 review",
  "category": "fitness",
  "updated": "2021-04-07T13:55:52Z",
  "author": "andrew-williams",
  "summary": "The Garmin Vivoactive 4 isn't the same as a Forerunner watch, but is a solid, more affordable option",
  "verdict": "The Garmin Vivoactive 4 puts the tech smarts of the watches used by the ultra-marathon-running elite into a more accessible wearable. You may not get all the pro-style advice of a Forerunner, but you do get the rest.",
  "pros": [
    "Great exercise tracking, with full GPS",
    "On-watch music streaming",
    "Stacks of stats"
  ],
  "cons": [
    "ANT+ HR broadcast mode does not work well yet",
    "No Performance Condition/training load monitoring",
    "Spotify/Deezer integration should be more friendly"
  ],
  "article": [
    "The Garmin Vivoactive 4 is part of Garmin’s rapidly expanding range of touchscreen running watches, and sits in the middle of the lineup in terms of both price and features.",
    "The Vivoactive 4 is still significantly cheaper than the company's Fenix and Forerunner flagships, and smart changes to the controls mean you are much less likely to accidentally pause and stop exercise tracking with touchscreen swipes and prods.",
    "It’s a great fitness tracker, as long as you're happy to miss out on some of the month-to-month monitoring stats offered by Garmin's more advanced devices.",
    "It's possible that we might see a new Vivoactive 5 in the coming months, hopefully with updated hardware for the same launch price. Alternatively, Garmin might choose to do what it did with the Instinct, and release a slightly updated version with added solar charging to keep the battery topped up for long durations.",
    "If you're not sure whether to opt for the Vivoactive 4 or save some cash by picking up the previous model, see our complete comparison: Garmin Vivoactive 3 vs Garmin Vivoactive 4.",
    "The Garmin Vivoactive 4 was announced in September 2019 at the IFA conference and it is a follow-up to 2017’s Vivoactive 3.",
    "It was priced at $349.99 (£259.99, AU$499.99) at launch, but can now be snapped up for around $300. That’s a little more than the Garmin Forerunner 645 Music, and loads less than either a Forerunner 945 or Fenix 6.",
    "The Vivoactive 4 is a good route to Garmin watch tracking without blowing a huge hole in your finances. If you want a more affordable alternative, you could opt for the Vivoactive 3, though this older model is now starting to get quite outdated.",
    "The Garmin Vivoactive 4 looks fairly similar to the Vivoactive 3 and Foreunner 645. A band of silver, but not chrome-bright, metal sits around the edge of the watch. Its screen is protected by Gorilla Glass 3 tech, but it's not recessed like the Fenix 6’s, making it slightly more vulnerable. Every bit of such protection adds to a watch’s dimensions, though.",
    "We switched to the Vivoactive 4 from using the Forerunner 645 Music. It’s the watch we use to track runs week-to-week.",
    "The Vivoactive 4 is larger, and it's significantly so. But just buy a Vivoactive 4S if a slim watch is what you want as it has similar features with a slightly smaller screen and battery.",
    "This is a comfortable watch to wear, but again the Forerunner 645 wins out slightly here. The Vivoactive 4’s standard silicone band is thicker and has less “give” than the Forerunner’s. The lighter and smaller a watch is, the less likely you are to notice it is even there on your wrist after a few hours.",
    "We find we tend to take the Vivoactive 4 off for a few hours each day. You only end up with angry-looking indentations on your wrist if you do the strap up extra-tight.",
    "There’s no need to take it off, apart from to charge, if you are happy to wear it all day. The Vivoactive 4 has 5ATM water resistance, sufficient not just for showering but swimming too.",
    "The Garmin Vivoactive 4 has a 1.3-inch screen of 260 x 260 pixel resolution, the same specs as the Fenix 6.",
    "This display won’t look too impressive to those who haven’t owned a Garmin or similar watch before. These are transflective screens, meaning they reflect light so they become clearer on a bright day.",
    "This is the polar opposite of the LCD and OLED screens used in a lot of other smartwatches. They have to increase brightness to compete with sunlight, rather than being 'powered' by it.",
    "The Garmin Vivoactive 4 also emits light, so you can see the display in a dark room. But this light only comes on when you interact with the watch or give it a wrist flick towards your face. This screen uses very little power when non-lit, and displays content 24/7, until the battery dies.",
    "This is still the best kind of screen for outdoor run training. You don’t have to worry about flicking your wrist so you can see your pace mid-run. It’s just there, on-screen, the whole time. And there’s no battery tax involved.",
    "The Vivoactive watches have fewer buttons than those in the Fenix and Forerunner series, because they are a touchscreen trackers. Garmin has put two buttons on the Garmin Vivoactive 4, rather than the one on the Vivoactive 3, though.",
    "This is likely a response to complaints it is far too easy to accidentally pause or end a workout with the Vivoactive 3.",
    "During exercise, the Vivoactive 4’s screen is used to flick through information screens. But to pause and stop tracking, you use the buttons. The result? We’ve had zero of the issues many Vivoactive 3 owners have experienced.",
    "You might assume the Garmin Vivoactive 4 feels more like a smartwatch than the very exercise-focused Forerunners and Fenix products. The interface is much the same here, though.",
    "You flick up and down from the watch face to access both extra info screens and apps. The Vivoactive 4, just like other Garmins, uses the Connect IQ app store to add software to the watch. A few years ago we half-thought this app store might get more of the kind of apps you see on Wear OS or an Apple Watch. But this interface shows that is not aim.",
    "For example, if you install Flappy Bird, a poor-quality clone of a mobile game that blew up in 2013, it starts running automatically when you flick to its “info” page, above the clock face. We may not have cancelled a run tracking session by mistake with the Garmin Vivoactive 4, but we have accidentally loaded Flappy Bird a dozen times or more.",
    "Steer clear of apps like this and you’ll be fine.",
    "The Garmin Vivoactive 4 is an excellent fitness tracker. Switching from the Forerunner 645 Music, you actually get several more stats to pore over. There’s Pulse OX, which measures SPO2, Body Battery and Respiration. We’ll dig into these more in a bit.",
    "But the one missing part might actually be more important for some of you. It’s called Performance Condition, a stat that judges how well do you compared to your baseline every time you track an exercise. This is judged, roughly, by mapping heart rate against exertion. It’s not always 100% reliable but is a great motivating stat when using the Forerunner and Fenix watches.",
    "Whenever we run with a Forerunner while hungover or lightly under the weather, you can bet Performance Condition will pick up on it, and end up with less-than-stellar figures. Garmin could have added this stat to the Vivoactive as it doesn’t rely on a dedicated sensor. Garmin left it out because this is meant to be a rung or so below the higher-end Forerunners, and we miss it.",
    "The Vivoactive 4 also misses out on “training load” stats, seen in the Gamin Connect app with a Forerunner. This tells you whether you’ve worked hard enough in the last seven days to improve or maintain your fitness. And at the end of a workout it does not tell you the recommended interval before working out again, based on the vigorousness of exercise.",
    "Do you want your tracker to really apply the pressure, and tell you when you’re not quite putting the effort in, even when working out regularly? The Vivoactive 4 does not do this to the same extent as a Fenix 6 or Forerunner 645.",
    "The basics are sound, though. GPS tracking seems as good as that of any Garmin watch. It may seem to place you on the wrong side of the road on occasion, or suggest you walked through a building, but the connection is solid and GPS lock-on happens within a few seconds following the first triangulation in an area.",
    "Heart rate tracking is mostly good, with one obvious issue. Recording during exercise is reliable for a wrist-bound sensor. The Vivoactive 4 tracks changes in exertion reasonably quickly while you run. There are no unexpected dips or peaks, and Garmin does not smooth out the data so much it becomes an artist’s impressionist take of you heart rate over time. It tends to be a little slower on the update during the first few minutes of tracking, but this is nothing new.",
    "Broadcast mode is where we had issues. This is where the Vivoactive 4 sends out its heart rate data over ANT+, to effectively act like a heart rate strap. We used this mode for an indoor cycling session on Zwift and it failed. The heart rate reading should have been around 137-150bpm most of the time, but it hung around 90 to 100 for a full hour. Whatever algorithm Garmin currently uses for broadcast mode does not seem to work very well.",
    "We’re sure Garmin will address this in an update, though, as it is clearly not a fundamental problem with the hardware.",
    "The Vivoactive 4 lets you track a huge number of exercises, more than 20. And others can be added through a Connect IQ download. Some simply have different displays of data, the bits you’ll see on-screen while actually tracking.",
    "There is some deeper stuff here too, though. The Vivoactive 4 has golf tracking complete with data for specific courses. And the watch can act like a coach through Garmin’s Workouts. These tell you the exercises to perform, right on your wrist, and are most useful for gym style workouts.",
    "The Vivoactive 4’s large screen is also a great canvas for exercise data. When running, for example, the default view shows the duration, distance, pace, and your heart rate. They are all comfortably laid-out on one screen. It seems less cramped than our usual Forerunner 645, even if the shift from a 1.2-inch screen to a 1.3-inch one doesn’t sound all that grand.",
    "There's no Garmin Performance Condition stat to look at like there is on top-end watches. That means the Vivoactive 4 does miss out slightly on intuitive week-to-week performance monitoring.",
    "In its place you are given a stack of other bits of “health” data. Pulse OX measures your SpO2, the oxygen saturation level in your blood. This involves a slightly different heart rate sensor hardware. A run tracker’s optical heart sensor typically fires a green light into your skin, then records the light level witnesses by a little sensor that sits alongside. SpO2 records two sets of results, one using infrared, to also calculate your oxygen saturation.",
    "You can see the difference by comparing the Garmin Vivoactive 4 and Forerunner 645. The 645 has three small green LEDs arranged around one light sensor module. The Vivoactive has two larger light sources and two sensors.",
    "Many of you may not find your SpO2 results all that interesting. If you’re in reasonably good health, you’ll likely see consistent results above 95%, shrug your shoulders and pay little attention to Pulse OX. And if it’s significantly lower, it is time to visit your doctor, not up your training regime.",
    "The Garmin Vivoactive 4 also measures how many times you breathe in a minute, throughout the day. It does so algorithmically, using your heart rate and heart rate variability. We didn’t find this data particularly useful, much like Pulse OX. However, it may be of more interest if you suspect you may have sleep apnea. But, yet again, this is something to talk to your doctor about. Garmin Connect can only get you so far.",
    "Body Battery is the extra data field you might actually find useful. It creates a graph of what it believes to be your body’s fuel reserves. Sleeping tops it up. Exercise and general stress deplete it. This relies heavy on heart rate variability, so it is a little more interesting than something that simply makes the graph drop more quickly based on time and exercise sessions.",
    "Performance Condition out, Body Battery in: this is one of the key differences between the Vivoactive 4 and one of Garmin’s higher-end watches. This is a slightly more 'lifestyle' leaning tracker, but the depth of recorded data is still otherwise great. There’s less of a sense Garmin’s stats are smudged and smoothed into vagueness than with almost all other tracker brands.",
    "Other info the Garmin Vivoactive 4 records includes your sleep and the number of floors you climb each day, using the watch’s altimeter.",
    "The sleep data is broken down into the usual REM, deep sleep and light sleep stages, but you can also look through your pulse oximeter and breathing data for each night. This seems, in part, a way to pack in more than rival trackers. But it is supporting evidence if you want to have a science-based moan about the bad sleep you had last night.",
    "Music is perhaps the most important extra feature of the Garmin Vivoactive 4. There’s a $50/£50 difference in price between the standard Forerunner 645 and Forerunner 645 Music, but here you get music streaming as standard.",
    "And that means 3.6GB of storage to add podcasts, playlists and albums. You can plug your Vivoactive 4 into a laptop to add files manually. The file system pops up when you do, and there are separate folders for podcasts and music.",
    "The band also supports Deezer and Spotify, for which you’ll need a Premium subscription to either service. Judging by the many one-star app reviews on Connect IQ, Garmin hasn’t made the process of linking up your account smooth enough. We had to spend a while working it out too.",
    "Once the Vivoactive 4 app is installed you need to dig into the watch’s settings menu to find the Music Provider setting, which then routes through to your phone to prompt the account link-up. But why can’t we do this directly from Connect IQ?",
    "Garmin’s music service integration is clunky. But once you are up and running it works perfectly well, and even implements little tiny renditions of album art. There’s no speaker on the Vivoactive 4. You hook up a pair of wireless headphones directly, letting you run without your phone.",
    "Garmin Pay is the other techy feature. This lets you make wireless payments, much like Apple Pay or Google Pay. In the US it supports a bunch of important banks, including Chase, Bank of America and Wells Fargo. UK buyers are less lucky. Santander is the only household name on the list.",
    "If your bank doesn’t support Garmin Pay, you can’t use it. Check out the list before buying a Vivoactive 4.",
    "The watch can also handle some smartwatch basics. Notifications from your phone apps come through, and you can choose which do, if any. The Vivoactive 4’s screen is a perfectly good way to read an email header or a quick WhatsApp message, and you can reply to them with pre-specified canned replies.",
    "You can’t dictate messages through a mic or talk to a digital assistant here. We meant it when we said “smartwatch basics”.",
    "There are also screens for the weather, your upcoming calendar entries, and you can track your water consumption if you like. Connect IQ lets you add more of these micro-apps too. Our advice: don’t treat the Vivoactive 4 like a smartwatch, or expect it to do much beyond the simple stuff.",
    "The more apps you have installed, the more the interface seems weighed down. Remember, there’s no specific area for apps here. They either end up on the workout menu, which is fine, or in the carousel of screens that sit above and below the watch face. You only want to keep pages you actually use here, or it starts to feel like a rubbish dump you never want to visit.",
    "Our current layout includes just the heart rate readings from the last four hours, the body battery display, music controls and notifications. Avoid Connect IQ’s tiny (we really mean tiny) selection of games. They are all bad, and very old. Third-party apps you may find useful include the period tracker and Pomodoro, a productivity technique where you work in intense 25-minute stretches. Pomodoro also runs as an exercise activity, so does not clog up the Vivoactive 4.",
    "We are fairly content with the watch’s limited app library. Even with a touchscreen the Garmin Vivoactive 4 does not feel like an ultra-quick, high power smartwatch. Screen transitions are 'digital', with none of the physics-based effects used in an Apple Watch to make its software feel more organic and responsive.",
    "Garmin says the Vivoactive 4’s battery lasts up to eight days of standard tracking, where you do not use GPS, for six hours of GPS tracking with music or up to 18 hours without music.",
    "It lasted four days for us, including two hours of GPS use during two run sessions and another hour of heart rate broadcasting for an indoor cycle session. We did not stream music during the runs.",
    "Our real-world experience is clearly a way below Garmin’s own claims, given our GPS use only tots up to 11% use of the battery according to the official specs. However, the Vivoactive 4’s longevity is a little better than the smaller Forerunner 645 Music’s. And as we were reviewing the watch, we likely played around with the interface more than we would three months into owning it.",
    "Exercise every other day and it should last a little over half a week, at least. Still, there’s no real battery efficiency progress here, and the Vivoactive 4 is shown up by the Huawei Watch GT 2. It lasts over a week even with several GPS-tracked runs. But we’d rather train with a Garmin watch than a Huawei.",
    "The Vivoactive 4 uses a plug-in charger, a little proprietary cable just like that of the Vivoactive 3 and Fenix 6. Charging from zero to full takes an hour or so.",
    "The Garmin Vivoactive 4 is a slightly more accessible alternative to Garmin’s high-end Forerunner and Fenix running watches. It offers all the basics, including great GPS, heart rate tracking and music streaming for less money than a Forerunner 645 Music. And an awful lot less than a Forerunner 945 or Fenix 6.",
    "What do you lose? This is partially touch-operated watch. But unlike the Vivoactive 3, it doesn’t introduce many annoying issues.",
    "You also get less advice about your performance and training. None of this relies on hardware, but Garmin needed to keep some distance between the Vivo and Forerunner/Fenix watches.",
    "In its place are stats to do with your general health. Body Battery is not a bad way to make sure you don’t run yourself into the ground and breathing/SpO2 figures add yet more stats to the gumbo.",
    "The Garmin Vivoactive 4 is a good watch for those who want to exercise regularly, and track that exercise accurately, but are not too worried about making sure every session counts.",
    "While it records much of the same data as Garmin’s top-end running watches, the metrics delivered focus more on health than performance and progress.",
    "Want to push yourself to shave seconds off your minutes-per-km each month? Or really focus on your performance throughout a session? A Garmin Forerunner is probably a better watch than a Vivoactive 4. The Forerunner 645 Music is the obvious alternative.",
    "However, if you care more about general fitness and are happy to take the pressure off yourself just a little, the Garmin Vivoactive 4 is excellent. It costs less than the Forerunner models, supports music streaming and actually harvests much the same raw data as Garmin’s most expensive fitness trackers.",
    "First reviewed: January 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Garmin Vivoactive 4 price and release date",
    "8": "Garmin Vivoactive 4 design",
    "14": "Garmin Vivoactive 4 screen",
    "19": "Garmin Vivoactive 4 interface and controls",
    "26": "Garmin Vivoactive 4 exercise tracking",
    "47": "Garmin Vivoactive 4 other features",
    "60": "Garmin Vivoactive 4 battery life",
    "65": "Verdict",
    "69": "Who is this for?",
    "71": "Should you buy it?"
  },
  "links": {
    "running watches": "https://www.techradar.com/best/running-watches",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "solar charging": "https://www.techradar.com/news/garmin-launches-solar-fitness-tracker-with-indefinite-battery-life",
    "Garmin Vivoactive 3 vs Garmin Vivoactive 4": "https://www.techradar.com/news/garmin-vivoactive-3-vs-garmin-vivoactive-4",
    "Garmin Forerunner 645 Music": "https://www.techradar.com/reviews/garmin-forerunner-645-music-review",
    "Forerunner 945": "https://www.techradar.com/reviews/garmin-forerunner-945-review",
    "Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Garmin watch": "https://www.techradar.com/best/garmin-watch",
    "Vivoactive 3": "https://www.techradar.com/reviews/garmin-vivoactive-3-review",
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "the list": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3163626778485104600/https://www.garmin.com/en-GB/garminpay/banks/",
    "Huawei Watch GT 2": "https://www.techradar.com/reviews/huawei-watch-gt-2-review",
    "Forerunner 645 Music": "https://www.techradar.com/reviews/garmin-forerunner-645-music-review"
  }
}