{
  "source": "https://www.techradar.com/reviews/polaroid-go",
  "title": "Polaroid Go review",
  "category": "cameras",
  "updated": "2021-04-28T14:35:47Z",
  "author": "tom-morgan",
  "summary": "The Polaroid Go is cute, but isn't quite as polished as it looks",
  "verdict": "Essentially a scaled-down version of the delightfully retro Polaroid Now, the Go is a point-and-shoot instant camera you can take just about everywhere. The credit card-sized images It produces are perfect for sharing, and it stylishly blends retro looks with modern niceties like a rechargeable battery. Even without autofocus it captures sharp selfies and portraits, but the lack of macro mode means it isn't quite as flexible as rival models - even if they are significantly bigger. Nothing can match it for size, so while creative photographers might find it a little basic, it's the ideal party snapper.",
  "pros": [
    "Properly dinky dimensions",
    "Point-and-shoot simplicity",
    "Rechargeable battery"
  ],
  "cons": [
    "Fixed focus can be troublesome",
    "No dedicated close-up mode",
    "Film more expensive than rivals"
  ],
  "article": [
    "Instant cameras are supposed to be about fun, but their bulky nature usually means planning ahead when taking one out with you. Not so with the Polaroid Go, which aims to bring some much-needed spontaneity back to the increasingly popular medium.",
    "Pitched as \"the world's smallest analogue digital camera\", the Go is a scaled-down version of the delightfully retro Polaroid Now, albeit without that camera's autofocus lens system.",
    "That might mean a few more wasted film packs on blurry images, but on the other hand it's small enough to carry around everywhere, making it perfect for spur-of-the-moment snaps.",
    "It's only the second camera from Polaroid's modern incarnation, following a decade-long journey that began life as The Impossible Project in the late 2000s, and gives the reborn brand a direct rival to Fuji's successful Instax Mini range.",
    "The all-new camera arrives with an all-new instant film format. Each pack of Polaroid Go film includes eight 67 x 54mm (2.6 x 2.1-inch) shots, which have a square 47 x 46mm (1.85 x 1.8-inch) image area.",
    "Currently, only color film is available, unlike Polaroid's larger I-Type, which is also sold in monochrome. Polaroid sells twin-packs of film for around £19/$20 each, making them around 25% more expensive per shot than Fuji's Instax Mini.",
    "It's easy to believe Polaroid's claim that the Go is the world's smallest instant camera once you get one in your hands: at 105 x 84 x 61mm (4.1 x 3.3 x 2.4in), the diminutive plastic body fits neatly in your palm, and makes the Polaroid Now look positively gigantic.",
    "Only hybrid instant cameras, which use digital sensors and effectively 'print' their photos using Zero Ink paper, are smaller.",
    "Because it keeps the same boxy, retro-inspired shape and button layout as the Polaroid Now, don't expect portability on a par with a compact digital camera: the Go is only just small enough to fit in the back pocket of your jeans, and is more at home in a jacket or handbag.",
    "Operation is very straightforward, with the flash and shutter buttons on the top face, and the viewfinder and power buttons on the rear. Double-pressing the flash button activates double exposure shooting, and holding it down turns on the self-timer, though the lack of tripod thread on the underside negates some its usefulness.",
    "It's impossible to miss the digital shot counter next to the power button, which should hopefully stop you prematurely opening the film drawer and ruining any shots you have remaining in the currently loaded pack.",
    "There's a microUSB port on the side for convenient recharging, though it would have been nice to see Polaroid stretch to the newer, reversible USB-C standard instead.",
    "Power the camera on and the flash is automatically enabled. You can turn it off for brightly-lit outdoor scenes, but will want to leave it on when shooting indoors. A small LED indicator lets you check at a glance whether it's set to fire or not.",
    "The viewfinder may be slightly offset from the camera lens, but what you see through it is largely indicative of what is captured. Selfie fans will also appreciate the lens-facing side of the viewfinder, which effectively doubles as a giant mirror and helps with composition. The smaller dimensions make it so much easier to hold than the Polaroid Now, which can be pretty unwieldy.",
    "The shutter has the same half-press button as the Polaroid Now. On the larger camera this would activate the autofocus, but that's missing here – instead it adjusts the aperture setting based on the amount of available light.",
    "You can hear an internal mechanism working when you use it, and the shutter only fires after it has picked between the two available settings, so you don't have to worry about accidentally over- or under-exposing your shot.",
    "A full press takes a photo, which is ejected out the front of the camera. It takes around 15 minutes to fully develop, and can be a little delicate, so don't throw your prints in a coat pocket and expect them to survive the process without a smudge or two.",
    "Polaroid Go film has a square aspect ratio and 47 x 46mm image area, so each one looks just like a miniature I-Type photo. For comparison, rival Fujifilm’s rectangular Instax Mini film has a larger 61 x 46mm image area.",
    "Just like I-Type, Polaroid Go prints produces muted, almost dream-like colors, blended with darker, more dramatic shadows.",
    "What looks blue through the viewfinder can often end up with a purple tint, transforming skylines and providing a different perspective on a scene. It's not an unpleasant effect, but Fuji's Instax film tends to be more true-to-life, if that's what you're after.",
    "Focal length is typically 0.5m and beyond, so attempting a close-up usually just results in a blurry final image. Selfie fans should always hold at arm's length, and remember to pause before pushing the shutter button all the way in. Accept that limitation and there's a decent level of clarity on display given the small size of each photo.",
    "Outdoors, exposure is usually on point, with the flash helping to softly illuminate subjects without overpowering the natural light of a scene. Forcing it off tends to result in more realistic colors, at the risk of significantly darker shadows as the photo paper has less light to work with.",
    "Instant film can often struggle with brightly-lit skies, but the Go coped well throughout our testing, only blowing out the final image when shooting towards the sun.",
    "Step inside and the flash becomes a necessity, as even well-lit rooms can appear dark and gloomy without it.",
    "This has always been a trait of instant film, so is by no means a fault of the camera – it's just something newcomers to the medium will have to adjust to.",
    "With size on its side, the Polaroid Go is a reminder that instant photography is supposed to be fun. It takes almost everything we liked about the Polaroid Now, including a rechargeable battery and distinctive images, then fits them into a body you'd be happy to carry around all the time – not just when you have photography in mind.",
    "Polaroid's film produces a delightful mix of detailed yet lo-fi pictures with eye-catching colors, and although there's no autofocus here, which can make close-ups a bit of a stumbling block, it's surprisingly capable in most lighting conditions. The smaller photos are arguably even cuter than the I-Type originals on which they are based.",
    "You pay a premium for portability, though. The larger Polaroid Now costs a similar amount, and the entry-level Fujifilm Instax Mini 11 is much less expensive. You could buy the camera itself and five packs of film for the price of the Polaroid Go alone.",
    "If portability is what has stopped you trying instant photography so far, though, then Polaroid Go is likely to be the camera to change your mind."
  ],
  "headers": {
    "6": "Design and features",
    "12": "Performance",
    "18": "Image quality",
    "25": "Verdict",
    "29": "Not convinced? Try these..."
  },
  "links": {
    "Polaroid Now": "https://www.techradar.com/reviews/polaroid-now",
    "Fujifilm Instax Mini 11": "https://www.techradar.com/reviews/fujifilm-instax-mini-11"
  }
}