{
  "source": "https://www.techradar.com/reviews/icedrive",
  "title": "IceDrive review",
  "category": "computing",
  "updated": "2021-01-14T07:02:57Z",
  "author": "john-faulds",
  "summary": "Impressive interface and security combined with great prices",
  "verdict": "IceDrive offers some groundbreaking features, ultra-high security, and attractive pricing but it lacks in the collaboration department.",
  "pros": [
    "Excellent security",
    "Virtual drive",
    "Reasonable prices"
  ],
  "cons": [
    "Virtual drive is Windows-only",
    "Limited support options",
    "No collaboration features"
  ],
  "article": [
    "IceDrive is a cloud storage solution that aims to make cloud storage feel like a physical hard drive with what the company calls “revolutionary” drive-mounting software. With IceDrive, you’ll be able to access your cloud storage just as easily as on your own device’s hard drive, but without taking up any space.",
    "IceDrive is a relative newcomer to the cloud storage market, founded in 2019. And in this IceDrive cloud storage review, we look at how it compares to some of the best cloud storage providers in the business as we examine its pricing, features, ease of use, and support.",
    "IceDrive plans can be purchased monthly, annually, or for a lifetime. If purchasing for a year or a lifetime license, there are three plans: Lite, Pro, and Pro+. If paying by the month, there is no Lite option.",
    "Lite comes with 150 GB of storage and 250 GB of bandwidth per month. Pro increases that to 1 TB storage and 2 TB bandwidth, while Pro+ offers 5 TB storage and 8 TB bandwidth.",
    "Monthly plans go from $4.99/month to $17.99/month, yearly plans $19.99/year to $179.99/year, and lifetime plans $59 to $499.",
    "There is also a free account with 10 GB of storage and 3 GB daily (not monthly) bandwidth, but it doesn’t have client-side encryption.",
    "The lifetime plans are interesting because they’re similar to buying an external hard drive. You’d pay less for a physical device, but in the likely scenario that you’d want your data backed up to the cloud anyway, with an IceDrive lifetime license, you’d be killing two birds with one stone.",
    "One of IceDrive’s best features is the ability to use it like a virtual drive that is attached directly to your computer. In fact, you can mount it like any other drive with a single click.",
    "It uses special software so that all the operations you’d need to perform on files—open, edit, delete, and upload—feel as fast as they would for files on your own hard drive or an attached drive. Intelligent caching of your recently used files means you’ll notice almost no slowdown. The only downside of this feature is that it is Windows-only.",
    "Other operating systems aren’t left out completely, though. IceDrive has a “portable” app which can be used on Windows, Mac, and Linux. It’s portable because it doesn’t actually need to be installed; just download it, and then you can run it directly from wherever you’ve downloaded it to.",
    "With it, you can upload and download files and folders, stream media, and preview documents and images without needing to download them first. You can edit files on your computer and the portable app will watch them for changes and upload new versions to your account in the cloud.",
    "There is also a web app that has been designed to work almost identically to the portable app. So you can access your account from anywhere that has a web browser installed. Apps for iOS and Android provide similar functionality, including the ability to share content and back up your entire device.",
    "IceDrive has a clean, easy-to-navigate interface. Even if you’ve never used any form of cloud storage before, understanding how to use IceDrive will take next to no time. Searching for files and transitions between pages happens very quickly, as does uploading documents to your account.",
    "It is also easy to create public links for files and folders or share them with people by entering their email address. Shared content can have passwords and expiry dates, but there is little else in the way of collaboration features.",
    "The interface between desktop and web apps is nearly identical. The mobile apps are similarly well designed with options to automatically upload images and videos.",
    "Windows users also have the option of mounting the virtual drive, which has the same interface as Windows’ file explorer, allowing them to interact with files in the drive in the same way as anything else on their computer.",
    "IceDrive support options are a bit limited. The company is based in Wales in the UK, and publicly lists a phone number and Skype ID, but the contact page suggests submitting a support ticket for a faster response.",
    "There is also a help center where you can search for articles, but the few searches we tried didn’t yield too many results.",
    "IceDrive is the only cloud storage solution to use the twofish algorithm, which is recognized as being the most secure encryption algorithm available. IceDrive also features client-side encryption so that your data is encrypted on your device before even being transferred to servers. And IceDrive takes a zero-knowledge approach, which means that only you can view and decrypt your data.",
    "IceDrive does many things well, but, as we mentioned, it lacks collaboration features. If those are important to you, some alternatives to consider are Google Drive and Microsoft OneDrive, which both have more robust collaboration options.",
    "Google Drive comes with 15 GB for free with any Google account. Paid plans range from $1.99/month for 100 GB up to $299.99 for 30 TB.",
    "OneDrive also has a free plan, but with only 5 GB of storage. Its paid plans go from $1.99/month for 100 GB up to $9.99/month for 6 TB, which can accommodate up to six people (1 TB per person).",
    "IceDrive impresses in a number of areas, including its approach to security, ease of use, and market-leading features like its virtual drive—although it would be better if the virtual drive were available for operating systems other than Windows too.",
    "Its pricing is attractive, with the lifetime license options in particular representing good value. However, support options are limited, as are collaboration features.",
    "If collaboration is important, IceDrive wouldn’t be your best choice. But if you’re more concerned with security, and are looking for a well-designed, easy-to-use cloud storage solution, IceDrive is a great choice."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "12": "Interface and in use",
    "16": "Support",
    "18": "Security",
    "19": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "IceDrive": "https://icedrive.net/",
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Lite": "https://icedrive.net/",
    "Pro": "https://icedrive.net/",
    "Pro+": "https://icedrive.net/",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365"
  }
}