{
  "source": "https://www.techradar.com/reviews/asus-tuf-a15",
  "title": "Asus TUF A15 review",
  "category": "computing",
  "updated": "2021-09-16T20:21:13Z",
  "author": "matt-hanson",
  "summary": "The new affordable gaming king?",
  "verdict": "The Asus TUF A15 is a brilliant affordable gaming laptop that manages to strike the right balance between performance and value. It’s strong 1080p performance, tough build quality, and large selection of ports will win it a lot of fans, especially amongst competitive esports players.",
  "pros": [
    "Great 1080p performance",
    "Good value",
    "New AMD processors",
    "Very good battery life"
  ],
  "cons": [
    "Noisy fans",
    "Not the most powerful gaming laptop",
    "Design won’t be for everyone"
  ],
  "article": [
    "In the Asus TUF A15, we’ve found one of the most compelling gaming laptops in recent memory. It’s not exciting for the typical reasons that usually accompany a new gaming device, however.",
    "It doesn’t come packed with the top-of-the-line flagship components that power the best gaming PCs. And, it’s not outfitted with the kind of flashiness that you would find in Asus’ Zephyrus gaming laptops, which are also plenty powerful in their own right. In fact, the Asus TUF A15 is a pretty standard looking gaming laptop.",
    "The Asus TUF A15 (also known as the Asus F506IV) sets itself apart by offering great performance, powered by the solid Nvidia RTX 2060 GPU and the AMD Ryzen 4000 mobile CPUs that have seriously impressed us, in a gaming laptop whose quality of performance is matched by a very reasonable price tag.",
    "The Asus TUF A15 is what we would call an affordable gaming laptop, which means it’s not as cheap as budget offerings, but nor is it as expensive as high-end gaming laptops aimed at enthusiasts.",
    "Still, ‘affordable’ when it comes to gaming laptops still means a decent chunk of change, and the Asus TUF A15 starts out at $1,300 (£1,300, around $2,000). That’s certainly pricey, although it offers much better value for money compared to some gaming laptops, such as the Alienware m15.",
    "So, you’re looking at a price in the same ballpark as the HP Omen 15 and Dell G3 15, both fine 15-inch gaming laptops, but ones which don't, at the time of writing, offer quite as recent components as the Asus TUF A15.",
    "As with other gaming laptops in Asus’ TUF series, the Asus TUF A15 is a big, chunky device that’s a far cry from Asus’ Zephyrus range – but then, that’s part of the appeal. As the ‘TUF’ moniker alludes to, the Asus TUF A15 places build quality and durability at the forefront of its design.",
    "This isn’t a rugged laptop that you could drop from a height and not worry about it, but it’s a gaming laptop you’d happily chuck in a backpack and take to friends’ houses and LAN parties. Some ultra-thin and light gaming laptops feel so delicate that you’d be frightened of taking them out of the house – not so with the Asus TUF A15.",
    "It’s certainly a design that doesn’t shy away from the fact that this is a gaming machine, but it’s not completely overboard either – and if you’d like to give it some more gamer cred, the Asus TUF A15 comes with a sheet of stickers to cover the laptop with. The chassis comes in two colors: Fortress Gray (the color of our review model, as pictured) and Bonfire Black.",
    "On opening the laptop, there are even more design choices to appeal to gamers. There’s the almost obligatory RGB lighting for the keys, and the all-important WASD keys are further highlighted with a translucent coloring, leaving you in no doubt that this is a laptop for gaming on.",
    "The industrial design is certainly appealing, and it’s functional too. It gives the laptop extra protection from knocks and bumps, and there's also a honeycomb design on the base of the machine, which keeps the device from sliding about, with the cells in the structure housing cooling vents.",
    "The chunky design also allows Asus to pack in plenty of ports, with an Ethernet port, HDMI, two standard USB ports and a USB-C port on the left-hand side, along with a port to plug in the power supply, while on the right-hand side there’s another standard USB.",
    "It’s a good selection, and should allow you to hook up your favorite peripherals without the need of an adapter. The LAN port is especially welcome on a gaming laptop, offering as it does faster and more reliable network speeds.",
    "Meanwhile, the screen is a nice, large, 15.6-inch 1080p display with 144Hz refresh rate, further bolstering the TUF A15's gaming credentials. You can also get a version that tops out at a 60Hz refresh rate.",
    "As we mentioned at the outset of this review, what made us particularly excited about the Asus TUF A15 is its choice of components, which includes some of the latest hardware from both AMD and Nvidia.",
    "In the CPU department, the Asus TUF A15 features the new AMD Ryzen 7 4800H. It’s not quite the flagship mobile processor from AMD (that’ll be the Ryzen 9 4900HS), but the Asus TUF A15 isn't aiming to be a flagship laptop. What it is aiming to be is a machine that offers a mix of performance and value, and that’s why we like Asus’ choice of the 4800H.",
    "We’ve talked elsewhere about how AMD’s Ryzen 4000 mobile processors could transform gaming laptops, and the Asus TUF A15 is a great example of this, with eight cores and 16 threads bringing a level of power we’d expect to see in much more expensive laptops.",
    "This is paired with an Nvidia RTX 2060 GPU. Again, it's not a flagship GPU, but it's a brilliant 1080p performer, making it a great choice for this kind of gaming laptop. It’s one of Nvidia’s more affordable GPUs, but still offers very good performance, including modern ray tracing support, and with 6GB of GDDR6 memory this is a smart choice for a laptop in which costs need to be kept down.",
    "As you can see from our benchmarks, the graphically-demanding Metro Exodus runs at 45fps (frames per second) at Ultra. With a bit of tweaking, you’ll get it to play over the magic 60fps mark, while still looking great.",
    "With less intensive games, like Fortnite or CS:Go, you’re going to be able to really take advantage of the 144Hz screen for fast and responsive gameplay.",
    "So, this isn’t a gaming laptop that’s stuffed full of the most powerful tech, but it offers excellent performance with modern games at a price point that's a lot more affordable than those of high-end gaming laptops. That’s a win in our book.",
    "One thing that did bug us, however, was how loud the laptop got when playing games. When the fans on this thing kick in, they kick in loud. We’re used to loud gaming laptops – they’ve got to be kept cool somehow – but the fans in the Asus TUF A15 are particularly distracting.",
    "We’ve come to never expect too much from a gaming laptop when it comes to battery life, but the Asus TUF A15 doesn’t do too badly here, with the PCMark 10 battery life benchmark, which replicates moderate use, taking five and a quarter hours to drain the battery.",
    "That’s not too bad for a gaming laptop, and it’s in part thanks to the energy efficiency of the AMD Ryzen 7 4800H, which doesn’t deplete the battery as fast as the more power-hungry Intel CPUs we often find in these laptops.",
    "The battery here is a huge 90Wh one, which is a lot larger than you’d usually find in a gaming laptop (and not far off the maximum size you’re legally allowed to bring onto a plane), and that also explains the excellent 11 hours, 44 minutes, uptime we recorded in our looped 1080p video benchmark.",
    "While playing a looped video isn’t the most demanding of tasks, the fact that the TUF A15 lasted so long is very impressive. When it comes to gaming, however, the uptime drops to around two hours, depending on the kind of game you’re playing. That’s still not bad, and could get you through a shortish train journey; but, as with other gaming laptops, you’ll want to plug this in while you play."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "14": "Performance",
    "22": "Battery life",
    "26": "Don't buy it if..."
  },
  "links": {
    "best gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Alienware m15": "https://www.techradar.com/reviews/alienware-m15-review",
    "HP Omen 15": "https://www.techradar.com/reviews/hp-omen-15-2019",
    "Dell G3 15": "https://www.techradar.com/reviews/dell-g3-15",
    "rugged laptop": "https://www.techradar.com/news/best-rugged-laptops",
    "AMD’s Ryzen 4000 mobile processors could transform gaming laptops": "https://www.techradar.com/news/gaming-laptops-will-never-be-the-same-and-its-all-thanks-to-amd"
  }
}