{
  "source": "https://www.techradar.com/reviews/certa-hosting",
  "title": "Certa Hosting review",
  "category": "computing",
  "updated": "2021-10-07T04:56:51Z",
  "author": "mike-williams",
  "summary": "A good pick for small UK-based businesses",
  "verdict": "Certa Hosting is a UK-based web hosting provider aimed at bloggers, freelancers, and owners of small to medium-sized businesses in general. Without breaking the bank, they will provide its customers with everything they need to write their own success stories.",
  "pros": [
    "30-day money-back guarantee",
    "Free backups and unlimited SSD disk space",
    "Superior speed performance",
    "Free CDN with over 20 locations around the world",
    "Stellar 24/7 customer support"
  ],
  "cons": [
    "No free domains",
    "No data centers outside the UK",
    "No SSL certificates with cheaper plans"
  ],
  "article": [
    "Certa Hosting is a UK-based company with over a decade of experience in the web hosting industry. It is mostly geared towards customers who are looking for premium quality hosting solutions for small to medium-sized businesses. The company was founded in 2007 in Oswestry, a small town in England near the Welsh border and their headquarters have remained there to this day.",
    "If you’re eager to find out more about the history of Certa Hosting, we’re afraid we’ve got some bad news. Besides a sorry excuse for an “About” section, the copy/paste description on their Facebook account, and the one-and-only video on their YouTube channel, there is nothing to be found. If you still want to check out their “About” section, prepare to go through litanies of self-praise (one of them claiming that Certa Hosting is “a leading web hosting services provider”) that end with a placeholder text about the nature of pain, which seems oddly fitting.",
    "Not surprisingly, the locations of Certa Hosting’s data centers also remain a mystery, but we expect them to be somewhere in the UK, most likely together with the company’s head office in Oswestry.",
    "Besides suffering from a lack of information, Certa Hosting’s site is quite easy-to-use, and pleasant to look at as well. It also features a blog with over a hundred articles on various topics. However, their social media accounts (Facebook, Twitter, LinkedIn, and YouTube) appear to be collecting dust for a couple of years now.",
    "Although the cost of Certa Hosting’s hosting solutions is pretty pocket-friendly, it is advertised without 20% VAT, so be sure to check out the “real” price just below the highlighted one. Here you’ll find an excellent selection of hosting plans starting with email hosting, shared hosting (basic, cPanel, and WordPress oriented), reseller hosting, cloud hosting, cloud-based VPS hosting, and bare metal server hosting. In addition to hosting, they also offer a full list of Microsoft 365 products.",
    "The cheapest option on the menu is a shared hosting plan called “Certa Lite'' and for the price of £3.59 ($4.90) per month (VAT included), it supports a single site, unlimited disk space (SSD), ten email accounts, two MySQL databases, unlimited bandwidth, and weekly backups. With “Certa Unlimited'' for £11.99 ($16.30) per month, you’ll be limit-free when it comes to the number of sites, email accounts, and MySQL databases as well. However, none of the three shared hosting packages comes with free domain name registration.",
    "All of Certa Hosting’s email, shared and reseller hosting plans come with a 30-day money-back guarantee but with no contracts, which means that you can cancel your plan anytime you want.",
    "Certa Hosting accepts credit/debit cards and PayPal.",
    "Even though choosing a suitable hosting solution shouldn’t be a challenge, if you’re not sure which one to go with, be sure to get in touch with Certa Hosting’s pre-sales support staff via live chat. They seem to be ready and willing to help.",
    "Whichever plan you choose, your next step is to deal with the domain name. You can register a new one (it will cost around $12.00 per year or more), transfer an existing one, or use it as it is and update your nameservers. After this, you’ll proceed to create an account with Certa Hosting or log in if you already have one. You can do so by signing up with Facebook, Google, Twitter, or doing it the traditional way, that is by filling out the form with your personal and billing information. After creating a safe password and (wisely) going through the terms of service, you’ll proceed to checkout and complete the payment.",
    "Certa Hosting promises an instant setup and it delivers on the promise. Once you open your account, you can go to the control panel by clicking on “My Services” and picking out the plan you just paid for. Since Certa Hosting utilizes an industry-standard cPanel, finding your way around should be an easygoing experience even for less tech-savvy users. From there, thanks to Softaculous you can easily install more than 80 useful apps including WordPress, Magento, Joomla, PrestaShop, and OpenCart.",
    "Alternatively, instead of a CMS you can use a drag-and-drop website builder that appears to be included in all shared hosting plans, which is a welcome change since this wasn’t the case in the past.",
    "We should also note that all plans include daily snapshot backups, a Wildcard SSL certificate, DDoS protection, antivirus, antispam, FTP security lock, web application firewall, 2FA, Hotlink, and brute-force login protection. Hence, you should feel pretty safe when using Certa Hosting’s services.",
    "Given that Certa Hosting offers a free CDN (content delivery network) with over 20 locations around the world (including Europe, North America, South America, Asia, Oceania, and Africa), speed shouldn’t be a huge challenge for the company.",
    "After performing the GTmetrix speed test on Certa Hosting’s official site, we were glad to see a highly promising performance. The site fully loaded in just 1.9 seconds, which is much better than the recommended speed (it is less than 3.5 seconds), not to mention the average one (of 8.1 seconds). In addition to this, all other vital web metrics (largest content element, total blocking time, and cumulative layout shift) were much better than the recommended results, bringing on an A (95%) as a final GTmetrix score.",
    "As for uptime, every Certa Hosting’s plan guarantees 99.9% of it. To check how likely they are to keep this promise, we performed a two-week-long uptime test (via UptimeRobot) on Certa Hosting’s official site. Throughout the testing period, not one instance of downtime was recorded, and the average response time was stable, reassuring us that we were right to expect nothing but a rapid and reliable performance.",
    "The first support channel you’ll notice on Certa Hosting’s official site is their live chat, which will invite you to enter any questions you might have about their products. It is supposed to be available 24/7 but we had better luck when we tried reaching them during the working hours (it might be just a coincidence, however). Nevertheless, Certa Hosting’s support team was both kind and knowledgeable, which is something we value highly.",
    "In addition to chat, you can get in touch with the team via telephone number (UK-based), email, ticket, or through any of their social media accounts.",
    "Although there is no community forum, Certa Hosting offers a decent knowledgebase filled with easy-to-follow articles categorized by topics. You can also check out their blog for additional tips and tricks, but most of the articles feel a bit dry.",
    "Like Certa Hosting, 123 Reg is a UK-based host offering a fine range of hosting solutions and site-building tools mostly aimed at their countrymen. Although both hosts are budget-friendly, Certa Hosting is more generous with its free features as it doesn’t impose any restrictions on bandwidth nor disk space.",
    "SiteGround is one of the most popular web hosting providers from the UK, and a challenging competitor of both Certa Hosting and 123 Reg. Unlike their UK-oriented counterpart, SiteGround offers several data center locations across the world including three in Europe, one in the USA, one in Asia, and one in Australia, which makes them more fitting for non-UK customers.",
    "The major difference between well-liked hosts such as HostGator and Bluehost, and Certa Hosting is the location of their data centers. While Certa Hosting is made in the UK and mainly for the UK’s market, HostGator and Bluehost are all for the USA. Nevertheless, all of them offer a wide array of fairly priced hosting solutions that come with a 30-day money-back guarantee at a minimum (it’s 45 days with HostGator). That is to say, you can give them a try without the need to worry about going broke any time soon (or ever).",
    "For over a decade Certa Hosting has been providing small UK-based businesses with everything they need, and it will likely continue to do so in the future. Their hosting solutions are well-structured, feature-full, budget-friendly, and the support team is everything we could wish for: prompt to respond, patient, polite, and very professional.",
    "Users looking for an equally affordable and beginner-friendly host but the one from the USA, should check out HostGator and Bluehost."
  ],
  "headers": {
    "4": "Pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "16": "Support",
    "19": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Certa Hosting": "https://certahosting.co.uk/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "email hosting": "https://www.techradar.com/news/best-email-hosting-providers",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "bare metal server hosting": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Certa Lite": "https://certahosting.co.uk/web-hosting/",
    "Certa Unlimited": "https://certahosting.co.uk/web-hosting/",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "CMS": "https://www.techradar.com/best/cms",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "DDoS protection": "https://www.techradar.com/news/best-ddos-protection",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "123 Reg": "https://www.techradar.com/reviews/123-reg",
    "SiteGround": "https://www.techradar.com/reviews/siteground",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}