{
  "source": "https://www.techradar.com/reviews/myfico",
  "title": "MyFico identity theft protection review",
  "category": "computing",
  "updated": "2021-11-29T17:53:05Z",
  "author": "john-brandon",
  "summary": "One of the best identity protection apps from a trusted credit reporting company",
  "verdict": "MyFico is an expensive product but has extensive credit reporting features and a brilliant interface. It’s also from a well-known company. A FICO score is an industry standard, and MyFico has a professional polish that is worth the added expense, especially if you are protecting your identity from fraud abuse.",
  "pros": [
    "Brilliant interface",
    "Excellent simulator",
    "Powerful features"
  ],
  "cons": [
    "Expensive"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "Among a sea of competitors, finally, there’s an identity theft protection app that’s worth your time and money. This kind of makes sense as MyFico is the consumer division from the same company that invented the FICO credit score, which has become “An industry standard for more than 25 years.”",
    "MyFico emphasizes your credit score and credit reporting, providing not only a healthy amount of information about your credit status, but also a wealth of educational info. The mobile app looks more professional than most of the apps we’ve tested and presents information in a colorful and clear format. While this product tends to cost more than some, it checks all of the boxes that signal a great product.",
    "For starters, the interface is intuitive and clear. We can’t emphasize that enough because a clunky and boring interface in any app makes it hard to use. With identity theft protection, it’s even more important because finding the features you need easily could help you ward off a criminal or hacker trying to steal your personally identifiable information. MyFico shows credit scores in a colorful way that’s engaging; alerts pop up to warn you about dangers.",
    "The app provides $1 million in identity theft insurance, like most products. Yet, that’s even part of the most basic pricing plan. There’s also a credit score simulator - you can see how a new car loan will impact your credit, for example. The company behind MyFico is well-known and trusted. Overall, this is a smart and efficient product for monitoring your online identity.",
    "The Basic plan costs $19.95 per month, and automatically auto-renews. True to its name, this entry-level plan includes only one credit bureau (Experian) and the $1 million insurance in case you fall victim to identity theft. FICO credit scores are updated monthly, and there is score and credit monitoring. You also receive Identity Theft Restoration via a customer support hotline for help in recovering your identity at all hours of the day.",
    "The next tier up plan is the Advanced plan for $29.95 per month. You can view credit reports from three agencies so this is a more complete plan, but the updates are less frequent at every three months. This plan also adds identity theft protection - the app scans thousands of websites looking for personal identity fraud and other credit problems. Otherwise, the plan is identical to the lower one.",
    "The top plan is the Premier plan, and it is the most expensive identity theft protection pricing option we’ve found in this software category. It costs a hefty $39.95 per month and provides monthly credit reports and monthly updates from all three agencies making it the most comprehensive coverage. However, it does not add any additional features to sweeten the deal.",
    "While many identity theft protection apps look and function like a clunky tax program from a decade ago, MyFico is a bright spot in the field. The mobile app in particular looks more engaging with a colorful credit score indicator and a more modern design.",
    "The interface is trim and efficient, which means you can glance at the mobile app and see your credit score and investigate problems or review the alerts about identity theft and resolve them. There’s also something to be said for how the credit score simulator works - it’s more like a wizard that shows possible scenarios if you do buy a house or a new car and can determine whether that’s a good idea.",
    "If the clarity of the interface actually helps you resolve an identity theft issue or avoid a credit problem due to the simulator and how it all works, it’s worth the higher price tag. Other identity theft apps tend to be clunky and outdated, so even if the features are more impressive they are harder to find.",
    "MyFico doesn’t reinvent the wheel - or even invent one. All of the features are quite predictable, including credit scores and monitoring and threat detection for your personal information (the app can analyze thousands of websites looking for potential identity theft issues). All plans include $1 million in identity theft protection insurance which gets underwritten by the American Bankers Insurance Company of Florida. It’s all wrapped up in a clear and intuitive interface meant to point out any credit history problems.",
    "There’s also a FICO Score Simulator. This tool lets a user run a simulation of what a financial move, such as buying a car with a loan, or taking out a mortgage, will do to the FICO credit score. Users get to explore up to 24 different financial scenarios, and see what the effect will be. In fact, you can track potential impact to all three credit bureaus simultaneously.",
    "There is a MyFico support center to help users having an issue. There is a direct toll free number, and also an email- both facilitate direct contact. The hours of operation are Monday to Friday, 6 AM - 6 PM, and on Saturday 7 AM - 4 PM PST.",
    "There are also articles organized by topics, such as “Why did my FICO® Score change?” and expert education about credit.",
    "The only real hesitancy here in recommending MyFico to anyone interested in protecting their online identity is the price. Even the Basic plan at $19.95 is more than almost every other low-cost identity theft app we found, such as Complete ID and Allstate Identity Protection. Moving up to the plan that provides monthly data from three credit bureaus, you’ll find the price is higher than any other identity theft protection app around, including Norton LifeLock. We also wish that there was a way to pay for an individual search so this made better sense for low volume users not looking for a monthly plan.",
    "That said, we do like the interface and the feature set that is available. The company backing this product is well-known and established - you won’t be wondering which tiny identity theft company is protecting your information and alerting you to problems. A FICO score is one of the best ways to determine if you need to look into credit history problems.",
    "We also like that the most basic plan still includes identity theft insurance in case of fraud. MyFico reps are available all day if you need to call and resolve an issue. This MyFico product is sound and we recommend it, but Norton LifeLock and IdentityForce are better options with more features and a lower price.",
    "We've also highlighted the best identity theft protection"
  ],
  "headers": {
    "5": "Plans and pricing",
    "8": "Interface",
    "11": "Features",
    "13": "Support",
    "15": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "MyFico": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6690133301918524000&xs=1&url=https%3A%2F%2Fwww.myfico.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmyfico",
    "Basic": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7256831298420511000&xs=1&url=https%3A%2F%2Fwww.myfico.com%2Fproducts%2Ffico-score-plans&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmyfico",
    "Advanced": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6660360690153049000&xs=1&url=https%3A%2F%2Fwww.myfico.com%2Fproducts%2Ffico-score-plans&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmyfico",
    "Premier": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9900160503173720000&xs=1&url=https%3A%2F%2Fwww.myfico.com%2Fproducts%2Ffico-score-plans&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmyfico",
    "tax program": "https://www.techradar.com/best/small-business-tax-software",
    "Complete ID": "https://www.techradar.com/reviews/complete-id",
    "Allstate Identity Protection": "https://www.techradar.com/reviews/allstate-identity-protection",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}