{
  "source": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k-max",
  "title": "Amazon Fire TV Stick 4K Max review",
  "category": "televisions",
  "updated": "2021-12-02T13:54:24Z",
  "author": "nick-pino",
  "summary": "Pushing the streaming stick form factor to the max",
  "verdict": "The Amazon Fire TV Stick 4K Max caters mostly to Amazon Prime members and Alexa-based smart home owners, but it’s still an undeniably powerful device at an affordable price. We don’t love how Amazon’s implemented ads on the home page and have issues with search, but we still feel this is the best streaming device for Amazon Prime subscribers.",
  "pros": [
    "4K HDR streaming",
    "Access to Amazon Luna",
    "Dolby Vision / Atmos / HDR10+",
    "Voice remote with Alexa"
  ],
  "cons": [
    "Too many sponsored ads",
    "Homescreen previews are low-res",
    "Search still could be better",
    "Luna can be unstable"
  ],
  "article": [
    "The Amazon Fire TV Stick 4K Max pushes the streaming stick form factor to its apex, offering faster performance and support for the latest Wi-Fi standards.",
    "That said, while a lot of work has clearly been done under the hood, the user interface for Amazon’s latest streamer remains the same as previous years, and focuses broadly on Amazon’s key streaming service, Amazon Prime Video. That last bit makes it a great streaming stick for Amazon Prime members, but a rather lousy one if you don’t want to shell out for Amazon’s all-in-one subscription service.",
    "The good news is that video streaming is only half of what a Fire Stick can do. It’s also able to keep track of your smart home devices and supports Amazon’s Luna game streaming service – making it a great rival to Google’s excellent Chromecast with Google TV. TikTok is now available on Amazon's Fire Sticks, too, if scrolling through endless dance content is your thing.",
    "It’s not absolutely flawless and the limited advertising might annoy some folks, but for anyone who loves Alexa, shops with Prime and is interested in Amazon’s experiment in game streaming, the affordable Amazon Fire TV Stick 4K Max is a triple threat.",
    "The Amazon Fire TV Stick 4K Max dropped on October 7, 2021 and is retailing for $55 / £55 / AU$99. That’s just a few bucks more than the older Amazon Fire TV Stick 4K, and you’re getting a big boost in performance as well as the Wi-Fi 6 antenna.",
    "Speaking of Roku and Google, it’s worth noting that there are rival devices to the 4K Max that offer a lot of the same functionality – namely, the Chromecast with Google TV and new Roku Streaming Stick 4K (2021). Both support Dolby Vision HDR and many of the same services, however neither has access to Luna. All three are great for different types of customers, so it’s worth visiting all three reviews before you make a decision.",
    "If you were to only look at the outside of the Amazon Fire TV Stick 4K Max, you probably wouldn’t feel like much has changed in its latest incarnation. In fact, if you were to put the 4K Max next to the 4K and tape up the logos, you might not be able to tell the difference between them – they’re both flat USB stick-sized devices with an HDMI port sticking out of them.",
    "While they look similar they are, we assure you, very different; all the new features for this model are happening under the hood.",
    "To make it faster, Amazon has upgraded the amount of memory the Stick has to 2GB, around a third more than the old model had. On top of that, the new SoC runs at 100MHz faster than its predecessor, which is what Amazon says makes the Amazon Fire TV Stick 4K Max around 40% faster than the Fire TV Stick 4K.",
    "Of course, all this power wouldn’t be worth much if the 4K Max struggled with pulling data down over Wi-Fi – that’s why Amazon decided to equip it with a Wi-Fi 6 (802.11ax) antenna that enables a theoretical max speed of 3.5Gbps… not that we’re expecting anyone’s internet to live up to that kind of speed. If anything, you’re basically future-proofing your streaming device for future upgrades to your wireless network.",
    "What’s the same between the two models is that, like its predecessor, the Fire TV Stick 4K Max also comes with a Bluetooth voice remote. The Fire TV Stick 4K Max remote now comes with quick launch buttons for Prime Video, Netflix, Disney Plus and Hulu – all of which feel like strong picks – as well as a live TV button and a new blue button for Alexa. These changes are relatively insignificant in the grand scheme of things but they definitely don’t take anything away from the experience either.",
    "Once you’ve found either a USB port with enough power output to charge the device or a wall outlet to plug the Fire TV 4K Max into, you’ll boot it up to find a familiar log-in screen asking you for your Amazon account information and a preference on which apps you’d like installed. So long as you have that information handy, setup should just take a few minutes.",
    "Once it’s complete you’ll see the main user interface for Fire TV that’s separated into three tabs – Home, Find and Live – with a revolving top row of featured shows and movies curated by Amazon as well as some ads. Having ads on the homescreen is annoying, especially considering the first row of apps under the Home section are also sponsored picks.",
    "Move down the user interface and you’ll start to find rows of shows and movies lumped together by a common theme like New Arrivals, Free on Amazon Prime, Comedy Movies, etc… This content-first presentation certainly looks nice and even comes with some good recommendations right near the top, but you have to pay close attention to see which of the shows and movies are actually available on Amazon Prime Video, and which of them will cost you some money to stream.",
    "There’s also the problem here that Amazon puts its own content front and center and will steer you towards buying a show on its service rather than anywhere else. That makes for great business sense, but not the best user experience.",
    "What makes up for things somewhat is Amazon’s latest integration with more free TV services – you’ll now find IMDb TV shows and movies available on the streaming stick as well as free local and national news networks in the US. This will offer cord-cutters a wealth of content at no additional cost and helps Amazon stay on par with Roku’s The Roku Channel that offers much of the same functionality.",
    "On top of those free services, you’ll also find many of the same services you’ve come to expect from streaming sticks including Netflix, Hulu, Disney Plus and even Apple TV. You’ll also find YouTube and YouTube TV on there (the latter of which isn’t available on Roku devices) as well as a number of music streaming services. The collection of apps is impressive and should keep you entertained for a long, long while.",
    "So how well does it work? Pretty darn well. Out of the box, the Amazon Fire TV Stick 4K Max offers 4K HDR streaming – plus Dolby Vision, HDR10+ and Dolby Atmos support. That’s pretty much every cutting-edge format we know about today minus a few of the outliers, giving you a crisp, colorful experience.",
    "To test out what 4K HDR content looked like, we watched a few episodes of the newly released All or Nothing season following the Toronto Maple Leafs. Contrast looked exceptional on our 75-inch Hisense test TV with good highlights and black levels, as did color saturation and sharpness. Admittedly, it did take a few seconds to reach maximum resolution after playback started, but when it got there it was as good as we’ve seen Amazon Prime Video look on a 4K TV.",
    "In fact the only annoying part of the experience doesn’t occur when you go to play content – it happens when you’re previewing it on the homescreen. There, in the upper-right corner of the screen, is a very low-resolution sample of the content you’re about to watch. Seeing that on a 4K streamer is a little disconcerting, especially one packing as much power as the 4K Max.",
    "To test shows in Dolby Vision, we had to download the Netflix app – no problem. Even though the download was small, the 4K Max downloaded it extremely quickly and installed it in just a few seconds. You’ll still have to sign in, which can add a few seconds, but you can very quickly have new apps up and running thanks to the faster Wi-Fi and extra memory. Less than 30-seconds later, we had The Witcher in 4K Dolby Vision and Atmos on Netflix.",
    "But what happens if you’re less sure about what you want to watch? Or maybe kind of sure about the name of the movie, but not where to watch it? For those problems you’ll have to turn to Alexa and the Fire TV’s built-in search function.",
    "If you want to see, say, movies with Kurt Russell, all you have to do is ask. Alexa will then show you all the movies that are part of your subscriptions starring Russell as well as free movies from other services with Russell in it. Search for a specific movie starring Russell like, say, Guardians of the Galaxy Volume 2, and Alexa will show you where to watch it. In that particular case, the 4K Max does a good job showing you that the film is available to watch with a Disney Plus subscription before showing you the options to rent it from Amazon.",
    "While all of the search features seem to work fairly well, they’re still not the best streaming platforms have to offer. Search results on Amazon Fire TV are sorted into a few helpful rows, but there’s no organization to the results beyond that. The search for Kurt Russell movies started out with The Christmas Chronicles, a 2018 movie starring Russell as Santa Claus, that was generally helpful, but the very next movie was F9 (Fast & Furious 9) where Russell only played a minor role. That’s a minor quibble to be sure, but it’s one example of Fire TV’s search results being not quite as well thought out as they could have been.",
    "Last but not least, we have to talk about Amazon Fire TV Stick 4K Max’s integration with Luna that is, well, merely OK. As much as we’d thought we’d see nearly flawless performance from Luna on the Amazon Fire TV Stick 4K Max, it simply didn’t happen. Most games played reasonably well on our 100Mbps wireless connection, but there were a few nagging moments of lag that soured the experience. That’s especially upsetting when a stutter-free experience on our computer is just one room away – but it turns out that even a Wi-Fi 6 antenna doesn’t beat a hardwired connection.",
    "Overall, Luna is playable on the 4K Max but it’s not our preferred way of accessing the service."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "6": "Design",
    "11": "Features",
    "17": "Performance",
    "26": "Don't buy it if..."
  },
  "links": {
    "Luna": "https://www.techradar.com/news/amazon-luna-first-look-is-amazons-game-streaming-service-worth-trying",
    "Chromecast with Google TV": "https://www.techradar.com/reviews/chromecast-with-google-tv",
    "TikTok is now available on Amazon's Fire Sticks": "https://www.techradar.com/news/tiktok-comes-to-fire-tv-sticks-along-with-a-few-changes",
    "Amazon Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Wi-Fi 6": "https://www.techradar.com/news/the-real-benefits-of-wifi-6",
    "Roku Streaming Stick 4K (2021)": "https://www.techradar.com/reviews/roku-streaming-stick-4k-2021"
  }
}