{
  "source": "https://www.techradar.com/reviews/nutribullet-baby",
  "title": "Nutribullet Baby review",
  "category": "appliances",
  "updated": "2021-07-12T10:00:00Z",
  "author": "emily-peck",
  "summary": "Make weaning easy with this convenient baby-orientated blender",
  "verdict": "The Nutribullet Baby is a handy and compact blender that comes into its own when you’re prepping food for baby weaning. With six cute storage cups and two blending bowls, it's great for batch-preparing food to use at a later date.",
  "pros": [
    "Choice of two blending bowls",
    "Comes with handy date-dial storage cups",
    "Great for batch blending"
  ],
  "cons": [
    "Doesn’t take hot liquid",
    "Not as large as a standard family blender",
    "Plastic design (although it is BPA free)"
  ],
  "article": [
    "Nutribullet is best known for its range of personal blenders that feature to-go cups so you can make smoothies and other drinks that don’t require decanting. However, the brand also offers some of the best blenders that can blitz larger quantities of fruit and vegetables.",
    "Now the brand has added Nutribullet Baby to its line-up. Marketed as a ‘complete baby food-making system’, the appliance can create super-smooth fruit and vegetable purees for babies who are six months and up, along with more textured meals, such as blitzing oats and grains into fine cereal for children aged one and over.",
    "There are two blending containers; the 32 oz / 909ml batch bowl, which is large enough to prepare more than one baby meal in one go, so you can freeze the rest ready for later in the week, and the 12 oz / 340ml short cup, which should be used for blitzing smaller portions.",
    "Just like a Nutribullet personal blender, fill both containers with the ingredients, push and twist onto the blender’s base and start blitzing.",
    "The Nutribullet features a pastel blue and white design, which instantly transfers you to the cutesy ‘baby zone’, while the six storage cups come with smiley faces on the side. These have been designed to make food more attractive to babies when it’s offered direct from the cup. While it won’t stop your tot from throwing their food around the room - we can but dream - it will ensure food prep and the clean up is as smooth-sailing as can be.",
    "If you already own a large family blender, we don’t think the Nutribullet Baby is an essential buy, but if you want a machine that is dedicated to pureeing, crushing and smoothing food for your tot, it’s definitely a blender to consider.",
    "The Nutribullet Baby is priced at $59.99 / £59.99 and is available in the US and UK from the Nutribullet website and Amazon for £59.99 / US $59.99. At time of writing, it wasn't available in Australia.",
    "In the US, Nutribullet also offers the Nutribullet Baby Turbo Steamer, which can warm pureed meals and eggs, or sterilize bottles for $29.99, along with the Baby and Toddler Meal Prep Kit, which includes a range of fun on-the-go packaging so you can feed your children home-made dishes even when you’re out and about.",
    "Aesthetically, the Nutribullet Baby blender is designed for new parents as its plastic Tiffany blue and white body won’t look out of place next to all the other paraphernalia that comes with a newborn such as a sterilizer, bottle warmer, and nursing pump. Each storage cup comes with a cute little face on the side, and a date dial so you can see exactly when you made the food so it can be conveniently stored in the fridge or freezer for a later date. Should you wish to feed baby direct from the pot, no doubt the smiley faces will entice your child.",
    "While the design is eye-catching, what it lacks is longevity - with such cute styling, it’s not an appliance that you’ll want to keep on show beyond the weaning stage. At 10.6 inches / 27 cm high and 11.8 inches / 30 cm wide - it’s small and easy to store or fit discreetly on the corner of your countertop.",
    "Setting it up ready for use is simple and all you need to do is choose from the two blending bowls – either the 32 oz / 909ml batch bowl or the 12 oz / 340ml short cup - twist them onto the base, plug in and use. There’s a removable section in the lid of the main batch bowl so you can add ingredients as you go, but the lid itself is a little harder to remove.",
    "The blender comes with a booklet that offers hints and tips on baby weaning, but for recipes, you’ll need to head to the website, where you’ll find lots of inspiration including creamy potato and corn soup or an apricot and oatmeal breakfast.",
    "On test, the Nutribullet Baby impressed us with its ability to puree both soft and harder ingredients. When we blended steamed butternut squash, cauliflower, peas and carrots, we found it took a while for the blade to pull the ingredients down, so we added a little liquid via the removable cap on the main lid to cap to encourage the ingredients to combine. After a minute of blending the vegetables were smooth, with only a few chunkier pieces remaining. It’s worth noting that this model won’t take hot ingredients so you need to ensure they are cooled down before use.",
    "Once you’ve inserted the ingredients you simply push down anti-clockwise to click the bowl into place and the motor immediately starts. This was a little off putting at first as we weren’t expecting the motor to start so easily. But we soon got to grips with starting the blend with a simple push, and stopping it by moving the bowl clockwise and gently unclicking it.",
    "To find out how well the mixer could puree a single vegetable, we also used it to blitz some butternut squash chunks that were par-boiled to soften them slightly. We needed to give the blender a shake halfway through to try and encourage the majority of the ingredients to puree, but we managed to blend just under half a bowlful of butternut squash in around 50 seconds. The results were very smooth and ideal for baby weaning.",
    "Our next test was to see how finely the blender could grind dry ingredients so we added large pieces of white bread to the batch bowl and turned it on to create breadcrumbs. This test worked particularly well and the bread was demolished in under 20 seconds.",
    "Our final test was to see how well the blender could handle both frozen and fresh fruit. To find out, we added some frozen berries and chopped fresh bananas to the short cup pressed down, and clipped it into place. Within seconds the mix had blended and in under a minute we were able to serve up a chilly fruit puree pudding to baby. While the blender performed well in each of our tests, it’s worth noting that it is quite noisy – ramping up to 90 db when pureeing the steamed vegetables, for example.",
    "The Nutribullet Baby is easy to clean. While it doesn’t come with a brush, if you run a hot tap on the blade straight after use you can dislodge any ingredients from the blade effectively.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Nutribullet Baby price and availability",
    "8": "Design",
    "12": "Performance",
    "18": "Don’t buy it if…"
  },
  "links": {
    "best blenders": "https://www.techradar.com/best/best-blenders"
  }
}