{
  "source": "https://www.techradar.com/reviews/roccat-burst-core",
  "title": "Roccat Burst Core review",
  "category": "computing",
  "updated": "2021-03-10T20:16:05Z",
  "author": "michelle-rae-uy",
  "summary": "It’s not often you find a premium mouse this cheap",
  "verdict": "Though minimal on frills, the Roccat Burst Core is a stand out when it comes to performance, ergonomics, and a premium design. And, it’s more affordable than most gaming mice in its class.",
  "pros": [
    "Surprisingly affordable",
    "Extremely lightweight",
    "Premium build"
  ],
  "cons": [
    "Rigid cable",
    "Feet not good on all surfaces"
  ],
  "article": [
    "The Roccat Burst Core proves that while there’s a case to be made for expensive gaming mice, you don’t always have to pay more to get more. Roccat’s budget version of its much-lauded Burst Pro, may not have all the bells and whistles that the best gaming mice do, but it’s an excellent value.",
    "However, it does come with its own special features, even if that list is shorter. It’s extremely lightweight, for one – lighter than the super lightweight Corsair Katar Pro XT, which may be its biggest rival. It is also outfitted with Roccat’s Titan Switch Optical, the same optical switch that the more expensive Burst Pro has that’s rated at 100 million clicks.",
    "More importantly, the Roccat Burst Core delivers where it matters most, from its performance right down to its look and feel, which is even more impressive considering its price. At $29 (£24, AU$69), it’s $30/£25/AU$30 cheaper than the Roccat Burst Pro and a fraction of the price of many of the best gaming mice out there.",
    "That surprisingly affordable price tag also puts it in direct competition with the Corsair Katar Pro XT, which costs the same in the US and Australia but is £10 more in the UK. It’s readily available for purchase in both the UK and US Roccat sites as well as the usual major retailers. However, those in Australia can purchase it from online retailers only.",
    "The Roccat Burst Core’s biggest selling point is that it’s extremely lightweight. At 68g, it’s one of the lightest mice right now. What Roccat has done here is utilize a light honeycomb shell that’s been gaining popularity lately, without committing all the way, so users won’t have to worry about dust and debris inside their mice.",
    "How does that look exactly? It’s very much like the Burst Pro where holes are carved on the underside of the top panel but the outermost shell is kept solid. Except now you get a translucent outer shell that showcases RGB lighting in a unique and funky way. Think of it as a stripped-down, less flashy version, which makes sense considering the price.",
    "It has, however, kept its symmetrical ergonomic shape that feels extremely comfortable to use. Palm grip gamers will appreciate the support it offers, though gamers with bigger hands could have used a little more pronounced hump on the palm rest. In any case, it’s nice and comfortable to use, especially because of the lightweight design.",
    "The Roccat Burst Core feels pleasant (and premium) to the touch, the side panels being textured to give you a nice solid grip and the top panel, including the right and left buttons, offers a soft, velvety feel thanks to its matte finish. Of course, there is a downside – the top panel tracks fingerprints way too easily.",
    "We recommend using a quality mouse pad with this mouse. While Roccat calls its PTFE mouse feet “a top-tier feature that offers exceptional glide,” they won’t really offer much resistance without one, making the mouse itself harder to control. That’s on top of the fact that it doesn’t really feel luxurious sliding it around your bare desk.",
    "The cable also feels stiff. We sometimes have to stop mid-game to re-adjust the cable as it was getting in our way. It’s also a rubber cable, which means that it has a higher chance of fraying. Then again, for a mouse this cheap, some compromises had to be made.",
    "Luckily, the Roccat Burst Core is uncompromising in its performance. Whatever features the gaming mouse is lacking are certainly made up for thanks to the Titan Switch Optical switches that not only gives it a long life-cycle of 100 million clicks, but also fast and accurate actuation and nice, satisfying tactile feedback.",
    "It also comes with on-board memory which allows users to keep their preferred profiles regardless of the PC they’re using. It only has a maximum of 8,500 DPI, but really, at that point, no human will ever notice the difference between that and 20,000 DPI. So, this is hardly a big deal.",
    "Testing it on games like Doom: Eternal, Subnautica, Firewatch, and Hellblade: Senua's Sacrifice is an immersive experience. Its sensor is incredibly responsive and accurate while its buttons are fast and have no noticeable latency. Even macros and button assignments are executed quickly without lag, making your game seamless.",
    "The lightweight design makes it easy to quickly react to enemies without exerting a lot of force on our wrists. Understandably, a lot of gamers prefer mice with more heft for more controlled movements. However, we find the Roccat Burst Core’s light weight better as it puts less strain on our wrist and shoulders. It’s all a matter of preference, but if you’re suffering from chronic shoulder and wrist pain, this might actually work in your favor.",
    "As this mouse is fully customizable via the Roccat Swarm app, we recommend taking full advantage. There’s not a lot here in the way of RGB lighting, mainly because its RGB lighting zones are limited to its scroll wheel, but there are some animations as well as adjustments to speed and brightness.",
    "Mostly though, you’d want to take advantage of adjusting the settings, creating profiles, and creating macros so you can fully personalize the mouse. There’s a lot you can do on the app, from setting vertical scroll and horizontal tilt speeds to saving up to 5 DPI settings for the DPI button to cycle through and assigning game-specific macros. These customizations will not only make the Roccat Burst Core truly yours, but also give you a gaming edge."
  ],
  "headers": {
    "0": "Two-minute review",
    "16": "Don’t buy it if…"
  },
  "links": {
    "best gaming mice": "https://www.techradar.com/news/best-gaming-mouse",
    "Corsair Katar Pro XT": "https://www.techradar.com/reviews/corsair-katar-pro-xt",
    "Doom: Eternal": "https://www.techradar.com/reviews/doom-eternal-review"
  }
}