{
  "source": "https://www.techradar.com/reviews/razer-blade-15-2021",
  "title": "Razer Blade 15 (2021) review",
  "category": "computing",
  "updated": "2021-09-15T21:50:12Z",
  "author": "jackie-thomas",
  "summary": "The classic gaming laptop returns",
  "verdict": "The Razer Blade 15 is still one of the nicest laptops on the market, bring luxurious design and excellent performance. However the high price tag and relatively short battery life hold it back from perfection.",
  "pros": [
    "Excellent performance",
    "Beautiful design",
    "Comfy keyboard",
    "Still the best trackpad in a Windows laptop"
  ],
  "cons": [
    "Gets hot",
    "Very expensive",
    "Short battery life"
  ],
  "article": [
    "At this point, the Razer Blade 15 is extremely familiar. Year after year, Razer improves on its classic gaming laptop design, putting the latest and greatest hardware in it and the 2021 version is no different.",
    "Now powered by Nvidia Ampere and Intel 11th-generation processors, the Razer Blade 15 is more powerful than ever, and is finally able to actually power the 4K screen that the top-end option features in-game. The Nvidia GeForce RTX 3080 in the model we're looking at here is the perfect pairing for this 4K display, and this laptop shows that 4K gaming laptops might actually start having a reason to actually exist.",
    "And all the other things that have made the Razer Blade 15 stand out in the past still apply here. It's still a remarkably thin and light gaming laptop for the amount of power it brings to the table, and it's one of the few gaming laptops that we don't feel ashamed to pull out in a coffee shop.",
    "Though, with a 4K display and literally the most power-hungry laptop hardware on the market, battery life is still a big hurdle for the Razer Blade 15. We're still not at the point where you can take the Razer Blade 15 to work with you and leave your charger at home. Though, now that you can charge it with a standard USB-C charger – at least to a point – that's less of an issue than in the past.",
    "The 2021 version of the Razer Blade is available now, starting at $1,799. That configuration will get you the Intel Core i7-11800H, 16GB of RAM, a 512GB SSSD and the Nvidia GeForce RTX 3060, behind a 1080p 144Hz display.",
    "That's definitely a high starting price, but it definitely goes higher. The model we have in, listed to the right, will set you back an eye-watering $3,399. This configuration will be pretty appealing to creative professionals, however, who will doubtlessly find the 32GB of RAM and Core i9 processor incredibly useful.",
    "But, as always with the Razer Blade 15, you're paying for a luxury computing device, rather than just for the ability to play your games on the road. There are plenty of other gaming laptops out there that can provide similar specs and performance, without even losing out much on portability.",
    "Something like the Asus TUF Dash F15 is just as portable, though the weaker Tiger Lake H35 chip will lag behind the full-fat 11th-gen Core i7 in the Razer Blade 15.",
    "However this time around, there's a direct challenge to the Razer Blade 15 coming directly from Razer. The Razer Blade 14 is neck-and-neck with the Blade 15 in performance, at the same price point. And, it's even more portable to boot. Plus, if you're doing a lot of creative work that requires CPU heavy lifting, the 5th-generation AMD Ryzen processors in the Blade 14 frankly blow the Intel silicon out of the water.",
    "The only thing that the 15-inch Razer Blade has over the Blade 14 at this point is the 4K screen, but even then we could take it or leave it on a laptop display anyways.",
    "The Razer Blade 15's design hasn't changed much in recent years, and we're not exactly complaining. It still has the all-black unibody aluminum chassis and the Razer logo illuminated on the top of the laptop. There's also a large trackpad and some of the best speakers in a gaming laptop today. And, of course, a keyboard that's simply to die for.",
    "For a laptop that houses such powerful hardware, it's also incredibly thin and light, weighing in at just 4.4lb and measuring just 0.67 inches thick. This makes the Razer Blade 15 one of the most portable laptops in its class, and gamers that don't want to sacrifice performance while traveling are going to find a lot to love here.",
    "However this portability is betrayed at least a little bit by the large charging brick. It's definitely smaller than some past versions of this laptop, but it still adds a bit of bulk to the package – especially since the Razer Blade 15 still can't get you a full day of work on battery power, more on that later.",
    "The model we're looking at here is the one with the 4K touch OLED display, and wow is it gorgeous. It has an average brightness around 313 nits, which isn't the brightest in the world, but when combined with its ability to hit 109% of the sRGB color spectrum, it's simply a beautiful display to look at, whether playing games or just binging Netflix in bed.",
    "Luckily the media appeal doesn't end with the display, the speakers are also simply incredible. We took the laptop on a vacation in Colorado, spending two weeks using it to watch TV, listen to music and, of course, play games, and the speakers sound great in all of those use-cases.",
    "Bass is thick and it gets loud enough to fill a room. And not a lot of detail gets lost in the high-end during bass-heavy songs or action-packed sequences in movies and games. It's still not going to beat buying a nice gaming headset or anything, but the speakers definitely get the job done.",
    "Other Windows laptops are starting to catch up with Razer when it comes to trackpads, but the Razer Blade 15 still has one of the best trackpads this side of the best MacBooks. It's accurate, smooth, and large enough to easily use gestures without accidentally brushing your fingers outside of the box.",
    "It's definitely a nice touch, but we're still not at the point where trackpads are good for playing PC games, so you're probably going to want to pair this laptop with a gaming mouse either way.",
    "The keyboard is also as good as ever, with plenty of travel and some beautiful RGB lighting. Travel is nice and deep, and we're able to type on it quickly and accurately, which is more than can be said for the 2018 MacBook Pro we're usually working on.",
    "As for ports, there's actually a lot considering how thin this laptop is. On the right side, you have a Kensington lock, HDMI, a USB-A and a Thunderbolt 4 port. Over on the left, you have the charging port, another Thunderbolt 4, two more USB-A ports and a combo 3.5mm audio jack. There's no shortage of laptops that are ditching many of these ports in the name of making laptops thinner and lighter, but Razer has so far resisted the urge – lets hope it continues to do so.",
    "Any gaming laptop with an 11th-generation Core i7 processor and an RTX 3080 is going to absolutely dominate any game you throw at it, but what was surprising is how well this laptop handled games at 4K.",
    "The mobile version of the Nvidia GeForce RTX 3080 isn't nearly as powerful as the desktop variant, and so it starts to struggle a bit at 4K, especially when features like ray tracing are brought to the table. However, playing games like Middle Earth: Shadow of War and Final Fantasy XIV: Shadowbringers, we're able to completely max the graphics settings and still get a framerate above 60 fps.",
    "There are a couple of especially heavy games where we have to lower graphics settings a bit, namely The Witcher 3 and Cyberpunk 2077, but those games are incredibly heavy and only the most beefy desktop systems can max them out at 4K anyways.",
    "Our benchmarks basically reflect this, easily scoring 72 fps and 65 fps in Total War: Three Kingdoms and Metro Exodus, respectively. And yeah, these are technically older games, but they still push hardware to its limits, which is why we use them in testing.",
    "It's also just a solid PC overall, scoring 8,555 points in Cinebench, and 6,797 points in PCMark 10, which is a score that is only beat by the Razer Blade 14.",
    "It wasn't so long ago that we just assumed that any gaming laptop was just going to have bad battery life, but that's not the case anymore. There are a ton of gaming laptops like the Asus ROG Strix G15 that can reach more than eight hours of battery life – and that laptop even has better performance than the Razer Blade 15.",
    "Instead, in the PCMark 10 battery life test, the 2021 Razer Blade 15 lasts just six hours and 16 minutes, and can't even break five and a half hours in our video playback test. It's really a shame, because otherwise this laptop is a great choice for carrying around with you on the go.",
    "Now, six hours of battery life isn't the worst thing in the world. You're still going to be able to get through plenty of work before the laptop dies on you, but when compared with similar devices, it's still less than we'd like to see.",
    "One of the biggest pet peeves we've developed over the last year or so of testing laptops in lockdown is that, quite simply, laptop cameras suck. Especially with Ultrabooks that prioritize nearly invisible bezels that don't really do anything but look pretty. But luckily, the Razer Blade 15 has an incredible webcam.",
    "You're getting a 1080p webcam, and it actually looks pretty great in calls – at least better than we usually see in a laptop. The microphone also sounds great, picking up our voice without too much background noise distracting our friends while we're in Discord or chatting over Zoom.",
    "Luckily, there isn't much bloat with the Razer Blade 15. It does come pre-installed with Razer Synapse – love it or hate it – but the preinstalled software basically ends there. That means that when you pull the laptop out of its box it'll boot up quick the first time, and the SSD is your canvass to install anything you want, and nothing that you don't need.",
    "The webcam also has an IR sensor, which means it supports Windows Hello, though we wish Razer included a fingerprint sensor as well. Still, facial unlocks are quick and setting it up is as easy as ever."
  ],
  "headers": {
    "4": "Price and availability",
    "10": "Design",
    "20": "Performance",
    "25": "Battery life",
    "28": "Camera and microphone",
    "30": "Software and features",
    "32": "Don't buy it if..."
  },
  "links": {
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Asus TUF Dash F15": "https://www.techradar.com/reviews/asus-tuf-dash-f15",
    "Razer Blade 14": "https://www.techradar.com/reviews/razer-blade-14",
    "best MacBooks": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Asus ROG Strix G15": "https://www.techradar.com/reviews/asus-rog-strix-g15-amd-advantage-edition"
  }
}