{
  "source": "https://www.techradar.com/reviews/wix",
  "title": "Wix website builder review",
  "category": "computing",
  "updated": "2021-06-01T15:46:05Z",
  "author": "mike-williams",
  "summary": "Quick and easy website building from the industry leader",
  "verdict": "The lengthy feature list and smart editor make Wix a great website building choice, but the limited support might be an issue for big business sites.",
  "pros": [
    "Easy-to-use editor",
    "Powerful features",
    "Powerful blog"
  ],
  "cons": [
    "Online store not included with free/basic plans",
    "Can't change Wix templates",
    "Bandwidth limits on low-end plans"
  ],
  "article": [
    "Wix is a giant of the website builder industry. Browse their website and clues to this success appear right away. The service isn't just packed with appealing features, but the firm does its best to outperform everybody else, and there's plenty to appeal to everyone from the total design newbie to big business and experienced web developers.",
    "While some services give you only a few templates, Wix has more than 500. Its built-in image editor has 40 Instagram-style filters. The blog supports 26 languages. The App Market has more than 200 widgets for enhancing your site and integrating third-party sites and services.",
    "Looking to build a web store? Wix has plenty of e-commerce templates, too. And the company doesn't have any transaction fees on your sales (whereas Weebly, for example, charges 3% on some accounts).",
    "Beginners can sample much of this for free. But experts can go much further, with features like Wix Code, enabling them to manage database collections, generate dynamic pages and custom forms, use their own JavaScript, access APIs and more.",
    "It’s not all perfect, though. The templates aren't responsive in the usual sense, although the effect is very similar (Wix can generate a separate mobile version of the site and use it when necessary). Some features, like form building, come in the form of apps which require extra payments to get their full functionality. But nonetheless, this is a powerful and comprehensive service with a lot to offer all classes of user.",
    "Wix does its best to get you quickly up to speed. Account creation is as simple as entering your email address and a password. You're asked to choose the type of site you'd like to create – business, photography, music, blog and so on – and then whether you'd like to have Wix generate the site for you, or if you’d rather do it all yourself from scratch.",
    "If your needs are simple, you've never used a website builder before, or you're just in a hurry, having Wix automate the process might save you a little time.",
    "You can modify your site in many ways. Hovering your mouse cursor over a section displays buttons to edit it or change designs. Or you can click something to view and edit its properties in a sidebar. But the automatic editor doesn't allow you to drag-and-drop objects on the page or resize them. However, since most of the design is done for you, you can set up the site, populate your web store, write blog posts, preview and test your pages and put them online in next to no time.",
    "It’s possible to switch to the full-fat Wix editor at any time (which is also what you get if you don't choose the automatic process initially), but the problem is that you can't then switch back and keep your changes. It's an either-or decision, simple or full Wix power: there's no way to combine the two, unfortunately.",
    "Opting for the regular editor gives you complete control of layout. Objects can be positioned with pixel-level placement, rather than being automatically aligned in blocks or columns. You can drag-and-drop complex blocks (contact forms with headings, buttons, text) as a whole, change alignments, even ungroup items within a block to rearrange them however you like.",
    "Visual tweaks include neat animations and colour filters for images, and you can assign a range of actions to most objects. You can add all the usual elements to your page in a couple of clicks. There's plenty to explore.",
    "One major highlight of the editor is its visual previews, enabling you to see any component before you add it. Choose Gallery, for instance, and you don't just get text items such as Collage or Grid. Instead, the editor displays thumbnail previews of what each option will look like, helping you to immediately choose the right component. It's a similar story when you're browsing buttons, menu styles, or audio and video players – Wix always clearly shows you what you're going to get.",
    "The core editing functions are equally well designed, and are more like a native application than the average website builder. Right-click menus show you appropriate commands for different controls, for instance. Alignment guides and on-screen displays of control heights and widths help you position and size items accurately, and floating toolbars give speedy access to key options and features.",
    "The editor supports a vast number of keyboard shortcuts, a major plus if you regularly use them in other applications. You can Shift+Click or Ctrl+Click to select multiple items, then use standard key presses to delete, copy and paste them, send them to the front or back of the page, save the project, preview it, undo actions if you've made a mistake, or redo them if you've changed your mind.",
    "Put this all together and the Wix editor feels polished and professional, with both the visual cues that beginners need, and the shortcuts and workflow support that experienced users expect.",
    "Wix offers wide support for multimedia, with native components to display single images, slideshows, image galleries, music and video files in all the main formats.",
    "There's support for directly importing or playing media from Facebook, Instagram, Dropbox, Google Drive, Flickr, Google Photos, YouTube, Vimeo, Dailymotion, SoundCloud, Spotify and more.",
    "A \"My Uploads\" area enables building your own cloud-based media storage bin. If you've got 10 images you'll use on multiple pages or sites, for instance, you can upload all of them to Wix. You'll then be able to access them directly from the Add Images dialog without having to upload the files each time you need them. You also have access to Wix’s own media library and those from Unsplash and Shutterstock (the latter aren’t free).",
    "The Wix App Market has further add-ons to give you more playback features, higher bandwidth, user stats, document viewers (PDFs, Google Docs, Sheets, Drawings and Slides) and more. They're welcome, but keep in mind that although most are free in some form, they often require extra payments to remove branding or get their best features.",
    "Wix's blogging platform is easily accessed from a standard button on its left-hand toolbar. In a click or two you're able to add a new blog post, customise its layout or change how you would like the blog to work.",
    "Blog posts are created using a simplified editor, but this still has a decent set of functions, including options to add images, galleries, videos, music, GIFs and custom HTML.",
    "There are plenty of ways to customise a post. You're able to add tags and categories, define related posts, and set meta titles, meta descriptions or separate mobile-friendly titles. And once you're done, posts can be published immediately or scheduled for some future time.",
    "Building a web store with Wix seems very simple. Browse an array of templates, add any extra components you need, and the visual previews and sample images make it easy to define the look and feel of your store. Don't be fooled, though: there's plenty of power under the hood.",
    "Wix supports digital as well as physical products, for instance, and also includes services.",
    "Products can be illustrated with videos, as well as images. You can give them custom options (size, colour), a weight or an SKU (a product code to enable automatically managing your inventory.) You can promote them with coupons, organise them into collections, or set up your own shipping and tax rules. Wix supports plenty of payment providers, and even shows you only those available in your area, including their own payment system",
    "Wix stores can't quite match specialist e-commerce solutions (or for that matter the best web hosting providers), but that's no great surprise. The service does make it easy for personal and small business users to start selling online, though, and considering the low price you're paying, that's a pretty good incentive.",
    "Wix has a lot of built-in support. Left-clicking any object in the editor displays a toolbar with a Help icon, and a Help menu is permanently visible in the editor's own toolbar. Separate screens like the Blog Manager always have their own Help icon in the top-right corner.",
    "Wix's free plan includes Wix branding, gives you access to the drag-and-drop editor, and in theory supports an unlimited number of pages. In practice, though, a 500MB storage limit and maximum 500MB data transfer per month mean it's only suitable for very small sites.",
    "The Connect Domain plan lifts your bandwidth limit to 1GB and allows using your own domain, but still includes Wix branding. It's priced at $4.25 (£3) a month for the one-year package. Keep in mind though that this plan is not available in the US and other locations.",
    "The Combo plan offers 2GB bandwidth and 3GB storage, and finally ditches the branding. There's a free domain, you're able to use a customised favicon, and you get $75 of ad vouchers. It's yours for $14 (£6) a month.",
    "The $18 (£8.50) a month Unlimited plan gives you unlimited bandwidth, 10GB storage, premium form building and a Site Builder app to drive more traffic to your site.",
    "The VIP plan completes the range of ‘Website’ plans at $39 (£18) a month, by increasing the storage to 20GB, adding a few perks, and offering ‘priority response’ VIP support.",
    "There are also three ‘Business & eCommerce’ plans, all of which allow you to sell products online.",
    "The cheapest one is Business Basic at $23 (£13) a month which looks similar to VIP in terms of storage, minus the perks.",
    "Next up is Business Unlimited which increases your storage to 35GB, for $27 (£16) a month.",
    "Finally we have Business VIP, which offers you 50GB of storage and brings back the ‘priority response’ and VIP support, for $49 (£22) a month.",
    "Signing up for Wix Free gives you as much time as you need to try out the service basics, but Wix also has a no questions asked 14-day money-back guarantee for its Premium products.",
    "Wix's attractive templates and excellent editor make it easy for even total design newbies to build a great-looking, powerful website. We're less convinced that Wix has the support services that big websites require, but the core features are so strong that you need to try it yourself.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "5": "Getting started",
    "7": "Editor",
    "15": "Media",
    "19": "Blogging",
    "22": "E-commerce",
    "26": "Support",
    "27": "Plans and pricing",
    "37": "Final Verdict"
  },
  "links": {
    "Wix": "https://wixstats.com/?a=18408&c=124&s1=trd-us-6898298613501963000",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Combo plan": "https://www.wix.com/upgrade/website",
    "Unlimited plan": "https://www.wix.com/upgrade/website",
    "VIP plan": "https://www.wix.com/upgrade/website",
    "Business & eCommerce": "https://www.wix.com/upgrade/website",
    "Business Basic": "https://www.wix.com/upgrade/website",
    "Business Unlimited": "https://www.wix.com/upgrade/website",
    "Business VIP": "https://www.wix.com/upgrade/website"
  }
}