{
  "source": "https://www.techradar.com/reviews/corsair-sabre-rgb-pro-champion-series",
  "title": "Corsair Sabre RGB Pro Champion Series review",
  "category": "computing",
  "updated": "2021-08-02T19:06:27Z",
  "author": "michelle-rae-uy",
  "summary": "Fast and furious",
  "verdict": "Setting out to prove that less is more, the Corsair Sabre RGB Pro Champion Series demonstrates that you don’t need extra frills to win. All you need is a gaming mouse built for speed.",
  "pros": [
    "Incredibly fast performance",
    "Great ergonomics",
    "Lightweight",
    "Innovative cable design"
  ],
  "cons": [
    "Possible performance hit at 8,000Hz with lower specs",
    "Not many frills",
    "Only for right-handed gamers"
  ],
  "article": [
    "The Corsair Sabre RGB Pro Champion Series may look like an ordinary, plain-looking gaming mouse. However, when you’ve got a gaming mouse designed with help from the biggest esports gamers right now, it’s anything but.",
    "Every inch of this speedy devil is geared towards competition, so while it’s kept its design and feature set simple and minimalist, it’s also honed in to make things fast, efficient, and accurate. And, incredibly so, boasting an 8,000Hz polling rate, 18,000 DPI, Quickstrike buttons with fast actuation, PTFE glide pads for smooth gliding, a drag-reducing paracord cable, a lightweight design, and Corsair’s AXON hyper-processing technology.",
    "Luckily, you won’t have to pay an arm and a leg to take all that good stuff home. At $59 (£49, about AU$99), there might be other cheaper mice out there, but the Corsair Sabre RGB Pro Champion Series is still a bargain considering what it’s offering.",
    "Plus, there are also much pricier gaming mice, many of which don’t offer as high of a polling rate or as good of a design. Even its closest rival, the Razer Viper 8K, which comes with the same polling rate and a slightly higher DPI, costs more at $79 (£79, AU$134).",
    "If you’re into over-the-top gaming looks, the Corsair Sabre RGB Pro Champion Series’ simple and minimalist design might not be your cup of tea. This matte black plastic gaming mouse is not quite eye-catching and lacks all the frills apart from the two RGB lighting zones.",
    "It is, however, designed to be ergonomic and comfortable for long hours of gameplay. At 129 x 70 x 43mm, it’s neither overly massive nor too small, which makes it a great fit for most hands. At 74g, it’s blissfully light (although there are slightly lighter mice out there). And, it’s got that subtle ergonomic shape with moderately concave sides that keep most gamers’ fingers in place without needing a rubberized grip, and a pronounced bump at the palm rest that supports your hand for a less fatiguing gaming experience.",
    "The paracord cable is a god-send, made of the same nylon material used in the suspension lines for parachutes so you know it’s as robust as it is ultra-flexible. This cable never pulls on the mouse and never drags, so it never gets in the way of your game. It’s also 2.1 meters or almost 7 feet long, if you need some distance between you and your gaming PC.",
    "To round out that seamless experience, the Corsair Sabre RGB Pro Champion Series is also fitted with replaceable PTFE glide pads underneath for a much smoother glide on most surfaces.",
    "There are six buttons total: the left and right buttons, scroll wheel, DPI button, and the two side buttons that are set to forward and back at default. These buttons offer a much shorter travel with Corsair’s Quickstrike technology, which utilizes springs and metal hinges to balance the keys and create zero gap between the button and the Omron switch underneath. And, because the mouse utilizes optical switches, these buttons should last you quite a while with their 50 million click rating.",
    "The only thing some people might not like about these buttons is the fact that the DPI button is flush and may be easy to miss if you’re unaware of its existence. However, that doesn’t make it any less responsive than the others.",
    "Sadly, the RGB lighting is minimal. There are only two zones – one on the wheel and the other on the Corsair logo at the palm rest. Both are customizable, however, via the Corsair iCue software. There, you’ll find four presets that you can fine-tune, as well as three custom settings with more adjustability. The mouse also features hardware lighting, which means you can save a preset on the mouse using the software, and use that same preset on a different PC.",
    "The Corsair Sabre RGB Pro Champion Series is one of those rare gaming mice – at least at the time of writing – that boast an 8,000Hz polling rate, which essentially means it reports 8,000 times in one second. That’s quite a jump from the usual 1,000Hz polling rate that most mice have right now. Corsair then combines that with an 18,000 DPI and the AXON hyper-processing technology.",
    "All these impressive numbers don’t just look good on paper. You can really see the difference between this and other gaming mice, as it’s far more accurate even in faster-paced scenarios.",
    "In Far Cry 5, for example, we’re able to aim and shoot one enemy after another quickly and accurately when facing multiple enemies at once. It’s the same case with Cyberpunk 2077. Essentially, because of that faster polling rate, we are able to very quickly zero in on our targets without overcorrecting and killing them more effectively, vastly improving our kill-to-death ratio.",
    "It helps that the Corsair Sabre RGB Pro Champion Series is incredibly lightweight. Plus, because of those pads and very flexible cable, it truly feels like an extension of our hand. Of course, those buttons are incredibly responsive and their actuation is impressively short. We have found that we could press a button very lightly, and it’ll be just as effective as a regular press.",
    "Bear in mind that the 8,000Hz polling rate could slow down your computer if you have an older rig. While we haven’t experienced this during our testing – owing to the fact that we tested it on gaming laptops with Intel Core i7 and AMD Ryzen 9 chips – we’ve read reports of people experiencing hits to their performance when using it on PCs with older or lower specs.",
    "To be fair to Corsair, this is actually noted on the mouse’s landing page. According to Corsair, “Higher USB polling rates use additional system processing power. A minimum of an Intel i7 9th generation or AMD Ryzen 7 2nd generation processor (or equivalent) is required for the best 8,000Hz hyper-polling experience.”",
    "If you have such specs, however, you shouldn’t have an issue.",
    "Much like all of Corsair’s gaming products, the Corsair Sabre RGB Pro Champion Series is supported by the iCue software, which lets users customize its RGB lighting as well as record macros and create remaps.",
    "The RGB lighting customizations are more minimal than others. There are only four presets available, and in those presets, there are only two or three settings you can adjust. There are three custom presets on hand, to be fair, and they are a little more customizable. However, they’re also still limited.",
    "As far as key reassignments, you’ll find the customizations here as extensive as those on other gaming mice. The iCue software will let you remap any of the six buttons with keystrokes, macros, and other functionalities like launching an app or disabling a media button."
  ],
  "headers": {
    "0": "Two-minute review",
    "21": "Don’t buy it if…"
  },
  "links": {
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "Razer Viper 8K": "https://www.techradar.com/reviews/razer-viper-8k-review"
  }
}