{
  "source": "https://www.techradar.com/reviews/lamniavpn",
  "title": "LamniaVPN review",
  "category": "computing",
  "updated": "2021-02-02T15:07:22Z",
  "author": "sead-fadilpasic",
  "summary": "It’s fast, but that’s about it",
  "verdict": "LamniaVPN provides torrenting support and some of the best speeds we’ve witnessed, but unfortunately this is where the advantages end. There are no user-friendly native clients to make setup easier, the website lacks detailed information and we felt cheated by the “24-hour” free trial.",
  "pros": [
    "Blazing speeds",
    "Supports torrenting",
    "Unblocks BBC iPlayer"
  ],
  "cons": [
    "Misleading free trial",
    "Expensive",
    "No native apps",
    "Unclear privacy policy"
  ],
  "article": [
    "LamniaVPN is a VPN service founded by a group of IT professionals now based in the UK. It's been around for circa twelve years, with data centers in eight different countries and a global support network.",
    "LamniaVPN claims to offer a 24-hour free trial, after which it starts charging for its service on a monthly basis at £12.99 ($17.20). However, 17 hours after we signed up for the trial, we were charged the full price, so be wary.",
    "Besides the monthly subscription, you can purchase a quarterly service charged at £34.99 ($46.30) every three months (equal to $11.66/month), also with a “24-hour” free trial. There’s also a one-time, single-month subscription that costs £14.99 ($19.85).",
    "As an additional option, LamniaVPN offers a dedicated VPN location of your choice at the price of £19.99 ($43.79) per month and a yearly subscription charged at £199.99 (equal to $36.50/month).",
    "Payments are carried out via PayPal. Under one account, you can connect up to 3 devices to LamniaVPN at the same time.",
    "LamniaVPN delivers great speeds but lacks a lot of the finesse demonstrated by the better-known players in the cyber anonymity field, such as ExpressVPN or NordVPN, both of which provide beginner-friendly apps for all the major devices, thousands of servers, live chat support and more.",
    "Close contenders Surfshark and CyberGhost don’t fall far behind and are both a lot cheaper than LamniaVPN if you opt for one of their longer subscription options.",
    "None of these services offer the type of free trial that LamniaVPN does, but they do offer a risk-free money-back guarantee.",
    "Being able to unblock popular streaming channels like Netflix or BBC iPlayer is an enviable VPN feature. LamniaVPN can unblock BBC iPlayer, but don’t get your hopes up if you want access to Netflix US.",
    "The company running LamniaVPN is headquartered in the UK and has technical operators in France, Thailand, Germany and the USA.",
    "Scanning through the server list, we counted 20 servers in 8 countries, while elsewhere on the website the provider claims to have thousands of IP addresses.",
    "There isn’t much mention of the encryption and the protocols used, but the website states that it uses OpenVPN, “a custom security protocol that utilizes SSL/TLS for key exchange” and “is capable of traversing network address translators (NATs) and firewalls”. When manually installing the service on Windows, we also noticed the use of L2TP.",
    "The provider’s Privacy Policy is a neatly presented but limited document that fails to address the data collected and logged by the provider. We did find some troubling though unclear information; there seems to be certain “activity data tracked by your device”, which could mean anything, really.",
    "Torrenting is allowed, although not on all of its server locations.",
    "LamniaVPN can be used on Windows, Mac, iOS, Android and Linux devices. However, things aren’t as simple as just downloading and installing an app and being done with it.",
    "While Windows 10 users should be able to download its auto-dialer from the welcome email and start connecting immediately (although we couldn’t), others will have to rely on their devices’ in-built VPN options and the instructions provided on the website.",
    "We tried to look for the “live support” the provider claims to have but we could only manage to find a contact form and an email address, which can hardly be called “live”, but is better than nothing. Still, we tried contacting the support twice, the first time was about general queries we usually ask VPNs, the other time was to ask for a refund due to charging the service before the free trial was supposed to end.",
    "In terms of materials provided on the website, we were disappointed. We found a small FAQ section and video instructions for the auto-dialer and manual installation, but even that area is incomplete.",
    "Also, the pages for Linux and OpenVPN configuration gave us the message that they are “currently being updated” and to “use Live Support or Contact us for more details”.",
    "Upon installing the auto-dialer, we tried connecting to several different servers, but the connection failed each time. We had no other choice but to try the more complicated way: manual installation.",
    "Since we had experience with this before, it went smoothly, but the video instructions on the website are clear enough for a beginner as well, so you shouldn’t have any inconvenience (other than wasting your time).",
    "From the provided server list, we first chose to test a location in the Czech Republic, which gave us a blazing 43.17Mbps on an 85Mbps testing connection. We then went for a server in the UK, which delivered a somewhat less brilliant but acceptable 18.43Mbps.",
    "A server in the US, meanwhile, gave us 13Mbps, which is as expected for a server in another continent.",
    "Each connection was established in less than a second, which isn’t something we see often.",
    "LamniaVPN excels in download speeds, torrenting support, and unblocking some VOD content. In all other areas - including server network, native apps, customer support and information availability - it falls far behind the industry giants.",
    "The biggest insult, however, is the fact it claims to offer a 24-hour free trial, only to end it 17 hours after signing up."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "11": "Privacy and encryption",
    "14": "Support",
    "19": "Speed and experience",
    "24": "Verdict"
  },
  "links": {
    "LamniaVPN": "https://www.lamnia.co.uk/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1287397949762543000&xs=1&url=https%3A%2F%2Fwww.iubenda.com%2Fprivacy-policy%2F68020904&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Flamniavpn",
    "contact form": "https://www.lamnia.co.uk/contact.html",
    "email": "mailto:support@lamnia.co.uk",
    "FAQ section": "https://www.lamnia.co.uk/vpnfaq.html",
    "video instructions": "https://www.lamnia.co.uk/setup.html"
  }
}