{
  "source": "https://www.techradar.com/reviews/xbox-series-s",
  "title": "Xbox Series S review",
  "category": "gaming",
  "updated": "2021-08-30T10:47:35Z",
  "author": "nick-pino",
  "summary": "The Xbox Series S is a next-generation console with a couple of caveats",
  "verdict": "The Xbox Series S is a great entry point into next-gen gaming for those who have no qualms about buying games digitally or subscribe to Xbox Game Pass. It's a great option if you want to avoid the sizable financial outlay required to own a full-blown next-gen console, but there are some drawbacks. It has significantly less storage, prioritizes 1440p resolution for gaming and does without the 4K HD Blu-Ray drive of the Xbox Series X.",
  "pros": [
    "The smallest Xbox ever made",
    "Compact design, powerful specs",
    "Completely silent in operation",
    "Faster load times"
  ],
  "cons": [
    "Targets 1440p resolution when gaming",
    "512GB SSD fills up fast",
    "No disc drive",
    "UI can be overwhelming at first"
  ],
  "article": [
    "The Xbox Series S is a next-gen console that takes a radically different approach to the flagship model of the Xbox Series X. It's designed to offer the same generational leap as Microsoft's more powerful system, such as high frame rates, ray tracing and super-fast load times, but at a considerably lower price – and inevitably, this means it comes with a few notable compromises.",
    "The Xbox Series S has significantly less storage than the Xbox Series X, and primarily targets a resolution of 1440p for gaming. It can upscale to 4K when connected to an ultra HD display, and a handful of titles are capable of native 4K such as Ori and the Will of the Wisps, but this is a machine designed to run games at a lower resolution first and foremost.",
    "Microsoft's more affordable Xbox also does away with the 4K HD Blu-Ray drive of the Xbox Series X, which means it's a digital only device. If you've amassed a large library of physical games over the years, this alone could be a deal breaker.",
    "These cutbacks might be too much for some users to stomach, but it makes the Xbox Series S a much cheaper and smaller device as a result. Crucially, it's still capable of playing next-gen games and is a great entry point into the Xbox ecosystem.",
    "During our time with the Xbox Series S, we tested dozens of games – from last-gen \"Xbox Series X/S optimized\" hits including Halo: The Master Chief Collection, Forza Horizon 4, Doom Eternal and Gears 5, to launch titles like Yakuza: Like a Dragon.",
    "Each one impressed us, with smoother frame rates, increased resolutions (when compared to Xbox One and Xbox One S) and faster load times, even if they didn't look quite as pretty as they do running on the Xbox Series X, mostly due to targeting a lower resolution.",
    "That said, for gamers who have no qualms about buying games digitally, or subscribe to Xbox Game Pass, you’re getting the full suite of next-gen features on Microsoft's cheaper console. The Xbox Series S is a great entry point into next-gen gaming, then, without the sizable financial outlay required to own a full-blown next-gen console.",
    "As we've alluded to already, there are drawbacks to consider. If you prefer to purchase games physically, or have amassed a large collection of Xbox One games over the years, the Xbox Series S's lack of disc drive may put you off.",
    "You only get a 512GB SSD, too, as there's no higher-capacity option. And while the console's SSD is dramatically faster than the old mechanical drives in the Xbox One X and Xbox One S, it can fill up fast.",
    "The five games we mentioned above almost took up the entire 512GB SSD on our review unit (you only get 364GB of usable space), leaving us with just 30GB of space to play with. That means if we wanted to install a game of that size to the system's internal drive, we'd likely have to delete something first (or additionally purchase the console's expandable storage, which costs nearly as much as the Xbox Series S itself).",
    "The other factor that may deter people from buying Microsoft's more affordable Xbox is the fact that outputs at 1440p for gaming. This lower resolution is a firm favorite in the PC gaming space due to the superior image quality it provides over 1080p, and lower amount of graphical grunt it requires from developers to achieve, which has allowed Microsoft to create a lower-spec machine that still boasts next-gen features.",
    "If you own an Xbox One X, the drop to 1440p from native 4K can be noticeable. The Xbox One X was able to deliver games like Forza Motorsport 7 at 4K/60fps, and is still capable of some sumptuous visuals. It's easy, then, to think that the Xbox Series S is a step back – however, it's capable of a lot more than Microsoft's aging Xbox One X, even if it doesn't always beat it in terms of resolution.",
    "Looking at the internals of the system, the Xbox Series S separates itself from the One X with its vastly more powerful CPU and more technically capable GPU, courtesy of AMD's RDNA 2 architecture which enables cutting-edge features like ray tracing. Yes, the Series S has fewer teraflops than the Xbox One X (four compared to six), but teraflops are no longer the defining factor in how GPU power is determined.",
    "For Xbox One owners looking to upgrade without breaking the bank, the Xbox Series S is a great option, if you can accept what it's been designed to achieve. If you've already got the Xbox One X and a 4K display at home however, we suggest considering the Xbox Series X instead.",
    "Considering the bigger sibling? Check out our Xbox Series X video review below.",
    "The Xbox Series S is available now for $299.99 / £249.99 / AU$499, and released on November 10, 2020. That's the same release date as the Xbox Series X, though the price is significantly cheaper than the Series X's price of $499 / £499 / AU$749.",
    "Keep in mind however that, without a disc drive, you won't be able to buy used games or trade games with your friends: you're dependent on the Xbox Store for any purchases, which means you won't always get the best deal.",
    "That issue is negated somewhat if you subscribe to Xbox Game Pass (a separate expense, but exceptional value nonetheless), or only buy the occasional game at full price around launch time, but it's not ideal for those who rely on physical game sales or trade-ins to fund their favorite pastime.",
    "Speaking of discounts, it's worth pointing out that the Xbox Series S is also available on Microsoft's Xbox All Access subscription service in select regions, including the US, UK and Australia.",
    "Xbox All Access bundles the console with Xbox Game Pass Ultimate on a 24-month plan (giving you access to the latter for the duration) for $24.99 / £20.99 / AU$33 a month, with no upfront costs – that's a good deal, and one that works out cheaper than if you were to buy the console and pay for 24 months of Xbox Game Pass Ultimate separately.",
    "Of course, Microsoft isn't the only one with new hardware out in November. Sony released the PS5 and PS5 Digital Edition just a few days after the Xbox Series S and Series X, so if you're still on the fence then it's worth checking out our reviews of those consoles before committing.",
    "While the hardware powering the Xbox Series S is brand-new, the design of the Xbox Series S is a little reminiscent of the (now discontinued) Xbox One S All-Digital Edition.",
    "The Xbox Series S has a distinctive black fan vent, almost like a speaker grille, on the top that breaks up the swathe of white which encases the rest of the console, and it's where the majority of the heat is exhausted. It's the smallest Xbox that Microsoft has ever made, with a plain front face that sports a single USB port and a power button. It's a clean, understated and functional design.",
    "In terms of ports, if you spin the Xbox Series S around you’ll find an HDMI 2.1 output, two USB 3.2 ports, an Ethernet port, a storage expansion slot and an AC input.",
    "Perhaps unsurprisingly, the Xbox Series S doesn't have a port for Kinect, Microsoft's now-defunct motion-sensing camera, or a HDMI input for cable boxes. (Note, however, that the Xbox Series S only ships with a High Speed HDMI cable, not an Ultra High Speed HDMI cable.)",
    "In terms of weight and size, the Xbox Series S measures in at 6.5 x 15.1 x 27.5cm and 4.25 pounds (around 2kg). Its size should ensure it easily fits into most entertainment center cabinets and on TV stands, and it's light enough to pack up and bring to a friend's house, or take with you on vacation.",
    "As we mentioned above, the Xbox Series S is smaller than the Xbox One S, which is an impressive feat considering that it’s packing a 4 TFLOP GPU and an octa-core Custom Zen 2 CPU that need to be cooled.",
    "While some might not like the way Microsoft has aped its own design from the last generation, we're okay with it. It's nice to have some continuity, especially in products which are advertised as a family of devices instead of a whole new line, although it is fairly straightforward and industrial-like in its appearance.",
    "The Xbox Series S's strong suit is its value proposition – it's a compact powerhouse. It can offer either upscaled 4K gaming, native 1440p resolution or a 1080p picture.",
    "Its GPU, while not as powerful as the one in the Xbox Series X, can upscale games to 4K (in a similar way to the Xbox One S) and still run games at 120fps at 1440p, but you'll need a HDMI 2.1-compliant TV if you want to keep the resolution at 1440p. It's also capable of ray tracing, and loads games faster than ever thanks to Microsoft's Xbox Velocity Architecture.",
    "Combine Velocity Architecture with the 10GB of GDDR6 memory and built-in SSD, and you’ve got all the makings of a powerful console.",
    "But do you actually need a 4K TV? And furthermore, do you need one that supports HDMI 2.1 for its 120Hz refresh rate? Let’s walk through all the scenarios.",
    "If you're using a 1080p TV, the Xbox Series S uses a technique called supersampling to create better-looking images, even on less-capable displays. Supersampling is a complex process, but the basic idea is that the game is rendered at higher resolution, and then downscales the image to match the output of your TV.",
    "The end result is a noticeable boost in image clarity and anti-aliasing (the removal of jaggies and pixelated edges), and means that gamers who aren't using a 4K or 1440p -capable screen will still benefit from improved image quality from the Xbox Series S.",
    "Most folks though, we expect, will be pairing the Xbox Series S with a 4K HDR TV – potentially one with a 120Hz native refresh rate, although the majority of displays sold over the last few years are likely to only support 60Hz at 4K and 1440p.",
    "If you do hook the Xbox Series S up to a 4K panel, the console will use a technique called upscaling to convert a non-native 4K signal to 4K. While there's a stark difference between rendering in 4K, and rendering in 1440p and then upscaling to 4K – especially if you've got a keen eye for detail – it still makes games on the Xbox Series S look better than if the console was locked to a 1440p output.",
    "It's worth noting that the Xbox Series S can render some games in native 4K if a developer chooses to enable that option, but it's done on a game-by-game basis, and isn't something you’re going to see on every game on the system.",
    "The upshot here is that the console can utilize HDR (high dynamic range) that enables a wider color palette, higher peak brightness and better contrast levels. Skies look bluer, grass looks greener and colors pop in every scene. If you haven't had the opportunity to game in HDR yet, you're in for a treat.",
    "If you are fortunate enough to have a display that's compliant with HDMI 2.1, you can enable 120fps at 1440p without having to drop down to 1080p resolution. To enable 120fps, simply pop into the console's audio and visual settings, where you can choose from various frame rate and resolution options.",
    "It's pretty straightforward, but it's worth noting that not all games can hit 120fps and, at the time of writing, there are only a handful that can, including The Falconeer and Gears 5's multiplayer – with Call of Duty Black Ops: Cold War, Halo Infinite multiplayer and more due to get support in the future.",
    "Even if you don't invest in a new TV, you're still going to see the benefits of the new SSD and Microsoft's Xbox Velocity Architecture. The latter is a multi-step solution that combines the Series S's custom NVMe SSD, hardware-accelerated decompression blocks, a brand-new DirectStorage API layer and Sampler Feedback Streaming (SFS).",
    "That's a lot to parse, but the gist of it is that data is stored in a more efficient way, and can be loaded into memory faster thanks to both the physical storage medium and the software algorithms that Microsoft have implemented to load the data.",
    "The result is significantly faster load times compared to Xbox One X, and the SSD also enables features like Quick Resume which we’ll get to shortly.",
    "Of course, the one area that's less impressive here is the meager 512GB of storage capacity, which most people will fill up pretty much overnight. While 500GB was sufficient early on during the last console generation, game file sizes have expanded exponentially in the years since, making anything less than 1TB of storage seem like a raw deal.",
    "And it gets worse when you consider that you don't even get access to the full 512GB of storage. The system OS takes up 148GB of space, meaning you've only got 364GB of usable storage to play with from the outset.",
    "By the time you've installed four or five games, you'll need to start thinking about what to uninstall, which is never a fun experience. While Microsoft claims that games on Xbox Series S will be up to 30% smaller due to not having 4K texture files, this won’t stop the system's internal drive from rapidly filling up.",
    "The good news is that Microsoft has released an add-on storage solution at launch, in partnership with Seagate, that can add 1TB of extra storage if you run out of room. The bad news? The Seagate Storage Expansion Card costs $219.99 / £219.99 / AU$359 – money that could be spent on buying an Xbox Series X instead.",
    "Coming from the Xbox One Controller, you'd be forgiven for thinking that the Xbox Series X/S controller isn't all that different. However, it's now more comfortable and easier to use than ever before due to subtle changes in the controller's ergonomics.",
    "Its overall dimensions have been tweaked ever so slightly, reducing the size of the controller as a whole, but not to the point where it's noticeable to the average user. It means more hand sizes can use the new Xbox pad comfortably. Other changes include a textured and matte finish on the handles, triggers and bumpers, that help you get more purchase on the controller during tense gaming sessions.",
    "Probably the biggest change for the controller itself, though, is the new D-pad, which has been revised to be a full 360-degree pad that feels great on the thumb. Each direction clicks with a satisfying sound and tactile feedback (though some might find it noisier than they'd like), and its smooth finish makes pulling off half-circle sweeps in fighting games a real pleasure.",
    "Another minor change is that the triggers on the back of the controller have been shortened to make them more accommodating for smaller hands. The triggers still have haptic feedback in the form of rumble motors, but it's not the same as the adaptive triggers in the PS5 DualSense controller, which can change resistance on the fly.",
    "The new Share button does exactly what you'd expect – it captures and shares moments in your game for posting in your Xbox Feed or on social media. One click takes a snapshot, while holding the button down longer captures a 15-second video (you can adjust the duration in the Capture settings).",
    "It's much easier than on the Xbox One, where you had to press the home button twice and then X or Y, but it does take some getting used to if you’re accustomed to doing it the old way.",
    "Overall though, it's mostly what you remember, with two asymmetrical analog sticks, the menu and view buttons that fill in for start and select, and the four face buttons (A, B, X, Y).",
    "The Xbox Series S controller keeps its 3.5mm audio jack and expansion port at the bottom, but it now uses a USB Type-C charging port instead of microUSB. You'll also find the pairing button at the top, which you use to sync the controller to the console, or for pairing when using Bluetooth.",
    "The new Xbox pad is still a comfortable controller to play with, but its biggest weakness is the fact that it still uses AA batteries, instead of a rechargeable lithium-ion cell like the Xbox Elite Wireless Controller Series 2. We found a pair of AA batteries lasted for around 10 days or so of heavy gaming, but we’ll update this review with a clearer figure in due course.",
    "If you're appalled by the idea of a controller using AA batteries in 2020, you can also pick up Microsoft's play-and-charge kit, which comprises a rechargeable battery and USB-C cable, for $24.99 (£20.99 / AU$29.95 ) to save you money in the long term (you can also use rechargeable AAs).",
    "While the kit is obviously an extra expense that may irk some, there's an element of flexibility at least – and you're also not at the mercy of a lithium-ion cell battery, which can degrade over time, and which is more costly to replace should anything go awry.",
    "Our advice? Pick up rechargeable batteries, or Microsoft's play-and-charge kit, if you plan on doing more than 40 hours of gaming a week.",
    "If it's been a few years since you bought an Xbox console, and you're worried that the process of setting it up might be confusing, don't be. Setting up the Xbox Series S proved to be a streamlined process, thanks in no small part to the new-and-improved Xbox app for Android and iOS.",
    "You’ll need to download the app from the App Store or Google Play Store, and log in to your Microsoft account. Once you're logged in, power-on the console and type in the code you see in the app, which appears on your TV screen – this pulls in all your data without you having to type it all in. You'll still need to enter a few additional details via the console, like your Wi-Fi name and password, but then you're off to the races after waiting for a small update to land.",
    "The UI that greets you when you’ve finished setting up the Xbox Series S will be instantly familiar to anyone who's used an Xbox One in the last three months, as the 'new' Xbox Dashboard rolled out in August, and is the same across both Xbox Series X and S and the older hardware. It isn’t the most intuitive of interfaces, though.",
    "There's a lot of information on display at once, and it's fair to say there's a small learning curve when it comes to figuring out how to navigate the UI effectively.",
    "The downside to the new consoles having the same user interface as the One series is that the Xbox Series S doesn't feel any different right away, even if navigating the dashboard feels snappier than before thanks to the extra power underneath the hood.",
    "Moreover, the new UI still presents some of the same problems we've noticed in the past with Xbox One's interface: some images on the screen take a few seconds to load as content is pulled from the internet, and it's generally a bit too busy for most tastes, with far more information on screen than you actually need at one time.",
    "Look past the UI, however, and you'll begin to see some areas where the Xbox Series S really innovates, though they're admittedly more subtle.",
    "Smart Delivery from the Xbox Store means you'll always get the best possible version of a game when you download it, or if it's upgraded in the future. Your save data also carries over seamlessly, even if you jump back and forth between your old Xbox One / One X / One S and new Xbox Series S. It's essentially simultaneously backwards and forwards compatibility, which is reassuring.",
    "Jumping between multiple games at a time is now possible thanks to Quick Resume, a new feature that allows the Xbox Series S to hold multiple game states in the memory at one time, so you can jump back and forth between games without having to reload them.",
    "The number of games that can be suspended varies – we had as many as eight in rotation at one point – and it won't work with every title, especially those with ever-changing online worlds, like Sea of Thieves. It's a handy, time-saving feature that's only possible thanks to the console's SSD, and game states are preserved even if the console is completely powered down.",
    "Lastly, we have to talk about the console's multimedia capabilities. As a streaming device, the Xbox Series S carries most major services, from Netflix and Amazon Prime Video to newcomers like Apple TV Plus and Disney Plus, as well as region-specific apps such as Hulu in the US and Sky Go in the UK.",
    "Accessing these requires navigating to the Apps section of your library or, if you frequently use particular apps you can pin them to the home screen or create a specific group that can be accessed from the Xbox guide. We noticed that, like games, apps stayed in a suspended state when we flicked between them.",
    "It's important to note that while the Xbox Series S only outputs at 1440p resolution when you're gaming, the console is capable of displaying streaming apps in 4K HDR. That means the likes of Netflix, Disney Plus and Apple TV Plus will output in 4K if you're using a compatible display.",
    "As on the One X, some of these services are available in Dolby Vision and Dolby Atmos, giving you access to advanced HDR and 3D surround sound respectively, but you may have to pay for a higher subscription tier in order to access those formats.",
    "We won't mince words here: the Xbox Series S's game library is off to a bad start. With the delay of Halo Infinite to 2021 and beyond, there aren't any first-party exclusives available at launch on the Xbox Series S, other than titles that have previously been available on Xbox, or on PC, like Gears Tactics.",
    "We'll get more third-party exclusives soon, in the form of The Medium and Bright Memory Infinite, but right now Microsoft's first-party output is noticeably lacking.",
    "Instead of releasing new experiences on day one, Microsoft has opted to improve the library of games it's already got via Xbox Series S Optimizations. Games like Gears 5, Forza Horizon 4, and Ori and the Will of the Wisps, and Sea of Thieves have all been optimized to either increase their base resolution or frame rates, or to offer greater visual fidelity.",
    "If you want to quickly see which games have been optimized for the Xbox Series S, head to 'My Games & App' > 'Games' > and then select 'Group by console type'. You can then see all the games optimised for Xbox Series X/S at a glance.",
    "If you're someone who loves having access to the entire library of Xbox games past and present, the Xbox Series S will be appealing because it supports four generations of Xbox titles, stretching all the way back to the original Xbox.",
    "Being able to jump back and forth between Xbox 360 classics like Viva Piñata and Red Dead Redemption to more modern-day blockbusters is comforting, and it's nice not having to break out the old hardware or track down an old CRT TV.",
    "The caveat here is that, because the Xbox Series S doesn't have a disc drive, you'll need digital versions of those older games in order to play them – and for that reason alone, Xbox Game Pass is great.",
    "On it, you'll find over 100 games available to download on the Xbox Series S, with a mix of new first-party titles like Halo: The Master Chief Collection, Gears 5 and Forza 7, and some indie gems from the Xbox 360 era. If you're someone who loves the Games with Gold program, but wish you had a few more options to download, Game Pass is really satisfying.",
    "While Game Pass can't make up for the lack of exclusives at launch, it does enable you to pad out your library, and gives you a chance to see some of the best previous-gen games in a new light. You also get access to all of Microsoft's first-party games the day they release, including the upcoming Halo Infinite, which represents a huge long-term saving in itself."
  ],
  "headers": {
    "0": "Two-minute review",
    "82": "Don't buy it if..."
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Halo: The Master Chief Collection": "https://www.techradar.com/news/halo-the-master-chief-collection-is-getting-a-serious-xbox-series-x-upgrade",
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review",
    "Yakuza: Like a Dragon": "https://www.techradar.com/news/yakuza-games-in-order-by-release-date-in-chronological-order-and-ranked",
    "Xbox One": "https://www.techradar.com/reviews/original-2013-xbox-one",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One S All-Digital Edition": "https://www.techradar.com/reviews/xbox-one-s-all-digital-edition",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Xbox Elite Wireless Controller Series 2": "https://www.techradar.com/reviews/xbox-elite-wireless-controller-series-2-review",
    "App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7182353581694995000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fgb%2Fapp%2Fxbox%2Fid736179781",
    "Google Play Store": "https://play.google.com/store/apps/details?id=com.microsoft.xboxone.smartglass&hl=en_GB&gl=US",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-review",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite"
  }
}