{
  "source": "https://www.techradar.com/reviews/soti-mobicontrol-mdm",
  "title": "SOTI MobiControl MDM review",
  "category": "computing",
  "updated": "2021-08-19T14:30:58Z",
  "author": "christian-cawley",
  "summary": "A feature-packed MDM system with a free evaluation period",
  "verdict": "A complete mobile device management system, SOTI MobiControl boasts vast device compatibility and can be hosted on-premises or in the cloud. Various license options are available to keep your MDM in-budget, and the software is also available with a 28-day free evaluation period.",
  "pros": [
    "Feature packed",
    "Legacy device support",
    "Supports multiple operating systems and form factors"
  ],
  "cons": [
    "Hard sell approach during evaluation period"
  ],
  "article": [
    "Mobile Device Management (MDM) systems are at their best when they cover the complete range of mobile hardware in use. While compatible with a wide range of devices, MDM software also needs to be easy to configure and simple to enroll devices on.",
    "SOTI MobiControl is one of several mobility and IoT solutions from SOTI. It aims to provide a simple user interface for managing multiple form factor device types from various vendors running most operating systems.",
    "It simplifies the security and management of multi-vendor, multi form-factor and multi-operating devices in your multi-purpose business mobility deployment – all through a single, easy to use interface.",
    "In this review, we'll look at what SOTI MobiControl has on offer to manage multiple mobile devices.",
    "SOTI MobiControl is high on features, providing almost everything you could possibly require for managing a fleet of devices across users, operating systems (Google Android, Apple iOS and macOS, Microsoft Windows, and Linux are all supported), and sites. Zebra mobile computer enterprise devices are also supported.",
    "The software enables full lifecycle device management, simplifying the task of securing and managing mobile hardware through the full lifecycle, with multiple methods of enrolment. Among these are SOTI Stage, Apple DEP, Android Zero-Touch, and Samsung KME.",
    "Linux support is key to SOTI MobiControl's advanced IoT management feature. As IoT devices proliferate in industry, this software boasts being the first solution for managing Linux-based mobile devices and endpoints.",
    "SOTI MobiControl also integrates with SOTI Hub and SOTI Surf to deliver managed, mobile access to key documents and files from anywhere. Combined with mobile app management – including the ability to deploy across a multi-OS environment. Deployment can be achieved across multiple scenarios: BYOD (Bring Your Own Device), CYOD (Choose Your Own Device), COBO (Corporately Owned, Business Only), and COPE (Corporately Owned, Personally Enabled). Android 11's COPE implementation is also supported.",
    "Premium Plus and Enterprise Plus Service customers can benefit from SOTI MobiControl's System Health Dashboard, a real-time view of the past 48 hours of activity. This collates operational stats on queue lengths, processing time, mobile CPU and database health, and server health.",
    "SOTI MobiControl is available with on-premises or remote cloud hosting, depending upon your requirements. If you have the expertise and time bandwidth to manage on site, the on-premises installation makes sense. However, this may also come with the typical complications that arise when installing new services. Is a dedicated server required? Will a virtual server suffice?",
    "The answer to these questions will depend on your set up, scale, and budget. Cloud hosting may be the smarter solution to get started with SOTI MobiControl.",
    "Enrolment is supported across multiple device types, generations, and platforms, and described as \"rapid.\"",
    "While some MDM solutions are limited to specific platforms (for example, Jamf with its Apple-centric device management), SOTI MobiControl can be used with a wide selection of hardware.",
    "As suitable for the latest smartphones, tablets, and laptops, as it is for PDAs and other legacy devices, SOTI MobiControl covers every possible device usage you might consider. So, whether your hardware is Android, iOS, or Windows tablets, Android-powered devices used by couriers, or even legacy Windows PDAs, SOTI MobiControl can be used for device management.",
    "From an endpoint point of view, SOTI MobiControl's presence is largely anonymous, although this of course depends on the type of provisioning.",
    "At the admin end, a straightforward, browser-based UI is provided, which makes it simple to select devices, interrogate for information, and create groups. This enables rollout of specific permissions, applications, patches and updates, etc., based on device role, user location, and many other considerations.",
    "Endpoints can be found by device name, manufacturer, model, OS, and even factors such as remaining battery, memory, and standard methods such as phone number, the owner's username, and MAC address.",
    "If you're interested in SOTI MobiControl, a free trial is available for evaluation purposes. This lasts 28 days but freezes after 7 days of inactivity and is closed after a further 7. Strict pricing appears to be on a business-by-business case, with scalable options, but based around a $4.00 per device per month license for the cloud system, and $3.25 per device per month for on-premises hosting.",
    "A perpetual $90 per device per month option is also available, with $18 per device per year for maintenance.",
    "With such flexible pricing available to suit pretty much any business dynamic, SOTI MobiControl looks like a smart choice. However, beware the hard sell. During the evaluation I was contacted several times, despite informing the sales team early on that I would email them when I had questions. If you're not keen on being rushed into making a decision on software procurement, this may understandably put you off.",
    "MDM solutions tend to offer more than you need or focus on a specific device type. SOTI MobiControl appears to get the balance right by supporting pretty much all devices that you need it to. With multiple device management scenarios (BYOD, CYOD, COBO, COPE) you can be certain that the devices you're overseeing are updated, audited, error-free, and not misused.",
    "The evaluation period is extremely generous, but it is worth reiterating that the sales team really wants to close the deal early. Consequently, they'll be in touch repeatedly to arrange a demo.",
    "With a choice of on-premises hosting and cloud hosting, SOTI MobiControl should be easy to set up and rollout. The option of a System Health Dashboard for Premium and Enterprise Plus subscriptions offers a useful 48-hour view of various operational stats, demonstrating the hidden power of SOTI MobiControl."
  ],
  "headers": {
    "4": "Features",
    "9": "Installation and setup",
    "12": "Compatibility",
    "14": "Usability",
    "17": "Plans and pricing",
    "20": "Final verdict"
  },
  "links": {
    "MDM": "https://www.techradar.com/best/best-mdm-solutions",
    "SOTI MobiControl": "https://soti.net/solutions/mobile-device-management/",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know"
  }
}