{
  "source": "https://www.techradar.com/reviews/network-solutions-website-builder",
  "title": "Network Solutions website builder review",
  "category": "computing",
  "updated": "2021-08-23T05:40:01Z",
  "author": "chyelle-dvorak",
  "summary": "Network Solutions website builder has a lot of great features",
  "verdict": "While Network Solutions isn’t as widely known, it’s still a valuable web hosting option on paper that might be right for you. It doesn’t have the best interface but it’s easy to build your own website using Network Solutions’ drag-and-drop features. Just make sure you read the user agreement.",
  "pros": [
    "Easy to use drag-and-drop features",
    "Good ecommerce tools",
    "Templates are easy to use"
  ],
  "cons": [
    "Confusing interface",
    "Hidden list of features",
    "Cannot view templates as easily",
    "Pricing and refunds are opaque"
  ],
  "article": [
    "The great thing about Network Solutions is how many options they have on their website. You can easily build a website on your own, or sign up for their professional website design services. If you’re not ready to build a website by yourself, then using such assistance will save you time and energy. You can also chat with them to answer some questions you may have about web hosting or their website builder service. If you want a web host that makes managing your domain settings easier, then Network Solutions might be the right option for you.",
    "If you already have a registered domain somewhere else, Network Solutions includes options for domain transfer. All you need to do is enter your domain name on the main website, complete your purchase, then authorise the transfer. If you’re trying to transfer your domain to a new registrar to save money, then Network Solutions likely has a more affordable option. Prices are also lower than some of the more popular web hosts out there.",
    "When it comes to their Website Builder service, Network Solutions offer you three simple plans. They all come with an introductory price for the first month, but we were unable to find out how much a regular month costs. This lack of transparency is not a good sign.",
    "The first one, just called ‘Website Builder’ will cost you $2.95 for the first month. This comes with a free domain name for the first year (you’re also able to use one you already own), and access to over 150 templates so you don’t have to start creating a site from scratch.",
    "‘Website and Online Marketing’ is worth $3.95 for the first month. In addition to all the features present in the first plan, this one focusses on marketing, and includes business profiles and search engine submissions to Google, Yahoo and Bing, among others.",
    "The third plan, ‘Website, Marketing and Store’, will set you back $4.95 for the first month, and brings e-commerce to the party. With it, you can sell up to 500 products, accept credit cards, offer a secure shopping cart, and it allows you to link your store to your Facebook Marketplace.",
    "In addition to not knowing how much subsequent months will cost for any of these plans, their refund policy is opaque. The company has one, of course, but when asked for it, we were pointed to this website which contains a long legalese document. Not being upfront and transparent about their refund policy makes it hard for this author to fully trust this company, but from what we could gather, you cannot get a refund unless you contact the company by phone, to a US phone number, and only within 72 hours of receiving a welcome email. In a world of email and online chats, this company seems to go out of its way to make refunds hard to get.",
    "The interface is one of the drawbacks to Network Solutions. Unlike other website builders, like Yahoo, GoDaddy, or Zyro, the interface looks more outdated which might make someone question their templates and services.",
    "Unfortunately, it’s difficult to find out how you can view the templates available on their website. You have to go to “renew services” in order to even see what the template packages are. There also isn’t an obvious list of features on their main website which makes them harder to find.",
    "The best feature about Network Solutions is how it gets the job done. You can build your own website easily once you get started and there are plenty of drag-and-drop options to help you save time. Everything is straightforward in terms of actually creating your website. However, when it comes to viewing the features, Network Solutions could make some improvements. The design of the interface is the hardest part to navigate. There’s not a clear list of features that’s easy to access. Similar to how templates are hidden, you need to go to the “renew services” tab in order to find a list of service features.",
    "Network Solutions offers add-ons like CodeGuard and SiteLock that not all competitors provide. GoDaddy, Bluehost, and SiteGround are slightly different from Network Solutions. If you want to build an affordable website and get it up and running quickly, then Network Solutions is a good option. However, if you’re more concerned with how your website looks, then you might want to choose something with a more updated interface.",
    "Network Solutions is a more affordable website builder designed to get the job done quickly. If you’d rather not build everything by yourself, you can always use their professional website design service.",
    "Overall, Network Solutions is a great place to save money on web hosting, especially if you’re looking to transfer your domain name. They provide a variety of services and make building your website simple. You can easily host your website on the cloud or on WordPress. Since you can easily change plans, you can always start with something smaller and build your way up as your website grows.",
    "Our main concern though lies with their terms of services, their lack of transparency about their non-introductory prices, and a deliberately complex way of requesting a refund. All this leads us to wonder just how easy it would actually be for you to cancel your agreement with them, while retaining your data and domain name.",
    "Looking for more web hosting options? Check out our web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Interface",
    "9": "Features",
    "10": "The competition",
    "11": "Final verdict"
  },
  "links": {
    "Network Solutions": "https://network-solutions.7eer.net/c/221109/1014109/555?subId1=trd-us-7154976355370349000",
    "website design services": "https://www.techradar.com/news/best-website-designer-services-get-expert-help-to-build-your-online-presence",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Website Builder": "https://network-solutions.7eer.net/c/221109/10998/555?subId1=trd-us-1190441343512112000&sharedId=trd-us&u=https%3A%2F%2Fwww.networksolutions.com%2Fwebsite%2Fdiy-website-builder%3Fclickid%3D0Zywlp0%253AixyLW-5wUx0Mo3b3UkBWo60NRwaLwE0%26iradid%3D1014109%26irpid%3D221109%26sharedid%3D%26source%3DIR%26siteid%3D662%26channelid%3DP99C662S645N0B3A1D9E0000V152%26promo%3DTECHRADAR",
    "Website and Online Marketing": "https://network-solutions.7eer.net/c/221109/10998/555?subId1=trd-us-4243081018485505000&sharedId=trd-us&u=https%3A%2F%2Fwww.networksolutions.com%2Fwebsite%2Fdiy-website-builder%3Fclickid%3D0Zywlp0%253AixyLW-5wUx0Mo3b3UkBWo60NRwaLwE0%26iradid%3D1014109%26irpid%3D221109%26sharedid%3D%26source%3DIR%26siteid%3D662%26channelid%3DP99C662S645N0B3A1D9E0000V152%26promo%3DTECHRADAR",
    "Website, Marketing and Store": "https://network-solutions.7eer.net/c/221109/10998/555?subId1=trd-us-2680253746913334000&sharedId=trd-us&u=https%3A%2F%2Fwww.networksolutions.com%2Fwebsite%2Fdiy-website-builder%3Fclickid%3D0Zywlp0%253AixyLW-5wUx0Mo3b3UkBWo60NRwaLwE0%26iradid%3D1014109%26irpid%3D221109%26sharedid%3D%26source%3DIR%26siteid%3D662%26channelid%3DP99C662S645N0B3A1D9E0000V152%26promo%3DTECHRADAR",
    "this website": "https://web.yoxl.net/c/221109/58786/1642?subId1=trd-us-6115343782233582000&sharedId=trd-us&u=https%3A%2F%2Flegal.web.com%2F",
    "Yahoo": "https://www.techradar.com/reviews/yahoo-website-builder",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy-website-builder",
    "Zyro": "https://www.techradar.com/reviews/zyro",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "SiteGround": "https://www.techradar.com/reviews/siteground"
  }
}