{
  "source": "https://www.techradar.com/reviews/reebok-floatride-energy-3-adventure",
  "title": "Reebok Floatride Energy 3 Adventure review",
  "category": "fitness",
  "updated": "2021-08-27T15:08:26Z",
  "author": "cat-ellis",
  "summary": "A road shoe at heart, with a dash of trail DNA to handle grittier routes",
  "verdict": "The Reebok Floatride Energy 3 Adventure is an interesting concept, taking a road shoe and adding a handful of trail-inspired touches that don't turn it into a true off-roader, but make it a good option for straying onto surfaces like gravel and wood chips. Traction on loose surfaces is good and the water-resistant upper is a real winner, but the high ankle collar has relatively little padding so make sure you lock the laces down tight before heading out.",
  "pros": [
    "Extra tough upper",
    "Water-resistant",
    "Extra traction on loose surfaces"
  ],
  "cons": [
    "Little padding in collar",
    "Lacks grip on hard wet surfaces"
  ],
  "article": [
    "The Reebok Floatride Energy 3 Adventure isn't a trail shoe, but a reinforced road running shoe with a little trail DNA for routes that take you onto gravel paths or wood chippings. The miniature lugs on the sole won't help in inch-thick mud, but provide some valuable extra purchase on loose or gritty surfaces where smoother shoes may slide.",
    "Other design tweaks include a toughened heel and toe to shrug off scuffs, and a new water-resistant plastic mesh upper that does an admirable job of deflecting splashes. It's not fully waterproof, but will help prevent the unpleasant cold feeling of rainwater seeping into your socks the moment you accidentally step in a puddle on an unpaved footpath.",
    "Just take care when you're back on the road; we found that the soles lacked grip on smooth wet urban surfaces.",
    "You'll also want to be certain that you lock down the laces properly. They're designed to give a snug fit, but it's particularly important here due to a high collar with minimal padding, which has a tendency to rub if your foot has enough room to move. We strongly recommend taking your time to get the fit just so before heading out on your first mixed-terrain run.",
    "If your usual training routes take you along a river or through a wood, this hybrid shoe could be a very good addition to your shoe collection – particularly for such a reasonable price.",
    "The Reebok Floatride Energy 3 Adventure went on sale in on July 8, 2021. It's priced at $110 / £85 / AU$160 for both men’s and women’s sizes, and is available direct from Reebok.",
    "The Reebok Floatride Energy 3 Adventure is a great-looking shoe. It’s essentially a neutral road shoe with a 9mm heel-toe drop, but with a little trail shoe DNA thrown in to handle a little off-roading when the fancy takes you.",
    "It sticks to the same basic look as the standard Floatride Energy 3, but adds extra touches like small lugs on the sole for a little extra traction when you decide to stray off the beaten path onto looser surfaces.",
    "The upper has been redesigned too, with a new water resistant mesh material to handle puddles, plus reinforced areas on both the heel and toe to avoid your new shoes being scuffed and scraped on grit and rocks.",
    "Thin, round laces give the Floatride Energy 3 Adventure a more trail-style look, but also have a practical use, allowing you to lock the shoe down tight for a snug fit. That's particularly important here because the ankle collar is relatively high and minimally padded, so has the potential to rub if the fit isn't quite right.",
    "There’s ample room in the toebox, even for our relatively wide feet, but with the new lacing system we were able to fasten the shoe securely enough to prevent slipping. The tongue, meanwhile, has a small gusset, which holds it securely in place.",
    "More environmentally-minded runners will also be pleased to learn that the Floatride Energy 3 Adventure is made from at least 30% recycled material – part of Reebok’s push towards sustainability, which is particularly important for running shoes, which have a relatively short life (even when reinforced).",
    "The Reebok Floatride Energy 3 Adventure works well as a standard road shoe, with its midsole cushioning providing a smooth, but not bouncy ride. It wouldn't be our number one choice if our route was entirely paved though, largely because its rubber lugs are surprisingly slippery on some wet urban surfaces like drain covers.",
    "It really comes into its own when you wander onto rougher ground, though. It's not meant for tackling seriously greasy mud, but if you want to hit a canal path or a woodland trail, it's ideal for the job.",
    "The redesigned sole provides a little extra traction on loose surfaces, and the reinforced toe meant we weren't worried about damaging the upper when things got bumpy.",
    "The highlight for us, however, was the water resistant upper. Trails aren't known for good drainage, and if you head out after a shower of rain, it's usually only a matter of time before you step in a puddle and feel cold water seeping into your sock.",
    "Not so with the Floatride Energy 3 Adventure, which kept our feet surprisingly cosy and dry. We wouldn't wade though a stream in them, but they're certainly capable of shrugging off the occasional splash.",
    "We also appreciated the pull tag at the heel, which is handy for removing a mud-coated shoe with minimal mess.",
    "It's worth bearing in mind, however, that the minimally padded collar may rub the back of your ankle unless you get the laces locked down securely. We'd definitely advise taking the Floatride Energy 3 Adventure for a little test run (or even a walk) and adjusting the fit accordingly before heading out to put in some miles.",
    "This definitely isn’t a substitute for a trail shoe, but it’s not designed to be – it’s more of a tough everyday runner for those sessions where you know splashes and grit are on the menu."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and release date",
    "6": "Design",
    "12": "Performance",
    "20": "Don't buy it if"
  },
  "links": {
    "running shoe": "https://www.techradar.com/best/best-running-shoes"
  }
}