{
  "source": "https://www.techradar.com/reviews/sleepphones",
  "title": "SleepPhones review",
  "category": "fitness",
  "updated": "2021-05-11T11:17:45Z",
  "author": "cat-ellis",
  "summary": "Silence is golden, but sometimes a little music is better",
  "verdict": "The SleepPhones, from Acoustic Sheep, are ideal for anyone who enjoys falling asleep to music, podcasts, audiobooks or ambient sound, and doesn't want to disturb their partner at night. The SleepPhones are comfortable for all sleeping positions, which is good news for side-sleepers, and their soft headband is machine washable for frequent use. They'll block out some degree of external sound too, though spouses of heavy snorers are likely to need something that actually blocks the ear canal.",
  "pros": [
    "Comfortable for all sleeping positions",
    "Very little sound leakage",
    "Machine-washable headband"
  ],
  "cons": [
    "No battery-level indicator",
    "Bluetooth unit can shift inside headband"
  ],
  "article": [
    "The SleepPhones, from AcousticSheep, are a soft headband containing a pair of flat speaker panels, designed for listening to music, ambient sound and audiobooks at night. They're specifically designed to be comfortable for side-sleeping, which is impossible while wearing regular headphones, and they succeed at that task admirably. In our tests they remained in place all night, without putting unpleasant pressure on our ears.",
    "Bass is somewhat muffled by the fleece, which is to be expected, but the Bluetooth connection remained steady all night and the SleepPhones easily last all night on a single charge.",
    "It's a shame that the Bluetooth unit within the headband has a habit of shifting when they're not being worn, and there's no battery level indicator to show how much charge is remaining, but if you're looking for a way to enjoy audio at night without disturbing your partner, they're a good choice. They're a much more affordable alternative to the Bose SleepBuds II, though with only a double layer of fleece to provide noise-cancelling, heavy snorers may prefer the more expensive option.",
    "The SleepPhones Wireless, which we tested here, cost $99.95 / £73.45 (about AU$130) direct from AcousticSheep in the US and the UK.",
    "If you don't want to plug in your headphones there are also the SleepPhones Effortless, which use induction charging and cost $149.95 / £116.95 (about AU$190). SleepPhones with a built-in microphone, a Bluetooth transmitter for your TV, or a 3.5mm headphone jack are available for connecting to non-Bluetooth devices.",
    "The SleepPhones consist of a soft, stretchable headband with small, flat speaker panels that sit over your ears and a central battery/Bluetooth unit that rests at the back of your head. This arrangement means that, unlike the Muse S meditation headband, which has its main unit at the front, there's nothing hard to press against your forehead.",
    "All the electrical components can be removed from the headband, which can then be machine washed. The band comes in a range of colors, and is available in fleece (tested here) or Acoustic Sheep's proprietary Breeze Fabric for warmer climates. It comes in small, medium and large sizes.",
    "To set up the SleepPhones Wireless, detach the control unit from the speaker units, then plug in the included MicroUSB charging cable. A red light will illuminate to show that the device is charging.",
    "To connect the SleepPhones to your phone, plug the power unit back into the speakers inside the headband, then hold the central square button (the others serve no purpose) to put the device in pairing mode and connect it to your phone.",
    "Your reviewer is a committed slide-sleeper, which means wearing headphones at night is usually impossible unless we just use a single earbud, or force ourselves to sleep on our back. Neither is ideal. We were relieved to find that the SleepPhones' speaker panels are soft and flat enough to avoid putting uncomfortable pressure on our ears overnight, and we were impressed by the sound quality, despite bass being softened by the fleece. Sound leakage was minimal as well (essential to avoid disturbing others).",
    "If you've been considering investing in a pair of Bose SleepBuds II but balked at the price tag, the SleepPhones coupled with an ambient noise app could be a good cheap alternative. They don't have noise-cancelling tech though, and don't block sound as effectively as a pair of earbuds, which is worth noting if you live with a heavy snorer.",
    "We mostly used them to play looping audio from the Rainy Mood app, and they performed well, remaining comfortable all night. AcousticSheep also has various relaxing MP3s available to download free, plus CDs available to buy.",
    "The chief downside of the SleepPhones is that you might have to spend some time arranging the power unit inside the headband before settling down to sleep. The speakers themselves are covered in material that grips the inside of the headband and prevents them moving, but the main unit is covered in silicone and tends to slide around inside, sometimes shifting quite some distance from the back of your head.",
    "It's also a shame that there's no battery indicator on the control unit. In our tests the SleepPhones kept running all night on a single charge, but there's no way to be certain how much power is remaining in the morning.",
    "First reviewed May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and availability",
    "5": "Design",
    "9": "User experience",
    "15": "Don't buy it if"
  },
  "links": {
    "Bose SleepBuds II": "https://www.techradar.com/reviews/bose-sleepbuds-ii-review",
    "in the US": "https://sleepphones.com/",
    "the UK": "https://www.sleepphones.co.uk/"
  }
}