{
  "source": "https://www.techradar.com/reviews/ledger-nano-x-cryptocurrency-wallet-review",
  "title": "Ledger Nano X cryptocurrency wallet review",
  "category": "computing",
  "updated": "2021-03-31T14:49:04.986Z",
  "author": "joel-khalili",
  "summary": "A hardware cryptocurrency wallet built for securing your coins for the long term",
  "verdict": "The Ledger Nano X is up there with the best hardware wallets on the market for securing your cryptocurrency. Supported by well-designed and feature-rich apps for mobile and desktop, the Nano X also makes it simple to manage and add to your portfolio. The main question is whether the improvements on display are worth the additional outlay, as compared with the previous model.",
  "pros": [
    "Easy to use",
    "Highly secure",
    "DeFi functionality",
    "Attractive design"
  ],
  "cons": [
    "Navigation could be simpler",
    "On the expensive side",
    "Recent Ledger data breach"
  ],
  "article": [
    "The Ledger Nano X is a premium hardware cryptocurrency wallet built to keep your digital wealth as secure as possible. Unlike hot wallets, which are connected to the internet and therefore vulnerable to attack, the Nano X stores your private keys offline, on the device itself.",
    "To ensure the hardware is as resilient as possible, Ledger employs a custom built OS (BOLOS) and CC EAL5+ certified Secure Element (SE) chip. The security of the device has also been audited and verified by ANSSI, the French national cybersecurity agency.",
    "The Nano X offers all the features of its cheaper sibling, the Ledger Nano S, but with the added ability to store a greater range of assets at once and to manage your portfolio on the go by linking the device to the smartphone app via Bluetooth.",
    "A much larger 100mAh battery also means you can use this hardware wallet when you’re out and about, without needing to hook it up to a power source.",
    "While the Nano X is designed primarily with HODLers in mind, it’s also simple to add to your cryptocurrency portfolio and put your holdings to use, thanks to partnerships with crypto exchanges Coinify and Changelly and DeFi protocol Compound.",
    "The Ledger Nano X will run you $119/£109. Alternatively, you can buy a three-pack for $299/£274, although there’s no reason you’d want to do this as an individual user.",
    "The closest competitor to the Nano X is possibly the Model T from Trezor, which costs $170 (roughly £125).",
    "The slightly less sophisticated Ledger Nano S is just as secure as the Nano X, but lacks the same connectivity options. Costing $59/£54.50, the Nano S could be the better option for people who are concerned about securing their crypto, but don’t want to break the bank.",
    "Using the Ledger Nano X is relatively straightforward; there’s not much that can go wrong when there are only two buttons available. When the device is powered on, the buttons are used to navigate left and right within menus, and pressing both at once confirms your selection.",
    "However, this process feels a little clumsy at times, especially when it comes to retreating back to a previous menu, and left us wishing for a touchscreen or at least a third button.",
    "When it comes to managing your crypto, the device will need to be hooked up to either the Ledger Live desktop or mobile application, via a USB-C to USB-A cable for the former and Bluetooth for the latter. Native clients are available for all major operating systems, covering Windows, macOS, Linux, Android and iOS.",
    "Both the desktop and mobile applications are easy to use, thanks to a simple design and clean interface. The various different functions are housed in self-explanatory tabs in the sidebar on desktop and bottom nav bar on mobile.",
    "Linking the Nano X with the Ledger Live apps is simple enough, provided the instructions are followed to the letter. Failing to note down your 24-word recovery phrase could lead to disaster, for example, but that’s part and parcel of securing crypto using a hardware wallet.",
    "The only problem we ran into concerned setting up a Bitcoin account via the app, which requires you to choose between two different address formats. The app could do a better job of explaining the difference for crypto beginners, even if the topic is covered off on the Ledger website.",
    "Using the Nano X to send and receive cryptocurrency is a breeze. With the device connected to the Ledger Live app, transactions can be set up and approved with just a few button-clicks. The wallet also supports a whopping 1,800 different crypto assets.",
    "However, what sets the Nano X apart is the ability to purchase crypto directly via the Ledger Live app, courtesy of a partnership with Coinify. Doing so allows you to circumvent any transaction fees you would incur by purchasing crypto via an exchange, and then triggering a transfer to your Ledger wallet. This is especially handy at the time of writing, with Ethereum transaction fees sitting at circa $13.",
    "Ledger Live also includes some DeFi functionality, allowing you to put your crypto to work, as well as secure it. A partnership with lending protocol Compound allows you to lend Ethereum-compatible assets and accrue interest as a reward for adding liquidity to the network.",
    "Finally, the Swap tab gives you the opportunity to directly exchange one crypto asset for another (e.g. Bitcoin for Ether), which is a quick way to diversify your portfolio without switching back out to fiat currency. However, this feature is not available in certain regions, such as Japan and the United States.",
    "The main avenue of support is the extensive knowledge base on the Ledger website. Here, you’ll find detailed information on setting up your wallet and transferring crypto for the first time, but also deep-dives into the more complex features and potential technical glitches.",
    "Ledger Academy, meanwhile, is a completely free resource designed to help beginners learn more about the esoteric world of cryptocurrency and the underlying technology, blockchain.",
    "If you still can’t find what you’re looking for in the knowledge base and FAQs, you can make use of the website’s live chat feature or submit a ticket via the online contact form.",
    "However, while Ledger offers its customers a range of different support resources, it would be remiss of us not to mention the security breach suffered by the company in the summer of 2020, which exposed the personal data of hundreds of thousands of customers.",
    "Having gained access to the company’s e-commerce database, hackers were able to lift a variety of personally identifiable data, such as names, email addresses and home addresses. This data was later published online and used by criminals to threaten and extort owners of Ledger crypto wallets.",
    "While the breach itself had nothing to do with the security of the actual hardware wallets, it’s not unreasonable to look upon an incident of this kind as a red flag.",
    "When it comes to rival hardware wallets, the closest competitor to the Ledger Nano X is the Trezor Model T. Both devices have a premium feel and are pretty watertight from a security perspective; it’s only a few small differences that set them apart.",
    "The Nano X is slightly cheaper, but the Model T boasts a touchscreen interface, which is preferable to Ledger’s two-button system. The Ledger device has native apps for a wider range of platforms, but the Model T is completely open source and therefore more transparent.",
    "Both companies also offer cheaper but slightly less feature-rich alternatives: the Ledger Nano S and Trezor One.",
    "The other option is to store your cryptocurrency in a leading hot wallet - such as Exodus, Electrum or Wasabi - all of which are totally free.",
    "Unlike wallets attached to crypto exchanges, non-custodial hot wallets give you control over your private keys. The only downside is that these wallets are connected to the internet, and are therefore more vulnerable to cyberattacks.",
    "The Ledger Nano X is an attractive, highly secure and easy-to-use hardware crypto wallet that will give you peace of mind when it comes to storing your cryptocurrency.",
    "Unlike other hardware wallets on the market, the accompanying app also allows you to purchase crypto directly, as well as exchange tokens for one another and earn interest on your holdings via the lend function.",
    "However, while the addition of Bluetooth allows you to manage your wallet on-the-go, the fact that hardware wallets are designed predominantly for long-term crypto holders anyway means we’d be tempted to opt for the much cheaper Ledger Nano S."
  ],
  "headers": {
    "5": "Price",
    "8": "Interface and ease of use",
    "14": "Transferring funds:",
    "18": "Support",
    "24": "Alternatives",
    "29": "Final verdict"
  },
  "links": {
    "Ledger Nano X": "https://www.awin1.com/awclick.php?awinmid=17181&awinaffid=103504&clickref=trd-us-8192931397158155000&p=https%3A%2F%2Fshop.ledger.com%2Fproducts%2Fledger-nano-x",
    "cryptocurrency wallet": "https://www.techradar.com/news/best-bitcoin-wallets",
    "hot wallets": "https://www.techradar.com/news/what-is-a-hot-wallet-for-cryptocurrency-everything-you-need-to-know",
    "Ledger Nano S": "https://www.awin1.com/awclick.php?awinmid=17181&awinaffid=103504&clickref=trd-us-7974244686065139000&p=https%3A%2F%2Fshop.ledger.com%2Fproducts%2Fledger-nano-s",
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "crypto exchanges": "https://www.techradar.com/best/mining-rigs",
    "Model T": "https://www.techradar.com/reviews/trezor-model-t-cryptocurrency-wallet",
    "DeFi": "https://www.techradar.com/news/what-is-defi-everything-you-need-to-know",
    "Exodus": "https://www.techradar.com/reviews/exodus-cryptocurrency-wallet",
    "Electrum": "https://www.techradar.com/reviews/electrum-cryptocurrency-wallet",
    "Wasabi": "https://www.techradar.com/reviews/wasabi-cryptocurrency-wallet"
  }
}