{
  "source": "https://www.techradar.com/reviews/back-4-blood",
  "title": "Back 4 Blood review",
  "category": "gaming",
  "updated": "2021-10-12T10:09:56Z",
  "author": "john-loeffler",
  "summary": "Back 4 Blood is well worth the wait – but it's not Left 4 Dead 3",
  "verdict": "Back 4 Blood captures much of what we all loved about Left 4 Dead while updating it with more modern gaming trends that helps keep the content fresh. But it might not be what some are looking for if you're hoping for a direct sequel to Left 4 Dead 2.",
  "pros": [
    "Online co-op is fantastic",
    "Card system lets you really own a character",
    "Campy dialogue and story get it just right",
    "Difficulty offers excellent replay value"
  ],
  "cons": [
    "No mod support (yet?)",
    "Not the greatest for solo players",
    "Melee combat falls away toward the end of campaign",
    "PvP is fairly underwhelming"
  ],
  "article": [
    "Back 4 Blood is the spiritual successor of the acclaimed Left 4 Dead Xbox and PC franchise of the aughts, but it definitely deserves to stand on its own, in its own right, as one of the best games of the year – and in many ways you're better off not thinking about the game's pedigree at all if you really want to enjoy all that it has to offer.",
    "In terms of the best co-op games, we really can't think of another game right now that is as much fun to play with your friends, and the game's surprising degree of replayability is a testament to the thought and care that went into the game design and mechanics. It stays fresh to play, even if it's your umpteenth time through the campaign.",
    "If you want to jump straight in – shotty in hand – without a thought for the story context or progression system, Back 4 Blood definitely gives you a steady flow of 'Ridden' to blast away at with a lot of level challenges, Mutation varieties, and general game mechanical chaos along the way to keep you satisfied, especially if you're playing through Back 4 Blood's online matchmaking or with your friends.",
    "Even if you're not necessarily a fan of first-person shooters, there really is nothing better in terms of simple pop-in/pop-out co-op action. There are many ways to play the game that don't hinge on your ability to no-scope a Ridden Ogre's weak points from across a map, and honestly you can play through the entire campaign without having to fire a gun even once – there's even an achievement for the most pacifist playthrough that is narratively possible.",
    "And while the core experience of Back 4 Blood is incredibly polished – in 30+ hours of playing, we encountered only one AI pathing bug – there are parts of the game that feel downright neglected. The solo campaign is a lot of fun and the AI teammates are more than competent, but even with downscaled difficulty, your squad pretty much becomes irrelevant towards the final acts.",
    "Probably more critically, the most common complaint we've heard from fellow players is that the PvP game mode is pretty basic, with little of the complexity that the Online Co-op Campaign and to a lesser extent the Solo Campaign modes demonstrate. For Left 4 Dead 2 players, this might be a deal breaker, and we wouldn't necessarily blame them.",
    "Likewise, Left 4 Dead 2 has remained popular for years after that game's release thanks to its active modding community. As of now, Back 4 Blood doesn't support modding, and it may never support it. For many potential players, this too might be reason enough to pass on Back 4 Blood.",
    "Even with these issues though, missing out on Back 4 Blood would be a huge mistake in our opinion. It isn't the Left 4 Dead 3 some were hoping for, but taken on its own, it's the best co-op experience you're going to find outside of an MMORPG and we can say that it is absolutely worth the decade-long wait.",
    "The amount of care Turtle Rock Studios put into the online co-op campaign suffuses all four acts and every level within them, but it also highlights that this is a game meant to be played online with other people.",
    "While you can play that campaign solo with bots stepping in as your teammates, this has its limitations, which you soon bump up against as you pass through the middle acts. In fairness to Turtle Rock, video game AI is maddeningly hard to get right, and Back 4 Blood's AI teammates are more than competent. But there's no substitute for a human at your side.",
    "The weapon upgrade mechanic in Back 4 Blood is one of its best features, but your AI teammates don't actually upgrade their gear alongside you, which should be a straightforward feature without much trouble. Trust us that you're going to notice its absence when you are killed by an especially powerful boss, or during a key set piece fire fight with a massive horde of Ridden.",
    "You'll be given the option to take over one of the remaining characters, who are armed with common starting gear that is no match for the threat you're facing. Rather than continue the fight, dying means scrambling like mad for any Blue or Purple-level weapon you can find before you get overrun.",
    "This adds to the challenge, sure, but it also pulls you clear out of the experience. You've travelled through hell with these 3 teammates and no one bothered to pick up a better weapon along the way?",
    "When you get to the end game, your character's death pretty much brings a run to its end and you're better off starting over a couple of levels back than trying to finish out with one of your remaining squad.",
    "And we do need to emphasize that those guns matter – a lot. Back 4 Blood has a Card Deck System that lets you add various perks to your character that allows for a high level of customization that goes way beyond cosmetic changes.",
    "The informal, class-based differentiation between a slow but tankie shotgunner and a glass cannon with a submachine gun and 75% faster movement really changes the way you can play the game. This falls apart somewhat when it comes to Melee builds, however.",
    "Right up until the last few levels, Holly can smack down entire hordes of Ridden like Leonidas putting the Persians to shame in 300. Until she very suddenly can't, and you don't have any appropriate perks needed to effectively pick up a shotgun and finish off the game.",
    "At that point, you better hope your friends can handle the Big Bads at the end while you keep them safe from hordes of common Ridden. In one instance, its actually impossible to melee your way through a boss, so it locks the melee build out of the action entirely. If you're playing a Solo Campaign, you're going to need to swap out a whole other deck build around some kind of gun so you can finish off the campaign, which is a shame.",
    "Likewise, the PvP mode is fun, but it doesn't really stand out in the end, which is something that might be a deal breaker for some franchise fans, especially Left 4 Dead 2 devotees. There is no PvP campaign here, there is only one type of PvP match, and while it executes this game mode very well, it is fairly limited.",
    "In contrast to the robustness the PvE Co-op campaign demonstrates, the PvP mode almost feels neglected, and the structure of the game mode itself doesn't look like it has too much room to expand with additional content unless entirely new game modes get added by Turtle Rock down the road.",
    "Speaking of added content, there is no mod support for Back 4 Blood, and there may never be. Turtle Rock co-founder and Back 4 Blood's director Chris Ashton told TechRadar that the studio would love to incorporate mod support in the game, but whether they can actually do so is an open question.",
    "The game features crossplay between PC and consoles, so it's more technically challenging to implement than it was with Left 4 Dead 2, but mods are what have kept Left 4 Dead 2 relevant 12 years after its 2009 release. Whether mod support ever makes it into Back 4 Blood will be a major hurdle for many Left 4 Dead 2 fans to clear, and we believe the game stands on its own merit even without mods, but it is the metaphorical Bruiser in the Saferoom.",
    "Playing on the normal difficulty setting, Back 4 Blood offers a lot of challenge, but a satisfying one. Turn things up to the next highest difficulty, and things quickly go off the rails and you're in the fight of your life. Push it to the max, and you're going to be lucky if you can survive the first building, much less the first level.",
    "This makes the card system, weapon upgrades, and communication with your squadmates essential, adding a solid basis for extensive replayability.",
    "Add in various achievements, unlockables, and just the sheer pleasure of the co-op campaign and there's plenty of reason to come back to Back 4 Blood for a good long while.",
    "The co-op campaign experience is what many, we dare say most, Left 4 Dead players loved about the original two games. Turtle Rock clearly thought so, and it made sure to focus its efforts into evolving that original experience into something even greater with Back 4 Blood.",
    "Its problems are real and they keep Back 4 Blood from perfection, but now that its finally here, we can confidently say that it was worth waiting a decade to finally play this game."
  ],
  "headers": {
    "0": "Back 4 Blood two minute review",
    "8": "Highly polished, aside from that bit of tarnish at the edges",
    "18": "Swarm mode is fun, but it feels like an afterthought with no obvious fix",
    "22": "From difficulty to unlockables, there's plenty of reason to keep playing with your friends"
  },
  "links": {
    "best co-op games": "https://www.techradar.com/news/best-co-op-games-2020-top-games-you-can-share-with-friends-on-console-and-pc",
    "told TechRadar": "https://www.techradar.com/news/back-4-blood-might-miss-out-on-one-of-left-4-dead-2s-best-features"
  }
}