{
  "source": "https://www.techradar.com/reviews/d-link-mini-wi-fi-smart-plug-dsp-w118",
  "title": "D-Link Mini Wi-Fi Smart Plug DSP-W118 review",
  "category": "smart-home",
  "updated": "2021-07-26T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "A compact smart plug that works with Amazon Alexa and Google Assistant",
  "verdict": "The D-Link Mini Wi-Fi DSP-W118 is an affordable way to control an appliance, even when you’re not at home. Easy to use, it sports a compact design and integrates with Alexa and Google Assistant. However, there’s no energy consumption feature and it doesn’t support HomeKit.",
  "pros": [
    "Simple to use",
    "Compact design",
    "Compatible with Alexa and Google Assistant"
  ],
  "cons": [
    "No HomeKit support",
    "No energy monitoring"
  ],
  "article": [
    "Like many of the best smart plug manufacturers, D-Link’s origins are in the home-networking market. The brand has produced some of the best routers and powerline adapters for more than 30 years. In 2014, D-Link dipped its toe into the smart home device waters, now offering a range of products, including some of the best smart home security cameras.",
    "The D-Link Mini Wi-Fi Smart Plug DSP-W118 is a compact unit that plugs into a power outlet, allowing you to control any appliance connected to it from your smartphone – even when you’re not at home. If you often worry that you’ve left your coffee maker or hair straighteners switched on once you’ve left the house, this device provides peace of mind, giving you a way to switch them off if they have in fact been left on.",
    "Connecting to your home Wi-Fi network, you can turn the D-Link Mini Wi-Fi DSP-W118 on and off using the mydlink app, or set timers and schedules, too. If you own other D-Link smart home devices, these can be grouped together with the smart plug in the app, so several gadgets can be controlled at once.",
    "Integration with Alexa and Google Assistant means you can control the smart plug using voice commands as well as your smartphone.",
    "The D-Link Mini Wi-Fi Smart Plug DSP-W118 is best suited to those looking for an affordable, compact smart plug that will work with Alexa and Google Assistant. It’s simple to use but lacks features such as energy monitoring. It isn’t compatible with HomeKit, either.",
    "The D-Link Mini Wi-Fi Smart Plug DSP W118 costs $24.99 / £19.99.99 / AU$39.95 and is available worldwide through Amazon and a selection of electrical retailers. In the UK and Australia, this is D-Link’s only smart plug. In the US, however, D-Link offers the D-Link Outdoor Wi-Fi Smart Plug DSP-W320, which has two outlets and is available for $34.99.",
    "Like most smart plugs, the D-Link Mini Wi-Fi Smart Plug DSP-W118 is a compact white unit. Made from plastic, in the US it’s a rectangular device that measures 2.6 x 2.4 x 2.4 inches / 6.5 x 6 x 6cm (w x h x d), while in the UK and Australia it’s a square-shape, which measures 2.3 x 2.3 x 1.7 inches / 5.8 x 5.8 x 4.4cm. In all territories, the plug’s dimensions ensure it doesn’t block access to other sockets when connected to a power outlet.",
    "On the top of the smart plug you’ll find a manual power button, while in the top right-hand corner on the front of the plug is an LED that illuminates green to indicate the plug is switched on, and pulse orange during set-up. On the right is a QR code, too, which is used to set up the smart plug.",
    "The DSP-W118 only works on the 2.4GHz band, which may mean you suffer connectivity issues if you’re installing it in a different room to your router.",
    "On test, we found the DSP-W118 extremely simple to set up. Once we’d connected the smart plug to a power outlet, we installed the mydlink app on our smartphone and scanned in the QR code found on the right side of the plug. The app then paired the plug with our Wi-Fi network and updated the firmware, before we were able to start using it.",
    "Using the app or Alexa to switch the plug on or off, it responded instantly, making a reassuring click each time and displaying a green LED in the right corner of the plug to indicate it was turned on.",
    "However, unlike rival smart plugs from TP-Link, there’s no energy monitoring feature included, nor an Away mode that can turn the smart plug on and off at random intervals. Such a feature can be particularly useful for those wanting to use the smart plug to simulate occupancy to deter intruders.",
    "The mydlink app is clear and easy to use. All of the D-Link devices installed in your home are displayed on launching it. In the case of the smart plugs, one tap on the right-hand side of the icon will switch the plug on or off, while pressing the icon itself will allow you to access a countdown timer and basic settings such as changing the name of the smart plug or updating the firmware.",
    "From the app we were also able to set a schedule for when the plug should switch on or off automatically, as well as create automations where several devices are controlled at once based on our location (provided by a smartphone), or triggered by a set word or phrase given to a voice assistant. However, the only way to create groups of devices that can be switched on or off at the same time is by creating an automation.",
    "When it comes to voice control, the D-Link Mini Wi-Fi Smart Plug DSP-W118 offers integration with Amazon Alexa, Google Assistant and IFTTT. However, there’s no support for Apple HomeKit.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "D-Link Mini Wi-Fi Smart Plug DSP-W118 price and availability",
    "6": "Design",
    "9": "Performance",
    "12": "App",
    "15": "Don't buy it if..."
  },
  "links": {
    "best smart plug": "https://www.techradar.com/news/best-smart-plugs-and-switches",
    "best routers": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523",
    "powerline adapters": "https://www.techradar.com/news/the-best-powerline-adaptors",
    "smart home device": "https://www.techradar.com/news/smart-home-devices",
    "smart home security cameras": "https://www.techradar.com/news/best-home-security-camera"
  }
}