{
  "source": "https://www.techradar.com/reviews/elegoo-mars-2-pro",
  "title": "Elegoo Mars 2 Pro review",
  "category": "computing",
  "updated": "2021-09-13T01:00:49Z",
  "author": "jess-weatherbed",
  "summary": "Small, speedy and great at the finer details",
  "verdict": "The Elegoo Mars 2 Pro has a few quality of life features such as built-in air filtration that makes it a great choice for anyone looking to print small, detailed models such as tabletop gaming miniatures, but are restricted to setting up a machine at home rather than a workshop or dedicated printing space.",
  "pros": [
    "Integrated filtration system",
    "High-resolution prints",
    "Fast layer curing"
  ],
  "cons": [
    "Resin vat is side-mounted",
    "Rubber seal gets in the way",
    "Fans can get loud"
  ],
  "article": [
    "Many of us wouldn't necessarily think of 3D printing as an affordable hobby, especially if you're looking to explore resin-based SLA and MSLA printers, but the Elegoo Mars 2 Pro proves you don't need to spend a fortune to get a premium product.",
    "Affordability is relative of course, but you can currently grab the Elegoo Mars 2 Pro for $260 / £230 / AU$640, which is more than a fair price to pay for the quality that you're getting, placing it in a similar price band as the AnyCubic Photon Mono.",
    "The Mars 2 Pro has a slighter larger build volume than that of the original Mars 2 printer, and a metal resin vat rather than the replaceable plastic version. Other differences outside of cost (with the original Mars 2 available for around $200 / £215) is the inclusion of an air filtration system and a rubber seal around the edges of the red acrylic cover, though we couldn't find available stock for the original Mars 2 on any Australian-based website.",
    "The printing capabilities for both printers are the same on paper, so if you can find the Mars 2 available and you're not fussy about getting a higher quality machine then you can expect the same printing results from either.",
    "The build volume, or available printing space, is on the smaller side, not uncommon for resin-based printers as the built plate has to be fully submerged in specialized UV reactive resin to function, but with larger printers available like the Elegoo Saturn or the AnyCubic Photon Mono X you might be tempted to look elsewhere if you think the Mars 2 Pro won't provide enough space for your prints or you're looking to batch print for a small business.",
    "The space is more than sufficient for printing smaller models though, and many larger figurines can be split into sections to print if you don't have the space to keep a larger printer. In fact, its compact size and built-in air filter mean that this is a far more 'home' friendly option than a larger machine and can be set up somewhere like an office rather than a dedicated printing room. We would still recommend only printing in a well-ventilated space (as resin is a toxic material), but the air filter can at least give us some assurance regarding health and safety.",
    "There are a handful of small criticisms we have about the Elegoo Mars 2 Pro, but they're not enough to dissuade us from purchasing the printer given how many pros it has over cons. If you're into tabletop miniatures or board games, this is a fantastic machine that will apply churn out high-quality and extremely detailed models with minimal fuss.",
    "If you've seen the rest of the Elegoo Mars family of 3D printers then you might feel like you're getting déjà vu when you look at the Mars 2 Pro. The design is very familiar, with a solid metal black base, a textured metal build plate and a clear red acrylic hood to contain fumes during the printing process.",
    "You're not expected to build the printer yourself thankfully, unlike some FDM-style machines that require some assembly out of the box. Instead, the Mars 2 Pro is well packaged and ready to go after you peel off some protecting films from the LCD display and the hood.",
    "You also get a handy tool kit included that contains an array of recommended equipment to start printing, such as a metal scraper for removing prints from the build plate, a plastic scraper for removing any failed prints that adhered to the delicate FEP film, a USB stick to load STL files onto, some latex gloves and disposable facemasks to wear for protection and paper filters to filter used resin back into bottles for storage.",
    "You also get the required allen keys to adjust the build plate during leveling, and a few extras that were absent in other products like the Elegoo Saturn – a replacement FEP sheet and a drip bracket that allows the build plate to rest at an angle and drip insured resin back into the tank before washing.",
    "A frustration we had right off the bat was the resin tank. It's constructed from solid metal, a definite upgrade from the plastic style used in the original Mars 2, but it's designed to be slide into place from the side of the machine rather than placed straight down like in the Elegoo Saturn. You won't spill any resin if you're careful, but the FEP sheet built into the resin tank (the clear sheet that UV light shines through to cure the resin) can stick to the surface of the display, making removing the tank a delicate process.",
    "Another issue that appeared relates to the rubber edge around the base of the acrylic hood, that while does make a very effective seal during printing, isn't fixed in place in any way and popped off whenever we lifted the hood. A great idea in concept, but the actual execution was poor.",
    "It's not all doom and gloom though. Where Elegoo likes to switch up its port location for its USB, the Mars 2 Pro has it on the front, on the lower right-hand side, so you won't need to awkwardly try and access the rear or side of the printer to load a new file in to print.",
    "The USB port is just underneath the 3.5-inch color touchscreen LCD which proved to be pleasantly fast and reactive, and very easy to use. There are a bunch of languages to choose from, but everything is clearly labeled which should make things easier for a complete 3D printing novice.",
    "The Mars 2 Pro is also easy to level – all you need is a piece of paper and the supplied allen keys. There are also instructions provided in a manual that are easy to follow and go through every step from setup and leveling to installing the Slicing software Chitu Box (as provided on the USB drive), so you can really go from unboxing to printing your first file in less than 30 minutes.",
    "A simple but appreciated feature on the Elegoo Mars 2 Pro is the inclusion of a 'Max Fill' line on the resin tank to prevent spills when the build plate is fully submerged, as well as a 'lip' that acts as a spout when you need to pour away the unused resin post-print. Resin-based printers are always going to be a messier affair than FDM-style machines, but we found that these helped to reduce the number of spills and drips in our work area.",
    "More intuitive features worth mentioning are the built-in air filter system that pulls fumes from under the red hood of the machine during the printing process, reducing the chemical smell of the resin. If you live in a studio or a small space then this allows you to set up the Elegoo Mars 2 Pro in a high-traffic area of your home, provided there is enough ventilation.",
    "On the subject of safety, the latex gloves and disposable masks are included for a reason. The Elegoo Mars 2 Pro uses 405nm UV resin which is a toxic substance. If you get any on your skin, be sure to wash it off immediately, and regardless of if you can small the resin or not, try to avoid being in the vicinity of the printer while it's operational. Fumes from the printing process can make you sick, so open any windows and clean up any spills with isopropanol alcohol.",
    "The equipment provided is sufficient but you'd do well to purchase higher quality tools like a respirator rated for fumes and a razor window scraper to remove stuck prints from the built plate.",
    "We're also unsure if it's the air filter or the cooling fans but the Mars 2 Pro is a very noisy printer. If you're behind a closed door then most of the noise will be blocked off, but if you're in the room where it's operating you may find the loud fans to be a nuisance.",
    "The build plate is held in place with a twist-style clamp for easy removal, and its smaller size means you can detach it from the Mars 2 Pro and connect it directly with the Elegoo Mercury Plus, a 2-in-1 wash and cure machine. You'll have to purchase this separately, but using one will help washing delicate prints without removing them from the build plate first.",
    "Something that would have been a nice addition is a magnetic flexplate system. You can find these through third-party retailers like 3DJake and they work by sticking a flexible sheet that covers the build plate surface that can then be peeled away to easy detach any models that may have adhered too firmly.",
    "The tech under the hood – or in this case, under the display – has changed across previous iterations of the Mars family of printers. In the Mars 2 Pro you're getting a powerful UV lamp in place of the LED matrix that featured in the previous Mars Pro, allowing for a faster cure.",
    "A caveat to this is that these new screens lack a protective glass layer like those seen in older Mars models, instead being professionally taped directly into the machine. There are clear indicators to not remove this tape while unpacking the printer, but it does feel like a step down from having an easily replaceable sheet, especially as you'd have to replace the entire screen if any leaked resin accidentally cures on it.",
    "The Elegoo Mars 2 Pro has a resolution of 2560 x 1620 which equates to 50 microns, which actually works out slightly larger than the original Mars Pro at 47 microns. This is mostly because the Mars 2 Pro has the same 2K resolution stretched across a larger build plate, but the difference is negligible and it's unlikely you'll see any detail lost to the naked eye.",
    "Chitu Box is available to download from the supplied USB drive and you'll find that profiles are already available for the Elegoo Mars 2 Pro and the software is very user-friendly – if you have a pre-supported STL file you can simply drag and drop onto the application, with tools to move and rotate the print being clearly displayed. Chitu Box also allows for a lot of optimizing once you're comfortable with the basics so we have no complaints regarding the choice of slicing software.",
    "With Chitubox being so easy to use, we would advise you don't print the test STL file already on the USB drive. The model itself is serviceable as a benchmark, with some complex details for the printer to try but it's set up to built directly onto the built plate with no supports, which then proved to be almost impossible to remove.",
    "In fact, we actually snapped the print after several minutes of trying to shimmy the supplied metal scraper beneath the print, then relying on brute force and boiling water to detach it. If you do wish to give it a try, purchase the aforementioned flex plates or built your own supports into the file.",
    "We elected to use the Elegoo Water Washable resin with the Mars 2 Pro and saw fantastic results. Typically, resin prints will need to be washed in isopropanol to get rid of any uncured resin that might be clinging to the print, but we saw no difference in quality between the standard resin and the water-washable variety which makes it appealing for anyone who can't stand the pungent smell of alcohol (or otherwise can't use it for health or personal circumstances).",
    "We tried several models to see how much fine detail could be picked up using zombie figurines that were sized for tabletop gaming, and the results were very impressive. Even in the sections where the files were extremely fragile such as exposed bone or sword blades, the Mars 2 Pro successfully spat them out without any hiccups. You can even see the stitching in the clothing, and ultra-thin exposed ribcages came out cleanly in beautiful detail.",
    "We only had one print that saw half-cured resin adhered to the PEF film and that was easy removed with some isopropanol and a soft paintbrush, and even then, that was likely down to user error as some STL files had to have supports manually added.",
    "Below you can see a washed mermaid print besides the provided USB drive for scale that hasn't been sanded or otherwise finished, and the nets and fish are clean and very defined. The scales on the mermaids tail are also visually detectable and sharp when viewed under a magnifying glass.",
    "These models all printed very quickly, well under two hours for a full built plate of miniatures which shaves some time off older products from the Elegoo line-up (and indeed, some cheaper products on the market from other manufacturers), so while you don't have a lot of free space for larger prints, you'll get faster results which could sway you if you need to batch print.",
    "Ultimately, size is going to be what sells you on the Elegoo Mars 2 Pro. It's far from the smallest SLA printer on the market, but it's faster than most larger printers and comes with some great quality of life features.",
    "We imagine you'll be particularly sold if you want a printer for board game accessories and tabletop miniature figurines as they're so small that a FDM printer don't be able to achieve the fine detail needed, and not everyone has the luxury of having a large space available for something like the Elegoo Saturn. The Mars 2 Pro is perfect for achieving the sharp, minuscule details needed and with a fast print speed to boot. In all, there's a lot to love about this printer."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Design",
    "16": "Features",
    "25": "Performance",
    "36": "Don't buy it if..."
  },
  "links": {
    "$260": "https://www.elegoo.com/collections/mars-series/products/elegoo-mars-2-pro-mono-lcd-3d-printer?variant=32572468166704",
    "£230": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FELEGOO-Photocuring-Exposure-Accuracy-Monochrome%2Fdp%2FB08Q4525NJ%2Fref%3Dsr_1_3_sspa%3Fadgrpid%3D109710223831%26dchild%3D1%26gclid%3DCjwKCAjwyvaJBhBpEiwA8d38vB0Hh1Mz5K1gap6G7fHnRElIgKygWLg1Ll0u1piVYuuwUouBEnY2LBoCs50QAvD_BwE%26hvadid%3D456834280942%26hvdev%3Dc%26hvlocphy%3D9045708%26hvnetw%3Dg%26hvqmt%3De%26hvrand%3D14613510529285755927%26hvtargid%3Dkwd-932358980817%26hydadcr%3D15002_1845704%26keywords%3Delegoo%2Bmars%2B2%2Bpro%26qid%3D1631478883%26sr%3D8-3-spons%26psc%3D1%26spLa%3DZW5jcnlwdGVkUXVhbGlmaWVyPUFIME9QUUxKVEtUVjQmZW5jcnlwdGVkSWQ9QTA2NzYyMjUzQTVJTFpYUlhYVVI1JmVuY3J5cHRlZEFkSWQ9QTAyNzc5NDMxNEo2ODFHNjBSUTYxJndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ%253D%253D%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1025732884663792800-21",
    "AU$640": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com.au%2FELEGOO-Saturn-3D-Printer%2Fdp%2FB086292QP2%2Fref%3Dsr_1_8%3Fdchild%3D1%26keywords%3Delegoo%2Bmars%2B2%2Bpro%26qid%3D1631478778%26sr%3D8-8%26tag%3Dhawk-future-22%26ascsubtag%3Dtrd-us-3194223462514207000-22",
    "AnyCubic Photon Mono": "https://anycubic.sjv.io/c/338476/1101384/14022?subId1=trd-us-1241205201153569800&sharedId=trd-us&u=https%3A%2F%2Fwww.anycubic.com%2Fcollections%2Fanycubic-photon-3d-printers%2Fproducts%2Fphoton-mono-resin-3d-printer",
    "Elegoo Saturn": "https://www.techradar.com/reviews/elegoo-saturn",
    "AnyCubic Photon Mono X": "https://anycubic.sjv.io/c/338476/1101384/14022?subId1=trd-us-3758349491259932700&sharedId=trd-us&u=https%3A%2F%2Fwww.anycubic.com%2Fcollections%2Fanycubic-photon-3d-printers%2Fproducts%2Fphoton-mono-x-resin-printer",
    "Elegoo Mercury Plus": "https://www.elegoo.com/products/elegoo-mercury-plus-washing-and-curing-machine?variant=32572404924464",
    "3DJake": "https://www.3djake.uk/3djake/resin-flexplate-system"
  }
}