{
  "source": "https://www.techradar.com/reviews/sony-srs-ra5000",
  "title": "Sony SRS-RA5000 review",
  "category": "audio-visual",
  "updated": "2021-09-16T13:38:25Z",
  "author": "nick-pino",
  "summary": "Sony’s expensive wireless speaker can’t replace the Apple HomePod",
  "verdict": "The Sony SRS-RA5000 is one of the first 360 Reality Audio speakers on the market, bringing spatial audio to a compact Bluetooth speaker form factor. The speaker can turn your living room into a concert fairground – replete with boomy bass and echo-y vocals – but lacks clarity and tonal balance offered by other high-end Wi-Fi speakers.",
  "pros": [
    "360 Reality Audio speaker",
    "360-degree sound",
    "Chromecast built-in"
  ],
  "cons": [
    "Mixed audio performance",
    "Music Center app is rough",
    "3D audio library is limited"
  ],
  "article": [
    "The Sony SRS-RA5000 is everything that the Apple HomePod set out to be: it’s a feature-rich speaker with built-in calibration tools that can adapt to any space, connect to most devices through Bluetooth, 3.5mm auxiliary or Wi-Fi, and fill said room with music.",
    "It does so with the help of a half-dozen drivers, three located on each side of the speaker, one down-firing woofer for supersized bass response and three up-firing speakers at the top. It’s the latter that enables the SRS-RA5000 to be one of the first qualified speakers to play Sony 360 Reality Audio format music that can sound even more immersive than traditional stereo audio.",
    "The catch, of course, is that all this new tech doesn’t come cheap: Sony’s pricing the speaker at $700 (£500, AU$870) – double what Apple charged for the HomePod and more than three times the cost of the Amazon Echo Studio that comes with Alexa built-in.",
    "At its extravagant price point, the Sony SRS-RA5000 should be practically flawless – and yet, after spending a few weeks with it, we just can’t say that’s the case. The tonal balance skews more toward the low-end with sharp, piercing highs and lackluster mids; the setup process and Sony’s Music Center iOS app are mired with bugs; and, outside of a few hundred songs, very little music has been mastered in the 360 Reality Audio format.",
    "For a very specific kind of music lover who enjoys being on the cutting edge of Hi-Fi audio, the Sony SRS-RA5000 might make sense. But, for everyone else: spend your money on a wireless speaker that can do most of what the Sony RA5000 offers at half the price.",
    "The Sony SRS-RA5000 was unveiled alongside the lower-priced Sony SRS-RA3000 during Sony’s virtual CES 2021 event. The speakers were released together in March 2021, but won’t be feature-complete until the launch of Sony 360 Reality Audio on Amazon in April.",
    "In terms of price, you’re looking at $700 (£500, AU$870) for the Sony RA5000 and $300 (£300, AU$449) for the RA3000. That’s on the expensive side for Bluetooth speakers, but these are some of the first Sony 360 Reality Audio speakers, which helps to justify their premium sticker price.",
    "Whatever you think of the sound performance, the Sony SRS-RA5000 looks like a million bucks: with a black clothed front and three copper grilles on top, the speaker looks like a piece of modern art and at 9.38 x 13 x 8.8 inches (W x H x D) it takes up a decent amount of space on a table.",
    "That said, because the speaker is a bit larger and requires a constant power source, finding a spot to place the speaker can be challenging. Do you want it to put it in the center of the room to get the best spot for spatial audio? Or should you stick in the corner on a table to get room-filling sound?",
    "After testing both configurations, you're slightly better off putting it against the wall. The back of a wall gives the audio something to reflect off of, which in turn makes it sound a little more detailed than when you just put it in the center of the room.",
    "To stand up, the RA5000 has three small legs on each of the three corners while the power cord connects underneath the speaker. On the back, you’ll find both the auxiliary audio in 3.5mm jack and the NFC pairing spot, but nothing else. The lack of ports may seem a bit baffling, but that’s because Sony wants you to use this, first and foremost, as a Wi-Fi speaker for reasons we’ll get to in a minute.",
    "Controls for the speaker are located near the top on the left face of the speaker – which you’ll need to use if you want to change the source of the audio between Bluetooth, 3.5mm and Wi-Fi.",
    "So why is Sony pushing Wi-Fi so hard on this speaker? The answer is because that’s how you’ll be able to hear Sony 360 Reality Audio music. Unfortunately, Bluetooth doesn’t have enough bandwidth to push the data-heavy format through the funnel and it can’t be piped through a 3.5mm audio jack either. That means you’ll need this speaker to be connected to the internet for the best-sounding music.",
    "Connecting over Bluetooth is easy enough – all you have to do is set the speaker’s source to Bluetooth and connect on your phone – but playing anything over Wi-Fi requires you to use the Sony Music Center app that is… well, at times problematic.",
    "For example, every time we went to use the app, it told us to connect the speaker to the Google Home app so we could Cast to it. After doing it after setup, the app asked us again the next time we went to use the Music Center app… and again after that. The same thing happened for Sony 360 Reality Audio that we had set up through Tidal.",
    "The good news is that, once you’re set up, the Sony RA5000 is pretty well-connected. It’s easy to cast from apps like Amazon Prime Music and you can even pair the speaker up with Google Assistant or Amazon Alexa speakers for hands-free controls. Moreover, that means you can add the RA5000 to groups through the Google Home and Amazon Alexa apps to create an almost Sonos-like setup.",
    "It’s also worth mentioning the automatic room calibration feature that modified the sound of the speaker to match our space. It’s something we’ve seen on other speakers and high-end soundbars, but it’s rare you see it on a wireless speaker and it’s a fantastic feature.",
    "Unfortunately, when it comes to actually finding 3D audio music to listen to, the Sony Music Center app isn't much help. It'd be great if it can pull in music from Tidal or Amazon Music HD, but instead it can only send you to those apps where you'll try (often without much luck) to track down 360 Reality Audio music on your own.",
    "On both Tidal and Amazon Music HD, the amount of 360 Reality Audio music is underwhelming. There's a few playlists to help you discover some hits, but try and search for your favorite artists and you'll find that very few of them offer a 360 Reality Audio version of your favorite songs.",
    "You could argue that this isn't, exactly, the speaker's fault – and it's not. But when you're selling a speaker that plays a certain kind of content, and that content isn't widely available, then it means the value of the speaker is diminished somewhat.",
    "The Sony SRS-RA5000 is the culmination of years’ worth of work by Sony’s audio engineers working on the 360 Reality Audio platform. We first heard a demo of the prototype over three years ago at CES, and Sony’s come a long way since.",
    "That said, the performance is a bit polarizing. With some songs that have been perfectly tuned in Sony 360 Reality Audio, it's incredible, but for most music we found its room-filling, floor-shaking bass overpowered the echo-y mids and sibilant highs.",
    "The soundstage at times can feel monstrous, almost like you’re listening to a live show, but it also suffers from the same issues that sitting far away at a concert has – namely, audio is missing details.",
    "Listening to our headphone testing playlist, a number of songs had a distant sound with bloated bass. The Way You Used To by Queens of the Stone Age had an over-pronounced guitar line with tepid vocals and a booming bass. Walk on Water by Eminem lacked some key nuances – like hearing Eminem breathe between verses – and had vocals that were, at times, almost indiscernible. Heck, even the instantly recognizable theme from Star Wars lacks key parts – like the chimes – that you have to really push your hearing to make out.",
    "That lack in clarity is made up for, partly, by the sense of presence the RA5000 gives to your music. It can feel like you’re actually in the audience of a concert sat near a stack of speakers. It’s pretty impressive that a speaker that size can output that kind of sound in so many different directions – and yet, even with Master Quality tracks from Tidal does it approach the same level of clarity that you’d find in a pair of open-back headphones.",
    "This, likely, has to do with how close the drivers are placed together inside the chassis and what little Sony has done to prevent reverberation and distortion. Having so many speakers inside a small container like that is a recipe for disaster unless you've found a way to absolutely isolate the drivers. We can't say for without breaking down the speaker to find out, but it seems like Sony hasn't done that.",
    "Compare the Sony SRS-RA5000 to some of our other favorite wireless speakers like the new Amazon Echo (2020) or the Sonos One, and there’s a massive difference in clarity. While the RA5000 provides this stadium-like sound, the Echo and the Sonos One are more direct with heaps more clarity at the expense of a larger soundstage.",
    "Sure, the Echo and Sonos One might lack the presence of the Sony RA5000, but we found their direct, unidirectional sound is quite a bit softer and more palatable for longer periods of listening – and comparatively they're an amazing value."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Price and release date",
    "7": "Design",
    "12": "Features",
    "20": "Performance",
    "28": "Don't buy it if..."
  },
  "links": {
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Sony 360 Reality Audio": "https://www.techradar.com/news/first-look-sony-360-reality-audio",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights"
  }
}