{
  "source": "https://www.techradar.com/reviews/iolo-search-and-recover-review",
  "title": "Iolo Search and Recover review",
  "category": "computing",
  "updated": "2021-06-02T06:01:57Z",
  "author": "daniel-blechynden",
  "summary": "Can Iolo Search and Recover find your missing files?",
  "verdict": "A well-regarded data recovery solution, IOLO Search And Recover 4 does the job that is expected of it. Recovery is fast and complete, with most types of data – including mailbox formats – supported. Robust software with good online help, the relatively low price is attractive, but despite claims to the contrary it seems unsuitable for recovering data from unmountable drives.",
  "pros": [
    "Recovers a wide range of file types and devices, including email from popular clients",
    "Good online support provision"
  ],
  "cons": [
    "User interface relies too heavily on slightly unclear, hieroglyphic-esque icons",
    "No free version and no trial option"
  ],
  "article": [
    "When you've deleted files, folders, or partitions in error, you need an affordable data recovery solution that works fast.",
    "That's exactly the idea behind IOLO Search And Recover 4, which lays claim to speedy, \"fast\" recovery and \"one-click restoration.\"",
    "Established in 1998, IOLO is a US-based company that has provided award winning software to millions of customers and over 80 million devices. That's quite a reputation – but is IOLO Search And Recover 4 going to meet expectations?",
    "Many data recovery tools provide a free trial or a free option. Free trials are typically limited by functionality – some will only show you what you can recover, whereas others put a cap on the volume of data recovered.",
    "This isn't the case with IOLO Search And Recover 4. There is no accessible free trial and no free download. Instead, you have the option of buying the data recovery utility for a $39.95 (£25) annual license or not buying it. As it is more affordable than many competing products, that's a price point that might suit you, especially if you can recover your data. While there is the option to use the software in evaluation mode, this isn't accessible until you actually pay for the software.",
    "IOLO Search And Recover 4 comes with a 30-day money-back guarantee and can be used on all of your home PCs. It runs on Windows 7, 8, 8.1, and Windows 10.",
    "You can expect to find and recover deleted and lost media files, office documents, system files, and even emails with IOLO Search And Recover 4.",
    "Capable of recovering emails from Microsoft Outlook and Outlook Express, Mozilla Thunderbird, and even older apps like Netscape Mail and Eudora, IOLO Search And Recover 4 can potentially help you recover lost email messages from years ago.",
    "There is also support for removable media, such as cameras and memory cards, CDs, DVDs, USB flash drives, and MP3 players. IOLO Search And Recover 4 can even recover from IDE, SCSI, USB, USB 2.0, FireWire, and other drive connections. Importantly, it also claims to be able to recover data from \"malfunctioning, damaged, formatted, and repartitioned drives and devices.\"",
    "Is IOLO Search And Recover 4 up to the job of recovering data from a USB flash drive? To find out, we used it with an unmountable 16GB SanDisk Cruzer Blade USB thumb drive. This was connected to a Windows 10 laptop (a Dell 5505).",
    "This is a perfect opportunity to test IOLO Search And Recover 4's claim to be able to handle \"malfunctioning, damaged\" drives. Sadly, despite demanding nearly $40 to use the software, IOLO could not recover data from our unmountable USB device. Consequently, we analysed the 256GB system drive instead.",
    "Individual and groups of files can be selected for recovery from the results. These are listed along with file path, quality, file format, and date information. Other filter options are available, although there is no search tool. Recovery involves simply clicking the Recover this File button and selecting a destination.",
    "Along with recovery, data can be terminated, deleting it fully from the disk.",
    "Standard analysis (\"SmartScan\") of the 256GB drive completed inside 5 minutes, which is faster than expected.",
    "We also performed a \"StrongScan\" of the drive. This tool analyses the drive more deeply for lost data. On our 256GB drive it completed in around 25 minutes. Sadly, there wasn’t any considerable improvement to recoverability, although far more data was revealed.",
    "Individual and group file recovery is also efficient, although there is no option to recover a partition, only the data lost from one.",
    "Overall, recovery is satisfactory, but the lack of options (beyond focusing on specific filetypes) is a shortcoming.",
    "Using new software can often lead to confusion. In the case of IOLO Search And Recover 4, publishers IOLO provide a complete, modern online support system.",
    "The IOLO support page starts off with a search box for inputting questions (avoid single words). You'll also find direct telephone numbers for customer service and technical support. One number is free, the other for customers who have paid for a support package.",
    "For further software instruction, IOLO provides a knowledge base. However, there is nothing in here that concerns IOLO Search And Recover 4, which is somewhat disappointing. The IOLO support page also has a live chat support box for you to raise any issues you may have with their technical personnel.",
    "Is IOLO Search And Recover 4 the recovery tool for you? It is, overall, a decidedly average piece of software. The hidden evaluation version aside, it is affordable and comes with a 30-day money-back offer. That at least mitigates the possibility of disappointment.",
    "But the user interface is dated, looking like it was rescued from Windows 7. When you launch the tool, you'll spot a nag box advising you how much is left on the current license. That even happens the day you buy it – a cynical ploy.",
    "While scan and recovery is fast, IOLO Search And Recover 4 couldn't even detect our unmountable USB drive, accessible to many competitor apps. This is disappointing when the software makes specific claims about being able to do just that. Ultimately, IOLO Search And Recover 4 feels like a recovery app that isn't quite finished yet."
  ],
  "headers": {
    "3": "Plans and pricing",
    "6": "Key recovery features",
    "9": "Finding files",
    "13": "Recovery performance",
    "17": "Support",
    "20": "Final verdict"
  },
  "links": {
    "data recovery solution": "https://www.techradar.com/best/best-data-recovery-software",
    "IOLO Search And Recover 4": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=25039&u1=trd-us-3220294399485763600&murl=https%3A%2F%2Fwww.iolo.com%2Fproducts%2Fsearch-and-recover%2F",
    "USB flash drive": "https://www.techradar.com/news/best-usb-flash-drives",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "IOLO support page": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=25039&u1=trd-us-1276604082118231300&murl=https%3A%2F%2Fwww.iolo.com%2Fsupport%2F"
  }
}