{
  "source": "https://www.techradar.com/reviews/returnal-review",
  "title": "Returnal review",
  "category": "gaming",
  "updated": "2021-04-30T09:18:30Z",
  "author": "vic-hood",
  "summary": "Returnal is a truly next-gen roguelike",
  "verdict": "Returnal puts its own stamp on the roguelike genre, blending ever-changing levels and permadeath with an intense third-person shooter experience. While players are often at the mercy of Returnal’s unpredictability – for better or worse – the immersive storytelling and the utilization of Sony’s latest hardware makes it feel like a true PS5 exclusive.",
  "pros": [
    "DualSense support is subtle but effective",
    "Sounds amazing with headphones",
    "Seamless loading times",
    "Immersive storytelling",
    "Environment changes keep gameplay fresh"
  ],
  "cons": [
    "Few persistent upgrades",
    "Runs can feel needlessly long",
    "Combat can feel repetitive"
  ],
  "article": [
    "Returnal is challenging. A pop-up before you start the game warns you of that, but it doesn’t mean you’ll be prepared. Developer Housemarque has blended the ever-changing levels and permadeath of roguelikes into a game that is otherwise a blockbuster third-person shooter, but what makes Returnal challenging isn’t simply the fact that it’s a ‘difficult’ roguelike, it’s the game's sheer unpredictability.",
    "Returnal is a game full of risky encounters that can mean the difference between a successful run and a more testing one, while players are constantly at the mercy of the loot they may – or may not – pick up, thanks to random generation. A lucky run with the right loot can mean the difference between success and failure, especially given that you have few persistent upgrades between runs (particularly in the earlier biomes, as the game’s six distinct environments are called), which can make it feel like you’re simultaneously grinding and starting from scratch at the same time.",
    "But each death in Returnal – and you will die, a lot – is not entirely pointless, as it unearths more of the story, uncovers secrets you may have missed before, and potentially offers better loot (but sometimes you’re just unlucky). The constantly changing environment keeps things fresh so that, even when you have died for the twentieth time, there’s a possibility you may stumble upon a room you’ve never seen before – and may not find again.",
    "Whether or not Returnal’s gameplay is for you will depend on your gaming preferences, but it’s hard for anyone to deny how stunningly immersive the game is as a whole. The combination of the subtle utilization of the DualSense PS5 controller’s haptic feedback and adaptive triggers, Sony 3D audio tech, and the downright mesmerizing environment make for one of the most immersive gaming experiences we’ve enjoyed to date, outside of VR. This immersion adds significant depth to the game’s somewhat bizarre and intriguing story, and sees Returnal earning its place as a truly next-gen PS5 exclusive.",
    "Returnal is centered around space pilot Selene, who crashes her ship, Helios, on an alien planet called Atropos. But Atropos is stuck in a time loop, meaning that each time Selene dies – and she will die frequently – she begins a new life cycle starting at the crash site. Equipped with a high-tech suit, Selene sets out to battle her way across Atropos and break the loop, which will allow her to escape.",
    "But this isn’t a simple case of Selene having to work her way through the same map again and again; instead, with each reset cycle, the world changes. Each of the six biomes has a different environment, including ancient forest ruins and desert plains, and is made up of ‘rooms’ much like dungeons. But when the cycle resets the order of these rooms changes – sometimes a room you visited last cycle isn’t available this cycle. In addition, the enemies in those rooms change too, which keeps you on your toes, as you never quite know which room you’re about to wander into – or what lurks there.",
    "Considering how much you die in Returnal, it’s a smart move for keeping things fresh with each run; and, in some cases, resetting the cycle allows Selene to pick up pieces of story information she may have missed, like Scout logs that Selene previously recorded and which give hints about the (intriguing but bizarre) story. Even when you think you’ve seen everything in a biome, you could be surprised. After nearly 20 hours with the game, we came across a room with a log that we had never encountered previously, despite running through the biome countless times before. On other occasions we uncovered destructible walls and gates, hiding secrets within, that we had previously missed; or, on a rarer occasion, found that the 20th-century house that sits perfectly preserved (and completely out of place) in the ruins of one room is actually accessible.",
    "This house is a key part of Returnal’s story. Each time the house’s porch light flickers on, Selene can enter, allowing her to uncover a fragment of the overall narrative which may explain why she’s landed on Atropos, and why she’s haunted by a mysterious astronaut figure. There are six house sequences in total, one for the completion of each of Returnal’s six biomes. While these sequences are surreal, and are initially a bit confusing, the more you unlock, the more you begin to piece together the psychological thriller at the heart of Returnal.",
    "Between the scout logs and the house sequences, Returnal purposely drip-feeds you pieces of the game’s story. It’s a brilliant way of motivating you to keep playing when you're struggling to make it to the next biome, giving you just enough to let you know that there’s something more to Selene’s adventure than initially meets the eye, but making you work to find out what that is.",
    "Selene begins each cycle armed with just a low-powered pistol and melee blade, and it’s up to you to find weapon proficiency upgrades that unlock higher-level weapons as you progress. Fortunately, as you unlock more biomes, once you enter later ones after a cycle reset you’re greeted with a high-proficiency upgrade, so you can just crack on with that biome without having to increase your weapon proficiency from scratch.",
    "For example, when we died in biome three and started again at the crash site, we used biome one’s shortcut to get straight to biome three, where there was a weapon proficiency upgrade at the beginning, allowing us to use weapons at a higher level immediately – so we didn’t have to build up that weapon proficiency again. However, it’s still worth trying to pick up any upgrades you can before you get there.",
    "Housemarque has confirmed that there are 10 base weapons, more than 90 weapon traits (each with three levels) and 10 alt-fires in Returnal. These weapons generally replicate in-game weapon staples like a pistol, shotgun, rocket launcher and assault rifle, and a melee blade. But these base weapons have different traits that suit a variety of playstyles and enemies; for example, you could be looking at two different Spitmaw Blasters, one of which generates acid pools while the other fires exploding shells. As you progress, you unlock new weapon traits, and then later can add on new ones, and you’ll also be able to pick up higher-level versions of weapons.",
    "All the weapons feel smooth and weighty thanks to Returnal’s utilization of the DualSense controller’s adaptive triggers, enabling you to hold down the left trigger halfway for a focus shot, or all the way for an alt-fire (more powerful) shot. This utilization adds layers to combat, making you think about the movement of your trigger finger, and allowing you to immediately feel the feedback from a powerful shot. It’s worth noting that this feature can be turned off if you wish.",
    "We found it took a lot of trial and error to find the type of weapon that suited us; and which weapon you use also depends on which enemy you’re going up against. Often, particularly as you progress, Returnal’s rooms are a bullet frenzy that sees you utilizing a combination of your gun, melee weapon and a ferocious amount of dash on enemies that range from tentacle-clad aliens to legless exploding robots – and that’s not even including the bosses, which have a variety of combat styles that, at some point, will likely find a weakness in your playstyle.",
    "Firefights are intense and, while they can be mostly avoided (apart from ‘lockdown’ rooms, all the exits from which are sealed), it’s worth taking advantage of the resources and loot that these fallen enemies drop when possible. Pro tip: sprinting to a boss fight isn’t necessarily going to work in your favor.",
    "With each reset cycle, enemies become more hostile, adding more ferocity to these fights. But, over time, you begin to be able to identify an enemy’s ‘tell’ before it attacks, making these fights a more fluid dance. We did find, however, that the combat scenarios with non-boss enemies do begin to get quite repetitive – especially when you run through the same biome again and again.",
    "In addition to the weapons, some of Returnal’s most key items are artefacts. Artefacts grant upgrades to Selene, such as improving melee damage or increasing protection. While artefacts are super-handy, most don’t persist through cycles – and which ones you get on your run is, again, random. This means that, if you die, you lose all the artefacts and weapons you’ve gathered up in that cycle. There’s a serious lack of persistent upgrades in Returnal, and it sometimes makes progression feel like a thankless task.",
    "A bit of flexibility here could have done wonders. While beating a really tough boss feels amazing, you’re brought crashing back down to earth when after your next death you realize that you lost the good loot you got from them.",
    "As you progress through the game and defeat more bosses, more permanent tech and upgrades become available, which make it slightly easier to get through biomes. But, to get to that point, you kind of need to make do with what’s at your disposal.",
    "Grabbing as many artefacts as you can in your run is advised, and some can be created using a fabricator. Fabricators turn Obolites, a glowing yellow resource that you find in-game, into specific artefacts (exactly what artefacts a Fabricator can create changes with each run) – although broken Fabricators create random artefacts. You can harvest Obolites by killing enemies and, on occasion, in containers or statues with glowing yellow eyes.",
    "Obolite- and loot-harvesting are elements of Returnal that almost encourage you to do a clean sweep of each biome on your way to your objective, as there’s a finite amount of Obolites to collect per biome, and they’re extremely useful as they also enable you to buy artefacts at Fabricators instead of having to solely rely on the game’s randomly-generated loot. It’s a matter of weighing up if you think it’s worth it.",
    "Risky encounters are a big part of Returnal. For example, it’s possible to use a rarer resource called Ether to get artefacts from an alien device, called the Cthonos, at Selene’s crash site, by depositing a certain amount of the Ether into the Cthonos and receiving a random artefact in return – unlocking that artefact for inclusion in future cycles.",
    "But Ether is also super-useful for a number of other purposes. You can instead use it to cleanse containers, keys or health resin infected with Malignancy, which – when left uncleansed – carry the risk of causing your suit to malfunction. By using the Ether to cleanse the Malignancy, Selene can safely pick up or open these items without any risk. But if you choose not to cleanse these items, then there’s a chance (ranging from low to high probability) that you’ll suffer a suit malfunction as a result of opening or picking up items regardless – though, these malfunctions can be removed by completing certain tasks. It’s impossible to tell if using your Ether, or even risking a possible malfunction, will be worth it – particularly with containers, which could hold great loot or something altogether useless.",
    "Ether can also be used to scavenge the bodies of other fallen scouts (if online is enabled), as you may be able to pick up some of their loot. Alternatively, you can avenge a fallen scout in order to try and get Ether – but that’s a bit riskier. Avenging a scout means that a large enemy will spawn, and needs to be killed in order for you to gain your Ether reward; but, in some cases, the dead scout will turn into a parasitic monster creature that simply needs to be killed. Sorry, buddy.",
    "With Ether being a fairly rare resource, it’s up to players to decide which scenario is most likely to pay off long term – and sometimes it’s not an easy decision to make when your back is against a wall.",
    "Even riskier is picking up a Parasite, which gives Selene both a buff and a de-buff (granting both positive and negative effects) – for example, you may get higher weapon power, but only if you’re standing still. It’s a constant game of weighing up risk against reward, and sometimes being too greedy can hurt you in the long run.",
    "Navigating Returnal’s world is pretty straightforward, and makes what could be a laborious task much easier. A map helps you keep tabs on which rooms you’ve been in, and indicates which upcoming rooms are simply side paths – likely containing loot – and which are main gateways leading towards the objective (highlighted in orange on the map). This is a helpful feature, especially as you unlock more biomes, as it enables you to quickly make your way through the biomes that stand in the way of you reaching the biome (and objective) you actually need to get to – highlighting shortcuts that make that journey easier in later biomes.",
    "A source of frustration for us with the first two biomes was the fact that Returnal’s cycle doesn’t reset from the most recently unlocked biome; instead you respawn back at the crash site, and have to make your way through all the previously unlocked biomes before making it to the point at which you died. So, for example, when we made it to the middle of the second biome and died, we would respawn at the crash site, and have to go through biome one to get into biome two.",
    "While this may put some players off, causing them to think this will be the case for every biome, we can assure you it’s not. As more biomes unlock, it becomes increasingly easier to access your most recently unlocked biome – through both tech and story progression – although how easily you’re able to traverse shortcuts still relies on how close to you the room containing that shortcut is generated in the next cycle.",
    "However, even when you start unlocking these shortcuts, runs are still long. With each run, players are typically looking at having to complete both the biome they reset from and the one they’re actually trying to complete. While in some instances this is useful, as it allows you to pick up some extra gear or health, often it’s more of an unnecessary annoyance, which drains your time more than anything. And, with enemies getting increasingly more hostile each cycle, oftentimes you may find yourself not even getting to the point you need to.",
    "Returnal is understandably a PS5 exclusive. While PS4 players will be wanting to get their hands on Sony’s upcoming first-party offering, we feel that the game simply wouldn’t have worked on last-gen hardware.",
    "Given that gameplay is based around constant death and respawning, the PS5’s super-fast SSD makes this ritual much less frustrating than it could have been on PS4. Loading times are extremely fast, and transitions are seamless, making you more inclined to come back for more.",
    "In addition, Returnal is a brilliant showcase for PS5 tech. The DualSense haptic feedback is fairly subtle, gently reacting to on-screen events in a way that doesn’t break your attention but adds to the experience. And if you’re playing with headphones, which allow for PS5 3D spatial audio, Returnal’s environment truly comes to life – you can hear the slithering of the world’s creatures in the background, the rumble of a storm in the distance, and the raindrops falling on Selene’s helmet.",
    "All this immersion made us a bit motion sick at times, but Housemarque offers a selection of accessibility options that include removing motion blur, adjustments for color blindness and more.",
    "Returnal is the perfect game for those who love a challenge with a bit extra behind it. It’s a game of risk, with its unpredictability defining the degree of challenge more than the enemies themselves. When Returnal is challenging, it’s punishingly so, and we often found ourselves stuck for hours on end at certain points - with the unpredictability meaning strategy could only get us so far, we had to just hope that our next run of loot was luckier than the last.",
    "But it’s hard to deny that Housemarque has done something different with Returnal, blending a roguelike with a blockbuster third-person shooter – and creating an arcade bullet hell that’s different to anything we’ve seen from Sony before.",
    "Returnal is a PS5 exclusive that emphatically meets the standards of what we’ve been crying out for from the new console, and it’s a fantastic showcase for what this new hardware is actually capable of.",
    "While Returnal’s formula may be something that frustrates many players, others will adore its fast-paced action, psychologically thrilling narrative, and risky endeavors – and with a price tag of $69.99 / £69.99 / AU$124.95, it’s worth identifying which of those camps you’re likely to fall into before you pick this game up."
  ],
  "headers": {
    "4": "Live. Die. Repeat",
    "9": "Bullet hell",
    "16": "Risky endeavours",
    "26": "Just one more go",
    "30": "A truly next-gen experience",
    "34": "Verdict"
  },
  "links": {
    "DualSense PS5 controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Sony 3D audio tech": "https://www.techradar.com/news/how-the-ps5s-3d-audio-chip-could-transform-your-gaming-experience"
  }
}