{
  "source": "https://www.techradar.com/reviews/webhostingbuzz",
  "title": "WebHostingBuzz review",
  "category": "computing",
  "updated": "2021-01-06T20:30:25Z",
  "author": "mirza-bahic",
  "summary": "Can this US-based web host give you a buzz?",
  "verdict": "WebHostingBuzz is a US-based web hosting provider with almost two decades of experience in this trade and a several attractive features on offer: fair-priced packages, unlimited bandwidth, SSD storages, free website transfer, SSL certificates, good performance and a noteworthy 45-day money-back guarantee which minimizes the risk of making a mistake.",
  "pros": [
    "Above-average performance and 99.9% uptime guarantee",
    "Great value for money",
    "Generous 45-day money-back guarantee",
    "Myriad of hosting plans and options"
  ],
  "cons": [
    "No support via telephone",
    "No website builder",
    "Self-help option requires some improvements"
  ],
  "article": [
    "The story of WebHostingBuzz began in 2002 when its founder and ongoing president Safvan Malik decided it was time to start offering a superior alternative to over-priced but low-quality web hosting services provided by the majority of large companies at the time.",
    "Almost two decades later, WebHostingBuzz operates more than two hundred servers and hosts over 200,000 websites around the globe. Despite being independent, it managed to become one of the leading international companies in the business, which it takes great pride in. By offering a myriad of hosting products, WebHostingBuzz aims to meet the needs of all businesses, regardless of their sizes and overall complexity, which is an admirable (and somewhat impractical) quest for a relatively small company.",
    "Their main office is located in New York and all of their data centers are located inside the US: New York (well, naturally), Dallas, Atlanta and Phoenix, with one center in every city. To ensure the reliability of their servers, WebHostingBuzz provides power back-ups via UPS and generators as well as round-the-clock monitoring by their expert technicians.",
    "All ecologically minded individuals will be glad to hear that WebHostingBuzz takes its environmental commitment very seriously, as all of their hosting services are completely carbon neutral.",
    "WebHostingBuzz has an official blog, but if you choose to visit it through the option offered on the main page’s footer (which is the most obvious choice), it will take you to the same page where you started. If you do manage to find the blog by other means, you’ll surely notice it looks half-done and untouched from July 2015, which doesn’t leave much of an impression. However, they at least appear to be relatively active on social networks, publishing new content every now and then on Facebook, Twitter and LinkedIn.",
    "WebHostingBuzz manages to cover a variety of hosting types: shared, reseller, VPS and dedicated server hosting. Each type is further divided into several different-sized hosting plans, all which seem reasonably priced. The most pocket-friendly option is a shared hosting plan branded as “Personal” and it starts at $5.99 per month, which is a bit above the average price. However, this plan includes 20GB of SSD disk space, unlimited bandwidth, one-click installs, one free migration, incremental backups and (recently) an SSL certificate, which seems like a pretty good deal.",
    "With WebHostingBuzz, there is a rather generous “hassle-free” 45-day money back-guarantee, which gives customers plenty of time to test its services. It should be noted that all additional services, such as domain registration and add-ons, aren’t eligible for refunds.",
    "All major credit cards and PayPal are acceptable payment methods with WebHostingBuzz.",
    "For those who are moving from another host, WebHostingBuzz offers a free migration service, which is always nice to see. In any case, choosing a fitting hosting plan with WebHostingBuzz is quite straightforward experience due to clearly presented comparison tables with all the relevant details being highlighted. After finding the plan that suits your needs, you’ll be required to register a new domain, transfer the one you already have or to leave it with your old host. We should note that there are no free domains with WebHostingBuzz although their pricing is as one would expect and amounts to some $10 for a year.",
    "Regardless of your choice, the next phase is to choose which billing cycle you want: a monthly or an annual one. Then, you can add some of the suggested additional services, none of which will come pre-selected. While this may seem like a tiny detail, we are stressing it here since we have witnessed quite the opposite practice all too often. Before proceeding, you can double-check the order summary, just in case.",
    "Before finalizing your account with WebHostingBuzz, you’ll be asked to provide pretty standard personal information (name, e-mail, phone number and so on), create a password, choose a payment method and proceed with it.",
    "Our new website appeared in a matter of minutes, so yours should too. As WebHostingBuzz provides its users with industry standard and easy-to-use cPanel, managing all aspects of your website should be simple enough, even for newcomers. Useful apps such as WordPress, Joomla, Magento, Drupal, Prestashop and many others can be yours in a flash, thanks to a one-click installer. Since WebHostingBuzz aims to be developer-friendly, many popular scripts and programming languages are supported: Java, Perl, Python, Ruby on Rails, PHP 5, MySQL 5, CGI, SSH, SSI and HTML5, to name a few.",
    "The only notable flaw we should point out is the absence of a website builder, which would provide users with an alternative way to shape the content on their websites.",
    "Now, let's check what level of speed we can expect to get with WebHostingBuzz. Following the speed performance test by GTmetrix on WebHostingBuzz’s main website, we were presented with a rather pleasing performance. The site fully loaded in 2.8 seconds, which looks good in comparison to the average result of 8.1. In addition, the process requires a mere 37 requests, while the average result is around 98. After every metric was taken into account, the performance was not perfect, but it certainly went beyond what is considered an average, which made GTmetrix grade the website’s performance with a solid B (85%).",
    "Considering that WebHostingBuzz offers a 99.9% uptime guarantee, we expected nothing less than that and, fortunately, our expectations were met. After more than a month of constantly monitoring the uptime of WebHostingBuzz’s main website, UptimeRobot failed to record a single instance of downtime and only a few minor oscillations in reaction time.",
    "Taking all of this into account, it appears that speed and reliability are not something WebHostingBuzz’s customers should be concerned about.",
    "As for customer support, WebHostingBuzz offers a few options: Server Status Blog, knowledgebase and a handful of ways to get in touch with their support agents.",
    "At first glance, WebHostingBuzz’s knowledgebase resembles many others we’ve seen before. The most popular articles (and the featured ones) are highlighted and you can browse through the chosen categories or use the search box. Our search ended with more than a few results, although (regrettably) most of them had barely anything to do with the keywords we used. There was a reasonable amount of decent step-by-step tutorials, although some of them hadn’t been updated for almost a decade and therefore felt out-of-date.",
    "If self-help options are not your cup of tea, you can contact WebHostingBuzz’s support team via live chat, e-mail or ticket support system, all of which should be available day-and-night. Additionally, WebHostingBuzz guarantees a response to all tickets in less than half an hour and “an even quicker response” for live chat. Our own experience with their support team was a confirmation of this, but we were left a bit disenchanted by the absence of a telephone option.",
    "Both Hostgator and WebHostingBuzz are US-based hosts with all of their data centers deployed inside the States. Both offer a whole range of hosting-related services at similar prices. However, Hostgator includes a website builder with every hosting plan, while WebHostingBuzz is not going to offer you one.",
    "When it comes to costs, Bluehost is more pocket-friendly than WebHostingBuzz, with a shared hosting plan starting at mere $2.95. However, a price hike after the initial period might take you by surprise, while with WebHostingBuzz prices stay pretty much the same.",
    "FatCow is yet another US-based competitor with a decent amount of hosting solutions at reasonable prices. In addition, all of its plans include a free domain registration, a point-and-click website builder and all expected customer support channels, which could attract newcomers. However, FatCow’s speed performance and uptime are below the industry average, while WebHostingBuzz demonstrated a top-notch performance.",
    "While WebHostingBuzz’s servers are located in the US, Strato’s are situated in Germany, which might be more convenient for clients from Europe. However, those who would prefer an industry standard cPanel will have to go with WebHostingBuzz, since Strato provides its own custom-made control panel which is, unfortunately, not a particularly user-friendly solution.",
    "WebHostingBuzz is one of those well-balanced hosts with which it is hard to find any major deal-breaker. Obviously, they may not offer a free domain registration and a website builder, but other features such as cPanel, SSL certificate and one-click WordPress installation are there to compensate for the weak points. If we add reliable performance, transparent pricing policy and an eco-friendly approach into the bargain, WebHostingBuzz might sound like a perfect choice. However, even if you are still convinced that it can meet your expectations, Bluehost or Hostgator are always a first-class alternative."
  ],
  "headers": {
    "5": "Plans and pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "16": "Support",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "WebHostingBuzz": "https://www.webhostingbuzz.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Personal": "https://www.webhostingbuzz.com/web-hosting/",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "FatCow": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1055151245522775000&xs=1&url=https%3A%2F%2Fwww.fatcow.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwebhostingbuzz",
    "Strato": "https://www.techradar.com/reviews/strato"
  }
}