{
  "source": "https://www.techradar.com/reviews/fasthosts",
  "title": "Fasthosts web hosting review",
  "category": "computing",
  "updated": "2021-12-03T02:48:57Z",
  "author": "mike-williams",
  "summary": "Is this UK veteran as fast as its name implies?",
  "verdict": "Fasthosts offers a wide array of hosting types, options, features, and some easy-to-use site-building tools for a fair price. On the flip side, all of its data centers are in the UK (making it less convenient for users elsewhere), the price spike after the promo period is significant (although the discounts are as significant), and the lack of SSL certificates with entry-level plans may put off potential users.",
  "pros": [
    "Eco-friendly hosting",
    "Feature-packed plans",
    "24/7 customer support",
    "Free domain name for a year",
    "30-day money-back guarantee",
    "A whole variety of hosting options"
  ],
  "cons": [
    "No uptime guarantee",
    "No free SSL with entry-level plans",
    "Significant price spike after the promo period"
  ],
  "article": [
    "Since its inception in 1999, Fasthosts has been coming up with new solutions aiming to provide its customers with everything they need to govern and grow their online presence. The company is based in Gloucester (the UK) together with its data centers that keep over a million domains “running swimmingly” and make sure more than 42 million emails are delivered smoothly and securely day after day. Fasthosts currently hosts over 320,000 websites and the number grows slowly yet steadily.",
    "Interestingly, the company was launched by then 17-year-old Andrew Michael as a part of his school project. After he found himself unable to find a suitable web hosting solution for his “A-level IT project”, he came up with an idea to create one on his own - and that’s how the story of Fasthosts started.",
    "In 2002, Techtrack 100 ranked Fasthosts as the second fastest growing tech company in the UK. Four years later, it was acquired by United Internet, a German internet service provider and one of the largest hosting groups in the world. Fasthosts’ primary data center is located in Gloucester, while the secondary data centers are scattered across unspecified locations in the UK.",
    "For all those who want to get into the green scene, Fasthosts offers an eco-friendly hosting experience. All of its data centers are run on 100% renewable energy from Ørsted, a Danish multinational power company that is one of the few suppliers of “green power” in the UK.",
    "Fasthosts’s official site is stylish, simple to operate, and fully stocked with information about the company, its infrastructure, and services. It also features a blog where you’ll find some helpful hints, but it isn’t updated too often.",
    "As for networking sites, Fasthosts is fairly active on Facebook, Twitter, LinkedIn, Instagram, and YouTube.",
    "Fasthosts’ product range includes shared hosting, WordPress hosting, email hosting, cloud hosting, reseller hosting, VPS hosting, dedicated server hosting and bare-metal hosting. It also provides domain registrations, website builders, cloud backups, online marketing tools, Microsoft 365 suite, and partnership programs.",
    "Shared hosting solutions start pretty pocket-friendly with an introductory price at £1.00 ($1.35) per month for the first three months, after which the price will rise to £5.00 ($6.70) per month. This plan (named “Ignite”) will supply you with a single site, 10GB of (“smart” SSD) storage space, two 1GB databases five, 2GB mailboxes, free domain for the first year (.com, co.uk, .uk, or .london), but no not with an SSL certificate. To get an SSL and some basic SEO tools, you’ll have to go with a bigger plan.",
    "If you have a change of heart within the first 30 days, you can cancel your contract with Fasthosts “without paying a penny” thanks to its 30-day money-back guarantee. However, if you have purchased any of the advanced hosting products, forget about receiving a refund.",
    "Fasthost accepts payment via all major credit/debit cards and PayPal.",
    "To set your online project in motion, pick out a plan you wish and proceed to set it up. If you went with one of the entry-level solutions, right at the start you’ll be prompted to upgrade your plan at a promo price, but you can choose to continue without the boost.",
    "Now you’ll be asked to create your account with Fasthosts, and doing so is surprisingly simple. You only need to surrender your full name, email address (which will also serve as your username), and a (very) strong password. Then, you can proceed to add your payment information and make a purchase or abort the mission. You can also go to the dashboard where you can complete it later on.",
    "Fasthost’s dashboard and industry-leading cPanel may seem like night and day (Fasthost’s midnight blue dashboard being the night), but it is fairly straightforward to use. There you can update and change your account information, track your invoices, product renewals, and transactions, register a domain name and browse other products, manage your hosting package, and seek customer support. However, if you went with a VPS package, you’ll be provided with Plesk.",
    "If you want to install WordPress, Drupal, Joomla, or any other useful app, just scroll down until you see a one-click installer, tap into “Configure Application” and everything else is as straightforward as it gets. If you don’t care about WordPress, you can upload your website through the pretty standard FTP and use their File Manager to upload and manage your files directly.",
    "Alternatively, you can accept Fasthosts’s invitation to try out one of their website builder packages that come with one to two months of the free trial. Besides the regular builder, Fasthosts also offers an e-commerce website builder, which is basically the regular builder but “with more e-commerce power”, and you can try it for free as well.",
    "We should also note that, unlike with most hosts, Fasthosts’ custom control panel doesn’t have a cancellation button, and the only way to cancel your subscription is to contact its support team via telephone. No, live chat or a ticket won’t cut it.",
    "Oddly enough, Fasthosts doesn’t focus on “fast” speed as one of its primary assets, at least not according to its official site where the word “speed” is seldom mentioned. Nevertheless, according to a test run via GTmetrix (our trusty tool), you can expect relatively fast loading speed with Fasthosts. That is if you and your target audience are found within UK borders. When tested from a server in London, Fasthost’s site fully loaded in 6.4 seconds, which is an alright performance yet not something you would brag about. In addition to this, all other crucial speed measuring metrics showed a pretty good performance resulting in a B (80%) as a conclusive GTmetrix grade.",
    "Refusing to keep pace with its competitors, Fasthost offers no uptime guarantee whatsoever. Thus, to evaluate the performance of Fasthost’s site, we called upon UptimeRobot, a rather reliable uptime monitoring tool. Fortunately, after running for two weeks on the site, UptimeRobot failed to record any downtime at all, although the site took fairly long to respond to requests.",
    "Whether you’ve run into an issue with your website, or you simply want to inform yourself about Fasthosts’ services, finding your way to customer support should be a breeze. The telephone line is available round-the-clock, and live chat during office hours. If there is no hurry, you can also submit a support ticket and expect an answer within three hours or so. Nevertheless, before reaching the support staff one way or another, you’re encouraged to check if your question has already been answered among the guides.",
    "Speaking of guides, you can find them in the knowledgebase of Fasthosts’ “Support Site” together with system status, resources (PDF guides and manuals, and a domain health checker), and a support hub. The guides themselves seem beginner-friendly and complete with suitable screenshots.",
    "Although there is a community forum available (for registered users), it doesn’t look particularly popular as some days-old questions haven’t been answered yet.",
    "Although both Heart Internet and Fasthosts are hosts from the UK offering a similar scope of solutions, there are some significant differences. For instance, Fasthosts appears more affordable at first, but since its products renew at a higher rate than with Heart Internet, the upper hand is quickly lost. In terms of features and security, it’s a draw. And when it comes to performance, Heart Internet wins the day.",
    "TsoHost is an excellent alternative to Fasthosts, especially if you already have a website since the migrations are free of charge. Although Fasthosts is a bit stronger when it comes to customer support, it offers no uptime guarantee (while tsoHost guarantees 99.9% of it), which might turn away some users.",
    "UK-based Fasthosts and US-based HostGator share a similarity when it comes to price spikes of their products after the promotional period. However, if you subscribe for three years with HostGator you’ll postpone the “unpleasant surprise” for that long, while with Fasthosts the promo price lasts from three to six months (depending on the plan).",
    "Both Bluehost and Fasthosts provide lots of how-to guides, videos, and 24/7 customer support to help less tech-savvy users find their way around. In terms of pricing, security, and performance, they are more alike than apart. However, since all of Bluehost’s data centers are situated in the USA, while Fasthosts’ centers are in the UK, the choice may come down to geography.",
    "While there’s a lot to like about Fasthosts, whether its strengths outweigh its weaknesses (or the other way around) depends much on your expectations and experience. One who is looking for a UK-based old-timer with which to launch a personal blog, open an online shop, or launch a start-up, will likely find Fasthost’s solutions worth a look. An attractive promo price tag and a 30-day money-back guarantee will just sweeten the deal.",
    "If you don’t mind having your site hosted in the USA, then HostGator and Bluehost are amazing alternatives that will give you more reassurance to work with while spoiling you with freebies."
  ],
  "headers": {
    "6": "Pricing",
    "10": "Ease of use",
    "16": "Speed and experience",
    "18": "Support",
    "21": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "Fasthosts": "https://www.awin1.com/awclick.php?awinmid=17100&awinaffid=103504&clickref=trd-us-1611398073323774000&p=https%3A%2F%2Fwww.fasthosts.co.uk%2F",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "email hosting": "https://www.techradar.com/news/best-email-hosting-providers",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "bare-metal hosting": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "domain registrations": "https://www.techradar.com/news/best-domain-registrars",
    "website builders,": "https://www.techradar.com/news/the-best-website-builder",
    "cloud backups": "https://www.techradar.com/best/best-cloud-backup",
    "Ignite": "https://www.awin1.com/awclick.php?awinmid=17100&awinaffid=103504&clickref=trd-us-9223770543852860000&p=https%3A%2F%2Fwww.fasthosts.co.uk%2Fweb-hosting",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "SEO tools": "https://www.techradar.com/news/best-seo-tool",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "live chat": "https://www.techradar.com/best/best-live-chat-software",
    "Heart Internet": "https://www.techradar.com/reviews/heart-internet",
    "TsoHost": "https://www.techradar.com/reviews/tsohost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}