{
  "source": "https://www.techradar.com/reviews/oneplus-nord-ce-5g",
  "title": "OnePlus Nord CE review",
  "category": "phones",
  "updated": "2021-07-15T15:31:09Z",
  "author": "srivatsa-ramesh",
  "summary": "Less successor, more success extender",
  "verdict": "The OnePlus Nord CE is the company’s new mid-range smartphone that brings decent specifications and a great software experience at an affordable price. The cameras are not the best and it even misses out on a few staples — but if you’ve been waiting for an affordable offering from the company, the OnePlus Nord CE is your calling.",
  "pros": [
    "Battery life",
    "Great in the hand",
    "Software experience"
  ],
  "cons": [
    "No Alert slider",
    "No IP rating",
    "Basic camera performance"
  ],
  "article": [
    "With the launch of the OnePlus 9 series earlier this year, the company reached new heights in terms of its pricing, leaving many loyalists disappointed and waiting for a return to the budget segment. Those prayers have now come true in the form of the new OnePlus Nord CE.",
    "CE is supposed to stand for “Core Edition”, a reference to how the device was designed to retain the essence of the original OnePlus Nord but at a lower price. That makes it the cheapest smartphone from the brand in years in India, and among the cheapest in Europe.",
    "Even with an affordable price tag, the OnePlus Nord CE continues to offer the classic OnePlus experience we’ve all grown to love — a clean software skin that is always responsive, a minimalist design with some personality, and adequate hardware to keep the phone running smooth.",
    "It starts with Oxygen OS, which remains as one of the only software skins which is free of bloatware and added services in this segment. Running atop Android 11 this time, it is fast and fluid as ever, without skimping on the features and customizations that fans enjoy.",
    "Staying true to the theme, we also get a 90Hz AMOLED display that makes every interaction look smooth. The Snapdragon 750G at its heart was usually powerful enough to keep things going. With 5G support, the OnePlus Nord CE will be ready for the next generation of connectivity when the networks are.",
    "Of course, it isn’t a perfect phone, and OnePlus had to cut a few corners to achieve this price tag. There’s no Gorilla Glass protection on the display and even the back is made of polycarbonate material. The beloved alert slider was also axed. However, those decisions do make the phone quite comfortable to hold as it’s much lighter and thinner than others. And even with that petite form factor, it manages to bring back the 3.5mm headphone jack.",
    "The cameras continue to be about average, as was the trend with older OnePlus devices, but they should suffice enthusiasts. What managed to surprise us was the battery life — a large battery paired with an efficient chipset make the Nord CE a champ in this regard. Warp Charging is also present, taking the phone from zero to 65% in just about 30 minutes.",
    "The OnePlus Nord CE might not be the best smartphone under Rs 30,000 / £400, but it is the easiest one to recommend to most users, thanks to an enjoyable overall experience and far fewer cons to be mindful of.",
    "The OnePlus Nord CE was announced in June 2021, and it's on sale now in Europe (including the UK) and India. OnePlus doesn’t seem to be intending for this phone to come to the US, and OnePlus phones aren’t available in Australia either.",
    "It has a starting price tag of Rs 22,999 for the 6GB of RAM and 128GB storage model, which is exclusive to those who live in India.",
    "The 8GB and 128GB model will cost you Rs 24,999 / £299 (around $420, AU$550) and the top of the line 12GB and 256GB model will cost Rs 27,999 / £369 (around $520, AU$680).",
    "The design of the OnePlus Nord CE tells you half the story of its pricing. No, we don’t mean that’s cheap, but this is something OnePlus had to bring in to keep the cost this low. Allow us to explain.",
    "The OnePlus Nord CE is available in three colorways - Blue Void, Charcoal Black and Silver Ray. We are using the Blue Void variant here for our review. It is made up of composite material along with an aluminium frame running around the phone. It doesn’t have the Gorilla Glass protection on the back like the OnePlus Nord. Also gone is the glossy back, which has been replaced by this fine-looking matte finish.",
    "The Blue Void variant feels like a mix of a green and blue color and it also reminds us of the Glacial Green variant of the OnePlus 8 from 2020. The sides have a purplish tint and the back panel changes its color between blue and green spectrum as the light falls on it.",
    "The power key is on the right side of the phone and is easily reachable with one hand, while the volume rockers sit on the left of the device. You get a 3.5mm headphone jack, solo speaker, and USB Type-C port on the bottom. On the left side, you get a dual SIM slot.",
    "The OnePlus Nord CE measures 159.2 x 73.5 x 7.9mm and weighs just 170 grams. That makes it thinner and lighter than the OnePlus Nord by a fair margin. You will enjoy holding this phone in your hands, especially if you are a fan of compact phones.",
    "The OnePlus Nord CE feels extremely comfortable and light in the hand and thanks to the matte design, you also get a good grip on the phone.",
    "While it might not be as compact as the Asus 8Z, the OnePlus Nord CE will be a welcome change for those who are coming from bulkier phones. The phone isn't slippery either, so unless you have butterfingers, you should be safe. For what it's worth, OnePlus is also offering a free silicone case in the box, which is very similar to the one we got with the original Nord with a pattern.",
    "The major feature that the device misses out on comes in the form of an alert slider. The OnePlus Nord CE joins the N series here by omitting the iconic feature that has been one of the standout features since the OnePlus 2. For those who are unaware, the alert slider is a quick hardware key that's on most OnePlus phones on the side, that switches between silent, vibrate, and ring modes.",
    "OnePlus said that it wants to give the trademark OnePlus features such as the alert slider to its more premium OnePlus devices. But, we did miss out on this feature during our usage time.",
    "You lose some, you gain some - while the Nord CE misses out on the alert slider, the 3.5mm headphone jack makes a comeback which might make you happy. Furthermore, the device does not have any official water resistance rating, but the phone is protected to withstand a bit of water splash and dust.",
    "On to the back, you will see the triple camera array with a bump which is raised by a couple of millimetres. If you keep the phone on a flat surface, it does wobble, but if you have a case, this won't be an issue.",
    "Overall, we liked the design of the Nord CE even though it missed out on some key features such as the alert slider and the Gorilla Glass protection on the back. The In-hand feel is great and the ergonomics of the devices is one of the best we’ve experienced in recent times.",
    "The OnePlus Nord CE sports a 6.43-inch AMOLED display, making it the handiest phone in the OnePlus Nord and N series lineup. It has a Full HD+ (2400 x 1080p) resolution, 20:9 aspect ratio, and a 90Hz fluid refresh rate. Gone is the Gorilla Glass protection of the OnePlus Nord, but OnePlus is bringing DragonTrail glass protection here. It isn’t as durable as Corning’s Gorilla Glass, but it does protect the screen from picking up scratches easily.",
    "On top of that, the OnePlus Nord CE also comes with a basic pre-installed screen protector to protect against scratches.",
    "The front of the phone is dominated by the screen with slim bezels on the sides and a thicker bezel on the top and the bottom. The selfie camera is also placed in a punch-hole toward the left-hand side. The cut-out blends with the display really well and we found ourselves not noticing it after a while.",
    "The display here is a flat one, unlike some of the flagship phones from OnePlus. It is a crisp and sharp AMOLED display with nice viewing angles. The phone is also HDR certified which means you will be able to stream HDR content on Netflix, YouTube and more.",
    "We did play a couple of titles on Netflix and the video quality was excellent and enjoyable as well. Overall, you’d enjoy watching movies, shows, scrolling through Instagram, and social media on the OnePlus Nord CE. The 90Hz refresh rate is the icing on the cake; it makes the whole experience smoother. You also get an option to switch back to 60Hz, which will bring up the battery life by a bit.",
    "You also get access to vivid, natural, sRGB, Display P3, and AMOLED wide gamut screen calibration modes. You can set them to your liking under the display section. There’s also an Ambient display that can display contextual information such as an alert or a notification when the screen is turned off. It can be set as the Always-on Ambient display mode.",
    "The AMOLED display also brings a pleasant experience with deep blacks and excellent contrast and sharpness. However, the colors on the OnePlus Nord CE aren't quite as eye-catching as we’d see on some other mid-range phones like the Poco F3 or Xiaomi Mi 11X. While it might not be the brightest panel, the phone gets the outdoor brightness fairly well to read under direct sunlight.",
    "It is one of the few phones at this price to offer an in-display fingerprint scanner. The scanner works fairly well, but we’d prefer to see a faster mechanism. Additionally, you also get the 2D face unlock feature which cuts the usage time of the in-display fingerprint scanner by at least 50% with its super-fast unlocking.",
    "Performance is another area where OnePlus had to step down in order to keep the price low and make it more affordable than the OnePlus Nord. The device is powered by a Qualcomm Snapdragon 750G octa-core chipset. It is an octa-core processor clocked at 2.2GHz and built on an 8nm fabrication while the graphics are taken care of by the Adreno 619 GPU.",
    "This is also a 5G enabled chipset which comes with Qualcomm’s X52 5G modem for 5G connectivity. In India, you get support for the N78 band only(SA/NSA) and N1, N3, N5, N7, N8, N20, N28, N38, N40, N41, N77, and N78 for the European market.",
    "The Snapdragon 750G is a capable chipset which does perform well when it comes to day to day tasks such as opening multiple apps at once, switching between them, and playing a few games. We did not feel any lag or jitter during our gaming time.",
    "The device is not the snappiest OnePlus we’ve seen. We found some apps or games took a second or two longer to open than we’d expected. It secured a score of 1812 in the multi-core in the Geekbench 5 which is pretty respectable, but we have better performers in the segment such as the iQoo Z3, Poco X3 Pro, Mi 11X (Poco F3).",
    "The OnePlus Nord CE is available in three configurations - 8GB of RAM and 128GB of storage, 12GB+256GB, and the India exclusive 6GB+128GB. Just like most other OnePlus phones, you are not getting MicroSD card support here as well.",
    "You get LPDDR4X RAM and UFS 2.1 storage type, which is not the fastest or the best in the segment and thus apps take a couple of additional seconds to open. As for the memory management, most of the apps stayed in the background and switching between apps did not force reload the content except on a couple of occasions where the game reloaded when we switched back after a few minutes.",
    "In Call of Duty Mobile with ‘very high’ graphic quality and a ‘very high’ frame rate, we were able to achieve 60fps for the most part with decent stability. You can also play the game with Max refresh rate, but the graphic quality will drop too high. Asphalt 9 gameplay was also smooth and enjoyable. The battery dropped by 6% after 20 minutes of gameplay.",
    "You also get some additional and useful game tools like FPS meter, do not disturb, heads-up notification, disable auto-brightness, mis-touch prevention, graphic optimization, and prioritizes signals to the game to reduce latency. The 90Hz high refresh rate also helps the overall gameplay with its smoother graphics and motion.",
    "Oxygen OS along with the Snapdragon 750G provides an overall smooth experience for most people who are looking out for a good mid-range phone. While it might not be the best when it comes to performance or gaming in the segment, it is a good one to consider. If performance is your top priority, the Poco X3 Pro with its flagship-grade Snapdragon 860 is still the best option here.",
    "Cameras have never been the headlining feature on any OnePlus smartphone, be it the flagship or mid-range phones, but that did change a bit with the recently launched OnePlus 9 series. On the OnePlus Nord CE, you are getting three cameras on the back and one camera on the front - one less camera sensor on either side compared to the OnePlus Nord.",
    "There’s a 64MP main camera with an f/1.79 aperture. The company did not specify the sensor, but it is from OmniVision and not Sony or Samsung. The primary camera also comes with Electronic Image Stabilization (EIS) and clicks the images in 16MP resolution by default. The secondary 8MP camera has a 119-degree field of view and an f/2.25 aperture. It also supports EIS. And, lastly, you get a 2MP mono lens with an f/2.25 aperture.",
    "The photos that were taken in the default 16MP mode come out bright, colorful and punchy. The colors are a bit oversaturated thereby taking the contrast slightly up, but that’s fairly acceptable given the punch it adds. The dynamic range is also pretty respectable on the Nord CE.",
    "The auto HDR feature makes sure the image is not too dark or overexposed and comes in handy more often than you’d imagine. However, we did notice some incorrect white balance with a slightly green hue in the images.",
    "The pictures taken in 64MP mode are more than double the size of the 16MP, but it does bring up more details and you can zoom in a bit more than you could on the 16MP pictures. The 16MP images should be good enough for most social media sharing, but if you plan on printing or editing the image, the 64MP images are a better choice for you.",
    "The night mode on the Nord CE takes up to seven images, merges, and brings the best features of all to a single image. The output in the Nightscape mode is good and better than the one you get with the regular mode. It does bring more light than reality and brighten up the picture, but you will miss out on details in the low-light scenario. We hope, OnePlus can make things slightly better in terms of low-light performance over an OTA update soon.",
    "The 8MP wide-angle brings a wider field of view and also retains most of the colors well. Due to the smaller sensor and aperture, the dynamic range takes a hit here. ultra-wide is a cool feature to use, but the quality isn’t as good as the primary camera as it lacks detail. The best use-case scenario would be to use this mode while clicking some beautiful landscapes.",
    "You also get a new 2MP mono shooter on the back to take black and white shots. It does come in handy when you want to take some dramatic shots, but this is best for daylight usage. In our testing we found the images to have retained more information compared to the colour ones (and desaturated). However, we don’t see this feature being used by people often as it is also hard to find in the camera app. You will have to click on the filter option on the bottom right of the screen and scroll to last and get the mono mode.",
    "Selfies are handled by a 16MP shooter on the front which is a Sony IMX471 sensor with an f/2.45 aperture. The selfies come out well under good lighting conditions, but we did find the phone was over-sharpening a bit too much for our liking. But, overall selfie quality was good enough for sharing and social media posts.",
    "The camera also includes a bunch of shooting modes such as time-lapse, panorama, slow-mo, video, portrait, nightscape, and Pro mode. The portrait shots on both the front and back cameras come out well with good edge detection. You can shoot up to 4K at 30fps and 120fps slow-mo videos. The video recording was good, but it was a bit shaky due to the lack of OIS. The EIS does a good job by keeping up and outputs a decent video with good HDR and audio pickup.",
    "In a nutshell, the OnePlus Nord CE camera is again not the best in the segment, but it is a step in the right direction as we could see the pictures are slightly better than the OnePlus Nord. However, if you want the best camera phone in the segment, the Google Pixel 4A is still the best bet.",
    "The software experience on OnePlus smartphones has been a fan favorite for a few years now. That’s because of the overall consistent and smooth performance, lag-free experience, and most importantly, the bloat-free experience. While Oxygen OS is not that close to stock Android now, the device offers a bunch of handy software features without being overwhelming with options.",
    "The OnePlus Nord CE brings the Oxygen OS experience to a new lower price point. The device runs on Oxygen OS 11 based on the Android 11 out of the box along with the May 2021 security patch. The company has confirmed the device will get two years of Android updates and three years of security updates which means you will be getting Android 13 and security updates till June 2024. However, it needs to be noted that OnePlus has become somewhat slow with software updates and fixes recently, so we wouldn’t hold our breath over this.",
    "During our testing, we got a major day-one update that fixed several bugs and made the performance a lot more consistentThe update also improved the camera and improved the overall stability.",
    "Oxygen OS brings a lot of customization features such as a system-wide dark mode, third party icon packs, accent colour, hidden space for apps and files, colour tone, icon shape and fonts. You get ambient display mode which is quite useful as well - it allows you to set your image as a “Canva” - more on this in a minute. The dark mode option under the display settings also allows you to enable dark mode on a per-app basis which means you can enable dark mode on apps which do not natively offer it.",
    "There is a dedicated Customization section under the settings menu which does bring a bunch of useful options. You can set ambient display clock style, fingerprint animations, and the cool-looking horizon light which lights up the side of the Nord CE when a notification arrives - you can choose from multiple colour options and it looks really good in the dark.",
    "Interestingly, OnePlus has added a ring/vibrate/silent button on the top of the notification area since it misses out on the alert slider. The media notifications now sit right below the notification toggles which also gives more space to the incoming notifications.",
    "You can set the accent colour to literally any colour you want with presets or you can just customize the colour you need. The Zen mode is also present if you want to stay focused for a few minutes and concentrate on a particular task. You also get a built-in screen recorder.",
    "For navigation, you get to choose from three soft keys or choose full gesture control, which gives more screen estate. In addition to the system gestures, you also get screen-off gestures for quick commands.",
    "A dedicated permission manager section displays all the permissions taken by the application installed on the phone. Parallel apps that allow you to run a second instance of the application comes in handy if you are a dual SIM user. App locker, pocket mode, and quick reply in landscape mode features are also available.",
    "The OnePlus Switch features come in handy if you are coming from any Android smartphone to the Nord CE - it transfers all the data including apps, call/text logs, and apps including data.",
    "Overall, OnePlus, as always, has done a pretty good job in the software department and the Nord CE passes with flying colors when it comes to software experience with a no-nonsense approach and bloat-free experience. There were no unnecessary notifications or any ads that were pushed during our usage time. You do get some apps pre-installed such as Amazon, Netflix, Facebook and Instagram, but they don’t fall under the bloat category.",
    "The OnePlus Nord CE provides the best software experience in its segment with its next best competitor being the Pixel 4a. Although the OnePlus Nord CE doesn’t offer the best in class hardware specs, we’d recommend this phone purely for the software experience.",
    "The OnePlus Nord CE packs a 4,500mAh battery, a jump from the 4,115mAh unit on the OnePlus Nord. While the battery size on paper is just above average, the overall battery life that we managed to get was excellent. Once fully charged, the device can easily last one full day with heavy usage and a day and a half if you are a moderate user.",
    "The average screen time during our review was always close to 6 hours and 30 minutes and the best we managed to get was 8 hours - which is nuts!. Our general usage included all-day interaction on WhatsApp, Slack, Mails, a few minutes of calls, YouTube, music streaming, gaming, and social media surfing.",
    "With the aforementioned usage, we were able to hit the bed at 11 PM with at least 20% battery left after starting the day at 8 AM. However, if you are a person who watches a lot of video content or plays extended hours of gaming, the battery life will drain faster. But, if you are not a gamer or streamer, the phone will easily get through the next day afternoon at least if not evening.",
    "We were pretty happy with the battery life on Nord CE - the Snapdragon 750G chipset also plays its part here by not being power-hungry. In case you are interested, the battery dropped by 6% after 20 minutes of Asphalt 9 gameplay.",
    "OnePlus is bundling a 30W fast charger in the box and now the charging has got a brand new name - Warp Charge 30T Plus. It takes about 60 minutes to completely charge the device with over 60% of the charging happening in the first 30 minutes.",
    "While the 30W fast charging is not the fastest when compared to the competition from Realme and iQoo, the 60-minute charging time is still respectable and the 30-minute quick charge comes in handy if you are heading out and need a quick top-up.",
    "There is no support for wireless charging, which is not a surprising factor considering the price point.",
    "The headphone jack makes a surprise return on the OnePlus Nord CE while the sole bottom-firing super linear speaker stays intact from the OnePlus Nord. Playing audio via the loudspeaker was quite good and enjoyable. It was surprisingly loud but still falls behind other dual stereo speaker setups. We did not notice much distortion even at max volume. It is very easy to block the speaker grill and muffle the audio while gaming or watching content in the landscape mode.",
    "For wireless audio, you get Bluetooth 5.1and supports aptX, aptXHD, LDAC, and AAC codecs. You also get a Dirac audio tuner which allows you to set scenario-based enhancement such as Dynamic, Movie, and Music.",
    "You also get support for an equalizer for both wired and wireless earphones. Lastly, the call quality was extremely good and the network reception was also top-notch. The microphone audio picks up was also quite good as we could access the Google Assistant hand-free on multiple occasions.",
    "First reviewed: June 2021",
    "Want to know about the latest happenings in tech? Follow TechRadar India on Twitter, Facebook and Instagram!"
  ],
  "headers": {
    "8": "OnePlus Nord CE price and availability",
    "11": "Design",
    "23": "Display",
    "31": "Performance",
    "40": "Cameras",
    "51": "Software",
    "63": "Battery",
    "70": "Audio",
    "73": "Don't buy it if..."
  },
  "links": {
    "OnePlus 9 series": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Core Edition": "https://www.techradar.com/news/exclusive-oneplus-nord-ce-design-first-look-and-how-oneplus-designed-it",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "best smartphone under Rs 30,000": "https://www.techradar.com/best/best-phones-under-rs-30000",
    "Asus 8Z": "https://www.techradar.com/news/asus-8z-price-in-india-launch-date-specs-review",
    "Poco F3": "https://www.techradar.com/reviews/xiaomi-poco-f3",
    "Xiaomi Mi 11X": "https://www.techradar.com/reviews/xiaomi-mi-11x",
    "N78 band only(SA/NSA)": "https://www.techradar.com/news/oneplus-9-series-5g-debacle-explained",
    "iQoo Z3": "https://www.techradar.com/reviews/iqoo-z3",
    "Poco X3 Pro": "https://www.techradar.com/reviews/xiaomi-poco-x3-pro",
    "Mi 11X": "https://www.techradar.com/reviews/xiaomi-mi-11x",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "Google Pixel 4A": "https://www.techradar.com/reviews/google-pixel-4a",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Realme": "https://www.techradar.com/reviews/realme-x7-pro",
    "iQoo": "https://www.techradar.com/reviews/iqoo-z3",
    "wireless earphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Twitter": "https://twitter.com/TechRadarIndia",
    "Facebook": "https://www.facebook.com/TechRadarIndia",
    "": "https://www.facebook.com/TechRadarIndia",
    "Instagram": "https://www.instagram.com/techradarindia/"
  }
}