{
  "source": "https://www.techradar.com/reviews/infinity-free",
  "title": "Infinity Free web hosting review",
  "category": "computing",
  "updated": "2021-09-09T06:38:29Z",
  "author": "mike-williams",
  "summary": "Host your site for free forever",
  "verdict": "Infinity Free is probably the best web hosting you can get for nothing and it comes with no expiration date. Its one-and-only solution includes some of the neat features you would usually expect to get with commercial-level hosting only, such as unlimited disk space, (almost) unlimited bandwidth, industry-standard cPanel and the Softaculous one-click installer.",
  "pros": [
    "Ad-free hosting",
    "cPanel included",
    "Free hosting for everyone",
    "Free subdomain",
    "One-click installer with over 400 apps",
    "Unlimited storage space"
  ],
  "cons": [
    "No email accounts",
    "Limited support options",
    "Suitable for small sites only"
  ],
  "article": [
    "Infinity Free is a US-based web hosting provider launched in 2016, and, as its name suggests, it offers free hosting services for an indeterminate period of time. We all know that not everything presented as free hosting is truly free, but Infinity Free manages to live up to its name and does that without overloading your site with ads.",
    "Besides highlighting that hosting with them is completely free (forever and ever) with unlimited disk space and bandwidth, Infinity Free fails to brief us about the company itself. From the information we were able to gather we learned that although the company was formally founded in 2016, it started providing free hosting in 2011 as a part of a passion project.",
    "Despite providing fully free services, Infinity Free is sustainable thanks to its business deal with iFastNet, whose services are marketed on Infinity Free’s official site. Therefore, if you ever feel the need to upgrade your free plan to one of the premium ones, expect to be forwarded to iFastNet’s site.",
    "Although we can’t be fully confident, Infinity Free’s data center appears to be located in Chicago (Illinois, the USA).",
    "Infinity Free’s official site is pretty plain and overrun with ads, but it is easy-to-use (partly due to its simplicity). Unfortunately, like with most free hosts, it doesn’t feature an official blog nor is it particularly active on social media sites.",
    "Infinity Free offers three shared hosting plans only, one of which is completely free-of-charge. It is titled “Infinity Free'' and it should include unlimited disk space, unlimited bandwidth (although it is limited to 50,000 daily hits), and unlimited hosting domains. It also supports 400 MySQL databases, a single FTP account, but not a single email account, and all of the above is granted with “limited server power”. Despite these limitations, at least the plan includes a free subdomain, free SSL certificates for all your domains, and a Softaculous auto-installer with over 400 handy apps.",
    "If you want more than a handful of features and are ready to pay the cost, check out the additional premium plans provided by iFastNet. “Super Premium” goes for $3.99 per month and will considerably boost the number of resources, while “Ultimate Premium” promises unlimited hosting for the price of $6.90 per month.",
    "Given that Infinity Free’s services are free, there’s no real reason for them to provide a money-back guarantee.",
    "However, if you purchase one of iFastNet’s packages, you can get a refund within seven days, no questions asked. As for payment methods, they accept PayPal, WorldPay, and 2CheckOut.",
    "To start your free hosting trip, tap the “Sign Up Now” button, insert your email address, think up a password, go through terms of service and deny being a robot (sorry, robots). After verifying your email, it is time to create your hosting account through three simple steps.",
    "The first step includes choosing a domain name and there you can use a free subdomain (seven of them are available as we write) or a domain you already own and point it to Infinity Free nameservers. If you decide on a second option but are not sure how it all works, there is an in-depth guide describing every step of the way (with screenshots and everything).",
    "After this, your account username will be generated at random, and the same goes for your account password if you (for whatever reason) decided to leave the space empty. In any case, your account will be created within seconds making this one of the simplest and most straightforward experiences of this kind. That being said, you might need to wait for up to 72 hours for your hosting account to “start working everywhere” and your newly created site to become accessible.",
    "Your account UI is easy-to-use and provides access to a simplified version of the control panel which is a long-reigning king of user-friendliness among its many competitors, a Linux-based cPanel. Although you won’t get all the tools you would with a regular cPanel, Infinity Free’s version will cover all the essentials including online FTP manager, MySQL database control, phpMyAdmin, options for PHP, DNS, cron jobs, error pages, backups, and more.",
    "If you want to utilize some of the most useful apps out there (such as WordPress), you can have them in working order within a few clicks thanks to the Softaculous one-click app installer.",
    "Having in mind that we are testing a free service, we didn’t exactly expect to be blown away by neither speed nor uptime performance. First, we experimented with the speed of Infinity Free’s site via GTmetrix (our trusted tool) and got pleasantly surprised by near-perfect results topped by GTmetrix’s grade A (98%). The test revealed that it took mere 1.4 seconds to fully load the site, which is not only better than the average score but better even than the one recommended for an ideal user experience.",
    "After this, we checked the results of our uptime test run via UptimeRobot on Infinity Free’s official site for two weeks straight. In a similar fashion with the speed test, this one left us just as impressed. The results show no downtime at all and only a few minor oscillations in response speed painted a picture of reliability.",
    "As you might have guessed, customer support provided by a free host is almost always nothing to write home about. Such is the case with Infinity Free, so don’t expect to get one-on-one consultation via telephone, live chat, or email. Although there are a few email addresses available for contact, it is stated that they are not meant for support and that all of your questions are going to be left unanswered.",
    "The one alternative you are left with is to seek help on their community forum, which is actually an amazing option to have since most of the questions there (if not all) are answered by fellow users.",
    "The other one is to consult Infinity Free’s comprehensive knowledgebase that contains, among others, a novice-friendly category called “Getting Started”. There are ten categories in total and over 80 in-depth guides that cover everything from managing your domain and DNS to making your SSL certificate work with WordPress.",
    "A nice alternative to Infinity Free and one of the better free hosting providers out there is India-based GoogieHost (not to be confused with Googlehost). It comes a bit stronger in terms of features since their free plan includes CloudFlare, an industry-standard cPanel, a user-friendly website builder, and up to two business emails (Infinity Free currently provides none). However, in terms of security and stability Infinity Free wins the day.",
    "FreeHostingNoAds is another noteworthy alternative to Infinity Free and it delivers exactly what its name implies - free hosting without ads. What is more, it also includes a drag-and-drop website builder, while Infinity Free doesn’t. However, unlike Infinity Free that puts no limits on disk space and bandwidth, with FreeHostingNoAds both of them are severely limited.",
    "If you are not looking exclusively for free web hosting, there are quite a few budget-friendly hosts able to cover all the basics and more while providing round-the-clock customer support. Some of the fan-favorites are HostGator, Bluehost, and DreamHost, and all of them offer a wide variety of services and hosting packages, ranging from simple shared and flexible cloud setups to VPS and dedicated server hosting. They may not be completely free-of-charge, but as with most things in life (web hosting included) you get what you pay for.",
    "Are you trying to find a free host for a blog, small portfolio, or any other personal project on a similar scale? If the answer is yes, then Infinity Free is worth a look. With user-friendly cPanel, Softaculous, and easy-to-follow how-tos you’ll be able to build a captivating website without too much trouble.",
    "However, if you have bigger dreams for your website and don’t mind spending a few bucks each month to make these dreams come true, check out hosts such as HostGator and Bluehost."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "14": "Speed and experience",
    "16": "Support",
    "19": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Infinity Free": "https://infinityfree.net/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "free hosting": "https://www.techradar.com/web-hosting/best-free-web-hosting",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "SSL certificates": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Super Premium": "https://infinityfree.net/premium/",
    "Ultimate Premium": "https://infinityfree.net/premium/",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "GoogieHost": "https://googiehost.com/",
    "CloudFlare": "https://www.techradar.com/reviews/cloudflare",
    "FreeHostingNoAds": "https://www.techradar.com/reviews/free-web-hosting-no-ads",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "DreamHost": "https://www.techradar.com/reviews/dreamhost"
  }
}