{
  "source": "https://www.techradar.com/reviews/razer-huntsman-v2",
  "title": "Razer Huntsman V2 review",
  "category": "computing",
  "updated": "2021-09-24T20:35:07Z",
  "author": "john-loeffler",
  "summary": "The Razer Huntsman V2 offers quieter comfort – at a price",
  "verdict": "The Razer Huntsman V2 optical gaming keyboard is a joy to type and game on, while also offering a quieter mechanical experience for anyone who will use it around those less appreciative of the clickity-clacks standard to mechanical models. And though it does feature an 8,000 Hz polling rate, this feature isn't as relevant on a keyboard as it is on a mouse, and the price might put the Huntsman V2 out of reach.",
  "pros": [
    "Comfortable keycaps",
    "8,000Hz polling rate",
    "Plush wrist rest"
  ],
  "cons": [
    "Expensive",
    "No USB passthrough",
    "No macro keys"
  ],
  "article": [
    "The Razer Huntsman V2 optical gaming keyboard is an absolute joy to type on, and I should know: I type for a living.",
    "We writers enjoy how a good, noisy keyboard can make any home office sound like an old-timey newsroom, but we also understand that your coworkers or family might not be so keen on the idea. If that's the case, the Huntsman V2 is the best of both worlds: It gives you the tactile satisfaction of the best mechanical keyboards while sparing the ears and sanity of those around you.",
    "That said, if you are offended at the idea of a quiet mechanical keyboard, you do have the option of getting it with Clicky (Purple) key switches for $10 less (about £10 / AU$15) - so there's something for everyone here.",
    "The Huntsman V2 doesn't have as many features as the Razer Huntsman V2 Analog though. While the two models look very similar, the mechanical version lacks the funky, RGB LED strip around the wrist rest carried by its analog counterpart. (The wrist rest is still great, like a fluffy pillow for our hands, and we love it anyway.) The Huntsman V2 does have per-key RGB backlighting as well, so you might not get as much RGB as you'd like, but this is Razer: You're still getting a lot of RGB.",
    "It also doesn't have USB passthrough, which we definitely liked about the Huntsman V2 Analog. This plus side: This omission means you have a single braided USB cable rather than the two – one USB Type-A and one USB Type-C – on the Huntsman V2 Analog.",
    "The dedicated volume knob and media control buttons return, which is a nice feature to have, but as far as extra buttons go, that's it for the Huntsman V2. While you can record and program macros using the Razer Synapse software, it requires using keyboard shortcuts rather than having a dedicated button you can use like those found on some of its rivals.",
    "What the Razer Huntsman V2 does have that a lot of other keyboards don't is an 8,000Hz polling rate, like the Razer Viper 8K gaming mouse. That said, this feature may seem like a nice thing to have, but it's hardly even noticeable while you're typing away.",
    "With a mouse, you can see the cursor glide across a screen, and the higher the polling rate, the more often the mouse's position on screen gets updated (assuming you have a monitor with a fast-enough refresh rate to take advantage of those extra data points).",
    "This means that the higher a mouse's polling rate, the smoother its motion across the screen will appear. This is a very legitimate difference, and so an 8,000Hz polling rate in a mouse absolutely makes sense. With a keyboard? Honestly, not at all.",
    "Look, I'm a professional typist who's so familiar with a keyboard that I can write a thousand words in under an hour and never once look down at the keys I'm tapping away at. And even I'm not a fast-enough typists that I'm outpacing the standard 1,000Hz keyboard polling rate.",
    "Don't believe me? Let's do the math: The world-record for words per minute is 216 (set in 1946 by Stella Pajunas on an IBM electric typewriter), which translates to about 54,000 keystrokes an hour, 900 keystrokes a minute, or 15 keystrokes a second.",
    "A Hertz is a measure of how many times something is cycled every second, so a standard keyboard is polling about 67 times per keystroke. So, eight times faster gives you 536 polls per keystroke versus 67. If having 536 opportunities to capture a keystroke seems meaningful, this is definitely the keyboard for you. Your eyes still won't notice the difference though, and you probably aren't even typing at a world-record pace.",
    "Fortunately you aren't paying extra for that polling rate. The Razer Huntsman V2 Optical is a good bit cheaper than the Huntsman V2 Analog, and it's available now on Razer's website for $199 / £199 / about AU$275 for the Linear Red Switch model, and $189 / £189 / about AU$260 for the Clicky Purple Switch model.",
    "There's also a Tenkeyless option available as well, for $159 / £159 / about AU$210 and $149 / £149 / about AU$205 for the Linear Red Switch and the Clicky Purple Switch models, respectively."
  ],
  "headers": {
    "0": "Razer Huntsman V2 Optical two-minute review",
    "14": "Don't buy if..."
  },
  "links": {
    "best mechanical keyboards": "https://www.techradar.com/news/best-mechanical-keyboards",
    "Razer Huntsman V2 Analog": "https://www.techradar.com/reviews/razer-huntsman-v2-analog",
    "Razer Viper 8K": "https://www.techradar.com/reviews/razer-viper-8k-review",
    "world-record for words per minute is 216": "https://www.ratatype.com/learn/average-typing-speed/#:~:text=The%20highest%20typing%20speed%20ever,using%20a%20Dvorak%20simplified%20keyboard.",
    "translates": "https://www.coleman-data.com/wpm-to-kph-calculator/"
  }
}