{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-chromebook-2",
  "title": "Hands on: Samsung Galaxy Chromebook 2 review",
  "category": "computing",
  "updated": "2021-05-06T16:52:56Z",
  "author": "bill-thomas",
  "summary": "Cheaper. Better. Still shiny.",
  "verdict": "The Samsung Galaxy Chromebook 2 improves on the original by culling the unnecessary features and hardware, which makes the laptop make more sense as a Chromebook.",
  "pros": [
    "Beautiful design",
    "Gorgeous display",
    "Comfy keyboard",
    "Affordable"
  ],
  "cons": [
    "No USB-A",
    "No included pen"
  ],
  "article": [
    "At CES 2020, Samsung finally launched a Chromebook that was worthy of its Galaxy name. The original Samsung Galaxy Chromebook was an AMOLED-equipped beauty, making a Chromebook into a luxury product. However, because of its luxury status, it was priced way too high to be worth a recommendation to anyone other than avid Galaxy fans.",
    "The Samsung Galaxy Chromebook 2 at CES 2021, however, bucks this trend by bringing everything that made the original great, but bringing the price down and battery power up, by going with a QLED panel instead of AMOLED, and limiting the processor to a Core i3.",
    "That sounds like Samsung has crippled its flagship processor in the name of attainability, but really these cuts make the Samsung Galaxy Chromebook 2 shine in its new price category, rather than how the first Samsung Galaxy Chromebook felt way out of its league last year.",
    "The Samsung Galaxy Chromebook 2 is coming Q1 2021 and will start at $549, which is far less expensive than the original Samsung Galaxy Chromebook, which launched last year at $999.",
    "Where the original Galaxy Chromebook was a hard sell at that price tag, especially when you took the very short battery life into consideration, this one is much more approachable.",
    "That starting price will net you a very Chromebook-y configuration of an Intel Celeron 5205U, 4GB of RAM and 64GB of eMMC storage. That doesn't seem like a lot, but remember that Chromebooks don't really need a Core i7 to get the job done. If you do want more horsepower, you can bump that price up to $699 to get a Samsung Galaxy Chromebook 2 with a 10th-gen Intel Core i3, 8GB of RAM and 128GB of storage.",
    "At $699 at the top-end, the value of the Samsung Galaxy Chromebook 2 has entirely shifted, and is now in the running for one of the best Chromebooks, but we'll have to wait until we get it in-house for a full review before we actually make that decision.",
    "The Samsung Galaxy Chromebook 2 largely retains the same design as the original – and that's the highest praise we can give it. While the first Samsung Galaxy Chromebook was extremely expensive, we thought it was an absolute work of art, and that really hasn't changed.",
    "The aluminum chassis has a lovely red colorway, which will be immediately striking whenever you whip it out of your bag at your local coffee shop – when we're actually able to sit in local coffee shops again, anyway.",
    "Laptops have a tendency to all go with a gray color option in the name of professionalism, a move that is largely overrated and needs to end. There is still a silver colorway available, because of course there is, but when such a striking red laptop is available, we don't know why anyone would pick the version that looks like every other boring laptop on the market.",
    "There are a few changes here, though. The biggest of these is the shift away from the 4K AMOLED display in the Samsung Galaxy Chromebook to a 13.3-inch FHD QLED panel, which we're told is inspired by Samsung's TVs.",
    "Sure, that's a much lower resolution than we got last year, but we're talking about a 13.3-inch display. At this screen size, 4K is totally unnecessary, and just serves to drain battery faster in the name of a fancier spec sheet.",
    "To our eyes, the Galaxy Chromebook 2's display is still one of the best Chromebook displays we've ever seen. And while we don't have stats on how bright or color accurate the screen actually is, it's more than bright and colorful enough to consume all your favorite media on. The fact that such a lovely QLED panel is included in a Chromebook that is this affordable is a triumph for Samsung.",
    "And, at the end of the day, if you're looking for a laptop that has a display fit for content creation, you probably shouldn't be looking at a Chromebook either way.",
    "The keyboard feels much the same as it did last year, which is to say it's extremely comfortable to type on. Spacing is on point and while the travel isn't too deep, bottoming out doesn't feel too terrible.",
    "The Samsung Galaxy Chromebook 2 is still a 2-in-1, which means it'll still be able to flip into a tablet when you need it to, which makes it so much more compelling of a media consumption device. Unfortunately, Samsung isn't including a pen with the Galaxy Chromebook 2, though you will be able to buy it separately.",
    "As far as ports go, you're still getting two USB-C ports and a microSD card reader. We'd love to see a USB-A port, but such is the way laptops have been going for a while.",
    "We were able to go hands-on with the Samsung Galaxy Chromebook 2 equipped with an Intel Core i3 processor, 8GB of RAM and 128GB of storage. Now, while we weren't able to run robust benchmarks on it – such that benchmarks are even able to be run on a Chromebook – it was more than responsive enough to get the job done.",
    "However, that's not where Samsung is really claiming to have made huge improvements, anyway.",
    "With the Samsung Galaxy Chromebook 2, Samsung is claiming up to 14 hours of battery life on a single charge, which is a huge improvement over the original laptop. According to our sister site LaptopMag, the Samsung Galaxy Chromebook only lasted 5 hours and 56 minutes.",
    "If Samsung's battery life claims are accurate – which remains to be seen – the Samsung Galaxy Chromebook 2 will last nearly three times as long, which will see it up there with existing Chromebooks like the Google Pixelbook Go.",
    "Just like the first one, the Samsung Galaxy Chromebook 2 is one of the most beautiful Chromebooks we've ever seen. But that was always going to happen.",
    "What makes the sequel so much better than the original is that Samsung didn't feel the need to stuff it so full of high-end features and hardware that it no longer made sense as a Chromebook.",
    "With the lower price and longer battery life, the Samsung Galaxy Chromebook 2 has a chance to become one of the best Chromebooks on the market today, and we look forward to getting it in-house to see everything it can do."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "17": "Performance",
    "21": "Early verdict"
  },
  "links": {
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Samsung Galaxy Chromebook": "https://www.techradar.com/reviews/samsung-galaxy-chromebook",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Google Pixelbook Go": "https://www.techradar.com/reviews/google-pixelbook-go-review"
  }
}