{
  "source": "https://www.techradar.com/reviews/fimi-x8-mini",
  "title": "Fimi X8 Mini review",
  "category": "cameras",
  "updated": "2021-09-09T16:46:15Z",
  "author": "sam-kieldsen",
  "summary": "A tiny 4K drone that comes close to matching the DJI Mini 2",
  "verdict": "In a world without the DJI Mini 2, the Fimi X8 Mini might be the perfect entry-level 4K drone. Not only is it easily portable, it’s lightweight enough to fall into the magic sub-250g category, it flies well in normal weather conditions, has excellent battery life and produces decent-looking videos and photos. That said, DJI’s offering feels more rounded, more feature-rich and just generally better put together than Fimi’s – and in our opinion it’s worth the extra outlay.",
  "pros": [
    "Slightly cheaper than DJI rivals",
    "Easy to fly",
    "Under 250g"
  ],
  "cons": [
    "DJI Mini 2 is more polished",
    "No front-facing collision sensors"
  ],
  "article": [
    "The Fimi X8 Mini is an entry-level drone with some serious capabilities. While it’s relatively affordable, beautifully compact and lightweight enough to be classed alongside toy quadcopters, it’s no child’s plaything: the camera supports 4K video and the battery supports 30 minutes of flight – over a range of up to 8km, no less.",
    "With a simple but effective companion app and well-designed remote controller, Fimi has created a strong all-round package here. This drone can be flown in blustery conditions, grabbing strikingly sharp and stable footage as it does so, and its folding design means it can be tossed in a small backpack or handbag every time you head out for the day – just in case you happen across something that deserves to be photographed or videoed from the air. It can also be charged from any USB port, thanks to its battery’s USB Type-C port.",
    "For around £350, it’s a great deal – but in a world where the DJI Mini 2 exists, we’re not sure it’s the best deal for a sub-250g drone. The Mini 2 is the best entry-level drone around, and for our money has the X8 Mini beat in every category that matters: build quality, camera performance and flight safety.",
    "It’s a fine margin, to be fair – the X8 Mini doesn’t have any glaring weaknesses, except perhaps the lack of forward-facing anti-collision detectors – but we think the Mini 2 is just a stronger performer, and that makes it still the better deal even at its slightly higher asking price.",
    "The Fimi X8 Mini is available to buy now through Fimi's official store for $369 (around £268 / AU$500). You can also buy it through importers like Banggood or via eBay, but the pricing varies quite wildly depending on where you buy it.",
    "It’s available in a variety of packages, some with memory cards included. It’s worth nothing that if you want it to come in at under 250g you’ll need to opt for the version with the Pro battery – the Standard battery edition comes in at little over 250g.",
    "All editions come with the remote controller, four spare propellers, a gimbal cover, three cables for attaching mobile devices to the controller and a USB Type-C cable for charging.",
    "One of the main selling points of the Fimi X8 Mini is its sub-250g weight. According to our digital scales, it’s 244g with a memory card inside – which means that in some regions (like the US) it won't need registering.",
    "If you're in the UK, though, bear in mind that all drones with a camera (regardless of their weight) now need to be registered with the Civil Aviation Authority (CAA). You'll also need to clearly label the drone with your operator ID number before use. An operator ID costs £9, lasts for a year and a single ID can be applied to any number of drones in your possession. As non-toy drones go, this is about as friction-free as it gets.",
    "The overall look – four folding rotor arms, removable battery at the back, a gimbal-mounted camera just below the nose – is strongly reminiscent of the DJI Mavic Mini and DJI Mini 2, the much-loved sub-250g drones that the Fimi X8 Mini has clearly been designed to compete with. The X8 Mini folds down to a trim 145 x 85 x 56mm, compared to the DJI Mini 2’s 138 x 81 x 58mm, so it’s just as easy to carry – even if it does feel markedly flimsier and cheaper than its sturdily-built DJI rival.",
    "The battery can be charged directly via a USB Type-C cable, and because the USB-C port is located on the battery itself, it’ll charge whether it’s mounted in the drone or not – a nice touch. On the drone itself there’s a microSD card slot for storage and a micro USB port (used only for transferring images and videos direct from the drone’s card to a computer).",
    "The controller is a lot more solidly constructed than the drone, feels fine in your hands, and boasts some clever (if not entirely original) design touches: the thumb sticks can be removed and stored in little recesses on the bottom edge, while the entire thing can be stretched out to accommodate pretty much any size of smartphone (and even some smaller tablets). It comes with adapters for Lightning, USB-C and micro USB devices, and just like the drone is charged via USB-C. With the thumb sticks and any devices removed, it measures 165 x 89 x 47mm and weighs 260g: nicely portable, we think.",
    "The controller has a simple control layout. Under the left stick is the power button and a four-LED battery indicator, while under the right stick you’ll find a return-to-home button: tap this if you lose sight of the drone or it becomes disconnected from your phone and it’ll fly back to its take-off point. On top, your forefingers have easy access to a wheel that adjusts the camera tilt, a shutter button and a button that toggles between still image and video capture.",
    "Fimi claims the X8 Mini has a theoretical transmission range of up to 8km from the controller. That’s a little less than the 10km offered by the DJI Mini 2, but it’s all academic really: many countries' regulations state that a drone has to remain visible to the pilot while they’re flying it, so anything beyond a few hundred meters is breaking the law.",
    "All we can say is that during our review process the controller, our iPhone and the X8 Mini maintained a solid connection roughly 99 percent of the time, only losing it at one point when the drone was a dozen or so meters away (suggesting this drop had nothing to do with range). It has real-time GPS tracking to ensure it can return to home in the event of a signal drop, and the app uses no-fly zone geofencing to prevent take-off close to airports and other restricted areas.",
    "What it doesn’t have are forward-facing anti-collision sensors. The X8 Mini has downward-facing sensors, which aid take-off and landing, but launch it straight into a wall or tree and it won’t do be able to stop itself.",
    "It does offer the same level of wind resistance as the Mini 2, though: level 5, which means it can withstand a “fresh breeze” of 8.5-10.5m/s. In practice, we found it pretty stable, even on a blustery day on a coastal clifftop where the wind speed definitely exceeded that.",
    "It did tilt too much for the camera’s gimbal to fully compensate, but in terms of actual flight stability we had no real problems getting it where we wanted it to go. It’s a nippy, responsive flyer that controls nicely and can move at a fair clip when pushed: up to about 16m/s in fact (or faster with the wind behind it).",
    "With up to 30 minutes of flight time on a full charge (this will vary depending on wind speed and other factors), we have no complaints about battery life either. You’ll get a warning through the app when power is ebbing, and the aforementioned return-to-home button can be tapped to take the leg (or thumb-) work out of the retrieval process.",
    "The Fimi Navi Mini app is an essential part of the flight process, and we’re happy to report that, while it’s a little rough around the edges in comparison to DJI’s imperious Fly app, it does everything it needs to in a reasonably tidy fashion. The UI is clean and simple, doesn’t feel loaded with extraneous options and confusing menus, and the app never crashed on us in the middle of a flight.",
    "It even offers a 5.8GHz Wi-Fi flight mode that lets you ditch the hardware controller and create a direct connection between your phone and the X8 Mini, flying it using touchscreen controls. While this is a much less comfortable way to control things (and cuts the range to just 100m), it’s handy to have as a backup option.",
    "The app includes a handful of automatic flight modes, which let you set a tracking point by dragging a box around an on-screen object (you, for example) and then have the drone fly an automated route while keeping said object in the centre of its frame. We’ve included the spiral mode in our sample video below (note that we’ve sped it up in post-production). What the drone won’t do is, say, follow behind you while you ride a bike or jetski by tracking the controller location.",
    "The Fimi X8 Mini is no slouch in the imaging department. Its 12MP Sony CMOS sensor and 3-axis mechanical gimbal form a solid foundation for aerial video and photography, enabling the capture of 4K footage at 24/25/30fps, 2.7K at 24/25/30/50/60fps, 1080p at 24/25/30/50/60/90fps and 720p at 100/120fps.",
    "In addition to standard AVC/H.264 encoding, HEVC/H.265 encoding is supported (great for owners with beefy computers), and the option to shoot with a flat F-log profile gives color graders plenty to work with in post-production.",
    "As you can see from our sample footage above, 4K videos exhibit fine detail and benefit from the drone’s aerial stability, but are a bit lacking when it comes to dynamic range – no surprise given the sensor’s tiny size.",
    "To give you an idea of the in-camera processing, the first few clips in our sample were shot in the standard color profile, while the last few were captured in F-log (with no color grading from us).",
    "Photos can be captured at 12MP or 8MP resolution in JPEG and/or DNG raw formats. Again, there’s a lack of dynamic range 'punch' in them, but this could be mitigated in post-production. For a tiny camera on a tiny drone, we think the results are acceptable – if not perhaps quite as impressive as the DJI Mini 2’s."
  ],
  "headers": {
    "4": "Fimi X8 Mini price and release date",
    "7": "Design and controller",
    "13": "Features and flight",
    "22": "Video and image quality",
    "27": "Don't buy it if..."
  },
  "links": {
    "DJI Mavic Mini": "https://www.techradar.com/reviews/dji-mavic-mini",
    "DJI Mini 2": "https://www.techradar.com/reviews/dji-mini-2"
  }
}