{
  "source": "https://www.techradar.com/reviews/dji-fpv-drone",
  "title": "DJI FPV drone review",
  "category": "cameras",
  "updated": "2021-08-25T11:53:13Z",
  "author": "james-abbott",
  "summary": "A fun but flawed FPV drone for beginners",
  "verdict": "The DJI FPV is fun in capital letters – its first-person view provides an incredibly immersive flying experience thanks to the amazing DJI Goggles, not to mention equally compelling video footage from the forward-facing camera. But it’s not all plain sailing. With a real-world flight time of around 10 minutes, high cost when you factor in essential accessories and the difficulty in pulling off true FPV acrobatics, it's significantly more complex and niche than DJI's other drones.",
  "pros": [
    "A huge amount of fun to fly",
    "Easy to fly for an FPV drone",
    "Goggles offer great image quality",
    "Solid transmission"
  ],
  "cons": [
    "Front props visible in footage",
    "Stills photography severely limited",
    "'Spotter' needed when flying outdoors"
  ],
  "article": [
    "The DJI FPV is an intriguing new breed of drone. FPV (or First-Person View) drones are fast, fun and offer the most immersive flying experience possible, thanks to the inclusion of video goggles that give you a bird's-eye view from the sky. The trouble is, they're usually custom or self-built and not the easiest drones to fly – until now.",
    "Thanks to DJI, anyone with a fair amount of pocket money to spend can now experience the exciting world of FPV drones with the DJI FPV. It’s a huge amount of fun to fly, but how long will the novelty last? And is it as compelling as other drones like the DJI Mavic series?",
    "While the DJI FPV comes pretty close to bringing the user-friendliness of the Mavic series to a new category of flying machine, it doesn't quite match their polish, convenience or value for money.",
    "It's certainly a neat, consumer-level FPV drone that’s easy to fly in the 'Normal' mode and provides an accessible entry point for beginners. More experienced FPV pilots will also appreciate the ability to flex their skills and capture high-quality footage in 'Manual' mode.",
    "The DJI FPV is mainly aimed at shooting immersive FPV 4K video, and there is the ability to shoot still images at a basic level – but you certainly shouldn’t buy this drone for that reason. The advantage of shooting video with an FPV drone is that you can achieve the exhilarating first-person view that almost makes the viewer feel like they’re flying.",
    "The DJI FPV is capable of shooting 4K video up to 60fps and can also shoot 1080p at 120fps, which for the most part looks great. But even with lens correction turned on, the camera still captures the front propellers in video and stills. Another negative is that the battery only lasts for around 10 minutes in real-world situations, so you have to shoot fast.",
    "The great thing about the DJI FPV is that it works out of the box as you’d expect. Just charge everything up, including the DJI FPV Goggles V2, install the DJI Fly app, update the firmware and you’re ready to go. Combine this with the relative ease of flight in 'Normal' mode and the DJI FPV quickly becomes an enticing proposition. But unfortunately, it’s not all good news.",
    "Not only does the drone come in at a high cost once you factor in all the additional accessories you’ll need to get the best from the drone (more on that later), it's also much more limited compared to a standard drone in terms of both features and basic flying.",
    "One of the problems with flying the DJI FPV is that you’ll be wearing FPV goggles. This means that as well as following all the relevant drone laws in your country (see the link below for more on that), you’ll also need to have an observer standing next to you who can maintain visual line of sight of the drone while it’s in the air.",
    "It’s not the end of the world, but it does mean that when flying outdoors you can never do it alone – you’ll always need to have someone with you acting as an observer. And that's symbolic of what is a fun, but ultimately niche, flying experience.",
    "You can buy the DJI FPV right now in a standard bundle, along with various optional accessories. The standard DJI FPV Combo pack includes the drone, remote controller, DJI FPV Goggles V2 and one battery for $1,299 / £1,249 / AU$2,099.",
    "DJI is also offering a Fly More Kit, although this one differs from its usual Fly More bundles. Rather than being a pricier bundle that includes the drone and some extra batteries, it simply lets you buy two extra batteries and a dedicated charging hub for $299 / £259 / AU$429.",
    "There's also the optional Motion Controller, which steers the drone based on the movements of your hand, and which you can buy separately for $199 / £139 / AU$229.",
    "This all adds up to quite an investment compared to more affordable models in the existing Mavic series – but as we'll see, the DJI FPV offers a flying experience that's quite unlike any other drone.",
    "In recent years, DJI’s focus has been on its Mavic line of drones, which all feature a similar folding design. The DJI FPV is different – while it's a small drone, the motor arms are fixed and the upright body makes it appear much larger than it is.",
    "The main body sports a typical quadcopter design which, excluding the motor arms, is comparable in size to the DJI Mavic Air 2. Although with a take-off weight of approximately 795g, the DJI FPV is only marginally lighter than the DJI Mavic 2 Pro.",
    "The DJI FPV isn’t large or heavy, but that fixed design means that buying a bag or case specifically for the FPV, controllers and DJI Goggles would be a good idea, since they don’t fit into regular camera bags well at all. The DJI Goggles Carry More Backpack is one option and costs $119 / £109 / AU$169. But this unfortunately isn't included with the DJI Fly More Kit, which only includes two extra batteries and a charging hub.",
    "Since this is an FPV drone, the gimbal operates only on the tilt (vertical) axis. Image stabilization, taken from the DJI Osmo Action, takes care of keeping video footage smooth. The DJI FPV Goggles V2 come with a battery that attaches to a cable and can be stored in your pocket during use.",
    "The goggles provide reliable long-distance, low-latency transmission which never once faltered during our testing. The single screen resolution of 1440x810 provides a beautifully clear image from the camera, too.",
    "The view is so large, though, that when reading flight information you have to look to the sides of the screen, which can be tricky. Also, changing the camera and flight settings in the goggles takes getting used to as it’s not as easy as using a phone cradled on a controller.",
    "Since the drone is geared towards the DJI FPV Goggles V2, the new DJI FPV Controller V2 doesn’t have a phone cradle for attaching a phone. This is unsurprising because you will always get the best experience from FPV drones when flown wearing goggles, as opposed to trying to view the camera feed on a phone or tablet. But it might have been a nice option for those wanting to use the DJI FPV as a traditional drone.",
    "The controller features a minimal design and large buttons that can be easily controlled by feel when flying the drone and using the goggles; you just have to memorize the button positions and six buttons, which include a customizable custom button and a dial for controlling the camera angle. The control sticks screw into the controls and can be conveniently stored in the controller handles when not in use.",
    "Unlike self- or custom-build FPV drones, the DJI FPV offers no real ability for owners to repair damage themselves if they happen to crash the drone. The drone must be sent to DJI for repair and even with DJI Care Refresh, crashing the FPV remains expensive when all you might need is a new motor arm, for example.",
    "DJI Care Refresh costs $199 / £189 / AU$319 for one year and provides up to two replacement drones in that year – the first costs an additional $259 / £249 / AU$419, and the second a further $279 / £269 / AU$469.",
    "You can, of course, purchase new propellors and replacement accessories including the camera, as well as the drone itself and controller separately, but at $739 / £659 /AU$1139 for just the drone, it’s an expensive replacement. With crash damage a risk, purchasing DJI Care Refresh would be prudent, but this adds to the cost of the overall package.",
    "To put all of this into context, if you were to buy the FPV Combo, the Fly More Bundle, the DJI Goggles Carry More Backpack and one year of DJI Care refresh, the seemingly attractive cost of the FPV Combo at $1,299 / £1,249 / AU$2,099 suddenly soars to a whopping $1,916 / £1,806 / AU$3,016 when you add on what can only be called essential accessories. That's only marginally less than a DJI Phantom 4 Pro V2.0 and official Phantom backpack.",
    "Traditional FPV drones are typically self-build and racing models that are much more difficult to fly, and therefore easier to crash, than consumer-level drones. In creating the FPV, DJI has used its expertise from the Mavic series to produce a drone that has flight modes that are suitable for both beginners and more experienced pilots.",
    "When you see ‘suitable for beginners’ mentioned with regards to the DJI FPV, this means FPV beginners rather than first-time drone users. If you’ve never flown a drone before, it’s highly recommended that you try a standard drone model first to get used to the controls and basic flight maneuvers.",
    "'Normal' mode is the one you will naturally start with, since this uses GPS positioning and takes advantage of the DJI FPV's front and bottom visual positioning sensors. The drone behaves much like other DJI drones in this mode and will hover in position when the controls are released.",
    "But there is one key difference between the DJI FPV and the company's other drones. While the Mavic series can automatically stop when the sensors detect an obstacle, the FPV will simply slow down and alert you to the presence of danger – you must adjust flight yourself to avoid a collision. So, even in 'Normal' mode, you still need to take a great amount of care when flying the DJI FPV.",
    "Manual mode is designed for use by more experienced FPV pilots, since it has no GPS and the collision sensors are turned off. This is so experienced FPV pilots who require the ability to perform aerial stunts and fly through tight spaces at speed can do this. This mode isn’t for the inexperienced and or the faint-hearted. Even experienced standard drone pilots will have a steep learning curve with this mode.",
    "Sport mode is a hybrid of the 'Normal' and 'Manual' modes, offering some of the maneuverability of the latter with some of the safety features of the former. Just to give you a flavor of the different modes in terms of speed, 'Manual' mode is capable of up to 87mph (0-62mph in two seconds), 'Sport' mode can reach speeds of up to 60mph, while 'Normal' mode is a much more modest 33mph.",
    "The DJI FPV isn’t particularly feature-packed compared to DJI’s usual offerings – there are no automated flying modes, for example. And alongside the flight modes aimed at users of all levels of drone flying ability, the USP of the drone relies heavily on the FPV element and its ease of use compared to traditional FPV drones.",
    "The DJI FPV is advertised as being able to fly for up to 20 minutes, but this is at a speed of 25mph in windless conditions, so unlikely in reality. Flight time, in real terms, in our tests was around 10 minutes per battery and will always ultimately depend on conditions. But in context, this is still much better battery life than standard FPV drones.",
    "While the DJI FPV is arguably the most fun DJI drone to fly, its video and stills functionality is limited compared to Mavic and Phantom series drones. Still, the video capabilities on offer are still impressive for an FPV drone.",
    "The DJI FPV features a 12MP 1/2.3-inch CMOS sensor and the camera offers a 14.66mm equivalent lens with a 150-degree field of view and a fixed f/2.8 aperture. The fixed focus range is said to be from 0.6m to infinity, which means that everything in shot is in focus – and this certainly appears to be the case.",
    "There's enough here to satisfy both amateur and professional videographers. The camera is capable of shooting immersive video in 4K at 50/60fps and 1080p at 50/60/100/120fps, which provides a huge amount of cinematic and creative scope. Plus, video footage can be captured in Standard and D-Cinelike color profiles at a bitrate of up to 120Mbps.",
    "Overall, the 4K and 1080p video is overall just what you’d expect from a DJI drone – aside from the camera capturing the front propellers at times, even when the lens correction is turned on. It makes sense to have the latter switched on, because it removes the barrel/fisheye distortion the lens otherwise creates, but you will need to crop some aerial video and stills to remove the propellers. If you leave the lens correction off you will always have to crop.",
    "Stills photography can also be captured, and all it takes is a long press of the shutter button on the remote to switch between stills and video. Photography capabilities are severely limited, though, and it’s safe to say that the DJI FPV is not a drone that you would ever use for shooting stills specifically.",
    "If this is important to you and you don’t already own a different drone that’s more suited to stills photography, then the DJI FPV probably isn't the drone for you.",
    "When shooting stills you can only shoot in either 'Auto' or 'Manual' modes and capture JPEGs. Shooting in raw is not available, and neither are any automated shooting modes for either stills or video. This drone is ultimately for capturing forward-facing FPV video.",
    "One issue when shooting stills or even video in a hover is that, when there’s a side wind, the drone will naturally tilt to the side to hold position. Since there’s no gimbal movement on the horizontal axis, your still images will be taken at an angle (see above). This is again another difference between the DJI FPV and the Mavic series, which use their gimbals to account for this tilt and level the camera."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "DJI FPV release date and price",
    "14": "Design, controller and goggles",
    "26": "Features and flight",
    "34": "Video and photo quality",
    "42": "Don't buy it if..."
  },
  "links": {
    "DJI Mavic Air 2": "https://www.techradar.com/reviews/dji-mavic-air-2-review",
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review",
    "DJI Phantom 4 Pro V2.0": "https://www.techradar.com/reviews/dji-phantom-4-pro-v20"
  }
}