{
  "source": "https://www.techradar.com/reviews/ifit-nordictrack-s22i-studio-cycle",
  "title": "iFit NordicTrack S22i Studio Cycle review",
  "category": "fitness",
  "updated": "2021-03-02T15:51:00Z",
  "author": "daryl-baxter",
  "summary": "A fantastic all-in-one design that offers a great outdoor experience at home",
  "verdict": "The NordicTrack S22i is one of the best home exercise bikes we’ve tried to date. Its price may seem steep, but when it offers Bluetooth connectivity, a dedicated screen, adjustable incline, 24 resistance levels, two dumbbells, and a yearly membership to iFit for instructor-led workouts, it’s difficult to find a disadvantage here. Build quality is excellent too, and the ability to swivel the screen means it's ideal for off-bike workouts as well. An impressive package.",
  "pros": [
    "Fantastic Google Maps integration",
    "Great design with incline feature",
    "Value for money with iFit membership"
  ],
  "cons": [
    "Can’t connect to popular wearables",
    "Android OS can be slow to load"
  ],
  "article": [
    "The iFit NordicTrack S22i Studio Cycle is an impressive exercise bike that'll give you a full-body workout, while also supporting your mental health.",
    "The adjustable incline can accurately simulate different levels of terrain by lifting and lowering the angle of the bike, and 22 resistance levels the terrain during your workout.",
    "Interactive workouts are powered by iFit, allowing you to follow instructors through guided studio workouts, and simulated real-life bike rides. You'll get all this free for a year when you when you purchase the bike, with a rolling subscription fee thereafter.",
    "iFit also provides Google Maps integration, allowing you to cycle through the landscape of your choice and create your own custom routes.",
    "The bike's display can be rotated for floor workouts (the bike includes hand weights for strength work) and offers Bluetooth connectivity for your headphones – though sadly there's no Gymkit integration for Apple Watch.",
    "We found the Android operating system occasionally unstable, and you may find yourself having to wait for the maps or workouts to load once you’ve selected your choice.",
    "The virtual rides are the highlight though, allowing you to feel as though you’re biking through anywhere in the world, even when you can't get outdoors (we reviewed the S22i during the Coronavirus pandemic).",
    "When you consider the heaps of content available to you, alongside the design of the bike itself, it’s a fantastic machine to have around your home if you want to keep fit for both your body and your mind.",
    "The iFit NordicTrack S22i is priced at $1,999 (about £1,400 / AU$2,600) with a $199 (about £140 / AU$260) delivery charge, or from $57 (about £40 / AU$70) a month on a finance plan for 39 months. You also receive a one-year iFit Family Membership, which enables you to sign in to the bike once it arrives, and you can create a workout plan right away.",
    "There's also a smaller model, the S15i Studio Cycle, which costs $1,599 (about £1,100 / AU$2,000) including includes the one-year membership plan. While it's smaller and has a 14in display, it offers otherwise similar features at a slightly lower price.",
    "The bike is delivered in one piece – all you need to do is to set up your iFit account on the 21in screen that’s going to be your trusted companion, then make sure that the pedals are adjusted accordingly and the seat is at a manageable height.",
    "Creating an account is an easy affair, and can be done through the iFit website or app (available for iPhone or Android). Once the it's downloaded, you can validate your membership through the straightforward steps provided, and you only need to log in through the bike once it's connected to Wi-Fi.",
    "The bike uses Google’s Android operating system, so if you have a phone that’s also on Android, the experience will be fairly similar.",
    "The iFit app, meanwhile, features an elegant and easy to follow design, so you can find the workout you want for that day in a few presses. It also works on iPad, which is ideal if you want to work out somewhere away from the bike.",
    "If you use an Apple device, you might notice that iFit is quite similar to the Apple Fitness Plus service that the company launched late last year. However, there are some key differences, and the NordicTrack 22i includes a free one-year subscription so you can give it a good try before deciding whether to invest in a rolling plan afterwards.",
    "The design of the bike is well-thought out; there’s no need to use an Allen key to make adjustments, as you only need to twist certain nozzles around the bike to raise or lower the handlebars, or adjust the seat position. There are two dumbbells and a drinks-holder too, all thoughtfully positioned in a way that makes them practical to use. Everything feels as though the bike was designed by someone who has had fitness ingrained in their lifestyle for years.",
    "There’s also a fan that can blow out some cold air as you’re biking through the streets of a virtual Italy if needed. It's a great extra touch that not only helps keep you cool during intense iFit classes, but also adds to the illusion that you’re riding through a town, not in your home.",
    "The S22i isn't designed to just be a bike; it's an all-in-one gym to work all the muscle groups in your body.",
    "We found it very intuitive to use – particularly the incline and resistance controls built right into the handlebars. These can be adjusted automatically as well; when we created custom routes through Google Maps, the bike changed its own resistance and incline to match the virtual terrain and better simulate a real ride,",
    "The screen is what you’re inevitably going to be focusing on, and for the most part, it succeeds. There's heaps of content available through iFit, and the hundreds of instructors keep the energy going even through tough classes. There are also workouts that allow you to join a coach on a ride through a city, where they guide you through the landmarks and make you feel involved.",
    "It should also be mentioned that users have found ways to install apps such as Netflix and Disney+ for the screen, so if you prefer to use the screen to watch The Mandalorian while you cycle, that's also an option.",
    "Everything is accommodated for when you’re using the screen, including the ports around it. There’s a HDMI socket so it can connect to a second monitor if needed, alongside a USB port to charge your smart device, and a headphone jack with physical buttons for volume control. Everything has been thought of here to reduce the frustration for the user.",
    "However, what lets it down is the operating system itself. There’s no escaping the feeling that this is an enlarged Android device, especially when you’re using the keyboard on this 21in screen. With that, there can be a delay for a workout to load up, or even for certain keypresses to respond.",
    "However, it’s a small price to pay for the benefits that the content brings, and 2021 bikes have a new Android 9 OS tablet, and faster Wi-Fi connectivity for a better, more reliable, experience.",
    "First reviewed February 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and availability",
    "10": "Design and setup",
    "17": "Performance",
    "25": "Don't buy it if"
  },
  "links": {
    "iFit NordicTrack S22i Studio Cycle": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3617484571258886000/https://www.nordictrack.co.uk/exercise-bikes/nordictrack-commercial-s22i-studio-cycle",
    "Gymkit": "https://www.techradar.com/how-to/how-to-connect-your-apple-watch-to-gym-equipment-with-apple-gymkit",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "iFit NordicTrack S22i": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1033275539321065200/https://www.nordictrack.co.uk/exercise-bikes/nordictrack-commercial-s22i-studio-cycle",
    "iPhone": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2910119915646335500&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fgb%2Fapp%2Fifit-home-workout-fitness%2Fid1274601042",
    "Android": "https://play.google.com/store/apps/details?id=com.ifit.wolf&hl=en&gl=US",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Disney+": "https://www.techradar.com/deals/disney-plus-price",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far"
  }
}