{
  "source": "https://www.techradar.com/reviews/dyno-mapper",
  "title": "DYNO Mapper review",
  "category": "computing",
  "updated": "2021-07-06T15:30:36Z",
  "author": "jonas-p-demuro",
  "summary": "Website accessibility testing, and a whole lot more",
  "verdict": "While DYNO Mapper emphasizes website mapping, its accessibility tools are a balance between ease of use while being quite functional and will work to bring your site up to standards.",
  "pros": [
    "Suite of services",
    "Transparent pricing",
    "PDF Analytics",
    "Automated testing"
  ],
  "cons": [
    "Lacks support options",
    "Expensive",
    "Some features restricted to higher plans",
    "Lacks free trial"
  ],
  "article": [
    "DYNO Mapper was founded in 2014, and has its headquarters in Chicago, Illinois. Unlike some other firms that focus exclusively on web accessibility, DYNO Mapper offers a range of services, including its visual sitemap generator with Google Analytics integration, and inventory, audit and planning along with the web accessibility services.",
    "Notable clients of the DYNO Mapper service include PayPal, Adobe, LegalZoom and UCLA.",
    "At the heart of the DYNO Mapper software as a service (SaaS) is the ‘Visual Sitemap Generator.’ This tool can map out up to 200k of web pages on a single crawl, creating a visual representation of a site that is quite useful when planning out a website redesign.",
    "However, for the purposes of this review, we are looking at DYNO Mapper from the perspective of web site accessibility. And after all, you don’t really want to be that guy or gal that goes into the seafood restaurant and orders the hamburger- as it generally is not too good.",
    "Thankfully, DYNO Mapper does not have their web accessibility as an afterthought, nor as an appendage. Rather, it is fully integrated in, with adherence to a ton of the latest standards including:",
    "There is a useful and easy to use Visualize function. Rather than getting just a list of potential accessibility issues, and then having to correlate them to a corresponding page, DYNO Mapper runs tests live in a browser, and then places icons where the problems are. There are even three different icons- Known, Likely and Potential- to help prioritize efforts. Each project can also be tested as often as you wish, unlike some competitors that limit the number of tests.",
    "There is also a feature for monitoring available. This serves to allow DYNO Mapper to run tests on the site for “Ongoing automatic testing,” with the generation of a monthly report. For convenience, it can be configured for automatic notification generation as issues are developed, sent directly to your email inbox.",
    "The user reviews for DYNO Mapper are generally positive. Favorable comments indicate that this service produced a useful site map for redevelopment. Furthermore, DYNO Mapper was able to bring the service into ADA compliance. Additionally, customer service is praised for its efficiency, easiness to reach, and ability to resolve issues in a timely fashion- in some cases in just minutes. Finally, people felt the service was affordable, and the support was helpful.",
    "DYNO Mapper has a three tier pricing structure. All the individual plans have unlimited users, and offer discounts when paid annually. There are also Enterprise plans which get priced differently, and contact is needed for a quote.",
    "The lowest tier is the ‘Standard’ plan, which can handle 25 projects, and 50 GB’s of content data. It uses a site crawler to analyze 5,000 URL’s per crawl. It can interface with Google Analytics, and do keyword tracking on 1,000 keywords. It can be done on demand as needed, and scheduled once each month at a cost of $129 each month.",
    "The middle child of the three tiered plan is the ‘Organization’ plan, which is a hefty increase to $399 monthly. This plan adds on to the features of the lower plan to include up to 50 projects, and 25,000 URL’s per crawl. It increases to 2,500 keyword tracking, 100 GB of content data and scheduling of 5 analyses each month. It also adds the feature of content imports by xPath.",
    "The top plan of the DYNO Mapper offering is designated as ‘Plus,’ which costs $499 monthly. This increases the plan to 50,000 URL’s per crawl, and 10 scheduled analyses each month. Another feature that this plan offers, that the lower plans lack is PDF accessibility testing, on up to 250 per project.",
    "There is a free demo, and it includes a “Proof of concept (PoC) of your domain,” but we did not find an offer of a free trial.",
    "Support for DYNO Mapper is via a login to your account with an email and password. You also have the option of signing in with a social media account, such as LinkedIn.",
    "Contact can also be established via an online portal. There is also a toll free number for enterprise sales, along with a chat box in the lower right hand corner of their web pages. However, DYNO Mapper is lacking as there is no direct email provided, or a phone number for support. Finally, we did not find any options for online educational content, such as a whitepaper, video content, or eBooks.",
    "DYNO Mapper has its merits as a web accessibility service, realizing it lives as part of the larger universe of services under the website mapping umbrella. We like the upfront pricing, the favorable user reviews, and the report with icons to make it child’s play simple to locate and fix potential accessibility issues. We take exception to the pricing that does not have a la carte pricing for the web accessibility piece, the lack of support options, and that some features, such as PDF accessibility gets limited to only the top plan. For those that are planning a website redesign, and have a need for a website mapping, DYNO Mapper makes plenty of sense for the web accessibility component."
  ],
  "headers": {
    "2": "Services",
    "7": "User Reviews",
    "8": "Pricing",
    "13": "Support",
    "15": "Final verdict"
  },
  "links": {
    "DYNO Mapper": "https://dynomapper.com/",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "Standard": "https://dynomapper.com/plans-pricing",
    "Organization": "https://dynomapper.com/plans-pricing",
    "Plus": "https://dynomapper.com/plans-pricing"
  }
}