{
  "source": "https://www.techradar.com/reviews/g-cloud-unlimited-cloud-storage",
  "title": "G Cloud Unlimited cloud storage review",
  "category": "computing",
  "updated": "2021-09-07T16:30:00Z",
  "author": "michael-bizzaco",
  "summary": "A competitively-priced cloud storage service for Android and iOS users",
  "verdict": "oing toe-to-toe with the likes of Dropbox and iCloud, G Cloud Unlimited lets you set up automated backups for your entire mobile device, with plenty of organization and sharing options to customize your storage with.",
  "pros": [
    "Unlimited storage at a competitive price",
    "Great mobile app",
    "Can add multiple devices to one account",
    "Plenty of automation and customization options",
    "Tough encryption"
  ],
  "cons": [
    "Mobile backups only (no desktop app)",
    "No support for Windows and Linux mobile devices"
  ],
  "article": [
    "From phones to tablets, our mobile devices are like digital extensions of our personalities. The home of the contacts we hold dear, our daily text conversations, memorable photos, and other important media, we rely on these on-the-go devices to keep our daily lives flowing and our most poignant content under lock and key.",
    "But, at some point, it’s wise to consider offloading some of our digital data, which is where services like G Cloud Backup enter the fray.",
    "Operated by Zoolz, a commercial cloud backup provider, G Cloud Backup is a mobile mitigation tool for Android and iOS devices, allowing users to transfer their pertinent data from their phones/tablets to an encrypted cloud server, all through an easy-to-use mobile app.",
    "While G Cloud offers three different pricing options for its cloud services, we’ll be focusing on the company’s “Unlimited” tier for the purposes of this review.",
    "G Cloud offers a rich assortment of storage capabilities for its subscribers. Not only are you able to easily and safely (more on that below) offload your files onto the G Cloud servers in seconds flat, the platform will also allow you to view, share, and manage your backed-up essentials.",
    "After you link your mobile device to your G Cloud plan, you’ll be able to choose exactly what content types (contacts, texts, photos, etc.) will be transferred to the cloud, along with how frequently you want your designated media to be backed up. For those that prefer a more manual approach to backup services, you can just as easily tap and send your media to G Cloud one file at a time.",
    "In terms of pricing, G Cloud Unlimited subscribers can expect to pay $5.99/month or $59.99/year for the company’s most premium storage option. If you find yourself constantly backing up data, we’d recommend the one-time yearly fee, which will save you $12 upfront versus a recurring monthly charge. Best of all, your unlimited plan covers any additional devices you wish to add to your G Cloud enrollment.",
    "When it comes to moving over your data, you’ll want a migration tool that can do so efficiently and with as much built-in protection as possible. Fortunately, G Cloud takes the privacy and ultimate security of its users very seriously.",
    "When a transfer is initiated, military-grade 256 AES encryption is applied to your media as it leaves your device and remains with the files once they’re stored. Furthermore, the digital repository that your content lands in is the one and only Amazon Web Services (AWS) cloud, one of the most secure and renowned backup tools used by companies like Netflix and Uber.",
    "We tested the G Cloud mobile app for iOS using an iPhone 12. After downloading the G Cloud Backup app you’ll be prompted to either sign in or create an account. G Cloud offers quick enrollment options through Google, Apple, and Facebook, but you can manually create an account, too.",
    "Once logged in, you’ll be brought to a data selection screen to choose what media G Cloud will back up. Options include contacts, photos, videos, and calendars. You’ll then be asked whether or not you want to enable background backup, which requires access to your location.",
    "The G Cloud app’s overall layout is sleek and the interface itself is nimble and responsive. The home page shows you how many files are pending upload, how many are currently stored, and when your last backup occurred. You can manually stop and resume your backup from the landing page, and there’s even a Cloud Gallery button for viewing the photos and videos you’ve backed up.",
    "By tapping the hamburger icon in the top-left corner, you’ll open a dropdown of additional tabs, featuring a data selection filter, the option to view your data on G Cloud’s site, and a main settings tab where you can enable a passcode function, toggle on/off background backup and cellular data, and upgrade to a higher account tier.",
    "G Cloud Unlimited is available for Android and iOS devices. If your phone/tablet is lost or damaged, or you’re simply not near it, you can also access your G Cloud account through the company’s website.",
    "At this time, G Cloud does not offer support for mobile-based Windows or Linux devices.",
    "When it comes to cloud storage, G Cloud has a host of rivals to be weighed against. IDrive, one of our favorite cloud services, may not offer unlimited storage, but 5TB for $60/year (first year only) is nothing to shake a stick at. And, like G Cloud, IDrive allows you to add multiple devices to your subscription.",
    "Then there’s pCloud, the Swiss-based cloud service that offers tough encryption, support for multiple devices, a built-in music player, and the option for a single lifetime charge ($175 for 500GB/$350 for 2TB).",
    "Dropbox is another storage staple, offering an intuitive interface, plenty of file-sharing options, and a sleek mobile app.",
    "G Cloud Unlimited is a foolproof platform for safely storing all of your most vital media under one easy-to-access roof. While the mobile-only platform lacks the integrated business support of cloud services like pCloud and BackBlaze, the convenience of having your backups automated and quickly accessible makes G Cloud Unlimited an attractive contender for digital storage."
  ],
  "headers": {
    "4": "Features",
    "7": "Privacy and security",
    "9": "User experience",
    "13": "Platforms",
    "15": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Zoolz": "https://www.techradar.com/reviews/zoolz-cloud-backup",
    "G Cloud Backup": "https://genie9.go2cloud.org/aff_c?offer_id=2&aff_id=1381&source=trd&aff_click_id=trd-us-7374026264474515000&url=https%3A%2F%2Fwww.zoolz.com%2Fgcloud%2F%3Fsession_id%3D%7Btransaction_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fg-cloud-unlimited-cloud-storage",
    "privacy and ultimate security": "https://genie9.go2cloud.org/aff_c?offer_id=2&aff_id=1381&source=trd&aff_click_id=trd-us-8656391534011009000&url=https%3A%2F%2Fwww.zoolz.com%2Fgcloud%2Fterms%2F%3Fsession_id%3D%7Btransaction_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fg-cloud-unlimited-cloud-storage",
    "AWS": "https://www.techradar.com/news/aws",
    "backup tools": "https://www.techradar.com/best/best-backup-software",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Android": "https://play.google.com/store/apps/details?id=com.genie9.gcloudbackup&hl=en_US&gl=US",
    "iOS devices": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1387840185539428600&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fg-cloud-backup%2Fid1038372306",
    "company’s website": "https://genie9.go2cloud.org/aff_c?offer_id=2&aff_id=1381&source=trd&aff_click_id=trd-us-6607590832851113000&url=https%3A%2F%2Fwww.zoolz.com%2Fgcloud%2F%3Fsession_id%3D%7Btransaction_id%7D&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fg-cloud-unlimited-cloud-storage",
    "IDrive": "https://www.techradar.com/reviews/idrive",
    "pCloud": "https://www.techradar.com/reviews/pcloud",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review"
  }
}