{
  "source": "https://www.techradar.com/reviews/breville-the-juice-fountain-cold",
  "title": "Breville the Juice Fountain Cold review",
  "category": "appliances",
  "updated": "2021-07-13T10:00:00Z",
  "author": "helen-mccue",
  "summary": "A mid-range centrifugal juicer that makes very smooth juice",
  "verdict": "This centrifugal juicer from Breville is a great option for big families, it comes with a large jug and large pulp container allowing you to make plenty of juice without stopping to empty anything. It makes really smooth pulp free juice, although the centrifugal action does mean you’ll get froth on top of the juice. Avoid it if you’re looking to make your daily kale shot at home because it doesn’t juice leafy greens well.",
  "pros": [
    "Large capacity lidded jug",
    "Easy to empty large pulp container",
    "Juice is smooth with no pulp"
  ],
  "cons": [
    "Poor results juicing leafy greens",
    "Lots of foam on some juices",
    "Takes up a lot of space on countertop"
  ],
  "article": [
    "Breville is known for high-end, well-designed appliances and makes some of the best blenders and best Instant Pot alternatives on the market. It’s also hoping to make the list of the best juicers too, with its ‘Cold Spin Technology’ which Breville claims will ensure the juicer stays cool, despite its high spin speed to avoid any heat damage to vitamins and minerals during the juicing process.",
    "The Breville the Juice Fountain Cold is one of the more affordable juicers from Breville, but it still offers ‘Cold Spin Technology. It’s a centrifugal juicer, and uses a blade that spins at high speed to extract juice from fruit and vegetables. The main difference between this model and Breville’s more expensive juicers is the power; the Juice Fountain Cold is 850W in the US or 1250W in the UK and Australia, whereas Breville’s more premium juicers have higher power motors, which spin faster, extracting more juice.",
    "The Breville the Juice Fountain Cold makes very clear juice with no pulp and the large capacity jug and pulp container are perfect for people who want enough juice for two to three days or for a large family. If you’re looking for a juicer that’ll make kale shots and similar juices from leafy greens, then avoid this model as it doesn't extract much juice from kale. Instead, opt for a cold press juicer, which is also known as a slow juicer or masticating juicer. This is also a bulky machine so best avoided if you’re short on space.",
    "The Breville the Juice Fountain Cold, which is also known as Sage the Nutri Juicer Cold in the UK, is priced at $179.95/ £179.95/ AU$349. It’s available through the Breville website in the US and Australia, in the UK it’s available through the Sage Appliances website.",
    "In the US and Australia, it sits in the middle of Breville’s juicer range, but in the UK, it’s the most affordable juicer Sage offers. However, the juice extraction technology is similar to the more expensive models on offer, so for the price, it’s a good option.",
    "This is a centrifugal juicer that works by chopping the fruit and vegetables with rotating blades and then spinning the chopped fruit and vegetables at a high speed through a mesh filter to extract the juice. It’s a common juicing method and much quicker than a cold press juicer.",
    "While the main motor unit isn’t particularly large, once fully assembled with the juicing jug and pulp container in place, the Breville the Juice Fountain Cold is a large appliance that takes up a lot of space on the countertop. The fully assembled juicer measures 17 x 17 x 9 inches/ 43 x 43 x 23 cm (h x w x d). It’s easy to disassemble for storage but will still take up a lot of cupboard space. On a positive note, the large size means a large capacity, the 70oz/ 2L lidded jug and 3.6 qt/ 3.4L pulp container allows you to juice a lot of fruit and vegetables in one go. The lidded jug can be used to store juice in the fridge for up to three days, which means you don’t have to get the juicer out every day.",
    "There are just two speed settings to choose from, high or low depending on the type of fruit you’re juicing. A speed selector guide in the manual gives advice on what speed setting to use. The wide feed chute allows whole fruits like apples to be placed into the juicer without the need to chop up first and the juice dispenses directly into the lidded jug, so there’s no splashing.",
    "It’s not too fiddly to assemble and most parts apart from the juice cover and food pusher are dishwasher safe, which makes cleaning simpler and it also comes with a cleaning brush for easy cleaning of the filter mesh.",
    "All the component parts slot together easily and it’s intuitive to put together – we didn’t really need to consult the instruction manual for assembly and the two speed settings are really simple to use. We tried carrot juice first, chopping the tops off the carrots, but otherwise putting them in whole, unpeeled. From 7.8oz/ 222g carrots, it produced 4.2oz/ 119g juice which is a juice yield of almost 54% and a good yield for carrot juice. The juice itself was very clear and smooth with very little foam.",
    "As with most juicers, oranges have to be peeled before juicing and it achieved a juice yield of 59%, which is lower than we’ve seen from other centrifugal juicers such as the Nutribullet Juicer. However, the juice had no traces of pulp at all and had a very smooth texture. There was almost ¾ inch of foam on the top of the juice, but if you pour it from the jug with the lid in place, the foam separator helps to keep the foam in the jug and out of your glass.",
    "Results from juicing kale were disappointing, air flows up the feed chute and blows the chopped kale pieces back out as you try to feed them in, but once we had managed to get all of our kale in, we only got a 14% yield and there were visible pieces of unprocessed kale in the pulp container, so it’s quite a wasteful process and in this case, we’d recommend looking for a cold press juicer.",
    "We tried a mixed green juice containing some tricky ingredients including celery, parsley, ginger, broccoli, apple and pear. It coped well with these ingredients, producing a clear smooth juice with a yield of 68%, again there was some foam on top, but otherwise the juice was very smooth. At 86dB this was the loudest of all the juices we made.",
    "It took just 13 seconds to juice a whole apple which is very speedy, add to that the fact that you don’t need to chop up the apple first due to the wide feed chute, which makes the juicing process fast with this model. The large pulp container is really easy to empty and most of the parts can go in the dishwasher so it’s simple to clean.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Breville the Juice Fountain Cold price and availability",
    "5": "Design",
    "9": "Performance",
    "14": "Don't buy it if..."
  },
  "links": {
    "best blenders": "https://www.techradar.com/best/best-blenders",
    "best Instant Pot": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "best juicers": "https://www.techradar.com/news/best-juicer"
  }
}