{
  "source": "https://www.techradar.com/reviews/mega",
  "title": "Mega cloud storage review",
  "category": "computing",
  "updated": "2021-05-26T19:06:15Z",
  "author": "mayank-sharma",
  "summary": "Does Mega live up to its name?",
  "verdict": "Mega is one of the best cloud storage services around, though it lacks the suite of apps you get from the likes of Apple, Google, Microsoft and Dropbox. It has a free tier, is competitively priced, has very strong security, and is mostly very easy to use as well.",
  "pros": [
    "Excellent security protocols",
    "Competitively priced",
    "Clean, user-friendly interface"
  ],
  "cons": [
    "Basic business support",
    "Limited extra apps and add-ons",
    "Lacks collaboration options"
  ],
  "article": [
    "Mega configures its cloud storage somewhat differently as the brainchild of eccentric tech entrepreneur Kim Dotcom (who has since moved on, but was also responsible for the now defunct Megaupload), its main draw is the variety of built-in security mechanisms you get on all of the Mega plans (including the free one).",
    "The features include end-to-end encryption and the publishing of its source code on GitHub, so anyone can audit it for security issues. Mega overall is intuitive and easy to use, with cross-platform tools available across Windows, macOS, Linux, Android and iOS.",
    "Mega strikes that good balance between features and simplicity, running on just about every device. You can have it watch specific folders on your computer, along with uploading files through the web interface. Any size file can be uploaded, as long as you stay within your overall quota, with the service supporting versioning as well, enabling the retrieval of older versions of documents.",
    "Baked right into the Mega service is file and folder sharing. It includes the option to either include the encryption key with the link which is quite convenient, or to transmit the encryption key separately, though a different channel, a nice feature to impress more security-conscious users, but perhaps not the general masses. For an even additional layer of security, links can also be password protected, with dates of expiration assigned.",
    "What makes Mega stand out is these security features, with end-to-end encryption supported (see below for more), and a clear emphasis on protecting your privacy throughout. There’s even a secure chat client built into the platform as well, especially useful for using Mega in a small business setting for secure communication between employees.",
    "What’s missing from Mega is the free online office suite that other cloud providers include, and it lacks some of the more advanced features found in other products, but on the whole it's a slick cloud storage solution to put the focus on protecting your data. Uploading and syncing is a breeze, the majority of the file sharing options you're going to need are included, and your files are available from just about anywhere.",
    "Mega’s web interface provides a slick and smooth experience. Everything is neatly laid out and accessible – whether you need to upload files or get information about your account- all is reassuringly straightforward. The web app enables viewing (or listening to) media files, documents and so on from within your browser. The functions, such as sharing files and folders are always mere clicks away, making it one of the more user-friendly cloud storage solutions that we've come across.",
    "Along with access to Mega through the browser, there is also the option of using the MegaSync app for Windows, macOS or Linux. Just like the online interface, all is quite clean and well laid-out inside the desktop client to monitor any folders that you designate, syncing files analogous to Dropbox. You can granularly control to sync your entire Mega cloud locker to your computer, or just your selected files and folders.",
    "Also impressive are the number of extensions that Mega offers, including an extension to the Thunderbird email client, to a command line interface. That this cloud storage service is built by people who are passionate about technology shows through, with an integrated, encrypted chat platform called MegaChat used to speak securely with other users, when the need arises.",
    "Upload and download speeds are plenty fast when we use them – assuming you have a decent broadband connection of course – and the desktop has some slick extra features that we like as well: the ability to throttle how much bandwidth it's using, for example, and the option to exclude certain files from the syncing process based on their names.",
    "An important reason that Mega attracts customers is due to its approach to security. The platform is totally end-to-end encrypted, which means not even Mega – or anyone issuing warrants to Mega – can make any sense of your data. Also keep in mind that this means that if you forget your password, you can't get your data back (you'll need to acknowledge you understand this before you create an account).",
    "Truth be told this is not completely true: there is a recovery key in your account, but you need to jot this down somewhere else to create a proper safety net. Secure access to your account can also be done by optionally enabling two-factor authentication (2FA), which is an extra we always like to see from a security standpoint. It really shows through at every stage that Mega takes privacy and security uber seriously.",
    "Users can sign up for a free tier from Mega, without entering any credit card details, and stay on this free plan forever as it gives 15GB of 'base' storage, and a 'limited' file transfer limit which apparently changes dynamically based on the spare capacity on the Mega network. Extra space- up to 50 GB- can be earned by completing various tasks, such as inviting friends or installing the mobile apps, but this extra space eventually expires.",
    "The paid tier pricing starts at €4.99 (roughly $6.07 or £4.29) a month for 400GB of storage and a 1TB file transfer limit. The top tier is €29.99 (about $36 or £26) a month for 16TB of storage and a 16TB file transfer limit. Additional discounts are available on those prices if you pay up for a whole year at once, and business accounts with extra user management features are available from €10 (around $12 or £9) per month per user.",
    "Mega has plenty of appeal, certainly among users who value privacy and security above most other considerations. Having been able to use the various apps and features, it’s easy to say how easy it is to get around the service while finding all the tools needed. Mega caters to both absolute beginners of cloud storage, along with the more advanced users who can take advantage of such features as encrypted chat or a command line interface.",
    "There is also an appeal for enterprise users as well, with its extra user management features, secure built-in chat, and the ability for easy file sharing with folks not on Mega. Overall, Mega has a clean, easy-to-use interface with plenty of useful features. While it doesn't quite have the scope of some other cloud services, it can edge out many of them on price, and the security measures of Mega are indeed impressive."
  ],
  "headers": {
    "2": "Mega features",
    "6": "Mega interface",
    "10": "Mega security",
    "12": "Mega pricing",
    "14": "Final verdict"
  },
  "links": {
    "Mega": "https://mega.nz/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "secure chat": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "free online office suite": "https://www.techradar.com/best/free-office-software",
    "Thunderbird": "https://www.techradar.com/reviews/mozilla-thunderbird",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "file sharing": "https://www.techradar.com/best/best-ways-to-share-big-files"
  }
}