{
  "source": "https://www.techradar.com/reviews/kitchenaid-k150-blender",
  "title": "KitchenAid K150 Blender review",
  "category": "appliances",
  "updated": "2021-08-13T10:00:00Z",
  "author": "helen-mccue",
  "summary": "An affordable and simple blender from KitchenAid that blends we",
  "verdict": "The KitchenAid K150 blender is a basic model and the most affordable in the KitchenAid blender range. It’s a simple, no fuss blender with no accessories and minimal speed settings, it’s ideal as a first blender but seasoned cooks might find the lack of speed settings frustrating. It’s great for crushing ice, making mayo and it can blend a good smoothie. The downsides are the small capacity pitcher and the fact the base is plastic not metal like other premium KitchenAid blenders.",
  "pros": [
    "Effective at blending",
    "Simple to use",
    "Dishwasher safe jug and lid"
  ],
  "cons": [
    "Only three speed settings",
    "No preset programs",
    "Small pitcher"
  ],
  "article": [
    "KitchenAid offers a range of high-power premium blenders, the KitchenAid K150 is a lower spec blender at a more affordable price. There are some compromises to achieve the lower price tag, these include making the base from plastic rather than die-cast metal and a lower-powered motor, there’s also fewer speed settings and programs.",
    "However, if you’re looking for a blending appliance from a premium manufacturer but can’t stretch to the price of other KitchenAid blenders, this model is a great choice, particularly for novice cooks or households where it’ll only get occasional use, because the compromises won’t be too noticeable.",
    "With just two colors to choose from (three in Australia and four in the UK) it doesn’t offer the wide range of color options that you usually get from KitchenAid, so you may not be able to coordinate it with other KitchenAid appliances in your home. But there are compatible accessories available to buy separately, which would make it a more versatile blender.",
    "With just three speeds, it’s easy to operate and in our tests it made a decent smoothie and has no problem crushing ice so is ideal for simple everyday tasks. It’s not the best model for larger households where the smaller 48oz/ 1.4 liter capacity jar might not be big enough, but as an entry-level model it’ll get the job done.",
    "Available through the KitchenAid, this is the lowest price blender model in the KitchenAid range and will set you back $99.99/ £229/ AUS $299. The brand also offers the KitchenAid Artisan K400, which is its mid-range blender offering a more powerful motor and larger capacity pitcher, and is priced at $249.99/ £299/ AU$499.",
    "KitchenAid appliances commonly feature multiple color options, however, this blender comes in a much smaller choice of hues; red or black, plus cream in Australia and the UK, which also has a fourth grey option. The three-part blending system combines the intelli-speed motor with a ribbed pitcher and asymmetric blade, and KitchenAid claims this combination gives optimum blending results.",
    "The 48oz/1.4-liter pitcher capacity is on the smaller side compared to other KitchenAid blenders, but the base is a fairly standard size, which means despite the small blending capacity it’ll take up a similar amount of space on your worktop as other models such as the KitchenAid K400, with an overall measurement of 14.8 x 7.1 x 8.5 inches/37.6 x 18 x 21.6 cm (h x w x d). The plastic base makes it lighter than other KitchenAid blenders, which have a much heavier but also more robust die-cast metal base. This model weighs 8lbs/ 3.63kg so if you want to store it in a cupboard, you’ll have no problem lifting it in and out.",
    "Being an entry-level model, it doesn’t come with any personal blending cups or other accessories but there are plenty of compatible accessories available to purchase separately should you get the blending bug. There are only three speeds, plus a combination pulse/ ice crush mode, which will be fine for most people, but more experienced cooks may prefer a model with extra speed settings for more control.",
    "There’s no recipe book included in the box and the manual doesn’t give advice on blending times and speeds, but with just three speeds to choose from, it’s not too tricky to figure it out.",
    "The KitchenAid K150 blender is easy to set up, the jug slots straight on to the base and can be rotated to ensure the handle is positioned either to the left or the right. It’s also really simple and intuitive to use, there’s barely any need to consult the instruction manual.",
    "While it doesn’t have any preset timed programs, the pulse setting doubles as an ice crush setting. We tried it out and the ice was crushed quickly and evenly. We also filled it to maximum capacity with water and switched on to the highest speed setting to check for leakage, but there was absolutely no leaking from anywhere in the jar or the lid.",
    "To test its smoothie-making ability, we blended a mix of spinach, pineapple, apple juice, yogurt, and banana on the highest setting. A couple of very small flecks of spinach weren’t completely liquidized and if we’re being super picky it wasn’t the silkiest smooth smoothie we’ve ever had when compared to very high-end expensive blenders, but it was still smooth and a great result in a lower power blender.",
    "At 86dB chopping nuts was the loudest of our tests and is the same noise level experienced when stood 20 feet away from an automatic cash wash. We used the pulse setting and even gave them a stir halfway through but despite this, the nuts weren’t very evenly chopped. There was a mixture of larger chunks, powder, and some nicely chopped pieces, so not a great result.",
    "It makes a good mayo and the blade configuration means that it can blend very small quantities so it had no problem blending two egg yolks. The lid has a removable cap which made it easy to pour in the oil and it produced a thick emulsified condiment.",
    "There’s no dedicated self-clean program, but the manual gives instructions on how to use speed setting three to clean it, which works well. The jar and lid are also dishwasher safe, so cleaning is simple and quick.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "30-second review",
    "4": "KitchenAid K150 price and availability",
    "5": "Design",
    "9": "Performance",
    "15": "Don’t buy it if…"
  },
  "links": {
    "blender": "https://www.techradar.com/best/best-blenders"
  }
}