{
  "source": "https://www.techradar.com/reviews/klipsch-t5-ii-true-wireless",
  "title": "Klipsch T5 II True Wireless review",
  "category": "audio-visual",
  "updated": "2021-01-27T14:59:40Z",
  "author": "olivia-tambini",
  "summary": "The Klipsch T5 II look great, but how do they sound?",
  "verdict": "The Klipsch T5 II True Wireless offer the same excellent build quality as their predecessors, alongside a great bass response that’s ideal for electronic and pop music. However, sibilance in the trebles and the lack of noise cancellation means they can’t beat the likes of the Apple AirPods Pro and the Sony WF-1000XM3, particularly at this price.",
  "pros": [
    "Cool charging case",
    "Excellent bass response",
    "Great connectivity"
  ],
  "cons": [
    "Sibilant trebles",
    "No noise cancellation",
    "Expensive"
  ],
  "article": [
    "The Klipsch T5 II True Wireless are the latest earbuds from the heritage audio brand, bringing an updated design, new drivers, and improved connectivity to the original T5 earphones.",
    "Despite their high price, these true wireless earbuds lack the active noise cancellation that features in models such as the Apple AirPods Pro or the Sony WF-1000XM3. However, they do retain the excellent build quality of their predecessors, reprising the Zippo lighter-esque design of the charging case.",
    "The earbuds themselves have been upgraded, too, sporting a smaller, lighter build, alongside an IP67 water- and dust-resistance rating. We found the earbuds comfortable in use, with the six different-sized ear tips in the box a welcome addition of which other manufacturers should take note.",
    "We weren’t fans of the buttons that sit on the outer housing of each earbud, since using them can cause the buds to be pushed further into your ear canal. However, we appreciate that touch controls can be equally finicky, and that how you feel about them will come down to personal preference.",
    "When it comes to audio performance, the Klipsch T5 II excel in some areas, but disappoint in others. They offer a great bass extension with tightly controlled low frequencies, but suffer from sibilance and a lack of sparkle in the trebles. In addition, while they provide a good level of clarity and comprehensive codec support, they’re let down by their relatively narrow soundstage and lack of dynamism.",
    "In general, connectivity is very good as a result of Bluetooth 5 support. We didn’t experience any pairing issues while using the Klipsch T5 II. We also liked the fact that you can adjust the EQ settings via the Klipsch Connect app.",
    "Battery life is also decent, if not class-leading, coming in at 32 hours in total.",
    "And that pretty much sums up our overall opinion of the Klipsch T5 II: they're pretty good, but not class-leading. Sure, these wireless earbuds sound good enough for casual listening, and build quality is impressive, too – but for the price, we expect more.",
    "That ‘more’ would be through the inclusion of active noise cancellation, a truly flawless audio performance, or even a battery life that beats the competition. Sure, they’re an improvement upon their predecessors in terms of connectivity and design, but without these extra features, the Klipsch T5 II are relegated to the world of good, but not great, true wireless earbuds.",
    "The Klipsch T5 II were released in July 2020, and cost $199 / £185 / AU$329 – the same price as their predecessors. That’s slightly cheaper than the Apple AirPods Pro, and a little more expensive than the best true wireless earbuds of 2021, the Sony WF-1000XM3.",
    "However, unlike those wireless earbuds, the T5 II lack active noise cancellation, which is a feature you may (quite reasonably) expect for the price. However, the charging case in particular does feel well-made, eschewing cheap plastic in favor of hard-wearing metal.",
    "The Klipsch T5 II take a few design cues from their predecessors, while adding new touches to improve the user experience.",
    "Like the original Klipsch T5, the earbuds come with an eye-catching Zippo lighter-style charging case, which is made from brushed metal and clicks closed in a satisfying manner.",
    "On the front of the charging case sits a subtle engraving of the Klipsch logo, and round the back is a USB-C port for charging. On opening the case you’ll see a row of three LEDs, which indicate how much power the earbuds have remaining.",
    "Now onto the earbuds themselves. Klipsch says that they’re approximately 25% smaller and more closely mimic the shape of the ear; they certainly feel comfortable to wear. Plus, with six pairs of color-coded ear tips, you should be able to find a secure and agreeable fit.",
    "Somewhat unusually, the ear tips protrude from the bottom of the oval housings, rather than being integrated into them. However, this doesn’t cause the earbuds to jut out of your ears awkwardly, fitting into them snugly and subtly.",
    "On the outside of each earbud is a button that can be used to control music playback, accept calls, and enable the Transparency mode. There are a few press combinations you’ll need to remember, but they should become second nature once you’ve spent a bit of time with the Klipsch T5 II.",
    "Buttons, as opposed to touch-sensitive housings, are an interesting choice: they can cause the earbuds to be pushed further into the ear canal every time you interact with them, which can be uncomfortable. However, there are plenty of folk who despair of touch controls, so whether or not you're a fan of Klipsch’s approach will really come down to personal taste.",
    "Thanks to an IP67 dust- and water-resistance rating, the Klipsch T5 II are suitable for use while working out. You won’t have to worry about sweat or the elements damaging their inner mechanisms. It’s only a shame that Klipsch hasn’t also included optional ear fins for fitness fans who want to ensure their buds stay firmly in their ears – but they feel pretty secure, nonetheless.",
    "Overall, the Klipsch T5 II look sleek and stylish, and although the company hasn't disclosed how much they weigh, they feel incredibly light and comfortable to wear, even during long listening sessions.",
    "Inside the T5 II sit 5mm dynamic drivers, with a thin diaphragm that’s designed to enhance the clarity of your music and improve audio quality “across the entire frequency spectrum”, according to Klipsch.",
    "While we didn’t have any issues with the level of clarity, we did find that performance varied across the different frequencies, so the T5 II's don’t quite live up to this claim.",
    "Listening to Harley Alexander’s Tiny Bricks, the strummed guitar sounded smooth and warm, as undulating synths harmonize sympathetically with the gentle vocals.",
    "In more vigorous tracks such as Dutch Uncles’ Oh Yeah, we noticed some sibilance in the treble frequencies, particularly when it came to percussion and ‘t’ vocal sounds. However, the synth blasts sounded bright and the bass was tightly controlled and powerful.",
    "The earbuds excel when it comes to bassy electronic and pop music, with a lovely richness in the mids and excellent handling of sub-bass frequencies. In Childish Gambino’s Sober the vocals sound gorgeously clear, displaying a great balance with the pulsating keys and distorted guitar riffs.",
    "That’s not to say that these earbuds can’t handle acoustic music, too. Sufjan Stevens’ No Shade In The Shadow Of The Cross sounded heavenly when the vocal harmonies kicked in, although the track suffered from a lack of sparkle in general, and sibilance was quite noticeable.",
    "Overall, the soundstage isn’t the widest, and the imaging is disappointingly flat – we’d have liked more dynamism from the Klipsch T5 II, which would make for a more interesting listen.",
    "If you need to quickly tap into your surroundings, there’s a handy Transparency mode, which allows environmental sound to pass through the buds and into your ears. We found this feature worked well; even without ANC, these buds provide a decent seal and can block out a fair amount of noise.",
    "Battery life comes in at 32 hours in total, with eight hours for the buds themselves – more than the original Klipsch T5, and far more than the Apple AirPods.",
    "They aren’t the longest-lasting wireless earbuds we’ve ever tested, but that battery life will easily get you through a week of commuting, exercise, or working from home.",
    "Connectivity comes courtesy of Bluetooth 5, which means pairing the buds with your devices is simple and quick, with the wireless connection remaining stable throughout our tests.",
    "Codec support covers AAC, SBC, and aptX, so you’ll be able to listen to music with a resolution of up to 24-bit/96kHz, meeting the threshold for Hi-Res Audio. Good news, if you have a huge library of high-quality or tracks or a Tidal account.",
    "For tweaking the equalizer settings and the Transparency mode levels, head to the Klipsch Connect app, as well as checking for firmware updates."
  ],
  "headers": {
    "0": "One-minute review",
    "9": "Klipsch T5 II True Wireless price and release date",
    "11": "Design",
    "20": "Audio performance",
    "28": "Battery life and connectivity",
    "33": "Don't buy them if..."
  },
  "links": {
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "original T5 earphones": "https://www.techradar.com/reviews/klipsch-t5-true-wireless-earphones",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Tidal": "https://www.techradar.com/reviews/tidal"
  }
}