{
  "source": "https://www.techradar.com/reviews/saucony-endorphin-speed-2",
  "title": "Saucony Endorphin Speed 2 review",
  "category": "fitness",
  "updated": "2021-06-15T08:00:00Z",
  "author": "michael-sawh",
  "summary": "A daily shoe that feels at its best when you want to go faster",
  "verdict": "The Saucony Endorphin Speed 2 doesn’t make wholesale changes to the well-loved Speed and that’s actually not a bad thing. It’s a daily shoe that’s great to run quick in, making it a good match for tempo runs, faster training sessions and one you could even turn to for race day.",
  "pros": [
    "Responsive nylon plate",
    "Good fit for tempo runs",
    "Comfortable upper"
  ],
  "cons": [
    "Mainly upper changes from first Speed",
    "Reviere colorway an acquired taste"
  ],
  "article": [
    "The Saucony Endorphin Speed 2 is the follow-up to the Speed, which launched in 2020 and was a standout in the Endorphin range for those looking for an enjoyable daily shoe to run in.",
    "Unlike the Endorphin Pro, which is built for race day, the Speed doesn’t have a carbon plate. Instead, it uses a full length nylon plate that, combined with Saucony’s PWRRUN midsole cushioning technology, aims to offer a nicely responsive feeling underfoot to help make it a formidable partner for short and long distance training runs.",
    "Saucony isn’t making wholesale changes with the Speed 2. Along with retaining that nylon plate and midsole combo, it’s made improvements to the upper to make things more comfortable and breathable, though it’s crept up in weight slightly.",
    "Ultimately, what hasn’t changed is what Saucony aims to deliver here: a running shoe that feels nice at a variety of paces, but definitely feels more enjoyable going fast.",
    "The mesh upper changes don’t feel hugely noticeable, though this does create a more spacious feel in the toe box of what is a narrow fitting shoe. It’s a snug fit overall, the outsole offers good traction underfoot and is best for sticking to road and track running.",
    "Like the Speed, the Speed 2 is an enjoyable shoe to run in and is a good training partner that puts it among one of the best daily trainers you can lace up.",
    "The Saucony Endorphin Speed 2 launched on June 15t 2021 and costs £155/$160 from Saucony (Australian pricing has yet to be confirmed at the time of writing). The original Endorphin Speed cost the same £155/$160 when it launched in 2020.",
    "Like the original Speed, the Speed 2 is a neutral running shoe built for road running, jumping on the treadmill or heading to the track. It comes in three colourways; Royal Black, Vizio Pro and the new Reverie colourway (pictured) that we had to test.",
    "We think it’s fair to say that this chequered look isn’t going to be everyone’s cup of tea, but it seems Saucony likes to be more than a touch adventurous with the colorways it’s draping its running shoes in right now.",
    "There are men’s and women's Speed 2 options with the men’s shoe weighing in at 225g and the women’s coming in lighter at 200g. The original Speed weighed in at 221g, so there have been a few grams added in weight. It still has an 8mm heel-to-toe drop like the original Speed and the new Endorphin Pro 2, which is 35mm at the heel and 27.5mm at the forefoot.",
    "It’s not the most streamlined daily running shoe we’ve used, and it would be nice to see it get lighter still, but thankfully it’s not one that feels tough to run in even when your legs start to tire.",
    "Where Saucony has made changes is in the upper department. It’s an engineered mono-mesh that’s been made from recycled materials to give it added sustainability credentials, though Saucony doesn’t outline just how much of that material is the recycled kind. It’s designed to keep things light and breathable though.",
    "One of the benefits of that mesh upper is that it feels quite spacious up front in the toe box, which is welcomed in what does feel like quite a narrow fitting shoe and that’s something to be mindful of. Saucony also says it’s used anti-slip laces here to create that strong fit, though we can’t say we hugely noticed those laces made a huge difference on that front. The heel counter, collar and tongue have a textured, flexible feel to add to what is overall a comfortable, breathable upper.",
    "Underneath, you’ve got the same outsole make up as the first Speed with reinforced high abrasion zones that are designed to offer strong traction and durability. Those zones are more prominent at the forefoot shoe where it stretches even up to the front of the toe box with more of the sole exposed at the back that could quickly get eaten up on harsher off-road terrain. It’s an outsole built for flat, dry roads or tracks, though when then rain came on one run we’d have appreciated a little more in the grip department.",
    "The overall feeling of running in the Speed 2 is that it’s a very enjoyable one. While this writer didn’t get the chance to run in the first Speed, it doesn’t take long to appreciate why there was a lot of love for the Speed 2’s predecessor.",
    "That combination of the full length nylon plate and Saucony’s PWRRUN PB midsole cushioning creates a soft, but satisfying feeling underfoot that makes this a shoe that’s great to go quick once you’ve really hit your stride.",
    "Saucony’s cushioning offers that nice bounce without feeling overly aggressive and the Speedroll profile is there to push you forward and onto your toes and it’s really noticeable.",
    "You get that feeling even when you’re walking around in these shoes. While you might not get that snappy feel you’ll find with carbon plate shoes, there’s plenty to like here when you want to go a bit quicker in your session.",
    "That softer feel of this shoe makes it better fit for going longer too. We ran short 5k runs, tempo runs, did track sessions and long training runs and it felt most rewarding for quick 10k runs and tempo runs. It doesn’t feel quite as well suited for slower paced runs as everything in this shoe is geared to run quick. The upper is supportive and comfortable in the right places and is a shoe that’s a real joy to run in.",
    "It’s one we wouldn’t rule out using for race day either. It feels like a shoe well equipped for chasing down 10k to half marathon PBs and one that’s durable enough to put in plenty of training miles and still be one to turn to when you get on that start line."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and release date",
    "7": "Design",
    "14": "Performance",
    "20": "Don't buy it if"
  },
  "links": {
    "Speed": "https://www.techradar.com/reviews/saucony-endorphin-speed",
    "Endorphin Pro": "https://www.techradar.com/news/saucony-updates-its-fastest-ever-carbon-running-shoe-with-a-new-fit",
    "running shoe": "https://www.techradar.com/best/best-running-shoes"
  }
}