{
  "source": "https://www.techradar.com/reviews/asus-rog-strix-g15-amd-advantage-edition",
  "title": "Asus ROG Strix G15 AMD Advantage Edition review",
  "category": "computing",
  "updated": "2021-06-01T03:00:08Z",
  "author": "bill-thomas",
  "summary": "AMD's swing at the high-end gaming laptop is here",
  "verdict": "Despite some bugs and a dated design, the Asus ROG Strix G15 might be one of the best value gaming laptops in its class. If you're after some seriously powerful gaming performance, you should keep an eye on this one – but only if you're comfy being an early adopter.",
  "pros": [
    "Excellent performance",
    "Jaw-dropping battery life",
    "Good build quality",
    "Plenty of ports"
  ],
  "cons": [
    "Some growing pains",
    "Divisive design",
    "Heavy charging brick"
  ],
  "article": [
    "The best gaming laptops, for years, have been dominated by Intel and Nvidia hardware, something that only really started to change in 2020 when AMD launched its Ryzen 4000 laptop processors. The Asus ROG Strix G15 is the next step in that direction, launching with not only Ryzen 5000 series processors, but paired with the latest high-end Radeon graphics announced at Computex 2021.",
    "So, admittedly, there's a lot riding on this gaming laptop, as it is going so against the grain of the hardware we typically see in devices like this, especially in its price range. We're not sure yet exactly how much the Asus ROG Strix G15 is going to cost when it hits the streets, but we have been told that it will cost around $1,650 (about £1,160, AU$2,130). That's a pretty high price, and puts it in between the Razer Blade and Asus' own Zephyrus G14, both of which are some of the best gaming laptops in the world right now.",
    "And for the most part, this gaming laptop does hold its own against its competitors. You can get some pretty solid performance out of it, and battery life is straight-up incredible. But there are definitely some issues with this laptop that makes it hard to give it a solid recommendation. At the same time, though, it does show just how close AMD and Nvidia are right now when it comes to laptop graphics.",
    "At the time of writing we don't have a solid price tag for the Asus ROG Strix G15, but we have been given an estimated price of $1,650 (about £1,160, AU$2,130) for the AMD Advantage Edition - which is the configuration listed to the right.",
    "This configuration, with the AMD Radeon RX 6800M is meant to go head to head with laptops featuring the RTX 3070, which typically cost around the same as the Asus ROG Strix G15. In fact, we recently reviewed the Asus ROG Zephyrus G15, which has a very similar configuration, with a Ryzen 9 5900HS and an RTX 3070, but with a slower 165Hz display at $1,499 (£1,599, AU$2,599).",
    "This new AMD Radeon RX 6800M laptop does have better gaming performance - at least on paper - and a much faster screen. But you'll have to weigh those options against the extra $150 and see if that's worth it. With this level of hardware, we don't think a 300Hz display is going to be necessary for a vast majority of people, but if you're looking for a portable esports machine that won't break the bank, this might be it.",
    "If you were to close your eyes and imagine a gaming laptop, you probably wouldn't come up with something too far off from the Asus ROG Strix G15. This is as traditional a gaming laptop as you'll find today, even though it is on the nicer end of the gamer aesthetic.",
    "This gaming laptop is has an all-black colorway with red accents, both at the back of the laptop, and one that serves as a rubber foot for the laptop – which means you'll only see it when the laptop is upside down. That rubber foot also has some text engraved on it that says \"Back on Top\" next to the Asus ROG logo. So, yeah, this is very much a gaming laptop. That's not necessarily a bad thing, but if you don't want everyone thinking you're grinding away in World of Warcraft: Burning Crusade Classic every time you break out your laptop, this might not be for you.",
    "But while it does have a bit of a dated design aesthetic, don't go thinking that it's cheaply put together. The top of the laptop and the keyboard deck are aluminum, and while the keyboard deck does have a little bit of give, you really have to push down on it to make it flex.",
    "However, while the top of the laptop is aluminum, the bottom of the laptop still seems to be plastic, but it's at least of high quality. And then because it's a gaming laptop in 2021, there's a strip of RGB lighting that runs along the front of the laptop.",
    "There's also RGB lighting in the keyboard, and all of this lighting can be controlled through the the Asus Armoury Crate app, just like any other Asus gaming laptop.",
    "The keyboard itself is a delight. Nice, deep travel makes it great for playing games, including long grinding sessions in World of Warcraft Classic, getting ready for the new (old) expansion that comes out on June 1. It's not quite as good for long-form typing as many Ultrabooks, but it's perfect for gaming, and really, that's all you can ask for.",
    "The trackpad is also huge for a gaming laptop, more akin to what you'd find on an XPS 15 than a gaming laptop like this. And, what's more, is that it feels incredibly solid. A lot of gaming laptops will half-ass the trackpad, with clickers that feel squishy or wobbly, but everything about this trackpad feels premium. Kind of a waste in a laptop most people will be pairing with one of the best gaming mice, but we love that the trackpad feels good to use when we just want to get some light web browsing done.",
    "One of the biggest crimes of this laptop, especially considering its size, is the placement of the speakers. Despite the fact that there's plenty of space both on the sides and above the keyboard, the speakers instead fire out the bottom. This isn't that big of a deal if you're going to be playing games on a table like a normal person, but if you want to play some games or stream some Netflix while lying in bed, the sound will be extremely muffled.",
    "Although, if you ware using it on a table, the speakers themselves are actually fine. Like most laptop speakers, they lack bass, so you might want to use headphones if you're listening to music or playing a game with a lot of explosions.",
    "But that's not a big deal, because you're going to be wanting to use a gaming headset when you're gaming anyways, because when this laptop gets pushed, the fans can get pretty loud. It's definitely not enough that you're going to annoy everyone you live with, but they're definitely noticeable when under load.",
    "Luckily, when you unplug the laptop, it'll immediately shift into Silent mode, which cuts performance, but makes it much more tolerable to just sit and enjoy some content.",
    "As for ports, there's plenty to offer with the Asus ROG Strix G15. On the right side of the laptop, there are two USB-A ports and a combo 3.5mm audio jack. However, most of the ports are hiding on the back of the laptop, exactly where we like to see them in a gaming laptop. Back there you'll find another USB-A port, a USB-C Gen 3.2 port, HDMI, Ethernet and a dedicated charging port.",
    "Speaking of charging, wow is the brick charger heavy. Like, we pretty much expect every laptop in this class to have one, and luckily we've started moving away from laptops having two, but we were not ready for how heavy the Asus ROG Strix G15 charging adapter was. It could be that the months of lockdown have atrophied our muscles to the point where it seems heavier than it is, but even still, if you plan on traveling with this laptop, the heavy charger is definitely something you'll want to take into consideration.",
    "Packed with an AMD Ryzen 9 5900HX, 16GB of RAM and an AMD Radeon RX 6800M, it's no surprise that the Asus ROG Strix G15 is an absolute powerhouse of a gaming laptop.",
    "In its keynote debuting the Radeon RX 6800M, AMD specifically targeted the Nvidia GeForce RTX 3070, and, well, the 6800M crushes it. In pretty much every benchmark we throw at this laptop, it passes up Nvidia's GPU. In Metro Exodus, the Strix G15 passes the 73 fps that the 3070-equipped Asus ROG Zephyrus G15 manages, with 78 fps. That's just a 7% difference, but that's still a win for AMD.",
    "This happens in the synthetic benchmarks, too. In 3DMark Time Spy, the Strix G15 beats the the Zephyrus with 10,098 points to 9,333. It goes even further in Fire Strike, where it manages to beat the RTX 3080-equipped MSI GE76 Raider by 5%.",
    "It sounds like a dream machine, and in a lot of ways it is. However, either AMD or Asus has some kinks to work out here. Halfway through our testing, we started getting drastically reduced performance, we're talking 18 fps in Metro – much lower than the 78 fps it usually manages. We were thankfully able to get it back to normal with a simple reboot, but expect some growing pains.",
    "Earlier we talked about the absolutely massive power supply, but unless you're going to be out literally all day, because this is one of the longest lasting gaming laptops we've ever tested.",
    "The Asus ROG Strix G15 manages 11 hours and 23 minutes of battery life in the PCMark 10 benchmark, which simulates various real-world workloads you might encounter while doing office work. It falls a little under that in our video streaming test, where it manages just 9 hours and 22 minutes, but that's still a full 8-hour day and change.",
    "In years past gaming laptops like the Asus ROG Strix G15 would last just a couple hours, and it was just something you accepted due to the power of the hardware on offer. But with more and more gaming laptops breaking the 8 hour threshold, it's not unreasonable to expect all-day battery life out of a gaming laptop.",
    "Just like many other Asus gaming laptops over the last year or so, there's no webcam on the ROG Strix G15. If all you're after is a laptop to play the best PC games and nothing else, this probably won't be a big deal. However, if you're looking to stream or even just use this laptop for work and play, you'll have to spend extra to get an external webcam."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "19": "Performance",
    "23": "Battery life",
    "26": "Camera",
    "27": "Don't buy it if..."
  },
  "links": {
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Computex 2021.": "https://www.techradar.com/news/computex-2021",
    "AMD Radeon RX 6800M": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "Asus ROG Zephyrus G15": "https://www.techradar.com/reviews/asus-rog-zephyrus-g15",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "MSI GE76 Raider": "https://www.techradar.com/reviews/msi-ge76-raider"
  }
}