{
  "source": "https://www.techradar.com/reviews/fitbit-versa-review",
  "title": "Fitbit Versa review",
  "category": "fitness",
  "updated": "2021-03-11T14:22:18Z",
  "author": "lee-bell",
  "summary": "An affordable alternative to the Ionic",
  "verdict": "While its feature set isn’t quite on par with that of its bigger brother the Ionic, the Fitbit Versa feels like the same watch but with a lighter and friendlier design and a much lower price point.",
  "pros": [
    "Lightweight design",
    "Fitbit’s most customizable wearable",
    "Relatively low price"
  ],
  "cons": [
    "Rounded design won't suit everyone",
    "Battery life not as good as Ionic",
    "No GPS"
  ],
  "article": [
    "When it was first unveiled, the Fitbit Versa was positioned by the San Francisco-based health tech firm as a smartwatch, with a lighter design in comparison to previous devices, more personalization options, and with a battery life of over four days.",
    "Since then, we've seen the company also introduce the Fitbit Versa Lite - a pared down and cheaper version of the device you're reading about here - as well as the Fitbit Versa 2 and Fitbit Versa 3, which build upon the original device and are among the best Fitbits you can buy today.",
    "These newer models have expanded what the company's fitness trackers can do, but it's more expensive than this original watch and many will still find the Versa a suitable option for their wrist.",
    "Read on below to learn everything that stands out about the Fitbit Versa and how we feel about the smartwatch.",
    "The Fitbit Versa is a cheaper alternative to the company’s flagship Ionic smartwatch, which was its most expensive wearable to date when it was released in late 2017.",
    "Priced at £199.99 / $199.95 / AU$299.95 at launch, it was pitched as a replacement of the Fitbit Blaze running watch, and we've seen the price of the Fitbit Versa drop over time.",
    "It reached £130 in the UK and $150 in the US. The price isn't always that low, but the point is you can shop around for a better deal than the standard selling price.",
    "Then there's also the Fitbit Versa Lite. It's a remarkably similar product, but loses a few features such as swim tracking and music to bring the price down to $159.95 / £149.99 / AU$249.95. We've seen that price drop with time, but if you can find the original Versa for less than the Lite it's worth opting for this watch instead.",
    "The Fitbit Versa is available in silver, black or rose gold as well as several watch strap color combinations.",
    "For the Versa, Fitbit hasn’t just updated the design of one of its previous or existing wearables; it’s given it a completely fresh look and perhaps one that seems more Pebble-like and Apple Watch-esque than any of the company's previous devices.",
    "It boasts what Fitbit is calling a ‘Squircle’ watch face design, that is, a square face with rounded edges - in case you needed that spelling out.",
    "Despite its silly design name, the Versa is a much more handsome and friendly-looking watch than many of the firm’s previous devices, especially the Ionic, which we have to admit we weren’t the biggest fans of.",
    "In comparison, the Versa is pretty nondescript and thus harmless looking, ensuring your eyes are left to concentrate more on what’s happening on the display than around it.",
    "Although we loved it, it's worth noting that the 'Squircle' might not appeal to everyone.",
    "The Versa isn’t only aesthetically pleasing, but probably one of the most comfortable smartwatches Fitbit has made thanks to its lighter weight.",
    "Fitbit claims the Versa is one of its lightest smartwatches yet due to its ultra-thin, anodized aluminum case and slightly tapered and angled design that has been built to fit small or large wrists.",
    "However, this lightweight material does make it feel a little cheap at times, something to keep in mind if you’re wanting the Versa to be more of a lifestyle watch and you like the weighty, premium build of fancy watches.",
    "On the left-hand side the Versa sports one main wake-up/back button, while on the right there are two smaller pause and finish workout buttons. These are easy enough to press and proved to work perfectly while using the Versa for both focused exercise and day-to-day wear.",
    "The traditional watch-style clasp is super easy to fasten and release, while retaining a good grip during intense workouts; something we prefer to those modern button-style straps some smartwatches and activity trackers have these days.",
    "As with the Ionic, these straps are also interchangeable with many different colored metal, fabric or silicon versions in case you want to change up the watch style entirely.",
    "As for the Versa’s display, it’s a vibrant, colorful touchscreen with a brightness up to 1,000 nits. This means that even in direct sunlight or underwater it’s easily visible, even when not turned up to the maximum brightness capacity.",
    "Touch commands also seem to be much improved over the Ionic, which seemed to suffer a little from latency. Now commands seem to be fluid and uninterrupted.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "4": "Fitbit Versa price and release date",
    "9": "Fitbit Versa design and display"
  },
  "links": {
    "Fitbit Versa Lite": "https://www.techradar.com/reviews/fitbit-versa-lite-review",
    "Fitbit Versa 2": "https://www.techradar.com/reviews/fitbit-versa-2-review",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "best Fitbits": "https://www.techradar.com/best/the-best-fitbit",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Blaze": "https://www.techradar.com/reviews/wearables/fitbit-blaze-1312660/review"
  }
}