{
  "source": "https://www.techradar.com/reviews/hp-officejet-pro-9010e",
  "title": "HP OfficeJet Pro 9015e/9010e review",
  "category": "computing",
  "updated": "2021-06-24T10:21:45Z",
  "author": "jim-hill",
  "summary": "Prompt office printer with HP+ appeal",
  "verdict": "HP’s fast 4-in-1 has all the key features and comes with a fairly low per-page cost, so long as you take out an HP+ subscription.",
  "pros": [
    "Duplex print and scan",
    "Strong app support",
    "HP+ eligible",
    "Rapid print rate"
  ],
  "cons": [
    "No multipurpose tray",
    "Duplex mode is slow",
    "Visible horizontal lines"
  ],
  "article": [
    "HP’s latest OfficeJet Pro printers, aimed at small workgroups in a small office, are the first to come with HP+. Like an expanded Instant Ink subscription, if you opt into HP+, you will receive replacement ink cartridges in the mail before you run out. But now the first six months are free and you’ll get an extra year on your warranty. Some other smart features are unlocked with HP+ which we will explain in this review.",
    "Firstly, as ever, HP confuses matters by releasing the same product with a different designation in different territories. So this printer is known as the 9015e across North America, but is referred to as the 9010e in Europe.",
    "The HP OfficeJet Pro 9015e/9010e comes with a fax facility and a 35-page ADF (automatic document feeder) that can scan both sides of the page automatically. It’s a fast inkjet printer with room for 250 sheets of A4, self-healing Wi-Fi and a touchscreen interface. At around £175 (US$229, AU$329), it’s competitively priced and with an HP+ subscription discounting the cost of your cartridges by around 70 percent, it’s quite economical to run too.",
    "With its crisp corners and two-tone basalt colour-scheme, the HP OfficeJet Pro 9015e/9010e looks rather smart. It’s quite compact and it runs quietly, so it would suit a home office well. Apparently 15% of the plastic used in its construction is recycled and if you sign up to HP+, you can return your spent cartridges for closed-loop recycling too.",
    "The tilting touchscreen is rather small, but still more convenient than hard buttons, while the main paper tray has a reasonable capacity of 250 sheets.",
    "The 35-sheet ADF on top gives the HP OfficeJet Pro 9015e/9010e a slightly top-heavy look, but it means it can automatically scan and copy both sides of any documents placed in it.",
    "The HP OfficeJet Pro 9015e/9010e comes with clear printed quick start instructions, but you probably won’t need them.",
    "Simply turn the power on and the colour display prompts you to set the time and location and to install the four ink cartridges. You can then use the HP Smart software on your phone or computer to complete the setup procedure. This includes an effective calibration process where the printer runs off a test page and then examines the results under its own scanner to check that the print heads are aligned. Our sample was perfectly aligned first time.",
    "In operation, the HP OfficeJet Pro 9015e/9010e works smoothly and quietly and is easy to use thanks to the small, but sensitive touchscreen and the HP Smart app. The app presents all of the usual function in a very intuitive way and also allows you to set up shortcut commands on the home screen of the printer. If you frequently find yourself signing loan agreement forms for example, you can use the app to program one icon, which when pressed, will scan and send your signed document to your preferred email address.",
    "The HP OfficeJet Pro 9015e/9010e performed fairly well in all of our tests, turning out consistently crisp printed pages at a fair old clip. The 22ppm claim for mono simplex pages is accurate enough although it slows right down when you are auto duplexing both sides of the paper.",
    "Plain black text appears bold and legible right down to the smaller point sizes. When larger areas of black ink are called for, however, you can clearly see horizontal lines spoiling black and white pictures. When printing in colour, these lines are invisible, so colour documents and photographs look fine. Photos on glossy photo paper do not have such a strong sense of depth and detail as most photo printers can manage though, so we wouldn’t recommend this model if that’s what you were intending.",
    "As a photocopier, the HP OfficeJet Pro 9015e/9010e works very well. The scan resolution perfectly matches the print resolution while the scanner’s easy slide-off glass lets your documents glide on and off the scanner bed with ease.",
    "If you use the ADF instead of the flat bed, you can duplicate both sides of the document automatically.",
    "The HP OfficeJet Pro 9015e/9010e is as smart as it looks and includes all of the key features a small business could need in a keenly priced package. It’s not great at photos on photo paper, but in other areas the print quality is high and, if you take out an HP+ subscription, the running cost for a cartridge-based printer is low. With the rapid 22ppm print rate and features such as Private Print and customizable keys, it would suit a small office well."
  ],
  "headers": {
    "3": "Design and build",
    "6": "Setup and operation",
    "9": "Performance",
    "13": "Final verdict"
  },
  "links": {
    "HP+": "https://www.techradar.com/news/hp-streamlines-the-printing-experience-with-new-service",
    "HP OfficeJet Pro 9015e/9010e": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1052080413090749600&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fshop%2Fpdp%2Fhp-officejet-pro-9015e-all-in-one-printer",
    "inkjet printer": "https://www.techradar.com/news/best-inkjet-printers"
  }
}