{
  "source": "https://www.techradar.com/reviews/allclear-id",
  "title": "AllClear ID review",
  "category": "computing",
  "updated": "2021-03-18T15:30:55Z",
  "author": "john-brandon",
  "summary": "A low price can’t hide the fact that AllClear ID is a confusing product",
  "verdict": "AllClear ID is not exactly sending clear signals. A confusing website that barely explains what the product even does, an enrollment process that mostly assumes you have a free code from your employer, and a lack of clarity around the services provided make it hard to recommend. At only $14.99 per month, it seems like a bargain. There’s even a Basic monitoring version that is free to use. However, almost every other identity theft protection app provides more information and guidance both on the website and in the application itself.",
  "pros": [
    "Low price"
  ],
  "cons": [
    "Confusing website",
    "Confusing service plans"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "When it comes to protecting your identity, the worst thing you can experience is confusion. There is already anger and chaos over being hacked and losing access to a bank account. There’s consternation about damaging your credit history and credit score. We’re living in an age when criminals can cause devastation and heartache -- not to mention being in the middle of the coronavirus pandemic. It’s not the best time to have to deal with identity theft.",
    "That’s why AllClear ID is such a frustrating product. With a low price and even a free version, you might be tempted to jump on board. What harm can it do? And yet, the website for the product and the product itself don’t provide nearly enough guidance. Even when you go to choose between the Pro plan and the Basic plan, you won’t see a comprehensive list of what is available with each plan, only a quick paragraph that summarizes the differences.",
    "Even worse, the product seems geared for those who have a code from an employer who provides AllClear ID as part of a benefit package. (A report in Tom’s Guide from 2016 mentions that the non-employer version doesn’t even work anymore.) The website and app include the bare minimum in details about the protection available, and a blog that appears to offer financial and online protection guidance ends up feeling too generic. (Here’s one about voice assistants that is full of blanket statements and fear-mongering without any actual details.)",
    "AllClear ID offers two different plans but fails to spell out exactly how they differ. Confusingly, when you register, there’s one paragraph that claims what the free Basic plan provides (mostly identity theft monitoring) and then what the Pro plan for $14.99 offers (mostly credit monitoring) but then has one list that seems to apply to both pricing plans. Worse yet, when you actually try to enroll, there’s a pop-up where you select Basic or Pro but the registration process still doesn’t clarify what is available specifically as part of each plan. It’s a shot in the dark.",
    "A clunky interface that looks like it could double as a website from 1998 doesn’t help. There are bright blue links on a white background, and you will have a hard time figuring out what to click on and how the features even work. We’re a long way from the wizards and step-by-step guidance of Norton LifeLock, which shows the status of identity protection in a clean and professional interface.",
    "There’s something disconcerting and even troubling about a product that relies mostly on a series of generic blog posts meant to help users. Identity theft is a serious issue, one that causes credit problems and makes it hard to buy a home or a car. If a criminal steals your identity, it may even be difficult to secure a new job. There’s a greater need for clear information on the company website and within the app than a photo editing app or a task manager - we’re talking about a highly personal problem if you are an identity theft victim.",
    "AllClear ID claims to offer some fairly standard features, but as mentioned already, it’s not clear which specific functions are included in the Basic plan and the Pro plan. There’s the typical fraud alerts (but no explanation of how they work or what they are tracking). You receive an annual TransUnion and VantageScore 3.0 credit report, but it’s not clear if you can also review a credit score. (You have to guess whether the credit reporting is only part of the Pro plan.) There’s a feature called ChildScan Monitoring but it’s not at all obvious what this does.",
    "There is a lot of competition in the identity theft protection field, and AllClear ID failed to make a convincing argument about its appeal or even an ability to compare favorably with any of the apps currently available. Norton LifeLock provides far more information about the features available and a clear, highly usable interface that walks you through every step. Complete ID is far more affordable if you are already a Costco member. Even the apps from Equifax and Experian are more compelling, despite both companies announcing data breaches, because at least they spell out which features are available and what the product does.",
    "As you can guess by now, AllClear ID has some issues. It’s confusing to figure out which features are even available, even if you have an enrollment code from your employer. The interface is old and clunky, like a tax program from the 90s. It’s not even clear if you receive a credit score or merely a credit report that lists potential problems.",
    "As for actually resolving issues, AllClearID doesn’t spell out what will happen if you are an identity theft victim. Confusing features like ChildScan Monitoring might be helpful but it’s not clear what that does. Even the wording on the website is confusing - one feature listed is Fast and Secure Phone Alerts which sounds like you will receive alerts on your phone about - who knows? That isn’t clear. In the end, it could make identity theft even more confusing than it already is."
  ],
  "headers": {
    "4": "Plans and pricing",
    "5": "Interface",
    "7": "Features",
    "8": "The competition",
    "9": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "AllClear ID": "https://www.allclearid.com/identity-protection-services/",
    "non-employer version doesn’t even work anymore": "https://www.tomsguide.com/us/allclear-id-pro,review-2811.html",
    "about voice assistants": "https://www.allclearid.com/digital-assistants-might-share-think/",
    "Basic plan": "https://enroll.allclearid.com/registration/profile?cid=245",
    "Pro plan": "https://enroll.allclearid.com/registration/profile?cid=245",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "Complete ID": "https://www.techradar.com/reviews/complete-id"
  }
}