{
  "source": "https://www.techradar.com/reviews/disconnect-premium-vpn",
  "title": "Disconnect Premium VPN review",
  "category": "computing",
  "updated": "2021-07-09T14:42:21Z",
  "author": "sead-fadilpasic",
  "summary": "Blazing speeds, but many limitations",
  "verdict": "Disconnect Premium is great, if you own an Apple device and are looking for top VPN speeds. Unfortunately, you won’t be able to use it to unblock localized Netflix and BBC iPlayer libraries, nor for torrenting, and its apps are rather basic.",
  "pros": [
    "Superb download speeds",
    "30-day money-back guarantee",
    "Very user-friendly"
  ],
  "cons": [
    "Not many VPN locations",
    "Can’t unblock BBC iPlayer, Netflix",
    "Basic apps",
    "Doesn’t allow torrenting"
  ],
  "article": [
    "Disconnect Premium is a provider of VPN services for owners of Apple iOS and macOS devices. Its stated mission is to provide people with the freedom of the internet, without anyone looking over their shoulder.",
    "This VPN solution is available under three subscription options. As usual, the cheapest is also the longest - a one-year plan at $4.17/month ($50 billed every year). Other options include a six-month and one-month plan.",
    "Regardless of which duration you opt for, you’ll be able to ask for a refund at any time during the first 30 days, no question asked.",
    "With one account, you’ll be able to cover up to three devices at the same time.",
    "Unfortunately, the only accepted payment method is credit/debit card, which doesn't offer the same level of control as PayPal, nor the privacy of cryptocurrencies.",
    "While Disconnect Premium provides wonderful download speeds that match the best VPN providers in the industry, it still lacks plenty of features offered by the likes of ExpressVPN, NordVPN, Surfshark and CyberGhost.",
    "These include feature-abundant apps for all platforms, thousands of servers, Netflix and BBC iPlayer unblocking capabilities and torrenting support, to name just a few.",
    "While many VPN solutions can give you access to geo-restricted content on BBC iPlayer and Netflix, Disconnect Premium isn’t one of them. We tried connecting to the relevant servers but these services saw right through us and recognized our true location.",
    "Disconnect was founded in 2011 and is currently headquartered in San Francisco, California.",
    "Although the website claims that Disconnect Premium “utilizes servers in over 180 locations and 80+ countries\", we only witnessed six VPN locations in the app itself: California, Frankfurt, London, New York, Singapore, and Toronto.",
    "Customer support told us the provider actually has about 100 servers/IP addresses, with each of the locations we listed above having multiple servers users can connect to.",
    "To protect your privacy, Disconnect Premium deploys AES 256-bit encryption, along with 2048-bit DH for key exchange to support perfect forward secrecy, as well as the IKEv2/IPSec connection protocol.",
    "Since there isn’t any mention of torrenting or P2P on the website, and considering the provider’s location in the US, we can assume that these activities are forbidden and recommend you refrain from them if and when you use this VPN service. Our assumptions were later confirmed by customer support.",
    "Disconnect claims that it “never logs, tracks, or collects any of your online activity or personal information, except the information you explicitly volunteer (like if you decide to email us)\". This is detailed in the Privacy Policy, where we also learn that it won't collect any of your personal info, including your IP address, other than the information you voluntarily provide.",
    "While this all sounds nice, it would be even better if Disconnect opened its doors to outside auditors to verify these claims.",
    "Disconnect Premium only has apps for iOS and Mac.",
    "At the time of writing, the Mac app has 3.1 stars (out of 5), as rated by 30 people. Its version history shows it is updated fairly regularly, with three updates rolled out in the month before this review. The iOS app is rated 3.5 stars by 45 users and is also regularly updated.",
    "Unfortunately, there aren’t many ways to contact customer support - only by email. However, we found this a pretty decent option as the provider took around one hour to respond to our queries.",
    "There’s also a blog that contains news and updates from the VPN world and Disconnect itself. You can also take a look at its Twitter profile or even GitHub page, where you can analyze some parts of its platform.",
    "Despite some problems we had with upgrading the service at the beginning, our experiences with this VPN platform were rather nice, primarily in terms of download speeds. Connecting went smoothly, but unfortunately there weren’t many options and settings in the app.",
    "To conduct our tests, we used a 70Mbps testing connection from a location in Southeast Europe.",
    "The VPN delivered some surprising speeds, starting with a blazing 59.87Mbps from a server in Frankfurt. Although the London speeds dropped off a bit at (a still very fast) 36.23Mbps, the situation improved when we connected to a server in New York, which gave us a superb 56.96Mbps. Finally, we decided to hop over to Singapore, which also delivered amazing results, at 55.27Mbps.",
    "Disconnect Premium offers amazing download speeds that are well above the industry average and also offers a generous no-questions-asked money-back guarantee. In this sense, it even stands shoulder-to-shoulder with the VPN heavyweights.",
    "However, this is where any similarities end and we start to notice its disadvantages. It has limited server infrastructure, no unblocking capabilities for popular streaming content, no torrenting support, some of the most basic apps we’ve seen, and it's only available for Apple devices."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "11": "Privacy and encryption",
    "15": "Support",
    "19": "Speed and experience",
    "22": "Verdict"
  },
  "links": {
    "Disconnect Premium": "https://disconnect.me/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://disconnect.me/privacy",
    "Mac app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8593468197096126000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fdisconnect-premium%2Fid1333277187",
    "iOS app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9512377187839992000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fid935480186",
    "email": "mailto:support@disconnect.me",
    "blog": "https://blog.disconnect.me/",
    "Twitter": "https://twitter.com/disconnectme",
    "GitHub": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9806588878178083000&xs=1&url=https%3A%2F%2Fgithub.com%2Fdisconnectme&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdisconnect-premium-vpn"
  }
}