{
  "source": "https://www.techradar.com/reviews/zeeker-p10-rugged-smartphone",
  "title": "Zeeker P10 rugged smartphone review",
  "category": "phones",
  "updated": "2021-12-03T19:53:23Z",
  "author": "desire-athow",
  "summary": "A newcomer with an industry leading 108-megapixel camera sensor",
  "verdict": "The Zeeker P10’s main selling point is its 108 megapixel camera sensor. That’s probably the only reason why you will consider this smartphone. Otherwise, it is a decent proposal, only just though, and the below-average performance coupled with a rather high price tag, make it a tough sell.",
  "pros": [
    "IR camera",
    "Solidly built",
    "108 megapixel camera sensor",
    "Competitively priced if you’re after a 108-megapixel camera"
  ],
  "cons": [
    "One speaker",
    "Custom UI not to our taste",
    "Performance is very average",
    "Separate power button and fingerprint sensor"
  ],
  "article": [
    "This newcomer to the rugged smartphone market made an entrance with a visual bang, one with the highest pixel count on any camera sensor, 108 million to be exact (12,000 x 9,000) which is more than three times the resolution of an 8K screen (or 13 times that of 4K). That is the headline feature and one that is worthwhile if you are after a rugged smartphone that can take ultra high resolution photos. Another feature that didn’t get that much attention is the 8-megapixel infrared night vision sensor that could be useful for nocturnal journeys.",
    "For the rest though, there’s evidence of some corner cutting. For a start, the 4G-capable Mediatek Helio G85 is slower than the Mediatek Dimensity 700 found in a number of cheaper 5G smartphones like the Doogee V10 or the Ulefone Armor 12 5G. The amount of onboard RAM and system storage is also less than we’d expect on a phone costing $370.",
    "Overall, if you don’t need the high pixel count, there are definitely cheaper rugged options out there. And should you be looking for a more affordable 108-megapixel camera, the Xiaomi Redmi Note 9 Pro 5G is a more balanced smartphone with a longer warranty and 5G.",
    "The Zeeker P10 is available from Amazon US for as little as $370 with free shipping. You can also buy it from AliExpress for roughly the same price but read this first if you're considering doing so.",
    "Zeeker embraces the utilitarian approach of the traditional rugged smartphone design. Plenty of plastic and textured surfaces with a dash of fluorescent colour, wrapping up a metal frame. Going down that route has one big advantage, economies of scale. By adopting a design that’s very close to the competition, you minimize the amount of potential mistakes, cut down on the bill of material and reduce time-to-market. On the other hand, there’s no big differentiators as far as the shape and design are concerned.",
    "The phone’s display is a 6.49-inch FHD+ covered by a layer of Corning Gorilla glass. It is a tad oleophobic, definitely better at avoiding greasy fingerprints compared to say, the Samsung Galaxy Note 9. Near its top is a status LED and a punch-hole selfie.",
    "On the left edge is a SIM tray and a custom button while the right edge is located a fingerprint reader, the power button and the volume rocker. At the bottom, a flap hides a USB Type-C connector as well as a headphone jack.",
    "At the rear of the device is the crown jewel, a huge 108-megapixel camera sensor courtesy of Samsung. The ISOCELL HM2 has found its way in a wide range of premium smartphones like the Honor 50, the Motorola Edge 20 but no Samsung devices to date. There’s an 8-megapixel night vision camera, an 8-megapixel ultra wide camera and a 2-megapixel camera with an array of infrared LED and LED flash. Further down below is the grill that hides a single speaker.",
    "At 173 x 81 x 15mm for a weight of 317g, it is reasonably light for a rugged smartphone with this screen size. Our current champion is the 6.67-inch Nokia XR20 which weighs just 248g. As expected, the Zeeker P10 is MIL-STD-810G and IP68/IP69K rated.",
    "A Mediatek G85 system-on-chip lies at the heart of the P10 and while it is a capable chip, it is still barely mainstream when it comes to sheer performance. Zeeker added 6GB of RAM and 128GB eMMC 5.1 (the faster version).",
    "As far as connectivity is concerned, there’s Bluetooth 5.0, NFC and Wi-Fi 5. A 6000mAh battery powers the smartphone and it is fed by either a 18W fast charging option and 15W wireless charging. In the box was a screen protector, a fast charger, an OTG cable, a USB cable and a pair of earphones.",
    "Zeeker developed its own UI, Zeeker UI, which is an overlay that sits on Android 11. Zeeker says that it is fast, clear and practical. In use, we didn’t see much of a difference although the bundled apps and features seem to be a bit of a deja vu. There’s the outdoor toolbox and the kids/children space as well as Duraspeed; the first one is a collection of apps (compass, barometer, sound meter etc) aimed at field workers, DIYers and outdoor dwellers. The second one allows you to set up a restricted secondary virtual phone and is ideally suited for a guest user (e.g. children) while the third one allows you to freeze apps in the background.",
    "You won’t buy that phone because you are an avid player. The wide range of tests we put the P10 through don’t lie. In the majority of benchmarks, Zeeker’s inaugural rugged smartphone delivers some of the poorest scores in recent memories we’ve seen on 3DMark. Sandwiched between the XR20 and the Ulefone Armor 8 Pro. Not catastrophic but something to be aware of.",
    "Buy it if:",
    "You want a rugged phone with a big camera sensor",
    "That’s the only reason you’d buy this phone. It’s rugged and it has a wonderful 108-megapixel camera sensor plus an underrated IR camera sensor.",
    "Don’t buy it if:",
    "You want 5G connectivity",
    "Despite its relatively high price, the Zeeker P10 doesn’t do 5G.",
    "You want a rugged smartphone with mid-range performance",
    "While we didn’t encounter any significant issues with day to day usage, the Zeeker P10 is simply too slow for this price. We’d rather sacrifice the screen for a 5G capable Dimensity 700 SoC.",
    "We've also rounded up the best rugged smartphones and best rugged tablets"
  ],
  "headers": {
    "0": "Two minute review",
    "3": "Pricing and availability",
    "4": "Design",
    "9": "Hardware",
    "11": "Performance and in use",
    "13": "Should I buy the Zeeker P10?"
  },
  "links": {
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "Doogee V10": "https://www.techradar.com/reviews/doogee-v10-rugged-smartphone",
    "Ulefone Armor 12 5G": "https://www.techradar.com/reviews/ulefone-armor-12-5g-rugged-smartphone",
    "Xiaomi Redmi Note 9 Pro 5G": "https://www.techradar.com/news/redmi-note-9-5g-launch-date",
    "Zeeker P10": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB09F9RM3LM%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1090208799273629300-20",
    "AliExpress": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-1180764250707267800&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F1005003292399352.html",
    "read this first": "https://www.techradar.com/news/world-of-tech/want-to-buy-tech-from-online-chinese-retailers-read-this-first-1324890",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Honor 50": "https://www.techradar.com/reviews/honor-50-review",
    "Motorola Edge 20": "https://www.techradar.com/reviews/motorola-edge-20-lite",
    "Nokia XR20": "https://www.techradar.com/reviews/nokia-xr20-5g-rugged-smartphone",
    "Ulefone Armor 8 Pro": "https://www.techradar.com/reviews/ulefone-armor-8-pro-rugged-smartphone",
    "best rugged smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "best rugged tablets": "https://www.techradar.com/news/the-best-rugged-tablets"
  }
}