{
  "source": "https://www.techradar.com/reviews/angellist",
  "title": "AngelList review",
  "category": "computing",
  "updated": "2021-10-28T18:25:54Z",
  "author": "mike-jennings",
  "summary": "The best option if you want a job at a fast-moving startup",
  "verdict": "If you're interesting in working for a startup or tech company, AngelList provides a wealth of additional information including funding and equity options that you just won't find on other job sites. However, if you're looking for a new position in another industry, you'll likely be better off looking elsewhere.",
  "pros": [
    "Impressive startup listings",
    "Transparent and full of data",
    "Helpful quizzes and profile options"
  ],
  "cons": [
    "Relatively small jobs database",
    "Not ideal if you don't want a startup position",
    "Some missing features"
  ],
  "article": [
    "AngelList has only been around since 2010, so it’s one of the newer names on the scene when it comes to the big job sites. It’s also one of the most interesting job-hunting projects around, because it’s one of the few job sites that’s dedicated to the startup scene.",
    "It makes perfect sense for a job site to focus on startups. There have never been so many nimble, successful and fast-growing tech firms, and there have never been more people who want to work at them – and all of those people will be perfectly versed at finding jobs online.",
    "AngelList’s mission is to make startup hiring fairer and more equitable. That’s refreshing, because too often the startup scene relies on nepotism and networking rather than talent and experience.",
    "At the time of writing there are more than 130,000 jobs on the site, and those positions are obviously found in startup companies and tech firms – and the firm’s database includes big companies like Revolut, Mozilla and Squarespace.",
    "That’s no surprise considering AngelList’s focus on these markets, and it does mean that AngelList has a great database of relevant jobs at top-notch companies. Negatively, though, this site doesn’t have the millions of job openings listed by some rivals, like LinkedIn Jobs or Monster, and it’s not much good if you don’t want to work in a tech company or at a startup.",
    "There are other areas where AngelList makes up for its lack of a huge jobs database. The site places a big emphasis on transparency, which means that job listings have salaries and equity options displayed up-front. That’s not the only helpful information you’ll see on job listings, either: AngelList displays how much investment a company has raised, information about the company culture, the size of the company and the markets where it operates. Work from home options are shown if applicable, and the site lists if companies are willing to sponsor visas.",
    "Job listings have tags that show if companies are hiring, if they’ve been recently funded and if they share any investors with other big-name startups. Other tags illustrate if a company is highly rated by the site’s users, or if it has good scores for leadership and work/life balance. The transparency continues elsewhere – you can see profiles of staff members and see who’ll read your application if you apply.",
    "It’s possible to use your AngelList profile as your resume, and there are sections to add your relevant history, skills and education. You can also list your website and social profiles. You can list what roles you’re interested in, add a small biography and indicate if you’re currently open to job offers.",
    "Elsewhere, many of the profile options are unsurprisingly startup-focused. There are questions about VISA sponsorship and the size of companies you’d like to consider, and you can link your GitHub profile. The Culture section of your profile allows users to set out their ideal workplace, which is handy for finding an environment where you’re more likely to be happy.",
    "AngelList also has other handy features and innovative additions on the rest of its site. You can specify if you’re looking for full-time work, contract positions, or an internship, and there’s an extensive quiz where you can match your preferred work environment and career goals to suitable workplaces. There are also skills assessments, like on most other job sites.",
    "There’s a lot to like about AngelList, but in other areas the site is potentially divisive. It has a straightforward interface that presents job openings like search results, but those results are a bit busy and filled with potentially unhelpful information like news articles.",
    "It doesn’t have as many features as LinkedIn Jobs and Glassdoor – you won’t find learning resources, interview prep modules or proper social networking here. And, of course, AngelList’s focus on startups means that it doesn’t have the breadth of opportunities you’ll find on mainstream sites.",
    "AngelList has thought of everything when it comes to startup recruitment. That makes it the best tool available if you want to work in the startup scene, and especially if you want a position at a tech company. If that sounds like you, then this should be your first port of call.",
    "It’s undoubtedly excellent for startups, and it’s got some good features – but if you want a broader look at the job market, you’d be better off looking elsewhere."
  ],
  "headers": {
    "2": "Features",
    "12": "Final verdict"
  },
  "links": {
    "AngelList": "https://angel.co/",
    "job sites": "https://www.techradar.com/best/us-job-sites",
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "LinkedIn Jobs": "https://www.techradar.com/reviews/linkedin-jobs",
    "Monster": "https://www.techradar.com/reviews/monster",
    "Work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Glassdoor": "https://www.techradar.com/reviews/glassdoor",
    "social networking": "https://www.techradar.com/best/best-business-networking-apps"
  }
}