{
  "source": "https://www.techradar.com/reviews/amazon-music-hd",
  "title": "Amazon Music HD review",
  "category": "audio-visual",
  "updated": "2021-06-09T14:44:52.190Z",
  "author": "becca-caddy",
  "summary": "Great value music streaming with high-quality audio and a huge library",
  "verdict": "Amazon Music HD is Amazon’s top tier music streaming service. It boasts more than 70-million tracks with an easy-to-use interface and CD-quality streaming and Ultra HD audio files on offer. It might not be as slick as the competition, and recommendations could be better, but this is a solid option for those who care about quality listening and plenty of choice.",
  "pros": [
    "Huge selection of music",
    "Great for people with Prime",
    "Hi-res audio",
    "Simple and easy-to-use"
  ],
  "cons": [
    "Not as good-looking as the competition",
    "Music discovery is good, not great",
    "No video content",
    "No free ad tier"
  ],
  "article": [
    "Over the years, Amazon has launched several different streaming services. The best, which competes with the likes of Spotify and Apple Music, is Amazon Music HD.",
    "This is a high-quality music service to rival audiophile-grade services, like Tidal, at a great value price. It brings users lossless FLAC audio at 24-bit/192kHz, while many other services only offer 320kbps. Amazon recently announced that Amazon Music Unlimited subscribers can now upgrade to the high-quality streaming audio – which used to be reserved for Amazon Music HD subscribers – for free.",
    "If you have Amazon Prime, you get a discount (it’s $7.99 / £7.99 / AU$6.99 per month rather than $9.99 / £9.99 / AU$11.99 per month), and Amazon Music HD has good Alexa integration. That means if you already use Amazon and its products, this music streaming service makes a lot of sense. Even if you don’t, this is a good value option with hi-res audio and a solid library of tunes.",
    "Amazon Music HD is a music streaming service from Amazon. But things can get confusing because it isn’t the only music streaming service Amazon offers.",
    "There’s also Amazon Music Prime, which brings Amazon Prime members free music streaming of more than two million songs.",
    "If that’s not enough, you can subscribe to Amazon Music Unlimited – this is an extra payment, even if you’re a Prime member. Think of this as music streaming lite. With a membership, you can access more than 70 million tracks, listen to them ad-free, and download them for offline use.",
    "Then there’s Amazon Music HD. Think of this as a premium add-on to Amazon Music Unlimited, which brings you all the benefits of a music streaming service, along with CD-quality audio and many Ultra HD audio files.",
    "Amazon Music has said that from now on, its high-quality streaming tier is going to be available to all Amazon Music Unlimited subscribers without an accompanying price hike.",
    "Amazon’s announcement came on the same day as Apple’s. The brand announced a slew of upgrades to its Apple Music streaming service, including Spatial Audio with support for Dolby Atmos and the ability to listen to over 75 million tracks in Lossless Audio.",
    "This means both Apple Music and Amazon Music might soon be the only music streaming services to offer hi-res audio as a standard and at no extra cost to subscribers to their current music streaming offerings. This will give them both a leg up over the competition, like Tidal and Deezer, which charge a premium for similar quality.",
    "The Amazon Music HD tier was previously an additional $5 / £5 per month for Amazon Music Unlimited subscribers. Now it’s free for customers in the US, UK, Germany, Canada, France, Italy, and Spain. Unfortunately, it doesn't seem to be available in Australia yet.",
    "To sign up for Amazon Music HD, you’ll need an Amazon Music Unlimited subscription.",
    "An individual plan is $7.99 / £7.99 / AU$6.99 per month if you’re a Prime member – or $9.99 / £9.99 / AU$11.99 if you don’t have Prime. These plans only allow you to listen to the service on one device at any one time.",
    "There’s also the option of a family plan, which allows six different people to listen to music all at once, for $14.99 / £14.99 / AU$17.99 a month.",
    "There’s no student subscription, which you tend to find on other services, and no free ad-based tier, although you can sign-up to a 30-day free trial.",
    "The price of Amazon Music HD makes it one of the best value services for hi-res audio. For example, Tidal HiFi costs $19.99 / £19.99 / AU$23.99 a month and offers a similar level of audio quality.",
    "Amazon Music HD offers lossless audio in two quality ranges: HD and Ultra HD, both of which are encoded by the lossless FLAC codec.",
    "As a quick refresher, lossless audio allows you to hear the full range of sound from recordings that have been mastered from better-than-CD quality music sources. Simply put, the sound you hear through Amazon Music HD more closely replicates the quality that the musicians and engineers were working with in the studio when recording compared to the highly compressed versions you might find on many other services.",
    "The lossless High Definition (HD) songs on Amazon Music HD have a bit depth of 16 bits and a sample rate of 44.1kHz. This is what’s called CD quality.",
    "You can stream more than seven million songs in Ultra HD on Amazon Music HD, with a bit depth of 24 bits, sample rates ranging from 44.1 kHz up to 192 kHz, and an average bitrate of 3730 kbps. This is better than CD quality.",
    "There are also songs – no word on the exact number at the time of writing – remixed in Dolby Atmos and Sony 360RA 3D Audio formats. However, you’ll need the right equipment to experience these formats – the Amazon Echo Studio smart speaker is one device that can handle both spatial audio technologies.",
    "Many other streaming services currently offer Standard Definition (SD) with a bitrate of up to 320 kbps. These audio files are compressed, and won’t reveal as much detail as less highly compressed sources.",
    "In contrast, Amazon Music HD brings you the original recording served up with a much higher quality sound. Or at least it’ll try to based on your network, which device you’re listening on, and whether you have the best headphones and speakers – they’ll need to support HD and Ultra HD playback to make the most of the sound quality on offer.",
    "Of course, many streaming services offer better quality tiers now – and Spotify might soon blow the competition out of the water with its high-quality HiFi tier. But Amazon Music HD does it as standard and at a lower price.",
    "When you’re browsing Amazon Music HD, you’ll see that every track is labelled with a small HD or Ultra HD badge. Click on this in the desktop or mobile app, and you’re shown what the quality of the track is, what quality the device you’re using is capable of bringing you, and what it’s playing at right now. If you’re not getting the quality you expect, take a look at your settings.",
    "This is a great way to prove you’re getting the quality you want – especially if you’re an audiophile and want to make sure you’re getting the best of the best consistently.",
    "There are more than 70 million songs in the Amazon music HD library at the time of writing. Most of these are HD, but more than five million are Ultra HD – and that number is growing.",
    "Spotify has 70 million tracks in its library, and Apple Music has 75 million, which means Amazon Music HD offers one of the best services in terms of choice. There’s nothing we couldn’t find that we enjoy listening to. This might be the case across many services these days, but it’s still worth considering before you sign-up for a new music streaming service – a few of your favorite artists might only be available in certain places.",
    "Amazon shied away from podcasts, video, and radio stations for a long time when other music services pushed these offerings. Since late 2020 it has added some podcasts in certain markets – including the US, UK, Germany, and Japan – but choice feels limited. There are better options if you want your streaming service of choice to be a well-rounded entertainment hub – which is what Apple Music and Spotify are swiftly becoming.",
    "You can download music to listen to later via offline playback. We found this to work very well, and it was good knowing if we lost a data or Wi-Fi connection, we could keep listening. But remember that those high-quality audio files take up more space on your device.",
    "You can also store music you already own locally within the Amazon Music HD app and import playlists from other streaming platforms with the help of a service like SongShift or TuneMyMusic.",
    "You can stream Amazon Music HD via your web browser, but it works the best in a desktop app or mobile app on iOS, Android, Mac and Windows devices.",
    "It’s also integrated into a range of home devices, including speakers, amplifiers, and soundbars. This includes all of Amazon’s Echo products, Sonos speakers, Fire TV devices, and more.",
    "The desktop app isn’t as slick or good-looking as Spotify, Tidal, or Apple Music, but it offers a similar user experience with a muted dark gray and white color palette and album and playlist artwork displayed in full color across the screen.",
    "There are only two options on the menu – Home and Library. Home is where you’ll see recently played tracks, album and playlist recommendations, and sections dedicated to the latest Ultra HD tracks.",
    "Library is where your music is stored, including what you’ve listened to recently and your saved playlists, artists, and tracks.",
    "The bar that runs along the bottom of the screen has playback controls, and there’s the option to send your music to a connected device – like an Echo speaker.",
    "There’s also a three-dot ellipsis next to playlists, albums and tracks that expands features and brings up menus. This keeps the interface clean and presents a range of options, including adding to queue, adding to a playlist, downloading or sharing – this opens up a link and social media with more options in the mobile app, including Instagram Stories.",
    "Even though it might not look quite as good as other services, its minimal design, easy-to-use controls, and menus make it straightforward. For that reason, this would suit someone who hasn’t dipped their toe into music streaming before.",
    "The same can be said for the mobile app, which offers a slightly better experience than the desktop version.",
    "Here you’ll find a similar Home section, which also includes recommended podcasts, as well as the curated station My Soundtrack – more on that below. The following section is Find, which is both a search and music discovery section where you can browse by genre and audio quality. Then there’s Library, which works in much the same way as the desktop app, with the addition of a handy song history section here, which is like browsing history for your listening.",
    "The final section is Alexa, and you need to grant Amazon microphone access to your phone for this to work – so be sure you’re happy with that before you agree.",
    "Unsurprisingly, Amazon Music Unlimited works with Alexa and it does work remarkably well to surface new music. You can ask Alexa to play tracks or playlists, or ask for specific genres and types of music, and Amazon’s voice assistant will access Amazon Music HD to play a mix for you.",
    "You can create your own playlists with Amazon Music HD – just head to Library > Playlists. However, the service also makes many good playlists for you, too.",
    "Many aren’t personalized to you but do surface good suggestions. You can find these in Home. We listened to a lot of rock and pop-punk from our teens when we first started using Amazon Music HD, so our playlist recommendations include: Hot Rocks, Women of Indie and 100 Greatest Alternative 90s. These were full of good tracks, some from artists we’d heard of and some from albums we’d never listened to all the way through.",
    "There are also sections called You Might Like and Albums For You, which showed an interesting mix of music that we hadn’t already played much but aligned with our interests.",
    "Then there are recommendations based on your listening. The first one, Amazon labels a Station rather than a Playlist. Called My Soundtrack, it generates after a couple of listens and recommends tracks from artists we’ve mostly already played – so it didn’t feel like a good way to discover new music, but it did surface tracks we weren’t as familiar with.",
    "My Discovery Mix is a playlist full of recommendations that updates on Mondays, based on your past listening and tastes – like Spotify’s Discover Weekly. However, we tried the service for more than a fortnight and didn’t get served up a Discovery Mix – we’ll update this review when it does show up.",
    "Overall, Amazon Music HD’s recommendations were right for us and did surface some new tracks. Still, it didn’t compare to Spotify’s recommendation engine, which feels like it knows us and our tastes better than we do ourselves."
  ],
  "headers": {
    "0": "One-minute review",
    "3": "What is Amazon Music HD?",
    "10": "Pricing and subscription",
    "16": "Audio quality",
    "26": "Music catalogue",
    "31": "Platforms and apps",
    "43": "Playlists and recommendations",
    "49": "Don't subscribe if..."
  },
  "links": {
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "recently announced": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Amazon Music Unlimited": "https://www.techradar.com/news/what-is-amazon-music-unlimited",
    "Amazon Music has said": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "Spatial Audio": "https://www.techradar.com/how-to/apple-music-spatial-audio-and-lossless-guide-heres-how-to-turn-them-on",
    "Deezer": "https://www.techradar.com/reviews/deezer",
    "lossless FLAC codec": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "HiFi tier": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008"
  }
}