{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs",
  "title": "Samsung Galaxy Note 10 Plus review",
  "category": "phones",
  "updated": "2021-02-05T13:57:11Z",
  "author": "matt-swider",
  "summary": "Samsung flagship style with stylus action",
  "verdict": "At release the Galaxy Note 10 Plus was Samsung's biggest and most powerful phone, and its Aura colors almost symbolically reflect smartphone luxury top to bottom. The hand-stretching 6.8-inch display is perfectly paired with the S Pen and an extra-big battery. Sure, it's technically neither the fastest nor the best camera phone, but it's the most fun we've had testing a phone in 2019 thanks to its five cameras and smart photo filters. This is one to get if you want to bask in pre-foldable phone opulence.",
  "pros": [
    "The best screen on a smartphone",
    "The best selfie camera around",
    "Fun-to-use rear cameras"
  ],
  "cons": [
    "Supremely expensive",
    "Big and slippery design",
    "Camera isn't 'the best'"
  ],
  "article": [
    "The 6.8-inch Samsung Galaxy Note 10 Plus seemed designed to prove us wrong whenever we collectively think \"Wow, phone screens can't get any bigger, can they?\" Oh, they can, a fact subsequently proven by the 6.9-inch Samsung Galaxy S20 Ultra and Galaxy Note 20 Ultra.",
    "With its massive screen size, the Note 10 Plus is a colossal Samsung phone (with an equally sizable price) that is quite a bit larger than the Galaxy Note 10. But it's easy to fall in love with the screen and Aura Glow glass back if you're into over-the-top smartphone opulence. It's both class-leading and classy looking.",
    "Of course, today's best phones all have big screens, including several from Samsung. So the new Note 10 Plus goes beyond what the S10 Plus provided six months before, and even the Galaxy S20 after, touting the handy, Note-exclusive S Pen with new wand-like gesture control tricks.",
    "Screens at these sizes are begging for a stylus, and when we called the S10 Plus the \"almost-everything-included Samsung phone\" this is what we meant. But there has to be more than that, and the Note 10 Plus mostly delivers.",
    "Its five cameras offer a 'Live Focus' portrait mode with fun-to-use filters. Although the Pixel 3 beats Samsung's main cameras in low light, the selective black-and-white Color Point and Big Circles filters took our selfie game to the next level. The Note 10 Plus has the best front-facing camera we've ever tested.",
    "Samsung goes a step further with ideas we didn't need, though. Live Focus Video makes sense on paper, but test it just once and you'll realize you don't actually want distracting background blurring effects in your videos. The same goes for AR Doodle – neat to use once but highly unnecessary. It's this year's AR Emoji/Animoji.",
    "You'll find these features and a stylus on the \"normal\" 6.4-inch Note 10, which has a more one-hand-friendly screen and cheaper price. But exclusive to the Note 10 Plus are faster specs, a microSD card slot, bigger battery, and ultra-fast charging speeds.",
    "Both 2019 Note phones are missing one thing: a traditional 3.5mm headphone jack. Samsung finally caved to the critically unpopular trend in an effort to make its phones thinner and pack in a bigger battery.",
    "Now, we'll level with you on this luxury handset. What you're getting for your money is a great camera in your pocket – but it's actually not the best camera phone. And it's fast – although, technically, it's not the fastest phone you can buy, either. Even though it will benefit from the Android 11 upgrade when it's released for the phone later in 2020, other phones will still outperform it.",
    "Forget all of that – the rankings, they don’t matter: the Note 10 is Samsung’s best phone and, most importantly, the most fun we’ve had using a smartphone in 2019. This may be Samsung's last great phone before the Galaxy Fold revolution.",
    "The Samsung Galaxy Note 10 Plus release date was Friday, August 23 2019 after being announced on August 7, and you'll pay more for S Pen-included smartphone than pretty much any other Android handset.",
    "It costs $1,099 / £999 / AU$1,699, price matching the iPhone XS Max in most regions. Keep in mind, that's for the 256GB internal storage version (while Apple starts at a measly 64GB), and Samsung offers a bigger screen, the S Pen, and microSD card slot.",
    "There is a 512GB version of the Note 10 Plus, but it's $1,199 and so far exclusive to the US. American carriers are selling the Note 10 Plus at an average of $45 a month over two years, while the Galaxy Note 10 Plus 5G edition starts at $1,299 and is exclusive to Verizon.",
    "Smartphones with big screens are more common now, chipping away at the value of the Note 10 Plus. However, none of them utilize a stylus, so Samsung has locked up that market.",
    "The price has now dropped thanks to the release of the Samsung Galaxy Note 20 and Galaxy Note 20 Ultra, but it's still an expensive handset. We may see it drop around Black Friday or Cyber Monday - we're putting together a list of the best Black Friday phone deals for you - so that may be a good time to keep an eye out on the Note 10 Plus.",
    "The 6.8-inch Samsung Galaxy Note 10 Plus screen is so big that we're kind of craving the innovation of the Samsung Galaxy Fold and other foldable phones.",
    "It takes up the entire front of the phone and then some, with an edge-to-edge design that has pixels spilling over the left and right sides. The curved display comes to a fine point, making it satisfyingly sharp in more ways than one.",
    "Samsung's use of punchy colors, a pixel-dense Quad HD+ resolution, and high peak brightness have always made its Super AMOLED screens look superb. It's just now maximized to seem extra immersive and worth all of that hand stretching.",
    "Okay, the Note 10 Plus display doesn’t have a fluid, silky smooth 90Hz screen refresh rate seen in the OnePlus 7 Pro. And its curved edges do produce false touches if you tightly wrap your hand around screen. But no other phone has this good of a screen.",
    "6.8 inches makes it sound almost too big – bigger than a 6.5-inch iPhone, right? Well, not really. Its width and girth are a fraction of a millimeter smaller than the iPhone XS Max if you measure it out, and it weighs less. It's only a few millimeters taller.",
    "Samsung's bigger-screen, smaller-body trick is that it uses a center-aligned punch hole to embed the front camera into the display. It's 26% smaller than the top-right S10 camera hole and less intrusive than Apple's 'notch.' We found it easy to ignore when watching Netflix.",
    "False touches or not, you will want to hold onto the behemoth Note 10 Plus tightly. It can be slippery and extend beyond your natural grip. It's just that big.",
    "We have a love-hate relationship with the Aura Glow color, too. Not only is it hard to wield the glass back and slick aluminum frame without a case, it smudges so badly.",
    "But get this mirrored finish in the right light and it has a memorizing rainbow effect, making the Note 10 Plus – literally – your new favorite shiny toy. It's a head-turner.",
    "The streamlined screen with the small punch-hole camera means there's no room to fit the IR scanner used in the Note 9 and Note 8 for a quick and secure face unlock. In it's place is the fancy ultra-sonic in-screen fingerprint sensor, which worked as a fine substitute in our tests. The tech seems to have improved in the S10 Plus.",
    "There's also one less button on the rails of this year's Note. The power button is now on the left side, as it's been combined with the much-maligned Bixby button. It's a good move. Oh, Bixby remains a completely mediocre voice assistant and the power button's move does take getting used to. But you'll be way more mindful of this new 'everything' button and quit mistakenly pressing it thinking it's volume down.",
    "Not every design trade-off is so great – the traditional 3.5mm headphone jack isn't here. Instead, Samsung uses the USB-C port so you can plug in included-in-the-box USB-C headphones. It had to happen sometime.",
    "The Note's secret weapon is the S Pen stylus, and this year's phone comes with some neat new tricks. None of them will convince you to buy this pricey phone, however.",
    "It's the returning functionality that is far more persuasive when you unsheathe the S Pen from the bottom right corner of the Note 10 Plus frame. It's shorter and thinner than before, but still accomplishes the same great fine-tipped note-taking.",
    "The S Pen is the best way to capture and annotate screenshots on a phone, while Screen Off Memo remains the fastest way to scribble down quick notes as fast as you can pop out the stylus. No need to turn the Note 10 display on.",
    "Remote Shutter returns from the Note 9, and it's the best way to take photos from a distance thanks to the S Pen's Bluetooth LE capabilities. New with the Note 10 Plus is the gyroscope and accelerometer for even more magic via 'Air Gestures.'",
    "Air Gestures allow you to zoom in and out of the camera view with a clockwise-counterclockwise rotation, and swipe through menus using a left and right flick motion. Getting these new functions to work took almost too much training.",
    "The S Pen allowed us to become the maestro of taking selfies, conducting the camera app to snap in multiple modes and take an endless parade of fun Live Focus shots. It worked for the most part, except you really new a tripod for this.",
    "Taking remote photos with the Note 10 in New York City isn't easy without a tripod, as the city is filled with domed trash cans and few flat surfaces. You'll get a lot of unflattering low-angle shots by sticking this on the ground. Are you really going to carry around a tripod for a smartphone, though?",
    "The other new S Pen feature is better handwriting recognition. It kind of works, but obvious mistakes still happen. It ironically had a problem converting our handwritten words \"This is text\" into printed text a few times. It is better, but better is subjective.",
    "The Note 10 Plus delivers on the hype of five cameras, with varying perspectives and superb performance from all, something we did find on the six-camera-lens LG G8.",
    "There are four cameras on back, with the main 12MP camera capturing scenes with the bright and punchy colors Samsung photos are known for. It's solid, albeit almost exactly like the Samsung Galaxy S10 Plus camera.",
    "Low light photos look better than ever thanks to a dedicated Night Mode. Without it, people’s skin looks like a 1990s glamor portrait when Photoshop first came on the scene – so much unfortunate airbrushing going on.",
    "With Night Mode enabled, we do see less aggressive smoothing, but more noise as exposure is increased. In most dark scenarios, we found it to be a better trade off. But for this reason, the Google Pixel 3, with its superior post-processing in Night Sight mode, remains the overall winner for your nighttime and bar-restaurant shots.",
    "What stands out the most are the Note 10 Plus 12MP f/2.1 telephoto and 16MP f/2.2 ultra-wide lenses. They offer photos at varying perspectives, while a VGA Depth lens (exclusive to the Note 10 Plus) aides in applying 'Live Focus' bokeh to photos (the smaller Note 10 relies on software blurring).",
    "We were able to capture scenes in new ways: up close without distortion via the 2x zoom telephoto lens, and cramming more in frame thanks to the wide-angle lens – without having to back up to get everything in the shot.",
    "The other highlight is the small punch-hole that embeds a 10MP front camera in the screen. With fun-to-manipulate Live Focus filters on selfie photos, we were able to make subjects (often us) really stand out.",
    "Color Point returns from the S10 series to be our favorite filter, but there's a new one we like almost as much: Big Circles. This fresh software-produced bokeh filter blurs the background with distant lights taking on a natural-looking bulbous shape.",
    "The Pixel 3 also offers excellent selfie photos, and we appreciate Google's use of two camera lenses on front, with one for wide-angle group selfie photos. But overall, we had more fun using the Note 10 Plus front camera and everyone we showed was wowed by the selective-black-and-white Color Point filter.",
    "We found the differences between the S10 Plus and Note 10 Plus still cameras to be minimal. Video is where Samsung's newest phone breaks new ground – if you ignore the silly features that distract from what's really good.",
    "Note 10 video benefits most from its 'Super Steady' optical image stabilization (OIS). Our side-by-side comparisons with an iPhone XS Max and Note 9 show Samsung's newest phone offers smoother video. It won't make you ditch something like the DJI Osmo Mobile 3, but when gimbal-free, you'll have the least shaky video out there.",
    "The return of Samsung's video editor, now retooled for 2019, is a welcome addition. It's built into the gallery app and easy to use, almost as if it's a simplified version of Adobe Premier Rush. And it pairs nicely with the S Pen for fine-tuning edits on the timeline.",
    "Live Focus Video seems like a natural progression, since we do love to use Live Focus photos. Blurring the background behind moving subjects is cool at times, especially when isolating a colorful subject against a black-and-white scene with Color Point or making your room appear on the fritz with the static-filled Glitch filter.",
    "But Live Focus Video is a bit too inconsistent to readily use outside of a \"Hey doesn't this video look neat?\" social media post. Unlike Live Focus photos, you shouldn't use this until the edges of foreground subjects are a little more defined. It's better than the very similar feature on the LG G8, but that's not saying a lot.",
    "Zoom-in Audio also serves a purpose – amplifying the subject you’re zooming into. Samsung analogized the feature to boom mic. However, we found this just made everything in a room louder, not just the subject we were zooming into.",
    "The Samsung Galaxy Note 10 Plus battery life will get you through more than a day, and it charges much more quickly than previous Samsung phones.",
    "We had 20% to 30% battery life after heavy use thanks to the hefty 4,300mAh battery capacity. That's roughly what we saw with the Galaxy S10 Plus, which had a smaller battery capacity, but also a smaller screen.",
    "More-than-all-day-battery achievement is aided by Samsung's power management having been greatly refined over the years and the fact that the QuadHD+ display resolution isn't on by default – it's set to 1080p out of the box.",
    "You won't notice the difference between 1080p and Quad HD+ resolutions outside of VR, but also off by default was the helpful Always On Display setting. We turned it on because seeing the time and lockscreen notifications at a glance made a difference in our appreciation of the screen day-to-day. It didn't hurt battery life much.",
    "Samsung finally upgraded its Fast Charging capabilities to 45W, a dramatic increase from the 15W wall chargers we're used to using. In the box, however, you're getting a 25W charger, which we found to be a fine improvement for most people. We went from 0% to 100% in 70 minutes with the 25W charger.",
    "The 45W charger that's sold separately is promising to replenish your Note 10 Plus battery for all day use in just 30 minutes and it's another Plus-exclusive feature you won't find on the normal Note 10. We haven't tested this out yet, but it costs $50. We'll update this Note 10 Plus review when we get one in.",
    "Wireless charging has also improved to 15W, which is good news because the 12W cap on the S10 'Fast Wireless Charging 2.0' speeds series felt slow. But if you bought Samsung's 12W Wireless Charger Pads Duo, you'll need the new 15W stand to make use of the higher speeds.",
    "Samsung's software has been redesigned to be logically laid out on such a tall device – everything is easy to reach within its menu system, and the camera app is among the most robust without feeling overly complicated.",
    "The clean One UI interface lines most navigation options on the bottom half of the Note 10 Plus screen, within thumb's reach. Everything on the device is well-laid-out. That's, sadly, not the case when extending Samsung's software beyond the phone.",
    "Samsung Dex now offers a dock-free desktop view of your phone on a computer by simply plugging a USB-C cable between the Note 10 Plus and a PC or Mac. There's also a new Link to Windows mode for receiving notifications and messages on PCs. That'd all be a win if drag-and-drop functionality weren't a bit buggy.",
    "What gets us the most is this: important apps, including Samsung Notes, don't have a good desktop edition. If we write something down and we want to bring it up on a PC or Mac, there's no reliable way to do so. Samsung's not going to win us over without the robust continuity software that Apple has between its devices.",
    "Yes, we complained about this on the S10 Plus, but porting Samsung Notes off of the phone matters so much more on the... Note 10 Plus.",
    "Here's another non-surprise: Bixby is, well, still Bixby. It continues to not hear what we're saying. Every time we try a new Samsung phone, the first thing it says is “Meet the new Bixby,” and yet it’s the same mediocre voice assistant. Every. Time.",
    "As you’d expect from a new Note, the 10 Plus is among the fastest phones out today. Sure, last year’s iPhone and a few other Androids are a smidge faster, but that’s mostly about bragging rights at this point.",
    "We found Samsung's 12GB of RAM more than enough to mirror Dex desktop mode and full browser support with many tabs open at once. The Plus version gets more RAM with 12GB vs the normal Note at 8GB, but either version is going to seem fast. We ended up with a GeekBench multi-core score of 10,849 in our tests.",
    "Both Note 10 and Note 10 Plus have either a Snapdragon 855 or a Exynos 9825 chipset, depending on your region, and we've tested both. Samsung didn't upgrade to the gaming-centric Snapdragon 855 Plus used in the Asus ROG Phone 2, but it did outfit the Note 10 Plus with a vapor cooling chamber designed to handle today’s 3D games and whatever comes next.",
    "One more perk exclusive to the Plus that’s not on the normal Note: this version retains the microSD card slot for expandable storage. That’s in case the 256GB or 512GB internal storage configurations aren’t enough for you.",
    "Not convinced by the Samsung Galaxy Note 10 Plus? Check out our Comparison Slideshow for alternative to this phone."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Price analysis",
    "15": "Display",
    "21": "Design",
    "27": "S Pen magic tricks",
    "35": "Five cameras",
    "50": "Battery",
    "57": "Interface",
    "63": "Performance",
    "67": "Who's it not for?",
    "68": "Competition"
  },
  "links": {
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Galaxy Note 10": "https://www.techradar.com/reviews/samsung-galaxy-note-10-review-and-specs",
    "S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "best Black Friday phone deals": "https://www.techradar.com/black-friday/black-friday-phone-deals-2021",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Note 8": "https://www.techradar.com/reviews/samsung-galaxy-note-8-review",
    "LG G8": "https://www.techradar.com/reviews/lg-g8-review",
    "S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Osmo Mobile 3": "https://www.techradar.com/news/dji-strikes-back-against-its-smartphone-steadying-rivals-with-the-clever-osmo-mobile-3",
    "Snapdragon 855": "https://www.techradar.com/news/snapdragon-855",
    "Asus ROG Phone 2": "https://www.techradar.com/news/asus-rog-phone-2-gaming-smartphone-is-official"
  }
}