{
  "source": "https://www.techradar.com/reviews/credit-squad",
  "title": "Credit Squad identity theft protection review",
  "category": "computing",
  "updated": "2021-11-18T05:47:23Z",
  "author": "john-brandon",
  "summary": "A relatively unknown company with a relatively average identity theft protection app",
  "verdict": "Credit Squad is an identity theft protection app that covers all of the basics. The app can provide a credit report and a credit score so you can investigate fraud or other problems. Credit Squad covers all of the bases and yet there’s also a sense that this is another average identity theft protection app that doesn’t do anything unusual or unique. It’s priced about the same compared to the best options out there with far less advanced features.",
  "pros": [
    "Fair price",
    "Three tiers of plans offered",
    "Credit Score tracker on all plans",
    "Early account take over warning offered on upper plans",
    "Seven year account history"
  ],
  "cons": [
    "Poor website",
    "Unexceptional feature list",
    "Lowest plan is only credit monitoring without ID theft restoration",
    "Top plan required for reports and tracking from all three credit unions"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "Most of our lives are pretty normal in the end. That’s not meant to be a ding or a complaint, but we tend to do our jobs, raise our families, and spend leisure time when we can. Few of us expect to win a million dollars in a lottery and when we go on vacation it might be to the beach for a few days, rather than an extravagant far away destination. It’s not a bad thing - average means no surprises, no drama, and no major hardships.",
    "If you’re the victim of identity theft, it’s anything but predictable and normal. It can throw your entire life into disarray - not being able to access a bank account is one of the surreal experiences that is quite stressful and would put anyone on edge. If a hacker starts using your credit card, you have to go on the offensive and try to restore your good name. That’s why identity theft protection apps are so helpful - they can provide the tools you need in case your life goes seriously haywire.",
    "Unfortunately, Credit Squad is fairly pedestrian and an average identity theft app. It provides predictable services like credit monitoring, and a report of a credit score, and you could argue it’s a good option to help out in a crisis. The problem is that, if your identity has been stolen, most will want more than an average product. It’s a tumultuous time and there is a lot of stress involved. What you really need is a powerful app and supportive representatives to call and guide you through the repair process. A host of services provide all of that, including Norton LifeLock and IdentityForce, at roughly the same price. Credit Squad ends up losing its appeal because it’s simply just too average.",
    "Given that Credit Squad is average and offers the typical feature list, the price is far from unique. There are three main pricing plans for individuals with the entry point at $14.99/month for the Standard Plan, which includes credit monitoring, an annual credit report, an annual credit score (which some sites will provide for free if you look around), and real time inquiry notifications. Now you can see why we think it is not a standout of a plan.",
    "Moving up to the Complete Plan raises the price to $19.99/month which incorporates all the features of the Standard Plan. It also adds useful additional features such as change of address monitoring, early warning of an account take over, and full service ID restoration.",
    "At the top tier is the Elite Plan that commands a $24.99/month charge, with a more comprehensive feature list. This includes credit scores, tracking and annual reports from all three credit services, while the lower plans are only from one of the credit services. Other than that, it is really identical to the Complete Plan as both include the $1 million of ID theft insurance.",
    "Credit Squad also offers family plans which covers “You and your kids,” which does not indicate if it also protects a spouse. The equivalent of the Complete Plan for a family is $5/month additional, at $24.99/month. There is also the equivalent of an Elite Plan for a family that rises considerably to $49.99/month to get all the features, including credit scores from all three credit services, rather than just the one of the lower family plan.",
    "The biggest red flag with Credit Squad is that, even when you scour the entire website and do a Google image search looking for screenshots, you won’t find anything. There are no reviews of the app and no smartphone versions for either iOS nor Android. The app seems like an enigma from the very start. A deeper search reveals an average app that looks just like every other option around.",
    "There’s nothing in the feature list for this product that stands out. You’ll see all of the most common features related to credit reporting, a credit score, lost wallet assistance, and alerts about sex offenders moving into your area. The credit reporting and credit scores are common with all of the identity theft protection apps. Credit Squad doesn’t specifically state there are agents available to assist you with identity theft recovery.",
    "Unfortunately, the app has a penchant for explaining things in a way that is heavy on SEO keywords and short on actual details. A description of the Full Service ID Restoration says it “Reduces the time and effort a consumer endures in the event that his or her identity is stolen, and goes beyond traditional credit report restoration by offering robust case knowledge in non-credit restoration.”",
    "Even if you read that a few times, you won’t know if that means there is a power-of-attorney privilege involved, if we’re talking about licensed investigators or a hotline, or if this feature is more about using the app. The term “robust case knowledge” can mean almost anything (or nothing).",
    "Credit Squad does indicate that it covers 7 years of credit history. It also indicates that this is longer than most services that only cover for two.",
    "Support for Credit Squad is also a bit amorphous. The website does indicate that it has “Teams of professionals on staff 7 days a week to answer your questions,” although it does not indicate the hours of operation.",
    "Also, there is no other option, such as email, either direct or through a support portal, nor chat. We also did not find any self-serve content, like a FAQ, or articles for common issues.",
    "Credit Squad starts to look like a weak product the more you inspect the website and the pricing strategy. For about the same price as Norton LifeLock, the app doesn’t offer any of the status updates or the wizards that help you learn about and resolve problems. If you’re looking for a robust portal of educational information you won’t find it here - no blog posts, no news alerts, nothing that even explains what the product actually does.",
    "The last thing any of us need is to feel helpless and uneducated about identity theft. While Credit Squad has the basic features you might need, the website is remarkably light on details including an explanation of what the features even do (using specifics). If the pricing was much lower it might be worth considering for basic identity theft protection. However, as the pricing currently is, there isn’t enough here to warrant even a cursory look compared to the more robust competition.",
    "We've also featured the best identity theft protection"
  ],
  "headers": {
    "4": "Plans and pricing",
    "8": "Interface",
    "9": "Features",
    "13": "Support",
    "15": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "victim of identity theft": "https://www.techradar.com/how-to/next-steps-if-youre-a-victim-of-identity-theft-in-the-us",
    "Credit Squad": "https://www.creditsquad.com/",
    "credit monitoring": "https://www.techradar.com/best/us-credit-monitoring-services",
    "Standard Plan": "https://www.creditsquad.com/#pricing",
    "Complete Plan": "https://www.creditsquad.com/#pricing",
    "Elite Plan": "https://www.creditsquad.com/#pricing",
    "SEO keywords": "https://www.techradar.com/best/keyword-research-tools",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}