{
  "source": "https://www.techradar.com/reviews/technics-eah-az40",
  "title": "Technics EAH-AZ40 review",
  "category": "audio-visual",
  "updated": "2021-11-12T11:01:34Z",
  "author": "simon-lucas",
  "summary": "Getting it right in your ears",
  "verdict": "They have plenty of features that make us want to recommend them, particularly where ergonomics and control options are concerned, but the Technics EAH-AZ40 aren’t exactly the complete package.",
  "pros": [
    "Impressively comfortable and wearable design",
    "Chunky, poised and quite detailed sound",
    "Numerous control options"
  ],
  "cons": [
    "Cutthroat competition",
    "Can stumble over rhythms",
    "SBC and AAC Bluetooth codecs only"
  ],
  "article": [
    "There’s ‘comfortable’ and then there’s the Technics EAH-AZ40. Small, light and easy to fit, these true wireless earbuds are pleasant to wear for as long as their battery lasts (and with eight hours in the buds and another couple of charges in their equally compact case, that’s a decent length of time).",
    "It’s just as easy to get the earbuds to do what you want as it is to wear them in the first place, too. Voice-control is responsive, the touch-controls equally so, and the control app is more wide-ranging than most. It couldn’t be simpler to get the EAH-AZ40 to do exactly what you want.",
    "Well, as long as ‘exactly what you want’ isn’t ‘deliver class-leading sound’, anyway. There’s really very little to quibble about if you take the sound of the Technics on their own terms - but the problem here is that for $149 / £129 / AU$199 or so you have a choice of literally dozens of alternative designs. Few are as comfortable, it’s true, and not all that many are as liberal in their control options… but plenty have better battery life and more than a few are more sonically adept, too, such as the Cambridge Audio Melomania 1 Plus.",
    "So, the Technics EAH-AZ40 are far from the first pair of wireless earbuds to discover that ‘really pretty good’ isn’t quite good enough. They deserve a place on your shortlist, sure… but only if your shortlist isn’t all that short.",
    "The Technics EAH-AZ40 are on sale now, and they’re priced at $149 / £129 / AU$199.",
    "That’s an aggressive price when viewed in isolation but, of course, nothing ever happens in isolation. And that doubly true for true wireless in-ear headphones - it’s the most vibrant and cut-throat market in all of Consumer Electronics Land. If they’re going to make it to the top of folks’ short-lists, they’re going to have to see off competition from pretty much everyone: from Beats to Cambridge Audio, from Sennheiser to Sony, it seems every company wants a piece of the action.",
    "Initially, the most obvious thing about the design of the Technics EAH-AZ40 is how little of it there is - the choice of colors (black, silver or rose gold) is perhaps the biggest design flourish.",
    "The earbuds themselves are very compact, light (just 5g each), and the plastic materials from which they’re built are reasonably grippy. Getting them comfortably positioned is dead easy, thanks to a simple ‘twist-to-fit’ methodology, a wide selection of eartips of various sizes and that low weight. Once in situ, the earbuds will stay snug, secure and comfy for hour upon hour.",
    "The charging case, too, is usefully compact. The materials used here feel a little cheaper than those used for the earbuds, but its dimensions and 30g weight make it far from a burden to stash in your clothing, let alone in a bag.",
    "You’ve a number of options where control of the EAH-AZ40 is concerned, all of them well-realized. Amazon Alexa and Siri voice assistants are both available, and both prove sharp-eared and responsive. There are capacitive touch-surfaces on each earbud, from where all the most important commands (‘play/pause’, ‘volume up/down’, ‘skip forwards/backwards’, ‘answer/end/reject call’ and ‘wake voice assistant’) can be received - these, too, are responsive and very difficult to confuse.",
    "There’s also the Technics Audio Connect control app. It’s a very comprehensive (although rather austere-looking) facility, with all sorts of options to fine-tune your earbuds’ performance. There’s a five-band EQ, for starters, with a selection of presets as well as the facility to customise EQs yourself. There’s the option to switch ‘ambient sound’ on or off, and if you choose to switch it on you can select between ‘attention’ (which pauses music and ramps up external sound when voices are detected) and ‘transparent’ (which gives a gentle boost to all external sound).",
    "You can also finesse the way the earbuds’ ‘Just My Voice’ function responds, too. ‘Just My Voice’ can identify your voice during phone-calls and will reduce surrounding noise, and the app lets you hear how you sound to the recipient of your call. You can rearrange the way the earbuds respond to the touch-surface controls. You can ask the earbuds to emit a loud chirp if you’ve temporarily misplaced them.",
    "We’re putting battery life down as ‘good but not great’. The earbuds themselves hold a perfectly respectable eight hours or so, and there are a couple more charges in the case itself - and a total of roughly 25 hours, all in, puts the Technics in the area between ‘disappointing’ (Bowers & Wilkins PI7, we’re looking at you) and ‘remarkable’ (a category reserved for the likes of Cambridge Audio’s Melomania 1 Plus, which will happily go 45 hours without a sniff of mains power).",
    "Wireless connectivity is via Bluetooth 5.2, which is currently as good as it gets - but there’s only SBC and AAC codec compatibility here. That doesn’t prevent the EAH-AZ40 being able to handle hi-res digital audio files just fine, but the lack of aptX (let alone aptX HD) is both puzzling and disappointing. Once the audio information is on board, it’s served up by a pair of 6mm full-range dynamic drivers. They’re augmented by something Technics describes as an ‘acoustic control chamber’.",
    "To start with, we should point out that all critical listening takes place with the EQ settings in the control app left well alone. It’s a rare manufacturer who doesn’t give the end user a chance to fiddle with the sound of their headphones, but it’s an even rarer one who hasn’t already struck the best balance.",
    "Technics, it seems, wants that balance to be between poise and outright heft. Consequently the EAH-AZ40 delve deep in the frequency range, attacking bass sounds with real determination and solidity - but with no lack of dexterity too. There’s plenty of information regarding detail and texture to go along with the outright substance, and the control of entry into and exit from bottom-end sounds is pretty good.",
    "This gives the midrange plenty of breathing space in which to communicate - and with vocalists as characterful as Captain Beefheart (Lazy Music) or St Vincent (I Prefer Your Love) the Technics give a full and revealing account. There’s a slight suggestion of isolation about singers, a tiny hint that they’re operating at a distance from the rest of the musicians, but it ensures they remain distinct and, in any case, it’s preferable to them being subsumed by the performance as a whole.",
    "The distance from here to the top of the frequency range is covered smoothly, though treble sounds are right on the cusp of ‘hard’. Another pass through the St Vincent tune reveals a vibrant high end with more bite than a team of huskies.",
    "This level of borderline-feral attack contributes no end to the EAH-AZ40 dynamic potency. They can switch from ‘gentle solo piano’ to ‘entire orchestra trying to take the roof off’ in an instant, but never lose composure or their winning sense of staging and focus as they do so. They’re less successful where the nuance of that piano is concerned, though, letting harmonic subtlety go astray. And while we’re at it, they’re not the last word in rhythm management, either - music can stomp where it ought to flow, and the more concerned with the dancefloor your music is, the more uncomfortable the Technics sound."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Technics EAH-AZ40 price and release date",
    "6": "Design",
    "14": "Audio performance",
    "19": "Don't buy them if..."
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Cambridge Audio Melomania 1 Plus": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Bowers & Wilkins PI7": "https://www.techradar.com/reviews/bowers-and-wilkins-pi7",
    "hi-res digital audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340"
  }
}