{
  "source": "https://www.techradar.com/reviews/little-nightmares-2",
  "title": "Little Nightmares 2 review",
  "category": "gaming",
  "updated": "2021-02-09T15:00:48Z",
  "author": "tom-regan",
  "summary": "Little Big Panic",
  "verdict": "Where its predecessor flirted with fear, this time around, developer Tarsier has fully delivered on its promise of a playable nightmare. While patches of clunky combat and frustrating platforming slightly mar the experience, overall, Little Nightmares 2 is a dingy delight. If you're after a unique and atmospheric horror game to tide you over until Resident Evil Village, then look no further.",
  "pros": [
    "A stunningly-realized, terrifying world",
    "Clever puzzle design that constantly surprises",
    "Each new locale is more harrowing than the last"
  ],
  "cons": [
    "Lack of precision hurts platforming",
    "Clunky combat",
    "May be too grimdark for some"
  ],
  "article": [
    "As any horror director will tell you, getting under people’s skin isn’t easy. Sure, you might pull off a cheap jump scare or startle someone with some staccato strings, but truly unsettling people? That’s a different story. In order to wrap those tendrils of fear tightly around your audience, players need to believe that they’re in a world where nowhere is safe - where anything can happen. When it comes to surreal and unpredictable horror, there’s no better muse than the original interactive horror great - our childhood nightmares. It’s a mantra that Little Nightmares 2 (or Little Nightmares II) creators Tarsier clearly share, and this time around, the studio delivers on its promise of a playable nightmare.",
    "For those paying attention, this isn’t Tarsier’s first time around the spooky block. Making its name co-developing the cutesy Little Big Planet series, 2017 saw this Swedish studio abandon colorful dream worlds in favor of exploring the dark recesses of childhood subconscious. While Little Nightmare may seem a world away from Sackboy’s cutesy-looking adventures, peel back the grimy surface and Little Nightmare’s core gameplay is surprisingly familiar.",
    "Following in the footsteps of its predecessor, Little Nightmares 2 once again takes LBP’s simplistic, family-friendly mechanics and repurposes them into something brilliantly sinister. Like Sackboy’s saccharine platformers, this is a game about running, jumping and interacting with objects - only in Little Nightmares 2, you’re not using these mechanics for playtime with felt-covered friends - you’re trying to avoid being eaten by a shrieking demon.",
    "Much like a real nightmare, the backstory for our new tiny protagonist (Mono) and where he finds himself is never even remotely explained - it just is. Where the slimy but same-feeling decks of The Maw conjured up feelings of disgust in the first game, this adventure sees you quickly fleeing one hell hole only to wind up somewhere far, far worse. From Coraline-esque dark city streets to the utterly chilling hospital locale, Little Nightmares 2 swaps the first game’s tension for an outright sense of surrealist dread.",
    "This time around, stunningly rendered 3D environments offer more detail than ever, immersing you in the grim details of whatever sordid place you’re unlucky enough to find yourself in. From its Limbo-esque woodlands to an absolutely harrowing take on a 1930s primary school, this is a fast-paced journey where you’re led purely by instinct - that constant gnawing feeling that something just isn’t quite right. Spoiler, it almost always isn’t.",
    "Thankfully, you’re not embarking on this journey alone. Working alongside the yellow-hooded protagonist from the first game, ‘Six’, Little Nightmares 2 sees you coordinating with said AI accomplice in order to survive this increasingly hostile world. While jumping onto door handles, climbing onto tables and crawling through vents all make their inevitable return, thanks to the AI twist, puzzles feel far more varied this time around.",
    "From a spine-chilling flashlight section that we won’t spoil to an ever-evolving chase sequence that constantly had us screaming at the TV, whenever you think you know what’s next, Little Nightmares 2 throws something new at you. Even if it’s just a new hat.",
    "Did we mention the exciting new headgear? Sorry, we got distracted by our ordeal. In a fun - and very Little Big Planet - twist, Little Nightmares 2 is littered with a wealth of wearable hats, allowing eagle-eyed collectors to change their appearance at will. It’s a fun touch that gives players even more incentive to explore every nook and cranny of this terrifying world.",
    "Still, cool virtual heard warmers aside, it's the clever puzzles that are undoubtedly the meat of the Little Nightmares 2 sandwich. While video game puzzles can more often be a source of frustration than fun, here Tarsier manages to get the balance just right. For the vast majority of the game, puzzles feature just the right amount of subtle environmental signposting to ensure that once you reach your ‘eureka’ moment, you feel like a genius. Be it manipulating a particularly gross headboard, or harnessing the almighty power of the television, it’s pretty rare that you’re doing the same thing.",
    "Still, it’s not all cowering and legging it. Unlike the first game, Little Nightmares 2 gives you a few choice moments to defend yourself. Whether it's bashing the skulls in of a porcelain foe, firing a shotgun at a b-tier member of Slipknot or swinging an axe into a scuttling dismembered hand - just as things get too much, you transform from prey to hunter. The only problem is, not all of these sections feel brilliant. Too often, swinging an axe or hammer in a poorly defined 3D space can often feel like a nightmare of its own - leading to frustrating deaths where you were sure that you landed a killing blow.",
    "This same depth perception problem plagues the more specifically-angled platforming sections of the late game, but mercifully, these are few and far between. Speaking of mercies, Checkpoints are generously placed throughout, helping to avoid frustrating restarts, annoying repetition and us swearing repeatedly.",
    "Tarsier's understated twoquel delivers scares by the hat load. We’ve already established that creating genuinely terrifying fiction isn’t the easiest task going - but making a harrowing interactive horror? That takes craft. It’s fitting then that 2021’s scariest game yet comes from a team all too familiar with the wonders of craft– the Swedes who co-created the felt world of Little Big Planet. It’s undoubtedly a weird mix on paper, but Little Big Planet’s iconic DNA courses through every facet of Little Nightmares 2 - and that’s partly what makes it so brilliant.",
    "Where the first Little Nightmares fell flat thanks to frustrating stealth sections and a lack of genuine scares, with Little Nightmares 2, Tarsier finally delivers on its petrifying potential. While its clunky combat and platforming slightly mar the experience, overall, Little Nightmares 2 is a dingy delight. If you're after a unique and atmospheric horror game to tide you over until Resident Evil Village, then look no further."
  ],
  "headers": {
    "5": "It's dangerous to go alone",
    "9": "A swing and a miss",
    "11": "Verdict"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village"
  }
}