{
  "source": "https://www.techradar.com/reviews/hostarmada",
  "title": "HostArmada review",
  "category": "computing",
  "updated": "2021-08-20T16:30:55Z",
  "author": "mirza-bahic",
  "summary": "A charming cloud-based host from the US",
  "verdict": "HostArmada is a new kid on the block, but a whiz kid armed with feature-packed, SSD cloud-based hosting solutions that include a free domain, a free site migration, a free SSL certificate for each site and a superb round-the-clock support staff.",
  "pros": [
    "Free daily backups",
    "Newbie-friendly approach",
    "24/7/365 customer service",
    "45-day money-back guarantee with shared hosting plans"
  ],
  "cons": [
    "No monthly pricing",
    "No Windows shared hosting",
    "Prices spike upon renewal"
  ],
  "article": [
    "Although a child prodigy, HostArmada still counts as a toddler among the giants of web hosting. Set in motion during 2019, this fast-growing company has since managed to cover four continents while sprouting their data centers across the world. However, its head office remains situated in its place of origin, Delaware (the USA).",
    "HostArmada covers everything from domain services to a wide variety of cloud-based hosting solutions, including SSD shared, WordPress, SSD VPS, dedicated CPU server, open source and development-oriented hosting solutions.",
    "To provide every user with lightning speed so that they can “crush their competition”, HostArmada utilizes powerful cloud technology, a native SSD platform, a redundant network and the latest AMD CPUs.",
    "What is more, users can choose between nine data center locations, including three in the USA (Dallas, Fremont and East Newark) and one of each in Canada (Toronto), the UK (London), Germany (Frankfurt), India (Mumbai), Singapore (Singapore) and Australia (Sydney).",
    "HostArmada’s main site looks pretty fancy with its clever use of sundown color palette and it is (besides being easy to look at) very easy to use. It is available in English language only and its pricing is listed in USD.",
    "There is an official blog as well, and it covers a whole range of topics (everything from tips and tricks to news and product announcements) which most users will find both a useful and an enjoyable read. The blog feels and appears to be updated on a pretty regular basis. However, if you still prefer a shorter text from (or you simply enjoy social networking), you can find and follow HostArmada on Facebook, Twitter, Instagram and LinkedIn.",
    "After examining HostArmada’s web hosting packages you should (and rightly so) come to a conclusion that its plans are pretty attractively priced. However, if you start paying attention to the small letters, you’ll be reminded of an old proverb that says if something is too good to be true, it usually (and regrettably) is. The pocket-friendly price you see is of a promotional kind and is valid only for the first signup. After this period, you’ll be charged at regular rates and they can be three or four times higher than the promotional ones, which is unfortunate news.",
    "For instance, HostArmada’s cheapest shared hosting plan titled “Start Dock” will cost you $3.99 per month, which seems like a real bargain. However, after the promotional period comes to an end the price will rise to its regular rate of $13.30 per month. This plan supports one website, 15GB of cloud storage (SSD), unlimited bandwidth, free SSL for all domains, seven daily backups and free domain registration (or transfer).",
    "Besides this, HostArmada provides two more packages for shared hosting, three for WordPress, four for VPS and three for dedicated CPU servers. There are also packages (three of each kind) aimed at developers, but they are basically the same cloud-based shared hosting plans with somewhat different features.",
    "All plans come with a money-back guarantee: a generous 45-day one with shared hosting plans or a 7-day one with VPS and dedicated servers.",
    "HostArmada accepts all major credit cards (including Visa, MasterCard, American Express, Discover, Diners Club, JCB and UnionPay) and PayPal.",
    "To set things in motion, we will go with the simplest cloud-based shared web hosting plan called “Start Dock”. Upon choosing it, you’ll be redirected to their domain registration (or transfer) page, where you’ll have to make a choice. If you are registering a new domain, it will come free-of-charge as long as you are HostArmada’s customer. If you already have one and want to keep it with your current manager, you can choose to do so as well. All in all, there is a hefty collection of domain names and if the one you want isn’t on the list, you’re invited to get in touch with HostArmada’s team and see what they can do about it.",
    "After this you’ll have to decide on the billing cycle (an annual, a biennial or a triennial one), location of your data center (all nine are available) and think about including a few add-ons. To finish the process, you’ll be asked to create an account with HostArmada and to do so you’ll be required to provide a list of your personal information (nothing unusual here), billing information and create a safe password.",
    "HostArmada’s dashboard is remarkably intuitive and from there you’ll be able to manage your account information, hosting services, add e-mail accounts (the number is unlimited) and a domain, log into your cPanel (yes, they provide an industry-standard control panel) and more. Even if you are a full-blown newcomer, managing all aspects of your newly created site should soon become second nature to you thanks to cPanel’s intuitive design. And if you happen to get stuck, we advise you to check out some of HostArmada’s beginner-friendly tutorials.",
    "From cPanel you can install WordPress in no time (or any of the hundreds of available apps) thanks to Softaculous one-click installer. If you would rather use a no-code website builder, HostArmada offers one and it comes with plenty of ready-made templates sure to make your website look like a million dollars.",
    "Given that HostArmada often highlights that the loading speed of one's website is a key component for its successful online presence, we had no choice but to check out the speed of HostArmada’s own site. After performing multiple speed tests on the main site via GTmetrix (our tool of choice), we got some quite underwhelming results with a C (76%) as a final grade. The time the site took to fully load was 3.5 seconds, which is just under the recommended limit. At the same time the process took 163 requests, which is almost as half as much as it usually does.",
    "When it comes to uptime, HostArmada offers a 99.9% guarantee in any given month excluding the scheduled (or unscheduled) maintenance. If the amount of downtime your site suffers exceeds that what is promised, you are entitled to get from 10% to 100% credit, depending on the amount of experienced downtime. During the testing period of two weeks (a bit more, actually), UptimeRobot managed to record mere four minutes of downtime in total, resulting in total uptime of 99.98%. With this, we had no legal basis to request any free credit, and fortunately so.",
    "The first stop for those seeking self-support is likely to be HostArmada’s comprehensive knowledgebase. It contains a full range of how-tos (200, to be precise) covering all common (and some less common) issues. It comprises nine categories (Billing, cPanel/WHM, Domains/DNS, Email, Open-Source Applications and so forth) that are further divided into fitting sub-categories. All in all, finding your way around is as intuitive as it gets and the articles themselves are incredibly easy to understand and follow. In addition to this, you can find a tidy sum of novice-friendly tutorials at their “Learning Center”.",
    "As for those who would like to get technical help from HostArmada’s support staff, they can get it via US-based telephone number (from Monday to Friday during the US business hours), ticketing system, e-mail and live chat.",
    "To ensure the best web hosting service possible, HostArmada provides a sort of a guarantee, the one that promises “an awesome support experience” and a compensation in case someone from their staff makes a mistake.",
    "Bluehost and HostArmada are hosts from the USA, and both are very beginner-friendly and capable of supplying everything needed for small to medium-sized businesses. On the downside, although both hosts offer hosting solutions at a low cost, the price hike after the promotional period is likely to leave you indifferent. One thing that makes them stand out is operating system support and with Bluehost you can get both Linux and Windows, while with HostArmada you'll be left with only a Linux option.",
    "Another similar (and fan-favorite) host from the USA is HostGator. Like HostArmada, HostGator provides a beginner-friendly approach with an entire set of fitting features. However, with HostGator you can pay for one month only, while with HostArmada there is no such option.",
    "Hostwinds is yet another US-based host and one that offers a diverse range of hosting solutions including shared, cloud, VPS, dedicated and reseller hosting. Their packages also include some great unlimited features (including storage, bandwidth and a number of email accounts). When it comes to speed performance, Hostwinds comes on top with a load time of 0.5 seconds and a conclusive grade of A (100%), an extraordinary sight indeed.",
    "Last (but not the least one) of HostArmada’s competitors we’re going to bring up is a cloud-based host from the USA known as Kinsta. However, Kinsta is focused exclusively on providing premium fully managed WordPress hosting solutions (the cheapest plan will cost you $30 per month), while HostArmada has some budget-friendly options as well.",
    "In just a few years of its existence, HostArmada managed to establish itself as a top-of-the-class web hosting company that provides swift and secure hosting solutions at an affordable price. Among the myriad of free features they will arm you with you’ll find domain registration, site transfers, SSL certificates, daily backups, SSD storages and the list goes on. Whether you are a novice, tech-savvy geek or something else entirely, HostArmada is definitely a step in the right direction.",
    "However, if you would rather put your trust in a more seasoned web hosting company, both HostGator and Bluehost have almost two decades of experience under their belts."
  ],
  "headers": {
    "6": "Plans and pricing",
    "11": "Ease of use",
    "15": "Speed and experience",
    "17": "Support",
    "20": "The competition",
    "24": "Final verdict"
  },
  "links": {
    "HostArmada": "https://hostarmada.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "AMD CPUs": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Hostwinds": "https://www.techradar.com/reviews/hostwinds",
    "Kinsta": "https://www.techradar.com/reviews/kinsta",
    "SSL certificates": "https://www.techradar.com/news/best-ssl-certificate-provider"
  }
}