{
  "source": "https://www.techradar.com/reviews/ninja-3-in-1-food-processor-with-auto-iq-review",
  "title": "Ninja 3-in-1 Food Processor with Auto-IQ review",
  "category": "appliances",
  "updated": "2021-12-03T11:44:20Z",
  "author": "helen-mccue",
  "summary": "A space-saving blender and food processor in one",
  "verdict": "The Ninja 3-in-1 Food Processor with Auto-IQ offers a vast array of functions in one appliance. Not only is it a full-size blender and personal blender, but it also functions as a food processor. It’ll take up less space than having all these appliances separately but comes with lots of accessories so it’s not small. Its performance was solid in our tests, it’s easy to use and can be cleaned in the dishwasher, a great choice if you’re looking to combine a few appliances in one.",
  "pros": [
    "Multifunctional appliance",
    "Recipe book included",
    "Blender has removable blades"
  ],
  "cons": [
    "Lots to store",
    "Fewer blades than a high-end food processor",
    "Limited speed settings"
  ],
  "article": [
    "Popular kitchen appliance brand Ninja originated in Canada and is known for making some of the best air fryers and best blenders. It’s also a firm favorite when it comes to Instant Pot alternatives and is becoming a go-to brand for well-made innovative kitchen solutions.",
    "The Ninja 3-in-1 Food Processor with Auto-IQ is also known as the Ninja Professional Plus Kitchen System with Auto-IQ in the US. It’s a blender that doubles as a food processor, so it can save space and money. It’s one of several multifunctional blenders offered by Ninja.",
    "It comes with a large blender pitcher as well as a separate food processor bowl rather than trying to combine the two in one, you’ll also get one personal blending cup (the US model comes with two personal blending cups). All the different accessories utilize the same base, meaning there’s a lot less to store than if you had a food processor as well as a separate blender and a personal blender.",
    "The food processor attachment comes with two different blades as well as a grating/ slicing disc (UK model only) so it can do virtually everything a standalone food processor can do. It only really lacks an assortment of different-sized grating and slicing discs, such as you would typically get from one of the best food processors.",
    "The Auto-IQ technology means the base knows which accessory you’re using and adjusts settings accordingly, making it really intuitive to use. It performed well in our tests and is a great choice if you don’t have space for both a blender and food processor. Though it should be noted that although it does save space there’s still a lot of accessories to store.",
    "The Ninja 3-in-1 Food Processor with Auto-IQ, which as we’ve already mentioned is known as the Ninja Professional Plus Kitchen System with Auto-IQ in the US, costs £199.99 / $199.99. The UK version comes with one personal blending cup and one slicing/ grating disc for the food processor. Whereas if you buy it in the US you’ll get two personal blending cups but no slicing/ grating disc.",
    "It’s available from the Ninja Kitchen website in both countries. All accessories are available to purchase separately too, so whether you’re in the US or the UK you can get extra personal blending cups if you need more than what comes in the box.",
    "This exact model isn’t available in Australia, but there is a slightly different combined blender and food processor model available in Australia called the Ninja Blender System with Auto-IQ BL682, which is priced at AU$379.99.",
    "Depending on your point of view, the Ninja 3-in-1 Food Processor with Auto-IQ is either a space-saving appliance or quite bulky to store. If you want to combine two appliances in one, then it can be regarded as a space-saving option. However, if you’re just looking for a blender or a food processor, the additional accessories in the box will take up more storage space than if you bought the one appliance, making it a bulkier choice. It measures 48 x 25.5 x 19 cm / 17.64 x 9.96 x 7.52 inches (h x w d) when the tallest accessory is attached. The base alone is quite lightweight, coming in at 2.8kg / 6.2lb but has suction cups on the feet to keep it stable.",
    "In the box, you’ll get a 2.1 litre / 72 oz blending pitcher with a removable blade. The lid releases easily with a button that triggers a handle to pop up for easy removal, there’s also a pouring spout in the lid so you can pour out smoothies without having to remove it. The 0.7 litre / 24 oz personal blending cup comes with its own blade assembly and drinking lid, as mentioned above you’ll get two personal blending cups if you purchase it in the US.",
    "The 1.8 litre / 64 oz food processor bowl includes a reversible slicing and grating disc as well as a chopping blade and a dough blade (if you purchase it in the US you do not get the slicing/ grating disc). The lid clicks easily into place and is released using a simple button. All attachments are made from BPA-free plastic so they’re lightweight and also dishwasher safe. Both the blending pitcher and the food processor bowl can be positioned on the base with the handle to either the right or the left side, making it a convenient choice no matter which is your dominant hand.",
    "The five programs include blend, max blend, chop, puree, and mix. The base instantly recognizes each attachment using the Auto-IQ technology and only the relevant programs are made available for the specific attachment that’s in place. Each program is timed and combines the optimum blending and pausing patterns for the task, whilst counting down on the timer. Alternatively, you can select one of the manual speeds, choose between low, medium, and high, or pulse, and the timer will count up.",
    "We found it easy to set up and the programs are intuitive to use, with the manual giving information on what each Auto-IQ program is designed for. Furthermore, there’s a small recipe book included in the box, which is a good starting point and provides some inspiration.",
    "The Ninja 3-in-1 Food Processor with Auto-IQ is such a versatile appliance, we tried out several of the functions and attachments to give it a thorough test, yet there’s still much more that it can do.",
    "The personal blending cup was the first accessory we tried, adding pineapple, apple juice, yogurt, spinach, and banana for a delicious smoothie. We opted for the Max Blend program and let it run for the full 70 seconds. It made a great smooth, silky drink, with no trace of pineapple fibers, although there were some tiny flecks of spinach that hadn’t been completely liquidized. The texture was smooth to drink and the drinking lid didn’t leak when we shook it. We did notice that the blades got a little warm, so wouldn’t want to blend it for any longer.",
    "In the main blending pitcher, it took just five quick pulses to crush six large ice cubes, the multi-level blades clearly doing their job here. Afterward we filled it with water to the maximum fill line for liquid and switched it on to high power. Reassuringly we didn’t see water leaking out of any part of the pitcher or the lid.",
    "We also made mayo in the main blending pitcher; the lowest blades don’t reach to the very bottom of the pitcher, so it struggled to mix the egg yolk and vinegar initially. But once we started adding in the oil, the level rose and it mixed it well. We poured the oil in through the pouring spout in the lid and it took one and a half minutes on low speed to make a lovely thick and emulsified mayo. After blending the blade mechanism can be removed, making it much easier to scrape out all the mayo from the bottom. There’s not a cleaning program, but to clean up tricky greasy residues you can pop it in the dishwasher.",
    "To chop hazelnuts, we opted for the food processor bowl. After five short pulses with very little change, we switched it on to low speed for 30 seconds. The result was quite coarsely chopped nuts with just a small amount of powder. Measuring 86db on our sound meter, this was the loudest noise level we experienced from the appliance. While it’s the equivalent sound level to a vacuum cleaner, it’s only for a short period of time.",
    "To test out the slicing and grating disc, we grated carrot and sliced cucumber. The feed chute is large enough to fit two carrots side by side or a medium-sized cucumber without having to cut it in half. It took a speedy seven seconds to grate two whole carrots, leaving just two thin discs of carrot not grated. It produced an even medium-sized grated carrot perfect for coleslaw. In three seconds it sliced its way through half a cucumber with nothing left unsliced and nice even slices that’ll keep perfectionists happy."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Ninja 3-in-1 Food Processor with Auto-IQ Price and availability",
    "8": "Design",
    "13": "Performance",
    "19": "Don't buy it if…"
  },
  "links": {
    "best air fryers": "https://www.techradar.com/news/best-air-fryer",
    "best blenders": "https://www.techradar.com/best/best-blenders",
    "Instant Pot alternatives": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers"
  }
}