{
  "source": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/readly-1238502/review",
  "title": "Readly review",
  "category": "computing",
  "updated": "2021-07-30T06:43:59Z",
  "author": "sharmishta-sarkar",
  "summary": "Thousands of magazines in one place for a small monthly fee – ‘nuff said!",
  "verdict": "Having thousands of magazines at your fingertips for a small monthly subscription fee is excellent value for money from Readly. Moreover, a very easy-to-use, smooth interface makes it a great reading experience, although not being able to scroll one page at a time on a desktop browser makes it a little hard to enjoy on a larger screen.",
  "pros": [
    "Superb value for money",
    "Vast range of titles",
    "Smooth interface"
  ],
  "cons": [
    "Not great on desktop",
    "No parental controls"
  ],
  "article": [
    "Readly makes it supremely easy to get all your favorite print magazines in one digital place for an affordable price. There’s no need to pay separate subscription fees for each magazine you want – with Readly, you just pay the one fee and you get access to something like 5,000 magazines from around the world.",
    "Yes, there are magazines in several languages available on Readly and they’re all mixed in, although you can filter by language if you wish. If you don’t filter, there seems to be no apparent order in which the magazines are presented to you the first time you sign up, or when you’re browsing to discover new content.",
    "Finding new magazines to read is remarkably simple. While Readly will throw up suggestions on what you’ve previously read, the search feature is very quick and filters only the specific category you’ve searched for, no mix-ups there. No matter what platform you’re using Readly on – PC, tablet or phone – the user interface is simple and smooth, with no apparent latency when turning pages.",
    "Readly seems to have been specifically designed for use on handheld devices like a tablet or smartphone. You can select individual articles within a magazine, which also increases the font size, and also allows you to scroll to read through completely. This feature, however, is missing on the browser application and makes it a little harder to read on a larger screen like a laptop or desktop PC.",
    "All in all, the ability to read as many magazines as you can digest for a small monthly fee makes Readly one of the best platforms for consuming print content in the digital age.",
    "In comparison to subscribing to individual print editions of magazines, Readly is remarkably affordable. For just $9.99 / £7.99 / AU$14.99 a month, you get access to over 5,000 magazines in different languages, plus a handful of newspapers from a few countries.",
    "Importantly, Readly offers a free trial period, which is usually 30 days. Occasionally, however, we’ve found the trial period to be two months, which makes it an even better value option. There are no contracts to lock you in, so you can cancel your membership any time.",
    "Readly claims there are over 5,000 magazines in its catalogue and we didn’t stop to count. That number in itself is staggering, and offers options for every kind of reader – anglers to audiophiles, kids to pensioners, high-flyers to home-makers.",
    "At the time of writing, we couldn’t find any gaps in topic or category. There are trashy supermarket tabloids alongside the likes of National Geographic, and you can find reads on special topics like bird watching and trains. You’ll even find bookazines that teach you about a specific topic, like coding or photography, and there are plenty of puzzle issues as well.",
    "During our testing, we didn't find any delays in new issues of subscribed magazines arriving on Readly, at least for the titles we picked.",
    "Comics have their own category on Readly, with titles like The Walking Dead and Commando included.",
    "There are several kids and young adult magazines also available, like The Beano, National Geographic Kids and so on. However, there are no parental controls, so the kids' titles are sharing shelf space with trashy tabloids of the \"A POLTERGEIST had SEX with our DOG\" variety when you’re doing a general browsing of all the magazines available on Readly.",
    "Readly apps are available for the usual suspects of iOS and Android – for smartphones and tablets – as well as an app for the Kindle Fire tablets. You can even read on a web browser via go.readly.com. All apps are free to download.",
    "The mobile and tablet apps, irrespective of platform, are very similar, displaying thumbnails (or tiles) of each magazine’s cover art. You can browse the Discover section to start getting some ideas of what you could read, and any title you’ve tapped on begins to download automatically for offline reading. The progress of this download is visible via a thin yellow line at the bottom of the screen on tablet and mobile (note that there is no download option when reading on a browser). If you happen to be just flicking through an issue, the download stops, and then picks up where it left off when you open the same issue again at another time. Once downloaded, you’ll see a green down arrow below the specific issue’s thumbnail.",
    "Download speed varies, depending on the size of each individual issue, but is very quick for newspapers. Storage demands aren’t excessive – after downloading four magazine issues and two newspapers, Readly took up 516MB of space on our iPhone. If you don’t think you’ll be reading offline, there is a toggle switch in the app’s settings to disable mobile data for when you’re out and about or abroad. You can, of course, remove anything you've downloaded to free up space.",
    "In fact, Readly gives you a lot of control over how you want the app to function – you can set the maximum number of issues you can download, enabled or disable background refreshes of pages, have page-turn animations switched on and even have a sound accompany that animation, both of which are wonderful just from a nostalgic point of view when reading a digital edition.",
    "Titles and issues you’ve read – even if they haven’t finished downloading – get added to the Recently Read section under My Content. You can Favorite any title you want for easy access later and you can even bookmark specific pages within a magazine if you need to revisit it later. Your favorites, recently read magazines and bookmarks are all listed in the My Content tab across all platforms.",
    "If you’re reading across several devices, your content gets synced almost immediately, including which page you stopped on. If you notice the sync hasn't happened, a quick refresh of the app will do the trick. We tested Readly in a desktop browser, an iPhone, an iPad and an Android tablet and every device synced smoothly.",
    "Browsing and reading on Readly is fast and fluid: it's just like swooping around a photo library, and a thumbnail viewer with a scroll bar pops up for easy navigation. If your device is in portrait mode you'll see single pages full screen, and in landscape you're given the choice of single page view and double page view. On a browser, though, you only get the double-page view, with a single zoom option via double-clicking on a page.",
    "Two-page views on any device have very small font sizes making them exceptionally difficult to read (practically illegible on a phone). We tried reading on both a 16-inch laptop as well as a 24-inch monitor and they both were hard to read. Zooming in isn’t a great experience on desktop either as that requires a lot of scrolling up and down, as well as left and right to get the full page experience.",
    "One-page views on mobile and tablet, though, require no such zooming. You can pinch to zoom if you wish, but there is a yellow 'page' icon below each magazine page that opens up a full article in a single file. This removes some formatting aspects of the article (although images remain untouched), as well as any background colors, but it offers a smooth scrolling and reading experience for individual articles.",
    "Interestingly, the Readly app is intuitive enough to recognize an advertisement from the real articles, and the page icon disappears for ad placements and covers. This feature lets you read either on a white background or switch to dark mode for a black background and white text. If there are multiple articles on a single page, a pop-up is presented asking you which one you want to read.",
    "Unfortunately, this article view feature isn’t available when reading on a browser and is our only complaint about the Readly experience.",
    "If you love your magazines, we can’t recommend Readly highly enough, particularly since it offers such great value. Not only are you getting access to thousands of magazines you likely wouldn’t be able to get in your country, it also doesn’t cost much at all. You only need a couple of magazines to justify the monthly Readly subscription.",
    "A simplified user experience, the ability to read offline and switch across different devices without losing your spot makes Readly a great experience… as long as you steer clear of the platform’s browser interface, which is missing some of the mobile and tablet app features.",
    "[First reviewed 2014; updated July 2021]"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Readly free trial and price",
    "7": "Readly catalogue",
    "12": "Readly apps",
    "18": "Reading experience",
    "23": "Verdict"
  },
  "links": {}
}