{
  "source": "https://www.techradar.com/reviews/lightning-calendar",
  "title": "Lightning Calendar review",
  "category": "computing",
  "updated": "2021-11-03T14:30:05Z",
  "author": "stefan-ionescu",
  "summary": "How does Mozilla Thunderbird's built-in calendar app measure up?",
  "verdict": "Lightning Calendar is a nice extension to Mozilla Thunderbird, in a similar way to how Microsoft Outlook features its own integrated calendar. While it currently offers a large number of features – including some nice extras for Lightning Calendar – Thunderbird still suffers from the same issue that has been plaguing it for a long time. Its interface leaves a lot to be desired, and if you’re not used to “old school” open-source applications and their UI, it can take a while to adjust.",
  "pros": [
    "Free and open-source",
    "Good for organizing tasks",
    "Works well on older systems"
  ],
  "cons": [
    "Occasional bugs",
    "Clunky interface that’s a little rough around the edges",
    "Not available as a standalone application, only as part of Thunderbird"
  ],
  "article": [
    "Calendar applications have become very diverse in their features and even core functionality. While some are aimed at presenting a good overview of the user’s daily schedule, others are better suited for long-term planning and addressing issues in a large organization. There are plenty of options for those who’re just looking for something closer to the traditional functionality of older calendar apps too.",
    "Lightning Calendar is a feature-rich calendar offered as part of Mozilla Thunderbird, the free, open-source email client. While a lot can be said about the usefulness of Thunderbird in comparison to other offerings like Microsoft Outlook, those who’re primarily interested in the calendar functionality can safely ignore the rest of the application.",
    "Lightning Calendar should prove equally useful to those who just need something simple and those who want a full-featured calendar suite with all the bells and whistles. The only potential issue is getting used to the user interface.",
    "Lightning Calendar is completely free. It follows the same principles as most of Mozilla’s other programs, meaning that it comes with no strings attached, and the source code is completely open as well. Anyone can get involved and contribute, and in fact, the organization somewhat relies on public contributions for its existence.",
    "If you find that you enjoy using Lightning Calendar and want to contribute something to its development, the organization accepts donations – just head over to the main Thunderbird website for more information. Keep in mind that you’re not required to do that in order to get the full functionality of Lightning Calendar, and donating won’t grant you any special perks either.",
    "Lightning Calendar offers a standard set of features, leaning towards the heavier side. You can create events, set up reminders, and invite people. You can also take advantage of public calendars that provide readily prepared information for various use cases. The community around Lightning Calendar is one of its strongest features, as the application enjoys a lot of support from its many users.",
    "Tasks have detailed configuration options, including progress tracking and advanced postponing. You can additionally configure the application itself extensively, making use of various options aimed at individuals and organization users alike. It can take a while to get used to what Lightning Calendar has to offer, and start taking full advantage of its features, but it’s definitely worth learning its ins and outs.",
    "The interface of Lightning Calendar is its weakest point, as we mentioned above. It’s far from a modern application in this regard, and those who aren’t used to the blocky look of some open-source applications might be a bit shocked by the initial presentation. If you don’t care for any flashy effects and animations though, the actual organization of the UI is quite good, and everything is exactly where you would expect to find it.",
    "The designers have clearly been taking lots of cues from Microsoft Outlook, which is not a bad thing as it means that you will need less time to adapt if you’re coming in from Microsoft Office. Still, Thunderbird – and Lightning Calendar by extension – isn’t as rich in features as Outlook, so you might be frustrated from losing some options.",
    "Lightning Calendar’s support is mostly community-based, much like the development of the application itself. Mozilla has prepared a large help base full of useful information, but if you can’t find an answer in there, you’ll have to post on the community forums. There isn’t really any dedicated support team to speak of, unless you’re involved with the program’s development, which is a different story anyway.",
    "You might be pleasantly surprised by the responsiveness and helpfulness of the community though. Most issues are resolved quickly, and you get the benefit of having multiple pairs of eyes on your problems.",
    "Microsoft Outlook is perhaps the most direct competitor to Thunderbird, and therefore Lightning Calendar. While it’s not free, it does offer more features than Lightning Calendar, and in a nicer package. That said, if you aren’t too pretentious about the visual presentation of your calendar application and don’t want any specialized features aimed at large organizations, you should be just fine with Lightning Calendar. Just don’t expect anything special compared to the competition.",
    "Lightning Calendar gets the job done, and that’s about it. It’s not a special application in its corner of the market, and it can definitely use some improvement on the interface side. But if you don’t care about that aspect specifically, it should provide you with everything you need for a smooth, fulfilling experience. The fact that it works on multiple platforms is a nice bonus, although the lack of a mobile app can be a big downside to some users. In those cases, you should look into synchronizing your calendar through a third-party platform, like Google’s services or something similar that Thunderbird can integrate with.",
    "We've also featured the best calendar apps"
  ],
  "headers": {
    "3": "Plans and pricing",
    "5": "Features",
    "7": "Interface and use",
    "9": "Support",
    "11": "The competition",
    "12": "Final verdict"
  },
  "links": {
    "calendar apps": "https://www.techradar.com/best/best-calendar-apps",
    "Lightning Calendar": "https://www.thunderbird.net/en-US/calendar/",
    "Mozilla Thunderbird": "https://www.techradar.com/reviews/mozilla-thunderbird",
    "email client": "https://www.techradar.com/best/best-email-clients",
    "Microsoft Office": "https://www.techradar.com/reviews/microsoft-365-review",
    "Microsoft Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "best calendar apps": "https://www.techradar.com/best/best-calendar-apps"
  }
}