{
  "source": "https://www.techradar.com/reviews/sony-xperia-1-iii",
  "title": "Sony Xperia 1 III review",
  "category": "phones",
  "updated": "2021-08-20T08:53:52Z",
  "author": "james-peckham",
  "summary": "Sony’s best phone for quite some time",
  "verdict": "The Sony Xperia 1 III isn’t for everyone, but for those who enjoy Sony’s Android phones, or who want a top-tier smartphone with a versatile camera, a beautiful screen and strong battery life, this is a great choice. It’s expensive, and its design means it isn’t for everybody, but if your budget can stretch to it, and you're a fan of its looks, it could be a great option.",
  "pros": [
    "Great battery life",
    "Incredible display",
    "3.5mm headphone jack"
  ],
  "cons": [
    "Tricky to handle, for some",
    "No in-screen fingerprint sensor",
    "Expensive"
  ],
  "article": [
    "The Sony Xperia 1 III is the best smartphone the company has made for years, offering a top-tier smartphone display, great battery life and a versatile camera that’s easier to use than those on previous Sony handsets.",
    "It isn’t the right phone for everyone – there are some unique elements to Sony’s approach to handsets that means it may not be for you – but if you like Sony smartphones, or you’re willing to try something a bit different, this could be for you.",
    "Sony is making a song and dance about how this is the world’s first 4K 120Hz smartphone – although that claim isn’t quite as impressive as it sounds, as Sony is currently the only brand making 4K phones. That 120Hz upgrade makes this screen better than ever though, with super-smooth scrolling the icing on the ultra-high resolution cake.",
    "The 21:9 aspect ratio won’t be for everyone – it’s designed that way to offer a ‘big screen’ experience when watching video – and this has a big impact on the design of the handset, and will make it difficult for people with smaller hands to hold. That said, this is the best screen we’ve seen from Sony for some time, and it’s one of the best on any phone released in 2021 so far.",
    "The camera has been upgraded over the Xperia 1 II – the new features aren’t game-changing, but the company has included a variable telephoto camera and a few tweaks to the main shooter that make this a stronger handset for photography than previous Sony phones.",
    "In fact, we found this to be the easiest camera to use on a Sony phone for some time. The automatic mode works well, and if you’re willing to play around with the settings you’ll find even more is possible via the in-depth shooting app.",
    "Inside the phone are a Qualcomm Snapdragon 888 chipset and 12GB of RAM, which we found delivered impressive performance throughout our testing, and you’ve got the option of 256GB or 512GB of storage. That’s plenty of power, and more than enough storage space for the average user.",
    "Sony has also improved the battery life here, by increasing the size of the cell, as well as by implementing a few new optimizations enabled by the new chipset. We found that the phone was able to last a full day even with intensive usage, and there are also new wireless charging features, such as reverse charging.",
    "There’s no denying that the price of the Xperia 1 III is high, and the 21:9 aspect ratio design will put some off, too. But if those aren’t issues for you, and you want a highly capable smartphone with a superb screen, the Xperia 1 III may be the perfect phone for you.",
    "The Sony Xperia 1 III was revealed on April 14, 2021, and the official release date was set for over four months later on August 19. That was a long gap between being announced and it being on sale, but you can now readily buy the handset in the US and UK.",
    "The starting price of the phone is $1,299.99 in the US and £1,199 (around AU$2,200) in the UK, which is slightly more than the launch cost of the Xperia 1 II.",
    "There's no word on whether it'll arrive in Australia. Sony doesn't traditionally sell its phones in Australia, so we're not expecting it to be easily on sale there.",
    "The design of Sony Xperia 1 III isn’t significantly different to that of recent Sony flagship phones, so if you've seen previous handsets from the company you can expect a similar affair here.",
    "The same long-and-narrow design returns here, with a 6.5-inch 21:9 aspect ratio display. This aspect ratio means the phone is longer than a lot of rival flagships like the Samsung Galaxy S21 Ultra and the Xiaomi Mi 11.",
    "The main difference between this phone and 2020’s Sony Xperia 1 II is that it’s slightly thicker – that’s to fit in a larger battery, which we’ll cover below. It doesn’t feel too thick though, and it feels reassuringly premium.",
    "The handset weighs 186g, and that increases by a few grams if you opt for the Xperia 1 III in its mmWave 5G variant (that’s the one on sale in the US).",
    "It has a glass rear with a brushed finish that makes it easy to grip, although its sheer size, at 165 x 71 x 8.2mm in a 21:9 aspect ratio, makes it an awkward handset for those with smaller hands to grasp comfortably – if you’re one of these people we’d recommend getting a case for the phone, as you may find it’s easily dropped",
    "The volume rocker and power button are on the right edge of the phone, and the fingerprint scanner is built into the power button, so you’re not getting an in-screen sensor, as you do a lot of other phones around this price.",
    "Below the power button is a Google Assistant button, which we didn’t find we used much during our testing time. This sits flush with the handset, so it’s unlikely to be something you’ll find yourself hitting by accident.",
    "There’s also a dedicated camera shutter button at the bottom of this edge, positioned so that it’s easy to hit when you’re holding the phone in landscape mode; Sony has even embossed it on the Xperia 1 III so it's easier to work out which button you’re hitting.",
    "The bottom edge houses the USB-C port and the SIM tray is on the left edge, while on the top edge is the 3.5mm headphone jack – this will be a major selling point for some, as it’s a feature that’s not available on a lot of top-end phones.",
    "There are also front-facing stereo speakers on the Xperia 1 III, something that has always been a highlight of Sony’s top-end phones. For this generation, they’re 30% louder and it makes a noticeable difference; if you’re after a phone with great speakers, this is a serious contender.",
    "Sony is selling the Xperia 1 III with the tagline of it being the world’s first smartphone with a 4K 120Hz display. As we’ve mentioned, this isn’t a huge surprise, as Sony is the only company offering 4K displays on a smartphone right now, but that doesn’t mean the experience isn’t fantastic.",
    "A 4K resolution is often wasted on a smartphone screen due to the limited size – and particularly with a 6.5-inch screen it can sometimes be difficult to see the difference between a QHD resolution and 4K, but it’s noticeable when watching 4K movies and videos.",
    "That 120Hz refresh rate, meanwhile, is a game-changer – previous 4K Sony smartphones haven’t offered anything above 60Hz. 120Hz means the image on your screen refreshes at 120 times per second, which means the on-screen image will look smoother when you're playing games or watching movies, or even just scrolling your Instagram feed.",
    "There are two image quality modes on the Xperia 1 III: Standard mode (which is on by default), or a Creator mode, which is designed to offer faithful color reproduction and a variety of other image-processing enhancements to make content look as close as possible to how its creators intended.",
    "We found ourselves using this mode more regularly, and it didn’t seem to have a detrimental effect on the battery life of the handset. Colors weren’t as vibrant when navigating the phone’s user interface, but they looked more true to life in video.",
    "If you’re looking for a phone on which to watch films, videos or TV shows, the Xperia 1 III is a great option. The 21:9 aspect ratio also offers something unique for mobile gaming, as it allows you to see more of the playing environment than on other handsets.",
    "Sony has tweaked the camera experience on its flagship smartphone for 2021 rather than overhauling it, and that isn't a bad thing. The camera isn’t the absolute best on the market in its auto mode, but we found that it captured images that are comparable with those from most top-end phones in 2021.",
    "Heading up the camera array is a 12MP f/1.7 aperture 24mm wide-angle shooter, which acts as the main camera. There’s also a 12MP f/2.2 16mm ultra-wide for when you need to get more people, or more of a scene, into the frame.",
    "The unique element of the Xperia 1 III’s camera setup is an adaptive telephoto camera, which comprises a 12MP sensor and two lenses – a f/2.3 70mm telephoto lens, and a f/.2.8 105mm lens for even greater reach.",
    "Why would you want an adaptive camera? Sony says this is faster than switching between two separate telephoto cameras, and in our testing we found using the camera to be a smooth experience that can offer great image quality and more flexible use than on other phones.",
    "The 70mm lens is designed to zoom in to 2.9x, while the 105mm lens offers 4.4x zoom; beyond that there’s digital zoom up to 12.5x. The zoom won’t offer the same quality of Samsung’s telephoto zoom on products like the Galaxy S21 Ultra, but it does offer a good experience alongside the main camera.",
    "If you’re looking specifically for a telephoto shooter you’re better off going for a flagship phone from Samsung, but it’s a nice perk to have on the Xperia 1 III, and you’ll find it helpful when you want to capture long-range shots. Here’s an example of what the Xperia 1 III telephoto cameras can do:",
    "The big photography feature of the Xperia 1 III that Sony is talking up is the company’s fast autofocus Dual PDAF technology. We found this to work fantastically in our testing, with the camera able to track objects such as animals or humans to ensure it’s less likely to blur when you hit the shutter button.",
    "It’s especially useful when you’re taking photos of pets or other animals who can’t be relied on to keep still while you snap their portrait, and the autofocus meant we were consistently getting a great image.",
    "Images contain impressive levels of detail, and colors feel true to life. The colors may not be exactly to your taste – for example, Samsung and iPhone cameras both produce a slightly more vibrant image – but if you want colors that look as close as possible to what you see in real life, you won’t go far wrong with the Xperia 1 III.",
    "The front camera is exactly the same as the one on the Xperia 1 II, which we found produced good-quality selfies. This camera is housed in the bezel at the top of the phone, and it’s an 8MP f/2.0 camera that’s good enough for the odd shot for social media, as well as for video calls.",
    "The Xperia 1 III is equipped to offer flagship performance, with the top-end Qualcomm Snapdragon 888 running the show, teamed with 12GB of RAM.",
    "You can pick up the handset with either 256GB or 512GB of storage, but unlike in previous generations you’ll get 12GB of RAM with both – and if you need more storage on top of that, you can expand on it via the microSD slot.",
    "In everyday use we found that the Xperia 1 III delivered top-tier smartphone performance – it’s able to run any game you’ll find on the Google Play Store, and we found that apps loaded as quickly as you’d expect for a top-end phone.",
    "We didn’t encounter any stuttering, and the Android 11 software onboard worked smoothly. Sony lays its own user interface over the top of Android – we like the look it brings, and it also offers a few extras that you don’t get with stock Android.",
    "The phone will launch with Android 11 software onboard, and the company has suggested it'll be upgrading to Android 12 and Android 13 (or whatever that iteration is called) in future.",
    "The Xperia 1 III scored an average of 3233 in our Geekbench 5 testing, which is a touch below what we’d expect from a top-end phone in 2021. For example, the Samsung Galaxy S21 scored 3367 (that’s the version running the Exynos 2100 chipset), and the OnePlus 9 Pro beat that with 3630.",
    "That may look subpar on paper, but in real-world use we didn’t notice any performance shortfalls compared to the OnePlus 9 Pro.",
    "5G is a big focus for the Xperia 1 III, and this is the first time Sony has offered the next-gen internet technology on its US flagship phone. The variant of this phone in the US is compatible with mmWave technology.",
    "In our limited testing (pandemic restrictions have limited our travel options), we found 5G connectivity to work well, with the strength and reliability of the signal being comparable with other handsets of this type.",
    "Sony has included a larger battery here than in the Xperia 1 II, and it makes a noticeable difference, with the phone lasting for at least an hour longer than during our testing time with the last-gen phone.",
    "It’s a 4,500mAh cell, compared to a 4,000mAh one in the Xperia 1 II. That doesn’t seem like a huge difference on paper, but combined with the power-usage optimizations enabled by the Snapdragon 888 we found it to make a noticeable difference.",
    "We often found the Xperia 1 III would have plenty of charge left at the end of a full working day, and we always had around 10% or so left in the tank at around 11pm.",
    "Sony has also improved its fast-charging here, so you’ll get a 30W charger with the phone. While many other manufacturers have dropped the charger from the box, Sony has decided to continue including one.",
    "What does 30W charging mean in practical terms? In theory it means that if your phone is at zero it’ll get you to 50% charged in just 30 minutes, and having used the charger in the box we found this to be accurate.",
    "Wireless charging is also an option here, although we’ve yet to learn the exact stats for that.",
    "Sony has also included reverse wireless charging for the first time here, which we found worked well – this allows you to charge devices such as headphones, smartwatches or other phones from your phone’s battery.",
    "This is particularly helpful, for example, if your headphones have died and you want to give them a quick boost. As with other brands’ reverse-charging tech, the charging speeds aren’t particularly impressive, but it’s useful in a push.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Sony Xperia 1 III release date and price",
    "12": "Design",
    "22": "Display",
    "28": "Camera",
    "38": "Specs and performance",
    "47": "Battery life",
    "55": "Don't buy it if…"
  },
  "links": {
    "Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Qualcomm Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Android 11": "https://www.techradar.com/news/android-11",
    "the company has suggested": "https://www.techradar.com/news/no-sonys-xperia-1-iii-wont-be-limited-to-just-one-android-update",
    "Android 12": "https://www.techradar.com/news/android-12-news"
  }
}