{
  "source": "https://www.techradar.com/reviews/fitbit-ace-3",
  "title": "Fitbit Ace 3 review",
  "category": "fitness",
  "updated": "2021-06-01T15:21:29.606Z",
  "author": "carrie-marshall",
  "summary": "The Ace 3 is a kid-friendly fitness tracker that's built to last",
  "verdict": "The latest Fitbit Ace is designed for kids aged six and up, and offers both activity tracking and sleep tracking. It’s fun, tough and water resistant, so it can handle pretty much any eventuality, and with around eight days between charges, it has plenty of stamina too.",
  "pros": [
    "Kids love it",
    "Silicone band also protects the screen",
    "Tracks activity, not just steps"
  ],
  "cons": [
    "Companion app isn’t exciting",
    "Short charger cable",
    "Only two colors"
  ],
  "article": [
    "The Fitbit Ace 3 is a Fitbit fitness tracker designed specifically for children, with a recommended minimum age of 6+. It’s more rounded than its predecessor with a brighter display and better battery life – up to eight days compared to five for the Fitbit Ace 2 – and with 50m water resistance it’s shower and swim-friendly too.",
    "It’s available in dark blue with green detailing and black with red detailing. The display is a monochrome PMOLED, and there’s a good selection of watch faces so that no two Aces are identical.",
    "Because the Fitbit Ace 3 is designed for children, it doesn’t track everything a grown-up tracker monitors, so for example there’s no data on calories burned or any facility to track weight loss. Children over 13 can track these things if they create a standard Fitbit account, which isn’t open to under-13s.",
    "For younger children the Ace 3 tracks sleep, steps, exercise time and active minutes. The latter uses multiple sensors to track all kinds of activity including jumping, trampolining and sports as well as the familiar step counting. There’s no GPS for location tracking.",
    "You or your children can set a range of activity goals that offer game-style rewards for reaching a certain number of steps or active minutes, and the Fitbit app has a Kid View that enables them to see their stats but not the rest of the family’s fitness data. Although the app isn’t particularly kid-focused it works well enough and the numbers proved to be powerful motivators for our own young testers.",
    "The Fitbit Ace 3 doesn’t come with lots of flashy features such as movie tie-ins or cartoon characters, and we think that’s a good thing; it doesn’t look like a childish device and that proved to be a big plus for our testers. The Ace 3 is good-looking, comfortable and tough enough to cope with even the most exciting adventures.",
    "The Fitbit Ace 3 was released in March 2021, and costs $79.95 / £69.99 / AU$99.95, direct from Fitbit (though you may be able to find it more cheaply at third-party stores).",
    "That's almost identical to the Garmin Vivofit Jr 3 kids' fitness tracker, which costs $79.99 / £79.99 (but is substantially more expensive in Australia at AU$159).",
    "Update: In June 2021, Fitbit also released the Fitbit Ace 3 Special Edition: Minions, which has a Minions-themed engraved band and special activity badges.",
    "Like its predecessor, the Fitbit Ace 3 is a small, rectangular pebble enclosed in a silicone band that protects it from lumps and bumps. The Ace 3 is more rounded than the Ace 2, and looks more modern as a result. It has an adjustable plastic clasp and currently comes in two options: dark blue with green clasp and black with a red clasp. Other colored straps can be bought separately.",
    "The strap fits wrists from 116mm to 168mm in circumference, and everything is water-resistant; the Ace 3 is good to 50m so it can stay on in the shower or when your child is swimming.",
    "The silicone band is comfortable and easy to adjust, and we were delighted to discover that unlike many kids’ watch straps the Fitbit’s band didn’t irritate our younger tester’s very sensitive skin. Where other kids’ watches would result in a fiery red rash if worn overnight, there was no irritation from the Fitbit during an entire month of 24-hour wear.",
    "The Ace 3’s display is a backlit monochrome OLED touchscreen and you can choose from a range of clock faces to personalise it via the Fitbit app. The lack of color is a bit disappointing when some rival kids’ trackers are more colorful, but the Fitbit Ace 3 lasts three days longer between charges than its predecessor, which we find more useful.",
    "The screen wakes when your child raises their arm, and the device can be controlled by pinching its sides or swiping the touchscreen to move between the clock face, the step counter, the sleep tracker, the timers, and options such as 'do not disturb'.",
    "The internal battery is non-removable and charges via a too-short proprietary USB cable that attaches to the back of the Ace. You should expect to charge the Fitbit roughly once a week. The official battery life is eight days, and we typically achieved eight or nine after a very excited first week during which constant step-checking killed the battery in just under seven days.",
    "The Fitbit Ace 3 has some clever ideas to keep kids excited, such as watch faces that only animate when you move around. Depending on the watch face, you can also display today’s activity on the main time screen, and if you set up challenges in the app the Ace can ping them when they get close to achieving their goals. If your child has their own phone you can also set up the Ace so that it receives notifications of calls and messages.",
    "One of the key selling points of the Ace 3 and benefits of its long battery life is that its tracking doesn’t stop at bedtime. It also tracks sleep and you can set up a reminder that might help with the daily challenge of getting the kids to go to bed. You can also set an alarm to wake them up again.",
    "We found the sleep tracking had an unexpected benefit for parents: by encouraging our testers to compete to see who could rack up the most sleep hours, we found bedtimes faced less resistance and that we got more time alone with the newspapers at the weekend. We can’t promise that this will last much longer but we’re very much enjoying it right now.",
    "We found that while our younger tester was motivated primarily by stats, to the point where they would finish dinner and then immediately race outside to bounce on the trampoline or run around, our older tester liked the Fitbit simply because it was a nice watch: the activity tracking was “interesting” but they chose it over their usual Timex for no other reason than “it looks cool”.",
    "The lack of movie character tie-ins was definitely a plus here: the Ace 3’s clean lines, sober colors and sticker-free appearance meant it didn’t become embarrassing for our older tester to wear to school.",
    "The Fitbit Ace 3’s screen is noticeably brighter, which makes it easier to read in bright daylight, and it’s easy for your child to see their activity stats without having to open the Fitbit app, although they can view their stats in more detail there too.",
    "Because it’s designed specifically for children the Fitbit Ace 3 doesn’t track calories. It tracks active minutes instead, a measure of activity that comes from counting not just step counting but any time spent doing other active things such as jumping, trampolining, skipping or playing racket sports. That’s courtesy of the built-in three-axis accelerometer and heart rate sensors, although you might find that older testers decide to cheat on their activity count by sitting on the sofa while waving their arms around – something our 13-year-old did specifically to annoy their younger sibling, who was running around the garden in order to boost their step count.",
    "We’ve found that the biggest problem with kids’ fitness trackers can be making sure the trackers are worn in the first place: like most parents, we’ve spent plenty of money on tech that ended up gathering dust on a shelf when the novelty wears off. But that didn’t happen with either of our testers after a month of daily use. Our younger tester wasn’t telling us their updated step count every three minutes, but they were still tracking their steps and doing extra exercise to maximize the activity count.",
    "In addition to the fitness tracking the Fitbit also enables you to set inactivity reminders and countdown timers, and to use the device as a stopwatch. The ability to set family goals in the Fitbit app is handy too enabling you to taunt one another, send each other encouragement or challenge each other to fitness competitions. It’s a very comprehensive package.",
    "Although the Fitbit Ace 3 has been designed solely for children it uses the standard Fitbit app, albeit with much of its functionality removed – so for example they can’t take part in the Fitbit community or see how many calories they’ve burned. However, what remains is clearly an app made for adults and adapted for children, rather than one designed ground-up for younger users, and neither of our testers particularly liked it.",
    "Setting up a child’s Fitbit is different from setting up a Fitbit for yourself. First of all you need to create a Family Account, and then you add your children – or at least, your children under 13. Although it’s not made clear in advance by the setup process, you can’t create a child account for anyone 13 or older. If your child is 13-plus they should set up a standard Fitbit account of their own and you can then send them an invite to join your Fitbit family.",
    "Standard accounts enable additional features in the app including calorie tracking, menstrual health tracking and access to the Fitbit community. For kids currently just shy of 13 you’ll be able to upgrade their account to a standard account on or after their 13th birthday.",
    "We chose to pair the Fitbit Aces with the parental phone, which wasn’t ideal: while it was great to be able to see our kids’ progress in the app, it also meant that our phone was required every time they wanted to see their stats or change a clock face.",
    "To the best of our knowledge it’s not possible to pair an Ace 3 with the Fitbit app on multiple devices without also using the parental login details and then switching to Kid View, so it’s worth thinking about which device you want your child to use before you set anything up.",
    "First reviewed May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Fitbit Ace 3 price and release date",
    "8": "Fitbit Ace 3 design",
    "15": "Everyday use",
    "20": "Fitness tracking",
    "24": "Companion app",
    "30": "Don't buy it if"
  },
  "links": {
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Ace 2": "https://www.techradar.com/reviews/fitbit-ace-2"
  }
}