{
  "source": "https://www.techradar.com/reviews/corsair-sabre-rgb-pro-wireless-champion-edition",
  "title": "Corsair Sabre RGB Pro Wireless Champion Edition review",
  "category": "computing",
  "updated": "2021-11-11T17:59:40Z",
  "author": "chazz-mair",
  "summary": "An efficient wireless option",
  "verdict": "The Sabre RGB Pro is fine. It is a wireless gaming mouse with good specs that’s a little uncomfortable. The buttons feel nice, and it charges quickly. But we don’t know many people who can take advantage of its 26,000 DPI. But if you are someone who could use that – go for it. Because that’s easily the most impressive part of this mouse.",
  "pros": [
    "Lightweight",
    "High polling rate"
  ],
  "cons": [
    "Wired version is faster for less",
    "Expensive",
    "RGB is gaudy"
  ],
  "article": [
    "Corsair’s Sabre RGB Pro Wireless Champion Series is a fine, inoffensive gaming mouse. With a max sensitivity of 26,000 DPI and a polling rate of 2,000 Hz, it’s certainly a solid option, but it fails to impress for its somewhat steep $109 (about £76, AU$149) price point.",
    "While testing the Sabre RGB Pro Wireless, we’re spending a lot of time with high-speed arcade shooters, but we’re not impressed in a way that would make us sing its praises in any specific way. Instead, we have some minor nitpicks with its construction that keeps it from being a great mouse. You’ll notice a difference if you’ve gone from a standard mouse to a gaming mouse. However, If you’re already experienced with gaming peripherals, the Corsair Sabre RGB Pro Wireless just doesn’t stand out.",
    "At around 5 inches in length and 2 inches in width, the Sabre fills up our hand. Our thumb fits comfortably on the side, and our ring and index fingers rest neatly on the left and right buttons. Those buttons are also both spring and switch-loaded. When you hit the buttons there’s some stress which feels nice when you hit them. It’s a good bit of feedback that often goes unnoticed.",
    "On the other hand, the side of the mouse is smooth and missing that bit of grip that many competing mice have, so it tends to feel like you’re holding this little slab of plastic instead of an actual mouse. All of the buttons are very big and hard to mindlessly press. The DPI switch is buried at the center of the mouse and covered in this glossy material that makes it slippery – you won’t press it accidentally. Finally, on the mouse’s underside is a switch that flips between wired, wireless, and Bluetooth modes. All of which work just fine.",
    "The mouse is very light for something of its size and moving it around is nice and easy. After getting used to the sterile, slick feel of the mouse, it no longer bothers us. It might be a bigger deal if your hands tend to get sweaty.",
    "But none of these features set it aside from the wired version of the same mouse. The wireless version drops the wired version’s 8000 HZ polling for the option to use Bluetooth or Corsair’s Slipstream tech to make a low-latency wireless mouse. TK",
    "Out of the box, you get a decently long USB-C cable that both charges the mouse and connects it to your device, which is always a bonus. Over a week of using the mouse, the battery has only died once but thankfully it charges super quickly. If the mouse ever dies, we can just switch to wired mode for a few minutes and change it back when it's full. From there, the mouse can work for several more days.",
    "The Sabre RGB Pro Wireless, like other Corsair products, works with iCue – its device management application. While it has recently been updated, it still is pretty clunky to use. It takes a while to load, and we have had trouble even getting the mouse to get detected. There’s dropdown menus and big pictures of your device, it needs to be streamlined.",
    "Like with any of these apps, you can adjust your settings. Most of the options just don’t seem that useful though when you’re dealing with a range of 1,000-2,000Hz. They’re both above the norm but far from exceeding market expectations. You can also change the color of the light but it’s placed right under your palm so you’ll only see it when you’re not using it. It feels superfluous and a little gaudy.",
    "If an app like iCue has to exist, it would have to do something seriously unexpected to impress us. So, like the Sabre RGB Pro Wireless itself, it gets the job done, but it’s not exactly outstanding.",
    "That’s the Corsair Sabre RGB Pro Wireless Champion Series in a nutshell. It’s a middle-of-the-road gaming mouse with some nice quality of life features – but those features don’t make it impressive enough to be worth the $109 (about £76, AU$149) price tag; especially when it’s wired sibling does all of those things and has a higher polling rate.",
    "PS: Might be worth checking out the Corsair Katar Pro XT as well."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Don't buy it if..."
  },
  "links": {
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "Corsair Katar Pro XT": "https://www.techradar.com/reviews/corsair-katar-pro-xt"
  }
}