{
  "source": "https://www.techradar.com/reviews/red-magic-watch-review",
  "title": "Red Magic Watch review",
  "category": "wearables",
  "updated": "2021-07-07T09:13:55Z",
  "author": "tom-bedford",
  "summary": "Beauty that’s surface deep",
  "verdict": "The Red Magic Watch has a fairly good-looking design and a user interface that’s one of the best we’ve seen in a smartwatch, as well as a battery life that keeps it ticking nearly two weeks. None of that is nearly enough to compensate for the awful fitness features though, with GPS that’s completely wrong and information that’s presented confusingly.",
  "pros": [
    "Good-looking UI",
    "Sleek design",
    "Fairly long-lasting battery"
  ],
  "cons": [
    "Horribly inaccurate GPS",
    "Confusing app interface",
    "Crashing problem"
  ],
  "article": [
    "When ZTE’s Red Magic gaming sub-brand announced its first smartwatch, we were skeptical; when we opened the box and saw the smartwatch, we were impressed, but after using the thing… well, you’ve already scrolled past that score.",
    "The Red Magic Watch doesn’t do anything to justify itself as a ‘gaming’ watch, which makes it odd that ZTE opted to release it under its Red Magic gaming brand (instead of just launching it as a ZTE or Nubia Watch, as with its other wearables).",
    "Instead of looking at this like a wrist-mounted gaming device, then, it’s best just to view it as a low-cost Chinese smartwatch made by a phone company, and it’s far from the first such device. We’ve got the Xiaomi Mi Watch, Realme Watch, OnePlus Watch, Oppo Watch, Honor Magic line, and so on - these devices aren’t there to compete with your Apple, Samsung or Huawei watches, but to give you a low-cost wrist-mounted complement to your pocket device.",
    "So within that busy niche, how does the Red Magic Watch fare?",
    "The Red Magic Watch puts its strengths up front: it’s pretty good-looking as low-cost smartwatches go, with a slim bezel and a fairly minimal design, but it’s in the user interface department where the wearable really shines.",
    "Compared to most other smartwatches on the market, the Red Magic Watch UI is bright and bold, with attractive menus, plentiful color and imaginative ways to present information. Scrolling through the watch’s menus felt just a little bit more enjoyable thanks to the design.",
    "Oh, and since we’re front-loading the compliments, it’s got a decent battery life at two weeks, which will easily outlast your Apple Watch or Wear OS device. It’s also very affordable, undercutting most of the other entries in the ‘phone-company-budget-watch’ niche, which is possibly why you’re checking it out in the first place.",
    "A low cost isn’t always a good thing though, and in the Red Magic Watch, its main function is to help us segue into our round-up of the device’s negatives. And there are quite a few.",
    "Our main concern is that, while the Red Magic Watch has built-in GPS, it’s dramatically - dare we say, comically - wrong. The companion app consistently showed our workout route to be roughly 10 miles off where it actually was - and that’s when it decided to record location at all. On the topic of the app, it doesn’t show all your data from exercise including, inexplicably, the timing of the workout.",
    "While we complimented the watch’s user interface, it is full of typos, and the app is too - this device needed a once-over for its language localization. There are also inconsistencies between how data is presented in the app and UI, like with distance being shown in meters in the app and rounded to kilometers on the watch.",
    "This kind of thing isn’t bad, per se, it’s just inoffensively weird. ZTE’s wearables have a history of buggy software, and this is just another example.",
    "But we did encounter one bug which wasn’t just bad, but catastrophic - part way through our testing of the Red Magic Watch it inexplicably crashed, wiping all our data on the watch in the process. This was incredibly frustrating, as you can well imagine, and soured our thoughts on the device.",
    "So it’s not a good run for the Red Magic Watch, but the most damning evidence of its failings is how relieved we were to take it off at the end of our review period, and start using a smartwatch that would track our workouts with a degree of accuracy (and not crash at random).",
    "The Red Magic Watch price is $99 / £89 (roughly AU$160, though the watch isn’t listed on Red Magic’s Australian website, so it seems the thing isn’t on sale there).",
    "That’s a really low price for a smartwatch, even one aiming at the aforementioned ‘low-cost Chinese smartwatch made by a phone company’ market - for context the OnePlus Watch costs $159 / £149 (around AU$210) and the Xiaomi Mi Watch clocks in at £119 (around $165, AU$210).",
    "You can buy the smartwatch from the Red Magic website if you’re interested, in black or silver. As the images show, we tested the latter.",
    "Like basically all smartwatches, in the ZTE Red Magic Watch box you get the body of the thing - silver or black - and a set of removable bands, which are beige or black depending on which body you opted for.",
    "The straps are made of silicone, giving the watch a rubbery feel when on the wrist. There are plenty of holes, which means you’ll probably be able to find a good fit for the watch on your wrist, and it also makes the band breathable - there are two loops on the strap so you can securely fasten the excess length down.",
    "The watch body is pretty large, with a 1.39-inch display and a bezel around that - wearing it felt a little like balancing a dinner plate on an arm. It was pretty thin though, so it didn't feel overwhelmingly large.",
    "Curiously, the Red Magic website cites both a 30g weight and 290g weight for the watch - the former seems too low and the latter too high. Apparent translation errors make this, and much of the website, a little confusing (which foreshadows the software section nicely).",
    "There are two crowns on the watch - tapping the top one brings up the app list, while the lower one is used to jump backwards through menus, or bring up the workout list. The watch is 5ATM waterproof, and it has a swimming mode, making it usable in pools, but we weren’t informed as to its IP rating.",
    "Design is largely subjective, but we’d say the smartwatch has the same sleekly minimal design that characterizes lots of low-cost Android-phone-companion wearables. If you’ve got a small wrist you might find the watch a bit too big for you, but otherwise it looks good.",
    "The Red Magic Watch’s 1.39-inch display is its best feature. It’s an AMOLED display, so it’s bright and colorful, a fact scrolling through the menus will testify to.",
    "Each tile of the user interface feels bold and decorative in an imaginative way: the weather app has a nice graphic on it, for example, while the music player has a distinctive color scheme with a warm red glow behind it. This might not seem like much, but it makes using the smartwatch a more interesting experience.",
    "You can choose from loads of different watch faces via the RedMagic Sports app, including a ‘Gallery’ option that lets you use a photo of your choice as the background.",
    "We did find the size of the screen a little encumbering at times, and we have fairly average-sized wrists - depending on the size of your wrist, you might find the watch too big as a result.",
    "The Red Magic Watch runs ZTE’s own software, which we don’t actually know the name for - but it’s not hugely different from the vast majority of smartwatch operating systems we see.",
    "We’ve already complimented the software’s appearance in the display section of this review, but in terms of layout, there’s nothing surprising. Swipe right from the main watch face and you get Apple-style activity rings, then a weather report, then sleep data, then heart rate, then music controls.",
    "Swipe up from the watch face to see a list of recent notifications (from your smartphone); swipe down for the settings menu. Notifications are pulled through for apps you authorize - you can’t respond on your wrist though, as with most smartwatches.",
    "Of the two crowns, the top one brings up the app menu, while the bottom one takes you to the workout list (more on that in the Fitness section below). The app list contains the likes of workout records, blood oxygen monitoring, breathing training, a compass, an alarm clock, a remote camera shutter for your phone and a few more similar apps. These are all standard fare for such a smartwatch.",
    "So the Red Magic Watch is your run-of-the-mill smartwatch in terms of the lifestyle features you’ll find on it, and the lack of an app store means you can’t expand the feature list.",
    "At least navigating the menus is a treat, as animations are smooth, the graphics look bold and the watch feels powerful enough to jump between apps easily. If we have one gripe, though, it’s that the screen-off time is incredibly short by default, though you can increase this up to 20 seconds if you want (though some might find that still too short).",
    "You’ll find yourself using the RedMagic Sports app for lots of watch-related tasks, as that’s the smartphone tie-in app you need to use alongside the watch which works on both Android and iOS. It’s not the most intuitive app ever made, and that’s made worse by myriad typos, spelling errors and curious syntax - it seems as though something went majorly wrong regarding the language localization, an issue we’ve had with previous ZTE devices too.",
    "The biggest problem we faced with the Red Magic Watch during everyday use wasn’t app errors or spelling mistakes, but the fact it crashed part-way through our testing process, wiping all our data on the device. We had to re-set-up the device as new after that, though luckily lots of the data was saved on the app. We can’t tell if this was an error with our review unit, or a bigger problem with the watch, but it’s something to know about.",
    "Well, let’s get into it - the Red Magic Watch could be a flawless five-out-of-five masterpiece in all other aspects, but with fitness results like the ones we got, it’s impossible to give the device a higher mark. The numerous fitness issues we encountered make it impossible to recommend the gadget for fitness fans.",
    "On paper, the Red Magic Watch has a roughly similar fitness set to competing devices, with 16 fitness tracking modes including indoor and outdoor running, spinning, swimming, basketball and soccer. It has built-in GPS, as well as heart rate and blood oxygen monitors.",
    "The soccer mode has a much-touted feature that lets you see a heat-map of your positioning through the match, so if you’re attacking too much, or loitering out of the way, you can tell. We didn’t test this mode, but our experiences with the GPS side of the watch (as we’ll detail) lead us to doubt it works right.",
    "As well as these specific modes, the smartwatch tracks your steps, calories burnt, and active hours through the day, as well as your sleeping habits through the night. The latter works fine, though is pretty basic - you can see a time breakdown of what sleep stage you were in at different times.",
    "We’ve teased the watch’s big flaws, now it’s time to deliver. We tested the Red Magic Watch many times in its outdoor running and outdoor walking modes, but when we viewed the workout data in the app, the GPS data was wrong. We’re not talking ‘that line is curiously wavy’ wrong, but ‘that line is miles away from where we actually were’ wrong.",
    "For every tracked workout, the map showed a route that was roughly 10 miles to the east of where we actually traveled - the charted route was in the correct shape, just the wrong place. This was pretty hilarious at first - apparently we’re skilled at running straight through the river Thames - but it effectively nullified the results of each run.",
    "Well, sometimes the route was the right shape, but not always. Sometimes the app told us we’d traveled 7km, but the map showed an actual distance of about 7 steps. Sometimes the line was dramatically wavy and zig-zagged when we’d run in a straight line. Sometimes location data just didn’t record at all.",
    "Even the recorded distances were iffy. On one occasion the watch gave us a distance that was roughly - roughly - in the ballpark we were expecting, but often it was significantly under the number it should be",
    "If the broken GPS tracking wasn’t enough, the app seems spitefully reluctant to impart the other fitness metrics on you at all. You can see all the data on the watch itself, but head over to your smartphone and you can only see steps, workout duration, calories burnt and average heart rate - you can see distance too, but only in the overall workout history list, and not in the individual listing for each workout.",
    "Plus, for some reason, this distance is shown in meters, not in the easily-understandable kilometers used in the watch. This discrepancy is baffling, and annoying, though it doesn’t technically change the watch user experience much.",
    "Want to see in the app how long you worked out for, your pace or cadence, or average speed? Sorry, you’re out of luck.",
    "Perhaps the most damning indictment against the Red Magic Watch is how keen we were to stop using it in favor of a better fitness tracker - the workout data was so flawed, and confusingly presented, that using the device was an unpleasant experience.",
    "The Red Magic website states the smartwatch has a 15-day battery life, or 50 hours of fitness tracking with GPS - in our experience, which includes several weekly GPS runs, we’d say 12 days is a fair estimate at its battery life.",
    "That’s fair for a smartwatch, as your Apple Watch or Wear OS device will only give you a day or two of use, but for a ‘low-cost Chinese smartwatch made by a phone company’ type device, it’s roughly average.",
    "Some smartwatches in this category go even longer, like the Honor Watch GS Pro which lasts a month, but those kinds of wearables are few and far between - generally, 12 days is about average.",
    "Charging is done via a proprietary dock that plugs into a USB port. While it’s a magnetic dock, the magnets don’t seem very strong, and a few times when we tried to power it, we unknowingly put it in the dock the wrong way, so it didn’t charge.",
    "First reviewed July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "Red Magic Watch price and availability",
    "16": "Design",
    "22": "Display",
    "26": "Performance and software",
    "34": "Fitness",
    "46": "Battery life",
    "50": "Don't buy it if..."
  },
  "links": {
    "Xiaomi Mi Watch": "https://www.techradar.com/reviews/xiaomi-mi-watch-review",
    "Realme Watch": "https://www.techradar.com/reviews/realme-watch",
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "Oppo Watch": "https://www.techradar.com/reviews/oppo-watch-review",
    "Red Magic website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7949020372788918000&xs=1&url=https%3A%2F%2Fna.redmagic.gg%2Fproducts%2Fredmagic-watch&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fred-magic-watch-review",
    "Honor Watch GS Pro": "https://www.techradar.com/reviews/honor-watch-gs-pro-review"
  }
}