{
  "source": "https://www.techradar.com/reviews/bowers-and-wilkins-pi7",
  "title": "Bowers & Wilkins PI7 review",
  "category": "audio-visual",
  "updated": "2021-05-07T15:23:23.512Z",
  "author": "simon-lucas",
  "summary": "Can any pair of true wireless earbuds be worth $399 / £349 / AU$599?",
  "verdict": "The fact that the Bowers & Wilkins PI7, with their sky-high price-tag, a control app that’s more style than substance, an incomplete suite of touch controls, and humdrum active noise-cancelling and battery life, must sound incredible to come this close to a five-star review. That’s because they offer a truly enjoyable listening experience, and with a charging case that doubles as an audio retransmitter, they’re a genuinely unique pair of wireless earbuds.",
  "pros": [
    "Thoroughly engaging and convincing sound",
    "Clever charging case",
    "Premium look and feel"
  ],
  "cons": [
    "Treble response doesn’t need much provocation",
    "Unblinkingly expensive",
    "Noise cancellation and battery life is nothing special"
  ],
  "article": [
    "Bowers & Wilkins has taken its sweet time to launch a pair of noise-cancelling true wireless earbuds – but the PI7 have been well worth the wait.",
    "Yes, they’re startlingly expensive and no, they’re hardly the last word in physical or operational ergonomics. But they’re a brilliantly enjoyable listen, with a stack of sonic talents as long as your arm. And with a charging case that’s capable of acting as an audio retransmitter, they have a genuinely unique selling point.",
    "Ultimately it depends on what your priorities are. If you want a fully featured control app, or active noise cancellation that can fully shut out your environment, or class-leading battery life, look elsewhere and save yourself quite a bit of cash at the same time.",
    "But if you want the best-sounding true wireless in-ear headphones money (and plenty of it) can buy, well, here they are.",
    "The Bowers & Wilkins PI7 active noise cancelling true wireless earbuds are on sale now, and they cost a not-inconsiderable $399 / £349 / AU$599.",
    "No matter the nation in which you find yourself settling the bill, though, there’s no denying Bowers & Wilkins has priced the PI7 well in excess of some extremely well-regarded alternatives.",
    "We’ve listened to and thoroughly enjoyed wireless earbuds from companies as diverse as Bose, Grado, Sennheiser, and Sony in the last twelve months or so, and not one of them has cost anything like the PI7.",
    "It follows that these Bowers & Wilkins contenders are going to have to hit the bull’s-eye in every single respect if they’re going to get anywhere near making a case for themselves.",
    "First off, Bowers & Wilkins is to be congratulated for making what is a pretty bulky earbud look smaller and more manageable than it actually is. The gold accents to complement the white or charcoal finish of the buds help in this regard, but there’s no two ways about it: if you’re blessed with especially small ears, it’s going to be tricky to get the PI7 positioned comfortably. Or, in extremis, positioned at all.",
    "Let’s presume your lugholes are of suitable size, though. Despite the 8g per earbud weight, the PI7 remain secure and comfortable for a good while – certainly long enough to exhaust their four-hour battery life. The charging case – about which there will be more later – holds a further four full charges, which gives a respectable but by no means astounding 20 hours of all-in battery life before the PI7 need recharging.",
    "This can be accomplished either using the USB-C input on the bottom of the charging case, or wirelessly using any Qi-certified charging pad. 15 minutes on the juice should be sufficient for two hours of play time.",
    "As you might expect (or, in light of the asking price, demand), Bowers & Wilkins has gone to town on the specifications. Each earbud features a dual-driver arrangement, with a balanced armature taking care of high-frequency reproduction, while everything below is handled by a 9.2mm dynamic driver. Each has its own individual amplifier.",
    "There are a total of six mics arrayed across the pair of earbuds. They’re charged with handling calls, communication with voice assistants (the PI7 can be used with Siri or Google Assistant), and assessing ambient conditions for the adaptive active noise-cancellation circuitry.",
    "Wireless connectivity from your source player is via Bluetooth 5 with aptX Adaptive capability – so smooth synchronization between audio and video content is assured, and connection reliability is constantly optimized. The connection between the earbuds themselves runs at 24bit / 48kHz resolution, so hi-res audio fanciers are catered to.",
    "As well as voice control, there is a capacitive touch surface on each earbud, from where it’s possible to deal with (some of) the most obvious functions: ‘play / pause’, ‘skip forwards / backwards’, ‘answer / end / reject call’, ‘summon voice assistant’ and ‘noise-cancelling on / off / auto’. ‘Auto’ in this instance means the PI7 monitor your surroundings and adjust the level of noise cancellation they deliver accordingly.",
    "Or there’s always the option of the Bowers & Wilkins Headphones control app – although in truth it’s far from the most useful. It’s good where software updates are concerned, it allows you to switch the ‘wear sensor’ on or off (so the earbuds will pause playback when you take them out of your ears), and it duplicates the ‘noise-cancellation on/off/auto’ function.",
    "It’s also the only way you can switch ‘ambient pass-through’ (which allows a degree of external sound in) on or off, or adjust the level of ‘ambient pass-through’ transparency you’d like. There are also some very pretty, but pretty pointless, ‘soundscapes’ to listen to as well.",
    "What there isn’t, though, is any facility to adjust volume. And given that the touch-controls don’t include this either, the only way to control volume levels is to ask a voice-assistant to take care of it, or to fish your player out of your pocket or bag. As omissions go, it’s a big one – certainly bigger than the lack of EQ adjustment.",
    "Although in a way, Bowers & Wilkins has made up for this dereliction with the remarkable ‘retransmission’ ability of the PI7 charging case. Included in the box (along with a selection of differently sized eartips) are USB-C to USB-C and 3.5mm to USB-C cables. Connect either one to the charging case (at one end) and, say, a laptop computer (at the other) and the case will stream audio information, at aptX Low Latency standard, to the earbuds.",
    "It’s a remarkable facility, bringing wireless connectivity to all kinds of previously unavailable sources: an in-flight entertainment system, for instance, or some games consoles. Or the MacBook Air we’re using right now, which is easily one of the flakiest sources of wireless audio we’ve ever encountered.",
    "Along with the earbuds’ Bluetooth repeater functionality (which means they can share sound with a second Bluetooth device), it makes the PI7 a pretty compelling proposition before they’ve even made a sound.",
    "Sound, though, is where a pair of true wireless earbuds really lives or dies – even pairs that don’t cost an arm and a leg. Happily, the PI7 are an almost flawlessly accomplished product in this respect, and come very close indeed to justifying their asking price.",
    "Once through a 24bit / 192kHz hi-res Qobuz stream of Neil Young’s Cinnamon Girl makes it absolutely plain: they don’t scrimp on the details, they don’t crowd a soundstage, and they’re vauntingly dynamic. The PI7 are a more complete and unambiguous listen than most true wireless earbuds we’ve tested.",
    "Low frequency sounds are deep, lavishly textured, utterly disciplined where attack and decay is concerned, and preserve all the latent momentum in a recording. They don’t crowd the midrange, but neither are they estranged from it – they simply occupy their own area of the frequency range with absolute discipline, underpinning the recording, and driving it forward with low-key insistence at the same time.",
    "The midrange itself is communicative to an almost indecent degree. The finest details of Young’s vocal technique are laid bare, and the immediacy and eloquence of the delivery is served up without equivocation. There’s plenty of space around the voice but, just as with the lower frequencies, it’s integrated into the overall presentation seamlessly. Positionally, too, the PI7 are deft – the backing singer is locked in position, a few steps back and a few steps to the left of the lead vocal.",
    "Everything else in the midrange is resolved expertly, too – there’s real bite and crunch to the guitar sounds, and the suggestion of microphonic feedback is also made explicit. There’s just no ambiguity to the Bowers & Wilkins sound – the idea that you’re being short-changed or somehow aren’t in receipt of the entire picture never occurs.",
    "Broad-strokes dynamic headroom is considerable, while the second-stage harmonic dynamics of the variations in strums or hits are made plain too. The timing of the sound is excellent, the separation of information is distinct even as the unity of the performance is made plain.",
    "The nearest the PI7 get to sounding anything less than utterly confident and assured is at the top of the frequency range. Switch to a recording that’s on the sharp or splashy side where treble sounds are concerned – A Pair of Brown Eyes by The Pogues or Aphex Twin’s Ageispolis – and the PI7 can overplay their balanced armature hand just a little.",
    "Treble control is unarguable, certainly, but tonally it can err just slightly on the airy, thin side – so an airy, thin recording will compound this trait, and it can be worsened further by increasing the volume. It’s not a fatal flaw by any stretch of the imagination, but it’s just about the only area of the Bowers & Wilkins sound that deserves an unflattering mention.",
    "The active noise-cancelling is a slightly qualified success, too. Without doubt it’s sufficient to downplay the drone of public transport, but it’s not able to deliver the uncanny blanket of silence that models like the Bose QuietComfort Earbuds are capable of. Call quality is excellent, though, and the integrated mics are sharp-eared enough to make your interactions with your favorite voice assistant quick and effective.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Bowers & Wilkins PI7 price and availability",
    "8": "Design",
    "21": "Audio performance",
    "30": "Don't buy them if..."
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds"
  }
}