{
  "source": "https://www.techradar.com/reviews/huawei-vision-s",
  "title": "Huawei Vision S review",
  "category": "televisions",
  "updated": "2021-06-24T09:21:59Z",
  "author": "simon-lucas",
  "summary": "Is the Huawei Vision S even a television?",
  "verdict": "If the UK’s version of the Vision S is the same as this one, and it costs as much as Huawei thinks it will, then it makes for an intriguing first attempt at (not quite) a television.",
  "pros": [
    "Some real 4K picture quality strengths",
    "Good OS",
    "Interesting extended functionality"
  ],
  "cons": [
    "No TV tuners",
    "Struggles to control on-screen motion",
    "Quite bulky"
  ],
  "article": [
    "What to say about the Huawei Vision S? Huawei has wanted to launch a 4K TV in the UK for a while now, and while the Vision S is yet to land on British shores – at some point – this version from Malaysia we've reviewed is set to be the same offering in every meaningful way.",
    "A lack of TV tuners (which will be the case with the UK-specific model too) means the Vision S is not, in any literal sense, a television at all. But it’s otherwise specified like one, looks like one and performs like one too.",
    "And in some ways, it outperforms its expected price. On-screen contrasts and detail levels are quite impressive, and the speakers don’t sound as rough as any number of ‘affordable’ big screens do. It’s got a very decent operating system – all the more notable given it’s a) bespoke and b) Huawei’s first effort – with some quite thoughtful functionality. It has terrible trouble getting a grip of on-screen motion, though, and visually it’s a throwback to the very early days of flatscreen TV.",
    "We’re not for a moment suggesting that Huawei isn’t serious about making inroads into the TV market, though. If anything, the Vision S has only made us more interested in what the company will do next.",
    "First things first: the Vision S is coming to the UK, but the model we tested here was technically a Malaysian model, ahead of a UK release. Still, the company is confident the 65-inch version (there is also likely to be a 55-inch variant) will cost in the region of £550 – and if it makes good on that desire, then the Vision S will be one of the most affordable screens of its size on the market.",
    "It follows that, with the best will in the world, we haven’t a clue what the Vision S is going to cost in other markets. In fact, we’re not entirely sure which markets will be getting it and which won’t. Once we know more, of course, we’ll be updating this information.",
    "Viewed head-on, the Vision S is a tidy, if unremarkable screen with nice narrow bezels and some very discreet branding across the bottom. At a touch over 7cm deep, though, it’s not the flattest flatscreen ever made (so wall-hanging won’t be the most decorative design statement), and it’s blade-like feet are quite far apart (so any surface it stands on will need to be pretty wide).",
    "Build quality is perfectly acceptable – in fact, if Huawei makes good on that promise of a £550 asking price, it’ll be among the most robust screens at this sort of money. The plastics from which it’s mostly constructed feel good and are creak-free.",
    "As far as the feature-set goes, there’s one big headline: this is not, in absolute terms, a television. It has no TV tuners, so it is, in fact, simply a colossal monitor. And that’s not a quirk of the Malaysian market – when the Vision S eventually makes it to the UK it will be tuner-less too.",
    "Of course, in many ways that’s neither here nor there. The way everyone consumes video content has changed fundamentally in the last 10 years or so, and given the Huawei has three HDMI 2.0 inputs, a USB 2.0 input, an Ethernet socket (along with Wi-fi, naturally), a 3.5mm analogue ‘AV’ input and a digital coaxial input, it should be easy enough to gain access to the content you’re interested in.",
    "Bluetooth connectivity is available too. And by the time the Huawei Vision S gets to the UK, it will apparently be tricked out with apps for iPlayer, Netflix and all the rest - so whether or not it’s actually, technically speaking, a TV shouldn’t really matter. You’ll still need a TV licence, mind you.",
    "Besides, there are a few television-esque elements to the Huawei Vision S’ specification – it’s just that they’re not all that impressive. This is a 4K 120Hz LCD screen that’s backlit by LEDs arranged around its edge, and it has support for HLG and HDR10 HDR standards – but it stops short of supporting any dynamic metadata equivalents.",
    "As far as sound goes, the Vision S is fitted with four horn-loaded drivers (two handling the full frequency range, and two high-frequency tweeters) powered by 10 watts each. Huawei has made the most of the notable depth of the Vision S chassis by creating a sound cavity of over a litre, which is a fair bit more than most actual televisions can manage.",
    "Getting to grips with the Vision S happens mostly using the remote control. It’s small and shapely, with just enough buttons – which makes it one of the better handsets to be provided with an affordable screen. There’s a ‘mic’ button on there – the Huawei turns out to be responsive and reliable when answering voice commands – and there’s an NFC patch too. This lets Huawei phones send their content to the Vision S without them having to be on a common network.",
    "Huawei is proud of its Harmony operating system – and as far as the Malaysian version goes it’s slick and straightforward. We’d imagine the UK version will be a little more extensive, but hopefully it won’t lose any of the logical, clean layouts of the version we’ve seen.",
    "Set-up is straightforward, if for no other reason than there aren’t that many options. The picture presets, for instance, fuss around the edge of image quality without making any kind of decisive difference – adjust brightness or contrast all you like, but the difference you’ll make will be minimal. The same is true of the sound EQs too: there are six of them, and they are all close variations on a theme.",
    "The Vision S is supplied with a little 13MP camera – it snaps into place in a little magnetic area at the top of the rear of the screen. Huawei smartphone owners (and anyone running Android 8.0 or more) can download the ‘MeeTime’ app and make video calls to other ‘MeeTime’ users, and cast them to the screen. Safe to say video calls at 1920 x 1080 on a 65-inch screen are a bit more impactful than Zoom calls on a laptop.",
    "So with no tuners and UK-centric catch-up or on-demand apps on board, testing the Huawei’s picture quality relies on a 4K Blu-ray player (luckily one with apps like iPlayer at Netflix on board) and a games console.",
    "With a 4K disc of Christopher Nolan’s Tenet playing, the Huawei looks undeniably good. The colour balance is convincing and, despite a lowly peak brightness of under 350 nits, contrasts are good too – this is thanks to how clean and detailed both white and black tones are. Backlight control is fairly strong too, with haloing only really evident in the most testing circumstances. There’s enough overall detail to keep skin-tones convincing, and the Huawei manages to control even quite tricky patterns without too many alarms.",
    "Motion-control, though, is a different story. Slow pans and rapid motion alike will struggle here – and at its most panicky, the Vision S can smear and double images in a pretty major way.",
    "It’s a similar issue when it comes to upscaling too. Using the disc-player’s Netflix app to stream a Full HD version of Yesterday on the Vision S’ 4K screen, we found that motion struggled even as detail and colour fidelity were aptly maintained. Edges are a little less well-defined and the overall picture is a little softer too, of course, but that’s really only to be expected.",
    "As with picture performance, the Vision S is a little better than the (probable) price might lead you to believe, without actually being all that good. It’s an altogether burlier listen than many alternatives, and throws its sound wide enough to escape the confines of the screen itself. It’s got quite decent midrange clarity, too, and will tolerate quite high volumes without losing too much composure. (It’s still not as good as a nice affordable soundbar, mind you.)",
    "Can't wait for the Huawei Vision S to release? Check out these affordable Hisense TVs:"
  ],
  "headers": {
    "0": "One minute review",
    "4": "Price and availability",
    "6": "Design",
    "13": "Smart TV (Harmony OS)",
    "17": "Picture quality",
    "21": "Audio performance",
    "22": "Don't buy it if..."
  },
  "links": {
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304"
  }
}