{
  "source": "https://www.techradar.com/reviews/vizio-v-series-51-sound-bar-v51x-j6",
  "title": "Vizio V-Series 5.1 Sound Bar (V51X-J6) review",
  "category": "audio-visual",
  "updated": "2021-07-14T14:09:59.893Z",
  "author": "nick-pino",
  "summary": "A basic 5.1 soundbar system that offers a solid value",
  "verdict": "As an upgrade to your basic TV speakers, the Vizio V-Series 5.1 Sound Bar has a lot to offer – well, specifically four things that include the ‘bar, the wireless subwoofer and two satellite speakers. It lacks the immersive presentation and feature set of higher-end soundbars, but at this price you’re getting a full 5.1 system for a pittance.",
  "pros": [
    "Comes with sub and rear speakers",
    "Incredibly slim design",
    "Incredible value"
  ],
  "cons": [
    "Weak surround units",
    "Flat soundstage",
    "Slight delay in audio after resuming"
  ],
  "article": [
    "For a budget soundbar, the Vizio V-Series 5.1 Sound Bar (V51X-J6) delivers a lot of value for the money. To wit, you’re getting a slim soundbar, two satellite speakers and a wireless subwoofer for around the same cost as a 2.1 soundbar from other big-name manufacturers.",
    "If this is the first time you’re upgrading your home setup, the V-Series will blow you away with its mid-focused presentation that accentuates dialogue and a subwoofer that can thump (at least periodically). You’ll also get an audio jack specifically designed for an Amazon Echo Dot or Google Nest Hub Mini to turn a ‘dumb’ soundbar into a super-powered smart speaker.",
    "On the flip side, the surround units aren’t the most powerful in the world and certainly can’t replicate the immersiveness or power of a Dolby Atmos setup with upfiring speakers. The flat soundstage doesn’t help with the immersiveness either, and you might experience a delay in audio when unpausing a TV show or film. These issues are annoyances, definitely, but don’t feel like deal-breakers given the price.",
    "Overall, if you’re in need of a cheap upgrade for your TV speakers and can’t drop a ton of money on it, the Vizio V-Series 5.1 Sound Bar delivers a rock-solid experience at a price that doesn’t feel outlandish.",
    "The Vizio V-Series 5.1 Sound Bar (V51X-J6) is part of Vizio’s 2021-2022 AV lineup that also includes the new V-Series, M-Series and P-Series TVs as well. In terms of price, you’re looking at $198 at retailers like Walmart at launch, and likely much less once we get to the big shopping holidays like Black Friday and Cyber Monday.",
    "At that price point, there are very few full 5.1 soundbars with discrete surround speakers and a wireless subwoofer. In fact, for that price usually the best you find is a ‘bar and a sub that may – or may not – be wireless. That said, some of the other 3.1 ‘bars out there have some neat tricks up their sleeves like faux-Dolby Atmos sound or Hi-Res Audio upscaling, but expect to pay a premium for those features.",
    "One thing we think everyone will appreciate about the Vizio V-Series 5.1 Sound Bar is its slim size – it can easily fit under most TVs without blocking the IR sensor. That’s especially handy if you connect the bar via HDMI to the TV’s ARC HDMI port that will allow you to use the TV’s remote control to control the soundbar’s volume.",
    "In terms of connections, the V-Series 5.1 Sound Bar has all the basics covered: there’s an optical audio in and the aforementioned HDMI port to bring audio to the soundbar, plus two separate 3.5mm jacks – one for phones and tablets, and the other specifically for voice assistant smart speakers like the Amazon Echo or Google Nest Hub.",
    "Also inside the box are a wireless subwoofer and two satellite speakers. Now, admittedly, neither of these will blow you away in power (more on that below) but their inclusion at this price point is what makes the V-Series 5.1 a pretty good value. In terms of design, the sub doesn’t need to be connected to the main bar, but you will need to run the included cables from the back of the sub to the two satellites. That might mean a slightly messier setup than you would like, but it doesn’t get much easier than this for an instant 5.1 system.",
    "Last but not least, you’ll also get a remote inside the box as well. The remote is plastic and fairly cheap, but it does allow you to tweak the EQ of the bar on the fly.",
    "So how does it sound? Well, that depends on what you’re used to. If you’re coming from your TV’s built-in speakers, you’re going to be blown away by the Vizio V-Series 5.1 Sound Bar. It amps up the mid-range to make dialogue very easy to hear and even throws in a few floor-shaking thumps every once in a while as well.",
    "The counterpoint, however, is that if you’re used to having a high-end sound system, the Vizio 5.1 Sound Bar is going to sound a bit flat in comparison. The surround units especially don’t do much for 5.1 mixes and typically only put out a fraction of the sound of the main ‘bar, and the sub really only kicks in a few scenes.",
    "It’s worth keeping in mind, also, that 5.1 is no longer the pinnacle of sound quality – that title belongs to spatial audio formats like Dolby Atmos. While 5.1 can give you a plane of sound, Dolby Atmos immerses you in a sound field with top-firing speakers that provide a height channel to the mix. Those bars are more expensive than what Vizio is offering here, obviously, but they’re worth investigating if you feel like you might be interested in having a larger sphere of sound.",
    "To its credit, however, the Vizio V-Series does support DTS Virtual:X that attempts to give you some semblance of spatial audio without upfiring speakers. The results aren't all that convincing, though.",
    "The good news to all of this is that you can do some tweaking of the sound through the remote. There’s only so much you can do with satellite speakers and a subwoofer of that size, but it’s nice having the option to turn them up or tweak them how you like and you can turn off the DTS Virtual:X if you find it distracting.",
    "Our final criticism of the bar is that we experienced a slight delay in the audio when unpausing a show or movie. That latency could be caused by the TV we were using (a TCL 5-Series 50S535) decoding the audio and sending the signal to the soundbar over ARC but it seems likely that you’ll experience this as well at some point."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Price and release date",
    "6": "Design",
    "10": "Performance",
    "16": "Don’t buy it if…"
  },
  "links": {
    "Amazon Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Google Nest Hub Mini": "https://www.techradar.com/reviews/google-nest-mini",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "TCL 5-Series 50S535": "https://www.techradar.com/reviews/tcl-5-series-2020-qled-tv"
  }
}