{
  "source": "https://www.techradar.com/reviews/twilio-voice",
  "title": "Twilio Voice review",
  "category": "computing",
  "updated": "2021-03-10T11:53:23Z",
  "author": "darcy-french",
  "summary": "Requires tech expertise to deploy, but hugely customizable",
  "verdict": "A powerful software platform and VoIP product for companies requiring an advanced communications framework and a high degree of customizability.",
  "pros": [
    "Basic drag-and-drop functionalities",
    "Transparent pricing model"
  ],
  "cons": [
    "Requires coding experience",
    "Limited free support"
  ],
  "article": [
    "Twilio Voice is a promising software platform enabling businesses to design powerful application programming interfaces (APIs) that leverage Voice over Internet Protocol (VoIP) technology to create top-quality business phone systems.",
    "Twilio Voice can be built into both new and existing communications systems and perfectly balances powerful backend customizability with useful tools to create intuitive APIs and positive user experiences.",
    "A well-deployed Twilio Voice makes it easy for employees to work from home and for IT employees to embed VoIP into any website or application. We think it’s a promising and exciting platform that can challenge the best VoIP service providers.",
    "Twilio makes it easy to find detailed pricing information on their website, which we really appreciate.",
    "In today’s ecommerce world, too many websites still force you to ring their sales team for a “personalized” quote, making it time-consuming and overwhelming to compare different providers. That’s why we like providers who make their pricing model accessible.",
    "Fortunately, Twilio Voice is not only transparent but also highly affordable. Customers can choose to pay-as-you-go, starting at $0.004 per minute, with discounts offered when volume milestones are reached. However, customers can also receive committed-use discounts if they pay for a minimum volume in advance. Unfortunately, this is something you will need to contact the Twilio Sales team to discuss.",
    "Twilio boasts a truly impressive list of features, many more than we have the space to explore in this article. So what we will do is explore just a few of our favorite Twilio Voice features, but we encourage you to check out the website if you want to learn more.",
    "Voice Insights goes well beyond merely tracking call duration and provides your team with sophisticated and data-driven insights into call performance. It is an innovative data analysis tool we haven't seen in many other VoIP providers. Several categories are combined to give you a complete picture of each call and help identify where weaknesses exist.",
    "This enables you to detect small inefficiencies before they become big headaches and helps ensure your customers' experience is continually improving.",
    "Automatic Speech Recognition (ASR) can be deployed in your Twilio Voice API to create transcripts from conversations in real time across more than 100 languages. There is also no training required, with the software able to transcribe a wide range of industry-specific words straight out of the box.",
    "Another AI tool relating to speech is Twilio Autopilot. It guides customers and clients to the right person by combining natural language understanding with machine learning to determine a user’s intent. This leads to better outcomes, because when a customer is interacting with your communications system, how something is said is often more important than just the words themselves.",
    "While not particularly glamorous, any VoIP provider review must explore the core features that power a business communications system. One of these is the ability to configure audio recordings. When a customer calls your business, you want to make sure that they receive useful information even before speaking with an employee.",
    "Fortunately, Twilio makes it easy to build audio recordings into your Voice API with ease. There are several options for designers, and the Twilio Help Center provides comprehensive instructions to help deploy this feature.",
    "When deployed correctly, Twilio Voice makes it easy for your company to design engaging UXs and to maintain a seamless and advanced communications system from anywhere in the world to anywhere in the world.",
    "Regarding the actual Twilio interface, it’s important to know that Twilio Voice is mostly designed for companies with in-house web and app development experience. It won't be easy to make the most of the platform’s powerful features if you don’t have someone with coding knowledge to deploy the software within your company’s existing frameworks.",
    "However, the Twilio Studio enables a limited drag-and-drop experience for those with limited design skills. It is not suitable for the initial deployment of an API, but is useful in allowing employees to adjust how they interact with the backend software.",
    "Twilio’s help center is top-notch, with an almost overwhelming number of support articles and how-to guides in English and many other languages.",
    "If you need more personalized support, all customers can contact Twilio support by email free of charge. Unfortunately, for 24/7 phone and email support as well as several other perks, customers need to sign up for a premium support plan.",
    "There are three premium support plans called Production, Business, and Personalized. These respectively cost 4%, 6%, and 8% of your monthly spend, or a minimum per month of $250 (Production), $1500 (Business), or $5000 (Personalized).",
    "The primary mechanism through which Twilio protects the security of its users is through Twilio Proxy. This enables users (whether customer, client, or employee) to have private conversations through the internet, confident that their conversation is accessible only to them.",
    "Account security, for employees as well as customers and clients, is also protected through two-factor authentication. 2FA requires users to provide a password and a code sent to a trusted device before accessing the Twilio Voice interface. This prevents anyone from accessing your account unless they have both your password and access to this trusted device.",
    "Twilio Verify also prevents fake accounts and fraud from engaging with your business by tying all new account creations to real phone numbers.",
    "Twilio has established itself in a niche part of the VoIP market. Compared to a leading provider such as RingCentral Office, Twilio is more agile and customizable, although it requires more time and effort to deploy. It is a great choice for medium and large-sized organizations that have the resource to deploy a customized system.",
    "However, this flexibility puts Twilio at a disadvantage compared to providers such as Spitfire, which provides organization-level VoIP services that require less initial setup and development experience. We think Spitfire’s services may be more suited to small organizations that want an “out-of-the-box” solution.",
    "We think medium and large companies wanting a top-quality communications system would benefit immensely from a Twilio Voice and VoIP package. The packages are exceptionally customizable and highly affordable.",
    "However, we think the work required to deploy a Twilio Voice API properly may be prohibitive for small companies requiring a less complicated and more straightforward communications system.",
    "Overall, it’s not the best VoIP provider, but is undoubtedly an interesting choice worth considering."
  ],
  "headers": {
    "3": "Twilio Voice: Plans and pricing",
    "6": "Twilio Voice: Features",
    "13": "Twilio Voice: Interface and in use",
    "16": "Twilio Voice: Support",
    "19": "Twilio Voice: Security",
    "22": "The competition",
    "24": "Final verdict"
  },
  "links": {
    "Twilio Voice": "https://www.twilio.com/voice",
    "business phone systems": "https://www.techradar.com/best/best-business-phone-system",
    "best VoIP service": "https://www.techradar.com/news/best-voip-service",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "RingCentral Office": "https://www.techradar.com/reviews/ringcentral-office",
    "Spitfire": "https://www.techradar.com/reviews/spitfire"
  }
}