{
  "source": "https://www.techradar.com/reviews/seagate-xbox-storage-expansion-card-review",
  "title": "Seagate Xbox Storage Expansion Card review",
  "category": "gaming",
  "updated": "2021-06-24T15:57:02Z",
  "author": "gerald-lynch",
  "summary": "A must-have for Game Pass-loving Xbox Series X or Series S gamers",
  "verdict": "It isn’t cheap, but the Seagate Xbox Storage Expansion Card is a must-buy item for Xbox Series X and S owners looking to make the most of their Xbox Game Pass subscriptions.",
  "pros": [
    "Super simple set up",
    "Excellent loading and transfer speeds",
    "Respectable storage amount"
  ],
  "cons": [
    "Incredibly expensive",
    "Not quite as fast as internal SSD"
  ],
  "article": [
    "Video games are getting bigger and bigger – not just in the size of their in-game worlds, but the file sizes they come in too. It’s not unusual for games to weigh in at more than 100GB these days, and the latest Xbox Series X and Xbox Series S consoles come with only 1TB and 512GB of built-in storage space respectively.",
    "The Seagate Storage Expansion Card looks to alleviate the pressure on that over-burdened built in storage A simple plug-and-play memory card, it slots into the back of the new Xbox consoles, and… that’s it – an instant extra lump of storage is seamlessly added to your console, no set up required.",
    "Making use of the new Xbox Velocity Architecture storage system, the card is able to hit incredibly fast transfer and load speeds. It’s not quite as speedy at the built-in storage, but as much as forty times faster than a conventional drive, according to Microsoft’s calculations. Note as well that a Velocity Architecture storage system is required in order to play Xbox Series X / S enhanced games.",
    "The big drawback? The cost – it’s prohibitively expensive, almost the price of an Xbox Series S console itself. And Seagate kind of has us over a barrel at the moment – there’s no alternative to its card if you want extra space for your console, barring the laborious process of moving games back and forth between a conventional hard drive and the internal storage.",
    "But the simplicity of the system can’t be knocked. It’s expensive, but not hugely more so than equivalent PC SSD sticks – and looks a damn sight easier to install than what Sony apparently has planned for the PS5. The Seagate Xbox Storage Expansion Card comes highly recommended.",
    "Available now, the Seagate Xbox Storage Expansion Card has a retail price of $219.99 / £219.99. So far, that seems to be a pretty unwavering price point, with discounts remaining quite rare.",
    "It’s expensive, no doubt about it – but so is cutting-edge SSD technology as found in PCs, and somewhat trumped here. Considering the ease of installation and the performance of the card, it just about justifies the price – even if there’s a begrudging feeling that both the Xbox Series X and Series S should have had more built in storage to begin with.",
    "The Seagate Xbox Storage Expansion Card is a small gadget – smaller than a credit card, if a bit thicker at 2.1” x 1.25” x 0.3” inches. Featuring a proprietary connection to the back of the Xbox Series X and S consoles, it can only be used with Microsoft’s machines. Two thirds of the card is a metal alloy that slips snugly into the console’s port, while the rest is wrapped in a black plastic shell with the Xbox logo and a little grip notch attached. There’s also an included transparent plastic cap to put on the card, should you want to store it or travel with it.",
    "Setup couldn’t be simpler – take it out of the package, pop the cap off, and push it into the appropriate port on the back of the console. That’s it – your card is automatically formatted and prepared to work as additional Velocity Architecture SSD storage straight out of the box. You might need to push it in slightly more than you’d have expected though – I initially received a warning that the card was recognized, but that the connection to it from the Xbox was weak. Inserting it more firmly did the trick and everything from there on in worked as expected.",
    "What’s worth pointing out though is that, like almost every hard drive, the usable space on the expansion card is less than the advertised 1TB. Between onboard drivers and the discrepancy in how the console reads available space on the card, you’re actually left with 920GB to play with. Still, that’s more than the 802GB the Xbox Series X’s “1TB” hard drive provides, and huge compared to the 512GB the Xbox Series S is shipped with.",
    "So how many extra games can that 920GB let you install? That’ll vary on the type of game you’re playing of course. Call of Duty: Black Ops Cold War weighs in at a gigantic 190GB for instance, so you’d barely be able to get that installed on the card four times. But if we say that the average game download size hovers around the 30GB mark, you’d get an additional 30 games safely stored on the card. If you’re into smaller indie titles, expect that number to be much higher, while AAA open world game fans can expect it to be lower.",
    "As for speed, the Seagate Xbox Storage Expansion Card is incredibly fast, supporting all the same Quick Resume features and speedy loading times that the console’s internal drive supports. It’s not quite as fast (booting a save of Yakuza: Like a Dragon from the card from the home screen took 45 seconds from the card, and around 37 from internal storage), but it’s still much faster than previous console generation solutions offered. And, when it comes to loading times once in-game, the gap closes significantly so as to be almost imperceptible to anyone but those carrying a stopwatch around.",
    "Transfer speeds are solid too – it’s slightly speedier to send files to internal storage from the card as opposed to the other way around, but only by a fraction. But it’s a night and day difference between the Seagate card and an external HDD – the 24.6GB driving sim WRC 9, for instance, took 3 minutes 50 seconds to move from internal storage to a USB 3 HDD, compared to just 1 minute 6 seconds for the Seagate card.",
    "The Xbox Series X/S interface itself is very clear and easy to use when it comes to managing storage devices too. The settings section makes it obvious where each game is stored, and offers a simple transfer queue view to enable you to easily manage installation locations.",
    "It’s worth noting also that, should you be going to a friend’s house, you can just plug your card into the back of their Xbox Series X/S console and access all the games stored on it with little faff. You’ll either need to sign into your account on their console to play the games, or your friend will need to have a license for them too. But it’s a quick and easy way to transport a good chunk of your game library with you, without waiting around for a download at a pal’s place."
  ],
  "headers": {
    "0": "One minute review",
    "5": "Price and availability",
    "7": "Design and performance",
    "15": "Don’t buy it if…"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Velocity Architecture": "https://www.techradar.com/news/velocity-architecture-is-the-soul-of-xbox-series-x-heres-what-it-does",
    "equivalent PC SSD sticks": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "Sony apparently has planned for the PS5": "https://www.techradar.com/news/why-sonys-ps5-internal-storage-solution-has-me-concerned",
    "Call of Duty: Black Ops Cold War": "https://www.techradar.com/reviews/call-of-duty-black-ops-cold-war",
    "Yakuza: Like a Dragon": "https://www.techradar.com/news/yakuza-games-in-order-by-release-date-in-chronological-order-and-ranked"
  }
}