{
  "source": "https://www.techradar.com/reviews/philips-essential-airfryer-hd925291",
  "title": "Philips Essential Airfryer HD9252/91 review",
  "category": "appliances",
  "updated": "2021-04-30T07:44:26Z",
  "author": "carrie-ann-skinner",
  "summary": "Compact and great for fries",
  "verdict": "The Philips Essential Airfryer HD92552/91 is a compact kitchen appliance that does a good job of air-frying chicken and fries. It’s expensive but it can bake, roast, and reheat as well as air-fry. It’s simple to use and doesn’t take up as much countertop space as other air fryers on the market.",
  "pros": [
    "Excellent crisp results",
    "Compact",
    "Handy presets"
  ],
  "cons": [
    "Uses more oil than other air fryers",
    "Expensive",
    "Small capacity"
  ],
  "article": [
    "Philips has been manufacturing air fryers for more than a decade, and the Essential Airfryer HD9252/91 certainly benefits from the brand’s years of experience. Its all-black design and orange LED display may not be the most stylish, but it turns out evenly browned fries and chicken wings every time.",
    "Air fryers use hot air to crisp foods placed in the frying basket more quickly compared to traditional methods. The Philips HD9252/91 uses a starfish design on the bottom of the frying basket, which, according to Philips, ensures hot air circulates more easily. This means that, like all air fryers, it uses considerably less oil when crisping food – Philips claims you’ll require 90% less oil with its air fryer – and so offering a healthier way to enjoy foods that would usually be deep-fried, without compromising on the taste.",
    "More compact than most of the air fryers we’ve tested, the Philips Essential Airfryer HD9252/91 has a 5-quart / 4.8-liter capacity, which Philips says is sufficient for three servings. And, as well as air-frying, the appliance can also roast, bake and reheat.",
    "There are seven presets for everything from fries and frozen food to chicken and cake that offer default lengths and temperatures, although you can adjust these defaults as you see fit using the touch controls on the 6-inch / 15.4cm display.",
    "The Philips Essential Airfryer HD9252/91 is priced at $179.95 / £149.99 (around AU$270), and is available through Philip’s website in the UK, and at retailers such as Crate & Barrel in the US.",
    "This air fryer is Philips mid-range offering, with the more stylish Premium range of air fryers with a larger capacity costing as much as $449.95 / £300 / (around AU$530)",
    "The Philips Essential Airfryer HD9252/91 is a compact unit, measuring 14.17 x 10.39 x 11.61 inches / 36 x 26.4 x 29.5cm (d x w x h), although at 5-quart / 4.8 liter it offers a lesser capacity than many other air fryers on the market. However, like many of the best air fryers we’ve tested, it can roast, bake, and reheat as well as air fry, which makes it a versatile appliance.",
    "The design of the frying basket is similar to that we’ve seen with other air fryers including the Proscenic T21, where the basket sits in a plastic holder, and the two sections must be clipped together before being inserted into the air fryer.",
    "A button at the top of the basket’s handle lets you separate the holder and basket for easy serving. Both sections are dishwasher-safe, while the black plastic exterior can simply be wiped down with a damp cloth to remove any splashes or smudges.",
    "As we’ve already mentioned, alongside the ability to air-fry, the Philips Essential Airfryer HD9252/91 can bake, grill and roast. The LED display offers touch controls to adjust the temperature and time, and includes seven presets for cooking everything from fries and frozen foods to cake and chicken. A keep-warm function maintains the temperature of food for up to 30 minutes, with the air fryer able to cook for up to one hour at a time. It reaches a maximum temperature of 392F / 200C.",
    "The Essential Airfryer doesn’t come with a recipe booklet. Instead, you’ll need to download the NutriU app to your smartphone or tablet for inspiration, where you’ll discover a wide range of recipes alongside tips and tricks about what to cook in an air fryer. The paper instructions for the kitchen appliance are scant, with little available through the app – we’d have liked more detail.",
    "In our tests, the Philips Essential Airfryer HD9252/91 excelled at cooking fries. Using the time and temperature from the potato program on the air fryer, and following the preparation steps from the NutriU app – 1Tbsp of oil for a 1.1lb / 500g batch – the cooked fries presented crisp exteriors that offered a satisfying crunch, with fluffy, soft potato inside. Similarly, the chicken wings had crisp skin and remained succulent on the inside – although we did find that five wings was the maximum quantity the frying basket could hold, which may not be sufficient for two servings of this particular dish. In our experience, there wasn’t a need to tweak the time or temperature – the results were just right.",
    "It’s worth noting that you will need to use oil when cooking many foods in the Philips Essential Airfryer, even items such as chicken wings, which can be cooked in rival air fryers such as the Instant Vortex Plus without any oil. There’s no denying that the addition resulted in crunchy, crisp skin on the wings and a satisfying crunch to fries – and, while the design of the frying basket does mean that some fat drains away, it does slightly reduce the healthiness of the meal you’re cooking.",
    "We also cooked 1.1lb / 500g of frozen steak-cut fries in the air fryer, using the dedicated frozen food program. While the majority of the fries were cooked, the smaller capacity of the Philips Essential Airfryer meant those nestling in the center of the frying basket required more cooking. The level of browning, too, wasn’t even across the full quantity of fries.",
    "The Essential Airfryer does offer an audible and visual alert on the completion of cooking, but we were disappointed by the lack of a reminder to turn or shake the food part way through cooking (this ensures items are evenly browned). However, it proved the quietest air fryer we’ve tested to date, registering 52db on our meter, which is the equivalent to the gentle hum of a refrigerator. In addition, the exterior casing remained cool to the touch throughout cooking."
  ],
  "headers": {
    "4": "Philips Essential Airfryer HD9252/91 price and availability",
    "6": "Design",
    "11": "Performance",
    "15": "Don't buy it if..."
  },
  "links": {
    "best air fryers": "https://www.techradar.com/news/best-air-fryer",
    "Proscenic T21": "https://www.techradar.com/reviews/proscenic-t21-air-fryer-review",
    "Instant Vortex Plus": "https://www.techradar.com/reviews/instant-vortex-plus-air-fryer-review"
  }
}