{
  "source": "https://www.techradar.com/reviews/tcl-20-se",
  "title": "TCL 20 SE review",
  "category": "phones",
  "updated": "2021-05-05T14:48:45Z",
  "author": "jennifer-allen",
  "summary": "Cheap and cheerful-ish",
  "verdict": "The TCL 20 SE lacks speed in many ways from performance to charging, but it looks nice and it has a gorgeous display, so it's good enough if you're on a tight budget.",
  "pros": [
    "Great display for the price",
    "Looks good",
    "Decent speakers"
  ],
  "cons": [
    "Slow charging",
    "Mediocre camera",
    "Limited performance"
  ],
  "article": [
    "TCL isn't a big name in the smartphone market right now. You're much more likely to know it from its TVs or sound bars. It's slowly making moves into the mobile market though, with the TCL 20 SE forming the much more budget end of things alongside the relatively high-end TCL 20 Pro 5G.",
    "While that phone might be a decent enough option for the price, the TCL 20 SE is a little more underwhelming. It has a gorgeous 6.82-inch screen that stands out and makes you take note, but its slower Snapdragon 460 chipset and mediocre cameras mean you won't exactly be wowed.",
    "To be fair though, it's also a very cheap Android phone. Available for only £149 (around $210/AU$265) and already enjoying chunky discounts, the TCL 20 SE is certainly not going to break the bank, and if you're looking for a cheap phone to get you by, this isn't a bad option at all.",
    "That's particularly the case if you enjoy watching streaming content on the move, thanks to some neat screen features we'll get into later.",
    "The TCL 20 SE looks reasonably nice too. Sure, it has a plasticky feeling to it and it's a bit of a fingerprint magnet, but it still looks fairly pleasant from a distance. It's available in either Nuit Black or Aurora Green, with the latter looking particularly eye-catching.",
    "As mentioned, the screen is the highlight here. It has a 6.82-inch display with a 20.5:9 aspect ratio that works well for watching Netflix or YouTube videos while on the move.",
    "That's further enhanced by its use of NXTVISION - a technology that TCL has borrowed from its TVs. It digitally upscales content to improve contrast and brightness. It genuinely does the job well, especially given the price involved for this handset.",
    "If you're worried about the front-facing camera getting in the way, it doesn't. It's in a small cut-out on the top-center of the screen and reasonably unobtrusive.",
    "The back of the phone is the location for the fingerprint sensor as well as four reasonably subtly placed camera lenses, each labeled up so you know exactly which lens does what.",
    "The cameras do the job but that's about it. The lenses include a main 16MP camera, a 5MP ultra-wide, 2MP depth, and 2MP macro. An 8MP selfie camera rounds things out. You can get some reasonable results - in part thanks to the phone's software - but this is far from a device for avid snappers.",
    "Images tend to come out moderately okay but lacking some depth and vibrancy. Interestingly, thanks to the TCL 20 SE's good-quality screen, the results look far better on the phone than on other devices.",
    "As soon as you move them across to use elsewhere, you'll notice the camera's limitations. Don't expect to see any useful bonuses like a night mode here either, although that's to be expected at this price.",
    "While we're on the subject of things to not expect, there's no wireless charging functionality, of course. Charging itself is pretty slow going too, although at least the 5,000mAh battery capacity goes some way to redeeming that fact.",
    "Performance-wise, the TCL 20 SE is a little sluggish. Even when negotiating menus and opening apps, it never feels particularly nippy. It's not the end of the world and it can fall back on the crutch of its low price tag, but if you're impatient, you'll notice it, especially when gaming.",
    "That's the thing about the TCL 20 SE. It feels wrong to criticize it too much when it's so cheaply available, but outside of its display, it's really nothing special. If you're on a tight budget though and mostly stream content, you might be swayed.",
    "The TCL 20 SE is available in the UK already with a US release date unconfirmed at the time of writing, however it is expected to launch there at some point. There's no news on an Australian release, though TCL does sell phones there.",
    "The phone is available in a choice of two color schemes - Nuit Black or Aurora Green. It's available in the UK exclusively from Argos SIM-free.",
    "The TCL 20 SE is a fairly substantial device, especially if you have small hands. For the small-handed amongst us, there's a certain amount of stretching involved to reach the other side of it, but that doesn't mean it's uncomfortable. That's because the phone's edges are curved so it feels quite smooth to wrap your hands around.",
    "Designed in a fairly standard way, you have a USB-C port on the bottom with a 3.5mm headphone jack up top, along with a power button and volume rocker on the right edge, and a Google Assistant button to the left-hand side. It's all suitably intuitive and standard for most smartphones.",
    "On the plastic back there's a fingerprint sensor and the TCL logo along with the camera lenses, which stick out ever-so-slightly. The back is also where you notice most obviously that the device is a fingerprint magnet, but you can wipe them off relatively easily.",
    "The TCL 20 SE is a reasonably good-looking phone too, at least when it's not covered in fingerprints. While it feels cheap, its shimmery back looks decent.",
    "TCL is also keen to stress that it has placed the phone's dual speakers in a way that means you won't end up holding your hand over them while in use, which is a pretty useful design feature. There's no water resistance, but we wouldn't expect that at this price.",
    "The TCL 20 SE has a 6.82-inch IPS LCD display with a small cut-out for the front-facing camera in the top-center. It's 720 x 1640 with 263 pixels per inch, and it's perfectly designed for watching videos on the move, being suitably sizable so you don't feel like you're missing out.",
    "That's accentuated by the use of TCL's NXTVISION technology. The technology upscales the content you're watching, ensuring many videos look far better than usual.",
    "It also tweaks all the images you view so that even photos you take look better on this screen than elsewhere. It's this phone's greatest strength and it's a pretty good one if you use your phone to regularly watch Netflix or YouTube.",
    "There's a separate app devoted to NXTVISION so you can tweak the settings or opt to disable it, which you might want to do when viewing photos for example, so that they look more like they will on other displays.",
    "Of course, don't count on any other shiny extras like HDR10+ support or enhanced refresh rates. This is a budget phone, don't forget.",
    "The TCL 20 SE has four rear cameras but they're not exactly awe-inspiring. There's a 16MP f/1.8 main camera, a 5MP f/2.2 ultra-wide, a 2MP f/2.4 macro, and a 2MP f/2.4 depth-sensing camera. On the front, there's an 8MP f/2.0 selfie camera.",
    "Just to confuse things, TCL has decided to use a 48MP main camera and a 13MP selfie camera on the phone in some regions, but we haven't tested that version.",
    "None of the cameras we have tested are particularly exciting. Thanks to the TCL 20 SE's great display, you'll look through the photos and think they look surprisingly good. Transfer the photos elsewhere though and their limitations are soon apparent.",
    "That includes a lack of depth and color. We may have taken a fair few photos on a gloomy day but the TCL 20 SE makes it look all the gloomier.",
    "When we took photos of vibrant flowers in full bloom, they looked pleasant enough but lacked some depth, while details such as raindrops were barely noticeable. The use of portrait mode doesn't do much to help with focus either.",
    "Good lighting helps but that's not something you can guarantee, and the TCL 20 SE's camera limitations are all the more evident when using the macro camera or the ultra-wide lens.",
    "Video footage is limited to 1080p at 30fps at most - understandable for this price. On the plus side, both the front and rear cameras can manage this rate so that's useful.",
    "The TCL 20 SE's greatest strength camera-wise lies with the software involved. A fair number of options are available to you including slow motion, light trace, and panorama. It's also possible to tweak settings individually, although you're always going to be held back by the hardware.",
    "The TCL 20 SE isn't snappy. Some apps open up speedily, like Facebook or Netflix (both pre-installed), but it's inconsistent. That's hardly surprising given the low-end Snapdragon 460 chipset and 4GB of RAM used, and it's reflected in our Geekbench 5 test.",
    "The phone returned a multi-core score of 1,104 with a single-core score of only 247. That's not going to set the world on fire by any means and that's clearly evident when we tried playing a few games. The likes of Call of Duty: Mobile suffered from some noticeable stutters and moments of lag.",
    "Simply not designed with gaming in mind, the TCL 20 SE also lacks a bit of storage, with only 64GB to play with. Luckily, a microSD slot helps out here if you need to expand the storage. There's also a 128GB version listed by TCL, but this doesn't appear to be available at the time of writing.",
    "Where we did appreciate the TCL 20 SE is with the speaker setup. Its dual speakers are placed in a way that means you'll be able to watch videos without blocking out the sound, which is a small but very useful feature.",
    "The TCL 20 SE has a 5,000mAh battery capacity, which sounds impressive until you bear in mind that it doesn't feel so huge in actual use. We watched the percentage timer throughout the day, and even with occasional use it felt like it dipped faster than made sense. That's particularly true when gaming for a while, with the TCL 20 SE not really maintaining the numbers you'd expect.",
    "That's not to say it's terrible by any means but you're going to need to recharge it overnight. Throughout the night is the best time too as the TCL 20 SE is pretty slow to get back up to speed, with it only able to charge at 18W.",
    "As a side note, the phone supports reverse charging (allowing you to use it to charge other devices), which you may never use but it's a nice bonus and a surprising addition on such a budget device. Of course, there's no wireless charging.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "15": "TCL 20 SE price and release date",
    "17": "Design",
    "22": "Display",
    "27": "Camera",
    "35": "Performance and specs",
    "39": "Battery life",
    "42": "Don't buy it if..."
  },
  "links": {
    "TCL 20 Pro 5G": "https://www.techradar.com/reviews/tcl-20-pro-5g"
  }
}