{
  "source": "https://www.techradar.com/reviews/arlo-essential-spotlight-review",
  "title": "Arlo Essential Spotlight review",
  "category": "smart-home",
  "updated": "2021-04-14T11:26:35Z",
  "author": "christian-de-looper",
  "summary": "A solid home security camera for the price",
  "verdict": "The Arlo Essential Spotlight camera is more affordable than Arlo’s other home security cameras. It's simple to use, the Full HD footage is clear and in color both during the day and at night thanks to the built-in spotlight, and you can access useful smart features – although you will need an Arlo Smart subscription in order to do so. The battery isn’t removable, so the weather-proof camera will be out of action when it needs charging.",
  "pros": [
    "Good video for the price",
    "Arlo app is simple to use",
    "Spotlight works well"
  ],
  "cons": [
    "Subscription all but essential",
    "Battery can’t be removed",
    "Smaller field of view than other Arlo cameras"
  ],
  "article": [
    "Arlo has been offering some of the best smart security cameras for a few years now, but while its cameras are among the best in the business, they’re also a little pricey. With the new and more affordable Arlo Essential Spotlight camera, the brand is looking to appeal to a wider range of buyers.",
    "Like any other Arlo security camera, the Arlo Essential Spotlight camera will send an alert to your smartphone when it detects motion, so that you can login and view the incident in real time. It also stores the footage in a secure area online (providing you’ve subscribed to an Arlo Smart plan after the three-month free trial has expired), so this video can be played back at any point over the next 30 days.",
    "The camera records video in Full HD, making it a step down from some of Arlo’s other cameras, and it’s only got a 130-degree field of view compared to the larger 160-degree field of view of Arlo’s more expensive cameras. However, at $129.99 / £129.99 / AU$229.99 it's certainly a more affordable option, and it has some of the other features found on the Arlo Pro 3 and Arlo Ultra, such as a spotlight that illuminates when motion is detected in low light, ensuring that the footage can be seen in color, along with two-way audio and a built-in siren which can be manually or automatically triggered.",
    "The Arlo Smart subscription doesn’t just cover video storage. It also uses AI to provide more detailed motion alerts – for example whether the motion was a person, animal, vehicle, or some other source, as well as enabling you to choose areas within the camera’s field of view in which motion detection is enabled.",
    "Unlike its more expensive siblings, the Arlo Essential Spotlight camera doesn’t require a base station; instead it connects directly to your Wi-Fi network, although if you already have Arlo cameras and a base station in your home, it can be paired with those – Arlo says this not only increases the battery life, but also extends the range of the camera.",
    "The camera is battery-powered, but the rechargeable battery isn’t removable, so when the camera needs recharging it’ll be out of action. You need to remove the camera from its mount and use the micro USB cable that comes in the box to recharge it. Arlo says the battery will last up to six months between charges, but this will depend upon how often it detects motion, the number of times the spotlight is triggered, and how often you view footage, and use the microphone and speaker.",
    "Amazon Alexa, Google Assistant and HomeKit integration are built into the Arlo Essential Spotlight camera, so you’ll be able to get the camera to work with your smart lights and other devices to create routines that give the impression that you're at home when you're not. You’ll also be able to view footage from the camera on your TV or screen-equipped device, no matter which voice assistant you have.",
    "The Arlo Essential Spotlight camera is positioned as Arlo’s entry-level home security camera, although with color night vision and a built-in siren it doesn’t make too many compromises. The Arlo Essential Spotlight camera is available now from the Arlo website, Amazon and other electronics retailers with a list price of $129.99 / £129.99 / AU$229.99.",
    "The camera comes with a three-month free trial of Arlo Smart, which stores video footage securely online and identifies whether motion alerts are caused by a person or animal. Once the trial expires you’ll need to subscribe, at a cost of $2.99 / £2.49 / AU$4.49 per month, to get the most out of your camera. Arlo offers a more expensive subscription that supports 4K video, but as the Arlo Essential Spotlight camera isn’t capable of recording at this resolution you won't need this.",
    "Arlo designs products that look and feel like they belong together, and the Arlo Essential Spotlight is no exception. The weather-resistant camera has the same white plastic body and black front as the rest of Arlo’s security camera lineup, and at first glance you probably wouldn’t be able to tell which model is which.",
    "Above the lens on the front of the camera is an LED light. On the back there’s a screw mount for fixing the camera to a wall or other surface, and on the bottom, behind a cover, is the micro USB port. It’s a little frustrating that Arlo is sticking with micro USB here – with phones, smart speakers and other gadgets increasingly moving to USB-C, the company is behind the times.",
    "A key difference between the Arlo Essential Spotlight and other Arlo cameras is that other models have removable batteries, so you don’t have to take your camera offline when you charge it, as long as you've purchased a second battery that you can swap-in. The Arlo Essential Spotlight needs to be removed from its mount and charged indoors using the bundled micro USB cable; with six-month battery life it’s hardly an issue you’ll regularly run into, but it's still something to note.",
    "Setting up the Arlo Essential Spotlight camera is a breeze. You start by downloading the Arlo app and either signing in or creating a new account. Then, hit the 'Add New Device' button, and follow the on-screen instructions to add a new camera, which requires you to hold a QR code displayed on your phone screen in front of the camera. The app makes the process easy, and as we already had an Arlo account we were able to complete the setup process in under five minutes, including a firmware update at the end of the process.",
    "Physically installing the Arlo Essential Spotlight is easy too, with everything you need to mount the camera included in the box. You screw the mount into a wall or ceiling, and then simply screw the camera onto the mount.",
    "In an ideal world, after the camera is set up you won’t have to interact with it unless it detects something that needs your attention. The camera will automatically start recording when it detects motion, and the spotlight will turn on for low-light recording too.",
    "The video quality is very good for a camera in this price range, even if footage isn't quite as crisp as that from some of Arlo’s more expensive devices. If you need more detailed video, consider the 2K Arlo Pro 3, or the 4K Arlo Ultra instead – although hose come at a much higher price.",
    "The field of view of the Arlo Essential Spotlight is 130 degrees, which is quite a bit less than the 160-degree field of view on the Arlo Pro 3. This should still be enough for most situations, but if you need a camera to cover a wide area it may not be suitable.",
    "The camera doesn’t have infrared night vision, as some other security cameras do. Instead, it uses its spotlight to illuminate the scene in low light. The end result is that footage taken at night is in color, and contains a good amount of detail. As you might expect, the light isn’t as bright as the one on the Arlo Pro 3 Floodlight, but it’s bright enough for most scenarios.",
    "Note too that, as with any smart device, you'll need a strong and reliable Wi-Fi connection for the best performance.",
    "One of the best things about the Arlo ecosystem in general is the Arlo app. It's well-designed and easy to use, and there are plenty of settings that you can tweak if you’re so inclined.",
    "The app interface features four tabs. First up is the Devices tab, which is where you’ll be able to see all your cameras and devices, and their status, and quickly jump into settings for each. There's also the Library tab, where you can see past footage, and export it; the Mode tab, which enables you to configure settings to control how a camera behaves when you're home or away; and the Settings tab.",
    "As is often the case with cloud-based platforms like Arlo's, some features, like object detection and cloud storage for your recordings, are locked behind a paywall. As mentioned you get a three-month trial of Arlo Smart to let you try these features for free, and after that you’ll have to pay $2.99 / £2.49 / AU$4.49 per month, which isn't too bad compared to some other security camera plans.",
    "Arlo claims the Essential Spotlight camera battery will last up to six months before it needs recharging; exactly how long the battery lasts will depend upon how often motion is detected, how many times the spotlight is triggered, the amount of time spent viewing footage through Live View, and whether the two-way microphone and speaker are used.",
    "We found it took around four hours to recharge the battery using the bundled micro USB cable and power adapter."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Arlo Essential Spotlight price and availability",
    "9": "Design",
    "14": "Performance",
    "19": "App",
    "22": "Battery life",
    "24": "Don't buy it if..."
  },
  "links": {
    "best smart security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Arlo Pro 3": "https://www.techradar.com/reviews/arlo-pro-3",
    "Arlo Ultra": "https://www.techradar.com/reviews/arlo-ultra",
    "Arlo Pro 3 Floodlight": "https://www.techradar.com/reviews/arlo-pro-3-floodlight"
  }
}