{
  "source": "https://www.techradar.com/reviews/sitelock-vpn",
  "title": "SiteLock VPN review",
  "category": "computing",
  "updated": "2021-11-12T17:18:11Z",
  "author": "sead-fadilpasic",
  "summary": "Lovely speeds, but no P2P support",
  "verdict": "SiteLock VPN is a highly usable VPN service, if you don’t mind the fact it’s located in the US, doesn’t allow torrenting and cannot unblock BBC iPlayer. It also leaves a lot to be desired in terms of information provided on the website. Otherwise, you’re getting an affordable, sleek and fast solution that can unblock whatever Netflix library you set your eyes on.",
  "pros": [
    "Budget-friendly",
    "Excellent download speeds",
    "Unblocks Netflix",
    "Phone customer support"
  ],
  "cons": [
    "Only accepts debit/credit cards",
    "Headquartered in the US",
    "Doesn’t unblock BBC iPlayer",
    "Complicated cancelation process",
    "Lacks information"
  ],
  "article": [
    "SiteLock is a popular cybersecurity company founded in 2008 that specializes in protecting websites (hence the name) of small businesses, but also has solutions for individuals. One of these solutions is a VPN that can be purchased as a separate service.",
    "The SiteLock VPN is available under three subscription plans: one-month, one-year and two-year. The latter is the cheapest, costing only $3.99/month (charged at $95.75 every two years), which is a 40% discount on the monthly subscription.",
    "Unfortunately, the only accepted payment method is credit/debit cards, which doesn’t allow you as much flexibility and user control as you’d get with PayPal, nor the anonymity of cryptocurrencies.",
    "There is no free trial and the refund policy only applies if the service is not working. Specifically, it says that you can request a refund within 30 days of signing up for the service, but you need to submit your request in writing, along with your reasons. However, you will only get your refund if “SiteLock’s services fail to perform, as determined solely by SiteLock, or in the event of an early discontinuation of unused pre-paid Services by SiteLock.”",
    "The cancellation process itself is very inconvenient, as you need to wait for someone from customer support to actually check your identity so the cancelation request can be verified, leaving you to wait for an undefined amount of time before your account is cancelled.",
    "Although SiteLock VPN is a decent alternative to the likes of ExpressVPN, NordVPN, Surfshark, and CyberGhost, it's not on the same level.",
    "These major VPN players still have a much better offerings. All of them are located outside of the privacy-unfriendly US, support torrenting, unblock BBC iPlayer and let you pay via a variety of different methods. They also provide access to many more servers, much more information on their products, and include a lot more features in their apps.",
    "During our testing, we attempted to access geo-restricted libraries on two popular streaming services: Netflix and BBC iPlayer. We managed to unblock whatever content on Netflix we wanted but weren’t so lucky with BBC iPlayer, which successfully recognized we weren’t accessing the platform from the UK, even though we connected to VPN servers there.",
    "SiteLock’s headquarters are in Arizona, the United States. Its VPN service provides users with access to over 1,100 servers in more than 40 locations worldwide, including in Albania, Colombia, Costa Rica, Mexico, Israel, Nigeria, Peru, Moldova, South Africa, United Arab Emirates, and others.",
    "The apps are very modest on privacy features, except the kill switch that can be activated on Windows (although it's off by default). We tried asking the provider for more details about encryption, but our email queries fell on deaf ears. What we do know is that the apps use OpenVPN and IKEv2 connection protocols.",
    "In the provider’s Customer Agreement, we found some information on its no-logging policy. The document states that the service doesn’t monitor, record, log, store, or pass your activities to any third party. We’re also told that it doesn’t “store connection time stamps, session information, used bandwidth, traffic logs, IP addresses or other data”.",
    "Since there still hasn’t been any independent audit of the VPN platform, we have no choice but to trust these claims.",
    "SiteLock’s VPN has apps for Mac, Windows, Android and iOS devices, and they can be downloaded from the user’s dashboard. There, you’ll also find simple instructions for their installation and use, as well as video instructions. No other platforms seem to be supported.",
    "If you need assistance beyond the installation instructions, you can try SiteLock’s FAQ/support section but it isn’t exactly abundant. You may need to contact customer support directly via phone, contact form or email. The provider also has social media presence on Facebook, Twitter, Instagram and LinkedIn.",
    "We gave email support a shot, but never got an answer. This could be due to the fact that our questions were more general in nature, but the vendor’s competition has been a lot more enthusiastic about answering.",
    "We found the apps very simple to use, considering there aren’t many features to mess with. The process of connecting is a bit clunkier than it could be, as you have to select the server in settings, click Save, and then go back and click Connect. However, the app connects quickly, in just a couple of seconds and you’ll get a notification upon successful connection.",
    "The provider’s speeds were tested on a 44.66Mbps testing connection from a location in south-east Europe. We first wanted to see how the ‘Best Available’ server would perform. In our case, it was a server in Belgrade, Serbia, which delivered a decent 20.17Mbps, although we expected more from the “best available”.",
    "Then we proceeded to the UK, which interestingly gave us better results than Serbia, measuring a very nice 21.98Mbps. We then hopped over to a server in New York, which delivered a high (considering the testing speed) 15.22Mbps. Finally, a server in India gave us just 7.61Mbps, but this is typical considering the server’s distance from our location.",
    "SiteLock VPN is a handy VPN solution for anyone who doesn’t plan on using it for torrenting or streaming BBC iPlayer, nor is too concerned about the lack of an audited no-logging policy.",
    "Its advantages include affordable pricing, great download speeds, Netflix-unblocking capabilities and customer support available over the phone. However, if you’re still concerned about privacy and want access to every possible corner of the internet, you might want to consider an alternative.",
    "Other VPN providers we have recently tested include:",
    "VPN Gate, Seed4.me, Hideway VPN, BulletVPN, Tuxler VPN, VPNsecure, b.VPN, FastestVPN, X-VPN, SuperVPN, VeePN, ProXPN, Dashlane VPN, TouchVPN, Goose VPN, SlickVPN, Namecheap VPN and VPN Proxy Master"
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "12": "Support",
    "15": "Speed and experience",
    "18": "Verdict"
  },
  "links": {
    "SiteLock": "https://www.sitelock.com/products/purchase-vpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Customer Agreement": "https://www.sitelock.com/download/legal/SITELOCK_CUSTOMER_AGREEMENT_2019.pdf",
    "FAQ/support section": "https://www.sitelock.com/resources/help-center",
    "contact form": "https://www.sitelock.com/contact",
    "email": "mailto:support@sitelock.com",
    "Facebook": "https://www.facebook.com/SiteLock/",
    "Twitter": "https://twitter.com/SiteLock",
    "Instagram": "https://www.instagram.com/sitelock/",
    "LinkedIn": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6283622504963294000&xs=1&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fsitelock%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsitelock-vpn",
    "VPN Gate": "https://www.techradar.com/reviews/vpn-gate",
    "Seed4.me": "https://www.techradar.com/reviews/seed4me",
    "Hideway VPN": "https://www.techradar.com/reviews/hideway-vpn",
    "BulletVPN": "https://www.techradar.com/reviews/hideway-vpn",
    "Tuxler VPN": "https://www.techradar.com/reviews/tuxler-vpn",
    "VPNsecure": "https://www.techradar.com/reviews/vpnsecure",
    "b.VPN": "https://www.techradar.com/reviews/bvpn",
    "FastestVPN": "https://www.techradar.com/reviews/fastestvpn",
    "X-VPN": "https://www.techradar.com/reviews/x-vpn",
    "SuperVPN": "https://www.techradar.com/reviews/supervpn-free-vpn-client",
    "VeePN": "https://www.techradar.com/reviews/veepn",
    "ProXPN": "https://www.techradar.com/reviews/proxpn",
    "Dashlane VPN": "https://www.techradar.com/reviews/dashlane-vpn",
    "TouchVPN": "https://www.techradar.com/reviews/touch-vpn",
    "Goose VPN": "https://www.techradar.com/reviews/goose-vpn",
    "SlickVPN": "https://www.techradar.com/reviews/slickvpn",
    "Namecheap VPN": "https://www.techradar.com/reviews/fastvpn",
    "VPN Proxy Master": "https://www.techradar.com/reviews/vpn-proxy-master"
  }
}