{
  "source": "https://www.techradar.com/reviews/smeg-drip-filter-coffee-machine",
  "title": "Smeg Drip Filter Coffee Machine review",
  "category": "appliances",
  "updated": "2021-06-24T07:20:48Z",
  "author": "sophie-bird",
  "summary": "Is the Smeg Drip Filter Coffee Machine worth its price tag?",
  "verdict": "The Smeg Drip Filter Coffee Machine makes smooth coffee that stays hot for up to 40 minutes. It can’t make fancy lattes but it’s not designed to, and instead, you get great features such as an auto-start mode, aroma settings, and a large capacity coffee jug.",
  "pros": [
    "Accurate programmable timer",
    "Keeps coffee hot for 40 minutes",
    "Makes multiple cups at once"
  ],
  "cons": [
    "Cup sizes are much smaller than standard coffee cups",
    "Interface steams up in use",
    "Takes up a lot of space"
  ],
  "article": [
    "The Smeg Drip Filter Coffee Machine features Smeg’s iconic retro-inspired design, and is available in a variety of colors. It’s designed to produce large quantities of filter coffee in one go, and a hot plate means you can keep the coffee warm for up to 40 minutes after brewing.",
    "There’s a timer function, so you can load in the ground coffee, add water, and select the time you want the machine to start brewing your coffee. You can also choose between a delicate or an intense aroma from your coffee, depending on how you like it.",
    "Although this Smeg can create multiple cups of coffee at once, we found the cup sizes the machine uses to be much smaller than a standard cup. The interface on this machine also steams up when the coffee is brewing, and the water tank isn’t the easiest to fill up.",
    "It did a very good job of keeping coffee warm for up to 40 minutes, while its stylish design also adds to its appeal and earns it a place among our best coffee makers.",
    "The Smeg Drip Filter Coffee Machine is available from a wide range of retailers. It’s certainly not the cheapest drip filter coffee maker on the market, but you’re also paying for Smeg’s signature retro design here.",
    "The Smeg Drip Filter Coffee Machine’s design reflects the brand’s ethos of combining a retro look with modern conveniences. It’s available in eight different colors in the UK and seven in the US, while color choices in Australia are more limited.",
    "Aside from its distinctive looks, the other thing we noticed straight away was how big this maker is. It measures 14.25 x 9.6 x 10 inches / 24 x 25.6 x 36.1cm (w x d x h), and it was too tall for us to be able to slide this coffee maker under our kitchen wall cabinets.",
    "It features a lid that forms the top of the appliance, and lifting this allows you to fill up the water reservoir, as well as position the filter basket and reusable filter, and add your ground coffee. The water reservoir has a 47floz / 1.4-liter capacity, which Smeg says is big enough to hold water for 10 cups of coffee, although we found the company’s definition of a cup to be rather on the small side – in practice you’ll get around five standard mugs of coffee from a full brew.",
    "The carafe also has a 10-cup capacity and is made of glass, which is a nice touch as many drip filter machines have plastic carafes. We also like the reusable coffee filter that’s included with this machine, as it means you don’t have to use paper filters, and the only waste left behind is the used coffee grounds, which you can put on your garden or recycle as food waste. If you prefer to use paper filters, there’s still the option to add them into the machine’s filter basket.",
    "On the front of the Smeg Drip Filter machine you’ll find a small screen that doubles up as a clock and four buttons, one of which allows you to program in a time you’d like the machine to start brewing your coffee. The other buttons are used to turn the machine on and off, adjust the aroma intensity, and select the machine’s four-cup setting – on this setting the machine stops brewing after four cups, allowing you to make a smaller quantity of coffee without having to beside the machine and manually stop the brewing process (you will have to do this for all other quantities aside from a full 10 cups).",
    "The glass carafe sits on a hot plate which is automatically activated when the Keep Warm setting kicks in after the coffee has finished brewing, and it keeps the coffee warm for up to 40 minutes.",
    "There’s no set-up required before you can start using the Smeg Drip Filter machine – you simply need to wash the carafe and its lid in warm water, and rinse the machine through, and you’re ready to start brewing coffee. It’s worth noting that you can’t remove the water reservoir to fill it up, and trying to pour water into it can be a little awkward. To rinse the machine before first use you have to place the carafe onto the warming plate and switch the machine on, and it’ll then run hot water through the coffee maker.",
    "For our first brew we decided to make enough coffee for two cups, and we spooned the required amount of ground coffee into the reusable filter. We switched the machine on, and we found that it took two minutes to brew our two cups of coffee. When the machine was working it averaged 45 decibels, which is pretty good when you consider a quiet library averages 40 decibels – most of the noise came from the coffee dripping into the carafe rather than the machine itself. One thing we did notice is that the clock screen steamed up when the machine was in use, although this wasn’t a major issue and it’s easily wiped clean.",
    "As we’ve mentioned, there’s a four-cup button on this Smeg coffee maker; however, you can only choose between this and the full capacity of 10 cups of coffee, so for any other size of brew you’ll have to stay by the machine and manually stop it when you’ve reached the desired amount.",
    "We measured out two cups of coffee and found that each cup, according to the carafe, was actually only 5floz / 150ml whereas a standard cup measures 8floz / 250ml – so for a couple of standard mugs of coffee with a bit to spare you’ll be better off using the 4-cup setting. The coffee tasted smooth, though, and was nice and hot.",
    "Next, we tried making a full carafe of coffee on the machine’s auto start mode. Programming the timer was easy and it proved to be very accurate, starting up and brewing our coffee right on schedule. This feature is great if you want to have your morning coffee waiting for you when you wake up - you’ll just have to remember to fill the water reservoir and put coffee into the filter before you go to bed.",
    "The Smeg Drip Filter isn’t the cheapest coffee maker on the market, but there are a few features that give it the edge over its competitors. You can adjust the water hardness settings to suit your taste, and simple touches such as being able to silence the ‘beep’ when pressing buttons are handy extras.",
    "Cleaning the machine is relatively easy – you can place the filter and the filter holder in a dishwasher, while the jug needs to be washed in warm soapy water. When the Smeg needs to be descaled a descaling icon will show up on the coffee maker’s screen, and you simply need to add descaling solution to the water tank, and run a cleaning cycle followed by two rinse cycles."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Smeg Drip Filter Coffee Machine price and availability",
    "5": "Design",
    "11": "Performance",
    "18": "Don’t buy it if…"
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines"
  }
}