{
  "source": "https://www.techradar.com/reviews/ordo-sonic",
  "title": "Ordo Sonic+ review",
  "category": "fitness",
  "updated": "2021-07-20T15:29:17Z",
  "author": "cat-ellis",
  "summary": "A top quality sonic toothbrush doesn't have to cost the Earth",
  "verdict": "The Ordo Sonic+ is a premium electric toothbrush for a super affordable price. It uses the same technology as the Philips Sonicare line (fast pulses that push water between teeth), but with a more gentle action. This, combined with its soft bristles, makes it a great choice for anyone who finds standard electric toothbrushes too vigorous, and its small head means it's also ideal for those with braces. The optional subscription packs of floss, mouthwash, interdental brushes and replacement brush heads make it even better value. Thoughtfully designed, well built, and effective.",
  "pros": [
    "Premium design",
    "Very affordable",
    "Gentle cleaning action",
    "Good value subscription packs"
  ],
  "cons": [
    "No shaver socket adapter",
    "Charger can collect residue",
    "No travel case"
  ],
  "article": [
    "The Ordo Sonic+ works on the same principle as a Philips Sonicare electric toothbrush, using sonic pulses to send water between and around your teeth. The Sonic+ is more gentle though; its movements are slightly slower (40,000 per second rather than 62,000 per second) and although there’s no pressure sensor, its head has softer bristles that will help you avoid gum damage. If you’re concerned that a Sonicare brush might be too vigorous, it’s a great alternative.",
    "We also particularly like its small brush head, which gives easy access to all tooth surfaces. This, combined with the gentle brushing action and optional subscription pack containing toothpaste, floss, mouthwash and three sets of interdental brushes, makes it a very good choice for anyone with fixed braces.",
    "It’s tough to criticize the Ordo Sonic+, but it’s strange that the charger only has a USB connector, and there’s no adapter for plugging it into a standard shaver socket.",
    "There’s no Bluetooth connectivity here, but for such an affordable price (£49.99 - about $70 / AU$90) that's no surprise. if you’re looking for a gentle and effective toothbrush, and are confident that you don’t need guidance with your technique, the Ordo Sonic+ could be the brush for you.",
    "The Ordo Sonic+ was released in August 2020 and costs £49.99 (about $70 / AU$90). It’s available direct from Ordo, and from Boots in the UK. For comparison, the entry-level Philips Sonicare DailyClean 3100 costs £59.99 (about $80 / AU$110), but only has one mode compared to the Ordo's three, and has a much less attractive design.",
    "Replacement brush heads for the Ordo Sonic+ cost £5 (about $7 / AU$9) each, which is also much less than most other electric toothbrush brands.",
    "Despite its low price, the Ordo Sonic+ certainly doesn’t feel cheap, and will look just as good in your bathroom as brushes costing several times the price. It's supplied with the brush handle, charging base (which comes in two pieces for easy cleaning), USB cable, and one brush head with a plastic cover.",
    "Our review unit also came with a pack containing two tubes of toothpaste, three packets of interdental brushes, floss, a pouch of mouthwash concentrate, and a bottle for diluting it. These can all be bought separately, and the pack (not including the bottle) is available as a one-time purchase, or on a subscription plan.",
    "Unlike many electric toothbrushes we’ve reviewed recently, there’s no travel case. It’s also worth noting that there’s no adapter for plugging the charger into a standard shaver socket in your bathroom.",
    "The charger has a central pin that slots into a recess on the bottom of the brush. This design holds the brush firmly in place, but lead to a build-up of toothpaste and hard water reside at the bottom of the brush unless it’s carefully dried after use. There’s also a small gap between the brush head and body (much like the Philips Sonicare DiamondClean 9000), so it’s a good idea to make sure this area is clean and dry after you’ve finished as well.",
    "The handle (available in white/silver, charcoal gray, and rose gold) is slim and light, with a single control button. Pressing it once will turn the brush on, and pressing it again quickly will switch between the different cleaning modes. These are listed on the handle, with the current active mode indicated by a white LED.",
    "Pressing the button after a brief pause will turn the brush off. A red light towards the bottom of the handle illuminates when the brush is charging, and switches off when it’s finished.",
    "The Ordo Sonic+ is very pleasant to use – comfortable in the hand, and nicely weighted. It’s unusually quiet as well, producing even less sound than the top-end Philips Sonicare 9900 Prestige. It has four modes (clean, white, massage, and sensitive), which cover all the fundamentals, but there are no intensity options. Instead, all the settings are relatively gentle.",
    "The brush head is particularly small, making it easy to manoeuvre right to the back of you, and its slim design means it’s easy to use with your mouth closed. The bristles are softer than many other brushes we’ve tested, making it a good choice if you have sensitive gums.",
    "This also helps compensate for the lack of a pressure sensor. There’s no light or vibration to indicate if you’re pressing too hard with the brush, but the design of the head means you’re less likely to cause damage than you are with other electric toothbrushes.",
    "There’s no display on the handle, so no visible indicator of how long is remaining, but the brush buzzes gently every 30 seconds to alert you when it’s time to move to the next quadrant of your mouth, and it switches itself off when two minutes are up.",
    "In our tests with disclosing tablets the Ordo Sonic+ wasn’t quite as effective when used alone as the Philips Sonicare 9900 Prestige, but if you opt for the refill pack, the interdental cleaning tools makes it easy to finish the job by hand.",
    "We particularly like that the subscription pack isn’t delivered on a set schedule; you can choose how often it arrived based on how quickly you get through its contents. Floss is always handy, and the interdental brushes will be particularly useful to anyone with braces.",
    "The refillable mouthwash bottle is a nice touch, reducing use of single-use plastic. You only need a very small amount of mouthwash concentrate (the small pouch provided will fill the bottle four times) and when fully diluted it still has quite a kick. We also appreciated the two different sized toothpaste tubes, though the smaller travel tube would be even more useful if the brush came with a carry case for taking on the road."
  ],
  "headers": {
    "4": "Price and release date",
    "6": "Design",
    "12": "Performance",
    "19": "Don't buy it if"
  },
  "links": {
    "electric toothbrush": "https://www.techradar.com/best/electric-toothbrushes",
    "direct from Ordo": "https://www.ordolife.com/",
    "Philips Sonicare DiamondClean 9000": "https://www.techradar.com/reviews/philips-sonicare-diamondclean-9000",
    "Philips Sonicare 9900 Prestige": "https://www.techradar.com/reviews/philips-sonicare-9900-prestige"
  }
}