{
  "source": "https://www.techradar.com/reviews/asics-novablast-tokyo",
  "title": "Asics Novablast Tokyo review",
  "category": "fitness",
  "updated": "2021-04-22T13:50:25.511Z",
  "author": "cat-ellis",
  "summary": "A neutral road shoe that's light, bouncy, and a whole lot of fun",
  "verdict": "An extra light neutral road shoe, the Asics Novablast Tokyo is great fun thanks to a new super-bright color scheme and masses of squashy Flytefoam Blast material in the midsole. The result is a ride that's bouncy, springy and energetic. The mesh upper is particularly breathable, and minimal padding in the tongue will make this a great shoe for summer speed work. Just be careful if the weather takes a turn for the worse; the reduced tread underneath means there's a risk of slipping in wet conditions.",
  "pros": [
    "Springy, energetic ride",
    "Comfortable out of the box",
    "Light and breathable"
  ],
  "cons": [
    "Can feel unstable on bumpy roads",
    "Limited grip in wet weather"
  ],
  "article": [
    "The Asics Novablast Tokyo is a new iteration of the company's lightweight, springy road running shoe – and it's a lot of fun. This is a highly cushioned neutral shoe with masses of lightweight Flytefoam Blast material in the midsole that give a really bouncy ride.",
    "The shoe is stiff laterally, with a toe that's quite dramatically curved for efficient transfer of energy and a distinctively springy feeling that's great for faster sessions and race days.",
    "Asics has gone to great lengths to pare back the weight, which has resulted in a particularly breathable upper, and although both the laces and tongue are thinner than we're used to, there was no unpleasant pressure on the top of our foot after a long run.",
    "However, all that squashy foam means the Novablast Tokyo can feel a little unstable on bumpy surfaces, and the minimal grip (another weight-saving measure) means you'll want to keep it for dry days to avoid slipping. We foresee it being an excellent shoe for warm days though, and the heel clutch provides a secure yet comfortable fit even with lightweight socks.",
    "Not that unlike the Sunrise Reborn pack launched earlier this year, which features new versions of the MetaRide and Gel-Quantum 360 TYO shoes redesigned from old clothes collected in Japan, the Novablast Tokyo sticks with the company's conventional manufacturing techniques and materials.",
    "The Asics Novablast Tokyo launched in February 2021, and costs $130 / £130 / AU$230 direct from Asics.",
    "The Asics Novablast Tokyo come in one color: a searingly bright red-orange that the company calls Sunrise Red. Our review pair were supplied in an illuminated box, but that was barely necessary; nobody's going to miss you, which is a real plus for training sessions after dark. The men's model has black detailing, while the women's (tested here) has white. It may not be to everyone's taste, but it's fun.",
    "Asics has sought to reduce weight wherever practical, and as a result the men's version tips the scales at around 275g, while the women's is about 225g.",
    "The laces are thinner and narrower than we've come to expect, and we were concerned that they might put unwanted pressure on the top of the foot when combined with the minimally padded tongue, but this wasn't the case.",
    "The shoe fastened securely and remained comfortable throughout each run, though you may want to pay a little extra attention to the tension.",
    "The midsole is made from Asics' Flytefoam Blast material, which is super soft, giving the shoe a very characteristic bouncy feel. There's 32mm of squishy foam under the heel and 22mm under the toe, which is generous by anyone's standards.",
    "The shoe is stiff enough to remain springy though, and the aggressively angled toe provides good forward momentum. If your 10k times have hit a plateau, this could be right up your street.",
    "We found the Asics Novablast Tokyo comfortable right out of the box, and despite the thin laces mentioned earlier, it was easy to get a secure fit. As with all recent Asics road shoes, the heel clutch prevents slipping, and there's plenty of room in the toebox to suit a wider foot and accommodate swelling on hot runs.",
    "This is one of the most breathable road shoes we've tried in some time, which should be a real boon for summer efforts, and the upper is manufactured entirely in one piece with no seams or welding, which should help prevent blisters even with thin summer socks.",
    "Although the Asics Novablast Tokyo doesn't have a carbon or plastic plate, it has real spring that makes it a better choice for faster sessions than long, slow runs. In fact, the super-soft foam combined with stiff sole give it a slightly strange, unstable feel until you get up to speed, at which point it becomes thoroughly enjoyable.",
    "You may also feel a little unsteady if the roads near you are prone to cracks and potholes; for the best run, we recommend sticking to reasonably well surfaced roads. You might also want to keep them for dry days; the outer sole has relatively little grip, which could lead to some slipping in wet conditions, particularly when you take the squishy foam into account.",
    "In the right conditions, though, this shoe is a joy, and we can see it being particularly fun in hot weather when a heavier shoe would make training a sweaty drag."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and release date",
    "6": "Design",
    "12": "Performance",
    "17": "Don't buy it if"
  },
  "links": {
    "running shoe": "https://www.techradar.com/best/best-running-shoes",
    "Sunrise Reborn": "https://www.techradar.com/news/asics-launches-sustainable-new-running-shoes-made-from-recycled-clothes"
  }
}