{
  "source": "https://www.techradar.com/reviews/yamaha-yh-l700a",
  "title": "Yamaha YH-L700A review",
  "category": "audio-visual",
  "updated": "2021-10-13T10:51:33Z",
  "author": "simon-lucas",
  "summary": "Big (definitely) and clever (mostly)",
  "verdict": "If spatial audio is your thing, then Yamaha has some big, bold headphones that will show you a good time. The performance-to-price ratio could be better though.",
  "pros": [
    "Beautifully built and finished, from premium materials",
    "Convincing and periodically captivating spatial audio effects",
    "Sound reflects their big and burly look"
  ],
  "cons": [
    "Unarguably expensive",
    "Ordinary noise cancellation",
    "Size rules out many potential owners"
  ],
  "article": [
    "The world isn’t short of wireless noise-cancelling headphones, but Yamaha has given its YH-L700A a definite point of difference – and we don’t just mean the eye-widening price. The company is adept with digital sound processing, as its long and proud heritage of multichannel home cinema amplifiers demonstrates.",
    "And there’s no denying the effectiveness of the spatial audio aspect of these headphones – they’re a more immersive and convincing listen in this respect than any nominal rival. Even in stereo, they have plenty to recommend them in sonic terms – not least their full-bodied, expansive and dynamic personality.",
    "However, there’s no EQ customization available here,and they’re far from the last word in noise cancellation. And to bring things down to a fundamental level, they’re quite big – too big, certainly, for many people who might not have previously considered their heads all that small. Plus, did we mention the price?",
    "The Yamaha YH-L700A wireless over-ear headphones are on sale now, and are priced at $529 / £449 / AU$699. That looks quite a lot, doesn’t it? But when you realise they should more properly be called ‘Yamaha YH-L700A wireless active noise-cancelling high-resolution 3D-audio headphones with voice control and aptX Adaptive compatibility’, suddenly the price doesn’t appear quite so steep. The YH-L700A may be getting on for twice the price of Sony’s field-leading WH-1000XM4, but they compare favourably with the likes of, say, Apple’s AirPods Max.",
    "It’s worth pointing out here that www.usa.yamaha.com is a peculiarly unresponsive website, so it will take you quite a bit longer than is ideal to confirm that information.",
    "Justification for a premium price begins on the outside and, sure enough, the Yamaha YH-L700A look, feel and – to an extent – even smell like a premium product. The use of woven fabric (for the judiciously padded headband and most of the closed ear-cups’ covering), leather (on the earpads and a little section of the earcups) and robust, tactile plastic (for pretty much everything else) gives a strong impression of expense. The fairly assertive ‘tri-tuning fork’ Yamaha logo on each rectangular earcup doesn’t do any harm in this respect, either. An all-in weight of 330g adds to the impression of solidity, without making the headphones especially burdensome – not in the short-term, anyway.",
    "There’s a fair amount of adjustment in the headband, but even at its smallest the fit is on the generous side. As such, those with notably wide heads shouldn’t have any difficulties, while the more petite-headed may find themselves a little swamped. Swamped by leather and expensive-feeling fabric, admittedly, but swamped nonetheless.",
    "Each earcup features a mic opening for use with active noise-cancelling, telephony and voice assistance. In addition, the left earcup also has a physical control for cycling through noise-cancellation options (‘off/ambient sound/on’). There’s a 3.5mmm input for wired use; when used wirelessly, Yamaha claims a battery life of between 11 hours, with all clever features turned on, and 34 hours, with all clever features turned off. The lithium-ion battery can be fully charged, from flat, in around 3.5 hours.",
    "On the right, on the edge of the earcup, you’ll find a button for power on/off/Bluetooth pairing and another to cycle through your 3D Sound Field effect (more on both those later). There’s also a USB-C input for charging the battery. On the leather-covered portion of the right earcup, meanwhile, there are three multifunction controls, covering play/pause, volume up/down, skip forwards/backwards and answer/end/reject call.",
    "As well as these physical controls and Google Assistant or Siri voice control, there’s Yamaha’s Headphones Controller app, too. Some controls, such as noise-cancelling options and 3D sound options, duplicate the function of the physical controls on the YH-L700A – but it’s here that Head Tracking, Listening Care and Listening Optimizer can be switched on or off. And yes, all three of those functions bear discussion.",
    "Head Tracking becomes available when you’re listening with the 3D Sound Field option switched on. As you might suppose, it intends to adjust the spatial audio presentation relative to the movement of the wearer’s head. Listening Care, meanwhile, seeks to optimize to the headphone’s volume balance, based on real-time calculations undertaken every 0.7m/s, while Listening Optimizer uses an in-cup mic to measure the seal and leakage of the earcup relative to the wearer’s ears, amending the sound accordingly.",
    "Given the exhaustive nature of the specification, at least as far as convenience and the listening experience is concerned, it’s mildly surprising to find no accelerometers fitted to the YH-L700. So, if you take them off your head then they’ll just blithely continue playing. If they’re aware of the position of your head, surely they ought to be aware of their position relative to your head?",
    "On the inside, the YH-L700A use Bluetooth 5.0 for wireless connectivity, with support for SBC, AAC and aptX Adaptive codecs. Sound is delivered by a couple of 40mm full-range dynamic drivers, with a frequency response (according to Yamaha) of a frankly fanciful 8Hz up to an only-slightly-more-credible 40kHz.",
    "Along with the headphones themselves (which swivel and fold helpfully to make transporting them a little easier), the YH-L700A package includes a 50cm USB-A to USB-C charging cable, a flight adapter, a 3.5mm to 3.5mm audio cable (the Yamaha are on ‘Hi-Res Certified’ when hard-wired) and a very pleasant semi-hard carry-case.",
    "There are most definitely a couple of fundamental ways to assess the performance of the Yamaha YH-L700A: in straight stereo, like the majority of headphones, and with their fancy-pants 3D Sound Field algorithm engaged. So these seem as good a place as any to start.",
    "With all processing switched off and a Tidal Masters file of Sparks’ What the Hell Is It This Time? playing, the Yamaha are a poised and undeniably burly listen. There’s nothing muscle-bound about their presentation, you understand, but at the bottom of the frequency range they’re assertive in a very well-behaved manner. Bass sounds are punchy and textured, with nice straight edges where the attack and decay of individual notes and hits are concerned. There’s plenty of detail on display, so differentiating between the derivation of low-end sounds is easy.",
    "These same detail levels are evident throughout the rest of the frequency range, too. The vocal in the mid-range, unmistakable in its tone and phrasing, is absolutely packed with character – which is just as it should be. Attack at the top of the frequency range is more than adequate, but there’s never any suggestion that things could get hard, edgy or out of control in some other way. Instead there’s ample drive, tempered by complete control. If well-supervised abandon sounds like your thing, the Yamaha have plenty to offer.",
    "They’re impressive where dynamics are concerned, too – both the low-level harmonic variances that describe the light and shade of a recording, and the broad-strokes gleeful charge into the final crescendo stuff. The soundstage they describe is cogent, expansive and properly organised. In fact, as far as stereo performance goes, there’s only a minor, but definite, lack of rhythmic expression that prevents the YH-L700A impressing in every single respect. Listening to Summertime Clothes by Animal Collective isn’t quite the fluent, undulating experience it should be.",
    "Listening to the same songs with 3D Sound Field engaged is quite a different experience. Yamaha’s mastery of digital sound processing will be common knowledge to anyone familiar with the multichannel home cinema amplifiers the company has released in the past couple of decades, and there’s absolutely no doubt that the seven Surround mode settings – cinema, concert hall, audio room and so on – offer an entirely ‘other’ sonic experience.",
    "The various EQs give distinct and individual presentations, and there’s no disputing the spatial nature of each and every one of them. In some cases, they make the recordings slightly less easy to interpret; in other cases, they make identifying individual strands of a recording easier to follow. However, in every instance they offer a fuller, more enveloping and more immersive experience. Whether or not it’s preferable to the straight stereo reproduction is very much a question of taste.",
    "Head Tracking is a slightly less convincing feature of the whole 3D Sound Field experience. Basically, if you’re facing ‘forwards’ while listening, both drivers are contributing a pretty similar amount of information. Turn your head to the left, though, and the right earcup gains sonic primacy since it’s now facing the ‘front’ of the stage. The stereo system in my childhood home had a feature such as this – it was called a ‘balance’ control.",
    "Of the other headline features, the effect of both Listening Care and Listening Optimizer are either subtle or negligible, depending on your point of view. Certainly, if you’re wearing the YH-L700A while seated in an indoor environment then they don’t have a huge effect on the headphones’ sonic performance. The work the algorithms are doing is more noticeable – and, consequently, more welcome – if you’re out and about. Although at this point we’re bound to enquire as to why you’re out and about wearing such a massive pair of headphones.",
    "The active noise cancelling is also a rather qualified success. There are only three positions here, don’t forget: on, off or ambient sound (which increases the amount of external sound audible from inside the headphones). There’s no doubt that exterior noise is diminished when noise cancelling is on – but it’s far from the blanket of silence in which a set such as the Bose Noise-Cancelling Headphones 700 cocoons the listener. Mind you, at least switching the noise-cancellation circuitry on doesn’t result in the sort of overt counter-signal that less accomplished designs can introduce."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Yamaha YH-L700A price and release date",
    "5": "Design and features",
    "14": "Audio performance",
    "23": "Don't buy them if..."
  },
  "links": {
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Apple’s AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "www.usa.yamaha.com": "http://www.usa.yamaha.com/",
    "Bose Noise-Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review"
  }
}