{
  "source": "https://www.techradar.com/reviews/paypal-here-point-of-sale-pos-review",
  "title": "PayPal Here point of sale (POS) review",
  "category": "pro",
  "updated": "2021-08-12T19:57:43Z",
  "author": "joanne-heng",
  "summary": "PayPal Here simple and versatile payment processing service.",
  "verdict": "A popular POS system provider with top-notch customer service.",
  "pros": [
    "Affordable pricing",
    "No hidden costs",
    "Quick and easy set up",
    "12 month warranty",
    "Intuitive interface"
  ],
  "cons": [
    "Lack of advanced features",
    "Not suitable for high-volume businesses"
  ],
  "article": [
    "Aside from making payment processing a breeze, the best pos system should offer a suite of services for merchants to gain insights to grow their business. While most know PayPal as an online payments system, not many know that the company has its own PayPal Here POS application and mobile payment processing system.",
    "With Paypal Here point of sale system, merchants can accept payments anywhere with just a smartphone or tablet. In this PayPal Here POS review, we’ll look at the service’s pricing, features, interface, support, and security to help you determine if the platform is suitable for your business.",
    "While the mobile app that accompanies your card reader is free to download, merchants will have to purchase a reader that is right for their business. PayPal Here offers three devices that differ in price point and functionality. With all three devices, you’ll have to pay transaction fees that PayPal charges separately.",
    "The cheapest reader ($24.99) is the Chip and Swipe Reader, which accepts chip and magnetic-stripe payments and is EMV compliant to support the latest payment security standards. PayPal’s entry-level reader does not support NFC/contactless transactions from apps such as Apple Pay or Android Pay.",
    "For that, PayPal offers a Chip and Tap Reader and a Chip and Tap Bundle. The former, which will set you back $59.99, gets you a device that takes chip, contactless, and magnetic-stripe payments. Finally, the Chip and Tap Bundle ($79.99) includes the Chip and Tap Reader along with a charging stand that keeps your reader charged all day long.",
    "PayPal Here also offers many POS hardware accessories, like printers, cash drawers, POS stands, and more to complete your setup.",
    "While PayPal Here isn’t the most feature-rich POS service provider, it does offer some useful features that are worth mentioning.",
    "Getting started with PayPal Here POS is a breeze. All you’ll have to do is download the app and sign up for an account. You’ll then be greeted with the app's intuitive and clean interface. With a few clicks and scrolls you’ll be able to manage your inventory, view basic sales reports, and edit your business information.",
    "On the customer-facing end, the mobile readers are just as easy to use.",
    "PayPal Here offers multiple channels of customer support for its POS system users. On its website, you’ll find a Help Center where you can search for video tutorials, how-to guides, and answers to your queries pertaining to account setup, payment processing, and more. The service also has an active community forum where users can communicate with one another.",
    "If you prefer to contact a customer support agent, PayPal Here’s support team is available through the phone or email. On our test, the service’s friendly support team responded to our email query within 72 hours.",
    "PayPal Here is PCI-DSS compliant, and all transactions on its readers are end-to-end encrypted, so you won’t have to worry about losing your sensitive data, and that of your customers, to breaches.",
    "For extra security, PayPal Here monitor client transactions 24/7, as a precaution for any suspicious payment activity or fraud.",
    "With no ongoing contract and a low entry cost, PayPal Here is great for small businesses looking for a secure and easy-to-use payment processing system. Large-scale business owners with higher demands, however, may find PayPal Here’s features too basic.",
    "For these users, services like Adyen POS and Helcim POS that provide advanced features such as plug-ins, integrations, advanced analytics, and detailed reports may be more appropriate. These services, however, see pricing plans that are much more complex than PayPal’s simple pricing.",
    "With an easy-to-use app, simple backend features, clear pricing, and no contract to tie you down, PayPal Here POS is great for small business owners looking for a simple POS setup. Large-scale business owners with high-volume sales, however, may find the PayPal Here lacks advanced features and isn’t as comprehensive as they’d like.",
    "That said, PayPal Here’s comprehensive support, ease of use, convenience, and multiple payment options make the service easy to recommend."
  ],
  "headers": {
    "2": "PayPal Here POS: Plans and pricing",
    "6": "PayPal Here POS: Features",
    "7": "PayPal Here POS: Interface and in use",
    "9": "PayPal Here POS: Support",
    "11": "PayPal Here POS: Security",
    "13": "PayPal Here POS: The competition",
    "15": "PayPal Here POS: Final verdict"
  },
  "links": {
    "best pos system": "https://www.techradar.com/news/the-best-pos-system",
    "EMV compliant": "https://www.techradar.com/news/what-is-emv-compliance",
    "NFC": "https://www.techradar.com/news/what-is-nfc",
    "Apple Pay": "https://www.techradar.com/how-to/how-to-use-apple-pay",
    "POS hardware": "https://www.techradar.com/news/pos-hardware-how-to-find-the-best-retail-equipment-for-your-business",
    "PCI-DSS compliant": "https://www.techradar.com/news/what-is-pci-dss-compliance",
    "Adyen POS": "https://www.techradar.com/reviews/adyen-point-of-sale-pos-review",
    "Helcim POS": "https://www.techradar.com/reviews/helcim-point-of-sale-pos-review"
  }
}