{
  "source": "https://www.techradar.com/reviews/fujifilm-gfx100s",
  "title": "Fujifilm GFX100S review",
  "category": "cameras",
  "updated": "2021-04-28T16:05:31Z",
  "author": "sharmishta-sarkar",
  "summary": "Medium format in the palm of your hand… kind of",
  "verdict": "The original GFX 100 was a groundbreaking camera, but the Fujifilm GFX100S takes it all to another level. For the first time there’s a 100MP medium format camera packed into a DSLR-sized body, including image stabilization, and costing as much as some of the latest full-frame mirrorless snappers. A lot of X-series tech has made its way here, making the GFX100S one of the more mainstream and accessible medium format cameras there is.",
  "pros": [
    "102MP on tap",
    "Improved IBIS",
    "Relatively small and compact"
  ],
  "cons": [
    "Still quite heavy",
    "Continuous AF not perfect",
    "Expensive for some"
  ],
  "article": [
    "Medium format cameras aren’t particularly mainstream, but the Fujifilm GFX100S is trying to change that. Traditionally, medium format cameras, particularly the ones with 100MP on tap, are mostly used within studio environs because of how big and heavy they are. They’re all also frightfully expensive, like Hasselblads and PhaseOne cameras, and even the Fujifilm GFX 100 is pretty pricey.",
    "Instead of going with the flow, Fujifilm has miniaturized its medium format snapper and the new GFX100S is about as big and heavy as a full-frame DSLR like the Canon EOS 5D Mark IV and costs less than the latest Sony Alpha 1 full-frame mirrorless shooter.",
    "Fujifilm managed the downsizing by redesigning the shutter and image stabilization mechanisms. This has allowed the company to move the battery pack to the grip, and thus losing the vertical grip that was the hallmark of its predecessor. While it might be lighter and smaller than its predecessor, it’s still heavier than the average full-frame mirrorless camera and, paired with a GFX lens, the kit is still relatively heavy.",
    "The IBIS unit is now 20% smaller than the one in the GFX 100 and 10% lighter too, but Fujifilm has managed to improve on the stabilization by half a stop – the GFX100S is rated for 6 stops of shutter speed compensation as compared to 5.5 stops in the older model.",
    "With the loss of the vertical grip comes the use of a smaller battery but, again, the compromise isn’t as much of a disadvantage as you’d expect. The GFX100S uses the same battery as the Fujifilm X-T4 that’s rated for 460 shots per charge, and that’s pretty much what you’d get from most modern full-framers.",
    "The addition of a traditional mode dial on the top plate also means that the GFX100S would be familiar to most photographers moving from another system, while the virtual shutter speed and ISO dials that debuted on the GFX 100 are available for anyone comfortable using them. If not, the control layout on the GFX100S is easy to get used to, with a very distinct Fujifilm aesthetic.",
    "The company has managed to cut costs with the EVF, which is a 3.69-million dot OLED panel as opposed to the 5.76-million dot one on the GFX 100. However, the new camera does inherit the older one’s 3.2-inch tilting touchscreen.",
    "It also inherits the GFX 100’s video specs, with 4K/30p 10-bit 4:2:0 internal recording available at a max bit rate of 400Mbps (a significant jump over the 100Mbps on the Sony A7R IV, for example). Where it outperforms the GFX 100 is the ability to record up to 120 minutes of video length – twice that of its predecessor. It also gets a brand-new Film Simulation filter, taking the total count to 19.",
    "All in all, the GFX100S is a major improvement over its predecessor in terms of portability and usability, and having over 100MP of resolution on tap is a dream, but it’s still heavier than the average full-frame camera and is, despite its relatively lower price tag, still pricey even for many professional photographers.",
    "For a 100MP medium format camera, the Fujifilm GFX100S is what can be considered ‘affordable’. At $5,999 / £5,499 / AU$9,499 for the body alone, it costs as much as some high-end pro full-framers, like the Sony A9 II, and is actually cheaper than the new Sony Alpha 1 (which will set you back $6,500 / £6,500 / AU$10,499).",
    "Compared to the GFX 100, which will currently set you back an eye-watering $9,999 / £9,999 / AU$15,999, the new model is almost half the price. And that makes the GFX100S a very real prospect as an upgrade for some photographers.",
    "At the time of writing, the GFX100S is still available for pre-order from most major camera retailers. It was expected to be on shelves by the end of February 2021, but that seems to have been pushed back to an unspecified date in most markets.",
    "Fujifilm calls its 100MP cameras “large format” even though the dimensions of the sensor are the same as the ones used in the 50MP medium format bodies. That makes the 102MP sensor inside the GFX100S 1.7x larger than a full-frame alternative. And that usually requires a large body. However, the GFX100S can easily be mistaken for a full-frame camera when in the hand, making it a far cry from the original GFX 100.",
    "Its significantly smaller size is not its only headline feature, though. Fujifilm has managed to shrink its in-body image stabilization mechanism by repurposing the tech used in the company’s smaller bodies like the X-H1, X-T4 and X-S10, and actually managed to improve its capabilities by half a stop in the process. The image stabilization system also comes into play when using the camera’s high-resolution mode that spits out 400MB stills resulting from the combination of 16 shots taken using pixel shifting.",
    "However, the smaller body means there’s no longer a vertical grip to house extra batteries. Moreover, instead of the 400-shot NP-T125 battery pack as used in the other GFX bodies, the GFX100S utilizes the smaller NP-W235 pack found in the Fujifilm X-T4 that has a CIPA rating of 460 shots per charge. While 460 is a far cry from the whopping 800 shots you could get from the extra batteries in the GFX 100, this is in line with most battery packs used in other full-frame mirrorless cameras today and is usually enough for a day’s worth of work. However, thanks to the camera's USB-C port, the battery can be topped up in-camera even while on the go.",
    "In addition to the use of a traditional mode dial on the top plate of the GFX100S, Fujifilm has also tweaked the design of the joystick controller on the rear of the camera. Instead of the usual four-way joystick, there’s now a smaller 8-directional ‘nub’ that can move diagonally as well. This makes moving the AF point a lot quicker, but it does take a little getting used to – the directional changes are so minute that it’s easy to go diagonally instead of horizontally, for example.",
    "Like its predecessor, the GFX100S is capable of 5fps bursts with continuous autofocus and it also inherits the video prowess of the GFX 100. However, as mentioned before, instead of being restricted to just 60-minute video clip limits, the GFX100S can record movies up to 120 minutes.",
    "And while the shutter mechanism’s lifecycle, max speed and sync speed remain the same as that of the GFX 100, Fujifilm has managed to reduce lag from 0.09 seconds to 0.07 seconds.",
    "Then there’s the addition of a new Film Simulation setting called Nostalgic Neg. This preset adds a hint of amber to highlights and ups the saturation of some colors slightly, resulting in a more retro-looking image.",
    "Weighing just 900g and measuring 150x104x44mm, the GFX100S resembles a full-frame DSLR more than its predecessor. However, when paired with a GFX lens, the new camera can be tiring when used handheld over long periods of time. During our testing, we had to keep putting it down every 20 minutes or so, despite a very comfortable and deep grip.",
    "And while the hand grip has a middle finger indent that’s perfect for users with small hands, it might be too small for those with larger fingers. It’s worth noting that, while the rear thumb rest is deep, the placement of the Q button (to access the Quick Menu) on the ridge of the rest can cause concern for some, like it did on the Fujifilm X-T30, however we didn’t encounter this issue ourselves when testing.",
    "The rest of the control layout will be familiar to most photographers (whether you’re moving from a DSLR or a mirrorless system), with the traditional mode dial on the left of the top plate and a 1.8-inch LCD display on the right. This display can be customized to show shooting parameters, a histogram or the virtual shutter speed and ISO dials that made the GFX 100 unique.",
    "The top display can be illuminated using a small button on the side of the EVF and graphics can be shown in black on white or the default white on black, depending on what’s easier for you to see. Even the Quick Menu can be customized in a similar fashion to be displayed on a live view background or on an opaque grey screen on the rear LCD monitor. In fact, practically anything can be programmed to suit specific the needs of the user, whether its drive modes or exposure settings.",
    "Compared to some high-end full-framers (and the GFX 100 for that matter), Fujifilm has used a 3.68-million dot EVF on the GFX100S – a lower-resolution OLED panel as compared to the likes of the Sony A1 (9.43 million dots) or the Canon EOS R5 (5.76 million dots), but this has helped keep costs down. Despite that, the EVF is sharp, with 0.77x magnification in 35mm terms. Thankfully, though, it retains the large 3.2-inch tilting rear monitor from the GFX 100, with a plethora of touch controls that would be familiar to users of Fujifilm’s latest cameras.",
    "There are dual card slots on board, but instead of opting to go for high-speed storage formats like CFexpress (as many other camera makers have done recently), Fujifilm has stuck to the SD format, with both slots compatible with UHS-II speed devices.",
    "Despite trying to keep cost down, the GFX100S is solidly built, with the same weather-sealing we’ve seen in older models. But there is no denying that its compact form factor and the massive 102MP on tap makes the GFX100S a compelling alternative to high-end full-frame mirrorless cameras.",
    "As mentioned above, Fujifilm has compromised on the EVF and battery to keep the price of the GFX100S down, but in no way do those hamper the performance of the camera. Despite the lower resolution EVF, it’s comparable to several mirrorless alternatives, offering a clear reproduction of the frame. Similarly, the rear display is also extremely responsive and is easy to read outdoors.",
    "While it’s tempting to compare the GFX100S to the performance of the current line-up of pro full-frame mirrorless cameras, with their blitzing fast burst rates and superfast autofocus tracking, it is important to keep in mind this camera is medium format. That means you’re not going to be able to rattle off 20fps bursts, and the autofocus can feel slow and clunky in comparison. That said, for the medium format category, the GFX100S still performs admirably.",
    "Shooting at its maximum 5fps burst rate, the GFX100S can save up to 42 JPEGs and 16 RAW files to card, provided you’re shooting 14-bit stills, just like its predecessor. Move to 16-bit and its buffer depth drops to 7 frames for both JPEGs and RAW. Also like the GFX 100, the new camera remains operational while images are being saved, so you can continue shooting or make adjustments while you wait.",
    "For a medium format camera, the autofocus is pretty snappy. The GFX100S picks up a subject’s face remarkably quickly, although it does struggle if there are several faces in the frame. Again, tracking isn’t as fast as on a Canon R5/R6 or a Sony Alpha model, but the GFX100S can keep up with most slow-moving subjects. It’s also important to keep in mind that AF performance will also depend on the lens you use. Armed with a GF 36-64mm f/4 lens, we were quite happy with the camera, but it might be a different story when using a lens like the GF 120mm f/4.",
    "Even though battery life is rated for 460 shots, that’s a conservative number. You’ll easily be able to squeeze out close to 600.",
    "And while the IBIS is rated for a very impressive 6 stops of shutter speed advantage, in real world use that’s more like 4 to 4.5 stops (after all, the camera is still quite heavy as compared to other mirrorless systems). That’s because stabilization systems are measured for just pitch and yaw movements, and the number provided is a best-case scenario. Still, even the diminished stabilization is more than enough to get to work with shutter speeds as low as 1/8 second, depending on your ability to handle a heavier camera.",
    "Just thinking about the whopping 102MP available to play with can get most of us excited. There’s absolutely no denying how much detail a high-resolution sensor like that can capture and the GFX100S does not disappoint in any way. Whether you need to crop a whole lot out of the image or you want to print large, there’s more than enough resolution here to play with.",
    "The camera’s metering system works admirably, keeping details intact whether in light or in shadow, retained perfectly even when you’ve cropped significantly to zoom into the subject, as we have done below.",
    "Then there’s the legendary dynamic range you get from a medium format camera. If you try to underexpose frames when using APS-C or full-frame cameras, chances are you won’t have the leeway to bring images back to life during post-processing, but with a medium format camera, that’s usually very doable. We underexposed some test shots by two or three stops and were amazed at how well details were preserved and were brought to fore during the editing process.",
    "Noise performance is also pretty good. The advantage of having a medium format sensor is its ability to capture a lot more light than smaller alternatives. So, for the most part, we didn’t need to go above ISO 800 when shooting in low light, but images captured in ISO 6400 are also excellent. You will notice grain at ISO 8000, but those images are also perfectly usable, as long you’re not planning on cropping too much.",
    "Colors are remarkable and although some look a touch oversaturated when using some Film Simulations, just opting for the Standard preset made most of our test shots come alive with bursts of color. Tonality is beautiful and Fujifilm’s Film Simulations make this camera ideal for any type of photography.",
    "First reviewed March 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Fujifilm GFX100S: price and availability",
    "12": "Specs and features",
    "19": "Design and handling",
    "26": "Performance",
    "32": "Image quality",
    "37": "Don't buy it if..."
  },
  "links": {
    "Fujifilm GFX 100": "https://www.techradar.com/reviews/fujifilm-gfx-100-review",
    "Canon EOS 5D Mark IV": "https://www.techradar.com/reviews/canon-eos-5d-mark-iv-review",
    "Sony Alpha 1": "https://www.techradar.com/reviews/sony-a1",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A9 II": "https://www.techradar.com/reviews/sony-alpha-a9-ii",
    "X-H1": "https://www.techradar.com/reviews/fujifilm-x-h1",
    "X-S10": "https://www.techradar.com/reviews/fujifilm-x-s10",
    "Fujifilm X-T4": "https://www.techradar.com/reviews/fujifilm-x-t4",
    "Fujifilm X-T30": "https://www.techradar.com/reviews/fujifilm-x-t30-review",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5"
  }
}