{
  "source": "https://www.techradar.com/reviews/breville-the-fresh-and-furious-review",
  "title": "Breville the Fresh and Furious review",
  "category": "appliances",
  "updated": "2021-08-12T14:48:15.012Z",
  "author": "helen-mccue",
  "summary": "A compact blender that performs brilliantly at a great price",
  "verdict": "Breville the Fresh & Furious is a neat compact blender that’s affordable and a great option if you’re looking for a well-made blender but can’t justify the higher price tag of Breville’s more premium models. It pulverizes spinach and pineapple into a silky smoothie, has no problem crushing ice and can cope well with small quantities. However, it can’t hold the same large capacities as Breville’s top-of-the-range blenders.",
  "pros": [
    "Easy to store",
    "Affordable",
    "Effective blends and crushes"
  ],
  "cons": [
    "Small blending jug",
    "Some leaking out of inner measuring lid",
    "Base is plastic"
  ],
  "article": [
    "Breville is a go-to brand for those seeking high-end, well-designed kitchen appliances; from some of the best coffee makers and Instant Pot alternatives, to blenders, Breville offers a wide array of food preparation gadgets that look stylish as well as being extremely effective.",
    "Breville the Fresh & Furious is the brand’s entry-level blender that keeps the price low by switching out the sturdy stainless steel motor base in favor of a plastic one.",
    "The pitcher has a smaller capacity than its more premium models too. However, despite the compromises, it still has the recognizable Breville style and feels well-built.",
    "With five speeds and three preset programs, it offers plenty of settings for most people’s blending needs but if you want really nuanced control of blending speeds, you might want to check out Breville the Super Q which has 12 speeds.",
    "It’s compact, light, and doesn’t come with any accessories other than a tamper, so it’s easy to store. In our tests it performed really well, blending everything we threw at it and unlike the bigger, more expensive Breville the Super Q , it can blend small quantities very well. The jug size makes it ideal for smaller families or anyone who wants a good all-around blender with a sensible price tag.",
    "Breville the Fresh & Furious is available online through the Breville website in the US and Australia. In the UK it’s known as Sage the Fresh & Furious and can be purchased through the Sage Appliances website.",
    "This model offers an entry-level blender at a great price in comparison to the other blenders in the range, but the motor isn’t as powerful as you’ll get in the higher priced blenders.",
    "Breville the Fresh & Furious is smaller and more compact than the higher-priced blenders available from Breville. It measures 17.3 x 8.5 x 6.9 inches/ 43.9 x 21.6 x 17.6 cm (h x w x d) so won’t take up much space on your countertop. And if you want to store it in a cupboard it’s not too heavy to lift in and out regularly at 8.6 lbs./ 3.9kg. Though it should also be said that the light weight is because the base is plastic, it doesn’t have the same solid and sturdy brushed stainless steel base as higher-priced Breville blenders such as Breville the Super Q so will be more susceptible to movement if blending really tough foods.",
    "The design is sleek, practical, and uncomplicated. The jug sits directly onto the base, rather than being tricky to maneuver it into position, as we’ve found with some blenders we’ve tested, and it can be positioned with the handle either facing the left or right-hand side. The lid has a handy ring pull design, which makes it easy to remove. The 50oz/1.5-liter Tritan jug is smaller than the 68oz/2-liter jug you get with Breville the Q or the Super Q and the 1100W (1300W in the UK and Australia) motor isn’t as powerful either, but that’s reflected in the price. A tamper is provided to help move ingredients around while blending.",
    "It has five speeds to choose from as well as three preset programs: green smoothie, auto pulse/ ice crush, smoothie. For easy cleaning, there’s an auto-clean function, but the jug and lid are also dishwasher safe. There’s a timer that counts down during the preset programs and for the five-speed settings it counts up, stopping the blender after 120 seconds, this is a safety feature to restrict wear on the motor.",
    "In the US it’s available in seven muted color options, but in the UK and Australia, it comes in silver only. The instruction manual doesn’t give any advice on time or speed settings so you’re on your own here. It doesn’t come with a recipe book either, but one is available to download on the US and Australian websites.",
    "Breville the Fresh & Furious is straightforward to assemble and use, it didn’t struggle with any of our blending tests and we didn’t experience any ingredients getting lodged under the blade either.",
    "We tried out the Green Smoothie preset program with a smoothie containing apple juice, spinach, pineapple, banana and yogurt. This sixty second program allows you to walk away while it liquidizes everything into a completely smooth and lightly aerated drink, with no bits.",
    "The rounded inner base of the jug allows it to blend very small quantities, so when we made mayo, it was able to mix two egg yolks with vinegar unlike Breville the Super Q which wasn’t able to mix such a small quantity in our tests. The mayo came was emulsified with a thick spoonable texture, but we experienced spitting while we poured in the oil.",
    "The ice crush program is preset for sixty seconds, but our six ice cubes were completely evenly crushed in just twenty-five seconds. At 85dB this was the loudest of the tests we carried out and is equivalent to the noise of an automatic car wash when you’re stood 20 feet away.",
    "To chop hazelnuts, we set it to mix – the lowest speed setting - and pulsed it on and off a few times. This produced a mixture of chopped nuts with some powder, but no larger chunks so not a bad result.",
    "When the jug is filled to its max capacity and switched on, some liquid escapes through the inner measuring lid but it remains in the recessed part of the lid and doesn’t spill down the sides.",
    "We tried out the auto clean program after making mayo, all you need to do is fill the jug with 2 cups of warm soapy water. It did a great job, removing most of the gloopy mayo residue from the sides and blade area in just sixty seconds, making it really quick to finish off in the sink. But for an easier option, pop the jug and lid straight into the dishwasher.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "30-second review",
    "5": "Breville the Fresh and Furious price and availability",
    "7": "Design",
    "11": "Performance",
    "18": "Don’t buy it if…"
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines",
    "Instant Pot": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "blenders": "https://www.techradar.com/best/best-blenders",
    "Breville the Super Q": "https://www.techradar.com/reviews/breville-the-super-q"
  }
}