{
  "source": "https://www.techradar.com/reviews/saucony-ride-14",
  "title": "Saucony Ride 14 review",
  "category": "fitness",
  "updated": "2021-05-09T12:00:00Z",
  "author": "michael-sawh",
  "summary": "Saucony makes upper tweaks to its great daily trainer road shoe",
  "verdict": "The Saucony Ride 13 was one of the best road running shoes that launched in 2020 and the Ride 14 doesn’t make wholesale changes to a shoe that’s well suited to easy runs with and picking up the pace. If you didn’t love the upper on the 13 or like the idea of something that’s a little lighter, then you’ll find the Ride 14 will be more to your liking.",
  "pros": [
    "Nicely responsive PWRRUN midsole cushioning",
    "Comfortable fit",
    "Well built for a variety of runs"
  ],
  "cons": [
    "Upper changes don't feel huge",
    "Could still be a bit lighter"
  ],
  "article": [
    "The Saucony Ride 14 is the successor to the Ride 13, a neutral running shoe built for road running that’s all about being an option you can turn to for a variety of sessions. Whether that’s lacing them up for short, easy 5k run outs or long steady Sunday marathon training runs.",
    "It retains the same PWRRUN cushioning used in the 13 to provide a nicely responsive and cushioned ride and has matched that with a mesh upper that’s designed to help make this a lighter and more breathable shoe to eat up miles in than its predecessor.",
    "That reduction in weight mainly lies in its FormFit mesh upper, which uses a thinner construction inside of the upper with some material reduced at the top of the shoe. It’s also added more ventilated areas to make it a more breathable shoe to run in too.",
    "In reality, the upper changes don’t feel like they make a huge difference to the performance of the Ride 14 compared to the 13. It still provides snug, supportive surroundings and the cushioning in the midsole still offers a satisfying bounce and is built to let you up the tempo.",
    "'If it ain’t broke, don’t fix it' seems to be the approach from Saucony with the Ride 14. There’s not a huge amount here to convince Ride 13 owners to upgrade, with a slight drop in weight to a shoe that’s still a great do-it-all option to consider.",
    "The Saucony Ride 14 launched in April 2021 and costs $130 / $125 (about AU$170) direct from Saucony.",
    "The Ride 14 comes in four colorways for both men and women and the blue Future Spring colorway we had the pleasure of running in is quite a departure from the Ride 13's loud Citron Mutant design. If you want a more muted look, you do have options here.",
    "In terms of those key specs, it has the same 8mm heel-to-toe drop as the 13 and promises a weight drop of 10g on the men’s shoe and 6g on the women’s. It’s stuck with the same TPU-based PWRRUN cushioning technology and rubber outsole that offers plenty in the way of traction and feels built to eat up plenty of miles before showing signs of wear. While it handled a few off road runs, this is one to save for pavement and road running.",
    "Saucony’s FORMFIT upper is built with supreme comfort in mind and it’s an engineered mesh kind, but this is where Saucony has sought to make changes and shave off some grams in weight. It’s stuck with the same spongy-style laces that sit against a plush tongue to alleviate any unnecessary pressure on the top of your foot.",
    "It’s added more ventilated areas around the upper to make it a more breathable shoe to run in on hot days and it seems to have tweaked the material on the heel collar for something that feels smoother than what was used on the 13.",
    "Saucony has also adjusted the shape of the shoe up front where the toe box sits a lot closer to the top of your feet this time. It gives it a sleeker profile than its predecessor and again feels like a move to shave off weight without compromising on offering a roomy fit for a wide range of foot types.",
    "The best thing we can say about the Ride 14 is that it feels pretty much identical to running in the 13. Whether it was on easy runs, longer hour and above runs or even some quicker 5k and 10k runs, this is a shoe that can handle a lot with no issues.",
    "The PWRRUN-packing midsole offers an enjoyable ride and strikes a good balance between giving that bouncy feel underfoot and still feeling controlled and stable. When you reduce your pace, it’s a shoe that accommodates those slower speeds well. When you need to get a sprint on, there’s a nice snap there to support some speedier running sessions.",
    "The upper changes though didn’t feel like they were hugely noticeable in our running time with them. Running conditions weren’t hot and sweaty enough to really get a sense whether that mesh upper can really make things more breathable.",
    "The reduction in weight doesn’t radically change how they feel to run in. It’s still a really comfortable upper, but it would be interesting to see a more significant weight drop for those who might still feel the Ride might be a little on the clunky side. It wasn’t for us, but we’re sure there are some that might feel differently.",
    "The mix of cushioning that offers some pop, snug-fitting upper and durable grip gives it the kind of profile to make it well suited to a range of runners and distances from shorter distances up to marathon distance. These aren’t super performance shoes designed to smash out PBs in, but if you want something reliable and easy to throw on for most of your runs, this certainly fits the profile."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and release date",
    "6": "Design",
    "11": "Performance",
    "16": "Don't buy it if"
  },
  "links": {
    "Saucony Ride 14": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2884648657222848000&xs=1&url=https%3A%2F%2Fwww.saucony.com%2FUK%2Fen_GB%2Fsearch%3Fq%3Dride%252014&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsaucony-ride-14",
    "Ride 13": "https://www.techradar.com/reviews/saucony-ride-13",
    "running shoe": "https://www.techradar.com/best/best-running-shoes"
  }
}