{
  "source": "https://www.techradar.com/reviews/amazon-echo-show-5",
  "title": "Amazon Echo Show 5 (2019) review",
  "category": "audio-visual",
  "updated": "2021-06-16T11:54:41Z",
  "author": "henry-st-leger",
  "summary": "The show must go on",
  "verdict": "The usefulness of Alexa, and integration with WikiHow, is enough to justify the low price of the Echo Show 5, even if the lack of some features grates on us. This isn’t quite the definitive smart display, but it is one we can imagine in a lot of people’s homes.",
  "pros": [
    "Low, low price",
    "Integrated how-to videos",
    "Camera shutter"
  ],
  "cons": [
    "Low resolution",
    "No YouTube app",
    "Frustrating UI"
  ],
  "article": [
    "The Amazon Echo Show 5 (2019) is a shrunk-down version of Amazon's second-generation Echo Show, for those wanting a smaller and cheaper take on the increasingly common smart display.",
    "The smallest of the three sizes Amazon offers the Echo Show in (the Echo Show 8, has unsurprisingly an 8-inch display, while the Echo Show 10 boasts a 10-inch screen), the Alexa smart assistant is built-in - just like in Amazon's smart speakers, such as the Amazon Echo Dot – allowing for hands-free voice commands, and a way to hear information about the day’s news, weather, trivia, or whatever you can think to ask. It's almost certainly likely to be discounted on Amazon Prime Day 2021, too.",
    "There is another version of this 5.5-inch smart display you may want to consider. The Amazon Echo Show 5 (2nd generation) has an upgraded 2-megapixel camera with twice as many pixels as the previous version and comes in a Deep Sea Blue finish.",
    "Unlike an Amazon Echo speaker, these smart displays carry a touchscreen, for showing as much information, and in some cases more, as telling it out loud. Users can cycle through their own personal images, watch videos through an internet browser, or just keep up a handy clock face – because, let's face it, who has a real clock anymore?",
    "Amazon is also pitching the Show 5 as a general home companion, something to call up how-to videos and recipes as much as setting alarms. Here's what we thought of the Amazon Echo Show 5 (2019).",
    "The Amazon Echo Show 5 (2019) retails for $89.99 / £79.99 / AU$129, making it the most affordable smart display Amazon offers. In comparison, the Echo Show 8 (1st generation) costs $89.99 / £79.99/ AU$129, and the top-of-the-range Echo Show 10 is priced at $249.99 / £239.99 / AU$399.99.",
    "The Amazon Echo Show 5 launched in June 2019 and is available worldwide from Amazon.",
    "The Echo Show 5 (2019) apes the design of the Echo Show (2018), except with a more compact 5.5-inch display, around the size of a smartphone screen – hence the ‘5’ labeling.",
    "Whereas most smart displays are compared to tablets, the shape and size of the Show 5 – and its 960 x 480 resolution – means you're not getting much visually that you wouldn't from watching videos on your phone. It might be unfair to compare it to a handheld device, but the design choices here seem to be asking for the comparison.",
    "The Show 5's screen is positioned on the front at an angle, while the wedge-shaped back, which houses the speakers, is covered in the same mesh casing of the previous Show, with physical volume buttons, a mute button for Alexa, and a shutter you can physically slide over the camera lens, for the more privacy-minded among you.",
    "Along the rear is a power port – like the rest of the Echo range, you’ll need to keep the Show 5 plugged in at all times. If you’re keeping it in one place, that won’t be an issue, though if you’re hoping for a smart display you can flexibly use across different rooms in the house, this isn’t it.",
    "You do also get a micro USB port on the rear, but its intended purpose isn’t immediately clear. While it’d be handy to be able to save a plug socket near your bed and charge, for instance, a phone from the Echo Show 5, it’s unlikely you’re going to have a micro USB to micro USB cable, or micro USB to Lightning cable with which to charge an external device. A full size, powered USB port would be more useful as a result.",
    "A 3.5mm headphone jack, for more private listening, or linking up to more capable Hi-Fi equipment, sits on the back too.",
    "The Echo Show 5 (2019) has the same functions offered by Amazon's other smart displays - it can be used to listen to music streaming services, watch Netflix and Prime Video, but sadly not YouTube, and even make video calls using the built-in camera or double as one of the best home security cameras so you can keep an eye on your property when you're not around.",
    "Thanks to Amazon’s simple layout, you’re never really being shown too much information in a small space, though heading into an internet browser can be a bit fiddly.",
    "We also found the interface could be frustrating to navigate at times. There’s no physical home button, and you need to pull down a menu from the top side of the screen to find a shortcut back to the home screen. The Alexa voice assistant also can’t jump to particular menus through voice commands, meaning you’re either hands-free or hands-deep, while the things you can do through the screen are quite limited.",
    "The main feature is Alexa’s routines, which enables you to connect to other smart home devices and link them up into singular commands: such as boiling the smart kettle and playing a radio station when you get up in the morning, or dimming the lights when you’re settling in for the night.",
    "You don't get the Zigbee smart home interface of the larger Echo Show 10, though Amazon's efforts at building up compatibility with other smart home brands means you're unlikely to find yourself unable to connect different products. You'll certainly be fine with multi-room setups with other Echo devices, and there are Alexa skills for the likes of Philips Hue light bulbs or Arlo security cameras.",
    "While the Show 5 is hooked up to Vimeo for music videos, you can’t summon videos directly from YouTube, and the low-resolution screen isn’t particularly tempting for watching Netflix shows and the like.",
    "Overall, its size, form factor, and limited video capabilities make the Show 5 generally better suited as a bedside alarm clock than a kitchen companion, or as a replacement tablet. But it being tethered to one area means you’re probably going to be using it as one or the other: having to watch it go dark and then reboot every time we wanted to bring a recipe into another room was a hassle, and made us wonder why we weren’t just looking up information on our phone – which is essentially the same size, with higher resolution, and the ability to jump between apps more easily.",
    "You probably won’t be coming too much to the Echo Show 5 (2019) for your music needs. While the hands-free voice control for summoning songs, playlists, and radio stations is as handy as on any Alexa device, the output itself leaves a lot to be desired.",
    "Like the larger Echo Show, the Show 5 uses rear-facing speakers behind the display, though with a somewhat smaller output: only 1.65 x 4W instead of the larger model’s 2 x 10W wattage. It doesn’t go very loud, and the volume it does achieve is hindered by a muddy bass presentation. Listening to Cough Cough (by Everything Everything) turns the track’s varied percussion into a solid slab of identical beats, as if replacing a whole drum kit with a single bass drum.",
    "You can alter the levels of bass, mids, and trebles in the Alexa app, but they feel like slightly blunt tools, and you tend to end up removing layers of the track rather than improving the quality.",
    "The mid and high frequencies are generally clear though, making the Show 5 perfectly capable for playing podcasts, listening to radio stations, or chatting with Alexa herself.",
    "It’s impossible not to compare the Show 5 to the competition: largely because most of the competition is the rest of the Amazon range.",
    "The Lenovo Smart Clock came out shortly before the Show 5, and we awarded it four stars for its strong sound and smart capability. Unlike the Show 5, it has a basic YouTube app (even if it only shows video recommendations via your Google account), and utilizes the Google Assistant AI instead of Alexa. It’s also slightly smaller at only four inches across, and doesn’t feature a camera for video calls or have an internet browser.",
    "But which of the two you’ll want to go for will depend on whether you have Alexa or Google Assistant devices already, whether you plan on doing video calls on something other than your smartphone, and whether you really want to scrawl the net yourself on a device not really suited for it.",
    "So what did we make of the Echo Show 5?",
    "As a compact and affordable smart display, Amazon absolutely delivers. The Show 5 vastly undercuts its other screen-based siblings in price, and bundles in the full Alexa experience along with the beginnings of smart routines and a digital alarm clock.",
    "Inevitably there are corners cut in the process. The Show 5 retains the bass-heavy presentation of the Echo Show’s speakers – at a lower volume – and doesn’t offer the app integration it needs to really feel like a necessary presence in the home.",
    "But the fact remains that the Echo Show 5 is still one of the cheapest ways to get an Alexa device into your home – and bundled in with an alarm clock, basic smart home functionality, and the beginnings of some video apps, you’re getting a pretty big package for the price. This isn’t quite the definitive smart display, but it is one we can imagine in a lot of people’s homes."
  ],
  "headers": {
    "5": "Amazon Echo Show 5 price and availability",
    "7": "Design",
    "13": "Features",
    "20": "Sound",
    "24": "Other smart displays to consider",
    "27": "Final verdict"
  },
  "links": {
    "second-generation Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-review",
    "smart display": "https://www.techradar.com/best/best-smart-displays",
    "Echo Show 8": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Amazon Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Amazon Echo Show 5 (2nd generation)": "https://www.techradar.com/reviews/amazon-echo-show-5-2nd-generation",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Famazon-echo-show-5-compact-smart-display-with-alexa%2Fdp%2FB07KD7TJD6%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1316822118370014000-21",
    "Echo Show (2018)": "https://www.techradar.com/reviews/amazon-echo-show-review",
    "tablets": "https://www.techradar.com/news/best-tablet",
    "more privacy-minded among you": "https://www.techradar.com/news/new-amazon-patent-could-mean-alexa-really-is-always-listening",
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Philips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "Arlo security cameras": "https://www.techradar.com/reviews/arlo-ultra",
    "Netflix shows": "https://www.techradar.com/best/best-netflix-shows",
    "Lenovo Smart Clock": "https://www.techradar.com/reviews/lenovo-smart-clock-review"
  }
}