{
  "source": "https://www.techradar.com/reviews/amazon-echo-buds-2nd-gen",
  "title": "Amazon Echo Buds (2nd Gen) review",
  "category": "audio-visual",
  "updated": "2021-10-12T16:08:29Z",
  "author": "nick-pino",
  "summary": "The Amazon Echo Buds are back with a host of improvements",
  "verdict": "Amazon has made a number of improvements to the new Amazon Echo Buds, including a reduction in size and weight as well as bolstering its noise cancellation technology. The Amazon Echo Buds (2nd Gen) might not be able to compete with the top-tier noise-cancelling earbuds from Sony and Sennheiser even after all the new improvements, but they’re a significant improvement upon the previous generation.",
  "pros": [
    "Affordable ANC earbuds",
    "Can facilitate a perfect fit",
    "Improved sound quality"
  ],
  "cons": [
    "Bulge from the ears",
    "ANC could be even stronger",
    "Battery life is on the shorter side"
  ],
  "article": [
    "UPDATE: The Amazon Echo Buds (2nd Gen) now have a UK release date of November 10, 2021, a full six months after they launched in the US. Read on for more info below...",
    "Amazon’s audio business has been on a roll this last year. First there was the new-and-improved Amazon Echo that took sound quality to a whole new level, and now there’s the Amazon Echo Buds (2nd Gen) that could do the same for the company’s flagship noise cancelling true wireless earbuds.",
    "To make those improvements Amazon made the new Amazon Echo Buds 2’s case even smaller (by around 40%), and has taken a serious look at both its noise-cancelling technology and overall audio performance. The result is true wireless earbuds that cancel even more ambient noise than before and sound better, too – plus they’re easier to carry around.",
    "There are a few other minor changes here – like the adoption of wireless charging via any wireless charging pad and vents to reduce pressure built up in the ear – as well as some changes to the setup process that will help you find the perfect fit with the included ear tips.",
    "There are some weaknesses here compared to the best true wireless earbuds from Sony, Sennheiser, and Bose (see: lackluster noise cancellation, bulging design and potentially breakable case), but if you're looking for incredibly affordable, noise cancelling true wireless earbuds for Amazon Prime Day 2021, these are probably your best bet.",
    "The Amazon Echo Buds (2nd Gen) launched in the US on May 13, 2021 for an introductory price of $100, around $30 less than the original Amazon Echo Buds. Eventually, however, that introductory price ended and you're now looking at a $120 sticker price.",
    "We now know that the UK version is releasing November 10, 2021, a good six months after the US launch. Similarly, they're selling for just £80 at first and then jumping to £110 after an introductory period. Those who pre-order will also get six months of Amazon Music Unlimited for free.",
    "Unfortunately, no Australian release date has been announced at this point.",
    "How does that stack up against the competition? Well, even at $120, the Amazon Echo Buds (2nd Gen) are some of the cheapest noise-cancelling true wireless earbuds out there. The Bose QuietComfort Earbuds cost $279 / £249 / AU$399, while our favorite models, the Sony WF-1000XM3, come in at $170 / £170 / AU$199.",
    "There are a few cheaper true wireless models out there that we recommend (see: the Lypertek PurePlay Z3) but in terms of big flagship earbuds with some level of active noise cancellation, the new Amazon Echo Buds 2 are among the cheapest options out there.",
    "The marquee feature of the new Amazon Echo Buds (2nd Gen) is their smaller size. The buds themselves are around 20% smaller than before, according to Amazon, while the case is around 40% smaller and looks radically different.",
    "Because of the reduction in size they’re lighter overall, and therefore a bit more comfortable to wear for longer periods of time.",
    "Another key improvement is the new laser-drilled vent inside the earbuds themselves that relieves pressure build up. It’s a design feature we first saw with the Powerbeats Pro a few years ago, and now it’s basically a staple of every major pair of true wireless earbuds.",
    "Despite being smaller and certainly more comfortable to wear, the Echo Buds do extend out of your ears a little – not enough to make them look awkward, but enough for them to rub up against a hood if you’re wearing one or up against the pillow when you’re lying down. Neither of those are deal breakers outright, but they could be important factors when deciding which pair of earbuds you want to pick up.",
    "That said, if you plan to use them to work out, the Amazon Echo Buds (2nd Gen) do have two key design features that make them particularly good gym companions. The first is that they have an IPX4 rating, making them splash-proof. That means they’ll be totally fine if they get some sweat on them. The other great feature is that they come with a few different ear tip sizes in the box, and a few wings to help stabilize them in your ear during workouts. Not only does this create the great seal that you need for optimal sound performance, but it also prevents the earbuds from bouncing out when you’re running on the treadmill.",
    "Speaking of the eartips, we have to give some serious props to Amazon’s use of the external microphones during setup. Basically, the Amazon Alexa app can tell you if your earbuds have a good seal by playing a few tones and seeing how much of that leaks through to the outer microphones. It’s a small thing, but we can’t stress enough how important it is to find a good fit with earbuds, and this a great way to do it.",
    "To control the earbuds you have two options: you can either tap on the earbuds or use Alexa voice controls. Should you use the former, you can tap once to play or pause music; twice to skip to the next song or answer phone calls; and three times to go back to the previous song. By default, a long press switches between noise cancellation and audio passthrough modes, which is helpful if you need to quickly listen to what someone’s saying and you don’t want to pull out the earbuds.",
    "Alexa voice controls are straight forward – you can often simply say things like “play” or “next song” and Alexa will understand what you want – but using commands like “Alexa, turn off noise cancellation” can be a bit more finicky.",
    "Speaking of the case, it's pretty lightweight and easy to carry around in your pocket for long periods of time. The only thing we don't love about it is that the hinge of the case is fairly weak and could snap if dropped from the right height, so it's worth being especially careful with it when you have it in your hands.",
    "In terms of straight up audio reproduction, there seems to be a big improvement in terms of sound quality. In our original review of the Amazon Echo Buds, we said that the bass was heavy-handed and muddy, and mids lacked resolution across the frequency range. These issues feel significantly improved this time around, and we can now make out some key details in some of our favorite songs.",
    "For example, you can hear a real richness to Ariana Grande’s voice in The Weeknd’s Save Your Tears (Remix) that simply wouldn’t have been possible before. I Feel It Coming with Daft Punk has a wide left-right stereo separation, which is pretty impressive for a pair of true wireless earbuds. No song had as wide of a soundstage as you’d expect from a pair of open-back over-ear headphones, but there’s definitely a higher level of clarity than before.",
    "Problematically, though, they’re not hi-res by any stretch of the imagination, nor do they support any of the 3D spatial audio formats. You can find the latter on the Sony WF-SP800N that support Sony 360 Reality Audio or on the Apple AirPods Pro that support Apple’s own spatial audio format. The Amazon Echo Buds (2nd Gen) don’t support any.",
    "It’s a similar story for the Echo Buds’ noise cancellation. On one hand, there’s been a significant improvement to the way the Buds cancel sound – by Amazon’s estimates the new Echo Buds block out about twice as much sound as their predecessors. That makes sense considering the original Amazon Echo Buds featured noise reduction technology rather than outright active noise cancellation, and it’s an improvement that hasn’t gone unnoticed.",
    "The bad news is that the noise cancellation still isn’t top notch. It will certainly suffice when you need to block out household noise and you’ve got music playing at a moderately loud volume, but bring these on an airplane or the subway and we’re not sure they’d be able to fully cut out the background noise. Admittedly, the ability to do so is a feat of engineering we’ve only seen on a few earbuds and a handful of over-ear headphones, but we can’t welcome the Echo Buds into that club based on the performance we’ve heard (er, not heard?) so far.",
    "Perhaps the most surprising part of the Echo Buds' performance is that they work well for making phone calls. Friends we spoke to said that we sounded great with the earbuds and while they didn't come through exceptionally clear on our end, it was more than adequate for business calls and the like.",
    "Our last point of criticism is that, while having Alexa built into the earbuds is nice and can be a real time-saver, we wish there was a faster way to access our default voice assistant without having to go into the settings and set that up. Thankfully, however, Amazon makes the option available through Alexa app, so it's not a huge hassle to setup.",
    "Battery life seems to be just fine – but not anything special. Amazon claims that the Echo Buds should last about five hours per charge with ANC turned on and voice detection enabled, and the case should have enough charge for another 10 hours. That number seems accurate to us based on our usage – we listened to them for over a dozen hours and the case still had about 5% charge left.",
    "While we wish they lasted a little bit longer, that five-hour-per-charge battery life seems to be about the going rate for active noise-cancelling earbuds right now.",
    "If you need the extra juice, you can do a bit better if you drop the ANC and always-listening assistant features (you’ll get around 6.5 hours that way), but even then the Echo Buds’ battery life isn’t nearly as good as class leaders like the Samsung Galaxy Buds Plus, which offer 11 hours of playback per charge and an extra 11 inside the charging case."
  ],
  "headers": {
    "5": "Price and release date",
    "10": "Design",
    "19": "Performance",
    "26": "Battery life",
    "29": "Don't buy them if..."
  },
  "links": {
    "now have a UK release date": "https://www.techradar.com/news/the-new-echo-buds-are-finally-coming-to-the-uk-but-will-black-friday-hamper-sales",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Amazon Echo Buds": "https://www.techradar.com/reviews/amazon-echo-buds",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Lypertek PurePlay Z3": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "Sony WF-SP800N": "https://www.techradar.com/reviews/sony-wf-sp800n",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Samsung Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus"
  }
}