{
  "source": "https://www.techradar.com/reviews/doogee-v10-rugged-smartphone",
  "title": "Doogee V10 rugged smartphone review",
  "category": "phones",
  "updated": "2021-10-18T21:18:25Z",
  "author": "desire-athow",
  "summary": "In an increasingly competitive market, differentiation becomes a major challenge",
  "verdict": "The Doogee V10 manages to carve out a niche in the crowded rugged smartphone market. It is keenly priced and will be of particular interest to those looking for a solution that has a longer than average battery life as well as wireless or fast charging.",
  "pros": [
    "Infrared camera",
    "Good performance in this price range",
    "Solidly built",
    "Very well priced",
    "Battery capacity"
  ],
  "cons": [
    "No support for memory card",
    "Low screen resolution"
  ],
  "article": [
    "Doogee introduced a new line of flagship rugged smartphones eschewing the S-prefix for the V one. The first in line is the V10, a 5G smartphone that ticks almost all the right boxes but aims to be a crowd pleaser thanks to a great price tag.",
    "Unlike a lot of its rivals, Doogee has kept things simple by reusing the same design as previous models while cutting some corners (like reducing the screen resolution and removing support for microSD memory cards) while adding to others (a bigger-than-average battery and an infrared thermometer). Fast charging and wireless charging are welcomed additions as well.",
    "The Doogee V10 is cheapest at online retailer Banggood at the time of writing, for as little as $260, a 24% discount of its suggested retail price of $340 and a $140 saving off its $400 price tag at Amazon US. It is available in three colours (olive green, red and gray). Just bear in mind that buying hardware from South East Asia comes with some strings attached. Other than the obvious import tax-related issues are potential problems linked to lack of firmware updates, after sales and levies raised by courier companies for handling the packages.",
    "As expected the V10 is IP68, IP69-K and MIL-STD-810G rated; one can therefore guess that the design will follow a certain pathway. An industrial finish that mixes plastic, rubber and metal to make it more robust and protect the more fragile components.",
    "The front of the device is occupied by a 6.39-inch HD+ screen covered with Corning Gorilla Glass and what looks like an oleophobic layer that mitigates smudges. The top left of the screen contains a pinhole 16-megapixel camera sensor, courtesy of Samsung.",
    "At the back are four sensors arranged on a raised octagonal island, in a 2x2 matrix and consisting of a 48-megapixel main camera, an 8-megapixel wide angle camera, a 2-megapixel portrait camera - all Samsung sourced - and an infrared thermometer.",
    "The right hand side of the device houses a fingerprint scanner, the power button and a volume rocker. The opposite side contains the dual SIM tray as well as a customizable button. The Type-C USB port is covered with a flap and there’s no 3.5-inch headphone jack.",
    "A word on the dimensions of the beast; the size of the display and the capacity of its battery means that this was never going to be a small smartphone. At 199 x 184 x 37mm for a weight of 340g, it is a chunky bit of technology.",
    "The Doogee V10 comes with the standard hardware you’d expect from a rugged smartphone within that price bracket. There’s a Mediatek Dimensity 700 system-on-chip with 8GB of LPDDR4 memory and 128GB onboard storage (using the more recent UFS 2.2 technology). Sadly, you can’t upgrade the onboard storage using a microSD card.",
    "At 8,500mAh, the onboard battery is far larger than what we usually encounter in this price range and the presence of a 33W fast charger and a 10W wireless charging put the V10 squarely in the “very good” category when it comes to power. Doogee claims that the battery can be charged in less than an hour using the fast charger, something we haven’t tested.",
    "No surprises when it comes to connectivity. There’s Wi-Fi 5, Bluetooth 5.2, NFC and an FM radio. Other than the 33W charger and the USB cable, there’s a sling cord and two screen protectors.",
    "The V10 can easily be used with one hand but just bear in mind that it is heavy. The features and apps that are worth noting are the system manager, a child mode and a game mode but no simplified mode for elderly users. And to complement the lot, an ubiquitous tool bag that contains a number of virtual tools aimed at those working out in the field.",
    "The low screen resolution (1560 x 720 pixels) should improve battery life and reduce the strain on the GPU when dealing with resource hungry tasks. The thermometer app is intuitive and can measure temperatures of both people and objects and seems to be smart enough to differentiate between the two.",
    "The V10 subsystem is supercharged, scoring some of the highest storage numbers we’ve seen in recent times including breaking Androbench’s sustained read speeds with a score of 1GBps. While that will not improve gaming performance which remains average at best, it does enhance the overall user experience.",
    "Overall, it was one of the better Mediatek-based rugged smartphones we’ve tested, scoring above average numbers in most benchmarks.",
    "Buy it if:",
    "You want an affordable 5G with a big battery rugged smartphone",
    "There’s plenty of reasons why you’d want to have a rugged smartphone with a big battery and 5G connectivity. Being able to use it as an outdoor mobile hotspot comes to mind, a particularly enticing proposition especially as it can be weatherproofed thanks to its wireless charging capabilities.",
    "A smart thermometer with a long battery life is a must have",
    "While the WP13 matches the V10 (including the thermometer), it doesn’t offer wireless charging and its battery is significantly smaller. However the 13% premium or the much bigger battery might be enough to sway undecided consumers either way.",
    "Don’t buy it if:",
    "Rock solid aftersale support is essential",
    "Chinese smartphone vendors with no local presence can be a bit of a pain should you hit a snag. The lack of commitment to firmware updates as well can be a major downside if businesses are considering buying these products. Bear in mind though that only a few rugged smartphone vendors offer the level of support expected from the likes of Samsung or Xiaomi."
  ],
  "headers": {
    "0": "Two minute review",
    "2": "Pricing and availability",
    "3": "Design",
    "8": "Hardware",
    "11": "Performance and in use",
    "15": "Should I buy the Doogee V10?"
  },
  "links": {
    "rugged smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "5G smartphone": "https://www.techradar.com/best/best-5g-phones",
    "Doogee V10": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-6364189058103975000&ulp=https%3A%2F%2Fwww.banggood.com%2FDOOGEE-V10-Global-Bands-Dual-5G-IP68andIP69K-8GB-128GB-Dimensity-700-NFC-Android-11-8500mAh-6_39-inch-48MP-AI-Triple-Camera-Octa-Core-Rugged-Smartphone-p-1889522.html%3Fcur_warehouse%3DHK%26ID%3D63127176246444%26rmmds%3Dsearch",
    "$400 price tag at Amazon US": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FDOOGEE-V10-Smartphone-Dimensity-Thermometer%2Fdp%2FB09B23ZSBV%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5543213511358249000-20",
    "mobile hotspot": "https://www.techradar.com/news/best-mobile-hotspots-for-3g-4g-and-5g"
  }
}