{
  "source": "https://www.techradar.com/reviews/sofi-invest-crypto-trading-platform",
  "title": "SoFi Invest crypto trading platform review",
  "category": "computing",
  "updated": "2021-02-17T15:48:17Z",
  "author": "mayank-sharma",
  "summary": "An easy to use platform for trading crypto",
  "verdict": "As long as you are comfortable with its limitations, SoFi Invest provides a solid option for trading cryptocurrency.",
  "pros": [
    "Cheap to operate",
    "Intuitive interface",
    "Mobile app"
  ],
  "cons": [
    "Only available to US residents",
    "Limited range of cryptocurrencies",
    "Transactions only in USD",
    "Cannot move crypto to private wallets"
  ],
  "article": [
    "SoFi is a San Francisco-based company that first came to prominence for refinancing student loans. Founded a decade ago, the personal finance firm now boasts a user base of more than one million users.",
    "The company’s investment platform, SoFi Invest, allows members to invest in a range of products, including stocks and equity-traded funds (ETFs). The platform, which is currently available only to US residents, is popular among traders especially because of its $0 fee for stock trading.",
    "In September 2019, SoFi also added the ability to trade cryptocurrencies, specifically Bitcoin, Bitcoin Cash, Ethereum, Ethereum Classic, and Litecoin. The platform uses Coinbase to handle all crypto transactions on behalf of its users.",
    "SoFi extends some of the same benefits to its crypto trades that it does to users of its traditional investment products. For instance, it requires no account minimums. However, the minimum order size for purchasing crypto is $10, while on the other end of the spectrum, SoFi users can purchase a maximum of $50,000 worth of crypto per day.",
    "SoFi charges a markup of 1.25% on every crypto transaction. That means when you purchase crypto, SoFi will automatically add the markup to the market price it receives from the exchange. It's also important to note that SoFi will only allow you to submit market order trades.",
    "When it comes to sales, the platform does have a few minimum restrictions. For instance, the minimum Bitcoin sale amount is 0.001 BTC. For Bitcoin Cash it is 0.01 BCH, for Ethereum 0.01 ETH, for Ethereum Classic 0.1 ETC and for Litecoin 0.1 LTC.",
    "The platform also has an ongoing promotion whereby it will give you $10 in Bitcoin when you buy at least $10 worth of any cryptocurrency within seven days of registering with the platform.",
    "To get started with SoFi, you’ll first have to register with the service, which involves creating an account and sharing various details to establish that you are a legal US resident. This involves sharing details such as your physical address, contact details, Social Security Number and such.",
    "Remember that while you can explore the platform without completing the application form, you’ll need to divulge these details before you can buy, sell or trade cryptocurrencies.",
    "Once you’ve created the account you’ll first have to link your bank account. Once that’s done you can transfer funds to your account, but SoFi requires them to remain in the account for one business day before you can purchase crypto.",
    "SoFi’s dashboard is fairly intuitive and easy to navigate. While it only allows you to trade the five cryptocurrencies mentioned earlier in the article, you can track the price movements of several popular altcoins too.",
    "The platform also enables you to buy crypto by specifying the amount in USD instead of the crypto units. Also since SoFi places market orders, the crypto is bought and sold in real-time.",
    "Note, however, that SoFi is a pure investment platform, which means you cannot transfer the crypto you’ve bought to an external wallet, nor can you use it for payments.",
    "SoFi claims that it secures all crypto holdings from fraud and theft. However, it doesn’t share more details about these mechanisms or if they come with certain limits.",
    "It should be noted that SoFi relies on an external exchange to complete its crypto transactions. This happens to be Coinbase, which takes pride in its security and insurance cover. Furthermore, SoFi claims that it doesn’t share its user’s personal information with its crypto trading partners and custodians.",
    "When it comes to SoFi Invest, the investment platform, the company claims it uses a number of tools to secure the holdings of its members, such as two-factor authentication and SSL encryption.",
    "The platform has a vast set of documentation to cater to its multitude of financial products. The SoFi Learn section will help users acquaint themselves with the various services offered by the platform.",
    "The information under the SoFi Learn section is designed to equip users with everything they need to know about a particular financial product. For instance, under Investing you’ll find educational material that covers everything from the basics of investing to helping you manage your money during a recession.",
    "You can use the search function to dig up articles related to any topics or financial instruments that interest you. A search for crypto brings up over 60 articles that cover various topics to help enhance your knowledge of cryptocurrencies.",
    "For platform-specific help, you should head to support.sofi.com, which helps users get to grips with the various products and specific features of the platform. Again, a search for crypto will bring up about two dozen results that will familiarize you with everything you need to know about trading crypto on SoFi.",
    "Besides the documentation, SoFi also offers online chat and phone support. It lists different phone numbers for its various products, along with their respective hours of operations.",
    "Unlike typical cryptocurrency exchanges like Coinbase, SoFi is an investment-only platform. This means that any cryptocurrency you buy on the platform cannot be used as payment or transferred to someone else’s wallet.",
    "Furthermore, as we’ve said before, unlike other crypto exchanges like Coinbase, you’ll not be able to move any crypto in your SoFi Invest account to an external wallet. Being a closed system also means that you won't be able to move your existing crypto into the platform for trading.",
    "SoFi claims that having a closed system helps it better secure your crypto assets, though you should be aware of the limitations that come with it.",
    "Also, the only fiat currency SoFi can handle is the US dollar, seeing as it is only available to US residents. To help establish that you are a legal citizen of the country, SoFi will ask you to furnish various details. This is to be expected from all good crypto exchanges and trading platforms and in turn gets you federal protection and safeguards for your funds.",
    "SoFi isn’t a full-fledged crypto exchange, in fact, it relies on Coinbase for conducting crypto transactions on its behalf. It’s markup is higher than some of its peers, but the overall transaction is at par or probably cheaper than some alternatives since SoFi doesn’t charge any fees for many functions.",
    "It’s because of this very reason that SoFi makes for an attractive option for trading crypto. As long as you know that you’ll not be able to move your crypto inside or outside your SoFi Invest account, the platform offers a cheap, and easy to use option for conventional traders looking to dabble in crypto."
  ],
  "headers": {
    "3": "Fees",
    "7": "Interface and ease of use",
    "13": "Security",
    "16": "Support",
    "21": "Alternatives",
    "25": "Final verdict"
  },
  "links": {
    "SoFi": "https://www.sofi.com/",
    "personal finance": "https://www.techradar.com/best/best-personal-finance-software",
    "trade cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "Bitcoin": "https://www.techradar.com/news/best-bitcoin-wallets",
    "Ethereum": "https://www.techradar.com/news/what-are-altcoins-everything-you-need-to-know",
    "Coinbase": "https://www.techradar.com/reviews/coinbase-cryptocurrency-exchange",
    "exchange": "https://www.techradar.com/best/mining-rigs",
    "altcoins": "https://www.techradar.com/news/what-are-altcoins-everything-you-need-to-know",
    "wallet": "https://www.techradar.com/news/best-bitcoin-wallets",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa"
  }
}