{
  "source": "https://www.techradar.com/reviews/hisense-u6g-uled-tv",
  "title": "Hisense U6G ULED TV review",
  "category": "televisions",
  "updated": "2021-09-09T14:02:30Z",
  "author": "christian-de-looper",
  "summary": "Could the Hisense U6G be the new budget TV king?",
  "verdict": "If you’re looking for bells and whistles, the Hisense U6G isn’t the TV for you – but if all you care about is a good viewing experience at a great price, you’ll get it here.",
  "pros": [
    "Excellent image quality",
    "Android TV is solid",
    "Inexpensive"
  ],
  "cons": [
    "Remote is a bit much in 2021",
    "Buy a soundbar"
  ],
  "article": [
    "The Hisense U6G doesn't have all the fancy bells and whistles that you'd expect from more expensive options, but still offers superb image quality for a TV in its price range.",
    "Those features include support for both Dolby Vision and HDR10+ alongside other HDR options. The U6G also offers up to 600 nits of brightness, which is fine for most environments, and while panels on this TV may not be the most consistent, under normal viewing you'd be hard pressed to notice blooming or blotchy image quality.",
    "The Hisense U6G comes with Google’s Android TV, which is only getting increasingly responsive as TVs get more powerful. It’s a decent option here, and while you may still have to wait a second or two every now and then for it to catch up, such instances are few and far between.",
    "At a starting price of $500 (around £360 / AU$670) for the 50-inch model, the U6G is tough to beat in this price range, especially if you like Android TV or plan on using an external streaming device. Most competitors either don’t offer local dimming, don’t get as bright, or offer an inferior software experience.",
    "The Hisense H6G is the cheapest in the Hisense 2021 TV lineup. It starts at just $500 (around £360 / AU$670) for the 50-inch model, and ranges up to $1,100 (around £790 / AU$1,470) for the 75-inch model. You can buy it now from the Hisense website and Best Buy.",
    "Here are the complete model names and prices:",
    "The Hisense U6G may sit at the budget end of the company’s revamped TV lineup, but it still offers a solid design. No, it’s not as premium-looking as a much more expensive TV might be, but bezels are still relatively slim, legs are sleek and stylish, and in general, the TV looks good. The bezels, legs, and everything else, are made from black or dark gray materials, and it generally looks good.",
    "The legs themselves are made from plastic, unlike some other TVs in this price range; however, it’s not a cheap plastic and should still be able to hold the TV up perfectly fine. It doesn’t look cheap from a distance or at a glance, so guests won’t be able to tell that there’s plastic involved unless they get up close and personal.",
    "On the back of the TV, you’ll get all your ports and connections. The TV offers a total of four HDMI ports, three of which are side-facing and one of which is back facing. You’ll also get an optical output for audio, two USB ports for power, an Ethernet port, and AV in ports. It’s a solid selection of ports, and more than enough for streaming devices, gaming consoles, and so on.",
    "The remote’s design is perfectly fine, but it’s a bit dated. In a world of stripped-back Apple TV and Google Chromecast remotes, the U6G’s remote is a little intimidating. You’ll get full channel controls, software controls, Google Assistant controls, quick-access buttons for six streaming services, volume controls, and so on.",
    "Generally speaking, the Hisense U6G and the remote offer a solid design. This is a budget TV and you won’t get an overly premium design – but the design that is here will still look good in most homes.",
    "The Hisense U6G ships with Android TV, which integrates excellently with Google’s ecosystem of products, and at this point in time, works pretty well. There were years when Android TV worked slowly and poorly on any but the highest-end TVs, but that has thankfully changed over the past year or so. Admittedly, streaming devices like the Apple TV 4K is still far more responsive, but you’ll be able to make your way around Android TV relatively easily.",
    "The remote offers controls for your smart TV, but the way it controls your TV out of the box isn’t all that smart. By default, it works through infrared, which means that it requires line-of-sight but to use some of the smart features, like Google Assistant, you’ll be prompted to pair the remote through Bluetooth. It’s a little weird that you have to pair the remote manually and it really should be paired out of the box.",
    "For the uninitiated, Android TV basically offers a row of apps at the top of the UI, along with rows of content for each app under that. It’s a solidly designed interface, and if you’ve never used it before, you’ll get used to it.",
    "App support, similarly, is quite good. Android TV supports most major apps including Netflix, Hulu, HBO, YouTube and others and there's even recommendations based on shows and films you've previously watched.",
    "Hisense’s ULED technology has been a hit – ULED TVs offer bright, vivid colors and deep black levels on a budget, and the Hisense U6G is no exception to that rule. The TV offers a 4K resolution, support for Dolby Vision, HDR10+, and HLG, and 60 local dimming zones to ensure deeper, more natural black levels.",
    "The H6G is at the low end of Hisense’s new TV lineup, but it still offer an excellent image quality for a TV in its price range.",
    "The TV offers a range of image modes for different viewing preferences. Out of the box you’ll get seven HDR modes, including a game mode and a sport mode. Most of the time, I kept it on HDR Standard, which offered more than enough brightness for my usually-dark living room. If you feel comfortable doing so, we would recommend experimenting with the viewing modes to find the best for your situation.",
    "So what are the trade-offs for buying the lowest-end TV in Hisense’s new range? Well, while 60 dimming zones is fine, it’s not amazing — and you’ll get more on Hisense’s more expensive offerings. This should make for less blooming — on the U6G there was some blooming around bright objects, especially near the edges of the display. You’ll get a more consistent experience. On the U6G there was some splotchiness, again especially near the edges.",
    "But the truth is that without an eagle-eye, and in regular viewing you’re unlikely to really notice these issues, and given the price range, the TV still displayed beautifully bright, vivid, and contrast-y images.",
    "Now, the TV doesn’t do much more than offer an excellent image quality. That’s to say, shell out a little more and you can get the U7G, which has the 120Hz panel, HDMI 2.1, and VRR tech that might appeal to gamers. If you’re looking for bells and whistles, the Hisense U6G isn’t the TV for you – but if all you care about is a good viewing experience, you’ll get it here.",
    "Watching HDR-supportive content like Apple TV+’s Tiny World was an immersive, beautiful experience. Watching lower-resolution content is a decent experience too. The TV’s upscaling tech is pretty good, and while not amazing, you’ll definitely forget that you’re not watching 4K content as long as the original source is 1,080p or so.",
    "The Hisense U6G is a visual powerhouse in the price range – but what about audio? Well, it does the job, but as is usually the case with budget TVs, if you afford to buy a pair of speakers or a soundbar, you should do so.",
    "Now, that’s not to say that the audio quality here is terrible. It’s now, and in fact, without having a previous-gen Hisense TV to compare the U6G to, it does seem like Hisense’s budget TVs are getting better.",
    "The speakers in this TV can get super loud – so much so that I rarely went above the 15 level except for testing purposes. At higher volumes, you will run into some distortion, but under normal listening it’s not bad. You won’t get a lot of bass, nor will you get much detail in the high-end, but as mentioned, the speakers here will do the job in a pinch."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "6": "Design",
    "11": "Smart TV (Android TV)",
    "15": "Picture quality",
    "22": "Audio Performance",
    "25": "Don’t buy it if..."
  },
  "links": {
    "Hisense 2021 TV lineup": "https://www.techradar.com/news/new-hisense-tv-2021",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008"
  }
}