{
  "source": "https://www.techradar.com/reviews/garmin-forerunner-45",
  "title": "Garmin Forerunner 45 review",
  "category": "fitness",
  "updated": "2021-06-04T14:50:51Z",
  "author": "kieran-alger",
  "summary": "The Garmin Forerunner 45 is a surprisingly well-featured affordable running watch",
  "verdict": "In terms of bang for buck, the Garmin Forerunner 45 is one of the most impressive running watches out there right now. You’ll be hard-pressed to find a more comprehensive device for this price. Yes, it has gaps and compromises, but it also sets the standard for features we now expect in our lower end watches. An excellent entry-level option.",
  "pros": [
    "Lightweight",
    "Good value",
    "Music controls"
  ],
  "cons": [
    "Limited sport profiles",
    "Plastic-heavy build",
    "No real swim tracking"
  ],
  "article": [
    "The Garmin Forerunner 45 is one of the best running watches in its price bracket could be just the ticket if you're in the market for an entry-level GPS fitness tracker.",
    "The Garmin Forerunner 45 is an upgrade to the budget-friendly Forerunner 35, and this new model still offers simple, no-frills run tracking in a pared-back watch. But it now comes with some of the training and wellness features we are used to seeing in watches much higher up the Forerunner food chain.",
    "In addition to built-in GPS, you get an optical heart rate monitor, adaptive training plans, VO2 max, activity and sleep tracking, Body Battery energy level monitoring, stress tracking, music controls, smart notifications, and some very neat safety features such as live tracking and incident detection.",
    "There’s a lot here for the price tag, so could even serious runners save themselves some cash by opting for this lower priced option? We’ve put the Forerunner 45 through its paces to find out.",
    "If you want something closer to a smartwatch, the newer Garmin Venu Sq is well worth considering. It has a slim, stylish design, a good range of fitness tracking profiles with on-board GPS, and a pulse ox sensor. It's a little more expensive though, so if you don't need the frills then the Forerunner 45 is likely the better option.",
    "With a £169.99 / $199.99 / AU$299.00 price tag at launch the Forerunner 45 is one of the cheapest Garmin watches and sits in the middle of the budget running watches bracket alongside the likes of the Polar M430 and the Coros Pace.",
    "The Forereunner 45 was released in April 2019, so we may see a Forerunner 55 in 2021, but there's no information on such a launch just yet.",
    "There are actually two Forerunner 45 versions: the standard 45, which has a 42mm case, and the 45S with a slightly smaller 39mm case, suitable for those with smaller wrists. Even the 42mm case is much smaller than most other running watches though.",
    "Both fitness trackers feature a 1.04-inch, 208 x 208 color display. Clearly, you’re not going to get Apple Watch resolution at this price, but the screen is clear and bright, and the colors, while limited, do help make it easier to read your stats and make the whole thing feel a bit cheerier.",
    "Garmin’s recognizable five-button control setup is here too with buttons for start/stop, back, up and down, and a backlight. Anyone who has used a Garmin in recent years will find this nicely familiar, and it’s one of the most intuitive menu and navigation structures you’ll find on any running watch.",
    "The Forerunner 45 is incredibly lightweight at between 32-36g, depending on the size you choose. That’s mostly due to the plastic frame and buttons, and the soft silicone strap that some might find a little cheap.",
    "But the bonus here is that it’s a decent comfortable watch to wear 24/7. If we had one bugbear it was that the strap slider would, well, slide off, leaving the end of the strap flapping around from time to time.",
    "The Forerunner 45 is waterproof to 50 meters, so you can swim with it, though there are no swimming features here.",
    "In the box you also get Garmin’s hopefully-now-standard four-pin USB charging cable. It’s a small thing but it means you can now use most of the charging cables from other Garmin watches to this juice up. That’s very handy indeed.",
    "You get a lot of features for under $200/£200. If you just run for fitness and want to cover the basics, the 45 now gives you more than enough. This will definitely take you from couch to 5km and probably even up to the marathon.",
    "If you’re really into the science of training and running, you’ll probably want to go higher end for more metrics and insights, but as a cheap way to track runs and monitor fitness, this is a very solid offering.",
    "The major focus here is on running – this is primarily a running watch – but there are 12 activity profiles including running, treadmill, indoor track, bike, cardio and walk.",
    "These are customizable via the Garmin Connect app, but it was a little frustrating to find you can only have six on the watch at any one time. You have to choose which in the app.",
    "The watch has memory to store 200 hours of training data, though it syncs automatically via your smartphone with Garmin Connect, so it’s unlikely you’ll ever test that limit.",
    "One standout feature, particularly when you factor in that this watch is largely aimed at beginner runners, is Garmin Coach. This offers adaptive training plans set by expert coaches for 5km, 10km and half marathon.",
    "You get to choose your goal whether that’s hitting a time or just completing, and you can drop in info such as your preferred run days, and current mileage/pace.",
    "The training plans are wonderfully easy to set up in Garmin Connect. It takes minutes to do and we loved the fact that the workouts you do are all based on your recent performances. So the first session is a Benchmark Run that then dictates the whole plan.",
    "In our tests we found the plans to be generally sensible, easy to follow with the sessions sent to your watch, and they genuinely switched up based on what we managed to do during the week. For example if we had to do a shorter run than planned or we didn’t quite hit the targets, our future workouts shuffled accordingly.",
    "It’s unlikely that you’d want to use this if you’re at the level of attempting a sub 1:15 half, but if you’re training for your first distances and races, this is a really handy feature indeed.",
    "If you’re just running to build fitness, the Forerunner 45 will now offer estimate VO2 max which you can use to chart your progress.",
    "When it comes to running form metrics, in addition to the usual pace, distance and speed, you also get cadence, probably the most important running mechanics metric for beginner-intermediate runners looking to improve.",
    "As with most running watches these days you get 24/7 activity tracking and step counts. There are optional move alerts that prompt you to get up and get mobile if you’ve been sedentary for long periods, while the Move IQ feature can spot if you’re running, cycling or swimming and will flag this activity in your reports to show how you clocked your active time.",
    "You can also set goals for the number of intensity minutes and your daily step targets.",
    "Another pair of Garmin’s newest features, Body Battery and stress tracking, are also packed into the Forerunner 45. Body Battery uses a combination of stats such as heart rate, sleep and activity to show you – as a score out of a 100 – how much energy you’ve got at any point during the day. Body Battery low? Sit quietly for 15 minutes and you’ll restore some power.",
    "Likewise the stress tracking takes heart rate readings into account and shows your stress level at any given moment. When we were on deadline for this piece, ours rose and we also found it registered higher levels when we did things like a big work presentation. As such it’s a useful tool for spotting stress triggers."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Garmin Forerunner 45 price and availability",
    "7": "Garmin Forerunner 45 design and screen",
    "14": "Garmin Forerunner features, app and usability"
  },
  "links": {
    "best running watches": "https://www.techradar.com/best/running-watches",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "heart rate monitor": "https://www.techradar.com/best/best-heart-rate-monitor",
    "Garmin Venu Sq": "https://www.techradar.com/reviews/garmin-venu-sq",
    "Garmin watches": "https://www.techradar.com/best/garmin-watch",
    "Polar M430": "https://www.techradar.com/reviews/polar-m430",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch"
  }
}