{
  "source": "https://www.techradar.com/reviews/new-ipad-102-2020",
  "title": "New iPad 10.2 (2020) review",
  "category": "tablets",
  "updated": "2021-06-14T15:15:56.156Z",
  "author": "james-peckham",
  "summary": "Apple's newest iPad is more of the same, but that's okay",
  "verdict": "The new iPad 2020 is great value for a brand-new iPad, even if it is only a modest upgrade over last year's version. It comes with a faster chipset and a 20W fast charger in the box, which join prior-year features like Apple Pencil and Smart Keyboard support. Best of all, the price hasn't changed year-on-year, making this the best iPad for those who don’t need Apple’s technologically best iPad.",
  "pros": [
    "Excellent value",
    "Strong performance",
    "20W charger included"
  ],
  "cons": [
    "Very little change",
    "Only 1.2MP selfie camera",
    "32GB of storage is pitiful"
  ],
  "article": [
    "The new iPad 2020 is Apple's best version of its entry-level iPad yet, and even though it hasn't changed much from the previous year's iPad 2019, it plays an important role as the iPad Air has gotten more expensive. To that point, it’s the easiest iPad for us to recommend to the average person.",
    "Value, not just price, is the key reason to buy the 10.2-inch iPad 2020, because it shares a lot of features with more expensive iPads: access to the same games and apps, compatibility with the Apple Pencil and Smart Keyboard and support for iPadOS 14.",
    "You could get the 2020 iPads cheaper than the asking price during Amazon Prime Day 2021 on June 21, which will see loads of discounts via Amazon (and a few other retailers which will kick off competing sales). Check back during the event as we'll highlight all the best deals on iPads, accessories, cases and more.",
    "It stands in stark contrast to the iPad Air 4, which sports a refreshed design, artist-friendly 10.9-inch laminated screen, and superior performance. All that seems tempting, but the price gap between the entry-level and ‘middle’ iPad classes has widened even further than in previous years. So while the new iPad 2020 looks like a relatively uninspiring proposition, it remains wholly value-driven.",
    "And there are a couple of new perks to ensure that what's technically the 'iPad 8' is more than just a rehash. In the box is a 20W power adapter for fast charging via a USB-C-to-Lightning cable, while running the show is the A12 Bionic chipset, which offers a solid specs bump that should see this iPad feel current for several years to come.",
    "Support for Apple's Smart Keyboard and Apple Pencil (sold separately) enhance the value proposition of the iPad 2020, as does its stellar 10-hour battery life. And then there’s the operating system: iPadOS 14 is a standout software update that deserves recognition, with new features – Scribble in particular – helping to make Apple’s stylus worth the extra fee.",
    "In the ‘compromises’ column, storage starts at a measly 32GB – you'll want to buy the 128GB model if you want to store and edit photos and videos. But it's still hard not to be impressed with this 'basic' iPad if the iPad Pro or iPad Air are out of your budget.",
    "Your perspective on the new iPad 10.2 (2020) will depend on how closely you’ve followed the iPad evolution over the years. Apple fans will lament the fact that the cheapest iPad hasn't seen much of an upgrade, aside from a more powerful and efficient chipset.",
    "However, while it’s reasonable to hanker for new, revolutionary changes when it comes to the flagship iPad Pro range, which costs over a thousand dollars in some cases, the new iPad 10.2 is designed for less demanding users.",
    "This is an iPad for someone who hasn't bought an iPad in a while, and who wants to get a replacement on the (relatively) cheap, or someone buying their first iPad. Apple's goal is to make sure such people buy its latest model – hence the aforementioned faster chipset and included fast charger – rather than going for an older model on sale at another retailer.",
    "Update: The newest entry-level iPad is getting iPadOS 15 when it rolls out towards the end of 2021. This new operating system update brings improvements to the Notes app, improved multitasking and widgets, and an app library.",
    "The iPad (2020) starts at $329 / £329 / AU$499 for 32GB storage, but the prices go up quite a bit if you want 128GB storage, or an LTE connection, or both. The 128GB variant without LTE costs $429 / £429 / AU$649.",
    "That’s an affordable price, especially when you compare it to the price of the iPad Pro range, or the also-new iPad Air 4, which starts at $599 / £579 / AU$899 – and as it’s only recently been launched don’t expect to see a lot of discounts over Black Friday.",
    "The iPad 10.2 (2020) release date was Friday, September 18, so if you want to head out and buy one, you can do so right now. You can buy directly from Apple, or from major retailers.",
    "The new iPad isn’t all that new in terms of design. In fact, it looks and feels almost exactly the same as the iPad from 2019, although that’s not per se a bad thing. The design is sold enough for this price point, even though it may feel a little dated when compared to Air and Pro iPads.",
    "There’s a 10.2-inch display – more on that in the screen section below – with thick bezels all around. The top bezel houses the selfie camera, while the home button, with a built-in Touch ID sensor, is on the bottom lip.",
    "This doesn’t feel as top-end as the iPad Pro’s Face ID biometric security, but it still works well and gives you an option to unlock your tablet with a press of a thumb or finger. We found the fingerprint scanner to work quickly, and it was accurate in our testing.",
    "There are some clear trade-offs in terms of the design, as there are elsewhere. This iPad has two speakers, but they’re both on the bottom and face the same direction – it’s functional, but not as impressive as stereo speakers. Similarly, the Lightning connector on the bottom of the tablet suddenly feels archaic, with the new iPad Air and iPad Pro both using USB-C like a 'proper' computer to ensure compatibility with a wider range of activities.",
    "The Air and Pro also support the more laptop-like Magic Keyboard, with trackpad and clickable keys, rather than the more rudimentary Smart Keyboard. However, if you're looking for an iPad that will enable you to enter text, read handwriting, sketch digitally and interact with a mouse, the new iPad 10.2 can do all these things.",
    "You’ve got the choice of silver, Space Gray or gold colors, which are the same options we’ve seen over the last few years. You’ll have to buy the Air for the bold new Sky Blue, green and Rose Gold colors. Dimensions-wise, the tablet is 250.6 x 174.1 x 7.5mm, and the Wi-Fi version weighs 490g, while the LTE variant is a touch heavier at 495g.",
    "The design of the new iPad isn’t remarkable, and it does feel a touch dated in a few ways, but considering the price of this tablet it isn’t a big surprise that Apple has kept with the same look for another year – and you’re unlikely to be too disappointed.",
    "As you’ve learnt in the title of this review, the new iPad features a 10.2-inch display.",
    "It seems that Apple has settled on this for the optimum screen size for its most affordable tablet, after upgrading it from 9.7 inches to 10.2 inches for the 2019 generation. You’re gaining a modest half-an-inch of screen real estate if you’re upgrading from a basic iPad 2018 or earlier.",
    "Apple also increased the brightness to 500 nits, which was noticeable when we compared this iPad to last year’s version. You may not realize it without comparing the two side by side, but it’s a useful upgrade using an iPad outdoors in the daytime.",
    "What you’re not getting is Apple’s fancy Liquid Retina display and laminated display process, as seen in more expensive iPads. Oh, the iPad 2020 has a perfectly fine resolution of 2160 x 1620, but the refresh rate remains 60Hz instead of 120Hz, and the LED screen isn’t tightly pressed up against the top glass.",
    "There’s a noticeable gap between the display panel and glass, and, more than anything, that makes the 10.9-inch Air and 11- and 12.9-inch Pros better options for anyone serious about sketching with the Apple Pencil. Anyone looking for a basic cheap iPad probably won’t notice.",
    "The iPad 10.2 has an upgraded chipset compared to the last two iPad models with Apple’s A12 Bionic processor. It’s not Apple’s latest, having first Z debuted in the iPhone XS and iPhone XR smartphone, but a solid replacement for the last-gen iPad’s A10 Fusion chipset.",
    "What does that mean for you? It means improved performance on this newest iPad, although it’s not going to be a gamechanger – this tablet won’t be as speedy as the iPad Air 4, which touts the new A14 Bionic chipset, or one of the most recent iPhone models.",
    "That said, we found the new iPad to be quick enough for everything we needed it to do. Apps loaded quickly, and we didn’t experience any slowdown during our time with the tablet.",
    "If you’re looking to multitask – something iPadOS now allows you to do – you may find your iPad will slow down a little, but this should still be capable of doing everything you want it to. It’s thought the tablet also has 3GB of RAM, although Apple has yet to officially confirm that.",
    "You’ve got the option of 32GB or 128GB for storage sizes, and there’s no microSD support here so whatever option you opt for will be the storage you’ll have for the tablet’s whole lifetime. If you’re planning to download a lot of apps and you don’t want to run out of space, we’d recommend opting for the 128GB variant.",
    "Those looking for more space again will need to look to the iPad Pro range, where you’re able to get 256GB, 512GB and even 1TB models. The new iPad Air has 64GB or 256GB sizes.",
    "The camera is never going to be the true highlight of a tablet, and Apple gets that, and it hasn’t made any upgrades over the shooter you found on the last-gen tablet.",
    "This isn’t going to give you photography similar to an iPhone, but instead it’s good enough for the odd task such as video streaming, taking photos for an app on your tablet or the odd shot whenever you’ve got your slate nearby.",
    "Apple has included an 8MP rear shooter with f/2.4 aperture. Images taken with it appear sharp and with strong colors, but again you’re not going to be blown away by what it can do if you have a relatively powerful phone camera.",
    "On the front is a 1.2MP front-facing selfie camera, which we would have liked Apple to improve for this generation of tablets – as we’re all now making much greater use of video calling, it would have been a sensible time for the company to improve the selfie shooter.",
    "That said, this is still good enough to get you through the odd video call, even if it won’t be as good as a dedicated webcam.",
    "This tablet comes running iPadOS 14 out of the box, and this is the best tablet software yet from the company. You may have iOS running on your previous iPad, and the good news here is that it works in a similar way with a few new quirks.",
    "Multi-tasking is far better within iPadOS 14, and just general usage is better within this software than on Android devices. Apps are generally better optimized for the iPad experience, and we enjoy a lot of the added extras that Apple has included.",
    "The new iPad 2020 has strong battery life, and it’s likely you’ll find that a relief as most want a tablet to be able to last for as long as possible between recharges. Each iPad generation has offered strong battery life, and there’s no change here with us finding that the slate can last for around 10 hours of video playback from a single charge.",
    "We don’t know how big the battery is inside the iPad 10.2, but it works well and it’s likely to be a similar size to the 8,827mAh that was inside the last-gen device.",
    "There’s no wireless charging here – this isn’t commonplace on tablets yet – so you’ll be using a wired to charge it, and we found that the 20W fast charger included in the box was able to top up the iPad speedily.",
    "First reviewed: September 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "New iPad 2020 price and release date",
    "14": "Design",
    "21": "Display",
    "26": "Specs, performance and camera",
    "37": "Software",
    "39": "Battery life",
    "42": "Don't buy it if..."
  },
  "links": {
    "iPad 2019": "https://www.techradar.com/reviews/ipad-102",
    "iPadOS 14": "https://www.techradar.com/news/ipados-release-date-and-news/news/ipados-14",
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "": "https://www.techradar.com/news/ipados-release-date-and-news/news/ipados-14",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15"
  }
}