{
  "source": "https://www.techradar.com/reviews/net-nanny-parental-control-software",
  "title": "Net Nanny parental control software review",
  "category": "computing",
  "updated": "2021-06-25T17:30:13Z",
  "author": "mike-williams",
  "summary": "This veteran virtual parent is working harder than ever to keep your kids safe online",
  "verdict": "Net Nanny isn't perfect, but excellent content filtering means it could still be a smart choice to protect your kids from dubious websites. Take the free trial, see how it works for you.",
  "pros": [
    "Intelligent content filtering",
    "Smart reporting helps you monitor your child's activities",
    "Location history",
    "Runs on Windows and Mac as well as Android/ iOS"
  ],
  "cons": [
    "Several geofencing limits",
    "Required Google app Safe Search to be set manually",
    "Child app crashed a couple of times during the review",
    "Can't limit app use by scheduling or time"
  ],
  "article": [
    "Net Nanny may be one of the oldest names in the parental control software business, but it's kept adding new features, and the latest edition includes tools you won't always see in the younger competition.",
    "The app's web content filtering doesn't rely on simple blacklists and site categories, for instance - it uses real-time content analysis to detect issues on every web page your child tries to access.",
    "There's smarter YouTube monitoring, too, with search and viewing histories.",
    "The company hasn't forgotten the basics, and you can also block or restrict app usage, limit screen time, and view detailed reports on your child's recent activities.",
    "Tracking tools include the ability to view the location (and location history) of all your children on a single map. Net Nanny has added geofencing support, too, allowing you to define important locations (home, school, grandma's, whatever you need) and get alerts when a child leaves or arrives.",
    "Support for Windows, Mac, Android, iOS and Kindle Fire ensures you can run Net Nanny just about anywhere. Keep in mind that features vary depending on the platform - Windows and Mac laptops don't support location tracking, for instance. That's an issue with all parental controls apps, though, and the ability to offer even partial protection on desktops is still a major plus point.",
    "Net Nanny's pricing is a little more complicated than usual, with three plans on offer.",
    "The first protects a single desktop for $40 a year. The second covers up to five desktop or mobile devices for $55, and the third protects up to 20 devices for an annual $90.",
    "(As we write, the company says these prices are discounted, with '30% off for a limited time.' A quick visit to the Wayback Machine showed Net Nanny offering the same prices six months ago, though, so it doesn't seem that limited. Still, it's possible the prices will be significantly higher by the time you read this.)",
    "That's not an unusual price for Net Nanny's level of features. Bark also uses text analysis to spot issues in web content, but isn't as successful as Net Nanny, and it costs a similar $99 a year to cover unlimited devices.",
    "There are significantly cheaper apps around, though. Kaspersky Safe Kids doesn't have the real-time content filtering you'll get with Net Nanny, but it more than covers the parental controls basics, and it costs just $15 to protect unlimited devices for a year.",
    "Net Nanny's trial scheme isn't exactly clear. The website explains you get 14 free days with the Android app, for instance, then we installed it and were offered three. Even just a day or two is better than nothing, though, and even if you sign up and regret it, you can still ask for a refund within the first 14 days.",
    "Net Nanny's setup process began when we installed the parent's app. We entered our email address and chose a password to create an account, chose the free three-day trial, and the app launched a wizard to help us begin.",
    "This can look a little intimidating, but there's a plus in NetNanny's live chat support (Monday to Friday, 10am to 7pm EST.) It's not 24/7, but it beats many smaller companies, which often provide support via email only. It was also good to see the company send us an email with more instructions, so even if we had to give up on our current session, we'd have guidance on what to do next.",
    "We followed Net Nanny's advice, visiting install.netnanny.com on our child's Android app, clicking a link to visit the relevant Google Play page, and installing the app.",
    "This prompted us to log in and create our child's basic profile - name, gender and age - and then walked us through the process of approving various Android permissions (device administrator, location, content checking.) There are a lot, but they're necessary for parental control apps, where you're keeping a very close eye on how a device is being used.",
    "Finally, Net Nanny prompted us to manually enable Safe Search in the Google app. That's good advice, but many apps do this automatically, and some do the same with other search engines (Kaspersky can enforce Safe Search with Google, Bing, Yahoo and Yandex.)",
    "The Safe Search setting isn't protected, either, so your child could simply disable it later. That's not automatically a disaster, as even if your child finds dubious content in a search, it should be blocked by Net Nanny's filter, but it's still a weakness in the system.",
    "Net Nanny gave our test 9-year-old unlimited screen time by default, but that's easy to change. We were able to set separate usage time limits for every day of the week, and with a precise number of minutes each time (many apps support only 15 or 30 minute increments, and Mobicip schedules usage time in one hour blocks only.)",
    "When screen time is up, you can opt to pause the device, preventing app usage, or just block internet access. That's a handy level of control you won't get with most apps.",
    "We couldn't initially find any way to schedule specific times when a device could be used, for example to block device access from bedtime until the morning. The Help site pointed us in the right direction: for some reason, Net Nanny places time scheduling in an entirely different area of the control panel, doesn't link them, and doesn't highlight the feature later (it's the bottom option of a drop-down list.)",
    "Once you find it, though, the scheduler works more or less as expected, allowing you to allow or deny internet access in one hour blocks throughout the day. Many apps only support a single range ('8am to 9pm'), but Net Nanny's approach gives you far more control, for example allowing you to deny device use at mealtimes (5-6pm) and restore it for an hour or two afterwards.",
    "Most parental control apps filter web content using blacklists and whitelists, but Net Nanny is much smarter. Real-time text analysis looks for dubious content as it's accessed, giving the app a chance of blocking even brand new dangers. And Net Nanny even takes account of context, enabling it to tell the difference between a Wikipedia article which references drugs in a responsible and relevant way, and a site which really, really doesn't.",
    "Net Nanny's content filtering can be customised using 14 categories: Drugs, Porn, Suicide, Weapons and more. Each category has three settings: always block, always allow, or an intermediate 'alert' (the child can access the content, but you'll be warned they've done so.)",
    "You can also add custom filters which block content including a specific keyword or phrase. That gives you a lot of control, but could block some worthwhile sites, as you won't fully benefit from Net Nanny's context sensitive analysis. Adding 'suicide' or 'self-harm' might prevent access to genuinely dangerous forums, for instance, but may also block access to useful mental health resources.",
    "If you need more control, Net Nanny supports building your own custom lists of sites it'll always allow, or always block. That's particularly handy if your child finds a blocked site she thinks should be available. Tap 'Request Access' in the child's app, the parent app raises an alert, and if it looks reasonable, you can add the site to the child's whitelist with a tap.",
    "A bonus 'Mask Profanity' feature tries to mask swear words, replacing them with hash signs (####.) This didn't quite work 100% of the time, but did much better than we expected. After we entered our favourite profanities at Google, for instance, Net Nanny masked our original search term, then hid it in all but one of our search terms, too.",
    "Although this worked as expected, Net Nanny's child app crashed a couple of times during the review, leaving us to access whatever sites we like. That might be an issue relating to our specific device or its setup, but it's an issue we've not seen with other providers, and has to be a concern.",
    "Net Nanny supports viewing the apps on your child's Android device, getting alerts about newly installed apps, and blocking anything unsuitable.",
    "There's support for blocking iOS apps, too, but only from an approved list. That's not unusual, though - iOS doesn't allow parental control apps as much power as Android - and Net Nanny's list is at least a long one, with around 125 top apps.",
    "Whatever your platform, making this happen is easy - just scroll down the app list and tap Allow or Block as necessary.",
    "Social Media is listed as a separate category, allowing you to block all social media apps with a tap.",
    "If that's too extreme, you can selectively block or allow individual platforms as necessary. An intermediate 'Protect' setting allows access, but uses Net Nanny's content filters to block dangerous content. It's only available on a few sites, but they're all big names: Facebook, Instagram, Pinterest, TikTok, Tumblr, Twitter and YouTube.",
    "We tried this with some custom keywords, and it delivered. If we set our filter to 'Block', Net Nanny didn't display content which contained the test keywords; if we set it to 'Alert', our test device could view the content, but we saw a warning in the Parent's dashboard.",
    "What you don't get is any option to limit app use by time. ESET Parental Controls can set app usage to a set number of minutes, or a scheduled time of day, potentially very useful ('you can play that game, but only for 30 minutes of your three hours, and only in the evenings.')",
    "Tapping Net Nanny's Location tab displays the location of your child's device on a regular Google map, with nearby stores and businesses highlighted, and we even got access to Street View when accessing our dashboard via a browser. That could be useful if you don't immediately recognise a location, or you're wondering why your child is there, and it's an improvement on the plain street-name-only maps you'll get with some parental control apps.",
    "Net Nanny detected and displayed our location correctly, and it didn't stop with the usual pin icon, either. It also displayed our approximate address, and how long we'd been there.",
    "By default, Net Nanny displays the current location, but a toggle at the bottom of the screen shows location history, instead. That's a useful and unusual extra, although one or two apps deliver even more (Kidslox also displays location history over a week, and adds journeys in the last 24 hours, too.)",
    "Tapping the location marker accesses Net Nanny's basic geofencing support. You can give the location a name (Home, School), though there's no way to edit the address (ours was a few buildings out.) You're able to tell Net Nanny whether you'd like to be alerted when your child arrives at the location, leaves, or both. You can apply the same rules to everyone in your family, too, so you don't have to set them up separately.",
    "This has some major limits. You can only use a place one of your children has visited before, for instance. There's no way to set up a zone in advance, so you're notified when they arrive somewhere they've never been before, which might be one of the key reasons for setting up geofencing in the first place.",
    "There's no option to set zone size, either, so Net Nanny can't reliably be used as a general location monitor, for instance to raise the alert if your child is more than a quarter of a mile from home.",
    "If you can live with those issues, though, Net Nanny's mapping features are easy to use, and its location history is a welcome plus.",
    "Net Nanny's web dashboard includes several useful monitoring tools. You can watch your child's remaining screen time count down, for instance, and look at reports of how it's been used in the past week, or month.",
    "A Searches tab shows recent internet history searches, their time and the device where they were used.",
    "A YouTube panel correctly showed our YouTube searches. A 'Seen' tab should display the videos we'd watched, but it remained blank throughout the review.",
    "There are no tools for monitoring calls or texts, or managing your child's contacts. Check out Qustodio or Boomerang if that's a problem.",
    "Net Nanny scores for its reporting, though, with a Family Feed view which not only summarises recent events, it adds useful links to explain common issues, and even points you to articles with useful guidance ('GroupMe & Other Dangerous Apps Parents Should Know'). It's a great way to make sense of what's happening, especially important if you've a lot of kids generating warnings, and a welcome plus for the service.",
    "Net Nanny's geofencing isn't up to scratch, and its app management tools aren't as in-depth as the best of the competition. The app's intelligent content filtering does a great job of keeping your kids away from the worst of the web, though, and justifies taking the trial all on its own. A must-try."
  ],
  "headers": {
    "6": "Pricing",
    "12": "Setup",
    "18": "Screen time",
    "22": "Content filtering",
    "28": "App management",
    "35": "Location tracking",
    "42": "Monitoring",
    "47": "Final verdict"
  },
  "links": {
    "Net Nanny": "https://www.netnanny.com",
    "parental control software": "https://www.techradar.com/best/parental-control",
    "three plans": "https://www.netnanny.com/products/",
    "first": "https://www.netnanny.com/products/",
    "second": "https://www.netnanny.com/products/",
    "third": "https://www.netnanny.com/products/",
    "Bark": "https://www.techradar.com/reviews/bark",
    "Kaspersky Safe Kids": "https://www.techradar.com/reviews/kaspersky-safe-kids-parental-control-software",
    "Mobicip": "https://www.techradar.com/reviews/mobicip-parental-control-software",
    "elp site": "https://www.netnanny.com/support/net-nanny-10",
    "approved list": "https://www.netnanny.com/features/block-apps/",
    "ESET Parental Controls": "https://www.techradar.com/reviews/eset-parental-control-for-android",
    "Qustodio": "https://www.techradar.com/reviews/qustodio-parental-control-software",
    "Boomerang": "https://www.techradar.com/reviews/boomerang-parental-control-software",
    "GroupMe & Other Dangerous Apps Parents Should Know": "https://wezift.com/parent-portal/blog/groupme-8-other-dangerous-apps-parents-should-know"
  }
}