{
  "source": "https://www.techradar.com/reviews/mobicip-parental-control-software",
  "title": "Mobicip parental control software review",
  "category": "computing",
  "updated": "2021-06-24T16:25:42Z",
  "author": "mike-williams",
  "summary": "Straightforward parental controls that cover mobiles, desktops, and Kindle Fire, too",
  "verdict": "Mobicip handles basic app and website-blocking tasks with ease, and the wide platform support is welcome, but it's short on features and the dated app lists and poor default settings are a concern.",
  "pros": [
    "Desktop and mobile apps",
    "Excellent Android setup",
    "Content filtering supports custom keywords",
    "Real-time alert when your kids try to access blocked sites/ apps"
  ],
  "cons": [
    "No geofencing",
    "Can't restrict specific apps by time or schedule",
    "Default restrictions didn't always make sense",
    "App lists appear to be outdated"
  ],
  "article": [
    "Mobicip is an interesting mobile and desktop parental control app which combines a number of protective layers to keep your family safe.",
    "The service doesn't rely on simple blacklists to block inappropriate content, for instance. The company says it 'scans websites in real time' across all the top browsers (Chrome, Firefox, Safari, more), allowing only suitable websites for each user.",
    "While some parental control apps rely on simple yes/ no thinking - block all apps in one category until your child reaches a certain age, then allow them to use whatever they like - Mobicip helps you make more personal choices. A Videos section enables blocking some streaming services while allowing others, for example, and you get similar control over specific games and any other apps you'd like to restrict.",
    "Parental controls rules are never suitable 100% of the time, so it's good to see Mobicip raise real-time alerts when you child tries to access a blocked website or app. You can approve access with a tap, the site or app is then added to an exceptions list, and your child is free to access it in future.",
    "Other features include location monitoring, the ability to view your child's browsing history, and options to schedule device usage. And if you're tired of parental controls which take an age to set up, good news- configuring your child's device can be (almost) as simple as scanning a QR code.",
    "Perhaps best of all, Mobicip doesn't just assume you're using Android and ignore everything else: there's also support for iOS, Windows, Mac and Kindle Fire. The features you'll get vary considerably depending on the platform, but that's the same with all vendors, and it's good to see a parental controls setup make at least some effort to protect all your devices.",
    "Mobicip offers three plans, varying only in the number of devices they support.",
    "The Small plan covers up to five devices for $48 a year. The Medium plan supports up to ten devices for an annual $60, and the X-Large plan protects twenty devices for $120.",
    "If you need to protect a lot of systems, there are significantly cheaper deals around. Kaspersky Safe Kids supports unlimited devices for a tiny $15 a year, for instance. If you're also looking for antivirus, Safe Kids comes bundled with Kaspersky's top security suite.",
    "No need to make a final decision just yet, though - Mobicip gives you seven days to try the app out before it takes your cash. (You must provide your payment details when you sign up, though, so make a note of the trial expiry date, and make sure you cancel in time if it's not working out.)",
    "We signed up for Mobicip, handed over our credit card details, and the site prompted us to create basic profiles for each of our children: name, age, and the default parental control setting we'd like to use (Strict, Moderate, Mature or just Monitor.)",
    "Test profile built, Mobicip invited us to install its iOS, Android, Windows or Mac app on the child's device, then scan a QR code or log in to our account.",
    "We grabbed the Android app, installed it in Child mode, and pointed it at the QR code. The app displayed our profile list, we chose the child who used this device, and the rest of the setup process was just a matter of enabling device permissions when asked.",
    "This felt far more straightforward than the usual Android parental app setup, where typically you install the app first, then create and customize a profile, and maybe then figure out how to link it to the parent device. Mobicip's approach is simpler, more streamlined, and should especially pay off if you've several children or devices to protect. Get them all together in one place, install the app on each, scan the QR code and you'll likely be finished in minutes.",
    "(It's not all good news, and Mobicip sometimes made it very difficult to manage our account. We couldn't log in for a while, for instance, and the website gave us no explanation beyond a cryptic '422! Unprocessable entity! The change you wanted was rejected.' When we did log in, the 'My Account' link in the menu redirected us to the home page, and we weren't able to manage our account details. So, although setup was impressive, you might run into issues later.)",
    "Mobicip's parent control rules start by scheduling when your child can use their device, and when they can't. You can only do this in one-hour increments, so bedtime could be 8pm, maybe 9pm, but there's no option for anything in between. That's a little inflexible - most apps use 15- or 30-minute increments, Kidslox only one (8:13pm bedtimes could be yours) - but Mobicip also has a major plus.",
    "While many apps only support a single span of usage time, like '8am to 7pm', Mobicip lets you make a separate 'allow or block?' decision for every one-hour slice of the day. So, if you only want Sunday device usage to be allowed from 8am-12pm, then 2pm-5pm, and 7pm-8pm, that's not a problem, and you can do something entirely different for every day of the week.",
    "Unfortunately, you can't schedule device usage by time, for example giving your child two hours a day but allowing them to choose when that is. The only way to automatically place a strict limit on time is to define exactly when that will be (7-9pm only, say), which is likely to be very inconvenient.",
    "You can take manual control by blocking screen time as required for a fixed number of minutes, or until the end of the day. That's handy, but it's no substitute for having a consistent usage limit which is applied automatically.",
    "Mobicip's Social Apps page displays 20+ apps and allows you to enable or disable them with a tap. Seemed like a good idea, until we noticed that the list was a little out of date. Google+ is still on the list, really? When it was shut down more than two years ago? We're left wondering, what else has Mobicip not updated in a really long time?",
    "It seemed odd that some of the social apps were enabled by default, too, and some were disabled. Had Mobicip intelligently enabled the apps most likely to suit our test 9-year-old, we wondered? Mobicip's website explanation of its restrictions looked reasonable, but when we scanned the list, it didn't seem to be that way. For example, although Mobicip not unreasonably thought WhatsApp was too much for our child, it had no problem giving default access to DOWN, Tinder and more.",
    "(It was easy enough to block these sites ourselves, but this shows you must pay close attention to Mobicip's default settings. And even then, you'll need some web knowledge. Most people won't know every one of the social apps on the list well enough to evaluate it themselves, and they shouldn't have to - that's why they're paying for Mobicip, to benefit from its expertise.)",
    "Next up, Mobicip presented us with a list of video streaming sites to enable. Disney+ wasn't on the list, a few defunct services were (Snag Film, Viewster), so we're guessing this isn't being actively maintained, either. It still includes YouTube, Hulu, Netflix, Amazon Prime Video and more, though, and we were able to disable or enable them as we liked.",
    "Mobicip's Mobile Apps screen finally presented us with a list of 100+ apps we could individually block or allow.",
    "This works, to a degree, but it's time-consuming to set up, and it doesn't begin to match the best of the competition.",
    "ESET Application Guard automatically blocks and restricts many apps by default, for instance, based on age ratings. You can limit app usage by time, or the time of day ('you can only play that game for 30 minutes a day, in the evenings'), giving you far more fine-tuned control over exactly what your kids can do.",
    "Mobicip allows you to block or allow apps by categories, including Adult, Chat, Gambling, Social Network, Weapons and Violence, and YouTube. (Yes, YouTube counts as a category, apparently.)",
    "Mobicip's web protection starts with an option to build your own blacklist (domains which are always blocked) and whitelists (domains that are always allowed.)",
    "Add custom keywords or phrases - the page gives examples like 'slenderman, bikini, kim kardashian' - and Mobicip blocks any pages where they appear. If you have specific needs, and you're very careful, that could be useful, but setting it up properly requires some time and thought if you want to avoid blocking legitimate sites.",
    "Mobicip's website seems to claim it does more content filtering of its own, but there's no information on this in the parent's dashboard, and no way to customize whatever it might be doing.",
    "The website suggests the app can also provide a 'Safe Browser', but the only support article we found on this was marked as obsolete, and for users of older versions of the app only.",
    "If your child runs up against a blocked site and they think it's unfair, they can request access from you. This updated a 'Messages' tab on our parent's screen to show one unread message, but didn't raise a notification, so we didn't spot it right away. When we did, though, we were able to review the request, approve the entire domain or just this specific URL, or just deny it.",
    "This works, but the lack of information in some areas (maybe due, again, to a lack of recent website updates) sometimes left us confused. If you install Mobicip, we'd recommend some intensive testing of the content filter to confirm it delivers for you.",
    "Mobicip can be used to view the location of your child's device, but in only the very simplest of ways.",
    "Choose Location from the menu and you're able to view device locations on a Google map. Mobicip accurately detected our location and allowed us to open it in a regular full-screen Google map, with overlays for local places (shops, businesses, general landmarks) and the option to switch to a satellite view.",
    "The support site warns that when you do this, the child sees a 'Lost Device' message, telling them you're checking where you are. That's not an issue we've seen with other apps, and it's easy to imagine how it might lead to arguments later, if your child gets annoyed that you've checked where they are 'too often.'",
    "Mobicip couldn't win us over with its other location features, either, because it doesn't have any. That leaves it looking distinctly underpowered. Kidslox not only displays your current location, but you can view location history, journeys during the last 24 hours, and support for geofencing enables creating custom locations (home, school) and getting notifications when you arrive or leave. Mobicip has some real work to do before it can begin to match that.",
    "Mobicip setup is easy and the ability to filter content by keyword gives you more control over web blocking. It's missing some common features, though - can't set an overall device usage time, for instance, just a schedule - and dated app lists and poorly chosen default settings mean you'll need to pay extra attention when setting up."
  ],
  "headers": {
    "6": "Pricing",
    "10": "Setup",
    "15": "Screen time",
    "19": "Apps",
    "26": "Content filtering",
    "33": "Location monitoring",
    "37": "Final verdict"
  },
  "links": {
    "Mobicip": "https://www.mobicip.com/",
    "parental control app": "https://www.techradar.com/best/parental-control",
    "Small plan": "https://www.mobicip.com/pricing",
    "Medium plan": "https://www.mobicip.com/pricing",
    "X-Large plan": "https://www.mobicip.com/pricing",
    "Kaspersky Safe Kids": "https://www.techradar.com/reviews/kaspersky-safe-kids-parental-control-software",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Kidslox": "https://www.techradar.com/reviews/kidslox-parental-control-software",
    "website explanation": "https://www.mobicip.com/content/what-are-restriction-options-available-mobicip",
    "ESET Application Guard": "https://www.techradar.com/reviews/eset-parental-control-for-android",
    "support site": "https://www.mobicip.com/content/how-do-i-locate-my-child%E2%80%99s-device-using-mobicip"
  }
}