{
  "source": "https://www.techradar.com/reviews/oukitel-wp10-5g-rugged-smartphone",
  "title": "Oukitel WP10 5G rugged smartphone review",
  "category": "phones",
  "updated": "2021-01-13T07:14:29Z",
  "author": "desire-athow",
  "summary": "A durable smartphone with one massive battery",
  "verdict": "5G is here and it works. The WP10 offers a rugged platform for those wanting a durable smartphone based on Android 10, at a price that's cheaper than the competition. But that's not all, the WP10 has a clever modular design that uses magnets and POGO connectors for expansion.",
  "pros": [
    "Massive battery",
    "Affordable price tag",
    "Decent performance",
    "Two dedicated buttons"
  ],
  "cons": [
    "Big with a portly appearance",
    "No microSD card slot"
  ],
  "article": [
    "We don’t get to review Oukitel rugged smartphones often on TechRadar Pro and that’s because it is a fairly newcomer to the outdoor, durable smartphone market but it is rapidly catching up having launched no less than six rugged smartphones in 2020. The flagship model is the Oukitel WP10, its first 5G rugged smartphone, one which comes with some worthy features.",
    "The Oukitel WP10 5G smartphone is currently on sale at Aliexpress for $399.99 at the time of writing. Extra discounts may be applied at checkout and prices may vary.",
    "What struck us when we first got hold of the WP10 was how big it was. At 178 x 83.4 x 17.6mm for a weight of 364g, it is the heaviest smartphone we’ve tested to date and could potentially cause serious injuries if used to hit someone. Its girth is due to the massive battery it houses as well as the near 7-inch display that squarely puts it in the phablet category.",
    "The design philosophy used by Oukitel is no different from the dozens of other rugged smartphones that we’ve tested in the past and stems from a very pragmatic approach. Keeping a similar design with the same building material reduces R&D, bill of materials and ultimately, the cost of the device (or increases margins).",
    "As such, the WP10 is not going to win any awards for looks but that was never the aim. With its sombre, industrial design with hints of bright yellow, reinforced corners and loads of screws, it embodies the stereotypical rugged smartphone.",
    "As for most of the competition, the rigid metal chassis is covered with what looks like a rubber coating. All the elements that allow Oukitel to slap an IP68/IP69K/MIL-STD-810G certificate on the device. The device has two dedicated buttons on the left; one emergency one and the other for push-to-talk services.",
    "There’s a USB-C port hidden behind a flap on the bottom of the WP10 and a volume rocker plus a power button and a fingerprint reader on the right. A tiny card slot allows you to add two SIM cards but no memory card, a bit of a bummer for some.",
    "The back of the WP10 is home to a quartet of camera sensors: there’s a 48-megapixel Sony IMX582 one, a 13-megapixel ultra wide angle camera and a pair of 2-megapixel ones.",
    "On the other hand, the front-facing camera has a 16-megapixel sensor. Note that there’s also two rows of POGO pins which can be used to connect with yet-to-be-announced peripherals, not unlike what Blackview and Doogee did in a not-so-distant past.",
    "Not much of a surprise here; the device shares the same hardware platform as the Ulefone Armor 10 5G which we reviewed recently. The processor (Mediatek Dimensity 800), the system memory (8GB LPDDR4x), the storage (128GB UFS 2.1), the radio specs (Wi-Fi 5 and Bluetooth 5.1) and the screen resolution (2400 x 1080 pixels) are identical.",
    "The biggest difference - literally - is the size of the battery which stands at 8,000mAh while its screen size (6.67-inch) puts it squarely amongst the biggest smartphones ever built. While the device does offer 18W fast charging, it doesn’t allow wireless charging, a shame given that it does offer NFC.",
    "The Oukitel WP10 performed in line with expectations, based on what we saw with other Dimensity 800-based smartphones. Compared to more traditional 4G system-on-chips, it performs roughly the same as the Helio G90T, a gamer-focussed processor from the Mediatek stable found amongst others, in the Doogee S96 Pro.",
    "Its storage subsystem - while not as stellar as the Ulefone Armor 10 - is significantly better than any eMMC-based models we’ve tested, and that’s a good thing. UFS, short for Universal Flash Storage, is the way forward and brings faster-than-SATA speeds to modern mobile devices. Note that Geekbench failed to run on all Dimensity 800 chipsets to date.",
    "As this is a Mediatek-powered smartphone with a clean Android 10 build, it comes with an array of utilities that - other than being free - do not carry any ads. There’s a system manager app, a QR code reader, a child app, a gamer app and an easy launcher, each targeting a different audience. And lest not forget the toolbag, an assortment of applications that aim to please the DIYer in every single one of us and include the likes of a protractor and a gradient line.",
    "There are only two other 5G rugged smartphones on the market, the Blackview BL6000 Pro and the Ulefone Armor 10. On paper, all three phones have their own USPs and the same Dimensity 800 processor. They can all be had for under $400 at the time of writing.",
    "Blackview has twice the storage compared to the competition but the smallest battery. Oukitel has by far the biggest battery while Ulefone’s model has a 64mp camera sensor but both have 128GB storage. So Oukitel is likely to have the best battery life of the three and the same performance as its peers.",
    "If you can look past its stout build, then the WP10 has a lot to offer for those looking for a sturdy offroad companion. From the four rear camera sensors to the promise of an ecosystem of peripherals, this relatively affordable 5G smartphone may even turn out to be a shoe-in replacement for a rugged tablet given its screen size.",
    "At that price though, we'd love to have 256GB storage as well as wireless charging like the Blackview BL6000 Pro although we’d lose on the battery life. At 380g, it is also far heavier than we'd expect it to be. Blame it on the huge battery and the near-tablet-sized display."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "9": "Hardware",
    "11": "Performance and in use",
    "14": "Competition",
    "16": "Final verdict"
  },
  "links": {
    "rugged smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "Oukitel WP10 5G": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-1093971183548444200&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F1005001860904968.html",
    "Ulefone Armor 10 5G": "https://www.techradar.com/reviews/ulefone-armor-10-5g-rugged-smartphone",
    "Doogee S96 Pro": "https://www.techradar.com/reviews/doogee-s96-pro-rugged-smartphone",
    "Ulefone Armor 10": "https://www.techradar.com/reviews/ulefone-armor-10-5g-rugged-smartphone"
  }
}