{
  "source": "https://www.techradar.com/reviews/saucony-endorphin-pro-2",
  "title": "Saucony Endorphin Pro 2 review",
  "category": "fitness",
  "updated": "2021-10-27T14:52:31Z",
  "author": "michael-sawh",
  "summary": "Saucony's carbon plate-packing performance shoe is now more comfortable for running fast.",
  "verdict": "While the Saucony Endorphin Pro 2 doesn’t bring wholesale changes from the first Endorphin Pro, it remains a shoe that’s built for speed, works great at a variety of distances and comes in cheaper than other carbon plate performance shoes.",
  "pros": [
    "Comfortable, snug fit",
    "Snappy, responsive cushioning",
    "Feels more durable than rivals"
  ],
  "cons": [
    "Not cheap",
    "Not one for easy miles",
    "A little firmer than other performance shoes"
  ],
  "article": [
    "The Saucony Endorphin Pro 2 is a running shoe that feels great at speed, and comes in cheaper than other performance shoes from Nike, Asics and Adidas.",
    "The changes from the Pro lie in the upper and to bring added support at the heel, which makes an already comfortable shoe, even nicer to run in. The ride may be a tad firmer than the competition, but Saucony’s PWRRUN PB midsole, carbon plate and Speedroll geometry means it still comes to life when you up the pace.",
    "It might not have the same sort of versatility as Saucony’s excellent Endorphin Speed 2, but it’s one that’s great to save for short distance and marathon races and training at your race pace.",
    "The Saucony Endorphin Pro 2 launched in June 2021 priced at $200 / £190 / AU$319.99. That's slightly more than the Endorphin Speed 2, which is more of a daily shoe, and launched at $160 / £155 / AU$259.99 at the same time.",
    "With the Endorphin Pro 2, Saucony isn’t ringing the big design changes as it’s mainly making tweaks to the upper and bolstering heel support to make it overall a more comfortable, breathable and supportive shoe to run in.",
    "While this reviewer didn’t get a chance in the original Pro, we can say that this is a performance shoe that feels lovely to slip on. Much like the Endorphin Speed 2, the Pro 2’s single layer mesh upper feels snug in the right places and offers a good locked down fit at the laces and back at the heel. It’s a shoe that feels true to size with our UK size 8 offering the right sort of room up front in the toe box and it doesn't sit tight on the sides of the foot either. We didn’t encounter any issues from a fit point of view on our mixture of runs.",
    "In terms of weight, things haven’t changed from the original Pro. It’s not quite as light as something like the Asics Metaspeed Sky, but that mesh upper and light midsole clearly helps keep that weight down and lets you know this is a shoe for speed.",
    "You’re getting the same 8mm stack height as the first Pro, which sits at 35.5mm at the heel and 27.5mm at the forefoot. There’s still a full length curved carbon plate with Saucony’s PEBA-packing PWRRUN PB midsole combined with Saucony’s Speedroll geometry aiming to offer that snappy, responsive feel.",
    "Saucony hasn’t changed things here on the outsole either, offering the same XT-900 outsole with reinforced high-abrasion zones, which are essentially in place to offer better durability in the areas that will do the most pounding. We used it on the road in both dry and wet conditions, and on the track, and found traction was pleasingly strong. You absolutely wouldn’t want to take these off-road from a durability point of view as they’re firmly made for flat and predictable running terrain.",
    "We do have to also talk colorways here too. Both the mens and womens shoes come in your pick of three looks, but it’s the chequered flag one that we had to test out that we think you’re going to want. Particularly if this is one you’re going to save for racing.",
    "The biggest compliment to pay the Pro 2 is that it feels like a shoe you can effortlessly run quickly in. That combination of carbon, midsole and shoe geometry works to such great effect that it doesn’t take many runs to know it’s one you could take onto the start line or when training at your race pace all the way up to those double digit training runs.",
    "It definitely doesn’t feel as springy to run in as say something like the Metaspeed Sky, but there’s still plenty of snap and that feeling stays very consistent throughout runs without feeling hugely taxing on the legs even when you ease up a little. The cushioning is just about the right side of responsiveness, but it’s that SpeedRoll geometry that, like the Endorphin Speed ,2 feels like the special sauce here that makes running fast in these so enjoyable.",
    "Unsurprisingly, when you slow that pace down, the Pro 2 does feel a bit awkward to run in but not entirely unstable. Those slower speeds are clearly not what this shoe is designed for and you could look for other options in Saucony’s range that offer better versatility. If you want something to run at your fastest, that’s why you’d lace them up.",
    "We don’t have huge complaints about the outsole, which (like a lot of performance shoes) has serious question marks over how many runs it can handle. There’s plenty of exposed foam, but there’s definitely a little more there than some other performance shoes, so it should get you a few more kilometres in comparison.",
    "Overall, the Pro 2 is a strong performance shoe that comes in less than its competitors, but doesn’t shortchange you in terms of the experience. The upper is light, comfortable and has just the right amount of space. It’s snappy, responsive and offers just enough bounce to make it an enjoyable shoe to run in too. Saucony says it makes a great companion shoe with its Endorphin Speed 2 and we’d be inclined to agree.",
    "If you’re looking for a performance shoe that won’t dent hole in your bank balance like a VaporFly Next% 2 or an MetaSpeed Sky will and you still want something that gives you that speedy feeling at short and long distances, this is definitely one to look at instead.",
    "First reviewed October 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Price and release date",
    "4": "Design",
    "10": "Performance",
    "17": "Don't buy it if"
  },
  "links": {
    "running shoe": "https://www.techradar.com/best/best-running-shoes",
    "Asics Metaspeed Sky": "https://www.techradar.com/reviews/asics-metaspeed-sky",
    "VaporFly Next% 2": "https://www.techradar.com/reviews/nike-zoomx-vaporfly-next-2",
    "MetaSpeed Sky": "https://www.techradar.com/reviews/asics-metaspeed-sky"
  }
}