{
  "source": "https://www.techradar.com/reviews/tailscale-vpn",
  "title": "Tailscale VPN review",
  "category": "computing",
  "updated": "2021-11-12T17:18:56Z",
  "author": "sarah-rogers",
  "summary": "Create a secure network of devices within minutes",
  "verdict": "Tailscale is remarkably easy to set up and a great tool for developers but it’s a little too light on features to be useful for other businesses.",
  "pros": [
    "Set up in minutes",
    "Stable IP addresses"
  ],
  "cons": [
    "Taildrop feature limited to devices owned by one user",
    "No way to securely share outside the network"
  ],
  "article": [
    "Many people are familiar with the security benefits of using a virtual private network, or VPN. By connecting to a VPN server, you can access an encrypted connection and mask your IP address from your ISP or bad actors looking to gain access to your accounts.",
    "But the best VPN services can also be used to securely connect to devices, whether to enable remote office work or just to share important files from one personal computer to another.",
    "Tailscale claims to be an easy way to set up a secure VPN network. Our Tailscale review will look at its plans, features, interface, support, and security to see if it lives up to expectations.",
    "It’s free to set up a network of personal devices with Tailscale. One user can add up to 20 devices. Tailscale also has a Personal Pro plan for $48 a year that expands personal accounts up to 100 devices.",
    "For businesses needing accounts for multiple users, the Team plan is $5 per user per month, enabling each user to connect up to five devices and permitting two admins. For more devices, the Business plan is $15 per user per month and enables 10 devices per user and unlimited admins.",
    "Businesses requiring unlimited devices per user will need to upgrade to the Enterprise level and contact Tailscale for rates.",
    "Tailscale’s main feature is the ability to create a “mesh” VPN, in that all the devices on the network can connect to each other directly. This is different from the traditional “hub and spoke” VPN, where each device is routed through a “hub” server, meaning a device has to go through a server to connect to another device. The mesh model enables faster, more secure connections between devices.",
    "The main draw of Tailscale is that it is extremely easy to set up, enabling all your devices to connect to one another within minutes. Unlike setting up a potentially complicated network on your own, Tailscale offers the peace of mind of knowing that you haven’t left open any vulnerabilities in your firewall.",
    "Tailscale provides a stable IP address for each device in your network, making it easier to connect to your or a colleague’s device from anywhere and eliminating the need to reconfigure your network if you move a server’s physical location.",
    "Tailscale’s Taildrop feature enables users to easily share files of any kind and size directly between their devices, without an intermediary. We tested this feature and found it even faster than Apple's AirDrop, sending small files near-instantaneously.",
    "One downside of Taildrop is that you can only share between devices owned by the same user, so team members cannot use it to share documents among themselves. This limitation is understandable, as it is easy to see how the feature could be abused, but it may hinder its effectiveness for certain businesses.",
    "On the Tailscale app and browser, devices can see all the other devices active on the network and their unique IP addresses. With the browser-based admin panel, users have more options. You can also monitor services running on network machines, see a list of users, define controls for certain users, set up automatic domain names for devices with Tailscale’s Magic DNS, and toggle settings like Taildrop off and on.",
    "Once set up, the more advanced features of Tailscale require some technical knowledge (for example, the access controls are JSON-based).",
    "At first, Tailscale’s support seems fairly light. A browser link reading “Support” only directs to an email address, offering no options for phone or live chat.",
    "However, nearly every question that you could have about Tailscale is covered in thorough detail in its documentation section, as well as detailed explanations of how Tailscale works and how it stacks up to a few competitors. It might even be too thorough for some users, as a quick answer can be hard to find.",
    "There is also a fairly active forum where users can post questions or bugs and get support from Tailscale developers and community.",
    "Traffic between devices using Tailscale is end-to-end encrypted, meaning no one at Tailscale can see what you are sending. No connections are routed through Tailscale’s servers, and most connections are exclusively peer-to-peer between the two machines.",
    "Tailscale users must log in using multi-factor authorization. Users access Tailscale with their existing Google, Microsoft, or GitHub accounts. Since users do not have a separate Tailscale account, there is no way for it to be hacked, adding an extra layer of security.",
    "Tailscale is a different sort of VPN than the popular “hub and spoke” options. So, users simply looking for an encrypted way to browse the internet or to change their IP address to a different location should look elsewhere, like ExpressVPN or NordVPN.",
    "Tailscale is shockingly easy to set up and a great tool for developers who need easy access to several machines or for businesses looking for a simple VPN for remote employees. However, since Tailscale is still relatively new, some features are still in development. You cannot yet securely share outside of the network, to show a client work in progress, for example.",
    "Since Tailscale is free for personal users, though, we recommend at least checking it out, to see if it could work for you.",
    "Other VPN providers we have recently tested include:",
    "VPN Gate, Seed4.me, Hideway VPN, BulletVPN, Tuxler VPN, VPNsecure, b.VPN, FastestVPN, X-VPN, SuperVPN, VeePN, ProXPN, Dashlane VPN, TouchVPN, Goose VPN, SlickVPN, Namecheap VPN and VPN Proxy Master"
  ],
  "headers": {
    "3": "Plans and pricing",
    "6": "Features",
    "11": "Interface and in use",
    "13": "Support",
    "16": "Security",
    "18": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "best VPN services": "https://www.techradar.com/vpn/best-vpn",
    "Tailscale": "https://tailscale.com/",
    "Personal Pro plan": "https://tailscale.com/pricing/",
    "Team plan": "https://tailscale.com/pricing/",
    "Business plan": "https://tailscale.com/pricing/",
    "Enterprise level": "https://tailscale.com/pricing/",
    "share files": "https://www.techradar.com/best/best-ways-to-share-big-files",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "VPN Gate": "https://www.techradar.com/reviews/vpn-gate",
    "Seed4.me": "https://www.techradar.com/reviews/seed4me",
    "Hideway VPN": "https://www.techradar.com/reviews/hideway-vpn",
    "BulletVPN": "https://www.techradar.com/reviews/hideway-vpn",
    "Tuxler VPN": "https://www.techradar.com/reviews/tuxler-vpn",
    "VPNsecure": "https://www.techradar.com/reviews/vpnsecure",
    "b.VPN": "https://www.techradar.com/reviews/bvpn",
    "FastestVPN": "https://www.techradar.com/reviews/fastestvpn",
    "X-VPN": "https://www.techradar.com/reviews/x-vpn",
    "SuperVPN": "https://www.techradar.com/reviews/supervpn-free-vpn-client",
    "VeePN": "https://www.techradar.com/reviews/veepn",
    "ProXPN": "https://www.techradar.com/reviews/proxpn",
    "Dashlane VPN": "https://www.techradar.com/reviews/dashlane-vpn",
    "TouchVPN": "https://www.techradar.com/reviews/touch-vpn",
    "Goose VPN": "https://www.techradar.com/reviews/goose-vpn",
    "SlickVPN": "https://www.techradar.com/reviews/slickvpn",
    "Namecheap VPN": "https://www.techradar.com/reviews/fastvpn",
    "VPN Proxy Master": "https://www.techradar.com/reviews/vpn-proxy-master"
  }
}