{
  "source": "https://www.techradar.com/reviews/robinhood-crypto-trading-platform",
  "title": "Robinhood crypto trading platform review",
  "category": "computing",
  "updated": "2021-02-12T17:08:41Z",
  "author": "mayank-sharma",
  "summary": "One of the cheapest trading platforms around that also offers crypto",
  "verdict": "A popular trading platform that might be good for investing in traditional stocks, but doesn’t inspire confidence with its crypto trading facilities.",
  "pros": [
    "Capable mobile app",
    "Multiple cryptocurrencies",
    "Easy-to-use interface"
  ],
  "cons": [
    "US-only",
    "Hidden fees",
    "Crypto for investment only"
  ],
  "article": [
    "Robinhood burst onto the financial services scene in 2015 with commission-free trading of stocks and exchange-traded funds (ETFs). Thanks to its mobile-first approach and a promise to make investment easy and affordable, Robinhood quickly caught the fancy of the new and experienced traders alike.",
    "While the platform has been mired in controversy thanks to its handling of the recent GameStop short squeeze, it continues to be popular because it allows users to trade in stocks, options and ETFs via smartphone and charges minimal brokerage fees.",
    "Starting in February 2018, the platform began to allow its users to trade cryptocurrencies as well. It started with just Bitcoin and Ether and has gradually increased the number of coins that can be traded on the platform.",
    "In this review, we’ll look at how Robinhood handles crypto specifically and whether its crypto exchange service is appropriate for newcomers to the space.",
    "Robinhood doesn’t charge any fees for trading traditional instruments such as stocks and ETFs, and claims to extend that facility to cryptocurrencies as well.",
    "However, several reviewers have pointed to Robinhood’s Crypto User Agreement where it notes that the platform will pass on any fees charged by intermediaries to the user. Users also claim that these fees are already included in the price of the crypto that’s displayed to the trader.",
    "Also, while you can start trading crypto on Robinhood with a regular account, you’ll initially only get instant access to a maximum of $1,000 after a deposit. If you are adding a greater sum to your account, you will have to wait for normal settlement to be completed before the money can be used to buy crypto.",
    "You can increase this limit by subscribing to a Robinhood Gold account, which offers multiple tiers of instant deposit limits. A Gold account costs $5/month, and offers various other advantages, but if you use more than $1,000 of margin, you’ll pay 2.5% yearly interest on the amount used above this threshold.",
    "Signing up for the platform is pretty intuitive. Note, however, that you’ll have to share your address and contact details to verify your identity.",
    "Robinhood currently allows you to trade seven cryptocurrencies: Bitcoin, Bitcoin Cash, Bitcoin SV, Dogecoin, Ethereum, Ethereum Classic, and Litecoin. Additionally, you can use the platform to keep an eye on the real-time price movement of ten other altcoins, including Bitcoin Gold, Monero, Dash, Ripple, Zcash, and more.",
    "There are a couple of things you need to keep in mind when trading crypto on Robinhood. Firstly, you can only buy crypto with available funds or the settled cash in your account. Furthermore, any funds from the sale of stocks, ETFs, and options will not be available instantly for purchasing crypto and can take up to three business days.",
    "You can place both market order and limit orders using Robinhood. However, Robinhood is strictly a trading platform, so any crypto you buy will be held by the company. This means you cannot transfer them to an external wallet, nor can you use them to pay for services.",
    "Cryptocurrency trading is offered through Robinhood Crypto, which is a subsidiary of Robinhood Markets LLC. Importantly, unlike Robinhood Financial, which offers the traditional trading products, Robinhood Crypto is not a member of Financial Industry Regulatory Authority (FINRA) or the Securities Investor Protection Corporation (SIPC).",
    "However, Robinhood assures users that all the crypto it holds on behalf of its users is stored in a mix of cold wallets and hot wallets. While the majority is held offline in cold storage, meaning hackers cannot gain access, some remains in hot wallets to support day-to-day operations.",
    "Robinhood also has a crime insurance policy, underwritten by Lloyd’s, that protects a portion of the assets against losses from theft, including cybersecurity breaches.",
    "Robinhood is particularly popular among the inexperienced and first-time traders. The platform supports these users through its support infrastructure, which is replete with learning resources to help its users become more knowledgeable traders. Robinhood has an extensive library that will teach you the basics of investment through dozens of articles.",
    "Similarly, it also has an expansive support section that breaks down information into various categories that each cater to different aspects of the platform, such as your account, bank transfers, taxes, and more.",
    "There’s also information to help you get started with the platform, and you can also use the search function to quickly find the answer to your queries. Searching for “crypto” brings up a total of ten articles that basically cover everything you can do with crypto on Robinhood.",
    "The platform does give you the option to contact a representative via email, though there’s no option to speak to one over phone or via instant messaging.",
    "When it comes to trading crypto, Robinhood has more in common with SoFi Invest than Coinbase.",
    "For instance, both Robinhood and Sofi operate in the US and offer crypto as an additional investment instrument in addition to traditional products like stocks and ETFs. Both also rely on external crypto exchanges to carry the actual buy and sell trades and are purely trading platforms that don’t allow users to transfer their crypto off their accounts on the respective platforms or use it to pay for services.",
    "However, the similarities end there. SoFi offers a smaller portfolio of cryptocurrencies and relies solely on Coinbase to conduct its transactions in the background. Robinhood routes them through several exchanges in a bid to secure the best price for customers.",
    "That said, while SoFi Invest is very upfront about its charges, Robinhood prefers to mask them behind legalese. Also, unlike SoFi, Robinhood doesn’t mention if there are any minimum and maximum limits to the amount of crypto that you can purchase or sell.",
    "Even if you choose to ignore recent limits placed on crypto trading in the aftermath of price surges, Robinhood’s lack of transparency in terms of fees and other pertinent details doesn’t inspire confidence.",
    "All things considered, the company's crypto trading platform is mainly suited to existing customers that want to use their earnings from selling stocks to trade crypto. For anyone else, the platform doesn’t offer enough of an incentivize.",
    "True, the platform is very popular and perhaps even cheaper than its peers for trading traditional products, but when it comes to cryptocurrencies, we’d suggest you take your business elsewhere."
  ],
  "headers": {
    "4": "Fees",
    "8": "Interface and ease of use",
    "12": "Security",
    "15": "Support",
    "19": "Alternatives",
    "23": "Final verdict"
  },
  "links": {
    "Robinhood": "https://robinhood.c3me6x.net/c/221109/662405/10402?subId1=trd-us-1354157968506510600&sharedId=trd-us&u=https%3A%2F%2Fwww.robinhood.com%2F",
    "trading of stocks": "https://www.techradar.com/best/best-stock-trading-platforms",
    "GameStop short squeeze": "https://www.techradar.com/news/gamestop-fever-rwallstreetbets-and-the-stock-trading-frenzy-explained",
    "trade cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "Bitcoin": "https://www.techradar.com/news/best-bitcoin-wallets",
    "Ether": "https://www.techradar.com/news/what-are-altcoins-everything-you-need-to-know",
    "crypto exchange": "https://www.techradar.com/best/mining-rigs",
    "Robinhood’s Crypto User Agreement": "https://robinhood.c3me6x.net/c/221109/662405/10402?subId1=trd-us-4413741292387393500&sharedId=trd-us&u=https%3A%2F%2Fcdn.robinhood.com%2Fassets%2Frobinhood%2Flegal%2FRobinhood%2520Crypto%2520User%2520Agreement.pdf",
    "altcoins": "https://www.techradar.com/news/what-are-altcoins-everything-you-need-to-know",
    "wallet": "https://www.techradar.com/news/best-bitcoin-wallets",
    "cold wallets": "https://www.techradar.com/news/what-is-a-cold-wallet-for-cryptocurrency-everything-you-need-to-know",
    "hot wallets": "https://www.techradar.com/news/what-is-a-hot-wallet-for-cryptocurrency-everything-you-need-to-know",
    "SoFi Invest": "https://www.techradar.com/reviews/sofi-invest-crypto-trading-platform",
    "Coinbase": "https://www.techradar.com/reviews/coinbase-cryptocurrency-exchange",
    "crypto exchanges": "https://www.techradar.com/best/mining-rigs"
  }
}