{
  "source": "https://www.techradar.com/reviews/adata-se770g-external-ssd-review",
  "title": "ADATA SE770G External SSD review",
  "category": "computing",
  "updated": "2021-02-03T11:21:25Z",
  "author": "mark-pickavance",
  "summary": "Striking appearance and excellent value",
  "verdict": "A striking design that craves attention, but also performs remarkably well considering the relatively low price. For those that like bling and rapid file transfers this drive offers both.",
  "pros": [
    "Funky LEDs",
    "Type-A and Type-C cables",
    "Good performance",
    "Inexpensive"
  ],
  "cons": [
    "No control over the visual effects",
    "Demands a USB 3.2 port for full performance",
    "Short cables"
  ],
  "article": [
    "Based in Taipei, Taiwan, ADATA has a solid reputation for producing low-cost solutions that perform well above their price point, undercutting higher profile brands.",
    "Over the past year, we’ve seen some excellent new products from them, including a competitively priced NVMe PCIe 4.0 drive.",
    "The ADATA SE770G External SSD reviewed here, is a more mainstream solution that provides customers with portable high-speed external storage, but with an exciting twist.",
    "Is this a uniquely styled product that customers will love, or a gimmicky drive that merely a brief diversion, you decide?",
    "The SE770G comes in only 512GB and 1TB models, and neither is especially expensive.",
    "On the UK Amazon, the 1TB model is only £131.33, and the 512GB capacity is £101.56, making the larger capacity model easily the best value.",
    "Stock on the US Amazon has been depleted due to the popularity of this line, but it should be back soon, costing $139.99 for the 1TB and $89.99 for the 512GB version.",
    "As with any online purchases, local sales tax might apply, and there may be better deals to be found.",
    "ADATA doesn’t invest heavily in packaging, and the SE770G comes pressed into a vacuum-formed plastic tray inside a thin card box.",
    "Inside the box is the drive, two USB cables and a Quick Start Guide in fourteen of the most spoken languages.",
    "The drive contains no files, but the Guide directs you to a web location where ADATA can supply you with extra documentation, support and software.",
    "And, it needs to be said, before you plug it into a computer, this drive looks decidedly mundane.",
    "It’s roughly rectangular, with filleted corners and chamfered sides, being shiny black on the top side and silver on the underside.",
    "Of these surfaces, it would be easy to conclude that the silver side is the one that should be ‘up’. It is made of metal and slotted to dissipate heat, but the reality is that this is the underneath.",
    "The USB port on the drive is Type-C, and both cables are around 20cm long, making them fine for laptop users but decidedly short for desktop computers.",
    "Once you attach it to a USB port, using either the USB-A or USB-C cables why the glossy black side should be face-up is glaringly evident, as it generates a spectacular light show through this translucent surface.",
    "The central part of the top is backlit with RGB LEDs through a stencil of hexagon and diamond tessellation, and colour cycles through a rainbow of rich colours.",
    "A lovely effect that is rather mesmerising, and it indicates that the drive is powered.",
    "Our only reservation about the light show is that the colour cycles don’t change when the drive is accessed, and surely a tiny software application could have been created to allow users to control the colours and the speed of cycling?",
    "Without this the result is impressive, but it might have been even better with a little more effort on the part of the product engineers.",
    "ADATA are typically coy about what hardware is inside their SSDs, since they may wish to revise it during a production run.",
    "We guess that this unit using an SMI controller, maybe an SM2262G, and it could be using Samsung, Intel or SK Hynix NAND, depending on spot pricing at the time of production.",
    "Whatever is inside, it performs well enough to be comparable with most USB 3.2 Gen 2 specification drives in the market today.",
    "USB drives built around NVMe PCIe technology can run much faster than the interface that attaches them to a computer.",
    "Therefore while the internal electronics might be capable of 3GB/s or 2GB/s reading and writing, the best a USB 3.2 Gen 2 connection can achieve is 10Gbit/s or 1,200Mb/s. And, when the communication overheads of control packages and error correction are factored in, the theoretical peak is closer to 1,050Mb/s in either direction.",
    "In this drive, the top performance is around 950Mb/s for reading and 900MB/s for writing, which isn’t the very quickest available but is highly respectable.",
    "In our benchmarking, CrystalDiskMark 7.0 recorded 954MBps reads, and 898MBps writes, and the AJA System test these translated into 857MBps reads and 862MBps writes.",
    "What’s useful to know is that on many NVMe drives they start a file transfer quickly and then drop down to around 700Mb/s once the internal cache is saturated. But at the lower speeds this drive runs, the cache would last much longer before becoming saturated, and therefore it is unlikely that it would slow significantly during a big file write.",
    "The temptation when looking for direct competition for the SE770G is to consider those drives that are specifically branded as for ‘gaming’. But for the purpose of this review that this unit includes a visual show is mostly irrelevant, as it competes with many external SSDs made for more general use.",
    "Also, gaming SSDs are often designed for games console hardware, and most have USB 3.0 ports, or USB 3.1 Gen 1, as this port has been recently relabelled.",
    "The Sony PS5 has 10 Gbps ports, but the Microsoft Xbox Series X will only have USB 3.1 Gen 1 Type-A connections.",
    "Therefore if you are buying this drive to use with a console, you won’t get the full performance available unless you have a Sony PS5.",
    "A few gaming drives support this higher speed standard is the WD BLACK Call of Duty: Black Ops Cold War Special Edition P50 Game Drive, and that uses the rare USB 3.2 Gen 2x2 standard to offer double the top speed of the SE770G. But it also costs nearly twice as much, at £237.99 or $249.99 for the 1TB capacity drive.",
    "Much cheaper but still not less than the ADATA option is the Sabrent 1TB Rocket Nano at £149.99, and the Crucial X8 1TB at £140.20 or $149. And, not far from those prices is the WD 1TB My Passport Portable SSD at £143.99 or $164.99.",
    "There are many 1,000MB/s quoted drives that cost much, much more, and the majority of 500MB/s USB 3.0 drives aren’t any substantially cheaper.",
    "Like the Team Group Treasure Touch, the LED effects on this drive are a bit of a gimmick, although these are some of the best illuminations we’ve seen on an external drive so far.",
    "At the very least it should have had a different colour cycle for when the drive was being read or written to.",
    "But ignoring the light show, this the SE770G delivers a decent capacity and good performance for those with a Gen 2 specification port, at a price that some Gen 1 drives don’t match.",
    "And, that point is critical. Because this is the drive that someone who only has Gen 1 ports now, but expects to get Gen 2 ports soon should seriously consider. It doesn’t cost any more than most Gen 1 drives but has double the performance when used with a Gen 2 port.",
    "Where usually the price premium for Gen 2 performance makes it pointless for those with the older Gen 1 ports to consider, the SE770G makes the cost much less of an issue and allows for some degree of future-proofing.",
    "This design also contradicts the expectation that cheaper storage isn’t well constructed, as this design feels substantial and robust. It might not withstand the abuse that a Crucial X8 or OWC Envoy Pro Elektron can handle, but it is far from fragile.",
    "For most users using the SE770G with a games console or to backup a laptop, this is a great choice and a truly eye-catching accessory."
  ],
  "headers": {
    "4": "Price and availability",
    "8": "Design and features",
    "20": "Hardware and performance",
    "28": "The competition",
    "35": "Final verdict"
  },
  "links": {
    "Crucial X8": "https://www.techradar.com/reviews/crucial-x8-1tb-portable-ssd",
    "OWC Envoy Pro Elektron": "https://www.techradar.com/reviews/owc-envoy-pro-elektron-usb-c-nvme-ssd-review"
  }
}