{
  "source": "https://www.techradar.com/reviews/sugarsync",
  "title": "SugarSync cloud storage review",
  "category": "computing",
  "updated": "2021-05-10T18:18:31Z",
  "author": "mark-pickavance",
  "summary": "SugarSync is a long-standing service perhaps best left in the past.",
  "verdict": "SugarSync offers ease of access and simplicity in use, providing straightforward file and cloud syncing. It would garner a higher recommendation were it not for the high pricing, and rival software that's more modern-looking and faster in operation.",
  "pros": [
    "High-strength AES 256-bit encryption",
    "Supports an unlimited number of devices",
    "Easy to use software apps"
  ],
  "cons": [
    "Very expensive pricing",
    "Apps sometimes feel clunky",
    "Lacks two-factor authentication"
  ],
  "article": [
    "SugarSync is one of the longest-running cloud backup services around, as it grew out of Sharpcast which started in 2004. The question is whether it has what it takes against the competition of newer, more nimble competitors? Similar in style to Dropbox, SugarSync enables you to sync selected files and folders locally, with the copies in your cloud storage.",
    "Any changes made on a computer are instantaneously synchronized back to the copies in the cloud. With SugarSync installed across multiple devices, and the latest versions of all your files are ready and waiting for you at all times, without the need for additional devices such as USB drives, or file transfer services.",
    "SugarSync offers plenty of functions and features, more in fact than anyone in need of a cloud storage facility would probably want. For example, the ability to back up any folder across multiple computers, support for file versions, and no limitation on individual file sizes are strong points. We also appreciate the excellent platform coverage too, with apps across desktop and mobile platforms including Windows, MacOS, Android and iOS.",
    "Changes you make to your files are instantly synced back to the cloud as well as your other devices- without any delay, and no scheduling is involved. Photos and videos are also backed up automatically from phones and tablets, not relying on the tools that come with your gadgets. Also, SugarSync works with NAS drives and external hard drives, though only on Windows, and the other limitation is that only with a business account.",
    "As another option, there is a web interface, but it is pretty basic, and only allows you to view your files, and to download or share them as needed. Competing services like OneDrive, Google Drive, Dropbox and iCloud offer more in this area. However, the portal is a help when you need to get at your files on a computer without having SugarSync installed.",
    "Desktop clients with SugarSync enabled allow you to control the bandwidth they use, so your internet connection does not collapse with the load of multiple uploads and downloads. The backup process can be paused at any time as well, to preserve the quality when you've got high bandwidth video streaming or video calling to perform.",
    "The SugarSync software is quite simple in use. For most users, you’ll configure it once, and not need to change it afterwards. You can have everything in your designated SugarSync folder which syncs to and from the cloud, and be in sync with other computers and mobile devices you've signed in to as well.",
    "Stored files have five previous versions held from subsequent updates by default. If needed, you can mark a folder as protected and define a larger number of changes to be tracked in the future. This option is especially useful against ransomware, to allow you to recover files prior to any nefarious encryption occurring, in case that scenario arises.",
    "We encountered no problems with navigation around the SugarSync apps for desktop or mobile, although they are occasionally slow and clunky – we see a need for a bit of a design refresh and some code optimizations. We found upload and download speeds to be perfectly acceptable, on even a less-than-stellar home internet connection.",
    "The web interface, where you can view your files and shares in a browser, is similar to the desktop clients: well-presented, easy to get around, and occasionally slow. It hardly has the kind of slickness that a Dropbox or Google Drive has. Truth be told, it kind of feels like an interface from five years ago, however it gets the job done.",
    "The concern of customers for cloud storage currently is the security of their files in the cloud. With this in mind. SugarSync uses AES-256 bit encryption for processing all files to and from its servers, which we appreciate. It lacks end-to-end encryption though, and that means that SugarSync itself could be peeking at your data – although this is more of a hypothetical concern.",
    "Just keep in mind that not every cloud storage service offers end-to-end encryption, and the benefit of not having it is that if you forget your password, SugarSync staff can get your files back to you. The downside though is that SugarSync staff could also hand your data over to authorities, such as law enforcement, which wouldn't be possible with end-to-end encryption. SugarSync doesn't offer two-factor authentication (2FA) for logging in either, which is a miss as clearly it is a best security practice.",
    "Personal plans for SugarSync start at $7.49 (about £5) a month for 100GB of space, $9.99 (about £7) a month for 250GB of space, and $18.95 (about £14) a month for 500GB of space. Business customers will pay $55 (about £40) a month for 1TB of room. All of these plans offer a 30-day free trial so you can assess what SugarSync is about before committing. Unfortunately, users are required to provide their payment information to get the free trial.",
    "Keep in mind that Google, Dropbox and Apple serve up to 2TB of cloud storage for about $10/£7 a month or even less, this makes SugarSync quite expensive. Furthermore, SugarSync simply doesn't have the features or functionality to justify the extra cost. The service really would need to revise its pricing strategy given the fierce competition in the area.",
    "Putting pricing aside for a minute, SugarSync offers a relatively impressive cloud storage service. It does its job as advertised while offering some neat features we seriously like. Being able to sync across multiple devices works really well, along with sharing files and folders with other people. Also, with a few caveats the service does keep your data quite secure.",
    "Quite frankly, we just can’t get past the pricing though – plenty of alternatives are cheaper, better designed, and look to be updated more often. If we hazarded a guess to its popularity, we can only assume SugarSync has plenty of existing, legacy customers who are happy to pay, as it's hard to see why anyone would sign up now considering the other options on the market."
  ],
  "headers": {
    "2": "SugarSync features",
    "6": "SugarSync interface",
    "10": "SugarSync security",
    "12": "SugarSync pricing",
    "14": "Final verdict"
  },
  "links": {
    "SugarSync": "https://www2.sugarsync.com/",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "file transfer services": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "NAS drives": "https://www.techradar.com/best/best-nas-hard-drives",
    "external hard drives": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "Personal plans": "https://www1.sugarsync.com/pricing/"
  }
}