{
  "source": "https://www.techradar.com/reviews/vizio-d-series-full-hd-tv-2021",
  "title": "Vizio D-Series Full HD TV (2021) review",
  "category": "televisions",
  "updated": "2021-07-20T19:39:15Z",
  "author": "nick-pino",
  "summary": "A Full HD TV that has the wits of most 4K TVs at a bottom-barrel price point",
  "verdict": "The new Vizio D-Series offers a surprising amount of smart TV features for an incredibly low price. Its picture performance is fine, despite the lack of extra pixels and HDR support, but its sound quality and poor upscaling leave a lot to be desired. It’s above-par compared to a few other remaining Full HD TVs on the market, but it can’t hold a candle to any of the 4K TVs out there.",
  "pros": [
    "Some models are Full HD...",
    "Decent black levels and brightness",
    "SmartCast built-in",
    "Super affordable"
  ],
  "cons": [
    "...And others aren’t",
    "Lots of added grain",
    "No HDR support",
    "Awful audio"
  ],
  "article": [
    "Despite technology’s continued march forward, the Vizio D-Series refuses to be left behind. Packed with Vizio’s proprietary SmartCast platform, the all-new D-Series offers decent smarts and Full HD picture performance at a price that is, well, very affordable.",
    "Of course, you have to be careful which D-Series model you’re picking up as there’s a regular HD model, the D32h-J09, and two Full HD models: the D40f-J09 (reviewed here) and D43f-J04. We can only speak to the latter two models in this review, but all of the above have the smarts of 4K screens without the extra pixels or HDR support.",
    "For folks who don’t need or want that extra clarity, the D-Series does make a strong case for itself - it has decent black levels thanks to its full array lighting (though there is some light bleed near the edges of the picture) and the above-par brightness will surprise you.",
    "The downside to this screen? Its audio is nothing to write home about and some scenes have a significant amount of grain that you wouldn’t see if it had better upscaling. Unfortunately because it doesn’t have the extra pixels the basic IQ processor doesn’t hold a candle to Vizio’s higher-end IQ Active and IQ Ultra processors that are in the M-Series and P-Series models. The result is a picture that is ultimately fine for a kids room, but not necessarily the type of TV you’d want to buy for your living room.",
    "The new Vizio D-Series is part of Vizio’s 2021-2022 TV lineup alongside the new V-Series V5, new M-Series M7 and new P-Series TVs. Currently there are three models out there that include the 32-inch D32h-J09, 40-inch D40f-J09 and 43-inch D43f-J04 that cost $179, $249 and $299 respectively.",
    "As we mentioned above, it’s worth making sure you’re at least buying one of the two Full HD models as you’ll get more bang for your buck there, but there’s not a massive difference between the 40-inch and 43-inch models outside of the slightly larger screen size.",
    "Compared to the competition, the Vizio D-Series is probably the most affordable TV out there from a reputable manufacturer which makes it compelling, but for just a bit more money you can buy the TCL 4-Series ($349) that offers 4K, HDR and Roku TV that we feel is well-worth the extra bit of cash.",
    "For a low-price TV, the D-Series actually looks pretty sleek. With a minimal bezel around the screen, slim plastic legs and a low-profile look, the D-Series looks very modern… at least in the front.",
    "Spin it around to the side, however, and you’ll see that it’s not completely modern – the D-Series is fairly thick around the midsection that juts out several inches. Here you’ll find the inputs and outputs for the TV that include only two HDMI ports (HDMI 1 supports ARC), composite-in and both digital optical audio out and 3.5mm aux.",
    "Having just two HDMI ports isn’t exactly a deal-breaker at this price, but it is something to pay attention to – if you know you have more than two devices that need to go into the TV, you’ll either need to find another model or invest in something like an HDMI splitter.",
    "Inside the TV, Vizio has installed its basic IQ Processor to handle motion processing and upscaling and a full array panel. It doesn’t list any contrast control zones for this TV, which we’ll explain down below, and the TV’s panel only has a native 60Hz refresh rate.",
    "Last but not least, the TV comes with a basic IR remote that has shortcuts for Netflix, Prime Video, Disney Plus, Crackle and others, as well as Vizio’s own WatchFree service. The remote doesn’t have voice search built-in, but there is a SmartCast app you can download if you want additional functionality.",
    "SmartCast really feels like the TV’s strong suit. Not only does it give it a leg up on other non-smart TVs, but SmartCast in particular offers a lot of functionality out of the box.",
    "To begin with, let’s talk about the Cast in the SmartCast name that allows you to use Chromecast Built-in or Apple AirPlay 2 to send content from your phone to the big screen. This can effectively be done in two taps – and it works with most major streaming services.",
    "Speaking of streaming services, all the main ones are here and accounted for. You’ve got the ones we mentioned above like Netflix, Amazon Prime Video and Disney Plus, as well as a number of other lesser streaming services like Adult Swim to watch Rick and Morty and Peacock to watch We Are Lady Parts.",
    "Of course, most of those streaming services do require a subscription in order to access them. If that’s not your style, you can tune in to Vizio’s WatchFree TV service that takes some regular channels like MTV and blends them together with internet-only stations to create a cable-like experience with ads that you can watch when there’s nothing else on.",
    "The big downside to SmartCast on the D-Series is that it does run a little bit slower than on higher-end models and the power-on sequence can take awhile if you don’t enable fast start that leaves the TV in low-power mode when you’re not watching it. We absolutely recommend doing the latter even if it costs a bit more money in the long run, as it will save you minutes of your life just waiting for SmartCast to load.",
    "For an HD TV, the D-Series’ picture performance is actually above average. It has its issues that are especially apparent if you’re used to watching some higher-end TVs, but if you’re upgrading from an old CRT or first-generation flat-screen, you’ll be pretty impressed.",
    "The reason for that is the TV’s moderately high brightness and decent black levels thanks to the full array lighting. With array lighting instead of side-lit LEDs, the D-Series can effectively black out parts of the screen for better contrast while keeping parts of the TV brightly lit. If you look closely, you’ll notice a bit of light leakage off to the side and more of a grey tone instead of outright black, but by and large the brightness and black levels are quite good at this price point.",
    "Where the TV is less strong is in its color reproduction and saturation. Without HDR built-in, this TV can’t produce as many colors as a 4K HDR screen can. The results are images that are less vibrant than what you’d find elsewhere.",
    "Two other problems are the TV’s IQ Processor and its native refresh rate – it’s simply not equipped with all the tools it needs to remove grain from space scenes in movies like Star Trek, nor is it ready to handle sports with its basic 60Hz refresh rate. None of that matters if you’re only using it to watch cartoons or dramas – both of which look great here – but you’re limited in what kinds of content you can watch.",
    "The good news is that gamers, mostly, will really like this TV. It has a dedicated Game Mode that offers less than 10ms input lag to make games play smoothly and its 1080p resolution is perfect for last-gen consoles like the Xbox One, PS4 and Nintendo Switch.",
    "Audio, unfortunately, is a mixed bag. Often the audio we heard lacked clarity in the mid-range making dialogue difficult to hear, and didn’t have a very wide soundstage.",
    "That said, you’ll probably want to buy a soundbar for this TV – potentially the Vizio V-Series 5.1 Sound Bar that upgrades you to surround sound from basic stereo sound.",
    "Without a soundbar, audio is a bit narrow, direct and lackluster. There’s little to no bass response and the mids kind of all blend together. You do get some of the high-end, but not enough to make music really sound its best. At best, the TV sounds average and at its worst, dialogue is a loud, indistinguishable mess."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "7": "Design",
    "12": "Smart TV (SmartCast)",
    "17": "Picture performance",
    "22": "Audio",
    "25": "Don’t buy it if..."
  },
  "links": {
    "V-Series V5": "https://www.techradar.com/reviews/vizio-v-series-v5-2021-review",
    "Vizio V-Series 5.1 Sound Bar": "https://www.techradar.com/reviews/vizio-v-series-51-sound-bar-v51x-j6"
  }
}