{
  "source": "https://www.techradar.com/reviews/huawei-watch-gt-3",
  "title": "Hands on: Huawei Watch GT 3 review",
  "category": "fitness",
  "updated": "2021-10-21T15:52:31Z",
  "author": "basil-kronfli",
  "summary": "A capable smart-ish watch with impressive battery life and workout tracking",
  "verdict": "The Huawei Watch GT 3 is one of those not quite smart but not quite basic watches. It offers battery life that would make an Apple Watch user cry and smart features that fall behind the most premium competition out there. A solid exercise compadre, the watch’s training specs are respectable for the price and premium styling, its big screen is stand out and the interface has seen a serious boost when it comes to speed and performance. Huawei is still behind the competition on things like wrist-based payments, and there’s no third-party app support as found on the Huawei Watch 3, but we nevertheless found the GT 3 to be a capable smartish watch.",
  "pros": [
    "Premium design across sizes",
    "Bright, bold OLED display",
    "Smoother interface than GT 2"
  ],
  "cons": [
    "No wrist-based payment solution",
    "No third-party app store",
    "No notification interactivity"
  ],
  "article": [
    "The original Huawei Watch GT launched in 2018. It was a stuttery proof of concept that made the point, smartwatch battery life doesn’t have to be totally atrocious. The Watch GT 2 levelled up the interface, smoothed things out and made the whole experience feel less janky, and was followed up by the Watch GT 2 Pro, a more premium take on the winning formula.",
    "A year on, and Amazfit has launched the battery-tastic GTR 3 Pro, while popular brands like Fitbit are having success with their take on smartwatches (the Versa 3 being particularly well received). The kind-of-smart smartwatch world is getting saturated, so what does the Huawei Watch GT 3 do that’s better than the rest?",
    "In the flesh, the most striking thing about the Huawei GT 3 is its big, bold, bright screen. We mainly tested the larger 46mm version, but for anyone after a more elegant option, it also comes in a 42mm size.",
    "Available in three finishes across all sizes, you can get the Watch GT 3 with either a sporty, leather or metal strap. The larger version’s metal option is a link strap, while the smaller watch’s metal strap is more Milanese loop-esque.",
    "If you do like a big watch face, then the GT 3 46mm options sports a 1.43-inch round panel with 466x466 resolution. This shrinks down to 1.32 inches on the 42mm option, and we really do appreciate having both gender-neutral styled and more elegant versions of the smaller watch to choose from.",
    "With each watch measuring a little over 1cm in thickness, the watches aren’t too chunky, and we’d go so far as to say the smaller version is one of the finest looking lightweight smartwatches we’ve tried to date.",
    "The fact the watch also benefits from a rotating crown adds easy navigation even in wet conditions, and Huawei’s also updated the interface to reflect Harmony OS 2, as found on the Huawei Watch 3.",
    "Huawei has upgraded the heart rate monitor on its new Watch GT 3, increasing the number of light signal receivers, which are the all-seeing-eyes that peer into your veins and get your pulse. The watch also benefits from an arched base design, increasing the likelihood that the point it touches your skin will be more snug and secure, and the back also features a micro-nano optical film to reduce interference.",
    "While we didn’t run with it, TechRadar contributor Mike Sawh had the chance to test it out, and found the heart rate monitor to be comparable to a reliable Garmin model in his short time with the watch.",
    "The Huawei Watch GT 3 also borrows some of the Huawei Watch 3’s features, mapping out a training plan for users across 13 pre-defined on-device programs. The watch also feeds in your personal running and health data and can tailor a personalised plan accordingly.",
    "Naturally, just like the Huawei Watch GT 2, the GT 3 brings back sleep tracking, heart rate, stress, SPO2 monitoring and more. Runners can also enjoy dual-band five-system satellites, which include standard GPS tracking, Galileo, Beidou, GLONASS and QZDD. Huawei promises 50% improved positioning than past generation models.",
    "The Huawei GT 3 brings back Bluetooth calls on your wrist from your phone. While unavailable on small variants of past watches, both the GT 3 46mm and 42mm support the feature. There’s also room on the watch for up to 500 songs, and there’s a new processor powering the watch along. Its smoothness is instantly noticeable when compared to past generation GT watches, bringing the series nearer parity with the Apple Watch’s responsiveness.",
    "One aspect of the watch that Apple can only dream of competing with is battery life. With the 46mm Huawei Watch 3 GT lasting up to 14 days, and the 42mm option lasting half that at seven days, both still wipe the floor with Apple’s latest Watch Series 7 and its 18-hour battery life.",
    "Choice is a good thing, and so is progress. On first impression, the Huawei Watch GT 3 represents both. It gives iPhone users a round watch with longer battery life, and boosts the performance when compared to the GT 2. Huawei needs to sort out a few things like its Wallet app; the company still doesn’t support wrist-based mobile payments. That said, we’re guessing that won’t be a deciding factor in picking up your next smartwatch.",
    "What’s undoubtedly more important than mobile payments is the Watch GT 3’s premium design, its more responsive UI, and its impressive battery stats that promise sleep tracking without a daily charge. With decent fitness features to boot, and availability across two strong styles, third time looks set to be a charm for the GT 3."
  ],
  "headers": {
    "2": "Design",
    "7": "Health tracking",
    "11": "Other specs",
    "13": "Early verdict"
  },
  "links": {
    "Huawei Watch GT": "https://www.techradar.com/reviews/huawei-watch-gt-review",
    "GTR 3 Pro": "https://www.techradar.com/news/amazfits-three-new-smartwatches-are-affordable-apple-watch-7-alternatives",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "Watch Series 7": "https://www.techradar.com/reviews/apple-watch-7"
  }
}