{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
  "title": "Samsung Galaxy Tab S7 and Galaxy Tab S7 Plus review",
  "category": "tablets",
  "updated": "2021-12-05T23:32:29Z",
  "author": "abbas-jaffar-ali",
  "summary": "The Galaxy Tab S7 Plus may be Samsung's finest tablet yet",
  "verdict": "The Samsung Galaxy Tab S7 range is an ambitious offering from Samsung, with a premium build and a fantastic screen that's unlike any we've seen on Android tablets before. However, the lack of developer support for apps on Android tablets takes a toll on what is otherwise a top iPad competitor.",
  "pros": [
    "Gorgeous OLED screen",
    "Premium design",
    "Fast performance"
  ],
  "cons": [
    "Just one port",
    "Android lacks quality tablet apps",
    "High price"
  ],
  "article": [
    "With the Galaxy Tab S7 range, Samsung is looking to challenge the current king of tablets – the iPad Pro. We're reviewing both here - the larger Tab S7 Plus, as well as the slightly smaller Tab S7.",
    "Both are fantastic tablets in their own right, though the the gorgeous 12.4-inch OLED panel on the Tab S7 Plus will certainly win over the LED panel of the Tab S7. With a resolution of 2800 x 1752 on the Tab S7 Plus and a refresh rate of 120Hz, it looks absolutely stunning, and it's the best screen we've ever seen on an Android tablet.",
    "The display has a 16:10 aspect ratio, which makes the overall shape of the tablet taller and narrower than an iPad, and it’s also thinner and lighter than the iPad Pro 12.9. The build quality is first-rate, and both tablets look and feel sleek and premium, without any hint of flex.",
    "Samsung hasn’t skimped on the rest of the specifications either. The Galaxy Tab S7 Plus and Tab S7 are powered by the Qualcomm Snapdragon 865 Plus, which is the fastest processor currently available for the Android platform.",
    "Samsung bundles the S Pen stylus with the slate, so you won't need to shell out extra for it. The S Pen is more responsive than the stylus that came with the Galaxy Tab S6 and it snaps magnetically onto the back of the tablet where it charges wirelessly.",
    "Where most Android tablets struggle is with apps: Android developers just aren’t as interested in optimizing apps for a tablet interface as those developing for iOS seem to be. Most Android tablet apps simply look like a stretched-out version of the phone app, rather than being rebuilt for the bigger screen.",
    "While the software offering isn't as strong as what you get on an iPad, there's a lot to love about the Galaxy Tab S7 range, with the highlight being the screen on the Tab S7 Plus. Samsung isn't just gunning to claim the title of best Android tablet here - it's setting its sights on the iPad Pro 2020 and the best tablet crown too.",
    "There's a chance we could see the Samsung Galaxy Tab S8 arrive at some point too with plenty of rumours about the new tablet range potentially launching in early 2022.",
    "Both the Samsung Galaxy Tab S7 and Galaxy Tab S7 Plus will likely be reduced in the Black Friday deals, so it’s worth looking at the best tablet Black Friday deals out there. We’ll be conducting a re-review in the future. However, we’ve updated references within our review to highlight new features that have emerged since our tests to give you a better idea of what you might be buying.",
    "The Samsung Galaxy Tab S7 and Galaxy Tab S7 Plus are both available now in the US, UK and Australia.",
    "The Samsung Galaxy Tab S7 Plus price starts at $849.99 / £799 / AU$1,549 for the 6GB of RAM and 128GB of storage variant, which is no surprise considering the flagship tablets it's competing with.",
    "That's a Wi-Fi only variant, and you're able to buy a 5G-ready version of the tablet as well. Some markets also have access to a 4G variant, but that's not on sale in the US. There's also an 8GB of RAM with 256GB of storage version in some markets.",
    "The Samsung Galaxy Tab S7 base model comes with with 6GB of RAM and 128GB of storage, and starts at $649.99 / £619 / AU$1,149.",
    "In the UK, you’re be able to buy a Wi-Fi only variant of the tablet but in the US you’ll only have the choice of a 5G-ready.",
    "In the UAE, Samsung has priced the Galaxy Tab S7 Plus at AED 3,599. That gets you a 256GB unit with 8GB RAM but no LTE. To sweeten the deal, Samsung is bundling a complimentary Book Cover for anyone pre-ordering it. For the Galaxy Tab S7, pricing sits at AED 2,699 for the Wi-Fi only model, and AED 2,999 for the LTE version, both with 128GB of storage.",
    "When you think of a premium tablet, the design that instantly comes to mind is the iPad Pro with its large screen, thin bezels and flat sides. The Samsung Galaxy Tab S7 series has all of that, and it manages to up the game by being both thinner and lighter than the 12.9-inch iPad.",
    "At 575g for the Tab S7 Plus and 498g for the Tab S7, it is reasonably light, but you'd still want to hold it with two hands. It's also impressively thin at just 5.7mm, which makes it the thinnest tablet we've used.",
    "Being thin and light does not mean the tablet feels cheap – it's quite the opposite. There's no flex on the tablet and It feels extremely premium, especially with the brushed metal sides that remind us a bit of the Galaxy Note 4.",
    "The rear side of the tablet is a bit of a fingerprint magnet and we started seeing smudges very easily on the Mystic Black color that we used. You'll also get two additional colors; Mystic Silver and Mystic Bronze.",
    "There's a glass strip towards the top of the rear of the tablet, which acts as a magnet to attach the S-Pen. Weirdly, the S Pen only charges when the tip of the pen is pointing in the camera's direction. The magnet is not the strongest and the fact it's behind the slate made us wary of losing the stylus without realizing as it's out of sight.",
    "However, Samsung has a clever design solution with the cover and we'll touch on shortly.",
    "The camera modules are also placed within this glass strip with a tiny bump around it. That does mean the tablet doesn't sit exactly flush when you lay it down on a table.",
    "The Samsung Galaxy Tab S7 series has just one USB 3.2 Type-C port, located on the right that can either charge or provide a data connection. This also means there's no headphone jack available on the slate. You'll have to double-check if your USB-C headphones are compatible, as when we tried one particular headset, the tablet showed it as an unrecognized USB device.",
    "There are plenty of docks and dongles available that can extend the functionality of this port, but two ports are always better than one - and it's something we'd have liked to of seen here if Samsung is serious about this being a productivity machine.",
    "There is a smart connector at the bottom, with the Samsung Keyboard cover magnetically attaches to. As far as buttons are concerned, you get a power button and volume keys, plus there's a SIM slot on top.",
    "If a tablet was judged by its screen alone, the Samsung Galaxy Tab S7 Plus would be one of the best out there. The gorgeous 12.4-inch Super AMOLED screen has a resolution of 2800 x 1752 and supports a fast 120Hz refresh rate making it smooth to operate.",
    "The Tab S7 sports a LTPS IPS LCD screen, with a resolution of 2560 x 1600 pixels, but retains the same refresh rate of 120Hz.",
    "The difference between the OLED screen on Samsung Galaxy Tab S7 Plus and other IPS-based tablets such as the iPad Pro or the Huawei MatePad, is IPS screens just seem dull after you've used OLED.",
    "The 16:10 aspect ratio of the screen is a decent compromise between entertainment and productivity. Most streaming content is made with a 16:9 aspect ratio, so you lose very little screen estate when watching Netflix or YouTube compared to an iPad which has a 4:3 ratio.",
    "On the flip side, you don't get as much vertical space for apps, web browsing or emailing, but it isn't a huge issue.",
    "There are very narrow bezels around the tablet, and Samsung improved its prevention against accidental taps - but it's not perfect. You need to make sure the S Pen touches the screen before your palm does otherwise you start seeing app windows resizing or flying off the screen.",
    "The Galaxy Tab S7 Plus features an in-screen fingerprint sensor. It's not as fast as the ones we've seen on some smartphones, but it works well enough. On the Tab S7 the fingerprint reader resides in the power button, which is equally fast at unlocking the device when you need to.",
    "Although the Samsung Galaxy Tab S7 series can be purchased as a standalone tablet, its productivity levels improve tenfold when used with accessories. The S Pen is already included in the box which is much nicer than the extra you'll need to spend if you were to purchase an Apple Pencil for the iPad.",
    "Like the Apple Pencil on the iPad Pro, you can snap the S Pen magnetically onto the back of the the Galaxy Tab S7 to store it, and to charge it wirelessly. Samsung has improved the latency on the S Pen and added air gestures to the Tab S7 Plus, similar to those you'll see on the new Galaxy Note 20.",
    "Besides the S Pen you can optionally buy the Book Cover and the Book Cover Keyboard for the Galaxy Tab S7 Plus. The Book cover magnetically attaches to the back of the Tab and adds a kickstand that lets you stand the tablet up - useful if you're about to watch a movie. Do keep in mind that with both these accessories, the weight of the tablet goes up noticeably.",
    "The top of the Book cover has a small bump where the S Pen resides, and you can flip the top part of the cover to access the stylus. We highly recommend using the Book Cover as it provides excellent protection against losing your S Pen.",
    "The Book Cover Keyboard snaps on using the Smart Connector to provide you with a keyboard and trackpad, allowing you to use the slate in a similar fashion to the Microsoft Surface Pro 7. There is a bit of jiggle when using the tablet with the keyboard in your lap - it's workable, but not as sturdy as the Surface.",
    "The keys are large and nicely spaced with decent throw, though they're not backlit which makes it difficult to type in the dark. You do get the full set of keys along with with numeric and function keys for shortcuts to change volume and brightness levels as well as for navigating Android.",
    "The trackpad is also decently sized and slightly bigger than the one found on the iPad Pro Keyboard case. However, it felt a bit jumpy like some of the Windows laptops. It supports three fingers gestures that allow for the same functionality as Android's navigation gestures. For anyone that prefer to press instead of tapping, the right side of the trackpad acts as a right click when pressed.",
    "The Samsung Galaxy Tab S7 series is equipped with the fastest processor currently available for the Android platform - the Qualcomm Snapdragon 865 Plus. This is backed up with either 6GB or 8GB of RAM, depending on what variant you choose.",
    "Along with that 120Hz display, this makes for the smoothest Android tablet experience we've come across. In terms of storage you have the choice between 128GB and 256GB, and if that's not enough you can extend this using a microSD card up to 1TB in size.",
    "Apps launch quickly and you can easily switch between them without any delays. We had multiple apps working on both tablets and it continued to operate as fluidly as having a similar set of apps open on an iPad.",
    "We ran Geekbench 5 on the Tab S7 Plus which registered a single core score of 936 and a multi-core score of 2,846. That's not as fast as the iPad but you'd be hard pressed to notice the difference with general usage. On the Tab S7, the scores were 973 and 3,227 respectively.",
    "There are four speakers on the tablet that sound pretty good and make it a device suited for watching films or playing games. However, the iPad has the Tab S7 beat again as we found the speakers on multiple iPad products to be louder and richer.",
    "Some versions of the Galaxy Tab S7 come with a SIM card slot, and some version of the Tab S7 Plus are even 5G compatible. If you're fortunate enough to live or work in a 5G coverage area, this version of the Tab S7 Plus will be able to take advantage of increased download and upload speeds.",
    "Even if you're not currently in a 5G coverage area, carriers around the world are continuing to roll out the next generation network to more and more areas, which means when it does arrive in your location you'll be able to take advantage of them.",
    "There's also an 8MP front-facing camera that thankfully sits on the top of your screen when the tablet is in a landscape mode. We found this more suited for conducting video calls as your eye line is more suited to where the camera sits rather than it being off to the side like it can be with other tablets.",
    "Round the back, both tablets have a dual-camera setup, with a main 13MP camera joined by a 5MP ultra-wide offering. There are people out there that take photos with their tablets and the cameras here will serve them well.",
    "You get all sorts of camera modes such as Live Focus (for portraits), Pro Video, Night and Single Take that Samsung released with the S20 series. This last mode records a short video and then creates multiple clips and images out of it with different aspect ratios suited for social networks.",
    "Things get very uninteresting when it comes to the software on Android tablets. Even though Google supports a variety of screen sizes and aspect ratios for Android, most developers focus on portrait apps designed for phone screens.",
    "While this is a problem with the iPad to a certain extent, Apple has managed to get a lot more support for tablet apps that Google has. And its not just restricted to smaller teams of developers that don't necessarily have the resources- even companies like Adobe haven't made their pro apps available for Android tablets.",
    "Other apps, such as Microsoft Teams and Spotify, that do work on Android tablets are simply a stretched version of their phone app.",
    "It's not all doom and gloom though, as there are some apps which are optimized for Android tablets. Google tries to make all of its apps work well on Android tablets, but for the ones that don't Samsung has a reasonable solution called DeX.",
    "When your Galaxy Tab S7 is in DeX mode, your typical Android home screen is replaced by one that looks a lot like the Windows desktop and allows Android apps to work in windowed versions instead of taking the full screen.",
    "This allows for better multi-tasking as you're using multiple apps in movable windows- something the iPad is not capable of. However, not all apps are compatible with DeX - which can take you back to square one.",
    "Samsung has equipped the Galaxy Tab S7 Plus with a 10,090mAh battery which is higher in capacity than the iPad Pro 12.9-inch. That's very impressive considering the Tab S7 Plus is smaller in size and thinner than that model of the iPad Pro. The Galaxy Tab S7 comes with a smaller 8000mAh battery, but the absence of an OLED screen means you'll be able to get decent battery life on it.",
    "In our testing, we've found the battery on the Galaxy Tab S7 Plus to be strong. We'd say the battery life is somewhere between decent and good for everyday use. Most of our testing was been done with the Cover Keyboard attached, and we believe that has drained the life more quickly than if you just had the tablet on its own.",
    "Without the cover, we were getting ten plus hours on a full charge and over three days of standby time. With the keyboard cover, it was closer to eight hours of active usage and two days on standby.",
    "We saw similar usage on the Galaxy Tab S7 - our video loop test came in just shy of eight hours (using the Book Cover), and for everyday use of browsing, watching a decent amount of Netflix, and occasionally sketching with the S Pen, you're easily looking at around eight to ten hours of use before needing a charge.",
    "First reviewed: August 2020",
    "You might also want to check out the ReMarkable 2 tablet review."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Samsung Galaxy Tab S7 / Tab S7 Plus price and release date",
    "15": "Design",
    "25": "Display",
    "32": "The accessories",
    "39": "Specs, performance and camera",
    "49": "Software",
    "55": "Battery life",
    "59": "Don't buy it if..."
  },
  "links": {
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "iPad Pro 12.9": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "Galaxy Tab S6": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-review",
    "best Android tablet": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "iPad Pro 2020": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "best tablet": "https://www.techradar.com/news/best-tablet",
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "best tablet Black Friday deals": "https://www.techradar.com/news/black-friday-tablet-deals-the-best-savings-on-ipads-fire-tabs-and-android-slates",
    "Galaxy Note 4": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-note-4-1263301/review",
    "Microsoft Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "ReMarkable 2 tablet": "https://www.techradar.com/reviews/remarkable-2-tablet"
  }
}