{
  "source": "https://www.techradar.com/reviews/onyx-boox-note-air-review",
  "title": "Onyx Boox Note Air review",
  "category": "tablets",
  "updated": "2021-03-02T04:15:22Z",
  "author": "jamie-carter",
  "summary": "This A5-sized E Ink tablet runs Android apps and comes with a stylus",
  "verdict": "A fluent pen-and-paper experience awaits anyone looking for a power-efficient slate for annotating PDFs and taking notes via the included Wacom stylus. Glare-free readability and an ability to deal with all kinds of digital files, the Onyx Boox Note Air is prime paperless office tech – although short battery life and a slippery design are disappointing at the price.",
  "pros": [
    "Supports apps from Google Play Store",
    "Useful split-screen functionality",
    "Easy annotating using stylus"
  ],
  "cons": [
    "Short battery life for an E Ink device",
    "No water-resistance",
    "Very expensive"
  ],
  "article": [
    "If you’re using way too much paper and soaking up too much blue light at night, then the Onyx Boox Note Air offers the ideal solution. Despite the concept of the ‘paperless office’ being around for decades, a surge in home-working and home-schooling has resulted in a spike in sales of printers. However, you won’t need a printer if you can afford the Onyx Boox Note Air.",
    "While this 10.3-inch E Ink tablet is expensive, it’s a unique product that in some ways goes beyond LCD tablets such as the iPad Pro and Samsung Galaxy Tab S7 Plus. We already know that E Ink is a wonder of modern electronics, but it hasn’t been as revolutionary as maybe it should have beyond its use in the Kindle e-reader.",
    "In the Onyx Boox Note Air – a stable-mate of the impressive (and slightly larger) Onyx Boox Max3 – the tech comes into its own, where the focus is less about reading and more about annotating textbooks, PDFs and any other A5-sized documents using the (included) passive Wacom stylus.",
    "A 10.3-inch E Ink tablet with a front light, the 5.8mm-slim Onyx Boox Note Air boasts 32GB of storage, plus it comes with beefed-up processors and – perhaps most importantly – an open Android 10 operating system. The latter means access to Google Play apps including office favorites such as Dropbox, Google Drive, Pocket, Evernote and OneNote.",
    "It can also run the Kindle and Kobo ebook apps, effectively turning the tablet into a luxury ebook reader. If you frequently read PDFs then the Onyx Boox Note Air is a dream tool – although the screen is only black and white.",
    "The Google Play apps are the Onyx Boox Note Air’s secret sauce, allowing the device to equal Android tablets’ easy access to popular productivity apps. It soundly beats those devices in terms of weight and eco-credentials, but the Onyx is found wanting for battery life, which is odd for an E Ink device.",
    "The Onyx Boox Note Air also impresses with its software, flexibility with files and endlessly customizable text. Refresh rates can be tweaked. You can create bigger margins when annotating PDFs and books, and even split the screen into two. The front-light LEDs can be set to cool or warm.",
    "A lightweight, digital note-taking device that can sync with the cloud, the Onyx Boox Note Air updates E Ink tech with an impressive piece of hardware and some flexible software. But it does seem expensive when compared to mainstream LED tablets.",
    "The Onyx Boox Note Air is available for purchase now through the Onyx website or Amazon for $479.99 (around £349 / AU$700). The package includes a USB-C cable for recharging and hard-wired file transfer, as well as a Wacom stylus.",
    "It’s arguably the Onyx Boox Note Air’s compatibility with a stylus that you’re paying for, since no other E Ink reader offers this – although its support for apps from the Google Play Store also makes it way more versatile than, say, the ReMarkable 2 E Ink tablet.",
    "In terms of their housing, E Ink devices are almost always black or white. They rarely sport the dark blue and orange exterior of the Onyx Boox Note Air. A well-built and solid device, the Onyx’s 229 x 195 x 5.8mm dimensions and 420g weight nevertheless make it feel slippery in the hand. Its rear panel and front are prone to collecting greasy fingerprints, too.",
    "Built around a 10.3-inch E Ink Carta display, the Onyx has a bezel measuring barely 8mm on three of its four sides, and 27mm on the book-like spine. Although not visible, LEDs sit around the device’s screen, acting as a front light.",
    "The Onyx Boox Note Air’s clean lines are accentuated by an almost total lack of physical features. Aside from a USB-C slot on its undercarriage and an on/off switch, there’s nothing else here.",
    "There’s Wi-Fi and Bluetooth 5.0 for file transfer (including a nice QR code feature for quick file uploads from a phone), plus 32GB of internal storage – there’s no SD card slot to expand upon that.",
    "We love low-power, reflective E Ink displays – largely because they’re easy to read. The Onyx Boox Note Air’s anti-glare coating on the flat cover-lens reinforces our experience, but we’re not totally convinced about the Onyx Boox Note Air’s resolution.",
    "For context, the latest iPhone 12 Pro comes with a screen resolution of 2532 x 1170 pixels; but this much larger device manages just 1872 x 1404 pixels, for 227dpi. In practice, reading books and documents is a rewarding experience, and far more comfortable than reading on an LCD tablet. This is helped further in dark settings by edge LEDs that illuminate the display in either ‘warm’ or ‘cold’ light.",
    "Unlike most E Ink displays, the refresh speed here can be tweaked, with the result basically a trade-off between clarity and faster page turns. Which you opt for – Normal, Speed and A2 – will come down to personal choice. A super-fast X mode (just about) makes video watchable.",
    "One feature found on some other Onyx E Ink products is missing here – the ability to extend a desktop PC and act as a second screen for a PC monitor, albeit a static E Ink screen.",
    "What makes this E Ink device completely different to a Kindle is the inclusion of a touch layer that can be used with a passive stylus. In our experience, the Onyx’s matte screen proved super-easy to write and draw upon using the included stylus – much nicer than tapping on the glass front of an LCD tablet – although leaning on the screen did on occasion mistakenly initiate a command. We also noticed that scribbles sometimes disappeared before appearing again a few seconds later.",
    "However, the stylus works extremely well for annotating PDFs and also for general note-taking in Onyx’s home-baked Notes app. There’s a surprising amount of choice in Note, with all kinds of brush pen styles, line widths and grayscale options within a black-and-white but otherwise highly customizable experience.",
    "The display refreshes very slightly and often, which works well at keeping things quick and clean, without interrupting the flow. The device also featured a handwriting recognition mode, which reads scribbles and turns them into text. However, it proved only around 50% to 90% successful in our tests, making it unusable if you have terrible handwriting.",
    "It’s possible to hook up a Bluetooth keyboard to the Onyx Boox Note Air, with the inputting of text usable if the display is in the fast refresh ‘A2’ mode. Could you take the Onyx Boox Note Air on a work trip and use a small keyboard to input notes and write a basic report? Sure, but don’t expect to be able to do much more than just type some text to work with on another device when you get home.",
    "One disappointment is that third-party note-taking apps – such as OneNote and also Evernote – don’t support super-fast scribbles, and are laggy as hell. In fact, we’d go as far as to say OneNote is unusable on the Onyx Boox Note Air. Its own Note app is far, far quicker.",
    "We’re pleased to report that the Onyx Boox Note Air rarely leaves you hanging. Let’s not pretend this E Ink reader is an all-powerful device that can compete with high-end tablets – after all, it comes packing a mid-range processor. However, in practice that puts it right at the top of rival E Ink devices.",
    "In use the Onyx Boox Note Air is generally fast, opening files, rendering complex PDFs and processing stylus-strikes mostly without lags and freeze-ups. It also transfers files super-quickly over Wi-Fi and Bluetooth.",
    "The latter can be used to hook up a wireless keyboard and wireless headphones for listening to streaming music apps (or MP3 and WAV files) or audiobooks. It also has a tiny mono speaker, which isn’t great for music but fine for listening to audiobooks.",
    "Running on a Snapdragon 636 chip, the Android 10 OS has been slightly and sensibly modified to cater for the tasks you’re likely to want to perform on the Onyx Boox Note Air. The UI is separated into Library (ebooks and documents as DOC, DOCX, EPUB, FB2, HTML, MOBI, PDF, RTF or TXT files), Store, Notes, Storage (on its 32GB internal storage) and Apps.",
    "There is a caveat: since the Onyx Boox Note Air isn’t officially a Google Play-certified device, you will have to dive into the settings and check a box to enable Google Play to register your device. That done, Google Play Store is yours to explore. The apps typically useful for work behave well in the main, as do apps such as Kindle, Kobo and ‘read it later’ app, Pocket. Some popular productivity-centric Google Play apps come pre-loaded.",
    "However, the highlight is interaction with PDFs, even reflowable or complex PDFs, which are handled fluently and allow all kinds of annotations and notes. Reading text is comfortable and paper-like, with the Onyx Boox Note Air handling DRM-free EPUB and MOBI files natively while DRM books can be read via Kindle or Kobo apps.",
    "We also welcomed the chance to make notes while reading a book. Although you can write in the margins, the split-screen feature is handy here, which in landscape orientation puts a book page on one side and a blank page – or any other document – on the other ready for your notes.",
    "One of the best things about E Ink displays is that they use relatively little battery power. All of which makes the Onyx Boox Note Air’s 3,000mAh seem rather paltry. In our tests, we got about eight hours from the Onyx Boox Note Air while reading, annotating, note-taking, and using Wi-Fi to sync and stream.",
    "That’s about the same as an LCD-based tablet, which we did find slightly confusing. However, it has two batteries, so will recharge quickly.",
    "First reviewed: March 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Onyx Boox Note Air price and release date",
    "10": "Design",
    "14": "Display",
    "18": "Stylus",
    "23": "Specs and performance",
    "26": "Software",
    "30": "Battery life",
    "32": "Don’t buy it if..."
  },
  "links": {
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "Samsung Galaxy Tab S7 Plus": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Onyx Boox Max3": "https://www.techradar.com/reviews/onyx-boox-max3",
    "ReMarkable 2": "https://www.techradar.com/reviews/remarkable-2-tablet",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}