{
  "source": "https://www.techradar.com/reviews/webhostingpad",
  "title": "WebHostingPad review",
  "category": "computing",
  "updated": "2021-07-13T03:44:28.492Z",
  "author": "mirza-bahic",
  "summary": "With this host you can get unlimited features at a fair price",
  "verdict": "WebHostingPad is a US-based web hosting provider particular about its decision to make most of its features free of restrictions and all for more than a reasonable price. Although not one of the most affordable hosts, it will provide everything you need without making you compromise with average performance.",
  "pros": [
    "Unlimited hosting packages",
    "Pocket-friendly prices",
    "Free website builder by Weebly",
    "Free SSL certificates for each domain",
    "Pocket-friendly prices",
    "Unlimited hosting packages"
  ],
  "cons": [
    "Official blog is lacking content",
    "No monthly billing option"
  ],
  "article": [
    "Established in 2005, WebHostingPad is a brainchild of a crew of promising experts armed with industry experience, ambition and the aim to deliver the highest quality at the lowest possible price, so that everyone can afford to have a place on the internet and still enjoy a first-class service. They claim to host more than 200,000 domains at present and that this number continues to grow every minute. Their main office is located in Rolling Meadows (the USA) and their data centers are situated in Chicago (the USA).",
    "In addition to web hosting services, WebHostingPad offers domain name registration, email hosting and a website builder.",
    "WebHostingPad’s main website is pleasant to look at and has a strangely calming effect, probably due to use of pastel colors and an easy-to-use interface, as well as clear and transparent presentation of all their services. In addition, the website can be fully translated into a couple of languages besides English and they are: Spanish, Portuguese, Vietnamese and Chinese (Mandarin). The pricing seems to differ depending on the versions of the site you’re using, but nothing too drastic.",
    "Their official blog is available in English and it includes few articles, but well written ones. The two categories you can browse are “How-To Guides” and “Tips & Tricks”, but the first one contains a single article and the second one only two of them, which is a total of three articles on the entire blog. On the other hand, WebHostingPad’s team seems to be rather active on social networks (LinkedIn, Facebook and Twitter), creating content on an almost day-to-day basis.",
    "The first thing we noticed about WebHostingPad’s hosting plans is the lack of restrictions on their features. Hence, you can get unlimited domains, databases, email accounts, storage and bandwidth, which is something we don’t see often enough, particularly at this cost level.",
    "The shared hosting and WordPress hosting plans start at $1.99 per month and you’ll get the two of each to choose from: Power Plan and Power Plan Plus. At a minimum, each of them includes a free domain registration, free SSL Encryption, a free website builder from Weebly and unlimited websites, domains and emails, all of which is great to have at start. In addition to shared hosting, WebHostingPad provides VPS (unmanaged and managed) and dedicated servers.",
    "WebHostingPad doesn’t provide a monthly billing option, but users are free to opt for anything between one to five years. All of their hosting plans come with a standard 30-day money-back guarantee, which (not surprisingly) excludes domain registration and other add-ons.",
    "Available payment types include: all major credit/debit cards, direct bank transfer, PayPal, AliPay, Bitcoin and paper checks (US resident only), which is quite a number of options.",
    "Once you choose a hosting plan, you’ll be asked to register a new domain (the selection is quite impressive), transfer the one you already own or use it while keeping it with your current manager. If you are trying out WebHostingPad for the first time and want a new domain name, you are entitled to get a free one for a period of one year.",
    "After this, it’s time to choose a billing cycle and (as expected) the longer it is, the lower the cost of hosting. For example, committing to the entire five-year period rather than to one year (which is really a long-term decision) will lower the monthly price from $3.99 to $1.99, which is half as much. Then, if you are a new customer, you’ll be required to supply WebHostingPad with a fair share of your personal information. After you create a password, select a payment method and (ideally) read “Terms of Service” in detail, you can proceed to checkout.",
    "Shard hosting plans go with Linux-based cPanel, a user-friendly solution that will make everything much easier, especially for newcomers. Those who choose VPS hosting will be able to choose among several control panels, depending on the operating system they are using. Going for a WordPress hosting solution will, however, leave you without a control panel, but with access to a CMS.",
    "In any case, WordPress is just a click away, as well as various useful apps (such as ZenCart, osCommerce, Joomla and so on), all thanks to the one-click installer. Using these apps, you’ll be able to build and manage an online shop without any experience in programming.",
    "Another user-friendly feature that WebHostingPad provides is its Weebly website builder, which will allow you to create a professional website with a different strategy.",
    "Regarding the speed performance, we were expecting much from WebHostingPad and, as demonstrated by GTmetrix, were right to do so. WebHostingPad’s main website required 2.8 seconds to fully load, which looks amazing in comparison to the average result of 8.1. At the same time, the total of 59 requests was required, which is good compared to the average of 89. In conclusion, GTmetrix evaluated the website speed performance with an A (96%), pretty close to the perfect score.",
    "WebHostingPad offers a 99.9% uptime guarantee, promising its customers that their servers are being closely and constantly monitored to make sure their websites are up and running all the time. For each 8 hours of downtime exceeding the 99.9% guarantee, WebHostingPad promises one month worth of hosting credit to be issued on customers' accounts. However, according to UptimeRobot (a tool that monitored the uptime of WebHostingPad’s main website) there will probably be no need for that. After a month of consistent monitoring, not a single minute of downtime was recorded and there was just one major oscillation in response time, which leaves an impression of reliability.",
    "Seeking assistance by entering the “Help Center” on WebHostingPad’s site will provide you with a couple of options. If you're someone who prefers the DIY approach, the first choice will probably be the knowledgebase or, if you have a common issue, the FAQ section (located in the lower part of the same page).",
    "WebHostingPad’s knowledgebase is rather comprehensive and contains a total of 156 articles which are divided into relevant categories such as “Getting Started”, “WordPress”, “Weebly'' and so forth. From here you can go into the further division and search for the article which will answer your question, or save yourself the trouble and use the search box.",
    "Another way to find help is by getting in touch with WebHostingPad’s support team and you can do it in a few ways: by submitting a ticket, writing them an e-mail or contacting them via live chat. In our experience, the chat is the quickest way to get your issue resolved and it should be available round-the-clock. Alternatively, you can give them a ring, but keep in mind that telephone support is available only during the working days and from 8AM to 10PM (CST).",
    "HostGator and WebHostingPad are major players in the web hosting business. They both offer a whole array of hosting options and unlimited features at attractive prices and, in general, can offer something to fit anyone’s needs. However, the billing cycle with WebHostingPad is less flexible than with HostGator (which provides billing for 1, 2 or 3 months as well), so if you are reluctant to commit for an extended period of time, you should go with the latter.",
    "KnownHost is an equally experienced fellow US-based host offering a myriad of hosting options, reliable performance and a 99.99% uptime guarantee. However, when it comes to basic entry-level plans, WebHostingPad offers less restrictions overall and a free easy-to-use website builder, which will get you a higher value for money.",
    "Bluehost is another US-based competitor to WebHostingPad and one of the most well-known hosts out there, and for the right reasons. Although the prices seem awfully attractive at first glance, the price hike after the initial period might take you by surprise and not in a good way.",
    "WebHostingBuzz is yet another host from the USA, and one with the same goal as WebHostingPad. That is, to cover everything related to hosting without the need for anyone to break the bank. That being said, WebHostingBuzz doesn’t provide a free domain registration, website builder nor enough self-help options and (evidently) isn’t particularly geared towards beginners. WebHostingPad, fortunately for newbies, is.",
    "WebHostingPad is a well-rounded web hosting provider that can ensure an above-average speed and reliable uptime together with some increasable features, particularly when quality-price ratio is considered. Since their customer support is on par with everything above, WebHostingPad is not hard to recommend, especially to beginners. However, if you are looking for something more ambitious or simply an alternative, HostGator, Hostinger and Bluehost are all good choices, for newbies and veterans alike."
  ],
  "headers": {
    "4": "Plans and pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "18": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "WebHostingPad": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1049926045651749400&xs=1&url=https%3A%2F%2Fwww.webhostingpad.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwebhostingpad",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "domain name registration": "https://www.techradar.com/news/best-domain-registrars",
    "email hosting": "https://www.techradar.com/news/best-email-hosting-providers",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "Power Plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5090014209765425000&xs=1&url=https%3A%2F%2Fwww.webhostingpad.com%2Fhosting%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwebhostingpad",
    "Power Plan Plus": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1290773577059410400&xs=1&url=https%3A%2F%2Fwww.webhostingpad.com%2Fhosting%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwebhostingpad",
    "Weebly": "https://www.techradar.com/reviews/weebly",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "CMS": "https://www.techradar.com/best/cms",
    "online shop": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "KnownHost": "https://www.knownhost.com/https://www.techradar.com/reviews/knownhost",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "WebHostingBuzz": "https://www.techradar.com/reviews/webhostingbuzz"
  }
}