{
  "source": "https://www.techradar.com/reviews/mighty-browser",
  "title": "Mighty browser review",
  "category": "computing",
  "updated": "2021-08-18T19:30:32Z",
  "author": "lindsay-pietroluongo",
  "summary": "High-powered browser for an equally high cost",
  "verdict": "Mighty’s goal is to speed up browsing by moving it to the cloud, effectively extending your computer’s life, but the cost may be too high for most users.",
  "pros": [
    "Improves battery life",
    "Multitasking without slowdowns",
    "Lengthens the lifespan of your device"
  ],
  "cons": [
    "High monthly fee",
    "Waste of power"
  ],
  "article": [
    "Mighty is a new Chromium-based browser that aims to speed up your computer by letting the cloud do the heavy lifting. The company claims that you can have a bunch of tabs open and still use up 10x less memory than Chrome, avoiding the dreaded freezing, stalling or slowing down that all that multitasking often causes.",
    "Built mainly for speed, Mighty “streams your browser from a powerful computer in the cloud.” While this sounds cool – and fast, as they mention a lot on the website – there’s still a big question about if this functionality is actually needed by most people. (And when you hear how much it costs, you may make up your mind pretty fast.)",
    "According to Mighty, when you work with heavy apps (like Figma) in the browser, the process will be offloaded. Because of that, there’s no lag when moving the mouse, scrolling or typing. Plus, your computer won’t make that distracting fan noise (if you have a computer with a fan, that is) even as you do intense work and have a lot running at the same time.",
    "When using Mighty, your internet speed will be over 1Gbps. “You’re running your browser closely connected to the backbone of the Internet where it is peering with other services,” the website says. Your browser will also have 16GB of system memory all to itself. (Each Mighty browser gets 16 vCPUs that use Intel CPUs that run at up to 4GHz.)",
    "Bonus: All of that offloading into the cloud means your computer will get more out of its battery – two additional hours, according to Mighty.",
    "With Mighty, you can use a command to easily see and move between the tabs you have open. Other fast-action shortcuts help with productivity, like Command + M, which opens a Google Doc from your recently-opened docs.",
    "You can opt to get a Zoom meeting reminder one minute before it starts, then use the Command + J shortcut to join it. No more searching for that email with the meeting link that you accidentally deleted.",
    "Lastly, the browser always remains the way you last had it, even if you shut down your computer or switch to a different one.",
    "This is important to keep in mind: For Mighty to perform to the best of its abilities, you have to have a 100Mbps internet connection, which is more than a lot of people have.",
    "The company says you’re protected with various privacy features. Those include browser isolation, encryption, private browser history, and security audits. Plus, your data is never sold, and your logged-in identity is always secure.",
    "Right now, you have to be invited or request access to get a chance to use Mighty. The request-access web form has a lot of questions to fill out, especially about your computer, like how slow it is and how much RAM it has. You’re also asked things like what you use your computer for and how you feel about your browser.",
    "When you’re done, you don’t actually receive anything other than a message saying you completed the form. There’s not even an email waiting for you in your inbox, at least not until (and if) you’re accepted.",
    "As of this writing, it seems that Mighty is an invite-only option for MacOS users. It’s unclear what requesting access actually does, when you’ll hear back after requesting and who is or is not approved.",
    "The target audience for Mighty is … unique. And, probably, tiny. So, you could argue that Mighty doesn’t have any competitors because there’s nothing quite like it – or that every other browser that exists is a competitor because they’re all easier to access. Let’s get into this a bit more.",
    "The problem the browser aims to solve is a prevalent one: Your computer may have difficulty running apps, a browser and/or games, which will make you want to eventually upgrade your computer.",
    "The issue is with their solution: Buy their browser and do all of that in the cloud (great so far) for $30 a month.",
    "Note that the price of $30 per month is not yet published on the Mighty website, but that’s what’s been floating around the rumor mill, and it’s been reported by multiple sources.",
    "That’s a lot of money for most SaaS products, and it’s especially pricy when it comes to Mighty for two reasons:",
    "1. Most browsers are free, even the industry leaders, so it’s “competing” in a sub-category all its own.",
    "2. You could save your $30 per month and level up your computer to a super powerful one in around four years. And if you can’t wait that long because your computer is so lackluster, using Mighty as a browser solution probably won’t be enough of an improvement anyway.",
    "There’s no doubt that a web browser is possibly the most important app on a computer and a necessity on mobile devices. It’s not even far-fetched to think that some power users will be happy to pay up for an excellent (and safe) browser now or in the future.",
    "All of the power that Mighty offers sounds impressive, but it may be far too much for most people. That wouldn’t be a problem if it were free or low-cost. But for such a high price tag, who wants to pay for a service they’re only going to use a small fraction of?"
  ],
  "headers": {
    "2": "Features",
    "5": "Tabs and keyboard shortcuts",
    "9": "Privacy and security",
    "10": "User experience",
    "12": "Platforms",
    "13": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "Mighty": "https://www.mightyapp.com/",
    "browser": "https://www.techradar.com/best/browser",
    "Figma": "https://www.techradar.com/news/remote-workers-are-having-to-juggle-a-mind-boggling-number-of-different-applications",
    "Intel CPUs": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Google Doc": "https://www.techradar.com/reviews/google-docs",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "request-access web form": "https://mightyapp.typeform.com/to/LcRM2O",
    "floating around the rumor mill": "https://news.ycombinator.com/item?id=26959943",
    "SaaS": "https://www.techradar.com/news/what-is-saas"
  }
}