{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
  "title": "Samsung Galaxy Watch review",
  "category": "wearables",
  "updated": "2021-06-17T05:50:06Z",
  "author": "matt-swider",
  "summary": "A bold design, an iconic rotating dial, and a five-day battery life",
  "verdict": "The Galaxy Watch is Samsung's most refined smartwatch due to its helpful fitness tracking and four-day battery life – if you opt for the larger 46mm size that we liked and recommend. All of this is packaged inside a sophisticated-looking circular silver-and-black smartwatch that has a rotating bezel for effortless menu navigation. Be warned, third-party apps are lacking and its iOS support is limited if you're using an iPhone. This is best for Samsung fans.",
  "pros": [
    "Impressive four-day battery life",
    "Great core smartwatch software",
    "Rotating bezel cycles through UI"
  ],
  "cons": [
    "Proprietary wireless charger",
    "Bixby proven to be terrible again",
    "No Google Maps, WhatsApp, FB Messenger"
  ],
  "article": [
    "The Samsung Galaxy Watch is still one of the most refined smartwatches you can buy today thanks to its attractive design, cohesive user interface and, importantly, four-day battery life.",
    "Sure, it's not the newest Galaxy Watch, thanks to its successor, the Galaxy Watch 3 (don't worry, you didn't miss anything – there was no Watch 2). This new watch brings upgrades in a range of areas and if you're looking for a new Samsung watch it's worth checking out our review of it so you can see any improvements.",
    "Saying that, the Samsung Galaxy Watch is still a competitive wristwatch, one which rivals Apple Watches in a few key ways, so it's still worth considering. Its price has dropped since it was superseded by the Galaxy Watch 3, but it remains a good choice in 2021.",
    "The Samsung Galaxy Watch will probably be even more affordable with Amazon Prime Day 2021 deals – and given the discounts we saw last year on Samsung wearables, we expect its big smartwatch to have a price drop when the deals holiday starts on June 21.",
    "The Galaxy Watch looks and feels like a high-end wristwatch, with a circular stainless steel case and stylized bezel. It’s both stylish and functional because, like the previous Gear S3, the bezel rotates to cycle through its various on-screen menus.",
    "This is the most satisfying way to navigate a smartwatch. Your fingers won’t cover up the watch’s small, hard-to-accurately-target touchscreen (an issue with any smartwatch), and the rotating bezel: an idea exclusive to newer Samsung watches.",
    "The older Samsung Galaxy Watch Active is cheaper than the Galaxy Watch, but it doesn't feature that rotating bezel. Thankfully, the newer Samsung Galaxy Active Watch 2 has a rotating digital bezel, with haptic buzzing to simulate a 'tactile' feel when spinning through menus. It is, however, more expensive than its now-discounted predecessor.",
    "And we're expecting even more price drops for the Galaxy Watch during the upcoming deals season leading up to Black Friday on November 27 and Cyber Monday thereafter. We've seen discounts on the Galaxy Watch in years past, and expect even more savings now that its successor has been released.",
    "You also won’t find rotating bezels supported by Google’s Wear OS, while Apple’s watchOS uses a less intuitive rotating digital crown button on the side. This is one of two reasons why the Galaxy Watch runs Samsung’s Tizen software, not Wear OS.",
    "To see the Samsung Galaxy Watch in action, watch our hands-on video below:",
    "The other reason for the Tizen operating system is battery life. We found that the larger 46mm Galaxy Watch lasted a solid four days with normal use during our two months of testing. We checked messages, fetched constant notifications, tracked workouts, played Spotify, and talked to Bixby, Samsung’s mostly terrible AI. Samsung says the smaller 42mm Galaxy Watch lasts three days.",
    "The big difference between the Galaxy Watch and the Gear S3, besides an extra day of battery, is that it’s more fitness-focused, thanks to additional sensors and a revamped Samsung Health app. It auto-detects six of (an expanded) 39 exercises – and still helpfully nudges you when you’re too sedentary, and it has a fairly accurate sleep tracker. It’s also now waterproof down to 50 meters, matching the Gear S3 Sport 5ATM rating in a more adult design.",
    "The Galaxy Watch does inherit problems from previous Gear watches, however – and what's bad is almost all software-related. Samsung’s core apps are polished, sure, but the Galaxy Apps store lacks critical third-party apps, notably Google Maps, Facebook Messenger, and WhatsApp. The Bixby voice assistant is here, but it’s no better than S Voice at understanding us, and Samsung Pay doesn’t use Magnetic Secure Transmission (MST) despite the fact the Gear S3 did.",
    "The Samsung Galaxy Watch is very much the Samsung Gear S4 that never was. It’s an iterative update, one that adds fitness software, new sensors, and extra waterproofing to everything we liked in the Gear Sport and the Gear S3 before that.",
    "The Galaxy Watch launched in the US in August 2018, the same day the Galaxy Note 9 came out, and in the UK in September. Those in Australia had to wait a bit longer, but it's available there too.",
    "At launch, the Galaxy Watch started at $329 / £279 / AU$499 for the 42mm version, and $349 / £299 / AU$549 for the larger 46mm size. When it first came out the Gear S3 cost $349 / £349 (around AU$475), and only came in one size.",
    "We've seen prices fluctuate a little too with it hitting $50 less than the above in the US and around the £250 mark in the UK.",
    "The LTE version of the Galaxy Watch cost a bit more at launch: $379 / AU$599 (about £290) for the 42mm model and $399/ AU$649 for the 46mm version. In the US it began life as an exclusive to T-Mobile, but now you can get it on Verizon, AT&T and Sprint too.",
    "In Australia it's only available with Telstra. In the UK, you can now buy the LTE version of the watch but it's exclusive to EE. It costs £20 per month over the course of 24 months with unlimited data as well as 1GB extra internet for the your smartphone data allowance.",
    "The newer Samsung Galaxy Watch 3 starts at $399 / £399 / AU$649 for the smaller 41mm model for its lowest option and only goes up from there, so if you're on a budget, perhaps this older smartwatch will suit you better.",
    "The Galaxy Watch comes in two sizes: the larger 46mm size in a two-toned silver-and-black color scheme, and the smaller 42mm size in either straight-up Midnight Black or Rose Gold. We tried on both sizes, and recommend the 46mm version for its larger battery and bigger touchscreen – it looks just fine on medium-sized wrists if you don’t mind a slightly bigger watch.",
    "It’s more of a fashion statement than the understated Apple Watch – even with the more screen-focused Apple Watch 4. Samsung's timepiece is big, circular, and meant to look like a wrist watch. We got compliments on its design when wearing it out; there was a lot of surprise that this was a smartwatch in a sea of people wearing the Apple Watch. It stands out.",
    "There’s less variety when it comes to the case colors and included straps. The silver-and-black 46mm watch has three 22mm strap options: Onyx Black, Deep Ocean Blue, and Basalt Grey. The smaller black or rose gold 42mm watch has more 20mm strap variety: Onyx Black, Lunar Grey, Terracotta Red, Lime Yellow, Cosmo Purple, Pink Beige, Cloud Grey, and Natural Brown. Samsung sells extra straps, and any interchangeable 22mm or 20mm will work if you want to change up the style from day to day.",
    "The 1.3-inch Super AMOLED screen (1.2-inch on the 42mm watch) is bright and color-rich, as we’ve come to expect from Samsung’s stellar display technology. It’s easy to see everything, even during an outdoor run, thanks to adaptive brightness settings. And its smart use of blacks, especially in the background, burns fewer pixels on the 320 x 320 resolution. The one downside is that the screen is slow to update when it’s woken – the time and steps show old figures for half a second. It’s like you’re literally waking the watch up from a nap and it’s taking a moment to come to its senses.",
    "The ornate and functional rotating bezel has a third characteristic: it makes the Samsung Galaxy Watch durable. Take it from us – we’ve broken the exposed Apple Watch glass screen more than once. There’s protection here for the screen, with military-grade durability and Corning Gorilla Glass DX+ that prevents the display from getting scratched, according to Samsung.",
    "Two physical buttons adorn the Galaxy Watch, and while they’re on the right side of the case, Samsung has wisely offset them from the usual center location, which means they’re not prone to accidental presses against your bent wrist as on other smartwatches. This is a well-engineered watch – at least during the day.",
    "You’ll want to wear this watch to bed for its helpful sleep-tracking capabilities, but be warned: it’s large and cumbersome to leave strapped to your wrist the entire night. The 46mm version is an ever-present 63g, and it can feel like a rock tethered to your wrist. This is the one (and only) area in which you’ll be in better shape with the 42mm version, which weighs 49g.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "14": "Samsung Galaxy Watch release date and price",
    "20": "Sizes and design"
  },
  "links": {
    "Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Gear S3": "https://www.techradar.com/reviews/wearables/samsung-gear-s3-classic-1327492/review",
    "Samsung watches": "https://www.techradar.com/news/best-samsung-smartwatch-finding-the-right-tizen-wearable-for-you",
    "Samsung Galaxy Watch Active": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-review",
    "Samsung Galaxy Active Watch 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "watchOS": "https://www.techradar.com/news/apple-watchos-5-update",
    "Gear S3 Sport": "https://www.techradar.com/reviews/samsung-gear-sport-review",
    "Gear Sport": "https://www.techradar.com/reviews/samsung-gear-sport-review",
    "Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review"
  }
}