{
  "source": "https://www.techradar.com/reviews/sennheiser-mke-400-2021-review",
  "title": "Sennheiser MKE 400 (2021) review",
  "category": "cameras",
  "updated": "2021-08-06T16:35:18Z",
  "author": "hamish-hector",
  "summary": "A brilliant mic for vloggers",
  "verdict": "The Sennheiser MKE 400 microphone is the perfect companion for travel vloggers or beginner videographers looking to upgrade their audio setup. Its features are easy to use but not quite as in-depth as other options on the market, so experts might want something that gives them more control and better noise reduction.",
  "pros": [
    "Compact design",
    "Good noise reduction",
    "Affordable",
    "Easy to use"
  ],
  "cons": [
    "Wind can cause some problems",
    "Quite basic"
  ],
  "article": [
    "The Sennheiser MKE 400 (2021) is a brilliant compact shotgun microphone that will be perfect for vloggers and budding filmmakers, with its simple yet effective controls and great performance for the price making it easy to produce brilliant results.",
    "The super-cardioid recording pattern and the mic’s low-cut filter (alongside the windsock) do a brilliant job of reducing noise from most sources. Some issues can occur in particularly loud environments, but if you’re careful with your recording, your subject can often cut through the worst of it.",
    "It’s also pretty small and not heavy at all, meaning it won’t weigh your camera setup down. This mic is excellent for carrying around if you’re looking to travel light but still need all your equipment, making it an especially good choice for travel vloggers.",
    "You also won’t need any specialist kit to start using this mic – one of the cables in the box instantly lets you hook it up to your smartphone so you can start recording with just the equipment you already own, although the mic will also work with pretty much any camera if you want to upgrade your setup.",
    "If you’re after more control over your recordings, though, these basic controls won’t be for you, and those with higher budgets might want to opt for a better-performing option. We also wouldn’t recommend using this as a podcasting mic, unless you plan to record audio on your phone.",
    "For a lot of people though, the Sennheiser MKE 400 (2021) shotgun mic will make a perfect addition to their toolkit.",
    "The Sennheiser MKE 400 (2021) is available from a range of outlets and has a list price of $199.95 / £179 (Around AU$270), though you can find it cheaper if you shop around. Even at its full price, the MKE 400 is a very affordable mic in comparison to similar models, and so makes for a great piece of kit for those dipping their toes into the worlds of filmmaking and vlogging.",
    "This microphone definitely lives up to its billing as a compact shotgun microphone: it’s small and very light, so even if you’re someone who already carries a lot of equipment around you should be able to find space for it in your bag.",
    "You’ll just need to have 4.9 x 2.6 x 1.5 inches (126 x 67 x 37mm) of space, and be willing to carry around an extra 93.5g. This size and weight also make it easy to handle, whether it's plugged into your phone or camera.",
    "One small peace-of-mind feature is that the audio output port for the recording has a screw connection, enabling you to secure the cable and ensure that your recording isn’t ruined by a wobbly wire.",
    "Another helpful element is the new headphone jack – this allows you to quickly and easily monitor the audio being picked up by the Sennheiser MKE 400 (2021), so that you can check if it needs adjusting before you hit record.",
    "Our only criticism of the design is that once you put the windsock on, the buttons and ports will be slightly obscured by it. This isn’t a huge deal most of the time, but you will have to remember to attach the audio output cable before putting the sock on – we found the fluff got in the way when we tried to attach the cable after.",
    "We also have one design issue that’s not related to the mic, but to the cables that come with it. If you’re planning to use the MKE 400 as a shotgun mic exclusively with your phone or camera you won’t have any issues with the cables that come packaged with it. People recording on mobile will find them especially useful, as the cable incorporates an adapter that enables it to work with your aux port without add-ons.",
    "However, if you were hoping to use this mic for other uses (say for podcasting or work meetings) you’ll need some extra kit. The two included cables are both very short, and almost certainly won’t be long enough to create a workable PC setup.",
    "The Sennheiser MKE 400 (2021) performed admirably during our testing – we spent several days recording with the mic in as many different scenarios as possible, and we were very impressed with the results. The audio came through clearly, and a lot of the noise from our surroundings was reduced to a respectable level, making it perfect for vloggers and budding filmmakers.",
    "This is thanks to a few features built into the microphone. Firstly the mic is super-cardioid, which means it preferentially records audio from directly in front or behind it, blocking out noise from the side.",
    "In addition, thanks to the mic’s low-cut filter (which you can toggle either on or off) you’re able to easily cut out unwanted low-frequency noise, like road noise or vibrations caused by handling the mic during recordings.",
    "Finally, the gain switch (which can be toggled between -20dB, 0dB and +20dB to make inputs louder or quieter) is a helpful way to balance recordings on the fly, a task made even easier thanks to the headphone jack.",
    "This aux port and adjacent volume buttons let you quickly and easily monitor what the mic is recording in real-time, letting you make adjustments as you need to. This will undoubtedly save you a lot of time – and pain – when you think you have the perfect take but then realize that you have to go again because the gain was set too high and the audio is blown out; if you’ve ever had this happen, you’ll know how frustrating this can be.",
    "Recording in areas with a lot of background noise from all directions, or when the wind picks up can lead to some problems, although in most cases we found that by adjusting the settings and making sure to angle the microphone correctly to take advantage of the cardioid profile we could still make out what our subject was saying quite clearly.",
    "You can also always rely on the windsock to help reduce wind noise. This incredibly fluffy cover is very effective at helping to cut out unwanted sounds, and there’s rarely any reason not to slip it onto the Sennheiser MKE 400 (2021)."
  ],
  "headers": {
    "0": "One minute review",
    "6": "Price and availability",
    "7": "Design",
    "14": "Performance",
    "21": "Don't buy it if..."
  },
  "links": {}
}