{
  "source": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
  "title": "Microsoft Surface Pro 7 review",
  "category": "computing",
  "updated": "2021-12-02T14:21:40Z",
  "author": "joe-osborne",
  "summary": "The calm before a storm of innovation",
  "verdict": "We expected a bit more in advancements from the seventh Surface Pro tablet. USB-C is nice, but for a device at this price, its should be Thunderbolt 3. Plus, the display bezels are awfully thick for a tablet in 2019. The Surface Pro 7 isn’t big enough of a leap over the Pro 6 for us to recommend it to either upgraders or folks just getting into Microsoft’s tablet.",
  "pros": [
    "Vastly improved performance",
    "USB-C finally",
    "Now with Wi-Fi 6"
  ],
  "cons": [
    "Overall loss in battery life",
    "USB-C isn’t Thunderbolt 3",
    "Few, if any, other design changes",
    "Screen bezels are thick for 2019"
  ],
  "article": [
    "We had hoped the Surface Pro 7 would have fixed all the issues that the Surface Pro 6 had when it was released. But, its successor unfortunately does not do much to right the ship. This was the perfect opportunity to get the product line back on course but this update ends up falling short where it matters.",
    "That’s not to say that there are no improvements here. The Surface Pro 7 comes with the increasingly important USB-C port as well as some updated components. But, there’s not much else beyond that making this a hard device to recommend unless you want to stick with the Surface Pro line and have an outdated model. In fact, if you’re willing to spend the extra cash, the newer release, Surface Pro 8, is the better machine.",
    "As with the Surface Laptop 4, this shows that Microsoft can still make great portables when it makes the effort. It’s just that the Microsoft Surface Pro 7 comes up short. If you’re on a budget however, you could potentially get it at a good price now that a newer model is available.",
    "The new Surface Pro 7 starts at $749 / £799 / AU$1,249 as with previous versions and comes without the Type Cover ($129, £149, AU$249) and Surface Pen ($99, £99, AU$139) included. That means, this price is par for the course.",
    "That base configuration gets you an Intel Core i3 processor (CPU) 4GB of memory (RAM) and a 128GB solid-state drive (SSD), with the latter points upgradeable to as much as 16GB and 1TB capacity, respectively. Here’s how those upgrades break down:",
    "This pricing, again, is inherited from previous versions, but it's still not a great deal when you're spending upwards of 1,000 bucks or quid to get the full experience with the accessories that are still sold separately.",
    "The Surface Pro 7 that we’re reviewing here will cost you $1,199 in the US. Again, that’s without the Surface Pen and Type Cover that Microsoft has included in our review sample. To get the full Surface Pro experience at this configuration, you’ll be spending around $1,460 in the US.",
    "That said, a similarly configured 12.9-inch iPad Pro – with 256GB of storage, the Smart Keyboard Folio and second generation Apple Pencil – will cost around $1,480 in the US. Apple is just as guilty for selling accessories separately that are arguably central to the experience.",
    "So, it doesn’t look like Microsoft is way out on left field with its pricing, and you’re getting a full mobile PC with Microsoft’s tablet option, but it’s nevertheless egregious.",
    "Microsoft may have finally included a USB-C port, but absolutely nothing else has changed about the Surface Pro 7 design from last year’s model. The device still measures 11.5 x 7.9 x 0.33 inches (292 x 201 x 8.5mm) and weighs 1.7 pounds (770g). The tablet also still comes in the same matte black and silver aluminum finishes.",
    "The tablet's touchscreen still comes in at 12.3 inches on the diagonal with a 2,736 x 1,824 resolution (267 pixels per inch) and 3:2 aspect ratio. It's just as sharp, vibrant and responsive to touch as the previous generation, which was already quite impressive. But, again, this specification hasn’t changed in years, and could use an update at least in features, such as HDR and enhanced color gamut coverage. Also, the bezels are awfully thick for a tablet of this price in 2019.",
    "Now having issued practically the same tablet for two years, it’s becoming clear that either Microsoft has reached its limits on the original Surface Pro design, which is unlikely, or the company is simply no longer interested in tweaking the Surface Pro any more – except for tinkering with the Pro X.",
    "Instead, it feels like Microsoft is far more inspired by its upcoming dual-screen devices, which will likely herald the future of the company’s hardware design – depending on how successful they are.",
    "As for the most major Surface Pro 7 design change, we get USB-C at long last, but it’s on the USB 3.1 standard and not Thunderbolt 3. With that, you get the versatility of this new connection without the raw throughput of the Thunderbolt 3 technology.",
    "Apple and countless other competitors at similar price points have widely adopted Thunderbolt 3, which makes its absence in the Surface Pro 7 more glaring. While Apple didn't including it in the iPad Pro, it did with the similarly-priced 13-inch MacBook Pro, for example.",
    "Now, Microsoft has improved the device's studio microphones for stronger accuracy when using Cortana with your voice, but that's such a minor improvement it's hardly worth mentioning.",
    "In Microsoft’s favor, however, the Type Cover keyboard now has deeper-feeling travel as well as a bouncier feel as our fingers leave the keys. This is an upgrade for sure, though will certainly be an adjustment for longtime Surface Pro users – at least for a few minutes. Meanwhile, the Type Cover’s touchpad remains unchanged, and is just as smooth and responsive to the touch as ever.",
    "We also appreciate the Alcantara fabric that makes a return with this Type Cover, which appears and feels to be more tightly woven than before. Hopefully this will make the fabric more stain resistant, as Microsoft claims.",
    "All told, this is essentially the same Surface Pro you’ve known for years, only now it features a more versatile USB-C port in lieu of a DisplayPort connection. Why not drop the original USB-A as well for another USB-C? Who knows. There is a lot that could have been done to improve this product at the same price that simply wasn’t done, so forgive us for being nonplussed by the Surface Pro 7 design and feel."
  ],
  "headers": {
    "3": "Price and availability",
    "9": "Design"
  },
  "links": {
    "Surface Pro 6": "https://www.techradar.com/reviews/microsoft-surface-pro-6",
    "Surface Pro 8": "https://www.techradar.com/reviews/microsoft-surface-pro-8",
    "Surface Laptop 4": "https://www.techradar.com/reviews/surface-laptop-4",
    "12.9-inch iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2018"
  }
}