{
  "source": "https://www.techradar.com/reviews/gate",
  "title": "Gate review",
  "category": "computing",
  "updated": "2021-06-15T05:03:49Z",
  "author": "mirza-bahic",
  "summary": "Premium managed WordPress at a fair price",
  "verdict": "Gate is one of the pioneers of the web hosting industry and it hails from the USA. For more than two decades they have been making a name for themselves by providing reliable, feature-packed hosting solutions that are also focused on network security. Although their managed WordPress solutions are a good thing, it may actually be too much of a good thing for users with simpler needs.",
  "pros": [
    "Exceptional 90-day money-back guarantee with “no questions asked”",
    "Free SSL certificate included with all plans",
    "Technical team is available 24/7",
    "Wide array of features"
  ],
  "cons": [
    "Lack of beginner-friendly features",
    "Not many hosting options"
  ],
  "article": [
    "Established in 1996, Gate is one of the better-known (and highly experienced) companies in the web hosting industry that offers well-structured and budget-friendly hosting solutions to small and medium sized businesses all over the world. According to them, back in the day there was a gap in the marketplace and the one that was screaming for a comprehensive and highly secure solution which won’t do a lot of damage to one’s budget.",
    "To address this need, they’ve focused their resources on providing the “best-in-class” managed WordPress solutions, with a special attention given to issues of security, as well as website management and maintenance. Their main office is situated in Chicago (the USA), but they have several stations in the USA, Canada and Europe. As a part of Hostway Corporation, they share their US-based data centers with powerful corporations such as Disney, Wrigley and Fox News Channel.",
    "Gate’s main website has completely altered its appearance in the last few years and for the better, both in terms of aesthetics and functionality. However, it is available in English language only, which suggests that their target market belongs to the English-speaking parts of the world.",
    "Gate’s website features a blog which seems to be their latest addition to the site, since it includes a total of five articles, two of which contain links to articles on other sites. They are, however, nicely written and rich with information about the services they provide. They don’t seem to be particularly active on social networks, even though they were so in the past, most notably on Facebook.",
    "Gate currently features three high-end managed WordPress hosting solutions with an enterprise-level security, “all-in-one suite” of management tools and a myriad of attractive features. All plans are displayed in meticulously detailed yet easily understandable manner and include dedicated managed virtual machine from “new era”, premium security, “WordPress Toolkit” (automatic updates, daily backups, one-click staging, one-click installer, WordPress instance sync and one-pane-of-glass-to-rule-them-all), unlimited monthly visits, free SSL certificate and free migration for all of your WordPress websites (if you possess them, that is).",
    "The most affordable one out of three is labeled as “Core” and it will cost you $36.75 for a month (if you subscribe for a year) and $49 if you choose to go for a month only. Although far from something one would describe as budget-friendly, “Core” is, by all means, reasonably priced if we take into account all the features it includes.",
    "Although Gate doesn’t provide a free trial, there is an incredible 90-day money-back guarantee and a promise they will refund everything you paid them in full with no questions asked.",
    "As for payment methods, Gate currently accepts all major credit/debit cards, PayPal and they claim to support Apple Pay, Google Pay and Microsoft Pay as well, so there is a decent amount of choice.",
    "Given that Gate is a provider of managed WordPress hosting solutions, since you are interested in it, you, presumably, already have an idea about what it is that you want. If you are, however, mistaken and not quite sure where to start, you have an option to book a demo with Gate’s team. You can do this by providing them with some personal data (your name, e-mail address and a phone number) and patiently wait for them to reach you and show you around Gate’s platform.",
    "Keep in mind that all of this will be available to you under one condition (and one condition only) and that is that you are not a robot. If you are, however, a robotic machine capable of hiding its identity with a single click (on “I’m not a robot” check, which anyhow sounds like something a robot would say), do so, by all means, for we are not here to judge.",
    "On the other hand, if you want to create an account with Gate, you’ll be pleased with how simple and short the whole procedure is. After opting for a plan, you’ll proceed with deciding what to do with a domain name, and, in addition to all the anticipated options, you’ll have a choice to start with Gate’ own subdomain (wp.gate.com) and add your own domain later on. After this, you’ll have an opportunity to configure your plan by selecting a billing cycle, server location (for “Core” two are available at the moment) and site title.",
    "During the final steps you’ll be asked to provide a pretty standard amount of personal information, choose a method of payment, create a password and proceed to checkout. After the verification (most likely via e-mail), your website shouldn’t take too long to appear.",
    "Gate’s dashboard matches its website in color and functionality, and if you have any prior experience, you'll find it very user-friendly. All hosting packages include Plesk as its control panel, which is (although slightly outshined by cPanel) pretty easy to use.",
    "Gate promises nothing less than a “high caliber performance” thanks to the (as they elaborate) “built-in speed kit theology to accelerate your website speed, retain traffic, and increase revenue”. They continue to emphasize the importance of speed by sharing a trivia that 40% of visitors on average will abandon a website if it takes more than three seconds to load. After reading all this, we had high hopes while waiting for GTmetrix to give us the results of the speed test performed on their main website.",
    "It’s no wonder we had to do a double take when faced with a D (60%) and a fact that it took 6.1 seconds for Gate’s website to fully load, which is better than average result (8.1 seconds), but twice as many as three seconds they took as the example above.",
    "As for uptime, it seems there was a 100% uptime guarantee at some point, but we couldn’t find anything about it at this moment. However, after monitoring uptime of Gate’s main website for a month (provided by Uptime Robot), we were presented with a report showing 99.6% of uptime, which is, regrettably, below the industry standard. Most instances of downtime were fairly short (average score being around five minutes), but the most concerning one lasted for 2 hours and 43 minutes, which isn’t looking too good.",
    "Describing its own customer support as “mission-critical”, Gate offers its users access to it around-the-clock so as to make sure (as they say) that “your WordPress site is stable, secure, and lightning fast.” The technical team can be reached via email, ticket (for sales) and telephone. Since there were no promises regarding the response time, we submitted a support ticket with a few simple inquiries and got our response in little over 30 minutes, which is good enough.",
    "For those who would rather fend for themselves, there is a knowledgebase and a well-made one. There, you can browse articles by picking out a category (and there are eight of them, including the one for newcomers), clicking on a tag, using a search box or opting for one of the popular ones (five are displayed at the bottom of the page). Although there isn’t a great deal of them (around 60 at the moment), the knowledgebase has managed to cover all the important issues about WordPress hosting in an easy-to-understand way, with most of the articles containing suitable pictures as well.",
    "One of Bluehost‘s latest products is (you’ve guessed it) managed WordPress hosting solutions, and the ones that will give you a bang for the buck. Bluehost may not offer some of Gate’s attractive unlimited features or erect an equivalent of a digital fortress in terms of security, but with a promotional price of $14.95 per month it can draw many users to it.",
    "Besides offering premium WordPress hosting with an array of attractive features, HostGator has basic shared hosting, VPS, reseller and dedicated servers as an option, so it can cover most small to medium-sized businesses, while Gate doesn’t. What is more, all WordPress plans with HostGator (premium or not) come with a free domain registration, 99.9% uptime guarantee, 45-day money-back guarantee and $150 worth of Google Ads credit, which is a nice little bonus.",
    "SiteGround is quite a popular choice for all those who are looking for managed WordPress solutions specifically, and with good reasons for it. Like Gate, they offer plenty of powerful features for advanced users, yet have a lot of basic ones to boost the confidence of newcomers as well. However, since Gate uses industry-standard Plesk as a control panel, it may be attractive to those who are familiar with it. On the other hand, SiteGround utilizes their own control panel, which is (to be honest) one of the best custom-made control panels we have seen so far.",
    "Established in 1997, DreamHost is one year Gate’s junior. Both hosts essentially offer an endless list of features even with its most pocket-friendly WordPress packages. That being said, with DreamHost you’ll get a few more, including a free domain name for a year, a 100% uptime guarantee and (as of late) free drag-and-drop WP website builder filled with templates. However, DreamHost’s money-back guarantee is valid for the standard 30 days, while with Gate you are free to wait an “eternity” of 90 days before making a final judgement.",
    "Gate promises first-class managed WordPress hosting installed in a dedicated virtual machine environment, enterprise-level security and a complete set of website management tools, and it delivers on that promise, beyond all doubt. However, for bloggers and those who want to launch their first websites into cyberspace, all of this may be an overkill.",
    "Although Gate’s substantial 90-day money-back guarantee implies you can try them out with no need for concern, if you’re not mad about managed WordPress, take a look at what HostGator and Bluehost are capable of offering before making any decisions."
  ],
  "headers": {
    "4": "Plans and pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "16": "Support",
    "18": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Gate": "https://gate.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "managed WordPress": "https://www.techradar.com/news/best-managed-wordpress-hosting",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Core": "https://gate.com/pricing/",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "SiteGround": "https://www.techradar.com/reviews/siteground",
    "DreamHost": "https://www.techradar.com/reviews/dreamhost"
  }
}