{
  "source": "https://www.techradar.com/reviews/therabody-theragun-prime",
  "title": "Therabody Theragun Prime review",
  "category": "fitness",
  "updated": "2021-11-03T12:03:58Z",
  "author": "rob-clymo",
  "summary": "Enjoy pinpoint muscle massage the easy way with the Theragun Prime",
  "verdict": "The Therabody Theragun Prime is an excellent middle-ground option for anyone wanting to tackle massage and muscle relief challenges without knowing where to start. Central to the appeal of the Prime model is its accompanying app, which offers real-time visual guidance based on an individual’s needs. Combined with the ergonomic design of the Prime the app helps you exploit the power of the gun’s brushless motor. While the selection of just 4 heads might seem a little frugal there’s more than enough inside this particular box of tricks to help aid muscle relief and reduce stress all through the potent delivery of percussive massage.",
  "pros": [
    "Fab ergonomic design",
    "Excellent supporting app",
    "Great restorative performance"
  ],
  "cons": [
    "More power than you might need",
    "Limited head selection",
    "No carrying case"
  ],
  "article": [
    "Billed as a 'smart percussive therapy device', the Therabody Theragun Prime is a step up from the myriad other massage guns on the market. It’s a complete solution that comprises the innovative gun design with its distinctive triangular handgrip along with four precision massage heads.",
    "The device features five speeds with settings augmented by the supporting Therabody app. This brings extra features and functionality to the party and integrates with Apple Health and Google Fit to boot.",
    "Performance is also impressive with 16mm amplitude, meaning that it’s got the potential to offer a more intense massage and therapy experience than many rivals. With 120-minutes of runtime from the brushless motor on offer the Therabody Theragun Prime is easily one of the best in its class.",
    "The Therabody Theragun Prime costs $299 from Therabody in the US, £275 in the UK, and AU$499 in Australia. It can also be found via Amazon in the same locations.",
    "That's about par for the course for a mid-high end massage gun, and is around the same price as the Hydragun (though that device lacks the Theragun's Bluetooth connectivity and smartphone app).",
    "Therabody is one of the biggest names in the massage therapy marketplace and there’s something to suit every need from its sizeable product portfolio. This model, the Theragun Prime, is instantly recognisable as a Therabody device because of its distinctive triangular styling that looks like it means business.",
    "It sits at the lower end of the Therabody pricing spectrum, just above the portable mini model but is still a cheaper option than the Elite and Pro models. In fact, looks-wise it shares the same design ethos as the Elite or Pro and is put together just as nicely too.",
    "Opening the box reveals just how well designed and manufactured this massage therapy gun is. Admittedly, it doesn't come with a zip-up carry bag like many other models we’ve looked at recently, but there’s a soft cloth bag for keeping your Theragun in if you decide to ditch the box and that’ll also hold the other included accessories. There’s not a lot else: four assorted heads, a power cord and adaptor, plus a collection of mini manuals and other paperwork round out the contents.",
    "The Therabody Theragun Prime's four attachments mean it can tackle most stress-busting and massage requirements, but you can buy more from Therabody if needed though. There’s a Dampener, which can be used for sore and tender areas as well as near bone.",
    "The Standard Ball is a great all-rounder, which can be used for more general massage work. The Thumb tool, meanwhile, is aimed at letting you home in on precise areas using trigger point therapy. Similarly, the Cone attachment can be called upon to handle any pinpoint muscle treatment needs you may have.",
    "Perhaps the most impressive aspect of the gun’s design is the way you attach the massage heads. The unit has a steel rod protruding out of the massage barrel and to fix heads to this you simply line up the slot in the attachment and press it firmly down over two compressible ball bearings. This has the effect of locking the massage head in place, preventing it flying off mid-massage, which can tend to happen with some of the cheap, and no so cheap, push-fit models on the market. We’re really impressed with its performance so far. To remove a head you simply reverse the procedure.",
    "The Therabody Theragun Prime is a smart percussive therapy device and that’s because performance can be enhanced with the help of its supplementary app. While you can still use the Theragun Prime on its own it’s definitely a very good idea to get the app, which works on both iOS and Android devices, as you’ll be able to get more from its capabilities. Actually, getting the app couldn’t be easier, as there’s a QR code to scan in amongst the paperwork, so you can be up and running in a few minutes.",
    "First, you'll need to create an account, and pair the device with your phone via Bluetooth. Once you’ve got that in place you really start to see why the app is such a key part of owning a Theragun device. The company has done a really good job with the software, which explains everything you need to know about the gun and offers a small mountain of advice on how to get the best from it.",
    "New users can pick through a range of helpful options and create a custom plan of massage therapy, Taking this route lets you create massage sessions to suit particular problem areas, and the app guides you through your workout in real time, showing how long to spend on each area along with how to apply the massage using colorful graphics.",
    "The app not only stops you doing things wrong, it also illustrates just how easy it is to get things right. In our case, with a little bit of guidance from the app, and after specifying the ankle area as a location of particular need, we found that the gun was able to help with muscle relief by targeting that specific area. The great thing about all this is that you can adapt it to suit changing needs or, of course, create another profile and have the Theragun do the same for someone else. The gun speed can also be controlled using the app, which in some ways works better than using the physical buttons on its handle.",
    "It's worth bearing in mind that the Theragun Prime is one of the most powerful massage guns out there, and its higher settings are quite potent. Again though, if you follow the guidance offered by the app you’ll find that it’s much easier to channel this energy and get the gun to do the right things come massage time.",
    "Considering how much power it packs, we were impressed by how long the Theragun Prime lasted between charges. Therabody states that you can expect 120 minutes or so runtime from the gun and we see no reason to disagree with that. Charging it is done using the included power cable and adaptor, although you can’t use the gun while it’s plugged in.",
    "After a few sessions with the unit you really start to get a feel for how best to hold it; the triangular design works much better than more traditionally styled models in that respect.",
    "Delivery of the massage is largely excellent thanks to the 16mm amplitude. It’s high-powered for sure, but the overall feeling you get is that this is a machine that has been designed and engineered by folks who know exactly how to hit the right spot.",
    "Theragun claims this gun is 70% quieter than earlier models, but we did find it a bit noisy nonetheless. That said; this is really the only minor negative we can think of when it comes to the Theragun Prime. It’s therefore easy to see why Therabody is the brand of choice for many individuals looking for effective muscle and massage relief."
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Price and availability",
    "5": "Design",
    "11": "Performance",
    "20": "Don't buy it if"
  },
  "links": {
    "Google Fit": "https://www.techradar.com/news/google-fit-all-about-the-smartwatch-and-phone-fitness-app-and-what-sports-it-tracks",
    "Therabody in the US": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1460358091563053300&xs=1&url=https%3A%2F%2Fwww.therabody.com%2Fus%2Fen-us%2Fprime-us.html%3Fdwvar_prime-us_color%3Dblack%26cgid%3Dpercussive-devices-accessories%23prefn1%3DproductTypePLP%26prefv1%3Dpercussivedevices%26start%3D1&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ftherabody-theragun-prime",
    "in the UK": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6386766729995272000&xs=1&url=https%3A%2F%2Fwww.therabody.com%2Fuk%2Fen-gb%2Fprime-blk-euuk.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ftherabody-theragun-prime",
    "in Australia": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1400971553978508300&xs=1&url=https%3A%2F%2Fwww.therabody.com%2Fanz%2Fen-au%2Fprime-blk-anz.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ftherabody-theragun-prime",
    "Hydragun": "https://www.techradar.com/reviews/hydragun"
  }
}