{
  "source": "https://www.techradar.com/reviews/echelon-smart-rower",
  "title": "Echelon Smart Rower review",
  "category": "fitness",
  "updated": "2021-03-16T11:33:01.266Z",
  "author": "daryl-baxter",
  "summary": "A great alternative to cardio workouts in your home, with a foldable design to stow away",
  "verdict": "The Echelon Smart Rower is a well built, beginner-friendly rowing machine that pairs with the company's mobile app so you can join in hundreds of instructor-led workouts (both live and pre-recorded). It's a great package, and the machine is well designed for home use, but the monthly app subscription fee is pretty steep, so you'll need to make sure you're committed to your new exercise routine before investing. A great alternative to a smart bike or treadmill if you want to focus on your upper body,",
  "pros": [
    "User-friendly design",
    "Folds easily for storage",
    "Intuitive mobile app",
    "Nearly silent"
  ],
  "cons": [
    "Expensive subscription fee",
    "Short 12-month warranty"
  ],
  "article": [
    "The Echelon Smart Rower is an indoor rowing machine that allows you to to take part in live or on-demand workouts – whatever your level of experience. Its design will help the most inexperienced beginner get to grips with proper rowing form, and it folds down surprisingly small too, making it a practical choice for anyone with limited space at home.",
    "At $1,039.98 / £1,199 (about AU$2,000), it costs about the same as most mid-range commercial air rowers, and has the solid build quality you'd expect at that price level. However, it's Echelon's app that really makes the Smart Rower special. Available on both Android, iOS and iPadOS, it gives you curated content by specialized trainers who will push you to go that extra mile, while listening to a playlist full of licensed music.",
    "The app requires a substantial subscription fee of $39.99 / £39.99 (about AU$50) a month, which may seem expensive, but if you want to go all-in on the health kick, it's worth the cost.",
    "The Echelon Smart Rower is a heavy investment and a commitment to yourself; it has a design that fits the home well, with an application that’s intuitive to use, but at a price. It really comes down to your priorities, but if you plan to make rowing part of your regular routine then it could well be worth the cost.",
    "First announced at CES 2018, the Echelon Smart Rower is available to buy now for $1039.98 / £1,199 (about AU$2,000), with monthly payment plans available to break up the cost. It can currently be shipped to the US, Canada, Mexico, the UK and France, though hopefully Echelon will soon be extended further afield. The the time of writing, delivery is expected to take between three and seven working days.",
    "The Echelon app is subscription-based, with monthly, annual and biennial plans available. Echelon United costs $39.99 / £39.99 (about AU$50) when billed every month, $399.99 / £399.90 (about AU$500) when billed every year, or $699.99 / £599.85 (about AU$900) when billed every two years.",
    "There's a 30-day free trial so you can put it to the test before committing, and you get equipment-free workouts in addition to the guided rowing sessions, but that's a pretty steep price.",
    "It becomes better value if you own other Echelon equipment, such as the Echelon Smart Connect EX3 Max Bike, but we would have preferred to have a subscription level that takes into consideration the product that you've bought, with a lower fee if you only have one machine.",
    "The Echelon Smart Rower in a variety of pieces, but the packaged instructions help you decipher them with ease, while a step-by-step guide ensures that you have a working machine within the hour. It’s a high-end design constructed from a mix of metal and plastic, with the rower part looking more like a jet engine.",
    "The Smart Rower has been made with the home in mind; simply taking the design of a rower that you see in the gym, and placing it in the home simply wouldn’t work. At worst, it would have been a major irritant to you and others living with you, so it's welcoming that Echelon put the home to the forefront of this design.",
    "Its measurements are fairly large at 212cm x 106cm x 52cm, which means you'll need plenty of floor space to accommodate it. Fortunately, Echelon has come up with an innovative solution: this rowing machine folds. Pressing a lever to the back of the machine allows the section with the seat to lift up, cutting the full length of the machine in half.",
    "The handlebar has a good grip, with easily-accessible buttons to control the 32 levels of magnetic resistance when needed, while the seat is comfortable enough for long workouts.",
    "The foot pads are easily adjustable, with three settings that cater to most adult foot sizes. When the exercises become faster and more intense, the strap keeps your feet in check and stops you from letting loose mid-workout.",
    "There’s a clamp that can attach your smartphone or tablet, which is essential for the Echelon Fit app that makes this rowing machine 'smart'. Found in both the App Store and Google Play, it allows you to simply pair the machine with your phone, and once you’ve created your account and paid the membership, you’re good to go.",
    "The app has its share of negative reviews, but we found it well designed, with a UI that can guide any user to the right workout, and a navigation tab bar at the bottom to easily track your progress, join in live content from a fitness trainer, or look ahead to the week to take part in any upcoming live workouts. There are also over 900 pre-recorded workouts that you can join on demand, so there's always a new challenge.",
    "Echelon Fit can also work in tandem with Fitbit and Strava accounts, so you can track your fitness and compete with friends virtually too.",
    "However, you can also use the Smart Rower without the app and its subscription, and it's a well build piece of equipment that functions well as a conventional rowing machine. That's good news, because while the app and its content are high quality, you may decide it's too costly to keep rolling long term, or you might find that you need to cut back on expenses at a later date.",
    "The Smart Rower is Echelon’s first foray into the world of rowing machines, so we weren’t sure as to how it would compare with those found in a typical gym. However, after using it for a month, we found it eclipsed the performance of a commercial rowing machine, justifying its relatively high price tag.",
    "The handlebar is made from a great quality material, helping you maintain a strong grip throughout your chosen workouts. Changing between resistance levels was fast and responsive, and thanks to the app, you can see which level you’re currently at, so if you lowered it in error, you can quickly correct it.",
    "There are 32 resistance levels to choose from. However, while this writer found them challenging at level 30, a daily routine in weights for the last year made lower resistance levels feel very light. With this in mind, these resistance levels are better suited to someone who is a beginner in wanting to change their exercise habits and focus on their upper body strength, rather than buy a set of weights.",
    "The machine is surprisingly quiet in use, especially when you factor in the resistance and the intensity of the movements, which is a credit to the design. Echelon says that the machine's belt drive and silent flywheel system help reduce noise – and it’s completely right.",
    "When you're following a workout in the app, you will notice that you are in a class of other users, and there is a temptation to compete against someone else. The app doesn’t push you to do this, but you'll feel motivated to do more reps if you pick a rival to row against.",
    "The design of this app is to be complimented here; it’s clean, informative and even the windows can be hidden during a workout, so you can focus on the trainer only if you decide to.",
    "There's plenty of variety too: from intense workouts take place live in a studio (so you may even get a shout-out from the instructor while exercising) to calming cruises along a virtual river. The tranquillity of feeling as though you’re rowing elsewhere is oddly relaxing, and it's the escapism that also adds to your mental health, which is a fantastic benefit here thanks to the app and the Smart Rower.",
    "There really isn’t a disadvantage to the machine itself that made the Rower feel out of place. The resistance levels could be heavier when reaching the max of 32, but that’s a small complaint when you factor in the app and the design of the Rower. Its function is to focus on one form of cardio workout to help up to 85% of your body’s muscles, and it does it fantastically here.",
    "The only downside we could see was the warranty. At 12 months, it feels somewhat short; you want to be sure that a machine like this, at this price, will last much longer than a year."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Echelon Smart Rower price and availability",
    "8": "Design and setup",
    "17": "Performance"
  },
  "links": {
    "Echelon Smart Rower": "https://bit.ly/2Nne6yh",
    "Echelon Smart Connect EX3 Max Bike": "https://www.techradar.com/reviews/echelon-smart-connect-ex3-max-bike",
    "App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1089193093543273500&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fgb%2Fapp%2Fechelon-fit%2Fid1262424186",
    "Google Play": "https://play.google.com/store/apps/details?id=com.viatek.fitnation.echelon_android&hl=en_US&gl=US",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Strava": "https://www.techradar.com/how-to/use-strava"
  }
}