{
  "source": "https://www.techradar.com/reviews/huawei-matepad-11-review",
  "title": "Huawei MatePad 11 review",
  "category": "tablets",
  "updated": "2021-12-05T23:37:48Z",
  "author": "tom-bedford",
  "summary": "A low price and top specs make up for rough edges",
  "verdict": "The Huawei MatePad 11 comes with top specs, a fairly long-lasting battery and a great-looking screen, making it a worthy Android-alike tablet. Its low price will appeal, too, in particular to students looking for a tool for work and play. However, the app situation is an issue, due to Huawei's problems in that area, and while lots of popular apps are available, there are still a few key ones that aren't, or don't work properly.",
  "pros": [
    "Fairly inexpensive",
    "Good-looking screen",
    "Commendable battery life"
  ],
  "cons": [
    "Missing or broken apps",
    "Troubles with keyboard folio",
    "No headphone jack"
  ],
  "article": [
    "Since the Huawei ban in mid-2019 put a halt to the company using Google's Play Store on its devices, thereby making apps pretty hard to come by, our recommendation of each subsequent gadget from the company has been closely linked to the app situation at that time.",
    "With the Huawei MatePad 11, a mid-range slate we'd best summarize as a rival to the entry-level iPad, the issue has been largely addressed, so we can recommend the tablet. Many productivity, lifestyle and gaming apps are fully available to download and use.",
    "This isn’t facilitated by Huawei's AppGallery, mind. It’s through Petal Search, a platform that lets you hunt for APKs (or Android Package, basically a way to install apps from websites, not an app store). The vast majority of top apps are available this way, although paid titles are absent.",
    "With this development, we could largely test the MatePad 11 like we would any other tablet. We played rounds of Call of Duty: Mobile and PUBG Mobile, and streamed music from Spotify and movies from Netflix and Prime Video. We were able to check emails on Hotmail and actually wrote this review on the tablet, using WPS Office.",
    "The Huawei MatePad 11's hardware is the real champion here. Its 2K, 120Hz refresh rate display looks great; the Snapdragon 865 chipset provides all the processing power necessary for a range of tasks; the 7,250mAh battery keeps the slate ticking along for a decent length of time – and the quad speakers sound great, too.",
    "As a result, this is a great jack-of-all-trades tablet. If you’re looking for a compact entertainment device, the MatePad 11 will suit you well, but it's also fairly useful as a productivity portable or business companion – or even as a big-screen device for checking your social media on the go.",
    "There are some caveats, though, which hold us back from wholeheartedly recommending this slate. For example, we found that some streaming apps output video at a lower resolution than they would on rival devices, likely since they're not natively optimized for the slate. Workarounds for certain Google apps proved buggy – our attempts to write this review via Google Docs didn’t go well.",
    "We didn't test the MatePad 11 with the M-Pen stylus, which most buyers will get with the tablet, but we did use the keyboard folio that clips to the slate magnetically. Unfortunately, we encountered a few problems. The magnets aren't particularly strong, which meant that there were times when the slate would disconnect from the case while we were using it as a stand. Furthermore, the case is quite wobbly; sometimes, when we were typing fast the screen would shake as a result.",
    "Overall, the Huawei MatePad 11 is a good tablet then, but not necessarily a great one. There remain some software improvements we need to see before we can give a Huawei device a wholly glowing review. Still, compared to the company’s tablet launches over the past two years, the MatePad 11 is definitely worth checking out, and it stands up well to devices from Samsung or Apple.",
    "The Huawei MatePad 11 costs £349.99 in the UK for the 128GB storage model, which converts to around $490 or AU$660; but it appears the tablet will only go on sale in Europe.",
    "The MatePad 11’s price is fair for a mid-range device – for context, the 2020 model of Apple's iPad 10.2 costs $429 / £429 / AU$649 for 128GB, while you'll be paying £629 (roughly $830, AU$1,150) for the 128GB version of the similar-spec Samsung Galaxy Tab S7 FE. As such, the MatePad 11's price is highly competitive.",
    "The Huawei MatePad 11 feels more 'iPad Pro' than 'iPad', as a result of its slim bezels and slender body, and it's fairly slender compared to many other low-cost Android tablets, although it’s not exactly a huge departure from them either.",
    "At 253.8 x 165.3 x 7.3mm, the MatePad 11 is fairly thin, and its aspect ratio makes it longer and less wide than your standard iPad. It weighs 485g, which is about average for a tablet of its size, although it feels notably heavier than the dainty Amazon Fire HD tablets.",
    "You’ll find the device’s front-facing camera on the top bezel with the MatePad in a horizontal orientation, which is a convenient placement for video calls. In this position, there's a volume rocker on the left side of the top edge, while the power button can be found along the top of the left edge. While the MatePad 11 includes a USB-C port on the right edge, there’s no 3.5mm headphone jack. This might prove an annoyance for those who prefer wired cans (or who want the MatePad to entertain a child, who might struggle with wireless audio).",
    "On the back, there's a camera bump. It doesn't protrude too far, but it's surprisingly big considering there's only one camera. Most budget slates tend to have fairly unobtrusive rear bumps.",
    "The rear of the MatePad 11 is clad in plastic. It feels far more premium than the relatively cheap-to-the-touch acrylic of the Amazon Fire tablets, although not so against the aluminum of the entry-level iPad line. Plastic is a hardy material, though, which means the MatePad 11 will likely be well-protected from knocks and bumps. The tablet doesn't appear to have an IP rating, however, so we’d keep it away from water.",
    "It's in the screen department that the Huawei MatePad 11 really distinguishes itself from its competition. The display looks far better than the screens you'll find on similar-priced rivals, leaving the Huawei tab a cut above for playing games and watching certain media.",
    "As the name suggests, the MatePad's screen is 11 inches diagonally – well, specifically, 10.95 inches, but who's counting 0.05 inches? It's an LCD panel, making it easier to see in direct sunlight, although it doesn't display the same contrast or 'true' dark colors of an OLED screen. That's the display's only weakness.",
    "A 2560 x 1600 resolution is identical to the pricier yet same-sized Samsung Galaxy Tab S7, and higher-res than an equal-priced tablet from any other company. The refresh rate is 120Hz, which means the picture updates 120 times per second – that's twice as fast as the 60Hz you’ll find on most budget tablets. The 120Hz is a premium feature that you won't find on many of the MatePad's rivals.",
    "As a result, motion looks a little smoother, which is noticeable when you're scrolling through social media or gaming.",
    "The Huawei MatePad 11 is compatible with the company's M-Pen stylus, in the same vein as Samsung’s S Pen or Apple’s Pencil, which can be used for note-taking or sketching, depending on the app. In most regions, this accessory is bundled with the tablet; however, we didn't test the slate alongside this tool, so we can't comment on its usefulness.",
    "We did use the tablet's Smart Magnetic Keyboard, however, which is sold alongside the MatePad 11, and functions as both a case and a keyboard that pairs with the device via Bluetooth.",
    "Compared to Apple's iPad accessories, we found it a little clunky to use. First, the magnets that hold the non-keyboard part of the folio to the back of the tablet seem a little weak, and on occasion the slate would fall over as a result. This was compounded by the fact that typing on the keys would cause the folio to shake, so a bout of furious typing would cause the keyboard to wobble precariously.",
    "The most irritating issue we encountered is that, sometimes, the keyboard would just stop working – we could be pressing keys, but the letters wouldn’t appear in our document. Turning the tablet’s Bluetooth off and on, and physically removing and then replacing the slate from the keyboard cover did fix the issue, but it was annoying.",
    "As mentioned, we wrote this entire review using the MatePad, so were able to form a decent impression of how Huawei's Smart Magnetic Keyboard lags behind Apple's equivalent. Nevertheless, it remains functional, and might serve you better than cheap Amazon alternatives, too.",
    "On the inside of the Huawei MatePad 11 sits a Snapdragon 865, which was 2020's top-end Android chipset. While it doesn't compare with the later 870 or 888 iterations from 2021, the differences in processing power will be negligible for most people.",
    "When we put the tablet through the Geekbench 5 benchmark test, it returned an average multi-core score of 3323 – that's just behind the 3335 of the Lenovo Legion Phone Duel, which used the Plus version of the 865, and ahead of the Xiaomi Mi 10, which also uses the 865.",
    "That's a decent score, one that beats a few other phones using the same chipset. It ensures the tablet will happily cope with most of the tasks you'll throw at it – gaming, editing and the like. The MatePad 11 is supported by 6GB of RAM.",
    "There's a microSDXC slot for a card that expands the tablet's base 128GB storage up to 1TB, which might be useful for professionals – although is unlikely to be necessary for the majority of users.",
    "Around the MatePad 11 you’ll find four stereo speakers, tuned by Harman Kardon, which provide good audio quality for music and media, and work quite well for creating a 'surround-sound' effect when you're watching a movie.",
    "In terms of cameras, there's a 13-megapixel rear snapper and an 8-megapixel front-facer. The former is useful for scanning documents and taking reference pictures, but don't expect the impressive photography prowess of Huawei's phones here. The latter is fine for video calling and selfies – but, again, snaps aren't exactly incredible.",
    "The Huawei MatePad 11 is one of the first devices from Huawei to come with HarmonyOS, the company’s home-made operating system – which, in this case, replaces Android (although for some reason, Geekbench thought we were using Android 10...).",
    "On the surface, HarmonyOS feels a lot like Android. In particular, its appearance closely resembles EMUI, the fork of Google's operating system that Huawei designed. However, dig down deeper and you’ll see some big changes.",
    "The most important is that, unlike Android, you don't have access to the Google Play Store for apps. Instead, you can use Huawei's AppGallery, which has a limited selection of titles, or use Petal Search. The latter searches for app APKs online (basically, websites that let you install an app directly from the internet, instead of via an app store), and it’s using this method that you’ll discover the popular titles you'd find on the App Store or Play Store.",
    "We were able to find all social media apps, entertainment platforms such as Netflix, Prime Video and Spotify, games such as PUBG Mobile and Call of Duty: Mobile, and productivity tools such as KineMaster, Celtx and Outlook in this way; none of these are available on AppGallery. Since the Huawei ban in mid-2019 stopped Google apps working on Huawei devices, app support for its products has been poor – but the issue is 95% solved now.",
    "That last 5% references premium apps; there's no way of paying for apps. What this means is that top platforms such as paid games, professional-tier editing software and similar are all missing, which makes the MatePad 11 more difficult to recommend to those people who use such premium services.",
    "We did have a bit of an issue with certain APK apps, in that their resolution capped out at 720p instead of the 1080p we'd expect if we were on an Android device. This made movies we streamed through Netflix and Prime Video, for example, look slightly pixely. It isn’t clear why we weren't able to stream in higher quality.",
    "There are no Google apps available on the MatePad 11, and we found the popular workaround of finding the service via a browser, and creating a home-screen shortcut to that web page, didn't always work. We could easily get to the web page for Google Docs in this way, but when we tried to type a sentence, every word we wrote was duplicated – likely down to some bug. As a result, we had to use the WPS Office app to write this review.",
    "Despite the few issues we’ve covered above, Petal Search remains pretty useful; it’s a big improvement from the almost app-less devices Huawei was putting out for a while.",
    "The Huawei MatePad 11 has a fairly impressive battery life for a tablet. Although its 7,250mAh power pack doesn't seem hugely impressive on paper, we found the device had quite a bit of stopping power between charges.",
    "Huawei cites the MatePad's battery life as 'twelve hours of video playback' – a stat that won't mean much to the majority of people who aren't going to be watching half a day of videos straight. However, it does tell us that if you're using the slate for a less-intensive task, you'll probably get even more battery life out of the device.",
    "Our experience backs that up. We easily beat 10 hours of use from a single charge, sometimes achieving 14 or 15 hours of moderate use before the power ran dry. Of course, for more intensive tasks, such as playing games or rendering your own video, this will reduce.",
    "Since most iPads – and other rival tablets, for that matter – cap out at 10 or sometimes 12 hours of use, we found the MatePad's power impressive.",
    "Charging speed here is 22.5W, which isn't exactly fast, but fast-charging has yet to reach the tablet world.",
    "First reviewed October 2021",
    "You might also want to check out the ReMarkable 2 tablet review."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Huawei MatePad 11 price and availability",
    "11": "Design",
    "16": "Display",
    "20": "Accessories",
    "25": "Specs, performance and cameras",
    "31": "Software",
    "39": "Battery life",
    "44": "Don't buy it if..."
  },
  "links": {
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "entry-level iPad": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "ReMarkable 2 tablet": "https://www.techradar.com/reviews/remarkable-2-tablet"
  }
}