{
  "source": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
  "title": "Nvidia GeForce RTX 2060 review",
  "category": "components",
  "updated": "2021-06-23T16:54:22Z",
  "author": "kevin-lee",
  "summary": "Nvidia’s mid-range graphics card is a whole new beast",
  "verdict": "The Nvidia GeForce RTX 2060 might be more expensive than the graphics card it’s replacing, but it’s also a helluva lot more powerful, too. This mid-range GPU will make your PC gaming dreams come true and get you in the door with ray tracing maxed out at 1080p.",
  "pros": [
    "Ready for 4K @ 30fps gaming",
    "Silky ray traced 1080p gaming",
    "Runs much cooler than previous"
  ],
  "cons": [
    "Slightly pricier than predecessor",
    "RTX heavily impacts performance at QHD and 4K"
  ],
  "article": [
    "The Nvidia GeForce RTX 2060 is one of Nvidia’s best graphics cards (despite the shadows of the RTX 3060 and the RTX 3060 Ti looming over it). Hardly the meager, plasticky middle child of Nvidia’s GPU lineup, this GPU brings quite a few things to the table. Not only has it mastered Full HD and QHD gaming, but it also lets you bask in the glory of Nvidia’s ray traced future while keeping things affordable.",
    "With every new generation of Nvidia graphics cards, there’s always one that gets a massive power bump over its predecessors. This time, it’s the Nvidia GeForce RTX 2060, doing what the Nvidia GeForce GTX 1070 has done before it.",
    "And, although the Nvidia GeForce RTX 2060 does come at a slight price bump over its predecessor, it’s a price we’d gladly pay. Especially in the face of the RTX 2060 Super and the RTX 3000 line. If you’re looking for a way into the 2000 line without spending a fortune, this is an appealing option.",
    "As we expected, the new Nvidia RTX 2060 comes at a higher $339 (about £270, AU$490) price than the Nvidia GeForce GTX 1060 it’s replacing, which currently starts at $179 (about £140, AU$180). That’s a $200 price bump, although some might argue that this isn’t nearly as severe a price bump as we’ve seen on the company’s higher-end GPUs.",
    "Despite the higher price, the Nvidia RTX 2060 certainly punches well above its weight and feels more like a replacement for the Nvidia GTX 1070 Ti, which cost $449 (£419, AU$759) around the time of this review. It still falters behind its bigger brother, the $499 (about £380, AU$690) Nvidia RTX 2070, but puts AMD’s $399 (£379, AU$679) Radeon RX Vega 56 and $279 (£249, AU$425) XFX Radeon RX 590 Fatboy in their place.",
    "It’s worth mentioning, however, that AMD is gearing up to give Nvidia RTX 2060 a run for its money when it unleashes the AMD Radeon RX 5700, expected to offer comparable performance at 1440p on Max or Ultra settings, though bizarrely at $30 more. Additionally, Nvidia is set to roll out the Nvidia GeForce RTX 2060 Super to compete with the AMD Navi card. If your mind is still set on the Nvidia RTX 2060, you might find it at a cheaper price once those hit the streets.",
    "The Nvidia GeForce RTX 2060 is quite a step up from its predecessor. Equipped with 6GB of the latest 14Gbps GDDR6 video memory and 50% more CUDA cores, you’re looking at a much more capable graphics card. Whereas the Nvidia GeForce GTX 1060 was designed for 1080p gaming and could scrape by playing some games at 1,440p, the RTX 2060 has mastered high-frame rate Full HD gaming, delivering excellent 1440p results and somewhat playable 4K gaming hovering around 30 frames per second (fps).",
    "This is thanks in large part to the RTX 2060 being based on a modified version of the Turing TU106 GPU used in the Nvidia GeForce RTX 2070. While this technically means you’re getting a cutdown version of a higher-end graphics card, most of its power still carries over. This is the very reason why this new ‘mid-range’ card is so capable.",
    "The only thing we’re not wild about is the fact that Nvidia has decided not to include an NVLink connector or any form of SLI support on the RTX 2060. This means users will have to buy a much more expensive RTX 2070 or RTX 2080 – rather than plugging in another RTX 2060 – if they want to inject some more graphical oomph into their gaming PC later on.",
    "In our synthetic benchmark tests, the Nvidia GeForce RTX 2060 tops not only its predecessor, but even higher-tier GPUs of the Nvidia Pascal generation, like the Nvidia GTX 1070 Ti. The only graphics cards to top the Nvidia RTX 2060 are the considerably more expensive Nvidia GeForce RTX 2070, AMD Radeon RX Vega 56 and Nvidia GeForce RTX 2080. That is, until AMD releases the new AMD Radeon RX 5700 and RX 5700 XT graphics, and Nvidia unleashes its Super RTX series, you won’t find another mid-range graphics card more powerful than this.",
    "All this performance also translates to seamless gaming experiences. The Nvidia RTX 2060 is more than powerful enough to keep frame rates well north of 60fps in Full HD gaming, which is music to the ears of high-refresh-rate monitor owners. Meanwhile, it even delivers decent 4K gaming that hovers close to 30 fps in our benchmarks.",
    "Despite having the smallest complement of RT and Tensor Cores in the Nvidia RTX lineup thus far, the Nvidia RTX 2060 can still pull off all of the Turing architecture’s new tricks including DLSS and ray-tracing. In fact, this GPU can play Battlefield V at a consistent 70-75 fps with the game running at 1080p with Ultra quality settings and ray tracing.",
    "Unfortunately, tuning up the fidelity to 2,560 x 1,440 drops the frame rate to 45fps – 40fps if left on Ultra quality settings and ray tracing. However, 4K with all the same settings is still surprisingly somewhat playable with the frame rate hovering around 25fps.",
    "Based on our testing, we also find new dual fan cooler works well at keeping the Nvidia RTX 2060 running much more efficiently than the previous Pascal-series cards.",
    "It’s a bit disappointing that Nvidia has yet again raised the price of PC gaming with the Nvidia RTX 2060. However, it’s hard to argue its price when it delivers such stunning performance. Plus, it’s expected to drop in price as soon as the RTX 2060 Super and AMD Radeon RX 5700 are on the market.",
    "This new mid-range graphics card rules over 1080p gaming, fully delivers on 1440p experiences and can even play games at 4K (if you don’t mind the more pedestrian frame rate of 30 fps).",
    "The Nvidia RTX 2060 is $50 more expensive than the GPU it replaces, but we’d happily save up a little longer and get this card over the slowly disappearing GTX 1060 – as well as the GTX 1070 and GTX 1070 Ti. It’s simply much more capable and longer lasting. Plus, this graphics card can give users a taste of the new ray tracing future Nvidia is pushing, though, not to the uncompromising level of the company’s higher-end cards.",
    "Users on a tighter budget may be better served by the myriad versions of the Radeon RX 590, if they’re okay with just gaming at a Full HD resolution. Otherwise, the Nvidia RTX 2060 currently stands unchallenged as the best mid-range graphics card you can buy.",
    "Image credit: TechRadar",
    "Want more CES 2019 highlights? TechRadar is hands-on with 8K TVs and foldable, rollable displays, along with new laptops and Alexa-enabled smart gadgets. Check out everything we've seen, live from Las Vegas!"
  ],
  "headers": {
    "3": "Pricing and availability",
    "6": "Features and chipset",
    "9": "Performance",
    "14": "Final verdict"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "Nvidia’s ray traced future": "https://www.techradar.com/news/ray-tracing",
    "Nvidia graphics cards": "https://www.techradar.com/news/nvidia-geforce",
    "Nvidia GeForce GTX 1070": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/msi-geforce-gtx-1070-gaming-x-1323106/review",
    "RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "RTX 3000": "https://www.techradar.com/news/nvidia-ampere",
    "Nvidia GeForce GTX 1060": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/nvidia-geforce-gtx-1060-1325075/review",
    "Nvidia GTX 1070 Ti": "https://www.techradar.com/reviews/nvidia-gtx-1070-ti",
    "Nvidia RTX 2070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070",
    "unleashes the AMD Radeon RX 5700": "https://www.techradar.com/news/amd-radeon-rx-5700-rx-5700-xt",
    "Nvidia GeForce RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "Super RTX series": "https://www.techradar.com/news/nvidia-super-rtx",
    "Battlefield V": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "Check out everything we've seen, live from Las Vegas!": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets"
  }
}