{
  "source": "https://www.techradar.com/reviews/parental-control-kroha",
  "title": "Parental Control Kroha review",
  "category": "computing",
  "updated": "2021-06-21T08:00:27Z",
  "author": "mike-williams",
  "summary": "Budget Android parental controls with photo, SMS and call monitoring built-in",
  "verdict": "If you're mostly after call and SMS monitoring then Kroha is as cheap a solution as you'll get, but weak geofencing and multiple poor design decisions suggest you'll be better off with something else.",
  "pros": [
    "Monitor call and SMS history",
    "Simple geofencing",
    "Can limit app use by time or schedule",
    "Low price"
  ],
  "cons": [
    "Sideloading required to get call and SMS monitoring",
    "Geofencing supports one site only",
    "Poorly chosen web content categories",
    "Below par app design"
  ],
  "article": [
    "Parental Control Kroha is an unusual Android app which covers the child protection basics, then claims to go much further, all for a surprisingly low price.",
    "The system delivers on the essentials with features to block and control access to web content, manage access to apps, limit device and app usage by time, track the current location of their children, and display alerts if they leave a defined area.",
    "Kroha's bonus comes in its extra monitoring abilities. You can view your child's contacts, for instance, track changes, delete unwanted contacts or add new ones. The app has options to browse call history, show messages, view the latest photos sent and received. And while tracking all this can take some time and effort, the app does its best to help by organizing your child's latest activities into an easy-to-browse news feed.",
    "Kroha doesn't support iOS for the child's app. That's likely to be an issue for some, though keep in mind that even if it did, an Apple-friendly version wouldn't include the majority of these monitoring features. IOS simply doesn't support them.",
    "Kroha does offer an iOS app for parents, though, so you can at least keep an eye on the family from your iPhone.",
    "Kroha doesn't waste your time with a confusing range of products, complicated pricing schemes or introductory deals: there's just one plan which covers up to 5 devices for a very low $12 a year.",
    "If you've a large family and a lot of hardware, Kaspersky Safe Kids covers unlimited devices for a barely-more-expensive $15. Kaspersky doesn't have as many child monitoring tools, though, and even if you had to buy 2x Kroha licenses to cover everyone, $24 a year still feels like a great deal to us.",
    "No need to take our or Kroha's word for it, though. The app has a five-day free trial, which although it's not long, gives you the time you need to confirm it works on your devices and delivers the features you need.",
    "Kroha's setup gets off to a poor start by offering only the best basic outline of what the process is involved, then recommending we watch a video tutorial to find out more. This isn't even embedded in the installer - there's just a link which opens Kroha's YouTube channel in your browser. It all feels very dated in comparison to apps like Kidslox, where a smart wizard explains every step, automatically pairs devices via Wi-Fi or gives you QR codes to scan.",
    "Look past the below-par presentation, though, and the process works much like everyone else: create an account, choose Parent or Child, and enable the various Android permissions any parental control app needs to work.",
    "Kroha's Parent Mode interface is text heavy, with tiny icons, and looks more like an old Windows application than a modern mobile app.",
    "There are a huge number of features - tap your child's profile name and you'll find 17 different areas to explore - but exploring highlighted more annoyances, including huge tooltip-type captions which pop up every time you open a new screen, sometimes as many as 7 in succession. After a while, though, the app finally stopped displaying these, and we were ready to check out Kroha's abilities.",
    "Kroha's app management tools begin with a Lock App area where you can allow, block, or limit the use of individual apps or particular categories.",
    "This looks underpowered, with as many issues as the rest of the app. Most of our apps weren't placed in a specific category, for instance, and although Kroha put 13 apps in the Social Networks category, some of those decisions were questionable (they included Microsoft Authenticator, Netflix, Amazon Prime Video, a VPN and a mobile phone provider's app.) Ignore all that and take a look at Kroha's functionality, though, and there's a lot of power here.",
    "You don't have to organize your apps within a standard set of categories, for instance. You're able to create more, and move apps between them in a couple of taps.",
    "You can then set a daily time limit for each app category, as well as scheduling when those apps can be used. And we don't just mean a single time span, like '6pm-8pm', as you'll get with some of the competition. Kroha allows you to permit app use (or not) in half hour blocks throughout the day, so if you feel the need to block apps from 00-7am, 9am-12:30pm, 1pm-4pm and 8pm-12:00, and then do something else tomorrow, you can make it happen.",
    "Kroha's Web Control feature is a content filter which enables blocking dubious sites based on their category. It only blocks adult content by default, but although there are a host of other categories on offer, these feel more like the developer is trying to bump up the numbers rather than providing useful controls.",
    "Is there really a big demand from parents to block Rodeo sites, for instance? If we told you that Kroha has the option to limit access to Language Translation sites, would you sigh with relief? Can anyone see a major benefit in being able to block Wine and Beer/ Cocktails sites separately, but not have a general Alcohol category? (And we won't even mention the 9 categories connected to religion.)",
    "Still, Kroha does give you plenty of fine-tuning opportunities, and the ability to add your own categories makes life simpler. If you're aiming to limit your child's gaming, for instance, you could create a Restricted Gaming category with a short time limit, maybe an Unlimited Gaming category with a few apps which have no limits at all, then you add new games to each category as appropriate. Easy, -ish.",
    "There's a welcome extra in the ability to enforce Google's Safe Search, which filters out a lot of inappropriate content all on its own. Some apps go further, though: Kaspersky Safe Kids also supports safe search on Bing, Yahoo and Yandex.",
    "Kroha includes what is optimistically calls YouTube Control, too, although it also can't match up to the competition. It can't monitor or report on searches, for instance, or enforce YouTube's Restricted Mode. All you're able to do is browse your child's viewing history, then add specific videos or channels to a blacklist. This has a little value, but 'we only let your kids watch inappropriate videos once' probably isn't the best-selling point.",
    "After the issues we'd seen so far, Kroha's location tracking seemed a major improvement. An accurate location! Displayed on a Google Map's satellite view! There's even geofencing support, the ability to create a custom zone around your home, school or anywhere else, and get an alert when a child arrives or leaves. Could this be Kroha's big success story?",
    "We looked more closely, and - no, not quite. It's good to see Kroha has some form of geofencing - some apps don't support it at all - but there's a major limitation: while just about everyone else allows creating multiple zones, Kroha allows only one.",
    "If you create your first zone around a school, for instance, Kroha sends a notification if your child leaves. But if your child visits a family member in the evening, and you want to check that they stay there, you'll need to switch the zone to their house, then put it back to the school (or wherever else you need it next) when they're home. Use Kaspersky Safe Kids or most other parental control apps, and you could create school, home and family zones just once, save them, and they're always active, no delete/ recreate hassles at all.",
    "Kroha does deliver a handful of worthwhile extras in a few areas, particular device monitoring.",
    "Curious about your child's contacts, for instance? You can view stats, including any added recently, and there are options to delete the contact, or call him directly.",
    "You're able to view the latest photos, too. There's no option to delete them or do anything else, but this could still be useful.",
    "Kroha has icons titled Call History and SMS History, too, but by default these just display 'No history.' Why? There's no clue in the app, and you might easily wonder if your child has deleted their history, or there's some technical hassle. Tap the Help button, though, and a page on the Kroha site explains that Call and SMS History isn't available in the Google Play version of the app, and to get it you must manually install an APK from the Kroha site, instead. There's not a word about sideloading, though, the risks or what you might have to do - you're left to figure it all out for yourself.",
    "Our trip around Kroha's feature set ended with a couple of bonus tools. A Sounds panel turns all sounds to 100%, just in case your child has left the phone on silent and can't hear your call, and a Night Mode option sets screen intensity and color temperature to 'protect your child's eyes from blue light.' They work as expected, but don't add much value to the package, and hopefully Kroha will fix its other issues before it adds even more random features to the app.",
    "Kroha has more power than you'd expect for its very low price, especially with its app management features and call/ SMS/ photo monitoring. But weak geofencing, strange app and web category choices and poor overall design make it impossible to recommend. It's cheap, yes, but you're likely to be better off elsewhere."
  ],
  "headers": {
    "5": "Pricing",
    "8": "Getting started",
    "12": "App management",
    "16": "Content filtering",
    "21": "Location tracking",
    "24": "Monitoring",
    "29": "Final verdict"
  },
  "links": {
    "Parental Control Kroha": "https://parental-control.net/",
    "child protection": "https://www.techradar.com/best/parental-control",
    "one plan": "https://parental-control.net/#buy",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}