{
  "source": "https://www.techradar.com/reviews/nike-pegasus-trail-3",
  "title": "Nike Pegasus Trail 3 review",
  "category": "fitness",
  "updated": "2021-09-20T11:06:05Z",
  "author": "fergus-scholes",
  "summary": "A dependable all-rounder for on and off road running",
  "verdict": "The Nike Pegasus Trail 3 is a solid all-rounder that'll suit most runners and most situations. Its design is uncomplicated, but it works, with a comfortable fit and thoughtful design features like a tough toe bumper, rear tab, and gusseted tongue. The midsole foam is particularly impressive, giving an excellent ride, and the lugs give decent traction on rough surfaces. The Pegasus Trail 3 proved a little slippery on wet surfaces during our tests, but is otherwise hard to fault.",
  "pros": [
    "Brilliant midsole for a supreme ride",
    "Great looking",
    "Very comfortable",
    "Nothing overly complicated"
  ],
  "cons": [
    "Lack of traction in the wet"
  ],
  "article": [
    "The Pegasus Trail 3 is a straight out of the box crowd-pleaser that will work for most types of runners. Whether you’re looking for something a bit more sturdy on the run-commute to work, a more cushioned ride to rack up long training miles, or heading off road, it’s a great go-to option that’s really versatile for a host of use cases.",
    "This running shoe doesn’t over-complicate things, which is refreshing – a pretty regular mesh upper strikes the right balance of breathability and support, the underfoot is really comfortable without being spongy, the foot sits comfortably in the heel, and nicely sized toe box means you’re not cramped.",
    "The only downside is grip in the wet; you'd want to grab another pair of shoes when it’s raining. Other than that, the Pegasus Trail 3 is top class.",
    "The Nike Pegasus Trail 3 was released in June 2021, priced at $130 / £114.95 / AU$190 – the same launch price as the Pegasus Trail 2.",
    "It’s always nice pulling on a running shoe that look great, and Nike’s latest trail running offering certainly ticks this box – it’s one of the best looking options out there. We’ll delve deeper below, but the design ethos for these seems to be not to over-complicate anything, which is quite refreshing.",
    "The upper is a simple two-layer mesh. The outer one is a lightweight slightly harder wearing material with perforations of around 1mm bringing good ventilation, and the interior a tighter weave softer fabric that helps wick away sweat and keep the foot comfortable.",
    "The top of the padded tongue is independent for the top couple of inches, meaning you can open the shoe up so getting it on and off is easy, and it’s gusseted thereafter, with the inner lining thereby helping keep it in place and slightly reducing the chance of debris coming in around the laces.",
    "The lace eyelets go into a strip of rubbery type material which runs down both sides. This seems a great robust solution which should withstand the rigours of almost countless lacings and unlacings.",
    "There's a nice toe bumper, which is an extension of the rubber outsole that wraps up around the front and then spreads out around the sides for protection. And on the heel is a tab, which is really useful for quickly pulling them on. It looks kind of cool, too.",
    "The midsole features Nike React Foam along the entire length (more on how this is in the performance section below), and features some nice stylistic contouring and coloured flecks, which add to the look of the shoe.",
    "The shoe has a 9.5mm drop, with a heel stack height of 24.5mm, and forefoot of 15mm, so there’s a nice amount of cushioning without being too much.",
    "It weighs in at 321g, so not the lightest. However, this is the ballpark for a pair of solid and very comfortable trail running kicks, so we can’t grumble too much.",
    "There’s no sign of Vibram, or any other specialist third party input on the outsole, so it’s down to Nike’s own rubber compound, which they claim to be grippy, however testing proved otherwise (more to come on that). The lugs are decent enough and, as seems to be the trend with many trail running shoes, they extend from the heel too.",
    "One gripe with this shoe – and it’s a problem that seems to be inherent on Nike trail runners – is that it's slippery underfoot when wet. Whether on smoother urban surfaces, such as bricks or paving, or on trails on smoother stones or rocks, you’re likely to feel unstable. We largely tested it in the dry, however, and it performed absolutely as expected on all surfaces. Decent lugs offer great grip on gravel and loose terrain.",
    "Turning to the good – in fact the very good – Nike’s React foam is pretty faultless. It offers a great level of cushioning whilst still being responsive and not in any way sloppy. This means these trainers also lend themselves brilliantly for use on tarmac too – longer runs for clocking up high mileage, or even a bit of light speed work.",
    "The foot is really comfortable; the toe box is sufficiently large not to restrict you, but not large enough to be sloppy. It’s perfect around the collar too, with no rubbing on the ankle.",
    "Protection-wise, there's a small toe bumper, and at the back of the heel the protruding sole doubles up as rear bumper. This probably isn't a shoe to be beasting on the likes of volcanic lava type trails like Tenerife’s Mount Teide – it would start taking a hammering quite quickly – but for most trails, including gravel, rocks and forests, it'll be absolutely fine.",
    "It's absolutely a shoe that you could clock up hundreds of smooth miles in. It's well built and comfortable, with a great ride that should help keep those recurring injuries at bay as well as any shoe could.",
    "It's definitely a shoe you could use for general around town use too, which rounds the Pegasus Trail 3 off as a fantastic all-rounder."
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Nike Pegasus Trail 3 price and release date",
    "4": "Design",
    "13": "Performance",
    "19": "Don't buy it if"
  },
  "links": {
    "running shoe": "https://www.techradar.com/best/best-running-shoes"
  }
}