{
  "source": "https://www.techradar.com/reviews/hike-point-of-sale-pos-system-review",
  "title": "Hike point of sale (POS) system review",
  "category": "computing",
  "updated": "2021-10-28T14:52:04Z",
  "author": "rob-clymo",
  "summary": "We review the affordable Hike POS system for retailers, an intuitive, fuss free POS system built for Apple and Android devices.",
  "verdict": "A standard but solid omnichannel POS offering for busy small and growing retail businesses who need cost-effective customer payment software and sales hardware. With its mobility and user-friendly interface, Hike POS fits in with almost any retail environment.",
  "pros": [
    "Hike POS offers great hardware compatibility",
    "Good levels of service - 24/7 chat function for an instant reply",
    "Provides everything that a growing business needs",
    "Simple, intuitive and interactive interface",
    "Offline sales modes with automated cloud-syncing",
    "Free 14-day trial available",
    "Supports 8 languages",
    "0% transaction fees across plans"
  ],
  "cons": [
    "Premium API access only available for Enterprise customers",
    "Dedicated account management only available for Enterprise customers",
    "Custom onboarding only available for Enterprise customers",
    "Amazon Marketplace, MailChimp, inventory integrations, advanced user permissions, detailed analytics and custom reports all not available on Essentials plan"
  ],
  "article": [
    "Get a quote for a POS system today.",
    "With a global presence and a proven track record, Hike POS is an Australian, cloud-based quality POS system designed for retail. Hike POS enables users to sell across all channels—in-store, online and on the move.",
    "Hike provides a complete retail POS system with features including inventory, reporting and eCommerce. Hike is rapidly evolving, and appears committed to staying on top of the latest industry trends, as they regularly update their product. It’s available in the UK, Europe, US, Canada, Australia and New Zealand.",
    "There are pretty clear pros and cons to each of the numerous POS systems on the market, including Hike's. In this Hike POS review, we provide all the essential information and analysis, from Hike POS pricing to Hike POS integrations, to help you decide whether it’s the best point of sale solution for your business.",
    "Alternative retail competitor products include Vend POS, Lightspeed POS, Shopify POS and Square POS.",
    "Hike POS pricing offers three plans, as either a monthly or annual subscription. Importantly, there is no contractual commitment.",
    "Hike POS Essential",
    "The Essential plan has the everyday POS features required by a small, single-location retailer. Accounting integrations, which include QuickBooks Online and Xero, are also enabled on the entry level product.",
    "Order features for the small retailer are all covered, including returns and refunds, gift receipts and discounts. Retailers with multiple locations will need the Plus plan, as will businesses requiring credit notes, delivery dockets and multiple delivery address profiles.",
    "All major payments are available on the Essential plan, apart from bulk payments (‘on account’ sales) which is covered on Plus.",
    "Hike POS Plus",
    "The Plus plan has additional features such as API access, Shopify, BigCommerce, WooCommerce, Magento and Neto integrations. There are also marketplace and marketing integrations, including Amazon Marketplace and MailChimp.",
    "For both plans, savings are made when subscriptions are paid annually, as opposed to monthly. At the time of writing, there is an extra discount on the Plus plan, which provides extra savings for the growing retail business. On both plans, each first additional register is charged at $39.",
    "With Hike POS you can count on good flexibility: switch POS plans without penalty, even if downgrading at any time, and any remaining pro-rata credits from your current plan are automatically transferred to the new one.",
    "Hike POS Enterprise",
    "The Enterprise plan is priced on demand, and is aimed at large and franchised businesses who require bespoke customization. For a business quote you'll need to contact Hike directly, as pricing becomes custom. The main differentiating features of Hike POS are Premium API access, dedicated account management and customized onboarding.",
    "To start a plan, all customers get a free two week trial, which is quickly gives you instant trial access to a Hike account. There is no need to enter any credit card details, which provides peace of mind to try the service without pressure before you decide to buy.",
    "Hike POS works on iPad, PC and Mac. The data syncs to a central database in the cloud, so you can use all supported devices in your retail outlets. Most of Hike’s selling features also work offline, so your business can keep going without internet connectivity. Once you are back online, your data will automatically sync to the cloud.",
    "The Hike POS interface works on iPad, iPad Mini, PC and Mac computers. Transactions can be processed straight from your laptop. Retail businesses will enjoy the intuitive, streamlined interface, enabling retailers to tap a screen to run their entire business.",
    "Hike POS system is designed to make retail sales management simple. Hike’s iPad app is a useful design element as it enables your product catalog to be beautifully visualized on the touchscreen tablet too.",
    "Getting started is simple. There’s an ‘autopilot’ option, where Hike will set up your store for a fee, which is good for the time-pressed business owner or technophobe.",
    "Hike customer support is easily reached by phone, email, or the 24/7 live chat - who were responsive within a minute each time I asked questions. Hike’s representatives are knowledgeable and friendly. If you don't have time to sit and talk to customer services, Hike also has a 'Submit a ticket' option that works like Zendesk.",
    "Users on Essential or Plus plans have the same access to customer support, only the Enterprise plan has dedicated account management.",
    "The Hike POS Help Center contains resources, including FAQs, user guides and video tutorials, that go through the system - from its basic features to advanced configurations. Company blogs are regularly updated, and the team actively responds to queries posted on review boards.",
    "Today cloud-based POS systems are widely considered as providing greater security than a locally hosted legacy POS solution. In fact, tough security and full high-quality integrations are two big benefits of choosing a cloud point of sale system like Hike.",
    "Information is stored on secure servers, backed by the same encryption used by online banking. They automatically backup all your data, giving you one less thing to worry about.",
    "If you're looking for the gold standard in POS systems for retail, Vend POS is an inventory-orientated, feature-rich option that is considered by many as the model of what a retail POS system should function like.",
    "Being the world's first cloud-based POS system, Vend have come along way with their services to meet retailers demands and evolve their product scope alongside consumer needs. The industry buzz around the brand however means they're less affordable than Hike POS, with prices starting from $99 per month.",
    "Square POS system is another smart retail payment solution. With no monthly fees, you could potentially save a lot of money on POS software with Square, but beware of the significant transaction fees which start at 2.5 % plus $0.10 per transaction. Hike POS meanwhile takes 0% of your business transaction profits.",
    "Hike POS system claims to be targeted towards the following markets:",
    "Upon thorough review, frankly we found Hike POS isn’t as competitively designed for hospitality as some of the best POS systems for food trucks and POS systems for restaurants currently on the payment provider market. If you're stumped with where to start for a suitable hospitality POS provider, read our guide on how to choose a POS system for a restaurant and bar.",
    "However, Hike POS is a retail POS system contender for its functionality, ease of use and outstanding 24/7 support. Quick to install, Hike POS is a feature-rich, POS integration friendly retail management software solution that is on par with retail POS software like Helcim POS and Paypal Here point of sale system.",
    "As a retail merchant you can have confidence that brands such as Dyson and Mercedes-Benz are already using Hike POS for common tasks like stock management, employee account management and customer transactions.",
    "Be mindful though that Hike themselves advise \"using same register in multiple devices at the same time will result in duplicate receipt/invoice numbers\" so it may not suit the multiple site retailer on a tight budget.",
    "Hike's many POS integrations with popular CRM, accounting, digital marketing, e-commerce and marketplace tools enable you to connect your POS system to existing essential third-party software and merge your instore sales with online store profits in one view.",
    "Hike POS offers great hardware compatibility too, so chances are that it will work with the equipment you already have: including barcode scanners, cash drawers and receipt printers. There is also a selection of convenient Hike POS hardware bundles available on its website. In fact, one of the best parts of Hike POS and reason for our review-turned-recommendation is that switching from your old system to Hike POS is a breeze.",
    "The most obvious benefit of choosing Wix POS is that it allows you to manage your business as well as process all of your payments using one, simple platform. The seamless nature of Wix POS therefore makes a lot of sense, with the extra advantage of being able to monitor and control all transactions using a single dashboard.",
    "The simplified system lets you tackle chargebacks and disputed payments with relative ease too, while the straightforward nature of the e-commerce setup being connected to Wix Payments means there’s less chance for abandoned carts.",
    "All in all, if you're considering Wix POS as your first point of sale system or upgrade, particularly if you're normally an Android user, you'd be making a sage business decision."
  ],
  "headers": {
    "5": "Hike POS: Pricing and plans",
    "17": "Hike POS: Features",
    "18": "Hike POS: Interface and in use",
    "21": "Hike POS: Support",
    "24": "Hike POS: Security",
    "26": "Hike POS: The competition",
    "29": "Hike POS: Final verdict"
  },
  "links": {
    "Get a quote for a POS system today.": "https://www.techradar.com/news/get-a-quote-for-a-pos-system-today",
    "quality POS system": "https://www.techradar.com/news/the-best-pos-system",
    "Vend POS": "https://www.techradar.com/reviews/vend-point-of-sale-pos-system-review",
    "Lightspeed POS": "https://www.techradar.com/reviews/lightspeed-point-of-sale-pos-review",
    "Shopify POS": "https://www.techradar.com/reviews/shopify-pos",
    "Square POS": "https://www.techradar.com/reviews/square-pos-system-review",
    "Hike’s selling features": "https://hikeup.com/software-features/",
    "Help Center": "https://support.hikeup.com/hc/en-us",
    "Square POS system": "https://www.techradar.com/reviews/square-pos-system-review",
    "best POS systems for food trucks": "https://www.techradar.com/news/best-pos-system-for-food-trucks",
    "POS systems for restaurants": "https://www.techradar.com/news/the-best-pos-system-for-restaurants",
    "how to choose a POS system for a restaurant and bar": "https://www.techradar.com/news/how-to-choose-a-pos-point-of-sale-system-for-a-restaurant-and-bar",
    "Helcim POS": "https://www.techradar.com/reviews/helcim-point-of-sale-pos-review",
    "Paypal Here point of sale system": "https://www.techradar.com/reviews/paypal-here-point-of-sale-pos-review",
    "POS integrations": "https://www.techradar.com/news/7-pos-integrations-to-help-you-run-a-more-efficient-business"
  }
}