{
  "source": "https://www.techradar.com/reviews/max-access",
  "title": "Max Access review",
  "category": "computing",
  "updated": "2021-07-09T14:30:06Z",
  "author": "jonas-p-demuro",
  "summary": "The ultimate compliance solution",
  "verdict": "An AI driven algorithm can certainly be a cost effective method to streamline web accessibility, and Max Access adopts this approach. However, we are concerned with some missing features, such as the lack of a phone number for contact, or the shortage of online reviews.",
  "pros": [
    "Free 14-day trial",
    "Transparent pricing",
    "Automated scans",
    "Color blindness reports"
  ],
  "cons": [
    "Limited support options",
    "Lack of online reviews",
    "AI driven only",
    "Higher plans get expensive"
  ],
  "article": [
    "Max Access goes back to 2014, is based in Eugene, Oregon and proudly states that it is made in the USA. They provide the estimate that 10% of websites are not compliant with the Web Content Accessibility Guidelines from the WC3 Organization. Max Access, by Online ADA endeavors to help websites to be available to everyone, including those that are disabled.",
    "While Online ADA is a full services web accessibility company, Max Access is an AI driven subsidiary, designed to hold costs down through automation.",
    "The clients that Max Access services include Bank of America, Walmart PetRx, Samsung and the California State Parks.",
    "Max Access designs its service to make businesses “Be compliant and avoid lawsuits,” by making websites accessible to all. This also has the benefit of giving a boost to your brand’s perception by indicating that your website cares.",
    "The key to this is to download a single line of code, and once installed onto the website, it gives access to the site. The site is then scanned, and then analyzed for potential issues. Updates are then provided to the site to bring it into compliance, including standards such as:",
    "Max Access makes the claim that a website can be made accessible in just minutes- and it works with any website. It is also a fully customizable solution, which integrates in a multilingual screen reader. The solution is fully encrypted and secure with no interface lag to deliver lag free performance.",
    "There is also a mobile responsive mobile website toolbar, along with a dashboard that features detailed compliance reports. This process makes the site tab navigable. The remediation also gets recognized by search engines. It can even scan images, and be able to accurately describe what is in them.",
    "Another useful feature of Max Access is the rescans. Some of its competitors only run the scan once a month. Max Access stands out due to the fact that it will perform a rescan of your site on a much more frequent basis- as frequently as every 24 hours- and then will be on the ready to spot any new content on the site, or updates.",
    "While the process is automated, it is powerful and can generate color blindness reports, 54 voice options in 27 different languages, and color contrast customization.",
    "Searching the internet, we could not find any reviews of Max Access. We are a little baffled by this, as Max Access indicates that its code is downloaded “Over 1,000,000 times a day,” so surely someone should have an opinion on it.",
    "Max Access is in the minority of web accessibility providers that provides its pricing on its site, and we appreciate the transparency. It is based on a four tier pricing structure, and we also like the free trial, and like that it is a generous 14 days.",
    "The starter tier is ‘Typical,’ for a website of under 1,000 unique pages. For a cost of $37 per month (which appears to be on a special at the time of this screenshot), users get a custom toolbar, a back-end dashboard, a compliance summary and website code fixes. Pro features can be added for an additional $4 monthly that then upgrades to detailed compliance reports, and Alt-tag manager, an Aria manager and usage statistics.",
    "The next higher plan is ‘Large,’ designed for websites of under 10k pages, at a current discounted cost of $74 per month. To add the same Pro features to this plan runs $8 monthly. For those that have an even larger website, there is the ‘Huge’ plan which can handle 100k unique pages, and runs $110 monthly, and also offers the option for the Pro add-on features for $13 monthly. At the top tier is the ‘Mega’ plan that can handle a site of over 100k pages, with Pro features added on for $260 monthly. All of the plans have the same feature set, with the higher plans able to accommodate the larger site.",
    "For digital agencies, Max Access can be contacted for a ‘Bulk rate.’",
    "Customer support could be more robust, with limited options for those that need some help. The options do include a US postal address. The other option is to send them a message through an online portal. As if this was not limiting enough, the customer service hours are limited to 9 AM to 4 PM Pacific Standard Time.",
    "There are plenty of options missing, starting with a toll free phone number, or any phone number. A direct email would be convenient as well, along with chat, but these are not present either. Furthermore, none of the advanced options are found, such as online videos, eBooks, whitepapers or forums, but we did find a nice assortment of tutorials.",
    "The web accessibility from Max Access is a bit of a mixed bag. The pluses would certainly include the one line of code implementation, the free 14-day trial, the mobile website toolbar, and the frequent rescans of the site to promote compliance. Misses we would point to would be the total dearth of user reviews, the limited support options, and that some features are locked away in a more expensive Pro plan. Overall, Max Access is an intriguing entry into the competitive space of web accessibility, but you need to question if an AI only approach suits your website’s needs."
  ],
  "headers": {
    "3": "Services",
    "9": "User Reviews",
    "10": "Pricing",
    "14": "Support",
    "16": "Final verdict"
  },
  "links": {
    "Max Access": "https://maxaccess.io/",
    "Typical": "https://maxaccess.io/pricing/",
    "Large": "https://maxaccess.io/pricing/",
    "Huge": "https://maxaccess.io/pricing/",
    "Mega": "https://maxaccess.io/pricing/"
  }
}