{
  "source": "https://www.techradar.com/reviews/adobe-captivate",
  "title": "Adobe Captivate review",
  "category": "computing",
  "updated": "2021-09-21T14:30:37Z",
  "author": "jonas-p-demuro",
  "summary": "Professional project creation",
  "verdict": "Adobe Captivate offers a mature platform for creating professional educational content. While potential users should keep in mind the low rated iOS app, and the multiple payment options, overall it is worth a close look.",
  "pros": [
    "Free trial",
    "Choice of acquisition options",
    "In software image editing",
    "Supports VR projects"
  ],
  "cons": [
    "Cancellation fee on monthly plan",
    "Limited support options",
    "iOS app has low rating",
    "Higher price"
  ],
  "article": [
    "A seriously big player in the digital realm, Adobe produces a number of compelling tools. Captivate has had a longer history than many others, having humble beginnings as a basic screen recorder utility, with the original name of Flashcam, and then relaunched as RoboDemo in 2002 as an early eLearning authoring tool.",
    "When Adobe acquired Macromedia in 2005, the product name was changed again to the current Adobe Captivate.",
    "Adobe Captivate has moved on significantly from its most basic origins, and it is designed for project creation. However, the original screen capture tool is at its heart, as it can capture content from the screen of the computer. This can be performed in either a manual recording mode, where the user needs to trigger the capture event, or in an automatic recording mode that automatically can capture it. In either mode, this software then places the screenshot captures into a series of slides.",
    "With Adobe Captivate, users can draw upon a wide variety of content to make their presentation, and start a project with a blank canvas, that is a series of blank slides. For example, slides can be imported from a Microsoft Powerpoint presentation to combine content. If a user wants to use a straight image, that can be accommodated as well, as not only can that image be inserted, but it can be easily resized, undergo color correction, and rotated all within the software.",
    "This powerful software can go beyond what simple slide software can provide. This includes an option to create what Adobe dubs a “Responsive Project.” With this type of project, Adobe Captivate creates a project that is designed to be viewed on multiple different devices, which covers desktops, laptops, tablets and smartphones. Going beyond this, this software can even take you right to the cutting edge, and can enable production of a VR project that will engage an audience with 360 degree images and even video.",
    "Another useful Adobe Captivate feature is the templates. This is useful to have a consistent look across multiple projects, or between modules of the same project. The other benefit is the time savings by using a template.",
    "Adobe Captivate offers a number of options to acquire this product. We also appreciate the free 30-day trial to see if it meets your requirements. There is only a single tier, and it includes all the features.",
    "The first option is a monthly subscription that costs $39.99 each month. However, while it gets paid monthly, there is an annual subscription required, along with “Early termination will attract a monthly termination fee,” which means that if you cancel after the initial 14 days, that you need to contact customer support to pay half of the remaining year out. This undoubtedly must irk some users who would rather have a month to month plan, or a pay once annual plan.",
    "Adobe does offer some other options for those that prefer. For the “One and done” crowd who would rather not have a monthly subscription, there is the Perpetual License price of $1,299. If that is too steep, there is also the appropriately named “Student & Teacher Edition,” for eligible folks to acquire it perpetually for $399. Finally, for users of the prior Adobe Captivate 2017 edition, there is a program to upgrade it to the current version for a one time price of $499.",
    "Support for the Adobe Captivate product goes through the Adobe Help Center. We searched, and did not find options for direct contact, with no direct phone number, email, chat, or a contact portal We did find that with an account, there is a direct way to contact Adobe for support, but we cannot indicate what method it is exactly.",
    "As the way the market is moving, this Help Center has plenty of info, but it is predone content, with no further human interaction. We can more easily accept this on lower priced offerings, than on a fully featured product like Adobe Captivate. Topics to explore include “Why is the installer stuck,” “Where do I find my serial number,” and “How do I update my credit card info?”",
    "Going through some reviews on the Apple iOS store for the smartphone app which is called “Adobe Captivate Prime,” lets us know why this app gets such a low rating. Across a somewhat low 80 ratings, the score is a low 2.2 out of 5 stars.",
    "iOS users have a multitude of issues to report. These include the difficulty with getting audio and video, and a lack of support. Furthermore, there are multiple complaints that the videos don’t even load, which frustrates its users.",
    "Over on the Android side, things are better, as on the Google Play Store, the Adobe Captivate Prime app gets a better 4.3 out of 5 star rating, across 580 reviews. However, there are recent reviews citing issues with playback, and videos loading that has frustrated users.",
    "Adobe Captivate is a strong and mature entry into learning presentation software. We point out the strengths that include the ability to incorporate content from PowerPoint and digital images, the choice of acquisition options from a monthly plan to a lifetime fee, and support for VR projects. However, some drawbacks to note are the single tier, the higher price, and the support options that are too limited. Overall, Adobe Captivate sets a standard for this category of software, and it is worth a close look as it has endured in this spot for many years now."
  ],
  "headers": {
    "2": "Features",
    "6": "Plans and pricing",
    "9": "Support",
    "11": "User reviews",
    "14": "Final verdict"
  },
  "links": {
    "screen recorder": "https://www.techradar.com/news/the-best-free-screen-recorder",
    "Adobe Captivate": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-1290890208675484000&url=https%3A%2F%2Fwww.adobe.com%2Fproducts%2Fcaptivate.html",
    "monthly subscription": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-1523895340061098500&url=https%3A%2F%2Fwww.adobe.com%2Fproducts%2Fcaptivate%2Fbuying-guide.html",
    "Perpetual License": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-1173651856836402700&url=https%3A%2F%2Fwww.adobe.com%2Fproducts%2Fcaptivate%2Fbuying-guide.html",
    "Student & Teacher Edition": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-1459658546748666600&url=https%3A%2F%2Fwww.adobe.com%2Fproducts%2Fcaptivate%2Fbuying-guide.html",
    "upgrade it": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-8299804962163594000&url=https%3A%2F%2Fwww.adobe.com%2Fproducts%2Fcaptivate%2Fbuying-guide.html",
    "presentation software": "https://www.techradar.com/best/best-presentation-software",
    "PowerPoint": "https://www.techradar.com/reviews/microsoft-powerpoint"
  }
}