{
  "source": "https://www.techradar.com/reviews/moto-g-stylus-2021",
  "title": "Moto G Stylus 2021 review",
  "category": "phones",
  "updated": "2021-02-05T19:29:54.748Z",
  "author": "david-lumb",
  "summary": "The cheapest new stylus phone",
  "verdict": "The Moto G Stylus 2021 builds on its predecessor in every way, offering the best stylus experience at a low price. While other budget phones beat it on price and battery, the G Stylus 2021 is a well-rounded handset with enough classy touches and good specs to compete with pricier devices. While the stylus functionality only applies to a few first-party and third-party apps, it’s novel and potentially helpful for folks who want an alternative to touch controls.",
  "pros": [
    "Stylus is sleeker, more functionality",
    "Good display",
    "Decent 4,000mAh battery"
  ],
  "cons": [
    "Middling cameras",
    "Few apps support stylus",
    "Slow battery charging"
  ],
  "article": [
    "The Moto G Stylus (2021) is Motorola’s second go at a stylus-packing device, following the Moto G Stylus (known as the Moto G Pro outside the US) that launched in early 2020 and refining it in every way. Don’t expect any grand improvements: while it’s a specialized version of the 2021 Moto G phones, it won’t outperform its siblings.",
    "Instead, it’s a respectable phone that’s also the most affordable way to use a phone with a paired stylus. It’s not the only affordable phone with one with the LG Stylo 5 out, though that phone was released in mid-2019, making the Moto G Stylus 2021 nearly more advanced by two years of tech generations.",
    "Everything about the stylus has been improved, with a sleeker look and more functionality in the software. It’s still a newer and cheaper version of the Samsung Note 10 Lite, so don’t expect physical buttons on the accessory or fancy tricks like using it as a remote – but if you want to jot down notes, edit photos, or just use a stylus instead of your finger, the Moto G Stylus is still the cheapest way to do it.",
    "It’s not the cheapest Moto G phone, of course, as you’re still paying above other high-value handsets like the Moto G9 Power just for the stylus. But while its siblings have some surprising compromises to stay in their price tier, the new Moto G Stylus improves on every part of its predecessor – though in most areas, only incrementally.",
    "The biggest change is in the display, an expansion from 6.4 to a massive 6.8-inch Full HD Plus screen. That’s more screen real estate to sketch on or enjoy media, with a 20:9 ratio that frankly feels nearly too big for one-handed use. Interestingly, the Moto G Stylus 2021 sits between the Samsung Note 20 (6.7-inch) and the Note 20 Ultra (6.9-inch) in sheer display size.",
    "The cameras are one of the only areas that haven’t been improved, though getting a triple rear camera setup is still a good deal for a budget phone. Given more budget handsets are sporting multiple rear shooters, it’s unfortunate that the G Stylus doesn’t have a telephoto camera to help with zoom photography, for instance.",
    "Ultimately, there’s a lot here that feels similar, but the upgrades feel worth it for anyone who wants a modern phone with stylus functionality – and it’s nice to see more software perks for those who like living by their digital pen.",
    "Given the $299 (around £220 / AU$384) price is virtually unchanged from its predecessor, the G Stylus feels again like a good bargain among budget phones to get neat functionality for anyone who wants to draw on their phone like it’s the Palm Pilot days.",
    "The Moto G Stylus 2021 is priced at $299 (around £220 / AU$384) in the US, and we've yet to have confirmation on whether the phone will be available in the UK or Australia. It's similarly unclear if or when it's coming to other regions.",
    "Those in the US were able to buy the phone from a variety of retailers from January 14, 2021. Carriers such as AT&T, Verizon, T-Mobile, Google Fi, and various MVNOs have begun offering the device, and will expand to more retailers in the coming months, according to Motorola.",
    "The Moto G Stylus 2021 looks very similar to its identically-named predecessor, just... larger and heavier. Given the new version of the phone packs a 6.8-inch display versus the older 6.4-inch display, that’s no surprise – but size aside, there’s not too much different on the new phone, with the same glass display, glossy plastic frame, and plastic back cover.",
    "The phone’s rear cover does look a bit classier, with dark gray or white color inlaid with a houndstooth-like pattern that has a prismatic sheen when it catches the light. Instead of arranging the rear cameras in a vertical line, the new Moto G Stylus collects them in a rectangular camera block, which imitates the design stylings of flagships like the Samsung Galaxy S20 phones.",
    "The lock button on the right side has been enlarged to include the fingerprint scanner, which is not just fast-acting but in a place we appreciate, sitting right under the thumb when grabbing the phone one-handed.",
    "The lock button-fingerprint reader combo was seemingly inherited from last year’s Motorola One 5G, and while it isn’t an in-screen sensor like those found on some flagship phones, it’s classier than the rear-mounted fingerprint scanner typically found on cheaper phones.",
    "There’s a volume rocker button above the aforementioned lock button on the right side, with a slot for a microSD card on the left side, USB-C port on the bottom-middle and a 3.5mm headphone jack to the left and a speaker to the right.",
    "In our time with it, the lone speaker rivaled the Pixel phones for even tones and a good sound that fills the area, though its mono-directional output means it still lags behind the audio nuance found in flagship phones with second speakers near the earpiece – but gamers take note that it’s easy to cover up the Moto G Stylus’ single speaker thus blocking all sound when holding the phone sideways to play.",
    "The stylus returns as a helpful but not revolutionary accessory. Quite the contrary, as the touch control paradigm has generally been a superior way to control your phone – but there are folks who prefer the option of pulling out their digital pencil to make notes, edit photos, or simply get more precision when browsing their phone. Other folks might find it vestigial, a holdover from the early mobile age that doesn’t have nearly as many applications as their finger – for them, this phone might not be novel enough.",
    "The stylus itself is a thin inkless pen around a digit longer than your forefinger, with a mesh tip at the screen-touching end and a pop-out cap on the other. The stylus still doesn’t have any smart functionality, but it’s been implemented a bit more sleekly into the design of the phone. Instead of having to pry the stylus out with a fingernail, you can push in the bottom of the accessory for the end to pop out, which is much easier to grasp.",
    "This is basically how the Samsung Note’s S Pen has worked for years, but it’s a nice premium touch on a budget phone. The old G Stylus had no feedback when you pulled the accessory in or out of the phone, but In another premium touch, sliding the new phone’s stylus back in its slot results in a slight vibration to let you know it’s locked in place.",
    "Motorola claims the new Moto G Stylus operates better than the old, and whether that’s true or not, it’s the software that’s felt like it's improved the most. The signature Moto Note app has been expanded with more color options and the ability to load up images to mark up with the stylus, and by default it will automatically open when you pull out the accessory.",
    "You can access Moto Note quickly via a shortcut bar that appears when you’ve pulled the stylus free – it’ll minimize to a circle with a pen icon, which dims if you’re navigating elsewhere. The bar has five buttons: two permanent (to open a new Note and take a screenshot to edit) and three customizable, which by default open a new Coloring Book feature, open the Notes app proper, and open the Camera app with a Cinemagraph photo mode pre-selected (which can be more easily-edited via stylus).",
    "A new Moto Gesture lets you split the screen to sketch on one half and open an app on the other, while other apps have added or will add stylus-recognizing functionality, Motorola says, including big names like Evernote and Among Us.",
    "As mentioned before, the Moto G Stylus 2021’s 6.8-inch display is significantly larger than the 6.4-inch display on its predecessor, though it’s still a Full HD resolution LCD screen. Not much has changed, but it’s still a quality display that’s sharp and is capable of showing off vibrant colors.",
    "In side by side comparisons streaming the same media, the G Stylus’ LCD display showed nearly the same clarity and rich colors as the OLED screens on the Google Pixel 5 (Full HD resolution), iPhone 11 Pro Max (Full HD Plus), and Samsung Galaxy S20 Plus (WQHD). The G Stylus’ screen was comparatively dimmer, though that’s to be expected with an LCD screen.",
    "The Moto G Stylus still has a punch-hole in the top left corner of the display for the selfie camera, and given the larger size of the screen, the hole obstructs even less visual area than the punch-hole did in last year’s G Stylus.",
    "The new Moto G Stylus hasn’t changed much of the triple rear camera array that appeared on its predecessor, with a 48MP main shooter, 8MP ultra-wide lens (admittedly half the megapixels of the older phone’s 16MP ultra-wide lens) and 2MP macro camera, as well as a 16MP selfie shooter.",
    "The phone’s 48MP main shooter is the standout here, capturing good clarity and balanced colors for casual daytime shots. The quality fades a bit under low-light conditions, merging dark colors into pockets of black or deep brown.",
    "This low-light performance is a bit poorer for the ultra-wide camera, which also doesn’t produce as sharp of photos – understandable, given its lower megapixel count – but it’s still a helpful daylight alternative when trying to get more subjects and landscape in frame. Without a telephoto lens, the phone’s digital zoom makes do, crop-zooming in to mushy textures at the maximum 8.8x level.",
    "The macro lens is, like most other macro lenses, a bit of a struggle to get focused on the subject. In our testing, we got decent but not standout shots when we could get them properly focused, and while that makes it more capable than other phones in shooting very close subjects, up-close photography is kind of a wash among all handsets.",
    "The Moto G Stylus packs the usual array of photo modes, like panorama and a decent but not standout Night mode. Like prior Motorola phones, this also includes Cinemagraph, which is a somewhat gimmicky way to take a video that allows you to select what’s in motion – which is admittedly way easier to do with a stylus. This isn’t new to the phone, as the Moto G Stylus 2020 had it, but the extra precision with the stylus still makes it easier to use.",
    "The new G Stylus inherits plenty from its predecessor, like 4GB of RAM and 128GB of storage (expandable to 512GB via microSD card), though its Snapdragon 678 is an upgrade on the older G Stylus’ Snapdragon 665. No, that doesn’t include 5G connectivity – you’ll need to pay more for the Motorola One 5G phones for that.",
    "The phone scored a 1627 on Geekbench 5, a rating that’s just below that of borderline flagships like the Motorola Edge (which scored 1733) and above the Google Pixel 5 (1600) – both of which sport the more powerful Snapdragon 765 chipset. The Moto G Stylus’ specs are enough to flow through daily tasks, browsing the internet, playing games, and keeping up with the stylus. The little slowdown we did experience was when quickly navigating around the OS and opening third-party apps like YouTube, but that was irregular.",
    "Gaming, however, was a seamless experience, and a testament to the lower-powered Snapdragon 678 – we didn’t experience any slowdown when running multiple rounds of Call of Duty: Mobile, for instance. Our biggest hindrance was the aforementioned placement of the single speaker on the bottom of the phone, which is easy to cover during intense play sessions. The phone didn’t even get too warm, which is appreciated.",
    "The Moto G Stylus 2021’s big letdown is running Android 10 out of the box. While Motorola is already updating older phones to the newest Android version at a more rapid pace than in previous years, that does mean the non-US version of the G Stylus’ predecessor, the Moto G Pro, already has Android 11, per Android Central.",
    "The 4,000mAh battery isn’t the biggest among the Moto G Stylus 2021’s siblings (the Moto G9 Power has a 6,000mAh battery), but it’s enough to last over a day of use, and well into the second, as we found in our testing.",
    "The G Stylus doesn’t support wireless charging, which isn’t a dealbreaker at this price point. But the phone’s maximum 10W wired charging speed is a serious downgrade from other phones; most Moto phones at least have 18W, while many others start at a baseline of 25W or 30W.",
    "First reviewed: February 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Moto G Stylus (2021) price and release date",
    "10": "Design",
    "16": "Stylus",
    "22": "Display",
    "25": "Camera",
    "30": "Performance and battery life",
    "36": "Don’t buy it if…"
  },
  "links": {
    "Moto G Stylus": "https://www.techradar.com/reviews/moto-g-pro-review",
    "Samsung Note 10 Lite": "https://www.techradar.com/reviews/galaxy-note-10-lite-review",
    "Moto G9 Power": "https://www.techradar.com/reviews/moto-g9-power-review",
    "Samsung Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "Samsung Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Call of Duty: Mobile": "https://www.techradar.com/news/call-of-duty-mobile-season-1",
    "Android 10": "https://www.techradar.com/news/android-q",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android Central": "https://www.androidcentral.com/first-motorola-phone-get-android-11-stylus-toting-moto-g-stylus"
  }
}