{
  "source": "https://www.techradar.com/reviews/wd-my-passport-ultra-4tb-portable-hard-disk-drive-2019",
  "title": "WD My Passport Ultra 4TB portable hard disk drive (2019) review",
  "category": "computing",
  "updated": "2021-03-30T10:02:05Z",
  "author": "desire-athow",
  "summary": "An old favorite returns",
  "verdict": "The WD My Passport Ultra 4TB (2019) is a good storage device, but if a long warranty and a Type-C connector are low on your priority list, then there are drives that offer better value for money, either from WD’s own portfolio or from rivals.",
  "pros": [
    "Smart design",
    "USB Type-C connector",
    "Suite of applications",
    "Three-year warranty"
  ],
  "cons": [
    "Price",
    "Average performance"
  ],
  "article": [
    "The latest version of WD's portable hard disk drive throws up a question right out of the gate - what is with the name?",
    "It doesn’t help that WD keeps the same names for its hard disk drive ranges even if new models are released almost every year. Take the My Passport Ultra, for example: TechRadar first reviewed it in 2013, and back then, it had a different design and a much smaller capacity.",
    "The 2019 version is a major upgrade on the 2017 spin, introducing a new design, a Type-C connector (rather than the flat USB one) and an updated version of WD’s Discovery software. The My Passport Ultra (2019) is available direct from WD for $119.99 (4TB), $89.99 (2TB) and $69.99 (1TB) respectively.",
    "WD has given the plastic/metal combo from the previous generation a different design, fusing modern anodized metal and textures, in either a dark blue or a silver finish. That’s down from six options in the previous range (which are still on sale at most retailers).",
    "There’s a white activity light which indicates that the device is active, idle, or in standby, and you get a USB Type-C connector (USB 3.1 Gen 1) plus a cable and a Type-C to Type-A adaptor.",
    "The reviewed 4TB model weighs 232g without the accessories, with a footprint of 82 x 110mm and a thickness of 21mm, almost double that of the 1TB/2TB models as it carries more platters.",
    "This storage solution uses an OEM drive that’s not available on the open market – WD’s laptop drives have a maximum capacity of 2TB. You can buy it (WD40NMZM) from eBay, but it will cost four times the price of the WD My Passport Ultra 4TB portable drive – the laws of supply and demand at work!",
    "What we know is that this hard disk drive has 5,400RPM platters, probably two of them, each with a 2TB capacity, hence the increased thickness. We don’t know the cache capacity, but what we can observe is that it generally performs worse compared to the G-Tech 2TB mobile USB-C drive, which is likely to contain a 2TB single platter version of this drive.",
    "Our standard 10GB test file was transferred in just under 100 seconds, making this one of the slowest drives we’ve tested recently. The WD My Passport Ultra does get relatively warm in use and produces an audible hum (about 48dB if you put your ear to it – not that you’re likely to do that, of course).",
    "The WD Discovery software acts as a dashboard that offers access to the My Passport drive and to My Cloud Home (if you have an account). From here, you can switch off the LED light, and set up a password for your drive with 256-bit AES hardware encryption. It also carries an app store that provides direct access to free and paid applications at reduced prices. At least one of these apps – ENCSecurity’s Encryptstick– is obsolete, however. Grab WD Backup and WD Security, though, as they are decent and versatile solutions which cost nothing.",
    "Then there’s Upthere.com which is the cloud storage solution from WD. You get 20GB free off-the-bat, with cross-platform compatibility and two-factor authentication by default. Upgrade to 100GB for $1.99 per month with no yearly contract.",
    "With a three-year warranty by default, a useful set of utilities, a reasonable retail price and decent performance, the WD My Passport Ultra 4TB (2019) marginally improves on an already good product.",
    "In a mature market where the upper limit for portable hard disk drives seems to be 4TB – we tested one of this size back in 2015! – there’s little need or desire to innovate, with pricing becoming the sole metric these drives are judged on.",
    "Against the likes of the Seagate Expansion, which costs 25% less, the lure of a three-year warranty and a Type-C connector might be diminished. Plus the Seagate drive comes with a two-month complementary membership to the Adobe Creative Cloud Photography Plan worth $20.",
    "Then there’s the other more affordable WD portable hard disk drive, the 4TB Elements, which retails for a smidgen under $100. It lacks hardware encryption and the three-year warranty, but is more than likely to pack the same hard drive as the My Passport Ultra.",
    "All in all, consider the My Passport Ultra if you want the lengthy three-year warranty and absolutely need a Type-C connector. The drive’s performance is on par with the rest of the competition, and its software bundle is useful."
  ],
  "headers": {
    "3": "Design",
    "6": "Performance",
    "11": "Final verdict"
  },
  "links": {
    "My Passport Ultra": "https://www.techradar.com/reviews/pc-mac/pc-components/storage/disk-drives-hdd-ssd/western-digital-my-passport-ultra-1183613/review",
    "Upthere.com": "https://upthere.com/pricing",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Seagate Expansion": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSeagate-Expansion-Portable-External-STEA4000400%2Fdp%2FB017KE8OG0%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6581712558927077000-20",
    "Adobe Creative Cloud Photography": "https://www.techradar.com/news/what-is-adobe-creative-cloud",
    "4TB Elements": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FElements-Portable-External-Drive-WDBU6Y0040BBK-WESN%2Fdp%2FB0713WPGLL%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9232390750457604000-20"
  }
}