{
  "source": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-nano-review",
  "title": "Lenovo ThinkPad X1 Nano review",
  "category": "computing",
  "updated": "2021-04-07T20:53:26.651Z",
  "author": "john-loeffler",
  "summary": "A featherweight title contender",
  "verdict": "The Lenovo ThinkPad X1 Nano is a beautiful, lightweight, and surprisingly powerful Ultrabook that is probably the lightest laptop we've ever tested. Its 13-inch screen is a crisp 2K and its 16:10 ratio offers plenty of useful space to get your work done in such a tight package. While there were some sacrifices made given the space constraints, such as the limited number of ports, these barely hold it back from being one of the best laptops you're going to find if portability and performance are your top-line priorities.",
  "pros": [
    "Sleek design",
    "Incredibly light",
    "Excellent display",
    "Surprisingly powerful",
    "Physical webcam shutter"
  ],
  "cons": [
    "Limited ports",
    "Keyboard layout",
    "Small trackpad",
    "Somewhat pricey"
  ],
  "article": [
    "The Lenovo ThinkPad X1 Nano is everything great about the Lenovo ThinkPad X1 Carbon, only lighter and better.",
    "The biggest selling point of the X1 Nano is that it's incredibly lightweight, starting at just 1.99 lbs (0.907 kg), which makes it among the lightest laptops we've ever tested. If portability is a must-have feature for you, then the X1 Nano must absolutely be at the top of your list.",
    "And it's not just about the light weight either. The X1 Nano has a somewhat smaller battery than some other Ultrabooks we've tested lately, but it is Intel Evo certified, so it has been designed from the ground up with efficiency in mind. This lets the battery squeeze out a full workday's worth of use on a single charge in almost all but the most extreme cases, and since it charges through a USB Type-C Thunderbolt 4 port, you have a lot more flexibility when it comes to charging than if it were a more traditional charging port.",
    "Given the lightweight and battery efficiency, you'd expect the X1 Nano to sacrifice some on the performance side of things, but the X1 Nano is surprisingly powerful and will not have any problems chewing through most productivity tasks with ease, making it by far one of the best business laptops out there right now.",
    "There are some downsides to the X1 Nano, such as the limited number of ports. Other than the combo audio jack, there are just two USB Type-C ports, one of which you're going to need for charging. That means that the remaining port is likely going to be connected to a dock of some kind, which is an extra accessory you'll need to carry around with you, dinging its portability a bit.",
    "With a somewhat steep entry-level price tag and a slew of security features, this is really geared more towards professional use than a general use, around-the-house-and-coffee-shop kind of Ultrabook. With that caveat thrown out there, for those who are looking for a new work laptop that they can take with them just about everywhere without having to give up too much in terms of performance, the Lenovo ThinkPad X1 Nano definitely belongs on your shortlist.",
    "The Lenovo ThinkPad X1 Nano is available now, starting at $1,499 / £1,769 / AU$2,374. In the US and Australia, the entry-level configuration features an Intel Core i5-1130G7, 8GB LPDDR4 RAM, and a 256GB PCIe SSD. In the UK, the entry-level model has slightly better specs, bumping the RAM up to 16GB and the SSD to 512GB.",
    "The model we reviewed comes in at $1,877 / £1,959, and isn’t available in Australia at the moment, but the nearest configuration to the one we reviewed doubles the SSD capacity to 1TB and cost $3,495.",
    "Both the UK and Australia configurations above are both the highest end configurations available in those regions, but in the US, there are even more options available, maxing out with an i7-1180G7, 16GB RAM, 1TB PCIe SSD, and features a black carbon fiber weave on the lid instead of the matte black carbon fiber lid on the model we reviewed. It costs $2,231 for this model, so there is about $700 difference between the entry-level and highest-end models, which is a fairly good spread.",
    "The build of the Lenovo ThinkPad X1 Nano is very high quality, with a carbon fiber and magnesium chassis that makes it incredibly light and durable. While we wouldn't drop it on a hardwood floor, it could probably handle a decent fall without getting too banged up.",
    "Underneath, there is a small vent for airflow that doesn't bleed too much heat, with the outflow vent on the right side of the chassis. The hinges of the lid turn 180-degrees, so you can open the X1 Nano all the way into a straight profile to lay (mostly) flat on a surface, making it great for collaborating on a project with a colleague. The hinges bump the keyboard up a bit, so it's doesn't lay completely flat, but this helps make the keyboard more accessible in this position.",
    "The keyboard is your typical chicklet-style keyboard with a pointer button in the center, in keeping with the ThinkPad brand. The keyboard is comfortable to type on and the keys have good travel, so they feel responsive.",
    "The only criticism we have of the keyboard is the placement of the Function (Fn) key. Most users will be used to having the control and function keys reversed, with control being the furthest-left bottom key on the keyboard. It took us some time to adjust and we kept trying to copy and paste using the wrong key, which was somewhat frustrating, but we learned to adapt just fine after using it for long enough.",
    "The Trackpad on the X1 Nano is rather small, with separate left, middle, and right buttons along the top. This cuts somewhat against what you might be used to, but clicking the bottom left and bottom right of the trackpad work just as well, and this is what we found ourselves doing for the most part. Overall, it's responsive and functional, which is all you can really ask for in a trackpad.",
    "There are four speakers on the X1 Nano, two top-firing tweeters and two-bottom firing woofers. Throw in Dolby Atmos certification and you have some great sounding speakers for a laptop.",
    "The X1 Nano is light on ports, with only a pair of USB Type-C Thunderbolt 4 ports and an 3.5mm combo audio jack. The power button is at the back end of the right side, next to the X1 Nano's outflow vent. In our experience, we didn't notice much in the way of hot air blowing out of this vent, but thankfully, everything still stays pretty cool during use.",
    "We were really impressed with the Lenovo ThinkPad X1 Nano when it came to performance. Holding it in your hand, you wouldn't think that it was packing any kind of powerful hardware, but the Intel Core i7-1160G7 proves itself admirably in our benchmarks.",
    "Compared to the Razer Book 13's Intel Core i7-1165G7 processor, the X1 Nano keeps up very well, though just a bit behind, Razer's powerful new Ultrabook. On our GeekBench5 tests, the X1 Nano scores a 1,447 to the Book 13's 1,558 in single core performance, and 5,093 to 5,397, respectively, in multicore performance. On our PCMark 10 Home test, the X1 Nano falls behind the Book 13 by a few hundred points, 4,564 to 4,871, respectively, but this still isn't terrible by any means.",
    "The X1 Nano didn't do as well in our 3DMark tests as the Book 13, but it keeps reasonably close while outperforming the Dell XPS 13 – except in Time Spy, for some reason. We ran this particular benchmark a few times just to make sure, but both the XPS 13's 1,547 score and the Book 13's 1,771 score in Time Spy absolutely wallops the X1 Nano's average score of 843.",
    "When it comes to battery life, the X1 Nano holds its own against both the XPS 13 and the Book 13, despite having a somewhat smaller battery (48 WHr, compared to 52 WHr for the XPS 13 and Book 13).",
    "On our PCMark 10 battery test, the XPS 13 comes out on top with 11 hours 47 minutes, followed by the Book 13's 11 hours 42 minutes. The X1 Nano lasted 11 hours 28 minutes.",
    "Likewise, in our HD video test, the X1 Nano's 11 hours beats out the Book 13's nine hours and 20 minutes, and loses out to the XPS 13 by only one minute. All in all, this is some very impressive performance given its hardware.",
    "Fortunately, there is almost no bloatware to speak of on the Lenovo ThinkPad X1 Nano, which makes sense seeing as this is definitely geared towards the business community and you don't tend to see that kind of thing on business laptops.",
    "But since this is a more enterprise-oriented device, there are a bunch of security features of note, including match-on-chip fingerprint scanner, self-healing BIOS, and a human-presence detecting IR camera, which will lock the computer if it detects that the user has turned or walked away from the screen.",
    "There is also the physical shutter switch for the webcam that helps protect your privacy when not in use."
  ],
  "headers": {
    "0": "Two minute review",
    "6": "Price and availability",
    "9": "Design",
    "16": "Performance",
    "22": "Software and features",
    "25": "Don't buy it if..."
  },
  "links": {
    "Lenovo ThinkPad X1 Carbon": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-carbon-2017",
    "best business laptops": "https://www.techradar.com/news/best-business-laptops",
    "Razer Book 13": "https://www.techradar.com/reviews/razer-book-13-2020",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review"
  }
}