{
  "source": "https://www.techradar.com/reviews/acer-chromebook-spin-513-review",
  "title": "Acer Chromebook Spin 513 review",
  "category": "computing",
  "updated": "2021-06-29T09:41:13Z",
  "author": "richard-devine",
  "summary": "Acer brings Snapdragon into the arena",
  "verdict": "The Chromebook Spin 513 is a good Chromebook and it has an attractive price to go with its stylish design, good battery life, and plenty of flexibility. But the Snapdragon just isn’t as good as you can find in competing Chromebooks powered by Intel at this price point.",
  "pros": [
    "Sleek, stylish design",
    "USB-C power",
    "Strong battery life",
    "2-in-1 design",
    "Great trackpad"
  ],
  "cons": [
    "Average speaker quality",
    "Extremely glossy display",
    "No memory card slot",
    "Performance falls short of competing Chromebooks at this price"
  ],
  "article": [
    "All of the best Chromebooks today generally have a number of features in common. Touch displays are widespread, as is great battery life and the killer feature for a number of years, an attractive price.",
    "Acer’s new Chromebook Spin 513 ticks all the right boxes for a desirable Chromebook. Without seeing the traditional Chromebook logo on the lid, you could easily mistake this for one of the company’s newer Windows 10 Ultrabooks. But what’s out front isn’t really the story with this particular Chromebook.",
    "Inside it uses the Qualcomm Snapdragon 7c processor, which makes this an ARM-based Chromebook, and promises much stronger performance than something like the much-loved, but definitely under-powered Lenovo Chromebook Duet. It also means silent running, with no noisy fans to spoil your day.",
    "The Acer Chromebook Spin 513 is a compact 2-in-1 Chromebook, with a full 360-degree hinge which means maximum versatility in putting it to work. Once you’re done with your daily tasks and want to kick back with a movie or perhaps play a little Google Stadia, rotate that display, get the keyboard out of the way and sink into relaxation mode.",
    "It also works as a solid, if large, tablet when fully rotated. A 13-inch tablet is a bit cumbersome, but it makes for a superb reading experience for books and magazines, and of course, all the Android apps you can install from the Play Store simply work better with a touchscreen. It’s a shame that this is an exceptionally glossy display, though, because on anything but full brightness you’ll be looking at your face and your fingerprints a lot.",
    "ChromeOS has been optimized for ARM processors for many years now and it’s certainly extremely refined. There are no compatibility issues to worry about, unlike with Windows 10 on ARM devices, and the Chromebook Spin 513 can still fire up a Linux virtual machine like any other Chromebook. You will encounter compatibility issues here with some Linux apps, as not everything you might want to install has been built for ARM, but on the whole, it’s the same experience you’d get on an Intel Chromebook.",
    "What isn’t the same as on an Intel Chromebook, however, is the overall performance. The Chromebook Spin 513 has excellent battery life, and performance is pretty good, but it’s also impossible to ignore that a similarly priced Intel-powered Chromebook like the Lenovo Flex 5 is significantly more impressive. For most, this might not be noticeable, but Chromebooks are increasingly attractive for development and other professional work, and it’s here the Chromebook Spin 513 will fall short.",
    "It’s also disappointing that with only 4GB of RAM inside, you’ll run into too many occasions of ChromeOS just stuttering and stumbling. That part isn’t Acer’s fault, but when you’re using almost all of the available RAM with nothing open, the manufacturers need to start supplying more memory. If Google isn’t going to do something, then it falls to the companies making the Chromebooks. After all, it’s Acer’s badge on the lid and to most casual buyers, it’s Acer who’s responsible for giving them a good laptop.",
    "The Chromebook Spin 513 is a good Chromebook, though. It isn’t necessarily the first one you should run out and buy, but if you’re shopping in the $500 and under category definitely put it on the shortlist. For most people most of the time it’ll be absolutely perfect.",
    "The Acer Chromebook Spin 513 doesn’t do anything radical with its design, but for a sub-$500 laptop it’s very well done. The Chromebook Spin 513 is priced at just £399/$399/AU$560 and you get plenty for it. It’s mostly plastic with a metallic lid, but it doesn’t look like plastic. It looks like one of Acer’s mid-tier Ultrabooks, with a slim chassis mated to a convertible, 13-inch Full HD touch display with skinny side bezels.",
    "The sides of the laptop taper to their thinnest point at the front, thanks to a cleverly curved bottom panel. This allows the sides to be thick enough at the back to accommodate ports. You don’t get a lot, but there are two USB-C, one USB-A, and a 3.5mm headphone jack. Power is delivered over USB-C, so you do lose one if you’re charging, but equally, you can charge from both sides.",
    "The keyboard is a standard Chromebook affair. Despite fairly shallow key travel, the lack of any real flex in the base of the laptop means it’s really nice to type on. It feels firm and clicky, and is paired with an excellent trackpad. It’s covered in Gorilla Glass, so the surface is completely smooth and it’s very responsive with a strong clicking action. It’s one of the best trackpads you’ll find on any laptop in this price range and is especially useful if you like to use gesture controls.",
    "One of the benefits of the Acer Chromebook Spin 513 is that it has a fully convertible display. At 13.3-inches and with a 1080p resolution, it’s a perfect size for both working on and consuming media and games. Everything looks sharp, colors look great and it gets plenty bright enough. But you won’t be working outdoors with one of these.",
    "This is a seriously glossy display. Even indoors, if you dim the brightness you’ll be staring back at yourself most of the day, and if you use the touchscreen, keep a microfiber handy. Glossy displays aren’t anything new, and generally, they go hand-in-hand with touch, but it’s still hard to live with at times.",
    "The storage situation on the Chromebook Spin 513 is also a little disappointing. You only get 64GB of eMMC, which for most ChromeOS operations is fine. But if you start installing Android apps and games, Linux software, or even just store a lot of files offline, it won’t go that far. It’s more of an issue here because, without a memory card slot, you can’t expand your storage with a microSD card either.",
    "The other disappointing thing about the hardware is the lackluster speakers. Being bottom-firing, at least when you’re using the laptop to watch media or play a game, the sound isn’t obstructed. But like too many Chromebooks, they’re a bit tinny and lack any real definition.",
    "The beauty of the latest ARM chips in Chromebooks, like the Snapdragon 7c found here, is that the experience is now so good that most users wouldn’t be able to tell it apart from an Intel-powered competitor. That isn’t overselling it, either.",
    "The Chromebook Spin 513 performs admirably at most tasks that most Chromebook users would want to use it for. General web browsing is fine unless you stack Google Chrome with too many tabs, Android apps zip along and you get the added benefit of no fan noise and good battery life.",
    "But, as good as performance is, the Snapdragon 7c is still a good way behind the Intel Core i3 in sheer horsepower. And if you’re the sort of Chromebook buyer who’s looking to do a little bit more than just using some Android apps and the browser, it might not be the one for you.",
    "In every performance benchmark, the Chromebook Spin 513 falls behind the similarly priced, Lenovo Flex 5 with 4GB of RAM and a 10th Gen Intel Core i3 processor. The Core i3 is also better suited to Linux use, with no worries of ARM-based incompatibilities, and stands ahead for budding developers or content creators using a Chromebook. And for some reason the Jetstream 2 benchmark crashed every time before completing.",
    "4GB of RAM also just isn’t enough. Using Cog to examine system performance, with no browser or apps of any kind open, you can see that almost all of the available RAM is being used up just having Chrome OS booted. Either Google needs to do something to make Chrome OS less resource-heavy or laptop makers like Acer need to start putting 8GB in as a minimum on machines in this price bracket and above.",
    "On battery life, the Chromebook Spin 513 claws it back. The less power-hungry ARM processor helps push use time much further, even with that glorious 1080p display. Acer's claims of over 13 hours aren't quite met, but they're also not a million miles away.",
    "During our video test at 50% brightness battery life extended to 12 hours 26 minutes. That's the best-case scenario, however, since day-to-day use heralds decreased, but still strong battery life.",
    "In mixed-use scenarios,, with media consumption, many hours spent in the Chrome browser and using Linux apps, battery life was more between 9-10 hours, which is still ample to get through an entire day leaving the charger at home.",
    "Chrome OS is Chrome OS is Chrome OS. One of the strengths of Google’s operating system is that it’s extremely consistent across devices. Chrome OS also gets regular updates, and more recently improved the Android version inside to Android 11, meaning better compatibility and performance from apps downloaded from the Google Play Store.",
    "If you also use an Android phone, pairing this with your Chromebook opens up another avenue of convenience. Such features as instant tethering and password-free unlock are features that are easily missed when moving back to a different operating system.",
    "Compared to a similarly priced Windows 10 laptop, you’re getting a lot here, too. With the Play Store, Linux support, and the wealth of web apps out there, using a Chromebook no longer comes with the sacrifices it once did. There’s a really strong case to buy the Chromebook Spin 513 over a comparably priced Windows 10 laptop purely on the strength and performance of Chrome OS on even budget devices."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Acer Chromebook Spin 513 design and hardware",
    "16": "Acer Chromebook Spin 513 performance",
    "21": "Acer Chromebook Spin 513 battery life",
    "24": "Acer Chromebook Spin 513 software",
    "27": "Don’t buy it if..."
  },
  "links": {
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Lenovo Chromebook Duet": "https://www.techradar.com/reviews/lenovo-ideapad-duet-chromebook-review",
    "Lenovo Flex 5": "https://www.techradar.com/reviews/lenovo-ideapad-flex-5-india"
  }
}