{
  "source": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
  "title": "HTC Vive review",
  "category": "wearables",
  "updated": "2021-03-16T10:51:28Z",
  "author": "nick-pino",
  "summary": "A few years since release, the HTC Vive still offers a fun experience, despite the advanced competition.",
  "verdict": "If you have the budget, the HTC Vive is the best virtual reality experience on the market, bar none.",
  "pros": [
    "Best VR experience",
    "Intuitive controls",
    "Software partnership with Valve"
  ],
  "cons": [
    "Still a bit pricey...",
    "Requires a high-end GPU",
    "Less comfortable than the Rift"
  ],
  "article": [
    "First launched in 2016, the HTC Vive was one of the earliest premium VR headsets available to consumers. And, for a long time afterwards, it was the king of consumer VR tech.",
    "That’s because, for a good few years, it felt far ahead of many of its competitors. This made it difficult to describe the experience of stepping into virtual reality to someone who hadn’t already tried VR themselves. Even those who had had a taste of VR back in 2016 were likely only experiencing it via the cheaper mobile VR hardware like the Gear VR, Google Daydream View or Google Cardboard, which served as a great gateway into VR, but couldn’t be compared to what you’d experience with an HTC Vive strapped to your face.",
    "Fast-forward to 2021 and a lot has changed. Now, there are multiple VR headset options you could buy right now, from the super high-end experience of the Valve Index (if you can find one) through to the best option for PlayStation lovers, the PSVR and the standalone, extremely convenient Oculus Quest and, more recently, the Oculus Quest 2.",
    "Since the launch of this original HTC Vive, HTC has also launched a number of new VR headsets, including the HTC Vive Cosmos and HTC Vive Cosmos Elite.",
    "What’s more, there’s likely to be an upgrade to the HTC Vive we’re reviewing here right around the corner. A top HTC official said the company plans on producing a new wireless, standalone VR headset in 2021 that is “probably better than what’s out there from any vendor today”. Although it doesn’t seem to be a direct competitor to the likes of the Oculus Quest 2, it could still signal a shift in focus for HTC to create a more mainstream VR headset.",
    "Virtual reality might not yet be as popular as playing on a regular games console is, but more and more people are buying VR systems for their homes – or at least trying them out at a friend’s house.",
    "But that doesn’t mean to say that the original HTC Vive we’re reviewing here isn’t still a solid option for starting your VR journey – it’s just worth considering it’s a good few years older than some of the newer models entering the market.",
    "The HTC Vive wasn't affordable for most people at launch, or for a long time after, but year on year it’s got less expensive.",
    "As of right now, you can no longer officially buy the HTC Vive system through HTC, the brand is focusing on its newer headsets. However, it is still available from third-party sellers and some tech retailers.",
    "At the time of writing, the whole system, which includes the headset, the controllers, earbuds and the base stations themselves, sells for about $499 / £499 (about AU$615). This still isn’t cheap considering that's before you buy a computer with the recommended specs – which you’ll absolutely need to get the HTC Vive up and running, it isn’t a standalone headset like the Oculus Quest or Quest 2.",
    "It also isn't cheap when you look more widely at the VR landscape. It's still about $100 / £100 more expensive than the Oculus Quest 2, which is the current VR headset favorite and our most-recommended option – especially those without the powerful PC set-up who want a quick, convenient and comfortable way to try VR out for the first time.",
    "Below you'll find our original review of the HTC Vive, as well as thoughts about the VR system throughout now we're looking back at it nearly five years after it first launched.",
    "The first time we got our hands on the HTC Vive was all the way back at Mobile World Congress 2015, where HTC made the original announcement of its partnership with Valve – and it's worth noting that it's been retooled and vastly improved since that original showing.",
    "The consumer version works wonderfully, is vastly easier to setup and feels ready to be shipped to the public which, considering that units are supposed to go out any day now, is a very good thing.",
    "Like other virtual reality headsets, the Vive has the arduous task of completely immersing you in a video game by producing two images simultaneously. However, unlike PlayStation VR and Oculus Rift that use a single camera to track your head and extremities, HTC Vive has two base stations, which sit on the wall attached to the included wall mounts or a high shelf and help map track your movements as you walk around in the 3D world.",
    "What the stations track are small divots on the top of the two controllers and on the headset itself. There are 72 of these dots speckling the controllers and helmet that help accurately track the Vive.",
    "Inside every box is a Vive headset unit, two controllers, two base stations, earbuds, a cloth to wipe down the lenses, a small hub that sits between the headset and your PC, charging cords for the controllers and power cables for base stations. Also packaged with every unit are three games: Job Simulator, Fantastic Contraption and The Lab. It's everything you're going to need for a great virtual reality experience minus the computer that powers the whole thing.",
    "New to the consumer version is a spectacularly simple setup program that should, for the vast majority of tech enthusiasts, allow you to breeze through the setup process.",
    "Once you're plugged in and the room has been mapped out, you're free to roam around every inch of the digital space. This means digital worlds can be more expansive and more immersive on the Vive than the other two systems and, thankfully, less nausea-inducing, too.",
    "The only limitations you'll encounter once inside your digital world are faint blue walls made up of lines that keep you inside the playzone. These blue lines are superimposed into your game by SteamVR, the software put out by Valve that's running underneath every virtual experience.",
    "It's called \"chaperone mode,\" and its practical application is to prevent you from moving too far outside the area that you've set up for the Vive and potentially stumbling into furniture/plants/animals/etc around your home and hurting yourself.",
    "As for the games themselves, what's there is simply amazing.",
    "In the course of two weeks, I've played 20 or so titles, some of which are much, much better than others. I'll cover them in detail in a moment but, in short, they were mostly fantastic showcases for VR, full of personality and just as varied as you might expect. One minute I was on top of a castle fending off stickman invaders with a bow and arrow, the next I was inside of an arcade cabinet fighting spaceships in three dimensions. I played mini-golf on an impossibly constructed multi-level course and trained to become both a ninja and space pirate.",
    "Some of what I just described is part of Valve's The Lab, a collection of games that the iconic developer put together to introduce players to virtual reality. These are all very good titles, but third-party developers have now caught up and are releasing some very decent VR games too."
  ],
  "headers": {
    "12": "How does the HTC Vive work?"
  },
  "links": {
    "Gear VR": "https://www.techradar.com/reviews/samsung-gear-vr-2017",
    "Google Daydream View": "https://www.techradar.com/reviews/daydream-view-2017",
    "Google Cardboard": "https://www.techradar.com/reviews/wearables/google-cardboard-1287573/review",
    "Valve Index": "https://www.techradar.com/reviews/valve-index#:~:text=Final%20verdict,you%20go%20to%20use%20it.",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "HTC Vive Cosmos": "https://www.techradar.com/reviews/htc-vive-cosmos-and-cosmos-elite",
    "HTC Vive Cosmos Elite": "https://www.techradar.com/reviews/htc-vive-cosmos-and-cosmos-elite",
    "A top HTC official said": "https://www.techradar.com/news/htc-vive-successor-wont-rival-oculus-quest-2-when-it-launches-later-in-2021",
    "PlayStation VR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review"
  }
}