{
  "source": "https://www.techradar.com/reviews/nada-temporary-email",
  "title": "Nada temporary email review",
  "category": "computing",
  "updated": "2021-07-15T16:00:58Z",
  "author": "chelsea-forsyth",
  "summary": "Temporary email inboxes to keep your main account spam-free",
  "verdict": "A simple service that does exactly what it says on the tin, nada is an accessible and hassle-free temporary email service that’s great for redirecting spam mail away from your main email account.",
  "pros": [
    "Completely free",
    "Easy to set up",
    "Keeps your main email account free from spam"
  ],
  "cons": [
    "Inboxes are public",
    "Can’t send or reply to emails",
    "Very basic service"
  ],
  "article": [
    "Entering your email address to access or sign up to new services is a common occurrence—but that doesn’t mean you have to disclose your main account to untrustworthy sites unnecessarily.",
    "While you do have the option to switch to one of the best secure email providers to keep your data safe from hackers or unknown senders, utilizing a temporary email service also means you can keep your main inbox spam-free and protected. One option is nada—a free, disposable email service that many use when registering to new websites that require email details or confirmation.",
    "In this nada email review, we’ll discuss the pros and cons of using this service, its main features, and who nada is right for.",
    "Currently, nada’s email service is completely free of charge. While at the time of writing the service is quite basic—you’re unable to send emails, only receive them in a public inbox that anyone can access—it is possible that paid subscriptions could occur if the service evolves further.",
    "While nada is a relatively simple platform, there are still many features that make the service stand out.",
    "While the odd bit of spam mail can slip through and end up in your junk folder, utilizing nada’s service means the majority can be redirected away from your main email and into your temporary account.",
    "Choose a specific name for your account or accept one randomly generated by nada, and use it when registering to new websites or less-trustworthy services that require an email account. Then, watch as any unwanted emails land straight in your nada inbox, rather than clogging up your main account.",
    "Nada’s service isn’t exactly private—your account is accessible by anyone with the email address, so it’s intended for use only for non-personal, disposable communications. Regardless, it’s reassuring to know that all emails are only kept for up to seven days, and that you have the option to manually delete them after reading—which is also recommended for privacy reasons.",
    "With this in mind, don’t use this service for any important correspondence. If your inbox were to delete everything or stop receiving emails, you would no longer have access to your mail. You should not use nada for banking, buying cryptocurrency, registering for services that you intend to use daily, or really for anything that you will need at a later date.",
    "Creating a nada inbox takes a few seconds, and there’s no registration process requiring personal details. Upon heading to the website, you’ll automatically be greeted with a randomly-generated inbox that you can start using immediately. To access this inbox on another device, you don’t need to log in—clicking “add inbox” and typing in the email address will display your messages.",
    "You also have the option to create a custom email address by choosing a username and picking from a list of twelve domains. You can create as many of these as you like.",
    "As nada is a purely web-based service, there’s no email program to download or install—it’s all managed directly from your browser. While the user interface is basic, nada’s website adequately performs its sole function of receiving and displaying emails quickly and clearly. Accessed on mobile, the website isn’t as responsive, which is probably why a mobile-friendly version of your inbox can be accessed via the free app. While simple, nada’s mobile app is sleek and responsive, and adding existing inboxes is easy to do.",
    "Keep in mind that you can’t send or reply to emails in nada—it’s simply a temporary space on the web where you can receive unimportant communications. Put simply, nada’s interface is designed as a way to register to websites and confirm your email address, rather than a communication platform.",
    "While nada’s service is relatively straightforward, there are still support options for users who encounter issues.",
    "You can send enquiries via the form on nada’s website. While this is advertised as a feedback tool for users, designed to improve the service, there’s nothing that states basic enquiries can’t also be entered here.",
    "Nada also has a Facebook page where its community of users often post feedback. Nada frequently asks for user feedback here, and suggested changes from the community have been implemented as a result. Support enquiries are also welcome via the Facebook page, with responses taking one to two working days.",
    "If you’re looking for a secure email service to send and receive communications, you’ll probably want to look elsewhere, as all nada inboxes are public. This means that—if you have the name of the inbox—you can “add” it into your nada browser or app and view messages from anywhere. As a result, it’s recommended that you only use nada inboxes for insensitive correspondence that doesn’t contain personal details.",
    "Nada states that they do not keep IP logs of users of the service—all IP logs are automatically deleted after 24 hours, with IP information encrypted in such a way that company employees cannot access them. This is beneficial to those wanting a no-hassle place to receive communications, but it also means that once deleted, emails and inboxes cannot be recovered.",
    "While nada’s service is useful, other services like Temp Mail and Email on Deck are also viable options. Both offer a free service with a similar user interface, though Email on Deck does enable the sending of emails too, and offers a Pro subscription which can be purchased with Bitcoin.",
    "Costing around $60 (or 0.001761 BTC) for 30 days, Email on Deck’s Pro account offers the removal of ads, the sending of 100+ emails, and the ability to send anonymous emails.",
    "If you’re looking for a convenient way to redirect spam, nada’s temporary email is a brilliant solution. With a quick, hassle-free set-up, multiple inboxes at your disposal, and automatic deletion of emails, nada offers a simple way to keep your main account decluttered.",
    "While ideal for those signing up to new, infrequently used services or websites, keep in mind that nada shouldn’t be a replacement for your main email account—the lack of sending or replying to emails is a hindrance. While those looking for a private, encrypted email account can opt for one of the best secure email providers instead, nada is an accessible, no-frills service for throwaway communications."
  ],
  "headers": {
    "3": "Plans and pricing",
    "4": "Features",
    "9": "Interface and in use",
    "13": "Support",
    "16": "Security",
    "18": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "best secure email providers": "https://www.techradar.com/best/best-secure-email-providers",
    "nada": "https://getnada.com/",
    "email account": "https://www.techradar.com/news/best-email-provider",
    "Temp Mail": "https://temp-mail.org/en/",
    "Email on Deck": "https://www.emailondeck.com/",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin"
  }
}