{
  "source": "https://www.techradar.com/reviews/roku-streaming-stick",
  "title": "Roku Streaming Stick+ review",
  "category": "audio-visual",
  "updated": "2021-12-01T17:47:14Z",
  "author": "nick-pino",
  "summary": "Roku’s streaming stick goes full-on 4K with exciting results",
  "verdict": "While the Roku Streaming Stick+ has better range than its predecessors, and the power to process 4K HDR video, a few niggling issues like slow pop-in time on the home screen and lack of Dolby support keep it from reaching its full potential.",
  "pros": [
    "4K HDR Streaming Stick",
    "Wi-Fi antenna placement",
    "Roku OS 8"
  ],
  "cons": [
    "Proprietary power cable",
    "No Dolby Vision or Atmos",
    "Occasional pop-in issues"
  ],
  "article": [
    "While the Roku Streaming Stick+ has now been usurped by the newer Roku Streaming Stick 4K+, it's still a very good value for streaming sticks.",
    "At around two years old, this was one of the first streaming device in the stick-shaped form factor to offer both 4K and HDR screen option, and offered a far-reaching Wi-Fi antenna.",
    "You'll get both those features in the latest Roku Streaming Stick 4K+, but if you can find this on sale for a discount, we still recommend it.",
    "[Update: Since October 2019, the Roku Streaming Stick+ had a permanent price drop from $59.99 to $49.99. In addition to the price drop, Roku announced that new models will include an updated remote that includes volume and power controls as well as the new mute button. We've updated our review to reflect the price change.]",
    "Surprisingly, the Roku Streaming Stick+ only costs a mere $49.99/£59.99, after a $10 price drop in October 2019. It’s a price that makes the old Roku Premiere+ obsolete and places the 4K streaming stick in ‘impulse buy’ territory.",
    "For comparison, the Amazon Fire TV Stick 4K is regularly priced at $49.99 / £49.99, but can often be found for $34.99 / £39.99.",
    "Last but not least Google's 4K streamer, the Chromecast Ultra, goes for $69 / £69 and it doesn't come with a traditional remote.",
    "Roku’s streaming sticks have always been deceptively simple devices, but the new Roku Streaming Stick+ takes that design philosophy to a new level: It’s just as petite as its predecessors (a mere 3.7 x 0.8 x 0.47 inches and 0.9 ounces) but stuffs even more power into the flash drive-sized form factor. Despite the additional hardware, however, it will still neatly fit behind your TV, and draw power from either your TV’s USB port or from the wall.",
    "It is, for the most part, a familiar design. It’s a form factor that Roku pioneered five years ago with its oblong and creatively colored purple Roku Streaming Stick, and it’s clearly served the company well over the years. The form factor was popular enough for Roku to warrant an update last year and throughout the years has been copied by both main hardware manufacturers and cheap knock-offs alike.",
    "New for the Streaming Stick+ is that strange, proprietary power cable that houses the external antenna. It provides the Roku Streaming Stick+ with four times the range as the old Roku Streaming Sticks and helps reduce interference. The benefit here is a faster and more stable streaming experience which translates to faster load times and less time buffering.",
    "The downside is that, should the cable break or go MIA for any reason, you can’t just replace it with any old mini-USB cable. Thankfully, Roku has given that scenario some thought and will make individual cables available for purchase - i.e. you won’t have to rebuy the entire system just because you’ve misplaced (or destroyed) the power cable.",
    "The major advantage Roku has over its competition - namely the Chromecast Ultra - is that, like every other model Roku makes, the Streaming Stick+ comes packaged with a remote.",
    "While the Streaming Stick’s remote doesn’t have all the bells and whistles that the Roku Ultra has, it still feels fairly premium. It has a microphone built-in for voice search, dedicated media buttons for Netflix, Sling, Hulu and PlayStation Vue, and thanks to its IR Blaster/HDMI CEC connection, it can control the volume on your TV and some external devices.",
    "It would’ve been nice to have 3.5mm audio jack built directly into the remote, but not having one here isn’t a dealbreaker - and plus, there’s always the Roku app for iOS and Android.",
    "Of course, what’s hardware without software to go along with it?",
    "In the case of the new Roku Streaming Stick+, you’ll have to familiarize yourself with Roku OS 8 – a pumped up version of the egalitarian operating system that adds few new streaming services and apps, including Roku’s free streaming channel, Roku TV.",
    "Before now, Roku had most everything a streamer could want: Netflix and Amazon, obviously, but also YouTube, Crackle and Vudu as well. If you’d like to stream some audio, Roku offers both music mainstays, Pandora and Spotify, but also Deezer, VEVO, SiriusXM, Amazon Music and TuneIn, too.",
    "The latest addition to the line-up is Roku’s own streaming channel - a free-to-watch network that has films and TV shows the company has licensed from studios like Columbia and Paramount. The films range in quality and swap from time-to-time, but considering it’s all free content, it’s hard to complain too much.",
    "While we were reviewing the Roku Streaming Stick+, The Roku Channel was showing The Warriors, The Pursuit of Happyness, Drive and Men in Black, among dozens of others.",
    "While the massive, egalitarian offering of 3,000+ streaming channels is clearly the highlight of Roku OS, we’re also fond of its clean and simple layout, as well as its robust search platform. Nearly everything is easy to find on the platform, aided in no small part by deeply integrated voice search functionality that scours over 200 apps to find the best prices on shows and films, and features like My Feed help us keep track of the content coming shortly that we have our eyes on.",
    "The interface is feeling a bit dated as time goes on, but we’d rather have something that works - even if it’s a bit older - rather than something that crashes unexpectedly each and every time you turn it on. (Cough, Android TV.)",
    "So what’s it like to use Roku’s pint-sized streaming device? In a word: Great.",
    "In more words, the Roku Streaming Stick+ is an excellent device - jumping in between apps is a quick and painless affair, and videos start up quickly, even if they’re in 4K HDR.",
    "Not only does the new Roku Streaming Stick+ competently play 4K UHD content, it can play it from a decent range, too. This is a huge boon for those of us who keep our entertainment far away from our router, and will likely improve the experience for anyone who suffers from slow buffering times or frequent stutters.",
    "So far, there hasn’t been too much to criticize the Roku Streaming Stick+ about. And that’s because, as a standard 4K HDR10 streamer, Roku’s latest iteration of the streaming stick is an all-around great device. But start talking about future-facing technology and things become a bit murkier.",
    "The big place we could see Roku losing out to the competition down the road is on format support. Apple surprised many when it announced that it would support both Dolby Vision and Dolby Atmos, two new technologies that promise better visuals and better audio, respectively – neither of which will be offered on the Roku Streaming Stick+. Dolby Vision is supported on the Chromecast Ultra as well, and Atmos is available on Xbox One consoles. For Roku to turn a blind eye to these technologies feels a bit short-sighted.",
    "The other small problem we had with the Roku Streaming Stick+ is that, from time to time, it suffered from some pop-in issues on the home menu. To be more specific, while browsing the menu, some parts of the interface would take a few seconds to load. It’s not a deal breaker and it’s not something that happened all the time, but the time spent waiting for the My Feed section to populate could’ve been spent streaming content.",
    "Roku has done something really special with the Streaming Stick+ and it’s important to recognize it. By squeezing 4K HDR streaming hardware into a device the size of USB stick, Roku has made a svelte, small, powerful and affordable streaming device.",
    "While the Roku Streaming Stick+ is perfect for the here and now, we’re definitely worried about how it will hold up - especially against the increasingly fierce competition from Google and Amazon. The other concerns we have are with its proprietary power cable - if you lose it, it’s not all that easy to replace.",
    "The Roku Streaming Stick+ is playing to its strengths – it’s small, it’s powerful and, thanks to its new external Wi-Fi antenna, has an extended range. It’s priced appropriately (especially after the recent price drop) and, don’t forget, the Roku Streaming Stick+ comes with a remote and Roku’s all-around awesome Roku OS.",
    "On the downside, though, the Roku Streaming Stick+ does use a proprietary power cable now. Lose it, and you can’t just replace it with any old mini-USB cable you have lying around. On top of that, issues with pop-in and a lack of future-facing technology stop the Roku Streaming Stick from winning our unbridled recommendation.",
    "All said, if you’re looking for a streaming stick with exceptional range and power - and don’t mind a few minor drawbacks - the Roku Streaming Stick+ is a competent addition to your audiovisual arsenal."
  ],
  "headers": {
    "4": "Price and release date",
    "7": "Design and features",
    "14": "Roku OS 8",
    "21": "Performance",
    "27": "We liked",
    "28": "We disliked",
    "29": "Final verdict"
  },
  "links": {
    "Roku Streaming Stick 4K+": "https://www.techradar.com/reviews/roku-streaming-stick-4k-2021",
    "Roku Premiere+": "https://www.techradar.com/reviews/roku-premiere-plus",
    "Amazon Fire TV Stick 4K": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
    "Chromecast Ultra": "https://www.techradar.com/reviews/chromecast-ultra"
  }
}