{
  "source": "https://www.techradar.com/reviews/realme-8-5g-review",
  "title": "Realme 8 5G review",
  "category": "phones",
  "updated": "2021-05-28T14:27:31Z",
  "author": "david-nield",
  "summary": "5G on a budget",
  "verdict": "The Realme 8 5G is exactly what you would expect before you unbox it, knowing the retail price and the manufacturer: a solid, inexpensive 5G phone. If that's what you're in the market for, then this handset is definitely going to appeal.",
  "pros": [
    "It has 5G",
    "Large, bright screen",
    "Very cheap"
  ],
  "cons": [
    "Rather basic design",
    "No wireless charging",
    "Average camera"
  ],
  "article": [
    "The low-end, low-price smartphone market has never been busier, with the likes of Xiaomi and OnePlus joining seasoned budget phone makers Motorola and Nokia in pushing out super-cheap handsets that cover all the necessary basics without putting a huge dent in your bank balance.",
    "Then we have Realme, which already has a long line of solid, inexpensive phones behind it. New for 2021 is the Realme 8 5G, which offers more of the same: a respectable level of performance and an appealing design for not much money at all. In fact, you won't be able to find a cheaper 5G phone than this right now in some markets.",
    "Of course there are necessary compromises to get to this price point – you shouldn't expect top performance or the best camera capabilities from the Realme 8 5G. However, it's got enough to keep a lot of users happy, and for many people the actual cost of the phone is more important than extras such as wireless charging.",
    "The need for 5G is an interesting one in 2021: most phones now come with the technology, even at the budget end of the market, but availability in terms of network coverage remains patchy around the world. Buying a 5G phone now protects you for the future, but it's hardly a necessity at the moment.",
    "It's worth noting that there is a 4G version of the Realme 8 that actually costs more – it ditches the 5G but has a better screen and a better camera. You need to decide which smartphone features you want to spend your money on, and when you have, you'll find there's a phone out there for everyone.",
    "There's no doubt that the highlights of this phone are the 5G and the affordable price, but we've also been impressed by the longevity of the 5,000mAh battery packed in here, and the screen quality and general performance are good for the price too. In other areas – like the camera – the Realme 8 5G does okay without really standing out from the crowd.",
    "Whether you're looking at budget phones or the iPhone 12 Pro Max, picking the right handset is about weighing up the features and performance against the price, and the Realme 8 5G definitely gives you a lot for your money – which is exactly as you would expect from the phone maker's track record.",
    "You can pick up the Realme 8 5G from May 20 in the UK, but until May 23, 2021 there are early bird prices available: £179 for the 4GB of RAM/64GB of storage option (normal price £199) and £229 for the 6GB of RAM/128GB of storage option (normal price £249).",
    "At the time of writing the best way to get the Realme 8 5G is to go directly to the Realme website.",
    "At the standard starting price it amounts to around $280 /AU$365, but there are currently no plans for the phone to be launched in the US or Australia. As always, check the widgets on this page for the latest online deals for the phone.",
    "Realme has been making smartphones for a good number of years now, and considering what we've seen in the past it's no surprise that the Realme 8 5G is a well-built, smart-looking device. Despite the low price, this doesn't feel like a cheap or flimsy handset, although you don't get any sort of IP rating protection against water and dust (no surprise at the budget end of the market).",
    "The thickness of 8.5mm (about a third of an inch) makes it very slightly thinner than handsets costing similar amounts, such as the Nokia 5.4 and the Moto G50. At this price point we'd say it's one of the better phones out there in terms of its overall design and aesthetics, though you don't get anything in the way of innovation here.",
    "The 6.5-inch display means an overall width of 74.8mm (2.9 inches) and an overall height of 162.5mm (6.4 inches). The phone tips the scales at 185 grams (6.5 ounces).",
    "You've got volume controls on the left-hand side as you look at the phone, while on the right there's a recessed power button that doubles up as a fingerprint sensor – something phone makers keep doing despite our complaints about it.",
    "As this makes the power button more difficult to find and press, as well as making unlocking the phone harder, we'd much rather see the fingerprint sensor under the screen or even just on the back of the handset.",
    "Speaking of the back, the glossy plastic back has a slight shimmering effect that lends a little bit of a premium feel to the Realme 8 5G. The rear camera module is up in the top left-hand corner of the casing – it adds quite a substantial camera bump, but we can live with it. Your color choices here are Supersonic Blue (translation: blue) and Supersonic Black (translation: black).",
    "Put the Realme 8 5G in a line-up of smartphones and it's not going to look out of place alongside phones of a similar price, or indeed phones that cost a bit more up in the mid-range section of the market.",
    "While you're never going to mistake it for a high-end flagship when you hold it or glance at it, the design and feel is very solid. We've only had the phone a few days, but we can imagine it lasting for several years.",
    "The 6.5-inch, 2400 x 1080 LCD screen fitted to the front of the Realme 8 5G gives you plenty of space to work with and plenty of pixels to look at: it's actually better than you might expect for a phone at this price point. The 90Hz refresh rate is fairly standard for a 2021 phone, but it's definitely going to be good enough for most users.",
    "We ran through all the usual smartphone tasks in our testing – scrolling through social media, scrolling through websites, scrolling through the recommended carousel on Netflix – and had absolutely no complaints about the display. Realme says it has a maximum brightness of 600 nits, and when you ramp the brightness right up it's more than enough for games and movies.",
    "That brightness helps outdoors too – you won't have any problems making out details on this screen in daylight. Viewing angles are solid, animations and videos are fluid and smooth, and it's worth mentioning that you can adjust the color temperature of the screen through the onboard Realme UI software if needed.",
    "While a 1080p screen does feel a little cramped at times in terms of how much you can fit on screen at once, it's actually par for the course at this price: you're not going to be too disappointed unless you're taking a step down from something at the upper mid-range or flagship level.",
    "And while the difference between this screen and the displays on high-end flagships is noticeable in terms of brightness and fluidity, the Realme 8 5G still very much holds its own.",
    "It's also worth mentioning that the phone comes with a thin, transparent screen protector already attached to the display – it's up to you if you want to take it off. The only interruption to the screen is the punch-hole selfie camera.",
    "The Realme 8 5G comes with a 16MP selfie camera on the front – definitely more megapixels than you might expect from a selfie camera on a budget phone – and a triple-lens 48MP main + 2MP macro + 2MP depth rear camera on the back.",
    "There's no ultra-wide lens here, and no optical zoom, so it's really that 48MP main camera that's doing pretty much all the work. While we tried out a few macro shots, we didn't find the dedicated mode particularly smart at picking up close-ups.",
    "Despite that lack of flexibility, this rear camera is perfectly capable, thanks to that main 48MP sensor: pictures come out sharp and well-balanced, if a little over-saturated at times, and focusing speeds are good.",
    "Unless you're shooting photos professionally, you'll be mostly happy with the results that you get here – the vast majority of the time they're good enough for social media as long as the lighting is good.",
    "It's a similar story across most budget phones that we test, because phone camera optics have now progressed to the point where even the cheapest components can capture something worthwhile. The lack of ultra-wide and optical zoom is a shame though, and as the light goes down, the weaknesses in the camera setup start to show up.",
    "You can still get photos at night, with a reasonable amount of detail – especially if you activate the night mode, which boosts the brightness a bit if you're able to keep the phone steady for longer. However, you usually end up with a lot of noise and blur as well, particularly when you're not taking a picture of something close up.",
    "Overall, this is one of those areas where the Realme 8 5G performs pretty much as you would expect considering the price you're paying – you're going to buy this phone because you want 5G and something affordable, and everything after that is a bonus. For everyday quick snaps, it's perfectly fine.",
    "Video recording is nothing to get excited about, with rather humdrum results in our testing. The video capture capabilities top out at a 1080p resolution at 30 frames per second, and in general that's going to satisfy everyone below the level of serious movie maker.",
    "There are also slow motion video recording capabilities, as well as a pro photography mode that gives you more control over settings such as white balance.",
    "The Realme 8 5G is powered by the budget Dimensity 700 5G chipset from MediaTek, and on the Realme UK website, the phone is listed with 8GB of RAM and 128GB of internal storage – which is what our review unit came with.",
    "However, this model isn't actually going on sale in the UK: your choices are actually 4GB of RAM/64GB of storage and 6GB of RAM/128GB of storage (you can extend that storage with a microSD card if you need to).",
    "As for the phone we had to test (8GB of RAM/128GB of storage), we found it pleasingly smooth in operation, with no noticeable lag when jumping between menus and apps, and websites and media files loading up smoothly.",
    "It's worth again emphasizing though that this 8GB version isn't available in the UK, so we're not sure why Realme sent us this particular configuration – less RAM will have an impact on performance.",
    "Smartphone performance is usually one of the key areas where you get what you pay for, from the cheapest to the most expensive handsets, and that's the case here – it's certainly no flyer, but it'll do everything you need it to do. That's backed up by Geekbench 5 scores of 569 (single-core), 1,765 (multi-core) and 1,515 (OpenCL), which are in the region of what you would expect given the internals.",
    "You can get away with some light gaming on the Realme 8 5G, and even some quite heavy gaming if you don't mind a reduction in frame rates. We tried several reasonably demanding and fast-paced games, and didn't notice the phone skipping a beat.",
    "Of course the question with budget phones is just how long they'll hold their performance for, which we can't tell you about. We also can't judge the phone with 6GB of RAM or 4GB of RAM, which are the versions on sale in the UK.",
    "5G is a big draw at this price, and you'll have to work very hard to find a cheaper 5G phone to take advantage of those glorious next-gen upload and download speeds. The question is though whether it's worth saving money on the 5G aspect and getting a similarly priced 4G phone that adds extras in other areas – like performance and camera quality. After all, 5G is by no means ubiquitous at the moment, and 4G speeds are generally fine for most people's day-to-day use.",
    "Rounding out the specs, the phone comes with a single speaker and there is a 3.5mm headphone jack here, so you can easily use wired headphones if you want to, no dongle required. As with previous Realme phones, there's a clear plastic case included in the box, giving you some basic protection for free if you want it.",
    "Android 11 is on board here, which is good to see, although we've never quite fallen in love with the Realme UI that's on top. Like a lot of Android skins from Chinese phone makers, it's just a bit busy, a bit quirky, a bit garish for our tastes – you've got a bunch of extra apps like an Instagram clone called 92 installed for some reason – but your mileage may differ.",
    "The 5,000mAh capacity battery packed inside the Realme 8 5G really does a great job: we were finishing days with 50% of juice still left in the tank, which is impressive.",
    "It's not unusual for a budget phone though: typically less powerful components and lower resolution screens tend to be kinder in terms of strain on the battery. Note that there's no wireless charging here, only wired charging up to a maximum of 18W.",
    "If you need a phone that's able to go a couple of days between charges then the Realme 8 5G might well be it. That said, if you're going to really hammer the 5G modem, push up the screen brightness and spend a lot of time using GPS for navigating, that time between charges will rapidly come down. As always, it depends how you're going to use your device, but the Realme 8 5G is definitely above average in the battery life department.",
    "Watching streaming video (at maximum brightness and a low volume) knocked the battery down by about 10% per hour, while gaming drained a little bit more: between 12-15% an hour on average. Those are decent figures, even if we are talking about a brand new phone with a brand new battery inside it – you're covered for long journeys whether you want to game or stream the time away.",
    "When you're not doing anything with the phone – unlikely but possible – you're only going to see drops of about 10% or so per day. Realme says it's worked hard on battery optimizations so that the phone is never drawing more power than it needs to (adapting the use of the 5G modem when you're not connected to a 5G network, for example, which can otherwise be a major battery drain).",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Realme 8 5G release date and price",
    "10": "Design",
    "18": "Display",
    "24": "Camera",
    "33": "Specs and performance",
    "43": "Battery life",
    "48": "Don't buy it if..."
  },
  "links": {
    "Xiaomi": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "OnePlus": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "Motorola": "https://www.techradar.com/reviews/moto-g10-review",
    "Nokia": "https://www.techradar.com/reviews/nokia-34",
    "solid, inexpensive phones": "https://www.techradar.com/reviews/realme-7-5g",
    "Realme 8": "https://www.techradar.com/reviews/realme-8-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "the Realme website": "https://www.realme.com/uk/realme-8-5g",
    "what we've seen": "https://www.techradar.com/reviews/realme-7-review",
    "Nokia 5.4": "https://www.techradar.com/reviews/nokia-54-full-review",
    "Moto G50": "https://www.techradar.com/news/the-moto-g50-is-a-surprise-new-cheap-phone-and-it-comes-with-5g",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}