{
  "source": "https://www.techradar.com/reviews/cowboy-4",
  "title": "Cowboy 4 review",
  "category": "fitness",
  "updated": "2021-09-27T09:04:14Z",
  "author": "joseph-delves",
  "summary": "The Cowboy 4 makes an almost unimpeachable case for being your next e-bike",
  "verdict": "Superb value and with both great hardware and a fantastic smartphone-based user interface the Cowboy is incredibly polished. Suited to racing around town, it’s simple, powerful, and stylish. Low maintenance and easy to operate, it’s the sort of design that will makes cycling the most viable choice for almost any journey.",
  "pros": [
    "Excellent handling and simple design",
    "On-bike charging for smartphone navigation",
    "Affordable insurance option"
  ],
  "cons": [
    "Non-adjustable assistance level",
    "More expensive than its closest rival"
  ],
  "article": [
    "If you’re looking for an e-bike for the city, you’re going to need a pretty good reason not to buy a Cowboy 4. One of the two best value machines on the market, we think it also has a slight edge versus its main rival when it comes to both hardware and user experience.",
    "Designed by Belgian bikemaker Cowboy, this fourth version of the firm’s machine delivers pretty much everything you could want from a bike made for helping you navigate town. Very simple, very low maintenance, and, thanks to a wirelessly charged smartphone interface, able to point you in the right direction, it’s brilliantly clever and a blast to ride.",
    "Very neat looking, the bike uses a combination of a quality rear-hub motor and a single-speed drive to propel its rider along. These are powered by a removable battery that should manage most commuters’ journeys several times over before needing to be recharged.",
    "It's available with a standard or step-through frame, both of which use almost identical components including in-built and centrally powered lights, an oil-free belt drive, and hydraulic disc brakes. Finished with mudguards, both models are fairly upright for a low-stress riding position, while wide tyres and a rigid fork continue the bikes’ generally utilitarian design.",
    "That's all very modern, although the Cowboy 4 deserves to gain diverse fans it’s clearly designed to appeal most to occasional cyclists, or those previously put off conventionally powered bikes. Further helping attract this non-traditional crowd, the Cowboy is controlled via a very slick smartphone app.",
    "Best of all, for an extra £29 (about $40 / AU$50), a compatible smartphone can be attached to a wireless charger, placing all the bike’s stats, along with internet-based mapping right on your handlebars, leaving most of the Cowboy 4’s rivals lost down a dead-end street.",
    "The only downside is range; at 43.5 miles with power assistance, it's the same as the Ampler Curt, but less than the Ribble Hybrid Al e, which can keep running for up to 60 miles and carries a similar price tag. The Cowboy smartphone app doesn't let you customize the power options to eke out a little more distance at the expense of power, which may disappoint some riders who want to embark on longer weekend treks, but for those who want to simply climb aboard and ride the city streets, that will be less of a concern.",
    "Both conventional and step-through versions of the Cowboy 4 are available to pre-order now direct from Cowboy in Europe and the US. In Europe, the bike is due to ship in September 2021 and costs £2,290 / €2,490 including delivery.",
    "In the US, the Cowboy 4 is available for an early bird price of $1,990 until 31 October 2021, with a $100 deposit payable up front. The first bikes are due to start shipping to US customers in January 2022.",
    "That's certainly not cheap, but is a reasonable price for an e-bike with these specifications, and is slightly less than the similarly sleek WAU Bike.",
    "The Cowboy 4’s design boasts a high degree of integration, along with a minimalist parts list. Largely because of the motor assistance, it’s able to get by with a single-speed drivetrain, relying on the extra electrical assistance rather than any gears helping it to deal with hills or headwinds. In turn, this keeps the whole bike both lightweight and low maintenance.",
    "The motor allowing for this trick is hidden away in the rear hub, while its battery can easily be spotted behind the seat tube. Able to be locked in place for security while parked, it can also be removed for convenient indoor charging.",
    "The components that make up the rest of the bike, like the brakes and tires are all unbranded and have mostly been commissioned by Cowboy. However, a real nerd could probably identify their manufacturers, and happily, it’s all quality stuff. The disc brakes are hydraulic, meaning they run on reliable fluid rather than more fiddly cables.",
    "The broad tires can roll over most things and allow enough of a cushion that you won’t notice the absence of a suspension fork. At either end of the bike are in-built lights powered via the central battery, while the space above the stem is filled by a Quad-Lock bracket for holding your phone.",
    "Rounded off with fenders to keep your backside dry, the Cowboy 4 is available with either a conventional or step-through frame. Both come in a single size, with the step-through being optimized for riders between 160-190 cm and the standard model serving those 170-195 cm tall. This leaves anyone in between free to pick which they prefer. Having tried both, we think the step-through is not only a great choice for those looking to use a child seat or panniers, but perhaps the most carefree feeling of the two.",
    "Regardless of which you pick, both the bike’s mechanical and electronic features are excellent. Zipping along confidently with the motor sensing when to add power to your pedalling, they’re great for getting a head start in traffic.",
    "However, unlike most bikes, the level of assistance can’t be customized through the smartphone app. That's potentially annoying for those that want to do more of the work themselves, it’s also less than ideal when navigating through areas shared with pedestrians, where a less enthusiastic motor response would be better. However, 95% of the time the level of support is spot on. Certainly, it’s not the sort of bike that’s likely to leave you sweaty when you reach your destination.",
    "The other downside of the lack of customization is that you can't tweak the Cowboy 4's power settings to reduce the motor output in exchange for a little extra range. The bike has a maximum range of 43.5 miles, which isn't exceptional (the Ribble Hybrid Al e keeps rolling for up to 60 miles, and is also an excellent e-bike for city riding). That said, the absence of adjustable settings means that it's simpler to simply climb aboard and start riding. Just be aware that this is a bike built for city streets rather than long weekend tours.",
    "Its operation is also as close to silent as we’ve found, while the handling of the bike is nicely composed and never feels skittish. Some bike snobs might lust after a centrally mounted motor, but working in conjunction with the Cowboy 4’s single-speed drive, its hub-based system gives little away versus this more expensive alternative. Its brakes are powerful, even in the rain, while the contact points like the saddle and grips are comfy.",
    "This leads us on to the bike’s clever digital extras, of which there are plenty. To start with, to unlock it, you simply have to have your pre-paired phone with you and hop aboard. Once activated, your phone could remain in your pocket, however, a far better spot would be in the bike’s additional Quad Lock case. Here it will not only benefit from wireless recharging but can act as a personal digital assistant to help you find your way.",
    "Bear in mind, however, that charging your phone will put a little extra drain on the battery. Cowboy says a complete charge takes 3.5 hours, and we found this to be accurate. We preferred to detach the pack and charge it under our desk during the working day; unlike e-bikes with a fully integrated battery like those from Ribble, you don't need to connect the entire bicycle to a mains outlet.",
    "Although it's occasionally an afterthought with some brands, you can tell almost as much work has gone into Cowboy’s app as the bike. Drop a pin or search a location, and not only will it find you quick, low-traffic routes, but it will also tell you how long it’ll take you to get there, and how much of your battery you’re likely to have left on arrival.",
    "Forget where you left your bike, or worse, have it stolen, and an inbuilt GPS tracker will help you locate it. At the same time, the app will display things like current speed and distance travelled, while also letting you log all your daily journeys. It’ll even notify a pre-chosen contact of your location in the event of a crash.",
    "The clever stuff doesn’t stop with the bike or the app either. One of the biggest difficulties of riding in many cities is holding onto your bike. As an extra, Cowboy will also insure your bike against theft for £10 (about $15 / AU$20) per month. Much cheaper than stand-alone insurance, taking up this offer is likely to mean your bike gets even more use while cutting out one major stress of inner-city cycling. Currently, Cowboy also offers a mobile repair service, although unlike many brands it doesn’t yet have dedicated service centres.",
    "If this review seems positive to the point of sycophancy, there’s a reason why I think this bike out-performs almost any similar equivalent. And it’s as much to do with the structure of the company selling the bike as that of the bike itself. Most bike companies make multiple bikes, with some larger brands producing more than one hundred different models in maybe five or six sizes plus a couple of color schemes. Generally, these then get sold through a distributor that sells to a shop, which then sells to you.",
    "Of course, None of this is very efficient. Cowboy, which has secured tens of millions of Euros in funding, makes two bikes, in a single size, using mostly identical parts.",
    "This highly efficient business model translates into very cheap bikes for the end consumer. At the same time, a bike with so much money behind it isn’t likely to be dashed off by a designer on a Friday evening. Released every few years, each iteration builds on the experience and feedback generated by focusing on a single product. Of course, creating a company capable of doing this isn't easy. Currently, I can only think of Cowboy and VanMoof as successful examples, plus a far larger number of people trying to pass off ropey products and pretending they’ve achieved the same magic.",
    "Leaving VanMoof as Cowboy’s only real rival, it’s no coincidence that both firms are targeting the same young, urban demographic with very similarly designed machines.",
    "So how does the Cowboy compare with its nearest rival? To start with, at £2,290 (about $3,200 / AU$4,200) the Cowboy 4 is almost 25% more expensive than the £1,798 (about $2,500 / AU$3,300) VanMoof S3. However, its onboard phone charging feature is currently pretty exceptional and means you’ll probably never get lost or be late again. Hardware-wise, I’m a fan of the Cowboy’s single-speed drivetrain, although plenty will prefer VanMoof’s clever four-speed automatic system.",
    "At 19kg, the Cowboy is lighter than the more unwieldy 21kg VanMoof. The Cowboy’s rear hub motor is also better than the VanMoof’s front-mounted alternative. Although slightly less slick looking, the Cowboy’s battery can be easily detached for charging, while VanMoof’s fixed version means the whole bike needs to be brought within range of a power outlet to be recharged.",
    "The finishing kit on the Cowboy also has a slight ergonomic edge, plus you can fit a rack, which is an oversight on the VanMoof. However, scoring for the VanMoof against the Cowboy is its boost button which adds a temporary injection of extra power when you need it and is just a really fun feature.",
    "Most of the other elements are pretty comparable. Both firms even offer similar insurance costing within pennies of the others. So, is the Cowboy 4’s spec that much better than the Vanmoof’s? Probably, but it’ll depend on your finances. Both are great e-bikes.",
    "Other companies make clever city e-bikes, but very few do quite such a good job as Cowboy when you take into account their cost. Then there’s the excellent supporting app, along with the ability to tap into low-cost insurance. Ideally suited to city use, the Cowboy is also just a very enjoyable bike to ride. Quite different to e-bikes made by more traditional firms, it all adds up to a package that’s streets ahead of almost anything else.",
    "First reviewed June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and release date",
    "10": "Design",
    "15": "Performance",
    "24": "Competition",
    "28": "Cowboy vs VanMoof",
    "32": "Conclusion",
    "34": "Don't buy it if"
  },
  "links": {
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "Cowboy 4": "https://uk.cowboy.com/products/e-bike-cowboy-4",
    "Ampler Curt": "https://www.techradar.com/reviews/ampler-curt",
    "Ribble Hybrid Al e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "direct from Cowboy": "https://uk.cowboy.com/products/e-bike-cowboy-4",
    "WAU Bike": "https://www.techradar.com/reviews/wau-x",
    "VanMoof S3": "https://www.techradar.com/reviews/vanmoof-s3"
  }
}