{
  "source": "https://www.techradar.com/reviews/thesafetyus-vpn",
  "title": "TheSafety.US VPN review",
  "category": "computing",
  "updated": "2021-01-13T15:14:51Z",
  "author": "sead-fadilpasic",
  "summary": "Speed or security? Choose your preference",
  "verdict": "TheSafety.US is a little on the expensive side, especially since it offers limited customer support and and information about the platform is scattered all over the website. However, it does have multiple advantages to support its price. You can use it to access certain geo-restricted content, install it on a router, take it for a lengthy test run, and browse, torrent, and stream at some very good speeds.",
  "pros": [
    "Exceptional speeds on some servers",
    "Unblocks Netflix",
    "Accepts Bitcoin",
    "Excellent customer support"
  ],
  "cons": [
    "A tad expensive",
    "Short money-back guarantee",
    "Disorganized information on the website"
  ],
  "article": [
    "Active in the VPN field since 2006, TheSafety.US uses reliable technology to protect its customers' privacy online, whether browsing, streaming, or torrenting. It also allows users to tweak the service based on preference: bullet-proof privacy or blazing speeds.",
    "The cheapest is the LiteVPN package, which costs $8.33/month if you opt for the annual billing option. It will get you access to servers in 21 countries, the Secure Kit Lite app and the provider’s protection technologies. The monthly price steps up dramatically if you go for the 6-month or 1-month subscription.",
    "More expensive packages include more features, such as access to more VPN servers, Imitation HTTPS, a kill switch, as well as directing your traffic through an additional server (the Double VPN package).",
    "Simultaneous VPN connections are allowed on up to 4 devices across all packages.",
    "You can also purchase your own personal proxy server, which provides you with anonymous access for all websites, at the price of $5 each ($4 upon renewal). They can also be purchased in bundles for durations of 10 or 30 days.",
    "Payment methods include PayPal, Yandex Money, Webmoney, Perfect Money, and even Bitcoin.",
    "There’s a 100% 7-day money-back guarantee, no questions asked, which we have verified. You can also get free VPN access for 3 days if you send the provider a request.",
    "In its pricing range, TheSafety.US is the closest to ExpressVPN but is a bit more complicated to get around as you don’t get any sort of welcoming email with a download link to ease you into the platform, and obtaining information on the website can be a tad difficult.",
    "There are also lots of cheaper VPNs out there that will provide you with almost the same level of service at a lower price. Examples include NordVPN, Surfshark, and CyberGhost, all with much longer periods of money-back guarantee, feature-rich native apps for all platforms, large knowledge bases and/or FAQ sections, and accessibility via live chat.",
    "Many VPN users embark on a search for a platform that will provide them with access to geo-restricted content on popular platforms such as Netflix, Hulu, HBO Go, or BBC iPlayer. TheSafety.US can help such users achieve this goal, although we didn’t have luck trying to break through BBC iPlayer’s defenses.",
    "TheSafety.US is headquartered in Panama, outside the jurisdiction of the Fourteen Eyes surveillance pact nations. The website is available in seven different languages.",
    "We were told by the support team that the company currently uses 30 servers for VPN and several servers for its personal proxy service. The servers are positioned in over 24 countries, including Israel, Panama, South Africa, Malaysia, Chile, Ukraine, Finland and more.",
    "At the time of writing, 15,784 proxy addresses (separated into three categories according to their purpose: anonymous, constant, and residential) were available in even more countries, like Macau, Guam, Dominican Republic, Bosnia and Herzegovina, Ecuador, Iran, Honduras, Cape Verde, Nicaragua, Gambia, Maldives, Turks and Caicos Islands, and many more.",
    "To protect your privacy, TheSafety.US deploys OpenVPN (TCP and UDP) and IKEv2 VPN protocols, for which it uses the 256-bit encryption. Depending on the chosen subscription package, users can run a single VPN, Double VPN or offshore VPN, for varying levels of privacy.",
    "All TheSafety.US subscription packages feature some form of Secure Kit program, which automatically configures the VPN connection and protects against DNS leaks. The program is able to mimic the normal SSL connection, hiding the fact you’re using a VPN and showing it to your ISP as a website visited via HTTPS. However, the provider says that it is a slightly less anonymous alternative to using the official open-source OpenVPN program.",
    "TheSafety.US claims that logs on its servers are disabled by default, including the operating system logs, but that its “VPN clients can keep statistics on the use of a VPN connection, including a record of visited websites”.",
    "This VPN vendor’s Privacy Policy is a large and detailed document but the tl;dr version is this: it doesn’t log your activity, and this includes browsing history, traffic destination, data content, or DNS queries. It also claims it never stores “connection logs, meaning no logs of your IP address, your outgoing VPN IP address, connection timestamp, or session duration.”",
    "While there’s no external confirmation of these claims (yet), this does sound reassuring.",
    "Torrenting is allowed, but exclusively on servers in Chile, Panama, South Africa, and Ukraine.",
    "TheSafety.US is compatible with Windows, Mac, iOS, Android, Linux devices, and routers. To set it up, you can download the OpenVPN-based Secure Kit app for Windows, Mac, Debian, Android, and iOS, as well as Firefox and Chrome browser extensions.",
    "The alternative is to use third-party software like the OpenVPN app, devices’ own in-built VPN options, and config files. It is less user-friendly but more anonymous, according to the provider itself.",
    "Instructions for the installation are available on the website, as is the information about other parts of the service, but it is a bit scattered around and can’t be accessed from one place, like a knowledge base or help center.",
    "If you want to contact the provider’s customer support, you’ll only be able to do so via the web form accessible from the lower right part of the screen where some of the competitors usually keep their live chat option. Even though this means there’s no direct contact with the support, it doesn’t mean that your message will be left unanswered. We received a response to our query within minutes of sending it.",
    "This VPN allows you to connect to its service via the Secure Kit app, which is very user-friendly, but there’s also a slightly more complicated way that requires you to download third-party software and config files (and copy them into a relevant folder on your device), as well as follow the instructions on the website closely. This may not be ideal for beginners.",
    "TheSafety.US has two groups of servers: those focused on speed but with less security, and those that place security above speed. We tested both types on a 67.31Mbps testing connection.",
    "Our first location was Belgium, where a UDP rapid access server hailed a blazing 45.06Mbps, while its TCP safer counterpart only delivered 5.62Mbps.",
    "A similar pattern was evident on the UK servers: the UDP returned an outstanding 21.08Mbps, while the TCP only gave us 5.03Mbps.",
    "We also tested a server across the Atlantic Ocean, in Florida, from which we got a solid 12.63Mbps on a UDP server and a very low 1.89Mbps on TCP.",
    "Finally, a server on the other side of the world, in Malaysia, hailed a very good (for this location, at least) 8.02Mbps on UDP and, surprisingly, 2.00Mbps on the TCP connection.",
    "TheSafety.US is a very good VPN service that will provide you with superior privacy and/or outstanding download speeds for your online needs, be it browsing, streaming geo-restricted content, or P2P traffic. It also accepts payments in Bitcoin and provides solid no-logging assurances.",
    "However, its website is a bit disorganized and pricing a bit high, closer to some of the more established VPN players in the industry, but without such a clean and simple-to-use client."
  ],
  "headers": {
    "1": "Price",
    "7": "Alternatives",
    "9": "Streaming",
    "10": "About the company",
    "13": "Privacy and encryption",
    "19": "Support",
    "23": "Speed and experience",
    "29": "Verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "TheSafety.US": "https://thesafety.us/",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://thesafety.us/privacy-policy"
  }
}