{
  "source": "https://www.techradar.com/reviews/expressvpn",
  "title": "ExpressVPN review",
  "category": "computing",
  "updated": "2021-11-04T14:36:08Z",
  "author": "mike-williams",
  "summary": "The best just keeps on getting better",
  "verdict": "ExpressVPN has a huge network, plus it's fast, secure, unblocks Netflix and just about everything else, supports torrents, has no serious logging (confirmed by an audit), offers clients for everything, and is easy to use. In short, this is a quality VPN which delivers in just about every area.",
  "pros": [
    "160 locations across 94 countries",
    "Good performance",
    "Clients for almost everything",
    "Excellent support"
  ],
  "cons": [
    "Above average prices",
    "Browser extensions require ExpressVPN app"
  ],
  "article": [
    "The VPN market is a tough one, with a lot of competition around, but ExpressVPN knows exactly how to stand out from the crowd: it piles on the professional features, delivering way more than just about anybody else.",
    "Top-notch platform support includes apps for Windows, Mac, Android, iOS, Linux and other operating systems, not to mention custom firmware for many routers, as well as detailed manual setup guides for Apple TV, Fire TV, PlayStation, Chromebooks, Kindle Fire and more.",
    "A strong set of core features give you multiple layers of protection. ExpressVPN protects your internet traffic by using its own DNS servers, for instance. High-end encryption technologies prevent even the most advanced attackers from snooping on your activities. Even if the VPN drops, no problem: a top-quality kill switch activates immediately to block your internet connection and keep you safe.",
    "There are plenty of valuable extras, too, ranging from Lightway (ExpressVPN's own superfast and secure VPN protocol) to browser extensions which include WebRTC leak blocking, location spoofing and HTTPS Everywhere support.",
    "The company offers a vast network of more than 3,000 servers spread across 160 cities in 94 countries. Europe and the US have the best coverage, but ExpressVPN also has many locations in Asia and several countries that rarely appear elsewhere. There are 27 Asia Pacific countries alone, for instance – Mozilla VPN only has around 30 countries in its entire network.",
    "A clear and simple privacy policy explains that ExpressVPN doesn't log any sensitive information. And unlike most of the competition, this isn't some generic marketing promise – the website goes into great detail on exactly what the service does and doesn't collect. Furthermore, ExpressVPN has recently had its servers audited to confirm that the company is following its own privacy policy.",
    "The real standout feature could be support, though, where ExpressVPN has agents available 24/7 on live chat. This isn't the very basic, outsourced, first-line support you'll often get with other services: they're experts who can walk you through just about any technical issue. If you run into trouble, then, you won't be waiting a day (or potentially longer) for a support response. In our experience, there's always someone available on ExpressVPN's live chat, and you could be getting quality help within a couple of minutes.",
    "We don't normally focus on corporate developments in product reviews, but this one is too big to ignore. In September 2021, ExpressVPN was acquired by KAPE Technologies PLC for nearly $1 billion. KAPE owns a number of other VPN brands like Private Internet Access, CyberGhost and ZenMate.",
    "An ExpressVPN blog post says it'll essentially remain business as usual: 'ExpressVPN will remain a separate service from other Kape brands, and everything you’ve come to know and love about ExpressVPN will only continue to improve.' We've no reason to think otherwise – Private Internet Access and CyberGhost are the same distinct services they always were – but we will monitor the situation and see what happens.",
    "Getting back to the product, ExpressVPN has fully open-sourced its speedy Lightway protocol, and it's now available on all platforms.",
    "The company's router app has seen a notable improvement: you can now sort your devices into groups, and connect each group to a different location. You could have all your smart TVs set to a US location, for instance, while your phones are set to a local server. If you have a couple of work laptops which can't use the VPN, you can set them up to connect to the router but then just use your regular internet connection. It's all up to you.",
    "There are the usual scattering of smaller new features across the apps. The Windows client now has a couple of new accessibility features, for instance: narrator support, and keyboard navigation. These might not make the headlines, but they'll be a big deal for many users, and it's good to see ExpressVPN addressing areas that most providers ignore.",
    "As explained in our dedicated ExpressVPN pricing and deals guide, the provider has a very simple pricing structure with only three plans, and these start with a monthly-billed product for $12.95.",
    "That's not cheap, but CyberGhost, Hotspot Shield and Surfshark all charge around $13 for their monthly plans, and it's not far from the $9-$10 charged by most big-name VPNs.",
    "Sign up for ExpressVPN's 6-month plan and the price drops to $9.99 per month. That's a reasonable discount, and it also gives you more flexibility than you'll get with some competitors, who don't offer a 6-month plan at all.",
    "The annual plan cuts your costs still further to a monthly equivalent of $8.32, a chunky 35% discount on the monthly subscription. But it's still substantially more than some of the competition (Private Internet Access asks $3.33 on its annual plan, Windscribe is $4.08), especially if you're willing to sign up for long periods. Private Internet Access's three-year plan costs only $2.19 a month, for instance, while Ivacy currently charges just $1.33 a month on its five-year plan.",
    "When you're comparing headline prices, though, be sure to check the small print, because ExpressVPN is closer to many competitors than you might realize. For example, many vendors have low prices which increase later. IPVanish looks reasonable value at $4.50 a month in year one, but jumps on renewal to $7.50. And NordVPN starts at $4.92, but renews at a costly $9.92.",
    "There's more to a VPN than price, of course. Anyone can offer low headline rates; it's offering a decent service, too, that's the tricky part.",
    "There are ways to save some cash, as well. Signing up with our exclusive deal adds three free months to the annual ExpressVPN subscription, giving you 15 months of service for an effective $6.67 per month.",
    "If you decide to sign up you'll discover a wide range of payment methods, including cards, PayPal, Bitcoin, and a host of other players (AliPay, Yandex Money, WebMoney and more).",
    "If you're not quite convinced, installing the Android or iOS app gets you a 7-day trial. And even after handing over your cash, ExpressVPN's 30-day money-back guarantee allows you to safely check out the service for yourself.",
    "If you decide you want to cancel, that process is also very straightforward. There are no small print clauses to catch you out, and you don't have to justify your decision to the company. You can use the service, in full, for 30 days, and if you're unhappy, or you simply change your mind, just tell ExpressVPN and you'll get your money back. That has to be a reassuring sign of just how confident ExpressVPN is in its service.",
    "Every VPN claims to offer complete privacy, but drill down to the details and there's often very little substance to back this up. ExpressVPN is refreshingly different, because the company doesn't just tell you how great it is – it also has an impressively lengthy list of features to help justify every word.",
    "Take encryption, for instance. Most services might mention that they support OpenVPN, or drop in a reference to AES-256, but ExpressVPN goes much, much further.",
    "The company explains that it uses a 4096-bit SHA-512 RSA certificate, for example, with AES-256-CBC to encrypt its control channel and HMAC (Hash Message Authentication Code) protecting against regular data being altered in real-time.",
    "To confirm this, we examined ExpressVPN's configuration files for OpenVPN, and the details were just as the company had described.",
    "Support for Perfect Forward Secrecy adds another layer of protection by automatically assigning you a new secret key every time you connect, and then replacing it every 60 minutes while the session remains open. Even if an attacker has somehow managed to compromise your system, the very most they'll get is 60 minutes of data.",
    "DNS support is another highlight. ExpressVPN doesn't just offer DNS leak protection, to prevent data about your online activities leaking out of the VPN tunnel, but it also runs its own private, zero-knowledge, 256-bit encrypted DNS on each of its own servers.",
    "That's a major advantage over some lesser providers, which in the worst-case scenario might redirect your DNS traffic to OpenDNS or some other third-party service. Apart from the risk of logging at the DNS server, using unencrypted DNS gives attackers the chance to intercept your requests, filter them, block or even alter them – all issues which largely disappear using ExpressVPN's method.",
    "We didn't test the DNS server in-depth, but websites such as IPLeak, DNS Leak Test and Browser Leaks confirmed that ExpressVPN servers were using the IP address for their DNS queries, and none of them had any DNS or traffic leaks.",
    "ExpressVPN's new ioXt Alliance certification adds even more privacy reassurance, and is interesting for a couple of reasons.",
    "The certification process scores the company on several low-level technical design details, including cryptography, network security, the software building process, automatic updates and more. For example, it checks that the app stores its private keys in the secure operating keystore rather than via some custom scheme of its own, an indicator of a secure design and something that would take a lot of time and expertise to check for yourself.",
    "Even if you don't have the background knowledge to interpret these details (that's okay, we struggle with some of them too), it's reassuring to see the company expose itself to this kind of technical scrutiny. Private Internet Access and NordVPN are also certified, and hopefully others will join these providers soon.",
    "Check out the typical VPN website and you'll usually find 'NO LOGGING!' claims prominently displayed in a very large font, but often behind that there is a privacy policy which either gives you very little details on any specifics, or reveals that the company does log some of your information, after all.",
    "ExpressVPN does things a little differently. The front page of the website doesn't have any 'zero log' boasting, for instance, and you have to head off to a 'What Is VPN' page to get a first look at the company's position: 'Privacy is a fundamental right. We don’t keep connection or activity logs, and we never share your details with anyone.'",
    "If you need more, the company doesn't force you to go hunting for the relevant details amongst 2,000 words of jargon-packed small print. Just clicking a link within the 'no log' statement takes you to a clearly written 'Policy towards logs' page which explains what ExpressVPN collects, what it doesn't, why the service works this way, and what it means for users.",
    "The page states that the service doesn't keep any logs of your IP address when you connect to ExpressVPN, or of the time you've logged in, the VPN IP address you're assigned, or any information on the websites or pages you're visiting (including via DNS requests), or any of your traffic.",
    "There is still some logging. The company records each date of when you connect to the service, and your choice of server. But as it doesn't store the connection time, or the IP address you’re allocated, there's no way anyone can use this data to definitively link an internet action back to a specific ExpressVPN account.",
    "The company also records the version number of any clients you've installed, along with the total amount of data you've transferred each day. This data also doesn't constitute any kind of privacy risk, and we've no doubt that other VPNs do similar things: they just don't admit it.",
    "ExpressVPN is based in the British Virgin Islands. Despite its small size, the BVI regulates its own affairs and the UK and US don't have jurisdiction to automatically compel ExpressVPN to release any data.",
    "The BVI isn't a part of '14 Eyes', the intelligence sharing agreement also known as SIGINT Seniors Europe (SSEUR), and not known to be a party to any of its intelligence sharing arrangements.",
    "In short, any would-be complainant would have to raise their issue in the BVI High Court, show that the records related to a serious crime (one punishable by a year or more in prison if it happened in the BVI), and explain how those records would provide relevant evidence to that case. It's hard to see how the minimal ExpressVPN records could provide useful evidence of anything.",
    "There's a lot to like here. It's clear that ExpressVPN understands the issues to hand and is making considerable efforts to explain them, properly and in full, to its customers. That in itself is reassuring, and a huge improvement on the detail-free privacy policies of many VPNs.",
    "You don't simply have to take what ExpressVPN says on trust, though. The company has had its TrustedServer technology and backend systems audited by PricewaterhouseCoopers to confirm that it's living up to its privacy promises.",
    "Legal restrictions mean we can't quote from the summary report, but it's freely available for customers to download and read. If you're not yet a customer, check out this blog post for background on the audit, in particular the 'full details of what was covered in the audit' (PDF) link. That document includes a vast amount of detail on how ExpressVPN's systems work, what it collects and what it doesn't – all the details PwC verified. This is interesting all on its own, even without the report, as a technical guide to how ExpressVPN works internally.",
    "Speed is an important factor when choosing a VPN, and we use some intensive tests to find out how a service performs.",
    "The process began in a US location with a 1Gbps connection. We used the standard ExpressVPN Windows 10 app to connect to our nearest location, then checked the download speeds reported by multiple speed test sites and services (SpeedTest's website and command line app, nPerf, SpeedOf.me and more). We fetched at least five results from each site, using two protocols (OpenVPN and ExpressVPN's own Lightway), and ran the entire test set in both morning and evening sessions to look for variations over time.",
    "ExpressVPN's OpenVPN speeds were above average at 310Mbps in the UK, 250-270Mbps in the US. (HideMyAss managed 390Mbps in recent tests, ProtonVPN 400-460Mbps, but IPVanish, Surfshark, and even NordVPN didn't reach 200Mbps).",
    "The real star is ExpressVPN's Lightway protocol, though, which more than doubled OpenVPN performance to 570-580Mbps in the UK, and a less impressive 350Mbps in the US. That shot past competitors like Private Internet Access (430Mbps), StrongVPN (450Mbps), Surfshark (450-475Mbps) and Windscribe (430-480Mbps). That said, some providers go faster still, and CyberGhost, IPVanish, Mozilla and NordVPN all reached 750Mbps and higher in recent tests.",
    "Unlike most of the competition, ExpressVPN doesn't just make vague claims about its unblocking abilities, it actually specifies which platforms are supported: Netflix, BBC iPlayer, Amazon Prime, Disney Plus, Google, Wikipedia, YouTube and others (more than 25 services in total). It's good to see a provider being upfront about what it's claiming to do.",
    "To get a feel for ExpressVPN's unblocking abilities, we ran several tests, checking whether we could access US Netflix, Amazon Prime Video, BBC iPlayer and Disney Plus from a selection of ExpressVPN servers.",
    "Netflix has been fighting VPNs even harder than usual this year, and it now blocks many providers. ExpressVPN isn't beaten yet, though, and the service got us into Netflix with two out of our three test locations.",
    "Amazon Prime Video was relatively straightforward. We tried connecting to three ExpressVPN servers, and were able to stream US content each time.",
    "It was the same story with BBC iPlayer, where we got access from all four of ExpressVPN's UK locations.",
    "ExpressVPN ended on a strong note, too, instantly bypassing Disney Plus protection with the first location we tried (the second and third worked, too).",
    "These are great results, but a quality VPN isn't just about getting you access right now – it's also what happens if a platform blocks a new range of IPs and your favorite server doesn't work anymore.",
    "Complain to many VPNs and they'll just reply that 'we don't guarantee access to any streaming platforms', leaving you on your own.",
    "On the rare occasions we've had unblocking issues with ExpressVPN, we've opened a live chat session, been talking to an agent within a couple of minutes, and either had recommendations on locations to try, other troubleshooting advice, or been told it's a known issue that'll be fixed soon (which has always been true). Far more helpful.",
    "ExpressVPN doesn't appear very torrent-friendly at first glance, as its website doesn't seem to mention the topic at all. There's so little torrent awareness that if you type 'p2p' in the knowledgebase search box, for instance, it assumes you've made a mistake and searches for 'pap' instead.",
    "No need to worry, though, ExpressVPN isn't trying to hide anything. We dug around the FAQ, ran a few tests and eventually discovered the truth.",
    "The service not only supports torrents, it also avoids the common hassles and annoyances you'll often get with other providers.",
    "Torrent users aren't forced onto a small number of overloaded servers, for instance. You can choose from the full set of ExpressVPN locations.",
    "There are no bandwidth or transfer-related catches, either. The company has no data cap, and says it will never throttle your connection.",
    "Performance testing with torrents is a challenge as there are many factors which might affect speeds, but we tried downloading using three locations (US, UK, Netherlands), had no connection or other issues, and saw broadly the performance we'd expect in each case.",
    "Factor in other key features of the service – no activity logs, lots of locations, apps for everything, Bitcoin support, the 30-day money-back guarantee – and ExpressVPN looks like a great choice of VPN for all your torrenting needs.",
    "Getting a VPN client installed and working properly can sometimes be a challenge, but the well-designed ExpressVPN website has clearly been set up to keep hassles to an absolute minimum.",
    "Log in to your account dashboard, for instance, and you don't have to hunt for a Download link. The website detects the type of device you're using, displays a Download button for that client, and enables grabbing a copy with one click.",
    "If you need something for another platform, clicking 'Set up on all your devices' takes you to a huge list of options, including Windows, iOS, Amazon Fire, Mac, Android, Linux and more. Tapping any of these displays more download links and instructions.",
    "Even these are far more helpful than you would expect. Tap the 'Android' link with most VPNs and you'll probably just be redirected to Google Play. ExpressVPN has a Play Store link, but it also gives you a QR code, a button to email yourself a setup link (ideal if you need to install it on another device), and even an option for experts to directly download the APK file.",
    "In a neat setup touch, ExpressVPN doesn't force you to find and manually enter your username and password. Instead, all you have to do is copy the unique activation code displayed on your download page, and paste it into the client when you're asked. The software then automatically sets up your login credentials, and you won't have to think about usernames and passwords, at all. (Very handy if, say, you're using a password manager and don't even know what your passwords are.)",
    "Your other option is to set up a third-party OpenVPN client. ExpressVPN makes this much easier by providing sensibly named OVPN configuration files (my_expressvpn_argentina_udp.ovpn, as opposed to something like NordVPN's ar1.nordvpn.com.udp1194.ovpn), and we had the OpenVPN Connect client up and running within minutes.",
    "The ExpressVPN Windows client has a comfortable and familiar interface which immediately makes you feel at home. A big On/Off button allows you to activate the service when required, a clear status display shows you the current server, a Choose Location button enables picking something else, and a menu button top-left gives speedy access to other features.",
    "There are a host of ways to choose the best server. A Smart Location feature picks your closest server. You can double-click a country to access its best location, or browse every location within a country and choose one manually. A Search box allows you to find locations by keyword, you can add individual locations to a Favorites list, and your last location is always just a click away.",
    "The client makes smart use of its system tray icon, too. Right-clicking displays a menu which includes your last three locations, and choosing one of those will get you connected immediately, without having to open the full client.",
    "The Location list doesn't initially display any information on the speed of its servers, something which can help you choose the fastest location. The client has a Speed Test feature which can add this for you, and it provides far more useful information than the competition, including latency and an estimate of download speed.",
    "A capable Settings dialog allows you to choose from six protocol variations: the new Lightway in UDP or TCP forms, OpenVPN UDP or TCP, L2TP - IPSec and IKEv2.",
    "Elsewhere, a kill switch blocks all internet traffic if the VPN connection drops, reducing the chance of any data leaks. There's no setup involved with this, it's enabled by default, and always ready to protect your privacy.",
    "It works, too. We used multiple tricks to forcibly close both OpenVPN and IKEv2 connections, but the client handled everything perfectly, blocking internet traffic, keeping us informed with a desktop notification, and reconnecting in seconds.",
    "Low-level technical touches include basic IPv6 leak protection, and the ability to run with your default DNS servers when using the VPN (you'll use ExpressVPN's own by default).",
    "One highlight of the app is its support for split tunneling, a smart technology which enables defining which apps use the VPN, and which use your regular internet connection. If an application won't work when your VPN is up (an email client, say), you can make it use your normal internet connection instead. And if you use your VPN for one or two applications only – a browser, a torrent client – then redirecting everything else out of the VPN tunnel could improve performance for those apps.",
    "If you're new to ExpressVPN, installing the Android app works much like any other. Go to the Play Store, find the app, install it as usual and work through the signup process.",
    "If you've already set up an ExpressVPN account, there are some easier options. We went to the ExpressVPN web console on our Windows system, chose the Setup > Android page, scanned the QR code and automatically downloaded and installed the app (your phone must allow installations from outside of the Play Store for this to work).",
    "We still had to make a couple of basic setup choices, for example deciding if we wanted to allow the app to send anonymous analytics back to ExpressVPN, but otherwise the process was completed in seconds.",
    "The app looks good, with portrait and tablet-friendly landscape interfaces, and works in much the same way as the Windows edition. An excellent Location Picker makes it quick and easy to find and reconnect to particular servers, you can connect and disconnect with a click, and the straightforward interface allows you to check your current location and Android VPN status at a glance.",
    "A Privacy and Security Tools menu adds some useful features to help you check your connection, with options to display your current IP address and location, check for DNS and WebRTC leaks, and generate secure passwords. ExpressVPN has had most of these tools on its website for quite some time, but it's far more convenient to access them from within the apps.",
    "New features include a Protection Summary box with details of your current or VPN location, IP address, and how much time you've used the service for recently. We don't see any great need for a chart showing us that we use the VPN mostly on Wednesdays (for instance), but the location and IP information is handy, and if you don't like the Protection Summary then you can turn it off in Settings.",
    "The Android app leaves out some of the more advanced features from the Windows client. There's no Speed Test, for instance, which means the location list has no indication of how fast, slow or overloaded a server might be.",
    "The Settings section doesn't give you any control over DNS, but more than makes up for that with an integrated kill switch, and support for ExpressVPN's latest Lightway protocol, as well as OpenVPN UDP and TCP.",
    "Elsewhere, split tunneling, a handy bonus addition, enables defining which apps should or shouldn't use the VPN. If you're only interested in Netflix, for instance, you could set up ExpressVPN to channel your Netflix app traffic through the tunnel, while allowing everything else to go through your regular connection, perhaps improving performance.",
    "The auto-connect feature is particularly welcome, optionally connecting you to the VPN whenever you join untrusted networks.",
    "The 'App and Website Shortcuts' feature provides a configurable toolbar on the connection window which can hold up to five shortcuts for your favorite apps. It's a very simple idea, but a useful one, which facilitates launching commonly used apps with a tap just as soon as you're connected.",
    "Problems? If any of this doesn't work as you expect, new in-app help gives you speedy access to support documents without having to head off to the website, while an 'Email us' link should give you more hands-on assistance when required.",
    "It doesn't have quite as many expert-level features as you'll get with some apps – you can't set your preferred DNS servers, for instance – but ExpressVPN's Android offering has more than enough functionality for most people, while remaining easy to use. Even better, install the app and you can try the service for free for seven days, an offer you won't get if you sign up on the website. If you're at all interested in Android VPN apps, ExpressVPN needs to be on your shortlist.",
    "ExpressVPN's iOS app opens with much the same clean and straightforward interface that you'll see on other platforms: a recommended location, a big Connect button to get online, and a menu button to explore further.",
    "The well-designed Location Picker offers multiple ways to find specific cities or countries, as well as maintaining a Recent Connection list and allowing you to add commonly used locations to your Favorites.",
    "As with the Android app, the iOS edition allows you to switch servers without manually closing the current connection first. This only saves you a single tap, but if you regularly switch servers, it's going to be a welcome usability plus.",
    "The choice of protocol includes IKEv2, OpenVPN UDP and TCP, but no Lightway yet.",
    "Although the app doesn't have a kill switch, its auto-reconnect option tries to re-establish the tunnel if your connection drops.",
    "Like its Android cousin, the iOS app has a Privacy and Security Tools menu where you'll find ways to confirm that your IP address has changed, it's from your selected country, and the VPN doesn't have any DNS or WebRTC leaks.",
    "We've seen more feature-packed VPN apps, but on balance ExpressVPN's iOS offering is likeable, easy to use and delivers the functionality most folks are likely to need. And if you'd like to check out the service for yourself, good news: as with Android, there's a risk-free 7-day trial available.",
    "The ExpressVPN clients are generally very polished and user-friendly, but they're not the only way to work with the VPN. The company also offers Chrome and Firefox extensions which allow you to control the client and service directly from your browser.",
    "Unlike just about every VPN provider, ExpressVPN's browser extensions aren't simple proxies. They are browser-based interfaces for your Windows, Mac or Linux client: they won't work unless you have them installed. That's inconvenient, but there are some major benefits, too.",
    "Launch ExpressVPN's browser extension, for instance, and it's able to communicate with the desktop client and read its state. The default location will be set to the same as the client – and if the client is currently connected, your extension will reflect that.",
    "You can control the desktop client from the browser, too. If you want to unblock a single website, you can choose a VPN location from within your browser, connect to it, do whatever browsing you need, and disconnect ExpressVPN when you're done. It's all very quick and convenient, with no need at all to switch backwards and forwards between your browser and the ExpressVPN client.",
    "This works well at a simple level. The browser extension interface looks much like the regular clients and apps, with a similar system for browsing and selecting locations.",
    "As it is just a basic frontend for the desktop engine, it's no surprise that the extension has some limitations. There's no Favorites system, for instance, or no speed testing. There are only two significant options, too ('Connect on browser launch' and 'Show desktop notifications'), although you're able to open the desktop app's Settings dialog directly from the browser extension.",
    "There's good news, too, with some welcome privacy tools. Both the Chrome and now the Firefox extension include settings to prevent HTML5 geolocation from revealing your real location while you're connected to the VPN, as well as blocking WebRTC leaks at the browser level, and using HTTPS Everywhere to automatically force connections to the HTTPS versions of websites whenever they're available.",
    "Improved localization means the extensions are now available in 17 languages: Danish, Dutch, English, Finnish, French, German, Italian, Japanese, Korean, Norwegian, Polish, Portuguese, Russian, Spanish, Swedish, Thai and Turkish.",
    "The browser extension won't be for everyone, especially as you must have the app installed to use it. But the ability to control the application from within the browser is a genuinely useful feature that you won't find with the competition, and overall, it's a very worthwhile addition to the package.",
    "Much like any other networking technology, a VPN can misbehave in many ways, and figuring out exactly what's going on can be a real challenge. That's why even the most experienced user can benefit from quality VPN support.",
    "ExpressVPN's support site gets off to a good start with its lengthy list of troubleshooting guides. Whether you're trying to diagnose slow speeds or dropped connections, understand error messages, change your password or cancel your account, there's useful information to hand.",
    "Most articles are well-written and deliver in all the key areas. They don't assume technical knowledge, instead taking the time to explain the background, offering multiple suggestions to resolve most problems, and linking to other relevant articles. For example, where other VPNs might have a single line suggesting you \"try another server\" to help diagnose speed problems, ExpressVPN also links to a detailed article explaining how to find the best location for you.",
    "The setup articles are even more impressive. You don't get just one generic installation tutorial per platform, for instance. There are guides covering how to install the app, how to set up manual connections, or use third-party apps such as OpenVPN GUI. And this isn't just about Windows. You'll find tutorials for Mac, iOS, Android, Linux, Chromebooks, eBooks, BlackBerry, Smart TV, routers, and... well, you get the idea.",
    "An accurate search engine scans more than 250 of these articles to find whatever fits your requirements. It's hugely refreshing to enter keywords on a VPN support site and actually view a lot of useful content. OpenVPN has 39 hits, DNS 53, there are 61 for Android, 17 for Ubuntu, 8 for DD-WRT, and the list goes on.",
    "If the website can't help, ExpressVPN's support team is available 24/7 via email and live chat.",
    "ExpressVPN recommends live chat for the fastest results, but we sent a test email question anyway to check response times. Although the company suggests it can take up to 24 hours to reply, we got a friendly, detailed and helpful message in under an hour. That's much faster than we expected, and the reply contained everything we needed to diagnose and resolve our issue.",
    "Live chat also performed very well. We ran several checks on the service, there were always agents available, and typically we had a first genuine response (a real comment on our issues, not just an automated 'I'm Steve and I'm here to help you' bot-type reply) within two or three minutes.",
    "The quality of chat support was well above average, too, with the agent spending 30 minutes patiently walking us through some well-chosen diagnostic steps.",
    "If you're a networking expert, it's tempting to assume this doesn't really matter. You know what you're doing, so there's no need to pay a premium for this kind of handholding, right?",
    "Well, maybe, but keep in mind that there's more to VPN support than explaining the low-level geeky technicalities. We've also asked about system status issues like temporary connection problems, or the best server to use for US Netflix or Amazon Prime. Unlike some providers, there's no waiting for a day to get an email response – we've always had useful advice within minutes of asking, and that ability to get speedy help makes a huge difference to the overall service experience.",
    "This is a top-quality VPN which exceeded our expectations in everything from platform support and privacy, to ease of use, unblocking abilities and its excellent support. It's more expensive than most, but you can see why: this is a polished, powerful and professional service."
  ],
  "headers": {
    "7": "What's new?",
    "12": "ExpressVPN pricing",
    "22": "Privacy",
    "33": "Logging",
    "45": "Performance",
    "49": "Netflix and streaming",
    "58": "Torrents",
    "65": "Client setup",
    "71": "Windows client",
    "80": "Android app",
    "93": "iOS app",
    "100": "Browser extensions",
    "109": "Support",
    "120": "ExpressVPN review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Mozilla VPN": "https://www.techradar.com/reviews/mozilla-vpn",
    "ExpressVPN was acquired by KAPE Technologies PLC": "https://www.techradar.com/news/expressvpn-to-join-kape-in-largest-deal-ever-in-vpn-industry",
    "blog post": "https://xvtelink.com/blog/pwc-audits-expressvpn-servers-to-confirm-essential-privacy-protections?a_fid=744&data1=trd-us-7042362643087144000",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "sort your devices into groups": "https://xvtelink.com/support/troubleshooting/router-app-manage-devices-vpn-connections?a_fid=744&data1=trd-us-5519603758293547000",
    "ExpressVPN pricing and deals guide": "https://www.techradar.com/vpn/expressvpn-price-deals-discounts",
    "monthly-billed product": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1552579137845948700",
    "6-month plan": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1359014650312545000",
    "annual plan": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1190626057210670600",
    "exclusive deal": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1314856668270619000",
    "VPN tunnel": "https://www.techradar.com/vpn/how-does-a-vpn-work",
    "ioXt Alliance certification": "https://compliance.ioxtalliance.org/product/135",
    "Speed": "https://www.techradar.com/vpn/fastest-vpn",
    "Netflix": "https://www.techradar.com/vpn/best-netflix-vpn",
    "VPN for all your torrenting needs": "https://www.techradar.com/vpn/best-vpn-for-torrenting",
    "ExpressVPN Windows client": "https://www.techradar.com/vpn/download-expressvpn",
    "installing the Android app": "https://www.techradar.com/how-to/how-to-download-and-install-the-expressvpn-android-app",
    "Android VPN": "https://www.techradar.com/vpn/best-vpn-for-android-our-5-top-choices",
    "iOS": "https://www.techradar.com/vpn/the-best-vpn-for-iphone",
    "Chrome": "https://www.techradar.com/vpn/best-chrome-vpn",
    "support site": "https://xvtelink.com/support/?a_fid=744&data1=trd-us-1348471784869046000"
  }
}