{
  "source": "https://www.techradar.com/reviews/druva-data-loss-prevention",
  "title": "Druva data loss prevention review",
  "category": "computing",
  "updated": "2021-03-17T11:58:24Z",
  "author": "john-faulds",
  "summary": "Provider of comprehensive data protection, cloud backup, and disaster recovery solutions",
  "verdict": "Druva is a great backup solution for organizations that want to be able to manage all their devices, servers—whether physical or virtual—cloud services, and disaster recovery strategies from a single management portal.",
  "pros": [
    "Award winning provider",
    "Established strong service record",
    "Comprehensive protection",
    "Disaster recovery",
    "Ransomware protection"
  ],
  "cons": [
    "Overkill for some"
  ],
  "article": [
    "Of the many data protection companies, Druva has earned its place amongst the best data loss prevention services in the world through the numerous awards it has won since its foundation in 2008.",
    "It provides comprehensive protection for business data, whether this be stored in data centers, cloud applications, or individual devices, as well as disaster recovery and ransomware protection. And this is backed up with advanced search and analytics so that organizations can get a better understanding of their data security.",
    "Druva can provide protection for data centers, SaaS applications, endpoints (devices), and Amazon Web Services (AWS) infrastructure, and has pricing plans for each of those four categories. All of Druva’s products come with a 30-day free trial.",
    "Druva Phoenix is the data center solution, and prices range from $210 to $300 per TB/month after deduplication. The entry-level plan, Business, covers Linux, Windows, and SQL servers, NAS storage, Oracle, and VMware. The higher plans add advanced caching, multi-site administration, cloud disaster recovery, and data analytics and search.",
    "Druva’s solution for SaaS apps and endpoints is called inSync and comes in three plans, with prices starting at $4/month per user for apps and going up to $8/month per user for endpoints. For exact pricing, you need to contact Druva.",
    "Druva CloudRanger is the AWS backup and disaster recovery solution. Once more, there are three plans, ranging in price from $3000/year for 50 managed AWS instances and 12-hour SLA support, up to $42,000/year for 500 instances and one-hour support.",
    "There are a few ways you can get started with Druva. After watching the introductory video, you can register for one of Druva’s regularly scheduled live demo sessions, or you can request a one-on-one demo. If you’d rather dive straight in, you can alternatively sign up for the 30-day free trial.",
    "The console that you first log into presents you with a dashboard with your overall protection summary and links to each of the individual products and services, inSync, Phoenix, and CloudRanger. Each of those also has its own dashboard. The inSync dashboard, for instance, will show you a breakdown of all the different types of backups you have configured, such as device, Microsoft 365, and Google Workspace, while the Phoenix dashboard shows you all the physical and database servers, VMware, and CloudCache.",
    "The dashboard features a lot of interactive graphs and pie charts to give you easy-to-digest visualizations of the status of your backups as well as how much you’re saving in global deduplication.",
    "From each product’s dashboard, you’ll be able to manage what it is you’re backing up, backup policies, scheduled jobs, disaster recovery plans, and admin groups. It’s a very comprehensive service and would no doubt take some time to get fully acquainted with, but once learned, would provide IT departments with a lot of power and insight.",
    "Druva’s cloud platform is built on AWS to be infinitely scalable to meet the needs of your business. Because it’s a SaaS solution, there’s no hardware to maintain or software to install, and no need to plan and schedule maintenance, because it’s always up to date.",
    "Druva’s cloud backup product provides extensive protection by covering a range of operating systems including Windows, Mac OS, Android, and iOS, as well as hypervisors like VMware and Hyper-V. The data in cloud apps such as Microsoft 365, Salesforce, and Slack can also be backed up and protected.",
    "The Druva platform can also help companies meet their compliance requirements by indexing all data, which makes it easy to search and restore files. All user activity is monitored and audited, with reports made available for any policy violations.",
    "Security features include the encryption of all data while it’s in transit and in storage, an alert system for unusual activities, and systems to prevent the propagation of ransomware.",
    "Druva provides a number of different support methods. For helping yourself, there is product documentation, a knowledge base, and video tutorials. There are also community forums and a learning center with self-guided courses on the different products.",
    "For direct support, there are phone numbers in different regions, live chat, and a separate support portal section where you can submit a support ticket. The support portal also includes links to many of the previously mentioned resources which are available from the main Druva website.",
    "Druva is just one of many companies that provides backup and data protection solutions.",
    "Veeam is a Swiss company that can back up data from physical and virtual machines as well as cloud services. It also provides tools for monitoring and analytics. It has two backup plans aimed at small businesses that start at $420/year for 10 licenses and go up to $840/year. Then there are two enterprise plans for which you need to contact sales for a quote. Note that Veeam doesn’t sell directly to customers but instead uses resellers. Veeam also offers quite a large selection of free backup tools.",
    "Acronis is another Swiss company that offers backup and data recovery solutions for physical and virtual machines and cloud apps. To back up a single server, prices go from $499/year up to $839/year, for a workstation $69–$99, and a virtual host $619–$929. Acronis also offers a wide range of other software tools for disk management, sharing, monitoring, and file transfer.",
    "Druva is a great backup solution for organizations that want to be able to manage all their devices, servers—whether physical or virtual—cloud services, and disaster recovery strategies from a single management portal.",
    "It’s easy to set up and deploy, although a bit of time would be required to get completely comfortable with the platform as it can do so much. But ultimately, you would be saving time because there’s nothing for you to maintain, and it is always up to date."
  ],
  "headers": {
    "2": "Druva: Plans and pricing",
    "6": "Druva: How it works",
    "10": "Druva: Features & services",
    "14": "Druva: Support and customer care",
    "16": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Druva": "https://www.druva.com/",
    "best data loss prevention services": "https://www.techradar.com/best/best-data-loss-prevention-service",
    "SaaS applications": "https://www.techradar.com/news/what-is-saas",
    "Amazon Web Services (AWS) infrastructure": "https://www.techradar.com/news/aws",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Acronis": "https://www.techradar.com/news/acronis-data-loss-prevention",
    "disaster recovery": "https://www.techradar.com/best/best-disaster-recovery-service"
  }
}