{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-fit-2",
  "title": "Samsung Galaxy Fit 2 review",
  "category": "wearables",
  "updated": "2021-01-18T11:02:33Z",
  "author": "michael-sawh",
  "summary": "The Fit 2 is a great-looking budget fitness tracker",
  "verdict": "The Samsung Galaxy Fit 2 feels like a more polished effort than the last Fit and is definitely one of the nicest-looking cheap fitness trackers you can put on your wrist right now. It largely delivers on those tracking basics too, but comes unstuck when you turn to it for monitoring heart rate and tracking exercise. If you’re happy just dealing with those basics and a smattering of smartwatch features, you’ll be well served here. The Xiaomi Mi Band 5 though will likely offer you better value while Fitbit’s cheapest tracker will offer a more reliable tracking experience too.",
  "pros": [
    "Comfortable to wear and improved screen",
    "Easy to use",
    "Nice watch face collection"
  ],
  "cons": [
    "Questionable heart rate accuracy",
    "No form of GPS support",
    "Generous battery life claims"
  ],
  "article": [
    "The Samsung Galaxy Fit 2 is a fitness tracker that has tracking step, sleep and heart rate at its core all wrapped up in a design that doesn’t feel as cheap as its price tag.",
    "It replaces the Galaxy Fit and the Galaxy Fit e, with Samsung now adding a higher quality AMOLED touchscreen display to better match its budget rival the Xiaomi Mi Band 5 and has ditched the physical button from the last Fit to create a more attractive, streamlined design.",
    "Housed in that slim, light sporty band frame are sensors that do a mostly good job of tracking steps, monitoring sleep (including REM insights) and tracking your exercise. It also offers automatic exercise tracking, though you’re better off taking the manual route. The lack of GPS means exercise tracking is motion sensor based, which does mean it’s left lacing in the accuracy department for outdoor activities like running.",
    "There’s also room for an optical heart rate monitor to enable continuous monitoring, heart rate data during exercise and to enable stress monitoring. Though if you’re hoping for accurate data, it falls quite short in all of those uses.",
    "Away from its fitness and health features, it also offers smartwatch-style features like notification support, music controls, weather forecasts and a collection of watch faces you can sync over from the Samsung Galaxy Wearable app. There’s compatibility for both Android and iPhones, though the Android support means you can respond to messages from the wrist.",
    "The stated battery life of up to 15 days seemed a little generous in our testing, especially if you’re using features like continuous heart rate monitoring and regularly tracking workouts through a week.",
    "The Fit 2 is a step up from the Galaxy Fit duo it’s replacing. If you like the idea of a cheap fitness tracker that feels nice to wear has a lovely screen and does a good enough job of tracking steps and sleep, the Fit 2 will have appeal. For anything beyond that though, Samsung’s tracker seems to come up a bit short.",
    "The Samsung Galaxy Fit 2 launched on September 3 2020 and is priced at $59 / £39 / AUS$135.",
    "What you get with the Samsung Galaxy Fit 2 is a pick of black or scarlet silicone bands matched up with a non-removable AMOLED display that measures in 11.1mm thick and weighs just 21g. Samsung has ditched the plastic bezel it used on the first Galaxy Fit for a more unified look between band and screen and it’s definitely for the better.",
    "That display is now a larger 1.1in with 126 x 294 resolution matching what you’ll find on the Xiaomi Mi Band 5. It offers nice, rich, vibrant colours and it’s bright too even without using it at its maximum brightness setting. It offers good viewing angles in bright outdoor light and it was easy to view for night time exercise sessions too. It’s not an always-on display, though we imagine that’s down to making sure you get a good amount of battery life from it.",
    "In terms of navigation, it’s all on the touchscreen display, which is nice and responsive. While there’s no physical button in sight, there is a capacitive touch sensitive area at the bottom of the display you can use to jump back to the main watch screen.",
    "If you want to take the Fit 2 for a dip, then you’ve got a 5ATM water resistant rating to make that possible. Lockdown has made it tricky to give it the pool test, though it does pass the shower test and lets you put the new dedicated handwashing timer app to the test without issue too.",
    "It’s a fitness tracker that on the whole is enjoyable to live with. It doesn’t weigh heavy on your wrist, it looks attractive and has a great quality display. The first Fit was on the verge of being a great-looking band, and in the Fit 2, this is definitely more like it.",
    "When you’re not counting steps or tracking workouts, there’s a handful of features on board that make it a bit more useful to have on your wrist. For starters, you have your notifications, which you can swipe right on the display to access the notification screen. From there you’ll find a big app icon to let you know where the notification is from and a tap will expand it.",
    "The narrow screen means you’ll need to scroll to read longer messages, and unsurprisingly, you can’t view images or pictures sent in your direction. When it’s paired with an Android phone, you do also get the added bonus of preset or custom responses you can select if you want to send a quick reply.",
    "There’s a nice collection of watch faces here too that in large make good use of that touchscreen display and will let you show off your daily activity stats or keep things simple.",
    "Music controls are available too as a widget along with weather forecasts and the new handwashing app, which is a timely addition. It simply offers a countdown to make sure you wash for the correct amount of time, sending a vibration when you hit 0.",
    "On a device and screen this slim, there’s always going to be struggle to offer much in the way of smartwatch features. What Samsung does offer though does work without any major issues.",
    "Packed inside of that slim fitness band frame is a 159mAh capacity battery Samsung claims will get you up to 15 days in usage and 21 days in low power mode. Based on our time of testing, daily battery drop-off with notifications turned on, the screen at half of its maximum brightness setting and a 45-minute workout, was around 10%.",
    "In more intensive use tracking longer periods of exercise, it was closer to 15-20%. So it worked out for us to be more like seven days of battery life. If you’re happy to use the basics and live without features like all-day heart rate monitoring, you can push it closer to double digits worth of battery life.",
    "The Samsung Galaxy Fit 2 promises to cover largely the same things you could do with the first Fit. You’re still getting accelerometer and gyroscope motion sensors to track movement and automatically detect sleep. There’s also an optical heart rate monitor to offer heart rate data during exercise, continuous monitoring to enable stress tracking.",
    "There’s no altimeter to track elevation, or any form of GPS support (either on-board or tethered to your phone).",
    "For those daily activity stats, you’re getting steps, distance covered and calories burned. There’s a dedicated widget to view step counts on the device, with additional data available in the Health app. There are inactivity notifications to make sure you stay active, but that’s pretty much it in terms of keeping you motivated to move.",
    "Putting it up against the Fitbit Sense and the Garmin Fenix 6’s fitness tracking features, we found it reported around 500-1,000 steps less on most days and came in around 1km less for distance covered. While we are not saying the Sense or Fenix 6 are more accurate, but there were clearly more consistent data between the Garmin and Fitbit trackers.",
    "If you care about tracking your heart rate, whether it’s during workouts or just through the day and night, we’d say based on our experience, it’s not quite fit for that. Daily resting heart rate readings compared to the Fitbit Sense and Garmin Fenix 6 was generally around 10bpm higher, which is a huge difference.",
    "When you switch to exercise tracking, we took it out on several runs and average and maximum heart rate readings were way off a Garmin HRM Pro chest strap monitor. As much as 20bpm. Switching to some HIIT workouts on the FIIT home workout app, it was a similar story. It posted lower average heart rate and maximum heart rate readings compared to the Apple Watch Series 6, which houses one of the most reliable wrist-based monitors.",
    "That heart rate monitor is also used to power the stress tracking, which based on accuracy issues doesn’t feel like measurements and data you can massively rely on here.",
    "With no GPS, you’re also relying on the less reliable method of using the accelerometer and it’s no surprise to find it comes up short from a GPS running watch. Up against a Garmin Forerunner 745 it captured a nine-mile run as an 8.4 mile run and it was a similar difference for shorter distance runs as well.",
    "When it’s time to go to bed, there’s automatic sleep tracking with snapshot data available on the band and more stats found inside of the Samsung Health app. It’ll track sleep duration and offer sleep efficiency insights with a breakdown of awake, REM, light and deep sleep periods. You can also see your average bedtime, wake-up time and sleep time to start looking closer at trends.",
    "Accuracy-wise, we put it up against Fitbit’s very reliable sleep monitoring skills and found it typically recorded an extra hour of sleep in comparison. Looking at the breakdown of that sleep time, light and awake times were similar though numbers attached to deep and REM sleep seemed low. The sleep tracking experience on the whole is good though, but clearly there’s some question marks over accuracy. It’s certainly not the worst we’ve tried though.",
    "Ultimately, this is a fitness tracker that does the basics well, but when it strives to try and do more, it doesn’t quite cut it.",
    "To make the most of the Fit 2, you’re going to need to make room for two apps on your phone. The first is the Galaxy Wearable one where you can tinker with your settings like setting up quick responses, adjusting notification support and changing the order of widgets on the tracker. This is also the place to go to switch up watch faces.",
    "You’ll also need to download Samsung Health to delve deeper into your health and fitness stats. Not a great deal has changed since the first Fit was launched. You’ve got the main Home screen where you can check out things like step counts, active time, exercise history, sleep tracking and heart rate. There’s also room to manually input data like blood oxygen and blood pressure information from other health monitor devices.",
    "The Together app section is where you can join challenges, connect with other friends using Samsung Health and see how your stats match to the average user. Last up is the Discover tab, which has been given some love and includes fitness programmes, access to mindfulness and meditation-themed audio as well as access to compatible workout apps like Fiit. Not all of these features are free offerings though, but it does mean if you want to look beyond simply tracking steps and sleep, you do have the support here.",
    "The app is by in large pretty straightforward to use. Some of the widgets like the ones related to Exercise tracking and daily activity tracking could do with being a bit more streamlined and intuitive to look over data though. It’s not quite Fitbit levels of user friendliness, but it is in general an app that’s easy to get to grips with."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Samsung Galaxy Fit 2 price and release date",
    "8": "Design",
    "13": "Everyday use",
    "20": "Fitness tracking",
    "31": "Companion app",
    "35": "Don't buy it if"
  },
  "links": {
    "Galaxy Fit": "https://www.techradar.com/reviews/samsung-galaxy-fit-review",
    "Galaxy Fit e": "https://www.techradar.com/reviews/samsung-galaxy-fit-e-review",
    "Xiaomi Mi Band 5": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-5",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Garmin Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Garmin Forerunner 745": "https://www.techradar.com/reviews/garmin-forerunner-745",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit"
  }
}