{
  "source": "https://www.techradar.com/reviews/saturnvpn",
  "title": "SaturnVPN review",
  "category": "computing",
  "updated": "2021-01-19T14:48:11Z",
  "author": "sead-fadilpasic",
  "summary": "Affordable and decently fast VPN that unblocks Netflix and BBC iPlayer",
  "verdict": "SaturnVPN provides a cheap but rather basic VPN experience. It doesn’t have native apps nor thousands of servers, and its money-back guarantee is one of the shortest we’ve seen. Regardless, it delivers decent download speeds, P2P torrenting and access to geo-blocked content.",
  "pros": [
    "Unblocks Netflix US, BBC iPlayer",
    "Exceptionally cheap",
    "Decent download speeds",
    "Free trial"
  ],
  "cons": [
    "Small server network",
    "No native apps",
    "Short money-back policy",
    "Slow customer support"
  ],
  "article": [
    "SaturnVPN is a provider of Virtual Private Network (VPN) services that offers solid performance on a small number of servers, with perks including a kill switch, torrenting support on some servers, low prices, and access to geo-restricted content.",
    "SaturnVPN is very affordable and has some of the lowest rates we’ve seen in the business. For example, if you sign up for the 36-month subscription, you’ll only be paying $39.99 every three years, which is an equivalent of just $1.11 per month, and even its shorter subscriptions are far from expensive.",
    "Under one account, you’ll be able to use this VPN on up to 3 devices at the same time. Accepted payment methods include PayPal, credit/debit cards, Perfect Money, Webmoney and even Bitcoin.",
    "Anyone interested in taking this platform for a spin will be able to do so, as there’s a 1-day free trial on the table that works with PPTP and L2TP protocols only and provides access to the provider’s servers in the United States, United Kingdom, and Germany. You only need to leave your name and email address and you’ll receive an email with your free trial VPN account details within 24 hours. You can’t use OpenVPN, Kerio, or Cisco AnyConnect clients with the trial.",
    "If you still end up buying the service but discover it’s not up to your standards, there’s a money-back guarantee you can rely on, although it’s only three days in length.",
    "SaturnVPN differs from today’s top VPN players in multiple ways. One of them is its money-back guarantee, which is considerably shorter than the 30-day policies offered by most leading services. CyberGhost even offers a 45-day money-back guarantee.",
    "Another big difference is the lack of user-friendly native client, like those provided by NordVPN and ExpressVPN, which stand out thanks to beautiful and intuitive design,.",
    "That said, SaturnVPN is cheaper than the above-mentioned VPNs, so it comes down to your priorities.",
    "Being able to unblock popular geo-restricted streaming platforms is considered an accomplishment for any VPN because access to these services is often the sole reason why someone seeks out a VPN vendor. SaturnVPN is certainly capable in this sense, as it unblocks Netflix US, Hulu, BBC iPlayer, and more.",
    "SaturnVPN operates from Texas, USA, with operators working both from inside and outside of the US. The provider runs “almost 60 dedicated servers” in only three countries: the United Kingdom, the United States, and Germany. Although it appears to have plans to expand.",
    "SaturnVPN’s platform operates through OpenVPN, PPTP, and L2TP connection protocols, as well as through Kerio VPN and Cisco AnyConnect VPN clients.",
    "You won’t find any flashy features and extras with this provider, but there’s one handy privacy-oriented feature that comes bundled with the OpenVPN app: a kill switch. Enabling this option will block your internet access if the VPN connection is interrupted, so none of your sensitive information will leak out into the unknown.",
    "A kill switch is especially handy when you’re using a torrenting client, which is something that this VPN vendor only allows on its servers in Germany.",
    "SaturnVPN is adamantly a no-logs VPN provider, which is repeatedly stated in its Privacy Policy. It says that it does not “and will not monitor user sessions for inappropriate behavior unless compelled to by law enforcement with proper documentation and paperwork.”",
    "The Terms of Service are a bit more specific and state that the provider doesn’t log any user activity, which includes sites visited, DNS lookups, emails, etc., but that it only logs access attempts to its servers, session durations, bandwidth used, and the user clicks made to its software. The purpose of this is security, troubleshooting, popularity tracking and improvements.",
    "We’d love to see independent confirmation of these claims, as well as more detail.",
    "SaturnVPN can be used on Windows, Mac, Android, iOS, and Linux devices, but it doesn’t have any native apps for these operating systems. Instead, it operates through OpenVPN, PPTP, and L2TP connection protocols that can be manually set up on your device(s), as well as through Kerio VPN and Cisco AnyConnect VPN clients.",
    "In addition to detailed setup tutorials, there’s a short FAQ section and a helpful blog, where you can find various interesting information about the VPN industry and SaturnVPN’s qualities.",
    "If you don’t succeed in finding the information you were looking for, there’s “24/7” customer support, available via live chat, contact form, or email. We put “24/7” in quotation marks because we only received a response three days after we sent our email.",
    "Considering it doesn’t have native clients, SaturnVPN isn’t the easiest VPN platform to get use, but it does have detailed instructions that make your life easier. The task is time-consuming and repetitive, however, as you have to set up each server separately and enter your credentials each time you add a new one.",
    "We observed the provider’s download speeds on an 81.67Mbps testing connection, and all the servers we tested used the L2TP connection protocol.",
    "A server in Germany gave us an excellent 30.53Mbps. We then tried a server a bit further away from us in the UK, which gave us a slightly less impressive, but still good, 20.95Mbps. Finally, a server in the USA delivered a lower yet still usable 12.79Mbps.",
    "SaturnVPN certainly does what a VPN is supposed to. It ensures your sensitive information is perfectly safe online, unblocks geo-restricted content, and lets you stream, torrent, and browse at some very acceptable prices. It even throws in a free trial for good measure.",
    "However, it does have some flaws that make it inferior to the top players in the field, such as ExpressVPN. It offers servers in only three countries, has no native clients, its money-back guarantee is very short, and its customer support is slow."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "10": "Privacy and encryption",
    "16": "Support",
    "19": "Speed and experience",
    "22": "Verdict"
  },
  "links": {
    "SaturnVPN": "https://saturnvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Privacy Policy": "https://saturnvpn.com/privacy-policy",
    "Terms of Service": "https://saturnvpn.com/terms-of-service/",
    "setup tutorials": "https://saturnvpn.com/vpn-setup-tutorial/",
    "FAQ section": "https://saturnvpn.com/faqs/",
    "blog": "https://saturnvpn.com/blog/",
    "email": "mailto:info@saturnvpn.com",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1031130861220028400"
  }
}