{
  "source": "https://www.techradar.com/reviews/fitbit-versa-lite-review",
  "title": "Fitbit Versa Lite review",
  "category": "fitness",
  "updated": "2021-03-11T12:45:37Z",
  "author": "james-peckham",
  "summary": "Fitbit's third smartwatch, the Versa Lite offers impressive features on a budget",
  "verdict": "The Fitbit Versa Lite is a pared back version of the Fitbit Versa, which may still offer all you need in a fitness watch. You won’t have access to music or Fitbit Pay, but if the price is more important to you then this could be a good choice for your next watch. It all just comes down to how much you can get the Versa Lite for when compared to the original Versa watch.",
  "pros": [
    "Small and comfortable design",
    "Solid battery life",
    "Low price"
  ],
  "cons": [
    "No GPS",
    "Lacks on-screen workouts",
    "No Fitbit Pay"
  ],
  "article": [
    "Want a smartwatch but don’t want to pay lots for it? There are lots of cheap smartwatch options on the market, but most of the Fitbit options so far - that's the Fitbit Versa and Fitbit Ionic - started out relatively expensive, so the company wanted to change that with its Versa Lite.",
    "The Fitbit Versa Lite Edition is a new version of 2018’s best-selling Fitbit Versa, but comes with a few features stripped away to ensure a slightly lower price. In terms of the entire Versa range, the Fitbit Versa 2 trumps both with more features, but it also costs more, so people who want a budget device will still find the Versa Lite preferable.",
    "It’s still not the cheapest smartwatch out there, but it’s significantly less than the original selling price of the Versa and much less than the Ionic, potentially making it a top choice for your first smartwatch. Plus, it may also be a great way to jump into the world of wearables and start tracking your fitness.",
    "The Versa Lite no longer tops our roundup of the best Fitbits following the release of the Versa 3 and Inspire 2, but if money is tight then it's still worth your consideration at the right price.",
    "After being announced in March 2019, you can now buy the Fitbit Versa Lite all around the world. Often you’ll find it listed alongside the original Fitbit Versa, so you’ll want to make sure you’re looking at the correct version.",
    "The price is where this gets interesting, with it only costing $159.95 / £149.99 / AU$249.95, compared to the standard Fitbit Versa’s selling price of $199.95 / £199.99 / AU$299.95.",
    "We’ve seen the Versa’s price drop a lot recently though in some places. In fact, Amazon sold the Fitbit Versa for only £135.99 / $145 over the Christmas 2018 sales period. So we’re hoping retailers will take the Fitbit Versa Lite and in the following months drop the price lower than what you’ll be paying on day one, but there's no guarantee that will be the case.",
    "At the time of writing our review, the Fitbit Versa was available on Amazon UK for only £154, which is obviously only a little more than the selling price of the Versa Lite at £149.99. That’s something to bear in mind, so if you can get the Versa for only a bit extra we’d recommend buying that instead.",
    "Months on from release, the Versa Lite has also seen price cuts of its own, so it retains its place as the budget Versa device, with the original Versa slightly more pricey and the Versa 2 the most high-end of the trio.",
    "If you’ve used the Fitbit Versa, you’ll know a lot of the design that’s on offer here. The Lite edition is - no surprises here - the company’s most lightweight smartwatch yet, although we don't currently know the exact weight of the device.",
    "In our week of testing we found the watch to be comfortable, and this will be particularly suitable if you have smaller wrists. It will definitely be much more suited to you than the Fitbit Ionic was.",
    "This watch is water resistant up to 50 meters, but it’s not specifically designed for the pool as it doesn’t feature swim tracking. The durability in water is more for when you’re out running in the rain or you accidentally submerge your wrist.",
    "There’s a touchscreen on the front, and it’s a full color display with a resolution of 300 x 300 (that's the same as what the Fitbit Versa has). It seemed clear and bright in our testing time, but Fitbit's screen tech has never seemed as vibrant as the Apple Watch 4 or some Wear OS devices.",
    "There are thick bezels around the display here, but if you’re using a black watch face it’s difficult to notice these. The Fitbit logo is also emblazoned along the bottom bezel.",
    "The screen isn’t as responsive as you’d find on the Samsung Galaxy Watch or Apple Watch 4, but it works well enough for you to navigate around and use the Versa Lite’s various apps and functions.",
    "The left edge of the watch contains the only button that you’ll be using on the Fitbit Versa Lite Edition, which will wake up the watch ready for you to cycle through the menus.",
    "The watch itself comes in white, lilac, mulberry and marina blue colors. Get it in one of the latter two and the watch body will be the same color (rather than silver), providing an interesting effect we haven’t seen on previous Fitbit products.",
    "We’ve been using the blue option, and it’s a bold color choice. Your watch will come with a silicone band in the box, but there are a selection of other straps you can buy alongside it if you want to mix up the style.",
    "You can also buy existing Fitbit Versa accessories to pair with the Versa Lite, so be sure to look at our best Fitbit Versa bands if you’re after a different look.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "4": "Fitbit Versa Lite release date and price",
    "9": "Design and display"
  },
  "links": {
    "Fitbit Versa": "https://www.techradar.com/reviews/fitbit-versa-review",
    "Fitbit Ionic": "https://www.techradar.com/reviews/fitbit-ionic-review",
    "Fitbit Versa 2": "https://www.techradar.com/reviews/fitbit-versa-2-review",
    "best Fitbits": "https://www.techradar.com/best/the-best-fitbit",
    "Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2-test",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
    "best Fitbit Versa bands": "https://www.techradar.com/news/the-best-fitbit-versa-bands-and-accessories"
  }
}