{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-smart-projector-2-review",
  "title": "Xiaomi Mi Smart Projector 2 review",
  "category": "televisions",
  "updated": "2021-10-01T11:34:42Z",
  "author": "hamish-hector",
  "summary": "An upgrade in name only",
  "verdict": "With its sleek compact design, in-built smart features, and decent picture performance there is a lot to love about the Xiaomi Mi Smart Projector 2 if you have a dark enough room to use it in. However, its similarity to its predecessor, the Xiaomi Mi Smart Compact Projector makes this a sequel in name only.",
  "pros": [
    "Compact design",
    "Good audio",
    "Solid image quality"
  ],
  "cons": [
    "No meaningful upgrades",
    "Not very bright",
    "Controller lacks backlighting"
  ],
  "article": [
    "If you’re looking for a compact projector (or outdoor projector) which can output a decent image and won’t break the bank, the Xiaomi Mi Smart Projector 2 ticks all of those boxes. However its similarity to its Xiaomi Mi Smart Compact Projector predecessor has us confused about what's new about this new model.",
    "The design and features of both projectors match up exactly, offering you a Full HD (1080p) image in sizes from 60-inch to 120-inch – provided you have the wall space. The end result is a decent image that offers brilliant colors thanks to HDR10, but struggles with detail during darker scenes.",
    "To achieve the best picture quality you’ll want to be in a pitch black room (or at least make it as dark as you can make it) as the 500 lumens bulb struggles to compete against other light sources. This means you’ll be forced to watch at night or install black-out curtains, but you’ll be happy with the results you can achieve.",
    "You’ll also find the projector’s built-in speakers offer a good audio performance that means external options might not be necessary.",
    "With the Mi Smart Projector 2’s Android TV OS and Google Assistant support, you can watch (almost) any program or film from your favorite streaming services or can cast video straight from your smartphone.",
    "As there doesn’t seem to be much of an upgrade from the previous model, though, we’d recommend keeping an eye on deals for the Xiaomi Mi Smart Compact Projector, as with a new version now released you might find it offers much the same performance at a discount.",
    "The Xiaomi Mi Smart Projector 2 launches in October in the UK, US and Australia. It’s set to have a price tag of £549 in the UK (around $750 / AU$1035 according to current exchange rates). We’ll update this review when we have more accurate pricing info across the other regions.",
    "The Mi Smart Projector 2 is nearly identical to the original Xiaomi Mi smart compact projector, from the shape, dimensions, color scheme and wraparound casing.",
    "That said, what you’re getting is once again a decent compact projector that is small enough to easily carry around with you if you’re looking for something a little more portable. The device measures 4.5 x 5.9 x 5.9 inches (115 × 150 × 150mm) and weighs just 2.8lbs (1.3kg).",
    "The only color option for the Xiaomi Mi Smart Projector 2 sees it come in a white plastic shell, with a front face covered in a gray fabric. It’s not ugly, nor is the projector stunning, so it shouldn’t upstage the image it outputs – and it could blend in well with your home’s décor.",
    "Ports wise the Mi Smart Projector 2 has the bare minimum to get by with one HDMI 2.0, one USB 2.0 and one audio output for headphones. With and Android TV OS and the ability to wirelessly cast to the projector, you’ll probably be okay for basic connectivity – but if you like using a range of entertainment devices that rely on HDMI you’ll need a splitter or a different device.",
    "The remote for the projector is incredibly simple, offering you just enough buttons for the basic functions and little else. You can activate the Google assistant, change the volume, go to the menu, navigate and select, and have a shortcut for Netflix.",
    "Our only issue with the controller is the lack of backlighting – an issue we found on the original Xiaomi Mi smart compact projector too. As you’ll want to be in near darkness when using the projector, it can be difficult to make out the symbols on the all-black handset meaning you’re forced to go by feel alone a lot of the time.",
    "The feature set is much the same as the previous projector too. The projector uses the Android TV OS to deliver many of your favorite streaming services. Apps and games from the Google Play Store. The built-in Google Assistant will also let you command the speaker with your voice, and search for content across all the different services that are available.",
    "During testing we did find that some apps weren’t yet supported on the projector – such as Disney Plus, Amazon Prime Video and Apple Music. It's easy enough to cast videos to the projector from a smartphone, though. It seems like it might be an update issue, and we can update this review if an update does bring these services to the projector.",
    "It also has great focus and keystone controls so we were able to easily set up this projector to give us a great looking image from multiple different angles and locations around our testing room. The auto-focus and auto-keystone works best for a projector that is straight on to a screen, but manual controls take moments to sort out.",
    "Audio wise, this projector packs in two 5W speakers that support Dolby Audio that bring a decent sound. You almost certainly won’t be blown away by the performance – and we’d recommend using external speakers if you have them – but for built-in speakers they do a very good job.",
    "The Xiaomi Mi Smart Projector 2 offers a decent picture quality and an absolutely enormous screen size if you have the space for it to accommodate its maximum 120-inch display – which it can achieve at a distance of three meters from a large enough surface.",
    "To put this projector through its paces we tested it out using the Marvel film Spider-Man: Homecoming. The projector dazzled us with its handling of bright colors (such as the superhero’s bold red and blue suit) thanks to its four-channel LED RGB+BP and HDR10 technology.",
    "However, as with many other projectors at this price, it struggles during darker scenes. In Spider-Man: Homecoming this meant Vulture’s dark suit and wings weren’t as detailed as we might have liked, and the whole final act of the film (which is set at night) was harder to follow than moments set during the day.",
    "We also found the projector wasn’t generally bright enough to combat ambient light; if the room wasn’t in pitch darkness (or very near) the projected image could be difficult to see. If you want to get the most out of this projector you’ll definitely want to use it at night or in a room where you can block out sunlight coming in through the windows.",
    "The last thing to note is that this projector can only output a Full HD image (1920 x 1080 pixels) rather than 4K. At this price you would struggle to find a higher quality image from a projector, but if you’re weighing this up against a TV it’s something you’ll want to consider (as even budget sets can offer 4K at this price)."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Price and availability",
    "7": "Design",
    "13": "Features",
    "17": "Picture quality",
    "22": "Don't buy it if…"
  },
  "links": {
    "outdoor projector": "https://www.techradar.com/best/outdoor-projector",
    "Xiaomi Mi Smart Compact Projector": "https://www.techradar.com/reviews/xiaomi-mi-smart-compact-projector"
  }
}