{
  "source": "https://www.techradar.com/reviews/daja-dj6-laser-engraver",
  "title": "DAJA DJ6 laser engraver review",
  "category": "computing",
  "updated": "2021-03-22T07:02:57Z",
  "author": "ali-jennings",
  "summary": "Quality laser engraving on a budget",
  "verdict": "Take full control of your engraving projects from your smartphone with the compact desktop DAJA DJ6 laser engraver.",
  "pros": [
    "Incredibly cheap",
    "Good quality engraving",
    "Large material compatibility",
    "Nicely designed app"
  ],
  "cons": [
    "Very small engraving area",
    "Manual laser focus"
  ],
  "article": [
    "Laser engraving technology has steadily advanced in recent years, making the latest models smaller and cheaper than ever before. The DAJA DJ6 is one of the smallest and cheapest laser engravers yet, with its small form reminiscent of a compact coffee machine.",
    "DAJA has gone for a straight forward approach, with an app designed for iOS and Android and support for Mac and Windows machines.",
    "Image, text or free form drawings can be loaded or created in the application and then sent directly to the laser for etching or cutting. The whole design and concept of the DAJA DJ6 Laser engraver really couldn't be easier.",
    "The compact design is reminiscent of a small coffee machine. The small footprint means that it's easy to store or keep neatly on a shelf, ready for use at any time.",
    "The company has also created an open design that means that although small, large objects can either be placed into or underneath the machine ready for lasering.",
    "Set-up of the DAJA DJ6 is quick; remove from the box, plug-in power and switch on, that's it, well almost.",
    "You also need to install the software on your chosen device. For the purpose of this test that's an Android Phone.",
    "Once the App is installed you switch on the mobiles Wi-Fi hotspot with the password given in the DAJA manual, wait for a second or two to connect, and then everything is set and ready to go.",
    "For a laser engraver of this size, the small DAJA DJ6 manages to pack in some impressive features.",
    "Firstly it comes equipped with a 3,000mW laser capable of cutting through specialist papers, felts and woods with a thickness of up to 1.5mm. That might not sound a great deal, but for a printer of this size, that's impressive and will make it very appealing to model makers and crafters.",
    "The open design is another feature that will appeal to many as larger items can be placed under the laser for etching and cutting.",
    "What gives the DAJA DJ6 the edge over many larger laser engravers is the fully-featured app. This App enables you to load in or create your etching content. This app is available for iOS, Android, macOS and Windows, although at present only the Android and Windows versions were fully available.",
    "One feature that you should always look out for on a laser engraver is the preview mode. This sends the laser on a path around the edge of the design you are cutting and ensures that you have the material correctly placed.",
    "A common feature for entry-level laser engravers is the manual focus laser along with the ability to use the direction buttons on the machine to move the laser into position. Out of the box, the laser is pre-focused, so for the most part, you should only need to focus when using different thicknesses of material.",
    "Another common feature is motion detection; this essentially ensures that if the DAJA is moved while in use, the laser will instantly cut out.",
    "Other safety features include a shield to protect your eyes and an internal fan that keeps things cool when the laser is in use.",
    "As specifications go, there's more here considering the size and price than I would usually expect.",
    "Entry-level laser engravers can suffer from all sorts of issues, under-powered lasers, slow engraving and cutting. Then there are the often DIY approach to the machines that require assembly from the user, however, this is not the case with the DAJA DJ6.",
    "The DAJA DJ6 come fully built, so there are few, if any, issues regarding the construction of the engraver. The solid build also ensures accuracy, and from the outset, that accuracy shows when this machine is in use.",
    "DAJA has approached the design of this machine sensibly. It's easy to set-up and get running. The app is well laid out, and while the grid preview does take a little getting used to, it is all clear enough.",
    "Unlike other machines where it can be tricky to differentiate between etching and cutting, in the app, you have clear indications on whether the image is to be cut or etched through the edit option.",
    "Likewise, adjusting the laser cutting and carving power is all handled in a separate menu option, and a little playing around and experimenting quickly outlines the settings you want.",
    "Putting the first piece of paper under the laser and setting off a simple etch of the TechRadar logo and the process was complete in around a minute. Compared with the laser cutters, I've tried recently that is extremely quick.",
    "Again setting the DAJA DJ6 to cut rather than engrave, and the small engraver went to work, again quickly and accurately cutting out the logo with ease.",
    "Running further tests and again, the App interface makes it easy to load additional images and graphics and etch and cut them as you need.",
    "The engraver settings' adjustments are limited in as far as you can't adjust speed. Still, the DAJA is well configured and adjusting the carve or cutting options enables a good amount of fine-tuning.",
    "As with other manual focus laser engravers, the focus is critical to the success of the engrave or cut. The same is true for the DAJA, and while the power of the laser does compensate for some adjustment, it's critical if you want to cut through 1.5mm ply.",
    "After a few focusing attempts, I finally managed to adjust the focus to enable a single pass that would cut through the ply. A slight push of the finished cutout was needed from the ply, but and impressively clean cut.",
    "The DAJA success is a unique compact laser engraver that will suit the needs of most people.",
    "The machine quality is excellent, even before thinking about just how cheap this engraver is.",
    "Likewise, the etching quality, although small, is excellent, and after running countless tests, I found that I was able to squeeze in the text to the length of 8cm on the diagonal, and a complete circle with a diameter of 7cm."
  ],
  "headers": {
    "3": "Design",
    "8": "Features",
    "17": "Performance",
    "28": "Final verdict"
  },
  "links": {
    "DAJA DJ6": "https://www.kickstarter.com/projects/dajalaser/the-most-affordable-laser-engraver-for-creative-life"
  }
}