{
  "source": "https://www.techradar.com/reviews/bitwarden",
  "title": "Bitwarden password manager review",
  "category": "computing",
  "updated": "2021-11-02T06:18:21Z",
  "author": "richard-sutherland",
  "summary": "The best free password manager available today?",
  "verdict": "One of the top password managers around, Bitwarden is secure, feature-packed, open-source, and has support for mobile devices.",
  "pros": [
    "Sync multiple devices",
    "Open-source",
    "Free tier per personal use",
    "Multi-platform support"
  ],
  "cons": [
    "Limited support options",
    "Basic desktop app",
    "Desktop application lacks password autofill"
  ],
  "article": [
    "Bitwarden, a company based in Santa Barbara, California offers its software via an open source license. We believe it to be one of the best password managers available today. With a user friendly interface, and a highly secure environment, it includes almost everything individuals, teams, and businesses would require in a password manager.",
    "In our Bitwarden password manager review, we test whether this open source software is a valid replacement for commercial password management solutions.",
    "Bitwarden’s basic plans focus on the meat of password management, but even the free plans include multi-device sync, optional self-hosting and unlimited cloud storage.",
    "Premium plans include reports on your passwords that highlight things like weak passwords and unsecured websites. Also, advanced features are added, such as Two Factor Authentication (2FA) and emergency access. A Data Breach Report can tell you whether an email address has been compromised in a known data breach.",
    "The business plans include features for managing the passwords of a larger workforce, with password sharing so multiple coworkers can access a private, corporate account. There is also fine-grained access control, user groups, two-step login, and multi-factor authentication. There is also an offer of an Enterprise Free Trial.",
    "Bitwarden’s installation process is straightforward. There are download buttons on the website for desktop apps, mobile apps, browser extensions, and command-line installers, and you can access the Web Vault from any browser by heading to vault.bitwarden.com. The list of supported platforms is comprehensive and includes:",
    "Even with all of that support, there is an option to be able to use any browser to access the ‘Web Vault.’ This allows you to access the passwords from any device- even if using a friend’s computer.",
    "If you download the desktop app, you can create your Bitwarden account from within it by supplying an email address and a master password. It’s all very clear and simple.",
    "Everything can be configured in the web app but if you prefer a standalone application, you’ll find the desktop app easy to use. Some password managers go overboard with superfluous features, but Bitwarden keeps things simple while offering enough flexibility for most users.",
    "When you add a new password, you can set the URL pattern it’s for and whether it should be added to a sub-folder. You can also add notes and custom fields but not much more.",
    "We prefer using the web app, as it includes two-factor authentication options and access to reports. The browser extension resembles the web app and includes a password generator, which makes using the password manager on the fly even easier.",
    "Bitwarden is one of the most demonstrably secure password managers available today, having been publicly audited by security firm Cure53. A benefit of open source software is that all of Bitwarden’s source code is available online, and this translates to that it’s received more scrutiny from security experts than closed source commercial password managers and security holes get patched in a timely fashion.",
    "Your Bitwarden vault is secured with AES-256 (the governmental standard for Top Secret data), and your master password is never sent to Bitwarden. It’s instead used to generate a key that’s further hashed with SHA-256. For those that are extra paranoid, you can even host all your passwords on your own server. All of these features come together to make a super-secure system you can confidently trust with your passwords.",
    "Bitwarden is an active open source project, so there’s plenty of support in the form of an online community, tutorials, a knowledge base and forums. Every common feature has a well-written tutorial and the user forums, while basic, are active and helpful.",
    "You can even email the developers for support via an online support portal, with Premium subscribers getting priority. It’s impressive for an open-source project like Bitwarden to have the level of customer support that rivals commercial products. However, it is disappointing that even for paying customers, we did not find a direct phone number for situations that would benefit from direct contact.",
    "Bitwarden has a free personal plan, a premium personal plan, two family plans including a lower tier free one, and two paid business plans.",
    "The free personal plan includes all the core features of Bitwarden, including multi-device sync and unlimited items in your vault. Upgrading to the $10/year Premium plan adds emergency access, two-step login with third parties, and priority customer support. The Premium plan costs a very affordable $10/year, with a shared 1GB of encrypted file storage.",
    "The free tier of the family shared plan is essentially the free personal plan, but includes sharing between two users, but you are limited to two shared password collections. Upgrading to the Family Organization plan costs just $3.33/month for six users and unlocks unlimited collections and 1GB encrypted file storage.",
    "The Team Organization plan costs $3/user/month (billed annually) and includes a wealth of added features such as user groups and RESTful API access. Finally, there is the Enterprise Organization plan that runs $5/user/month (also billed annually), that adds features such as SSO organization, and Admin Password Reset.",
    "If you’re willing to spend a little more, Dashlane adds identity theft protection to the mix. This adds credit monitoring, identity restoration support, and identity theft insurance that covers you up to $1 million should the occasion occur.",
    "Another paid password manager with more features than Bitwarden is LastPass. Notably, LastPass can autofill passwords on desktop applications, a nifty feature that some businesses will find invaluable.",
    "Bitwarden is not just one of the best free password managers available, it’s so usable and feature-packed it could put paid password managers out of business. The free plan has unlimited storage and multi-device sync, AES-256 encryption keeps everything secure, and the source code is available for all to peruse. We’d like to see a few additional features like desktop application password autofill, but other than that we highly recommend Bitwarden.",
    "We've also highlighted the best password manager"
  ],
  "headers": {
    "2": "Features and utilities",
    "5": "Setup",
    "8": "Interface and performance",
    "11": "Security",
    "13": "Support",
    "15": "Plans and pricing",
    "19": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "Bitwarden": "https://bitwarden.com/",
    "best password managers": "https://www.techradar.com/best/password-manager",
    "open source software": "https://www.techradar.com/best/best-open-source-software",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "browser": "https://www.techradar.com/best/browser",
    "password generator": "https://www.techradar.com/best/password-generator",
    "server": "https://www.techradar.com/news/best-small-business-servers",
    "free personal plan": "https://bitwarden.com/pricing",
    "Premium plan": "https://bitwarden.com/pricing",
    "Family Organization plan": "https://bitwarden.com/pricing",
    "Team Organization plan": "https://bitwarden.com/pricing/business",
    "Enterprise Organization plan": "https://bitwarden.com/pricing/business",
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "best password manager": "https://www.techradar.com/best/password-manager"
  }
}