{
  "source": "https://www.techradar.com/reviews/cleer-audio-crescent",
  "title": "Cleer Audio Crescent review",
  "category": "audio-visual",
  "updated": "2021-05-14T15:31:26Z",
  "author": "olivia-tambini",
  "summary": "A striking wireless speaker with Google Assistant smarts",
  "verdict": "The Cleer Audio Crescent is a wireless speaker that really stands out from the crowd, with an architectural design and luxurious finish. While it is rather expensive, it does provide a well-balanced soundstage, excellent connectivity, and Google Assistant smarts. It’s a shame there’s no HDMI port, though. You can use the digital optical port to hook it up to your TV, but you’re limited when it comes to lossless audio formats such as Dolby Digital, and the speaker’s own 3D sound mode isn’t a patch on Dolby Atmos.",
  "pros": [
    "Well-balanced sound",
    "Striking design",
    "Google Assistant built in"
  ],
  "cons": [
    "3D audio performance is patchy",
    "Expensive",
    "No HDMI port"
  ],
  "article": [
    "There may be a growing trend for smart speakers that blend into the background, or even take the form of a piece of furniture, but models such as the Cleer Audio Crescent prove that there’s still a place for statement audio devices in the home.",
    "With a striking architectural design and luxurious bronze finish (and a luxury $699.99 / £699 / about AU$900 price tag to match), the Crescent refuses to fade into the background.",
    "Through the control panel on the top of the speaker you can toggle between audio sources and sound modes, and adjust the volume – although at this price we’d have liked a remote control to be included. However, you can at least use your voice to control it via Google Assistant.",
    "There are plenty of wireless connectivity options, including Wi-Fi, Bluetooth, Chromecast, AirPlay 2, alongside all the physical ports you’d expect – including a digital optical port, which means you could use the Crescent as a soundbar for your TV.",
    "Of course, all those specs and flashy looks would mean nothing if the Cleer Audio Crescent didn’t sound good – and we’re happy to report that it ticks pretty much all our audio boxes, offering a well-balanced, powerful sound, tightly controlled bass, and support for hi-res audio.",
    "The Crescent comes with three different sound modes, one of which offers a semblance of spatial audio. It isn’t as convincing as Dolby Atmos, but it’s still impressive, and could be an incentive for those who want to use the speaker as a soundbar.",
    "There are cheaper wireless speakers capable of delivering an excellent audio performance, however – and if you’re considering the Crescent for use with your TV, you may be better off with a Dolby Atmos soundbar that will deliver a more immersive sound experience.",
    "Still, the Cleer Audio Crescent is certainly an accomplished wireless speaker, and if you’re looking for a smart speaker that will stand out from the crowd, you can’t really go wrong with this one.",
    "The Cleer Audio Crescent was first announced at CES 2020, although it didn’t become available to buy until January 2021.",
    "The moon-shaped speaker costs $699.99 / £699, and while Australian availability is still to be confirmed, that works out at around AU$900.",
    "It’s certainly pricey for a wireless speaker – in fact, our pick of the best wireless speaker of 2021, the Sonos One, is less than a third of the price. Still, you’re getting a truly unique design and high-quality finish for your money, and as long as the sound matches up, that price may be justified.",
    "The design of the Cleer Audio Crescent is certainly unique, with a boat-shaped build that looks rather architectural. If you want a wireless speaker that could just as easily double up as a piece of art, this is the speaker for you.",
    "As you’d expect from a speaker in this price range, the Crescent has a high-quality finish, with a perforated aluminum grille that attaches to a plastic base. It’s all clean lines and sweeping symmetry, which combined with that bronze and brown finish, looks very special indeed. Of course, it won’t appeal to those who want their home audio devices to blend into the background; this unit makes a statement.",
    "On the top of the speaker you’ll find a row of buttons that allow you to mute the built-in microphone, select your source, switch between sound modes, and control your music playback.",
    "Meanwhile, the front of the speaker features four LEDs that let you know when Google Assistant is listening.",
    "In terms of physical connection options, you’ll find an Ethernet port, 3.5mm analogue input, and a digital optical port round the back of the Crescent, with the latter making it possible to use the speaker as a soundbar (although the lack of HDMI port does limit you somewhat when it comes to lossless audio formats such as Dolby Digital).",
    "However, the Crescent’s size means your TV will need to be wall-mounted if you have any hope of still being able to use your TV remote without the speaker blocking the IR receiver.",
    "Speaking of remotes, it’s a shame that there isn’t a remote included with the Cleer Audio Crescent. While you can use your voice to control the speaker via Google Assistant, it would be nice to have the option of using a remote at this price (although that may speak more to our laziness than any real deficiency with the speaker).",
    "The Cleer Audio Crescent comes with a linear array of eight 40mm full-range drivers and two backfiring 84mm woofers, which provide impressively powerful audio performance. According to Cleer Audio, unwanted sonic resonance as a result of these powerful drivers is “eliminated” thanks to a glass-reinforced substructure and geometrically vaulted design.",
    "The speaker comes with three different sound modes: Room Fill, Stereo Widening and 3D mode. To our ears, Room Fill mode is the most well-balanced across the low, mid and treble frequencies.",
    "Listening to Mark Ronson’s 2019 album Late Night Feeling, the disco-inspired bass lines sounded punchy and well controlled, while the myriad featured vocalists came across clear and smooth. We’d have liked a little more detail in the highest trebles – sometimes, percussion suffered from a muffled quality – but the mid and low trebles sounded rich and lush.",
    "Moving on to the latest track from Little Simz, Woman, the vamping jazz piano chords cushion Cleo Sol’s airy vocal, with good separation between the different frequencies as romantic strings bubble up to the surface.",
    "In Bright Eyes’ Road To Joy, the acoustic guitar sounded warm and natural, while Oberst’s wordy lyrics came through with plenty of clarity. Driving percussion felt agile and accurately handled, and cacophonous brass hits had just enough punch without sounding harsh.",
    "When we put the Crescent into stereo widening mode, the soundstage did feel broader and more rich; less as though the music was coming directly from the speaker. However, it also had the unfortunate effect of dampening the trebles, losing a little clarity.",
    "3D mode is interesting. It certainly isn’t as convincing as Dolby Atmos, but it does give the sound a more immersive feel that could work well if you choose to use the speaker as a soundbar for movies and gaming. Again, there’s a noticeable dip in detail where the trebles are concerned.",
    "We’re not convinced that the trade off in audio fidelity is worth a slightly wider soundstage, although the ability to toggle between different modes is always appreciated – and you may find that your personal preference differs from ours.",
    "The Cleer Audio Crescent comes with support for both Wi-Fi and Bluetooth 4.2, so you can stream music over your home’s network or via your phone. It’s a shame that Cleer Audio hasn’t plumped for the latest Bluetooth standard for longer connection distances and quicker pairing, but the speaker worked fine when paired with our phone throughout our tests.",
    "There’s support for Apple AirPlay 2, Google Chromecast, and compatibility with Spotify Connect, too, so you have lots of options when it comes to streaming your music. And for more discerning ears, there’s support for hi-res audio as well.",
    "With Google Assistant built in, setting up the speaker is super-easy. Simply open the Google Home app on your phone and follow the instructions; you can then assign the Crescent to a specific room, give it a name, and adjust your Google Assistant settings.",
    "The built-in microphones had no trouble picking up our voice when we gave Google Assistant commands, even when playing music at relatively loud volumes."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Cleer Audio Crescent price and release date",
    "11": "Design",
    "18": "Audio performance",
    "26": "Connectivity and voice assistant",
    "30": "Don’t buy it if…"
  },
  "links": {
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "best wireless speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079/uk/news/best-speaker",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review"
  }
}