{
  "source": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/microsoft-surface-book-1306306/review",
  "title": "Microsoft Surface Book review",
  "category": "computing",
  "updated": "2021-04-16T20:40:14Z",
  "author": "kevin-lee",
  "summary": "An amazing laptop that does even more as a tablet",
  "verdict": "While the Surface Book brings many technological innovations to the laptop space, its greatest strength is that it's just an all-around terrific device.",
  "pros": [
    "Futuristic design",
    "Unrivaled display",
    "Seamless tablet separation"
  ],
  "cons": [
    "Battery life falls well below promises",
    "Major updates are still in tow"
  ],
  "article": [
    "The Microsoft Surface Book is one of the best Windows 10 devices we’ve ever seen and tested, and one of the most influential. Thanks to its powerful components, stunning 3,000 x 2,000 display, and that brilliantly-designed Dynamic Fulcrum hinge, it has certainly more than earned its place in the history of portables.",
    "In fact, it has had a huge impact on the 2-in-1 laptop scene and redefined what to expect from hybrid laptops since its release in 2015. And, with the constant flow of updates Microsoft releases for, the Microsoft Surface Book will stay relevant for some time to come. Especially with the newer Surface Book 2 costing a bit more, this original model is still a great choice for potential users.",
    "Even after all this time since its initial launch and all the new releases from Microsoft – including the Surface Laptop 4 released in April 2020, the Microsoft Surface Book has built a legacy that continues to impact the computer world.",
    "The Surface Book 2 is starting out less expensive than it did when it first came out, setting you back $1,199 (£1,149, AU$2,199). Still, the original Surface Book is even cheaper. You won’t find it sealed on a store shelf anymore, but you can find the Surface Book refurbished for as little as $749 (£849, about AU$1,035). And, a refurb Surface Book is still a Surface Book.",
    "But, it goes deeper than the spec sheet – the Surface Book’s convertible design is still attractive in 2019. While the Huawei MateBook X Pro may win you over with its bezel-free display, the Surface Book can boast versatility with a detachable screen and native stylus support that make it such a compelling device.",
    "But, because the Surface Book has been out for a couple years, you can save quite a bit of cash on the original. On Amazon, you’ll be able to save hundreds of dollars on a Surface Book, without losing much in the way of performance, compared to the Surface Book 2.",
    "If a tear in the space-time continuum were to suddenly rip open, two things would fall out: the Terminator and then the Surface Book quickly tumbling to the Earth behind it. From the snake-like hinge, the flat design and even down to the washed-out silver color of the laptop, everything about it just seems like it came from the future.",
    "Milled from two solid blocks of magnesium, the Surface Book feels sturdy and has a most minimalistic style.",
    "Along the chiseled sides, you'll find two flat edges that start from the top of the display and terminate at the tip of the palm rest. That's not the only seamless transition.",
    "Unlike most other convertible devices, the screen and base sections share nearly the same thickness and weight. Without the foreknowledge that the display can actually detach, the Surface Book looks like one continuous device, thanks to the hinge.",
    "From the keyboard deck to the palm rests, the Surface Book is one flat piece of metal, except for the glass touchpad, obviously. Even the Surface Book’s display is one continuous piece of magnesium, with the only design flourishes being a mirror finished Windows logo in the center and rear-facing camera.",
    "At the midpoint of the Surface Book, there's a piece of connective tissue that Microsoft calls the dynamic fulcrum hinge. Rather than simply bonding the screen and keyboard base together, it's this key piece that makes the Surface Book work.",
    "The dynamic fulcrum hinge, rather than folding flatly, like a normal laptop, coils into itself, leaving a noticeable gap between the screen and keyboard when it’s closed. When opened, this same hinge rolls out and actually extends the base of the laptop, which in turn helps extend the support base for the tablet section of the Surface Book – a section that Microsoft calls the Clipboard.",
    "While a traditional notebook display might weigh half a pound at most, the top section of the Surface Book weighs 1.6-pounds, because it has all the necessary parts to act as a standalone tablet. As such, the hinge has been reinforced and contains extra mechanisms, not unlike the Lenovo Yoga 900's watchband-style hinge to keep it in place.",
    "And, because the Surface Book is solid as a rock, you can even pick it up by the display and shake it around, without having to worry about the whole thing falling everywhere. And, on a flat surface, the display is held steady in place and even stays put when you have it in your lap.",
    "The only times we got the screen to move were when we tried poking the Surface Book with the Surface Pen, but that really comes from trying to operate a touchscreen on a laptop. Fortunately, the hinge on the Surface Book 2 is a lot sturdier – but again, it’s much more expensive. Other than that, the strikingly similar design carries on to the Surface Book’s sequel.",
    "To alleviate some of the worries about the gap in the middle of the system – yes, there’s a large open space right in the middle when it’s closed. No, dust and other bits of nasty gunk won’t slip into the interior anymore than with a standard laptop, unless you’re an especially messy person. After a week of using the Surface Book day-in and day-out, we were able to run our finger against the inside hinge and not find a single speck of dust.",
    "Another plus side of having a laptop that doesn’t close completely flush is that you don’t need to worry about oily outlines of the keyboard appearing on the screen. It’s a design element that also eliminates the need to seat the keyboard into a recessed area. Rather, the keys stand at attention above the keyboard deck.",
    "The keyboard itself offers a luxurious 1.6mm of key travel that caps off with a satisfying thwack when you bottom out the keys. The trackpad is just as pleasing, with its glass-laminated surface. For the first time ever, we found ourselves using three-finger multi-gestures to rotate through windows and reveal the desktop.",
    "While this is a tiny element of the Surface Book, few – if any – other Windows notebooks on the market today offer such a tight tracking experience.",
    "The Surface Book’s other trademark feature is the screen, which can pop off the base with the tap of a button. Now, Microsoft was technically late to the 2-in-1 laptop game with other devices able to perform similar actions, including the Acer Switch family, Toshiba’s Click notebooks, some HP devices – the list goes on.",
    "However, Microsoft was the first to make a system as seamless as the Surface Book.",
    "Undocking and attaching the Clipboard is nearly as seamless as the Surface Book's design. After either pressing the eject button on the keyboard or the virtual button in the taskbar, the screen will blink off for a second and then notify you it's safe to detach the screen with one quick tug.",
    "It's fast and simple, however, the timing takes a little getting used to. After you get the prompt to detach the screen, you have to wait for about half a second before you can actually lift the display off its base.",
    "Another unique feature to this notebook is it's the first to integrate a discrete graphics processor, or GPU, into a hybrid system. Hidden beneath the keyboard is a customized Nvidia GeForce GPU that makes this laptop just a bit more capable with media production and gaming.",
    "We've seen this sort of GPU docking technology before in machines like the MSI GS30 Shadow with GamingDock and Alienware's GPU Amplifier solution. Microsoft has improved upon dockable graphics, as the Surface Book just needs a short moment to disengage the extra parts, whereas both the Alienware and MSI solutions require the laptop to reboot completely.",
    "It's a nifty feature that allows us to easily show a friend something cool or when we want to read a digital comic book without having to lug the whole laptop around. However, it didn't really click with us until we realized how easily it allows us to bring our entire PC to another place without having to disconnect our external monitor, keyboard, mouse, Xbox controller and all our other peripherals at home.",
    "It's the coolest mechanic since the saucer separation of the Enterprise-D. What's more, it leaves open a door to expandability. Because the Clipboard is compatible with all Surface Book keyboard bases, not just the one it shipped with, Microsoft could theoretically come out with future upgrades that can be done through new bases. (Or maybe even a desktop rig that interfaces with the display? We can dream.)",
    "Bill Thomas and Gabe Carey have also contributed to this review",
    "First reviewed: October 2015",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "11": "Mind the gap",
    "20": "Mobilizing the desktop"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "2-in-1 laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2",
    "Surface Laptop 4 released": "https://www.techradar.com/reviews/surface-laptop-4",
    "Huawei MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro",
    "Lenovo Yoga 900's watchband-style hinge": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/lenovo-yoga-900-1307062/review",
    "MSI GS30 Shadow with GamingDock": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/msi-gs30-shadow-1277918/review",
    "Alienware's GPU Amplifier solution": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/alienware-17-2015-1291790/review",
    "compatible with all Surface Book keyboard bases": "https://www.techradar.com/news/mobile-computing/laptops/surface-book-isn-t-just-fast-it-s-also-flexible-on-the-upgrade-front-1307568"
  }
}