{
  "source": "https://www.techradar.com/reviews/dt-research-dt362gl",
  "title": "DT Research DT362GL review",
  "category": "computing",
  "updated": "2021-10-11T10:33:46Z",
  "author": "mark-pickavance",
  "summary": "A Windows PC in an unexpected form factor",
  "verdict": "A durable phablet with an extensive selection of accessories and options, the DT362GL offers a Windows IoT Enterprise data capture platform. But battery life isn’t great, and there are some surprising omissions.",
  "pros": [
    "Windows IoT Enterprise edition",
    "Plenty of accessories and options",
    "Extremely rugged",
    "Swappable batteries"
  ],
  "cons": [
    "Its Windows",
    "Small screen size and odd resolution",
    "Lacks audio in or out",
    "Battery life isn’t stellar"
  ],
  "article": [
    "Data collection devices are uniquely focused equipment designed to function in harsh environments while providing a reliable service. They’re at the heart of any logistical operation, enabling management to identify stock movements and volumes without the need for time-consuming manual exercises.",
    "The DT Research DT362GL is a data capture computer built by a company with a reputation for making built-for-purpose devices that can enhance the data capture workflow and the efficiency of those performing it.",
    "Built around Windows IoT Enterprise edition, its objective is to capture data in a secure and timely fashion while providing the flexibility of that platform. Is a low-powered Intel processor and Windows the right combination for an agile data capture device?",
    "With these types of devices, they’re not generally sold at a flat price, but one that is defined by the options that are taken and the service contract that comes with it. The review machine is priced at £967.96 ($1480), but that’s without some of the accessories, like extra batteries, that most customers will require.",
    "Those budgeting for this device should consider what accessories they will need from the outset and the likely lifespan of batteries recharged every working day.",
    "These days anything robust must look the part, and the DT362GL’s chunky damage resistant corners sell that it can handle being dropped, probably from orbit.",
    "Many people picking it up for the first time would assume that this is a phone, but it’s a complete PC shoehorned into a polycarbonate and rubberised shell with a hand strap to help maintain a grip on it across the back.",
    "Beneath the easily removed hand strap is a battery module that can be hot-swapped for replacements. And the included charging station has two slots, one for the DT362GL and another for a second battery to be ready for use.",
    "On the sides are the power button and two programmable buttons that can be used to operate some of the optional hardware, like a scanner or take a picture.",
    "The review machine had both those options, with the scanner being on the top edge and the 8MP camera being on the rear. Other options fit behind removable panels on either side.",
    "The only standard external port is a single USB-C on the bottom edge, and alongside that is a proprietary port for connecting an optional scanning trigger.",
    "A minimalist approach to external ports allows it to be IP65-rated for water and dust resistance. And, the robust construction is MIL-STD-810G rated for shock and vibration protection. Those definitions don’t include water immersion or pressurised jets, but they’re more than sufficient for what this hardware might encounter on a loading dock or in a warehouse. As an option, DT Research can make this hardware C1D2 compliant (Groups A, B, C and D), should the environment house containers with ignitable concentrations of gases or vapours."
  ],
  "headers": {
    "3": "Price",
    "5": "Design"
  },
  "links": {}
}