{
  "source": "https://www.techradar.com/reviews/password-boss",
  "title": "Password Boss review",
  "category": "computing",
  "updated": "2021-03-22T22:48:31Z",
  "author": "darcy-french",
  "summary": "A good password manager without being a great one",
  "verdict": "Password Boss does exactly what it says it does and does it well. Small and medium-sized businesses simply wanting a secure and easy-to-use password manager would do well to consider this provider.",
  "pros": [
    "Simple yet reliable platform",
    "Business-specific support"
  ],
  "cons": [
    "Few innovative features"
  ],
  "article": [
    "Password Boss is a compact but powerful password manager for businesses. It might not be the best password manager, but it is reliable, easy to use, and highly secure. For small and medium-sized businesses that don’t require complex features or advanced analytics and administrator controls, Password Boss may be an ideal solution.",
    "In our Password Boss review, we look at the strengths and weaknesses of the platform and compare it to some of its competitors.",
    "Password Boss makes it easy to keep track of important passwords and credentials and makes collaborating across your organization a seamless experience.",
    "As a baseline, Password boss includes all the features you would expect in a top-quality password management solution. These include one-touch login, password sharing, password generation, and secure cloud storage and backup.",
    "Password Boss also enables users to create different storage areas for business and personal credentials, ensuring the two don’t get mixed up.",
    "The good news is that Password Boss also offers some innovative features we haven’t seen in its competitors, such as the Dark Web Scan. This feature tells users which of their passwords have been compromised and how much of their information may be available for purchase on the Dark Web. This is a powerful feature, although we would like to know more about the technology powering this scan, which we were unable to find out about on their website.",
    "Password Boss is easy to set up, and creating an account takes only a few minutes. We like that Password Boss provides a helpful video and troubleshooting advice for businesses and users downloading and logging into the platform for the first time. It’s a small thing, but it makes a difference.",
    "Password Boss also makes it easy for business leaders to set up their teams. IT administrators can easily create accounts for all employees, making it easy to start well and make the most of the platform’s centralized administrator controls and analytics.",
    "The Password Boss apps are easy to navigate, intuitively designed, and highly responsive. In our test, synchronization across three devices (Windows, iOS, and Android) was impressive. By the time we were able to switch devices, new data and credentials had already synced.",
    "We also appreciate the app’s security interface. This panel provides easy-to-interpret information on the state of your account and detects potential vulnerabilities. Few competitors provide this information to all users.",
    "Security is absolutely essential to password management. Without a comprehensive and top-quality security framework, no password management software is worth your organization’s business.",
    "Fortunately, Password Boss has a top-notch internet security policy that ensures your data is highly secure and inaccessible to anyone but you.",
    "Core to the platform’s security policy is the zero-knowledge architecture and end-to-end 256-bit encryption. Without going into the details, this means that neither Password Boss nor anyone else can access a user’s encrypted data without their master password and unique encryption key, even when it’s in cloud storage.",
    "Another security feature that is useful for businesses is encrypted password sharing. Password Boss’s enterprise features allow IT administrators to allocate different levels of permissions. Employees can only use encrypted passwords and credentials relevant to their role and level of access. Employees can then use the relevant websites and applications, but without ever seeing an unencrypted version of the data (i.e. the password). Password sharing, therefore, provides an additional pillar of security for businesses.",
    "We like that Password Boss provides a specific support area for businesses, making it easier to find the right advice quickly. Here users and business leaders can find useful articles on data sharing, team settings, and security policies.",
    "However, the lack of online chat or phone support was disappointing and might deter businesses who want a more responsive provider for their password management solution.",
    "Password Boss offers two plans for businesses: Standard and Advanced. Both come with all the features included in the platform’s personal plans, but with a few extras specifically for businesses.",
    "Its website currently advises that you call for the latest pricing. However, previously Password Boss had the options below so you may find you get variations on this theme when you make that call.",
    "The Standard plan costs $3 user/month with a minimum of five users, which means the annual cost starts at $180 per year. This plan includes basic administrator controls, team-based sharing, and separate business and personal storage for users.",
    "The Advanced Plan costs $4 user/month (minimum of five users), meaning prices begin at $240 per year. This plan includes everything in the Standard plan, plus advanced user management and analytics, and audit logs.",
    "Medium and large-sized organizations might benefit from the more powerful administrator controls and analytics offered by some of Password Boss’s competitors.",
    "Both LastPass and RoboForm have more in-depth and advanced analytics than Password Boss and give business leaders and IT administrators greater control over users’ accounts. Although they are slightly more expensive, they may offer a more seamless experience for enterprises.",
    "Password Boss is a good password manager without being a great one. Although the platform has few weaknesses, along with strong security policies, useful features, and an affordable price tag, it doesn’t do much to stand out from the pack.",
    "However, this shouldn’t necessarily deter businesses, because simplicity can be a strength when it comes to password managers. Password Boss does exactly what it says it does and does it well. Small and medium-sized businesses simply wanting a secure and easy-to-use password manager would do well to consider this provider."
  ],
  "headers": {
    "2": "Features and utilities",
    "6": "Setup",
    "8": "Interface and performance",
    "10": "Security",
    "14": "Support",
    "16": "Plans and pricing",
    "20": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "password manager": "https://www.techradar.com/best/password-manager",
    "Password Boss": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1041958272158599400&xs=1&url=https%3A%2F%2Fwww.passwordboss.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpassword-boss",
    "collaborating": "https://www.techradar.com/best/best-online-collaboration-tools",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "backup": "https://www.techradar.com/best/best-backup-software",
    "employees": "https://www.techradar.com/best/best-hr-software",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "apps": "https://www.techradar.com/best/best-apps-for-small-business",
    "Windows": "https://www.techradar.com/news/best-windows-10-pro-laptops",
    "iOS": "https://www.techradar.com/best/ios-productivity-apps",
    "Android": "https://www.techradar.com/best/best-android-antivirus-app",
    "internet security": "https://www.techradar.com/news/best-endpoint-security-software",
    "websites": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "RoboForm": "https://www.techradar.com/reviews/roboform"
  }
}