{
  "source": "https://www.techradar.com/reviews/medical-alert-system-review",
  "title": "Medical Alert medical alert system review",
  "category": "pro",
  "updated": "2021-11-12T12:59:49Z",
  "author": "jeph-preece",
  "summary": "Find out in our Medical Alert review why this service is worth considering, despite the limited options",
  "verdict": "With an in-home landline medical alert system priced at just $22 per month, Medical Alert offers one of the most affordable options on the market with one of the faster emergency response times.",
  "pros": [
    "Affordable pricing",
    "Multilingual operators",
    "Loud speakerphone",
    "Fast response time",
    "Helpful caregiver app",
    "Eco-friendly, reused devices"
  ],
  "cons": [
    "Large mobile device",
    "Additional costs for extra services",
    "Limited options"
  ],
  "article": [
    "Medical Alert has a pretty on-the-nose brand name for a medical alert system company, but who really needs fancy marketing when you offer a quality medical alert system with an excellent emergency call center?",
    "For the majority of their service, Medical Alert is similar to other medical alert system products we’ve reviewed. They have the standard mobile GPS packages, in-home landline and in-home cellular communication features.",
    "Their packages include PERS devices that are widely used in the industry, such as the MyTrex MXD3G, which is made by Rescue Touch and features the loudest speakerphone we tested.",
    "While the basics are great, we've found Medical Alert's offerings are essentially a clone of other companies. Still, with affordable pricing, we look into why Medical Alert is an attractive medical alert system budget-friendly device.",
    "Get a free quote for a medical alert system.",
    "Best quality package",
    "Medical Alert’s best offering is their At Home cellular package, which features the MyTrex MXD3G. Made by Rescue Touch, this system has a very loud speaker, ideal for if your loved one is hard of hearing.",
    "At it’s best, the audio was both loud and clear, although occasionally it wasn't that clear. The parity in the quality of the MyTrex, and other systems, likely depends on how long the system has circulated.",
    "A minor downside to the Mytrex MXD3G is the pendant range. It's pretty short. While it’s listed to have a range of roughly 600 feet, we averaged 70 feet in our tests. Despite this small inconvenience, the consistency of the signal was excellent It works even with multiple walls and furniture in its way.",
    "When you think about it, 70 feet may seem short, but it’s actually plenty of range for most apartments and homes. If you need a mobile medical alert system, consider a medical alert smartwatch.",
    "The On-the-go medical alert system is bulky compared to other mobile medical alert systems, and the audio isn’t great. It comes with a wireless pendant, allowing you to use it like an in-home system while it’s charging in the base station.",
    "Medical Alert fall detection",
    "Medical Alert uses a teardrop shaped fall detection pendant with it’s in-home systems. While these fall detection pendants can sometimes be too sensitive, we found the Medical Alert one to be better than most at detecting falls.",
    "It’s still not perfect. And it causes more fall alerts than we’d like but it was significantly better than other fall detection sensors we tested. We love that it detects falls right away, unlike many sensors that call for help after a 30 to 60 second delay.",
    "That said, be careful with it. It does detect falls when you haven’t fallen. And if you’re away from the base station, it’s often difficult to know if it’s calling for help.",
    "In our first round of three-week testing, Medical Alert averaged roughly 78 seconds per call. This was 8 seconds slower than average, making for a very disappointing result when you consider GreatCall averaged 20 seconds per call.",
    "However, in the second round of daily three-week tests, Medical Alert averaged around 35 seconds per call. While it was still much slower than GreatCall (which averaged 15 seconds), it was far more competitive. And when every second counts, this matters.",
    "The quality of the emergency call center was good, but not exceptional. Most of the calls were excellent. The operators typically confirmed our identity and asked us multiple times throughout the call if we were okay.",
    "However, there were many calls where the operators didn’t follow the same script. Sometimes they assumed we were the person on the account (a potential security risk) and sometimes they failed to ask if we needed help.",
    "We like that Medical Alert covers your spouse for no extra cost, proving additional pendants with each in-home system. And we also love the 365Access Caregiver App that goes with the On-the-go mobile system, allowing your loved ones to track your location and get alerts if you need help.",
    "With Medical Alert you can choose from monthly, semi-annual or annual subscription packages to save money. With some categories, such as At Home, you can even choose if you want to default to cellular or landline to help you keep costs down.",
    "Medical Alert’s basic landline package is an excellent bet if you've got a budget to stick to. At $22.95 per month, it’s one of the most affordable medical alert systems that we’ve reviewed. And with an above-average call response time, it’s an excellent value, despite the aging technology.",
    "However, the cost of the other packages is less impressive.",
    "At $32.95 per month for the in-home cellular system, it’s only a little under the market average for a similar package. But by comparison, MobileHelp offers a better in-home cellular system for about $25 per month.",
    "At $37.95 a month for a mobile system, it’s a few dollars below the market average, but still significantly more expensive than GreatCall’s Lively Mobile ($25 per month).",
    "For a fall detection pendant, you'll need to factor in an additional $10 a month.",
    "Overall, Medical Alert is a fine, if pretty standard medical alert system option. In the event of an medical emergency, it'll work fast and well.",
    "We like that they use the Mytrex MXD3G for their in-home cellular system, as the audio is very loud, but you need to test it to make sure the speaker isn’t worn out. The fall detection pendant is better than most, but still needs refinement.",
    "When comparing their offering to the wider industry, their packages are simple and limited. The customer service is good, particularly if your caregiver's first language isn't English, but they also don’t seem to go out of their way to help.",
    "Medical Alert's marketing isn’t aggressive and they won’t try to sell something you don’t need, but they also lack the educational resources other services provide."
  ],
  "headers": {
    "5": "Medical alert systems",
    "15": "Medical Alert emergency response center",
    "19": "Medical Alert customer service",
    "20": "Medical Alert cost comparison",
    "26": "Medical Alert: final verdict"
  },
  "links": {
    "medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021",
    "Get a free quote for a medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021#section-get-a-quote-for-a-medical-alert-system",
    "medical alert smartwatch": "https://www.techradar.com/best/best-medical-alert-smartwatches",
    "MobileHelp": "https://www.techradar.com/reviews/mobilehelp-review",
    "GreatCall’s Lively Mobile": "https://www.techradar.com/reviews/greatcall-review"
  }
}