{
  "source": "https://www.techradar.com/reviews/creative-sxfi-carrier",
  "title": "Creative SXFI Carrier review",
  "category": "audio-visual",
  "updated": "2021-05-24T10:00:46Z",
  "author": "ted-kritsonis",
  "summary": "A Dolby Atmos soundbar with a few tricks up its sleeves",
  "verdict": "The Creative SXFI Carrier is one of the most interesting soundbars we've seen so far this year, with both Dolby Atmos and the brand's own virtual surround sound on offer. Creative wisely pairs its Carrier sound bar with a sub to deliver an audible boom that will surely reverberate throughout the room – though it could use a few more features like Wi-Fi support and AirPlay/Chromecast.",
  "pros": [
    "Dolby Atmos and SXFI surround sound",
    "Loud and clear",
    "Comes with a subwoofer",
    "Super X-FI technology with connected headphones"
  ],
  "cons": [
    "No Wi-Fi support",
    "No voice assistant built-in",
    "No AirPlay or Chromecast",
    "SXFI only works with headphones"
  ],
  "article": [
    "The Creative SXFI Carrier soundbar combines the immersive sound of Dolby Atmos audio with the unique virtual surround sound of Creative's own Super X-FI technology – with a much smaller footprint than its predecessor, the SXFi Sonic Carrier.",
    "Its small form factor is a huge advantage – not every room is ideal for a surround sound setup, nor is it something everyone wants. Not to mention that some popular sound bars don’t come with subwoofers. Creative tries to address all these points with the Carrier, and does it in a way that feels like it just works out of the box.",
    "It's also the first soundbar to support Super X-Fi technology. Previously found in amplifying headphone dongles, and more recently, the brands own holographic Creative SXFI Air headphones, the technology uses scans of your ear to create a personalized virtual surround experience, applying a 7.1 soundstage to your regular stereo audio.",
    "To that end, setup and calibration are easy, and so long as you have room for the sub, you will have a pretty heavy bass response to make a movie, show or song really deliver.",
    "It will cost about $1,000 (around £700, AU$1,300) to get your hands on it, which is pretty competitively-priced when you compare it to other Dolby Atmos speakers, but it’s just unfortunate that it’s not a connected speaker to offer features like AirPlay 2 and Chromecast as other content delivery options. That’s where you may need to pay more to get more of the connected experience you may be seeking.",
    "The Creative SXFI Carrier launches on May 24 in the US, and will cost $1,000. Based on current conversion rates, that works out to be around £700, AU$1,300, though we're still waiting on official release dates for the UK and Australia.",
    "With a subwoofer included, this is an attractive price for a Dolby Atmos soundbar – and with SXFI technology included, it sits apart from competitors like the recently announced JBL 9.1 Bar. Of course, there will be some cheaper Dolby Atmos options out later this year like the recently announced $400 LG SPD7Y, but if you're looking for a high-powered 'bar, Creative has you covered.",
    "The SXFI Carrier is a two-piece kit that links the soundbar with the included subwoofer. It’s very much a marriage because the two need each other to function properly and produce the advertised sound.",
    "The soundbar measures 34.6-inches wide, 3-inches high and 5-inches deep, while the sub is of considerable size at 17.7-inches high, 16.9-inches deep and 8.9-inches wide. It also weighs 28 pounds, so has some heft to it on top of all that.",
    "The soundbar has brackets to mount it to the wall, should you want to go that route, but its length is short enough to fit on just about any entertainment console you have in front of your TV.",
    "As is often the case with Creative, it tries to be generous with the ports. There are three HDMI 2.1 ports (two inputs, one output) with support for eARC on one as we;; as Toslink optical, 3.5mm Aux-In, plus another to connect with the sub. A USB-C port allows for audio input if you’re plugging in a device without a headphone jack.",
    "The USB-A port is useful if you’re plugging in wireless headphones, like those Creative also makes, and Creative even threw in a 3.5mm headphone jack at the front of the sound bar.",
    "This is a Dolby Atmos system, and under the hood, it has a lot going on. Seven dynamic drivers are powered by DSP amplifiers, producing output on par with Creative’s previous SXFI Sonic Carrier – a sound bar that was double the size and several times the cost. The sub has a 10-inch driver powering the bass coming out of it.",
    "On the top of the soundbar you'll find power, volume, and source buttons, as well as a button to turn on the SXFI audio processing.",
    "The upward-firing speakers are evident just looking at the bar, and those play a crucial role in delivering that Atmos effect. As do those firing out the sides, along with the three facing forward for left, right and center channels. While not the prettiest sound bar available, there’s an impressive set of specs under the hood, and it shows once the sound takes off.",
    "The Carrier’s own remote is pretty detailed, though we didn’t have to reach for it as much as we thought because the app covered so much of the same ground. There are dedicated buttons for all the inputs, plus special ones to adjust the bass from the sub, and six presets at the bottom two rows.",
    "Those presets may come in handy, especially if you really like to calibrate what you’re doing. For example, we were able to set a preset that switched the Carrier to Movie mode with output going to the headphones, and Super X-Fi turned on. In another, we set it to Music mode and Aux for the output anytime we wanted to listen to tunes. While an extra step, especially when it comes to switching from movies to music, the presets do streamline the process completely.",
    "Creative wisely consolidated its mobile app situation to make things simpler. The newer Creative app for iOS and Android works with the Carrier, and is all you need to set everything up. Sticking with the theme, the easiest way to hook this up to the TV is to connect an HDMI cable from the bar’s eARC port to the TV’s same port. It keeps everything seamless because you won’t have to worry about audio from your game console, streaming box, Blu-ray player or any other cable box coming from the sound bar.",
    "Plugging things in that way is the best way to ensure Dolby Atmos works by default. You can always double-check that in your TV’s audio settings, but it should work without issue. The Carrier does come with its own remote, though you can also use the app to control the same features. The eARC connection also gives passthrough control so you can use your TV remote to adjust volume, for instance.",
    "Unfortunately, Creative didn’t make this a connected sound bar. There’s no Wi-Fi or Ethernet port, so your only recourse to enable that is to use a third-party device. We plugged in an Amazon Echo Input to the rear headphone jack and successfully made it a smart speaker. We could play music by voice and ask Alexa anything we wanted while the speaker was on. The only caveat was that it needed to be in Aux mode to actually be audible. For instance, when watching TV, it wouldn’t raise the volume when we asked it to because it was in TV mode at that time.",
    "This is less of an issue if your TV already offers voice assistant access. Or if your streaming box does. In those cases, it won’t matter as much if you can’t control the Carrier that way. The one advantage of an Echo Input is you can play music with the TV powered off.",
    "About the sub: you do have the option to hook it up to the sound bar with a cable, but you don’t need to, since wireless works just fine out of the box. The two pieces pair up once you power them up. We had a few audible hiccups initially come up after that, but those disappeared right after we received a firmware update to install.",
    "It became obvious to us from the start just how symbiotic the sound bar and sub truly are here. Creative designed the bar itself to offer little to no low end, so it focuses on the highs and mids, while the sub handles all the bass. That explains why it’s as big as it is, and the combination serves its purpose because these two can really go. The rumble coming from the bass response is enough to shake up a small room.",
    "Dolby Atmos also works well to make that effect feel resounding, as the upward-firing speakers bounce off the ceiling to spread things out. Despite Creative’s best efforts, there’s no way to emulate a proper 5.1 or 7.1 surround sound setup, but that’s not to say you won’t feel immersed in it. We felt it was vibrant, clear and enveloping when the content we watched really brought out the best in it. It’s an impressive mix that we came to enjoy more and more as time went on.",
    "Not everything necessarily fired the right way, though. We were never really enamored with Superwide mode. Its name suggested a more expansive soundstage, but when we asked Creative, they told us that it works best with content originally recorded in stereo with broad dynamic range. That could be jazz or classical music, for instance. Superwide is supposed to enhance the stereo separation, though your mileage may vary, depending on what you try listening to with it on.",
    "We should also note that Creative’s excellent Super X-Fi technology is part of this, and works well when you have the right headphones. Technically, you can plug in any pair of cans into one of the Aux ports, though the best option is to use Creative’s own SXFI Theater headphones. Those are wireless, and use a USB transmitter, which fits perfectly with the Carrier’s USB-A port.",
    "It’s nice to have Bluetooth connectivity, and we particularly liked it for playing music from YouTube, except we do wish Creative put in more effort to support other codecs. The Carrier only supports the standard SBC, so there’s no AAC or aptX onboard here. Granted, it is more a TV speaker than one for music, but at a higher price point, details like that do matter.",
    "We can’t overstate how much the sub factored in, no matter what we listened to. It often felt like a car rumbling to life, and the louder we went, the more it seemed like a muscle car. Whether it’s a living room or basement, the sound will cover a fair amount of space."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Price and availability",
    "7": "Design",
    "17": "Setup",
    "22": "Audio performance",
    "28": "Don't buy it if..."
  },
  "links": {
    "SXFi Sonic Carrier": "https://www.techradar.com/reviews/creative-x-fi-sonic-carrier",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Creative SXFI Air headphones": "https://www.techradar.com/reviews/creative-sxfi-air-headphones-review",
    "Dolby Atmos soundbar": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "JBL 9.1 Bar": "https://www.techradar.com/reviews/jbl-bar-91",
    "LG SPD7Y": "https://www.techradar.com/news/lg-is-making-a-dollar399-dolby-atmos-soundbar-with-hi-res-audio-upscaling",
    "SXFI Theater headphones": "https://www.techradar.com/reviews/creative-sxfi-theater"
  }
}