{
  "source": "https://www.techradar.com/reviews/akaso-v50-pro",
  "title": "Akaso V50 Pro review",
  "category": "cameras",
  "updated": "2021-02-08T15:22:30Z",
  "author": "jamie-carter",
  "summary": "A quirky, budget-friendly action cam that covers the basics",
  "verdict": "With a reliable 4k/30fps mode that’s both detailed and smooth, a large touchscreen and a pile of accessories, this entry-level action camera impresses despite a few quirks and limitations.",
  "pros": [
    "2-inch touchscreen",
    "Lots of accessories",
    "Wrist remote",
    "The price"
  ],
  "cons": [
    "Mini USB port",
    "Touchscreen can be laggy",
    "App crashes",
    "No live-streaming"
  ],
  "article": [
    "Among the many contenders for the title of best cheap action camera are some strong options from US-based manufacturer Akaso – we've reviewed the Akaso V50X, and this special version of the V50 Pro is another option with a different sensor and an equally compelling specs sheet.",
    "Initially launched in 2019, the Akaso V50 Pro (US$119.99/UK£119.99, around AUS$156) has recently been refreshed and upgraded – slightly – as the Akaso V50 Pro ‘The Endless Summer’ Special Edition (US$139.99, equal to UK£102/AUS$182), principally for the US market.",
    "It’s the latter we have on test here, which sports a slightly higher resolution 20MP sensor than the original version, which topped out at 12MP. That aside, the two models are identical, which means you get another generous helping of accessories in the box. But how does the V50 Pro's 'The Endless Summer' edition perform in reality?",
    "The Akaso V50 Pro is not a complex camera, and nor does it look like one. Measuring 60x41x32 mm and weighing 64g, it sports a reasonably industrial design around its 170-degree wide-angle lens. It’s functional, too; as well as a tactile silicone chassis that doesn’t collect fingerprints, there’s a large 2-inch touchscreen.",
    "There’s also a 1/4-inch tripod thread on the bottom, which will be hugely appreciated by photographers and anyone else who is constantly confused by the absence of one on pricier GoPros like the GoPro Hero 9 Black.",
    "However, there is something on the Akaso V50 Pro that did leave us completely confused; a Mini USB slot. There to recharge its 1,100mAh battery – two of which are included in the box – we haven’t seen a Mini USB cable for about five years.",
    "It’s baffling, but it doesn’t make much practical difference. In close proximity on the camera’s side is a mini HDMI for sending video to a TV, and a microSD card slot.",
    "Now Akaso plays its trump card. An action camera that tops-out at 4K/30fps may not make it cutting edge, but its sheers weight of accessories will make it hugely attractive.",
    "It’s a major haul. The standouts in the box are a very handy wrist remote, two batteries, a battery charger, a waterproof case (good to a depth of 100ft/30m) and a mounting frame.",
    "Then comes a flurry of mounts and mounting screws for bikes and helmets, various sticky fixes, zip ties, Velcro strips and a cleaning cloth. Luckily there’s a Mini USB cable in the box, too. What can you do with the Akaso V50 Pro? Perhaps the easier question to answer is 'what can’t you do with it'?",
    "Well, operate it quickly, that’s what. Although the large 2-inch, 320x240 pixel resolution IPS LCD screen on the rear of the Akaso V50 Pro is one of its highlights, it’s not quite as responsive as it should be.",
    "Double or triple presses are often required, while the onscreen menus themselves take a little getting to know. However, it’s simple to get the Akaso V50 Pro into the mode you want, and set the resolution (which includes 4K/30fps, 2.7K/30fps, 1080p/60fps, 1080p/30fps, 720p/120fps and 720p/60fps). Besides, the free Akaso app also lets you set it up remotely when a phone is connected to the camera’s Wi-Fi network.",
    "That app can be irritating. Though it generally works well and is the easiest way to tweak the camera’s settings, it is prone to crashing when transferring photos and videos to a phone. It’s faster to hook it up to a PC or Mac to transfer files. While it’s there the Akaso V50 Pro can also work as a webcam for a PC, which might please those who are after a webcam for remote working.",
    "For video the Akaso V50 Pro peaks at 4K/30fps, though the MOV files it produces boasts basic electronic image stabilization (EIS) tech that helps create a highly watchable video. It’s best to have it on, though the EIS works better as you drop down to 2.7K/30fps and 1080p/60fps.",
    "There’s also a 720p/120fps slo-mo option as well as those for time-lapse video, fast motion movies (in steps from 2x to 15x) and a scene mode that can be set for riding, winter and night. Another feature we liked is one that limits the length of files to one, three or five minutes, which is handy if you just want to grab a snippet of action and don’t want to have to switch off the camera mid-ride. The accessories do pretty well, with the wrist remote especially impressive.",
    "The Akaso V50 Pro also does reasonably well with photography. There are no options to zoom, so you’re stuck with that 170-degree wide-angle shot, but the results are plenty detailed and colorful enough without ever being noisy.",
    "There are also plenty of options, from dipping below that 20MP resolution to capturing time-lapses, photo bursts, long exposures, delay timers and experimenting with various preset modes (including portrait, landscape, indoor, outdoor and night).",
    "For both photos and videos you can also dive into the settings and tweak the AE meter and add a variety of filters (from vivid, natural and negative to warm, cold, red, green, and blue). That’s a lot of play with for such a budget-orientated action camera, though it’s the satisfactory results from its 4K/30fps video mode that makes this capable camera worth considering for the price."
  ],
  "headers": {
    "18": "Don't buy it if..."
  },
  "links": {
    "best cheap action camera": "https://www.techradar.com/best/best-cheap-action-camera",
    "GoPro Hero 9 Black": "https://www.techradar.com/reviews/gopro-hero-9-black"
  }
}