{
  "source": "https://www.techradar.com/reviews/irobot-roomba-i3-plus",
  "title": "iRobot Roomba i3 Plus review",
  "category": "appliances",
  "updated": "2021-12-06T11:00:00Z",
  "author": "helen-mccue",
  "summary": "Hands-off vacuuming but it comes at a price",
  "verdict": "The iRobot Roomba i3 Plus is a robot vacuum that takes care of itself – almost. It automatically empties dirt from the vacuum into bags in the charging dock. It’ll take itself to the charger when the battery runs low and you can schedule cleaning for set times, so there’s very little you’ll need to do from week to week. But it’s expensive, the charging dock is bulky and you’re committed to paying for expensive bags regularly.",
  "pros": [
    "Automatic dirt emptying",
    "Scheduled cleaning",
    "Bags keep dust, pollen and mold contained"
  ],
  "cons": [
    "Only one suction level",
    "Dust bags are expensive",
    "Dirt emptying is loud"
  ],
  "article": [
    "iRobot is a US-based robotics company that was founded in 1990 and launched the first Roomba robot vacuum in 2002. It’s one of the biggest manufacturers of robot vacuums and since launching has sold more than 30 million home robots worldwide. It utilizes 20 years of robot vacuum knowledge to create some of the best robot vacuums on the market.",
    "The iRobot Roomba i3 Plus sits in the middle of the iRobot range, it’s neither the most nor the least expensive model available. We reviewed the iRobot Roomba i3 Plus which builds on the i3 with the addition of an automatic emptying function at a significantly higher price.",
    "The Roomba i3 Plus offers most of the features you’d expect from a robot vacuum including an accompanying app that allows you to create cleaning schedules and adjust settings. Unfortunately, it doesn’t support iRobot’s Smart Map technology, so it can’t remember maps of your home which means there’s no option to select individual rooms or zones to clean. Instead, to create no-go zones, you’ll need to purchase what iRobot dubs virtual barriers. These 5.5-inch / 14cm blocks sit in your home and create, well, virtual barriers to areas you don’t want cleaner.",
    "The self-emptying ability is the big selling feature of the i3 Plus and it means there’s very little need to interact with the vacuum unless the dust bag needs replacing or the filter requires a clean, making it the ideal choice if you want to forget about the vacuuming completely. Automatic dirt disposal utilizes the charging dock to store a dust bag, this means that not only are you committed to buying replacement bags on a regular basis but also that the dock itself is much bulkier than a standard charging base.",
    "In terms of performance, pick up is good and for the most part, it does clean in a logical pattern, but it’s not uncommon for it to miss spots, so it works best when used regularly. The higher price seems a lot to pay just to avoid emptying the dust container regularly. But that said, the bags use four layers of allergen blocking material to trap 99% of pollen and mold so it’s ideal if you’ve got allergies.",
    "The iRobot Roomba i3 Plus is priced at $599.99/ £699.99/ AU$1399 and is available worldwide from the iRobot website, or from online retailers including Amazon. This model is particularly pricey thanks to the self-emptying feature.",
    "The iRobot Roomba i3 doesn’t come with the self-emptying station and is more affordable, costing $399.99/ £449.99/ AU$999.",
    "The self-emptying feature requires dust bags which come in packs of three and are priced at $19.99/ £21.95/ AU$59 per pack. However, iRobot says the dust bag holds around 60 days' worth of debris. The virtual wall barriers, which allow you to create no-go zones for the vacuum, are priced at $99.99/ £69.99/ AU$125 for two.",
    "The Roomba iRobot i3 Plus is a pretty standard size for a robot vacuum, measuring 3.6 x 13.3 x 13.3 inches/ 9.2 x 33.7 x 33.7cm (h x w x d). The height is low enough to fit under most low pieces of furniture without too much trouble. The charging dock however is another matter, it’s one of the bulkier docks we’ve seen and the tall height means you can’t tuck it under a piece of furniture to hide it out of sight. It measures 19 x 12.2 x 15.4 inches/ 48.3 x 31 x 39cm (h x w x d).",
    "There are just three simple buttons on the top of the vacuum, the large central ‘clean’ button is used to start, pause, or resume cleaning when not using the app. There’s an LED that surrounds the button, which will illuminate red if there is an issue. Pressing the button prompts the robot to tell you what’s wrong.",
    "There’s a home button to send the vacuum back to the charging base, this can also be used to activate the dirt disposal process if the vacuum was manually placed onto the charger. Finally, the spot clean button tells the vacuum to spiral out from its current position to spot clean a specific area, it spirals out 3 feet/ 1 meter and then spirals back to where it started. Turn the vacuum over and you’ll find a rotating brush that sweeps debris from the edges of the room into the path of the dual multi-surface rubber brushes.",
    "All other functions are available via the app, which allows you to schedule cleaning for regular days and times. You can also adjust how many times the vacuum passes over the floor which is useful in the absence of adjustable suction levels.",
    "The vacuum is designed to navigate rooms purposefully in straight lines so that it cleans logically rather than randomly. At the end of cleaning it heads back to the dock and the automatic dirt disposal process removes the dirt collected in the vacuum and stores it in a bag inside the charging dock.",
    "The bag should last for up to 60 days of cleaning. When it’s time to change the bag out for a new one, just flip up the lid on top of the canister and remove the bag, it’ll self-seal to avoid creating any mess or dust clouds as it’s removed. Two bags and a replacement filter are provided in the box, the filter needs to be cleaned weekly and replaced every 2 months.",
    "The Roomba i3 Plus has a limited number of settings so it’s easy to use. Overall pickup is good, but as with most robot vacuums, it can miss some larger debris such as oats when on hard floors, because the rotating brush occasionally flicks them across the floor instead of into the path of the vacuum. We also noticed that it didn’t collect all the debris from the corners of a room. Having said that though, it picked up the majority of the dirt and debris in its path and a quick check of the dust container showed it was collecting a lot of dust and fluff from carpets.",
    "When we sprinkled flour over different parts of the floor it collected the majority of it. However, in some areas, it did leave flour in the grooves between the planks of wood flooring. When this happened we used the spot clean mode for a more thorough clean, but it didn’t remove all of the flour from the grooves.",
    "It navigated both carpet and hard floors with ease and even managed to clean our long pile rug without getting stuck, it also successfully avoided falling down the stairs. The vacuum is designed with Reactive Sensor Technology which iRobot says helps it avoid getting stuck in places and despite having to navigate around several dining chairs as well as stools in our Kitchen, it managed not to get stuck.",
    "During cleaning, our decibel meter registered a maximum of 68db, which is equivalent to sound experienced by background chatter in an office, which is acceptable. However the dirt emptying process is loud, it registered 84dB on our noise meter which is similar to a truck traveling down the road at 40mph. Thankfully the process only takes an average of 11 seconds. The dirt bags are easy to access and replace, and we like that they seal to avoid mess and dust clouds when removing.",
    "While you don’t need to worry about emptying the dirt canister, the filter does require regular maintenance. To remove dust and ensure it’s not clogged it has to be removed and tapped into your trash on a weekly basis, it’s a quick process but one you should factor in if you’re looking for a completely hands-off experience. It’s also worth noting that it does create a bit of dust cloud so if you’ve got allergies it’s best to do this outside.",
    "It effectively collected hair from carpets, which thankfully didn’t get tangled in the rubber brushes, but after one cleaning session on carpet, there was hair tangled around the rotating side brush.",
    "When using the ‘clean everywhere’ option in the app, we experienced very hit-and-miss results. On some occasions, it did clean everywhere but on others, it missed large areas or even whole rooms. We had more success when using it in the timed mode, we used this mode but set it so that there was no time limit and it generally vacuumed everywhere, then returned to the charger when finished.",
    "The initial set-up was straightforward, and we didn’t have any issues connecting the Roomba to the app. It’s a simple app that’s easy to navigate and while it offers some useful options to customize cleaning, it’s limited in the number of functions available. Scheduled cleaning is very easy to set up for specific times and days, or you can ask it to perform a clean every time you leave the house.",
    "The app allows you to select whether the vacuum performs a daily clean, where it covers the space once, or extra clean which will direct it to cover the space twice. The third option is room-size clean, in this setting it will cover larger spaces once and small-to-medium-sized rooms two to three times. Spot clean can’t be selected via the app and it’s not possible to create boundaries or no-go zones using the app either.",
    "There aren’t too many other features in the app, other than checking history and amending some of the dirt emptying settings. It does also integrate with Google Home and Alexa for voice-activated vacuuming.",
    "The iRobot i3 Plus will pause cleaning and return to the charging dock if the battery runs low during vacuuming, it’ll then resume cleaning where it left off. So there’s really no need to worry about battery life so long as it can get back to the charging dock.",
    "When we did allow it to clean until the battery ran out, it lasted for around 1 hour 20 minutes, the battery then took just under two hours to fully recharge. The battery level is indicated in the app, which shows a battery graphic colored in green to indicate the level of charge.",
    "First reviewed: December 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "iRobot Roomba i3 Plus price and availability",
    "8": "Design",
    "14": "Performance",
    "21": "App",
    "24": "Battery life",
    "26": "Don't buy it if.."
  },
  "links": {
    "robot vacuum": "https://www.techradar.com/news/best-robot-vacuums"
  }
}