{
  "source": "https://www.techradar.com/reviews/chromecast-ultra",
  "title": "Chromecast Ultra review",
  "category": "audio-visual",
  "updated": "2021-12-02T14:43:26Z",
  "author": "nick-pino",
  "summary": "The Google Chromecast makes the jump from 1080p to 4K HDR",
  "verdict": "There's (almost) no refuting it: Chromecast Ultra offers one of the best value-for-money streaming video devices for 4K TV owners. There's not as much benefit for the 1080p crowd, but if you’re looking for powerful, fast streaming in a device the size of a wafer for your brand-new UHD TV, there’s no better place to find it than with the Chromecast Ultra.",
  "pros": [
    "Cheap, effective 4K and HDR streaming",
    "Built-in Ethernet adapter",
    "Google Home integration"
  ],
  "cons": [
    "No native Amazon Video support",
    "No remote control",
    "It'd be easier to navigate with an interface"
  ],
  "article": [
    "The Chromecast Ultra was Google's initial drive for the 4K HDR crowd: a wafer-sized streaming device that can receive 4K HDR signal from any mobile device currently on your network. It's similar to Google's previous streaming dongles in being a small device with big potential, so what makes this Chromecast so special?",
    "The Chromecast Ultra earns that extra label not only because it added 4K playback and HDR video for the first time – it also boasts an Ethernet port and improved internal components, so videos load faster and are less susceptible to lag. Those features help the Chromecast Ultra feel more premium than its predecessors, without offering a major departure in terms of form factor or available content.",
    "The key feature that continues to makes the Chromecast Ultra (and future Chromecast-equipped devices) so popular is simply their ability to 'cast' content – to take a link sent from your phone, tablet, laptop, or smart speaker and load it up on your TV.",
    "You can simply cast YouTube videos or Spotify playlists, or you can go further with security cam feeds and games, and connect the Chromecast Ultra up to Google Home and Google Assistant (so you can get photos, weather and so on displayed).",
    "We'd say the Chromecast Ultra is well deserving of its \"ultra\" status, but first we're going to talk about two shortcomings: the lack of a remote, and the lack of a standard user interface.",
    "Not having a place on the TV to find fresh videos can frustrate those used to flipping through television stations, and if you're new to casting it can be confusing to get to grips with the interplay of phone, laptop or tablet and the TV.",
    "That makes the Chromecast Ultra more suitable for tech-savvy people comfortable controlling the big screen with a smaller phone or tablet – who don't necessarily need that big user interface to surface content. Buying it as a gift for someone who doesn't know their Google Cast from their Bluetooth might not go down so well.",
    "Now that we’ve got that out of the way, let’s dive into what makes the latest Chromecast Ultra the best one yet for 4K HDR owners.",
    "The Chromecast Ultra doesn't change too much design-wise from its immediate predecessor – it's more or less the same puck-like shape as the previous Chromecast. That’s a very good thing: the previous one remains one the sleekest, most beautifully minimal streaming devices on the planet.",
    "An HDMI cable juts out of one end of the disc while the other hosts a microUSB port that needs to be connected to a wall outlet via the included adapter - unlike the original Chromecast, the Ultra can't be powered by a USB port on your TV.",
    "From sight alone though, you'd be hard pressed to pick out the differences between the 2nd-gen Chromecast and the Chromecast Ultra.",
    "Circumference-wise, the Ultra is just a hair bigger than the much older 2015 Chromecast – it's 2.29 inches (58 mm) now rather than 2.05 inches (52 mm). That's not a big difference, and the Ultra still hides behind the TV with relative ease.",
    "One minor tweak is that the Chromecast Ultra only comes in a single color, black, unlike the standard Chromecast which you can get in fun hues like coral and lemonade.",
    "Admittedly, few will likely mourn the passing of these color options – the dongle is hiding behind the TV after all – but was nice to have the choice.",
    "Another alteration Google's designers made with the Chromecast Ultra was to introduce an Ethernet port to the charging cable that plugs into the wall. If you've got a router close enough, that'll enable faster, more consistent streams over a wired connection (though 4K is still possible with Wi-Fi).",
    "Finally – and now we're really down to the details – instead of an engraved Chrome logo on the top face, you'll find a simple G. Google obviously wants to bring the Chromecast more in line with other products like the Google Home, and play down the link with the Chrome browser.",
    "Beyond those four alterations, everything else is exactly how you remember on the Chromecast Ultra. There's the coiled 802.11ac (2.4 GHz/5 GHz) Wi-Fi antenna tucked inside the casing for high-performance streaming, and the reset button along the outer rim for restarting the system should it start acting up.",
    "Once you run the included five-foot power cable into a wall outlet with the bundled adapter (and optionally plug in the Ethernet cable), it's time to run through the new Chromecast Ultra's quick and easy setup process.",
    "The process takes all of five minutes, most of which are spent downloading the Google Home app from either the Google Play Store or iOS App Store and giving the Ultra a minute to download the latest firmware.",
    "You'll be asked to connect the Chromecast Ultra to your home wireless network (unless you're using a wired connection, of course) and finally you'll be met with a brief settings screen. You're up and running.",
    "When you're not actively streaming something to the Chromecast Ultra, it enters a screensaver mode displaying images from Google Photos, Facebook, Flickr, curated artwork, the weather and even headlines from top news sources.",
    "Unlike the Amazon Fire TV Stick or Roku Streaming Stick, there’s no central hub for apps that you can browse on the TV itself. The Chromecast Ultra is either taking content from your phone, tablet or PC, or simply displaying pretty pictures until it’s told to do otherwise.",
    "That said, the Google Home app serves as the main spot for checking out what content is available to stream, and which apps you already have installed that work with your new streaming dongle."
  ],
  "headers": {
    "8": "Chromecast Ultra: design",
    "17": "Chromecast Ultra: interface"
  },
  "links": {
    "Google Home": "https://www.techradar.com/reviews/google-home",
    "the previous Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Roku Streaming Stick": "https://www.techradar.com/reviews/audio-visual/av-accessories/roku-streaming-stick-2016-1232196/review"
  }
}