{
  "source": "https://www.techradar.com/reviews/nikon-z9",
  "title": "Hands on: Nikon Z9 review",
  "category": "cameras",
  "updated": "2021-11-02T11:37:33Z",
  "author": "mark-wilson",
  "summary": "Nikon takes a leap forward with its most powerful camera ever",
  "verdict": "The Nikon Z9 sees Nikon's mirrorless cameras take an impressive jump forward to match flagship rivals from Canon and Sony. The Z9 feels like an indestructible DSLR, but inside are innovative features like advanced AF tracking, 20fps raw burst shooting, 8K video and an electronic-only shutter. We also like its new two-way tilting screen. It's a shame some video features won't be available until a firmware update in 2022 and we need to give the Z9 some real-world testing, but it has the potential to be a modern-day Nikon classic.",
  "pros": [
    "Stacked 45.7MP sensor",
    "Powerful AF tracking",
    "Shoots lengthy 8K video clips",
    "Rugged build quality",
    "Dual-axis tilt-screen"
  ],
  "cons": [
    "Some features need firmware update",
    "A bit bulky for non-pros"
  ],
  "article": [
    "The Nikon Z9 is the landmark mirrorless Nikon camera that professional wildlife and sports photographers have been waiting for. A full-frame flagship that takes the baton from the Nikon D6 – and marks the end of pro Nikon DSLRs – the Z9 sees Nikon's mirrorless tech take a big leap forward and match the advances made by Canon and Sony.",
    "Significantly, the Nikon Z9 is the first professional camera to arrive without a mechanical shutter. That's right, there's no physical curtain moving up-and-down in front of the sensor when you take a shot.",
    "This means the Z9 relies completely on its electronic shutter, a bold statement of intent that shows Nikon's confidence in its new stacked 45.7MP full-frame CMOS sensor and Expeed 7 processor. Together, these two things deliver what Nikon claims is the \"world's fastest sensor scan rate\", which has repercussions for both video and stills.",
    "The result is an incredibly powerful hybrid camera that sits somewhere in between the Canon EOS R3 (which has a 24.1MP BSI stacked CMOS sensor) and the Sony A1 (a 50.1MP full-frame powerhouse). The Z9's DSLR styling will be comfortably familiar to those upgrading from the likes of the Nikon D5 or Nikon D850, but hidden inside are some truly modern features including Nikon's best ever autofocus system.",
    "With the ability to shoot 8K/30p video (and an 8K/60p mode en route), the Nikon Z9 also joins a select group of mirrorless cameras that are capable of recording in that lofty resolution. Filmmakers also get features like Eye AF tracking when shooting, which means the Z9 is a far superior video tool to the likes of the Nikon D6.",
    "But what is the Nikon Z9 like in the flesh and is it really the equal of Canon and Sony when it comes to pro mirrorless tech? We had a short play with one at London's Sky Garden to find out.",
    "The Nikon Z9 will be available to buy for $5,499 / £5,299 / AU$8,999 when sales start in December.",
    "This price is a little lower than expected, particularly as the Nikon Z9 is way more advanced than the Nikon D6 – a camera that cost US $6,496 / £6,299 / AU $10,378 at launch (body only) when it arrived last year.",
    "It's also a pretty aggressive price compared to its closest rivals. The Canon EOS R3 recently arrived for a body-only price $5,999 / £5,879 / AU$8,599, while the Sony A1 remains way out in front with its $6,500 / £6,499 / AU$10,499 price tag.",
    "The Nikon Z9 isn't a cheap camera, of course, costing more than some medium format cameras. But that price tag could tempt some owners of older DSLRs like the Nikon D850 and Nikon D810 that now is a good time to upgrade.",
    "Like the Canon EOS R3, the Nikon Z9 is a traditional-looking mirrorless camera that's designed to appeal to those making the switch from a DSLR.",
    "In the hand, it feels like a flagship Nikon camera should – rock-solid and ergonomically refined. It's an old-school design, but the Z9's body is 20% smaller than the beefy Nikon D6, and the deep, comfortable grip is ideal for both horizontal and vertical shooting. In the spirit of bulldozers like the Nikon F4 from the 1980s, it's also built like a tank, with a magnesium alloy body that's fully weather-sealed. Only the Canon EOS R3 can claim to offer this kind of ruggedness in the mirrorless world.",
    "Also coming from Nikon's DSLRs is an AF mode button for quickly switching between manual and autofocus. And round the back is a handy feature that we enjoyed during our short play – a dual-axis monitor that tilts 90-degrees in both horizontal and vertical directions.",
    "We've seen something similar before on cameras like the Fujifilm X-T3 and Panasonic S1H, and the Nikon Z9's monitor doesn't flip around to face the front like the latter's display. But given the Z9 is predominantly for photographers, this is likely fine for most buyers – and the ability to see what you're shooting from low angles in portrait or landscape orientations is a real bonus. Particularly for the pros who are increasingly being asked to deliver stills and video in portrait format to suit phones and tablets.",
    "The Nikon Z9's info display also handily rotates when you turn it into portrait mode, which helps you avoid craning your neck. And the i-menu seen on the Nikon Z6 II and Z7 II also returns here, giving you quick one-button access to 12 customizable functions like ISO, white balance and flipping between raw and JPEG.",
    "One of the main sticking points for DSLR users who've been considering switching to mirrorless is the electronic viewfinder. As if to confirm that it's killing off the DSLR, Nikon claims the Z9's EVF has absolutely no lag or blackout, giving you a continuous real-time view that's akin to an optical viewfinder. This EVF is also a super-bright, 3,000-nit panel that certainly looked crisp and clear in our brief time with it.",
    "One of the downsides of the Nikon Z9 lacking a mechanical shutter is that its sensor no longer has that built-in protection from dust. So Nikon has added a new sensor shield, which drops down when you remove the lens. Like the Nikon D6, the Z9's rear buttons are also illuminated to help you find them in the dark, although this can be turned off if you're looking to remain a little more inconspicuous.",
    "The crucial areas of autofocus and burst shooting are ones that need lots of real-world testing. But on paper, the Nikon Z9 has jumped forward in both areas to sit at the mirrorless top table occupied by the Canon EOS R3 and Sony A1.",
    "While cameras like the Nikon Z6 II offer good autofocus, they've always lacked the sophistication of rivals when it comes to tracking faces, eyes and animals. Well, the Nikon Z9 catches up here – not only does it track people (including faces, eyes, heads and upper bodies), animals (bodies, eyes and heads) and vehicles (cars, motorbikes, planes and trains), it claims to offer class-leading simultaneous subject recognition.",
    "This means the Nikon Z9 can recognize up to ten different types of subject in a single frame and track them all individually. We'll need to test this in the field to see if it lives up to those claims, but this could be a useful tool for pros shooting busy scenes with mixed subjects.",
    "In terms of autofocusing power, the Nikon Z9 is a big leap forward from the Nikon Z7 II, offering five times as many auto-area AF points as that camera – these are the AF points that can automatically detect a subject in the frame and acquire focus. And Nikon says that it offers better subject-tracking across the frame than the previous flagship Nikon D6. Again, we'll need to do some real-world tests to confirm this.",
    "But how about that other crucial spec for sports and wildlife shooters, burst shooting? Here the Nikon Z9 is impressive, even if it doesn't quite hit the headline top speeds of the Canon EOS R3 and Sony A1. The latter can both hit an impressive 30fps when shooting raw photos, though this is in very specific circumstances (using a CFexpress card with particular lenses in good conditions).",
    "The Nikon Z9, meanwhile, can shoot full-resolution raw at 20fps, and Nikon's big claim is that you can do this for over 1,000 frames. Again, this is when using ProGrade Digital Cobalt CFexpress cards, but the promise of a near-limitless buffer when shooting at those speeds will light up the eyes of sports, news and wildlife snappers.",
    "If that's not quite fast enough, the Z9 does also offer a cropped burst mode that can hit 120fps. Given this only shoots 11MP JPEGs, it's likely to be a slightly niche, emergency mode for pro photographers – though the fact that it can do this with full AF/AE tracking is impressive. In other words, these aren't just video frames. Nikon also says that, when you factor in its FTZ adapter for mounting older F-mount lenses, this mode is available for over 100 lenses.",
    "Nikon's decision to remove the mechanical shutter from the Z9 is a bold one. In most cameras, the mechanical shutter is a backup option offering slower burst-shooting rates for those who are concerned about the traditional drawbacks of electronic shutters, namely rolling shutter. This is caused by the read-out speeds of a sensor being unable to keep pace with the movement of a scene, resulting in effects like warped golf clubs.",
    "Nikon says the Z9's new stacked sensor has the world's fastest sensor scan rates, which means its electronic-only shutter keeps even fast-moving lines straight. But the slightly concerning caveat is that Nikon claims the Z9 only \"virtually does away with rolling-shutter distortion\", which means it's still possible in some situations. What those are we'll have to discover during testing, but pro photographers will hope that's only in very rare circumstances or when shooting video.",
    "The Nikon Z9's stacked 45.7 MP full-frame CMOS sensor effectively makes it a super-powered version of the Nikon Z7 II, which also offers a 45.7MP resolution but without the stacked chip for speedy read-out speeds.",
    "This resolution gives you significantly more cropping potential than the 24MP Canon EOS R3. The drawback is slightly slower maximum burst speeds than the EOS R3 or EOS R5, which can hit 30fps when shooting raw photos.",
    "Still, the Z9 does join the select few mirrorless cameras that can shoot 8K video. According to Nikon, it can 8K/30p video continuously for up to 125 minutes, which somewhat puts the smaller Canon EOS R5's overheating limitations to shame. The slight downside, though, is that some of the Z9's more exotic video modes are only going to be available via a firmware update sometime in 2022.",
    "The modes unavailable at launch including the ability to shoot in the 10-bit ProRes 422 HQ format internally, along with 12-bit in-camera ProRes Raw HQ recording. Impressively, that firmware update will also allow the Nikon Z9 to shoot raw 8K/60p video internally.",
    "This would be a first for a mirrorless camera, although it's not clear exactly when the firmware update will arrive next year, or how long you'll be able to record for in that 8K/60p mode. Still, for now you can shoot 8K in 24/30p and get full Eye-detection AF support in all video modes. The Z9 also shoots 4K using the full width of its sensor, and includes a 4K/120p mode for slow-mo scenes.",
    "Naturally, you'll need a big, speedy card to deal with all this data, so the Nikon Z9 has two CFexpress type B slots. The Type B version of CFexpress, adopted by both Canon and Nikon, is larger than the Type A cards used by some Sony cameras like the new Sony A7 IV, but does offer faster 1700MB/s top speeds. This supports the large buffer capacity that Nikon claims will keep the Z9 going for over 1,000 raws in a burst.",
    "Pro photographers, particularly those agencies or newspapers, also need fast transfer speeds, so the Nikon Z9 has an ethernet port for FTP transfers and also has an in-camera Wi-Fi-to-FTP transfer that you can use without a separate transmitter. Lastly, you can also hook up the Z9 to a 5G smartphone via its USB-C port.",
    "We were unfortunately only able to take a few photos with the Nikon Z9 in a meeting room rather than out in the field, so it's took early to make any conclusions about that new sensor's image and video quality.",
    "On paper, though, there's certainly lots of potential, with a native ISO range of 64-25600 and options to extend these down to ISO32 and up to ISO102,400. Nikon says the Z9 has new algorithms to help process out noise in dimly-lit situations.",
    "The Nikon Z9's new Expeed 7 processor has also apparently brought improvements to white balance, enabling it to more accurate reproduce skin tones or product colors that'll mean less tweaking in post-production. This will be welcomed by both sports and commercial photographers, particularly as these algorithms also affect exposure when using flash.",
    "Perhaps recognizing that even professionals don't have unlimited funds to splash out on multiple CFexpress cards or external storage, Nikon has also introduced a new high-efficiency raw format on the Nikon Z9.",
    "This isn't a new concept, as previous Nikon cameras have offered 'small' and 'medium' raw formats that take up less storage. But this new format replaces both of those and lets you deliver 45.7MP photos but with a much smaller file size. While a full-resolution image from the Nikon Z9 will be about 50MB, it says this new format will crunch that down to 10-15MB with no noticeable loss in image quality.",
    "We're looking forward to testing those claims, and the Nikon Z9's stills and video quality, in a full review soon.",
    "Occasionally, a camera manages to make a technological leap forward that makes its stablemates suddenly look a bit dated – and on first impressions, that's what the Nikon Z9 appears to have done. It effectively combines the Nikon D6 and Nikon D850 and takes them to a new mirrorless level, creating a super-powered Nikon Z7 II in the process.",
    "For owners of older Nikon DSLRs like the Nikon D850 or Nikon D810 who've been patiently waiting for the camera giant to go all-out on a professional mirrorless body, the Nikon Z9 looks like a no-brainer. It's expensive, of course, but also much cheaper than the Nikon D6 was at launch – and the aggressive price tag ($5,499 / £5,299 / AU$8,999) could even tempt those who had been considering the Canon EOS R3 or Sony A1.",
    "It's a shame that some of the video features, including support for popular codecs like 10-bit ProRes 422 HQ and that 8K/60p mode, won't be available until a firmware update arrives sometime in 2022. We also need to test many of the Nikon Z9's claims in areas like autofocus to see whether it really does leapfrog, or merely draw level with, its rivals from Canon and Sony.",
    "But there's no doubt that Nikon Z9 feels like a flagship Nikon DSLR, only with some impressive mirrorless power under the bonnet. And that's a combination that many pro photographers have been waiting to see for a long time."
  ],
  "headers": {
    "6": "Nikon Z9 price and release date",
    "10": "Design",
    "17": "Autofocus and burst shooting",
    "26": "Specs and features",
    "33": "Image and video quality",
    "39": "Early verdict"
  },
  "links": {
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Fujifilm X-T3": "https://www.techradar.com/reviews/fujifilm-x-t3",
    "Panasonic S1H": "https://www.techradar.com/reviews/panasonic-lumix-s1h"
  }
}