{
  "source": "https://www.techradar.com/reviews/monster-hunter-rise",
  "title": "Monster Hunter Rise review",
  "category": "gaming",
  "updated": "2021-03-23T15:00:00Z",
  "author": "dom-peppiatt",
  "summary": "Should you carve out some time for Capcom’s latest huntathon?",
  "verdict": "An essential Switch experience and an impressive – if diluted – Monster Hunter experience that adds new mechanics to the already burgeoning toolset whilst creating fresh, fun experiences for newcomers and series veterans alike.",
  "pros": [
    "More accessible than previous games",
    "Gorgeous graphics, consistent framerate",
    "Wirebugs/Palamutes are excellent"
  ],
  "cons": [
    "Some toned-down mechanics",
    "Lack of a distinct end-game"
  ],
  "article": [
    "You’ve just spent about 10 minutes talking to the Blacksmith in Monster Hunter Rise about what you can make out of the severed head (and tail) of a dragon you just brought from a particularly productive hunt in the Swamps. You’re on an adrenaline hangover – still a bit shaky, but eager to ride the high – and your synapses are firing off as you try to figure out if the fancy dragon legs will work with the hairy ape torso you made after your last hunt. You think you’ve figured it out (‘I don’t care about the perks, I look great’) and then get to the really important stuff; dressing up your cat and dog. The blacksmith smelts down some dragon scales and some surplus ore, and now your pets – sorry, colleagues – match with your particularly garish setup. It’s time to head back into the Ruins and do it all over again.",
    "If you’ve ever played a Monster Hunter game, you’ll know that this is the central rhythm that the whole game rests on. Sure, other flourishes – some narrative beats, some gimmicky encounters, some particularly brutal ape-bull hybrids – appear to change the tempo or modify the beat of the day-to-day, hunt-to-hunt norm, but that’s the crux. And it’s enough.",
    "Hunting, modifying your armor, hunting again, and upgrading something else – that’s the gamer catnip, right there. Slaying monsters with enough skill to break bits off them and praying you get the right drops to make your dream weapon/armor is the sweet spot between luck and skill, and once you get bitten by the proverbial Monster Hunter Wirebug, it threatens to never let you go. There may be some baffling backsteps from revisions to the gameplay loop we saw in Monster Hunter: World, and there may be some weird question marks hovering over the lack of an endgame, but there’s no question about it: this is a perfect Nintendo Switch Monster Hunter game.",
    "From the second you gain control of your fully customizable character and take part in your first hunt, you’ll notice there are a lot of changes to the core Monster Hunter experience. Whether you’re coming from Monster Hunter World on PC/Xbox/PlayStation, or Monster Hunter Generations or Monster Hunter 4 on Switch/3DS, you’ll feel it. You’ll feel it in the concessions Capcom has made for newer players, you’ll feel it in the more forgiving difficulty curve, and you’ll feel it in towering, sometimes labyrinthine, levels.",
    "Whilst we’re going to stop short of saying the game has gotten easier, we’re confident in saying that the developer has certainly toned down a lot of what made previous Monster Hunter games feel so empowering when you played them just right. The newly-introduced Wirebugs and the dedicated attacks that come with them (several each for all 14 weapons) make your combos and strings feel like you’re just taking potshots until you can empty the meter and throw your ‘ultimate’ move at a monster, diluting what used to be very reactive and timing-sensitive combat and making it more ‘showy’. Other weapons (the Hunting Horn in particular) have been roundly re-thought; previously esoteric support weapons are now more attacker-friendly, and fully lethal in their own right. Other weapons have seen combo windows extended, iframes increased, or punishment for whiffs somewhat negated. To put it simply; Rise goes easy on you.",
    "This is a Switch game, and it’s a Switch game launched after the Monster Hunter Stories games extended the series’ reach to a more casual crowd, so perhaps it stands to reason the skill ceiling has been lowered. It’s not a bad thing, either; having a complete compendium that lists every monster, its breakable parts, and the odds you’ll get each material when you capture it or kill it in-game is a great step forwards, and makes compulsive hunting for certain sets of gear a far more streamlined process than it’s been in the past. Some Monster Hunter purists may balk at this, but for the series’ first dedicated Switch game, we think it makes sense.",
    "One of the best additions to Rise is the humble Palamute: a dog-like companion that can be mounted and ridden into battle. Leaping off a cliff edge, getting a lil’ boost off your dog and throwing yourself onto a Rathalos’ face, sword-first, is a thrill unlike much else in gaming. Having your dog follow up, supporting you with attacks tied to your own inputs, and seeing them tear chunks out of the monster’s flank grants its own giddy thrill, too.",
    "The more feline-friendly among you will be pleased to note the Palicos also return, and are as resource-hungry and eager to please as ever. Playing solo, and with support from a canine and feline companion, is a perfectly cromulent way to play Rise, too, which is a treat. We’d still recommend teaming up with friends or finding buddies via the (surprisingly competent) online lobbies, but lone wolves can certainly find value in the game, too.",
    "Whether playing solo or in a party of up to four, though, you’re able to witness one of Rise’s best moments: luring a monster to another monster’s lair and beating up your target so badly it falls to the floor means it’ll be primed to mount. Inexplicably called ‘Wyvern Riding’ in this instalment of the series, mounting a monster with your Wirebug means you can instigate a turf war with another beast – raging around the arena, deploying attacks meant for you on the local fauna… it’s a feeling without equal in the game, and it’s worthwhile mechanically, to boot.",
    "Skilled riders will be able to parry opposing monster attacks, unleash powerful moves on them, and then mount the other monster afterwards, leaving the arena speckled with precious shiny parts for you to pick up and horde like the unhinged maniac you are. It’s some real wish fulfilment from Capcom, and mounting monsters makes for some of the most empowering moments in the game – if not the series.",
    "Once you’ve slashed, bashed and carved your way through the impressively extensive rogue’s gallery of monsters on display in Rise (featuring many, but not all, fan favorites), it’s time to steel yourself for Rise’s most gimmicky challenge: the Rampage. Somewhere between Dynasty Warriors’ raids and a tower defense game, these siege-like modes task you with installing defenses and repelling a slew of weaker monsters until the Apex predator arrives.",
    "Rampage missions are fun in multiplayer, where you have allies to draw the cheap, area-of-effect damage spat out by irritating drone enemies, but a nightmare in single-player if you’re not a patient player. The design philosophy behind the mode is clear – having monsters swarm you as you fortify your precious hometown is a wonderful conceit – but in practice, it can sometimes turn out to be more of a chore than a treat. At least you’re rewarded with new monsters to fight, and new arenas to fight them in.",
    "The new fights are where the game shines, too: repelling the dirty mud-bombs of a Swamp dragon, diving out of the way of cover monster Magnamalo’s vicious swipes, and knocking celestial god-dragons out of the sky before wailing on their suspiciously testicular ‘floatation sacs’... it’s all pure Monster Hunter, in the best way it can possibly be. Coming across a new monster, and learning how it uses its prehensile tail to lob fruit at you, or understanding how it acts once it’s mightily peeved, will forever be the most engaging part of the series – and even after 70 hours’ worth of locking horns with the varied beasts, the game can still surprise you.",
    "Monster Hunter Rise is a properly impressive title, and shows Capcom won’t simply rest on its laurels now that it’s found mainstream success with World. Coming back to a Nintendo console, Rise has had to make some concessions in terms of fight complexity and difficulty, but at its core Monster Hunter Rise is every ounce the satisfying, addictive experience its bigger, shinier brother is on Xbox and PlayStation consoles.",
    "Hardcore players may lament the assists the game gives to newer players, but once you bite through the softer shell of Rise, you’ll find the filling is just as sweet and rich as it ever has been. Come for the newly reviewed weapons and the innovations to the traversal system, stay for the compelling, insistent fun of the new fights (and the myriad surprises you’ll find in old ones).",
    "It was a hard task living up to Monster Hunter: World, especially on more limited tech, but Capcom has proved it can always Rise up to the occasion."
  ],
  "headers": {
    "3": "Sir, you are being hunted",
    "6": "Working like a dog",
    "10": "All the rage back home",
    "13": "Verdict"
  },
  "links": {
    "Monster Hunter World": "https://www.techradar.com/news/monster-hunter-world-review"
  }
}