{
  "source": "https://www.techradar.com/reviews/google-classroom",
  "title": "Google Classroom review",
  "category": "computing",
  "updated": "2021-09-15T03:23:43Z",
  "author": "john-brandon",
  "summary": "The virtual education platform",
  "verdict": "This virtual classroom provides a robust platform for remote education, and offers a variety of tiers to suit various educational needs across multiple platforms. Dragging it down are bugs in the Android app, and the lack of direct support options.",
  "pros": [
    "Clean interface that’s easy to learn",
    "Powerful media sharing tools",
    "Integration with G-Suite"
  ],
  "cons": [
    "No direct contact for support",
    "Can’t be licensed separately",
    "Bugs in the Android app",
    "Issues with assignments not saved"
  ],
  "article": [
    "Google Classroom is from the household name in search providers, as part of its Google Workspace for Education Tools. It has been available since 2014 (the previous name was G Suite for Education), with cross platform support. It is considered a blending learning platform, with the primary goal to enable students and teachers to share files for an educational purpose, combining multiple Google tools into a single platform.",
    "As of 2021, Google Classroom has 150 million users, at least partially driven by the need for online education necessitated by COVID-19 stay-at-home orders.",
    "While Google Classroom had been around for years, when schools from Pre-K to universities were forced to shut down last year, there was an immediate need for a tool to enable remote education. Thankfully, this tool from Google became the answer for many of these schools.",
    "Google Classroom is a cloud based platform, providing a way for students and teachers to interact. It attempts to offer an online educational platform, with opportunities for classroom instruction, one on one interactions between teachers and students, along with student assignments.",
    "Going beyond the ‘Big picture,’ there are tons of features here to make any teacher feel right at home. Even on the free tier, a teacher can manage multiple classes at once, students can submit their assignments via an image capture, and new students can be added via an easy to use link. A gradebook is even available to track students' progress.",
    "In order to support education, Google does provide the Google Workspace for Education to qualified institutions on a free basis. Eligible institutions are required to submit an application and get approval. Looking over the requirements, most K-12 institutions, and universities would qualify for the free tools. Even recognized home schools do, but not other organizations, such as a public library, that Google encourages them to look into Google Workspace Business edition. This lowest free tier has plenty of tools, including Classroom, Docs, Gmail and Chat among multiple others.",
    "There are upgrade plans available, but Google offers them as part of a package, and not just for Classroom a la carte. The next tier up is the Standard Tier at a cost of $3 per student, monthly, and a free teacher license is included for every 4 student subscriptions. It adds a few features, including a security center, management for advanced devices and apps, and a log export for Gmail and Classroom for analysis and insights.",
    "Moving up the tiered packages, next is the Teaching and Learning Upgrade, which is paid for the staff at $4 per month. The added features start with Google Meetings enabled for meetings of up to 250 participants, and live streams up to 10,000 folks. It goes on to advanced features for Google Meet with polls, breakout meetings and Q and A’s, add-ons for Classroom for additional tools, and plagiarism checks via unlimited ‘Originality Reports.’",
    "At the top is the Education Plus package, which has a cost of $5 per student per month, and gives one faculty license for every 4 students enrolled. This has all the features of the lower plans, and upgrades including to live stream a Google Meeting with up to 100k participants, expedited support with a faster response time, personalized cloud search of the domain, and rosters can be directly synced from a Student Information System to Classroom.",
    "Getting some help with Google Classroom is about as anonymous as everything else that Google provides. After all, it is not like there is a toll free number to call when we disagree with a Google search result.",
    "There is plenty of help for Classroom, but it is not direct contact, so there is no phone number, email or chat to reach anyone. Rather, there is a ‘Classroom Help Center,’ which provides step by step directions for each and every feature. There is also a ‘Classroom Help Community’ that allows folks to interact, and there is a Community Manager to maintain order, however some older threads are locked, limiting the opportunity to add a query to an existing thread. Novices can also benefit from the ‘Recommended Reading’ that is designed to get up and running with topics such as “Create a Class.”",
    "Taking a look at the Google Play store, clearly the Android app for the Google Classroom is seriously popular, with over 100 million downloads, with a ranking as the #2 app in free education. However, let’s not confuse popularity with quality, as it gets a surprisingly low 3.1 out of 5 stars.",
    "Looking through these reviews, we do realize that at least part of this is due to folk’s frustration of not being able to go to school, and obey COVID-19 stay-at-home orders for the last year. However, there are still a myriad of bugs that are plaguing users. These run the gamut, from assignments that are completed, but then not saved when the user logs in subsequently, notifications that only intermittently come through, and difficulties when attempting to open assignments on the phone. Some of this may be coming from a robust cross platform attempt that is trying to do a lot, and maybe too much across a myriad of devices. Also, to be fair, some users do praise the ease of use, and a teacher indicated how much easier this makes their task of educating their 30 students.",
    "While we can pick it apart, we do want to recognize that Google Classroom provides a valuable cloud based platform to connect teachers with their students through the challenges of online education. The pros include the cross platform support, the choice of tiers, and robust options that can enable a live stream lecture to up to 100k participants. The cons cover the Android bugs, the ongoing subscription costs for upgraded tiers, and the lack of direct support. Overall, when it comes to robust apps that pull together a bunch of technologies, it is hard to get better than a Google effort, which explains its popularity."
  ],
  "headers": {
    "2": "Features",
    "5": "Plans and pricing",
    "9": "Support",
    "11": "User reviews",
    "13": "Final verdict"
  },
  "links": {
    "Google Classroom": "https://classroom.google.com/h",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "free tier": "https://edu.google.com/intl/ALL_us/products/classroom/editions/",
    "Standard Tier": "https://edu.google.com/intl/ALL_us/products/classroom/editions/",
    "Teaching and Learning Upgrade": "https://edu.google.com/intl/ALL_us/products/classroom/editions/",
    "Education Plus": "https://edu.google.com/intl/ALL_us/products/classroom/editions/"
  }
}