{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-book-pro",
  "title": "Samsung Galaxy Book Pro review",
  "category": "computing",
  "updated": "2021-08-06T17:19:10.555Z",
  "author": "matt-hanson",
  "summary": "Has Samsung finally made a MacBook competitor?",
  "verdict": "The Samsung Galaxy Book Pro is a powerful and nicely-designed Ultrabook that comes with cutting-edge Intel processors, Wi-Fi 6 and immense battery life. It’s pricey, but you’re getting a fantastic laptop – and it’s a great choice for people with other Samsung devices.",
  "pros": [
    "Incredible battery life",
    "Thin and light",
    "Very good performance",
    "Good integration with Samsung smartphones"
  ],
  "cons": [
    "Expensive",
    "Lots of bloatware",
    "Design is a little on the boring side"
  ],
  "article": [
    "The Samsung Galaxy Book Pro is the latest flagship from the almost-all-conquering electronics giant. We say ‘almost’, as while Samsung dominates in many fields, including smartphones, TVs and storage, to name just a few, it’s not found the same level of success with laptops.",
    "However, with the Samsung Galaxy Book Pro, it’s clear that the company wants to change that, and has made a stylish high-end laptop that packs Intel’s latest 11th generation processors. In fact, like the HP Spectre x360 (2021) and Dell XPS 13 (Late 2020), the Samsung Galaxy Book Pro is an Intel Evo-certified laptop.",
    "Intel Evo platforms are designed to provide a certain level of performance, so they must have 11th generation processors, wake up from sleep in less than a second, offer Thunderbolt 4 ports for super-fast data transfer speeds and offer over nine hours of battery life. The idea is that if you buy a laptop with an Intel Evo badge on the box, you should know you’re getting a very impressive performer. No pressure, then.",
    "With high-end new Intel CPUs and Samsung’s ‘Galaxy’ branding, which the company reserves for its flagship products, it may come as no surprise to learn that the the Samsung Galaxy Book Pro is an expensive laptop. For the 15.6-inch model we review here, you’re looking at a minimum of $1,199.99 / £1,099 (around AU$2,000). That’s a huge chunk of change by anyone’s standards.",
    "The good news is that by and large, the Samsung Galaxy Book Pro justifies this price tag. The design isn’t the most exciting, but it’s impressively thin and light – weighing just 1.05kg. This makes it a great laptop for taking out and about, as you can place it in your bag or backpack and you’ll hardly notice it’s there.",
    "There’s a decent array of ports, including a microSD card slot, which puts it ahead of other professional laptops that seem to sacrifice ports for slim and light designs. The Samsung Galaxy Book Pro proves you don’t have to make those kind of compromises.",
    "General performance is very good, with the 11th generation processors and ample RAM allowing you to run Windows 10 and pretty much any app you like easily. Without dedicated graphics, this isn’t going to be playing many AAA games, or handling intensive graphical workloads, but you wouldn’t be buying it for that anyway.",
    "Where it really excels, however, is with battery life. In our tests it lasted between 14 and 16 hours depending on what you’re using it for. That’s a remarkable amount of time, and it means you can happily work on this for a full work day without worrying about plugging it in.",
    "It’s so good that it boosts the Samsung Galaxy Book Pro from a decent laptop to an excellent one. If you’re after a solid laptop for working on when out and about, its lightweight design and epic battery life is going to go a long way toward justifying its high price.",
    "The Samsung Galaxy Book Pro, as with other ‘Galaxy’ products from Samsung, is a flagship device, and that means it comes with a steep price tag. The base model, with a 13.3-inch 1080p AMOLED screen, Intel Core i5-1135G7 processor, 8GB of RAM and 256GB of storage, costs $999.99.",
    "In the UK, you can get a similar spec, but with a larger 512GB SSD for £1,099. It doesn’t seem like the Galaxy Book Pro is currently available in Australia, but these prices would equate to around AU$2,000.",
    "In the US, the model with 512GB SSD costs $1,199.99.",
    "There’s also a 15.6-inch model with an Intel Core i5-1135G7 processor, 8GB RAM and 512GB storage that starts at $1,099.99 / £1,199 (around AU$2,200).",
    "So, this is a high-end laptop with a price tag to match. The asking price means it goes up against expensive laptops like the Dell XPS 13 and MacBook Pro 13-inch (M1, 2020). These are formidable opponents from more established laptops makers, so the Galaxy Book Pro certainly has its work cut out for it.",
    "Samsung’s Galaxy phones are well known for being some of the best looking handsets around, and the Samsung Galaxy Book Pro is another attractive device from the company. It’s sleek and thin, with dimensions of 304.4 x 199.8 x 11.2 mm for the 13.3-inch model, and 355.4 x 225.8 x 11.7 mm for the 15-inch model, which we review here.",
    "The weight is impressively light as well, with the 15.6-inch model weighing just 1.05kg, which is astoundingly light for a 15-inch laptop, and means you can easily pick it up with one hand. It should easily slip into your bag or rucksack as well, and you’ll hardly know that it’s there.",
    "These days, many of us are working and learning remotely, and needing to be flexible with where we work (and sometimes when we work) means a thin and light laptop is incredibly useful, and the Samsung Galaxy Book Pro ticks those boxes nicely.",
    "The color scheme is ‘Mystic Silver’ with a metallic-colored lid, while the rest of the body is white. It’s nice, but we wouldn’t quite go as far as to say the Samsung Galaxy Book Pro is the best looking laptop money can buy right now. That doesn’t mean it’s ugly – far from it – but there’s just so much competition from the likes of the stunning HP Elite Dragonfly G2 that it’s hard to stand out as a good looking laptop these days.",
    "Still, if we take the ‘Pro’ part of the name as an indication that the Samsung Galaxy Book Pro is designed to be a business laptop, then the overall design will certainly appeal to people looking for a device you can use in an office or take out in a meeting.",
    "The thin bezels around the 15.6-inch screen gives the Samsung Galaxy Book Pro a modern appearance, especially compared to the MacBook Pro, and it means Samsung has been able to add a large screen without making the overall size of the laptop too large.",
    "The dimensions offer enough space for a full size keyboard with large, easy to hit keys. There’s a decent amount of travel on them, so typing and working on the Samsung Galaxy Book Pro is comfortable. It also includes a numpad, a handy addition that’s often not included in laptops due to space restraints.",
    "On the top-right corner above the num pad sits a button that turns the laptop on, and is also used for scanning your fingerprint to log into Windows 10 securely. There’s no icon on the button, but it’s highlighted with a silver surround, which is a nice, minimalist way of setting this key apart from the rest.",
    "Below the keyboard is a large trackpad that is responsive and easy to use. It’s good to see Samsung take advantage of the larger form factor of a 15.6-inch laptop to make the keyboard and touchpad as large and comfortable as possible.",
    "Even with its slimline design, the Samsung Galaxy Book Pro features a decent selection of ports, which is always important for a business laptop. On the left-hand side is a HDMI port and two USB-C ports.",
    "On the right-hand side there’s an audio jack, USB-A port (useful for older USB devices) and a microSD card slot. We’re always happy to see a card slot in a laptop, especially one that’s aimed at professionals. It’s a genuinely useful thing to have, especially for photographers, for example, who won't need to plug in an additional dongle or adaptor. Along with the numpad on the keyboard, this is a feature often left off laptops, so it’s good to see Samsung stick with it. The port selection certainly puts to shame the MacBook Pro, which comes with just two or four (depending on configuration) USB-C ports.",
    "Overall, the design of the Samsung Galaxy Book Pro is understated, yet provides pretty much everything you’d want in a laptop for working on these days. It’s impressively thin and light, the screen is large and isn’t dwarfed by bulky bezels, there’s plenty of ports and the keyboard and track pad are large and comfortable. It might not be the most exciting design, but this is a laptop designed to deliver, not to excite.",
    "As an Intel Evo laptop, the Samsung Galaxy Book Pro needs to provide a certain level of performance, and that includes offering over nine hours of battery life, while also waking from sleep in less than a second and offering 40% better performance than a two-year-old laptop.",
    "The Samsung Galaxy Book Pro certainly offers very good performance from a laptop of this price point. Not only is it thin and light, but Windows 10 runs smoothly and boots up quickly. During our time with the Samsung Galaxy Book Pro, it comfortably ran multiple apps and websites with ease.",
    "The large keys of the keyboard and large and vibrant screen made working on the Samsung Galaxy Book Pro comfortable as well.",
    "The model we review here comes with an Intel Core i7-1165G7, a powerful quad-core processor with a max frequency of 4.7Ghz. Paired with 16GB of RAM, this results in speedy laptop that is ideal for day-to-day workloads. It may be overkill for people who just want a laptop for browsing the internet or video streaming, but if you want something you can load a bunch of programs on, and they start up and run quickly, this is a very good machine for doing just that.",
    "There’s no dedicated graphics, but the integrated Intel Iris Xe graphics offers very good performance. While you won’t be able to play the latest AAA games on it (older or some new retro or indie titles are doable though), it’s good enough for photo and video editing, and it helps contribute to the overall performance of the Samsung Galaxy Book Pro.",
    "The screen is bright and vibrant, and with the 15.6-inch version, you get plenty of space to play around with. The speakers aren’t as impressive, though, sounding a little thin at normal volumes, and getting distorted when turned up too loud. This is likely a symptom of the Samsung Galaxy Book Pro’s thin and light design, as it means there’s not enough space to put in better quality speakers. They do the job, but if you want to listen to music (or you want a laptop for video and music editing), then you’ll want to plug in some external speakers.",
    "The fingerprint scanner, which is used to log into Windows 10, worked very well during our time with the laptop, logging us in quickly and without fuss every time. Sadly, that’s not always the case with other Windows 10 laptops.",
    "One of the biggest selling points of the Samsung Galaxy Book Pro is its ability to integrate with other Samsung products, most noticeably smartphones and the Galaxy Buds true wireless headphones. We tried the laptop with a variety of Samsung devices, including the Galaxy Buds, Samsung Galaxy Note 9 and Samsung Galaxy S21+, and the integration was good, but with a few caveats.",
    "For a start, while Samsung is trying to make the integration between its devices as seamless as Apple’s (with the iPhone, Mac and Airpods), it doesn’t really manage it, but that’s not entirely Samsung's fault.",
    "While Apple has full control over its hardware and software, Samsung doesn’t. So, connecting your Samsung phone, for example, involves using Android (by Google) and Windows (by Microsoft) and signing into a range of accounts, including your Samsung account. Meanwhile, the photo sync option, which lets you see photos on your phone in Windows on the laptop, uses Microsoft’s OneDrive service.",
    "It’s not a deal breaker, but it makes the whole thing less cohesive than Apple’s way of doing thing, where you just need a single Apple ID account, and the process is very simple.",
    "Samsung has also pre-installed many of its own apps on the Samsung Galaxy Book Pro. These apps, like Samsung Gallery and Samsung Notes will be familiar to anyone who has a Samsung phone or tablet, as they are the same as the ones that come preinstalled on those devices. It brings a bit more uniformity between the Samsung Galaxy Book Pro and its smartphone and tablet counter parts and it also means you can sync items between them.",
    "However, the Windows 10 versions of these apps suffer from the same issues that the mobile ones do, as Windows 10 comes with perfectly good apps, such as Note Pad and Photos, which do similar jobs. Sure, they don’t sync with Samsung devices automatically, but it leaves the Samsung Galaxy Book Pro feeling like it comes pre-loaded with redundant tools.",
    "On the Samsung smartphones, it’s a similar situation, and many people may wonder what the point of Samsung Gallery is, for example, when Google Photos does essentially the same thing. It’s clear why Samsung has done this – it wants people to use its apps, not Google’s or Microsoft’s, but many users may not be impressed – especially if they don’t own a Samsung smartphone or tablet as well.",
    "Less understandable is Samsung’s frustrating decision to pre-install a trial of McAfee anti-virus on the Galaxy Book Pro. Once the free trial expires, you’re then pestered with big, alarming pop ups in red that count down the minutes until you’re at risk – unless you click ‘Stay protected’ and subscribe to McAfee.",
    "It’s a pretty grubby practice, and while this is more on McAfee and its scare tactics to get people to subscribe, Samsung isn’t blameless as it made the decision to include it. These pre-installed trials are usually paid for by the software maker, so it can help budget laptops from smaller brands be sold for less money, with the laptop maker recouping some money from these deals. However, with a brand as big as Samsung, and with a laptop as expensive as the Galaxy Book Pro, the justification is harder to make. It’s a shame.",
    "Thankfully, the Samsung Galaxy Book Pro is powerful enough that even with these pre-installed apps, performance isn’t impacted.",
    "In this day and age, having a good quality webcam and microphone in a laptop is essential, as many of us are working remotely, or increasingly using video calls to keep in contact with friends and family.",
    "The Samsung Galaxy Book Pro comes with a 720p webcam, which is a little disappointing, as we’re seeing an increasing number of 1080p webcams being included in premium laptops. For example, the Dell XPS 13, one of the Samsung Galaxy Book Pro’s biggest rivals, has a 1080p webcam, and the difference in quality is very noticeable.",
    "The webcam of the Samsung Galaxy Book Pro does the job, but the lower resolution means the image loses details. Not the end of the world, but a cleaner and crisper image looks more professional in business meetings, and can make you look more natural in personal video calls, which really can make a difference when you’re video calling with loved ones half the world away.",
    "The built-in microphone of the Samsung Galaxy Book Pro also does the job, but doesn’t excel. When buying a laptop at this price, you’d like a bit more ‘wow’ factor with both.",
    "The Samsung Galaxy Book Pro certainly wows when it comes to battery life, however. As an Intel Evo laptop it needs to offer at least nine hours, but we found it went far beyond that.",
    "In our own battery life benchmark, which involves playing a looped 1080p video at 50% screen brightness, the Samsung Galaxy Book Pro lasted a very impressive 16 hours and 49 minutes.",
    "That’s a fantastic result for a laptop of this power, and puts many of its competitors to shame. We also found that during our time with the Samsung Galaxy Book Pro, we were able to comfortably work an entire workday without needing to charge the laptop.",
    "The PC Mark 10 benchmark, which replicates more intensive workloads such as video calling and web browsing, also showed just how good the battery life is, with the Galaxy Book Pro lasting an excellent 13 hours and 38 minutes. Again, it means you can comfortably work a whole day without worrying about plugging it in.",
    "Battery life is one of the most important considerations people have when buying a new laptop, so the fact that the Samsung Galaxy Book Pro has such an impressive one could seriously sway people."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Price and availability",
    "14": "Design",
    "26": "Performance",
    "43": "Webcam and microphone",
    "47": "Battery life",
    "52": "Don't buy it if..."
  },
  "links": {
    "HP Spectre x360 (2021)": "https://www.techradar.com/reviews/hp-spectre-x360-2021",
    "Dell XPS 13 (Late 2020)": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Intel Evo": "https://www.techradar.com/news/intel-evo-could-be-a-revolutionary-new-lineup-of-processors",
    "MacBook Pro 13-inch (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "HP Elite Dragonfly G2": "https://www.techradar.com/reviews/hp-elite-dragonfly-g2",
    "Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Galaxy S21+": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review"
  }
}