{
  "source": "https://www.techradar.com/reviews/blink-indoor",
  "title": "Blink Indoor review",
  "category": "smart-home",
  "updated": "2021-12-02T14:49:10Z",
  "author": "esat-dedezade",
  "summary": "A simple, wireless home security camera that nails the basics",
  "verdict": "The Blink Indoor is a simple to use home security camera that records clear Full HD footage both during the day and at night. Thanks to its AA battery power supply, which lets you place it anywhere and move it around easily, it offers plenty of flexibility and the included Sync Module 2 provides a local storage option for the video clips, which is a handy bonus - although a cloud storage subscription is also available if you prefer. Alexa support is welcome and while there is motion detection, it can’t differentiate between people and pets, either.",
  "pros": [
    "Affordable",
    "Clear video quality",
    "Offline storage option"
  ],
  "cons": [
    "No person detection",
    "No free cloud storage option beyond initial trial"
  ],
  "article": [
    "Putting together an indoor home security setup used to be a tedious ordeal, with power tools, miles of cabling, and hours of work required to achieve the final goal. Thankfully, those days are long gone. Today, there’s a whole host of security cameras that are easy to set up and maintain, beaming HD content from your home straight to your smartphone, for easily achievable peace of mind.",
    "One such device is the Blink Indoor — a minimalist wire-free security camera that will appeal to people looking for the ultimate hassle-free setup. Just like the Blink Outdoor, its biggest selling point is the fact that it can last up to two years running on a single set of AA batteries, negating the need for any regular charging shenanigans. However, unlike Blink’s other wire-free home security camera, it isn’t weather-proof and can only be used inside.",
    "That said, it provides total freedom to place it wherever you like, from bookshelf to windowsill, and everything in between, which sets it apart from other cable-laden security cameras such as the Blink Mini, as well as rivals from Eufy, Wyze, and even Amazon’s other home security company, Ring. You can find out how the two differ by reading Blink vs Ring.",
    "Featuring a Full HD resolution and 110-degree field of view, the Blink Indoor also has infrared night vision, as well as other handy features like motion alerts and Alexa (but no Google Assistant) support. Throw in a built-in speaker for two-way communication and the bundled Sync Module 2 which offers a USB drive local storage option, and you have yourself a tempting package at its $79.99 / £79.99 price tag.",
    "The Blink Indoor is best suited to those looking for a simplistic indoor home security camera that offers a hassle-free solution for keeping an eye on things at home, or those that want the flexibility of a wire-free device that can be moved in an instant. However, if you’re particularly set on person detection, you may want to consider options from Ring or Eufy instead.",
    "The Blink Indoor camera can be snapped up for $79.99 / £79.99, and is available directly from Amazon in both the US and UK. You can also purchase it from the likes of Best Buy, Lowes and Target in the US, or Currys, Very and Argos in the UK. At the time of writing, It’s not currently available in Australia.",
    "Because the Blink Sync Module 2 is included in the price there’s nothing extra you really need to buy — chances are you’ve got a spare USB flash drive lying around which you can use for local storage if you don’t fancy relying on the cloud. If you do want to grab a dedicated one though, you can easily grab a 256GB USB flash drive for around $25 / £25.",
    "If you’re happy with cloud storage then that’s an option too, though it won't be free. While the Blink Outdoor comes with a free 30-day cloud storage plan trial, after which it’ll cost $3 / £2.50 per month.",
    "Depending on your needs, you can buy Blink Indoor packs that have up to four cameras, and these all include a Sync Module 2 as well. You can also buy individual cameras that don’t include the module if you simply want to expand your existing setup in future.",
    "The Blink Indoor is about as basic as things can get, but that’s no bad thing. A security camera is the last thing you want to draw attention to, and its rounded square white look is pleasantly minimal.",
    "It feels sturdy and robust in the hands despite its plastic build, and the included mount is easy to install even for nervous DIYers, though we opted to simply stand it up on a bookshelf. The mount itself is also stiff enough to ensure the camera will remain pointing where you aimed it.",
    "One thing we should point out is the fact that due to its plastic body, it can get scratched and scuffed relatively easily. In real use this won’t be a problem, but having thrown it in our rucksack during our travels, it didn’t take much for some (cosmetic) scratches to appear.",
    "Flip the camera round, and you’ll find a large screw that can be loosened with an included tool. This lets the back easily pop off, revealing the battery compartment and QR code, the latter of which is needed to link your camera to the app (more on that in a bit).",
    "The Blink Outdoor’s Full HD camera provides a clear picture that’s sharp enough to identify the faces of any intruders. The feed automatically switches to infrared-powered night vision in low light which drops the color for a monochrome view. Despite this, things remain clear, though objects further away do lose some detail. There’s also the usual levels of distortion around the outer edge of the picture as a result of the wide-angle lens, but that’s to be expected and poses no real annoyance. Overall, the day and night performance of the Blink Indoor is impressive, letting you relax in the knowledge that everything is being captured in more than enough detail to be useful.",
    "Beyond the picture quality, the Blink Indoor also has a motion tracking feature that can alert you when movement is detected. You can set dead zones using the app, though this is probably more useful for an outdoor camera that has to deal with things like passing traffic and exuberant tree branches. Chances are, with an indoor camera like this, you’ll want motion tracking across the entire available area, to ensure any intruders are brought to your attention.",
    "If you’re the owner of a boisterous cat though, things can get a little tricky, as the Blink Indoor lacks the ability to differentiate between people and animals, making it difficult to know when to take motion alerts seriously.",
    "If you have an Amazon smart display, such as the Amazon Echo Show 10, or any Fire TV device you can also ask Alexa to show you your Blink camera(s), beaming the image to a larger screen. This works well, though sadly (and expectedly, given the fact that Blink is Amazon-owned), this feature isn’t compatible with any other smart platforms like Google Home. You can, however, craft a solution to this using IFFT, if you’re so inclined.",
    "The Blink app nails the two most important things — it’s easy to set up, and crammed with useful features. Initial setup is as easy as using the app to scan the QR codes on first the Sync Module 2 and then the camera itself, entering your Wi-Fi password to get both automatically connected and up and running.",
    "Following this initial setup you’re good to go, and can view live feeds and mess around with the settings, such as changing the name of the camera to something that makes more sense than the nonsensical default numbers you’re given. You can also tweak the aforementioned motion detection zones, selecting areas of a grid in which motion will be ignored. As mentioned, this is something you’re probably less likely to do in an indoor camera, but the option is available nonetheless. You can also adjust the sensitivity of the motion detection, as well as the, retrigger time, in addition to adjusting the length of recorded clips, with 30 seconds being the maximum.",
    "The Blink Indoor comes with a 30-day free trial which lets you save recorded footage to the cloud. Once it ends, you’ll be limited to motion notifications and live streaming only, unless you pay for a cloud subscription. If you’d rather not, there’s always the handy option of plugging a USB drive in the Sync Module 2, letting you store videos locally. Obviously this poses the potential risk of a nefarious intruder finding and removing the USB drive, which is something you might want to consider.",
    "The Blink Indoor’s standout feature is it's up to two-year battery life, supplied by a humble pair of included AA batteries, as we've already mentioned. While the actual time will vary depending on how often motion is detected and how regularly you use its live view feature, after a few months with the Blink Indoor in our home, we see no reason why it can’t live up to its stamina-centric claims.",
    "When the time comes to replace them you could always opt for rechargeable offerings to save buying more batteries in the future, making for a more sustainable option.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Blink Indoor price and availability",
    "9": "Design",
    "13": "Performance",
    "17": "App",
    "20": "Battery life",
    "22": "Don't buy it if..."
  },
  "links": {
    "security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Blink Outdoor": "https://www.techradar.com/reviews/blink-outdoor",
    "Blink Mini": "https://www.techradar.com/reviews/blink-mini",
    "Blink vs Ring": "https://www.techradar.com/news/blink-vs-ring-what-are-the-differences-between-amazons-cams",
    "Amazon Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Fire TV": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k"
  }
}