{
  "source": "https://www.techradar.com/reviews/tp-link-deco-voice-x20",
  "title": "TP-Link Deco Voice X20 review",
  "category": "computing",
  "updated": "2021-09-23T10:35:40Z",
  "author": "cliff-joseph",
  "summary": "Mesh Wi-Fi system with Alexa voice controls and speaker",
  "verdict": "The Deco’s router/speaker combo works well, and the Deco app is easy to use, but you’re paying a big premium for a fairly cheap-and-cheerful speaker.",
  "pros": [
    "Strong, reliable Wi-Fi signal",
    "Easy to use app",
    "Speaker and mic support Alexa voice control"
  ],
  "cons": [
    "Expensive",
    "Modest Wi-Fi speed",
    "Speaker has limited inputs/connectivity"
  ],
  "article": [
    "TP-Link isn’t the first company to combine a Wi-Fi router and smart speaker into a single unit - Netgear did it with the Orbi Voice back in 2019, but that didn’t last long, so the jury is still out on whether this approach is anything more than a gimmick.",
    "But, first and foremost, the Deco Voice X20 is a router - or, to be specific, it’s a mesh Wi-Fi system - that's designed to provide fast, reliable Wi-Fi throughout your entire home. On that score, it’s actually quite conventional, offering dual-band Wi-Fi 6 (aka 802.11ax) with a maximum speed of 1,800Mbps. That’s not especially fast for the new generation of Wi-Fi 6 routers, although the Deco Voice X20 should still be perfectly adequate for streaming music and video and a spot of gaming.",
    "The TP-Link website is a little confusing, though, as the main page for the Deco Voice X20 simply shows a single router on its own. However, clicking the ‘Buy’ button will take you to TP-Link’s online store where pricing actually starts at £279.99/US $340.00/AU $544.96 for a pack that contains two Deco Voice X20 routers, which is the model that we review here.",
    "That 2-pack should be suitable for most homes of up to four bedrooms - or around 4000 sq.ft in size - but there are 3-pack and 4-pack options available for larger homes, and even packs that combine the Deco Voice routers with a variety of smart lights, security cameras and other smart devices that can be controlled with your voice commands.",
    "It’s worth noting, though, that there’s a more conventional mesh system, simply called the Deco X20, that lacks the speaker and microphone of the Deco Voice model. The Deco X20 provides similar wi-fi speed and features, but only costs £170.00/US $180.00/AU $392.12 so you’re clearly paying quite a premium for the speaker and voice features.",
    "The Deco Voice X20 has the traditional white, cylindrical design of previous Deco models, although the inclusion of the speaker and four separate microphones means that it’s larger, and also has a small stand that lifts it up in order to improve dispersion of sound from the internal speaker.",
    "Tucked around the back of the unit you’ll find a small panel that houses the power socket and two Gigabit Ethernet ports. The first router that you set up will need to use one of those ports to connect to your existing broadband modem or router, leaving just one for a wired connection for a games console or other device, while the second router can use both Ethernet ports for wired connections.",
    "The Deco app is well designed too, including some parental controls that allow you to set up profiles for individual family members, create schedules for Internet access for your children, and use filters that can automatically block adult content or other unsuitable material.",
    "But, like many routers these days, it does try to drum up some extra cash by promoting its HomeShield service, which provides additional parental controls and security features. There’s a one-month trial available through the app, so you can try it out first, but after that it costs £5.99/US $5.99/AU $9.99 per month.",
    "The Wi-Fi side of things is admirably straightforward. You just plug the first router into mains power and use an Ethernet cable to connect it to your existing modem or router.",
    "You can scan the QR code in the box to download the Deco app for iOS or Android, and the only work you have to do is to create an account and password to keep your network settings secure, and also to assign a name and password for your new Deco wi-fi network.",
    "Once that’s done the app uses Bluetooth to automatically connect to the first Deco, set up the new network and then connect the second Deco router as well (which we placed in our back office where the Wi-Fi has always been a bit dodgy). The only real limitation here is that the app just sets up a single network that merges the 2.4GHz and 5.0GHz bands, so more experienced users might prefer a system that provides more in-depth control over the network settings.",
    "The Deco Voice X20 provides good Wi-Fi performance too. Devices in the same room as the first router managed download speeds of 100Mbps with the Ookla speed test and 12.5MB/s for Steam. That’s pretty much what we’d expect with our 100Mbps broadband service, but the Deco system also proved rock-steady as we picked up our laptop and walked down the hall to that back office, not wavering for a second as it maintained the same 100Mbps and 12.5Mb speeds the whole time.",
    "We can’t fault the Wi-Fi performance of the Deco Voice, but the smart-speaker side of things is more of a mixed bag. The Deco app includes a ‘skill’ for the Amazon Alexa voice assistant that allows you to use voice commands to control both the router and its internal speaker.",
    "You could tell it to “turn off the guest network” or control some smart lights that are connected to the router - although the options for controlling smart devices in the app aren’t clearly explained, and TP-Link just seems to pass the buck to Alexa there.",
    "The little 5W speaker inside the router isn’t particularly powerful, but the sound quality is fairly respectable and it’ll be fine for waking you up in the morning or singing along to a few tunes while you’re preparing Sunday lunch.",
    "However, the reliance on Alexa means that you can only stream music from services that are supported by Amazon’s Alexa app - which you have to download separately.",
    "On an iPhone, Alexa had Amazon Music already set up - no surprise there - and also allowed Apple Music, Spotify and Deezer to be added as well. However, there was no option for using a Tidal account, and no way to stream the 30GB library of music files that we have stored on an office laptop either.",
    "To be fair, the emphasis with the Deco Voice is on using voice commands to control all your smart devices, but if you’re paying quite a lot extra for the built-in speaker then the speaker really should work with a wider range of music sources."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Design and features",
    "9": "Performance and getting started",
    "13": "Voice controls and music",
    "19": "Don't buy it if..."
  },
  "links": {
    "Wi-Fi router": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523",
    "Orbi Voice": "https://www.techradar.com/reviews/netgear-orbi-voice",
    "mesh Wi-Fi system": "https://www.techradar.com/news/best-wireless-mesh-routers",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Wi-Fi 6 routers": "https://www.techradar.com/news/wi-fi-6-routers-the-best-wi-fi-6-routers-you-can-buy-in-2019",
    "TP-Link website": "https://ukstore.tp-link.com/collections/home-wifi"
  }
}