{
  "source": "https://www.techradar.com/reviews/eset-2020-antivirus-solutions",
  "title": "ESET Antivirus solutions review",
  "category": "computing",
  "updated": "2021-01-08T10:57:52Z",
  "author": "mike-williams",
  "summary": "Highly configurable security with some expert-level features",
  "verdict": "ESET NOD32 Antivirus has mixed independent testing lab results and it's not always easy to use, but experienced users should appreciate its advanced features and low-level configurability.",
  "pros": [
    "Minimal performance impact",
    "Highly configurable",
    "Expert-level device control",
    "Covers up to 24 devices for 3 years"
  ],
  "cons": [
    "Mixed results from testing labs",
    "Not many features",
    "Can be complex",
    "ESET Internet Security is only a little more expensive"
  ],
  "article": [
    "Bratislava-based ESET was founded by a group of friends some 30 years ago to market their NOD antivirus software. These days it has a broad portfolio of products covering all the major platforms, and is used by 110 million customers all around the world.",
    "ESET's home user range begins with ESET NOD32 Antivirus, a stripped-back product which focuses on the antivirus, anti-phishing and anti-ransomware basics. But there's still a major plus in that it supports Windows, Mac and Linux devices (many baseline antivirus products are now Windows-only).",
    "Prices start at $40 for single device, one-year license. That's not bad, but it's missing any introductory discount; Bitdefender AntiVirus Plus is $20 in year one, Trend Micro Antivirus+ Security $30, before they rise to $40 on renewal.)",
    "You can extend the license to cover up to 24 devices and three years, as flexible a system as we've seen. This won't necessarily improve value, though. A five device, three-year Bitdefender AntiVirus Plus license is $150, for instance; ESET NOD32 Antivirus is $160 for the first term, $240 on renewal.",
    "ESET Internet Security adds a spam filter, parental controls, and a secure browser to protect online banking transactions. The package enables blocking unauthorized apps from accessing your webcam, while an anti-theft feature (Windows-only) could help locate your missing laptop.",
    "There are multiple layers of network security, including a firewall, monitoring for dangerous traffic patterns, and a Connected Home Monitor which scans your home devices for vulnerabilities. ESET Internet Security also adds Android support to its Windows and Mac coverage.",
    "Prices start from a reasonable $50 for a single device, one-year license, and rise to a more costly $190 ($270 on renewal) outlay to cover five devices over three-years. That's somewhere in the middle of what we'd expect. Bitdefender Internet Security covers a single device for only $25 in year one, for instance, but it's $60 on renewal; a three-year, five-device Kaspersky Internet Security license is $135 initially, $270 on renewal.",
    "ESET Smart Security Premium extends the suite a little more with a password manager and encryption for your files and folders. These are very useful, but also relatively small additions, and the kind of features you'd see in mid-range suites elsewhere.",
    "The package starts at only a marginally more expensive $60 for a one-year subscription, and a five device, three-year license costs $220 for the first term, $300 on renewal.",
    "That's not bad, but again, choosing a vendor with a steeper discount can save you a lot of case. Kaspersky Total Security's five device, three year license is $150 for the first term, for instance, though it's the same $300 on renewal.",
    "Installing ESET NOD32 Antivirus is straightforward: hand over your email address, choose a few key settings (would you like the app to detect potentially unwanted programs, are you happy to share data about how you use the program with ESET?), and it's up and running.",
    "After installation is complete, ESET NOD32 Antivirus automatically launches a full system scan. That might not always be convenient, but it doesn't grab many resources, and we were able to continue using our review system as usual.",
    "If you enabled the 'check potentially unwanted programs' feature, there's a chance you'll get more warnings than you expected. We were repeatedly warned about uTorrent and other legitimate apps, for instance.",
    "ESET's executables and data files grab approaching 800MB of hard drive space, relatively high for a plain antivirus package, but we only noticed a single main background process.",
    "Running top benchmark PCMark Professional before and after installation showed NOD32 cut our score by a mere 1.3%. Some do better - Kaspersky's performance hit was a tiny 0.6%, Bitdefender's 1% - but it beats Avast (3.2%), Norton (3.3%), Trend Micro (4%) and more.",
    "AV-Comparatives' October 2020 Performance test covers more areas than our tests, but broadly agrees with our verdict, placing ESET 5th out of 17 for minimal impact on system performance.",
    "The package did well with our self-protection results, too, where we simulate various attacks to see if malware can disable a security app. We tried deleting files, terminating processes, closing internet connections, disabling filter drivers, removing autostart settings and more, but none of our efforts put the tiniest of dents in ESET's digital armor, and we weren't able to compromise its protection.",
    "ESET NOD32's interface works much like many other antivirus apps: a simple dashboard displays your current security status, you can launch a full system scan with a click, and there is a sidebar which enables browsing the program's other features and tools.",
    "This is clear and straightforward, and even the greenest of security newbies should quickly feel at home. But don't be fooled, there's more to the app than you might think.",
    "The dashboard window is resizeable, for instance, and many panels will rearrange their layouts to make best use of the available interface. It's a smart touch which reduces scrolling and makes it easier to more comfortably view complicated reports.",
    "Exploring the interface further, we found some surprisingly powerful features. The Log Files panel may look like an ordinary table of recent antivirus events, but then we right-clicked, and a menu appeared with a host of powerful tools: filtering by multiple parameters, copy and delete options, search tools, exporting to multiple formats.",
    "There are some inconsistencies. The Log window supports right-clicking items and pressing Ctrl+A and Ctrl+C to copy everything; the Processes window has no right-click menu, and pressing Ctrl+A only selects the first item in the list.",
    "ESET's interface is still more interesting than most of the competition, though. If you're a technical type, be sure to left-click every link and right-click every object to get a feel for what it can do.",
    "ESET's scan types are more limited than most of the competition: there are just Full System, Removable Devices and Custom scans (the latter checks your choice of files, folders or drives).",
    "There's no Quick Scan, at least as standard. You can create scan profiles to run more limited checks, but it's far from intuitive, and unless you go exploring ESET's menus you may never realize the option exists.",
    "The app scanned our test 50GB of executables in a relatively speedy 18 minutes, a close match for Trend Micro (16 minutes) and Kaspersky (19 minutes.) Some competitors check only new or modified files after the first run, though, so for example Kaspersky's second run lasted just under three minutes. ESET took the same 18 minutes each time.",
    "As ESET checks files as they're saved to your hard drive, anyway, this shouldn't matter much in real-world use. But if you'd like to speed things up, or otherwise tweak your protection, take a look at the Settings dialog. An array of expert-level options covers everything from the basic objects you'd like to scan (boot sector, network drives, archives, whatever it might be) to fine-tuned details like the email protocols to check or ignore, and the level of nested zip files ESET should scan (zips within zips).",
    "This flexibility continues almost everywhere you look. Right-click a file in Explorer and ESET NOD32, like everyone else, gives you the option to scan it for danger. But you can also check the file reputation to find out more about it; scan the file without cleaning it, just to get an immediate verdict; or manually quarantine a file even if it's not been flagged as malware, a very useful way to safely archive a file you're concerned about.",
    "The results from these scans were variable. The reputation scan, in particular, regularly suggested that entirely safe executables from completely legitimate developers were 'risky.' But it did also give us some useful information, such as when ESET first saw the file, and on balance we're glad it's included with the package.",
    "AV-Comparatives' Real-World Protection Test matches 17 of the top Windows antivirus engines against both well-known and the very latest malware.",
    "The July-October 2020 summary report saw ESET reach only 13th place with a protection rating of 99.3%. The good news: it just beat Avira, who also managed 99.3% but had more false positives. The bad news: Microsoft Defender was more accurate than both, with a protection rate of 99.5%.",
    "AV-Test's August and October 2020 Home Windows User tests found ESET blocked 100% of test threats. As that's more common with AV-Test, we usually check previous results to see if an engine is consistent over time. ESET's latest Internet Security product only appears in the most recent two tests, though, so that data isn't available yet.",
    "SE-Labs' July-September 2020 Home Anti-Malware Protection report is more definitive, placing ESET in second place out of 14 with a Total Accuracy Rating of 99.9%. (Kaspersky came top, and Avast, McAfee and Trend Micro lagged just behind with 99.8%.)",
    "Our smaller tests showed little sign of behavioral monitoring, with our sample threats able to exploit various Windows tools to download various malicious files.",
    "ESET didn't fall down on its file detection, though, instantly quarantining every threat as soon as it touched our hard drive.",
    "Our custom ransomware simulator tries to encrypt thousands of user documents. As it's our creation, the file shouldn't be picked up from its signature alone, and we use it as a test of antivirus behavior monitoring.",
    "It didn't quite work out that way with ESET, though, as NOD32 Antivirus correctly realised our simulator was a threat from the file alone, and blocked it before it could run. That tells us precisely nothing about ESET's behavior monitoring, but we can hardly blame NOD32 Antivirus for that; all it can do is block the threats we give it, and the app did that exceptionally well.",
    "ESET NOD32 Antivirus comes with two URL filtering layers: the simplest protects you from phishing sites, while the other uses multiple technologies to block more general website dangers.",
    "Conveniently, both layers are built into the core engine. There's no need to install browser extensions or worry about which browsers are protected or supported, you're automatically covered for everything that accesses the web.",
    "There are a lot of configuration options, too. Most are on/off switches which you'll rarely use – you can disable scanning for HTTP sites, for instance, though that's probably a bad idea – but you can create handy blacklists and whitelists of sites which should always (or never) by blocked.",
    "ESET isn't included in AV-Comparatives' latest anti-phishing test, and we weren't able to get our own automated testing software to fully work with the app, so we can't give a definitive verdict on its URL blocking abilities.",
    "Simple manual checks found ESET blocked everything we threw at it, though, including some very new phishing links provided to us by security testing company MRG Effitas.",
    "The program is smart enough to recognize some web threats by analysis, too, as well as simply looking up a URL blacklist. When we pointed it at a new link containing a Bitcoin miner script, for instance, ESET checked the script, spotted the danger and alerted us to a 'potentially unwanted application.'",
    "Much like ESET's antivirus protection, we don't have enough data to be completely sure how good its URL filtering might be, but small-scale testing does show some very positive signs.",
    "ESET's bonus tools start with Device Control, an unusual feature which enables defining what happens when users connect a host of device types to the system: external storage, a USB printer, Bluetooth device, scanner, smart card reader, modems and more.",
    "Options include making devices read-only, displaying a warning to users or blocking them entirely. Rules can apply to all or specific devices (‘block all USB storage apart from x, y, z’), some or all user accounts, and the system logs all device connections for review later.",
    "It's a powerful system, far more capable than G Data's similar Device Control feature, but it's also tricky to set up. There's no simple library of prebuilt rules, and no user-friendly visual rule creator. Instead you're mostly choosing technical options from lists and hoping you understand them correctly (check the Help page on the feature).",
    "Beginners should probably leave the Device Control screens alone, then. It does have real value for businesses, though. Get it working and you can lock down sensitive systems, make it harder for employees to copy sensitive information to their own USB keys (or just infect them with an autorun virus.)",
    "ESET NOD32 Antivirus doesn't have the lengthiest of feature lists. There's none of the generic privacy or security tools you'll often see elsewhere: no password manager, no 'file shredder', no junk file cleaner or anything similar.",
    "The few extras you get are tucked away on the Tools menu. Here, you can view logs, see what the program has blocked, watch running processes, download ESET's bootable SysRescue cleaning tool, and more.",
    "Some of these are a little dubious. The System Cleaner claims to warn you of key Windows settings which have been changed from their defaults, for instance, perhaps because of malware. Sounds great, but in reality it doesn't give you nearly enough information to make a clear decision.",
    "For example, System Cleaner highlighted Windows System Restore on our review system, saying 'Windows System Restore settings allow you to revert your system to a previous state.' Yes. We know that. System Restore was turned on for our system drive, though, so what problem was ESET trying to describe? We've no idea.",
    "It's the same elsewhere, with for instance System Cleaner telling us it would like to reset our 'System folders configuration' and 'Executable files configuration' but without offering any explanation as to why, or what changes it wants to make. Why should we allow ESET to reset whatever it's complaining about, when we've no idea what that is? Simple answer: we shouldn't, and neither should you.",
    "There's much better news elsewhere, fortunately. ESET SysInspector is a particular highlight, an excellent tool which takes a snapshot of your system and highlights interesting items: running processes, network connections, critical files (HOSTS), important Registry entries and more. It's not for beginners, but if you've used extended task managers like Sysinternals' Process Explorer you'll soon feel at home.",
    "An interesting antivirus that boasts some expert-level tweaks and tools, but is let down a little by very mixed results from the independent testing labs.",
    "IF ESET NOD32 Antivirus looks short on features, that's probably because the company has saved most of its tools for ESET Internet Security.",
    "Upgrading gets you a firewall, for instance. A spam filter. Parental controls, webcam protection, network monitoring, extra network attack and botnet protection, plus an anti-theft feature for Windows. And an Android app, too.",
    "All this can be yours for just $50 for a single device, one-year license. That's only $10 more than an equivalent ESET NOD32 Antivirus license, and you can save even more money by adding devices and years.",
    "Is the suite really worth your time, though? Let's see.",
    "Install most security suites and you'll get a firewall that blocks network attacks, and makes at least some effort to intelligently decide which of your apps should be allowed to make internet connections, and which should be blocked. Suites from providers including Bitdefender and Symantec do a great job of making these decisions all on their own.",
    "Install ESET Internet Security and its firewall starts in automatic mode, which allows all outgoing traffic without making any filtering attempts, and blocks uninitiated traffic from the web. That has a little value in a technical sense, but you could do much the same with Windows' built-in firewall.",
    "The first problem here is that, unless you go exploring the Firewall settings, you may never realize there's no filtering for outbound traffic. If a process tries to get online, it can.",
    "The second problem is that even if you spot the issue and enable ESET's alternative Interactive Mode, the firewall still won't make any decisions itself, and instead asks you whether it should trust any application which makes an outbound connection.",
    "We do mean any application, too. While smarter firewalls might know to trust Chrome, for instance, ESET's offering raised an alert.",
    "You could make this go away forever in a few clicks, by telling ESET to allow Chrome in future. But while that's easy with an obvious process like Chrome, it's not so clear when you're looking at something like '64DriverLoad.exe is trying to communicate with remote site 255.255.255.255'. Even experts aren't going to be able to give a definitive verdict on every prompt, at least not without some explanation, and the more prompts there are, the more likely users will click 'Allow' just to make them disappear.",
    "ESET also offers a firewall Learning Mode which the company says 'automatically creates and saves rules according to predefined parameters.' Sounds easier, but ESET also warns that the mode is intended for initial configuration only, and shouldn't be used permanently, which doesn't sound encouraging. If you need outbound filtering long-term it seems like you'll be the one making all the key decisions.",
    "ESET's spam filter is a capable junk mail blocker which works by integrating into Microsoft Outlook, and, just in case anyone is still using them, the ancient Outlook Express, Windows Mail or Windows Live Mail.",
    "Although that sounds very dated, the Outlook extension is surprisingly capable. You can choose whether to scan incoming, outgoing and read emails, select an action to take (delete, move to the Junk or a specified folder), add custom text to the subject line, and log the spam score to understand any false detections.",
    "There's even the ability to process all the existing emails in the current folder, perhaps to clean up a cluttered Inbox because you've not had a decent spam filter before.",
    "Properly measuring antispam accuracy takes a very long time and a large number of samples, but to get an idea of ESET's capabilities, we presented it with 100 emails flagged as spam (some correctly, some not) by the commercial SPAMfighter.",
    "The results were good, with ESET correctly marking 84% of the messages as spam, and recognizing that 10% of messages incorrectly flagged by SPAMfighter were legitimate. It did let through six junk mails, but we can forgive that if a spam filter is less likely to block real messages, and overall ESET's mail filter worked very well.",
    "The company doesn't boast about it, but ESET Internet Security includes webcam protection which aims to prevent your webcam from being hijacked by malicious apps.",
    "We tried this out by running an obscure command line tool to grab a webcam image, and ESET noticed it immediately, popping up a warning, and not allowing webcam access until we had approved the app.",
    "This is powered by a very configurable rules-based system, so you can always allow access to some apps, always block others, maybe prompt for a few, or, if you never use the webcam, just automatically block everything. You don't have to explore these rules if you're not interested – ESET will manage everything automatically – but we're happy to have the option.",
    "The Banking and Protection feature opens your default browser in a hardened form which ESET says makes it more difficult for keyloggers to capture personal data. We tested this with a keylogger of our own, and it worked as advertised; we captured keypresses in other apps, but not the browser.",
    "ESET's Parental Controls are also very basic, with support for content filtering but nothing else, not even basic functionality like restricting internet access or device use by time. It works, but doesn't add a lot of value to the package.",
    "ESET's Anti-Theft feature works much like many competitors, and may enable you to track your device location, use webcam image capture to get a view of its location, or send a message to its finder. There are plenty of mobile services which do much the same, but it's good to have one that covers Windows.",
    "Elsewhere, ESET's Connected Home Monitor lists devices connected to your network and raises alerts for any new connections. It can scan your network for open ports, weak router passwords and other vulnerabilities, too. The module didn't find anything interesting for us, but it's worth a quick check, anyway.",
    "ESET Internet Security also adds support for Android to its Windows, Mac and Linux lineup.",
    "That's not quite as big a deal as it sounds, because ESET already offers a free version of its Mobile Security and Antivirus app. It's not advanced - just Antivirus and real-time protection - but it could be all you need.",
    "Upgrading does include a pile of extras though, from mobile versions of the desktop tools (anti-theft, banking protection, Connected Home network monitor), to an app locker, a security audit for your apps, and more.",
    "There's nothing surprising here, but the app does score well for protection, with AV-Test's July and September 2020 tests giving it full marks in every category. (If you're primarily interested in Android protection, though, you can trial ESET's premium Android features for 30 days without having to set up or register Internet Security.)",
    "ESET Internet Security has a long list of features, and some are impressive, but others are underpowered and can't match the competition. If you're an ESET fan or need this precise feature set, the suite might be interesting, but everyone else will find better protection elsewhere.",
    "Top-of-the-range security suites usually add some major new features to tempt potential customers, like the full VPN access you'll get with Avira Ultimate.",
    "At first, ESET Smart Security Premium looks relatively disappointing, with the package only adding a password manager and file encryption system to the ESET Internet Security feature list.",
    "In reality, the suite is better than it sounds. The password manager isn't the usual underpowered app you'll get with some security suites, for instance – it has a surprising number of features. And the encryption system uses the same DESlock technology as ESET's business-oriented Endpoint Encryption products.",
    "Pricing starts at a reasonable $60 for a single device, one-year subscription. There are discounts as you add more devices and years, but these aren't as good as you'll see with some vendors, so ESET Smart Security Premium can seem relatively expensive if you're covering a lot of devices.",
    "Is the suite worth a look? That's your call, but these are the extras you'll get.",
    "ESET's Password Manager isn't as powerful as specialist standalone apps like Dashlane and LastPass, but it's smarter than the efforts you get with most security suites, and it covers the basics well enough.",
    "Wide platform support includes apps for Mac, Android and iOS, and browser extensions for Chrome, Firefox, Edge and more.",
    "You're able to import passwords from Chrome, Firefox and a range of other password managers (1Password, Bitwarden, Dashlane, LassPass, more.)",
    "Once you're up and running, the browser extensions allow you to generate secure passwords, saving your credentials, syncing them across all your devices and automatically filling in web forms.",
    "You can also create one or more Identities, with personal details which can automatically be entered into web forms: name, address, date and place of birth, common forms of web ID (email address, Skype name, Yahoo ID), credit card information and more.",
    "The service highlights particularly weak and reused passwords, helping you spot potential problems before any vulnerable accounts are hacked (well, hopefully).",
    "The Password Manager isn't about the browser extensions, though. A native Windows app enables browsing your logins and launching whatever sites you need. A Sharing Center can securely share data with other ESET users, and it's even possible to capture and reuse passwords for Windows applications, as well as websites.",
    "There's plenty of functionality here, and the Password Manager was heading for a thumbs up. Then, unfortunately, a disastrous update meant the app largely stopped working, we lost access to our passwords, and a sudden mass of one-star reviews on the app stores told us we weren't alone.",
    "We're not counting that as a major black mark for ESET. It was a major usability issue, but our credentials weren't compromised and the problems should all be fixed by the time you read this.",
    "We can't entirely ignore such a serious bug, though, and neither should you. If you're planning to make use of the password manager, take the full 30 days of the trial, and test it, in-depth, with every app and browser extension you intend to use.",
    "ESET's Secure Data allows you to create an encrypted vault on a hard drive, USB stick or other device.",
    "Open the vault with the correct password and it acts like a virtual drive or folder. Save or copy files to the vault and they're automatically encrypted; open or view them and they're decrypted. You don't have to worry about the technicalities, though, because the vault works just like any other drive or storage device.",
    "Once you're logged out, though, the vault is inaccessible to any else. If you lose a protected USB key and the finder plugs it into another computer which doesn't have ESET's Secure Data installed, they won't see the encrypted folder. If they have Secure Data they'll be prompted for the password, but unless they know or can guess it, your data will be safe.",
    "Secure Data is a simple and effective way to protect your most important files from snoopers, and it's not a feature you'll get with most security suites. You can get freeware tools that perform similar tasks, though, and on balance we're not sure Secure Data or the Password Manager are enough to justify signing up for ESET Smart Security Premium. Issues and limitations with ESET's suites mean ESET NOD32 Antivirus is our pick of the range."
  ],
  "headers": {
    "17": "Interface",
    "23": "Antivirus",
    "29": "Protection",
    "37": "Blocking malicious sites",
    "44": "Device control",
    "48": "More features",
    "54": "Final verdict",
    "59": "Firewall",
    "66": "Spam filter",
    "71": "More features",
    "88": "Password manager",
    "98": "Secure data"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "ESET NOD32 Antivirus": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1446952930327717400/https://www.eset.com/us/home/for-windows/",
    "ESET Internet Security": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2189765046364092200/https://www.eset.com/us/home/for-windows/",
    "Bitdefender Internet Security": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "ESET Smart Security Premium": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1058890485956787600/https://www.eset.com/us/home/for-windows/",
    "October 2020 Performance test": "https://www.av-comparatives.org/comparison",
    "July-October 2020 summary report": "https://www.av-comparatives.org/comparison",
    "August and October 2020 Home Windows User tests": "https://www.av-test.org/en/antivirus/home-windows/manufacturer/eset/",
    "July-September 2020 Home Anti-Malware Protection report": "https://selabs.uk/reports/epp-home-20q3-anti-malware-testing",
    "Mobile Security and Antivirus app": "https://play.google.com/store/apps/details?id=com.eset.ems2.gp",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "password manager": "https://www.techradar.com/best/password-manager"
  }
}