{
  "source": "https://www.techradar.com/reviews/benq-zowie-xl2546k",
  "title": "BenQ Zowie XL2546K review",
  "category": "computing",
  "updated": "2021-03-30T00:32:57Z",
  "author": "nick-ross",
  "summary": "The latest in old-school, cutting-edge and ancient gaming-monitor tech for modern-day eSports professionals",
  "verdict": "When it comes to the old-school monitor technology that competitive FPS gamers like, this represents the pinnacle of evolution.",
  "pros": [
    "Outstanding performance for first person shooters",
    "Zero ghosting or blur",
    "Great stand and monitor housing"
  ],
  "cons": [
    "Poor for watching movies or design work",
    "No HDR, FreeSync or G-Sync",
    "Premium price"
  ],
  "article": [
    "In a world where gaming monitors are competing to offer the fastest refresh rates, best viewing angles, biggest curved screens, brightest colors and most jaw-dropping HDR contrast – all in an effort to make the latest games look pretty – BenQ’s latest Zowie XL2546K stands to the side, looking on with a pitiful disgust. This is a monitor that has been designed, first and foremost, to play an eight-year old game at a world championship-winning level. If competitive FPS gaming is not so much your life but your profession (or at least something you take extremely seriously) the Zowie XL2546K has been designed for your needs above all other considerations.",
    "This 24.5-inch 1080p monitor comes with a matte anti-glare coating and doesn’t just use the ancient TN panel technology to reduce the image ghosting and blur that’s inherent in LCD panels, it has a 240Hz refresh rate to add an extra layer of motion smoothness and further reduce ghosting and blur. These features are not unique in the market, but BenQ’s skunkworks Zowie team has layered its proprietary “DyAc+” technology on top of all this to minimise ghosting and blur to the point where even spray firing, recoil control and screen-shake caused from explosions can leave your crosshair and enemies displayed in sharp relief. BenQ itself says that some of the image enhancements offer only a 1% improvement that won’t be perceptible to everyone, but international Counter-Strike: GO tournaments have been decided by smaller margins.",
    "It’s not only the panel technology that has been designed for pro gamers, but the ergonomics too. The screen doesn’t just offer generous adjustments in terms of tilt, height and swivel, all of these increments are measurable with embossed notches so you can sit-down and adjust everything to near-millimeter accuracy without having to eyeball your setup. This is incredibly important at tournaments where competitors share screens and is useful for more casual gamers who want to instantly set up their monitor after transporting them to LANs (or similar). To this end, there’s even a carry handle at the top and a PVC screen-protector included in the box.",
    "In addition to this, the base has been reduced in size and protrudes less in front of the screen without impacting stability. This is so that pro-gamers who sit inches away from the screen, with a heavily angled keyboard and mouse (as shown below), won’t be impacted in their peripheral placement.",
    "The BenQ Zowie XL2546K is available now and costs around $499 in the US, £480 in the UK and AU$749 in Australia.",
    "Despite the BenQ Zowie XL2546K being all about function over form, it’s not ugly thanks to red color accents punctuating the uniform black, plastic chassis. The screen swivels, 45º left and 45º right from the base to enable competitive gamers to quickly choose the incremental degree of rotation without trial and error. At the rear there are also embossed increments to allow for similarly generous adjustments to tilt (-5º to +23º) and height (15.5cm) with the latter offering a slider for help with alignment. It also rotates 90º... which won’t help with performance but makes accessing the rear-ports much simpler. A red, plastic-lined, cable-tidy hole in the stand allows for a modicum of cable management and two ‘shield’ panels can be affixed to the sides to help combat ambient glare and act as a sight-screen for distracting backgrounds.",
    "The monitor’s bezel isn’t particularly thin at 13mm, so it’s not great for tiling. The screen itself is held firmly by the small-footprint base. Behind the screen, at the top left, BenQ has added a fold-down hook to hang your headset on.",
    "The OSD can be operated by a fairly intuitive mini-joystick and buttons at the rear on the right, but there’s also an innovative ‘S-Switch’ wired remote which makes settings much simpler to access. The centerpiece of this is a multi-directional scroller button which can instantly bring up an OSD display that grants access to the main menu while telling you what settings are set at. The multi-faceted button makes navigating through menus and changing settings a breeze. There are also buttons (one of which is programmable) to change input, go back and cycle quickly between three.",
    "A TN panel with a 240Hz refresh rate will already go a long way to cut out ghosting and blurring with fast-moving images. However, BenQ’s Zowie brand monitors include its bespoke Dynamic Acceleration technology which appears in the XL2546K in the form of its latest DyAc+ iteration. It works by turning the backlight off in between frames to clear the decks of all residual images left in the LCD crystals before showing the next image. It’s a technology we’ve seen before on Samsung TVs, where it introduced an annoying hyperrealism affect that transformed characters in a scene into (distracting) actors on set. However, it also made live sports look more lifelike and generally amazing. On a fast gaming monitor like the XL2546K the effect is designed to eliminate ghosting and make all 240 images per second look as smooth and clear as possible no matter how fast and frantic the action on screen is.",
    "The + in DyAc+ refers to improvements in this generation of the technology: in addition to speed improvements, there is no longer a halving in brightness which blighted the previous generation.",
    "Of course, synchronizing a backlight with a 240Hz display requires some serious technology, so it’s worth noting that if you've got DyAc+ turned on, you can't use either FreeSync or G-Sync, the dynamic-framerate image-enhancement technologies from AMD and Nvidia respectively. (The XL2546K does fully support FreeSync and is G-Sync compatible.) That's arguably irrelevant however, as you won’t need to synchronize fluctuating framerates with monitor frequencies (in order to produce a smoother image) when running old and competitive games at a steady, bazillion fps.",
    "The technology is part of the monitor and so doesn't impact upon input lag. BenQ also states that for peasants console players, “DyAc/DyAc+ is an independent feature built into the monitor that can work on any PC or console but DyAc/DyAc+ will be only active when the input content is 100Hz or above.”",
    "Another potentially useful feature is an app called \"Setting to Share\". This enables gamers to save, export and share their settings so that they needn’t plough through a menu making dozens of adjustments to things like color temperature, brightness, sharpness, saturation, and the myriad other settings that the XL2546K lets you tinker with every time you change game or a new player sits down. The monitor itself can store three user set-ups, but the app allows you to export and overwrite any of them.",
    "If you’ve got used to looking at standard LCD displays over recent years, it doesn’t take long to identify the limitations of a TN panel and understand why the wider industry has evolved away from them. The viewing angles are comparatively poor (especially vertically) with noticeable color inversion occurring when looking from the sides, above or below. Even different parts of the screen look a little different depending on how you're positioned in front of it.",
    "Meanwhile, the backlighting hasn’t been developed with an eye on generating infinite contrast that ranges from sun-burst bright to jet-black. Nor has it sought to eliminate the halo effect, with light bleeding from bright elements on dark backgrounds. And it shows: a game like Ori and the Will of the Wisps, for instance, while being perfectly playable, has elevated the character Ori from a bunny spirit to something akin to a messianic Leporidae with an obvious, outer glow emanating from the screen at all times. The glowing frequently appears in the form of clunkily banded gradients, rather than smooth transitions, too.",
    "But we don’t care about any of that here. You don’t buy the XL2546K to play Ori, you buy it to play CS:GO or games that have been inspired by the franchise’s legacy. There are numerous settings to tinker with to suit each gamer and game, with all of them being designed to make it easier to identify enemies and harder for them to hide in shadows or highlights. Settings include Black ‘eQualizer,’ Color Vibrance, Low Blue Light, Flicker-free and K Locker – all of which decimate the picture in ways that will make game designers cry, but game players kick ass.",
    "With three instantly accessible, professionally designed pre-set combinations built-in plus three combinations of custom settings being saveable to the monitor itself and a limitless number of settings being able to be saved and exported, you can easily choose between multiple elaborate combinations to suit your favorite games and different players. The S-Switch remote makes cycling between them very quick and simple.",
    "In practice, it all works as advertised in CS:GO. It’s very hard to detect any trace of ghosting and blur, no matter how twitchy our twitch reflexes were and, while every person’s preference will vary, every competitive player should be able to find a combination that perfectly suits them and maximizes their potential performance.",
    "As for other games, like Call of Duty and Borderlands, the improvements to the rendering of frantic movements also works very well and still looks good. Dialing back the contrast-ruining settings helps make the games more immersive but, as we’ve mentioned above, there’s no getting away from occasional halo effects and banded color gradients in some situations. Even the buttery smooth motion of Ori and the Will of the Wisps became something that we appreciated, despite the odd graphical aberration.",
    "Using the monitor for regular desktop and office work gave us no significant issues. We actually found it less bothersome than many other (HDR-equipped) gaming monitors which can make you squint to read small text. Beyond the color inversion caused by the mediocre viewing angles, the image is comparable with regular office monitors of a similar size.",
    "As for watching movies in Movie mode, we found that the high refresh rate did little to smooth out panning shots, where juddering objects and backgrounds, plus image artefacts, were common. Colors were washed out and moving your head even slightly highlighted the color inversion issues inherent in TN panels. Movies aren’t unwatchable, but this is the sort of multimedia performance we’d expect from monitors that are over 10 years old.",
    "The BenQ Zowie XL2546K sports three HDMI 2.0 ports, one DisplayPort 1.2 and a 3.5mm headphone jack. It comes with a DisplayPort cable in the box.",
    "If competitive FPS gaming is your profession or your passion, then the BenQ Zowie XL2546K has been made specifically for you. It’s like a stripped-down track-day car that’s designed to do one thing very well at the expense of opulent luxuries like ride comfort, air conditioning, fuel economy, speed bump clearance and a low sticker price. It’s capable for office work too, but anyone who expects and requires high-quality multimedia performance and color accuracy for design work should look elsewhere. Nonetheless, if you’re a top gamer (or want to be one), the BenQ Zowie XL2546K should be at the top of your shortlist.",
    "First reviewed: February 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "5": "Design",
    "8": "Features",
    "13": "Performance",
    "21": "Connectivity",
    "22": "Should I buy the BenQ Zowie XL2546K?",
    "23": "Don't buy it if..."
  },
  "links": {}
}