{
  "source": "https://www.techradar.com/reviews/dyson-omni-glide-review",
  "title": "Dyson Omni-glide review",
  "category": "appliances",
  "updated": "2021-09-07T13:37:47Z",
  "author": "carrie-ann-skinner",
  "summary": "Is Dyson’s newest cordless vacuum, which can lie flat to clean under furniture with low clearance, the best for hard floors?",
  "verdict": "The Dyson Omni-glide is a new type of vacuum for hard floors that can be maneuvered in any direction. Its two-brush-bar cleaning head can cover a wider area in one sweep, and its powerful suction is almost on par with more expensive Dyson models. However, it's expensive compared to rivals offering similar features, and it also has a smaller-than-average dust canister and a short run time.",
  "pros": [
    "Powerful suction",
    "Easy to maneuver into small spaces",
    "Compact and lightweight"
  ],
  "cons": [
    "Expensive",
    "Small dust canister",
    "Short battery life"
  ],
  "article": [
    "When it comes to the best cordless vacuums, each new model on the market seems to be bigger and more powerful than the last. However, Dyson believes there’s a place for compact, lightweight vacuum cleaners designed for hard floors that can easily navigate hard-to-reach spaces, and with this in mind has launched the Dyson Omni-glide.",
    "A new type of vacuum, which sits alongside the recently-launched Dyson V15 Detect Absolute – a cleaner so good that it’s nabbed the top spot in our best vacuum cleaners list – the Omni-glide is able to lie flat on the floor in part because the motor, filter and handle are all aligned, enabling you to easily maneuver it under furniture with low clearance.",
    "It’s smaller and lighter than any of the brand’s current top-of-the-range cordless cleaners, and features what Dyson dubs an ‘omni-directional’ cleaning head – hence the name. The cleaning head has two soft brush bars and four 360-degree castors on the bottom, along with an articulating neck which enables it to be steered in any direction.",
    "According to Dyson, the battery offers up to 20 minutes of runtime, and it’s swappable, so it can be replaced to ensure that interruptions to your cleaning sessions are kept to a minimum, provided you purchase an additional battery or batteries.",
    "The Dyson Omni-glide may be Dyson’s most affordable vacuum to date, but it’s still got a hefty price tag – so can it really revolutionize vacuuming for those with hard floors, or is it simply an expensive gadget that’s nice to have, but not essential? We put it to the test to find out.",
    "The Dyson Omni-glide will set you back $399.99 / £349.99 / AU$599.99, which makes it one of Dyson’s most affordable vacuum cleaners to date, although it’s still relatively expensive compared to many other cordless vacuums.",
    "As we’ve mentioned the battery is swappable, and additional batteries cost $149 / £85 / AU$199.99.",
    "The Dyson Omni-glide certainly looks different to other cordless vacuums from the brand. Rather than a traditional trigger-style handle, the Dyson Omni-glide has a vertical handle, which houses the swappable battery, with a power button on the front, along with another button to switch to maximum power.",
    "The motor, which generates the suction, and the eight cyclones, which generate 98,000g of centrifugal force to ensure that microscopic dust particles remain in the canister, sit below this, followed by the 0.05-gallon / 0.02-liter dust bin.",
    "As we’ve already mentioned, the Dyson Omni-glide is designed for hard floors, and it ships with just one cleaning head, which has two brush bars. These are covered in soft nylon to capture large particles without damaging hard floors, while anti-static carbon fiber filaments collect fine dust at the same time.",
    "It has two power levels: Eco mode, which is the lowest setting, and Max, and can be laid flat while cleaning so that you can maneuver it under furniture and in tight spaces.",
    "The Omni-glide can be converted into a handheld cleaner in the same way as other Dyson vacuums, by removing the main wand and attaching any of the three extra tools it comes with, directly to the dust canister. Weighing in at 4.18lb / 1.9kg, it’s one of Dyson's lighter vacuums too.",
    "Dyson says the battery lasts up to 20 minutes between charges when the cleaner is used on Eco mode, and up to 18 minutes when used on Max. A charging cable and docking station, which enable you to stow the Omni-glide upright, are also included.",
    "In our testing, the Dyson Omni-glide proved very effective at sucking up the fine dust, biscuit crumbs and cereal we sprinkled on hard floors, even on the Eco power setting. It glided easily, and was able to trap all the debris in just one slow pass – we were also impressed that we were able to steer the vacuum in any direction with the lightest of pressure.",
    "Converting the vacuum to handheld mode and back again is easy – as on other Dyson cleaners this requires removing the main wand and cleaning head. However, unlike other Dyson cordless cleaners, the handle is much longer, which makes it cumbersome to use in this mode.",
    "Emptying the Dyson Omni-glide is simple - just disconnect the wand and cleaning head from the canister, then press the button on the back, sliding the canister down. The ‘point and shoot’ mechanism ejects the dust and debris from the canister into a bin in one swift move and works in the same way as other Dyson vacuum cleaners, although the canister is the smallest we’ve seen on a Dyson vacuum, so will need regular emptying if you have a larger home.",
    "The rest of the vacuum is easy to clean too – we love that the bin and filter can be washed in warm soapy water, and the soft brush rollers can be quickly detached from the cleaning head so that they can be cleaned too.",
    "On its lowest power setting the vacuum was reassuringly quiet; however when switched to Max mode the Dyson Omni-glide hit 81db on our decibel meter, which is the equivalent of a truck travelling down the road at 40mph, making it one of the louder cordless vacuums we’ve tested.",
    "As we’ve mentioned, Dyson claims the Omni-glide’s battery will last up to 20 minutes on the lower Eco power setting before it needs recharging, and during testing we found the battery lasted the full 20 minutes; however we were disappointed that there’s no battery level indicator to let us know when we’re running low on power.",
    "The battery, which sits in the vertical handle, is swappable, and can be easily removed by releasing the clip on the top of the handle and replaced with a fully charged one. It took around 3.5 hours to fully recharge the battery, which isn’t the quickest, so if you have a larger home you’ll certainly want to consider investing in a second battery.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "5": "Dyson Omni-glide price and availability",
    "7": "Design",
    "13": "Performance",
    "18": "Battery life",
    "20": "Don't buy it if.."
  },
  "links": {
    "best cordless vacuums": "https://www.techradar.com/news/best-cordless-vacuum-cleaner",
    "Dyson V15 Detect Absolute": "https://www.techradar.com/reviews/dyson-v15-detect-absolute",
    "best vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}