{
  "source": "https://www.techradar.com/reviews/xiaomi-poco-x3-pro",
  "title": "Xiaomi Poco X3 Pro review",
  "category": "phones",
  "updated": "2021-05-14T15:04:59Z",
  "author": "andrew-williams",
  "summary": "A budget gaming monster phone",
  "verdict": "The Xiaomi Poco X3 Pro is the best gaming phone you can get for the cash at the time of review, with impressive power and a sharp, smooth screen, but camera quality takes a hit in return.",
  "pros": [
    "Superb gaming performance",
    "Long battery life",
    "Impressive 120Hz screen"
  ],
  "cons": [
    "Relatively weak camera",
    "No 5G",
    "Large and heavy"
  ],
  "article": [
    "The Xiaomi Poco X3 Pro sounds like the upgraded version of the brilliant and affordable Xiaomi Poco X3 NFC, right?",
    "It is. And it isn’t.",
    "The Xiaomi Poco X3 Pro has a much better processor than the Poco X3 NFC. This has to be one of the very best Fortnite/CoD/Insert Game Here phones you can get at the price.",
    "However, in some respects the Poco X3 NFC is better. Its camera is superior, and not just because it has more pixels, 64MP to the Poco X3 Pro’s 48MP. The Pro tends to smudge fine detail, and demonstrates poorer mid-tone contrast than the best in this class.",
    "Is it a flat-out bad camera? No, but you can get much better.",
    "All this really means is you don’t get the Xiaomi Poco X3 Pro’s excellent Snapdragon 860 chipset for free. There are compromises.",
    "Thankfully, they are largely found in the camera. The Xiaomi Poco X3 Pro’s 120Hz screen is great, battery life is excellent and, as you’d hope, there are no basic performance problems in Android.",
    "Sure, we wish it had 5G. It doesn’t. You can now buy the Moto G 5G Plus for similar money, and it has 5G. But will being able to play games at similar frame rates as last year’s top-end phones matter more to many? Of course it will.",
    "The Poco X3 NFC is arguably a better-balanced phone than the X3 Pro. Camera quality counts for a lot, but this is yet another demonstration of the sheer value you get with a Poco-series Android.",
    "Xiaomi announced the Poco X3 Pro in March 2021. It's out now and starts at £199 in the UK, and around $250 in the US - though in the UK that's as a result of reductions from its £229 RRP, while in the US it's only available through third-party channels, so the price varies more. The price converts to roughly AU$320, but it's not currently available in Australia.",
    "That's for 6GB of RAM, but for just a little more money you can get a version with 8GB.",
    "As those prices show, this is just slightly more expensive than the Poco X3 NFC. Xiaomi hasn’t used the ‘Pro’ title and the phone’s new chipset to squeeze too many more dollars out of us. Thanks, Xiaomi.",
    "The Xiaomi Poco X3 Pro looks a lot like the Poco X3 NFC. And some of you are going to hate it.",
    "There’s a very large ‘Poco’ logo printed on the layer under the back cover. Buy one of these and you can’t help but advertise for the brand every time you leave the phone on a table.",
    "However, at least it’s not quite as bad as the ‘Dare to Leap’ slogan etched into some Realme rivals. A brand name is one thing, but a Facebook-grade inspirational quote? No thanks.",
    "The back of the Xiaomi Poco X3 Pro is dressed up to look like dual-finish strips of matte and glossy glass. It is all-plastic, though.",
    "Xiaomi used rear glass in 2020’s Poco X2, but this phone and the Poco X3 NFC are largely plastic. There’s no glass bar the screen cover and top-most protective camera layer.",
    "This is common among cheaper phones. Glass was once fairly common. Now it isn’t.",
    "Other parts are typical of a value-first phone. The Xiaomi Poco X3 Pro has a fingerprint scanner on its side, rather than an in-screen one, but it’s great. It hasn’t, to the best of our recollections, failed recognition once during testing. And it feels fairly quick.",
    "You get a headphone jack, and there are stereo speakers with good maximum volume and enough mid-range output to avoid sounding thin. We’ve listened to hours of podcasts on the Xiaomi Poco X3 Pro. It did the job well.",
    "When playing a game or watching movies you might notice the speaker above the screen sounds less powerful than the one on the bottom, but it is still far better than a mono speaker.",
    "The Xiaomi Poco X3 Pro also has an IR blaster, the little black dot on the top of the phone. This is used by the Xi Remote app to function as a universal remote. And while its library doesn’t have the commands for all our gear, we’re not going to complain about a more-or-less free feature. And we have some obscure techy stuff at home.",
    "The Xiaomi Poco X3 Pro is a fairly large phone. It’s 76.8mm wide. That’s wider than a Samsung Galaxy S21 Ultra or the nearer-in-price 21:9 aspect Moto G 5G Plus.",
    "We haven’t minded too much, choosing for once to live like a rebel and not use a silicone case. But with a case attached, the Xiaomi Poco X3 Pro may be a struggle for some hands.",
    "However, it does at least have basic IP53 water resistance, giving it a fighting chance against splashes.",
    "We can blame the screen for the Xiaomi Poco X3 Pro’s larger size. And, well, it’s worth it.",
    "This is a 6.67-inch IPS LCD screen with a 1080 x 2400 resolution and a 120Hz refresh rate. First, second and third impressions are great.",
    "The Poco X3 Pro's screen looks sharp, color is bold, and the fairly large size instantly gives you the sense it’s made for games, video, and other stuff the enthusiast Poco crowd would enjoy. Poco phones seem to be popular among people who like to get a lot of tech for their cash.",
    "Having a 120Hz screen at this price is excellent. And switching between 60Hz and 120Hz, an option here, shows there’s a real boost to Android menu scrolling at the higher refresh rate.",
    "This is an LCD screen. It does not have perfect contrast, but we didn’t actually find raised blacks too noticeable even in a very dark room, at least with mixed content. You’d want an OLED if you spent a lot more, and its fast-responding pixels would make better use of the 120Hz refresh rate. But at this level? No major complaints.",
    "The one other quirk is unlikely to bother too many people. Xiaomi puts two color intensity modes in the Poco X3 Pro, Standard and Saturated. Both are ‘hotter’ than the traditional sRGB color standard, so there’s no true relaxed color mode here. But this is probably more a sign we spend too much time looking at phones than anything else.",
    "Brightness is not class leading. It seems to get a slight 'turbo' boost outdoors on bright days, but nothing close to flagship-like power.",
    "The cuts that Xiaomi made to accommodate a relatively high-end processor at a low price are felt most keenly in the Poco X3 Pro's camera.",
    "On paper it has typical hardware for this class. There's a 48MP primary camera, a basic 8MP ultra-wide, and two terrible 2MP macro and depth cameras. We’re fine with the numbers. We're used to ‘filler' cams in affordable phones.",
    "However, the Poco X3 Pro’s main camera performs noticeably worse than some of the alternatives, including Xiaomi's own Poco X3 NFC and Redmi Note 10 Pro.",
    "Texture details those family members would draw with surprising clarity are obfuscated into mush through the X3 Pro’s eyes. Mid-tone contrast is significantly worse, and it seems to make greater use of detail-eradicating noise reduction.",
    "Images are relatively soft, and the softness kicks up a level in the ultra-wide, as is to be expected from a budget 8MP sensor.",
    "The main camera performance is the sort of thing we used to see quite commonly in phones with Samsung sensors, a few years ago. But the Poco X3 Pro has a Sony IMX582 sensor.",
    "Xiaomi uses it in the even cheaper Redmi Note 10, which tells us cost is likely the issue here.",
    "Time for a little context. This camera is not an embarrassment. The Poco X3 Pro can take nice photos, better ones than the Microsoft Surface Duo (original cost $1400 / about £1,075), which we tried recently. And it has a handy night mode that makes a huge difference to images’ dynamic range and brightness.",
    "However, it is outperformed by the Realme 8 Pro, Redmi Note 10 Pro and Xiaomi Poco X3 NFC. This is a big issue if you value camera performance over gaming power.",
    "The selfie camera is pretty decent, though. It uses a 20MP sensor, just like the more camera-focused X3 NFC.",
    "Video tops out at 4K 30 frames per second, but there is proper stabilization for smoother clips.",
    "The Poco X3 Pro lost ground in the camera section of this review, but it makes up a good deal of it with its chipset. That’s the Snapdragon 860, a processor that should interest many of you.",
    "It’s a mid-range chipset with power similar to the Snapdragon 855 Plus, used in phones like the Asus ROG Phone 2 and OnePlus 7T.",
    "Yes, they are old, 2019 phones. But the older 8-series Snapdragon chipsets are still more powerful than today’s 7-series ones.",
    "The Poco X3 Pro is the best budget Fortnite phone you can get, at the time of review. Aside from short drops when loading new textures, this phone sticks glue-like to the maximum 30fps. It probably deserves a crack at the 60fps mode Epic Games unlocks for some high-end phones.",
    "If you want serious gaming power for next-to-no cash, the Poco X3 Pro is a killer choice. Other phones may get the Snapdragon 860, but they don’t have it at the time of review.",
    "The phone scores 2,530 points in Geekbench 5, far greater than the 1,800-ish of Snapdragon 765G phones like the OnePlus Nord. It roughly matches phones like the Samsung Galaxy S20 and OnePlus 7T.",
    "As you’d hope, then, Android runs perfectly on the Poco X3 Pro too. However, the truly notable performance improvement over less powerful phones like the Poco X3 NFC is in high-end games such as Fortnite and ARK: Survival Evolved.",
    "The Snapdragon 860 is paired with 128GB or 256GB of storage and 6GB or 8GB of RAM. Our review Poco X3 Pro has 6GB of RAM, so your experience should be at least as good as ours.",
    "This phone runs Android 11 with Xiaomi’s MIUI 12 software on top. This is fairly inoffensive, but its icons look, to our eyes at least, far too big fresh out of the box.",
    "One of the first things we did was to open up the ‘home’ settings, shrink the icons slightly and fit in more per page. You’ll see the result in the images here. A display this big deserved five columns of icons, not four.",
    "The Poco X3 Pro has a 5160mAh battery, just like the Poco X3 NFC. Its stamina is similarly impressive, even with a much punchier processor.",
    "We left the 120Hz display mode switched on during testing and were routinely left with 40% or more charge remaining by the end of the day.",
    "On one day we kept a closer eye on the level. After starting the day at 7am, we still had 48% left by 11:30pm. That was after a solid day of use, including some browsing, a short gaming session, and a lot of audio streaming.",
    "It lost several more percent of charge overnight and needed to be plugged in by lunchtime on day two. However, if you’re a lighter user you can expect the Poco X3 Pro to last two full days.",
    "There are obvious benefits here for gamers, and we don’t think many should buy the Poco X3 Pro if they don’t care about gaming at all. You can play for, say, an hour a day and still not worry about whether it will last until bedtime. Stamina is impressive.",
    "Charging speed is good enough too. The Poco X3 Pro comes with a 33W charger that takes the phone from flat to 59% in 30 minutes. Or to 100% in 59 minutes.",
    "This isn’t sensationally fast like the OnePlus 9, but considering the lower price and the high capacity of the battery itself, it’s a winner. Of course, there's no wireless charging at this price.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Xiaomi Poco X3 Pro price and availability",
    "12": "Design",
    "25": "Display",
    "32": "Camera",
    "43": "Performance and specs",
    "53": "Battery life",
    "60": "Don't buy it if..."
  },
  "links": {
    "Xiaomi Poco X3 NFC": "https://www.techradar.com/reviews/xiaomi-poco-x3-nfc",
    "Moto G 5G Plus": "https://www.techradar.com/reviews/moto-g-5g-plus-review",
    "Poco X2": "https://www.techradar.com/reviews/poco-x2",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "Redmi Note 10": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-india",
    "Microsoft Surface Duo": "https://www.techradar.com/reviews/microsoft-surface-duo",
    "Realme 8 Pro": "https://www.techradar.com/reviews/realme-8-pro",
    "Asus ROG Phone 2": "https://www.techradar.com/reviews/asus-rog-phone-2-review",
    "OnePlus 7T": "https://www.techradar.com/reviews/oneplus-7t",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review"
  }
}