{
  "source": "https://www.techradar.com/reviews/audio-pro-a36",
  "title": "Audio Pro A36 review",
  "category": "audio-visual",
  "updated": "2021-12-06T16:22:51Z",
  "author": "simon-lucas",
  "summary": "Have a good time, all the time",
  "verdict": "Smart and stylish, compact and manageable, ergonomically excellent and with as perky a sound as it’s possible to imagine, the A36 may not be perfect but they’ll be perfect for some.",
  "pros": [
    "Lively, upfront sound",
    "Usefully compact and nicely finished",
    "Fine control app"
  ],
  "cons": [
    "Hardly the most faithful speakers",
    "Low frequencies want to dominate",
    "Can get tiring at high volumes"
  ],
  "article": [
    "Audio Pro has this down to a fine art now. With the A36 it’s delivered a compact, attractive and nicely made pair of (fairly) wireless speakers that are no effort at all to set up, to get working or to integrate into a wider Audio Pro system.",
    "Connect the powered left speaker to the passive right, plug the powered speaker into the mains and then make the connections you need to make. Wireless if you prefer, or using physical inputs that include HDMI ARC so you can easily involve your TV in the Audio Pro ecosystem. And then strap in while the A36 do their full-on, large-scale, thoroughly energetic audio thing.",
    "No, these stereo speakers aren’t the last word in fidelity, and they are constantly this close to getting carried away where the lower frequencies are concerned. But if it’s excitement and entertainment you crave along with a big serving of convenience, you’re invited to give the Audio Pro A36 a thorough once-over.",
    "The Audio Pro A36 wireless floorstanding speakers are on sale now, and in the United Kingdom they’ll set you back £799 for a pair. In the United States, you’re looking at $899, while should you a) fancy a pair and b) live in Australia you should expect to hand over AU$1195.",
    "Obviously the world’s not short of stereo speakers with amplification and streaming smarts built in - at the moment it’s KEF’s LSX standmounters (£999) that set the standard. But at this price, the A36 don’t have an awful lot of floorstanding, multiroom-capable opposition… so perhaps this slender gap in the market is about to be filled.",
    "Not for the first time, Audio Pro has delivered a product that manages to look discreet, purposeful and chic all at the same time. The A36 floorstanders are compact (a miniscule 832 x 190 x 210mm), look good in fairly undemonstrative way (matte white or matte black finishes are available) and prove helpfully flexible about positioning, despite a fairly hefty rear-firing bass reflex port.",
    "Not for the first time, Audio Pro has (relatively speaking) gone to town where specification is concerned. Both speakers feature a 25mm textile dome tweeter above a pair of 114mm mid/bass drivers, from which Audio Pro is claiming a frequency response of 35Hz - 25kHz. The passive speaker of the pair also has a pair of speaker-cable binding posts on its rear panel, just below the bass reflex port. It’s here that a connection is made to its powered partner.",
    "The powered speaker is, of course, where the bulk of the action is. It forms the left channel of the system, and it’s home to two 75-watt channels of Class D amplification as well as featuring all wired and wireless connections. Wirelessness is dealt with by Wi-Fi and aptX Adaptive Bluetooth connectivity, while the physical sockets extend to HDMI ARC, analogue 3.5mm, digital optical input and a pre-out for a subwoofer. Plus a socket for mains power, of course, and a corresponding pair of speaker binding posts.",
    "Control options for the A36 are extensive and universally well implemented. There’s a tactile little metal and plastic remote control, with all major functions handled - plus five ‘preset’ buttons for storing favourite radio stations and playlists. Or you might prefer to use Amazon Alexa.",
    "Probably best of all, there’s the Audio Pro Control app, which puts a whole host of functionality at your disposal. It’s here you can involve your favourite streaming services (headliners include Spotify, Tidal, Deezer, Amazon Music, Qobuz, vTuner, TuneIn and plenty more), establish an Audio Pro multiroom system, select your source, adjust bass and treble response, and set an alarm. It’s not quite as clean or instinctive as the all-conquering Sonos control app, but it’s not all that far behind - which is about as big a compliment as it’s currently possible to pay.",
    "An HDMI ARC socket is a straightforwardly good idea, of course, and there’s no two ways about it: route your TV through the A36 and it’ll sound altogether bigger, burlier, more detailed and more engrossing than it has a hope of sounding by itself. But if you really want to know what a pair of floorstanding speakers is capable of, don’t give them a news broadcast to deal with. Instead, let them play some music.",
    "With a TIDAL account integrated into the control app and a 16bit / 44.1kHz stream of Nick Cave & The Bad Seeds’ Nature Boy playing, the A36 don’t take long to reveal themselves. If you prioritize punch, drive and attack as an attitude over outright insight or fidelity, read on. Audio Pro has a pair of wireless speakers with which to tempt you.",
    "In all honesty it’s not fair to imply the A36 don’t have insight or fidelity - it’s just that they don’t consider those attributes to be anywhere near as important as energy, excitement or all the other up-and-at-’em attributes they make a big deal of. From the bottom of the frequency range to the top, the A36 are all about entertainment.",
    "They control the top of the frequency range pretty well - in extremis it’s not beyond a little splashy hardness or edginess, but at realistic volumes and with sympathetic material, the Audio Pro strike a sensible balance between substance and attack.",
    "It’s a fairly similar story at the opposite end; bass sounds are decently textured and detailed, but that’s secondary to their outright presence. Control of the entry and exit from individual bass sounds is reasonably disciplined, but the A36 prize punch and heft far more than a perfectly straight edge. So despite their fairly easy-going positioning, you’re nevertheless advised to find them a bit of free space in your room in which to do their thing. Or, at the very least, try to avoid backing them up close to a wall.",
    "In between, there’s a very pleasing amount of detail extracted from the midrange, and despite that fulsome low-end presence, vocals manage to exist securely in a little pocket of space. There’s enough information retrieved to make a singer like Cave sound every bit as characterful, as emotive and as approximate in his pitching as can be. Integration between the three drivers is acceptably smooth, and despite their enthusiasm at either end of the frequency range, the A36 manage to sound fairly unified where tonality is concerned.",
    "In every other respect, too, the Audio Pro reveal themselves to be straightforward and competent. Dynamic headroom is sufficient to allow the peaks and troughs of Metronomy’s Love Letters worthwhile expression while still picking up on the more subtle harmonic variations throughout the same song. They muster decent rhythmic expression, too, so listeners with a preference for the dancefloor should have no qualms.",
    "All of this assumes an EQ setting that’s been left well alone, of course. It’s possible to back off that low-end presence, of course, but that takes quite a lot of the momentum out of the A36 sound at the same time. Equally, you can tone down the mild excesses of the high frequency reproduction, but that renders the overall presentation rather blunt.",
    "No, the Audio Pro aren’t the last word in sonic neutrality or accuracy - but then neither, it seems, do they seek to be. They came to get down and - let’s not beat around the bush - jump around."
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Audio Pro A36 price and release date",
    "5": "Design",
    "10": "Audio performance",
    "19": "Don't buy them if..."
  },
  "links": {
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "stereo speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "KEF’s LSX": "https://www.techradar.com/reviews/kef-lsx",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Deezer": "https://www.techradar.com/reviews/deezer",
    "Amazon Music": "https://www.techradar.com/reviews/amazon-music-hd"
  }
}