{
  "source": "https://www.techradar.com/reviews/amazon-fire-tv-stick-4k",
  "title": "Amazon Fire TV Stick 4K review",
  "category": "audio-visual",
  "updated": "2021-12-03T09:08:23Z",
  "author": "olivia-tambini",
  "summary": "The Amazon Fire TV Stick 4K adds Ultra HD",
  "verdict": "The inclusion of 4K support makes the new Amazon Fire TV Stick 4K a brilliant option for all your streaming needs – although a lack of equity across different platforms means that Amazon hasn’t quite achieved perfection yet.",
  "pros": [
    "Supports 4K streaming",
    "Speedy user interface",
    "Fantastic variety of content",
    "Amazon Alexa voice assistance"
  ],
  "cons": [
    "UI biased towards Amazon",
    "Performance varies between apps"
  ],
  "article": [
    "The Amazon Fire TV Stick 4K is the third version of Amazon's popular streaming device. The biggest difference between this stick and the ones that came before it is that this one has been updated to support 4K viewing.",
    "Having said that, this version of the Fire TV Stick is similar to the second-gen Fire TV Stick in many many ways. It boasts an 802.11ac Wi-Fi chip and a 1.7GHz quad-core processor – but buying one of the 4K-enabled streamers we’re reviewing here still won’t break the bank at under $50.",
    "The Amazon Fire TV Stick 4K also comes with Amazon’s Alexa built-in voice assistant. There's a huge range of content to select from the many apps on offer, including Amazon Prime Video, Netflix, and many more. With lots of streaming options on offer, we can’t help but ask: who really needs a smart TV?",
    "This version of the Fire TV Stick addresses issues we had with the previous Fire TV Stick. However, a couple of small, niggling problems remain that made our experience with this streamer less-than-perfect – although it wasn’t far off.",
    "Since the Fire TV Stick 4K was released, Amazon has pushed further into TVs after it unveiled a number of new Fire TV Edition sets, as well as a second-generation Amazon Fire TV Cube, which is an updated version of its Alexa-enabled hands-free streaming media player, adding Dolby Vision and a few other new features to the mix. We've also seen an update to the basic HD Fire TV Stick (2020) with HDR, and a the highly affordable Fire TV Stick Lite.",
    "What's more, you can now even hook up your Amazon Echo speakers with Fire TV devices, to create an immersive home theater system – totally wireless, and all controllable with voice assistant Alexa.",
    "The Amazon Fire TV Stick 4K is available to buy for $49.99 / £49.99, which works out at around AU$68 based on current conversion rates – however, it's not yet available to buy in Australia and there's so far no word on when Amazon will begin selling it in this territory.",
    "Compared to the non-4K version of the Fire TV Stick, you’re looking at a price increase of around $10 / £10, which we think is very reasonable considering the increased quality of content you’ll be getting with support for 4K, Dolby Vision, HDR, HDR10+ and Dolby Atmos.",
    "Similar products, including Google's Chromecast Ultra, retail for around $69, so the Fire TV Stick 4K is a good option if you’re looking to spend under $50 - still, it’s worth bearing in mind that you will need to buy subscriptions to use many of the apps like Netflix and Prime Video, which can soon add up.",
    "If you’ve used the previous Amazon Fire TV Stick before, you’ll notice that the new version hasn’t changed very much in terms of design.",
    "Measuring 99mm x 30mm x 14mm, the Fire TV Stick 4K is as unobtrusive and compact as ever, designed to plug directly into the HDMI 2.2 port on your TV. The stick itself is a little bit wider than a standard HDMI cable, so Amazon has included a male-to-female HDMI extender cable in case you have trouble fitting it in.",
    "Amazon says the extender cable can also be used to improve the WiFi connection and remote control performance.",
    "The outside of the Fire TV Stick 4K is largely the same as the previous model, only now it features the Amazon arrow logo without any text. On the inside, you have an 802.11ac Wi-Fi chip and a 1.7GHz quad-core processor like before, but now of course, the Fire TV Stick has support for 4K, as well as Dolby Vision and Dolby Atmos.",
    "On the side of the Fire TV Stick 4K you’ll find a micro-USB port to connect the power adaptor.",
    "Now on to the remote; the biggest change here is that it now includes volume buttons and a power button. The inability to change the volume using the the previous model’s remote was a particular sticking point for many users, who found it annoying to constantly switch between it and their TV’s remote, or asking Alexa to change the volume.",
    "The remote therefore can now be used to change the volume on your TV, AV receiver, or soundbar, which is far more convenient.",
    "Like it’s predecessor, you’ll still find a microphone button at the top of the remote, which can be used to summon Alexa without having to say “Alexa” before every command you make.",
    "Setting up the Fire TV Stick 4K is absolutely seamless, thanks to the simple user interface and responsive remote control. During setup, the Fire TV Stick needs to be plugged into the mains as well as the HDMI port on your TV - all the cables and adaptors you’ll need come in the box.",
    "Once you’ve plugged the Fire TV Stick into your TV, you're then prompted to set up the remote – you’ll be walked through the entire process by your TV so you don’t need to worry about leafing through manuals.",
    "Like its predecessor, the Fire TV Stick 4K user interface is extremely easy to navigate, even for those who haven't even used a streaming device before. Recently accessed shows and apps can be found on the home screen, or you can scroll up and across to find different content and apps.",
    "US Fire TV customers will also find a recently added tab on their device's interface; called 'Live TV', it collates all your live channels into one place.",
    "As well as being easy to use, the UI is very responsive and quick to load, and there’s a fantastic selection of streaming apps to choose from. To test how easy it is to sign up to a new service, we tried setting up an account with Disney Life through the Fire TV Stick 4K.",
    "The whole process was extremely simple, with the option to link your new account to an existing social media account like Facebook – although the experience will vary between different apps, it’s encouraging that we didn’t run into any issues while setting up accounts with the platforms we don’t already subscribe to.",
    "Using the remote to control the Fire TV Stick 4K is similarly effortless, and the Alexa-powered voice search functionality is quick and accurate when you’re using apps like Netflix or Amazon Prime Video.",
    "However, voice search doesn’t work with every app on the service – UK viewers will notice that you can’t use it with BBC iPlayer, which means you have to manually type search terms within the app. Furthermore, you won’t be able to use your voice to skip to the next episode on many apps that otherwise support voice control, which is slightly annoying.",
    "Another issue we found with voice search is that when you make a request that the Fire TV Stick 4K is unable to support, whatever content you are playing disappears, and you have to then select it again from within the app or Fire TV homepage to start it up.",
    "That being said, the voice search is generally very good, and you can even use voice commands to turn your TV on, control your smart devices, and view live camera feeds from compatible smart security cameras on your TV, which is really useful.",
    "In general, the search functionality is better than the previous model, as you can now search for shows by actor and specifically for 4K content, as well as searching for show titles directly. Amazon’s own content is predictably prioritized above other results from platforms, which could be irritating if you're primarily a Netflix user, for example.",
    "Overall, the selection of apps available is extremely good, and you should be able to find most streaming platforms you can think of – although UK viewers won’t be able to find Now TV, and US viewers won't be able to stream on Walmart's Vudu, which is currently a large source of Dolby Vision content. Still, there's such a huge variety of content, so you probably won’t miss the odd niche app unless you are a diehard fan.",
    "If you want to take your Fire TV Stick 4K abroad – and its portability makes it a great traveling companion – you may want to install a VPN to unlock content from your home country.",
    "Overall, we're impressed with the Amazon Fire TV Stick 4K. The interface is super responsive, quick to load, and it’s set out in an intuitive way.",
    "Navigating through the different apps, shows, and movies is simple, with recently accessed content displayed on the home screen, however, you may find search results overly skewed towards Amazon’s own content if you’re used to using different streaming platforms.",
    "Speaking of, the lack of consistency across different streaming platforms is an issue that affected the previous model of the Amazon Fire TV Stick. Hopefully future updates will provide more parity across the different platforms so that the experience is as streamlined as possible no matter where you watch your content but, for now, it's something we think most folks can look past.",
    "You might also want to check out Roku vs Fire Stick: which streaming video devices are better?"
  ],
  "headers": {
    "6": "Price and availability",
    "9": "Design",
    "17": "Features and performance",
    "30": "Final verdict"
  },
  "links": {
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "second-gen Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Amazon Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Fire TV Edition": "https://www.techradar.com/news/amazon-bets-big-on-you-wanting-an-alexa-smart-tv-with-huge-fire-tv-edition-rollout",
    "Amazon Fire TV Cube": "https://www.techradar.com/news/new-amazon-fire-tv-cube-enhances-your-watching-experience-with-dolby-vision",
    "Fire TV Stick (2020)": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Fire TV Stick Lite": "https://www.techradar.com/reviews/amazon-fire-tv-stick-lite",
    "hook up your Amazon Echo speakers with Fire TV devices": "https://www.techradar.com/news/amazon-echo-speakers-can-now-be-turned-into-a-home-cinema-system-heres-how",
    "home theater system": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Chromecast Ultra": "https://www.techradar.com/reviews/chromecast-ultra",
    "AV receiver": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Live TV', it collates all your live channels into one place": "https://www.techradar.com/news/amazon-fire-tv-gets-new-live-television-section",
    "install a VPN": "https://www.techradar.com/vpn/how-to-install-a-vpn-on-amazon-fire-tv-and-fire-tv-stick",
    "Roku vs Fire Stick": "https://www.techradar.com/news/fire-tv-vs-roku-which-streaming-video-platform-is-better"
  }
}