{
  "source": "https://www.techradar.com/reviews/turtle-beach-battle-buds-review",
  "title": "Turtle Beach Battle Buds review",
  "category": "gaming",
  "updated": "2021-06-04T13:08:33.291Z",
  "author": "dom-peppiatt",
  "summary": "The Turtle Beach Battle Buds prove you can’t argue with value",
  "verdict": "The Turtle Beach Battle Buds are music to a Nintendo Switch player’s ears (no pun intended). Portable, easy to use, and offering great value for more, these plucky little wired buds dominate the market at this wallet-friendly price point. Sure, they’re not going to deliver headset-quality sound (and they may not look amazing), but if you need some headphones to keep in your Switch case for hassle-free travel or commute gaming, these little darlings are essential.",
  "pros": [
    "Remarkable value",
    "Easy to store and use on-the-go",
    "Flimsy, but useful, detachable mic"
  ],
  "cons": [
    "Sound is as basic as it gets",
    "Unstylish",
    "Mic can be overly sensitive"
  ],
  "article": [
    "Perhaps the best thing about the Turtle Beach Battle Buds is the versatility: you can plug the weird-looking Buds into practically anything you play games on. Though primarily targeted at the Nintendo Switch and mobile platforms, the Battle Buds can be used with Xbox Series X/S, Xbox One, PS4, PS5 and beyond – anything with a headphone jack, basically.",
    "So if you’re something of a ‘grazer’ when it comes to gaming (you know, having your main meal at home on your PS5 before having a little Nintendo Switch snack on the train), the buds are going to be your best friend.",
    "Oddly, for such a slight bit of hardware, the earbuds are loaded with a powerful frequency response – and actually produce such aggressive high-end and sharp sounds that it can be uncomfortable if you’re playing something with a lot of treble mix. The bass response is fine – just fine – but then you shouldn’t be expecting some sort of dedicated bass response in little buds like this anyway. The sound stage is good enough to tell you what’s going on in a game at any given time, but don’t get into anything particularly competitive with these guys jammed in your ears.",
    "If you want to take control of your games’ audio, you’ve got a couple of useful options – in-line controls for volume, muting functionality, and multifunction support on mobile devices can’t be sniffed at, especially considering it’s a simple ‘plug and play’ setup. The detachable boom mic is a nice touch… though we’d wager any self-respecting adult wouldn’t want to wear it outside the comfort of their own homes.",
    "If you’re not using these buds for music – weedy bass and aggressive treble aren’t a music-lovers dream, to be honest – these buds are fine. They offer control, present game audio in a cheap and cheerful manner, and won’t break the bank. For an entry-level accessory, you can’t really ask for more.",
    "The Turtle Beach Battle Buds are available from $30 / £25 / AU$45 and are available now. This comfortably fits into the budget end of the headset spectrum: the closest other headset you’ll find in that bracket is the Turtle Beach Recon 70N, and the Corsair HS50 Stereo Gaming Headset will be another step up from that (though we’d wager it’s money well-spent). The Turtle Beach Battle Buds can be plugged into any 3.5mm audio jack, and as such is compatible with PS4, PS5, Xbox One, Xbox Series S, Xbox Series X, Nintendo Switch, and PC.",
    "What you see is what you get with these buds – but that’s not a bad thing. Less moving parts means less to go wrong, after all. We’ve put these buds through their paces and moved them from machine to machine, home to commute, office to bedroom, and they still work just as well as they ever did. You’d think that 1m cable might get bent out of shape or end up patching out sound, but it’s a durable bit of kit – as is the rest of the design.",
    "A control box along the left-hand wire allows you to control the volume, and a mic mute button that’s sometimes a touch fiddly to find in a pinch can be found there, too. If you’re one of the mythical, lesser-seen people that gives a singular hoot about Google Assistant, you’ll find a button for that on the back, too. That button – honestly – is more hassle than it’s worth and has taken us away from the Genshin Impact phone app and into the Assistant app more times than we’d care to mention. Butterfingers, beware.",
    "The big, shield-like triangles aren’t pretty, but they are clever: these lil’ chunks of plastic house the 10mm drivers that power the not-unimpressive sound the Buds can throw out. They’re heavy, which is why those awkward little rubber scaffolds are attached to the inserts, so don’t plan on keeping these in for hours and hours at a time. The aesthetic trade-off, for the sound, is worth it.",
    "What you really care about when it comes to budget gear like this is how well it can perform its primary duty: when it comes to gaming, these Buds are great. Play a shooter, and you’ll hear shots and footsteps where you need to. The detail won’t be as clear as it would in a headset, but then you’re not spending $300 – you’re spending $30. You can make out nice OSTs running the background of your favorite RPG, and even if the bass response is anemic and the treble a bit too aggressive, everything sounds fine. You can wrap your ears around a game with these things in, and that’s what matters.",
    "If you’re playing on a serious console, you’ll likely notice some pretty severe echo in chat over PSN and Xbox Live thanks to the services’ lack of post-processing, and you’ll lose a fair amount of ambient noise in your big, atmospheric RPGs too – but then that shouldn’t be too surprising, given the price. Whack a retro game, or a port of something from the PS2/PS3 era on your Switch, pop these Buds in your ears and you’ll be fine. Just try not to play any audio/visual masterpieces on the bus and you’ll get the most bang for your buck.",
    "Here’s where buds can come a bit unstuck: the mic is remarkably sensitive and picks up a lot of ambient noise, your breathing, and even the boom brushing against your skin. The extra 4g of weight that the little mic adds can be a bit too heavy for the buds on either side of your head, and may cause it to sag and pull against your each a bit (especially if you have those rubber hooks equipped).",
    "The mic is a nice add-on – and can be used to shout obscenities at your teammates if absolutely necessary if you’re playing something competitive in Switch – but it’s not a selling point for these Buds; it’s an add-on, at best. You’re probably better off picking up on of the fully-fledged headsets up top if you’re looking for something that can handle chat."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Turtle Beach Battle Buds price and release date",
    "6": "Design",
    "9": "Audio performance",
    "11": "Microphone quality",
    "13": "Don't buy it if..."
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Turtle Beach Recon 70N": "https://www.techradar.com/reviews/turtle-beach-recon-70-headset",
    "Corsair HS50 Stereo Gaming Headset": "https://www.techradar.com/reviews/corsair-hs50-stereo-gaming-headset",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}