{
  "source": "https://www.techradar.com/reviews/fastvpn",
  "title": "FastVPN review",
  "category": "computing",
  "updated": "2021-11-12T11:13:11Z",
  "author": "mike-williams",
  "summary": "A simple but low-cost VPN from the Namecheap people",
  "verdict": "Seriously cheap for the first year, but you can see why: the desktop apps are unreliable, and there are very features. For unblocking Netflix and basic tasks only.",
  "pros": [
    "1,000+ servers across 75+ locations",
    "Unblocks Netflix, BBC iPlayer",
    "Low prices for the first term",
    "Decent kill switch"
  ],
  "cons": [
    "Below average speeds",
    "Very few features",
    "Various issues with the Windows app",
    "Doesn't unblock Amazon Prime Video, Disney+"
  ],
  "article": [
    "FastVPN is a simple VPN owned by Namecheap, the popular domain registrar and web hosting service.",
    "If you're wondering why you should trust a domain registrar to run your VPN, good question. No need to worry, though; it's using servers run by an arm of StackPath, which has also provided the network for major VPN brands such as IPVanish and StrongVPN.",
    "Whoever owns the network, it's a decent size, with 1,000+ P2P-friendly servers spread across 75+ locations worldwide. Apps are available for Windows, Mac, iOS and Android; tutorials show how to set up the service on Linux and various routers, and, unusually, there are no annoying limits on the number of devices you can connect at one time.",
    "The feature list is basic, though, covering the bare essentials only. You get OpenVPN and IKEv2 protocol support (no WireGuard), secure DNS to reduce the chance of DNS leaks, a kill switch to block internet access if the VPN drops, and that's about it.",
    "FastVPN's starting prices are some of the lowest around, thanks to big discounts off your first term.",
    "Sign up for the monthly plan, for instance, and you'll pay nothing at all for the first month, effectively a 30-day free trial, rising to a still-excellent $5.88 on renewal.",
    "The annual plan is just $1 a month for year one, rising to $2.88 on renewal. There are no longer-term plans (the old three-year option has disappeared.)",
    "These are very low first-term prices (and they're pretty good on renewal, too). Private Internet Access is one of our go-to VPNs for value, but with monthly plans at $9.95, dropping to $3.33 paid annually, it's still no match for FastVPN.",
    "If you are tempted, you're able to by card or PayPal, and there's a 30-day money-back guarantee to protect you if it all goes wrong.",
    "The FastVPN website comments briefly on logging, saying you'll \"keep your browsing activities to yourself with our strict no-log policy\" and that the service \"won’t track, collect, or share any of your logs\".",
    "We searched the website for something more detailed, without any luck. The only extra information we found came from the Windows VPN app installer, which warned that it collected \"aggregated anonymous app usage data, including your device and OS version so we can troubleshoot and improve our app\", but \"that's it\", and that there's \"no tracking of your personal identifiable information\".",
    "We'd like a little more substance than that, and ideally a security or no-logging audit, but that doesn't seem likely to happen any time soon. FastVPN is targeted at the average consumer who wants something easy to use which 'just works', and not the kind of user who cares about session logging or whether it uses AES-256-CBC or GCM.",
    "FastVPN's Windows app opens with a default 'Best Available' server choice, and a 'Connect VPN' button. The client displays the name of your current network, too, a handy way to be sure you're connecting to the official coffee shop Wi-Fi, and not some shady open network nearby.",
    "A location picker to the left gives a list of countries (some with city-level choices), server load and ping time information (you can sort by those, too), simple Favorites system to easily group your most commonly used locations.",
    "Although this looked good in theory, real-world performance was poor. OpenVPN connections took up to 40 seconds, three to four times faster than we usually see, and IKEv2 connections were also poor at 18-20 seconds.",
    "That was just the start. Occasionally, after connecting, we found we couldn't access any websites. Sometimes the VPN dropped, complaining of various internal errors or that there was 'no network detected.'",
    "It didn't help that some of these error messages were layered on top of normal status information, making them difficult to read. Not a huge issue, but it all helps to create a poor impression of the app. We expect better from a big company such as Namecheap.",
    "Settings are relatively limited: auto-start options, a choice of protocol (IKEv2, OpenVPN TCP/ UDP, and a Scramble option to help bypass VPN blocking), and a kill switch to block internet access if the VPN drops.",
    "The app handled unexpected disconnects very well. We forcibly closed our IKEv2 connection, the app noticed, displayed a notification and reconnected at once. So, we closed the connection again, then kept closing it, as fast we could, interrupting every reconnect attempt. That's a level of stress testing which goes way beyond what you're likely to see in real life, but the app just waited until we'd finished, then reconnected as before.",
    "The kill switch generally worked well, too. Whatever we did to IKEv2 or OpenVPN connections, the app raised an alert, wasn't especially troubled by our extreme testing methods and reconnected as soon as it could, without ever leaving us unprotected.",
    "FastVPN's Android VPN app looks and feels very similar to the Windows edition: big green Connect button, by default you're connected to the nearest server, but you can choose something else from a searchable list of locations.",
    "We noticed small usability issues. The desktop app hides city locations by default, and they're only visible if you expand a specific country. The mobile app displays city and country names in the same list, so there's much more scrolling (and the cities aren't always displayed in alphabetical order, either.)",
    "Settings are basic, too, with protocol options reduced to OpenVPN UDP or TCP (no IKEv2, this time).",
    "FastVPN's iOS app is very similar, but does add one very useful feature. An Always On option enables automatically connecting to the VPN whenever you access untrusted networks, while also ignoring networks you know are safe (home, work, etc).",
    "These apps aren't bad, and they didn't have the technical issues we saw on the desktop. But they're also short on features, and can't begin to compete with the best VPNs.",
    "FastVPN doesn't make any specific claims about its website-unblocking abilities, but generally suggests it can help you 'securely unblock sites and content.'",
    "This certainly worked as a BBC iPlayer VPN, where FastVPN got us access with the first location we tried.",
    "The service scored an even big victory when it unblocked US Netflix, a task which defeats many big VPN names.",
    "But FastVPN couldn't keep up that level of success, and it failed with Amazon Prime Video and Disney+.",
    "That's not a bad result, but we've seen some providers do much better. CyberGhost, ExpressVPN, Hide.me, Private Internet Access, ProtonVPN and Surfshark all unblocked everything in their latest reviews.",
    "We measured FastVPN speeds from a UK data center with excellent connectivity and a 1Gbps connection, giving us room to see exactly what the service could do.",
    "FastVPN turned out to be not so fast after all, with both OpenVPN and IKEv2 speeds reaching a modest 250Mbps. That's better than some - NordVPN and IPVanish didn't reach 200Mbps with OpenVPN - but a long way behind OpenVPN leaders such as HideMyAss! (340-350Mbps), Hide.me (390Mbps) and ProtonVPN (400-460Mbps.)",
    "There's another problem. OpenVPN is the fastest protocol FastVPN supports, but most providers give you much more capable options. IPVanish's WireGuard connections hit 750-900Mbps in recent reviews, for instance, while NordVPN's NordLynx was a close match at 760-880Mbps.",
    "So despite the name, there's no chance this service will appear in our list of the truly fastest VPNs. But although FastVPN trails far behind in the speed stakes, it's also far from the worst we've seen, and the service should handle most browsing or streaming tasks with ease.",
    "FastVPN's ultra-low starter prices caught our eye, but the Windows app was unreliable and there are very few features. Could work as a cheap VPN for unblocking Netflix and other basic tasks, but this isn't the service for experienced or demanding users. Assuming you want something better, we'd suggest going for our #1 rated ExpressVPN or, to save on costs, the also brilliant Surfshark."
  ],
  "headers": {
    "4": "Plans and pricing",
    "9": "Privacy and logging",
    "12": "Windows app",
    "17": "Windows settings and the kill switch",
    "20": "Mobile apps",
    "25": "Netflix and streaming",
    "30": "Performance",
    "34": "FastVPN review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Namecheap": "https://www.techradar.com/reviews/namecheap",
    "web hosting service": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "StackPath": "https://www.techradar.com/reviews/stackpath",
    "IPVanish": "https://www.techradar.com/reviews/ipvanish-vpn",
    "StrongVPN": "https://www.techradar.com/reviews/strongvpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "WireGuard": "https://www.techradar.com/vpn/what-is-wireguard",
    "Windows VPN": "https://www.techradar.com/vpn/best-windows-10-vpn",
    "OpenVPN TCP/ UDP": "https://www.techradar.com/vpn/udp-vs-tcp",
    "kill switch": "https://www.techradar.com/vpn/vpn-kill-switch-explained",
    "Android VPN app": "https://www.techradar.com/vpn/best-vpn-for-android-our-5-top-choices",
    "best VPNs": "https://www.techradar.com/vpn/best-vpn",
    "BBC iPlayer VPN": "https://www.techradar.com/vpn/bbc-iplayer-vpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Hide.me": "https://www.techradar.com/reviews/hideme-vpn",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "ProtonVPN": "https://www.techradar.com/reviews/protonvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "HideMyAss!": "https://www.techradar.com/reviews/hidemyass-vpn",
    "fastest VPNs": "https://www.techradar.com/vpn/fastest-vpn",
    "cheap VPN": "https://www.techradar.com/vpn/cheapest-vpn",
    "our #1 rated ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-4547838587482854000",
    "also brilliant Surfshark": "https://get.surfshark.net/aff_c?offer_id=61&aff_id=1691&aff_click_id=trd-us-6585965214302188000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffastvpn"
  }
}