{
  "source": "https://www.techradar.com/reviews/acer-chromebook-spin-713",
  "title": "Acer Chromebook Spin 713 review",
  "category": "computing",
  "updated": "2021-08-18T19:30:00Z",
  "author": "john-loeffler",
  "summary": "Powerful performance in a semi-brutalist package",
  "verdict": "The Acer Chromebook Spin 713 is absolutely one of the best Chromebooks out there right now with a combination of performance, design quality, and battery life, but the lack of an included stylus is downright strange for a 2-in-1 and the design takes few aesthetic risks.",
  "pros": [
    "Powerful performance",
    "Gorgeous display",
    "Comfortable keyboard",
    "Quality build"
  ],
  "cons": [
    "Nothing bold about design",
    "No stylus included",
    "No physical privacy shutter for webcam"
  ],
  "article": [
    "The Acer Chromebook Spin 713 takes all the best design features of its popular Spin series of Windows laptops, marries them to a lightweight Chromebook, and then ramps up the power and performance to achieve Intel Evo-certification for a Chromebook.",
    "While some might consider this overkill, the Chromebook Spin 713 puts all that extra horsepower to good use, making it a highly-portable workhorse for work, school, or travel.",
    "Available now in the US, UK, and Australia, the Chromebook Spin 713 sells for $699 / £599 / about AU$980. Acer's Australian Chromebook Spin 713 page shows the device as available in the region, but not actual models were on sale on the Australian site so your pricing may vary between retailers.",
    "For the laptop itself, starting with the solid build quality, Acer did not cheap out on the Chromebook Spin 713. It built the device into an aluminum chassis with sturdy but flexible hinges, a comfortable keyboard deck and trackpad, and a beautiful 3:2, 2256 x 1504p touchscreen display.",
    "Unfortunately, there isn't any kind of visual interest with the Chromebook Spin 713, and in some ways you might even think it wasn't finished yet, but this device definitely trends more towards function over form.",
    "The keyboard is comfortable to type on with a decent amount of travel and key spacing, while the trackpad is nice and responsive. The touchscreen, too, is responsive and when used with a stylus – which is not included with the laptop, unfortunately – note-taking is a breeze thanks to the 3:2 aspect ratio giving you plenty of real estate to scrawl over.",
    "The Acer Chromebook Spin 713 also features the most up-to-date Wi-Fi 6 standard as well as Bluetooth 5.0, so connecting additional peripherals like a wireless headset is a snap (which is good because the speakers? Not the best).",
    "For a thinner Chromebook, we were happy to see a decent number of ports, including a USB 3.2 Gen Type-A and a microSD slot, along with two USB Type-C ports with Thunderbolt 4.",
    "The webcam and microphone are the standard 720p webcam and microphone setup you'll find on most laptops out there. Hopefully we'll get better webcams one of these days, but probably not until we give up our obsession with razor-thin bezels. Unfortunately, there is no physical camera slide shutter on the webcam, which is always our preferred privacy solution.",
    "Speaking of, the bezels on the Chromebook Spin 713 are present, but not horrendous, other than the standard chin on very roughly 99.9% laptop displays in existence (don't quote us on that) and the display was crisp and vibrant.",
    "Honestly, it took a 13.5-inch, 1504p display, to remind us that Chrome OS actually has a very beautiful and elegant UI interface and it really shines with the Chromebook Spin 713.",
    "The Acer Chromebook Spin 713 is Intel Evo-certified, so it must pass certain performance and UX standards set by Intel, like fast startup in about a second, at least a nine hour battery life, and additional security features.",
    "That's all well and good – and it is good – but the star of the show here is the Core i3 or Core i5 processor (depending on your model).",
    "Chrome OS can run very well on ARM-based chips, Intel Celeron processors, and other low-power hardware, but it absolutely flies on a full Core i5-1135G7 like the one in the unit we reviewed.",
    "What's more, the Chromebook Spin 713 has 8GB RAM and a 256GB PCIe SSD, not eMMC flash memory storage, so it all but pushes you to install and run local apps from the Google Play Store, which the Chromebook Spin 713 simply chews through without so much as a stutter.",
    "As for battery life, we saw some mixed results with a couple of outliers that skew the average of eight hours and 24 minutes down a bit. The longest the battery lasted for us in our HD movie test was 10 hours 6 minutes, which isn't best-in-class battery life, but it's still a very respectable showing."
  ],
  "headers": {
    "0": "Acer Chromebook Spin 713 two minute review",
    "11": "Performance",
    "16": "Don't buy it if..."
  },
  "links": {}
}