{
  "source": "https://www.techradar.com/reviews/moto-g100-review",
  "title": "Moto G100 review",
  "category": "phones",
  "updated": "2021-04-28T13:34:45Z",
  "author": "tom-bedford",
  "summary": "A good phone shackled to a service",
  "verdict": "Sold on its own, the Moto G100 would be a good-value low-cost phone, thanks to a fast processor, pretty decent cameras for its price and a handy fingerprint scanner, though there are some issues like its big size and slow charging speeds. The real issue, though, is that you have to buy it with a dock for the Ready For multitasking software, which bumps up the price and adds functions not everyone will care about.",
  "pros": [
    "Lots of processing power",
    "Better cameras than other Moto phones",
    "Handy fingerprint scanner"
  ],
  "cons": [
    "Can’t be bought without Ready For",
    "Pretty large",
    "Slow to charge"
  ],
  "article": [
    "The Moto G series is Motorola’s line of low-cost smartphones, but now and then its handsets push the bounds of what we’d expect from a ‘low-cost’ phone – first the Moto G 5G Plus brought next-gen connectivity and top specs (it launched as the Motorola One 5G in some regions), and now the Moto G100 has arrived with a premium processor, big battery and loads of cameras.",
    "In a parallel universe, we’re writing a glowing review of the Moto G100, showering it with accolades and calling it one of the best low-cost phones you can buy. In our actual universe, though, the phone comes with a big catch which makes it quite a bit harder to recommend.",
    "You see, if you walk into a phone shop (brick-and-mortar or online) and walk out with the Moto G100, you’re also going to be carrying a USB-C to HDMI cable and bespoke phone dock, because you can only buy the phone with these gadgets, which bumps up the price of the phone.",
    "What’s the point of these peripherals? Well, they let you plug the phone into your TV or computer monitor, and access Ready For, a multitasking software along the lines of Samsung’s DeX – you can stream video from your phone to a TV, view or work on files that are on your phone using a Bluetooth keyboard, a mouse and a monitor, effectively turning your phone into a mini PC, or utilize the G100’s cameras and the display for video calling.",
    "It’s an interesting feature, and one that we’ve explored in our Ready For hub – but this isn’t a review of Ready For, it’s a review of the Moto G100, and it’s hard to review the phone alone when you can only buy it with the dock and cable.",
    "If the Moto G100 didn’t come with those peripherals, and cost less as a result, this could easily be a 4-star or even 4.5-star review. But we don’t live in the parallel world where that’s the case, we live in this one.",
    "On its own, the phone is easy to recommend. The key selling point is the inclusion of the Snapdragon 870 chipset, a ‘lite’ version of the super-powerful Snapdragon 888 found in most top Android phones, including the OnePlus 9 and Xiaomi Mi 11. The 870 is far more powerful than the chipsets you’d find in any other budget phones, making the G100 great as a productivity or gaming tool.",
    "The phone’s battery life is also pretty great, and it reliably saw us through a day of using the phone, no matter how intensively. The slow charging speed may put off some potential buyers, though.",
    "We’ve got to commend the phone’s photography capabilities too – at least compared to other Moto phones, as they’ve typically left a lot to be desired on the cameras front.",
    "While the device is extremely large as smartphones go, which might put off some people with smaller hands, we found its side-mounted fingerprint scanner, and even the volume rocker, relatively easy to reach.",
    "So the Moto G100 is a pretty great phone in its own right, but we’d remiss to judge it without taking into consideration the overall package – and as it stands, the G100 only really makes sense as a purchase if you’re going to make use of the Ready For functionality",
    "In the UK, the Moto G100 costs £449 for the phone along with a USB-C to HDMI cable and a stand dock, which as we’ve mentioned enable you to use the phone with Ready For. You can’t buy the phone without them.",
    "That price converts to about $620 or AU$810, but we don’t know about US and Australia availability just yet. Motorola typically releases its phones in those countries though, so a release is possible, and we’ll update this article when we know more.",
    "In the UK, that’s the highest price we’ve ever seen for a Moto G phone. Below you can see the prices for some of the brand’s other phones in your region, so you can get some context:",
    "The Moto G100 is one of the biggest smartphones we’ve tested, especially in the thickness department. It measures 168.4 x 74 x 9.7mm, so it’s tall and very thick, but not that wide. It weighs 207g, so it’s not the heaviest phone we’ve tested by any means, but it is above average.",
    "Thanks to its screen aspect ratio (more on this in the Display section) the phone is long and thin, which means that despite its big size it’s fairly easy to hold in the hand. We found the side-mounted fingerprint scanner, embedded in the power button on the right edge of the handset, fairly easy to reach.",
    "Above that button is the volume rocker, and there’s also a Google Assistant button on the opposite edge of the phone. This is fairly high up, so is a little hard to reach.",
    "On the bottom edge are a USB-C port and 3.5mm headphone jack, and on the back there’s a square camera bump with four lenses.",
    "Personally, we adored the back design, as its turquoise gradient finish looked really appealing, especially when it caught the light, and we received a few compliments on the handset during our time testing it. You can also pick up the phone in white, but as we haven’t handled this version we can’t say if it’s as striking.",
    "The Moto G100 has a large 6.7-inch screen, but the display has a 21:9 aspect ratio, so it’s relatively long and thin. The usual reasoning behind this kind of stretched display is that movies have the same aspect ratio, so when you’re streaming movies on the phone you won’t see black bars at the top and bottom.",
    "This is a huge oversimplification of film aspect ratios, but thin devices like this are definitely easier to hold in the hand, and are a better shape for split-screening different apps while ensuring you’ve got enough space to see them.",
    "The resolution is 1080 x 2520, which is fairly typical for a smartphone, and the refresh rate is 90Hz, which is a touch lower than the 120Hz which some phones at this price point hit. If you want a display that refreshes 120 times per second, which makes motion look smoother, there are other handsets for you.",
    "It’s an LCD screen, so color vibrancy and contrast are a little lacking compared to other phones with OLED or AMOLED panels (there are a few at this price point), but there are benefits too – the display is easier to see in direct sunlight for example. Overall, the display looked pretty good for LCD, and we found it fit for purpose for work, gaming or streaming movies.",
    "There are two front-facing cameras, housed behind separate circular cutouts at the top-left corner of the display; these take up quite a bit of space between them, though given the large size of the display it’s not too much of an imposition. Still, some might find the extra space lost to the second camera an unnecessary waste.",
    "Motorola has never really impressed us with its phone cameras, but we were pleasantly surprised by the G100 – it’s not going to win any awards, but photos taken with it looked fairly good.",
    "Leading the charge is a 64MP f/1.7 snapper, which is joined by 16MP f/2.2 ultra-wide, 2MP f/2.4 depth-sensing and 3D Time-of-Flight (ToF) cameras. As we’ve just mentioned, around the front are two cameras: a 16MP f/2.2 standard and 8MP f/2.4 ultra-wide snapper.",
    "Selfies looked pretty good, as they were fairly vibrant and bright – this is also the case in Portrait mode, which was pretty accurate at blurring the background and not the subject, although we found that we looked a little over-sharpened in some snaps.",
    "The front ultra-wide camera is good for group selfies, although be prepared for lots of distortion, and an overall darker-looking snap. Portrait mode didn’t produce great results though when used with this camera though – the edges of the subject were often quite blurred, and our face looked weirdly devoid of detail.",
    "Pictures taken with the main camera look pretty good, at least compared to snaps from same-price rivals and Motorola’s previous devices.",
    "There’s a fair amount of dynamic range in photos, and with bold colors when taken in well-lit settings. There’s lots of detail in pictures, and there’s good contrast in ultra-wide snaps, although not so much in standard pictures.",
    "Ultra-wide pictures taken on the rear camera weren’t too distorted at the edges, which isn’t often the case with low-price phones, but the contrast was a little muted – although this was only really noticeable when comparing snaps to ones taken with the primary camera.",
    "By default, pictures taken on the main camera are 16MP, thanks to pixel binning, but you can opt for high-res photos if you want, which gives you a lot more detail to play around with when editing your images later.",
    "We found macro mode pretty useful – a statement we’ve rarely found reason to write – for close-up pictures, as it boosted the sharpness of a subject to help it stand out from its background.",
    "Thanks to the high-res main sensor, while there’s no optical zoom you can digitally zoom up to 8x into a subject. The resulting pictures are quite grainy, but they’ll still be suitable for social media use.",
    "Our only major gripe with the camera performance is regarding exposure, as we sometimes found pictures were overexposed in sunny settings, more so than on rival phones.",
    "Video recording goes up to 6K – it’s incredibly rare for a phone to offer this resolution, as most top out at 4K, although some premium handsets go up to 8K. This is available at 30fps, but if you want 60fps recording you’ll have to stick with 4K.",
    "One useful feature is audio zoom, which lets you record audio from a far-away source if it’s in the center of the viewfinder. If you want to capture audio in a busy place and/or from a source that’s some distance from you, this can be very handy.",
    "As we’ve mentioned, the Moto G100 uses the Snapdragon 870 chipset, which is a big deal. The 800 series is the top-end line of processors from Qualcomm, with contemporary flagships like the OnePlus 9 and Xiaomi Mi 11 using the Snapdragon 888. Most Moto G phones use 700-series or 600-series processors, so this is a step up.",
    "In the Geekbench 5 benchmark test the Moto G100 returned a multi-core score of 2875 – that’s much higher than the Motorola One 5G’s 1822 or the Moto G9 Plus’s 1690. That score puts it on a par with the Samsung Galaxy Note 20 (2701), Galaxy S20 Plus (3034) and Sony Xperia 1 II (3085), all of which launched for a lot more than the G100.",
    "We found the Moto G100 great for gaming, running titles much more smoothly, and at higher graphics settings, than lots of rivals, even relatively high-end games. The large screen helps with certain titles too, as some, like Call of Duty: Mobile, are optimized to work in 21:9.",
    "Navigating the phone is snappy too, and you can jump between apps or menus with little wait.",
    "The phone has a single down-facing speaker, which was fine but got tinny at louder volumes. There’s also a 3.5mm headphone jack, which will be appreciated by fans of wired audio.",
    "The Moto G100 comes running Android 11 – that’s the stock version of Google’s mobile operating system, without any overlay, so icons and menus are in their clean, ‘original’ form.",
    "Motorola’s one tweak here is support for Moto actions, gestures that you can use to trigger certain functions – our favorite is making a double ‘karate-chop’ action to turn on the flashlight, while another useful one is activating Do Not Disturb mode by just placing the phone face-down.",
    "We’ve mentioned it quite a bit already, but now we should properly discuss Ready For, the multi-tasking mode you can use with the Moto G100 (or the Edge Plus).",
    "We’ve written an in-depth Ready For guide that you can read for the full low-down, but essentially this enables you to plug your phone into a bigger screen (like a TV or computer monitor) for additional functionality. You can connect the G100 to your home cinema to stream from Netflix, or cable it to your monitor, enabling you to reply to emails and use your apps on a bigger screen. Bluetooth games controllers, keyboards, mice and more can also be connected to improve the experience with particular apps.",
    "We’ve tested Ready For quite a bit, and found it useful for a few different functions, especially video calls, so we’ve only got good things to say about it. However, while we found it useful, other people might not – and since the required peripherals are bundled with the Moto G100, by buying the phone you might be paying extra for a service you’re not using.",
    "That’s why – going back to the point with which we opened this review – it’s a shame that the Moto G100 can only be bought with the Ready For dock and cable. It’s not a slight against the feature itself, but an observation that it won’t be useful for everyone.",
    "The Moto G100 has a 5,000mAh battery, which is a pretty big capacity that few phones can beat, and as a result its battery life is fairly impressive.",
    "We never found ourselves needing to charge the device in the middle of the day, even if we used it pretty intensively – and sometimes the phone even made it quite far into a second day, although we can’t quite say it offers two-day battery life.",
    "If the battery life is great, the charging speed isn’t – in fact it’s relatively glacial. At 20W, you’re looking at about two hours to get the phone from empty up to full, which is an age in a world of cheap 50W and 65W charging devices. There’s no wireless charging here either, although that’s the case with most phones at this price point.",
    "It’s worth pointing out that when you’ve got the Moto G100 plugged into your TV or computer to use Ready For, it doesn’t actually charge up – on the contrary, the battery is draining the whole time the phone is plugged in. This means that if you want to put your phone on charge while it’s in use in this way you’ll need to buy an adaptor to allow two USB-C inputs at once."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Moto G100 price and availability",
    "14": "Design",
    "19": "Display",
    "24": "Cameras",
    "37": "Performance and specs",
    "42": "Software",
    "48": "Battery life",
    "52": "Don't buy it if..."
  },
  "links": {
    "Moto G 5G Plus": "https://www.techradar.com/reviews/moto-g-5g-plus-review",
    "Ready For hub": "https://www.techradar.com/news/ready-for-what-is-motorolas-dex-alternative-and-how-does-it-work",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "pixel binning": "https://www.techradar.com/how-to/what-is-pixel-binning-and-how-can-it-help-my-smartphone-photography",
    "Moto G9 Plus": "https://www.techradar.com/reviews/moto-g9-plus-review",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Call of Duty: Mobile": "https://www.techradar.com/news/call-of-duty-mobile-season-1",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "Ready For guide": "https://www.techradar.com/news/ready-for-what-is-motorolas-dex-alternative-and-how-does-it-work"
  }
}