{
  "source": "https://www.techradar.com/reviews/msi-modern-am271p-11m-all-in-one-computer",
  "title": "MSI Modern AM271P 11M all in one computer review",
  "category": "computing",
  "updated": "2021-06-14T09:23:08Z",
  "author": "mark-pickavance",
  "summary": "Latest laptop tech in desktop form factor",
  "verdict": "A powerful and competitively priced all-in-one that leverages the new Intel mobile platform effectively. Had MSI not loaded bloatware and provided access panels to upgrade the NVMe drive and RAM, this would be a five-star review.",
  "pros": [
    "Competitively priced",
    "Decent performance for mobile parts",
    "Comes ready to run",
    "HDMI out and in"
  ],
  "cons": [
    "Bloatware",
    "Unnecessary partitioned drive",
    "The fan can be noisy when stressed"
  ],
  "article": [
    "There was a time many moons ago when almost all personal computers were all-in-one designs. This configuration resulted from there being few common standards for connecting displays or even agreed on connectors.",
    "When those standards evolved, computers became more flexible regarding monitors, though some designs, like the Apple iMac, embraced this single package concept afresh.",
    "The MSI Modern AM271P 11M is the latest incarnation of the all-in-one model that has the advantage that the owner needs only to plug the power, a mouse and keyboard, to be almost ready to work.",
    "Historically, many of these form factors has come with some significant limitations. What has MSI done to the Modern AM271P 11M to mitigate these issues, and does it make a good alternative to a standard laptop or desktop solutions?",
    "In Europe, the AM271P comes in two colours, black and white. Our review model was the 11M-023EU SKU, priced at £1,149 inclusive of VAT.",
    "They also offer the AM241P 11M-001EU with less memory, 8GB not 16Gb, for £1,049 and Windows 10 Home installed, not Windows 10 Pro.",
    "For those that like the concept but want even cheaper options, MSI has a 34-inch display AM241P variant with various CPU, memory and storage choices.",
    "Without closer inspection, it would be easy to assume that the MSI Modern AM271P 11M is a monitor.",
    "Out of the box, the system comes with the support foot detached, and this needs to be screwed to the main chassis to be useable. The attachment uses VESA 75 standard holes, so you could put it on an expensive support arm, as there is no functionality in the foot that is necessary to run the system.",
    "To keep the structure lightweight, a 120W external power pack is used, and in the retail version there is also a mouse, keyboard and webcam. These peripherals weren’t in our review box, so we can’t say if these items are any good or not.",
    "Most of the ports are where you’d expect to find them on a monitor, in the centre, but there is also a large number on the bottom left edge, where they also put the power button.",
    "The numerous ports available include USB in Type A and Type C, HDMI in and out, a Mic-in/Headphone-out combo and an Ethernet LAN port.",
    "The inclusion of HDMI in and out are interesting choices since they circumvent one of the classic all-in-one problems. These form factors are fine until one or another of the screen/computer combination no longer works, at which point you either have a monitor you can’t use with another computer or a computer you can’t see the output from.",
    "With these HDMI ports, those problems are largely resolved, although to get it fixed, you will need to send the computer away, even if it is just a monitor issue.",
    "This also provides a means to use a second display alongside the AM271P or to see the output from another system (or games console) on the screen.",
    "For those curious about these things, the HDMI in port has electronics that makes it aware if another system is plugged in, and the screen will become powered even if the computer part of this combo isn’t running.",
    "MSI kept the small joystick, called the 5-way Navigator here, to access an OSD menu to enable the selection of the inputs manually. Clearly, some thought went into how the screen and system would work to give the greatest flexibility.",
    "For those unfamiliar with the Intel i7-1165G7, this chip is a current Tiger Lake mobile CPU evolved from an overhaul of the uninspiring Ice Lake series that appeared in 2018.",
    "The chip is designed to counter the encroachment by AMD with their Ryzen 4000 series mobile CPUs intended for use in high-end ultraportables.",
    "Fabricated on a new 10nm SuperFin process, the Intel i7-1165G7 delivers significantly higher clock speeds and performance enhancements over its Intel i7-1065G7 predecessor, and it is swift at single-core processing.",
    "It also has an enhanced GPU using the Intel Iris Xe architecture with many more execution units than the typical Intel UHD Graphics party.",
    "The accompanying chipset supports up to 64GB of RAM, has Gen 4 PCIe on the Microprocessor side of the bus and has the capability to support Thunderbolt 4.",
    "However, the Thunderbolt option wasn’t taken up by MSI in this design, unfortunately.",
    "The hardware in the MSI Modern AM271P 11M demonstrates that mobile platforms are getting much closer to desktop performance, and most users will be completely unaware that under the skin, that’s what this system is."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design",
    "17": "Hardware"
  },
  "links": {}
}