{
  "source": "https://www.techradar.com/reviews/webroot-secureanywhere-internet-security",
  "title": "WebRoot SecureAnywhere Internet Security review",
  "category": "computing",
  "updated": "2021-06-09T03:14:43Z",
  "author": "catherine-miller",
  "summary": "Speedy antivirus software with additional protection",
  "verdict": "Webroot SecureAnywhere is quick, efficient, and keeps you safe when browsing but some users might not want to commit to an annual plan. We also wish there was an option to protect just a single device.",
  "pros": [
    "Scans your device quickly",
    "Cloud-based technology keeps definitions up to date"
  ],
  "cons": [
    "Not the cheapest software available",
    "Doesn’t come with specialist identity theft cover"
  ],
  "article": [
    "To secure your devices and your data, it’s important to use strong antivirus software. With so many on the market including both free and paid options, it’s important to look closely at what they offer to find the best antivirus software for your needs.",
    "Webroot is an established provider of virus protection and in this WebRoot SecureAnywhere Internet Security review, we'll explore why this software might be the right choice for you. However, this software doesn’t just scan for viruses, it also provides extra protection when you’re browsing the internet. While it’s not the cheapest choice out there, its speed and efficiency make it a great choice for the busy internet user.",
    "Webroot SecureAnywhere Internet Security has two packages available for purchase. The first plan, at $44.99, protects three device for one year which must be a PC or Mac as phones and tablets can’t be protected under this plan. With this plan, you also get always-on security, fast scans that won’t interrupt what you’re doing, ransomware protection, anti-phishing blocks for unsafe sites, and a firewall/network connection monitor.",
    "For $69.99/year, the second-tier plan protects five devices, including phones and tablets, with everything in the cheapest package included, plus password protection for your logins.",
    "If you want to add further years to your package, you can do this when ordering, and the price will depend on the length of time you require coverage. You can also get a 14-day free trial of the software.",
    "Webroot SecureAnywhere Internet Security includes a range of useful features that take it beyond a simple antivirus software.",
    "Webroot SecureAnywhere Internet Security protects your device by scanning for viruses like rootkits, trojans or other malware. It searches drives, files, and system memory, cross-checking with Webroot’s threat library and looking for other suspicious behaviour. Threats are moved to quarantine where they are made inactive.",
    "Additionally, the software comes with a number of shields that protect you as you browse, or even offline. These will warn you if a site is potentially malicious or an unexpected download is blocked.",
    "Webroot SecureAnywhere Internet Security takes an average of twenty seconds to scan your device, so you won’t need to wait around or interrupt your activities. This is impressive, and certainly makes the software easy to use. These scans happen automatically every day, at around the same time you installed the program, but can also be launched at any time, or rescheduled if need be.",
    "Webroot SecureAnywhere Internet Security uses the cloud to reduce the amount of material stored on your device, in particular malware definitions, so updates can be installed quickly and don’t take up room on your hard drive. This also means the threat library can be kept up-to-date more efficiently than with other services where you need to constantly download new definitions.",
    "Webroot SecureAnywhere Internet Security comes with further online protection than simple virus protection. For example, webcam protection helps prevent hackers accessing your device. Secure web browsing for computer or mobile (if that’s included in your plan) blocks malicious websites while you browse. For example, Webroot SecureAnywhere Internet Security's shield software will warn you if a website is suspected of conducting a phishing or key-logger attack.",
    "And, with the more expensive package, you’ll get LastPass included. This password management service encrypts usernames, passwords and credit card details to protect you from identity theft.",
    "Installation onto a PC is speedy, as is configuration. Webroot SecureAnywhere Internet Security also automatically adds a Chrome extension called Web Threat Shield. This efficiency carries through to the device scan, which is as quick as claimed, only half a minute.",
    "Although the dashboard is not that aesthetically pleasing, it’s easy to navigate and toggle on/off features like the firewall and Web Shield. Webroot SecureAnywhere Internet Security certainly lives up to its promise of speed, and this makes it a great choice if you need to scan frequently, or you’re strapped for time.",
    "Webroot’s site hosts plenty of resources to help you understand cybersecurity. There is also an informative blog and community where you can ask questions. You can download user guides for Webroot’s products to check how to run them.",
    "A dedicated support page has FAQs and a searchable knowledge base, but you can also get help by raising a support ticket, by chat, or by phone. The range of support options is excellent.",
    "Webroot SecureAnywhere Internet Security isn’t the only antivirus software out there. Another popular paid option is Bitdefender. Similarly to Webroot SecureAnywhere Internet Security, this comes in three versions: one device over one year for $19.99 (on offer as of May 2021), three devices for $32, and five for $36. This makes it quite a bit cheaper than Webroot.",
    "Bitdefender also comes with anti-phishing protection, a dedicated secure browser for online banking, and a Virtual Private Network (VPN) to encrypt all web traffic. Phone and tablet protection is only available with the most expensive package. Whilst it doesn’t promise the same scanning speeds as Webroot SecureAnywhere Internet Security, its price makes it a solid choice if your budget is more limited.",
    "Norton 360 covers one device ($34.99/year, on offer as of May 2021), five ($39.99/year) or five with the addition of LifeLock Select ($99.88/year). While this final package is much more expensive than Webroot SecureAnywhere Internet Security, it comes with 100GB of cloud backup for your PC to make sure your files are safe if the worst happens.",
    "LifeLock Select also includes credit bureau monitoring, which can alert you if your identity has been compromised and used online. Plus, you get $1 million coverage so lawyers and experts can restore your identity if this happens. This might be a better choice if you’re concerned about identity theft.",
    "Webroot SecureAnywhere Internet Security isn’t the cheapest antivirus software out there, but you will get a decent range of protective features, including anti-phishing, webcam protection, and password encryption, that give you extra coverage beyond just checking for viruses. Plus, the cloud-based technology delivers a quick, space-saving solution. If you hate waiting for your virus scan to finish, Webroot SecureAnywhere Internet Security could be the best antivirus software for you."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "12": "Interface and in use",
    "14": "Support",
    "16": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "best antivirus software": "https://www.techradar.com/best/best-antivirus",
    "WebRoot SecureAnywhere Internet Security": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24709&u1=trd-us-1371947972797717800&murl=https%3A%2F%2Fwww.webroot.com%2Fus%2Fen%2Fhome%2Fproducts%2Fisp",
    "first plan": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24709&u1=trd-us-5541658342223304000&murl=https%3A%2F%2Fwww.webroot.com%2Fus%2Fen%2Fhome%2Fproducts%2Fisp",
    "second-tier plan": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24709&u1=trd-us-7016197262366852000&murl=https%3A%2F%2Fwww.webroot.com%2Fus%2Fen%2Fhome%2Fproducts%2Fisp",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "password management": "https://www.techradar.com/best/business-password-management-software/best/password-manager",
    "Chrome extension": "https://www.techradar.com/news/the-best-google-chrome-extensions",
    "Bitdefender": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "Norton 360": "https://www.techradar.com/reviews/norton-2020-antivirus-solutions",
    "LifeLock Select": "https://www.techradar.com/reviews/norton-lifelock",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}