{
  "source": "https://www.techradar.com/reviews/google-pixel-5",
  "title": "Google Pixel 5 review",
  "category": "phones",
  "updated": "2021-09-02T18:03:06.590Z",
  "author": "david-lumb",
  "summary": "The Google Pixel 5 is an affordable flagship with some compromises",
  "verdict": "The Google Pixel 5 loses some of the more advanced features of its predecessor in order to keep the cost down, and the result is a streamlined phone with great camera software and a clean Android interface. But without some of those premium perks, like a telephoto lens, that appear in other handsets at the same price tier, the Pixel 5 struggles to distinguish itself from the competition. It's a good handset at a consumer-pleasing price – but that's true of other 2020 phones, too.",
  "pros": [
    "Camera software is better than ever",
    "Metal case is refreshing change from glass",
    "Clean Android interface"
  ],
  "cons": [
    "No telephoto camera",
    "Middling night photography"
  ],
  "article": [
    "The Google Pixel 5 represents a strategy change for the tech giant: the phone doesn't quite have the specs and features to compete with top-tier flagship devices, but instead is a more measured handset that costs less in turn.",
    "Compared to the Samsung Galaxy S21s of the world, the Pixel 5 focuses on what Pixel phones do best: offering users a great, simplified camera experience and a very clean Android interface. It's a tack that the Google Pixel 5a continues, and given the similarities between the phones (and that both will get Android 12 coming later this year), the only thing the Pixel 5 has over its cheaper sibling is a smaller size and more refined metal back.",
    "If you want a more flagship Pixel phone, you may want to wait for the Google Pixel 6 – Google officially revealed the design and confirmed it will pack the company's first in-house SoC, the Tensor chipset, and suggested it will be priced comparable to other top-tier phones. While we're excited for that phone, it still means that if you want a more humbly-designed phone at a lower price that still rocks the latest Android version, the Google Pixel 5 is a good, simplified phone choice.",
    "‘Simplified’ could apply to the whole phone, really: it’s got an all-in-one body that curves from the back around the sides, and which is metal, so you won’t have to worry about shattering it. Google has also gone back to a physical fingerprint sensor on the rear of the phone, which is far easier to find without looking than an in-screen scanner. And with the purest version of Android 11 on board, there’s no bloatware or operating system complications.",
    "Simplified can also mean lacking, though, and Google has cut some corners in designing the Pixel 5 to drive prices down to the level of more affordable flagships like the Samsung Galaxy S20 Fan Edition and OnePlus 9.",
    "In most ways, that’s fine, but there are some compromises that keep it from feeling like an affordable slam-dunk. The Pixel 5’s chipset won’t quite keep up with the processors in the new S20 FE or OnePlus handset, and its two cameras are lacking serious zoom capability.",
    "But it’s the uniqueness that we miss, too: fans of the Google Pixel 4’s Soli depth sensor, which enabled in-air gestures, will be sad to see it gone. In a rare move for a phone maker, Google abandoned tech instead of iterating on it; LG did the same thing when it abandoned its own depth sensor, which it introduced on the LG V50, when it brought out the LG V60.",
    "Personally, we don’t miss Soli, though we do miss what it could have become as a uniquely Google experience. But while some cutting-edge tech has been culled, it’s not a complete regression: the Pixel 5 has wireless charging, a 90Hz refresh rate display, and 5G, while its 4,000mAh battery is a lot bigger, and subsequently lasts far longer, than the 2,800mAh battery in the Pixel 4.",
    "Ultimately, the Pixel 5 is a mixed bag, with some curious omissions in an otherwise solid phone. It’s designed to hit a sweet spot for a certain kind of consumer who’s willing to forego some flagship features to get a finely-tuned photo experience, and it does that – but it’s something that other phones, like the Google Pixel 4a 5G, which has virtually identical photo capability, offer at a notably lower price.",
    "But the Google Pixel 5 does offer something that most other flagships don’t : it feels like one of the smallest phones on the market, despite having a not-so-small 6-inch OLED display, and it can comfortably be used with one hand. With the imminent arrival of the iPhone 12 mini, however, it's set to face some serious competition in the 'mini flagship' space.",
    "The Google Pixel 5 was released in the US, UK and Australia on October 15.",
    "The Google Pixel 5 price is $699 / £599 / AU$999, and it only comes in one configuration, with 8GB of RAM and 128GB storage. It’s available in two colors: Just Black and the greenish Sorta Sage.",
    "This comes in cheaper than the Pixel 4, which started at $799 / £669 / AU$1,049; although, as we've mentioned, that cost does come with a few compromises.",
    "The Pixel 5's price puts it at the lower end of the flagship price range, with the Pixel 4a 5G the next option down, at a mid-range $499 / £499 / AU$799 price – although given the nearly identical specs (Snapdragon 765G, 6GB of RAM, 128GB of storage) and cameras, the 4a 5G has a lot of overlap with the Pixel 5 despite that lower cost.",
    "The Google Pixel 5 is the first phone in some time to have a metal back – the industry switched to glass to enable better signal transmission (and wireless charging). The metal wraps around the sides for an all-in-one body that’s also a rarity today, and we’d expect this design to be far more resilient to damage, whether it’s wear and tear or more serious drops.",
    "The metal itself has a matte-like finish that makes it feel a bit more like polycarbonate than the typical aluminum frames. Its texture feels interesting but not exactly appealing, though one thing is for sure: it allowed us to get a more solid grip on the phone.",
    "This is important because, as previously mentioned, this phone feels small: despite having a 6-inch display, the all-in-one metal body and minimal bezel mean the phone feels more compact – and at 8mm thick, it’s also one of the thinner phones on the market.",
    "Not every aspect of the small format is perfectly designed: the metal lock button and volume rocker on the right side of the phone barely protrude from the body of the phone and have more resistance than you’d expect, making them a bit tough to press. This is a change from the large and protruding plastic buttons on the Pixel 4 and Google Pixel 4a (as well as the 4a 5G), which are far easier to manipulate. It’s an odd but noteworthy criticism; these days, we rarely complain about buttons.",
    "So if the frame is metal, how does the wireless charging work? It turns out that Google has been crafty, and drilled a small hole in the rear plate over the charging coil, then covered it with resin and painted over it, as Android Central’s Daniel Bader discovered.",
    "One the rear or the phone there’s a square camera block that’s nearly identical to the one on the Pixel 4, although the flash has moved from the top to the bottom of the array. The fingerprint sensor sits toward the top-center on the back in a circular divot; it’s not as accurate as we’d like, and it sometimes took us a couple of attempts to register our print, though it’s easy enough to find without looking.",
    "There’s a SIM tray on the left side, although there’s no microSD slot for expanding the storage, sadly. There’s a USB-C port on the bottom of the phone, with a speaker on the right. Unfortunately, the speaker audio quality that we so highly praised on the Pixel 4 is less well-rounded in the Pixel 5, tending towards tinny sound.",
    "The 6-inch Full HD Plus (2340 x 1080) display is a sharp and bright screen, with minimal bezels and a punch-hole to house the front-facing camera. That means a far better screen-to-body ratio than the Pixel 4, which had a solid black bar at the top of its display – but since that bar held the various sensors, including the Soli depth sensor that enabled features like in-air gesture control, it’s a bittersweet advantage to have more screen real estate here.",
    "The display retains the 90Hz refresh rate that Google rolled out with the Pixel 4, and it’s similarly smooth here. While it drains battery at a faster rate to keep it on (you can switch back to 60Hz in the settings), the effect is worth it when you’re browsing the internet or your app library without the stuttering you’ll experience on 60Hz and lower screens.",
    "The Google Pixel 5 packs a pair of rear cameras, and you’d be forgiven for thinking they’re the same as the cameras on the Pixel 4, as the new phone inherits the old handset’s glass-covered camera block. It does have the same 12.2MP main shooter, but the Pixel 5 swaps out its predecessor’s 2x optical telephoto lens for a 16MP ultra-wide lens.",
    "While the ultra-wide lens means the Pixel 5 is left without decent zoom capabilities, we prefer having the option to squeeze more people, or more of a scene, into the frame, though the 107-degree field of view isn’t quite as wide as some of the 120-plus-degree ultra-wide lenses on other phones. But, in comparison shots, the Pixel 4's 2x optical zoom camera didn't perform noticeably better than the digital zoom on the Pixel 5. Score another for the utility of ultra-wide.",
    "The shots we took with the Pixel 5 during our testing time were a mixed bag. Focusing was an issue with subjects that were close to us, or in motion. Our best photos were taken in full daylight – they looked crisp and had a lovely color palette – but low-light images had the same, or a bit more, noise than comparable photos taken with other flagship phones. Given the Pixel series' strong emphasis on night photography, this was a little surprising.",
    "The phone does capture accurate colors in low light, though – compared to images taken on the iPhone 11 Pro Max, for instance, which can exhibit a yellow tint, the Pixel 5 captures the correct hues. Its ultra-wide lens also creates a lot less distortion at the edges than images captured with similar lenses on other phones.",
    "The Pixel 5 really comes into its own in its editing software: pop open an image and click on the three 'levels' button and you'll find a plethora of editing toggles, which have been rearranged into a more user-friendly interface than in the Pixel 4. There are even new software tricks, like Portrait Light, which simulates a fill light to brighten faces and subjects at particular angles – useful if you want to add dramatic lighting, or highlight parts of your subject after taking a shot.",
    "As is typical for the Pixel line of phones, the Pixel 5 leans on its software to produce dynamic shots with great color, and even introduces interesting new ways to treat photos after taking them; however it doesn't elevate middling low-light shots.",
    "The Pixel 5’s specs are one of several areas where Google has compromised, likely to save on cost. The Snapdragon 765G chipset is not as top-tier as the Snapdragon 865 powering 2020’s leading Android phones, like the Samsung Galaxy S20 line or Snapdragon 865 Plus in the new OnePlus 8T, for instance, but it serves well enough.",
    "The processor is paired with 8GB of RAM, and the Pixel 5 breezes through tasks from browsing the web to gaming and playing media. We didn’t experience any egregious slowdown, although after playing a few rounds of Call of Duty: Mobile, we did see some animations hitch (not mid-game, thankfully).",
    "The benchmarks are another story: with a Geekbench 5 score of 1617, the Pixel 5's specs perform worse than the comparably-priced Samsung Galaxy S20 Fan Edition (2928), which is powered by a Snapdragon 865 chipset. This isn't exactly surprising, but it does indicate speed – and given the Google Pixel 4a 5G scored a roughly similar 1614, we have further support that the Google Pixel 5 doesn't perform much better than its cheaper counterpart.",
    "Since the Google Pixel 5's launch, a number of genuinely affordable smartphones have come out with better Geekbench 5 scores, which doesn't reflect well on this phone.",
    "The Pixel 5 packs 128GB of storage in its only configuration, and as with its predecessor you can’t expand this via micro SD. It’s frustrating, and it means that if you want more storage you’ll have to opt for a cloud solution.",
    "The Pixel 5 runs Android 11 out of the box, benefiting from new features including built-in screen recording, a Conversations feature that collects all your messages from various apps in one place, and improved smart home controls.",
    "One of the Pixel 5’s biggest improvements over its predecessor is its 4,000mAh battery – in our casual testing it comfortably lasted into a second day, while we found the Pixel 4, with its 2,800mAh battery, hit single digits in the early evening.",
    "Battery life was a major complaint with the Pixel 4, and Google seems to have gotten the message. In addition to the expanded capacity, the Pixel 5 also has a new software feature: Extreme Battery Saver. As you might guess, this is an enhanced version of the standard Battery Saver, which goes beyond turning on Dark Mode and pausing background activity to turn off Wi-Fi hot-spotting and other battery-draining activity – although crucially, you can whitelist apps to keep them operating normally.",
    "The Pixel 5 comes with an 18W fast charger in the box, and supports Qi wireless charging. You can also use the phone to wirelessly reverse-charge other devices, and although we found it a little difficult to charge smaller devices consistently (like wireless headphone cases), it’s easy enough to charge another phone.",
    "First reviewed: October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Google Pixel 5 price and release date",
    "14": "Design",
    "21": "Display",
    "23": "Camera",
    "29": "Specs and performance",
    "35": "Battery life",
    "38": "Don't buy it if..."
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Tensor": "https://www.techradar.com/news/google-pixel-6s-new-tensor-chipset-3-ways-it-may-top-apple-and-samsung-silicon",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Samsung Galaxy S20 Fan Edition": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Google Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "LG V50": "https://www.techradar.com/reviews/lg-v50-thinq-5g",
    "LG V60": "https://www.techradar.com/reviews/lg-v60-thinq",
    "Google Pixel 4a 5G": "https://www.techradar.com/news/google-pixel-4a-5g-offers-great-cameras-and-5g-connectivity-cheaper-than-the-pixel-5",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "Daniel Bader": "https://twitter.com/journeydan/status/1311397738119077889",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "Snapdragon 865": "https://www.techradar.com/news/snapdragon-865-phones-list-specs-and-5g-capabilities",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review"
  }
}