{
  "source": "https://www.techradar.com/reviews/earfun-air-pro",
  "title": "Earfun Air Pro review",
  "category": "audio-visual",
  "updated": "2021-04-23T10:28:31Z",
  "author": "sean-cameron",
  "summary": "A mostly brilliant and sonically balanced set of budget buds",
  "verdict": "The EarFun Air Pro true wireless earbuds look good, sound great, and offer a generally strong performance at a very attractive price. They fall down when it comes to comfort and general bulk, and have overly complex touch controls. Overall, though, they’re an accomplished effort.",
  "pros": [
    "Novel design",
    "Pleasing audio balance",
    "Effective noise cancellation"
  ],
  "cons": [
    "Can be uncomfortable over long periods",
    "No app for EQ adjustments",
    "Case is a little bulky"
  ],
  "article": [
    "Keeping up with new true wireless earbud releases is no mean feat. New brands are constantly trying to break into what’s becoming an increasingly crowded market, and enjoying varying degrees of success.",
    "Earfun, an outfit with a name worthy of an early team task from The Apprentice, is one such example. In the past year its new releases have garnered some positive attention, and with the Air Pro buds it’s seeking to cement its reputation.",
    "While they're priced solidly in the mid-range, they come with some bold marketing claims, including audio tuned by respected speaker brand Edifier, active noise cancellation, and a long battery life.",
    "From a design perspective they’re certainly a win. They have clean, angular lines and aren’t overly garish, and will be as at home on the train or bus as they are in the office. Their design is a little harsh and industrial, though, maybe too much so for some.",
    "We did find that after an hour or so of use they could start to become somewhat uncomfortable, although this could be chalked down to personalized fit issues, and of course will be a largely subjective thing. A range of ear tips are included in the box, as is standard nowadays.",
    "Their commuting credentials are enhanced by the presence of effective active noise cancellation, which we found blocked out the sounds of a busy street, and even a washing machine at home. An audio passthrough feature is also present for those moments when you need to let the outside world in.",
    "Infrared detectors will automatically pause your music if the buds are removed from your ears, and we found this worked well in testing. However, a point against the Air Pro earbuds is the size of the charging case. Although this no doubt allows for a bigger battery, it also means they don’t fit as easily into small pockets as some other buds.. The touch controls are limited, and as can often be the case, we found them difficult to work with – missed commands were common.",
    "While we found the EarFun Air Pro didn’t last quite as long as their claimed 32-hour battery life (that’s with ANC turned off), they still offer an impressive playtime for earbuds at this price.",
    "From a sound perspective, the Earfun Air Pro buds are a definite win. The buds provide an enjoyable listen for casual music fans, with warm, prominent bass and an energetic sound. These are buds that will work easily across most genres, though those looking for reference or studio-quality audio will be better off looking at wireless earbuds intended for audiophiles.",
    "These aren’t buds that will reveal moments of high fidelity in complex orchestral FLAC tracks; as the name suggests the focus here is very much on ‘fun’. If you listen mainly to rock, hip hop, punk or pop you’ll have an especially good time – and they’re equally at home with podcasts or audiobooks.",
    "On their own merits, the Earfun Air Pro buds are accomplished, but against the competition at this price point they shine. Amid a sea of similarly priced efforts on Amazon, they stand out thanks to their superior design and excellent audio chops, and show a high level of competence in almost all other areas. If it weren’t for slightly fiddly gesture controls and – in our experience at least – a slightly uncomfortable fit, these would immediately earn our wholehearted recommendation.",
    "As it stands, these wireless earbuds are an excellent choice for most, offering a blend of useful features and strong performance that should make them popular with commuters in particular.",
    "The Earfun Air Pro buds are available from Amazon for $80 / £70 / AU120, though they are stocked by a few other retailers. One color scheme is offered, a black / silver combination.",
    "The Earfun Air Pro are the product of a company that wants to set its products apart from the likes of the Apple AirPods. The build is angular and industrial, though still comfortable while providing a tight seal against the ear canal.",
    "We generally found that these buds were comfortable, but during longer listening sessions they began to chafe. This will vary from listener to listener, though, and you do get a range of eartips included in the box.",
    "Being slightly bulkier than some other earbuds means there’s room for a relatively large battery in each bud, and allows the microphone to be positioned closer to the mouth for clearer calls.",
    "There are drawbacks too of course; the larger footprint means that the charging case is slightly larger than we’d like. Though it will easily fit in loose jeans, it isn’t quite on the same level as the Galaxy Buds with their tiny case that can fit nearly anywhere.",
    "Still, they’re a great fit for commuters, who may value a longer battery life more than a slim charging case.",
    "Beyond any other specs, a set of earbuds will live and die by their audio performance. Many brands make grand claims about what they can deliver, and the Earfun Air Pro come with plenty of their own tantalizing audio specs.",
    "These include 10mm composite dynamic drivers, and a partnership with Edifier to tune the buds’ sound profile – and we’re happy to report that the resulting audio performance is excellent for the price.",
    "To clarify, these are not buds that will win awards for sonic detail, clarity or accuracy – they are tuned, as the brand name might suggest, to deliver something ‘fun’. This means that the bass is prominent, has a pleasant kick, and surprising warmth. Trebles have a sparkly quality, there’s no muddiness to the mid-frequencies, and overall, these earbuds deliver a decent sense of space across the soundstage.",
    "There are few genres that these buds won’t suit, though real bass-heads may wish to look elsewhere. These are generalist buds that will suit casual music listeners as opposed to audiophiles or those who want a chest-thumpingly strong bass performance.",
    "The noise-cancelling was also a pleasant surprise. Typically, exceptional noise cancellation will require spending at least $100 / £100 / AU$150; and while the EarFun Air Pro aren’t quite exceptional, they’re certainly not far off. For commuters, they’ll drown out most of the din of an average bus journey, and for home working they’ll certainly remove the din of the street outside.",
    "However, the ambient pass-through mode is a little less successful, and needs a little more fine-tuning. This is something that could have been achieved through the use of a dedicated app (as well as giving you the ability to adjust the EQ settings), though the lack of app support is hardly surprising for buds of this price..",
    "There's a lot of simplicity in a physical button. By comparison, touch-sensitive controls can be far more finicky, often not working as intended.",
    "The controls used by the Earfun Air Pro mostly work; they’re a little too complicated for their own good, though. Volume up and down controls are on the left and right earbuds, with the right also able to skip tracks and the left able to summon Siri / Google Assistant, as well as change the noise cancellation mode.",
    "We found these controls were not especially difficult to activate when stationary. When walking, however, it becomes quite tricky to achieve the desired outcome, with some of our commands being missed .",
    "Battery life, thankfully, is a completely positive story. The manufacturer claims you’ll get 25 hours in total with ANC on (seven from the buds and an additional 18 from the case), which is bumped up to 32 hours with this feature switched off.",
    "We found the battery life came in at about an hour less in all cases, which is still a strong showing, especially for buds at this price. They’ll see you through most long-distance flights, and will definitely be long-lasting enough to withstand an average week of commuting. Top ups are via USB-C, with no wireless charging offered."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Earfun Air Pro price and availability",
    "13": "Design",
    "18": "Audio performance and noise cancellation",
    "24": "Controls and battery life",
    "29": "Don't buy them if..."
  },
  "links": {
    "true wireless earbud": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds"
  }
}