{
  "source": "https://www.techradar.com/reviews/e-trends-trekker",
  "title": "E-Trends Trekker review",
  "category": "fitness",
  "updated": "2021-11-12T12:05:41Z",
  "author": "sarah-finley",
  "summary": "An E-MTB for all terrains, with a sturdy lightweight frame and a three-mode pedal assist",
  "verdict": "You’ll feel safe riding this powerful bike on the road or even on trickier terrain, with its suspension fork you don’t feel every bump you ride over. Its pedal assist makes hills much easier to grasp and riding in general. However, the bike is heavy and large to store, while its pedal assist isn’t as powerful when you’re starting your journey on a hill or gradient.",
  "pros": [
    "Comfortable",
    "Powerful pedal assist",
    "Reasonably priced",
    "Good suspension"
  ],
  "cons": [
    "Difficult to put together",
    "Pedal assist struggles on hills",
    "Big to store"
  ],
  "article": [
    "An electric mountain bike (E-MTB) for all terrains, this sturdy but heavy bike is powerful for long rides. With a lightweight frame, we found it heavy, but easy to ride with a comfortable saddle, well gripped handlebars, and a powerful pedal assist, which helped us get up to 15mph and tackle some very steep hills.",
    "The bike doesn’t come ready to ride though - and is difficult to put together. It’s pedal assist, via its 250W motor, and three speeds, is great while on a flat and you move on to a gradient, giving you that extra push when you need it. However, it doesn’t work as well when you start on a hill, with the pedals barely moving.",
    "If you’re looking for a bike to use for longer rides, with tougher terrains, this model has a suspension fork, meaning you feel less impact. While its 36V7.5Ah battery, once charged lasts for days, if not weeks – meaning you won’t run out of power when you need it the most.",
    "The E-Trends Trekker was released in November 2020, and costs £1,199 (about $1,600 / AU$2,200) direct from E-Trends. You can also find it more cheaply on Amazon if you live in the UK.",
    "That's relatively cheap for an e-bike, and very reasonable for an e-MTB with front suspension. For context, our current top-rated e-bike, the Cowboy 4, is a road model that costs almost twice as much at £2,290 (or $1,990 if you're able to snag one for the early-bird price in the US).",
    "You can certainly find cheaper E-MTBs if you trawl Amazon, but you're taking a chance on the build quality and customer service. E-Trends might not be as much of a household name as Raleigh or Trek, but it's an established bike builder with a sound reputation.",
    "You may also want to have a look at the Triumph Trekker GT.",
    "The E-Trends Trekker, with its lightweight aluminium alloy frame and 27.5in wheels, isn’t the lightest model out there. It weighs in at 49lb (22kg), but feels reassuringly sturdy when tackling hills and rough terrain. The bike is finished off with an adjustable leather saddle, durable pedals and handlebars with plenty of grip.",
    "Unlike some e-bikes, which come ready to ride, the E-Trends Trekker required a little assembly. Setting up the bike took some time as the front wheel, seat, pedals and handles had to be attached. We struggled somewhat with attaching the handlebars, which we put on back to front to start with. The front wheel took some time to put into place too, mainly because the instructions are basic at best, and there were only small tools included to help. The seat, which has a black finish to complement the rest of the bike, was easy to slot in, but did keep moving as we rode it, and it took us a few attempts to realise how to clip it in securely. The wheels are large, but thinner than some bikes – however they felt sturdy on the road. The wheels have reflectors, but there are no bike lights for night riding, so you’ll have to invest in your own.",
    "The ‎lithium battery sits in the main bike frame, and it easy to take out to charge by turning the small key. It goes relatively unnoticed otherwise, and doesn’t spoil the aesthetics of the bike.",
    "As the E-Trends Trekker is quite big, with a length of 178cm and a height of 108cm, we found it hard to keep in our apartment without it getting in the way, so we’d recommend having outdoor space or a garage to store it in.",
    "The E-Trends Trekker is easy to ride, with the pedal assist giving a welcome boost when you need it. The electric bike comes to life as you turn on the left-hand controls and you press the up and down buttons to increase and decrease the battery assistance. The bike has a 250W motor and offers three levels of assistance to suit the hill or terrain you’re tackling.",
    "A full charge takes around five hours, and the battery life is also shown on the LCD screen so you’ll always be aware of how much or how little you have left. The battery, which is in the frame, can be charged either while in the bike or out, and once charged will last for up to 30 miles, depending on the riding conditions.",
    "That's fairly short for an e-bike – even affordable commuter bikes can typically keep running for at least 40 miles – but that's understandable considering the extra weight of the Trekker's more robust frame and front suspension.",
    "The pedal assist is perfect when riding on roads which have a slight gradient, which then turn into hills. We tested it on multiple inclines, and it allowed us to glide up them effortlessly. The only problem is when you’re stopping and starting on hills - and you expect it to work just as well, it doesn’t, the pedals become increasingly stiff and at various points we had to get off and walk it up the hill.",
    "Some other e-bikes (such as the MiRider One) get around this problem with a throttle that boosts the bike for a couple of seconds as you push off.",
    "However, the Trekker's three settings were more than enough in most situations, with the lowest great for a slight incline and the third setting perfect for the steepest of hills.",
    "We did have to be careful to change the settings back down once we were on a flat road again, as it does become quite powerful. The pedal assist helped us get up to around 15mph very quickly and we loved how just a couple of pedals got us there.",
    "The pedals felt secure as we rode, but they were a little too close to the front wheel and we caught our toes on it a couple of times (thankfully just as we got on the bike and not mid-ride). The pedals also don’t clip away for storage, unlike some. Once we got the bike out on rockier trails we appreciated the addition of its front suspension fork, which helped limit the impact. Even as we powered down hills, we found the disc brakes performed well, making us feel safe. If you love a challenge or your battery runs out, its seven-speed Shimano gears will prove useful, though be prepared to sweat; this is a heavy bike, and without the power assistance, you'll feel it."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and release date",
    "7": "Design",
    "11": "Performance",
    "19": "Don't buy it if"
  },
  "links": {
    "direct from E-Trends": "https://e-trends.co.uk/products/trekker?variant=35417882001574",
    "Triumph Trekker GT": "https://www.techradar.com/reviews/triumph-trekker-gt",
    "e-bikes": "https://www.techradar.com/best/electric-bike",
    "bike lights": "https://www.techradar.com/best/best-bike-lights",
    "MiRider One": "https://www.techradar.com/reviews/mirider-one?region-switch=SG"
  }
}