{
  "source": "https://www.techradar.com/reviews/vpnuk",
  "title": "VPNUK review",
  "category": "computing",
  "updated": "2021-03-10T15:02:04Z",
  "author": "sead-fadilpasic",
  "summary": "A VPN solution that struggles to stand out from the crown",
  "verdict": "VPNUK is an affordable VPN solution that will give you online privacy at some acceptable speeds, but it’s far from perfect. The service is a bit difficult to get used to, the apps are basic, it can’t unblock Netflix or BBC iPlayer and there’s a lot of conflicting information on the website.",
  "pros": [
    "Decent speeds",
    "7-day free trial",
    "Supports torrenting",
    "Isn’t too expensive",
    "Various subscription options",
    "Multiple methods of communication"
  ],
  "cons": [
    "A bit complicated to use",
    "Apps only for Windows and Android",
    "Can’t unblock Netflix or BBC iPlayer",
    "Website needs updating"
  ],
  "article": [
    "VPNUK is a small provider of VPN services that offers a range of subscription packages for different types of user. It lacks a few features available with industry leading services, but has recently increased its basic VPN offering to support up to 50 simultaneous users (from the original 6).",
    "This vendor offers three types of user account:",
    "Shared IP - with a dynamic IP address, access to servers in 22 countries, and support for up to 50 users.",
    "Dedicated IP - with a unique static IP only you have access to, access to servers in 3 countries, and support for up to 5 users.",
    "1:1 Dedicated IP - for users who want to accept incoming connections, with access to servers in only 1 country, and support for a maximum of 1 user.",
    "You can choose the billing period you feel most comfortable with - one, three, six or twelve months - with the largest discounts attached to packages with longer durations.",
    "For instance, the cheapest Shared IP subscription for 1 user is the 12-month one and will cost you an equivalent of £3/$4.11 per month (charged annually at £36/$49.37).",
    "Regardless of the plan, you can get a 7-day free trial and you don’t have to pay for it or even leave your payment details. The provider informed us that there’s a 28-day money-back guarantee if you’re not satisfied with the platform. That said, we found conflicting information on this matter on the website.",
    "Accepted payment methods include credit/debit cards, PayPal, Skrill, and Bitcoin.",
    "VPNUK has some good points, but pails in comparison to major VPN players like ExpressVPN, NordVPN, Surfshark, or CyberGhost.",
    "While it will not cost you a lot and will allow you to choose among a range of subscription options, it doesn’t have their gorgeous native apps, lengthy money-back guarantees, or geo-restricted content unblocking capabilities. On top of this, the no-logs policies of these top services have been audited by independent third parties.",
    "Unfortunately, VPNUK can’t unblock localized content from today’s popular streaming platforms like BBC iPlayer and Netflix, but should be fine for the less challenging platforms like YouTube.",
    "The company running this VPN is headquartered in Spain, and it offers access to over 100 servers in 30 locations around the world, including in Iceland, Poland, Russia, Israel, and India. We were told by customer support that most of its Shared IP servers have at least 32 IP addresses per unit.",
    "To help you remain anonymous online, this VPN “uses the highest grade encryption techniques which ensures you are always safe when browsing the internet”.",
    "According to the provider, its VPN connections use AES-128-256, SHA128-384, RSA2048-4096 control channels, authentication, and keys, depending on the connection protocols: PPTP, L2TP/IPSec, IKEv2, OpenVPN, and WireGuard (which isn’t available with the Shared IP account).",
    "This VPN works in any country in the world (including China); all you need is an active internet connection. You’re also free to share large files via P2P and torrenting clients.",
    "Some of the extra options you can turn on in the Windows app include the provider’s SmartDNS service, a kill switch, and WebRTC vulnerability protection. A kill switch, the security mechanism that shuts down your internet connection if the VPN is interrupted, is also available in the Android app. However, it’s off by default in both apps.",
    "The vendor’s Privacy Policy guarantees that it has a strict no-logs policy, which means it doesn’t monitor or record your activities when using its VPN, nor does it pass them on to any third parties. It further adds that it doesn’t store “connection time stamps, session information, used bandwidth, traffic logs, IP addresses or other data.”",
    "Under the User Information section, the provider also states that it doesn’t “ever log or store user session data”, and that it may “only log access attempts to our servers, session durations and the amount of bandwidth used, this is only accessed when called upon for account troubleshooting and security purposes.”",
    "Unfortunately, we have no way of knowing whether these claims are true or not, because the claims have not been audited.",
    "VPNUK has a native app for Android and a custom OpenVPN-based client which gives a level of flexibility to the otherwise basic OpenVPN GUI client.",
    "At the time of writing, the Android app has a rating of 4.3 stars (out of 5) in the Play Store, as rated by 7 users. It had been downloaded over 100 times and was last updated just days before we wrote this review.",
    "With the website’s help, you can manually install the platform on more devices, including Mac, iOS, ChromeOS, Linux, FireOS, Blackberry, games consoles, Smart TVs, Raspberry Pi, Boxee, browsers (as proxy), and various routers - be it through the devices’ own VPN settings or third-party software like TunnelBlick or AnyConnect.",
    "If you get stuck anywhere, you can seek help via the searchable FAQ and Knowledge Base which might need some updating as we found some obsolete information (such as the maximum number of users).",
    "You can also reach out to someone on the team via the live chat option in the lower right corner of the website, email, contact form, or even telephone. We tried the contact form option and had to wait for only over an hour to receive a (rather helpful and detailed) response, which is a solid time for this method of communication in our experience.",
    "The provider also has profiles on Facebook, Twitter, YouTube (this one is without any content though).",
    "VPNUK was a bit complicated to install on Windows but we managed to set it up with the help of the website. Some confusion persisted when we tried switching between server locations, especially since the connection failed to authenticate several times after switching.",
    "Our tests were conducted using a 78.23Mbps Internet connection, from a location in Southeast Europe.",
    "We were pleasantly surprised by the download speeds delivered by a server in Italy: 46.03Mbps. Another in the UK performed significantly worse, with 17.90Mbps, but we've seen worse.",
    "Expectedly, a server in the US gave us an even lower speed than the UK at 15.14Mbps, which is about average in the industry. A server in India, meanwhile, gave us just 4.35Mbps.",
    "VPNUK doesn’t cost much and delivers decent speeds on nearby servers, but the performance drops off when connecting to servers located further away.",
    "It offers plenty of versatility when it comes to choosing your ideal VPN package, but lacks the ease of use offered by the top dogs in the VPN market. The service is also unable to give you access to content on geo-restricted VOD platforms, like Netflix."
  ],
  "headers": {
    "1": "Price",
    "9": "Alternatives",
    "11": "Streaming",
    "12": "About the company",
    "13": "Privacy and encryption",
    "20": "Support",
    "26": "Speed and experience",
    "30": "Verdict"
  },
  "links": {
    "VPNUK": "https://www.vpnuk.net/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://www.vpnuk.net/terms/#privacy",
    "Android app": "https://play.google.com/store/apps/details?id=uk.vpn.vpnuk",
    "FAQ and Knowledge Base": "https://www.vpnuk.net/faq/",
    "email": "mailto:helpdesk@vpnuksupport.com",
    "contact form": "https://www.vpnuk.net/contact-us/",
    "Facebook": "https://www.facebook.com/VPNUK/",
    "Twitter": "https://twitter.com/vpnuk",
    "YouTube": "https://www.youtube.com/user/users/vpnuklimited"
  }
}