{
  "source": "https://www.techradar.com/reviews/apple-airpods-2019-review",
  "title": "Apple AirPods (2019) review",
  "category": "audio-visual",
  "updated": "2021-10-25T16:26:06Z",
  "author": "olivia-tambini",
  "summary": "Are the second-gen Apple AirPods worth your money?",
  "verdict": "New features like wireless charging and faster pairing are useful, but the Apple AirPods (2019) aren’t a significant improvement over their predecessors, with the same lackluster audio performance and design. The battery life leaves something to be desired, too. Still, you shouldn't write off the AirPods completely. Two years since their launch, and they (along with the AirPods Pro and AirPods Max) are still the best true wireless earbuds for those that want excellent connectivity that works with the wider Apple ecosystem. Plus, their advancing age means that you can often find discounts on the wireless earbuds.",
  "pros": [
    "Excellent connectivity",
    "Wireless charging",
    "Hands-free ‘Hey Siri’ functionality"
  ],
  "cons": [
    "Wireless charging case costs extra",
    "Audio hasn't improved",
    "No interchangeable eartips"
  ],
  "article": [
    "The Apple AirPods are among the most popular true wireless earbuds on the planet – so are they still worth buying in 2021 now that the AirPods 3 have been announced?",
    "The upgraded Apple AirPods were released in 2019, when the world was expecting Apple to bring out a totally new version of the original AirPods, which launched in 2016. There were even rumors that the new AirPods would launch with active noise cancellation and a more waterproof design.",
    "In reality, the upgrades were less far-reaching than that, with Apple swapping out the existing processor for the latest H1 chip and giving the AirPods the ability to charge wirelessly.",
    "While this may have felt like a disappointment for some, the inclusion of a new H1 chip did improve connectivity and battery life compared to the original AirPods, and it allows you to summon Siri with your voice alone.",
    "Meanwhile, an optional wireless charging case means you can use a Qi-compatible charging mat to power the case, rather than sticking a cable into the Lightning charging port in the bottom of the case – though you do have to pay more to get the AirPods with a wireless charging case.",
    "These upgrades are certainly useful, but it doesn’t feel like Apple has addressed any of the issues the original AirPods had, notably, the sound quality and design.",
    "So, how do they sound? The AirPods have a lively, powerful presentation, although they can sound slightly harsh when it comes to higher-frequency sounds – and they certainly aren’t the bassiest earbuds on the market.",
    "The design leaves a lot to be desired, too. Sure, the AirPods’ protruding stems have become almost iconic, but the lack of interchangeable ear tips means many won’t be able to find a snug fit – and they definitely aren’t secure enough for us to feel confident about wearing them while exercising.",
    "These sound quality and design issues have since been addressed by the noise-cancelling AirPods Pro, which we would recommend over the 2019 AirPods. However, they are much pricier – and that brings us onto the price of the AirPods.",
    "The second generation of the Apple AirPods cost $159 / £159 / AU$249 with the standard charging case, and $199 / £199 / AU$319 with the new Wireless Charging Case bundled in.",
    "That’s pretty expensive compared to other better-sounding true wireless earbuds on the market, like the Lypertek PurePlay Z3 – although as time goes on, AirPods deals are increasingly common, and we’ve seen them drop to as low as $99 / £99 / AU$99.",
    "There’s no denying that the AirPods are still the most convenient earbuds to use with an iPhone or iPad, and that’s even more pertinent since a 2020 upgrade brought a an auto-switching feature that means the AirPods can now \"magically switch over between devices\", detecting automatically which device you are using.",
    "Whether that’s enough to convince you to buy them over cheaper alternatives, or the noise-cancelling AirPods Pro comes down to what you’re looking for from a pair of true wireless earbuds. And it’s worth bearing in mind that the next generation AirPods – the so-called AirPods 3 – are expected to be released this year.",
    "All in all, the Apple AirPods aren’t the worst true wireless earbuds you could buy, especially if you’ve already bought into the Apple ecosystem – but they’re definitely not the best true wireless earbuds you can buy in 2021, either.",
    "[Update: Finally, after months of speculation and waiting, Apple has finally launched its third generation of AirPods. You can read our Apple AirPods 3 review for the lowdown on the new earbuds, which support immersive Spatial Audio, adaptive EQ, and a longer battery life than their predecessors. Too pricey? Fear not, as the 2019 AirPods have also been given a permanent price cut.]",
    "The second generation of the Apple AirPods have been given a permanent price drop, and now cost $129 / £119 / AU$219.",
    "They previously cost $159 / £159 / AU$249 with the standard charging case, and $199 / £199 / AU$319 with the Wireless Charging Case bundled in. You can still buy the Wireless Charging Case separately for $79 / £79 / AU$129",
    "Significant Apple AirPod deals are rare, but not impossible to find – in fact, we've seen prices drop as low as $99 /£99 / AU$99.",
    "Design-wise, there’s not a huge amount of difference between the second-generation AirPods and the originals; the long earbud stems and pillbox-style charging case look pretty much identical, although the new charging case now features a small LED light on the front. This allows you to check the charge status of the buds – it glows green if they’re fully charged, and orange if they’re not.",
    "It’s interesting that Apple hasn’t changed the design of the earbuds themselves; after all, those stem-like protrusions were widely mocked upon their original release in 2016, and they don't do the headphones any favors today.",
    "After all, other true wireless earbuds that arguably look more stylish have been released since then, like the Sennheiser Momentum True Wireless 2 and the Bowers & Wilkins PI7.",
    "Another criticism of the first-generation AirPods was the lack of adjustable silicone ear tips that would allow you to find the best fit for your ears... and it’s the same story with the 2019 AirPods.",
    "Despite this, the new AirPods do feel fairly snug and comfortable, although we probably wouldn’t wear them out running for fear of them falling out. As with other Apple products the design of the AirPods has quickly become somewhat iconic, and you could argue that the originals popularized the true wireless earbud, which is a good enough reason to stick to a tried and tested design.",
    "Saying that, these design woes is have now been addressed with the AirPods Pro, which come with adjustable silicone tips and shorter stems for a more streamlined look.",
    "In terms of audio quality, nothing has changed between the original AirPods and the second-generation model. They have a lively, powerful presentation, although they can sound slightly harsh when it comes to higher-frequency sounds, and they aren’t the bassiest earbuds on the market.",
    "We tried them out on Joanna Newsom’s Sawdust and Diamonds, and while we were impressed by the clarity of the vocal, we were slightly underwhelmed by the treatment of the bass, and found that the treble frequencies were sometimes uncomfortably harsh.",
    "We had the same issues listening to Al Green’s Let’s Stay Together; while the mid-frequency vocals sounded smooth and detailed, the higher brass and woodwind accents overpowered the other frequencies.",
    "The AirPods (2019) fared slightly better when it came to Radiohead’s No Surprises. The gently strummed acoustic guitar had a warm, textural sound, while the glockenspiel sweetly accented the percussion with its crystalline presentation. Again, the vocals sounded good overall, with a smooth, clear tone; however, the new AirPods didn’t quite manage to convey the rich bass timbres.",
    "So, like the original AirPods, the new Apple AirPods sound great when it comes to mid-frequency vocals, guitar and keys, but they can sound rather lackluster when it comes to bassier frequencies, and you may experience slight harshness with percussive, high-frequency sound.",
    "There's no noise cancellation on offer here; for that, you'll need to take a look at the AirPods Pro, or the fantastic Sony WF-1000XM3 Wireless Earbuds.",
    "The charging case offers a further 20 hours of battery life on top of the five hours you get from the buds themselves, which is the same as the original AirPods; Apple also says the second-generation model offers “three hours of talk-time from a single charge”, up from the two hours provided by the originals. This is thanks to Apple’s proprietary H1 chip, which is built into the new AirPods.",
    "We found charging the case was really quick – we went from 25% to 100% battery in around an hour – and we also found the stated battery life for the earbuds themselves to be accurate.",
    "The new wireless charging case means you can use Qi-compatible charging mats to power the case without the annoyance of cables, which is convenient if you already have a wireless charging mat – and as mentioned, if you have the original AirPods, you can buy the case separately.",
    "The main calling card of the second-gen AirPods is improved connectivity, thanks to Apple’s H1 headphone chip, which replaces the previous chip, the W1.",
    "Pairing was pretty rapid with the original AirPods, but it’s noticeably quicker with the new AirPods; if you’re using an iPhone, an option to pair the AirPods will appear on your phone screen as soon as you open the charging case, as well as the battery status of the AirPods and the charging case.",
    "A 2020 upgrade also brought a an auto-switching feature that means the AirPods can now \"magically switch over between devices\", detecting automatically which device you are using – handy if you're already embedded into the Apple ecosystem.",
    "The H1 chip also enables the new AirPods to offer hands-free ‘Hey Siri’ functionality. This means you can use the voice assistant command to place calls, change songs and more – basically anything Siri can do, direct from the earbuds, without needing to pull your iPhone out.",
    "We found this feature worked really well, and the built-in microphone was adept at picking up our voice, even in loud environments.",
    "If you prefer, you can set up the new AirPods to summon the voice assistant when you double-tap the outer housing of the earbuds. If you select the AirPods from the Bluetooth menu in your phone’s settings, you can also configure the touch controls to play/pause your music, skip to the next or previous track; you can also turn off touch controls altogether. You can only assign one double-tap control to each earbud, which can be slightly limiting.",
    "While we carried out most of our tests using an iPhone SE, we also tried pairing them with an Android phone, the Huawei Mate 20. While you don’t get the automatic pairing you get with an iPhone, Bluetooth pairing is still pretty quick. You just need to hold down the pairing button on the back of the AirPods case and they should appear in your phone’s Bluetooth menu.",
    "Apple says the H1 chip means the “AirPods deliver up to two times faster switching between active devices”, are “50% faster when transferring a call to your AirPods”, and “deliver 30% lower gaming latency”.",
    "We tested the second-gen AirPods while playing iOS games and we didn’t experience any latency issues. We also found using the AirPods to make and answer calls to be a seamless experience, and the quality of the audio was generally very good."
  ],
  "headers": {
    "15": "Price and availability",
    "18": "Design",
    "24": "Audio performance",
    "30": "Battery life and connectivity",
    "42": "Don't buy them if..."
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "the AirPods 3 have been announced": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "original AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Lypertek PurePlay Z3": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "AirPods deals": "https://www.techradar.com/news/cheapest-airpods-prices",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods 3 review": "https://www.techradar.com/reviews/apple-airpods-3rd-generation#should-i-buy-the-apple-airpods-3rd-generation",
    "2019 AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "a permanent price cut": "https://www.techradar.com/news/apple-just-made-airpods-a-bestseller-this-black-friday",
    "now cost $129 / £119 / AU$219": "https://www.techradar.com/news/apple-just-made-airpods-a-bestseller-this-black-friday",
    "Apple AirPod deals": "https://www.techradar.com/news/cheapest-airpods-prices",
    "Sennheiser Momentum True Wireless 2": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-2-review",
    "Bowers & Wilkins PI7": "https://www.techradar.com/reviews/bowers-and-wilkins-pi7",
    "Sony WF-1000XM3 Wireless Earbuds": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "Huawei Mate 20": "https://www.techradar.com/reviews/huawei-mate-20"
  }
}