{
  "source": "https://www.techradar.com/reviews/vizio-m-series-512-channel-sound-bar-with-dolby-atmos-m512a-h6",
  "title": "Vizio M-Series 5.1.2 Channel Sound Bar with Dolby Atmos (M512a-H6) review",
  "category": "audio-visual",
  "updated": "2021-10-27T13:37:32Z",
  "author": "lewis-leong",
  "summary": "A great value for Dolby Atmos and DTS:X sound",
  "verdict": "The Vizio M512a-H6 is a great value for those who want to get into Dolby Atmos without breaking the bank. The sound bar system sounds balanced, offers a ton of customization, and offers a great sense of space. While we wish the sound bar included an app for easier control and WiFi streaming, they’re understandable omissions at this price.",
  "pros": [
    "Simple set up",
    "Intuitive remote",
    "Good sound and soundstage"
  ],
  "cons": [
    "No app support",
    "No built-in Wi-Fi",
    "Sound lacks detail for music"
  ],
  "article": [
    "The Vizio M512a-H6 is the company’s follow up to the excellent M51a-H6 with the main difference being the addition of two up-firing Dolby Atmos speakers.",
    "For the uninitiated, Dolby Atmos offers spatial audio that is more immersive by adding up-firing speakers to help aid soundstage height. More and more streaming services are adding movies mixed for Dolby Atmos to take advantage of this new audio format.",
    "The M512a-H6’s name hints at how the system is setup. There are five channels with one subwoofer, and an additional two up-firing Atmos speakers. The sound bar itself contains a center, left, right channels as well as the aforementioned two up-firing Atmos speakers. The subwoofer connects wireless with the sound bar but the two satellite speakers are wired and need to be plugged into the subwoofer.",
    "All that said, sound quality is good, and the addition of the two Atmos speakers help create a more immersive movie watching experience. While not the most detailed nor the most full featured soundbar system, at just $450 (about £325 / AU$582), the Vizio M512a-H6 is an excellent value for an entry-level surround soundbar system.",
    "The Vizio M512a-H6 retails for $450 (about £325 / AU$582) and will begin shipping in May 2021 at least here in the US, though no UK/AU availability has been announced yet. That being said, if you need something before that – especially something that's more powerful – the $999 Vizio Elevate offers more immersion and bass impact, but for double the price of the M512a-H6.",
    "The Vizio M512a-H6 is an understated sound bar that disappears visually. The sound bar itself is covered in a black mesh, hiding the drivers that live behind it. On top, the Dolby Atmos speakers are shrouded by black plastic covers and there are physical controls for playback, source selection, Bluetooth, and volume.",
    "Around the back, there’s an HDMI eARC, HDMI in, optical, USB, and a 3.5mm jack that can be used to hook up to a smart speaker. Out of the box, however, the M512a-H6 doesn't have any built-in smart assistant support.",
    "The subwoofer has a 6” woofer and connects wirelessly to the sound bar, however, the two satellite speakers are wired, and must be connected to the subwoofer.",
    "The good news? There’s plenty of cable length for the satellite speakers for flexible placement but unfortunately you’ll need to provide your own speaker stands for the satellites as they are not provided. Alternatively, you can place the satellite speakers on the left and right of the sound bar to use in a simulated surround set up.",
    "In terms of features, the Vizio M512a-H6 is pretty basic: there’s no Wi-Fi for direct streaming nor is there any smart assistant built in. However, there is Bluetooth for when you want to use the sound bar system for streaming music. There’s no airplay or Google Cast support either, so don’t expect it to integrate into your multi-room music setup unless you hook up a smart speaker to its 3.5mm connection.",
    "While basic in features, the core experience of using the M512a-H6 is very good. The sound bar supports HDMI eARC so it’ll turn on/off with your television. The remote control is also surprisingly robust – it features a small LED screen that lets you know what settings you’re changing. Everything from EQ, balance, inputs, and other settings can be controlled with the physical remote.",
    "While the remote is great, we would have liked an app to control settings more easily as the LED screen is so small, text is often truncated.",
    "In terms of sound quality, the Vizio M512a-H6 is well balanced out of the box and the subwoofer aurally disappears. There’s a great sense of space with the satellite speakers placed behind the listener. Soundstage is surprisingly wide but lacks the pinpoint accuracy of more expensive soundbar and speakers, meaning you won’t be able to pick out exactly where different instruments are coming from.",
    "In our testing, it’s clear that the M512a-H6 is first and foremost designed for home theater, providing tons of volume, impact, and a wide soundstage. Music sounds good, but lacks detail and instrument separation.",
    "For the most part, however, movies are definitely more immersive and the Dolby Atmos speakers do a good job of adding a sense of height... well, they can depending on your room’s setup. You see, Dolby Atmos works best with ceilings that are flat and around 10 to 12 feet tall. Those with vaulted ceilings will not benefit as much from the up-firing Atmos speakers. Still, if you've got the right set up, it's a surprisingly good performance for a soundbar at this price point.",
    "In terms of bass, the tiny 6-inch subwoofer does a good job digging deep but won’t provide the same visceral impact of a larger subwoofer. Those who want to feel bass will have to set up to a system with a larger sub like the Vizio Elevate."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Price and availability",
    "5": "Design",
    "9": "Features",
    "12": "Performance",
    "16": "Don't buy it if..."
  },
  "links": {
    "Dolby Atmos speakers": "https://www.techradar.com/best/best-dolby-atmos-speaker-guide",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Vizio Elevate": "https://www.techradar.com/reviews/vizio-elevate-sound-bar"
  }
}