{
  "source": "https://www.techradar.com/reviews/sony-xperia-10-iii",
  "title": "Sony Xperia 10 III review",
  "category": "phones",
  "updated": "2021-07-09T16:32:17Z",
  "author": "andrew-williams",
  "summary": "Small, but not that mighty",
  "verdict": "The Sony Xperia 10 III is a surprisingly tough little phone, but poor cameras and very slow charging mean it just can’t compete at the money Sony asks for.",
  "pros": [
    "Good battery life",
    "Petite phone with a mature design",
    "Great water resistance"
  ],
  "cons": [
    "Poor cameras",
    "Ridiculously slow charging",
    "Mediocre processor"
  ],
  "article": [
    "The Sony Xperia 10 III is a good demonstration of the ways Sony takes a slightly different approach to some other phone makers.",
    "It’s a small phone, nothing like one of the relatively big affordable 5G phones such as the Xiaomi Mi 10T. You don’t get a high refresh rate screen, but it does have a zero-filler camera array. The Sony Xperia 10 III has a 2x zoom lens, an ultra-wide and a standard 12MP camera.",
    "Sony doesn’t use the very best budget 5G chipset around, but this one is decent enough and the phone has a sharp OLED screen.",
    "We like the position the Sony Xperia 10 III takes. You don’t get too much show-off stuff, but it does seem to offer a few characteristics you’ll appreciate every day. However, most of these don’t really pan out in actual use.",
    "The Sony Xperia 10 III has possibly the worst camera we’ve tested at £400 (around $470, AU$740) for some time, fueled not just by the use of uninspiring sensors but poor processing too. Other Sony divisions make the very best phone camera sensors, and many of the best mirrorless cameras money can buy. But there’s no evidence of that expertise in the Xperia 10 III.",
    "Its speaker also sounds relatively thin and doesn’t go as loud as many competing phones, and pricing is not particularly competitive either.",
    "The Sony Xperia 10 III is disappointing and more expensive than its Xperia 10 II predecessor. But it may still be worth considering if you’re less interested in the nerdy tech than having an easy-to-handle phone that looks classy and offers solid battery life.",
    "The Sony Xperia 10 III is out now in the UK and costs £399. It was announced in April 2021 and went on sale in June. It's not officially available in the US at the time of writing, but you can find international versions for around $470. In Australia meanwhile it's hard to even find an international import currently.",
    "If you want a 5G phone and have that sort of money to spend, you have plenty of Androids to consider. There’s the larger Xiaomi Mi 10T, the cheaper OnePlus Nord CE 5G. Or if only the classic electronics brands suit your tastes, you can buy the Samsung Galaxy A52 5G or Samsung Galaxy A32 5G instead.",
    "That last Samsung is much cheaper, but has a lower-resolution screen and an all-plastic body.",
    "The Sony Xperia 10 III is a fairly plain-looking phone, but this is the classic Sony style. It does not lean on light-reactive finishes and color gradients. Xperia phones have had the same basic ‘monolith’ design since the year dot.",
    "We like it. It’s a mature style, the polar opposite of Realme and Xiaomi phones that have slogans printed on their rears in huge bold fonts.",
    "The Sony Xperia 10 III's shape and appearance is crucial to the appeal here. This feels like a small phone. At 68mm wide it is only slightly wider than the iPhone SE (2020) and even tinier than the Samsung Galaxy S21.",
    "If you’re tired of Android giants, the Sony Xperia 10 III may be what you need. It’s easy to handle and use, and while the non-tapered back does not make the most of those compact dimensions, you can appreciate the size of this phone as soon as you pick it up.",
    "Build quality is perhaps slightly better than what we’ve come to expect at this sort of price. The Sony Xperia 10 III has a glass back and glass front, but the sides are plastic. Both panes of glass use Gorilla Glass 6, just one tier below Corning’s flagship Victus glass.",
    "There’s more too. The phone has IP68/65 water resistance, which is excellent for a lower-tier mid-range phone. It means the Xperia 10 III is designed to handle both immersion in water at a depth of 1.5 meters and water jets. Put a slim silicone case on this phone and it is well-protected.",
    "You don’t get a case in the box, though, and no plastic screen protector is applied as standard. Sony is rare in its inclusion of a 3.5mm headphone jack in all its Android phones though. The Xperia 10 III has one, as do the higher-end Sony Xperia 5 III and Sony Xperia 1 III.",
    "We noticed its sound output was on the low side, but this should only annoy if your wired earphones/headphones are quiet too.",
    "This, unfortunately, applies to the internal speaker as well. The Sony Xperia 10 III has a single speaker, one that sits just below the display glass. It doesn’t have the mid-range substance of many of the larger phones in this price class, and fails at two of the key tests of any phone speaker. It struggles to make podcasts audible while you’re in the shower, and doesn’t have the volume to compete with the sound of a boiling kettle.",
    "It is no surprise a small phone like the Xperia 10 III has no room for a bass-improving speaker enclosure, but bear this in mind.",
    "The Sony Xperia 10 III has a side-mounted fingerprint scanner for pin-free unlocking, and it’s solid. While it takes the best part of a second to get you to the home screen, its reliability is very good. There’s also a Google Assistant button below this scanner.",
    "While we haven’t pressed this accidentally much in general use, we did find it kept going off when we went running with the Sony Xperia 10 III sitting in a pocket. This disturbs your music/podcast/audiobook, and gets annoying quick. We couldn’t find a way to disable this button.",
    "Sony’s style shows through in the Xperia 10 III screen too. This is an ultra-tall 21:9 display with no notch or punch-hole. The selfie camera sits in the screen surround, which makes the phone relatively long and allows for a 6-inch display in a truly narrow Android.",
    "This is an OLED panel, one that delivers the usual unbeatable contrast and good color of this display type. However, it does not have the obscene brightness levels of a top-end phone. Like other more affordable 5G Androids, the Xperia 10 III handles sunny days okay, but the display won’t seem anywhere near as bright as it does indoors.",
    "You should also bear in mind the realities of a 6-inch 21:9 screen. It’s great for social media feeds and reading articles, but is on the small side for gaming and watching 16:9 aspect video (standard widescreen content).",
    "And while the Sony Xperia 10 III supports HDR video, we don’t think this is the best phone to get if streaming Netflix or YouTube is one of your top daily activities. A bigger screen is always better for such stuff.",
    "This display is also stuck at the standard 60Hz refresh rate. 90Hz and 120Hz screens are now very common in Androids, even ones that cost just half as much as the Xperia 10 III. This means scrolling through Twitter, Chrome and your app drawer will look less smooth than it would otherwise.",
    "The Sony Xperia 10 III's camera is its most disappointing area, mostly because it sounds so promising on paper but does not deliver. It has a 12MP primary camera, an 8MP 2x optical zoom one and an 8MP ultra-wide.",
    "There are no filler lenses here, no useless 2MP macro cameras or 2MP depth sensors. And these days genuine zoom cameras are very rare in reasonably affordable Androids.",
    "A quick comparison with the Realme 8 Pro shows us why. That phone does not have a telephoto camera but its 3x digital mode can actually take more detailed images than the Xperia 10 III’s 2x optical zoom.",
    "These 2x zoom pics are a bit more detailed than a simple crop of the 1x camera, but they are soft, and the phone’s other photos are nothing to get too excited about either. Dynamic range is the big issue.",
    "First off, the Sony Xperia 10 III primary camera’s native dynamic range is not going to be up to much anyway. It’s a relatively small Sony IMX486 12MP sensor with 1.12-micron sensor pixels, significantly smaller than the class leader Google Pixel 4a’s 1.4-micron pixels.",
    "Smaller sensor pixels mean lower light sensitivity. And this camera does not use pixel binning to make up for this.",
    "However, the Sony Xperia 10 III’s low dynamic range has more to do with software than the hardware. Most phones use dynamic range enhancement in almost every shot taken these days. This phone seems to use it only occasionally in its Auto HDR mode, even when the scene clearly calls for masses of HDR tweaking.",
    "You can switch HDR to ‘on’, and doing so is not a bad idea. But even then, the Sony Xperia 10 III’s dynamic range is relatively poor. You can fix this to an extent in the edit. We opened up a bunch of images in Photoshop CC on a laptop to lift the shadows, and found loads more detail that appeared near-black as rendered by the Xperia 10 III. Phone apps can perform the same technique, if a little less gracefully.",
    "However, this won’t fix issues where low dynamic range exhibits not as a glum foreground but as a blown-out sky or cloud contours. Once parts of an image are blown out, they stay that way.",
    "Sony seems to have worse dynamic range and contrast management than any of its rivals at this level, by a huge margin. Most of the shots we took with the Sony Xperia 10 III were duds as a result.",
    "There are more issues too. The Sony Xperia 10 III’s zoom camera suffers from focus seeking, where you can see the preview image repeatedly get sharper and blurrier as it looks for the point of focus. This can result in out of focus images if you don’t give it time to settle.",
    "And the most annoying issue of all doesn’t really even relate to image quality. There is masses of lag in the Sony Xperia 10 III's camera. The thing pauses for 2-3 seconds at each press of the shutter button before the shot is actually taken, allowing you to snap another.",
    "A charitable view of this is that the phone waits for the optimal moment of minimal motion in your hands and the subject, to avoid a blurry image. But there’s no real excuse for lag this bad. It sucks all the fun out of phone photography. All of it.",
    "The Sony Xperia 10 III's ultra-wide camera isn’t great either, using the typical selfie-grade sensor of a phone half the price. All the phone’s sensors are oddly dated too. OmniVision announced the 2x telephoto’s sensor in 2015. The others were used in a bunch of cheap Chinese phones in 2018, and in few other models since. It's also a very similar array to last year's Sony Xperia 10 II.",
    "There’s nothing wrong with using older sensors if they fit the bill, of course. The Google Pixel 5 has the same Sony IMX363 as 2018’s Pixel 3. But we can find nothing about the Sony IMX486 to justify its use in 2021.",
    "The Sony Xperia 10 III can at least shoot 4K video at 30fps. It’s stabilized too, and looks very solid in good lighting. The selfie camera is acceptable as well, and appears to use the same sensor as the ultra-wide camera on the back.",
    "Its pictures look sharp in good lighting, but turn soft indoors or in the dark, in part because the sensor is tiny.",
    "The Sony Xperia 10 III also has a dedicated night mode, which can be used with all three rear cameras. It may improve the brightness and clarity of low-light images, but night photography here is still bad. There’s zero fine detail, photos look splotchy and vague.",
    "The Sony Xperia 10 III has a Snapdragon 690 chipset, one of Qualcomm’s mid-tier budget 5G CPUs. It's worse than the Snapdragon 750G of the OnePlus Nord CE 5G or the Snapdragon 765G of the Realme X50 5G.",
    "And, surprisingly enough, it’s actually slightly worse for gaming than the Moto G50’s Snapdragon 480 chipset. The Snapdragon 690 has an Adreno 619L graphics chipset, one somewhat less powerful than the Adreno 619 used in the ‘budget’ Snapdragon 480.",
    "A tough game like Fortnite runs just-about-passably, but there are quite frequent drops from the target 30fps into the teens, which you will notice. And the maximum graphics setting is ‘Medium’, which does not show off the visuals at their best. A phone half the price, the Moto G50, can run the game marginally better, although the actual experience of play is much the same: compromised visuals and frame rate in both cases.",
    "That said, we do like the Sony Xperia 10 III’s 21:9 aspect ratio screen for virtual gamepad controls. While those who spend hours playing games on their phones may want a larger screen, this one offers plenty of room for virtual controls without the sense your thumbs are getting in the way of the action.",
    "The Sony Xperia 10 III’s general performance is good enough for the most part. A processor like the Snapdragon 690 does not introduce major lag in Android, particularly when paired with a solid 6GB of RAM and 128GB of reasonably fast storage.",
    "It’s the sort of performance you see in a lot of entry-level 5G phones, where any performance deficit is seen in app load times and games, not grating day-to-day lag. We noticed Chrome wasn’t always super responsive and some menus do take a fraction of a beat to appear. There’s nothing too annoying here, but there is at least a mild performance compromise.",
    "The Xperia 10 III’s problem is it is one of the more expensive phones with this kind of performance. Xiaomi’s Poco F3, for example, is cheaper and in a completely different league thanks to its Snapdragon 870 chipset.",
    "We did encounter a few bugs too. The most notable: the Sony Xperia 10 III fired out ‘not responding’ type messages a bunch of times when the screen was set to auto-rotate, depending on the orientation of the phone.",
    "The phone’s software is based around Android 11, and the Sony interface layer pasted on top does not do anything too ambitious or off-putting. Its app menu is the most obvious point of departure from vanilla Android.",
    "It’s still a vertical scroll but you can arrange the app icons in your own order, and create folders in the app drawer, rather than just laying them out alphabetically.",
    "The Sony Xperia 10 III has a 4,500mAh battery. While 5,000mAh has become something of a default size for Androids, this is good capacity for a small phone. It’s 500mAh more than the Samsung Galaxy S21.",
    "Sure enough, the phone’s stamina is significantly better than that step-up Samsung, going by our experience of the Exynos CPU version of the Galaxy S21 sold outside the US. The Sony Xperia 10 III is one of the longer-lasting small Android phones, also beating the Pixel 4a and, on the other side of the fence, the iPhone SE (2020).",
    "However, it didn’t get close to lasting two days of our usual moderate to somewhat heavy use. We found the Moto G50 lasts significantly longer, for example. And while we’re happy with the Sony Xperia 10 III’s stamina, we were never left with 40-50% charge left by the end of the day. We’ve seen that with some of the larger Androids in the 250-400 dollar/pound range.",
    "We’d heard great things about the phone's longevity, but this seems to apply more to jobs like video playback. For mixed general use it’s good, it’s strong, but not eye-opening.",
    "The Sony Xperia 10 III's battery is also slow to charge. It comes with a dismal 7.5W charger, which comes across as a bad joke at what this phone costs. OnePlus offers fantastic 30W charging at this level.",
    "Such a weak charger takes more than hour to get to 50%. We tried using a 20W Quick Charge charger, but the Sony Xperia 10 III still only drew about 6W according to our power meter. Not good enough.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Sony Xperia 10 III price and availability",
    "10": "Design",
    "22": "Display",
    "27": "Camera",
    "45": "Software and performance",
    "55": "Battery life",
    "61": "Don't buy it if..."
  },
  "links": {
    "Xiaomi Mi 10T": "https://www.techradar.com/news/xiaomi-mi-10t-release-date",
    "best phone camera": "https://www.techradar.com/news/best-cameraphone",
    "best mirrorless cameras": "https://www.techradar.com/news/best-mirrorless-camera",
    "Xperia 10 II": "https://www.techradar.com/reviews/sony-xperia-10-ii",
    "OnePlus Nord CE 5G": "https://www.techradar.com/reviews/oneplus-nord-ce-5g",
    "Samsung Galaxy A52 5G": "https://www.techradar.com/reviews/samsung-galaxy-a52-5g-review",
    "Samsung Galaxy A32 5G": "https://www.techradar.com/news/samsung-galaxy-a32-5g-release-date-price-specs-and-5g-vs-4g-lte",
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Sony Xperia 5 III": "https://www.techradar.com/reviews/sony-xperia-5-iii",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Realme 8 Pro": "https://www.techradar.com/reviews/realme-8-pro",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Sony Xperia 10 II": "https://www.techradar.com/reviews/sony-xperia-10-ii",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Moto G50": "https://www.techradar.com/reviews/moto-g50",
    "Poco F3": "https://www.techradar.com/reviews/xiaomi-poco-f3"
  }
}