{
  "source": "https://www.techradar.com/reviews/windscribe",
  "title": "Windscribe VPN review",
  "category": "computing",
  "updated": "2021-11-05T19:42:02Z",
  "author": "mike-williams",
  "summary": "A feature-packed VPN with one of the best free plans around",
  "verdict": "Windscribe doesn't have the best speeds or the fastest support, but that won't be an issue for everyone. Mostly it's a great VPN, with loads of features, good-looking and powerful apps, and a generous free plan which makes it easy to try the service for yourself. Go check it out immediately.",
  "pros": [
    "Crammed with advanced features and functionality",
    "10GB free data allowance",
    "Unblocks BBC iPlayer, Amazon Prime Video, Disney Plus",
    "Good value with very flexible plans"
  ],
  "cons": [
    "Below average WireGuard speeds",
    "Doesn't unblock US Netflix",
    "No 24/7 or live chat support",
    "No security audit"
  ],
  "article": [
    "Windscribe is a very interesting VPN which piles on the features, yet remains easy to use, with some great value commercial products, and one of the most generous free plans around.",
    "A decent-sized network provides locations in 110 cities spread across 63 countries. Windscribe claims its servers really are in these locations, too, rather than, the company suggests, 'some competitors who have most of their servers in US and Europe, and simply fake the location with false IP WHOIS data to make it appear that it's elsewhere.'",
    "An array of apps keeps you covered on Windows, Mac, Android, iOS and Linux. Chrome, Firefox and Opera extensions give you even more ways to connect and stacks of privacy-related extras, and the website has guides to help you set up the service on routers, Kodi, Amazon Fire TV, Nvidia Shield, and via any OpenVPN-compatible software or device.",
    "WireGuard, IKEv2 and OpenVPN support with strong AES-256 encryption keeps all your tunnel traffic safe from snoopers, while stealth technologies try to obfuscate your VPN usage, perhaps allowing you to get online even in countries which actively block VPN traffic.",
    "Windscribe has always had powerful apps, but its v2.0 range takes them to a new level. They bring a stylish new interface, WireGuard everywhere, easy searching for locations, very configurable split tunneling (on the desktop as well as mobile devices), MAC address spoofing (a clever new way to prevent you being tracked), versatile auto-connect rules, automatic updates, even a command line interface to automate the VPN from scripts. More on those later.",
    "ROBERT is Windscribe's DNS-based tool for blocking ads, malware, trackers and various internet content types (gambling, 'fake news and clickbait', and so on). This goes way beyond the basic DNS blacklist you'll get with other providers, and gives you more power and configurability than even many desktop content-filtering apps deliver.",
    "Support is available via ticket, if you need it, but it's not 24/7. There's also no human-powered live chat, although the site does have Garry, a smarter-than-average bot, which can help with simple problems.",
    "Still, there's an unusual bonus in Windscribe's own subreddit with many new posts every day, and occasional replies from Windscribe. That's valuable as it allows potential customers to see what real Windscribe users are talking about, the questions they have and the issues they're facing – a level of transparency you rarely get with other VPNs.",
    "Windscribe's free plan offers a generous 10GB of data transfer a month if you register with your email address, 2GB if you don't. You're limited to 11 countries – North America, across Europe, and Hong Kong – but that's still far better than you'll get with many free services ('sorry, our free app only connects to Brunei, is that a problem?').",
    "Upgrading to a commercial plan gets you unlimited data, access to all 110 locations, and the ability to generate custom OpenVPN, IKEv2 and SOCKS5 configurations.",
    "There are no annoying limits on simultaneous connections, either. You can set up and use the service wherever you like, as long as the devices are yours (the small print forbids sharing your account with others).",
    "Prices are low. Monthly billing is only $9, for instance – many VPNs charge $10-$13. Pay for a year upfront and the price falls to an equivalent $4.08. That's a little below average, although if you're willing to sign up for longer then there are savings to be made with some rivals.",
    "For instance, the three-year plan from Private Internet Access is $2.19 a month, and VyprVPN gives you three years for $1.81 a month. At the time of writing, Ivacy has a five-year deal priced at $1.33 a month. Sure, we don't like long-term contracts either, but look at the totals. One year of Windscribe is $49, so after a year and a day you'll have paid $98, while handing over $80 to Ivacy gets you coverage for five years.",
    "That's not the end of the story, though. Windscribe's 'Build a Plan' scheme might allow you to save money by choosing just the locations you need, for $1 each. Each location adds 10GB to your free bandwidth allowance, and your plan must have a minimum of two locations.",
    "For example, if you register with your email address, you'll get 10GB data allowance a month. Build a plan with the US and UK locations, and you'll get 30GB of data for $2 a month. You can upgrade to unlimited data for another $1, or a total of just $3 a month, billed monthly (not just $3 because you've signed up for three years).",
    "If you only use a VPN for occasional short trips, say, that looks like a great deal. Surfshark's monthly-billed plan is more than four times as expensive at $13, for instance – okay, that's the full service with all the locations, but if you don't need them, who cares?",
    "Another option, ScribeForce, enables signing up a group of users (a business, a family) with the same account. There's a five-user minimum, but you'll pay just $3 each, billed monthly, for access to the full and unrestricted service.",
    "Unusual Windscribe account options include purchasing a static IP address. Adding a residential IP address costs $8 a month, for example (data center IPs are $2), but could greatly improve your chances of accessing any blocked sites, and enable connecting to IP-restricted business and other networks. (Once you have a static IP, you can also enable port forwarding in the Windscribe web console).",
    "Whatever your preference, Windscribe gives you a wider than usual choice of payment options, which include card, PayPal, Bitcoin and other cryptocurrencies via CoinPayments.net, along with gift cards and assorted other options via Paymentwall.",
    "Windscribe doesn't quite have the lowest headline prices, then, but it's monthly-billed plans are as cheap as you'll get. The others are fairly priced for the features you get, there are huge savings to be made if you're covering multiple users, and all this flexibility is a major plus.",
    "If you don't require a full service all the time, the free plan may be enough for casual use, and you could, say, buy three months of unlimited bandwidth a year for a total of $9, with no lengthy contract required. Many VPNs charge more for a one-off month.",
    "There is a small catch in Windscribe's money-back guarantee, which only covers you for three days and if you've used less than 10GB traffic. But if you think that might be an issue, download and try the free version before you buy, giving you extra time to see how the service works for you.",
    "Windscribe's privacy features start with its industrial-strength AES-256 encryption, with SHA512 authentication, a 4096-bit RSA key and support for perfect forward secrecy (keys aren't re-used, so even if a snooper gets hold of a private key, it will only allow them to view data within one session).",
    "The apps use multiple techniques to reduce the chance of data leaks, limiting IPv6 traffic, redirecting DNS requests through the tunnel to be handled by the VPN server, and optionally using a firewall to block all internet access if the connection drops.",
    "We checked Windscribe's performance on a Windows 10 system using the websites IPLeak, DNSLeakTest and DoILeak, and found no DNS or other leaks.",
    "We enabled the Windows client's kill switch (which Windscribe calls a firewall) and forcibly closed the VPN connection to see how it would behave. The results were almost perfect: our internet access was immediately blocked, the client interface updated to show there was a problem, then it immediately began reconnecting, and displayed a Windows desktop notification once we were online again.",
    "We'd like to have seen a desktop notification to tell us when the connection dropped, but that's just a usability issue; if the firewall kicks in and the client is minimized, the user is left to guess why their internet access has died. Normally you should be reconnected within a few seconds, though, so this isn't a major problem. And in privacy terms, the client worked perfectly, handling every oddball situation we threw at it and protecting our traffic at all times.",
    "Windscribe's stance on logging is covered in a clearly written and refreshingly short privacy policy which explains what the company does and doesn't collect.",
    "There's a tiny amount of very minimal long-term logging, but it's limited to the total bandwidth you've used in a month (essential to manage usage on the free plan), and a timestamp of your last activity on the service to allow identifying inactive accounts.",
    "The system does briefly collect some connection details – username, VPN server connected to, time of connection, bandwidth used during the session, number of devices connected – but these are held in the VPN server's RAM only, and are lost when the session closes.",
    "Other than that, there is no logging of connections, IPs, timestamps or browsing history. Or as the privacy policy puts it, 'we do not store any logs on who used what IP address, so we cannot tie user activity to any single user.'",
    "As there is no data on your activities, Windscribe points out that there's nothing to share. This is backed up by a transparency report which covers the numbers of DMCA and Law Enforcement data requests over the year, and in both cases states that: 'Exactly zero requests were complied with due to lack of relevant data.'",
    "This is all good, but we would like to see Windscribe go further. Competitors such as TunnelBear and ExpressVPN (along with others) have had their systems publicly audited to check for logging or other privacy issues, and that gives far more reassurance to potential customers than comforting words on a website. We hope that Windscribe (and all other VPN providers for that matter) will soon do the same.",
    "In the meantime, it's worth remembering that Windscribe gives you 2GB of data per month, for free, without requiring an email address or any other personal data. If you're just looking to protect email and basic browsing and can live with the data limit, this automatically gets you more guaranteed anonymity than you'll have with almost everyone else.",
    "Our performance tests involved connecting to the nearest Windscribe locations from both a UK data center and US location, each with 1Gbps test connections. We then measured download speeds using benchmarking services including SpeedTest (both the website and command line app), nPerf, SpeedOf.me and more. We ran each test using at least two protocols, and in both morning and evening sessions.",
    "OpenVPN downloads reached a very acceptable 230-240Mbps in the UK, a similar 220Mbps in the US. That outperforms CyberGhost's UK OpenVPN speeds (170-210Mbps) and Surfshark (100-110Mbps) and should cover you on most devices and connections, but can't match the best services (ExpressVPN, Hide.me, HideMyAss and ProtonVPN UK connections were all capable of 300Mbps and more).",
    "Switching to WireGuard, speeds fell to 150Mbps in the US, bizarrely. That doesn't make a lot of sense, and contradicts what we've seen before.",
    "Checking in the UK, we found Windscribe's UK speeds doubled to 430-480Mbps, much more in line with what we'd expect. Whatever happened during our US testing – a temporary server or testing glitch, maybe? – the UK figures show Windscribe is capable of some decent speeds.",
    "The service is probably fast enough for most connections, devices and applications, but it doesn't match the best of the competition. Most of the top VPNs deliver 500Mbps and above using their best protocols, and CyberGhost, IPVanish, Mozilla and NordVPN all hit speeds of 750Mbps and above.",
    "We can only measure the speeds for our test locations, of course, and you may see different results. If speed is a top priority for you, using the free version gives you the chance to check local speeds (from the 11 locations) without as much as handing over your email address. Alternatively, Windscribe's 'Build A Plan' option could give you a month of unlimited traffic to a couple of locations for only $3, a low-priced way to run all the intensive speed testing you need.",
    "Connecting to a VPN server in another country may, in theory, allow you to access content you wouldn't otherwise be able to view.",
    "Unfortunately, it's not always that simple, as many content providers now attempt to detect and block visitors they think are using a VPN.",
    "To test a VPN's unblocking abilities, we log in to at least three US and UK locations and attempt to view US Netflix, Amazon Prime Video, Disney Plus and BBC iPlayer streams.",
    "BBC iPlayer has some capable VPN defenses, and we've seen Windscribe have some issues with it in previous reviews. But not this time: iPlayer didn't detect our VPN use, and we were able to browse and view whatever content we liked across all three test locations.",
    "Switching to Amazon Prime Video, we had no difficulty viewing content from US Amazon.com using our UK Amazon account.",
    "Netflix has been fighting VPNs hard this year on multiple fronts, and Windscribe looks to be one casualty. It didn't get us into US Netflix from any of our three sites.",
    "Windscribe restored its unblocking credentials a little with our final test, as it got us hassle-free access to Disney Plus.",
    "It's a pity Windscribe didn't manage its usual 100% unblocking score this time around, but it's also not uncommon. Just about everyone struggles to unblock Netflix from time to time. These results can change overnight, though, so there's no substitute for signing up and trying out the service for yourself.",
    "VPN providers generally don't boast about their torrent support, and it can be a challenge to figure out what you're allowed to do. (TunnelBear was so quiet about its P2P policy that we had to email tech support to ask.)",
    "Windscribe is much more open and transparent. Just point your browser at the company's Status page and you'll see its full list of locations, which of them support P2P (most) and which of them don't (India, Lithuania, Russia and South Africa, at the time of writing).",
    "Your options are just as clear in the Windscribe apps. Locations where torrents aren't allowed are marked with the same crossed-out 'P2P', but select anything else and you can download whatever and whenever you like.",
    "We don't like to take a provider's website promises for granted, even when they're from a VPN we trust, so we tried downloading torrents from three P2P-approved servers. But as we expected, everything ran smoothly, and our downloads completed with no connection or performance issues at all.",
    "Factor in Windscribe's free plan and various anonymous payment options (cryptocurrencies, gift cards), along with its decent performance levels, and the company makes a great torrenting choice.",
    "Tapping the 'Get Started' button on the Windscribe site took us to the Download page. The website detected and highlighted the best choice for our laptop – the Windows client and Chrome extension – but there were also links to downloads for Mac, Android and iOS, extensions for Firefox and Opera, and guides to cover setup on routers, Linux, Kodi, Amazon Fire TV and more.",
    "There's an unusual extra touch in direct links to old versions of the Windows and Mac apps. You may not care about that as a new user, but being able to rewind to a previous version could be very helpful if you find the latest build doesn't work on one of your computers, or an app update turns out to be buggy.",
    "Installing the Windows app is easy. You're able to create an account just by entering a username and password, which gets you 2GB of data a month. Hand over your email, too, and you get 10GB. Tweet about Windscribe and you get an excellent 15GB.",
    "To put all that in perspective, Avira Phantom VPN's free package gives you a tiny 500MB.",
    "If you're hoping to manually set up other devices, Windscribe's web control panel has tools to generate configuration files for OpenVPN, WireGuard, IKEv2 or SOCKS5 connections. This is a little more complicated than you'll see with some of the competition, where sometimes you're able to download perhaps hundreds of server setup files in an archive, then unzip and use them all immediately. But it's also far more flexible, as for instance you can define your preferred OpenVPN connection type (UDP, TCP), cipher (AES-CBC, AES-GCM) or port for every location.",
    "Windscribe's Windows client 2.0 has real visual panache, with rounded corners and classy flag backgrounds (check the screenshot above) to highlight your current location.",
    "Practical benefits over the old app include extra status information, such as the active protocol. But although there's plenty of text, icons and other UI elements in a very small area, it still looks good. If you don't care about the low-level detail, you can just click the big Connect/Disconnect button and ignore everything else.",
    "Tapping Locations displays the full location list. This opens with a list of countries, but you can also expand any of these to view its available servers, complete with fun names (London server names include Tea and Crumpets, while you can connect to Los Angeles locations including Dogg, Pac and Lamar).",
    "Each server has a latency indicator to help you find the fastest option. You can also mark countries as Favorites, displaying them at the top of the list for zero-scroll reconnections later.",
    "Connection times were average, but the client does a good job of keeping you up to date by using Windows notifications to tell you when you're connected, and when you're not.",
    "Stylish visual extras are everywhere. The client doesn't just display your virtual IP all at once, for instance – each digit quickly rolls into place like it's a physical dial.",
    "The interface is very configurable. You can order locations by alphabet, latency or location; display latency as bars or figures; have the interface docked, or a free-floating window; display notifications for events, or hide them; and the list goes on.",
    "There are many interesting connectivity features, and these are often as tweakable as the UI.",
    "Supported protocols include WireGuard, OpenVPN, IKEv2, Stealth and WStunnel (harder-to-block versions of OpenVPN), for instance, or you can leave this set to Automatic and leave the client to decide.",
    "Low-level connection tweaks include a choice of TAP driver and preferred DNS servers (OpenDNS, Cloudflare, Google or Windscribe's own).",
    "Split tunneling allows you to decide which apps, IPs or host names are directed through the VPN, for instance, and which bypass it.",
    "Unusual extras include the ability to set up your device as a Wi-Fi hotspot (if your OS and network adapter supports it), or as a proxy gateway for use by TVs, gaming consoles or anything else that can work with a proxy server.",
    "One standout feature is that Windscribe's desktop clients can import custom OpenVPN configuration files from other providers, and then display those servers alongside its own. That could allow you to use Windscribe's client as a frontend for multiple free VPN providers, for instance, making it easier and more convenient to switch service if your data allowance runs out.",
    "The ultra-compact interface means there are a lot of options crammed into a very small space, and this sometimes makes the client a little more awkward to use. You'll only see these extra pages if you go looking, though, and if you need these more advanced features, spending half an hour exploring the menus will show you just about everything you need to know.",
    "Windscribe's mobile apps had more of the v2.0 features before the desktop, and once you've used the service on one platform, you'll know how to use it on the others.",
    "The main Android status display is much like Windows, for instance: the gorgeous background flag, the big On/Off button, details on your new IP and preferred protocol.",
    "A list of countries (expandable to city level) makes it easy to find the server you need. You can switch to lists of Favorites and dedicated Streaming locations. And there's a Custom Config list, maybe enabling using other VPN servers with Windscribe's interface and features.",
    "A comprehensive Preferences screen comes absolutely stuffed with features. The Connection panel alone enables choosing between WireGuard, OpenVPN UDP, TCP, IKEv2 or Stealth, or selecting your preferred port, as well as choosing which apps use the VPN, and which don't (split tunneling). It also provides integration with Android's Always-On feature to let you set up a system-wide kill switch, or to enable GPS spoofing, define a packet size, allow or block local network traffic, and more.",
    "A Network Whitelisting tool enables automatically connecting to Windscribe whenever untrusted networks are accessed, while ignoring others. So, for instance, you could have the service automatically connect to protect you in the library or coffee shop, while staying offline when you're at home or work.",
    "iOS users are often short-changed by VPN providers, but not here. Windscribe's iOS offering has all the core features of its other apps, including some options you'll rarely find elsewhere. Can your desktop VPN client use a custom OpenVPN configuration to access a server from another provider, for instance, or set a preferred protocol depending on your current network? No? Didn't think so.",
    "Windscribe's Chrome, Opera and Firefox extensions provide a quick and easy way to connect to the VPN from your browser. This has its limitations – they're simple proxies and only protect your browser traffic – but if you only need the VPN for basic browsing tasks, they're your most convenient and straightforward option.",
    "The extensions make an immediate positive impression, courtesy of a stylish interface along the lines of the new v2.0 desktop and mobile apps.",
    "Basic operations work much as you'd expect. Autopilot mode enables connecting to the best location with a click, you're able to choose countries or individual cities from a list, and set your most commonly used cities as Favorites.",
    "One welcome recent improvement sees the ad and malware-blocking ROBERT now available to free users. Known malicious and phishing sites, bandwidth sapping ads, trackers, social media widgets and more can all be exterminated in a click or two.",
    "Need more? The extension can block WebRTC leaks, fake your GPS location and time zone to match your chosen Windscribe server, keep switching your browser user agent to make you more difficult to track, stop websites begging you to let them show notifications, even delete first or third-party cookies when you close the tab.",
    "Put it all together and this is a very capable extension which delivers far more than you'll get with other VPN providers, and even many standalone Chrome privacy extensions. Don't just take our word for it: the excellent 4.7 rating on the Chrome store suggests most users agree.",
    "If you have any technical troubles, Windscribe's support site is a good place to begin looking for answers.",
    "Resources start with an array of setup guides for a very long list of platforms and devices (desktops, mobiles, routers, NAS, smart TVs, torrent clients and more).",
    "These tutorials don't have the same range and depth that you'll see from the best VPN providers, but there are interesting touches.",
    "ExpressVPN has setup guides for Windows Vista, 7, 8 and 10, for instance, using its app, OpenVPN or IKEv2. Windscribe's Windows setup section only covers its app, Windows 10 and IKEv2, but, unusually, it shows how you can install the client using PowerShell (it's easier than you think).",
    "The Android guides also give you more choice than we expected, with bonus advice on how to get connected via IKEv2 using the StrongSwan app, or via OpenVPN with OpenVPN for Android.",
    "Other areas are, well, not so great. Keen on learning about the shiny new browser extensions, for instance? The support pages have links to 'setup guides' for Chrome, Firefox and Opera, but clicking on these takes you to YouTube videos dated July 2016. Comments are enabled and there are a few people asking questions, but most go unanswered.",
    "You could go hunting in the FAQs and Knowledgebase, but there's not a lot of content there, either.",
    "If all else fails, you can contact support directly. There's no direct live chat (though apparently a simple support chatbot will sometimes escalate queries to a human support agent) and you can't just send an email, but the website does have a form you can fill in to raise a ticket.",
    "Exactly how long it'll take to get a reply isn't clear, and a Windscribe blog post explains why: 'As we're a relatively small company... we're unable to provide support 24/7, and since we provide support to all users, including millions of free accounts, things can be a bit overwhelming.'",
    "But on the plus side, Windscribe points out that it does all of its support in-house, rather than using 'outsourced minimal wage workers on the other side of the planet who are reading off a script.'",
    "We tried sending a test question on a Saturday afternoon, to see if support worked weekends. And it did: it took a longer-than-usual 26 hours, but we did hear back on Sunday evening. Our response was friendly, accurate and complete, though, and in our experience, Windscribe's genuine in-house expertise means any delays are well worth the wait.",
    "Windscribe is a likeable VPN and represents good value, with a host of useful privacy protecting extras, and one of the most generous free VPN plans around. We have some reservations – no 24/7 support, speeds aren't the best, and it doesn't unblock Netflix right now – but these issues won't affect everyone, and so we recommend you install the free version in order to see how it works for you."
  ],
  "headers": {
    "8": "Windscribe pricing",
    "22": "Privacy and logging",
    "34": "Performance",
    "40": "Netflix and streaming",
    "48": "Torrents",
    "53": "Client setup",
    "58": "Windows client",
    "72": "Mobile apps",
    "78": "Browser extensions",
    "84": "Support",
    "95": "Windscribe review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "WireGuard": "https://www.techradar.com/vpn/what-is-wireguard",
    "ROBERT": "https://blog.windscribe.com/how-r-o-b-e-r-t-works-76d627446083?affid=fghzq9e1",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "free plan": "https://windscribe.com/upgrade?promo=WS50OFF&affid=fghzq9e1",
    "commercial plan": "https://windscribe.com/upgrade?promo=WS50OFF&affid=fghzq9e1",
    "Monthly billing": "https://windscribe.com/upgrade?promo=WS50OFF&affid=fghzq9e1",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "Ivacy": "https://www.techradar.com/reviews/ivacy",
    "Build a Plan": "https://windscribe.com/upgrade?promo=WS50OFF&affid=fghzq9e1",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "firewall": "https://www.techradar.com/best/firewall",
    "privacy policy": "https://windscribe.com/privacy?affid=fghzq9e1",
    "transparency report": "https://windscribe.com/transparency?affid=fghzq9e1",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "CyberGhost's": "https://www.techradar.com/reviews/cyberghost-vpn",
    "torrent": "https://www.techradar.com/vpn/best-vpn-for-torrenting",
    "Status page": "https://windscribe.com/status?affid=fghzq9e1",
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "protocols": "https://www.techradar.com/vpn/vpn-protocols-and-which-is-the-best-to-use",
    "support site": "https://windscribe.com/support?affid=fghzq9e1",
    "Windscribe blog post": "https://blog.windscribe.com/garry-bot-now-with-100-more-humans-f1d8219f03de?affid=fghzq9e1"
  }
}