{
  "source": "https://www.techradar.com/reviews/breville-the-fast-slow-pro",
  "title": "Breville the Fast Slow Pro review",
  "category": "appliances",
  "updated": "2021-07-02T10:00:00Z",
  "author": "helen-mccue",
  "summary": "Any easy-to-use multi-cooker that rivals Instant Pot's multitude of cooking function",
  "verdict": "The Breville the Fast Slow Pro is a neat multi-cooker with a large LCD screen that makes setting and adjusting the various functions really easy. All multi-cookers are bulky to store but the additional accessories can be stored inside this one, which limits the storage space needed. It performed well in all of our cooking tests, but the main drawback is that for slow cooking and pressure cooking the minimum quantity is 1-quart/ 1-litre which is quite a lot for rice and grains.",
  "pros": [
    "Simple to use",
    "Dishwasher safe bowl",
    "6 cooking functions"
  ],
  "cons": [
    "Can’t cook small quantities",
    "Brushed stainless steel marks easily",
    "Hinged lid requires screwdriver for removal"
  ],
  "article": [
    "Breville is a name familiar with kitchen prep appliances, with the brand offering some of the best coffee makers and best blenders on the market today. Alongside its other appliances, Breville also has a multi-cooker that can rival the best Instant Pots when it comes to an all-in-one device that offers a multitude of cooking methods.",
    "The Breville Fast Slow Pro has a 6-quart/ 6-liter capacity and can be used to pressure cook, slow cook, reduce, steam, sear, and sauté. Choose from a range of pre-sets for cooking everything from stew, risotto, and rice to vegetables and meats, or manually adjust the pressure level and cooking duration, it offers the best of both worlds and is a great option for both seasoned cooks as well as beginners.",
    "Just like many of the electric pressure cookers on the market today, a button on the front of the Breville Fast Slow Pro releases the steam rather than needing a lever on the top needing to be pushed down, making it far less likely to burn your hands. There’s even a handy keep warm function too.",
    "Multi-cookers aren’t the most attractive of kitchen appliances but Breville have made this model neat and streamlined and coupled with the signature stainless steel styling it certainly looks better on the countertop than many of its competitors.",
    "The simple interface is easy to navigate with a clear LCD screen, but the cooking bowl has a minimum 1-quart/ 1-liter capacity, so it’s better for batch cooking and not the best option if you want to make small quantities.",
    "In the US and Australia, this machine is called Breville the Fast Slow Pro and is available from the Breville website. In the UK, it’s called Sage the Fast Slow Pro and is available from the Sage appliances website. It will set you back $249.95/ £199.95/ AU$399.",
    "Despite Breville being a premium appliance brand, the Fast Slow Pro doesn’t have an inflated price tag and is priced in line with the main competitor models.",
    "The Fast Slow Pro comes in a brushed stainless-steel finish and it has a simple fuss-free appearance that makes it more attractive than most other multi-cookers. There’s no denying that multi-cookers are by their nature bulky and take up space on your countertop and this one measures in at 12 x 12 x 13 inches/ 35 x 35 x 32 cm.",
    "The ceramic coated cooking bowl is dishwasher safe and has a 6-quart/ 6-liter maximum capacity and a 1-quart/ 1-liter minimum capacity, these are both clearly marked inside the bowl. It also comes with a stainless steel steamer basket and a rack for use inside the cooking bowl. The lid is hinged, so you don’t need to find somewhere to place it while checking your food, it’s also removable and dishwasher safe, but for this, you’ll need a screwdriver which means it’s not convenient to clean it like this every time.",
    "There’s minimal assembly required, and the controls are intuitive, so it’s easy to get going straight from the box. The LCD display clearly shows the settings available and it’s easy to navigate between the main functions which are: pressure cook, slow cook, reduce, sear, sauté, and steam. Time, temperature, and pressure settings are all easily adjustable to suit your food or recipe. For novice cooks or simply for guidance while getting to know the appliance, the pressure cook and slow cook functions both have a list of common meal presets - each has a predetermined cook time, temperature, or pressure level.",
    "It comes with a recipe book that contains 41 useful recipes to get you started as well as information on the settings to use for each recipe and general hints and tips, so it’s a helpful guide to use while you get to know the cooker. When pressure cooking, there are three steam release options to choose from; auto quick, auto pulse, and natural - the recipe book and pre-set functions give some guidance on the best steam release setting to use if you're unsure.",
    "To cook rice we used the pressure cook function, but instead of cooking our intended 9 oz/ 250g of rice, we had to double up the rice and water quantities to meet the 1-quart/ 1-liter minimum capacity. There is a pre-set rice option in the pressure cooker settings, but there’s very little information given on the quantity or type of rice that the setting is designed for, so after some research, we decided our brown basmati would need longer than the 10 minute preset, so we increased it to 15 minutes. The preheat took 13 minutes and the auto pulse steam release took a further nine minutes, so the total start to finish time was 37 minutes, which is much longer than the 20-25 minutes it would usually take to boil the rice in a pan. Having said that, cooking it in the multi-cooker allows you to walk away and leave it unattended while it cooks. The end result was beautifully cooked rice, which was not sticky or wet and didn’t stick to the cooking bowl either.",
    "The steam release is the noisiest part of the process, but at 72dB it wasn't the loudest multi-cooker we’ve tested. It’s worth noting that the steam release valve is at the back, so if you place the cooker under a wall cabinet or shelf, it’s likely that the steam and condensation will coat the underside of the cabinet.",
    "Similarly when it came to cooking broccoli florets using the steamer basket and steam function., we had no detailed cooking charts to consult. We opted for three minutes, which produced perfectly cooked al dente broccoli, but the 13 minute preheat turns it into a lengthy total cook time.",
    "To test the slow cook function, we made a slow cook beef chili recipe, we used the Sear function to brown the beef first and the Sauté function to soften the onions and vegetables which meant there was no need to use an additional frying pan, saving on washing up. The slow cook setting was easy to use and it doesn’t make any noise while cooking. The cooked chili had a lovely flavor, the meat was moist and soft and we like that there’s a Reduce function so if your recipe hasn’t thickened as much as you’d like, you can use this function at the end of cooking to reduce and thicken it.",
    "We cooked a Thai red curry using the pressure cooker function and again used the Sear function first to brown chicken legs. The pressure cooker settings are easy to adjust and although our recipe only took 20 minutes to cook, there was a 15 minute additional preheat time at the start and a six-minute steam release at the end, creating a 41 minute total cook time. The curry cooked as expected with very tender chicken that fell off the bone.",
    "During pressure cooking the temperature of the lid reached 158oF/ 70oC but all the handles and controls stayed cool.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Breville the Fast Slow Pro price and availability",
    "7": "Design",
    "11": "Performance",
    "17": "Don't buy it if..."
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines",
    "best blenders": "https://www.techradar.com/best/best-blenders"
  }
}