{
  "source": "https://www.techradar.com/reviews/sonnet-thunderbolt-3-to-dual-displayport-adapter",
  "title": "Sonnet Thunderbolt 3 to Dual DisplayPort Adapter review",
  "category": "computing",
  "updated": "2021-11-11T16:54:10Z",
  "author": "mark-pickavance",
  "summary": "Makes dual monitor connections from one Thunderbolt port",
  "verdict": "This device helps fix arbitrary port limitations imposed by laptop designers that included Thunderbolt 3 or 4 ports. But it won’t work on Apple Mac M1 systems, and it’s a costly item compared with a single output adapter cable.",
  "pros": [
    "Thunderbolt 3 or 4",
    "Easy to use",
    "No additional power required"
  ],
  "cons": [
    "Expensive",
    "Won’t work with some laptops"
  ],
  "article": [
    "Many laptop makers have included a Thunderbolt port on their devices because it’s a highly flexible interface that can both connect peripherals and provide a means to charge in one.",
    "But, unless a peripheral is specifically designed for Thunderbolt or potentially for USB depending on the port specifications, additional hardware is required to provide connections to other pieces of technology.",
    "Almost all Thunderbolt docking stations provide monitor connections, allowing laptops to attach external screens even if they don’t offer HDMI or DisplayPort onboard.",
    "For those taking their laptop on the road, taking a docking station, its cabling and power supply might not be convenient if all you want it for is to provide some external screen connectivity that the computer maker annoyingly left out.",
    "Thankfully, Sonnet has addressed that requirement with a simple and portable means to convert a single Thunderbolt 3 or 4 port into dual monitor output.",
    "Is it as straightforward as that? Well, almost.",
    "Direct from Sonnet in the USA and Canada, the Thunderbolt Dual DisplayPort Adapter costs just $79.99. For those in Europe and elsewhere, Sonnet has local distributors, and we found it for £85.20 from CVP.com in the UK.",
    "It’s worth noting that a simple single cable adapter costing $10-15 can be purchased that will take one Thunderbolt port and convert it to be an HDMI or DisplayPort output. To get two displays, you would need two of these adapters and two free Thunderbolt ports, and it might not work on all systems.",
    "Therefore, Sonnet’s device is an expensive way to solve this problem.",
    "As an external peripheral, devices like this don’t get much simpler.",
    "To boil it down, this is a rolled aluminium tube with a 30cm Thunderbolt 3 cable extending from one end and two female DisplayPort ports mounted on the other.",
    "Electronics inside the tube breaks out the Thunderbolt pathways to connect an external monitor using DisplayPort, and the device is powered by its connection to the computer, requiring no external PSU.",
    "Having a detachable Thunderbolt cable might have been nice, but a permanent connection avoids that tumbleweed moment when you get to a client ready to do a presentation, only to realise that you have the adapter but misplaced the cable.",
    "At just 95g, it’s highly portable, and the 99 mm long tube would hardly be noticed alongside the power supply and other paraphernalia that most laptop owners avail themselves of.",
    "Ostensibly this is the most basic of plug-and-play devices. Or so it would seem until a few caveats appear to make using it marginally more complicated.",
    "You have a laptop with Thunderbolt 3 or 4 specification ports, you’ve bought the Sonnet adapter and two high resolution monitors ready to go, so making this work should be just about plugging these things together?",
    "It can be, depending entirely on the computer hardware you are connecting between the adaptor and the screens.",
    "The likelihood of this working directly is much higher if the computer involved is an Intel or AMD Windows system or an Intel Apple Mac. All our testing utilised this hardware, and it is merely a matter of plugging it in, and the displays start working immediately.",
    "On Windows, it wasn’t even necessary to sanction the Thunderbolt peripheral. It just worked.",
    "The only prerequisites are that the machine must be running a recent version of Windows 10 64-bit release, and the Thunderbolt Bus Driver should be at 16.3.61.275 or newer.",
    "Thunderbolt 3 has sufficient bandwidth to support two 4K monitors or a single 5K monitor up to a resolution of 5120 x 2830. It is possible to mirror the onboard display, disable the onboard or extend the virtual desktop to include both the onboard and the additional monitor(s).",
    "In theory, those with two available Thunderbolt ports should be able to use two of these adapters, though Sonnet only mentions quad-screen functionality for Intel Macs.",
    "We should also mention that depending on the laptop hardware, how practical attaching dual or quad 4K external screens to an integrated GPU is very hardware dependent. Some integrated GPUs aren’t capable of driving one display at this resolution, never mind two.",
    "But this isn’t an issue that Apple M1 Mac owners will encounter as this adapter won’t work this that hardware. From what we understand, and we’re certainly not experts in anything Apple makes, the M1 architecture doesn’t support more than one external display. The only exception to this generalisation is the M1 Mac Mini that supports one display over HDMI and another via USB-C.",
    "Therefore, if you have an M1 MacBook or MacBook Air, this adapter is of no use to you, sadly.",
    "And, according to the Sonnet FAQ for this product, it also won’t support 5k on the MacBook Air (2017), and not all Thunderbolt 3 Windows PCs support two 4K monitors (or one 5k monitor) or 60Hz refresh rates. Sonnet has a list of laptops that won’t work with the adapter on its site, and it might be worth checking this before spending on one.",
    "The new Apple M1 Pro and M1 Max machines support two and three external displays according to Apple marketing, but we can’t guarantee that this device will work with that hardware at this time.",
    "A quick look around any large tech retailer will reveal several very similar-looking devices that appear to offer the same functionality.",
    "For those in Europe, Startech has the TB32DP2T. A very similar appearance and specification, and that costs just £68.86 in the UK.",
    "Global customers can also find the Sabrent TH-3DP2 for dual Displayport use, costing $99.99 direct from Sabrent. And, they also make a dual HDMI version, the TH-3HP2, for an extra ten dollars. We found both these products cheaper on Amazon.com, matching the Sonnet pricing.",
    "In general, if you see an unbranded product much cheaper than those claiming to provide this functionality, then be careful. Some are USB-C to DisplayPort adapters that might not work with your Thunderbolt port, and others offer only two outputs of a single display, i.e. mirroring.",
    "Getting two proper outputs from a single Thunderbolt port isn’t inexpensive unless you have two free ports and use cheap single Thunderbolt to DisplayPort adapters.",
    "PC makers are shirking their responsibilities by not including HDMI and DisplayPort on machines with plenty of space for them to be mounted, but the Sonnet Thunderbolt 3 To Dual DisplayPort adapter successfully addresses their ommissions.",
    "Sadly, a port that might have cost very little for a laptop maker to include ends up costing their customers an additional $79.99 with this device.",
    "And, the cost is a significant factor in considering this purchase. If you don’t need two displays from one port, much cheaper options exist. A Thunderbolt to DisplayPort cable can be purchased for under $15 on Amazon and will provide a single 4K at 60Hz monitor connection.",
    "What that cable can’t do is convert a single Thunderbolt port into two 4K outputs or combine the bandwidth to offer a single 5K external screen. If you specifically need dual screens, then this might be for you. That specific functionality costs roughly the same from all hardware makers that offer it.",
    "You can get cheaper USB-C to DisplayPort devices, but we’d recommend avoiding USB for this purpose if you have Thunderbolt ports available.",
    "And. if you own an Apple Mac M1 system, avoid it altogether, as this hardware won’t generate dual displays from those machines."
  ],
  "headers": {
    "6": "Price, availability and value",
    "9": "Design",
    "15": "In use",
    "27": "Competitors",
    "32": "Final verdict"
  },
  "links": {
    "Sonnet FAQ": "http://www.sonnettech.com/support/kb/kb.php?"
  }
}