{
  "source": "https://www.techradar.com/reviews/brave-web-browser",
  "title": "Brave browser review",
  "category": "computing",
  "updated": "2021-08-18T05:47:00Z",
  "author": "jonni-bidwell",
  "summary": "A browser and search engine pairing that covers the basics well",
  "verdict": "Brave has the user features and privacy settings you’d expect it to, but it fails to compete with other leading browsers.",
  "pros": [
    "Supports many Chrome extensions",
    "Won’t view or store browsing history",
    "Multiple search engines to choose from"
  ],
  "cons": [
    "Lack of noteworthy features",
    "Limited functionality depending on device"
  ],
  "article": [
    "Brave is a unique browser that also comes with its own search engine (also called Brave), but you can choose from six others if you prefer. While it touts its privacy features as being better than Firefox’s and its speed as better than Chrome’s, the differences there seem to be negligible.",
    "We didn’t have any issues with Brave, per se, but it failed to impress us beyond the basics. That said, there’s nothing explicitly wrong with this browser, and if you like how it looks and functions, then we don’t see a reason not to make it your go-to.",
    "If you’re using Chrome or Firefox, you can start by importing your autofill data, bookmarks, favorites, and history into Brave. If you go into Settings, there’s also an option to import from an HTML file.",
    "You can choose from seven search engines to set your default:",
    "Playlist",
    "The Playlist feature is one of Brave’s standout offerings. You can add audio and video from various sources (podcasts, YouTube, etc.) to your Playlist and then listen to what you saved online or offline. The playlist is accessible right from your browser, but you can only use this feature on an iPad or iPhone running iOS 13 or above.",
    "Viewing Brave Private Ads rewards you with tokens, which you can use to support content creators. These ads show up as notifications, and then creators get your token contributions based on your Attention, which is Brave’s determination of your level of engagement. You can also use some of your tokens to purchase digital content and goods.",
    "You’ll decide how many ads you want to see per hour and how much support you want to give creators. There’s no option for zero support, so you have to donate something to creators out of your earned tokens.",
    "According to their website, Brave’s servers don’t see or store your browsing data (and so they also don’t sell it to third parties). Your data is private, and it remains on your device(s) until you delete it.",
    "You can customize your privacy settings per site or browser-wide:",
    "Brave’s default settings already block “malvertising” (online advertising with the intent to spread malware), malware, and phishing, and plugins that are deemed a security risk are disabled. When it’s possible, Brave will auto-upgrade to HTTPS for advanced security and encryption.",
    "Additional privacy and security features include:",
    "You can read more about Brave's privacy protection here.",
    "This is what the default dashboard of the browser looks like.",
    "On the top-left, you can see stats for how effective the browser’s been at blocking ads and trackers and saving bandwidth and time. By scrolling down on the dashboard, you can see news stories that continue to populate as you scroll.",
    "That box on the right with the link at the top that says FTX lets you toggle between what you want to show in the bigger space below. For example, if you select Crypto.com, that information will populate where the Brave Rewards info is in the example above. Binance, FTX, Crypto.com, and Gemini are all cryptocurrency-related sources. Those links are called Cards by Brave, and you can hide individual ones by selecting Edit Cards at the bottom.",
    "Overall, Brave has a nice-looking dashboard, and you can make additional changes by going to the Settings gear on the bottom-right of the page. You can make changes to background images, stats, top sites, news, and the clock.",
    "Brave can be used on the following systems:",
    "On mobile, you can use Brave with Android version 5 or later and iOS version 13 or later.",
    "According to its website, Brave is 3x faster than Chrome (view their speed test here), and it has better default privacy features than Firefox.",
    "Personally, I didn’t find Brave to move faster than Chrome or Safari. In fact, Brave seemed to very slightly lag behind the other two browsers when searching for the same phrase. It wasn’t slow enough to be very noticeable, but it definitely didn’t seem to be considerably faster, either.",
    "It’s also unclear how Brave is so much more secure than Firefox. It seems that they have many of the same default privacy offerings, but Firefox comes out ahead with features like Primary Password and instant-erasure of online info when the browser’s closed. That’s not to say Brave isn’t safe, but safer than Firefox? Potentially not.",
    "We really liked how the Brave dashboard was laid out. Having the settings, bookmarks, and history on the bottom-right in minimalist icons gets rid of the busy top bar that a lot of browsers have.",
    "Brave seems to do what any browser should – you can customize the dashboard, arrange tabs and windows in different ways, save bookmarks, search from the address bar, etc. Unfortunately, many of their features are pending on at least one platform, so you may not get full functionality depending on where you use Brave.",
    "Lastly, while Brave Rewards and Playlist are notable features you won’t find on every browser out there, neither one is a major selling point."
  ],
  "headers": {
    "2": "Features",
    "8": "Privacy",
    "13": "User experience",
    "17": "Platforms",
    "19": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Brave": "https://brave.com/",
    "browser": "https://www.techradar.com/best/browser",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "here": "https://brave.com/features/",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Firefox": "https://www.techradar.com/reviews/mozilla-firefox"
  }
}