{
  "source": "https://www.techradar.com/reviews/ionos-ecommerce-website-builder",
  "title": "IONOS Ecommerce Website Builder review",
  "category": "computing",
  "updated": "2021-07-17T19:20:51Z",
  "author": "steve-paris",
  "summary": "Create an online store brimming with options",
  "verdict": "A good service with numerous options, with a great way to import an existing catalog of products. The price hike after the honeymoon period feels a little steep though.",
  "pros": [
    "Easy to use",
    "Nice range of templates",
    "Great customisability"
  ],
  "cons": [
    "No free trial",
    "Fees increase sharply after the introductory period"
  ],
  "article": [
    "We’ve had a look at IONOS’ 1&1 MyWebsite service, but they also offer a dedicated e-commerce website builder facility, which we’ll have a look at in this review.",
    "Disappointedly, just like 1&1 MyWebsite, IONOS doesn’t offer any free trial, so you have to commit to a plan if you want to explore the service’s features. There is however a proviso: you can try a month for free when you join, but every subsequent month will cost more than had you gone for the traditional no-free-month option.",
    "The cheapest option is the Starter plan, a $1 per month for the first year ($12 afterwards), and lets you sell up to 500 physical products. You get an SSL certificate and email, access to predesigned layouts, and various payment options. It’s a great and cheap way to get started - for the first year at least.",
    "Plus is the most popular option and costs $5 per month for the first six months ($20 afterwards). Your product allowance goes up to 5,000, and the templates on offer can be more extensively customised. You’re also given the ability to sell and track your purchases via Google.",
    "Then there’s Pro ($25 per month for the first six month and $35 thereafter). Not only can you sell up to 10,000 products, but digital downloads are finally available. Other features include being able to manage your store via an app on your phone, and support for multiple languages.",
    "Finally, there’s Expert ($35 per month for the first six months and $50 onwards). With it, you have no limits to the number of physical and digital products you can sell. You can link your store to, and sell via Amazon and eBay, and are granted other features such as volume discounts and customer group pricing.",
    "Even though all plans are advertised as a monthly expense, you must commit to a full year in advance. There is however a 30-day money back guarantee should you not be satisfied with the service.",
    "After having purchased your desired plan, it’s time to setup your website. There are quite a few templates for you to choose from, all conveniently divided into categories, with a handy search field at the top should you need it. All templates are fully responsive, which means they look great whatever the screen they’re viewed on - be it a desktop, tablet or phone.",
    "The top of the page contains general function tools such as switching between devices (desktop, table or mobile), undo and redo buttons, a preview and a publish option. The sidebar on the left contains elements you can add to your pages, like widgets, your store, a blog, etc.",
    "It all looks remarkably similar to other website services we’ve encountered, with similar functionality, similar tools, similar way of doing things. Suffice it to say that you have enough customisation options to turn a template into a unique experience, and the process is intuitive enough that if you have any experience of such services, you’ll have no problem finding your way around.",
    "So let’s take a look at the reason we’re here: the e-commerce side of things.",
    "Click on the Ecommerce menu on the left sidebar to be taken to your new online emporium. Adding items is easy, and since this service can support an unlimited number of items (depending on the plan), it’s reassuring to know that you can import the whole lot via a CSV, XCart or LiteCommerce file. Even better, not only can you see what information is in each column, but you also have the means to reorder these columns to match the data you’re about to import.",
    "If you only need to add a handful of items, you can also choose to do so manually, one at a time, by clicking on the ‘Add New Product’ button.",
    "Fill in all the fields that are relevant to your product, such as images, title, description, price, etc. If you’re selling objects of different colour or size (such as t-shirts for instance), you can add variations (but only if you have the right plan: Pro or above).",
    "When setting up your store, you’ve the option to connect it to your social media accounts (Facebook, Instagram, Twitter, YouTube and Pinterest), set up various preferences, like currency, weight and size. There are a few options that are interesting, like hiding out of stock items (this is off by default), enabling or disabling legal pages on some, all or none of your pages, and various ways to track your visitors via social media and google ads.",
    "To incentivise your customers, you’ll likely make full use of the Discount section, where you can specify which items are discounted, the level of said discount, and whether there’s an expiry date attached to it or not.",
    "Delivery options are quite thorough, ranging from free to a flat rate fee, to custom rates depending on size, weight, etc. When it comes to payment, various services are available such as Stripe, Square, PayPal, and even cash.",
    "IONOS also offers a selection of apps, many of which are free, to add functionality to your store. Options include additional payment gateways such as Authipay, and Lemon Way Payments, to a Label Editor, to the inclusion of chat buttons via WhatsApp, or Facebook Messenger (among others), to Delivery Trackers.",
    "These are not essential, but could add an extra touch for you and your customers.",
    "IONOS’ e-commerce website builder service offers a lot of options to help you set up an online store. The tools available to create and customise your site won’t confuse anyone who’s had experience with similar services in the past, and when it comes to the ecommerce side of things, the features are thorough, clearly displayed and easy to use. We particularly liked the detailed way you can import your stock inventory which is better than we’ve seen other businesses do it, and the available options for discounts, payments and shipping should satisfy most clients.",
    "The only downside really is the lack of a clear and obvious free trial, and a monthly fee which jacks up by a substantial margin after 6 or 12 months (depending on your plan)."
  ],
  "headers": {
    "1": "Plans and pricing",
    "7": "Getting started",
    "11": "Setting up a store",
    "17": "Apps",
    "19": "Final verdict"
  },
  "links": {
    "IONOS’ 1&1 MyWebsite": "https://www.techradar.com/reviews/11-mywebsite-basic",
    "e-commerce website builder": "https://www.techradar.com/best/best-e-commerce-website-design-services",
    "Starter plan": "https://www.ionos.com/ecommerce-solutions/ecommerce-website-builder#packages",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Plus": "https://www.ionos.com/ecommerce-solutions/ecommerce-website-builder#packages",
    "Pro": "https://www.ionos.com/ecommerce-solutions/ecommerce-website-builder#packages",
    "Expert": "https://www.ionos.com/ecommerce-solutions/ecommerce-website-builder#packages",
    "payment gateways": "https://www.techradar.com/best/best-payment-gateways"
  }
}