{
  "source": "https://www.techradar.com/reviews/delonghi-primadonna-soul",
  "title": "De’Longhi PrimaDonna Soul review",
  "category": "appliances",
  "updated": "2021-06-04T10:53:16Z",
  "author": "ava-szajna-hopgood",
  "summary": "We tested the De’Longhi PrimaDonna Soul to see if it’s really worth its hefty price tag",
  "verdict": "De’Longhi’s bean-to-cup PrimaDonna Soul coffee maker sits towards the top end of the price range for domestic coffee makers, and comes with high expectations. However, with 21 different drink options, it’s a sure-fire crowd-pleaser. The Soul machine is a great option for people craving a cappuccino, flat white, or cortado without the work required from a manual espresso machine.",
  "pros": [
    "Impressive range of drinks",
    "Reliable performance",
    "Produces excellent crema"
  ],
  "cons": [
    "Coffee Link app is difficult to set up",
    "Expensive",
    "Takes up a lot of counter space"
  ],
  "article": [
    "The De’Longhi PrimaDonna Soul is a recent addition to the brand’s popular PrimaDonna range, and is the first of its machines to connect to the Coffee Link app via Wi-Fi as well as Bluetooth. Consider it a follow-up to the PrimaDonna Elite model of 2016, which launched with the Coffee Link app, and was among the first coffee machines to be controlled by a smartphone.",
    "The Italian company is constantly improving the capabilities of its fully automatic bean-to-cup machines, and the PrimaDonna Soul is one of the more expensive models on the market. We’ve tested this model to see if it’s worth its hefty price tag, and whether it deserves a place in our guide to the best coffee makers.",
    "The PrimaDonna has an impressive 4.3-inch / 10.9cm TFT touch display with extensive drinks options. A sleek silver and black design gives the Soul a modern appearance, but it will take up a lot of room on your counter-top.",
    "While some would-be baristas enjoy tamping and grinding for their caffeine hit each morning, if you prefer a fully automatic, (almost) hands-free approach, the PrimaDonna Soul will be right up your street. De’Longhi’s Bean Adapt technology means this machine takes the guesswork out of making those all-important adjustments to your cup of joe. Once you’ve connected the machine to the Coffee Link app, settings are automatically adjusted to suit the beans of your choice, with the grinding level, dose of coffee, and infusion temperature all fine-tuned to help achieve that perfect coffee extraction.",
    "If you’d rather just plug-and-play, the machine requires minimal programming to set up, and clear on-screen options make it easy to create your choice of the many drinks available – and after a few runs, the color display prioritizes your favorite choices. A switch on the appliance’s thermal milk carafe adjusts the froth of the milk, and the rest is handled beneath the hood.",
    "For anyone that loves great coffee without a huge amount of fuss, the PrimaDonna Soul could well be worth the investment. The array of drinks this model can churn out would make it a fantastic choice for busy households. However, don’t expect any miracles from the smart features, as the Coffee Link app is a frustrating add-on that isn’t necessary to enjoy everything this machine can offer.",
    "The PrimaDonna Soul is available in the US, Australia, and the UK. Coming in at the top end of the price range for domestic coffee machines, it’s a great option for coffee lovers who are looking for one-touch controls. For larger households that love freshly brewed coffee every day, this is a reliable, robust model, with build quality and features that are reflected in the high price point.",
    "The PrimaDonna Soul measures 10.2 inches / 26cm x 15.3 inches / 39cm x 19 inches / 48.5cm (w x d x h), so while the width is relatively narrow for a machine of this capacity, it’s quite deep, and you’re going to need a fair amount of counter space to fit it in. The sleek stainless steel model comes with black finishes, and certainly looks the part for the price, with a few stylish touches that are easy to miss at first glance A rubber freshness seal for the 17.6-oz / 500g capacity bean hopper is a neat touch, as is the double-insulated 16.9 fl oz / 500ml LatteCrema milk carafe, which fits easily into a refrigerator when not in use.",
    "The milk carafe slots into the front of the machine and can be topped up through a newly designed lid, making it much easier to use than the carafe on the previous model, the Elite. Depending on your preferred density of milk foam, you’ll need to turn the dial from low to high before drinks are dispensed. There’s also a ‘clean’ setting which you’re prompted to use after every drink requiring froth, although you can override this option if you want.",
    "We tested the coffee pot next, a new addition to the accessories that can be fitted to the PrimaDonna Soul. The machine allows you to choose between one and five cups of coffee, and there was a beautiful crema topping on the coffee when we tried this. However, there isn’t any way to keep the pot warm, so if you’re not serving up the coffee straight away, it quickly goes cold. This was disappointing given what you’re paying for this machine, but if it’s filter coffee you really have your eye on then you’ll need a different machine altogether.",
    "Setting up the De’Longhi PrimaDonna Soul was incredibly easy for a machine that can produce such a wide range of drinks. We loved impressing family members with the pretty layers of coffee and milk dispensed to create the cappuccino Soul, as well as long blacks, cortados, and cafe lattes. As we’ve mentioned, you can set this machine to dispense into the coffee pot, as well as hot water for tea and hot milk, and it’s extra options like these that give De’Longhi the edge over automatic machines. We especially liked that any of the coffee-making processes can be paused mid-brew, which isn’t the case with cheaper models.",
    "The De’Longhi Soul delivers on crema, temperature, and speed. The main issue we had was with the Coffee Link app, which is difficult to set up, with the process requiring a number of sign-ins. It’s worth setting up the app so that you can enjoy the full range of tricks the Soul has to offer, including the Bean Adapt technology. Once you let the Soul know the type of beans you’re brewing with, and you have a few user profiles established, you can turn on the machine (from standby mode) from another room. If you have your mind set on waking up to fresh-brewed coffee timed in with your morning alarm, however, you’re out of luck here: each time the machine turns on, water is dispensed through the same tubes as the coffee, so you can’t simply leave your mug beneath the spouts overnight, and the milk carafe can’t be left out for longer than a few hours either.",
    "The electronic Thermoblock system produces satisfyingly hot coffees, and ensures a precise temperature for steaming milk. These are welcome features, as many coffee machines tend to turn out drinks that aren’t very hot.",
    "The PrimaDonna Soul is easy to keep clean, and the two trays are simple to remove and wash, while many parts are dishwasher-safe. Maintenance is also relatively easy – you’ll need to decalcify the machine every few months, and keep a fresh water filter in the water tank."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "DeLonghi PrimaDonna Soul Price and availability",
    "7": "Design",
    "10": "Performance",
    "14": "Don’t buy it if…"
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines"
  }
}