{
  "source": "https://www.techradar.com/reviews/instant-pot-duo-evo-plus-60-review",
  "title": "Instant Pot Duo Evo Plus review",
  "category": "appliances",
  "updated": "2021-12-02T14:40:17Z",
  "author": "ava-szajna-hopgood",
  "summary": "Instant Pot adds some much-needed updates to its cult multi-cooker",
  "verdict": "Instant Pot’s new Duo Evo Plus model refines its original design in almost every way. Safety improvements include a steam release valve and heat-proof handles, meanwhile the cooker’s enhanced design includes a searable, flat-based pot and a screen that displays more information about what’s going on inside. While Instant’s older models missed some of the key design features of its rivals, the Duo Evo Plus is an improved electric cooker that sets itself ahead of the pack.",
  "pros": [
    "Inner pot can be heated on all hob types",
    "Cooking progress indicator offers much more control",
    "New steam cover diffuser makes steam release safer"
  ],
  "cons": [
    "More expensive than original Instant Pots",
    "Measuring cup and and spoon not included",
    "Recipe app can be difficult to use"
  ],
  "article": [
    "Founded in Canada in 2010, Instant Pots have been growing in popularity worldwide ever since, thanks to their multi-cooker capabilities that cover everything from traditional pressurised recipes to yoghurt, cake baking and sous vide. Instant Pot’s appeal is broad, meaning recipes for specific models are easy to come by online, and other machines on the market compete with its startling array of cooking modes. While rivals can often perform slow cooking or pressure cooking well, the Instant Pot is known for delivering exceptional results for both methods.",
    "That said, there were a few aspects of Instant Pot’s previous designs that could be improved: having limited control over the time and temperature settings grows frustrating after you’ve mastered the basic programming functions. It also felt like an oversight that Instant’s pot wasn’t suitable for searing on a hob, when other rivals had designed a pot with this in mind. And a few more cooking options wouldn’t have gone amiss, such as a sous vide setting.",
    "Thankfully, Instant Pot has delivered a souped-up follow-up to its first generation of appliances. The Duo Evo Plus improves on Instant Duo’s performance, and gives users the options to change settings, no less than 48 cooking modes and (the all-important) option to sear food on the hob in the pot itself, with handles to take the pot straight to the table.",
    "Available now, expect to find the Instant Pot Duo Evo Plus costing around £120 / $120 / AU$750. That's a bit pricier than earlier models, but still good value considering the quality of the appliance, You can see today’s best deals for the Instant Pot Duo Evo Plus 60 where you are below:",
    "The Duo Evo Plus is currently only available in the 5.7 litre (6 quart) capacity in the UK, although a 7.5 litre (8 quart) model is due to be added to the range in early 2021. In the US the Duo Evo Plus comes in 6 quart and 8 quart models. In Australia a 5.7 litre/ 6 quart capacity is available. As with the older Instant Pot size, we found 5.7 litres an ideal capacity for a family or batch cooking. The stainless steel exterior certainly looks smart in the kitchen, although with the black exterior for the lid, any food spattering or water marks are easy to spot.",
    "One of the issues with Instant’s previous designs was the large amount of steam that would emit from the cooker after releasing the pressure valve. A new plastic diffuser covers the vent, meaning far less sputtering and a gentler emission of steam. The Duo Evo Plus also automatically seals when in place, something its older machines required the user to do manually.",
    "While the screens at the centre of Instant’s electric cookers may look similar before switching on, the new Duo Evo Plus has received a raft of small improvements that make for a far easier cooking experience.",
    "The LCD display is nicer to look at and use, with the digital interface and dial making it easier to choose from the Duo Evo Plus’ 48 cooking options. A progress timer makes it simpler to quickly check on the cooking progress of food, and even the screen itself has been slightly tilted upwards to make it a cinch to read at a glance when you’re busy in the kitchen.",
    "Of the 48 settings, you can choose pre-set cooking times and temperatures for dishes Instant is now famous for, such as ribs, stews and risotto. These settings can also be used for fermenting and dough proofing, and Instant has added in a sous vide option for low and slow cooked meat.",
    "If you’ve used an Instant Pot before, the basic usage is very similar to older models, albeit with necessary design tweaks that make it far easier to navigate as a home cook.",
    "Whether you choose to store it on the counter or away in a cupboard when you’re not using it is up to you - there’s no assembly time required: all it needs is a switch to plug in when you’re ready.",
    "The first thing we noticed is how much faster the Duo Evo Plus cooks. The 1200w heating element reduces preheating time (the Instant Pot Duo V2 7-in-1 Electric Pressure Cooker uses 1000w), and Instant has worked on reducing the pressure release time with its QuickCool™technology.",
    "Even cooking simple items like rice, soups and stews is much faster, and there’s far less time spent waiting for the pressure valve to click in order to allow the lid to open - which could reach upwards of 20 minutes on the Duo V2 7-in-1 model.",
    "In what appears to be another bid to outshine every other multi-cooker on the market, Instant has redesigned its inner pot to be suitable for heating on any type of hob. This means recipes that require browning meat and vegetables before slow cooking can still be achieved in one pot.",
    "By adding heat-proof handles to its inner pot, Instant has evolved their electric cooker into an appliance that can be brought straight to the table (or carried to a pot luck!), making things that much easier for the time-poor cook. An extra sealing ring and steam rack with handles are helpful additions. The Duo Evo Plus didn’t come with a cup measurer (despite the majority of its competitors, and previous models, including one), which is integral to a lot of Instant Pot recipes, so if you’re in the UK, you’ll need to use a measuring jug or similar with cup measurements.",
    "Speaking of recipes, you won’t find a recipe book when unboxing your Duo Evo Plus, as customers are instead encouraged to download the Instant Pot recipe app. We loved being able to browse this for inspiration as well as guides on how to cook everything from macaroni cheese to jerk chicken and cornbread, but as many of the recipes are from other Instant Pot users, there can be a few wild cards. Stick to the recipes by Instant Pot Staff and you’ll find the app useful and responsive for setting timers and even providing calorie estimates.",
    "As mentioned above, rice, soups and stews are straightforward in the Duo Evo Plus. We also took homemade yoghurt, steamed chocolate fondants, braised red cabbage and chicken curries for a whirl, all easily achieved and to pretty impressive results.",
    "The Duo Evo Plus is relatively simple to keep clean, although as we’ve found with all Instant Pots: anything especially pungent will linger longer than a usual saucepan, probably due to the fact the cooking flavours are sealed in the pot. Helpfully, the inner pot is also dishwasher safe."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design and key features",
    "11": "Performance",
    "18": "Don't buy it if..."
  },
  "links": {
    "Instant Pots": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers"
  }
}