{
  "source": "https://www.techradar.com/reviews/aoc-i1601p-156-inch-portable-monitor",
  "title": "AOC I1601P 15.6-inch portable monitor review",
  "category": "computing",
  "updated": "2021-11-22T13:19:05Z",
  "author": "joel-khalili",
  "summary": "A brilliant little portable monitor for the hybrid worker",
  "verdict": "A high-quality portable monitor ideal for shuttling between home, the office and anywhere else you might want to work. It’s sleek, lightweight, easy to set up and the display itself looks great. If not for a few small issues, we would have given I1601P full marks.",
  "pros": [
    "Extremely light and portable",
    "Lovely display",
    "USB-C or USB-A connectivity"
  ],
  "cons": [
    "Navigating menus is a pain",
    "Short cable"
  ],
  "article": [
    "The I1601P portable monitor from AOC is a fantastic little piece of kit, especially for someone looking to equip themselves for the new world of hybrid working.",
    "Launched in July, this monitor is extremely slim and light and fits snugly into a laptop case or backpack sleeve. We also love the stand, which attaches to the front and back of the screen with magnets that anchor the I1601P in place - and it doubles as a screen cover too.",
    "The 15.6-inch full HD IPS display is extremely easy on the eye, which means long working sessions don’t result in undue strain, despite the relatively small screen size. And the display boasts an impressively wide viewing angle too, so it can function well even on a crowded office desk.",
    "AOC has prioritized portability and ease of use above all else, and the result is a display that anyone can set up and start using in a matter of seconds; it’s a case of plugging in a single cable and off you go.",
    "We do have a few small gripes with the I1601P, like the shortness of the cable that comes bundled and the one-button navigation system, but these problems are relatively easy to overlook.",
    "The AOC I1601P is currently cheapest from Amazon at £199.99, available to EU customers only for now.",
    "For your money, you get the 15.6-inch monitor, the screen cover/stand and a USB-C to USB-C cable (with USB-A converter), which handles both power and data. There’s also a CD containing the relevant drivers, although these should install automatically anyway.",
    "For US-based shoppers, similar 15.6-inch models include the AOC I1601FWUX ($140 at Amazon) and the AOC I1601C ($160 at Amazon).",
    "The I1601P boasts a professional design, with a glossy black bezel, silver metal backside and super thin chassis. If you were feeling extra picky, you might say the bezel is on the thick side.",
    "The best piece of design is found in the stand itself, however, which uses a magnet-based system to anchor the screen in place. It also creates multiple tilt angles, so you can have the screen sitting bolt upright or at a backwards slant, depending on your preference.",
    "The stand also doubles up as a cover for when you’re moving between home and the office, protecting the screen from knocks and any bag detritus that might create nicks and scratches (or worse).",
    "It’s possible to use the monitor in portrait orientation too, which is great for developers or social media managers, but the stand feels decidedly less sturdy when doing so and the cable poking out the top is a bit of an eye-sore.",
    "Another small gripe: the USB-C to USB-C (with USB-A adapter) is annoyingly short. Sure, this portable monitor is designed to be used alongside a laptop or mobile workstation, but when you’re at your home office desk, you can’t use the I1601P as a small second monitor unless your tower sits right alongside.",
    "When devising the I1601P, AOC clearly prioritized an ultra-sleek and light design over all other considerations. For the most part, this approach makes a lot of sense, but does result in somewhat of a trade-off.",
    "For example, the monitor is equipped with a single USB-C port and a small button on the left-hand side - and that’s it for connectivity and controls. It’s easy to wish for a port or two (say, a downstream USB-C), but the most frustrating outcome of AOC’s design philosophy is the one-button menu navigation.",
    "To select a configuration option to edit (e.g. brightness, contrast, HDR etc.), you have to repeatedly press the single button until your selection is highlighted. In the absence of any way to actively select an option, you then have to wait a handful of seconds until the relevant sub-menu appears. If multiple selections need to be made, this process borders on the torturous.",
    "In terms of other features, the blue light mode is a nice touch - and not something you’d necessarily expect from a portable monitor at this price. The I1601P lets users configure the display to whichever tone best suits their current application (multimedia, web browser, office software etc.).",
    "We have no complaints about the performance of I1601P’s 15.6-inch full-HD IPS display. It’s crisp, responsive and easy on the eye.",
    "The refresh rate is only 60Hz, limiting its performance as a gaming monitor, but that was never AOC’s intention. For anything a regular office worker might want to do, 60Hz is absolutely fine.",
    "With a maximum brightness of 220 nits, the screen will function in bright office environments perfectly well - and even outdoors in some scenarios. And while the 700:1 contrast might not be suitable for photo editing or other color-specific tasks, it’ll be perfectly suitable for most other use cases you can imagine.",
    "We love this portable monitor from AOC. It does so much right; it’s light, portable, simple to set up and the display itself is lovely to look at.",
    "We were a little frustrated by the length of the cable provided and the one-button menu navigation is awkward, but once the display is configured to your liking, these problems will likely melt into the background.",
    "If you’re after a portable second monitor for your laptop, or even just a small additional display for your home office setup, you can’t really go wrong with the AOC I1601P - especially at this price point."
  ],
  "headers": {
    "5": "Price and availability",
    "8": "Design",
    "13": "Features",
    "17": "Performance",
    "20": "Final verdict"
  },
  "links": {
    "portable monitor": "https://www.techradar.com/news/best-portable-monitor",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "monitor": "https://www.techradar.com/news/best-business-monitor",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "office desk": "https://www.techradar.com/best/best-office-desks",
    "Amazon at £199.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB09F3C12VY%2Fref%3Dasc_df_B09F3C12VY1635764400000%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-5578928733077660000-21",
    "AOC I1601FWUX": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAOC-i1601fwux-Extremely-Portable-1920x1080%2Fdp%2FB06Y8SSQG5%2Fref%3Dpsdc_1292115011_t1_B08M9PZLYT%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4208737217219437600-20",
    "AOC I1601C": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAOC-I1601C-15-6-16-Monitor%2Fdp%2FB08M9PZLYT%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6319390095989268000-20",
    "developers": "https://www.techradar.com/news/best-laptop-for-programming",
    "social media managers": "https://www.techradar.com/best/best-social-media-management-tools",
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "web browser": "https://www.techradar.com/best/browser",
    "office software": "https://www.techradar.com/news/office-365-vs-g-suite-whats-the-best-office-software",
    "gaming monitor": "https://www.techradar.com/news/best-gaming-monitor",
    "photo editing": "https://www.techradar.com/news/best-photo-editor"
  }
}