{
  "source": "https://www.techradar.com/reviews/philips-b-line-242b1tfl00-touch-display",
  "title": "Philips B Line 242B1TFL/00 Touch Display review",
  "category": "computing",
  "updated": "2021-09-08T09:34:34Z",
  "author": "mark-pickavance",
  "summary": "Philips B Line series goes public",
  "verdict": "Solidly made design that will be popular with those that need to create customer-facing consoles. More contrast and brightness would have been nice, but the Philips 242B1TFL/00 is built for purpose and attractively priced.",
  "pros": [
    "Robustly built",
    "Rubber seals",
    "Remote control for OSD",
    "Four input types"
  ],
  "cons": [
    "Heavy"
  ],
  "article": [
    "Most monitors we see at Tech Radar Pro have adjustable mounts or elegant supports, but the Philips 242B1TFL/00 isn’t anything like them.",
    "It takes the underlying display technology of the Philips B Line series and repurposes it for public-facing information systems by adding protections to help it survive harsher environments.",
    "Open-frame monitors are entirely about thinking differently, and it's interesting to see how the designers of this display have approached that challenge.",
    "Typical UK pricing of the Philips 242B1TFL/00 is £410.10 Inc. VAT from online retailers, though it may be possible to reduce that for bulk purchases.",
    "That might seem high for a 1080p resolution screen, but a free-standing touch screen like the Dell P2418HT can cost another £50 or more than this.",
    "There are so many differences between this screen and a regular monitor it is difficult to know where to start.",
    "The Philips 242B1TFL/00 was designed to be mounted into an enclosure or Kiosk that Philips doesn’t supply. These are either made by the purchaser or a third-party company that specialises in computer systems that are used in industrial or retail commercial spaces.",
    "To this end, Philips provide mounting brackets designed to hold each of the four edges tightly to the enclosure, and a rubber gasket around the edge of the screen frame provides a way of sealing it against water and dust ingress.",
    "So that the users aren’t anywhere near that seal when using the panel, the border between the display start and the frame edge is big by modern monitor standards at about 16mm.",
    "Only the front of the panel is designed to handle liquid and dust, so it is imperative that the enclosure design doesn’t allow these substances to breach the gasket and get to the rear of the 242B1TFL/00.",
    "The scope systems used in kiosks are numerous, and therefore Philips engineers provided the widest selection of possible inputs covering VGA, DVI, HDMI and DisplayPort.",
    "With those options, this screen can equally support embedded systems, tiny Raspberry Pi solutions or full-blown PCs.",
    "An integrated USB hub allows for other peripherals, like cameras and printers, to be connected. Though, one port of USB is also needed to link the touch sensor back to the computer.",
    "One nice feature we admired was that while buttons exist on the rear of the panel for powering on and operating the OSD menu, a USB wired remote is provided with the same functionality. Given that in many enclosures, it would be difficult to see the screen and reach the buttons simultaneously, this small device could be invaluable to those setting up the hardware for deployment.",
    "There are no speakers, but audio from HDMI input is redirected to a 3.5mm audio jack for amplification within the enclosure.",
    "Considering that this panel doesn’t have a conventional case or support foot, it is still on the heavy side at 5.67kg. Much of this mass is down to having metal covering the rear of the panel and the thick glass touch panel at the front.",
    "While less than 6kg won’t make much of a difference to the overall weight of a kiosk built using one, makers need to take care during installation that it is properly supported by the enclosure.",
    "As this isn’t a design meant for office or home use, the selection of options provided in the OSD is limited. The menu includes a LowBlue toggle and basic modes, such as EasyRead, Photo, Office and Movie. A selection of colour temperatures is also available, sRGB mode and some volume control over the sound.",
    "The default Gamma is 2.2, and this value can be changed to a range of preset values.",
    "Many of the typical options we’d see are missing by default since this screen only has a maximum refresh of 75Hz, doesn’t support variable refresh, HDR or screen scaling.",
    "And, while it has four inputs, there is no PiP (picture-in-picture) capability.",
    "But few of these limitations are a genuine problem in the context of how it is likely to be used or configured.",
    "As we do with all monitors, we sent the 242B1TFL/00 through a complete display analysis to determine how close to the official specifications the retail hardware is.",
    "Colour representation isn’t critical in this context, but 93% of sRGB is acceptable but nothing special. Equally, the default Gamma is 2.2, and it tracks that value accurately.",
    "Philips told us that the display is rated to 350 nits of brightness but equally to expect closer to 295 nits due to the special protective coating on the touch glass covering.",
    "We suspect that this protection also reduces the contrast levels a little, but not enough to be noticeable.",
    "One interesting aspect of this design that is important is power consumption, as this display could be operational for long periods, and not all enclosures are well designed for ventilation.",
    "In regular operation, it consumes 26.1W, and that requirement can be reduced to 13.9W by selecting ECO mode from the OSD.",
    "Those are excellent numbers and hopefully should avoid overheating issues for most enclosures that include adequate ventilation.",
    "Some productive thinking has gone into the Philips 242B1TFL/00, and it isn’t just a modest 24-inch IPS panel with a touch screen glued on.",
    "The mounting system, water and dust protection, wide selection of inputs and the OSD remote control elevate this design in handy ways.",
    "The natural 1080p resolution is perfect for this job, and the ten-point touch sensor allows for a wide range of possible uses. The touch capability can be used for simple menu selections, more complicated finger-painting or signatures, and everything in between.",
    "That flexibility could be critical if the hardware is ever repurposed or have multiple uses.",
    "The only criticism we have is that the protective coating applied to the screen reduces both contrast and brightness, but there is logic to this. Because if it were brighter, say 400 nits, this would increase the power consumption and the heat being generated in the enclosure.",
    "But what surprised us the most about this hardware is that while it might be a niche requirement, the price seems very reasonable for what you can do with it.",
    "That cost saving could be critical to any company that needs numerous kiosks and wants to keep the unit costs down."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design and features",
    "17": "Performance",
    "29": "Final verdict"
  },
  "links": {}
}