{
  "source": "https://www.techradar.com/reviews/roccat-pyro-rgb-gaming-keyboard",
  "title": "Roccat Pyro RGB Gaming Keyboard review",
  "category": "computing",
  "updated": "2021-06-28T19:34:44Z",
  "author": "rhys-wood",
  "summary": "Roccat knocks it out of the park again",
  "verdict": "The Roccat Pyro RGB gaming keyboard impresses immediately with its sleek metal finish and ultra-responsive keys. The customizable RGB is handled perfectly, contrasting nicely against the all-black design of the keyboard. All this, plus extra features like a volume slider and togglable Game Mode make for a fantastic RGB keyboard all around with just a couple of minor drawbacks.",
  "pros": [
    "Gorgeous RGB",
    "Wonderfully responsive keys",
    "Fantastic price point"
  ],
  "cons": [
    "Slightly bulky",
    "Standard WASD keys",
    "Volume control wheel placed awkwardly"
  ],
  "article": [
    "From the moment we unboxed the Roccat Pyro RGB gaming keyboard, we had a good feeling about it. While it’s built from the same plastic casing as the Roccat Magma (link), the Pyro immediately differs with a gunmetal finish beneath the keys. This lends the Pyro a much sleeker, professional look and feel.",
    "The Pyro impresses right away with its remarkably clean and sharp RGB functionality. The effect contrasts wonderfully against the sleek black finish of the keyboard and its keys. We prefer the RGB here as opposed to the Magma, where the effect was a touch overwhelming thanks to the translucent base.",
    "Unsurprisingly, the Pyro’s RGB is fully customizable. There’s a range of options to choose from, and you’re able to choose your desired brightness and speed. Some of these extra options do feel a tad gimmicky though, and we found the traditional rainbow wave option to be the most pleasing to the eye.",
    "The fancy RGB is just the start, though. How does the keyboard perform? In short, fantastically well. The Roccat Pyro is remarkably satisfying to type on. The tactile and clicky feedback of this mechanical keyboard never gets old. Typing out long-form content on the Pyro is a joy, as such it’s easy to recommend to writers and authors of all stripes.",
    "The Roccat Pyro’s price point might be just a tad steep for some, but we think it’s fair for what you get with this excellent keyboard. At £89.99 (around $130 / AU$170), the Pyro is almost twice as expensive as the Roccat Magma, but a whole lot cheaper than the tenkeyless Roccat Vulcan TKL Pro (link).",
    "The Pyro, then, sits somewhere in the middle in terms of build quality and functionality. But that doesn’t mean Roccat has sold the Pyro short. While the Vulcan absolutely excels with that gorgeous premium finish, the typing experience on the Pyro is comparable. This makes the mechanical keyboard a fine choice if you’re after something close to premium quality without having to bust open the rainy day jar.",
    "The Pyro’s snappy, responsive keys are perfect for gaming purposes too. Each key bounces back into place effortlessly after being pressed thanks to its 2.0mm actuation point, offering close to zero resistance for optimal play. This is an especially important feature for competitive play, such as in twitch shooters like Overwatch and Call of Duty: Warzone.",
    "Being a keyboard with linear mechanical switches, the Pyro’s noise profile is on the louder side. Depending on your living situation, this could be an area where quieter keyboards, like the Roccat Magma, have an edge over the Pyro. The sound made from a press of the space bar is especially chunky. As such, the Pyro might get on the nerves of anyone you might be living with, definitely something to keep in mind if you’re currently weighing up your options.",
    "While the Pyro is certainly an excellent choice for a first time mechanical keyboard buyer, it’s understandably missing a few quality of life features that other pricier options have to offer. For one, WASD keys aren’t curved, textured or differentiated in any way. This could prove to be an issue during intense competitive moments, especially if you’re somewhat new to the environment. It’s by no means a deal breaker, but something to keep in mind especially if you aren’t planning on buying specialized keys separately",
    "The Roccat Pyro does have some other quality-of-life features worth mentioning. There’s a handy volume control wheel up at the top right corner of the keyboard, which is objectively nice to have. It’s a tad too close to the numpad keys for our liking - your thumb will inevitably brush the minus key when adjusting the volume - but this is easy to get used to after extended use.",
    "In all honesty, we almost wish that numpad wasn’t there. It adds a considerable amount of bulk to the Pyro, thereby increasing the amount of real estate it takes up on your desk. It lacks the compact form factor of more bespoke tenkeyless keyboards. On the other hand, there’s something to be said for the Pyro’s multipurpose nature. It’s a great gaming keyboard, but the numpad can obviously come in handy for work purposes.",
    "The Roccat Pyro is quick to remind you that it’s a gaming keyboard first and foremost, however. Similar to other Roccat keyboards, the Pyro comes with a built-in Game Mode that can be toggled on or off at any time. The Game Mode option can prevent unintentional shortcuts from activating while you’re playing games.",
    "For example, Caps Lock converts to an Easy-Shift function by default, which prevents you from accidentally typing in all caps which could have been an issue in communication-heavy games like MMORPGs, real-time strategies and shooters. Easy-Shift can also unlock a variety of shortcuts for keys in the WASD area, making it a surprisingly robust gaming feature."
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "Don't buy it if..."
  },
  "links": {}
}