{
  "source": "https://www.techradar.com/reviews/neeva-search-engine",
  "title": "Neeva search engine review",
  "category": "computing",
  "updated": "2021-10-08T17:54:40Z",
  "author": "lindsay-pietroluongo",
  "summary": "Ad-free search, but with a (low) price tag",
  "verdict": "Neeva has attractive search results for e-commerce, but the ad- and affiliate-free search engine can make it hard to actually shop – and it comes at a cost.",
  "pros": [
    "No software to download",
    "Decent privacy features",
    "Online shopping research features",
    "Personalized home page",
    "Advanced bookmarks feature"
  ],
  "cons": [
    "Payment required after trial",
    "Collects a good amount of data",
    "Not as visually appealing as competitors"
  ],
  "article": [
    "Neeva bills itself as “the only ad-free, private search engine,” and it claims to be free of affiliate links, too. After signing up for Neeva (we go over that a bit more in the user experience section), you can either use the search engine on Neeva.com or download an extension for your browser, as well as a mobile app if you have an iPhone. The extension says that it gives you more protection online by blocking trackers.",
    "Unlike most search engines, Neeva is not free. You’ll get a four-month free trial, but after that, it costs $4.95 per month.",
    "Since Neeva blocks ads and affiliate links, it’s great for shopping research without all the clutter. This is what an e-commerce search results page looks like:",
    "If you click on an item in the Top Reviewed Products section, a pane opens up on the right-hand side with more details:",
    "There’s a reason we highlighted “research,” though, and not online shopping in general. Because Neeva blocks ads and affiliate links, there’s more of a focus on reviews than actual shopping links. Sometimes, you can click through to a product, namely on Amazon, but it’s not nearly as shopping link-heavy as other browsers – which for some people, will be a bonus. Compare Neeva’s results to Google’s below.",
    "Neeva blocks ads and affiliate links, which is clear when you search, especially if you’re looking for products to purchase.",
    "In the Settings menu, there are a few options. You can set up two-step verification to add extra protection to password-protected online areas. You can also use a QR code if you want to sign in to Neeva on another device, like your iPhone.",
    "If you enable Memory Mode, Neeva will remember some of your search activity to provide customized suggestions and results. This is on by default, so if you want the most tracker-free experience possible, you’ll want to turn it off from the start. If you have the Neeva extension, tracking cookies and tracking requests are blocked by default. Under the Memory Mode option is a link to Erase Memory, which will get rid of your search behavior.",
    "Even though Neeva touts itself as a highly safe browser, they know more about you than it may seem. According to their privacy policy, a good amount of data is collected about its users. And though Neeva doesn’t share your information with third parties, there are a number of ways that your information is used.",
    "To get started, you have to head over to Neeva.com and enter your email address, then click the Try It Free! button.",
    "You then have to sign up and create a password, then click Create Neeva Account.",
    "This is a clunkier process than most search engines require. Often, you can just use the search engine on the dedicated webpage or download the software to your computer. It’s rare to be required to sign up for a search engine.",
    "Once you’ve got your account set up, the Neeva home page layout is nice. It’s customized to you, complete with your location, local weather, search ideas, and news headlines (and you can change your preferred news sources).",
    "You can connect your apps, too, like Dropbox, your Google products, Slack, and more. Connecting an app to Neeva means that content from those apps will be included in search results – so you could, for example, use the Neeva search engine to find something in your email.",
    "The Spaces feature lets you save and categorize search results. This is kind of like an improved version of classic bookmarks. When you’re searching, you can click the Bookmark icon on a result to save it to one of your Spaces.",
    "Neeva’s browser extension works with major browsers, including Brave, Chrome, Edge, Firefox, and Safari. There’s also an iOS app.",
    "When you’re talking about a search engine that doesn’t track you, DuckDuckGo has to be mentioned. And if you want to remain as anonymous as possible online, DuckDuckGo will do a better job of that than Neeva. It’s not as attractive or customizable as Neeva, but that may be secondary to staying as private as possible.",
    "You also can’t talk about safe search engines without bringing Firefox into the conversation. As a leader in its field, if you’re after safety, this seems the natural choice ahead of Neeva – and it’s buoyed by the fact that you don’t have to pay for it.",
    "Neeva promotes its e-commerce research search results as a leading feature, but since ads and affiliate links are blocked, it’s tricky to actually get to the product you want to buy. The Edge browser is the best one I’ve found for online shopping – unless you only want to do research, in which case, Neeva may be more streamlined.",
    "If you want a customized search engine experience without a ton of tracking and data sharing, Neeva may be the right option. However, we feel that there are other search engines with similar or better benefits, and they’re free to use. Even at just $5 per month, a total of $60 per year can feel like too much to spend for a search engine, especially one that doesn’t have the aesthetics, features, or safety and privacy features of its competitors. However, thanks to the four-month free trial, there’s plenty of time to test it for yourself to see if you’d like to stick with it.",
    "Want a search engine that plants trees? We’re not kidding. Check out Ecosia."
  ],
  "headers": {
    "2": "Features",
    "5": "Privacy",
    "9": "User experience",
    "15": "Platforms",
    "16": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Neeva": "https://neeva.com/",
    "privacy policy": "https://neeva.com/privacy",
    "DuckDuckGo": "https://www.techradar.com/reviews/duckduckgo-search-engine",
    "Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Check out Ecosia": "https://www.techradar.com/news/the-eco-friendly-search-engine-that-wants-to-kill-google-with-kindness",
    ".": "https://www.techradar.com/news/the-eco-friendly-search-engine-that-wants-to-kill-google-with-kindness"
  }
}