{
  "source": "https://www.techradar.com/reviews/unbounce",
  "title": "Unbounce landing page builder review",
  "category": "computing",
  "updated": "2021-03-22T04:19:28Z",
  "author": "harry-patte-dobbs",
  "summary": "A comprehensive and easy-to-use landing page builder",
  "verdict": "Unbounce offers competitively priced landing page building with quick-use and easily replicated templates. Their higher-priced plans also offer comprehensive optimization features to personalize landing pages by visitor attributes.",
  "pros": [
    "Easy-to-use templates",
    "Strong support base",
    "Intelligent AI reporting"
  ],
  "cons": [
    "No A/B testing or Smart Traffic on the cheapest plan",
    "The main four plans all feature visitor and conversion limits"
  ],
  "article": [
    "A landing page is a standalone web page created specifically for a marketing or advertising campaign. They’re designed to guide visitors to a single call to action (CTA) after they’ve clicked on an email or ad. Taking this action is called a conversion, and with a good landing page builder, you can guarantee a higher conversion rate for your business.",
    "One of the best landing page creators out there is Unbounce, used by companies including Later, Helix, and Zola. By using Unbounce to build, launch, and optimize custom landing pages that fit your campaign, you can ensure more conversions and, ultimately, a higher return on investment (ROI).",
    "Unbounce has four main plans to cater to businesses of all sizes. The biggest changes as you move up these plans are in the conversion and visitor limits and the number of domains you can connect.",
    "The lowest-priced Launch plan ($72/month) would suit small businesses expecting up to 500 conversions and up to 20,000 visitors per month, all on one connected domain. In the Optimize plan ($108/month), these estimates increase to 1,000 conversions, 30,000 visitors, and three domains.",
    "You’ll also get access to tools like Smart Traffic—an AI that directs users to your most relevant landing page based on visitor attributes. The Accelerate and Scale plans are aimed at larger companies and agencies dealing with multiple domains and/or campaigns.",
    "The Accelerate plan ($180/month) is for businesses looking at up to 2,000 conversions and 40,000 visitors per month across seven domains. You’ll also get quick-loading Accelerate Mobile Pages (AMP)—ideal for making pages mobile-friendly.",
    "The Scale plan ($270/month) would suit businesses aiming at up to 3,000 conversions and 50,000 visitors per month across 15 domains. With this plan, you’ll also get big-time bandwidth to support these campaigns.",
    "Additionally, Unbounce has a Concierge plan aimed at businesses expecting to exceed these numbers. It also features personalized onboarding, training, and support, but is billed on a needs basis.",
    "All plans include unlimited landing pages (on your connected domains), pop-ups, and sticky bars and can be billed monthly or annually (saving you 10% overall) with a free 14-day trial.",
    "One of Unbounce’s best features is its usability. You won’t need any web design experience or a developer to start building landing pages. You can customize more than 100 quick-to-use templates to build the page that best suits your business.",
    "Plus, the page migration feature means that your existing pages will be available to use as templates just as if they were Unbounce originals. Unbounce also offers access to 850,000 free-to-use images from Unsplash which are optimized (by balancing quality and file size) so as not to affect page speeds.",
    "You can publish your pages straight to your WordPress site or to a custom domain.",
    "All Unbounce plans allow unlimited users and sub-accounts, so you can assign varying permission levels for everyone on your team. In addition, audit logs and version histories allow you to track work and quickly revert landing pages to previous iterations if need be.",
    "Unbounce has a host of optimization features including Conversion Intelligence and Smart Traffic. With these, Unbounce uses machine learning to match visitors with relevant landing pages and uses AI-derived insights so that you can optimize your pages for higher conversion rates.",
    "However, these features aren’t available on the cheapest Launch plan.",
    "To set up your Unbounce account, simply choose your plan and whether you want to be billed monthly or annually. By clicking to start your free 14-day trial, you’ll be directed to a form to enter your personal details to choose a username and password. Alternatively, you can pre-fill the sign-up form with Google.",
    "Then you’ll be asked for your payment details (you can also pay with PayPal). Once you’ve signed up, you can switch between plans and monthly/annual billing via your account dashboard. Billing will commence at the end of your 14-day free trial. From there, you can get started with the Unbounce landing page builder.",
    "At the moment, the Unbounce page builder is only available on desktop. The drag-and-drop builder features the page you’re working on in the middle of the screen, with toolbars on either side.",
    "From the left-hand toolbar, you can add page elements like images, text, buttons, and widgets, whilst the right-hand toolbar allows you to edit their properties. You can edit properties like style and color for single objects or even metadata for your whole page.",
    "Along the top of the page builder are quick-use buttons that, for example, can send page elements forwards or backwards on your page’s layers and copy and paste.",
    "Unbounce has an extensive knowledgebase filled with articles and FAQs on its site, as well as a Master Unbounce daily webinar. There’s also chatbot on the website, or you can get in contact via email to receive a support ticket and one of the team will get back to you to resolve your problem (users can expect a response in 3–4 hours). Alternatively, there is a phone helpline.",
    "You can get in touch with Unbounce via phone, email, or chatbot on weekdays from 1am–8pm PST and on weekends between 9am–9pm PST. As mentioned earlier, further support is available on a Concierge plan.",
    "Instapage is used by companies like Verifone, Verizon, and Hellofresh, and its Optimizing plan ($149/month—billed annually) offers a lot of the same features as Unbounce’s Accelerate plan (in the same ballpark at $180/month).",
    "You’ll get the same SSL encryption, fast page speeds, conversion analytics, and A/B testing. However, Instapage’s Optimizing plan offers unlimited conversions as well as useful features like heatmaps. It also features similar Zapier, Salesforce, and Hubspot integrations to link it to customer relationship management software (CRM). It doesn’t offer page migration, though.",
    "Like Unbounce, Wishpond has more than 100 high-converting templates for mobile responsive landing pages. You can also publish your landing page anywhere, including your website or WordPress site.",
    "Wishpond’s Growth plan ($129/month—billed annually) allows up to 10,000 leads and, although Wishpond may suit small to medium-sized businesses, plans can be adjusted up to 1 million leads with agency plans available upon enquiry. Wishpond also offers email, phone, and chatbot help as well as an online knowledge base.",
    "Unbounce is a landing page builder that can be used without the need for developers. With customizable templates, you can easily optimize campaigns with a host of features like sticky-bars with targeted calls-to-action. There are plans to suit all business sizes, and even the options of Concierge plans if you feel you need a higher visitor and conversion limit.",
    "The lack of A/B testing and Smart Traffic on the Launch might mean that it's not comprehensive enough to be useful, but all plans offer multi-channel support and access to Unbounce’s knowledge base. With fast page speeds, drag-and-drop templates, and a bank of ready-to-use images, Unbounce has everything you need to create high-converting landing pages quickly."
  ],
  "headers": {
    "2": "Plans and pricing",
    "9": "Features",
    "15": "Interface and in use",
    "20": "Support",
    "22": "The competition",
    "26": "Final verdict"
  },
  "links": {
    "best landing page creators": "https://www.techradar.com/best/landing-page-creator",
    "Unbounce": "https://unbounce.com/",
    "Launch plan": "https://unbounce.com/pricing/",
    "Optimize plan": "https://unbounce.com/pricing/",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "Accelerate plan": "https://unbounce.com/pricing/",
    "Scale plan": "https://unbounce.com/pricing/",
    "Concierge plan": "https://unbounce.com/pricing/",
    "free-to-use images": "https://www.techradar.com/best/free-stock-photos",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "Instapage": "https://instapage.com/",
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "Wishpond": "https://www.wishpond.com/"
  }
}