{
  "source": "https://www.techradar.com/reviews/ininja-vpn",
  "title": "iNinja VPN review",
  "category": "computing",
  "updated": "2021-01-27T15:44:55Z",
  "author": "sead-fadilpasic",
  "summary": "Great proxy service for PC, not so much on a phone",
  "verdict": "iNinja clearly prioritizes its proxy product, even though it offers a VPN as well. We found it was quite fast for a free service, but the Android apps are highly temperamental. Add this to the fact iNinja logs your IP address, and you have an average service that's only really worth considering in a pinch.",
  "pros": [
    "Free service",
    "Solid speeds",
    "Very simple to use"
  ],
  "cons": [
    "Poor mobile experience",
    "Logs your IP address",
    "Lower level of data encryption",
    "Lacks features"
  ],
  "article": [
    "According to its website, iNinja is a free “VPN and proxy with ad blocker”, with a Chrome extension for desktops and apps for mobile devices.",
    "We noticed its mobile product doesn't function particularly well, however, and the provider’s main product is very clearly the browser extension (as confirmed by customer service).",
    "iNinja is a free service that claims it isn’t supported by ads, but its Android app demonstrates this isn’t quite true, as we were shown ads upon opening the app and almost every time we tried connecting.",
    "It is, however, true of the browser-based PC version. The only catch is that, in order to use it, you may have to become \"a peer on the iNinja network”.",
    "Although it has some positive aspects, iNinja is still a free service and as such cannot offer all the things you’d expect from its premium cousins.",
    "Take NordVPN as an example. It not only gives you access to an amazing platform with apps for your every device, but also thousands of servers. If you don’t mind coughing up for something even more advanced, meanwhile, then look no further than ExpressVPN.",
    "If you’re on the budget and need to save money, you may want to look at Surfshark or CyberGhost, both of which offer amazing deals on longer subscriptions and provide excellent VPN services.",
    "We didn’t expect it from a free service, but iNinja is capable of unblocking some streaming content on services like Netflix in areas where it might be unavailable.",
    "However, don’t expect to gain access to BBC iPlayer, even if you connect to one of the UK servers. The streaming platform will recognize you’re not connecting from the UK.",
    "The company running iNinja is called Ininja Network LTD and is registered in London, UK. It offers access to 17 server locations in 13 countries with shared IP addresses, including Ukraine, Canada, and Australia.",
    "In an effort to protect your privacy, iNinja deploys 128-bit SSL encryption, which is less secure than the 256-bit algorithm used by most of its competitors, but if superior privacy isn’t your primary concern, you should be fine.",
    "Although the website might make you think torrenting is allowed, we were told that this isn’t the case, since the main product is a Chrome extension.",
    "iNinja’s Privacy Policy explains the company collects: “data on the use of Our Services”, “information about your connections (time and duration of connection)”, as well as your IP address when using its services.",
    "The provider promises not to share your information with anyone without your explicit consent, but it does say it “may share information in response to a request for information if we believe disclosure is in accordance with, or required by, any applicable law, regulation, legal process or governmental request, including, but not limited to, meeting national security or law enforcement requirements.”",
    "That said, it also says it “will attempt to provide you with prior notice before disclosing your information in response to such a request.” Fair enough, but still, this amount of logged information is a lot.",
    "iNinja can be used on any device that supports Google Chrome, including Windows, Mac, iOS, and Android, because the platform comes in the form of a Chrome extension (for desktops), as well as an app for Android and iOS.",
    "The Chrome extension has been downloaded by over 400,000 users, and has a rating of 4.6 stars (out of 5), as judged by 8,232 users. It was last updated on November 11, 2020.",
    "On the other hand, the Android app has a score of 3.7 stars, gathered from 1,266 reviewers, out of over 100,000 who installed it on their devices. The app was last updated on December 5, 2019.",
    "Its iOS counterpart has so far gotten 4.7 stars from 6,700 ratings and was last updated on November 2, 2020.",
    "iNinja has a rather minuscule knowledge base that contains barely any helpful links, but we did manage to find some useful reading material on its blog. If you need more information than what is offered there, you can reach out to the customer service via email or web form.",
    "The installation process is very simple. You just download and install the software from the website or Google Chrome Web Store, allow it access through your device’s firewall and you’re good to go. This will add an icon to your taskbar which doesn’t do anything other than open the Chrome store.",
    "Using the app itself is also very simple: just click on the extension icon in Chrome and select the location you want to connect to. As our first location to test download speeds, we selected Vienna, Austria. The speed wasn’t bad, reaching 15Mbps on a 60Mbps testing connection. We’ve seen better than that, but much worse as well.",
    "We then decided to check out how London would fare and were quite surprised, watching the numbers rise to an exceptionally fast 34Mbps. A server in New York then gave us 12Mbps, which is still solid given the distance from our physical location.",
    "The first time we used iNinja on Android, however, we couldn’t connect to a single server and have discovered similar complaints among the reviews in the app stores.",
    "After restarting the app a few times, we finally managed to connect to a server in Moscow that gave us a decent 6.9Mbps. After a bunch of more attempts, we also succeeded in connecting to Freemont, US, which delivered 10Mbps.",
    "We really liked iNinja when we first installed it on Chrome. It was simple, effective, and fast, so imagine our disappointment when we tried running it on a phone and found we simply couldn't connect.",
    "To avoid such problems, you may want to consider spending a little on a more capable and feature-rich VPN service."
  ],
  "headers": {
    "2": "Price",
    "4": "Alternatives",
    "7": "Streaming",
    "9": "About the company",
    "10": "Privacy and encryption",
    "15": "Support",
    "20": "Speed and experience",
    "25": "Verdict"
  },
  "links": {
    "iNinja": "https://ininja.org/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://ininja.org/privacy.php",
    "Chrome extension": "https://chrome.google.com/webstore/detail/ininja-vpn-proxy-with-ad/ookhnhpkphagefgdiemllfajmkdkcaim",
    "Android": "https://play.google.com/store/apps/details?id=org.ininja.ininja&hl=en",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1291494992638261500&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fvpn-ininja-fast-unlimited%2Fid1433935212",
    "knowledge base": "https://ininja.org/pages",
    "blog": "https://ininja.org/blog/",
    "email": "mailto:contact@ininja.org",
    "web form": "https://ininja.org/contact.php"
  }
}