{
  "source": "https://www.techradar.com/reviews/nvidia-shield-tv-pro",
  "title": "Nvidia Shield TV Pro review",
  "category": "gaming",
  "updated": "2021-12-03T11:38:43Z",
  "author": "gerald-lynch",
  "summary": "The Shield TV Pro is still the best streaming box on the market",
  "verdict": "The new Nvidia Shield Pro doesn’t do much different from previous Shield models, but doesn't have to in order to remain the best streaming box and retro gaming machine out there. However, the lack of a bundled controller (while retaining the previous generation's price point) harms the deal overall.",
  "pros": [
    "A versatile and powerful streamer",
    "Chromecast built in",
    "Great gaming features"
  ],
  "cons": [
    "No longer ships with a controller",
    "No storage boost",
    "UI needs finessing"
  ],
  "article": [
    "Why buy the Nvidia Shield TV Pro? In a market filled with streaming devices at all sorts of different budgets – many of them cheaper than this high-spec model – the answer simply comes down to whether you want the best.",
    "From Fire TV Cubes to Roku streaming sticks, if all you're after is the latest movies and shows streamed without hassle, you can do so without breaking the bank – while even premium features like Dolby Vision are, these days, trickling down to cheaper models. But if you're after a bit more 'oomph' from the gadgets serving your TV, only the Shield TV Pro will do.",
    "An Android-powered set top box / games console, the Shield TV Pro is an impressively powerful streaming device, and is jam-packed with features that will tempt both movie buffs and gamers alike.",
    "Whether you're after high-spec PC gaming streamed to your TV, or 4K movies in multiple HDR formats, it's got you covered. It does offer less value for money than previous models however, despite a bump in specs.",
    "The Nvidia Shield TV Pro is available to buy now, priced at $199.99 (£179.99). That gets you the console itself, a new-and-improved remote control (which we'll discuss in detail shortly) and access to 20 great (if ageing) PC games that can be streamed over the internet as part of the GeForce Now service, which you can expand upon with your own purchases.",
    "With improved internal hardware and some new features which we'll get to in a second, it'd be a fantastic deal… were it not previously outdone by Nvidia's own Nvidia Shield TV Gaming Edition pack.",
    "That offered the last-gen box, last-gen remote and the mic-packing Nvidia Shield Controller, which is now sold separately, for roughly the same price. It's a better device than ever before, with more features and a more powerful processor, but it’s tough to say if the latest Shield represents better value than previously, even with the knowledge that any PS4 or Xbox One gamepad will pair with it, as well as newer PS5 DualSense or Xbox Series X controllers.",
    "Aside from its older siblings, there’s not much that can compete with the Nvidia Shield TV Pro. The Amazon Fire TV Cube is just as capable as a film and TV streaming device, and is cheaper, but lacks the gaming chops the Shield TV Pro offers. If you've got the money, the Shield TV is hard to beat.",
    "The Nvidia Shield TV Pro is a tiny little thing, given the power it packs. Shaped like a slim wedge with some angular indentations carved into it for posterity, it’s about the size of two Kindle e-readers stacked on top of each other. It’d just about fit into the back pocket of your jeans, in a pinch.",
    "Laying flat or standing tall (when placed in a sold-separately stand accessory), it’ll sit innocuously alongside your other AV gear, with its 'on' status depicted by a neon green light strip, the intensity of which can be tweaked if you find it a little garish.",
    "Around the back you'll find two USB 3.0 ports, a 4K HDR-compatible HDMI port, an Ethernet port and a proprietary power port. Wi-Fi is built-in (802.11ac dual-band) as is Bluetooth 5.0 for connecting wireless accessories. The only cable included in the box, however, is for the power. You'll have to supply your own HDMI (and USB if required) lead.",
    "Under the hood is 3GB of RAM and 16GB of storage. The RAM remains unchanged then, but we've seen other Shield models with as much as 500GB of on-board storage, so a little more here would have been appreciated. Still, the two USB ports make adding external storage a cinch, not to mention plugging in a wired controller or keyboard and mouse.",
    "What's really changed then is the processor – the first major upgrade to the Shield TV range since it was introduced in 2015. On-board here is the Tegra X1+ processor – representing a 25% performance boost over the retiring Tegra X1, it’s of the same family of chips currently powering the latest Nintendo Switch models, including the Nintendo Switch Lite.",
    "The Shield TV family has never been a slouch in terms of performance, but the addition of the X1+ makes everything feel a tad snappier, and also facilitates some of the new feature additions on-board here.",
    "If you’ve used an Android TV device before, you’ll know what to expect from the Nvidia Shield TV. It’s pretty much been the vanilla Android TV experience as Google designed it, with some small tweaks (mostly in terms of settings options) specific to the Shield TV Pro’s features.",
    "It offers rows of content, based on your installed apps. The top row is an overview of your most regularly-used apps, with the rows that follow offering rich artwork and content recommendation snippets based on what the associated app offers. All of this can be re-organised or hidden as you see fit.",
    "The Shield TV Pro therefore gives you access to all the major streaming services in their 4K / HDR configurations, from Netflix to Amazon Prime Video to the BBC iPlayer and everything in between. There’s also media server apps like Plex, a ton of Android TV games to try out (including some exclusive to the Shield and its powerful innards) and, for those happy to navigate the potential pitfalls, a host of retro gaming emulators to tinker with.",
    "Keep in mind that not every Android app you have on your phone has an Android TV variant, and that browsing the app store for Android TV can be a pain – you always get the feeling you’re not being shown every possible app from a search.",
    "A 2021 update did bring some new changes, removing app shortcuts from the home screen, and expanding the apps view to get more services onscreen at one time. There's also now a Discover tab with content recommendations, and new banner promotions for Disney Plus shows. It's a better interface, but altogether too different.",
    "Plus, Google Chromecast is built-in here, so any Chromecast-supporting mobile app that you want to throw up onto the big screen via the Shield will be supported here.",
    "It’s worth noting that all this can be browsed using voice commands from within any section of the interface or from inside an app, with the included remote featuring a mic. Google Assistant is the native voice butler built in, but the Nvidia Shield TV Pro can be controlled with Amazon’s Alexa devices, too. As such, the Shield TV Pro is an effective smart home hub, as well as being a media player and gaming box.",
    "So what’s new in terms of features for the Nvidia Shield TV Pro? It’s mostly down to video playback performance.",
    "Shield TV already supports plenty of HDR formats, but it now also can play back Dolby Vision content, a premium format that tweaks brightness and contrast levels using frame-by-frame metadata. If your TV supports it, it’s an incredibly rewarding feature, bringing great depth to a scene.",
    "It also means the Shield now supports both of Dolby’s premium cinema formats, including Dolby Atmos audio, which can make sounds appear to come from behind and above a movie viewer, as well as in front, for a truly immersive experience – provided you’ve got compatible speaker gear hooked up to your TV.",
    "The second of the big additions is a new AI image upscaler that can be toggled on or off at the push of a button. It’s fantastic, and transformative for content that’s running below 4K resolution.",
    "Powered by an algorithm determined by a neural network that has been fed thousands of hours of footage, it’s processed locally and can hugely sharpen softer sources, making them worthy of your 4K TV, not to mention standard-definition sources (like some YouTube content) running on a 1080p set.",
    "It doesn’t work across every app (anything running above 1080p or 30fps won’t accept it), and there are some occasions where it can be overly aggressive where an artistic intention may actually call for a softer focus. But for the most part it’s an excellent addition – so much so that a side-by-side slider, intended as a demo tool, has been left accessible in the menus to play with.",
    "If one thing sets the Nvidia Shield TV Pro apart from other streaming boxes, it’s the built-in GeForce Now service. It essentially gives you access to top-tier PC games on your TV, whether you have a gaming PC or not – provided your internet connection is capable of reaching consistent, moderately-fast speeds. GeForce Now is currently free to use, as it's still considered to be in a 'beta' phase – what it may eventually cost once it's beyond beta remains to be seen.",
    "The feature works by creating a virtual PC on Nvidia’s remote servers, making use of super-charged components to deliver max-settings gameplay visuals from demanding games.",
    "These are then streamed in as video feeds to your Shield TV Pro, which you can control – all the heavy lifting is done remotely, so all you need is a fast enough internet connection to keep the video from stuttering as you play. It's a similar concept to Google Stadia.",
    "Nvidia has done much to improve GeForce Now over the years. Running at maximum resolutions of 4K and at 60fps, a solid internet connection will see you manage to play games very smoothly. A recommended speed of 25Mbps is required for stable 1080p / 30fps streaming.",
    "The list of games GeForce Now supports is continually expanding, and adding to your library is easy – link up your Steam account, and any supported games you’ve purchased there are then playable through GeForce Now. You can buy games from Steam via GeForce Now too, meaning you don’t even need access to a PC to play.",
    "GeForce Now began life as a Netflix-like subscription service, giving you access to a catalog of games for a monthly fee. The remnants of that service remain, with all Shield TV Pro owners getting access to twenty included games straight out of the box, including Batman Arkham City, a handful of LEGO games and Tomb Raider. Not new titles, but welcome for free all the same.",
    "It’s not always seamless, however. Some games are better supported than others (those developed with gamepads in mind from the beginning, for instance), and you’ll sometimes be thrust into the Steam 'Big Picture' interface left wondering what’s going on, to be presented with a pop-up starter menu launcher window for your game in question.",
    "But there are benefits to playing streamed games beyond the low hardware entry requirements – games load in an instant without the need to download tens of gigabytes of data in advance, as well as all the latest updates and patches being applied automatically.",
    "The Shield TV Pro also has a feature called GameStream, which has a similar concept to the GeForce Now service. Providing you have a computer packing a compatible Nvidia GPU, you can stream almost anything from that machine to the Shield TV Pro.",
    "It takes some tinkering, and is no good to those without a reasonably powerful gaming PC in another room of the house, but again stresses the flexibility of Nvidia’s powerhouse box.",
    "A new remote control comes in the box with the Nvidia Shield TV Pro, and it’s thoughtfully reconsidered. Rather than being flat, it’s now shaped like a prism, and includes dedicated playback controls, as well as a selection wheel. A dedicated Netflix button is also included, as well as a mic-on button and a ‘Quick Menu’ button that can be customised in the interface to jump straight to any function you choose.",
    "The remote also doubles up as an IR blaster now for controlling your TV, while it’ll also beep if lost if you make use of the mostly-inessential Nvidia Shield TV mobile app.",
    "Another improvement is that the remote now makes use of AAA batteries, rather than the last generation’s button-shaped watch batteries. However, it’s still not as convenient as the first generation Shield remote’s USB rechargeable power supply.",
    "The Nvidia Shield TV Pro launches alongside a new standard Nvidia Shield model, priced more affordably at $149.99 / £129.99. In terms of what it can do, it’s a very similar product, with the same processor bump and upscaling features as the Pro.",
    "But in terms of industrial design, they couldn’t be more different – the standard Shield is shaped like a relay baton, and is designed to sit behind your TV, out of sight, the cylindrical shape used for its Wi-Fi signal boosting properties, apparently. It comes with the new remote, too.",
    "With just 8GB of built-in storage, only 2GB of RAM, and no full-size USB ports (microSD cards will instead be needed for storage expansion, while USB controllers will be a pain to get working), Nvidia is aiming this one squarely at media consumers, while the Pro is for the gamer that likes to tinker under the hood.",
    "There’s not much new within this Nvidia Shield TV Pro edition, but that doesn’t stop it being an essential buy for newcomers to the product. It’s unrivalled when it comes to its 4K HDR streaming capabilities, has wide app support thanks to its Android TV foundations, and is littered with potential for gamers, whether playing games stored locally on the device or over the net through the GeForce Now service.",
    "However, there’s a bit of a learning curve to the many tricks the Shield Pro is capable of, and you’re going to need a strong web connection to take advantage of all its gaming powers. Android TV as an interface needs some finessing too (as does GeForce Now’s game browsing library) – but any faults with Android TV lie with Google, not Nvidia.",
    "What is disappointing is the price – for the same cost as the older Shield TV Gaming edition, the Shield Pro really only adds a processor bump and a nifty upscaling feature. And that’s at the expense of a bundled Nvidia Shield controller, which we were fans of. As a result, what was already an expensive streaming proposition offers less value than with previous generations.",
    "As a device then, it’s almost unreservedly recommended. But it may sting to know that the Shield TV Pro isn’t quite the deal it once was."
  ],
  "headers": {
    "4": "Nvidia Shield TV Pro price and availability",
    "8": "Design",
    "14": "Features and interface",
    "27": "GeForce Now and GameStream",
    "37": "Remote",
    "40": "Want something cheaper? Try the new-and-improved standard Nvidia Shield",
    "43": "Verdict"
  },
  "links": {
    "Fire TV Cubes": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "Roku streaming sticks": "https://www.techradar.com/reviews/roku-streaming-stick",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "set top box": "https://www.techradar.com/news/best-set-top-box",
    "games console": "https://www.techradar.com/news/best-consoles",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "PS4 or Xbox One": "https://www.techradar.com/news/gaming/consoles/ps4-vs-xbox-720-which-is-better-1127315",
    "PS5 DualSense or Xbox Series X controller": "https://www.techradar.com/news/dualsense-ps5-controller-vs-xbox-series-x-controller",
    "Amazon Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "those happy to navigate the potential pitfalls": "https://www.techradar.com/news/gaming/are-game-emulators-legal-1329264",
    "Disney Plus shows": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "GeForce Now supports is continually expanding": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-6471979170012941000&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-gb%2Fgeforce%2Fproducts%2Fgeforce-now%2Fsupported-games%2F"
  }
}