{
  "source": "https://www.techradar.com/reviews/garmin-venu-sq",
  "title": "Garmin Venu Sq review",
  "category": "fitness",
  "updated": "2021-04-29T13:25:54Z",
  "author": "michael-sawh",
  "summary": "Without an AMOLED display, the Venu Sq just doesn't feel as exciting as the original Venu",
  "verdict": "The Garmin Venu Sq is a decent all-round performer, and we've not seen a Garmin watch with a color screen at this price point before. The problem is that the screen quality and design is inferior to the more expensive original Venu. The archaic watch UI and sluggish GPS left us with mixed feelings about the cheaper Venu. While you get that familiar sports tracking experience, we wished it had more in common with its pricier compatriot in the looks department.",
  "pros": [
    "Feature-packed",
    "Light and comfortable to wear",
    "Works with external sensors"
  ],
  "cons": [
    "Slightly archaic watch UI",
    "Lower quality screen than Venu",
    "Missing altimeter"
  ],
  "article": [
    "The Garmin Venu Sq is a cheaper alternative to the Garmin Venu, giving you similar fitness tracker and smartwatch features, but now with a square display.",
    "The Venu Sq is packing all the core sensors like built-in GPS, a heart rate monitor and also includes the very on trend pulse ox sensor. There’s dedicated modes for the likes of running, cycling and swimming to make it a solid sports tracking companion, though we found that picking up a GPS signal was a little on the sluggish side.",
    "It doesn’t scrimp on smartwatch features either, with the music edition (which we tested here) offering a built-in music player and all versions offering contactless payments and access to Garmin’s Connect IQ store to download apps and watch faces. The Venu Sq promises to do a lot, which does cause some problems with the way you get around the watch and it takes some getting used to how things work and where things live.",
    "What you really miss out from the main Venu is that more impressive AMOLED display, animated workouts to follow on the watch and an altimeter to track your elevation. If you can live without those features, then the Venu SQ should be a decent sporty smartwatch companion.",
    "Our overall feeling is that the Venu is a better showcase of what Garmin can do when it matches the best of its smartwatch and sports watch features with a display that puts it up against some of the best smartwatches available.",
    "If you're torn between the two Venu models, check out our complete guide: Garmin Venu vs Garmin Venu Sq. If you're looking for a more powerful Garmin watch, it's also worth considering the new Garmin Venu 2, which is more powerful than either of its predecessors.",
    "If you're looking for something smaller and more streamlined, you might be interested in the newer Garmin Lily. It lacks some of the Venu Sq's more advanced sports tracking features, but is well worth considering if you want something small and discreet.",
    "The Garmin Venu Sq was released in September 2020 for $199 / £179 / AUS$349. There’s also a Venu Sq music edition (which we tested), which costs $249 / £229.99 / AUS$429 and has on-board storage for up to 500 songs.",
    "By comparison, the original Garmin Venu costs £329 / $349 / AUS$649, so the Sq is considerably cheaper, whether you opt for music or not. However, it doesn't give you the same crisp AMOLED display.",
    "If you're not a fan of the Venu Sq's silicone band, there are other options available to buy separately from Garmin, including leather and woven designs.",
    "The aim of the Venu Sq is to really showcase that Garmin is capable of making a square sporty smartwatch that hosts a colour touchscreen display.",
    "So you’re getting a 40mm square polymer case that measures in at 11.5mm thick and weighs 37.6g. That’s in contrast with the round Venu where you’re getting a larger 43mm watch case that at 12.6mm, is a chunkier watch and is heavier at 46g.",
    "While both have the same polymer made cases, the Venu Sq uses an aluminium bezel compared to the more sleek-looking stainless steel one you get on the pricier Venu.",
    "What you’re getting is a lighter, smaller watch, though we’d argue you’re not getting a nicer looking watch. While the Sq feels well built, it simply doesn’t feel as polished as the round Venu. Even the two physical buttons feel nicer to use on the bigger Venu. Granted they’re at different price points, but we’d hoped Garmin would manage to carry some of that attractiveness from its first watch to pack a colour display.",
    "Speaking of that display, you’re actually getting an inferior one on the cheaper Venu. It’s packing a 1.3-inch, 240 x 240 liquid crystal display. The first Venu houses a more vibrant AMOLED touchscreen display. While the Sq’s screen didn’t really serve up any major issues in terms of visibility or brightness, the difference in quality from what you get on the other Venu is very clear to see. It is thankfully an always-on display, though there doesn’t seem to be an always-on option available when you’re tracking exercise.",
    "One piece of good news is that Garmin has used its quick-release bands that make it nice and easy to remove the 20mm bands and swap in one of Garmin’s official bands or compatible third party options too that will likely cost you less.",
    "In terms of water resistance, that is something Garmin is always consistent with across its watches. So you’re getting a watch with a 5ATM rating, making it suitable for showering and going for a swim with it on.",
    "Like pretty much all Garmin watches, tracking your health and fitness is the core reason you’d want to buy it. Garmin does it better than most and on the whole you’re going to get a good experience with the Sq.",
    "On the sensor front, you’re getting built-in GPS and support for Galileo and Beidou satellite systems to give you better mapping coverage around the world. There’s Garmin’s Elevate heart rate monitor, which can be used for training purposes and for health features like abnormal heart rate alerts and continuous monitoring.",
    "An attractive feature is that it also supports the ability to pair up additional sensors including external chest strap monitors if you’re not satisfied with the heart rate accuracy. We paired it up with Garmin’s new HRM Pro and Polar’s H9 chest strap without issue.",
    "You’re getting an accelerometer to track indoor activity and count your steps for fitness tracking and there’s also a pulse ox sensor to measure blood oxygen levels during sleep and with on the spot measurements. As is the case with other Pulse Ox-packing Garmins, enabling it will have a significant drain on the battery.",
    "One notable sensor you do miss out in an altimeter. That means you aren’t able to track elevation whether that’s stairs climbed during the day or if you’re taking on a hilly running or cycling route. It’s a sensor you will find on the more expensive Venu.",
    "Core sports modes are running, cycling and swimming (pool) and there’s some outdoor profiles for the likes of skiing and rowing. You don’t get breadcrumb trails in real-time or the ability to upload routes, but it does include Garmin’s Back to Start feature to help you get back home or wherever you started off your activity.",
    "For running, it served up reliable running stats and key metrics were in line with another Garmin watch we pitted it against. Heart rate was okay for steady paced runs, though if you care about accuracy and using it for serious heart rate-based training, our advice is to pair up a chest strap. Our one grip with the run tracking is that it often took a long time to lock onto a GPS signal. On occasions it took around five minutes or left us so impatient with waiting that we just decided to hit that track button.",
    "Garmin’s watches are generally reliable pool swimming companions and that doesn’t change with the Venu Sq. You get a rich set of metrics to look at in real-time and post swim, though it’s not as great to view in the water as the bigger, round Venu. Crucially, it pushed out accurate data compared to the very reliable Form Swim Goggles we pitted it against.",
    "If you’re hoping for an abundance of rich training analysis, that’s something you’re not going to get here. Things like Training Load and Status insights or a recovery advisor, which you’ll find on Garmin’s Forerunner watches don’t make the cut here. If you’re less concerned about analysing sessions and more interested in having largely reliable sports tracking, that’s what you’re going to get here.",
    "Another feature you’re going to miss out on here is the animated workouts feature that was first introduced on the Venu and the Vivoactive 4. This is the ability to follow workouts on the watch screen with animations showing you how to perform the moves and exercises. It’s a shame it doesn’t make the cut and it’s one of the features you’re going to have to pay more for to access.",
    "As a fitness tracker, Garmin is giving you things like step tracking and sleep monitoring. You can also monitor stress with access to its more unique approach to guided breathing exercises. For tracking steps it does a reliable job of it, though we’d say sleep monitoring still struggles to accurately recognise the times we fall asleep and wake up, usually recording much longer sleep times.",
    "Garmin does a pretty good job of getting the best of its smartwatch features into its smaller Venu watch. It works with Android phones and iPhones and we tried with both and didn’t experience any major issues.",
    "You can view your notifications and you can respond to them when you’re using an Android phone. It’s a smaller, more cramped screen to do it than the round Venu, but it can be done with minimal fiddling.",
    "There’s the ability to control your music and if you opt for the music edition you get enough room for 500 songs, which can come from your own collection or from offline playlists via Spotify, Deezer and Amazon Music. You will need a subscription to those services to do that.",
    "Garmin Pay is also on board, but the supported banks across the UK, US and Australia certainly varies. You definitely have greater support in the US than you do in the UK to use the handy feature.",
    "Everything is pulled together in Garmin’s Connect app, which we still think can feel a bit of a daunting place to explore for the first time if you’ve never used a Garmin before. It definitely isn’t as clean as Fitbit’s app for comparison.",
    "Along with that app, you have the separate Connect IQ Store one, which is where you go to download apps, watch faces, data fields and widgets. You’re likely to find more watch faces and data fields than you will apps. It can still be very slow to install or even update apps and watch faces. You also don’t get the nice live watch faces that were introduced on the Venu.",
    "One of the more slightly chaotic experiences of using the Venu Sq is the UI. Like the Venu, Garmin has employed a different way to navigate its colour touchscreen display-packing watches. That means there's a much steeper learning curve to learn what a swipe up or down does or which button you press to open sports tracking or hold down to get to the settings. We often found ourselves accidentally starting an activity tracking session and it definitely pays to spend some time getting to know where everything lives on this watch.",
    "With the addition of a colour display, there’s always going to be the worry that Garmin’s usually impressive battery showing will take a hit.",
    "It says you can expect to get up to six days in smartwatch mode, six hours in GPS mode with music streaming and up to 14 hours using GPS only. That’s four hours less of GPS battery life than the round Venu.",
    "There’s no low power modes or battery saving options, though you can disable features like continuous heart rate monitoring and choose not to use the always-on display mode to push the battery further.",
    "In our experience with notifications enabled, a few hours of music streaming, using the GPS to track 30 minute to 1 hour runs with the screen not in always-on mode, we tended to get around five days.",
    "With the always-on display mode, it’s more like three days, maybe four depending on what you’re using daily. That is still a good showing, but does mean you’ll be charging it a bit more regularly.",
    "If you already own a Garmin, it uses the same-style charging cable that’s pretty much present on most of its watches that have launched over the last few years, barring its fitness trackers and high-end and specialist watches."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and release date",
    "10": "Design and display",
    "17": "Fitness tracking",
    "28": "Smartwatch features",
    "35": "Battery life",
    "41": "Don't buy it if"
  },
  "links": {
    "Garmin Venu": "https://www.techradar.com/reviews/garmin-venu",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Garmin Venu vs Garmin Venu Sq": "https://www.techradar.com/news/garmin-venu-vs-garmin-venu-sq",
    "Garmin watch": "https://www.techradar.com/best/garmin-watch",
    "Garmin Venu 2": "https://www.techradar.com/reviews/garmin-venu-2",
    "Garmin Lily": "https://www.techradar.com/reviews/garmin-lily"
  }
}