{
  "source": "https://www.techradar.com/reviews/audeze-penrose-x",
  "title": "Audeze Penrose X review",
  "category": "gaming",
  "updated": "2021-02-17T17:18:01Z",
  "author": "adam-vjestica",
  "summary": "Superb sound is marred by strange design decisions",
  "verdict": "The Audeze Penrose X offer stellar sound quality for gamers and music enthusiasts alike, but they’re ultimately let down by finicky headset controls, a subpar microphone and a persistent, audible hiss. While it’s possible to circumvent some of these issues, we’d expect better for the high asking price.",
  "pros": [
    "Exceptional sound quality",
    "Compatible with PC",
    "Wireless or wired functionality"
  ],
  "cons": [
    "Underlying hissing noise",
    "Tight clamping force",
    "Finicky controls",
    "Muffled sounding microphone"
  ],
  "article": [
    "The Audeze Penrose X certainly live up to the company’s sterling reputation in providing excellent audio quality, but it’s an expensive gaming headset that’s held back by annoying issues that other rival brands – particularly in this price bracket – don’t suffer from.",
    "As an active pair of headphones, the Audeze Penrose X are always on, and therefore you will likely notice some white noise during use. Once you hear it, though, it’s hard to block it out – and it really hampered our enjoyment when using the headset.",
    "Nevertheless, we found that when gaming with the Audeze Penrose X headset, we were able to pick out sound details that we had previously missed. Bass was tight and punchy, and it’s clear the 100mm planar magnetic drivers have been expertly tuned to provide superb detail and clarity.",
    "Even though these are a closed-back pair of headphones, the Audeze Penrose X also provided excellent imaging and an impressively wide soundstage. It makes them an ideal showcase for the Xbox Series X spatial audio, particularly Dolby Atmos, as the Audeze Penrose X’s flat default equalizer can be shaped to provide a listening experience that suits you.",
    "The headset’s controls sadly aren’t as worthy of praise, nor is the microphone, as we found the controls to be impractical and the mic to be particularly underwhelming due to its muffled sound quality. The same can be said about the all plastic body and green accents, which make the headset look rather cheap – the boom mic is detachable, though, in case you ever wanted to wear them outside.",
    "While we did find the Audeze Penrose X to be fairly comfortable during many hours of play, those sensitive to headphones with tight clamping pressure may feel differently. Throw in a high-end price point, and it’s clear that the Audeze Penrose X has too many compromises to wholeheartedly recommend.",
    "The Audeze Penrose X cost $299 / £299 / AU$399. They were officially released on October 27, 2020. That puts them in the very high-end bracket of the gaming headset market, and in direct competition with the likes of the established Astro A50 wireless headphones and SteelSeries Arctis Pro Wireless.",
    "Like the majority of wireless gaming headsets on the market, the Audeze Penrose X are annoyingly designed to work primarily on Xbox consoles and PC, but not PlayStation. If you’re a PS5 gamer and are interested in these headphones, you’ll need to pick up the Audeze Penrose instead. The Audeze Penrose X will work wirelessly and through the PS5 DualSense controller, but you won’t be able to take advantage of the microphone or game/voice chat mixer.",
    "To our eyes, the Audeze Penrose X don’t look like a $299 headset, and they certainly don’t feel like one, either. While the build quality is nothing to complain about, the all-plastic materials and artificial leather pads don’t exactly scream premium build quality, and we wish Audeze would have done without the obnoxious green accents that give the headphones a cheap, toy-like appearance.",
    "Thankfully, Audeze makes up for the headphone’s uninspiring looks with some good design decisions, like rotating earcups – which are handy if you want to rest the headset around your neck – and a detachable boom mic. It gives the cans a bit more versatility if you’re after a pair of headphones to use outside of gaming and don’t want to be stuck with a large microphone attached, like the GSP 670, for example.",
    "We found the headphone’s onboard controls to be cumbersome. Turning on the headphones is as easy as holding down the power button for three seconds, where you’ll be greeted with a handy audio cue. You can then select between Wireless, Bluetooth and Aux at the press of a button. There’s a scroll wheel for overall volume and microphone volume, but we found it difficult to finesse the volume to the exact desired level. You can also mute or unmute the mic using a switch on the left earcup.",
    "One element that frankly doesn’t work as intended is how the user is asked to balance game and voice chat. You need to push down the microphone volume wheel, and then turn up or down to adjust the in-game/voice volume accordingly. This isn’t an easy feat by any means, and often results in you turning down the microphone, voice chat or in-game volume accidentally.",
    "Luckily the Audeze Penrose X headphones also have a 3.5mm jack, which lets you go wired, and a cable is included. However, the headphones will still need to be turned on to function, so bear that in mind if you were hoping to carry on gaming after the battery runs dry.",
    "When it comes to comfort, the Audeze Penrose X won’t suit everyone. We found them to be more than adequate during our play sessions, but if you’re sensitive to clamping pressure, be warned that these headphones will hug your head firmly. The top headband does a fair job at providing additional support, but again, we found that the headphones stayed snug via the pressure provided from the earcups. The headset is also on the heavy end, weighing in at 320 grams.",
    "Speaking of which, the earcups are a touch small for our liking. While our ears thankfully didn’t touch the inside mesh, it’s still a bit of a claustrophobic fit for the old lug holes.",
    "When it comes to audio performance, there’s only one word that accurately describes how good the Audeze Penrose X’s sound – and that’s phenomenal. Not only do the Audeze Penrose X get suitably loud, but the fidelity that these expensive cans can squeeze out of video games is truly astonishing. We discovered sound cues that we didn’t even know existed when playing older titles, and for a closed-back pair of headphones, the performance when using a spatial audio format like Dolby Atmos was superb.",
    "If you’re a competitive gamer who’s after every possible advantage they can get on the battlefield, the Penrose X should be in your arsenal. We never failed to hear footsteps creeping from behind or ran into any trouble pinpointing the exact location of gunfire. Again, the sound quality from these headphones is truly exceptional thanks to its large 100mm planar magnetic drivers and frequency response range of 10Hz - 50kHz.",
    "But… and it’s a big one, there’s a perceptible and persistent audio hiss present when using the Audeze Penrose X which sadly sullies the entire experience. As soon as you turn the headphones on, you’ll be able to hear a low-level amount of white noise, which can be heard during quieter moments when gaming. How sensitive you’ll be to the headset's constant hiss is entirely subjective, but this particular reviewer found it to be a deal breaker.",
    "The noise became even worse when sidetone was turned on, but even when it was off, the mic was muted and detached, we were still subjected to a constant, faint hissing noise.",
    "If Audeze can find a way to lower the noise floor further to reduce this, we’d definitely recommend these headphones based on the sound quality alone.",
    "For a wireless headset, the Audeze Penrose X has a decent amount of battery life. You’ll get 15 hours of playtime from a three hour charge, and thanks to the USB-C input, we found charging to be as simple as you’d expect.",
    "We didn’t encounter any connectivity issues, either, which is always a concern when using a wireless pair of gaming cans. Using the included 2.5GHz wireless dongle worked effortlessly, and there’s a little switch so you can select either Xbox or PC mode.",
    "Another area where the Audeze Penrose X falls flat is the headphone’s microphone quality. After jumping in a few party chats, we were told that our voice sounded muffled and muddy, as though we were underwater. We couldn’t rectify this problem no matter how carefully we positioned the microphone, and we also tried removing the pop filter, which didn’t negate the issue.",
    "To test the microphone’s quality further, we recorded ourselves using a Windows 10 PC which confirmed that the microphone was as described by those we played with. It’s a disappointing result, then, especially when you consider Audeze claims the microphone to be “broadcast quality” in its marketing materials.",
    "Another sticking point buyers should be aware of is how the Audeze Penrose X works with iOS devices, or more to the point, how it doesn’t. You can still connect to Bluetooth, but if you want to access the Audeze HQ app, which lets you adjust Bluetooth, microphone and voice/in-game volume on your phone, you’re out of luck. You also can’t switch between five equalizer settings on the fly and will be stuck using the desktop app."
  ],
  "headers": {
    "0": "Two minute review",
    "6": "Audeze Penrose X price and release date",
    "8": "Design",
    "15": "Audio performance",
    "20": "Battery life and wireless connectivity",
    "22": "Microphone quality and device compatibility",
    "25": "Don't buy it if..."
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Dolby Atmos": "https://www.techradar.com/news/hear-the-difference-the-best-dolby-atmos-xbox-series-x-games",
    "Astro A50 wireless headphones": "https://www.techradar.com/reviews/gaming/gaming-accessories/astro-a50-gaming-headset-review-1083794/review",
    "SteelSeries Arctis Pro Wireless": "https://www.techradar.com/reviews/steelseries-arctis-pro-wireless-headset",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "GSP 670": "https://www.techradar.com/reviews/sennheiser-gsp-670-review",
    "Audeze HQ app": "https://play.google.com/store/apps/developer?id=Audeze&hl=en_GB&gl=US"
  }
}