{
  "source": "https://www.techradar.com/reviews/adt-identity-protection",
  "title": "ADT Identity Protection review",
  "category": "computing",
  "updated": "2021-10-29T06:26:32Z",
  "author": "john-brandon",
  "summary": "A low-cost identity theft protection app from a home security giant",
  "verdict": "If you haven’t already signed up for an identity theft protection app, ADT Identity Protection is a good place to start. The price is reasonable and the features, while not breaking any new ground, do provide most of the basic functions you’ll need. The biggest surprise may be that there are no strings attached or pressure to sign up for ADT’s other services, even though ADT is more known for home security than personal security.",
  "pros": [
    "Low cost",
    "Wide array of features",
    "Fraud resolution assistance",
    "Online dashboard"
  ],
  "cons": [
    "Not known for personal security",
    "Lacks free tier",
    "Single tier only",
    "No free trial"
  ],
  "article": [
    "Our series on identity theft protection apps will evaluate the features, pricing options, competition, and also the overall value of using each app. However, these are not full hands-on reviews since evaluating identity theft protection apps is almost impossible. It would require several months of testing, purposefully hacking accounts to see if the protection app works, handing over personally identifiable information, performing multiple credit checks, and risking exposure of the reviewer’s personally identifiable information.",
    "ADT Identity Protection is an intriguing offering from a company you probably already know. As a trusted brand for home security - think alarm systems, video cameras and motion detectors - ADT typically would protect you against actual criminals trying to break into your house and steal your belongings. With such an established reputation, you may be more likely to trust the experience and credibility of ADT to guard your personal information as well.",
    "ADT Identity Protection does just that - it provides a fairly well-established set of features all intended to protect your credit card information, banking details, credit history and other sensitive info. There are a few small “gotchas” along the way - namely, that you can only view a credit score once per year - but the monitoring and theft detection are well worth the more than reasonable low price.",
    "The cost is a reasonable $9.99 per month, when you sign up for a subscription, and you might wonder if there is a catch. That’s about half the cost of some other competing apps, and a full $20 cheaper than the premium plans, for example Norton LifeLock. It is also worth noting that ADT only offers a single plan tier, and neither is there a free tier, nor any mention of a free trial.",
    "ADT Identity Protection includes up to $1 million in identity theft protection insurance. This can cover expenses to recover your identity and direct losses from theft (ADT indicates that the average time an identity theft victim spends on recovery is 104 hours).",
    "Additional provided services cover daily credit monitoring for changes to credit info and new account openings along with monthly credit score assessment, Dark Web notifications to identify your personal info for sale or used for fraud, monitoring for a change of address, and public record monitoring to see if your identity gets used for criminal activity.",
    "Unlike one of our other top picks for low-cost IT theft protection (Complete ID requires a Costco membership but costs only $8.99), ADT Identity Protection doesn’t require that you become an ADT home security customer or sign any long-term contracts. ADT does include a disclaimer about their membership which likely applies to every other identity theft protection app, which is that it may take weeks or even months to enroll. This could mean you are paying for the membership fee while waiting for the registration to complete.",
    "It reads this way: “Credit score tracking, and non-credit monitoring requires an additional enrollment process and ADT will be unable to provide services until you are fully enrolled.” While nobody wants to pay for a service they are not receiving, at least ADT makes this clear before you ever sign up for the service, and it just might be an indicator of their truthfulness in their other disclosures.",
    "ADT Identity Protection won’t win any awards for a novel interface - it is fairly general with a mostly white background and tabs along the left for accessing the main features. That said, it doesn’t look totally dated or too much like a tax program. Interestingly, the app doesn’t really look like the home security interface you might already know. There’s a familiar blue color that matches the ADT logo you may have seen in the yard of people who use the home security system. For the most part, the interface is meant to help you find features quickly without the status updates and wizards that make Norton LifeLock a bit easier to use.",
    "When it comes to the basic security features for identity theft protection, ADT Identity Protection has you covered. There are all of the typical options for credit monitoring and fraud detection. You’ll find all of the entry-level features for detecting activity on a bank account or credit card, and some of the most common “extras” for analyzing and monitoring your passport and other identification materials. Nothing new there, but for $9.99 per month it’s definitely a good place to start.",
    "The only real differences have to do with the number of credit scores you can obtain - it is only one annual report, whereas many of the top identity theft protection apps like Equifax Complete provide a monthly credit score update. ADT Identity Protection does include $1 million of theft protection insurance, which is unusual at this price point. Some other apps tend to offer a low price, but also a lower amount of only $100,000 to $500,000 in identity theft insurance.",
    "ADT Identity Protection doesn’t fall at the bottom of the spectrum of apps available to protect your identity, but it is also not the most comprehensive tool you will find in this segment.",
    "We prefer the interface and extensive features of IdentityForce and Norton LifeLock. However, there is something to be said for choosing an app that provides the basics at a low price. ADT is a well-known security company with the financial resources and staff to support you if there is a problem with identity theft and you don’t know where to turn. In fact, ADT indicates that with a single call you can connect to a fraud resolution expert. While companies like Equifax and Experian offer arguably better apps with more features, they have both experienced well-known data breaches and the premium plans that provide credit scores and insurance cost more.",
    "This all translates to ADT Identity Protection isn’t exactly a no brainer in terms of signing up and experiencing the best identity theft protection around. Where it might meet your needs is in offering the basics at a low price from a company you can trust.",
    "An important point to make here is that there are no strings attached that we know about - if you register for ADT Identity Protection, you can cancel at any time and you won’t have to pay for the home security products. While personal identity protection might be a lead generator for home security products, that doesn’t mean you have to take the bait or feel pressured to use ADT for home security as they are all standalone products.",
    "We've also highlighted the best identity theft protection"
  ],
  "headers": {
    "3": "Plans and pricing",
    "4": "Reimbursement",
    "8": "Interface",
    "9": "Features",
    "11": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "ADT Identity Protection": "https://www.adt.com/identity-theft-protection",
    "Dark Web": "https://www.techradar.com/news/over-15-billion-stolen-credentials-are-for-sale-on-the-dark-web-now",
    "Complete ID": "https://www.techradar.com/reviews/complete-id",
    "ADT home security": "https://www.techradar.com/reviews/adt-security-systems",
    "credit monitoring": "https://www.techradar.com/best/us-credit-monitoring-services",
    "Equifax Complete": "https://www.techradar.com/reviews/equifax-id-patrol-and-equifax-complete",
    "IdentityForce": "https://www.techradar.com/reviews/identityforce",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock",
    "Experian": "https://www.techradar.com/reviews/experian-identityworks",
    "best identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection"
  }
}