{
  "source": "https://www.techradar.com/reviews/dogpile-search-engine",
  "title": "Dogpile search engine review",
  "category": "computing",
  "updated": "2021-09-15T16:30:21Z",
  "author": "lindsay-pietroluongo",
  "summary": "Simple search engine with a complex privacy policy",
  "verdict": "This search results aggregator doesn’t improve much on its competitors, and it collects a whole lot of information about you as you browse.",
  "pros": [
    "Vertical sidebar menus",
    "Extra results per page",
    "Nothing to download or install",
    "Mobile-friendly version"
  ],
  "cons": [
    "Complicated privacy policy",
    "Lack of data protection",
    "Ad-heavy results"
  ],
  "article": [
    "Dogpile is a cutesy, illustrated search engine that compiles results from other search engines, like Google and Yahoo. According to the website, it gathers results from multiple search engines, figures out the ones that are most relevant to your search, and then gets rid of duplicates before showing you your options.",
    "The idea here is that you’ll get more targeted results for your search faster than if you were to use another search engine. The name “dogpile” is actually a rugby term, despite the brand’s dog illustrations (that’s Arfie the mascot, by the way), which refers to players piling on top of one another. The branding here is muddled, as the name is in reference to a sport, but the illustrations and “Go Fetch!” search button are animal-related ... but we can move past that.",
    "The suggested searches – referred to as Favorite Fetches – seem to take into account what people may be interested in right now. For example, in August 2021, the Favorite Fetches included “cheap flights,” “portable air conditioners,” and “rent a car,” seemingly because travel was on a lot of people’s minds. That’s mildly helpful if you’re going to search for one of those things, but the section isn’t altogether necessary. Other search engines, like DuckDuckGo, Google, and Yahoo, don’t have suggested searches like that, likely because they don’t provide that much value to the user.",
    "When it comes to data protection and privacy, Dogpile isn’t the search engine to choose if you prefer anonymity. First, they don’t have their data collection practices spelled out in layman terms in an easily accessible area – you have to dig through their privacy policy to find them, and even when you do, there’s a lot to take in. What they collect via Dogpile and how they use it isn’t entirely clear.",
    "Dogpile falls under the System1 company’s privacy policy, and System1 collects a lot of information about you, including personal identification data (name, street address, etc.) and computer/internet information (browser, equipment, IP address, etc.). This information isn’t just collected when you provide it – it’s also collected automatically when you use System1 services and via System1’s third-party business partners and vendors.",
    "When it comes to your online activity specifically, System1 also uses trackers – cookies and web beacons, to be exact – to collect location, referral, and traffic data from your browsing actions. And while that information isn’t always tied to your personal information, it can be.",
    "Does this mean that the company does whatever it wants with your most personal data? No – they still follow legal requirements about data collection and sharing. But Dogpile isn’t nearly as secure as those browsers and search engines that don’t even know who you are or what you’re doing because they believe in the utmost privacy for its users.",
    "The search bar is as basic as they come, which makes it easy to use, but not particularly appealing. You can designate your search by web, images, videos, news, or shopping – pretty standard for a search engine.",
    "When using Dogpile versus Google to search for the same topic, the results were returned in the same amount of time (seconds, if that long). And while Dogpile’s layout puts the results more front-and-center than Google’s, most of those first results are ads – there are many more ads than Google’s results right at the top, which will make it unappealing to some users.",
    "What’s nice about Dogpile is how the results page is laid out. The search-type options and a list of recent searches are on the left side and suggested searches are in the right sidebar. This means that the main part of the page with the search results fits in a lot more than Google does.",
    "Dogpile is a browser-only tool, so all you have to do is go to dogpile.com to use it. The company's search engine is optimized for mobile so you can use it on an iPhone or Android smartphone as well as on desktop.",
    "Dogpile doesn’t look as nice as any of the leading search engines, and its ad-heavy search results are a turn-off, even next to another ad-heavy search engine like Google. But its main competition comes in the form of solving Dogpile’s biggest problem: privacy. DuckDuckGo is likely Dogpile’s biggest competitor in terms of online safety, as the service has no online tracking whatsoever and offers users an extremely safe browsing experience. It’s not clear if Dogpile is particularly dangerous, but it does seem to track and use a lot of information about you and your online actions, which feels like a very un-modern way to go about it.",
    "While Dogpile’s privacy policy leaves a lot to be desired, it’s not a bad search engine otherwise. You enter a search, and it returns results – it handles the basics as you’d expect.",
    "Its main drawback is that it doesn’t do anything particularly well or unique – and what it does do ranges from a little bit to a lot worse than its competitors. Google’s results are more attractive and less ad-packed; Yahoo’s search interface is more modern-looking and has news headlines instead of those needless suggested searches; DuckDuckGo lets you browse tracker-free, and it has an intuitive mobile app. To put it simply, there’s one big reason not to use Dogpile and no compelling reasons to make it your go-to."
  ],
  "headers": {
    "2": "Features",
    "3": "Privacy",
    "7": "User experience",
    "10": "Platforms",
    "11": "The competition",
    "12": "Final verdict"
  },
  "links": {
    "Dogpile": "https://www.dogpile.com/",
    "privacy policy": "https://system1.com/terms/privacy-policy",
    "dogpile.com": "http://dogpile.com/",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "Android smartphone": "https://www.techradar.com/best/best-android-phones",
    "DuckDuckGo": "https://www.techradar.com/reviews/duckduckgo-search-engine"
  }
}