{
  "source": "https://www.techradar.com/reviews/y-brush",
  "title": "Y-Brush review",
  "category": "fitness",
  "updated": "2021-09-28T13:23:34Z",
  "author": "cat-ellis",
  "summary": "Super-fast brushing, but be prepared to invest extra time flossing",
  "verdict": "The Y-Brush is definitely not just a gimmick, and in the right circumstances it could be extremely useful. Once you've mastered the technique it cleans surprisingly well in just 10 seconds (five for your upper teeth and five for the lower), and it could be a real help if you have limited mobility in your hands. We can also see ourselves carrying one to give our teeth a quick spruce up during the day. It didn't clean as well between teeth as our conventional brush though, which meant spending more time with floss or interdental brushes afterwards. Perhaps not the great time-saver you might be hoping for.",
  "pros": [
    "Extremely fast",
    "Straightforward to use",
    "Convenient for travel"
  ],
  "cons": [
    "Poor cleaning between teeth",
    "Unattractive design",
    "Relatively expensive"
  ],
  "article": [
    "Can the Y-Brush really clean your teeth in just 10 seconds? In our experience, the answer is yes... mostly.",
    "It's hard to deny the novelty of an electric toothbrush that promises to clean all your teeth at once, giving every surface more attention than a conventional brush in 1/120 of the time. However, we weren't awed by the performance.",
    "We wouldn't expect any toothbrush to eliminate the need for floss or interdental brushes, but in our tests using a disclosing tablet, we found that the Y-Brush left noticeably more plaque deposits between our teeth than a standard electric toothbrush. We therefore needed to spend a little longer wielding the floss after brushing, which ate into the time we'd saved. You can't brush your tongue with the Y-Brush either, so you'll need to use a tongue scraper to finish the job.",
    "Mastering the Y-Brush technique takes a little time – you need to chew on the bristles while moving the brush from side to side – but even with a few weeks of practice we just couldn't get the same clean as we could from a regular toothbrush.",
    "It was more effective than we'd expected, and quite fun to use, but the extra work required to tidy things up afterwards meant we didn't save a huge amount of time compared to our regular routine.",
    "The Y-Brush was crowdfunded on Kickstarter in 2018, and its maker began shipping brushes to backers in 2020. It went on general sale later that year, and can be bought directly from Fasteesh in the US, Canada, UK, EU, and Australia.",
    "The Y-Brush starter pack costs £106.99 (about $150 / AU$200), and includes the handle, plus a brush head and charging cable. Accessories (including extra heads, toothpaste applicators and chewable toothpaste tabs) can be bought separately.",
    "That's quite a steep price, particularly for an electric toothbrush without Bluetooth. For context, our top-rated electric toothbrush, the Oral-B iO Series 9, is currently available for $199 / £245 / AU$400, and offers real-time location detection, custom brushing advice, and near-silent brushing.",
    "The Y-Brush consists of a semicircular tray, similar to a gumshield, which is lined with bristles to clean the front, back, and biting surfaces of your teeth. It isn't the only mouthguard-style toothbrush available, but most others use silicone 'bristles' to get the cleaning done.",
    "The Y-Brush uses more conventional nylon bristles, which its creator Fasteesh explains has been clinically proven to do a better job removing plaque than other materials. They're very soft, and we didn't experience any gum irritation.",
    "There are only two head sizes (one for teenagers and adults, and one for children). People's mouths vary hugely in size and shape, but the heads are made from a flexible plastic that can be bent a little to fit different sized arches, and Fasteesh has devised a way of manipulating the brush during cleaning that helps reach around the entire mouth.",
    "This head slots into a wedge-shaped handle, which is equipped with a single large button, surrounded by an LED ring that indicates the power status, charge level, and selected mode.",
    "There's a soft silicone adapter that fits over the end of your toothbrush tube, allowing it to dispense a thin line of paste that will sit neatly in between the brush head's bristles. We appreciate that Y-Brush doesn't force you to use its own proprietary toothpastes with a special dispenser, though it's worth bearing in mind that it works best with a relatively thin paste.",
    "Our review kit also included a wedge-shaped holder that allows the brush head to drain and dry after you've given it a thorough rinse. It's not particularly attractive to have on your bathroom counter (particularly because the brush head is a strange off-white color), and takes up a lot more space than most electric toothbrush charging bases.",
    "Our kit came with a travel case as well, which is a little larger than those for most electric toothbrushes, but is solidly built and has enough space inside for the draining stand, a spare head, and even a mini tube of paste.",
    "To use the Y-Brush, you first need to charge it via the micro-USB port in the side of the handle. It's a shame that there's no adapter for charging it via a bathroom shaver socket, but this only needs to be done approximately every six months (less brushing time means less power consumption) so it's not much of an issue.",
    "Once that's done, push the head onto the handle and attach the special silicone nozzle to your toothpaste tube (it's not suitable for a pump-style container). Rinse the brush head under the tap, then squeeze a thin line of paste all along the bristles.",
    "Now bite down gently on the brush with your upper teeth and you're ready to begin. Press the power button for one second to turn it on, and press it again briefly to change intensity settings. When the vibration tops, turn the brush over so the bristles sit over your lower arch and press the button once more.",
    "At the top setting, the Y-Brush does indeed take just 10 seconds to clean your entire mouth. However, Fasteesh advises starting with the most gentle option for the first few days, gradually moving up as you get used to it.",
    "When using the brush, it soon becomes clear why; rather than simply chomping down and waiting for the bristles to do their work, you need to chew vigorously while moving the brush side-to-side. It's an unusual motion, and you need to do it quickly. The lower intensity settings give you a little longer (15 and 10 seconds for each arch, respectively), so you can get used to the movement before graduating to the fastest setting.",
    "The results were better than we'd expected (it felt very strange to finish brushing after such a short time), but not as good as those we'd get with a standard electric toothbrush. Using a disclosing tablet, we found the Y-Brush cleaned flat surfaces well, but left more deposits of plaque between teeth and around the gums than we'd normally expect.",
    "We'd always expect to need interdental brushes and/or floss after cleaning our teeth, but with the Y-Brush we needed to spend longer tidying things up, which ate into the time we'd saved with the extra quick brushing.",
    "We could definitely see it being useful for freshening up on the move, though. The six-month battery life and carry case mean you can slip it into a bag and use it to give your teeth a (very) quick brush after lunch, or before an event.",
    "The Y-Brush may also be useful for people with limited movement of their hands, which would make manoeuvring a standard toothbrush difficult, but for our own everyday cleaning we'd prefer to stick with a conventional design – particularly considering how much it costs.",
    "At the time of writing, you can pick up the versatile Oral-B Genius X smart toothbrush for the same price, which might take a full two minutes for a complete clean, but has position detection to help you reach every part of your mouth, a pressure sensor to help avoid damage to gums and tooth enamel, and a smartphone app that helps you improve your brushing technique."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Y-Brush price and release date",
    "8": "Y-Brush design",
    "15": "Y-Brush performance",
    "25": "Don't buy it if"
  },
  "links": {
    "Y-Brush": "https://y-brush.com/",
    "electric toothbrush": "https://www.techradar.com/best/electric-toothbrushes",
    "Kickstarter": "https://www.kickstarter.com/projects/1283858434/y-brush-the-10-second-deep-cleaning-toothbrush",
    "directly from Fasteesh": "https://y-brush.com/",
    "Oral-B iO Series 9": "https://www.techradar.com/reviews/oral-b-io-series-9"
  }
}