{
  "source": "https://www.techradar.com/reviews/qwant-search-engine",
  "title": "Qwant search engine review",
  "category": "computing",
  "updated": "2021-07-27T23:11:21Z",
  "author": "michael-bizzaco",
  "summary": "A simplistic search engine with top-shelf privacy features",
  "verdict": "Qwant is a great search engine for those who put their privacy above all else. However, if your prefer the convenience of having your search engine remember your previous searches, then you'll likely be better off looking elsewhere.",
  "pros": [
    "Qwant does its own indexing",
    "No user data is tracked",
    "Multiple languages, display modes and filters",
    "Search history vanishes when you close your browser"
  ],
  "cons": [
    "Need to install a custom cookie to save site preferences",
    "Doesn't remember your previous searches"
  ],
  "article": [
    "We all use search engines. Whether we’re seeking answers to a direct question, scouring the web for the latest products and services, or pushing through tender for a digital transaction, a quality search engine provides an excellent jumping-off point for nearly everything you could possibly want to do online.",
    "While some of the most popular search engines (Google, Bing, Ask.com) offer advanced ways to filter results and customizable workflows/plugins, not every engine has the means to provide users with a completely peace-of-mind browsing experience. In fact, several names in big tech are notorious for selling off user data, leading one to question how secure our personal info and browsing history is when using one of these rich online databases.",
    "If privacy is an utmost concern, an alternative search engine may be your best bet. One such company is Qwant, a French-owned search engine that started in 2013. Prioritizing web safety by keeping away from trackers and cookies, Qwant offers a number of great tools to keep you and your data protected while browsing the web.",
    "Qwant is a completely independent search engine, meaning all of its algorithmic responses to user queries are based on the company’s own indexing, as opposed to results that are dictated by the logged data of all that use the actual search engine.",
    "On the surface, Qwant looks and operates like a number of today’s leading search engines. Initial queries are typed into a main search bar on the landing page that jumps users to the results page.",
    "Results themselves are displayed on the left side of the page, with tabs at the top for filtering, which include Web (default), News, Images, Videos, Maps, Music, and a Settings tab. For younger users, there’s even a Qwant Junior, a desktop and mobile version of the search engine built for the 6-12 age group.",
    "In terms of Qwant customization, you can change languages, choose between light and dark display modes, adjust filters for adult content, and more.",
    "Do keep in mind that if you’d like to save your site preferences, you’ll need to install a custom cookie on your web browser of choice, as Qwant doesn’t use cookies for tracking purposes (more on that below).",
    "When it comes to protecting your user data and browsing history, Qwant is ahead of the game. Unlike traditional search engines that mine existing searches to deliver results, Qwant doesn’t track user data at all, offering totally unbiased results based on the query alone - not your political leanings, heritage, household income, or previous web activity.",
    "If you’re used to Google remembering some of your top searches, you’re not going to find that with Qwant. The moment you’re done using the browser, your search history vanishes. With no cookies to preserve your browsing data, some users may want to opt for a more traditional search engine to recall certain queries. But, for those looking for top-notch privacy, you can’t get much better than Qwant’s security measures.",
    "Want an extra layer of web protection? Add one of the best VPN services on top of your Qwant search for completely confidential web browsing.",
    "We used the Qwant desktop search engine on a 2021 MacBook Pro running MacOS Big Sur version 11.2.3 with Safari as our browser. The search engine itself ran smoothly and delivered relevant links quickly. Similar to competitive browsers, the first block of sites consisted mainly of ads, but after scrolling down a bit, we were able to locate our actual results.",
    "When you scroll all the way to the bottom of the page, you can click Display more results to load another ten or so site links. We also used Qwant mobile on iOS on an iPhone 12. The interface itself is pretty similar to the desktop version with a few exceptions.",
    "For one, Qwant mobile features a separate private browsing mode that you can toggle on/off, as opposed to the desktop version which is built for private browsing from the ground up. This may be due to the fact that Qwant mobile is built on the source code from Mozilla Firefox.",
    "There’s also a convenient tab button that displays how many tabs you have opened at one time in numeric form. When you tap the button, all of your opened tabs are arranged in two rows and columns. Tapping a tab block will open it and swiping one will remove it from the queue.",
    "Qwant is available for MacOS, Linux, and Windows devices. It works on nearly all desktop browsers, including Firefox, Chrome, Safari, Internet Explorer, Edge, Opera, Brave, and others.",
    "You can also download Qwant’s mobile browser for iOS and Android devices from the App Store and the Google Play Store.",
    "Qwant’s main competitors are Google, Bing, DuckDuckGo, and Ecosia. Similar to Qwant, both DuckDuckGo and Ecosia tout a privacy-focused user experience with minimal tracking. Plus, with Ecosia, you’ll be reducing your carbon footprint, as the company uses 80% of its ad-generated revenue to plant trees across the world.",
    "Google and Bing are intuitive search engines that use your previous web searches and other data to curate the best results for your browse. That being said, both companies are known for harvesting user data for third-party means, so they’re not the most secure search engines available.",
    "If privacy is your top priority when using a search engine, Qwant is one of the best platforms out there. While not flashy by any means, glitz and glamor gives way for highly-protective measures around tracking, user data, and an overall mission statement that guarantees safety to its users.",
    "While Qwant may not remember your previous searches, you’ll never log out of your browser feeling like you’ve sold your last searches to an unknown buyer."
  ],
  "headers": {
    "3": "Features",
    "8": "Privacy",
    "11": "User experience",
    "15": "Platforms",
    "17": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "customizable workflows/plugins": "https://www.techradar.com/news/internet/20-search-engines-that-do-something-different-912541",
    "Qwant": "https://www.qwant.com/",
    "Qwant Junior": "https://about.qwant.com/en/junior/",
    "install a custom cookie": "https://help.qwant.com/help/qwant-search/settings/how-are-my-preferences-saved-on-qwant",
    "doesn’t track user data at all": "https://www.qwant.com/?drawer=liberty",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "MacBook Pro": "https://www.techradar.com/news/the-best-cheap-macbook-pro-deals",
    "Mozilla Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1450683739779756000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fqwant%2Fid924470452",
    "Google Play Store": "https://play.google.com/store/apps/details?id=com.qwant.liberty",
    "DuckDuckGo": "https://www.techradar.com/news/duckduckgo-reaches-a-major-milestone-in-its-fight-to-topple-google",
    "Ecosia": "https://www.techradar.com/news/the-eco-friendly-search-engine-that-wants-to-kill-google-with-kindness",
    "Google": "https://www.techradar.com/news/google-reveals-more-on-how-it-helps-deliver-speedy-search-results",
    "Bing": "https://www.techradar.com/news/bing-receives-a-microsoft-flavoured-rebrand"
  }
}