{
  "source": "https://www.techradar.com/reviews/samsung-q70t-qled-tv",
  "title": "Samsung Q70T QLED TV review",
  "category": "televisions",
  "updated": "2021-06-23T10:37:45.713Z",
  "author": "steve-may",
  "summary": "Is the Samsung Q70T the surprise bargain in Samsung’s 2020 QLED range?",
  "verdict": "Offering the same high-end upscaling and image processing as its more expensive stablemates, the Samsung Q70T QLED TV is a tempting buy for next gen gamers and bright-room viewers.",
  "pros": [
    "Razor sharp, rich images",
    "Low image lag",
    "HFR HDMI input"
  ],
  "cons": [
    "Edge-lit LED TV",
    "No Dolby Vision",
    "Limited black level"
  ],
  "article": [
    "The all-new Samsung Q70T QLED TV boasts much of the feature armory found in Samsung’s more expensive QLED 4K screens, but doesn’t come with such a punishing price tag – making it a great buy for folks who can't reasonably spend a couple thousand on the flagship Samsung Q95T.",
    "Despite using an edge-lit design, its imagery is bold and bright, connected platform is top notch and, if you’re planning to buy a PS5 or Xbox Series X, it could well be your cheapest route to high frame rate 4K gameplay.",
    "Gamers get ready, this could be the 2020 QLED TV you've been waiting for. And given that it's a slightly older model at this point, it might make a better fit for your budget.",
    "The Samsung Q70T QLED TV is the lower-to-mid model of Samsung's 2020 QLED TV range that starts with the Samsung Q60T and shoots up to the 8K Q950TS.",
    "This series is available in 55-, 65-, 75- and 85-inch screens sizes called the QE55Q70T, QE65Q70T,QE75Q70T and QE85Q70T respectively in the UK, or the QE55Q70T, QE65Q70T,QE75Q70T and QE85Q70T respectively in the US. The sample sent to TechRadar, the baby of the bunch, sells for around £1,099/$999.",
    "Sitting above it is the Samsung Q80T, with which it shares much, but there are key differences that make the Samsung Q80T a slightly better buy.",
    "The Q70T is cut from similar design cloth as it’s Q80T stablemate: it's all business and little bezel. It sports a micro-thin bezel, here on three sides, the panel balancing stork-like on a central T-stand if you buy a UK model, or on four legs if you buy one in the US.",
    "Rear connectivity comprises four HDMI inputs, of which the third is eARC compatible. The fourth input is 4K/120fps ready, which makes the TV one to shortlist if you want to max out the performance of your PlayStation 5 or Xbox Series X console. The remaining HDMIs are 4K/60fps enabled.",
    "The provision of a 120fps HDMI input is a welcome bonus for this mid-ranger, making the set an obvious contender for next gen gamers.",
    "There’s also Ethernet, two USB ports and an optical digital audio output, as well as Bluetooth and dual band Wi-Fi wireless.",
    "Lastly, the Q70T ships with two remote controls, one a button-heavy wand, the other a simplified, slimmer zapper. The choice of two remote controls is neat, but one's really fancy, the other not so much…",
    "Samsung’s Tizen is a veritable Tardis of a smart connected TV platform. It looks like simplicity itself, but packs in oodles of features.",
    "Overall, it's slick and intuitive, Samsung’s Tizen smart platform doesn’t just cover the streaming basics, it adds some unique features all its own, such as Ambient mode and Multi-View.",
    "There’s no Freeview Play support for UK buyers, although the set comes preloaded with all the key catch-up TV channels. There’s also a full shelf of streaming apps, including Netflix, Amazon Prime Video, Disney Plus, Rakuten TV, Apple TV and YouTube.",
    "Additional niceties include Mobile Multi View with Casting, which allows two screens, the TV image and your smartphone, to be viewed simultaneously, and Samsung’s Ambient mode, which turns the set into a large JPEG gallery, able to blend with your flock wallpaper.",
    "For Samsung mobile phone owners only, there's also Tap View for easy pairing - simply tap the back of your phone against the top or side of the TV, and voila, the two are paired.",
    "The set offers a full chorus of voice support. Keeping Samsung’s Bixby company are Alexa and the Google Assistant – though relevant devices are required.",
    "Sublime and naturalistic HD upscaling, coupled to a high overall picture level, make for a consistently enjoyable viewing experience, even when 4K content isn't available.",
    "Image presets comprise Standard, Dynamic, Natural and Movie, but if you want to get your hands dirty you can always explore the Expert Settings, where you’ll find fun features like adjustable gamma. The set also supports Filmmaker mode, which can be selected in the image mode menu.",
    "The Q70T benefits from the same AI smarts employed by other 2020 QLED 4K models, and it's a genuine strength. Samsung hits the proverbial bullseye when it comes to adding naturalistic detail and nuance to sub-4K images.",
    "So how does upscaling work here? The processor correlates image content with an on-chip database, and intelligently extrapolates faux detail and texture.",
    "When watching HD SDR content, stick with Standard, and maybe Natural for when you want a little more contrast. Studio broadcast, documentaries, cartoons for the former, more cinematic TV shows for the latter. Both Dynamic and Movie play at the opposite ends of the spectrum, never really satisfying either way.",
    "Filmmaker mode effectively turns off all the processing niceties, to emulate a Hollywood mastering monitor. When it comes to HD content, it’s a hair shirt.",
    "Alternatively just leave the set’s onboard AI to make the judgment calls for you.",
    "When it comes to HDR, the Q70T sticks its nose up at Dolby Vision, but happily sniffs around open standard rival HDR10+. Admittedly, there’s little sign that HDR10+ is gaining traction, but that's the HDR card we're dealt with. It means when you dial up the Netflix app on the TV, you’ll be able to watch Umbrella Academy in regulation 4K HDR - although to be fair, it looks very good.",
    "Peak HDR highlights were measured at 600 nits. This is lower compared to higher flying QLEDs, but a good result given the class of set. It’s certainly bright enough to add sparkle and depth to HDR content.",
    "The panel is edge-lit, unlike its QLED superiors which offer a direct full array with local dimming. For improved contrast, there’s a Dual LED arrangement. Combining two different color temperature LED light modules gives better subjective contrast and black level performance. Images have real dynamic snap and a convincing black level, at least when viewed in a room with ambient light.",
    "Off axis viewing does suffer from a collapse in color intensity and contrast, and if you watch in fully dark room conditions, deep blacks and letterbox bars tend to grey out.",
    "The set’s Auto Motion Handling image interpolation is top notch. On Auto pilot, it does a cracking job of enhancing picture sharpness according to content.",
    "If you prefer, the Auto Motion Plus setting can be manually configured, with adjustable blur and judder reduction. Typically we would set blur reduction at 9 or 10, with judder reduction at 3 or 4. There's also an LED clear motion option, but while this succeeds in cleaning up the image, it drops overall brightness significantly.",
    "The opening frenetic car chase of Michael Bay actioner 6 Underground (Netflix) is a real challenge when it comes to preserving clarity on fast moving action, but when this Samsung flexes its interpolation muscles there’s no obvious blur.",
    "A lime green Alfa Romeo Giulia Quadrifoglio looks delicious, as it dodges bright red vans through the winding streets of Florence. The sparks and explosive effects that accompany it enjoy bright HDR grading, while the sunlight streaming through the gaps in the narrow streets remains totally convincing.",
    "The Q70T’s ability to present deep color and dynamics is impressive. Amazon’s The Grand Tour is another challenging showcase for HDR vibrancy. In the season one episode Morroccan Roll, the deep red of Hammond’s Mazda MX-5 exhibits no hint of orange (a failing of LED LCD), spectacular highlights glinting off the bodywork.",
    "Unlike its Q80T cousin, the Q70T doesn’t feature OTS (Object Tracking Sound), and contents itself with two channel stereo, courtesy of down-firing drivers.",
    "They’re perfectly adequate for everyday use, and there’s an Adaptive Sound mode to combat noises in your listening room, but it makes sense to plan for a Dolby Atmos soundbar (Samsung naturally has a range that also support eARC) or accommodating a home cinema system, thereby taking advantage of the set’s Dolby Atmos pass-through functionality.",
    "When it comes to gaming, the screen is a star performer, boasting impressive low latency. You can choose to use the TV with Game Motion Plus engaged, which adds some processing niceties such as blur and judder reduction, or disable everything for the best possible input lag figure.",
    "With Game Motion engaged we measured input lag at 19.8ms, which is certainly good – but in hardcore Game mode, this drops to just 9.1ms (1080/60).",
    "The Q70T’s nearest competitor is the 58-inch Panasonic HX800. Like the Q70T, it’s edge-lit, and comes with Filmmaker mode plus a well-connected smart platform. It also offers cine-fans Dolby Vision support and low input lag.",
    "The Panasonic boasts Local Dimming Intelligent Pro, which mimics the operation of thousands of virtual local dimming zones to improve contrast, but its HDR peak brightness is appreciably less than the Samsung.",
    "The other recommendation for a premium screen at this price point is the Philips 65OLED7654. This high value OLED has universal HDR (Dolby Vision and HDR10+) support, and Ambilight lounge lighting.",
    "It may not be a full fat QLED, but Samsung’s Q70T is a darn good 4K TV all the same. Ideal for light room viewing, it offers superb detail and color performance, has a comprehensive connected platform and boasts excellent image interpolation.",
    "For gamers, the Q70T is a formidable proposition. Not only is image lag low, both with and without processing, there’s a 4K 120fps HDMI just waiting for your next games console. It also confounds when it comes to black level performance and screen uniformity... provided you keep the lights on."
  ],
  "headers": {
    "3": "Price and release date",
    "6": "Design",
    "11": "Smart TV (Tizen)",
    "17": "HD/SDR Performance",
    "24": "4K/HDR Performance",
    "33": "Sound and gaming",
    "37": "Other panels to ponder...",
    "40": "Final verdict"
  },
  "links": {
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Samsung Q95T": "https://www.techradar.com/reviews/samsung-q95t-4k-qled-tv",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Samsung Q80T": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
    "smart platform": "https://www.techradar.com/news/best-tv",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Rakuten TV": "https://www.techradar.com/reviews/rakuten-tv-review",
    "Panasonic HX800": "https://www.techradar.com/reviews/panasonic-hx800-tv"
  }
}