{
  "source": "https://www.techradar.com/reviews/mycle-compact-folding-electric-bike",
  "title": "Mycle Compact Folding Electric Bike review",
  "category": "fitness",
  "updated": "2021-12-02T12:46:31Z",
  "author": "sarah-finley",
  "summary": "A fun electric bike for short commutes, the Mycle Compact is great for zooming up hills",
  "verdict": "The Mycle Compact is the perfect bike if you have a short commute to and from work. Fully customisable, you can mix and match the colours of your perfect bike. With its pedal assist activated, at the touch of a button, you can fly up hills, no matter the gradient. When you’re home the bike folds up in a matter of seconds, ready to be stored away. However, with no suspension you’ll find it to be a bumpier ride on rockier terrains.",
  "pros": [
    "Lightweight",
    "Powerful pedal assist",
    "Customizable"
  ],
  "cons": [
    "Poor suspension",
    "Not comfortable for longer rides"
  ],
  "article": [
    "A smaller and lighter version of Mycle’s Climber and Classic bikes, the Mycle Compact Electric Folding Bike is powerful and an easy to fold commuter bike. It gives you a choice of two battery packs mean you can do 20km or 30km on a single charge (a modest but reasonable range for a bike in its price bracket), and its 250w 36v brushless electric motor means you won’t be left behind when you’re charging up those hills. It's lightweight and easy to fold up for storage, making it convenient for commuting by public transport, and storing in small apartments.",
    "The pedal assist gives you an extra boost for your journey and is activated quickly with just a touch of a button. However, you’ll struggle with longer rides due to the bike's small frame and lack of suspension.",
    "We did, however, appreciate the ability to give the Mycle Compact a personal though via customizable paintwork. You can opt a plain black bike, or mix and match colours such as brown and cream on its leather seat and green or yellow on its frame. It's not going to be the deciding factor when you're choosing a new e-bike, but it's a welcome extra.",
    "The Mycle Compact launched in mid 2021, and starts at £799 (about $1,000 / AU$1,500). That's affordable for any electric bike, let alone a folding one, and explains its limited range.",
    "For context, our current top-rated folding e-bike, the MiRider One, starts at £1,395 (about $2,000 / AU$2,500 and can keep rolling for up to 40 miles (double the Mycle Compact's maximum range).",
    "The Mycle Compact Electric Folding bike is well designed not just for commuting, but for storage too. With a lower and smaller frame than those of the Climber or Classic, and weighing in at just 17.5kg (roughly the same as the MiRider One), it has a unique and attractive look. The adjustable leather saddle slides in easily too, and houses the battery so it’s tucked away out of sight.",
    "The bike's paintwork is customizable, with three color options for the leather seat, and five for the aluminum frame. The green frame and brown leather seat we tested give it a 70s look, and make sure sure it got lots of attention out on the road. The handlebars and tires can also be customized too, with a choice of either black or an earthy walnut brown.",
    "The small tires, standing at just 20 inches, allow the bike to fold down into an impressively small package. However (as is often the case with many folding bikes), they struggled with rougher terrain.",
    "Mycle claims that the Compact can be folded in just 10 seconds, and it's right. Once the seat has been taken out, it’s easy to unlock and swing into place, while the handlebars fold down easily too. The battery can then be charged via the sea every time you store it away.",
    "The LCD display on the right handlebar gives you key riding stats, including speed and distance, and there's USB plug that can charge your phone as you ride, making it easy to use for navigation without draining its battery. We appreciated the inclusion of lights too (which also run from the bike's battery), which make it safer to ride in poor light or bad weather.",
    "The Mycle Compact comes fully built and ready to ride straight out of the box. We simply charged its battery up for a couple of hours, and we were ready to go. Be battery can be charged while still in the bike's seat post, or taken out if you find it more convenient.",
    "Like all e-bikes that are road-legal in the UK and EU, the Mycle Compact's motor can only be engaged while you're pedalling. If you want a proper workout (or to conserve battery power) you can ride this bike like a manual model, changing gears when you tackle hills.",
    "However, with just one push of a button its pedal assist is activated. With five levels it can go from a quick push along a slight gradient, to flying up the steepest of hills with just a couple of turns of the pedals. The bike has a decent motor, and it helped us cut down our short commute time by five minutes, compared to a normal bike. However, it did struggle on rough terrain.",
    "As the tires are smaller and thinner than those of some other electric bikes, and the frame doesn’t have a suspension fork, you feel every pebble or bump as you ride over it, so it’s best to stick to flat and well surfaced roads if possible. We’d also recommend keeping an eye on your pedal assist level - five is perfect for riding up steep hills, but make sure you bring the level back down for a flat road as you’ll accelerate at a much faster pace.",
    "The bike feels very stable as you ride, with the frame, pedals and tires all giving you a secure and enjoyable ride.The saddle isn't just comfortable, but easy to adjust and designed for a range of heights, and the pedals, sturdy while in use, fold away for better storage. However, make sure you clip everything in safely; on our first ride we made the mistake of not clipping the handlebars securely into place and they collapsed as we set off.",
    "We found that our review bike's battery kept running for between 20km and 25km in general use, with the LCD display warning us when it was running low. Overall, the Mycle Compact is a great bike for shorter commutes, helping you cut your journey time and arrive at work feeling fresh.",
    "First reviewed November 2021"
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and release date",
    "5": "Design",
    "10": "Performance",
    "17": "Don't buy it if"
  },
  "links": {
    "Climber": "https://www.mycle.co.uk/products/climber-electric-mountain-bike",
    "Classic": "https://www.mycle.co.uk/products/classic-electric-bike",
    "Mycle Compact Electric Folding Bike": "https://www.mycle.co.uk/products/compact-folding-electric-bike",
    "top-rated folding e-bike": "https://www.techradar.com/best/best-folding-e-bikes",
    "MiRider One": "https://www.techradar.com/reviews/mirider-one"
  }
}