{
  "source": "https://www.techradar.com/reviews/passcamp",
  "title": "PassCamp password manager review",
  "category": "computing",
  "updated": "2021-03-24T18:15:13Z",
  "author": "john-faulds",
  "summary": "Easy-to-use, but feature-light password manager",
  "verdict": "PassCamp is easy to use and there is even a free tier but the lack of features may be a deal breaker for some users.",
  "pros": [
    "Easy to use",
    "Impressive security features"
  ],
  "cons": [
    "Modest feature set"
  ],
  "article": [
    "If you’re not already using a password manager, you probably should be. Not only will it increase your levels of password security, but it will also make it easier to share passwords amongst teams.",
    "PassCamp is a relative newcomer to the market, but since day one its mission has been to top the list of the best password managers based in the cloud.",
    "To find out whether it has succeeded in its goal, in this PassCamp password manager review, we take a close look at its plans and pricing, features, performance, security, and support.",
    "PassCamp comes with three plans: two personal and one business. All plans feature secure sharing, a browser extension, autofill and autosave, and a mobile app.",
    "For personal users, there is the free Basic plan, but you can only store 25 passwords. With the Personal Premium plan, for €2,50/month (approx. $2.97), you can save an unlimited number of passwords and assign tags to them.",
    "Meanwhile, pricing for the Teams plan is €3,50/month (approx. $4.16). It has the same features as the Personal Premium plan with the addition of team management functionality and unlimited guests.",
    "PassCamp is a web app, which means that all your passwords are stored securely in the cloud. It features login autofill so that your usernames and passwords are automatically entered into the login fields when you visit websites for which you’ve created credentials.",
    "For teams, you can share passwords with anyone else who also has a PassCamp account. In addition, you can get notifications of password updates, contact invites, and items that have been shared or unshared. There is a history log too, with which you can keep track of all the changes made to any password or note either by you or contacts with sharing access.",
    "Different roles and permissions can also be assigned to team members. What’s more, you can add people outside your organization as guests, giving them the ability to access passwords without editing or management abilities.",
    "Setting up PassCamp is very simple and only requires a few steps. First, enter your email address. You’ll then be sent an email with a link to verify the address.",
    "Once you’ve completed the verification step, you have to set up a master password for your PassCamp account. You won’t be able to store this password in PassCamp, so it will need to be a strong password, something secure, but also something you can remember. This is how most password managers work.",
    "Once you’ve created the master password, you’ll be logged into your account. While it’s not mandatory to use the service, you should install a browser extension (available for Chrome, Firefox, and Safari) to get the best out of the app. The link to get the extension is available from the dropdown menu under your username after you’ve logged into the dashboard.",
    "When you log into PassCamp you’re presented with a list of all your items, either passwords or notes. Passwords will be added to the list as you start to use PassCamp and sign up for new websites. Or, you can click on the + button in the bottom right corner of the window to add passwords or notes manually.",
    "You can also add new contacts by clicking on the + next to the Contacts heading in the left column and then entering the person’s email address.",
    "You can review activity on your account by clicking on the bell icon in the top right corner of the window, which will show you a list of all the notifications received.",
    "When you sign up for a new website, the PassCamp browser extension will offer to save the details in your account. If you need help creating a strong password, you can also use the extension's built-in password generator which will generate a password for you.",
    "PassCamp has a wide range of security features to ensure your data is kept safe. For starters, your data is encrypted with AES-256 symmetric and RSA-4096 asymmetric encryption, as well as hashing and two-factor authentication.",
    "PassCamp also implements the zero-knowledge protocol, which means only you can access your password information. Even though your data is stored online using cloud storage, with zero-knowledge password proof, not even the PassCamp service providers can access your information.",
    "Centralized blockchain technology is also used to track the history of all passwords and notes so you can always view a log of every change made to the item, whether by you or someone with whom you shared it.",
    "PassCamp offers support in the form of a dedicated email address, a chat widget on the website, and a Help Center with links to frequently asked questions and a YouTube video channel.",
    "The chat widget doesn’t indicate whether it’s 24/7, but as it said “Last active recently” when we tested it and we didn’t get a reply for two hours, it seems like it’s probably not. There’s no telephone number or indication of operating hours.",
    "PassCamp is made by a web development firm with offices in the US, Lithuania, and Sweden, so it’s likely that hours of operation will align with those offices.",
    "PassCamp is a relative newcomer to the password management market and there are many alternatives from which to choose.",
    "Zoho Vault, for example, has plans for teams starting at $1/month per user and includes similar features to PassCamp. However, it also comes with integrations with third-party apps like Gmail, Dropbox, and Office 365.",
    "Bitwarden has free and paid plans for both personal and business users, with the Team plan costing $5/month for five users. Premium plans include reports highlighting weak passwords and unsecured websites, and whether an email address has been compromised in a known data breach.",
    "PassCamp is easy to set up and use and boasts impressive security features. Being completely browser-based means it’s a cross-platform solution. And its sharing features, history log, and the ability to have unlimited guests will be great for teams. But in general, PassCamp doesn’t have as many features as other password managers."
  ],
  "headers": {
    "3": "Plans and pricing",
    "6": "Features and utilities",
    "9": "Setup",
    "12": "Interface and performance",
    "16": "Security",
    "19": "Support",
    "22": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "password manager": "https://www.techradar.com/best/password-manager",
    "email address": "https://www.techradar.com/best/best-email-clients",
    "password generator": "https://www.techradar.com/best/password-generator",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "blockchain technology": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "Zoho Vault": "https://www.techradar.com/reviews/zoho-vault",
    "Bitwarden": "https://www.techradar.com/reviews/bitwarden"
  }
}