{
  "source": "https://www.techradar.com/reviews/ucraft-website-builder",
  "title": "Ucraft website builder review",
  "category": "the-best-website-builder",
  "updated": "2021-07-29T23:45:51Z",
  "author": "chyelle-dvorak",
  "summary": "A website builder with good features and an easy-to-use interface",
  "verdict": "Ucraft includes many valuable features for a website builder - a free option, website domain name, and SSL encryption. The well designed templates and stock images are a bonus, and the drag and drop interface allows you to create a rich full featured site in little time.",
  "pros": [
    "Bundled SSL encryption",
    "Easy to use team management settings",
    "Multilingual options"
  ],
  "cons": [
    "Cannot connect to third party servers"
  ],
  "article": [
    "Ucraft is an excellent web hosting company that makes building your own website a breeze. It’s website is very easy to use - you can look at samples of various templates, check out pricing and upgrades, and easily find inspiration by looking at other successful websites created with Ucraft.",
    "The free version of Ucraft comes with SSL security, unlimited bandwidth, up to 15 pages, and access to Google Analytics. You can use it as long as you like, and still have plenty of template options to choose from. One potential downside is a lack of access to the multilingual feature - you won’t have an option to change your site’s language like you do in the paid versions. You also won’t be able to add team members who are able to edit, manage, or become owners of the website with you. Other missing features include the use of Google and custom fonts, membership functionality, eCommerce, and data management, However, for a free service, Ucraft feels like a suitable introduction and a great stepping stone.",
    "The three paid plans are known as Pro Website, Pro Shop, and Unlimited. Pro Website is worth $10 per month when you pay annually. It’s a marked improvement from the free version, and includes unlimited pages, SEO tools, designer help, blogging tools, the multilingual option, and embedded HTML, CSS, and JS to add more functionality to your website. It also includes an eCommerce tool, allowing you to sell up to 15 different items.",
    "As its name implies, the next plan called ‘Pro Shop,’ introduces many useful features to your online store. You can now sell up to 1,000 products, including digital goods. You’re able to sell on Facebook, Instagram, Amazon and eBay, have over 50 different payment methods, and comes with an Abandoned Cart facility. You can get this plan for $21 per month when paid annually.",
    "Unlimited offers all of Ucraft’s features, including removing any limits on the number of products you can sell, allowing up to 10GB per digital file, and grants you Square POS Integration. Aside from that, nearly all features are the same as for the Pro Shop plan. Unlimited costs $69 per month when paid annually.",
    "You can try any of these plans free for 14 days. Ucraft won’t even ask you for your credit card information, which shows their confidence in their product portfolio.",
    "As soon as you click on ‘Start Trial’, you’re taken to the templates section. They’re broken down by category, such as Business, Personal, Fashion, etc, and you also have a Popular tab, but it’s hard to browse through them all. The lack of a search feature is also disappointing. But the templates themselves look great, and if you’re patient, you can check them all out, and select the one that looks best for your needs.",
    "Although you can connect a domain name to your account, and are even offered a free one (for a year) when you pay for one of the plans, you don’t need one to get started: simply grab a subdomain for free (ie, a. URL that ends with [mydomain].ucraft.site). Finally, once you’ve given your name, email and a password, and your 14-day trial begins.",
    "Ucraft’s interface is easy to navigate and is based around the concept of blocks and elements. The sidebar on the left offers you all the tools you need. Find the one you like, drag it to the main preview section, and you’re done.",
    "All elements are fully customisable, with contextual popup tools appearing as you click on an editable section.",
    "All of Ucraft’s templates offer adaptive settings, so your website automatically adjusts to fit any device, whether it’s seen on a phone, tablet, or desktop.",
    "The drag and drop interface is well implemented, and it’s quite easy to add a new element to your page: as you drag it, areas highlight on your preview section, letting you know where it will be inserted as you release the mouse button (there’s always an undo button if you put it in the wrong place).",
    "The integration with other services like Disqus, Evenbrite, SoundCloud, and Instagram for instance, is also welcome. There’s a language switcher tool, and the ability to embed custom HTML should you need to.",
    "When it comes to images, not only can you add your own, but you also have access to Ucraft’s free stock images, as well as Canva. We couldn’t find any image editing tools however.",
    "Two Ucraft features that particularly stand out are its team management settings and the multilingual option, all accessed via the Dashboard.",
    "The team management settings allows you to add other editors, administrators, or owners to share management of your website.",
    "The multilingual option makes it easy for website visitors to select whichever language they prefer to browse your website in. In the ‘Pro Website’ option, there’s a variety of advanced features, including a ‘checkout cart,’ sharing buttons, a countdown if you want to add one, and discussion forums.",
    "Blogging is known as ‘Articles’ in Ucraft, but the principle is exactly the same: you write, add images, set categories, schedule publication, etc. Everything you’d expect from a standard blogging tool, you can easily find here, including connecting to Disqus to enable comments on each piece.",
    "Working with the back end of your online store is done via the Dashboard. From there you can organise your settings and deal with your products. The bulk import feature for instance, is excellent, similar to other competent online store builders we’ve seen in the past. You’re able to use CSV, XCart and LiteCommerce files, have the ability to reorder the designated columns, and even remove them altogether, leading to great flexibility when migrating data over.",
    "You can also add products one at a time should you prefer. The interface is very easy to understand. We particularly liked the bulk update option, allowing you to make alterations to all products in one go, which can be a great time saver.",
    "When it comes to getting paid, the default payment gateway options are Stripe and PayPal, but you have the ability to connect to others should you prefer. There’s also a well stocked Apps section, which allows you to add additional functionality to your site, such as live chats, promotions, and specific analytics, to name but a few.",
    "Ucraft is easy-to-use, provides a vast number of well-designed templates, and includes a free version with no hidden fees, meaning that whether you’re new to building a website or already have experience, Ucraft has a variety of plans to fit your needs.",
    "You also have access to a large library of stock images and icons, along with examples of successful websites built on Ucraft for inspiration. The service is incredibly easy to navigate and the drag-and-drop features make building your site fast. The free option is a very welcome feature, and Ucraft’s 14-day free trial on all its plans is a great way to find out if this is the right website builder for you.",
    "You might also want to check out more of our website hosting buying guides:"
  ],
  "headers": {
    "1": "Plans and pricing",
    "6": "Getting started",
    "8": "Interface",
    "11": "Features",
    "17": "Blogging",
    "18": "Ecommerce",
    "21": "Final verdict"
  },
  "links": {
    "Ucraft": "https://www.ucraft.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "building your own website": "https://www.techradar.com/news/the-best-website-builder",
    "free version": "https://www.ucraft.com/pricing",
    "SSL security": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Google Analytics": "https://www.techradar.com/reviews/google-seo-tools",
    "Pro Website": "https://www.ucraft.com/pricing",
    "SEO tools": "https://www.techradar.com/news/best-seo-tool",
    "Pro Shop": "https://www.ucraft.com/pricing",
    "Unlimited": "https://www.ucraft.com/pricing",
    "Square POS": "https://www.techradar.com/reviews/square-pos-system-review",
    "free stock images": "https://www.techradar.com/best/free-stock-photos",
    "online store": "https://www.techradar.com/how-to/start-an-online-store-from-scratch-and-drive-sales",
    "payment gateway": "https://www.techradar.com/best/best-payment-gateways"
  }
}