{
  "source": "https://www.techradar.com/reviews/islabikes-ejanis",
  "title": "Islabikes eJanis review",
  "category": "fitness",
  "updated": "2021-04-07T10:41:50Z",
  "author": "cat-ellis",
  "summary": "Think cycling's not for you? This e-bike might make you reconsider",
  "verdict": "The Islabikes eJanis is a thoughtfully designed electric bike for cyclists who are no longer as limber as they once were, are recovering from injury, or just like the idea of a comfortable ride that won't leave them sweaty and rumpled. Smart features like easy-reach brakes and gears, plus smooth power assistance, make it a pleasure to ride. It's just a shame that the Ebikemotion app is still a work in progress.",
  "pros": [
    "Comfortable step-through frame",
    "Short-reach brakes; grip-shift gears",
    "Customizable power resistance"
  ],
  "cons": [
    "No built-in lights",
    "Somewhat short range"
  ],
  "article": [
    "Islabikes names its models after 60s rock legends, which gives you some idea of its target market. The Islabikes eJanis (as in Joplin) is designed to make cycling fun for anyone who might usually dismiss it as impractical. It's a noble goal, and one it achieves thanks to thoughtful touches both large and small.",
    "One of the joys of electric bikes is that they make cycling more accessible and practical. Whether you're no longer as fit and flexible as you once were (due to age, injury or illness), want to keep up with your kids on long rides, or just don't want to arrive at the office sweaty and out of breath, an electric bike opens up new possibilities by taking on some of the load.",
    "We're also starting to see more adopting a step-through frame that makes them practical for riders who find the more common step-over design hard to use, or who want to cycle in their everyday clothes. They also make it easier to hop off quickly when necessary.",
    "The eJanis is one such bike – but the accessibility options don't stop there. It's also packed with subtle features like light-touch grip-shift gears and a simple touch-operated control unit for the motor.",
    "The hardware is excellent - it's just a shame that the Ebikemotion smartphone app isn't quite as polished, and requires an annual subscription fee to download maps.",
    "The Islabikes eJanis was released in July 2020, and is currently only available for delivery in the UK direct from Islabikes.",
    "It retails at £2,699.99 (about $3,700 / AU$5,000). This puts it towards the more affordable end of the spectrum – in our experience it's hard to find a good quality e-bike for much below £2,000 / $3,000 / AU$4,000, and you can easily spend several times that figure for a high-performance model.",
    "Accessories like a handlebar-mounted bottle cage, propstand and luggage rack are available separately.",
    "Despite its name, which might suggest it's aimed specifically at women, the eJanis is a unisex bike, with a gray color scheme and sizes ranging from XS to L. It's light too thanks to its aluminum build – at 13.5kg, it's one of the lightest bikes we've tested to date.",
    "The bike is supplied almost completely assembled, with detailed instructions so even a complete beginner can install the quick-release front wheel and pedals, then adjust the handlebars and seat height. There's even a set of Allen keys included for the job.",
    "Its 250Wh battery is tucked into the down tube, neatly concealing the fact that this is an e-bike, and the Mahle Ebikemotion rear hub motor is capable of top speeds of 25km/h.",
    "Whereas cheaper e-bikes often use V-brakes, the eJanis is equipped with SRAM DB Level TL hydraulic disc brakes – something we always appreciate on an e-bike due to the greater forces involved. It also has short-reach brake levers, plus light-touch grip shift gears. If you have restricted movement in your hands, thoughtful touches like these could make all the difference.",
    "Similarly, the motor is operated using a small control unit beside the left bar grip. This has just three buttons; power, up, and down. It's simple to use, and allows you to tweak the power assistance level with just a gentle tap of your thumb.",
    "Not all e-bikes have controls within such easy reach, and while it doesn't look as neat as a discreet single button on the top tube, it's much more convenient, which is important for a bike built with accessibility in mind.",
    "We would have liked to see built-in lights like those on the Cowboy 3, plus a luggage rack as standard, though we also appreciate that this would have added to the price and thereby made the bike less accessible.",
    "The eJanis is a pleasure to ride, with the power assistance kicking in smoothly as you start to pedal, and switching smoothly with a gentle thumb-tap. The eJanis's motor isn't as quiet as that of the Cowboy 3, but with its more conventional design, it's likely to attract less attention.",
    "Unlike most e-bikes we've tested, the eJanis lends itself to a more upright sitting position, which will appeal to both city commuters in traffic and anyone wanting to keep weight off their arms.",
    "It has a typical range of 40-50 miles on a single charge, so for longer rides you'll want to plan your route in advance and conserve power on flat sections to ensure you have enough juice to make it all the way home.",
    "Like our top-rated e-bike, the Ribble Hybrid AL e, the Islabikes eJanis uses the Mahle Ebikemotion drive system and smartphone app, which allows you to tweak the bike's settings and turns your phone into a trip computer.",
    "Although currently labelled 'early access' on Google Play, the app is in fact complete, and connecting your phone to the bike is straightforward. Create a profile, then power the eJanis on and select the option to find your bike. Islabikes isn't one of the brands listed, but tap the 'EBM Compatible' option and the app will find and connect to the bike in seconds.",
    "With your phone mounted on the bike (mounts are sold separately) you'll be able to see your current location, assist level, battery level, and speed. The app also offers a navigation tool, which can calculate the fastest, quietest, or shortest route to your destination and provide turn-by-turn directions.",
    "It's a great idea in theory, but to get the most out of it you’ll need to subscribe to a map pack for £3.99 (about $5, AU$7) per month. That fee gives you maps for your whole continent, but will add up over the course of the year, so you might prefer to stick with Google Maps.",
    "We do, however, appreciate the activity-tracking function, which allows you to record your trips (complete with the road quality, which is handy for future journeys). The app can also connect to a heart-rate monitor and upload data to Strava, though these features aren't as likely to be useful to the typical eJanis rider.",
    "It's worth nothing that the eJanis has three power settings, which are mapped to ensure the bike moves off as smoothly as possible. All of these power levels will show as '100%' within the Ebikemotion app, but Islabikes explained to us that this means 100% of the current map, not 100% of the motor's total capacity."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "8": "Design",
    "15": "Performance",
    "24": "Don't buy it if"
  },
  "links": {
    "Islabikes eJanis": "https://www.islabikes.co.uk/products/adult-electric-bike-ejanis",
    "electric bikes": "https://www.techradar.com/best/electric-bike",
    "direct from Islabikes": "https://www.islabikes.co.uk/products/adult-electric-bike-ejanis",
    "Mahle Ebikemotion": "https://www.ebikemotion.com/web/",
    "Cowboy 3": "https://www.techradar.com/reviews/cowboy-3",
    "Ribble Hybrid AL e": "https://www.techradar.com/reviews/ribble-hybrid-al-e"
  }
}