{
  "source": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
  "title": "AMD Radeon RX 6800 review",
  "category": "computing",
  "updated": "2021-03-16T17:32:26Z",
  "author": "bill-thomas",
  "summary": "Getting there",
  "verdict": "The AMD Radeon RX 6800 marks AMD's return to the high-end graphics card market, delivering 4K gaming performance on par with the RTX 3070. However, the lack of features, especially those around upscaling, means that ray tracing is a wash at 4K.",
  "pros": [
    "Excellent performance",
    "Finally, AMD ray tracing",
    "Low power consumption",
    "Effective cooler"
  ],
  "cons": [
    "Divisive design",
    "Ray tracing performance behind competition",
    "More expensive than RTX 3070"
  ],
  "article": [
    "The AMD Radeon RX 6800 is a welcome addition to the AMD graphics cards roster, alongside the AMD Radeon RX 6800 XT. It’s another viable alternative to Nvidia’s higher end graphics cards in the enthusiast space, which Team Green has dominated for years.",
    "Before the AMD Radeon RX 6800’s arrival, GPUs like the Radeon VII, Radeon RX 5700 XT, and the RX 5700 couldn’t quite hold a candle to Nvidia’s high-performance range. With it on the shelves, AMD can now properly compete with (or even outperform) such cards as the RTX 3070 as well as allow its fans to enjoy the advantages of ray tracing.",
    "We only wish AMD had kept its usual price advantage. Unfortunately, AMD is charging $80 more at $579 (likely around £579, AU$800) for the AMD Radeon RX 6800. Next to the RTX 3070's $499 (£469, AU$809), it costs 10% more for about 5-15% more performance. It’s still an affordable high-end offering and a promising sign of things to come from AMD.",
    "The AMD Radeon RX 6800 is available today, starting at $549 $579 (likely around £579, AU$800) for AMD's reference board, and going up from there for aftermarket board partner designs. At this price, its closest competition is the Nvidia GeForce RTX 3070, which has half the VRAM but costs less at $499 (£469, AU$809).",
    "The next step up from here, assuming you're sticking with Team Red, is the AMD Radeon RX 6800 XT, which will set you back $649 (likely around £649, AU$960), which is going after the Nvidia GeForce RTX 3080 at the same price.",
    "Both of these graphics cards are more than capable of delivering excellent 4K gaming performance, however, and we expect that performance to get even better over time as drivers start to mature. However, because the AMD Radeon RX 6800 XT is so much more expensive than the RX 6800, the lower-end graphics card is by far the better purchase for the vast majority of people.",
    "The AMD Radeon RX 6800 is based on AMD's RDNA 2 graphics architecture, which is conveniently the same graphics tech behind both the PS5 and the Xbox Series X. Practically speaking, this means little to nothing right now, but has the potential to impact PC game optimization over the next generation of the best PC games.",
    "However, it's important to keep in mind that both the PS4 and Xbox One also used AMD graphics, and it didn't drastically effect PC game optimization over the last generation, so this could end up being a moot point – only time will tell on this, though.",
    "There are two massive differences from the first generation of RDNA, even though they were both built using the same 7nm (nanometer) manufacturing process.",
    "The first of these is the Infinity Cache. Essentially, this is is a global cache for the GPU which boosts bandwidth for the video memory (VRAM). This makes the GDDR6 memory on the 256-bit bus even more efficient than GDDR6X, while consuming less power. This results in a theoretical 2.4x bandwidth per watt increase over having straight GDDR6 on a 256-bit bus.",
    "Then, of course, AMD has included Ray Accelerators – one in each of the 60 Compute Units. In terms of raw ray tracing performance, in Metro Exodus with Ray Tracing on and DLSS off (Deep Learning Super Sampling) – a technology exclusive to Nvidia, which AMD doesn't have a real answer for – the Radeon RX 6800 is significantly slower than RTX 3070. And the gap widens significantly with DLSS on.",
    "Beyond that, the layout is very similar. Each Compute Unit has 64 Stream Processors, for a grand total of 3,840 on the Radeon RX 6800. AMD has been hard at work boosting efficiency, though, and has managed to boost frequency by a massive amount.",
    "The way AMD specs out frequency on its graphics cards is a tad confusing, but it's actually pretty helpful. When you look at the spec sheet, you'll see two frequencies laid out – the Game Clock and the Boost Clock. The Boost Clock is only the peak frequency – you'll only see this frequency during short bursty workloads. The Game Clock is about where AMD expects the graphics card to sit most of the time.",
    "The AMD Radeon RX 6800 has a Game Clock of 1,815MHz and a Boost Clock of up to 2,105MHz. During our testing, however, we saw clock speeds over the Boost Clock, and they were sustained there. This might be down to the pre-release driver we reviewed the graphics card on, however.",
    "It's testament to the optimizations AMD made that it was able to double the size of the GPU – from 251mm² and 10.3 billion transistors on the 5700 XT to 519mm² and 26.8 billion transistors on the RX 6800 – and boost clock speeds by so much, while the board power only increased from 225W to 250W. And, throughout our testing, ASIC power consumption peaked at 213W, which suggests that there is more room for performance through later driver updates and aftermarket board designs.",
    "Thanks to the new cooler design, however, temperatures are lower for the most part. Throughout our testing, temperatures peaked at 75C, with the GPU hotspot temp reaching just 88C. When you're watching your temperatures, it's important to note that the former is what you should be concerned with. AMD has told us that these new GPUs are expected to see the hotspot temp hit up to 110C during normal gaming usage, and that it's within spec and won't cause problems. If you see that number, don't worry, your graphics card isn't about to melt.",
    "AMD is also offering two ways to boost the performance of its Ryzen 6000-class processors: Rage Mode and Smart Access Memory. The former is inexplicably not available on the Radeon RX 6800, but it boosts power limits and the game clock, to give a slight edge in performance.",
    "When you go to enable this, a window pops up warning you that messing with GPU tuners will void your warranty, but don't worry: as long as you don't do manual overclocking and stick with Rage Mode, AMD has assured us that Rage Mode won't void warranty.",
    "For folks that have an AMD Ryzen 5000 processor, a 500-series AMD motherboard and either the Radeon RX 6800 or RX 6800 XT, Smart Access Memory gives your CPU full access to GPU memory, rather than just pre-mapped memory. This can boost performance up to 10% in select titles. This is an exciting feature, but it's a bit of a pain to enable.",
    "You're going to have to update your BIOS, then go in there and disable CSM – which means you might have to reinstall Windows 10 to even use it if you're not using a UEFI-compatible installation. Then you're going to have to go into the advanced tab of your BIOS and enable both Above 4G Decoding and Re-Size BAR Support. This is a feature that we only advise advanced users even try to mess with, so it's something we didn't test in-depth for this review. We will be doing a full deep-dive on the feature at a later date.",
    "Luckily, even without SAM enabled, the Radeon RX 6800 provides an excellent level of performance, so you're really not missing out on much by not enabling it. But, for those that want to take advantage of the advanced feature – it's there.",
    "Beyond that, AMD's excellent FidelityFX suite of features is still here, along with a ton of quality-of-life options, like Radeon Boost, which lowers resolution while moving, boosting framerates while you're moving too quickly to notice the reduction in image quality.",
    "The one feature that we missed the most, especially with the introduction of ray tracing this time around, is an equivalent to Nvidia's DLSS (Deep Learning Super Sampling). When you're playing games with ray tracing enabled, this tech is extremely useful, as it helps make up the massive performance differential that ray tracing brings. AMD has told us it's working on an alternative, hopefully it'll show up in time for RDNA 3.",
    "The absence of Tensor Cores does more than just leave out DLSS, though. You also don't get an alternative to Nvidia Broadcast. And, because we're all working from home due to the ongoing pandemic, is an extremely useful technology, especially if you're working from a noisy or messy environment.",
    "AMD has finally abandoned the blower that plagued the Reference designs of the RX 5700 XT and RX 5700, opting instead for a beefy triple-fan shroud design. This is not only way more efficient at keeping the graphics card cool, but is also much quieter under load.",
    "For output, we have two DisplayPort, one HDMI 2.1 and one USB-C. This covers basically every type of display output you could need in 2020, and props to AMD for not cutting out USB-C like Nvidia inexplicably did with its Ampere cards.",
    "For power, you have two 8-pin connectors, which is good news for anyone that lamented Team Green's move to a 12-pin connector with an adaptor.",
    "Aesthetically, however, people are probably going to be divided. AMD's board design this time around has a very 2012 gaming aesthetic. The side of the shroud, or what you'll see when the GPU is actually plugged into your system is all black with red trim and lettering. And, of course the Radeon logo lights up bright red.",
    "On the front of the card, the black trim is interrupted by a silver stripe surrounding the three fans – each of which has a 'R' logo, for Radeon. On the back, the silver stripe is bigger, and you can also see the bottom of the GPU itself. This isn't something we generally like on graphics card, as it's easier to damage, even if this way is marginally better for cooling.",
    "When AMD announced that the Radeon RX 6800 would be more expensive than the RTX 3070, we thought it was a bold strategy, and weren't sure it would work out. However, when it comes to raw performance, it seems like AMD has earned that price increase – for the most part.",
    "When it comes to traditional rasterization performance, the AMD Radeon RX 6800 beats the GeForce RTX 3070 across our entire testing suite, and by a pretty significant amount. In the 3DMark Fire Strike Ultra test, which measures 4K performance with DirectX 11, the Radeon RX 6800 beats the 3070 by a whopping 24%.",
    "In games, this gap naturally depends on the title. In Metro Exodus at 4K Ultra settings with RT off, the RX 6800 is just 3 fps faster than the RTX 3070, which a measly 6% performance difference. However, that difference widens significantly in DirectX 11 games, as that Fire Strike Ultra test hints at.",
    "The Radeon RX 6800 is 27% faster in Far Cry 5 and 25% faster in Assassin's Creed Odyssey. These are both games that are optimized for AMD hardware, of course, but the numbers are still impressive.",
    "That performance lead is much lower in many of the other games in our testing suite, however. In Red Dead Redemption 2, for instance, the RX 6800 is just 10% faster than the RTX 3070. And, in Final Fantasy XV, it's just 5% faster.",
    "The story completely changes once ray tracing enters the equation. Nvidia still has the upper hand here, and both in the 3DMark Port Royal test and in Metro Exodus with RT enabled, Nvidia has a significant advantage. In Port Royal, the Nvidia GeForce RTX 3070 beats the Radeon RX 6800 by 6%, and in Metro Exodus at 4K with RT on and DLSS off, the difference is 9% in favor of Team Green.",
    "For folks that just want something that delivers higher framerates in traditional gaming workloads, the AMD Radeon RX 6800 is absolutely better than the Nvidia GeForce RTX 3070, there's no argument there.",
    "However, if you were waiting for an AMD graphics card that can do ray tracing just as well, or even better than Nvidia, Team Red just isn't there yet. Ray tracing is there, and it does work, but without DLSS and the driver maturation that RTX cards have seen, you're going to be getting a better ray tracing experience elsewhere. It's still possible that AMD will be able to hammer out better ray tracing performance as the graphics card ages, though.",
    "One thing is certain, though: with Big Navi, AMD is back in the high-end GPU game. It hasn't toppled Nvidia in the same way it has with Intel yet, but we could definitely see Team Red continue in that direction over the next couple of years."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Features and chipset",
    "24": "Design",
    "29": "Performance",
    "38": "Don't buy it if..."
  },
  "links": {
    "AMD graphics cards": "https://www.techradar.com/news/amd-graphics-cards",
    "AMD Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "Radeon VII": "https://www.techradar.com/reviews/amd-radeon-vii",
    "Radeon RX 5700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5700-xt",
    "RX 5700": "https://www.techradar.com/reviews/amd-radeon-rx-5700",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "AMD's RDNA 2": "https://www.techradar.com/news/amd-big-navi",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "PS4": "https://www.techradar.com/reviews/ps4-pro",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x"
  }
}