{
  "source": "https://www.techradar.com/reviews/opera-browser",
  "title": "Opera browser review",
  "category": "computing",
  "updated": "2021-07-05T10:57:53.706Z",
  "author": "michael-bizzaco",
  "summary": "Clever social and workflow features compete with privacy concerns",
  "verdict": "Opera is a sleek browser alternative, but despite the built-in VPN still comes with a few security and privacy concerns.",
  "pros": [
    "Built-in VPN",
    "Social and messaging app integration",
    "Built on Chromium",
    "Integrated ad blocker",
    "Send encrypted content"
  ],
  "cons": [
    "Security and privacy concerns",
    "Limited encryption"
  ],
  "article": [
    "Choosing the best browser can make all the difference when it comes to your workflow, customizations, and user data. While it may be tempting to fire up whatever onboard browser comes packaged with your desktop or mobile device, we urge you to take a step outside of your system’s defaults to experience the web in bigger and better ways.",
    "One outlier that doesn’t get the attention it deserves these days is Opera, a Norwegian browser launched all the way back in 1995.",
    "Opera offers a feature-laden interface and is one of the only browsers with a built-in VPN (virtual private network). In this breakdown, we’ll be examining Opera’s many features, privacy functions, user experience, and more.",
    "Opera has been operating on Google’s open-source Chromium (the building blocks of Chrome) since 2013. That means you can install any web extension from Google’s massive library for a completely customized experience.",
    "What you won’t need an extension for is social and messaging app integration, one of Opera’s richest and best-looking features. Your favorite platforms are accessible right in your browser and smoothly pop in and out as you wish.",
    "With Opera, you can also:",
    "Opera is one of the only browsers with an onboard VPN, allowing you to mask your device’s IP address, and you can toggle the VPN on and off as you please.",
    "However, Opera’s VPN only allows you to choose between the Americas, Asia, and Europe for IP masking. That seriously limits you when it comes to accessing services like Netflix anywhere in the world – with most VPNs, you can choose your desired country. Also, it lacks encryption (other than HTTPS) and a tunneling protocol, leaving a lot to be desired in terms of privacy.",
    "On the plus side, Opera offers an assortment of privacy customizations that are standard with most web browsers. These include options to clear your browsing history and block cookies, as well as permissions settings that will prompt Opera to ask for your go-ahead with location sharing and camera/microphone functions. In private browsing mode, once you close out of the window, your history, cookies, and form data are automatically deleted.",
    "Some find it troubling that in 2016, Opera was sold to a Chinese consortium. The country’s tech companies have been in the news in the past for controversial privacy policy and data sharing issues. That said, Opera does claim to allow you to disable certain data collection processes in settings.",
    "We used the Opera desktop browser on a 2020 MacBook Pro running MacOS Big Sur version 11.2.3. We found it fast and responsive, and we especially liked the small, non-invasive list of icons in the left sidebar.",
    "When you click one – like Facebook Messenger or the bookmarks list – there’s a slide-out that lays over whatever page you’re on. Clicking it again makes it disappear, and nothing happens to the rest of the window to interrupt what you were doing.",
    "We used Opera mobile on iOS on an iPhone 12, and the browser took less than a minute to set up. We love the option for a fast-action button, which you hard-press to show options.",
    "On both the desktop and mobile versions, there’s a right-pointing arrow that indicates the My Flow sharing feature and hub. This button lets you share content from your phone to your computer and vice versa. A neat component of My Flow is that you can add a note to yourself, which will show up on both your mobile device and your computer’s browser.",
    "Opera is available for MacOS, Linux, and Windows devices. It works on desktop versions of MacOS X 10.11 and later, Ubuntu 16.04 and later, and Windows 7 and later.",
    "You can download Opera’s mobile browser for Android and Chromebook from the Google Play Store and for iOS from the App Store.",
    "Opera’s main competitors are Apple Safari, Google Chrome, Microsoft Edge, and Mozilla Firefox.",
    "Because it’s built on Chromium, Opera looks and feels a lot like Chrome, a leader in the web browser marketplace. While Mozilla Firefox is renowned for its privacy features, we found Opera to look and feel more streamlined and modern.",
    "Compared to Safari, Opera definitely comes out on top in terms of the vast array of extensions that can be added from the Chrome library. Microsoft Edge is geared more toward professionals who need to use it for meetings and productivity.",
    "When it comes to customization and social media integration, Opera stands above its competition, and some users will choose the browser for those features alone. Plus, the My Flow feature is especially useful if you’re someone who jumps between your mobile and desktop browser frequently and you need everything to be available in one place no matter what device you’re on.",
    "While some find the company’s 2016 acquisition a security concern, it’s no mystery that most browsers and VPN products store personal data and can do with it what they please (under most circumstances). If privacy is your priority or you have sensitive data that you need to keep safe, Opera probably isn’t the best choice. Otherwise, though, there are a number of tools and settings that will keep you reasonably protected while browsing with Opera."
  ],
  "headers": {
    "3": "Features",
    "6": "Privacy",
    "10": "User experience",
    "14": "Platforms",
    "16": "Competition",
    "19": "Final verdict"
  },
  "links": {
    "best browser": "https://www.techradar.com/best/browser",
    "Opera": "https://www.opera.com/",
    "VPN (virtual private network)": "https://www.techradar.com/vpn/best-vpn",
    "web extension from Google’s massive library": "https://www.techradar.com/news/the-best-google-chrome-extensions",
    "IP address": "https://www.techradar.com/best/best-ip-address-tools",
    "privacy": "https://www.techradar.com/best/anonymous-browsing",
    "privacy policy": "https://www.techradar.com/news/some-of-chinas-biggest-technology-companies-are-trying-to-bypass-apples-new-privacy-rules",
    "data sharing": "https://www.techradar.com/news/battlegrounds-mobile-indias-data-sharing-with-china-controversy-krafton-responds",
    "MacBook Pro": "https://www.techradar.com/news/the-best-cheap-macbook-pro-deals",
    "Google Play Store": "https://play.google.com/store/apps/details?id=com.opera.browser&referrer=af_tranid%3DQeseI2W7HS8apb9KO0vhiA%26pid%3Doperacom%26c%3Dwebpage%26af_web_id%3D2f2cabc2-6754-4bf6-a486-40ee67e00e8e-p%26utm_source%3Doperacom%26utm_campaign%3Dwebpage",
    "App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2374968989949544000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fid1411869974%3Fmt%3D8",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools"
  }
}