{
  "source": "https://www.techradar.com/reviews/ncr-silver-point-of-sale-pos-review",
  "title": "NCR Silver point of sale (POS) review",
  "category": "computing",
  "updated": "2021-07-29T15:38:27Z",
  "author": "anthony-spadafora",
  "summary": "NCR Silver is a cloud-based POS system from the world’s first point-of-sale company.",
  "verdict": "NCR Silver POS offers a wide selection of hardware and software, but going the ’a la carte’ route can get expensive fast.",
  "pros": [
    "Sleek and modern user interface",
    "Wide range of products and features",
    "Excellent customer support",
    "No flat fees - pay for what you use",
    "Demo available"
  ],
  "cons": [
    "No credit card processing",
    "Unspecified pricing structure",
    "A la carte hardware option can be expensive"
  ],
  "article": [
    "NCR Silver POS is an iPad-based POS system from the NCR Corporation (originally National Cash Register) that builds on 135 years of experience in the industry.",
    "The company is much larger than many of the start-ups in the POS and mobile payments space, but this has its benefits.",
    "NCR has developed a number of other POS systems, including Aloha POS for restaurants and Counterpoint for retailers, and the firm has certainly leveraged this experience while developing NCR Silver.",
    "NCR Silver POS sets itself apart from the competition by offering full 24/7 live support as well as a wide range of software and hardware bundles. If the company’s hardware bundles don’t necessarily work for your business, you’re free to assemble your own solution by combining its a la carte hardware options into a package that fits your needs.",
    "But the question remains, is NCR Silver POS the right POS system choice for your business? Let’s take a closer look at NCR Silver’s hardware, software and customer support to find out if this solution is still the gold standard when it comes to point of sale.",
    "NCR Silver’s approaching to pricing has changed in recent years. Previously, customers had two options to choose from: NCR Silver Basic or NCR Silver Pro.",
    "Now, NCR's approach to pricing is to assess costs based on bespoke business needs. Speaking to their sales department, we were advised that their pricing is entirely dependent on the business size, and POS software or hardware required.",
    "There's no-one size fits all, flat, transparent pricing structure with NCR.",
    "This has its perks, however. If you're a mom-and-pop operation you'll likely save with NCR Silver POS, where you might have had to pay for features you don't need with other POS companies.",
    "However, NCR Silver Pro still exists in some capacity. It's now been split into NCR Silver Pro Table Service for Restaurants and Bars and NCR Silver Pro for Fast Casual and Quick Service Restaurants. Each NCR Silver Pro plan, starts at $149 per month.",
    "On top of these features, NCR Silver also offer these add-ons:",
    "✔ Inventory management",
    "✔ Gift cards",
    "✔ Employee management",
    "✔ Kitchen display",
    "✔ Advanced reporting",
    "✔ Online ordering and contactless payments",
    "To get a realistic quote and find out how much you could save, contact NCR Silver POS directly.",
    "At the other end of the spectrum, NCR Silver also has a $39 mobile card reader called Ring Up designed for micro-businesses just looking to accept payments. The service costs $14 per month plus 2.7% per each swipe or dip.",
    "There are cheaper mobile card payment readers out there, but if you want to see what NCR Silver has to offer without a big commitment, this is your best choice.",
    "If you decide to use your own hardware with NCR Silver, getting started is as easy as downloading the company’s Point-of-Sale app from the App Store. Once you complete your registration with NCR Silver, the app will be activated and you’ll be ready to start putting your back office together.",
    "If you’d prefer to speed up the process, the company launched a new service called Silver Concierge back in 2015 that includes back office setup, monthly menu maintenance, hardware support and more.",
    "Much like a real concierge, the service provides improved customer support with the ability to call, email, instant message or text 24/7, 365 days a year. The best part of Silver Concierge is the price: it’s free and included in your NCR Silver subscription.",
    "Getting NCR Silver up and running is a fairly straightforward process, and knowing that help is there if you need it can make all the difference if you run into any difficulties.",
    "NCR Silver offers a strong selection of features, as well as some that typically cost extra, such as the email marketing and loyalty tool add-ons listed above.",
    "The company regularly updates its apps and platform, and these updates are included in your subscription. So, you’ll always be using the most current version of its software.",
    "When it comes to inventory management, NCR Silver provides the tools for the job, and its software can track inventory and even send you alerts when your stock is running low.",
    "The restaurant-focused NCR Silver Pro goes a step further by allowing you to track raw ingredients. You will have to create your purchase orders on your own, though, as NCR Silver does not manage vendor information or assist customers with purchase orders.",
    "In terms of reporting, NCR Silver offers multiple reports and even one which shows you daily and hourly sales data. There is even a category items list that shows your best and worst selling items.",
    "An item sales report is available to see how well items perform over a specific time period, and can be quite useful with seasonal goods.",
    "All of NCR Silver’s report data can be exported as an Excel spreadsheet, and the company’s POS system integrates with QuickBooks, Xero, Paychex, PassMarket and LevelUp. You can also create custom integrations for your POS system using NCR Silver’s API which the company makes available to its customers.",
    "If NCR Silver POS system proves too pricey for your budget, don’t worry as there are plenty of POS alternatives.",
    "For instance, if you run a restaurant you could go with Toast POS which specializes in the food service industry. The company’s hardware is a bit more expensive than NCR Silver’s, but it has been built from the ground up to withstand the rigors of any restaurant environment.",
    "If your business has more of an e-commerce focus, then Shopify POS might be a better fit. The company’s plans are cheaper than NCR Silver’s, and in addition to its Basic Plan, there is also a Lite Plan that costs just $9 a month.",
    "NCR Silver point of sale system provides a wide range of features, regularly cited excellent customer support and a variety of hardware options. If you're small business in the fast food or restaurant industry, NCR is smart choice to keep sales plus back and front of house operations running smoothly."
  ],
  "headers": {
    "5": "NCR Silver POS pricing",
    "18": "Ring Up by NCR Silver",
    "20": "NCR Silver POS setup",
    "24": "NCR Silver POS features",
    "31": "NCR Silver POS competition",
    "34": "NCR Silver POS final verdict"
  },
  "links": {
    "NCR Silver POS": "https://www.ncrsilver.com/",
    "POS system": "https://www.techradar.com/news/the-best-pos-system",
    "Aloha POS for restaurants": "https://alohaepos.co.uk/restaurant-pos-software/",
    "NCR Silver Pro": "https://www.ncr.com/restaurants/silver-pro",
    "contact NCR Silver POS": "https://www.ncr.com/contact-us",
    "Ring Up": "https://www.getringup.com/",
    "mobile card payment readers": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "Point-of-Sale app": "https://itunes.apple.com/us/app/ncr-silver-point-of-sale-pos/id517745327?mt=8&at=1001lnRX&ct=trd-us-4062194590164766700",
    "Silver Concierge": "https://www.ncrsilver.com/concierge/",
    "Toast POS": "https://www.techradar.com/reviews/toast-pos-point-of-sale",
    "Shopify POS": "https://www.techradar.com/reviews/shopify-pos"
  }
}