{
  "source": "https://www.techradar.com/reviews/samsung-q70-qled-tv",
  "title": "Samsung Q70 QLED TV review",
  "category": "televisions",
  "updated": "2021-06-23T10:24:42Z",
  "author": "stephen-withers",
  "summary": "The Samsung Q70 QLED is a solid mid-range model",
  "verdict": "The Samsung Q70 QLED is a mid-range 4K TV model that benefits from a direct backlight and local dimming, resulting in an excellent picture performance. A comprehensive smart platform and cutting-edge features complete what is an impressive overall package.",
  "pros": [
    "Excellent picture quality",
    "Great HDR performance",
    "Cutting-edge features",
    "Comprehensive smart platform"
  ],
  "cons": [
    "No Dolby Vision",
    "No Dolby Atmos support"
  ],
  "article": [
    "UPDATE: After a new Samsung TV? The Samsung Q70 QLED has since seen a 2020 successor in the Samsung Q80T, which we found to be a capable QLED with plenty to offer TV watchers and gamers alike. The new Q70T, though, is technically lower specified – and if you're after a real bargain you'll want to get the Q70 QLED reviewed here while it's still in stock, rather than a 2020 TV at its full RRP.",
    "Read on for what we thought in our original 2019 review...",
    "Samsung’s flagship Q90 QLED TV blew us away recently with its wider viewing angles, deeper blacks, and superior HDR images – sadly, however, not everyone can afford the flagship model. So what can Samsung offer for those wanting to experience QLED picture quality on a budget?",
    "The Samsung Q70 seems like a good place to start, with its direct QLED backlight and local dimming. You don’t get the ultra-wide viewing angles, black filter or One Connect box found on the more expensive models, but you do get all that excellent AI processing. In fact, apart those three missing features, the Q70 boasts most of the same cutting-edge features and comprehensive smart platform as its more expensive siblings.",
    "Does this midrange model hit the QLED sweet spot for those with limited funds? Let's find out.",
    "The 2019 Q70R comes in five screen sizes - a 49-inch, 55-inch, a 65-inch, a 75-inch and an 82-inch variation - all of which are available in the US and UK now.",
    "If you’re in the UK, you’ll find the QE49Q70R (£1,499); QE55Q70R (£1,699); QE65Q70R (£2,199); QE75Q70R (£3,499); and QE82Q70R (£4,799).",
    "While, in the US, customers will have the option of the QN49Q70RAFXZA ($1,249); QN55Q70RAFXZA ($1,499); QN65Q70RAFXZA ($2,199); QN75Q70RAFXZA ($3,299); and QN82Q70RAFXZA ($4,499).",
    "Unfortunately, Australia AV fans can only pick between three versions of the TV, all of which are called the Q75R there. That said, expect to find the QA55Q75RAWXXY (AU$2,899); QA65Q75RAWXXY (AU$4,099); and QA75Q75RAWXXY (AU$5,899).",
    "The Samsung Q70 looks functional rather than flashy, and while it retains the same basic styling as the rest of the 2019 QLED range it also reflects the lower price point.",
    "While it uses a lot of plastic, the design still has the 360-degree detail ethos used elsewhere in the line-up: that means a virtually bezel-less screen, a black border around the outer edge, and textured grooves at the rear.",
    "Samsung has adopted a more traditional stand further up the QLED range, but the Q70 uses metal feet that simply slot into place (no screws). These feet are wide apart, which means you’ll need a fairly big surface on which to place the TV, and that issue is only going to be compounded when dealing with the larger screen sizes (as we mentioned earlier, the Q70 goes up to 82 inches).",
    "Importantly, there’s no One Connect box here, either. Instead all the connections are located at the rear right of the panel as you face the screen. However at least there’s a full complement of inputs, including four HDMI, three USB, twin terrestrial and satellite tuners, CI slot, optical digital input, auto cal connector, and LAN port for a wired connection (along with built-in WiFi and Apple AirPlay 2).",
    "Samsung has resisted the temptation to embrace HDMI 2.1, claiming the current 2.0b inputs do all that is needed of them. That might disappoint some, but the company claims the Q70 can handle 4K at up to 120Hz, dynamic metadata (HDR10+), variable refresh rate (VRR), and auto low latency mode (ALLM). The only thing missing is enhanced audio return channel (eARC), but Samsung says that will be coming via a software update by the end of the month.",
    "You don’t get the snazzy metal zapper included with the more expensive models, but you still get two controllers: a fully-specced remote and a more basic wand designed for day-to-day use. The latter is comfortable to hold and easy to use with one hand, and includes a built-in mic for voice control, along with direct access buttons for Netflix, Amazon and Rakuten.",
    "Design TL;DR: The design is functional rather than flashy, and those wide apart feet might cause some installation issues. However the remote is effective and there’s a decent set of connections.",
    "The Samsung Q70 uses an identical smart TV platform to the other models in the QLED range, based around the Tizen-powered operating system. So you get the same launcher bar along the bottom as seen in previous years, and the useful second layer that provides easy access to other content (a feature that LG has copied on webOS this year).",
    "If you want to use your TV to watch video streaming services (and why wouldn’t you?), you’ll be delighted by the comprehensive choice available. Samsung has the lot, with apps for Netflix, Amazon, Now TV, Rakuten, YouTube, and all the UK TV catch-up services. There's even a brand-new iTunes app that just hit the platform earlier this month.",
    "Perhaps in recognition of the fact that owners face a bewildering array of choice, Samsung has introduced the Universal Guide. This new feature is specifically designed to collate all the available games, movies, sports, and streaming services into a single user-friendly interface.",
    "The guide then uses AI wizardry to monitor your viewing habits, creating a single ‘For You’ page with content tailored to suit your particular tastes. The more time it has to analyse your behaviour, the better the recommendations become, and it does work very effectively. However, there’s no individual log-in, so unless you live alone the analysis will be based on multiple users.",
    "Installing the Q70 couldn't be easier thanks to SmartThings - the handy app enables you to quickly and easily set-up your TV using your smartphone (it's available for both iOS and Android). SmartThings also allows you to use your TV as a smart hub, enabling you to sync, share, and control other connected devices in your home.",
    "Samsung’s QLED TVs are compatible with Amazon Alexa, Google Assistant, and thanks to the inclusion of Apple’s AirPlay 2 even Siri. This year Samsung has also built its own Bixby smart assistant into its TVs, giving the Q70 compatibility with a full house of AI-enabled assistants.",
    "Since Bixby is actually built into the TV, rather than simply working with another device that includes a smart assistant, the experience is largely seamless. Bixby is best accessed by simply pressing the mic button on the remote. There is a near-field mic built into the TV but we’d recommend turning that off, unless you want Bixby springing into life every 10 minutes.",
    "The Q70 also includes Samsung’s Ambient mode, which was introduced last year. This feature allows you to make use of your TV, even when you’re not watching it. The mode uses minimal power and displays info like the news and weather, or even artwork and family photos. It can also blend in with the surroundings, which is very cool when the panel is wall mounted.",
    "Smart TV TL;DR: It might be lower down the range but you'll still find the same the same state-of-the-art smart platform that includes iTunes, Universal Guide, and Bixby voice assistant here as you would on the flagship screens.",
    "The Samsung Q70 delivers an excellent performance in terms of SDR picture quality, and while it might not have the ultra black filter found on the more expensive models, as long as you don’t put this TV opposite a strong light source that shouldn’t be an issue. Besides, the Q70’s bright and punchy images look great even when there is ambient light in the room.",
    "The viewing angles aren’t as wide as the higher up models, but as long as you’re sat reasonably central that won’t be a problem either. Thanks to the VA panel, direct backlight and local dimming, the black levels are impressive and there’s plenty of detail in the shadows. We only counted about 50 zones, but Samsung’s superb local dimming algorithm remains highly effective regardless.",
    "We often use Gravity as a test for local dimming, because the star fields and bright white space suits are a real challenge. In general the Q70 handle this difficult material well, with very little haloing, blooming or clipping. However there were a couple of occasions where the local dimming was caught out, although with the less challenging content that was rarely an issue.",
    "Regardless of the material it was the detailed nature of the picture was readily apparent, with the AI-enhanced processing cleaning up more compressed content, and teasing every last pixel out of lower resolution material. The panel has plenty of brightness, and the colours are saturated but accurate, giving the images real pop.",
    "The motion handling is also good for an LCD TV, even without resorting to frame interpolation. However if necessary the motion settings smooth things out, often proving useful with sporting action where there’s a lot of movement. We measured the input lag at 14ms, which is great news for gamers, especially as there’s no danger of image retention or screen burn.",
    "HD/SDR Performance TL;DR: The SDR picture quality is sure to please film and TV fans, while some handy features and a 14ms input lag will delight gamers.",
    "The Samsung Q70 produced some lovely HDR images... even if it isn’t as impressive as its more expensive siblings.",
    "One thing's for sure: It certainly isn’t as bright, topping out at 800nits in its most accurate picture mode. However the tone mapping makes sure the peak highlights are delivered as accurately as possible. It also covers almost 100% of the DCI-P3 colour space, ensuring that the HDR images make full use of all those extra colours.",
    "The blacks are still black, even with the backlight and contrast controls maxed out, and the brightest whites are free of clipping. However the limited number of dimmable zones is more obvious with HDR, and blooming is certainly an issue with more challenging content. Having said that, the local dimming is still surprisingly effective and HDR images still have plenty of impact with the Q70 making full use of its 4K panel.",
    "A show like Star Trek: Discovery looks bright and colourful in HDR, even though it’s not actually in 4K. The same goes for Jack Ryan on Amazon, which is in 4K and also also looks stunning thanks to its HDR10+ dynamic metadata. Pop on an Ultra HD Blu-ray like Aquaman and the screen is awash with comic book primaries, while the HDR10+ encoding on the new Alien 4K disc means you won’t miss anything nasty lurking in the shadows.",
    "Unfortunately Samsung still doesn’t support Dolby Vision, a proprietary version of HDR that also uses dynamic metadata. This puts the Q70, and company’s entire range of TVs for that matter, at a disadvantage to models from Panasonic and Philips, who both support Dolby Vision and HDR10+. However missing features aside, the Samsung Q70 delivers a solid HDR performance.",
    "4K/HDR Performance TL;DR: The Q70 delivers a solid HDR performance, but doesn’t hit the highs of the more expensive QLED models.",
    "The Samsung Q70 sounds fairly good for a modern TV, in part thanks to its direct LED backlight requiring a deeper chassis. That means there’s slightly more room in which to install a decent set of speakers, even if they are still downward-firing. There’s a good sense of stereo separation, a solid midrange, and well-defined treble, but the bass is fairly limited.",
    "Samsung has tried to boost the sound quality of its TVs this year through the application of some machine learning. The result is the AI-enhanced Intelligent Sound mode that analyses the audio based on the environment and content, and the optimises it accordingly. As a result the sound has more width and depth, creating an acoustic experience that is more defined and immersive.",
    "The AI processing ensures that dialogue is clear, music more defined, effects more precise, and crowd noises more enveloping. The Q70 doesn’t support Dolby Atmos, but it is capable of sending Dolby Atmos from built-in apps like Netflix and Amazon to supporting soundbars and AV receivers via the HDMI audio return channel.",
    "Sound TL;DR: The basic sound quality is adequate, but receives a welcome sonic boost thanks to some clever AI enhancements.",
    "If you’re looking for alternatives to the Samsung Q70, the Sony KD-55XG9505 (XBR-55X950G in the US) is worth considering. It costs a bit more but also boasts full array local dimming, along with a Triluminos display, X-Wide Angle viewing, X-Motion Clarity, and the X1 Ultimate processor. There’s no support for HDR10+, but it can handle both Dolby Vision and Atmos, and there’s an Android smart platform with built-in Google Assistant.",
    "The LG 55SM90 (LG SM9000 in the US) is cheaper than the Sony but still costs more than the Q70. It has full array local dimming, and also includes NanoCell technology for better colours and deeper blacks, wider viewing angles, and the second generation Alpha7 processor. LG doesn’t support HDR10+ either, but like Sony there's Dolby Vision and Atmos, along with webOS 4.5, Google Assistant and Amazon Alexa built-in, and an ultra low input lag.",
    "The Samsung Q70 is a solid midrange model that offers a taste of QLED’s potential without the higher price tag. The panel may lack the black filter and wider viewing angles of the pricier models, but it can still deliver a bright and punchy image.",
    "Moreover, the AI-enhanced image processing is equally as effective, helping to make heavily compressed and low resolution content look better and the local dimming is particularly impressive, especially given the limited number of zones available. Feed the TV a 4K signal, however, and the results are often excellent. The sound quality isn’t bad either, thanks once again to some sonic AI wizardry, and the 14ms input lag is sure to please gamers.",
    "Despite sitting lower down in the QLED line-up, the Q70 includes the same comprehensive smart platform, extensive connections, and cutting-edge features found further up the range. This isn’t the flashiest-looking TV that Samsung has ever made, but if your funds are limited the Q70 is a cracking QLED all-rounder that’s worth checking out."
  ],
  "headers": {
    "5": "Samsung Q70R price and release date",
    "9": "Design",
    "16": "Smart TV (Eden)",
    "25": "HD/SDR Performance",
    "31": "4K/HDR Performance",
    "37": "Sound",
    "41": "Other panels to ponder...",
    "43": "Final verdict"
  },
  "links": {
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Samsung Q80T": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
    "Q70T": "https://www.techradar.com/reviews/samsung-q70t-qled-tv",
    "Q90 QLED TV": "https://www.techradar.com/reviews/samsung-q90-qled-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Sony KD-55XG9505": "https://www.techradar.com/reviews/sony-x950gxg95-4k-tv-xbr-65x950g",
    "LG 55SM90": "https://www.techradar.com/reviews/lg-nanocell-9-series-65sm9500-65sm9800-65sm9450",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you"
  }
}