{
  "source": "https://www.techradar.com/reviews/nokia-t20-review",
  "title": "Nokia T20 review",
  "category": "tablets",
  "updated": "2021-12-05T23:43:28Z",
  "author": "david-nield",
  "summary": "This Nokia tablet is exactly what you might expect",
  "verdict": "Considering what we've seen from the Nokia phones released under HMD Global's tenure, the Nokia T20 is exactly what you might expect: a solid, well-built device that comes in at an affordable price, offering plenty of value for your money despite some compromises.",
  "pros": [
    "Large, bright screen",
    "Affordable price point",
    "Metal design"
  ],
  "cons": [
    "Average performance",
    "Below-par cameras",
    "No real waterproofing"
  ],
  "article": [
    "It's been a fair while since we saw a tablet with Nokia branding attached – previous models included one running Windows RT, that's how long ago they came out – and the T20 is the first Nokia tablet to be launched under parent company HMD Global since it acquired the Nokia name. HMD Global's Nokia phones are known for their value for money, and that's a theme that continues with the T20 tablet.",
    "This is very much a tablet for those on a budget: If you want something to do the basics for as little money as possible, then the Nokia T20 could be the tablet upgrade for you. If you actually want to do some serious computing rather than just watching movies and checking your email, then you're probably better off buying an iPad.",
    "We suspect that a lot of people just want a tablet they can use for Netflix, Spotify and a bit of web browsing, and in that regard the Nokia T20 fits the bill. It's also the kind of tablet you can happily buy for or pass over to kids, so in that sense it's going up against the very popular and very cheap Amazon Fire tablet range too.",
    "There's Android 11 on board, which boasts two new Google innovations: Entertainment Space, for bringing all your streaming apps together, and Kids Space, for providing a safe environment for your children.",
    "Both highlight the intended uses for this tablet – so sitting back and watching something, or keeping the young people in your household quiet.",
    "We like what Nokia has done with the design and the screen here, and it's a credit to HMD Global that the tablet looks more expensive than it actually is. Under the hood though the specs aren't great – you'll be fine doing the basics, but not much more than that, and the device is notably slower than the premium models on the market at the moment.",
    "You'd expect that given the price though, and when it comes to a value-for-money Android tablet, the Nokia T20 is worth a place on anyone's shortlist. We're pleased to see more manufacturers taking an interest in making Android tablets, and actually giving Apple something to worry about (especially at the cheaper end of the scale).",
    "You can pick up the Nokia T20 for £179.99 (with Wi-Fi) or £199.99 (with Wi-Fi and LTE) in the UK. In the US and Australia, it's the Wi-Fi only model for $249.99 / AU$349. That's definitely a price to keep us interested considering everything that the tablet offers, but it's important to be aware of what its shortcomings are as well.",
    "You can buy the Nokia T20 right now in the UK, direct from Nokia: it'll cost you £179.99 for the Wi-Fi only version and £199.99 for the model with Wi-Fi and 4G LTE.",
    "In the US, the price for the Wi-Fi only edition is $249.99, and shipping is scheduled for November 17. In Australia, the Wi-Fi edition of the tablet is available now for AU$349.",
    "Perhaps the biggest compliment we can pay to the design of the Nokia T20 tablet is that it looks more expensive than it actually is.",
    "The best Nokia phones manage to look stylish while also being affordable, and HMD Global has pulled off the same trick with its first Nokia tablet too: it's hardly innovative or premium in terms of its appearance, but it's also well put together and reasonably stylish in an understated kind of way.",
    "The tablet measures 247.6 x 157.5 x 7.8mm, and weighs in at 465 grams (the LTE version is very slightly heavier). It's comfortable to hold, and you can just about manage it with one hand – though perhaps not for long.",
    "If you hold the tablet in landscape mode with the screen facing you, you've got a power button on the left hand side, volume buttons on the top towards the left, and a USB-C port on the right (thankfully it now looks as though micro USB has been fully abandoned, even on the cheapest devices). There is a 3.5mm headphone jack here, but it's rather oddly positioned on one corner.",
    "We like what Nokia has done with the back of the tablet: it's aluminum, which we like, and it has a nice matte texture to it that feels good on the fingertips. There's also a slightly raised bar at the top on the back of the tablet, with a slightly different texture – we're not sure what it's there for, but it adds a touch of variety (it can help you get the tablet facing the right way up, if nothing else).",
    "Also on the back we've got the single-lens rear camera (up in the top right corner) and a subtle Nokia logo. Pull this device out in a coffee shop and we think you're going to attract one or two admiring glances, no matter what angle other people are seeing it from. It feels relatively robust too, the sort of device that you won't worry about when you're sliding it into a bag or tossing it on the sofa.",
    "The Nokia T20 tablet is available in one color called Deep Ocean, which is a very dark blue – you can see what it looks like in the photographs accompanying this review. Some more color options would've been welcome, but we've got no real complaints about the one that HMD Global went for here. Finally, it carries an IP52 rating, so it's splash resistant but in no way fully water resistant.",
    "The Nokia T20 sports a 10.4-inch, 1200 x 2000 IPS LCD display, and let's be honest – it's not the greatest display panel we've ever seen attached to a tablet. Then again, you wouldn't expect it to be at this price.",
    "You don't get anything above the standard (60Hz) refresh rate, you don't get any cool innovations like mini-LED, and you don't get a particularly high pixels-per-inch density at 224ppi.",
    "Everything considered though, it's not a bad screen: it's perfectly fine for browsing the web and watching movies. The maximum brightness of 400 nits is respectable enough, though you're probably going to want to ramp that up to its upper limit most of the time (especially if you're trying to use the tablet in bright daylight).",
    "Compared with other similar tablets around this price bracket, the screen actually stands up fairly well, and the 10.4 inches is a generous enough size for the majority of tasks. We spent our time with the Nokia T20 flicking between email, videos, and social media, and the display does a good job with everything that you need to call up on it.",
    "The color balance and contrast are decent – the default wallpaper shows this off pretty well – and while it seems clear that HMD Global has saved some money with the screen, it still largely impresses. The bezels around the edges of the display aren't particularly thin, but we do like the curved corners that have been deployed here (which are very iPad Pro).",
    "Under the hood of the Nokia T20 we've got a Unisoc T610 processor, and our review unit came with 4GB of RAM and 64GB of internal storage (a model with 3GB of RAM and 32GB of storage is also available in certain markets).",
    "There is a microSD card slot thankfully, and you're probably going to want to expand the built-in storage if you're downloading a lot of podcasts, movies, or whatever else. In addition to the Wi-Fi model we tested, there's also a 4G LTE version.",
    "Those specs are very much budget specs, and it shows in the performance of the tablet. Opening apps, loading menus, switching between screens, changing from landscape to portrait mode and so on – this all takes a few milliseconds (or even whole seconds) longer than it would on something faster and more expensive.",
    "These delays don't make the tablet unusable, and it will be able to run any app you load up on it, but power users are going to be frustrated by the slow pace that the Nokia T20 goes at.",
    "If you're going to keep the multitasking down to a minimum, and don't mind a leisurely speed when it comes to getting stuff done, then the Nokia T20 will suffice. We wouldn't recommend this for any kind of demanding photo or video editing though, or for playing sophisticated games.",
    "The stereo speakers fitted to the tablet are perfectly capable and actually probably a bit more than that – they can produce a decent amount of volume and are fine for watching movies and listening to podcasts. At a push, they'll do for a tune or two as well. Obviously they're not the last word in distortion-free audio fidelity, but considering the price you're paying, they're a feature that HMD Global has managed well.",
    "As for the cameras, you're not the sort of person who takes photos with a tablet are you? Oh you are? Well in that case the Nokia T20 features a single-lens 8MP rear camera that takes some of the grainiest and most washed out photos we've seen in a while – seriously, you do not want to be shooting a lot of images with this. In low light the performance of the camera is even worse, and this is obviously an area where costs have been cut.",
    "The 5MP selfie camera isn't great either, though it'll just about do for video calls. Even so, video is jerky and noisy, so you're much better off using your smartphone or a webcam connected to a computer. We'd say the front and rear cameras are two of the biggest weaknesses of the tablet – but then again no one is really buying a tablet for its ability to capture photos and videos anyway.",
    "The Nokia T20 comes running Android 11, and we're pleased to say that HMD Global has confirmed that the tablet is going to get Android 12 and Android 13 as well when the time comes – so you're covered for a couple of years at least when it comes to getting the latest software on this device.",
    "On the downside, Android has never really been great on tablets, and that continues to be the case: Google doesn't really do much to tweak the software for a bigger screen, and nor do app developers (there are some exceptions, including Gmail and Spotify). It's not a disaster, but it's not iPadOS.",
    "There are some relatively new features to talk about on Android tablets though: the Google Entertainment Space, for example, which essentially brings together all your video streaming apps, games, and ebooks. Then there's Kids Space, a walled, curated area containing approved apps, ebooks and videos for your youngsters to enjoy.",
    "Both make Android tablets more useful, and mimic the sort of features that come as standard if you pick up an Amazon Fire tablet.",
    "You can get work done on the Nokia T20 through something like Google Docs and Google Sheets – but there's no official keyboard cover, so if you want to improve the typing experience then you'll need to buy a suitable Bluetooth keyboard. Only passive stylus support is available too, which means no sketching or anything like that – just simple taps on the screen.",
    "HMD Global reckons you can get \"all-day battery life\" out of the 8,200mAh battery inside the Nokia T20 – 7 hours of online meetings, 10 hours of movies or 15 hours of surfing the web according to the official blurb. That might be a bit optimistic based on our testing, with the battery dropping about 15% an hour during our video test (so that's a total of around 6-7 hours).",
    "To be fair that test was run with the display at maximum brightness, so you can probably eke out a bit more if you dim the screen a bit. The battery does seem to hold its charge well in standby mode, and if you're just a light user, we reckon you could get a couple of days between charges.",
    "If you're gaming and checking emails all day, on the other hand, the battery probably won't make it to bedtime.",
    "First reviewed: October 2021",
    "You might also want to check out the ReMarkable 2 tablet review."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Nokia T20 release date and price",
    "10": "Design",
    "17": "Display",
    "22": "Specs, performance and cameras",
    "30": "Software",
    "35": "Battery life",
    "38": "Don't buy it if..."
  },
  "links": {
    "a tablet with Nokia branding attached": "https://www.techradar.com/reviews/pc-mac/tablets/nokia-lumia-2520-1191348/review",
    "Nokia phones": "https://www.techradar.com/reviews/nokia-g50-review",
    "buying an iPad": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "Amazon Fire tablet": "https://www.techradar.com/reviews/amazon-fire-hd-10-2021-review",
    "best Nokia phones": "https://www.techradar.com/best/best-nokia-phones",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-11-2021-review",
    "stereo speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "ReMarkable 2 tablet": "https://www.techradar.com/reviews/remarkable-2-tablet"
  }
}