{
  "source": "https://www.techradar.com/reviews/benq-mobiuz-ex3415r",
  "title": "BenQ Mobiuz EX3415R review",
  "category": "computing",
  "updated": "2021-10-20T01:28:22Z",
  "author": "joel-burgess",
  "summary": "Is BenQ’s latest 34-inch ultrawide the perfect gaming and business battlestation?",
  "verdict": "BenQ's Mobiuz EX3415R is an impressive 34-inch curved widescreen monitor with 3440 x 1440p resolution, Vesa HDR400, Adaptive-Sync and a 144Hz refresh rate that will make both work and games look amazing.",
  "pros": [
    "Smooth 144Hz refresh rate",
    "Certified for Vesa HDR400",
    "Impressive 98% DCI-P3 color coverage"
  ],
  "cons": [
    "Only 200 nit typical brightness",
    "Expensive",
    "No HDMI 2.1"
  ],
  "article": [
    "While pro gamers are going to use flat, small 16:9 screens because they’re the fastest, most colour accurate and consistent screens around – for anyone that actually wants to get the most out of their games, ultrawide curved displays are where it’s at.",
    "BenQ’s Mobiuz EX3415R is a 34-inch 21:9 ultrawide gaming display that's big enough to make you forget any ambitions you had for multi-screen setups. With a curvature of 1900R, this screen is flat enough to keep everything nicely proportioned while still feeling like it wraps into your peripherals to give you a giant and consistent viewing experience. The EX3415R sits at the higher end of ultrawide monitor resolutions with a 3440 x 1440 pixel screen that offers a great balance between clarity and GPU processor demand.",
    "There’s only one variant of the Mobiuz EX3415R and while these units aren’t as fast as BenQ’s Zowie TN panels, they still have professional-level sub 2ms GtG response times — which is as good as IPS gets.",
    "The Mobiuz EX3415R will set you back $1,000 (£899 / AU$1,599), which isn’t quite as expensive as the painfully pricey LG UltraGear 38GN950 that’s currently at the top of our best gaming monitors page. That said, it’s still up there with the most expensive gaming monitors around.",
    "If you don’t already have one, you’ll also want to factor in the cost of a solid GPU to run games on this ultrawide monitor. You’re not just stepping up from 1080p gaming to 1440p, but you’re also adding enough horizontal pixels to make it closer to 4K frame rates.",
    "While you’ll get around 60fps averages using 21:9, 1440p Ultra settings on most games from a Nvidia GeForce RTX 2080, more demanding titles like Cyberpunk 2077 will only just be playable with this GPU. So, you’re probably going to want to pair this with an equivalent 30 series GPU like a Nvidia GeForce RTX 3060 Ti or better to get the most out of it.",
    "On less demanding titles like F1 2021, frame rates using these GPUs start to get above 60fps and begin making use of the EX3415R’s 144Hz refresh rate. So if you’re happy to play older or less demanding games then you’re in the clear, but for anyone wanting to really utilise this screen on the latest titles will need one of the top current graphics cards.",
    "The EX3415R includes AMD FreeSync Premium certification which means both 20 series and newer Nvidia cards, and AMD GPUs will be able to tap into this monitor’s 144Hz certified screen-tear-free experience. It also offers low-framerate compensation that’ll repeat frames to sync with your monitor when frame rates dip below its specified refresh rate. Interestingly BenQ didn’t opt for AMD’s FreeSync Premium Pro tier that offers low latency when the monitor is using HDR color. This is a disappointing choice considering the monitor has 98 percent DCI-P3 color coverage and has been independently certified as VESA DisplayHDR 400.",
    "Essentially, all this means is that while the color accuracy is excellent in normal viewing modes and is close enough to professional editing specs to be genuinely useful to professionals, this monitor may lose a little fidelity when gaming at high refresh rates.",
    "Instead, BenQ includes HDRi emulation viewing modes that attempt to manufacture HDR-like color from SDR while gaming at high framerates. This might be a downside for professionals, but the vibrant and saturated colors will not look overly different for anyone simply wanting immersion.",
    "There are a number of gaming specific features that’ll help you get the most out of your games. BenQ include AMA anti-blurring modes to allow you to reduce any ghosting and blur that might be present. With three levels of overdrive it's pretty good at offering the right level for minimum artefacts, but these settings are not adjustable while running Adaptive-Sync.",
    "This monitor has strobe backlight features that’ll improve the look of movement, but no more than the Adaptive-Sync. The screen is also not particularly bright, especially in SDR, with a peak brightness of 400 nits and a typical brightness of just 200 nits. It’s fit for purpose and looks great in indoor settings, but it’s definitely not particularly bright during the day when you factor in the price.",
    "This is compounded by a lack of dynamic contrast that limits the overall potential of this otherwise high-spec display.",
    "The EX3415R takes a slightly different approach to speakers by including a decent set of 2.1 channel 2W speakers and a 5W sub in a front facing soundbar at the bottom edge of the screen. These work well enough to mean you can ditch any standalone speakers and declutter your desktop.",
    "The stand is sturdy and offers a sleek outline that's appropriate in an office without losing all the gaming flair.",
    "Some other monitors in this price point offer HDMI 2.1 connectivity to make them suitable for 4K / 120fps connection with a gaming console, so it's a shame that the EX3415R doesn't. That said, this curved monitor is much more suited to a desk-based setup so it’s not a deal breaker, but it’ll be a disappointing omission for anyone that wants to use their desktop screen with the latest consoles.",
    "There's at least one of the latest DisplayPort 1.4 inputs to ensure you can play games at 144Hz in WQHD.",
    "Another nice addition with the EX3415R is the included remote instead of on-screen controls, making it easier for you to access an extensive suite of menu options that shouldn’t leave you wanting any extra display modes for work or play."
  ],
  "headers": {
    "0": "Two-minute review",
    "18": "Don’t buy it if…"
  },
  "links": {
    "LG UltraGear 38GN950": "https://www.techradar.com/reviews/lg-ultragear-38gn950",
    "best gaming monitors": "https://www.techradar.com/news/best-gaming-monitor",
    "top current graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458"
  }
}