{
  "source": "https://www.techradar.com/reviews/lenovo-thinkbook-13s-review",
  "title": "Lenovo ThinkBook 13s review",
  "category": "computing",
  "updated": "2021-05-12T16:31:03.734Z",
  "author": "john-loeffler",
  "summary": "An ultraportable powerhouse",
  "verdict": "The Lenovo ThinkBook 13s delivers outstanding performance for the price while packing in a fantastic display and appealing design. The audio could be better, but on balance there's very little holding us back from recommending this to any professional who's not quite ready to go all in on one of Lenovo's more expensive ThinkPad products.",
  "pros": [
    "Great performance",
    "Fantastic display",
    "Attractive design",
    "Reasonably priced"
  ],
  "cons": [
    "Okay audio",
    "Only one USB-C Thunderbolt 4 port",
    "Not the best for creatives"
  ],
  "article": [
    "The Lenovo ThinkBook 13s is a sleek, durable Ultrabook that features a fantastic 16:10 display, powerful performance, and a reasonable price, easily making it one of the best business laptops on the market for those who aren't ready to invest heavily in one of Lenovo's premier ThinkPad devices. And honestly, with what the ThinkBook 13s offers, you probably can skip the ThinkPads altogether.",
    "The lightweight aluminum chassis helps keep the ThinkBook 13s under three pounds (about 1.26kg) but it's 13.3-inch touchscreen is bigger than its diagonal lets on, thanks to its 16:10 screen ratio with 2,560 x 1,600 max resolution. It'd have been nice to have a stylus included, but given that this isn't a 2-in1 like the Lenovo ThinkPad X1 Titanium or Lenovo ThinkBook 14s Yoga, that's an understandable omission - you can always spend an extra hundred bucks/quid to pick up a precision pen anyhow, given that you'll be saving some money with this laptop.",
    "Performance is surprisingly robust given the price and size of the ThinkBook 13s, and thanks to its Intel Evo certification, you can depend on the laptop to get you through most - if not all - of your workday on a single charge.",
    "Unlike a lot of other Ultrabooks, there are two additional USB Type-A ports as well as HDMI 2.0 output, though there's only one USB Type-C Thunderbolt 4 port and no SD card slot. The USB-C port is also the charging port for the ThinkBook 13s, so you might not have full use of the port during the day, but its RapidCharge tech should help free it up before too long.",
    "The audio is better than we expected, given its downward-firing speakers, but it's definitely not the biggest selling point on the device - it's not really a negative either, though. The webcam is only 720p, but it does come with a physical privacy shutter, and the dual-array microphones definitely help with video calls and conferencing.",
    "Most of all, the Lenovo ThinkBook 13s doesn't make a whole lot of sacrifices for its rather affordable price point, especially considering that this is marketed toward the business consumer who can probably absorb the additional expense. If you're in the market for a highly portable laptop for work and you want to avoid the major investment that other business laptops usually require, the Lenovo ThinkBook 13s absolutely needs to be at the top of your list.",
    "The Lenovo ThinkBook 13s is available now in the US and Australia, starting at $785/AU$1,379, and is coming soon to the UK and will start at £989.",
    "In the US, you get it with either an AMD Ryzen or Intel Core processor, with the former being significantly cheaper. The entry-level model comes with an AMD Ryzen 5 4600U processor, 8GB RAM, and 256GB SSD for the above listed price. You can bump this up to a Ryzen 7 4800U with 16GB RAM and 512GB SSD for $928.",
    "Getting the ThinkBook 13s with an Intel Core i5-1135G7 with 8GB RAM and a 256GB PCIe SSD will run you $1,339, with the highest end configuration - with an Intel Core i7-1165G7, 16GB RAM, and a 512GB SSD - selling for $1,709.",
    "In Australia, the entry level configuration comes with an Intel Core i5-1135G7 with 8GB RAM and a 256GB SSD, while the highest end spec comes with an Intel Core i7-1165G7, 16GB RAM, and 512GB SSD for AU$1,839.",
    "The Lenovo ThinkBook 13s is built with an all-anodized aluminum chassis, with the ThinkBook line's characteristic dual-tone design, with the ThinkBook logo stamped prominently on the lid.",
    "The ThinkBook 13s isn't the thinnest Ultrabook on the market, but still comes in at just under 0.6 inches (or slightly less than 15 millimeters). Starting at 2.78lbs (1.26kg), it's no Lenovo ThinkPad X1 Nano, but under three pounds is still a good place for an Ultrabook so you won't find many complaints on that front.",
    "The speakers on the underside of the chassis are helped by the relative thickness of the laptop, since this at least gives the sound from the speakers some room to expand, but they can still be easily muffled if you set the ThinkBook 13s down on a soft surface like a sofa or a bed with a thick comforter.",
    "Fortunately, the thickness of the chassis also provides enough room for some USB Type-A ports and HDMI 2.0 output, especially since there's just the one Thunderbolt 4 port. A 3.5mm combo jack and Kensington lock slot fill out the rest of the ports along the sides.",
    "The keyboard is the standard Lenovo ThinkBook setup, which isn't a complaint by any means. The keys are responsive and have a decent amount of travel for an Ultrabook, and unlike some of its ThinkPad cousins, the Ctrl key is in the right place so we didn't repeatedly mess up our copy-and-paste operations while using it. Yes, we are still complaining about that.",
    "The trackpad is roomy and has the right amount of surface resistance for multi-gesture control, as well as responsive buttons and tapping input. It also has the attractive metallic trim around the edges that are a standard design feature of the ThinkBook line.",
    "The Lenovo ThinkBook 13s has a lot going for it in the performance department. While the model we tested was only working with a Core i5-1135G7, in several of our benchmarks, it came come to and even beat more powerful mobile processors like the Lenovo ThinkPad X1 Nano's Core i7-1160G7 and Razer Book 13's Core i7-1165G7.",
    "While any mobile processor is going to have its limitations, the ThinkBook 13s performed above where we thought it would given its specs. On our PCMark10 Home test, which is a measure of its general use and multitasking performance, the ThinkBook 13s scored 4,602, which is only about 210 points behind the most recent Dell XPS 13 and Razer Book 13 when running an Intel Core i7-1165G7.",
    "In our 3DMark tests, which predominantly measure GPU performance, the ThinkBook 13s edges past the XPS 13 in Firestrike (4,234 to 4,173) and more or less ties its Time Spy score (1,513 to 1,547). The ThinkBook 13s manages keep up with the XPS 13 in GeekBench 5's multicore benchmark (5,377 to 5,432) and only comes up 20 points short of tying the Book 13 in multicore performance (5,397).",
    "The ThinkBook 13s definitely lags behind these two in single-core performance (1,404 for the ThinkBook 13s versus 1,539 for the XPS 13 and 1,558 for the Book 13), but considering that this is more marketed towards business and professional users, multicore performance is much more important, so when it comes down to it, they're pretty evenly matched.",
    "All in all, not bad considering the hardware handicap for ThinkBook 13s. We were genuinely impressed.",
    "The ThinkBook 13s doesn't fare quite so well against its competitors when it comes to battery life though. It is Intel Evo certified, so we weren't surprised at all to see it make it past the nine hour mark in our battery tests, even if it just barely made it in both.",
    "At nine hours two minutes in PCMark10's battery test and nine hours one minute in our HD movie test, this is still an excellent result, even if the XPS 13 is the champ with 11 hours 47 minutes in PCMark 10 and 11 hours one minute in our HD movie test. The Book 13 is somewhere in the middle, with 11 hours 42 minutes in PCMark10 but nine hours 20 minutes in our HD movie test.",
    "Considering the ThinkBook 13s has a 56WHr battery - the largest of the three - we'd have liked to see it go a little bit longer, but with some settings tweaking, there's no doubt that you could probably stretch the battery into the 10 to 11 hour range during general and productivity use.",
    "We aren't at the point where a 1080p webcam is standard, unfortunately, but the 720p camera on the ThinkBook 13s isn't any worse than what most of us are using for work nowadays.",
    "During our daily Zoom meetings, the picture quality was more than adequate for our needs and we didn't hear any complaints about our audio, thanks to the dual-array microphone no doubt.",
    "The biggest feature of the webcam, in our opinion, is the physical privacy shutter. The early pandemic-era laptops could be forgiven - barely - for not having physical privacy covers for their webcams back when manufacturers weren't anticipating a work-from-home revolution.",
    "In 2021, though, its appalling that laptops still don't include them and it's enough to seriously make us considering passing on a laptop for lacking this feature alone. Lenovo, however, has been Johnny on the spot in this regard, so we're happy to single it out for praise for getting this right on their latest products.",
    "Unfortunately, given the price of the ThinkBook 13s, we did notice a bit of an uptick in bloatware, with the biggest offender being McAfee. While McAfee does make it onto our list of the best antivirus software, it just barely makes the list. There are better options out there, if we're being honest, and McAfee regularly uses popup notifications on your desktop by default to get you to buy a subscription to their service, which is pretty jarring.",
    "Anytime you use popups through the Windows desktop notification center, you are all but challenging us to set an office record for the fastest software uninstall of the year.",
    "Beyond that, Lenovo thankfully bundles all of their utility apps in a single product called Lenovo Vantage, which is useful for some more than others. Fortunately, it has a pretty light resource footprint, so its not something that's every going to bog you down and it doesn't spam you with ads on the desktop, so there's no harm really in keeping it around.",
    "Being a business laptop, there are some extra security features as well that are rather helpful, including a fingerprint scanner set into the power button for easy log-ins, but these features aren't as robust as those you'd find on more expensive ThinkPads like the X1 Titanium. For the price though, the ThinkBook 13s strikes a good balance on this front."
  ],
  "headers": {
    "0": "Two minute review",
    "6": "Price and availability",
    "10": "Design",
    "16": "Performance",
    "21": "Battery life",
    "24": "Camera and microphone",
    "28": "Software and features",
    "32": "Don't buy it if..."
  },
  "links": {
    "Ultrabook": "v",
    "Lenovo ThinkPad X1 Titanium": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-titanium-yoga-review",
    "Lenovo ThinkBook 14s Yoga": "https://www.techradar.com/reviews/lenovo-thinkbook-14s-yoga-review",
    "Lenovo ThinkPad X1 Nano": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-nano-review",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Razer Book 13": "https://www.techradar.com/reviews/razer-book-13-2020",
    "best antivirus software": "https://www.techradar.com/best/best-antivirus"
  }
}