{
  "source": "https://www.techradar.com/reviews/kobo-elipsa",
  "title": "Kobo Elipsa review",
  "category": "tablets",
  "updated": "2021-06-10T07:18:16.289Z",
  "author": "sharmishta-sarkar",
  "summary": "The ereader that wants to take on an iPad",
  "verdict": "The Kobo Elipsa can do a lot – use it as an ereader, take notes, it lets you draw and, of course, you can buy ebooks, borrow from a public library, and read longform web articles on its 10.3-inch E Ink display. In fact, that large screen is perfect for comics and graphic novels. While the stylus is useful, its use is restricted, plus the size and 383g weight makes it difficult to use for long periods of time, particularly single-handed. Between its unwieldy size and restricted note-taking abilities, it’s hard to recommend the Elipsa as a research device.",
  "pros": [
    "Stylus support",
    "Responsive, sharp 10.3-inch display",
    "Excellent handwriting recognition",
    "Word games in beta"
  ],
  "cons": [
    "Heavy and unwieldy",
    "Slow handwriting-to-text conversion",
    "Lacks amber LEDs",
    "Writing is restricted"
  ],
  "article": [
    "With a 10.3-inch screen, the Kobo Elipsa is not the largest ereader that’s ever been made – consider the 13.3-inch Onyx Boox Max3 for example – but it is for Kobo. It’s also the only device from the ereader maker to sport a stylus. Kobo is touting the Elipsa as not just an ereader, but as a research device that you can jot notes on, putting it in competition with the likes of the ReMarkable 2. The difference here, though, is that you need to jump through hoops to use the ReMarkable as a reading device – it’s more a digital note-taker than ereader.",
    "The Kobo Elipsa, however, is an ereader first – one that can multitask. The Kobo Stylus, while not quite real-time responsive, is fast enough to make writing an enjoyable experience, and the device’s ability to recognize handwriting to convert to text is remarkable. For the most part, the Elipsa does exactly what it says on the tin – it lets you read, make annotations, draw, create lists, buy ebooks, borrow ebooks from a public library and read web articles via Pocket. However, there are some caveats that make the Elipsa hard to recommend.",
    "Stylus support is locked to ebooks you buy directly from the Kobo Store, meaning you can’t annotate a sideloaded EPUB. However, you can write and draw on sideloaded PDFs. For a company that has a reputation for not locking down its ecosystem, it does feel as though Kobo is taking a step in that direction by allowing you to write only on locked ebooks.",
    "And while Kobo has managed to use software that recognizes handwriting really well – no matter how bad you think your writing is – it takes a while to actually convert that handwriting to text. For example, a single paragraph of about 30-50 words can take up to 30 seconds to convert.",
    "Then there’s the size and weight considerations. Kobo says the Elipsa is an ereader first, but with a screen size of 10.3 inches and 383g in weight, it’s not quite as portable as traditional ereaders. It’s too large to use on public transport, even if you’ve got a seat, and feels heavy in the hand, even without a sleepcover. And, it’s not designed for one-handed use.",
    "The stylus, though, feels quite natural to use. It fits into the hand just like a regular pen would and writing on a textured screen feels like you’re taking notes on paper (except for the solid feel of the plastic screen). The highlight and erase buttons are well placed near the forefinger/thumb and there are different nib sizes and grayscale shades to choose from.",
    "For a first attempt at a stylus-toting digital note-taker, Kobo’s done quite well with the Elipsa, but for a device that comes with a hefty price tag and some caveats, it’s hard to recommend as the research device Kobo wants it to be.",
    "Usually Kobo ereaders ship as a standalone device and you can then buy accessories like sleepcovers separately. However, the brand has taken a different approach with the Kobo Elipsa, selling it as a bundle, including the sleepcover and the stylus with the tablet, in a package called the Elipsa Pack. This will set you back $399.99 / £349.99 / AU$599.95, which is quite competitive considering you’re getting the accessories as well.",
    "In comparison, the ReMarkable 2 costs $399 / £399 / $679 for the tablet alone. You’ll need to pay an extra $49 / £49 / AU$79 to get the Marker (stylus). There is a Folio available for the ReMarkable 2, but that too is an extra expense.",
    "While it might hold its own against the direct competition, the Elipsa costs more than the current 10.2-inch Apple iPad (2020), a far more versatile device with a color screen, multimedia support and access to the App Store.",
    "The Kobo Elipsa is currently available for pre-order directly from the Kobo Store in your region and will begin shipping on June 24, 2021. That is also when it will become available to buy from leading retailers around the world.",
    "If you’ve never used a ReMarkable tablet or an Onyx Boox Note Air before, then think of the Kobo Elipsa as an oversized Kindle Oasis that you can write on. The reason we’re comparing the Elipsa with the premium Amazon device is because, like the Oasis, the Kobo’s screen is flush with the bezels, whereas all other Kobo devices have their screen set into a recess below the bezels.",
    "That 10.3-inch screen is one of the sharpest we’ve seen, with a screen resolution of 227ppi (1404x1872) – the same as the Onyx Boon Note Air – and uses the new E Ink Carta 1200 technology that’s specifically designed for note taking and reduces pen latency. According to E Ink – the company that makes the screens that ereader manufacturers use – this screen has 20% better response time as compared to the older Carta 1000 screens (as used in some older note-taking devices) and 15% better contrast ratio.",
    "Like all the Kobos, the Elipsa’s screen is also front-lit, but there are no amber LEDs here. That means that while you can dim the brightness, there’s no way to change the hue (temperature) of the light at night to warmer tones as you can on most Kobo devices – a major design flaw for a device that costs as much as the Elipsa. However, there is a ‘dark mode’ available on board that switches black text on white to white text on black.",
    "The Elipsa’s large size means it’s heavier than most traditional ereaders. Where most ereaders weigh around 200g or less, the Kobo Elipsa is a much heavier 383g for the tablet alone. That’s lighter than the 10.3-inch Onyx Boox Note Air (which weighs 420g) but still feels heavy in the hand. It takes getting used to, but is a little unwieldy when used either in bed or on public transport. We also found that the most comfortable way to use it as a note-taking device was to have it on a table.",
    "While its size and weight make it difficult to use single-handed, it would have been easier if there were page-turn buttons (like on the Oasis and Kobo Libra H2O). There is ample room for them as one side bezel is wider than the other. Presumably this wider bezel is there so you can hold the device comfortably while writing, but if you find yourself putting it down to do so most of the time, that space could have been put to better use.",
    "On the side of the wider bezel is the power button, which we found to be too small and awkwardly placed to find. Beside that is a USB-C port – another first for Kobo – for charging and transferring files.",
    "Unlike the plastic tablet, the Kobo Stylus is all metal, made of aluminum. There are two buttons conveniently situated where your thumb or forefinger would be – one to highlight when reading, the other to erase. Erasing triggers a page refresh, removing any ghosting or shading from the writing. The stylus is powered by a single AAA battery, which means there will be some ongoing cost to maintaining the pen. It’s important to note that the Kobo Stylus is proprietary and no other stylus will work with the Elipsa. So if the nib suffers from wear and tear, you will need to buy the replacement tips from Kobo.",
    "The sleepcover for the Elipsa is different from the usual ones for most ereaders – instead of opening like a book, it pulls up vertically. It has folds that convert the folio to a stand and a niche to stow the Kobo Stylus safely away when not in use.",
    "If there’s one thing that Kobo does well, it’s the device UX. It’s the same Linux-based software in use here, so if you’ve used a Kobo ereader before, you’ll be right at home with the Elipsa.",
    "Everything is streamlined as we’ve come to expect from Kobo, with the ability to organize your library as you see fit, plenty of information on the home screen (including recommendations and access to the Kobo Store) and all the important settings at your fingertips. To change the brightness settings on the Elipsa, just drag your finger either up or down the left edge of the screen, but keep in mind this works only when a file is open and not on the home screen.",
    "We even noticed a mention of Bluetooth in the beta settings, but it wasn’t available to use at the time of writing. If there is Bluetooth support – which could potentially be switched on via a future firmware update – then it would be possible to pair a set of wireless headphones with the Elipsa and listen to audiobooks, but we’ll have to wait and see if Kobo does enable this feature (which is available on all the Kindle ereaders at present).",
    "And speaking of beta settings: there are some word games on the Elipsa sitting within this pane and they’re playable. They’re not complicated games, but for a little light distraction, they’re not too bad at all. That said, there are no instructions available and you’ll need to figure out the gameplay by yourself.",
    "While the settings options on the top of the home screen remain unchanged, there’s something new on the bottom navigation bar – a dedicated tab for your notes. The My Notebooks section is where you can draw, write, make notes or create lists, all organized the way you want them. You can have notes with several pages or just one, add more later, change page background, and so much more. Of course, you can even change the hue of the ink in different grayscale shades, while also changing the thickness of the nib.",
    "It’s very easy to connect the Elipsa to Wi-Fi and you can force a sync any time you want. Even using the stylus is intuitive, although it does not work on all files (more on that later).",
    "Reading on the Elipsa is pretty much what we’d expect from any other Kobo device – the text is sharp and pictures (including cover art) render very well. In fact, its large screen is perfect for reading non-fiction books with diagrams, maps or images, as well as comics and graphic novels. There’s a lot of flexibility on how small or large you want the font to be – heck, you can even sideload other fonts you prefer, like Amazon’s Bookerly or Ember – or how much line spacing and margins you want.",
    "There’s a pinch-and-zoom functionality available when reading PDFs, which is great to have, but it doesn’t quite work as you’d expect. When we tried to zoom into a comic strip in PDF format, it turned into static after a second. Opening another PDF resulted in the same issue. Hopefully, Kobo engineers will soon be able to roll out a fix for this problem.",
    "While there’s no option to alter light temperature to warmer hues in the evening, Kobo has added the option of using a ‘dark mode’ that inverts text to white on a black background. While that does help a little, we think it would be a better reading experience if amber/yellow LEDs were available on the device.",
    "Like the Libra H2O and the Kobo Forma, the Elipsa has gyroscopic sensors that detect full 360º movements. You have the option to lock the movements to just vertical (portrait) orientation or horizontal (landscape) orientation, or let it keep adjusting automatically as you move the device. This, though, can get a little annoying as, occasionally, even the slightest change in angle can trigger a reorientation. When used horizontally, an ebook divides into two pages on screen (resembling an open book) thanks to the space available, which might be preferable to some users.",
    "As before, Kobo isn’t restricting the file format support, with 15 formats supported, including EPUB, EPUB3, PDF, MOBI, JPEG, GIF, RFT, CBZ and CBR. And you can look up the meaning of a word in some European languages (Dutch, Spanish, French, Italian, German and Portuguese) – handy if you’re learning another language (or improving your English if it’s not your first language).",
    "You can still long-press to select a word for dictionary lookup and highlight, but it’s definitely easier to use the stylus to do the latter (and this works even on sideloaded EPUBs).",
    "It would have made the reading experience a lot better if the Elipsa had page-turn buttons, but Kobo’s rapid page-turn engine (which debuted in 2018 on the Clara HD) is available – albeit it only works on ebooks purchased from Kobo. It works the same way as before – just long-press on the right bottom corner to move forward or the left bottom corner to go back. The page slider that debuted on the Libra H2O also pops up when you tap on the centre of the screen. However you choose to turn pages, there’s no ghosting or significant black blips caused by refreshes (unless the page has an image).",
    "Like all other Kobos before it, the Elipsa comes with OverDrive, Pocket and Dropbox support baked in. So you can borrow ebooks from your local public library, read longform web articles you may have saved to your Pocket account or store your entire digital library on the cloud and download without needing to connect to a computer.",
    "Where the Elipsa excels is viewing PDFs on that 10.3-inch screen, and we found that all DRM-free PDFs are editable.",
    "Writing on the Elipsa is a good experience. While the stylus isn’t quite real time, there’s only a very marginal lag that’s very easy to get used to. However, the screen isn’t completely smooth, meaning the stylus nib will, over time, suffer from wear and tear, but they are replaceable.",
    "Writing or drawing on files stored on the device, though, is restricted. As we mentioned earlier, you can annotate any ebook you’ve bought directly from the Kobo Store, but you can’t on any sideloaded EPUB. For example, you won’t be able to make annotations in the margin of a textbook in EPUB format you may have sourced from elsewhere, but you will be able to highlight sections of text.",
    "It’s a different story with PDFs though. As long as the PDF is not DRM-locked, you can scribble on it, but not highlight. PDFs can also be pinched and zoomed, although we faced rendering issues during our testing. If this functionality works well, you’ll see a small map appear on the top left corner of the page to help you orient. This could be really helpful when filling in PDF forms, for example.",
    "It’s not just books and forms that you can write on. The Elipsa also lets you create new notes on blank pages, all of which automatically get saved in the My Notebooks section accessible via the home screen. There are two types of notebooks – Basic and Advanced. Basic notes can’t be converted from handwriting to text, but can be exported to your computer or Dropbox. Backgrounds of Basic notes can be changed, so you can choose to write on a blank sheet, on a ruled page or on a grid.",
    "If you want to convert your handwritten notes to text, then you’ll need to select an Advanced Notebook. This adds a scrollbar on the right side, in case your note is a long one, and you can insert images and mathematical formulas into Advanced notes. You can't, however, change the background of the page here and you will need to write between the lines on the screen.",
    "The Elipsa’s writing capabilities are powered by MyScript, a company that produces real-time handwriting recognition software, and we’re impressed at how well this works. Even when we thought we scribbled deliberately badly on the Elipsa, the software was able to identify the words correctly and convert them into a text file. However, the process of conversion is slow. It takes about 5 seconds for a single sentence to be converted, but can take up to 30 seconds for a paragraph of about 30 words.",
    "Other than different background options, notebooks also allow you to switch orientations, change pens (including a calligraphy pen), and choose the thickness and opacity of the pen. There are even different types of erasers but we found ourselves just using the button on the stylus to ‘undo’ any errors.",
    "So, while all this sounds impressive on paper, the writing experience on the Elipsa feels restrictive because you can’t scribble on sideloaded EPUBs, the most common ebook format. But considering you can write on locked Kobo ebooks, it might just be a case of a firmware update to open up the Elipsa’s writing capabilities.",
    "Like any ereader, the Kobo Elipsa’s battery life is pretty impressive. There’s a 2,400mAh capacity battery under the hood, which is double that of the one in both the Libra H2O and Forma. This big battery can last up to four weeks on a single charge, but that will depend largely on how much you use the device and at what brightness you’ve got the screen set at.",
    "It takes a little under three hours to top up from 0% to full, which is not too bad considering the 1,200mAh battery in the Libra H2O takes over two hours. Unlike the Onyx Boox Note Air, there’s no quick charge capabilities here.",
    "[First reviewed June 2021]"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Kobo Elipsa: price and availability",
    "11": "Kobo Elipsa: screen and design",
    "19": "Kobo Elipsa: ease of use",
    "25": "Kobo Elipsa: reading experience",
    "34": "Kobo Elipsa: writing and drawing experience",
    "42": "Kobo Elipsa: battery life",
    "44": "Don't buy it if..."
  },
  "links": {
    "Onyx Boox Max3": "https://www.techradar.com/reviews/onyx-boox-max3",
    "ReMarkable 2": "https://www.techradar.com/reviews/remarkable-2-tablet",
    "10.2-inch Apple iPad (2020)": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "Kobo Store": "https://click.linksynergy.com/deeplink?id=HlvbvYZP82I&mid=38131&u1=trd-us-7160537659067870000&murl=https%3A%2F%2Fau.kobobooks.com%2Fcollections%2Fereaders%2Fproducts%2Fkobo-elipsa",
    "Onyx Boox Note Air": "https://www.techradar.com/reviews/onyx-boox-note-air-review",
    "Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review",
    "Kobo Libra H2O": "https://www.techradar.com/reviews/kobo-libra-h2o",
    "Kobo Forma": "https://www.techradar.com/reviews/kobo-forma-review",
    "Clara HD": "https://www.techradar.com/reviews/kobo-clara-hd-review"
  }
}