{
  "source": "https://www.techradar.com/reviews/logitech-g335-gaming-headset",
  "title": "Logitech G335 gaming headset review",
  "category": "computing",
  "updated": "2021-09-16T17:22:27Z",
  "author": "ural-garrett",
  "summary": "Less substance, more style",
  "verdict": "The attractive colorways and stylish design don’t mask a fairly average gaming headset that’s lacking where it counts. From sub-par audio and mic quality to a flimsy build, the Logitech G335 doesn’t perform as well as it looks.",
  "pros": [
    "Vibrant colorful design that’s gorgeous",
    "Lightweight and comfortable"
  ],
  "cons": [
    "PC users have to use a splitter",
    "Audio/mic quality doesn’t match similarly priced competitors",
    "Build feels a bit cheap",
    "Some may find that flipping mic to mute isn’t as good as a dedicated button"
  ],
  "article": [
    "Logitech brought some bold creative design decisions toward their colorful G-Series Color Collection featuring mice, keyboards and gaming headsets. The G733 Lightspeed wireless gaming headset served as the newest device beyond product refreshes.",
    "Gamers looking to go well below the G733’s $130 price range may want to consider the $69.99 (£59.34, AU $139) wired G335 as an option. 38 grams lighter than its wire-free sibling, the G335 lacks the RGB lighting on the ear cups, DTS surround sound, removable mic and only offers three colorways. What’s maintained is the angular chassis with reversible headband straps and breathable memory foam ear cups.",
    "Like the G733, it’s simply fashionable and comfortable regardless of the length of your gaming sessions. The weight loss does make the plasticy feel like it could be easily broken, though. Meanwhile, audio and mic quality doesn’t hold up well against similarly priced gaming headsets like the HyperX Cloud Core 7.1and the Corsair HS50. If you’re looking for more performance than style, you may want to look out for other headset options. Regardless, the G335 is perfect if looks matter more than performance or actual features.",
    "Available in black, white or mint, enough can’t be said in regards to the G335’s sleekness. Our mint colored review headset is offset beautifully by the lavender ear cups. For $10, users can purchase eight different headband straps, though the mint, lavender and yellow one included was cool enough.",
    "Beyond color, there’s an angular design that’s fairly minimal and futuristic, regardless of vantage point. The no-frills package means that the only on-ear controls is the volume roller, as the G335 lacks a mic on/off switch. Instead, the only way to cut the mic off is by lifting the mic up.",
    "Being a plug-and-play wired gaming headset means that it’s essentially compatible with anything that has a 3.5 mm jack. Multiplatform gaming enthusiasts could use this on every console they own without much fuss except for PC. Desktop users will have to use an included audio/mic splitter for both audio and mic usage. In an age where gaming headsets like the HyperX Cloud Core 7.1 offer a USB audio control box alongside plug-n-play for the same price, those who play mainly on PC may have an issue here.",
    "As mentioned previously, the Logitech G335’s audio quality just doesn’t compete with similar headsets. The 40 mm neodymium drivers lack clarity, richness and volume during gaming sessions. This is noticeable while playing everything from Cyberpunk 2077 to Battlefield V. Audio simply lacks the punch and clarity of rival headsets. This means the mix of gunfire, dialogue, explosions and ambient noise doesn’t sound as well put together as the Turtle Beach Recon 500 or Corsair HS50 – both priced within $10 of the Logitech G335.",
    "Unlike the HyperX Cloud Core 7.1 and the wired SteelSeries Arctis 3, the G335 lacks surround sound support. If you’re hoping to have some sort of situational awareness when it counts, you may be disappointed. The unidirectional mic lacks clarity as well unless it’s almost directly near the user's lips. This made communication during sessions a decent experience. Considering the plug-n-play nature, don’t expect any support for Logitic’s software suite either.",
    "Using a Tidal playlist to hear its flexibility with music, the G335 works as a decent pair of headphones if audio nuance isn't a priority. Listening to Jamroquai’s ten “Revolution 1993” is generally a flat experience as the intro drum roll and following bass guitar portions were lacking. Meanwhile, the headset couldn’t keep up with more bass-heavy music like Southern rapper Big K.R.I.T.",
    "The brains of the G335 doesn’t completely match its beauty, which is a shame. Overall, the angular and colorful design is what sells this gaming headset. At times it could nearly come off as a fashion accessory if handled delicately. Just don’t expect this flimsy yet comfortable headset to bring it in terms of audio clarity."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Don’t buy it if..."
  },
  "links": {
    "G-Series Color Collection": "https://www.techradar.com/news/logitechs-colorful-new-gaming-peripherals-aim-to-make-streamers-look-good",
    "HyperX Cloud Core 7.1": "https://www.techradar.com/reviews/hyperx-cloud-core",
    "Corsair HS50": "https://www.techradar.com/reviews/corsair-hs50-stereo-gaming-headset",
    "Using a Tidal playlist": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8508782636894948000/https://tidal.com/browse/playlist/a9292965-730d-4812-8e3b-27245ab3a11e"
  }
}