{
  "source": "https://www.techradar.com/reviews/hachi-infinite-m1-pro-portable-ultra-short-throw-projector",
  "title": "Hachi Infinite M1 Pro portable ultra short throw projector review",
  "category": "computing",
  "updated": "2021-01-10T23:32:58Z",
  "author": "desire-athow",
  "summary": "A projector that doubles as a virtual interactive display but with some limitations",
  "verdict": "The Hachi Infinite M1 Pro is one example of a great product in search of a market. It works fabulously well if you are cognizant of its intrinsic limitations but we feel that a high price tag and a rather limited number of real life uses make it more of a geeky curio rather than a genuinely useful technological peripheral.",
  "pros": [
    "Built in battery",
    "Touchscreen projector is a treat",
    "Works well out of the box",
    "Good audiovisual performance"
  ],
  "cons": [
    "No support for Google Mobile Services",
    "Can be a bit noisy",
    "720p resolution",
    "Slow eMMC storage",
    "Rechargeable remote control",
    "Bluetooth remote control"
  ],
  "article": [
    "Ultra short throw projectors have grown in popularity over the past couple of years thanks to improving performance and a drop in price. While most brands have been focusing on servicing the biggest slice of the market, the consumer audience. One brand though bucked this trend with the Infinite M1 Pro portable projector which can transform any flat surface into a virtual interactive display but with some caveats.",
    "At the time of writing, Amazon had the Hachi Infinite M1 Pro on offer for $1079.10 after a 10% discount via code redeemed at checkout.",
    "The M1 Pro can be positioned either horizontally or vertically depending on whether you want to use it as an ultra short throw projector or on a flat horizontal surface for a more hands-on experience. Physically, it looks like a polished charcoal-colored plastic brick with a narrow glass facia that hides the actual projector hardware and plenty of air vents to cool the components inside.",
    "A bit bigger than a DVD boxset, it measures 138 x 215 x 80mm for a weight of 1.3Kg and can rest on four tiny rubber feet when used as a UST projector.",
    "When standing up, the top includes a camera sensor, a microphone, a large power button and two volume buttons. A flap hides a USB-C connector (that doesn’t do power), there’s another dedicated USB-C connector that’s not hidden but can only do power. There’s also a HDMI connector and an headphone jack.",
    "The bundled remote control has a premium feel to it and doesn’t come with removable batteries. Instead, you have to recharge it using a micro USB port. Not being able to swap batteries around may well be an issue if you don’t have a compatible cable at hand.",
    "The remote doesn’t provide a clear indication as to when the built-in battery will run out and while the Infinite M1 Pro does come with a dedicated power supply unit, it doesn’t come with a compatible micro USB cable (or a charger) to charge the remote.",
    "The set of components inside the M1 Pro is actually quite powerful compared to the drivel that many projector vendors bundle with their products. Hachi used a Qualcomm Snapdragon 670, the same octa-core SoC used in the Google Pixel 3a, and paired it with 6GB of RAM and 128GB onboard storage (sadly eMMC, rather than the faster UFS type).",
    "The manufacturer also crammed a 5-megapixel camera, Wi-Fi 5 connectivity, Bluetooth 5.0, a pair of 5W speakers and two microphones. Surprisingly, there’s also a 5000mAh battery, enough to power the device for up to 2.5 hours, a feature that highlights the device’s versatility. You can use it for video conferencing, as a business projector, for educational purposes, for a presentation or as a large format display thanks to its native support for Miracast and AirPlay.",
    "Note that the native resolution of the M1 Pro is only HD/720p (1280 x 720 pixels); it uses the ubiquitous TI DLP technology with a rated brightness of 600 ANSI Lumens (measured centrally) and a 600:1 contrast ratio.",
    "First things first, you will have to set up your projector like you would do with an Android smartphone. You will need to use it as a touchscreen device first and then pair the Bluetooth remote control. Don’t try to - as we did without reading the manual - switch on the projector and use the remote to set up the device.",
    "The M1 Pro uses a custom UI called Infinite OS which sits atop Android 9.0 and reminds us of the attempts by Android box manufacturers to conjure a sleek user interface.",
    "There’s a bunch of preloaded applications including a couple of Hachi’s own (like an AI kitchen) but the device doesn’t come with Google Play as it is not yet officially certified. You do have Chrome but no YouTube.",
    "In a statement, the company said that “We're working diligently to certify the device for use with Google Mobile Services and anticipate completing this process in the coming months, at which time previously purchased devices will be able to access GMS through a simple software update. Currently, GMS-based apps are not available for download directly onto the device. In the meantime, however, apps that require GMS such as YouTube, Hulu, etc. can be easily accessed and used normally on the device via the web browser. These apps can also be screen casted to the projector when paired with any Android or iOS device.”",
    "You can operate the projector through the remote control, physical buttons located on the top of the device or, more interestingly, through its 10-point virtual touchscreen technology called Anypoint. It is calibrated to be used as a 23-inch screen size when projected horizontally or horizontally. Note that both the focus and keystone correction are processed automatically on either axis.",
    "The virtual touchscreen feature works a treat once you get the gist of it. You need a reasonably large white surface to get the most of it, around 51 by 29cm (or a diagonal of 58.8cm). Increase it to 43cm and the diagonal size shoots to 202cm. Picture quality is not on par with traditional UST projectors (like the Bomaker Polaris 4K projector) but it is more than adequate especially in a dark room.",
    "More surprising perhaps was the sound quality which, in all honesty, was quite good. It hit the right notes, so to say, delivering enough bass when needed (e.g. a soundtrack) and clear, rich definition without any artefact on a speech or a conversation.",
    "Touch typing is sort of possible but be aware that for best results, the sensor needs to see what your fingers are doing. Accidentally created shadows have, many a time, frustrated our hands-on and yes, the touchscreen feature will work when projecting vertically but is far trickier.",
    "Last but not least, the camera serves a purpose in (vertical) projector mode but we fail to see its use elsewhere. The ability to rotate it up or down or sideways would be useful.",
    "The Hachi Infinite M1 Pro offers a neat introduction to the otherwise rather complicated world of bring-your-own-display. Being able to transform almost any smooth flat surface into a board game or a virtual piano - either horizontally or vertically - is sure to earn you cookie points as long as you’re aware of the restrictions of the device.",
    "Beyond the novelty, we struggle to see the wider appeal especially given its $1000+ price tag. Yes you can project on a wall and it is awkward to use and is not as responsive.",
    "What we are therefore left with is a HD ultra short throw projector that can double as a fixed virtual horizontal touchscreen display (projecting downwards). We’d love to see the M1 Pro sport a USB-C supporting PD that can transmit data and power, voice control (via Google Assistant), a bigger battery as well as a compartment to store the remote control and charge it."
  ],
  "headers": {
    "1": "Price and availability",
    "2": "Design",
    "7": "Hardware",
    "10": "In use",
    "19": "Final verdict"
  },
  "links": {
    "portable projector": "https://www.techradar.com/news/best-portable-projectors",
    "Hachi Infinite M1 Pro": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FHachi-M1Pro-Infinite-Immersive-Ecosystem-Entertainment%2Fdp%2FB08LSTS162%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6323780962555993000-20",
    "Google Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "business projector": "https://www.techradar.com/news/best-business-projectors",
    "large format display": "https://www.techradar.com/news/large-format-displays",
    "Bomaker Polaris 4K": "https://www.techradar.com/reviews/bomaker-polaris-4k-ultra-short-throw-laser-tv"
  }
}