{
  "source": "https://www.techradar.com/reviews/instant-vortex-mini",
  "title": "Instant Vortex Mini review",
  "category": "appliances",
  "updated": "2021-11-03T11:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Small, but certainly not lacking",
  "verdict": "The Instant Vortex Mini is a compact air fryer that cooks crisp fries and crunchy but succulent chicken wings. Simple to use, we did need to experiment with cooking times to achieve crisp, fully cooked results, and its capacity is suitable for singles – or, at a push, couples with small appetites. That said, it’s an easy to use air fryer that makes it worthy of consideration.",
  "pros": [
    "Extremely compact",
    "Produces crisp, evenly browned results",
    "Easy to clean"
  ],
  "cons": [
    "Basket isn’t dishwasher-safe",
    "Reheat function can’t replace a microwave",
    "Requires experimentation"
  ],
  "article": [
    "Instant is well-known for its kitchen appliances, having achieved cult status with the Instant Pot – a multi-cooker that can pressure cook, slow cook, steam, saute and even make yogurt. The brand even has a line of air fryers that offer several cooking methods in one device.",
    "The Instant Vortex Mini is a smaller, more compact version of the Instant Vortex air fryer – which, like other air fryers on the market, uses hot air to create crisp, crunchy foods. According to Instant, it cooks using around 95% less oil than deep frying. It retains the all-plastic design of the full-sized air fryer, but moves the control panel to the angled top of the machine, creating a sleeker finish. It’s available in red, white and black, as well as aqua in some territories.",
    "The Instant Vortex Mini can roast, bake and reheat as well as air fry, and can hold up to 2 quarts / 2 liters of food, which Instant says is enough for two portions. The basket-style air fryer has a removable crisper tray and offers four preset programs for these cooking functions. A dial lets you customize the temperature and cooking duration of these modes.",
    "At $59.99 / £59/99 / AU$99.99, the Vortex Mini will suit individuals or couples wanting a healthier way to enjoy fries, chicken wings, and other indulgent foods, as well as those looking for a compact, streamlined device.",
    "The Instant Vortex Mini will set you back $59.99 / £59.99 / AU$99.99, which makes it the most affordable air fryer the brand offers. It’s available from Instant Pot direct or Amazon in the US and UK, while in Australia it’s sold through the Corelle website. It offers the same four cooking methods as the Instant Vortex air fryer, which costs $99.99 / £99.99 / AU$229.",
    "The Instant Vortex Plus is the brand’s top-of-the-range air fryer and builds on the Vortex and Vortex Mini with the addition of a dehydrate and grill cooking function. It’s priced at $119.95 / £119.99 / AU$269",
    "The Instant Vortex Mini is one of the most compact air fryers we’ve tested, measuring just 11.7 x 9.0 x 11.3 inches / 28.6 × 22.9 × 29.8cm. It has a capacity of 2 quarts / 2 liters, which Instant claims is enough for two portions. However, those with large appetites may well be disappointed at what is classed as one portion. It’s available in red, white and black, and there’s also the option of an aqua model in the UK and US.",
    "As mentioned, unlike the Instant Vortex and the Instant Vortex Plus, this basket air fryer features a control panel on the top, positioned at an angle. It features one-touch access to four cooking modes: air fry, roast, bake and reheat. There’s also a dial that allows you to customize the temperature and cooking duration for each cooking mode. The air fryer has a temperature range of 120 to 400ºF / 49 to 205ºC and it can cook for a maximum duration of 60 minutes.",
    "A crisper plate that sits inside the air fryer’s basket is dishwasher safe – but, unfortunately, the basket itself will need to be washed by hand. There’s no recipe booklet included with the air fryer; instead, you’ll need to go online or use the Instant app for your smartphone or tablet for inspiration.",
    "The Instant Vortex Mini may be small but it's certainly mighty when it comes to air-frying. Everything we cooked in the appliance, from homemade fries to chicken wings and even frozen steak cut fries, had a crisp, crunchy exterior. In addition, the insides of the fries were soft and fluffy, while the chicken wings were succulent and juicy.",
    "However, this wasn’t a result of any guidance from the Instant app – all the recipes here are for Instant’s larger-capacity air fryers and don’t provide any suggestions for using the Vortex Mini. We achieved the results we did through our own experimentation.",
    "Although the basket could hold the usual 1.1 lb / 500g of frozen steak cut fries, it was obvious this wouldn't allow for optimum cooking. Instead we knocked this down to 0.7 lb / 300g to ensure the fries weren’t too tightly packed.",
    "Since the Vortex Mini doesn’t come with a frozen food program, we set the appliance to our go-to temperature of 385ºF / 196ºC and a time to 12 minutes. At the end of that time, the fries were evenly browned and cooked through. We used the same temperature when preparing homemade fries, once again reducing the quantity to 0.7 lb / 300g. We used just one tsp of oil rather than the usual two, but were still left with deliciously crunchy fries.",
    "When it came to chicken wings, the crisper plate was just too small to fit in our usual testing batch of five, so we cooked just four pieces instead. Following 10 minutes of cooking time, the wings presented with golden, crisp skin, with a succulent and juicy inside.",
    "Handily, the Vortex Mini comes with a reminder to shake feature, in the form of a visual and audible alert when it’s time to rotate the food in the air fryer’s basket. We also liked the safety feature that ensures none of the presets can be activated unless the crisper basket has been inserted into the air fryer.",
    "During cooking, the Instant Vortex Mini registered 57db for noise on our decibel meter, which is equivalent to the gentle hum of a refrigerator, making it one of the quieter air fryers we’ve tested.",
    "First reviewed: October 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Instant Vortex Mini price and availability",
    "6": "Design",
    "9": "Performance",
    "16": "Don't buy it if..."
  },
  "links": {
    "Instant Pot": "https://www.techradar.com/reviews/instant-pot-pro",
    "Instant Vortex air fryer": "https://www.techradar.com/reviews/instant-vortex-air-fryer",
    "air fryers": "https://www.techradar.com/news/best-air-fryer",
    "Instant Vortex Plus": "https://www.techradar.com/reviews/instant-vortex-plus-air-fryer-review"
  }
}