{
  "source": "https://www.techradar.com/reviews/gopro-hero-10-black",
  "title": "GoPro Hero 10 Black review",
  "category": "cameras",
  "updated": "2021-09-17T11:24:56Z",
  "author": "mark-wilson",
  "summary": "Fully evolved, but a chip off the old block",
  "verdict": "It doesn't reinvent the action camera, but the Hero 10 Black is a much more user-friendly and refined version of its predecessor, and the most versatile action cam you can buy. The new slow-mo frame rates and wired data transfer modes are useful, while the snappier interface and small image quality improvements make it an enjoyable waterproof companion for adventures and b-roll footage. Its rivals now offer larger sensors and better value, though.",
  "pros": [
    "Snappier menus and interface",
    "Powerful GP2 processor",
    "New 4K/120p mode is fun",
    "Class-leading stabilization",
    "New lens cover repels water",
    "Faster wired transfer mode"
  ],
  "cons": [
    "Same small sensor",
    "Still not a low-light king",
    "Budget rivals offer better value"
  ],
  "article": [
    "The GoPro Hero 10 Black is the latest in a long line of Hero action cameras that stretches all the way back to 2005. It's the most polished, powerful GoPro so far thanks to its new GP2 processor, but it's also only a relatively minor upgrade over its Hero 9 Black predecessor.",
    "Every so often GoPros make a big leap forward: the GoPro Hero 5 Black was waterproof without needing a case, and the Hero 7 Black introduced HyperSmooth stabilization. Despite its momentous name, the Hero 10 Black isn't one of those models. But it does refine (and fix) most of the new features we saw on the Hero 9 Black, while adding a sprinkling of new shooting modes and better usability.",
    "The Hero 10 Black is built around the same 23MP 1/2.3-inch sensor as its predecessor and is waterproof down to 10 meters, but it's that new GP2 processor that unlocks most its new talents. Chief among these are some new shooting modes, including new 5K/60p, 4K/120p and 2.7K/240p options. The latter two are fun, slow-mo affairs that are perfect for social media cut-scenes or b-cam footage, particularly as GoPro's revamped Quik app will happily do some of the editing for you.",
    "Other improvements include a much more responsive touchscreen interface (the Hero 9 Black fell down here), a handy new wired data transfer mode for phones, and some under-the-hood image quality boosts, including local tone mapping and improved low-light noise reduction. There are certainly some small improvements to video quality as a result, but the Hero 10 Black can still only do so much with its relatively small image sensor.",
    "More significant for most people will be the fact that HyperSmooth 4.0 remains the best action camera video stabilization tech around, while watersports fan will enjoy the effective new hydrophobic coating on its toughened-up lens cover.",
    "It's a shame the Hero 10 Black hasn't moved up to a larger sensor like the Insta360 One R 1-Inch edition, while GoPro's recent moves into webcam and livestreaming continue to come with limitations on resolutions (still only 1080p) and platform support (although it is now possible to livestream with HyperSmooth stabilization).",
    "Despite its relatively conservative upgrades, though, the GoPro Hero 10 Black does nicely refine the image-quality strides made by the Hero 9 Black, and it's the most user-friendly, powerful action camera you can buy – if not exactly the best value.",
    "The GoPro Hero 10 Black is available to buy now for $399 / £379 / AU$599.95 if you sign up for a GoPro Subscription, or for $499 / £479 / AU$749.95 on its own. It'll also be available in India for Rs 54,500 from early November.",
    "The GoPro Subscription, formerly known as GoPro Plus, costs $49.99 / £49.99 / AU$69.99 per year when bought separately, and you'll be set up to auto-renew annually if you buy the Hero 10 Black with a subscription, although you can avert that by cancelling the subscription at any time during the first year.",
    "Given that you're not obligated to renew the subscription, it's likely the best way for most people to buy the Hero 10 Black. Included in the GoPro Subscription is unlimited cloud storage for videos and photos at full quality, automatic uploads, full access to the Quik app's editing tools, 50% off all accessories (up to 10 per year), live-streaming support, and replacements for broken cameras (for a fee, depending on the camera).",
    "GoPro will continue to sell the existing models in its camera range at their current prices, with no models discontinued. This includes last year's Hero 9 Black ($349 / £329 / AU$529), along with the Hero 8 Black ($279 / £259 / AU$419) and GoPro Max ($399 / £379 / AU$659). All of those prices are with a GoPro subscription, but again you can also buy them without one.",
    "The GoPro Hero 10 Black is, physically, nigh-on identical to its predecessor. The only external difference from the Hero 9 Black is the new model's fancy blue logos on the front and side.",
    "GoPro has made a couple of subtle tweaks, though, and the big one for watersports fans is the new lens cover. This now has a water-repelling hydrophobic coating, and it really works – we ran the Hero 10 Black and its predecessor under a tap, and the new lens cover was significantly better at repelling water, leaving no droplets to obscure your view.",
    "This lens cover also apparently has greater scratch resistance, which was trickier to try out on our loan sample – although an unplanned test when our head-mounted GoPro flew off after a heavy zip-line landing and came to rest in some jagged wood chips resulted in no obvious marks on the lens. Like the Hero 9 Black, this lens cover is also removable and replaceable if it does suffer serious damage, like a direct hit from an Airsoft pellet, or want to add ND (neutral density) filters.",
    "The Hero 10 Black is actually 5g lighter than its predecessor, although we can't tell exactly where GoPro has made this weight saving, and it brings no practical advantages anyway. Like before, the camera has folding 'fingers' in its base for mounting it directly onto accessories. These first appeared on the Hero 8 Black, and mean you don't need to fiddle around with an extra housing to bolt the camera onto your helmet.",
    "If you're not familiar with the Hero 9 Black, here's a quick refresh of the other design features the Hero 10 Black has inherited. There's a 1.4-inch front LCD for vloggers, which GoPro says is now a little smoother when showing movement than before, thanks to higher frame rates enabled by its GP2 processor (more on that later). although this screen is so small that we honestly couldn't tell the difference from its predecessor.",
    "Far more noticeable is the improved 2.27-inch rear touchscreen. Again, GoPro says this has \"improved touch sensitivity\", but the real difference comes from the power of the GP2 processor. The Hero 9 Black's sluggish, unresponsive rear screen was one of our biggest criticisms of that model, and while it did improve with a recent firmware fix, it's still nowhere near as snappy as the Hero 10's touchscreen.",
    "Let's be clear – this is how the Hero 9 Black should have performed from the outset, so it's hardly a win for its successor. But the faster startup times (it's typically ready to go in under five seconds, compared to eight seconds for the Hero 9 Black) and smartphone-like snappiness do make it far more enjoyable to use than last year's often frustrating experience.",
    "Open the Hero 10 Black's side door and you'll find the same 1,720mAh battery as the one used by its predecessor. Like the 1.4-inch front LCD, this was another change that was introduced on the Hero 9 Black, so it's something to be wary of if you're upgrading from an older GoPro – your older 1,220mAh batteries won't work here.",
    "Flanking the battery cover are a microSD card slot and USB-C port. The latter is used for charging, but it can also be used to directly transfer footage to your Hero 10 Black via wired transfer (this is about 50% faster than wireless transfers). It's a simple enough process with Android phones, which just need a USB-C to USB-C cable, but iPhone users will need the Apple Lightning-to-USB camera adapter, plus a standard USB-A to USB-C cable.",
    "Overall, then, the Hero 10 Black is a hardy pocket camera that's waterproof down to 10 meters, and which feels a little more polished than its predecessor.",
    "Last year, the GoPro Hero 9 Black introduced a new image sensor. It was the same-sized sensor as those in previous GoPros (1/2.3-inch), but had a higher resolution that enabled that camera to be the first GoPro to shoot 5K video. The Hero 10 Black has this same image sensor, but pairs it with a new GP2 processor that unlocks some handy new talents.",
    "The GP2 chip is the first big processing upgrade we've seen in GoPros for four years, and it's long overdue. The GP1 struggled to cope with the increased demands placed on it by the Hero 9 Black's dual screens and higher-resolution sensor, and its successor is behind pretty much all of the improvements you'll find in the Hero 10.",
    "What are these improvements? Alongside the aforementioned boosts to start-up times and touchscreen performance, there are also some useful new frame-rate modes that make it a more versatile action camera. You can see a summary of the new modes in the table below, but the particularly fun ones are the slow-motion options – including a long-awaited 4K/120p mode.",
    "The headline video improvements are those high frame-rate modes, but there are also some more enhancements. GoPro has been doing some algorithmic tinkering, and its GP2 chip brings local tone-mapping – an HDR processing technique for improving dynamic range – from its photo mode to video as well.",
    "In theory, this enhances contrast in specific areas of the video (rather than globally, across the whole frame) to bring out more detailed textures. In a similar vein, GoPro says it's improved its '3D noise reduction' to boost the Hero 10 Black's low-light performance in dimly-lit scenes (think woodlands, dusk or your home).",
    "Do these work? In a side-by-side comparison with the Hero 9 Black using the same settings, we did see a noticeable improvement in the definition of fine details (trees and grass, for example) on the Hero 10 Black. Look closely, and footage from its predecessor looked a little smudgy by comparison. This may only be noticeable to pixel-peepers though, and the noise reduction improvements were less obvious. It's a subtle rather than a dramatic difference.",
    "Probably more useful to most people are the final GP2-related improvements: better in-camera horizon leveling and HyperSmooth 4.0. The option of automatic horizon leveling, which keeps your footage level even if you're rocking from from side to side, used to only be available in GoPro's app. The Hero 9 Black introduced an in-camera version, but the Hero 10 Black's horizon-leveling skills are much more powerful, with the ability to correct footage that's been skewed by 45 degrees, rather than just 27 degrees.",
    "This is a handy feature for mountain bikers or skiers who want smooth footage that won't give viewers motion sickness. Another bonus on this front is HyperSmooth 4.0, which brings the stabilization's powerful 'High' mode to the Hero 10 Black's most demanding modes (5.3K/30p, 4K/60p and 2.7K/120p). Rivals like the Insta360 One R 1-Inch edition might have trumped GoPro with their larger 1-inch sensors, but in our experience HyperSmooth remains the best form of stabilization on any action cam.",
    "Finally, if you've been thinking of using a GoPro as your livestreaming camera, the Hero 10 Black brings one other upgrade here – you can now stream with HyperSmooth 4.0 stabilization.",
    "Unfortunately, there are still all sorts of restrictions on live-streaming with a GoPro, depending on your preferred platform – for example, Twitch is iOS-only, while YouTube requires you to have a channel with 1,000 subscribers, and you can also only create a private livestreaming link to send to friends if you're a GoPro subscriber. But the addition of HyperSmooth certainly makes it a much more useful tool for those who want to create action-packed streams with lots of movement.",
    "Naturally, the GoPro Hero 10 Black also inherits all of the special shooting modes we saw on the Hero 9 Black. These include TimeWarp 3.0 (one of our favorite modes, which creates a stabilized timelapse film) and 'Power Tools', which were first teased in GoPro Labs. This group of features, which still feel a little 'beta', bring some specific modes that are collectively very useful.",
    "One of our favorites, 'Hindsight', constantly buffers video so that when you press the shutter button you can record the previous 15 or 30 seconds of video; no longer will your dog's impromptu japes go unrecorded. Another 'Power Tool' includes 'scheduled capture', which enables you, for example, to leave your GoPro set up to capture the sunrise; it's not exactly earth-shattering, but it all boosts the Hero 10 Black's versatility. We'd note, though, that many of these features are also available on the older Hero 8 Black once you've loaded the GoPro Labs firmware onto the camera.",
    "While the Hero 10 Black's GP2 processor does make it a more polished, fun camera to use than its predecessor, some aspects of its performance are still typical GoPro.",
    "One of these, unfortunately, is battery life and overheating. The 10 Black has the same battery as the Hero 9 Black, which at 1,720mAh is larger than the batteries in all previous GoPros. But much of that capacity is drained by the Hero 10 Black's more demanding dual screens and high frame-rate modes.",
    "In our battery test, with the camera shooting a continuous 4K/30p clip with HyperSmooth on and the screen brightness at 50%, we managed to get 72 minutes of recording from the Hero 10, which included two breaks for overheating, when the camera shut down under the strain.",
    "This is actually a little less than we got from the Hero 9 Black, and similar to the result for the Hero 8 Black, so it's clear that the old GoPro adage is true: make sure you carry a spare battery or two with you. In a real-world test, during a visit to an adventure park, our fully charged Hero 10 Black gave us three and a half hours before conking out. That was a taxing afternoon for the camera, with lots of menu swiping and changing of frame-rates, but this is also a typical day out for a GoPro.",
    "Another traditional GoPro weakness, audio, also hasn't improved from the Hero 9 Black. The microphones do produce acceptable sound quality in quieter environments, while voice isolation and the handling of wind noise are certainly superior to older GoPros. But if you want to guarantee audio that matches your video quality, then we'd recommend getting the Media Mod accessory, and either plugging in a lavalier mic, or getting a wireless option like the Rode Wireless Go II.",
    "On the plus side, though, the Hero 10 Black's new slow-mo modes (4K/120p and 2.7K/240p) are a lot of fun, and a great way to bring a change of pace to your social media videos. As always, there is a noticeable quality drop when shooting in these modes, particularly if you find yourself in anything other than bright sunlight, but the versatility these modes give you, particularly when combined with horizon-leveling and HyperSmooth stabilization, makes them one of the main reasons to upgrade from an older GoPro.",
    "GoPro has made some changes to the default video settings on the Hero 10 Black. The action cam maker has seemingly outgrown the signature saturated look it's leaned towards previously, instead going for a more natural style out of the box.",
    "There are actually now three color settings to choose from. Previously you either had the option of a 'GoPro' color profile (which produced punchy, bold colors) and a 'flat' one that you could grade afterwards. But now there's an additional 'Natural' profile, which is the new default, and we're pretty big fans of it.",
    "GoPro has also dialed down the 'sharpness' to medium by default (another good move), but we tended to shoot with it on 'low', and with the bit-rate set to 'high' (or 100Mbps) for maximum image quality. When compared to footage shot on the Hero 9 Black with the same settings, the results were similar, but with subtle improvements that are likely down to that new local tone mapping.",
    "Still, the Hero 9 Black had already made the big advances in areas like detail over older GoPros with that new sensor, and you're unlikely to notice a huge difference here unless you're really pixel-peeping. The 5K/60p mode is a nice-to-have, if not ideally suited to action scenes due to the more limited stabilization that's available, but it's the new slow-mo modes that are the most fun.",
    "There's undoubtedly still a softness to the video in the Hero 10's slower frame rates of 120p and 240p (particularly the latter), but the option of shooting 4K/120p and 2.7K/240p lifts them from novelty status to something genuinely usable. GoPro's HyperSmooth also remains the best you'll find on an action cam, while the boosts to horizon leveling are another welcome bonus.",
    "On the other hand, not many people buy a GoPro to shoot stills – and while the Hero 10 is a passable, waterproof stand-in for your smartphone, it has been left a little behind on this front by rivals. In good light, the results are pretty crisp and colorful, while SuperPhoto can help you regain some highlight details from areas like sky. But the 3MP resolution boost from the Hero 9 Black won't be noticeable to most, and in tough scenes – including low light ones – it simply can't compete with the computational pipelines of Apple, Google and Samsung. You do get the option to shoot in raw, but this is only available in the 'wide' fisheye view and shadow recovery is limited with a 1/2.3-inch sensor.",
    "Perhaps the more sensible approach to GoPro snapping is to simply accept the sub-smartphone quality, and embrace the convenience of 'frame grabs', which now let you grab slightly improved 15.8MP stills from 5.3K video (or 19.6MP from 5K 4:3 footage). The kind of shots you get from doing this are unlikely to be found in your phone's camera roll, and the GoPro's ability to venture into dangerous territory remains one of the main reasons to buy one."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "GoPro Hero 10 Black price and release date",
    "11": "Design",
    "21": "Features",
    "33": "Performance",
    "39": "Video and image quality",
    "46": "Don't buy it if..."
  },
  "links": {
    "Insta360 One R 1-Inch edition": "https://www.techradar.com/reviews/insta360-one-r-1-inch-edition",
    "GoPro Labs": "https://www.techradar.com/news/gopro-labs-lets-you-unlock-new-hero-8-black-features-heres-how-to-try-it-now",
    "Rode Wireless Go II": "https://www.techradar.com/reviews/rode-wireless-go-ii"
  }
}