{
  "source": "https://www.techradar.com/reviews/westhost",
  "title": "WestHost review",
  "category": "computing",
  "updated": "2021-03-04T20:30:14Z",
  "author": "mirza-bahic",
  "summary": "This US-based host has been tempting new users with its pocket-friendly solutions for more than two decades",
  "verdict": "WestHost is a US-based company launched in 1998 with an aim to become one of the best known web hosting providers for newbies and veterans alike. Although its products present a good value for money in general, its cheapest entry-level plan leaves a lot to be desired.",
  "pros": [
    "Budget-friendly hosting options",
    "Customer support is available at all times",
    "Free SSL certificate, but with annual packages only",
    "Free website migration, but for cPanel users exclusively",
    "Standard 30-day money-back guarantee",
    "User-friendly and a solid option for newcomers"
  ],
  "cons": [
    "Capable customer support is not one of its trump cards",
    "No free domain with less expensive plans",
    "Massive price hike after the start-up period",
    "The entry-level plan is nothing special",
    "There is no guarantee on uptime"
  ],
  "article": [
    "Since its founding in 1998, WestHost has been providing simple yet comprehensive web hosting solutions to all sorts of businesses, helping them “leave their mark in the digital world.” With more than two decades of experience, data centers all over the world and a goal to remain pocket-friendly, it is hardly surprising that they have registered over one million domains so far.",
    "As the name suggests, WestHost’s main office is situated in the West (obviously). It is situated in Providence (the USA), to be more precise. Their data centers are equipped with tier- 3 technology and deployed in a disaster-safe zone near Salt Lake City (the USA), while others are scattered across seven global locations, some of them being the UK, Canada, Brazil and India.",
    "Upon reaching WestHost’s main website we were struck with an eerie feeling we’ve seen all this before and then it dawned upon us. Since both hosts are under the wing of UK2 group (company from the UK) WestHost’s website is almost indistinguishable from Midphase’s site (as well as the one from the UK2 itself) and we are sure the similarities are beyond skin-deep.",
    "Although the layout is a bit different, WestHost’s official blog is much like the one found with its counterparts, which is (actually) a compliment. It isn’t overflowing with articles, but those which are there cover some of the most important issues related to hosting, especially for newcomers (what hosting package to choose, how to protect your site, does SSL affect website’s traffic and so on).",
    "WestHost is supposed to be present on Facebook, Twitter and Google+, but the first two accounts seem rather neglected and the Google+ one is actually unavailable and has been in that state since 2019.",
    "All in all, WestHost’s main website, although far from the most visually lackluster websites we’ve seen, would greatly benefit from being polished up a bit.",
    "WestHost’s hosting plans are presented in a clear way in which they are easy to compare and contrast with each other. There are plenty of them to choose from for each provided type: shared hosting, email hosting, WordPress-optimized hosting, managed VPS and dedicated servers.",
    "The starter shared hosting plan will cost you mere $1.99 per month, however, after the initial one year the price will rise up to $8.00, which is (evidently) four times more than originally asked for. This plan comes with a number of limited features: ability to host one website, 50GB of disk space, 1000GB of bandwidth and one database. Refusing to spice up the deal even further, this plan comes without free domain registration or an SSL certificate, which is not particularly encouraging to the first-time users. To acquire an SSL (which is a must-have today), you’ll have to go for the “Business” package, which is the most expensive one out of the three.",
    "For shared hosting plans, WestHost provides its users with a usual 30-day money-back guarantee (which, predictably, excludes domain names), so you can try them out without the need to worry.",
    "As expected, available methods of payment are all major credit cards plus PayPal.",
    "As it usually is with the companies that are part of the UK2 group, all hosting plans are introduced in a straightforward fashion, ensuring that the decision making process remains a piece of cake. After going for a plan, you’ll be required to select a billing cycle, which can go on monthly, annual or biannual basis. It almost goes without saying, the longer the cycle, the lower the cost. We must add that we are always glad to see a monthly billing option, since it is not always available, despite the fact that it may appeal to the first-time users.",
    "On the same page you can include a couple of add-ons for an extra cash, one of which (SiteLock, to be precise) requires to be purchased for a year at a minimum. The next step is to solve a domain name problem, and you can either register a new one (for free if you didn’t opt for the cheapest package) or use the one you already have. If you are registering a new domain, you’ll surely notice that there are many of them on the offer, some on sale, but all with a complete DNS control.",
    "During the third step, if you are a new customer (as you probably are), you’ll be asked to provide your name (or the name of your company), your e-mail and the country of residence. That is all and it is pleasantly uncomplicated. After you make your payment, the account should be set up within 24 hours and ready-and-willing. WestHost’s user interface is easy-to-use and comes with a fully integrated industry leading Linux-based cPanel, which is always a good thing to see. With this one-click installer and a website builder (with hundreds of rather good-looking templates) your website should be up and running in no time.",
    "WestHost describes its network of data centers as “powerful” but cleverly avoids any promises with regard to its speed performance. With a good reason, it appears, since the results we got after testing the speed of WestHost’s main website (as provided by GTmetrix) were a bit underwhelming. The load time was above the average (5.2 seconds in comparison to the average result of 8.1), but most of the core metrics were just around average, some above and others below. This is not a bad performance per se, but it can’t be described as a stellar one either. With GTmetrix rating the site’s performance with a C (75%) we reckon that the “average” is the most suitable word.",
    "Interestingly, WestHost offers no uptime guarantee, which doesn’t instill much trust in reliability of their services. However, after monitoring the uptime of their main site for one month (as enabled by UptimeRobot), we were presented with 100% of uptime. The only recorded instance of downtime lasted for 13 minutes before the issue was solved, which looks pretty promising, especially since our expectations weren’t too high.",
    "There are quite a few ways to get in touch with WestHost’s support team and they are (like they say) just a click away. The live chat is open 24/7 if you need immediate help. If not, there is an option to submit a ticket or try to reach them via one of several email addresses, each corresponding to a specific department. In addition, there are two telephone numbers: one is international and another is reserved for the UK citizens and is toll-free.",
    "Reading through reviews on different customer platforms (most notably on Trustpilot) left us somewhat skeptical when it came to the quality of WestHost’s customer support. The most common complaint was related to the time it took the agents to respond to some relatively complex issues the customer had, which was (according to one user) a total of 18 days. Although our own experience with WestHost gave us no cause for complaint, we did, admittedly, ask a few rather simple questions, while these dissatisfied users needed technical assistance which they didn’t get fast enough.",
    "Fortunately, since WestHost’s website is fully equipped with self-help options, users who want to find solutions on their own (or those still waiting for a response from the WestHost’s support team) can browse FAQ section, guides for newcomers, knowledgebase and their official blog.",
    "Bluehost and WestHost are US-based companies that share certain commonalities with regard to price and features, and both are likely to drop a bombshell with price spikes after the promotional period. Both are equally beginner-friendly and will probably appeal to those new in the trade, especially since the standard 30-day money-back guarantee (which both hosts provide) ensures that no one should feel double-crossed at the end of the day.",
    "Midphase is a younger child of the same parent company (as WestHost) that offers a full list of hosting-related services, data centers in both the US and the UK and everything at affordable prices. Although both hosts are highly skilled, customers from the UK might find Midphase’s data centers more convenient and all users are likely to appreciate its customer service, since most reviews described it as “prompt and painless”, which (at least occasionally) isn’t the case with WestHost.",
    "Like WestHost, HostGator is a popular hosting company from the USA with years of experience under its belt and more than a couple of attractive features. Although both hosts cultivate a beginner-friendly attitude, HostGator goes a step further and provides a free domain registration, SSL certificate and a website builder even with the entry-level plan (which starts at mere $2.75 per month).",
    "To those who are looking for a pocket-friendly shared hosting plan to fire up their websites, both Hostinger and WestHost may appear like a good choice and (to some extent) they really are. However, after taking pricing, features, performance and customer support into the account, Hostinger is the one that will carry the day in every respect.",
    "Much like its sister companies, WestHost has been providing all kinds of customers with well-thought-out hosting solutions for more than two decades, which is a testament to the quality of its products. Although WestHost has an abundance of strong points, customer service is not one of them. Hence, if you’re used to finding solutions on your own, check out WestHost, since its do-it-yourself section has much to offer. However, if you would prefer customer support you can rely on (and practically everything else WestHost can supply), consider Hostgator and Bluehost as a starter home for your website."
  ],
  "headers": {
    "6": "Plans and pricing",
    "10": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "18": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "WestHost": "https://www.westhost.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "UK2": "https://www.techradar.com/reviews/uk2",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "email hosting": "https://www.techradar.com/news/best-email-hosting-providers",
    "managed VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "DNS": "https://www.techradar.com/news/best-dns-server",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Midphase": "https://www.techradar.com/reviews/midphase",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Hostinger": "https://www.techradar.com/reviews/hostinger"
  }
}