{
  "source": "https://www.techradar.com/reviews/razer-blackwidow-v3-mini-hyperspeed-review",
  "title": "Razer BlackWidow V3 Mini Hyperspeed review",
  "category": "computing",
  "updated": "2021-05-25T15:00:00Z",
  "author": "richard-devine",
  "summary": "Razer just launched the perfect gaming keyboard",
  "verdict": "The 65% keyboard is the sweet spot for gaming and working and Razer just laid down a marker for the rest to aim for. This keyboard oozes style, quality and performance, but the trade off for going wireless is a pretty high price.",
  "pros": [
    "Iconic BlackWidow styling",
    "65% form factor",
    "Choice of switches",
    "No companion app required",
    "Wireless over Bluetooth and 2.4GHz"
  ],
  "cons": [
    "Chroma RGB dramatically reduces battery life",
    "High price"
  ],
  "article": [
    "Compact keyboards have a number of benefits for PC gamers. If you travel about, they take up less space in your gear bag, and when on the desk it’s the same story. Why waste valuable space on a full-sized keyboard full of keys you’ll never use anyway.",
    "Increasingly, smaller gaming keyboards are breaking free of their niche appeal and becoming extremely popular among the mainstream. The new Razer BlackWidow V3 Mini Hyperspeed, while long on name, is short on form-factor and is the company’s newest compact keyboard.",
    "However, unlike the previous Huntsman Mini, the BlackWidow V3 Mini Hyperspeed is a 65% design. And that makes a huge difference.",
    "As soon as you open the box you know this is a Razer BlackWidow keyboard. The iconic design with its all-black exterior and steep angled chin is paired with a chunky, but incredibly sturdy build. But it’s not heavy, so if you do intend to carry this around, you won’t feel much in your bag. You also get two-step angled feet underneath as on some of Razer’s other keyboards, to give you a more ergonomic position.",
    "The Razer BlackWidow V3 Mini Hyperspeed is, as the last word of its title indicates, a wireless keyboard. Like the larger BlackWidow V3 Pro, it uses Razer’s Hyperspeed wireless technology to push out performance on par with a wired keyboard. Alternatively, you can connect over Bluetooth which might not be the preferred choice for gaming, but it makes using it with a laptop or an office PC more convenient.",
    "Like on its larger sibling, it really does work. Razer once showed us some graphs to illustrate how good its Hyperspeed tech is, but try the keyboard both wired and wireless and you simply won’t be able to see any difference. In even the fastest paced games like Call of Duty Warzone or Doom Eternal, the only hint this is a wireless keyboard is that you can’t see a cable.",
    "The trouble with wireless keyboards though, particularly wireless gaming keyboards, is battery life. That’s as true here as it is anywhere else, and if you’re intent on running your BlackWidow V3 Mini Hyperspeed with full Chroma RGB lighting on all the time you’re going to deplete it in days if you spend much of your time in front of the PC. Without you can certainly stretch it to multiple weeks.",
    "The BlackWidow V3 Mini Hyperspeed uses Razer’s traditional mechanical switches and comes with a choice of two. You get either the clicky green switches or the linear silent yellow switches. Both are superb, and which you get is down to personal preference. Our review sample has the yellow switches, delivering a smooth, bump-free action with a sound quiet enough to keep your office colleagues happy as you type away all day.",
    "Razer switches are tried and tested, and though these are the traditional mechanical over the newer optical switches, performance is still fantastic. The yellow switches in particular are extremely responsive and well suited to fans of fast actuation. For typing you can dance from key to key with the lightest of touches, for gaming you’ll never miss a beat.",
    "The BlackWidow V3 Mini Hyperspeed also has a couple of other tricks up its sleeve if the style, build quality and supreme performance doesn’t convince you. Razer has removed the need to use its Synapse software, with built-in lighting controls on the keyboard. You only need to use Synapse now if you want to get a little more serious with your customization.",
    "Additionally, alongside a few other Razer products, such as the DeathAdder V2 Pro, you can now pair multiple devices to a single 2.4 GHz wireless dongle. Freeing up a USB port is something we’ll never say no to.",
    "The price is about the only thing that could put you off. It isn’t too expensive considering the market and what you get, but it is still pricey. At £180/$180 (around AU$230) it won’t be to everyone’s tastes, which is totally fine. But it’s a price worth paying, because the 65% form factor is a bona-fide winner and Razer really set a high bar here."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Don’t buy it if…"
  },
  "links": {
    "gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "Huntsman Mini": "https://www.techradar.com/reviews/razer-huntsman-mini",
    "Call of Duty Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "DeathAdder V2 Pro": "https://www.techradar.com/reviews/razer-deathadder-v2-pro"
  }
}