{
  "source": "https://www.techradar.com/reviews/arlo-ultra",
  "title": "Arlo Ultra review",
  "category": "appliances",
  "updated": "2021-02-09T14:36:58Z",
  "author": "christian-de-looper",
  "summary": "The Arlo Ultra offers great image quality and smart features, but it’s expensive",
  "verdict": "If you’re willing to spend the money, you’ll love the excellent image quality the Arlo Ultra offers. Footage is fantastically detailed, and is available in color both during the day and at night thanks to the built-in spotlight. The weatherproof home security camera can be battery powered or wired, and offers a smorgasbord of smart features that can identify the cause of a motion alert and even track the subject so they’re always in shot.",
  "pros": [
    "Excellent image quality",
    "Packed with features",
    "Well-designed app"
  ],
  "cons": [
    "No free video storage",
    "Expensive",
    "Some features limit resolution"
  ],
  "article": [
    "The Arlo Ultra is Arlo’s first home security camera that records footage in 4K, and also one of its most expensive devices. If you want to keep an eye on your home when you’re not there, and have highly detailed and easily accessible footage of any intrusions or incidents, this could be the home security camera for you.",
    "As well as alerting you via the smartphone app when it detects motion, so that you can login and view what’s happening at your property in realtime, the Arlo Ultra also stores a video of the incident in a secure area online (providing you’ve subscribed to an Arlo Smart plan), and this footage can be viewed back at any point over the next 30 days.",
    "Arlo Smart doesn’t just cover video storage, it also enables a number of smart features. Among other things it can identify whether the motion was created by a person, animal, vehicle, or some other source, and you can set motion zones so that you’re only alerted about activity in specific areas.",
    "The camera has a 180-degree field of view for maximum coverage, and footage isn’t subject to a fisheye effect, as is the case with some security cameras that offer this wide field of view. It has a 12x zoom, so it’s easy to pick out details like number plates and clothing logos in the video, and there’s also a built-in spotlight, which when activated ensures that footage recorded at night is in color rather than black and white.",
    "Like previous Arlo home security cameras, the Arlo Ultra can be powered from the mains or a rechargeable battery. The battery is easy to change, thanks to the Unibody design. Just press the button on the bottom of the camera, and slide the case off to expose the battery, which can be popped out and swapped for a fully charged one. Alternatively, if you only have one battery, it can be charged while in the camera using the magnetic USB cable that comes in the box.",
    "The Arlo Ultra is compatible with Alexa, Google Assistant and HomeKit, so no matter which voice assistant you have in your home you’ll be able to view footage from the camera on your TV or screen-equipped device, and the camera can even work with your smart lights and other devices to create routines that give the impression someone is home.",
    "At $399.99 / £449 / AU$599 for the Ultra starter pack, which includes one camera, it’s an expensive buy, and you’ll need to keep in mind that it’s not just the price of the camera that you have to consider. After the included three-month free trial of Arlo Smart expires, you’ll need to fork out for a service plan to continue enjoying all the features on offer, including 4K recording, it’s these that really set the Arlo Ultra apart from other home security cameras on the market. That said, this is a great choice for anyone who wants a high-resolution smart security camera, especially those who are already within the Arlo ecosystem.",
    "The Arlo Ultra is positioned as Arlo’s top-of-the-range home security camera, although in the US and Australia a newer version, the Arlo Ultra 2, is now available and has the same features coupled with a longer wireless range. It’s not cheap then, although for the price you are getting the flexibility of wired or wireless installation, and a clear 4K video stream both during the day and at night, and .",
    "You’ll also need to subscribe to the Arlo Smart service plan to make the most of your Arlo Ultra. For a monthly fee, your video footage is stored in a secure area online, and your camera will record video continuously and identify whether motion is caused by a person or animal. Arlo Smart is priced from $2.99 / £2.49 / AU$4.49 per month, although this is for 2K recording. If you want the videos stored in the cloud to be in 4K, it’ll cost you $4.99 / £3.99 / AU$7.49 per month",
    "The Arlo Ultra is a stylish-looking product, with the same classic-looking white-and-black design shared by previous generations of Arlo security cameras. The camera itself has a black face, the upper part of which houses the camera lens and spotlight, while the rest of the device is white, and can be removed in one piece to make changing the battery a cinch. If you’d rather hard-wire the camera, you’ll find charging pins for the magnetic cable, which snaps into position, on the bottom of the unit.",
    "There are two ways to mount the camera. As standard, the camera comes with a magnetic base that can be fixed to a wall, although the camera can be detached from this mount easily, making it not suitable if the camera is within reach of anyone that might be snooping around your property. There’s also a connector for a screw mount on the back of the camera, although the screw mount itself is an optional extra. We found it pretty simple to screw the base into a wall, then attach the camera magnetically to that base and position it so its field of view fully covered the front of our property.",
    "Arlo cameras work through the Arlo SmartHub, so if you haven’t used an Arlo camera before you’ll need a hub to complete your Arlo setup – you get one in the box with the starter kit.",
    "The design of the SmartHub matches that of the camera – it’s mostly white, and looks stylish and unobtrusive. It features a power input and an ethernet port, and during the setup process you’ll connect it to your Wi-Fi router.",
    "The Arlo Ultra itself is pretty easy to set up. You need to download the Arlo app and follow the on-screen instructions, and during this process you’ll be told to plug the SmartHub into your router, insert the battery into the camera, and so on. The whole setup process is really very simple, but if you’re at all intimidated, the app walks you through every step.",
    "Once the Arlo Ultra is physically set up, you may want to adjust a few settings in the app. For example, we quickly set up geofencing, whereby the camera turned itself on or off based on whether we were away or at home - with our location being shared with the camera from out smartphone. Among other things you can also change the name of the camera, and adjust the speaker and microphone volume.",
    "After that, it requires little attention... unless something bad happens. If your camera is set to turn on when you’re gone, and off when you’re home, you should only get notifications when the camera detects motion or other events happen.",
    "We were impressed with the notifications, as not only do they include a snapshot of the motion, they also offer quick access to actions such as sounding a siren or calling a friend to alert them to the issue without you having to launch the app.",
    "Of course, there’s also image quality to consider, especially given that this is one of the few 4K home security cameras out there.",
    "The good news is that image quality from the Arlo Ultra is excellent. The high resolution allows for a 12x zoom, enabling you to zoom in to examine areas in detail when viewing footage through the Arlo app. It offers HDR support too so even if the sun is shining brightly or very dark shadows are being cast, areas of detail won’t be lost. The camera has a 180-degree field of view, but without the distorted fisheye effect that some other security cameras create, and color night vision. It goes a step further than other systems by offering automatic zooming and motion tracking (although this reduces the quality of the video to HD).",
    "The Arlo Ultra captures high-resolution footage with bright colors, and its super-wide field-of-view means it should be able to capture most of what happens outside your door, in your home, or wherever else you place it.",
    "Footage taken at night is of very good quality too. Details are crisp and sharp, and we found it easy to make out what was going on in the pictures. If you want color footage, you can choose to have the floodlight illuminate when motion is sensed at night",
    "Audio quality is also good. There’s a dual-microphone array, and the camera has noise-cancellation tech to cut out wind noise, which comes in handy for two-way audio if you need to use it.",
    "The Arlo Ultra works with Amazon Alexa, Google Assistant and Apple HomeKit, so you can ask your preferred assistant to show footage from the camera on your TV, view a live feed in your preferred smart home app, and so on.",
    "In general, the Arlo app is well-designed and easy to use, especially after you’ve had it for a few days and fine-tuned the settings to your liking.",
    "On the home screen, you’ll find a feed from all of your cameras that are set up, along with buttons to access the settings for your SmartHub and each camera. You can also quickly and easily add new cameras and devices through this screen.",
    "The settings for each device are also fairly easy to access. From the settings menu of the camera, you can switch cameras on and off easily, check the battery level of your device, change the video quality, and set up ‘zones’ so that you're only alerted when motion is detected in these areas.",
    "If you subscribe to Arlo Smart you’ll also be able to choose if you only want to be alerted about certain types of motion detected by the camera, for example when a person or vehicle is detected.",
    "Elsewhere, you can see a list of events in the Library section, and set the different modes your cameras are in from the Mode tab. Last but not least is the Settings tab, from which you can set up notifications, your profile, manage your subscription, and so on.",
    "We think most users will be able to easily navigate the app, and it offers a good range of features.",
    "Arlo claims the battery in the Arlo Ultra will last anywhere from three to six months between charges. Due to our making heavy use of the camera for this review we’re not able to give figures for ‘typical’ use, but how long the battery lasts will depend upon how often motion is detected, how many times Live View is activated, and whether the two-way microphone and speaker are used. We found it took around three and a half hours to recharge the battery using the bundled USB cable and power adapter.",
    "You want a device that’s easy to set up The Arlo app takes you through every step of the set-up process, and we found installing the camera was simple thanks to the handy magnetic mount.",
    "You want 4K video The Arlo Ultra is just one of a handful of cameras on the market that records footage in 4K. This means video is extremely detailed, and the 12x zoom ensures you can pick out details like number plates or clothing logos.",
    "You want color night vision The Arlo Ultra can record in color even at night thanks to its built-in spotlight, which can be set to switch on automatically if the camera senses motion.",
    "You want to store recorded footage locally If you choose to store footage locally on a microSD card inserted into the smart hub you can’t access that footage in the app – you have to manually take out the SD card and view footage on your computer or another device. Arlo says a fix for this is coming, but it may not be for some time.",
    "You want auto-tracking in 4K The video quality defaults to HD if you use the auto subject tracking feature. This might not be of a high enough resolution to ensure detailed footage, especially if the camera is covering a large area.",
    "You already have an Arlo Pro 3 The Arlo Pro 3 home security camera records in 2K rather than 4K, but that’s the only difference compared to the more expensive Arlo Ultra, so unless you place a premium on having the best possible image quality you won’t gain much by upgrading."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Arlo Ultra price and availability",
    "9": "Design",
    "13": "Performance",
    "23": "App",
    "29": "Battery life",
    "30": "Buy it if….",
    "33": "Don’t buy it if..."
  },
  "links": {
    "Arlo Ultra 2": "https://www.techradar.com/news/the-new-arlo-ultra-2-security-camera-can-record-4k-footage-for-six-months-straight"
  }
}