{
  "source": "https://www.techradar.com/reviews/tajezzo-pz5-smart-backpack",
  "title": "Tajezzo PZ5 Smart Backpack review",
  "category": "computing",
  "updated": "2021-12-05T22:09:45Z",
  "author": "jess-weatherbed",
  "summary": "A backpack straight out of Cyberpunk",
  "verdict": "If it wasn't for the eye-watering pricetag, the Tajezzo PZ5 Smart Backpack would be pretty easy to recommend, especially if you frequently ride bikes or motorcycles. It has some really fun features that proved useful though, and its unique style is a real showstopper, so if you have deep pockets, you won't be disappointed.",
  "pros": [
    "Extremely hard-wearing",
    "Speaker quality is fantastic",
    "Unique look",
    "Great for cyclists and motorcyclists"
  ],
  "cons": [
    "Incredibly expensive",
    "Battery pack is on the small side",
    "LED functions are minimal"
  ],
  "article": [
    "The Tajezzo PZ5 Smart Backpack is a hardshell backpack with an LED display that offers multiple features and oodles of style. If you regularly ride bikes or motorcycles then you can appreciate most of its features as quality-of-life improvements, but there's still plenty of fun to be had simply wearing it around town.",
    "You can get the bag in two styles, a black model that has an 'exposed' display with visible screws, and a white version with an inset screen and a slightly different shape. Both have the same features and dimensions so this is purely down to aesthetics over actual function, though we did notice that the exposed screws on the black version of the bag made removing the protective plastic film almost impossible without digging around with a pair of tweezers. You can see some plastic still present in our review images to reflect this.",
    "The design isn't going to appeal to everyone, but with a retail price of $359 (around £270 / AU$510), the Tajezzo PZ5 Smart Backpack is hardly something you'll grab on a whim. For context, that makes it pricier than some designer backpacks from brands like Ted Baker, Radley and Michael Kors, so before we start singing its praises (and it does have many), we'll be blunt – this bag should be much cheaper.",
    "It did go on sale as part of a crowdfund project on Kickstarter with early bird prices though, so it could very well be more affordable when it officially becomes available. The features and build quality are great, but the high pricetag makes it difficult to recommend.",
    "Right, onto the good stuff. The Tajezzo PZ5 Smart Backpack isn't just a bag to throw your laptop into, equipped with a microphone and speaker, an LED display and a smart control on the bag strap to switch between different modes. We took the bags around a busy event, throughout central London and a busy theme park, and we did naturally end up using all of these features.",
    "You can connect to the bag via Bluetooth to take calls thanks to that built-in mic, though we couldn't find a way to have the audio play through headphones whilst using the bag's microphone. If you did want to answer your phone, be prepared for everyone in the vicinity to hear your conversation. By doing this though, we did confirm that both the microphone and speakers are pretty impressive, with clear vocals detected through the mic even in a busy environment.",
    "The speakers are also seriously impressive for something built into a bag. Located along the top rear, directly behind your ears when wearing it, the volume is loud, the bass is punchy and just a genuine pleasure to listen to. It's unlikely you'd find much of a use for this when walking around (unless you're one of those youths who likes to blast their 'music' on public transport), but it was especially useful for taking calls while biking around, improving safety by negating the need to wear headphones.",
    "The LED display is rather simple. There are a few different light modes to choose from: Music Mode that fluctuates with your tunes, Breathing Mode that just calmly, uh, breathes, Night Mode for a solid line of light and Sport Mode, which detects rapid deceleration to flash red if you come to a sudden stop.",
    "That's a pretty neat safety feature for riders, though we wish there was some way to build an indicator feature into the bag too. The voice that lets you know what mode you're switching to is hauntingly bad, but Tajezzo has informed us that a new, improved English vocalization is being developed so we've left that off our list of cons for now.",
    "There's a 5,000 mAh battery pack that powers the bag and also charges other devices, with three cables: a USB-C, Lightning, and Micro USB. 5,000 mAh isn't a lot, working out to around a full charge on most modern smartphones, but Tajezzo informed us that a larger battery pack wasn't possible with the design of the backpack.",
    "We found it was enough to use the bag for a day and charge a phone after heavy use, but you'll need to recharge the backpack daily if you want the full benefits. The bag is charged via the Micro USB and takes around four hours to regain a full battery.",
    "The hard shell is seriously well built. It was able to support the weight of our reviewer as a step stool, and protected the innards from torrential rain. You can fit a 17-inch laptop inside with few issues, and there are separators in the bag itself to keep your belongings from rattling around in the case. As a standard backpack, it serves its purpose well, but that hard shell is a real benefit if you're worried about coming off your bike at speed and want to protect expensive gadgets and tech.",
    "The fit is on the small side. The straps are adjustable and have anti-theft mechanisms to secure yourself in, but even at the largest size it was a snug fit around the shoulders. If you're a healthy weight and have a slim frame then you'll be fine, but anyone muscular, or with a wide frame might find it gets a little tight after a few hours of wear.",
    "In all, this is a really fun bag. It's not worth the standard retail price, but the features did prove useful, and we were stopped multiple times by people on the street to compliment the style of the backpack, so this could go down a real treat with fans of streetwear fashion or Cyberpunk aesthetics. If you have cash burning a hole in your pocket and you need a bag to wear while riding a bike or motorcycle, it's a great product, but otherwise you might not use all of the features that have made it so expensive."
  ],
  "headers": {
    "0": "Tajezzo PZ5 Smart Backpack two minute review",
    "14": "Don't buy if..."
  },
  "links": {
    "Tajezzo PZ5 Smart Backpack": "https://www.tajezzo.com/",
    "on sale as part of a crowdfund project on Kickstarter": "https://www.kickstarter.com/projects/1636907760/pz5-the-coolest-smart-backpack-explore-unique-way-to-carry"
  }
}