{
  "source": "https://www.techradar.com/reviews/koofr",
  "title": "Koofr review",
  "category": "computing",
  "updated": "2021-01-15T02:43:51Z",
  "author": "john-faulds",
  "summary": "Access all your online files from one place",
  "verdict": "Koofr is fast, easy to use, and a great choice for those who want access to all their files from one place, but lacks features compared to the competition.",
  "pros": [
    "Connects to multiple cloud services",
    "Easy to use",
    "Fast"
  ],
  "cons": [
    "Basic collaboration features",
    "No zero-knowledge encryption"
  ],
  "article": [
    "Koofr is a cloud storage service based in Slovenia that offers safe storage for your files with options to connect multiple other cloud accounts like Dropbox, Google Drive, and OneDrive. Koofr is a made-up word originating from similar words in other languages for “chest”: i.e. a safe box for keeping important objects.",
    "The cloud storage market is a crowded one and Koofr goes up against some of the best cloud storage providers in the business. In this Koofr cloud storage review, we find out how it compares as we look at its pricing, features, ease of use, and support.",
    "Koofr’s pricing structure is quite simple. You get 2 GB of data for free forever. If you need more storage space than that, you can upgrade to one of the paid plans, which range in price from €0.5/month (approximately $0.60 USD) for 10 GB up to €60/month ($71.87) for 10 TB.",
    "All plans have access to the same set of features, including connecting to other cloud accounts, unlimited file size, and unlimited sharing. The only difference between the plans is in the amount of storage.",
    "Prices are listed per month, but currently, plans can only be purchased for a full year and there are no money-back guarantees or refunds. If you don’t pay to renew your subscription, your account will be automatically downgraded to a free account and your storage quota reduced to 2 GB.",
    "Koofr has a range of features that you’ll find with most cloud storage services as well as some that are less common.",
    "One of Koofr’s most powerful features is its integration with other online accounts like Dropbox, Google Drive, and OneDrive. Once your other accounts are connected, you can search all your remote files from the same place.",
    "Like all good cloud storage providers, Koofr is accessible through the web, with desktop apps for syncing files, which can be installed on Windows, Mac, and Linux operating systems. There are also mobile apps for iOS, Android, and Huawei, and browser extensions for Chrome and Firefox. Koofr also supports the WebDAV protocol.",
    "Koofr is good for sharing, both sending and receiving. You can share files or folders with links that can be made public or private and set to expire. You can also create links for people to send files to folders of yours that you’ve nominated, which can be a great way for people to send you large files.",
    "If you need to collaborate with people on a regular basis, Koofr also includes a built-in messaging option for attaching notes to the shared content, although other providers do offer more in this department.",
    "For your peace of mind, anything deleted from Koofr can be recovered up to seven days after it’s moved to the trash. Also, files in the trash don’t count against your storage quota. Built-in versioning also gives you the ability to wind back the clock on files modified unintentionally.",
    "Koofr cloud storage is very easy to use, and it’s fast too. Once you’ve created an account and logged in, you can connect your other online accounts. We connected our Dropbox and Google Drive accounts and had instant access to all our content. In fact, we found Koofr’s interface to be faster than Dropbox and Drive in terms of changing views and searching for files.",
    "Koofr also has a user-friendly previewing feature for images and videos. It even works with XLXS and Word documents uploaded to Google Drive, although it only worked with fairly simple sheets, while more complex ones lost most of their formatting.",
    "Sharing is straightforward too. Choose Sharing from the context menu of any file or folder, add an email address, and that person will receive an email notifying them to create an account to access the shared content.",
    "To get access to support, you need to be logged in to your Koofr account. There is a contact form on the Koofr main website as well as a help section with searchable articles, but you get access to more when you’re logged in.",
    "There are forms for asking questions and reporting bugs, as well as links to videos, tutorials, quick tips, and Koofr’s various social media accounts.",
    "Your Koofr account can be protected with two-step verification, and all transfers occur over secure connections. Data is encrypted on Koofr’s servers, but not on the client side, and there is no zero-knowledge encryption either.",
    "The cloud storage market is a crowded one and there is no shortage of competitors to Koofr.",
    "If security is your primary concern, Sync is a great choice with robust security and a free plan offering 5 GB of storage. Personal plans range in price from $60/year for 200 GB up to $96/year for 2 TB. Business plans for individuals go from $96/year for 2 TB up to $180 for 4 TB, and team plans from $60/user/year for 1 TB/user to $180/user/year for 10 TB.",
    "If a free plan offering more storage is what you’re after, pCloud offers 10 GB of free storage. Then there are paid personal plans for $47.88/year for 500 GB and $95.88/year for 2 TB. For business, pCloud offers 1 TB of storage per user for $287.64/year for up to three users.",
    "Koofr is great for those who want to combine all their cloud storage accounts in one place. It’s easy to use and fast. In fact, it seemed faster than the linked services themselves.",
    "Its pricing is reasonable for the smaller plans, but a bit more expensive for the larger ones. It offers a decent amount of storage on its free plan, but not as much as some of the competition. It also doesn’t offer the same level of security as others and is lacking in features, particularly those relating to collaboration.",
    "But if all you want from your cloud storage is something simple that brings all your content together in one convenient location, Koofr is an excellent choice."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "11": "Interface and in use",
    "14": "Support",
    "16": "Security",
    "17": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "Koofr": "https://koofr.eu/",
    "best cloud storage providers": "https://www.techradar.com/news/the-best-cloud-storage",
    "Sync": "https://www.techradar.com/reviews/synccom",
    "pCloud": "https://www.techradar.com/reviews/pcloud"
  }
}