{
  "source": "https://www.techradar.com/reviews/hp-elitebook-840-aero-g8",
  "title": "HP EliteBook 840 Aero G8 review",
  "category": "computing",
  "updated": "2021-09-28T23:33:19Z",
  "author": "ural-garrett",
  "summary": "The expensive productivity workhorse",
  "verdict": "HP almost gets the right balance of design, performance power and feature-set on the EliteBook 840 Aero G8 Notebook. The sacrifice of a below average battery life and expensive price tag may be a turn-off.",
  "pros": [
    "Beautiful design that’s ultralight",
    "Solid performance",
    "Amazing built-in speakers",
    "Plenty of security features for IT/Enterprise"
  ],
  "cons": [
    "Expensive",
    "Battery life is far from class leading"
  ],
  "article": [
    "Though slightly missing the mark on the battery life segment, the EliteBook 840 Aero G8 Notebook checks off all the right marks for a fine productivity-focused laptop. Some impressive specs are housed inside the ultra-light 2.54 lb chassis, including an 11th-gen Core i7 processor, 16GB of RAM and a 512GB SSD.",
    "The 14-inch laptop also offers optional features like 5G LTE Wireless, fingerprint reader, privacy protection screen, smart card reader and an IR webcam with a camera privacy shutter. But even if you don’t kit it out with all these fancy features, you’ll still get awesome-sounding Bang & Olufsen speakers and a comfortable dual point backlit spill-resistant premium keyboard.",
    "It’s a great all-around package, but starting at $1,954 (£1,126, about AU$2,700) the price may put some folks off.At this price, the HP EliteBook 840 Aero G8 will get you an Intel Core i5, 8GB DDR4 and a 256 GB SSD.",
    "This is the only spec version available in the UK. In Australia, there are two spec versions available only with Intel Core i7 processors. One with 16GB RAM for AU$2,350 and another with 8GM RAM for AU$$2,280.",
    "Our test model featured all of the specs listed to the right and will set you back a whopping $2,980.",
    "Regardless of which configuration you go for, it’s going to be expensive. To really blow the HP EliteBook 840 Aero G8 specs to the max, the cost can go upward to a jaw dropping $5,624. UK and Australian buyers don’t have those options. This is significantly more than other competitors like the Thinkpad X1, Dell XPS 13 or Macbook Air for those who don’t mind a change in an operating system. However, those who lean toward IT and Enterprise may appreciate the slew of security options available.",
    "The HP EliteBook 840 Aero G8 is simply marvelous to look at. The ultra-lightweight laptop is crafted with aluminium, and feels as sturdy as it does feathery.",
    "Port placement is sleek as well. On the right-hand side holds a 4.5mm AC jack, an HDMI port, two Thunderbolt 4 USB-C ports and a nano-SIM slot. Meanwhile, a security lock slot, two USB-A ports, 3.5 headphone/microphone jack and a smart card reader are housed on the left. Once opened, the screen hinge can be positioned at nearly a 180-degree angle and feels locked firmly in place at various positions.",
    "Between the Bang & Olufsen speakers is a keyboard that’s comfortable no matter how long you find yourself typing. The keys feel tactile and springy while remaining noticeably quiet during aggressive typing. Thankfully, the pointing stick doesn’t get in the way of the keys around it. The touchpad for mouse controls and clickers feel great as well.",
    "IT and enterprise users will have much to appreciate on all tier levels of the EliteBook 840 Aero G8. In PCMark 10, the laptop earns a respectable score of 4,982 points, which is higher than laptops. From web browsing to running music streaming apps like Tidal, the EliteBook 840 Aero G8 works great without any sign of slowing down.",
    "Total battery life averaged nearly 9 hours during tests. Utilizing the PCMark10 battery test, the EliteBook 840 Aero G8 taps out at 8 hours and 42 minutes. Our local video playback test delivers a total battery life of 8 hours and 50 minutes. This is lower than competing laptops, but it’s more than enough if you’re taking a flight within the continental United States. Though, if you’re travelling internationally, you might want to look into a portable laptop charger to get you to your destination.",
    "However, charging was fairly quick with an empty battery making the 100% mark in about an hour which is definitely impressive. As mentioned above, HP provides a handful of charging options including a standard AC plug or USB-C Thunderbolt charger.",
    "HP delivers a plethora of software that caters toward general use, enterprise and IT users. There are apps like HP Audio Control, which offers various customization tools for both headphones and built-in speakers. You also get HP Easy Clean for disabling the keyboard and touchscreen to clean the laptop without accidentally pressing things, and you get the standard HP Support Assistant if you run into any trouble.",
    "And of course, because this is an enterprise device, there are plenty of security-focused apps, too. Through apps like the HP Client Security Manager, HP Wolf Security and HP Pure Click Secure Browser, getting viruses and malware should be fairly difficult."
  ],
  "headers": {
    "0": "Two-minute review",
    "14": "Don’t buy it if..."
  },
  "links": {
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "processor": "https://www.techradar.com/news/best-processors",
    "Thinkpad X1": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-carbon-gen-9",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Macbook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020"
  }
}