{
  "source": "https://www.techradar.com/reviews/roccat-kone-pro",
  "title": "Roccat Kone Pro review",
  "category": "computing",
  "updated": "2021-05-19T20:54:01Z",
  "author": "ural-garrett",
  "summary": "Remarkably lightweight and esports-ready",
  "verdict": "Despite feeling light as a feather, the Roccat Kone Pro offers some serious esports grade performance and some fine customizability options through the Roccat Swarm app and RGB lighting. Unfortunately, driverless profile setup options don’t make up for the lack of direct DPI adjustment buttons.",
  "pros": [
    "Extremely Lightweight",
    "Titan Switch provide great click-throughs",
    "Titan Wheel Pro Scroll is perfect",
    "Sensor feels buttery smooth"
  ],
  "cons": [
    "PhantomFlex cable doesn’t feel durable",
    "Lacks DPI adjustment buttons",
    "Driverless profile setup isn’t intuitive"
  ],
  "article": [
    "The Roccat Kone Pro is the newest addition to Roccat's extensive line of gaming mice. Available in Arctic White and Ash Black, the $79.99 (£69.99, AU $119.95) wired gaming mouse has a lot going for it – including Titan Switches, a 19K DPI Owl-Eye Sensor, RGB lighting, and on-board memory for up to five profiles.",
    "All of that impressive tech is housed within an ultra-lightweight shell that weighs just 66g. This comes at with some sacrifices including the lack of DPI adjustment buttons which may be a huge “no-go” compared to similarly priced mouses like Razer’s Viper 8K and the Dark Core RGB Pro Wireless from Corsair. The clunky driverless options to make adjustments on the fly doesn’t help much either.",
    "Without holding the mouse, the Kone Pro looks sleek regardless of what color you pick. The click buttons have a transparent honeycomb design that really makes the RGB lighting pop. Between the left and right click buttons is the phenomenal-looking Titan Wheel Pro Scroll Wheel. Besides the sleek looking ridges, the aluminum designed wheel scroll looks like a high tech water wheel. Underneath is where things feel like a bit of an afterthought.",
    "The blue heat-treated PTFE or Teflon glides (an extra set is included for good measure) sort of feel a bit out of place with the overall design color wise. This is where users are able to switch between profile sets as well. The USB PhantomFlex Cable contributes to the floaty experience of the Kone Pro, but it doesn't look too durable.",
    "Though the Roccat Kone Pro may be ultra lightweight, it doesn’t feel too flimsy. The mouse can be held comfortably in three grip styles including Palm, Fingertip and Claw. The ergonomics are simply great for those with medium to large hands. Both forward and back side buttons are placed so you won’t have to adjust your grip too much. The Titan Wheel Pro Scroll is a joy to use. According to Roccat, the alloy quickly adapts to the user's finger temperature, making it more comfortable to use. From scrolling to clicking, it’s one of the best scroll wheels we’ve used.",
    "Performance is where things count the most and Roccat wears its esports pedigree on its sleeve. Titan Switches make click-throughs tactile and quick. Whether you’re gaming or working, clicks feel overwhelmingly responsive. And as far as durability, the Kone Pro is rated for 100 million clicks.",
    "The lightweight design makes cursor control smooth as butter. This is thanks to the amazing Owl-Eye 19K DPI optical sensor that has a 50G acceleration speed and 400 inches per second. Like mentioned above, the lack of adjustable DPI buttons to fine-tune user experience on the fly hurts the experience.",
    "To adjust DPI, you’ll have to enter configuration mode on the Kone Pro by holding the profile button and left click button. Then, the scroll wheel must be pushed up or down for colors corresponding with the DPI. This means making quick adjustments between fast-paced shooters like Fortnite and Call of Duty and slower paced shooters like Resident Evil Village and Metro Exodus, a frustrating experience. It’s even worse for other changes like polling rate and wheel click adjustments.",
    "Since the Roccat Kone Pro offers up to five profile settings in its on-board memory, you’re better off using the Roccat Swarm app even if turning the mouse over and pressing the profile button still isn’t very intuitive. Thankfully, the app has a robust set of options in fine-tuning user preference. Everything from performance options to RGB lighting settings can be configured for each profile easily.",
    "The Kone Pro may not be able to stand up to rivals Razer and Corsair in the $70 price range when it comes to feature sets - but gaming performance is where it counts and this gaming mouse does a remarkable job. Lightweight, comfortable and high customizability makes this a solid gaming mouse if you’re willing to look past its flaws."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Don’t buy it if..."
  },
  "links": {
    "Razer’s Viper 8K": "https://www.techradar.com/reviews/razer-viper-8k-review",
    "Dark Core RGB Pro Wireless from Corsair": "https://www.techradar.com/reviews/corsair-dark-core-rgb-pro-wireless",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review"
  }
}