{
  "source": "https://www.techradar.com/reviews/hyperx-alloy-origins-60",
  "title": "HyperX Alloy Origins 60 review",
  "category": "computing",
  "updated": "2021-07-01T15:13:32Z",
  "author": "hamish-hector",
  "summary": "A compact gaming keyboard at an affordable price",
  "verdict": "The HyperX Alloy Origins 60 is a compact keyboard perfect for gamers on a budget, though the premium design will make you proud to include it in your setup.",
  "pros": [
    "Affordable",
    "Premium build",
    "HyperX Red switches"
  ],
  "cons": [
    "No macros",
    "Awkward at first",
    "Noisy"
  ],
  "article": [
    "The HyperX Alloy Origins 60 may have a more petite form factor than what’s standard and comes at an affordable price to boot, but don’t let this put you off.",
    "Thanks to HyperX’s Red switches, you’ll find the keys are speedy and responsive to help keep you in the fight during tense gaming moments. The premium build of the frame and keys should also mean that they’ll last a long time.",
    "Through it all, the customizable RGB lighting will ensure you play in style. Multiple setups can be created to give each of your different gaming experiences their own unique vibe.",
    "For all that's great about the Origins 60 keyboard though, you will also find a few issues. The keys are noisy, and if you want it to double as a work keyboard, you might find the clicking and lack of some additional keys a little annoying.",
    "Gamers will also miss out on some premium features like macro keys and volume dials. But if you’re happy to game without them, the HyperX Alloy Origins 60 is a great keyboard to include in your setup.",
    "The HyperX Alloy Origins 60 is priced at just $99.99 / £109.99 (around AU$130) falling firmly into the affordable gaming keyboard category. You can also frequently find it on sale, so be sure to take a look around at different retailers if you want to save a little extra.",
    "While $100 for a peripheral doesn’t scream “cheap”, many of our best-reviewed gaming keyboards sell for $200 or more. Sure, you’ll miss out on some features with the Origins 60, but for the reduced price there isn’t much to complain about.",
    "Out of the box, the most obvious design element you’ll notice is the HyperX Alloy Origins 60’s small form factor. The ‘60’ in the name comes from the keyboard being only 60% the size of a standard keyboard. But the reduced size hasn’t made this peripheral feel any less premium.",
    "The keyboard body is crafted from aircraft-grade aluminum, giving it a cool, weighty feeling. As for the keys, the durable PBT material should make sure the Origins 60 stands up to its fair share of late-night gaming sessions.",
    "A fear we had before testing out this keyboard was its reduced size. Thankfully, even though the HyperX Alloy Origins 60 is compact, the keys are the same size as on a standard keyboard and they don’t feel squashed together. Typing feels natural, and the only change you have to get used to is that some keys now double up rather than having one dedicated function.",
    "Those like the directional pad, delete and the F-keys have been added as options to other keys on the keyboard. To use them you’ll first have to hold down FN which can take a little muscle memory training, but you’ll fall into the habit quite quickly.",
    "The keyboard is powered by a detachable USB-C cable and can be set to one of three different angles using different length feet found on the bottom of the frame.",
    "You'll find the RGB lighting is well implemented and offers extensive key customization too. If you want to create your own elaborate color design you can, the only issue is that it may take a little time to create. Once you have set it up though, you can save your design to one of three presets that you quickly swap between using keyboard shortcuts.",
    "The only downside gamers may notice is the lack of any macros keys. If you prefer a more classic experience you won’t miss them, but if you’re looking to go pro then the HyperX Alloy Origins 60 may not be the keyboard for you.",
    "One final minor detail that we liked is the included space bar cap, as the isoline-inspired design of it is beautiful especially when paired with the keyboard’s RGB light settings. It’s a minor detail, but one that will likely be appreciated by fans of custom keycaps.",
    "For gamers on a budget, this is a fantastic option for your next gaming keyboard.",
    "The HyperX Red (linear) key switches are very responsive. Keyboard switches come down to personal preference, but with 45g of actuation force, a 1.8mm actuation point and a total travel distance of 3.8mm these keys offer you an edge if you need to press the same key multiple times in quick succession.",
    "The keyboard as a whole offers you a precise and comfortable peripheral to take your gameplay to the next level.",
    "We tested the HyperX Alloy Origins 60 in competitive titles like Fall Guys and Fortnite, and we found it performed just as well as we’d hoped. On more than one occasion the responsive keys kept us alive longer than we might have deserved.",
    "No matter what games you want to play though, this keyboard should last you a while as the HyperX Alloy Origins 60 has an impressive 80 million keystroke lifespan that you won’t be hitting anytime soon.",
    "However, if you’re looking for a keyboard that will also double as one for work, this might not be it. The clicky-sounding keys can become more than a little annoying if you’re typing a lot, and you will occasionally find yourself missing some of the cut dedicated keys if you’re used to using a larger array.",
    "For its price, the HyperX Alloy Origins 60 is an amazing gaming keyboard. The smaller size can take a little getting used to, and you’ll miss out on some premium features over more expensive options, but if you’re on a budget this is a peripheral you’ll want to take a look at.",
    "Thanks to details like the aluminum body and great RGB lighting options this will still look like a premium product that you won’t feel embarrassed about when your squad asks what your setup is.",
    "If you’re looking for a keyboard that balances aesthetics, design, and value, this is it. Be on the lookout for frequent discounts too, as they’ll only make this already affordable gaming keyboard an even better deal."
  ],
  "headers": {
    "0": "Two minute review",
    "5": "Price and availability",
    "7": "Design",
    "15": "Performance",
    "21": "Final verdict",
    "24": "Don’t buy it if…"
  },
  "links": {}
}