{
  "source": "https://www.techradar.com/reviews/konftel-cam10",
  "title": "Konftel Cam10 review",
  "category": "computing",
  "updated": "2021-05-25T19:12:28.189Z",
  "author": "jess-weatherbed",
  "summary": "A wide-angle eco-warrior",
  "verdict": "Konftel Cam10",
  "pros": [
    "Great wide-angle 90° FOV",
    "Tripod compatible",
    "High-quality 1080p at 30fps"
  ],
  "cons": [
    "Expensive compared to market rivals",
    "No detachable USB-C",
    "Disappointing lack of features"
  ],
  "article": [
    "The Konftel Cam10 may not be a familiar name right now, but it certainly has all the right ingredients to make it one of the best webcams currently available on the market – especially for anyone looking to make sustainable hardware choices. In fact, the biggest criticism we can give it is the eye-watering price tag of $130 / £120 / around AU$170, which sadly makes it an unaffordable choice for most folk hunting for a basic webcam that will see them through the workday. Which is a real shame, because the Konftel Cam10 is great at the basics. The overall design is similar to other webcams: a horizontal bar-shaped camera that sits atop your computer or laptop display, with a mattified black plastic theme. The build quality is solid and hard to scratch, so dropping it or transporting it around in a laptop bag shouldn't prove to be an issue. The 1080p resolution is fairly standard for most webcams now and 30 frames-per-second (or FPS) is more than adequate for smooth video across most applications like Microsoft Teams or Zoom. While the microphones built into most webcams usually leave something to be desired, the dual mics on the Konftel Cam10 are more than sufficient. We would still suggest using a decent USB microphone or combi-headset to avoid echo, but regardless, the audio is clear enough for casual conversations.",
    "You're also getting a few quality of life features such as an inbuilt privacy filter, which is toggled via a physical switch on the top of the webcam, and the ability to use the Cam10 with a traditional tripod stand if required. The cable is sadly integrated with the device and cannot be removed, but it does use the widely-available USB-A type connection and measures around 60-inches (150cm) in length. A nice touch not usually included in webcams marketed outside of a streaming environment is the wide 90-degree field of view, allowing for much wider shots of your office if you need to include more than one individual on the call. This also makes it a viable choice for streamers looking to include more background in their videos, but you may find the lack of other features relevant to platforms like Twitch or YouTube a tad frustrating, especially given you can buy something like the Logitech StreamCam or Razer Kiyo for a small additional sum.",
    "In fact, the Logitech C920 (one of the best selling webcams of the last decade) is currently $90 / £90 / AU$136 – which is technically a price that was inflated during the webcam shortage created by the Covid-19 pandemic – and still manages to be a more affordable purchase than the Konftel Cam10. Konftel also doesn't sell the Cam10 directly on its own website, so you'll need to go to a list of approved retailers, which means there's no guarantee you'll find it at MSRP. This high price could be explained by Konftel's great environmental ethos given most products in its catalog are certified in line with the Climate Neutral standard, with even webcam’s packaging being constructed from minimalistic recycled cardboard. We love the idea that the higher asking price is to offset things like greenhouse gas emissions but there isn't anything to clearly justify the cost of the device.",
    "We've taken some example shots below of the out-of-box quality of the Konftel Cam10, as well as what can be achieved with some adjustments in the settings. Overall though, the light section sensors and adjustment are very impressive, with the video footage and images taken in low light environments not suffering from much background noise (the fuzzy, 'static' you can sometimes get on webcams when the sensor is struggling without enough light). The Konftel Camera Control software doesn't download with the device so you'll need to head over to the official website and select your OS to download manually. You also can't use it to connect directly to any streaming software like the Logitech Capture app can, but any alterations made in the Camera Control software will save and be carried over to any program using the webcam. The wide field of view is a blessing and the colors detected appear very natural in a variety of different lighting environments, but the lack of variable FOV could be annoying if you're not looking for wide-angle shots. You can manually zoom in and even flip the camera if you think you look better at a different angle (which, let's be honest, we all have) but having the ability to choose your FOV would be preferable, especially for this asking price.",
    "You can't make many adjustments to the physical webcam, with only an up-down motion possible to change the angle of your shot. The lack of swivel is disappointing, though if you choose to use it with a flexible tripod stand rather than mounting it atop a display, then you may be able to work around this. In all, the Konftel Cam10 is a great webcam if you're looking for something simple, but its hard to justify the asking price for the limited features you actually get, especially as other products that excel in simplicity are available for much less. If you've sworn off options from Logitech, then this is a very capable choice that isn't likely to disappoint you."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Don't buy if..."
  },
  "links": {
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "basic webcam": "https://www.techradar.com/news/best-cheap-webcams",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "USB microphone": "https://www.techradar.com/best/the-best-usb-microphones-2020-the-best-standalone-mics-you-can-buy-today",
    "combi-headset": "https://www.techradar.com/news/best-business-headphones-and-earphones",
    "Logitech StreamCam": "https://www.techradar.com/reviews/logitech-streamcam",
    "Logitech C920": "https://www.techradar.com/news/best-logitech-webcams",
    "Konftel Camera Control software": "https://www.konftel.com/en/accessories/konftel-camera-control"
  }
}