{
  "source": "https://www.techradar.com/reviews/samsung-tu8000-tv",
  "title": "Samsung TU8000 TV review",
  "category": "televisions",
  "updated": "2021-12-03T11:12:03.768Z",
  "author": "verity-burns",
  "summary": "A good value TV with some limitations",
  "verdict": "The TU8000 is a good value TV that offers a decent performance for the money, but can’t shake some of the limitations of its more humble spec list. Brightness and colour saturation take a knock compared with Samsung’s pricier QLEDs, but its detailed picture, fantastic smart TV system and strong upscaling performance still offer plenty to like.",
  "pros": [
    "Sharp, detailed 4K picture",
    "Good upscaling",
    "Superb smart TV platform",
    "Solid motion handling"
  ],
  "cons": [
    "Limited connectivity",
    "Lacks brightness for the best HDR",
    "Narrow viewing angles",
    "Annoying design"
  ],
  "article": [
    "For the past few years, Samsung’s 8 Series has been a great go-to option for TV buyers wanting to balance performance and price in a way that once seemed unfathomable.",
    "The TU8000 doesn’t quite represent the top of that range, but is just one step down, sharing plenty of the TU8500’s boasts, but with an even more attractive price tag.",
    "It uses Samsung’s Crystal LCD UHD panel technology, and promises ease of use, a minimalistic design, choice of built-in voice assistant and best-in-class smart TV system. There are also a whole host of screen sizes to choose from, so you can really make it work for your space.",
    "Despite its frame being largely made of plastic, the TU8000 is a really well-built TV. It’s just a shame Samsung decided to use a difficult-to-accommodate wide-foot stand on this model and also scrimped on the HDMI inputs — especially when one of those becomes unusable if you decide to wall mount it.",
    "Still, there are no such grumbles to be had on the smart TV system, which features all the on-demand and catch-up apps you could want, including Netflix, Amazon Prime Video, Apple TV and Disney Plus. There’s even the arty Ambient Mode included here, appearing outside of the QLED range for the first time this year.",
    "There’s no doubt that the picture comes with some limitations at its price, but overall the TU8000 impresses with its natural colour handling, crisp, detailed picture, solid motion processing and good upscaling. It needs some settings tweaked to perform to the very best of its abilities, though.",
    "As is so often the case, the audio performance in the TU8000 isn’t much to get excited about, but also isn’t the worst we’ve heard. Overall it’s just on the flat side, with little by way of dynamics and organisation, but offering a decent amount of weight that stops it from sounding too thin. A soundbar wouldn’t go amiss, but the sound projection it manages and the clarity through the midrange would just about let you skip it if your budget is tight.",
    "For the price, the TU8000 offers a good performance that requires some managed expectations. Peak brightness is restricted so HDR isn’t at its best and colours don’t have the pop that you’ll see on pricier sets. But detail is fantastic, black levels are strong and overall it’s a natural and engaging picture that holds its own against the competition.",
    "It might not be quite as impressive as last year’s RU8000, but pay a little attention to the picture settings on offer and you can still create a picture performance that offers brilliant value.",
    "The Samsung TU8000 is available in the UK, US and Australia, with the only difference being the 85-inch variant available in the US – instead of 82-inch in the UK and Australia. Other than that, the line up is the same across all territories, including 43-inch, 50-inch, 55-inch, 65-inch and 75-inch models.",
    "We reviewed the 55-inch version of the TU8000 (£599/$500/AU$1,299), but otherwise you’ll be paying £429/$350/AU$949 for the 43-inch, £499/$400/AU$1,049 for the 50-inch, £899/$700/AU$1,599 for the 65-inch, £1,299/$1,200/AU$2,499 for the 75-inch and £1,999/$1,800/AU$3,699 for the 82-inch/85-inch.",
    "There are a few more screen sizes to choose from this year compared with last year’s RU8000, and while UK prices are generally the same, the US and Australia have seen some price cuts. For example, prices for the 55-inch tested here are the same as last year’s RU8000 in the UK, but the same model in the US and Australia comes in $150 and AU$300 cheaper respectively.",
    "At this price, it’s probably unsurprising that the TU8000’s design is made up primarily of black plastic, across its back panel, bezels and stand. It still manages to feel well-built despite this, with some reassuring heft when getting it out of the box, and minimal bezels ensuring the set still looks stylish, plastic and all.",
    "Why Samsung has decided to bestow wide feet on this model though — or any TV for that matter — is anyone’s guess. A central stand, as is found on the TU8500 model above this, is so much easier to accommodate when it comes to placing larger TVs onto furniture. As it is, the UE55TU8000 will require a TV stand of at least 103cm, so do make sure your current setup can accommodate it first.",
    "Of course you can choose to wall mount this TV instead, and there are no unsightly lumps or bumps on the back to make this an issue. In fact, at just 6cm thick, it should sit pretty snug to your wall.",
    "However, it’s worth noting that one of the HDMI ports will become unusable in this position due to being rear-facing, which is a shame considering what’s there is already a fairly stingy offering.",
    "We’re used to having four HDMIs to choose from, even at this price, but the TU8000 only has three. That means even a fairly humble setup of a set-top box, Blu-ray player and games console will use up those parts from the off, with one lost if the set is wall-mounted.",
    "Other ports include two USBs, a composite video in, an RF antenna input for terrestrial telly, CI slot and an ethernet port for when wi-fi won’t cut it. There’s also an optical output for pushing the audio to a soundbar.",
    "As is usually the case with Samsung TVs, two remotes are included in the box — a chunkier standard-looking one and a more slender, simplified option. The latter has all the main features you’ll use most often, without the ones you won’t. This includes a ring-shaped D-pad, channel and volume controls, shortcuts to Netflix, Prime Video and Rakuten TV and buttons for activating Samsung’s Ambient Mode (more on that later), your voice assistant of choice and for general navigation.",
    "This remote can also be set up as a universal control for your other devices, which you’ll be prompted about during the initial setup.",
    "While you can get the TV set up just using the remote if you prefer, Samsung prompts you to download the Samsung SmartThings app to do it digitally instead.",
    "It works really well, even automatically adding the wi-fi details it digs out from your device so you don’t have to mess around with on-screen keyboards, which is always welcome.",
    "It also prompts you to download any extra on-demand apps you might like on the TV and choose your voice assistant, as well as helps you get the OneRemote set up as a universal control for all your sources.",
    "Once complete, the TU8000 will appear as a device within the SmartThings app alongside any other compatible devices you might have in the house. You can then control your TV via your phone if you’ve misplaced the remotes… or just can’t be bothered to get up to get them.",
    "Samsung has long offered one of the most comprehensive smart TV systems through its Tizen platform, and that’s not changed in 2020. It’s had some small design tweaks since last year, but navigation is pretty much identical and is still just as simple as before.",
    "That means a press of the home button will bring up a row of your installed apps, which are now smaller to fit more on screen, and highlighting any one of them will show up a secondary row of suggested content or actions. This content will be customised to your viewing habits if you’re signed in to that particular app, so Netflix will offer to continue what you were last watching, for example.",
    "Pretty much every on-demand service you could want is present, including Netflix, Amazon Prime, Apple TV, NowTV, YouTube and Disney Plus, as well as all of the UK’s catch up services, from BBC iPlayer to My5.",
    "There’s also an app store for adding other apps, including UKTV Play, BBC Sounds and Spotify, with the order of apps you add to your home menu entirely customisable to your preferences — you can now fit 14 on the screen at any one time. Scroll down from this main row of apps and you’ll come to Samsung’s content hub, with rows of TV and film recommendations, albeit from a limited number of providers.",
    "Most options surfaced for us seemed to be from Apple TV, Chili or UKTV Play and while it was interesting enough, it’s a shame not to see more popular sources included, like Netflix, Amazon or BBC iPlayer. We didn’t find ourselves using it at all.",
    "You get two options for voice assistance, in Alexa and Samsung’s Bixby (Google Assistant is coming soon). Alexa can work in conjunction with any Amazon speakers you might have, and is generally the better choice of the two for generic voice assistance, though Bixby does offer more by way of specific TV controls, such as changing input via voice. It still feels like a bit of a clunky inclusion that we rarely found the need to use, but it’s there if you want it.",
    "Samsung’s Ambient Mode is now included as standard on the TU8000, with the feature expanding its horizons beyond the QLED range for the first time this year. It’s a feature that’s been adapted from the Art Mode initially launched on the Samsung Frame, and allows you to have a selection of arty pictures, patterns or your own snaps appear on screen when you’re not watching TV.",
    "The TVs sensor will detect the brightness of a room and adjust the picture accordingly, so it looks more like a picture than a TV that’s just been left on, which in turn saves power. You can set a timer too, to ensure it switches off after a period of time.",
    "It’s not as convincing as Samsung’s The Frame as an artwork, mostly because the TU8000’s screen is more reflective, but it’s nice to see the feature trickle down the range all the same.",
    "This UE55TU8000 is capable of a very good picture for its price, but the out-of-the-box settings do need a bit of work to get the most out of it, particularly with HDR content.",
    "That’s because the peak brightness of this set is on the low side. Even with brightness turned up high in settings, you will likely find yourself wanting more, especially with dark scenes in well-lit rooms.",
    "So before we talk about the picture, let’s talk about how to get it looking its best. The first thing to adjust here is the picture mode, which is most accurate under Movie. Many will prefer the attractive cooler tones of Standard, which is also slightly brighter, but if you’re looking for the most accurate picture and colour palette, Movie is the option to go for.",
    "Movie mode has its brightness and contrast knocked down a touch from the maximum, and we’d recommend keeping them there. It’s a much subtler picture if you do, though you can push brightness up a touch if you feel you need it.",
    "Colour tone is a toss up between Warm1 and Warm2 and we’d ensure sharpness is always at 0 to avoid added noise. You can leave colour and tint settings where they are.",
    "We’d usually recommend turning all added picture processing off for the purest picture, but in this case, Samsung’s Contrast Enhancer works wonders for giving this picture the added oomph it needs, particularly in darker scenes. With SDR content you can probably keep it switched on low, but with HDR content, you’ll get more impact, albeit with less subtlety, set at high.",
    "The TU8000 will recognise whenever you’re playing compatible HDR content, and switch to an HDR mode automatically, so any settings you change at this point will remain in place for HDR content only.",
    "Finally, motion settings fall under an option called Picture Clarity. Opt for custom and you can set the judder settings yourself. Something around 3 or 4 seemed to work best for most content we watched, and motion is, for the most part, admirably stable.",
    "With the picture where we want it to be, we settle down with a 4K stream of Joker on Sky Q. Outlines are wonderfully crisp and there’s stacks of detail to go at, from the texture of the makeup on Joaquin Phoenix’s face to the detail in the buildings of Gotham in the opening scenes. More capable sets (read: more expensive) will offer up a bit more by way of depth and extra fine detail, but for a mid-range TV, there’s very little to grumble about here.",
    "Colours are well judged too, and there’s enough natural punch here to keep the picture engaging. The TU8000 even does a great job with skin tones, a tricky balance that TVs at this level can’t always manage.",
    "The lack of wide colour gamut for HDR in the TU8000 means you’re unlikely to be blown away by the out-and-out vibrancy of the TU8000 when watching HDR, but the subtler way it handles its colour palette and shading is still beautifully done. While colours probably wouldn’t be described as vivid, they’re also far from washed out.",
    "If there is an Achilles’ heel here, it’s dark scenes, when watched in anything but a very dark room. Even then, they struggle to impress, as the screen tries to balance the dark and light parts of the scene. There’s no doubt that blacks can go deep, but shadow detail and highlights lose out in the process.",
    "As an edge-lit set with no local dimming, the TU8000 was always going to struggle in these situations, but with Samsung’s Contrast Enhancer switched on, you can quickly improve the balance and give these scenes much more distinction.",
    "This is particularly helpful with HDR content. When streaming Ozark from Netflix, we were able to transform previously dull dark scenes when viewed in daylight into something much more punchy and enjoyable. Even the viewing experience in a dark room is much improved.",
    "With the Contrast Enhancer set to high, highlight details are presented much more brightly alongside those deep blacks, and with very little blooming. It even helps to bring out some detail that might have otherwise been lost in the shadows.",
    "As mentioned, the extra processing does away with some subtlety in search of better contrast, particularly noticeable in brighter scenes, and also adds in some noise. However at this price, it’s a trade off we’re willing to make.",
    "The result isn’t as precise or dynamic as HDR can be at its very best, but you won’t find many TVs at this level doing much better. Just be aware that, as is the case with all Samsung TVs, there’s no Dolby Vision support here, just HDR10 and the lesser-spotted HDR10+, plus HLG for broadcast.",
    "Carrying over to HD/SDR content with an Amazon Prime stream of Iron Man 2 and the TU8000 manages admirably. Its upscaling is pretty good, and while it can’t pass for native 4K, there’s still a good level of detail to get your teeth into, with no noticeable added noise.",
    "Colours are just as well-handled here as they are in HDR, so the red and gold of Iron Man’s suit are suitably striking without being over the top, while the contrast in darker scenes remains impressive with a helping hand from the extra processing.",
    "Even SD terrestrial TV content looks decent. It’s a little soft on detail, as you’d expect, but even with the further noise that creeps in, it’s a solid picture with a good colour balance that’s wholly watchable.",
    "The only downside to all of this is the viewing angles, which are annoyingly tight. Sit too far off axis and you’ll lose a fair bit of contrast and colour saturation, which takes away from the overall picture performance. If this is the TV for you, just be sure to bag the central seating position for movie night.",
    "The TU8000 offers three audio settings to choose from in the main settings menu. It’ll come with Standard selected out of the box, but you can also choose the Adaptive or Amplified settings.",
    "We like the added whallop from Adaptive, which strikes a good balance of adding some weight to the low end without losing out on too much clarity through the midrange.",
    "That low end still lacks the power and depth you’d get from a soundbar, but does at least help to give some presence to a soundtrack and ensure it doesn’t sound too thin. The treble is still a little on the sharp side but not so much that it becomes uncomfortable to listen to.",
    "Organisation isn’t the best so dialogue can get a little lost in the busiest scenes, but overall it’s fine, if lacking a little detail.",
    "As is usually the case with TV sound, particularly at this level, it’s just a bit flat, and lacks the dynamic wherewithal to shift between the subtlety required for quieter scenes and oomph required for the big ones. You’ll want to invest in a soundbar for that.",
    "It does do a good job of projecting the sound though, so you don’t have to push the volume out of its comfort zone, which is welcome at this level."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Price and availability",
    "12": "Design",
    "20": "Smart TV (Tizen)",
    "33": "Picture quality",
    "54": "Audio performance",
    "60": "Don't buy it if..."
  },
  "links": {
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008"
  }
}