{
  "source": "https://www.techradar.com/reviews/keeper-tax",
  "title": "Keeper Tax review",
  "category": "computing",
  "updated": "2021-10-01T04:54:19Z",
  "author": "rob-clymo",
  "summary": "Contractors can use Keeper Tax to take the strain out of their tax filing affairs",
  "verdict": "While Keeper Tax might not be a one-stop solution there is plenty to like about this finance app, not least of which is the ability to save yourself money.",
  "pros": [
    "Potentially saves you money",
    "Free tax calculator tools",
    "Option to file tax directly",
    "Free trial"
  ],
  "cons": [
    "Monthly fee"
  ],
  "article": [
    "Keeper Tax falls into the tax filing category, but it’s also a practical expense tracker based around an app for both iOS and Android. The appeal of Keeper Tax is narrowed slightly by the way that it has been tailored towards independent contractors with 1099 income, although for this area of the workforce it’s ideally suited. Keeper tax allows contractors to prepare their tax affairs ready for filing, while finding and flagging tax write-offs amongst any purchases made during the tax year.",
    "Keeper Tax prides itself on helping self-employed, contractors and freelancers save sizeable amounts of dollars every year. There’s a trial that allows you to explore the potential of the software and, if it ticks the right boxes, Tax Keeper can be used for a regular monthly fee.",
    "You can try Keeper Tax for free for the duration of its 14-day trial period. If you’re suitably smitten with what’s on offer Keeper Tax then costs $16 per month, which comes with the added benefit of a bookkeeper that’s assigned to your account on setup. This is the way Keeper Tax can monitor your card or bank accounts for any potential tax write offs via text notifications.",
    "It’s pretty cool and in that respect it could have the potential to save you a decent amount of money over time. If you want to file your taxes directly through Keeper Tax then this is also possible and costs an additional $89. There is also the option to export your collated accounting details and file somewhere else using an accountant for $39.",
    "One of the main benefits of using the Keeper Tax app is that it allows you to track work-related expenses throughout the course of the working year. Available for both iOS and Android, the software is great for the likes of contractors and freelancers because of the tools on offer inside the interface.",
    "There are several core features that make the app appealing. If you link your credit card or bank account to the software it lets you to automatically keep tabs on your bank statements. Using that feature the app subsequently spots any tax-deductible expenses, which you might otherwise miss or not realize are qualified as a legitimate expense. The app can connect to over 10,000 banks and financial institutions, so it’s easily able to cover most bases.",
    "There’s also the capacity to get texts from an assigned bookkeeper to also flag up any potential work-related purchases that can be written off as expenses. The resulting data from this activity can be exported into a spreadsheet if you want to analyze the figures offline or present them to an accountant or CPA. Another feature that Keeper Tax has that might appeal to many is its capacity to file your tax, which is a service available for a one-time fee as outlined above.",
    "Being a mobile-focused software application Keeper Tax fires on all cylinders even when it’s exchanging data with your bank accounts. In fact, once you’re past the setup phase for this dynamic aspect of the app you should find that Keeper Tax performs very nicely indeed, on both iOS and Android.",
    "Explore Keeper Tax for the first time and you’ll find that it’s easy to acquaint yourself with the controls, no matter if you’re using the iOS version or the Android edition. Another bonus with Keeper Tax is that alongside the standard features, you get free use of tax tools, including a calculator that helps estimate any quarterly tax payments. Similarly, it’s possible to get an estimate of your overall tax bill.",
    "For extra ease of use, these tools can actually help you budget better and keep closer tabs on those expenses. Overall then the Keeper Tax user experience is a stress-free one.",
    "There didn't seem to be any obvious source for support during our tour of the Keeper Tax software. However, the package is actually very simple, both to set up and subsequently use on a day-to-day basis. The app has been nicely designed too, which means there’s very little to go wrong.",
    "You’ll need to spend a little time configuring it to automatically connect to your bank accounts, but that’s about the hardest thing that needs to be done and even that’s straightforward enough. Hopefully then you won't need to contact support, if you can find them that is.",
    "Keeper Tax launched in 2018 so it’s still relatively early days for this expense tracking and tax filing tool. Nevertheless, what the San Francisco-based company has done with its user-friendly app so far is impressive. While there is the monthly charge to consider, having the benefit of notifications whenever you can take advantage of a potential tax write off means that Keeper Tax might soon be earning its keep.",
    "In fact, over time the software looks like to could potentially save you a bundle. Whether or not it offers the versatility and cover-all appeal of a package like QuickBooks or a similar accounting package remains to be seen. However, if you want a handy app that’ll spy those sneaky tax write offs that appear in your everyday expenses then this is well worth considering."
  ],
  "headers": {
    "2": "Pricing",
    "4": "Features",
    "7": "Performance",
    "8": "Ease of use",
    "10": "Support",
    "12": "Final verdict"
  },
  "links": {
    "Keeper Tax": "https://www.keepertax.com",
    "tax filing": "https://www.techradar.com/best/best-tax-software",
    "expense tracker": "https://www.techradar.com/best/best-expense-trackers",
    "tax affairs": "https://www.techradar.com/best/small-business-tax-software",
    "self-employed": "https://www.techradar.com/how-to/online-accounting-tools-for-sole-proprietors",
    "freelancers": "https://www.techradar.com/best/accounting-software-small-business",
    "for free": "https://www.keepertax.com",
    "$16 per month": "https://www.keepertax.com",
    "additional $89": "https://www.keepertax.com",
    "bookkeeper": "https://www.techradar.com/best/accounting-software-small-business",
    "file your tax": "https://www.techradar.com/best/small-business-tax-software",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-online",
    "accounting package": "https://www.techradar.com/best/accounting-software-small-business"
  }
}