{
  "source": "https://www.techradar.com/reviews/nzxt-capsule",
  "title": "NZXT Capsule review",
  "category": "computing",
  "updated": "2021-09-08T16:07:10Z",
  "author": "jess-weatherbed",
  "summary": "Professional quality made for gamers",
  "verdict": "The Capsule USB Microphone is NZXT's first dedicated audio product for gamers and streamers, and it gets a thumbs up from us. From the delightful build quality to the actual clarity of the recordings and broadcast this is a fantastic microphone for anyone looking for a plug-and-play product.",
  "pros": [
    "Top-notch audio recording",
    "fantastic build quality",
    "Striking design"
  ],
  "cons": [
    "Changing stands is a pain",
    "Matte letters and symbols are hard to read"
  ],
  "article": [
    "The NZXT Capsule USB microphone is a fresh, but welcome face in the world of broadcasting equipment that targets the gaming and streaming market. True to NZXT's other products, the Capsule has a modern design that's available in either white or black, and will be launched alongside a compatible NZXT branded boom arm.",
    "The streaming market has existed for some time and there are a vast number of USB microphones targeting different budgets and aesthetics. The NZXT Capsule is available from September 8 and will retail for $129.99 / £109.99 (around AU$210, Australian pricing and availability to be confirmed) which places it around the same price as beloved products like the Blue Yeti (MSRP $130) around the middle of the market. And while offerings like the Razer Seiren Elite are much pricier at $200, the Capsule feels like a premium product, more so than many other USB microphones we've tried.",
    "Right from the unboxing experience, the capsule is well packaged into a fitted foam box to protect the product in a way that feels real care and attention has been paid to keeping the microphone pristine. Not that the Capsule is by any means delicate – almost the entire build feels like it's constructed from solid metal and it has some serious heft to it. The chassis has been coated in a matte enamel, and no attempts at scratching or bumping it against the edge of a table (for science, of course) left any noticeable dents or removed the paintwork.",
    "There are two dials located on the front of the Capsule, one to control Gain on the top and another to control headphone volume on the bottom. NZXT expressed that it wanted the Capsule to be approachable and easy to use, so the minimalistic controls certainly make things easier, but a complaint we had right out of the gate is that the markers for volume on both dials are almost impossible to see because they blend into the black color of the control knob itself.",
    "It's easy to ignore this even if you haven't used a USB microphone before though as dial control on most things mean turning to the right equals louder and turning to the left equals quieter, but it's a design choice that feels like it was trying too hard to be elegant at the detriment of practicality.",
    "The dials themselves also feel very well made, with raised tactile dots for additional grip built along the side and you can feel some pleasant tension when operating them. They don't have a fixed range though, so if you rotate them they'll just keep going – make sure you keep an eye on your gain levels if you're liable to move the mic around.",
    "There's a strip of LED light around the bottom of the NZXT Capsule, but this isn't RGB or customizable. That's not a bad thing as it suits the overall look, and not every gaming product needs flashy rainbow lights on it. Functionally speaking, you can tell when it's working, and by pressing the top dial (gain) you can manually mute the mic which will turn the light red to let you know you're not broadcasting.",
    "You can also get a matching boom arm from NZXT that retails for $99.99 / £79.99 (around AU$150) if you want to switch out the desktop stand. Elevating the mic away from the desk has its advantages to minimize noise picked up from typing and moving things across the desktop surface. Technically speaking, any boom arm should accommodate the Capsule mic as it uses a standard thread, provided you use the included adapter, but the NZXT branded model better suits the product.",
    "As far as the recording quality is concerned, it's unlikely you'll be disappointed. The mic is a unidirectional cardioid that claims to have optimized speech for a gaming environment by cutting out background noise like the fans in your desktop PC or gaming laptop. The clarity is beautifully clear and crisp with very little detectable background interference without any changes, so you're getting incredible quality right out of the box.",
    "When in desktop form, we did pick up some interference when knocking the surface of the desk, but the audio feels very balanced. Using an elevated boom arm will reduce the possibility of any background interference",
    "The NZXT Capsule doesn't ship with any software, but the mic is compatible with established audio editing applications such as Nvidia Broadcast, or adjustments can be made directly in streaming software like StreamLabs or OBS. The quality of the raw audio recording is likely going to be sufficient for most people and actually fits NZXT's goal of creating a simple to use USB mic for gamers, allowing you to just plug in and play.",
    "On the bottom of the Capsule you'll find the USB-C port to connect the microphone to your laptop or PC, the thread to connect to a boom stand, and a standard headphone jack to connect your favorite headphones.",
    "Removing the desktop mount actually proved to be rather troublesome as more effort is required than expected for something described as 'quick release', and getting the shroud cover or the default stand back onto the mic itself takes a bit of wriggling to sit flush. It's far from difficult, but could cause a nuisance if you need to change between mounts frequently.",
    "The criticisms we have about the NZXT Capsule are small in the grand scheme of things, and the overall quality of both its broadcasting capabilities and build quality are seriously impressive. For gamers and streamers looking to upgrade from a current headset mic, the Capsule offers some compelling competition against other established products on the market with a look that is uniquely NZXT."
  ],
  "headers": {
    "0": "Two minute review",
    "14": "Don't buy it if..."
  },
  "links": {
    "USB microphones": "https://www.techradar.com/best/the-best-usb-microphones-2020-the-best-standalone-mics-you-can-buy-today",
    "Blue Yeti": "https://www.techradar.com/reviews/pc-mac/peripherals/speakers-and-headphones/microphones/blue-microphones-yeti-905163/review"
  }
}