{
  "source": "https://www.techradar.com/reviews/garmin-fenix-6",
  "title": "Garmin Fenix 6 review",
  "category": "fitness",
  "updated": "2021-06-10T15:22:29Z",
  "author": "lee-bell",
  "summary": "The Garmin Fenix 6 is the best multi-sport watch money can buy",
  "verdict": "The Garmin Fenix 6 is one of, if not the best multi-sport smartwatch money can buy, bringing performance and adventure tracking as well as GPS-based mapping to just about every outdoor activity you can think of. However, there’s a downside. It comes with a big price tag that will put most people off.",
  "pros": [
    "Cannot be beaten for outdoor tracking",
    "Solid and robust design",
    "Accurate activity tracking"
  ],
  "cons": [
    "Not many new features over Fenix 5 Plus",
    "Very expensive",
    "Not the most stylish of watches"
  ],
  "article": [
    "The Garmin Fenix 6 sits right at the top of the extensive tree of Garmin watches, and represents the best of everything the company has to offer right now.",
    "The Fenix series is a family of fitness trackers that pretty much has it all when it comes to outdoor fitness and adventure tracking. Stepping things up a notch, Garmin released the Fenix 6 range in August 2019, offering users a slight update in design and some welcome new features over the Fenix 5 Plus.",
    "We always see some excellent discounts on sports tech on Amazon Prime Day, and we'd be surprised if this year's Prime Day deals don't include an offer on the Fenix 6. It's a great opportunity to pick up one of the most powerful sports watches around at a bargain price.",
    "The sixth series comes in what seems like a million different skews depending on what you’re looking for in a multi-sports or running watch. It starts with the standard Fenix 6 model, which is the one being reviewed in this article and for comparison’s sake, has a 47mm case.",
    "Under this is the slightly more compact Fenix 6S, which has a 42mm case and thus a slightly lower battery life. There’s also a Pro version of these models available, which adds music compatibility, maps and Wi-Fi connectivity. Above that, there’s the more powerful Fenix 6X, which has slightly better battery life alongside music, Wi-Fi and maps as standard.",
    "Finally, there’s a super top-spec version of the 6X called the Pro Solar and this boasts a super light all-titanium body along with solar panels around the watch face's rim that give an extra boost in battery life.",
    "While things haven’t changed that much since the Fenix 5 Plus that came before it (expect the same big, bold and, yes, quite bulky design), there is a lot to love about the latest upgrade.",
    "From triathlon tracking to skiing, the Fenix 6’s sport-specific smarts are extensive to say the least, with advanced training features that will suit everyone and anyone, from amateurs to athletes.",
    "The Garmin Fenix 6 is out now in the UK, US and Australia, but it doesn’t come cheap, with a price ranging from £529.99 / $599.99 / AU$949 all the way up £999 / $1,149.99 / AU$1,549 depending on what you opt for.",
    "However, it’s worth bearing in mind that the lowest spec model is significantly cheaper (£70/$200/AU$200) than the Fenix 5 Plus was when it first landed just over a year earlier.",
    "The prices vary based on your choice of model, color, and strap, but generally speaking the base Fenix 6 is the cheapest with the 6S and 6X being a step up in terms of price. The most expensive is the Fenix 6X Pro Solar, which offers everything the 6X does plus solar charging and a lighter body.",
    "The differences in price vary greatly because of the sheer number of added extras available, each of which is targeted at different kinds of users.",
    "Despite its design upgrade, the Fenix 6 doesn’t look hugely different when placed side-by-side with its predecessor, the Fenix 5 Plus. This is because the updates are rather minor.",
    "Overall, it still looks quite bulky when compared to most other smartwatches on the market, and even other Garmin ranges like the Vivoactive or Forerunner series. While there’s good reason for this extra bulk (ruggedness and battery life) it’s still 1.1mm slimmer than the Fenix 5 Plus model, measuring 14.7mm thick, which is down from 15.8mm.",
    "Alright, this isn’t noticeably slimmer on the wrist but it does feel slightly lighter - weighing 7g less than the previous equivalent model. This is a welcome improvement for a smartwatch known for being rather cumbersome.",
    "The biggest design upgrade, however, can be seen on the display, which is now 17% larger, jumping from a 1.2-inch, 240 x 240 resolution display to a larger 1.3-inch, 260 x 260 offering. While that doesn’t sound like much, it does mean that fitness information is displayed in a much more intuitive way than before as it can now show extra (customizable) data fields.",
    "For instance, you can now fit eight activity measurements of your choice around the edges of the circular watch face screen instead of six, thanks to the slightly larger screen real estate. This allows you to see more of your data at a glance without having to scroll through endless menus. The resolution upgrade also means data is just that tad bit sharper, which helps a lot with this kind of display.",
    "If you’re familiar with Garmin devices, you’ll know the firm doesn’t achieve display brightness through a super powerful backlit AMOLED screen as seen on many other smartwatches. Instead, it uses transflective memory-in-pixel (MIP) tech which relies on external lights to illuminate when in well-lit conditions.",
    "Then there’s an LED backlight for when you’re in the dark. It doesn’t sound ideal, but it works really well. The Fenix 6’s display simply glows in direct sunshine, with all the timings, heart rate information and elevations illuminating superbly.",
    "In terms of overall design, the Garmin Fenix 6 is still very much the watch you only wear for the great outdoors, and definitely not something you’d really use as a lifestyle piece. It’s not the most stylish bit of wristwear out there (which, for the price would be nice) but this wasn’t what this series was designed for (check out Garmin’s Vivoactive series for that).",
    "Fenix was made for adventure – your companion while out in the great unknown. Tracking all you can throw at it no matter the extremities in which you do so. It’s therefore built with robustness in mind, so it can withstand even the harshest of elements. The latest model is no exception and has to be the best of its kind yet.",
    "The build quality, for instance, is just superb and for this reason, we can't imagine it ever breaking. We’ve had it thrown in the bottom of a bag, strapped to our wrist during hardcore weight sessions, tracking sweaty HIIT classes, hiking in the Alps, city running, the lot, and there’s still not a scratch in sight.",
    "Samuel Horti also contributed to this review"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Garmin Fenix 6 price and release date",
    "12": "Design and display"
  },
  "links": {
    "Garmin watches": "https://www.techradar.com/best/garmin-watch",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Fenix 5 Plus": "https://www.techradar.com/reviews/garmin-fenix-5-plus-review",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "running watch": "https://www.techradar.com/best/running-watches"
  }
}