{
  "source": "https://www.techradar.com/reviews/gryphon-ax-router",
  "title": "Gryphon AX Router review",
  "category": "computing",
  "updated": "2021-12-06T00:03:20Z",
  "author": "mark-pickavance",
  "summary": "Mesh access point designed for home users with children",
  "verdict": "A powerful Mesh router designed for people who have both massive homes and control issues. It’s expensive, needs a mobile device to deploy and configure, and is complete overkill for most residential properties.",
  "pros": [
    "802.11AX and Mesh capable",
    "Extensive access controls",
    "Sophisticated security"
  ],
  "cons": [
    "Expensive",
    "Personal security protocols only",
    "Exclusive to the USA for now",
    "Overkill for most homes"
  ],
  "article": [
    "The market for advanced wireless networking technology has exploded since many got the unexpected opportunity to spend more time at home.",
    "Unfortunately, this also revealed that Wi-Fi solutions that worked acceptably for personal use weren’t suitable as business tools when connection and performance issues became apparent.",
    "As a result, homeowners have been tempted to invest in technologies created for the commercial space and pay business prices for that privilege.",
    "Today we’ll be looking at the Gryphon AX, a wireless router that uses the latest AX and Mesh technologies focused on residential deployment.",
    "Is this the solution for your home and family, or would it create more problems than it resolved?",
    "The Gryphon AX comes as either a single device or a dual-router bundle, costing $279 and $479 directly from the Gryphon website. Currently, Gryphon only ships to customers in the USA, and the AX isn’t available through online retailers in other regions.",
    "But, as other Gryphon hardware is available through Amazon and other channels globally, the AX should be available elsewhere eventually.",
    "Out of the box, the Gryphon AX comes with just a single short Ethernet cable and a small wall socket mounted power supply. It’s a US standard outlet design with two blades and no earth, so users outside that region will need a converter to connect it to their local standard.",
    "Hopefully, Gryphon will make an international PSU soon that supports a grounding line for safer installations of devices that remain connected and powered for long periods.",
    "The outward appearance of this router is a message about simplicity, though the designers didn’t entirely follow this through by making it purely a box. The angled sides give it an architectural vibe, and the lack of any button to sanction connection, along with a single LED above the logo, demonstrate that this design has had anything considered superfluous removed.",
    "At the back is just two ports, one to connect to the internet modem and another to the LAN. The lack of other LAN ethernet ports dictates that an Ethernet switch will be required unless you only own one wired device. There is also no USB port to distribute a printer or storage device, should you be expecting that.",
    "But these aren’t the only things missing. When you pick up the router to see the label underneath, the critical pieces of information that it lacks is an admin login and password.",
    "Therefore, to set up and configure this router will require a mobile device, phone or tablet, and the installation of a Gryphon connect application to that device.",
    "Without the application, a device to run it on, and presumably the Gryphon server to accept enrolment, this hardware won’t work.",
    "From a technical standpoint, this is a Tri-band MU-MIMO Wi-Fi 6 specification router that sports six internal antennas and most of the clever technology that these things offer, like Orthogonal Frequency-Division Multiple Access (OFDMA) data transmissions and signal beamforming.",
    "All these activities are managed by an ARM-based quad-core CPU with 1GB of RAM and 512MB of flash memory. The three bands are a single 2.4GHz channel with 591Mbps of capacity and two 5GHz bands, one with 1,237Mbps and the other with 2,475Mbps.",
    "These all add up to a 4300AX rating, but the Gryphon AX only has a 1Gbit backhaul to the internet and LAN, so a single device or client can’t exploit all the theoretical bandwidth available. What it can do is allow more devices to interact with the system without impacting the performance of others dramatically.",
    "And, should you deploy more than one of these, 5GHz channels can provide a wide node-to-node backchannel that doesn’t require LAN cabling.",
    "The most notable omission from the wireless networking capability is the lack of a 160MHz channel, often used to provide a last resort for challenging installations.",
    "We also noticed during our assessment that the only connecting security protocols are only WPA2 and WPA3 personal, making it unsuitable for those that need Enterprise level security access.",
    "We could blame this thinking shift on Microsoft and Apple, but the idea that paying for something doesn’t give you complete control over it is one we’ve become familiar with in the world of technology.",
    "With the Gryphon AX, that philosophy dictates that the router can’t be used without registering it with the company, and without a mobile internet connection, you might be entirely scuppered to achieve this one stage of the configuration process.",
    "Once you’ve provided a name, email and password, you must scan a code on the underside of the AX to create a link between the user and device, and that circle is completed with a security code sent to that email address.",
    "Once this initiation ceremony is complete, the SSID of the router is shown and a password for access.",
    "The home page of the application reveals much about those behind the Gryphon AX, and what they consider important to tell their customers.",
    "At the top is the name of the router, not the name of the SSID, and the number of currently connected devices.",
    "Below that is a warning that Gryphon Premium isn’t activated, and therefore the network is ‘unprotected’. More about that later.",
    "The line below reveals the total data used, irrelevant unless you’re on a data-limited service and a speed test.",
    "Below that is a panic button to ‘Suspend the Internet’. That feature should have a klaxon sound when activated, then a ‘Danger!, Will Robinson’ audio message, but it doesn’t. Instead, it offers you a menu where you can panic right now, or panic in five minutes, or panic in a more leisurely fifteen minutes, depending on how much anxiety you are packing.",
    "And, at the bottom is the ‘User Dashboard’ and a row of icons to access various settings and features.",
    "The highlight of the home page is patently the panic button, as Gryphon are all about creating ‘family-friendly’ environments where those who paid for the equipment and service get to control it for those less respected due to age or circumstances.",
    "Many adults these days are paranoid about what their children are doing on the internet, ironically because of what they did when they were younger.",
    "Gryphon taps into those fears by providing a product that allows for total control over the internet service, potentially inside and outside the home.",
    "When user accounts are defined, their age group can be classified as a Toddler, Elementary, Middle School, High School, Adult or Unfiltered. Other than some of these age labels mean almost nothing outside the USA, it's somewhat curious that Adults aren’t by definition also ‘Unfiltered’.",
    "Using global controls, it's possible to limit the total amount of time that the internet is available, what is accessed and when. But once a user account has been created, it is possible to go much, much further, eliminating access to social networking, sex education or almost anything on the internet that has been deemed inappropriate by the person in charge.",
    "While having a safelist and limits on access for children might seem sensible, this facility goes substantially further and gives the owner complete control.",
    "Any self-respecting teenager confronted with this degree of control would undoubtedly get the Wi-Fi password of a neighbour’s service and circumvent this control mechanism entirely. But Gryphon has considered that possibility and created Homebound. An application installed on users’ devices redirects all the internet access through the Gryphon AX router, even when it is not connected to the wireless network.",
    "Depending on the broadband service and other factors, that redirection might harm performance to the point where the service they receive is effectively useless when away from home. For some parents, that implication might be considered a ‘win’.",
    "However, this invasive option isn’t free. Instead, it comes as part of the Advanced Internet Protection (Premium) package that costs $7.50 per month, payable annually in advance. The router comes with 90 days of the service included after which a subscription is required to keep everyone under control, assuming they agree to have the software installed on their phones and tablets.",
    "What’s slightly frustrating is that the Advanced Internet Protection package has some beneficial aspects that aren’t so draconian, including the ability to monitor connected devices for potential malware activity, intrusion detection and Ad-blocking technology. Except you get none of this enhanced security unless you pay the subscription, unfortunately.",
    "The obvious competitor for the Gryphon AX is the ASUS ZenWiFi AX Whole-Home, a Tri-band Mesh router aimed at home users that costs £172.49 in the UK and $264.32 in the USA. It also comes in a dual router pack that costs $391.99 (£339.99) and other bundles of up to five routers.",
    "That’s slightly cheaper than the Gryphon AX, and it has more bandwidth to distribute with an AX6600 rating. And, its security features don’t require a subscription service.",
    "Another alternative is the Linksys MX5300 Velop, an AX5300 rated router that costs £249.99 ($329.98) for one and £479.99 ($549.99) for two. That’s more expensive than the Gryphon AX but incorporates a four-port network switch and USB.",
    "One of the best value branded alternatives is the Netgear Orbi Whole Home Mesh WiFi 6 System (RBK752), costing £360 ($384.05) for a router and satellite, each with four LAN ports. This hardware has the same AX4200 rating as the Gryphon AX but can cover 4,000 ft²with the two devices.",
    "What all these devices offer is global availability, something the Gryphon AX currently can’t match.",
    "Wireless routers are complicated things that can even confound the most experienced IT professional. The Gryphon AX attempts to take an AX capable mesh access point and boil it down into something that typical homeowners can understand.",
    "The focus on parental controls is admirable, but it is easy to imagine that exercising the level of management available through this device is likely to cause a high degree of resentment if those restrictions are not well considered.",
    "What’s not debatable is that this solution is geared primarily for home use.",
    "The lack of controls for Enterprise security protocols makes the Gryphon AX unsuitable for business use, even if this is a secure solution. That the router wants to be at the very top level of controlling internet access won’t fit well with all network layouts.",
    "But where this hardware crossed a line with this reviewer is considering the cost of this hardware, the makers require a subscription to provide the optimal security service that this device offers.",
    "As good as this device can be, do home users need a Mesh capable router?",
    "A single Gryphon AX covers a home of 3,000 ft² and two can span up to 5,000 ft². In the USA, a typical home size was 2,301 ft² in 2019, and the trend is for smaller properties.",
    "Where in Europe, homes are much smaller, with the average UK property being only 826 ft², and even those in Germany are only 1,185 ft² on average. Mesh technology is ideal for offices, but in the residential sector, it's complete overkill unless you live in a mansion or castle. Most people don’t, statistically.",
    "And, given how adjacent houses are in many countries, the extended range of the Gryphon AX is more likely to interfere with the Wi-Fi in neighbouring homes than solve any connection issues in the owner's property.",
    "For those that do have a huge property and the spare time to micro-manage the internet connections of others, the Gryphon AX might be perfect. If you have neither of those things, cheaper options are available that don’t require a monthly subscription for complete functionality."
  ],
  "headers": {
    "5": "Price",
    "7": "Design",
    "20": "In use",
    "31": "Access control",
    "40": "Competitors",
    "45": "Final verdict"
  },
  "links": {
    "ASUS ZenWiFi AX": "https://www.techradar.com/reviews/asus-zenwifi-ax-xt8"
  }
}