{
  "source": "https://www.techradar.com/reviews/vagaro-point-of-sale-pos-system-review",
  "title": "Vagaro point of sale (POS) system review",
  "category": "computing",
  "updated": "2021-10-18T15:04:40Z",
  "author": "tom-cropper",
  "summary": "Fitness and wellness POS software management platform, Vagaro POS, offers membership management, email marketing, transaction security and much more. Find out why it's an upgrade for your business with our review.",
  "verdict": "Don't let the simplicity of the software interface and sleek design fool you. Vagaro POS is a highly effective POS system, ideally suited for its target wellness market of spas and beauty salons. As specialised POS systems go, Vagaro's models contain an exciting mix of POS software features specifically tailored for the beauty, wellness and fitness sectors. If your business works on Windows 7 software or older, however, it may not be so suitable. The good news? Vagaro's pricing structure is transparent with all the details available online, but it is quite complex with a number of fees included.",
  "pros": [
    "An attractive design and extremely user-friendly operation.",
    "Online booking and automatic reminders are a real benefit in reducing admin and the number of missed appointments.",
    "Simple software setup integration makes it easy to get going even without much experience or technical skill.",
    "Free trial available."
  ],
  "cons": [
    "Reporting features could be more streamlined.",
    "The booking system has some bugs, especially when managing multiple bookings.",
    "Pricing can be overly complex with plenty of scope for hidden charges.",
    "Some users online have complained about glitches in migration from previous platforms."
  ],
  "article": [
    "As a beauty spa, gymnasium or salon owner, you've likely heard of Vagaro POS, one of the best POS systems available in the wellness industry.",
    "Whether you sell shampoo, beauty services at scale or spinning machines, Vagaro point of sale offers a great POS software and hardware solution designed specifically with your business requirements in mind. Specialist POS software means a high degree of specification features, such as appointment scheduling and online booking management structured specifically for your business' setup.",
    "With a hard-wearing 15.6 inch POS display monitor with dual screens for customer and business operator, plus a 1920 x 1080 HD resolution the details that go into the design of Vagaro's POS hardware make it an durable market bestseller.",
    "The specificity doesn't stop there though. Vagaro knows its target market of Salon Owners, Beauticians, Gym Managers and Barbers, which is why their POS system has an extensive, detailed pricing structure which it shares openly online.",
    "Vagaro POS software itself is easy to use for staff and freelance fitness instructors, plus it issues automated appointment reminders for customers and business inventory management. Read on to find out how many of Vagaro's POS marketing features, like text push notifications, for a more personalised, profitable service, can give your fitness business an competitive edge.",
    "Vagaro POS free perks",
    "Vagaro's POS system offers superb value for what the POS package comes with. This includes access to an exclusive Vagaro Wellness Marketplace via the Vagaro customer app, which currently has over 500,000 downloads on Google Play marketplace alone, to attract a wider business audience. The counterpart Vagaro Pro POS app for businesses is also available for Apple and Android devices.",
    "Vagaro POS offers",
    "At the time of writing, Vagaro POS also offer up to three months free Vagaro POS system trial for UK customers and a one month free trial for US customers, or a more tempting FREE EMV compliant credit card reader when you start an account with them right away. If you do decide Vagaro is right for you, you'll also have setup fees or hidden cancellation charges to worry about.",
    "Vagaro POS pricing",
    "For one user, Vagaro POS subscripton starts at $25/£20 a month: Check Vagaro POS US pricing and Vagaro POS UK pricing. Their whole pricing model is user volume based and charged as follows:",
    "1 person – $25 or £20/month",
    "2 people – $35 or £30/month",
    "3 people – $45 or £40/month",
    "4 people – $55 or £50/month",
    "5 people – $65 or £60/month",
    "6 people – $75 or £70/month",
    "7+ people – £85 or £80/month",
    "For small merchants with charges of less than $4000/£3500 per month, transaction fees are 2.75% per swipe 3.5% +11 pence or 15 cents per keyed in transaction.",
    "Large merchants, over $4,000 per month in charges will pay 2.2% + 14 pence or 19 cents per swipe and 3.0% plus 14 pence or 19 cents per keyed in transaction.",
    "It also has separate Fixed Acquirer Network fees (FANF) depending on whether a card is present or not.",
    "FANF will not apply to anyone with a monthly sales volume under $200. Businesses with a monthly volume of £150 or $200 – £1000 or $1250 will pay a FANF of 0.15% of the total volume instead of a fixed dollar amount from the table.",
    "For those accepting card not present transactions, you’ll pay the following:",
    "They also have a number of penalty charges including on inaccurate information, returned deposits, chargebacks and investigations of transactions.",
    "Hardware accessories can also be purchased at an extra price. Some of these can be quite pricy so the eventual cost of your POS system could be considerable.",
    "Vagaro's standout POS features for salons and spas include",
    "✔ Dual screen: The POS comes with screens for staff and employees together with a safe and secure check out.",
    "✔ Scheduling: The calendar option allows you to quickly view availability and book classes online.",
    "✔ Virtual classes: A great innovation for the pandemic is the ability to stream classes remotely. This enables people to participate in classes even if they cannot attend in person.",
    "✔ Data analytics and reporting: The system captures a huge amount of data including customer tracking. You can see what customers have been buying, access developing trends and identify special offers or sales techniques which would help them become more involved with your business.",
    "✔ Bespoke look and feel: Each client can use features such as the website builder to give themselves a sales system designed with their own branding and to their own look and feel.",
    "✔ Mobile app: The business comes with a powerful dual facing app – a more powerful one for your business and a more simplified version for customers allowing them to book online from a location of their convenience.",
    "Note that every Vagaro POS system also comes with the following features, or has them available to purchase:",
    "Calendar",
    "Multiple Service Providers, Drag & Drop Appointments, Pop-up Notes, Recurring Booking, Personal Time Off, Resource Management",
    "Online Booking",
    "Yelp Booking, Instagram Booking, Facebook Booking, Booking on Your Website and Outcall/Mobile",
    "Customer Notifications",
    "Automatic Notifications, Push Notifications, In-App Notifications SMS/Text Email",
    "Customer Tracking",
    "Memberships & Packages, Classes, Products, Gift Certificates, Customer Notes & History, IOU, Invoices, SOAP Notes. Extra costs: Forms (£10/mo), Vagaro Drive (starting at £10/mo).",
    "Customer Marketing",
    "Automated Email Marketing, Automated Text Marketing, Get Discovered, Get Featured, Daily Deals. Extra costs: Branded App (£155/mo) and Online Shopping Cart (£10/mo)",
    "Reports & Payroll",
    "Inventory, Clock In/Out, Dashboard, Commission, Export Reports",
    "Website Builder (£10/mo)",
    "Free Templates, Online Booking, Service Provider Bios",
    "POS & CC Processing",
    "WisePad Card Reader. Extra costs: Point of Sale Hardware (Low Pricing), Low Credit Card Rates (1.75%)",
    "2 Great Mobile Apps",
    "Powerful App For Business, Simple App for Your Customers, Get Booked from App 24/7. Extra costs: Check-In App (£10/mo)",
    "An eye-catching design and a highly intuitive user interface make for an easy and comfortable user experience from both staff and customer interactions. All the information is presented clearly and can be easily understood with minimal training. Vagaro is a cloud-based POS system which means you don’t have to install substantial amounts of software making it easier to set up and implement.",
    "Managers can easily access the POS system and monitor everything from any location. This is especially important with more people choosing to work remotely and managers looking for systems which can provide overviews of their businesses which can be accessed on the go.",
    "Vagaro comes with a host of features such as payment transactions, online bookings, gift cards and much more. The system can easily be tailored to the demands of the businesses with features which can be added or removed depending on requirements. Its scalable business model means it can easily evolve with your company, adding one or more new users as and when they are needed.",
    "The price is affordable, and the EMV compliant POS system comes with the latest PCI DSS standards met, vital in an age of data security. The back-office aspect allows users to compile extensive reports, giving them immense visibility of business operations.",
    "Vagaro POS system has a lot of support and guides online, which allow you and your team to quickly get to grips with how to use the POS system. You can search based on various topics such as credit card processing, add-ons and hardware integrations. These offer guides designed to answer any queries and solve common problems.",
    "You can also submit a request or use online chat for any support questions. Vagaro support line is open 24/7 and you can also connect with them via social media.",
    "For a niche but growing industry, this is a surprisingly competitive market for POS providers. Other key POS brands for the health and beauty industry includess Wellness by Wellyx which is aimed at wellness studios. It offers many of the same features such as online booking and class scheduling which would also work for beauty salons and spas. Other options include Zenoti and Gymcatch. The latter is mainly aimed at gym owners and allows users to schedule classes and book online.",
    "Many other customers have also used Square, which is a less wellness-focused POS system provider. Booker POS is another option for spa and salon owners, thanks to an easy client booking system. Of these, though, it is Vagaro which has been really tailored to this space, so it retains a slight edge.",
    "Having a specifically designed POS system for your industry is a real bonus for salon and spa owners. Every Vagaro feature is created with consideration of its industry and modern innovation. With Vagaro POS you can not only manage daily transactions and bookings, you can also build a website, create a branded business app and even live stream classes from anywhere!",
    "These are just a few of Vagaro's POS software features, which can be accompanied by their stylish and user-friendly POS hardware. Anyone can implement Vagaro and get it started with minimal training, their website states setup takes roughly 15 minutes.",
    "Pricing is transparent; however, it can be complicated with add on charges for various penalties as well the cost of buying any additional hardware. The eventual system may end up being more expensive than you expect.",
    "Some users have complained about problems with migration from old platforms with client details going missing, and others suggest that they would like to see a bit more automation and functionality in their features.",
    "Overall though, this is an innovative, detailed-orientated platform which helps with employee management, day-to-day business operation efficiency and securely processing payments. For an excellent wellness POS system alternative, we highly recommend reading our Mindbody POS review."
  ],
  "headers": {
    "5": "Vagaro POS: Plans and pricing",
    "20": "Vagaro POS pricing: Fixed Acquirer Network fees (FANF)",
    "25": "Vagaro POS: Features",
    "51": "Vagaro POS: Interface and in use",
    "55": "Vagaro POS: Support",
    "57": "The competition",
    "59": "Final verdict"
  },
  "links": {
    "best POS systems": "https://www.techradar.com/news/the-best-pos-system",
    "Vagaro Wellness Marketplace via the Vagaro customer app": "https://sales.vagaro.com/vagaro-booking-app",
    "Vagaro Pro POS app": "https://sales.vagaro.com/vagaro-pro-app",
    "EMV compliant": "https://www.techradar.com/news/what-is-emv-compliance",
    "Vagaro POS US pricing": "https://sales.vagaro.com/pricing",
    "Vagaro POS UK pricing": "https://sales.vagaro.co.uk/pricing",
    "Calendar": "https://sales.vagaro.co.uk/calendar",
    "Online Booking": "https://sales.vagaro.co.uk/online-booking",
    "Customer Notifications": "https://sales.vagaro.co.uk/notifications",
    "Customer Tracking": "https://sales.vagaro.co.uk/customer-tracking",
    "Customer Marketing": "https://sales.vagaro.co.uk/marketing",
    "Reports & Payroll": "https://sales.vagaro.co.uk/reports",
    "Website Builder (£10/mo)": "https://sales.vagaro.co.uk/website",
    "POS & CC Processing": "https://sales.vagaro.co.uk/pos",
    "2 Great Mobile Apps": "https://sales.vagaro.co.uk/vagaro-app",
    "EMV compliant POS system": "https://www.techradar.com/news/what-is-emv-compliance",
    "PCI DSS": "https://www.techradar.com/news/what-is-pci-dss-compliance",
    "Wellness by Wellyx": "https://wellness.wellyx.com/point-of-sale/",
    "Zenoti": "https://www.zenoti.com/",
    "Square": "https://www.techradar.com/reviews/square-pos-system-review",
    "Booker POS": "https://www.techradar.com/reviews/booker-pos-review",
    "Mindbody POS review": "https://www.techradar.com/reviews/mindbody-pos-point-of-sale-review"
  }
}