{
  "source": "https://www.techradar.com/reviews/anycubic-vyper",
  "title": "AnyCubic Vyper review",
  "category": "computing",
  "updated": "2021-06-18T08:35:49Z",
  "author": "jess-weatherbed",
  "summary": "Snaking its way onto your workbench",
  "verdict": "If the world of 3D printing ever seemed too intimidating for you, look no further than the AnyCubic Vyper. While perfect for beginners with its auto-leveling feature and minimal assembly, seasoned printing hobbyists will also appreciate what it can offer, albeit with a few adjustments.",
  "pros": [
    "Built-in accessories drawer",
    "Reliable automatic bed-leveling",
    "Great value",
    "Quieter than similar models",
    "Responsive full-color touch screen"
  ],
  "cons": [
    "Excessive initial stringing",
    "Questionable assembly",
    "Cura profile needs fine-tuning"
  ],
  "article": [
    "The AnyCubic Vyper is a new addition to the popular family of AnyCubic 3D printers that aims to eradicate several issues that typically prevent people from exploring the world of 3D printing. Advertised as its first automatic leveling FDM (Fused Deposition Modeling) product, the Vyper is both easy to set up and use within an hour of opening the box. As the 'automatic leveling' might imply, the AnyCubic Vyper removes the need to manually align your build plate should you want to move the machine to a different location. While we kept our initial expectation low for this feature, the process was incredibly reliable and fast, which removes some of the most tedious work associated with setting up and maintaining 3D printers. In fact, a great deal of this printer's appeal will lay in the simplicity its features bring to both new and experienced users alike. You can use the AnyCubic Vyper either connected directly to your PC or laptop via a wired USB cable or by downloading files onto a provided SD card. You'll also find a USB SD card reader for folk who don't have an SD card slot built directly into your computers. A copy of the Ultimaker Cura slicing application and an uploadable profile for the program are provided on the SD card, as well as a test print named 'owl.gcode' and a set of PDF instructions on how to set everything up. The entire setup is near idiot-proof, but experienced in FDM printing will likely notice that the provided test file hasn't been fully optimized for the best possible print quality, and no guide has been included to help new customers understand the Cura software beyond initial setup.There are of course many free tutorials on how to use slicing applications like Cura available online so this shouldn't be too much of a dealbreaker.",
    "A few things that are immediately noticeable about the AnyCubic Vyper its similar appearance to other popular 3D FDM printers on the market such as the Creality Ender 3, though it arguably gives the competition a run for its money when it comes to features, print volume and speed. The touchscreen control panel is also satisfying fast and easy to use, though the estimated print completion time was found to consistently be incorrect. We found the print quality to be greatly improved once things had been better optimized, which makes this a fantastic buy for people looking for a reliable workhorse that won't burn too big a hole in your wallet. Many of the nuisances that we encountered during testing were comparatively small and didn't affect the actual quality of the printer itself, so if you're happy to put some time into making some slight adjustments then we think the AnyCubic Vyper will win you over – it has already removed a fair chunk of the leg work for you after all.",
    "The AnyCubic Vyper is available to pre-order now on the AnyCubic website for people in the US and EU regions at an early bird price of $299 (around £210 / €250 / AU$390) for the first 3,000 units sold. After the initial early discount offer has been depleted it will then be available for its standard price of $359 (around £255 / €300 / AU$460). This isn't the cheapest FDM printer on the market, but it's still a very affordable option that leaves it open for people wanting to buy their first printer, as well as anyone looking to upgrade from an older product. This puts it directly in competition with the likes of the Creality CR-6 SE which is currently listed for $307 (around £220 / €250), but still makes it a cheaper option than the Original Prusa MINI that retails for $399 / €419. Considering how many features you're getting by comparison to these two other products, the AnyCubic Vyper is a fantastic purchase and more than a fair price for what you're getting.",
    "The AnyCubic Vyper comes part-assembled and is easily put together in under 30 minutes, though we could recommend doing so with two people rather than solo given how heavy some of the sections are. The hefty weight is down to the solid metal that makes up most the 3D printer, which results in a sturdy build quality, save for a few areas that might prompt a raised eyebrow. There are a few sections where the shrink wrap used has a less than desirable finish and an unusual 'wax-like' (or possibly melted plastic) substance located on the head of some cables, but these all appear to be purely cosmetic gripes rather than something that affects the condition of the Vyper. There is a drawer built into the printer that contains a few useful extras, such as a set of allen keys, spare nozzles and some filament cutters for removing supports. This isn't the most robust drawer but it doesn't need to be and serves its purpose just fine.",
    "Some sections of cables come discreetly pre-cable tied to keep things tidy, but the instructions ask you to cut through some chunkier cable ties installed to prevent the printer from shifting during shipping so make sure you don't slice through the incorrect restraints. Most of the printer is matte black with deep blue accents found on the plastic housings for internal components. Save for the earlier mentioned criticisms the overall appearance of the AnyCubic Vyper is very sleek and professional, especially with the wiring for the device concealed within thick braided cables. The bright 4.3-inch LCD color touchscreen acts as the userface for the printer located at the front of the device and is a great deal more responsive than other similar systems we've seen on other 3D printers. It's also considerably better than the alternative, given scroll wheels and black/white displays are still fairly commonplace on many printers on the market.",
    "The automatic leveling feature is easy to find on the interface, clearly labeled on the home screen alongside options to prepare and preheat your filament of choice. Where most printers are manually calibrated using a sheet of paper and small, controlled adjustments, the AnyCubic Vyper is an absolute blessing by contrast. By selecting 'Auto-leveling' you'll start the process in which the Vyper carefully pinpoints 16 different locations on the printer bed, making gentle contact on the surface with the nozzle. Not only did this take less than three minutes to complete, but this calibration is actually saved, eliminating the need to make frequent adjustments (providing you don't move the location of your printer). Best of all, it works without any issue. We only had to level the machine once during its initial setup and it retained the calibration until it was moved to a different location, and even then we only re-leveled it as a precaution. It's hard to understate how useful this is regardless of your experience with 3D printing",
    "You're also getting other features such as the ability to pause a print when the available filament has been exhausted or power has been shut off and then resume at a later time with little fuss, and dual cooling fans to rapidly cool your prints, allowing for impressive printing speeds. Up to 180mm/s is achievable but it's recommended that you stick to somewhere between 80-100mm/s for a higher quality print. The heated bed is a lightly textured sheet of steel, held in place via magnets which makes it easy to remove for cleaning or general maintenance. This also makes taking your finished prints off the bed easier if the cooled print material has adhered too strongly to the surface, allowing you to simply 'peel' away the bed rather than using the supplied plastic spatula to wiggle under them. We only used the spatula a couple of times before we noticed the edge was becoming warped so you'll likely want to invest in a metal one if you want one handy. Being textured prevents things from sliding around mid-print, though some material does get stuck onto the surface if the layers are particularly thin and this can be a pain to clean off.",
    "The AnyCubic Vyper took a concerning amount of time to get started when it was powered on for the first time (around 10 minutes to start moving), but this was a blip that we didn't experience again after its initial test print. The 32-bit motherboard and an ARM Cortex-M3 chip ensure that the Vyper is capable for speedy prints while keeping relatively quiet. Most of the actual noise comes from the powerful dual-fans rather than the movement of the printer itself, and while it's far from silent, it's a great deal easier to live with than other FDM printers we've tried. We even managed to get a good night's sleep with it running in the same room. One nuisance that did occur was down to the spool of filament not feeding smoothly through the machine. This didn't affect the print quality in any way, as the motor pulling the material through the machine was more than powerful enough to keep the flow consistent, but it did cause a loud noise every few minutes when the spool itself would move after a deal of resistance. You can improve this by manually adjusting the extrusion force, controlled by loosening or tightening the knob located on the clear plastic feeder housing. For further optimization, you can also print accessories that help to feed the filament through more smoothly.",
    "The SD card that comes with the printer comes pre-loaded with an owl figurine that has already been optimized, but we noticed fairly early on that an issue the Vyper has is time accuracy. This isn't to say it isn't speedy - it's certainly a fast printer (aided by the aforementioned fans that can rapidly cool the print material), but the estimated time of completion displayed on the LCD userface wasn't accurate right out of the box. You can solve this issue by going into the AnyCubic Vyper's Cura profile and selecting into 'preferences' located across the taskbar. From there, head into settings and make sure both 'acceleration control' and 'jerk control' are enabled (though it will be easier to simply hit 'select all'. The time displayed at the end of each print did accurately record the full time taken to complete the print, even before these changes were made on every model we ran.",
    "It takes around two minutes for the filament and bed to pre-heat regardless of what you're making. The Owl g.code model took around 1 hour and 20 minutes to print, though the initial prediction displayed on the machine was 30 minutes. Similarly, Cura estimated the figure would take 50 minutes which also proved incorrect.",
    "The un-optimized quality of the prints made with the provided Cura profile are sufficient, but a few small issues became apparent after we ran a selection of files through. The Z seam is unsightly and can be greatly improved by making a few changes to the setting in Cura (3DPrintGuides has a great tutorial to help guide you through this), but it's frustrating that these issues could have been addressed during the set-up process. We also saw that most of our detailed prints had a fair bit of excess stringing, but nothing that couldn't be improved with some better calibration. We ran a series of benchmarks and 'torture tests' and despite our small criticisms, it's clear that the AnyCubic Vyper is a very impressive printer straight out of the box. We didn't have any failed prints despite minimal adjustments to the provided settings, and while we would recommend using a resin-based printer for some of the finer detailed models, the Vyper prints were still high quality. 3D printing is a skill that needs to be nurtured regardless of the great auto-leveling feature, so while you'll still need to put in some practice to get the best possible results from your prints, AnyCubic has taken out most of the boring setup for you. Seasoned printing hobbyists will be able to appreciate just how quickly they can get the Vyper up and running with minimal fuss, and allows newcomers to improve their software-based skills rather than have to mess around with the physical machine."
  ],
  "headers": {
    "0": "Two-minute review",
    "2": "Price and availability",
    "3": "Design",
    "5": "Features",
    "7": "Performance",
    "11": "Don't buy this if..."
  },
  "links": {
    "3D printers": "https://www.techradar.com/best/best-3d-printers",
    "Creality Ender 3": "https://www.techradar.com/reviews/creality-ender-3",
    "AnyCubic website": "https://anycubic.sjv.io/c/338476/1101384/14022?subId1=trd-us-9372171244228336000&sharedId=trd-us&u=https%3A%2F%2Fwww.anycubic.com%2Fcollections%2Fvyper%2Fproducts%2Fanycubic-vyper",
    "Original Prusa MINI": "https://www.techradar.com/reviews/original-prusa-mini",
    "3DPrintGuides": "https://3dprintguides.com/2020/06/how-to-remove-z-seam-3d-print/"
  }
}