{
  "source": "https://www.techradar.com/reviews/taotronics-tt-af001-air-fryer",
  "title": "TaoTronics TT-AF001 Air Fryer review",
  "category": "appliances",
  "updated": "2021-06-07T15:55:41Z",
  "author": "sophie-bird",
  "summary": "We’ve tested the TaoTronics TT-AF001 Air Fryer to see if it can cook up a storm",
  "verdict": "The TaoTronics TT-AF001 Air Fryer cooks fries to perfection without the need for much oil, but it’s big, and the price tag is quite hefty too. If you need a fryer with a generous capacity and a large selection of cooking presets, this air fryer doesn’t disappoint.",
  "pros": [
    "Quiet in operation",
    "Cooks evenly",
    "Large capacity"
  ],
  "cons": [
    "Relatively expensive",
    "Doesn’t have a shake alarm",
    "Bulky design"
  ],
  "article": [
    "TaoTronics is a brand that’s often associated with headphones and audio tech, but now the brand offers a range of air fryers and cooking appliances in the US and the UK.",
    "The TaoTronics TT-AF001 Air Fryer has a 6-quart/5.7-liter capacity which makes it suitable for preparing meals for six people (although this depends on how large you like your portions). It has 11 presets, and packs power with a wattage of 1,750 - most air fryers have around 1,700.",
    "It’s super-easy to use and works quietly, so it won’t bother you while it’s cooking. If you’re looking for lighter ways to prepare homemade fries, this air fryer doesn’t disappoint, producing crisp and tasty results with very little oil. The high heat also speeds up the cooking process compared to using an oven.",
    "We would have liked to see a shake alarm on this model so that we didn’t have to set a separate timer, but its cooking results, combined with easy cleaning and versatility, make the TaoTronics TT-AF001 an excellent choice, and a contender for our best air fryers list.",
    "The TaoTronics TT-AF001 Air Fryer is available in the US and UK. It’s one of the more pricier air fryers on the market, but it also has a large capacity, so you’re effectively getting more cooking capacity for your money. There are other models from big brands, such as the Instant Vortex Plus Air Fryer that are a similar size but are cheaper.",
    "The first thing we noticed about this TaoTronics air fryer was just how big it was. This isn’t uncommon for an air fryer of this capacity but you’ll certainly need to take into account where it’s going to live because it sure is bulky. There’s a handy cable tidy at the back of the machine, but this juts out making the depth of the air fryer shell even bigger.",
    "It measures 11.7 inches wide by 11.7 inches deep (29.8 x 29.8cm), which is on the large side] for an air fryer, but it’s 13.4 inches / 34cm tall, which could make it a tight fit under some wall-mounted kitchen cabinets.",
    "The controls of the TaoTronics TT-AF001 are displayed on a touchscreen which is illuminated when the machine is switched on. There are 11 presets to choose from, covering everything from fries to meat and even bread, so you can simply add your food, select the appropriate preset and push the start button. There’s a keep-warm function and a pre-heat option, but we were a little disappointed that there isn’t the option to set a shake reminder, so you’ll have to set your own reminder to give the food a shake halfway through the cooking time.",
    "Air fryers are designed to offer hassle-free cooking, and we were pleased to find that the TaoTronics’ frying basket was easy to clean. You can pop it in the dishwasher or wash it in warm soapy water, and even if you opt for the manual option, there won’t be much scrubbing involved thanks to the non-stick coating on the basket.",
    "We placed the air fryer on a heat-proof board for our first tests as some machines can get hot in use, but while the TaoTronics TT-AF001’s exterior became warm it never got hot enough to cause a problem.",
    "We put the TaoTronics TT-AF001 through a series of tests to see if it really is as good as the brand promised. The first thing we noted was how easy the machine was to operate - after washing the fryer basket before the first use, you simply plug it in, add your food to the basket, choose an option from the preset options and press the start button. If there isn’t a preset for the type of food you’re cooking, you can set your desired temperature and cooking time using the touchscreen controls.",
    "TaoTronics recommends using the preheat function before cooking to give you the best results. This normally takes five minutes; however, the first time you use the air fryer, TaoTronics recommends preheating for 15 minutes to allow for any new machine plastic smells to disappear – this worked for us, and a beeping alarm notified us when it was time to add some food into the frying basket.",
    "Our first test was frying frozen steak-cut fries, which normally take 30 minutes to cook in an oven. There’s a preset button for fries on this air fryer which takes 15 minutes, but you will need to shake the fries halfway through the cooking time. We were disappointed to find there isn’t a shake reminder on the TaoTronics TT-AF001, so we had to set a timer on our phone. The fries were evenly cooked after 15 minutes, and were nicely crisp on the outside with a good color to them.",
    "Next in our tests were chicken wings, and we managed to fit five wings into the frying basket without having to squeeze any of them in before selecting the chicken preset button, which took the guesswork of timings. We turned the wings halfway through the cooking process and once the timer was up, the chicken had crispy, golden skin with tender meat inside that fell off the bone – and all without using any oil.",
    "Since chicken wings release fats when they’re cooking, they provided a good test of how easy it was to clean the TaoTronics TT-AF001. The frying basket sits inside a frying drawer, and both can be placed in the dishwasher. The basket and drawer have a non-stick coating, and we found it only took a minute or so to get them looking as good as new in warm soapy water – although it’s nice to know that placing them in a dishwasher is also an option.",
    "We couldn’t complete our testing process without making homemade fries. For this test, we sliced potatoes, soaked them in water, and then placed them into the air fryer with a tiny drizzle of oil (around half a tablespoon/ 7.5ml) and selected the fries preset, which cooked the potatoes for 25 minutes. After shaking the fries halfway through, we were impressed to find beautifully cooked fries at the end of the 25 minutes – they had a golden color and a crispy coating, but the insides were soft and fluffy.",
    "The TaoTronics TT-AF001 was impressively quiet while it was cooking and only measured 44 decibels on our meter, which is no more than background noise To put that into perspective, the Cosori CP137-AF averaged 61 decibels and still didn’t seem particularly loud."
  ],
  "headers": {
    "0": "One minute review",
    "4": "TaoTronics TT AF001 Air Fryer price and availability",
    "5": "TaoTronics TT-AF001 Air Fryer design",
    "10": "TaoTronics TT-AF001 Air Fryer performance",
    "17": "Don’t buy it if…"
  },
  "links": {
    "best air fryers": "https://www.techradar.com/news/best-air-fryer",
    "Instant Vortex Plus Air Fryer": "https://www.techradar.com/reviews/instant-vortex-plus-air-fryer-review",
    "Cosori CP137-AF": "https://www.techradar.com/reviews/cosori-cp137-af"
  }
}