{
  "source": "https://www.techradar.com/reviews/realme-8-review",
  "title": "Realme 8 review",
  "category": "phones",
  "updated": "2021-06-04T11:28:13Z",
  "author": "jennifer-allen",
  "summary": "Solidly dependable for the price",
  "verdict": "The Realme 8 has a look that won't appeal to everyone, but under the hood there’s some quality performance for the price, in terms of the power, screen, battery and cameras. It's just a shame there's no 5G.",
  "pros": [
    "Sharp display",
    "Good gaming performance",
    "Good cameras"
  ],
  "cons": [
    "Look is a bit divisive",
    "No 5G support",
    "Feels a bit cheap"
  ],
  "article": [
    "Realme isn't exactly a household name in the West still, despite being around since 2018. Its name is better known in India where it holds a number of records and is also the country's fourth largest smartphone brand. In the UK and US though? It's a less known quantity. Perhaps then that's why the Realme 8 manages to be very well priced while still offering some great features.",
    "On paper, it has everything you could need from a budget phone. There's a 6.4-inch AMOLED screen that's bright and vibrant each step of the way, along with a MediaTek Helio G95 chipset that's designed with gaming in mind. A decent set of cameras further solidifies its ability to be a bit of a jack of all trades.",
    "That's not bad going at all for a phone that costs from £199 (around $280 / AU$360). It's only currently available in the UK and Europe with no news as to what comes next for the Realme 8, but residents of those shores would be wise to take note of it. It's a relatively cheap phone that still packs a lot in, providing you don't mind that there's no 5G support here, that is. For that, you'll want the Realme 8 5G.",
    "The phone has a somewhat divisive look to it. We were sent the Cyber Black edition but it's not entirely black. Instead, it has silver edges and these - visually as well as physically - stick out just a little bit, making it feel less stylish than we suspect its makers wanted it to look.",
    "Of course, looks are highly subjective, but it's those ridged edges that make us a little less keen. A sleeker design that you can wrap your hand around without noticing any edges would feel that touch classier. Similarly, a plastic back isn't exactly great, but it's these concessions that are presumably necessary to provide the performance that the Realme 8 offers.",
    "Screen-wise, it has a 6.4-inch Super AMOLED display offering a peak brightness of 1,000 nits. It looks as good as you'd expect, with its 1080 x 2400 resolution ensuring that everything looks sharp and vibrant throughout. That ties in well to its fairly strong gaming performance or simply if you want to watch some streaming content while on the move.",
    "Such viewing is somewhat enhanced by the fact that the front-facing camera is nicely out of the way. It's in the top left corner of the screen and barely makes a dent in what you're doing. You won't have to worry about fingerprint sensors either, with this placed under the display for seamless transitions.",
    "Four camera lenses reside on the back, in the top left corner, only moderately raised, and the somewhat cheesy Realme tag line - 'Dare to Leap' runs down the length of the rear. Fortunately, in our black shade at least it's fairly subtle so it's not too noticeable unless you're looking closely.",
    "The Realme 8's camera offers quite strong performance at this price point too. The lenses include a main 64MP camera, an 8MP ultra-wide, a 2MP macro, and a 2MP depth sensor. While some shots lack a certain amount of brightness, the images are pretty sharp and the results are suitably pleasing to our eyes. A 16MP selfie camera is useful too if you like to take shots of yourself, and the ability to record video in 4K at 30fps is there as well.",
    "Other camera features such as a night mode and AI scene enhancements further go some way to making this phone's cameras feel up to scratch.",
    "There's no wireless charging functionality here but the 5,000mAh battery recharges quite quickly, with Realme promising just over an hour for a full recharge. We certainly had no complaints during our testing of it.",
    "As mentioned, the Realme 8's performance is particularly well tuned for gaming thanks to the Helio G95 chipset. Of course it won't rival far more expensive fare but nor should you expect it to. But its benchmarks are pretty admirable for the price tag, and you'll likely be pleased at how nippy it feels in general use.",
    "We're still not sure about those looks but there's no denying that the Realme 8 is good elsewhere, especially for the price. It doesn't have any standout failings other than possibly its lack of 5G connectivity, depending on your needs, meaning it's a solidly attractive option for those on a budget and not in need of the biggest name in phones.",
    "The Realme 8 is available in the UK now, as well as Europe. There's no news of a release date further afield just yet. The phone is available in three different color schemes - Cyber Silver, Punk Black, and Cyber Black, and it starts at £199 (around $280 / AU$360).",
    "It's also possible to choose between two different configurations - 4GB of RAM and 64GB of storage or 6GB of RAM and 128GB of storage, with the latter costing an extra £20 at £219 (roughly $310 / AU$400). Needless to say, it's worth the extra £20 to get the extra RAM and storage space.",
    "The price makes it a contender for our list of the best cheap phones, but it faces stiff competition from similarly priced rivals like the Xiaomi Poco X3 NFC and the Moto G30, while the Realme 8 Pro only costs a little more and gets you upgrades to the chipset and camera.",
    "The Realme 8 only weighs 177g and it feels comfortable in your hands, even if you have quite small hands. It has a somewhat curved rear but that's slightly offset by the fact that the edges stick out a bit from the screen and rear, creating an extra ridge.",
    "We're not totally sold on this design, but perhaps the choice of color scheme doesn't help, with the Cyber Black variety turning those edges silver, thereby further highlighting them. It's no deal-breaker, of course, but it's something to bear in mind if style is important to you.",
    "More noticeably, the back and frame are both plastic, leaving the Realme 8 feeling a little cheap, but it's fair enough that shortcuts need to be taken to keep this device so well priced.",
    "Elsewhere, the design is fairly run of the mill. The USB-C port is on the bottom along with the speakers and a 3.5mm headphone jack. Volume controls and the power button are all on the right hand side for easy access.",
    "The fingerprint sensor is built into the display, so you don't have to worry about that getting in the way anywhere. Similarly, the selfie lens is suitably unobtrusive in the top left hand corner, leaving the front of the device looking pretty clean.",
    "On the back you'll find the camera lenses and the Realme tag line, the latter being subtle (at least in the shade we had for review) yet a tiny bit tacky too. Who needs their phone to come with a pseudo-inspirational line anyway?",
    "The Realme 8's screen is pretty nice. It's a 6.4-inch 1080 x 2400 Super AMOLED display promising peak brightness of 1,000 nits. For the less techy amongst us, that means it looks nice. It's a good size for watching streaming content and we didn't notice any issues when playing fast-paced games on it either.",
    "Underneath that display there's a fingerprint scanner which is just how we like things. It's a little bit smarter than placing a fingerprint sensor on the back and it's been speedy every time we've used it.",
    "With vibrant colors whatever we were doing, and a consistently responsive nature every time we picked our phone up, you can't really go wrong with the Realme 8's display at this price.",
    "The Realme 8 has four rear cameras located on the top left corner and only sticking out ever so slightly. These include a 64MP main camera, an 8MP ultra-wide camera, a 2MP macro, and a 2MP depth camera. Combined, it's a decent bunch of options and the results were pretty good as you can see below.",
    "Being able to choose the 64MP mode separately from everything else is always welcome but that's the neat thing about this camera. There are plenty of options for every scenario.",
    "Occasionally, there was a certain lack of color with our photos from the main camera but for the most part, this wasn't much of an issue. Instead, we appreciated how sharp and detailed many of the images looked, even as we increased the zoom to get more of a close up.",
    "Night mode does wonders for brightening up a darkened scene. Similarly, when taking photos of anything reasonably vibrant such as flowers, the results are pretty good. Even weeds can look quite delightful in the end.",
    "Macro mode was also a bit of a highlight, ensuring that a potentially dull photo of a dandelion flower was rich in detail.",
    "Video footage is available in 4K at 30fps from the rear camera or 1080p at 30 or 120fps on the selfie camera. Both provide reasonable quality here.",
    "The Realme 8 also has an AI Scene Enhancement mode like many other devices, but we didn't find the need to rely on it quite so much as we have with other phones at this price. Instead, images look pretty sharp regardless. Always a good sign.",
    "The Realme 8 feels suitably responsive at all times. Whether you're unlocking it via a password, fingerprint or your face, the phone is swift to respond to your touch so you won't have that split second pause that soon irritates. That trend continues with opening apps, and even some demanding games like Call of Duty Mobile.",
    "This game expects a lot of phones which is why we use it for testing, but the Realme 8 certainly wasn't too bothered by what it had to deal with. It made a change to be able to dive into a game reasonably quickly with minimal hassle on such a cheap phone.",
    "In our benchmark tests using Geekbench 5, we were fairly pleased. The phone (which has a MediaTek Helio G95 chipset) returned a multi-core score of 1,676 with a single-core score of 530. No complaints there then. Similarly, in use, games performed well, with a decent response rate for a phone that costs just £200 (around $280 / AU$360).",
    "Elsewhere, there's the option of the 4GB of RAM and 64GB of storage configuration or 6GB of RAM and 128GB of storage. We're not sure why anyone would save the £20 (roughly $30 / AU$35) and go for the cheaper option. Don't do it. Buy the superior variety and you'll be happy. If you somehow need more storage, a dedicated microSD card slot will help you out.",
    "As mentioned, the Realme 8 lacks 5G support, which is definitely a noticeable omission if you plan on future proofing with your next smartphone purchase. There's always the Realme 8 5G but weirdly, the standard Realme 8 has a superior camera and charges faster.",
    "The Realme 8 has a 5,000mAh battery capacity and it shows. Its battery life proved fairly long in our time with it, so you won't have to worry about recharging it all the time. As always, your mileage will vary, so if you're playing a lot of games it'll sink faster but you shouldn't generally feel the desperate need to recharge at the end of the day.",
    "When the time comes, it won't take long anyway. The Realme 8 juices ups fast with 30W of power at its disposal and it promises to get back up to 50% in just over 25 minutes. A full charge takes just over an hour.",
    "In our experience, those advertised figures work out about right. We liked being able to get back to being away from a power source reasonably quickly.",
    "Just bear in mind there's no wireless charging support so you'll be stuck to using cables. A small price to pay for speedy charging, at least.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "Realme 8 release date and price",
    "16": "Design",
    "22": "Display",
    "25": "Camera",
    "32": "Specs and performance",
    "37": "Battery life",
    "41": "Don't buy it if..."
  },
  "links": {
    "Realme 8 5G": "https://www.techradar.com/news/realme-8-5g-has-landed-as-the-cheapest-5g-phone-in-the-uk",
    "best cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "Xiaomi Poco X3 NFC": "https://www.techradar.com/reviews/xiaomi-poco-x3-nfc",
    "Moto G30": "https://www.techradar.com/reviews/moto-g30",
    "Realme 8 Pro": "https://www.techradar.com/reviews/realme-8-pro"
  }
}