{
  "source": "https://www.techradar.com/reviews/dashlane",
  "title": "Dashlane password manager review",
  "category": "computing",
  "updated": "2021-11-23T04:21:04Z",
  "author": "kieron-allen",
  "summary": "Is Dashlane the best password manager available?",
  "verdict": "Dashlane is an advanced password manager with all the functionality you would expect from a market-leading brand. The only drawback is how much you have to pay for it.",
  "pros": [
    "Lots of features",
    "Easy to set up and use",
    "Free tier available",
    "Free 30-day trial with no credit card required"
  ],
  "cons": [
    "Premium plans are expensive",
    "Free option has a 50 password limit",
    "No direct phone number",
    "Limited hours for live chat support"
  ],
  "article": [
    "With over 14 million customers, Dashlane is one of the best password managers available, with its first version of its software coming out almost a decade ago in 2012. It enables you to keep all of your passwords, usernames, payment card details, and secure notes in one safe place. It's just relaunched its Password Changer and added a new autofill engine powered by machine learning too. It’s no wonder that leading companies trust their passwords to Dashlane such as Pepsico, Wayfair, and BainCapital.",
    "Hackers continue to develop ever more ingenious methods to break weak passwords, while regular data breaches flood the internet with millions of leaked credentials. This is making it even more important to choose unique, strong passwords - and store them effectively.",
    "In our Dashlane review, we explore the many features that make this password checker a serious contender for the top spot, giving you all the information you need to decide whether this password manager is right for you.",
    "Dashlane automatically fills login details for websites, credit and debit card numbers, and online forms - a feature that can make the average working day far more efficient. A bulk password changing function also makes it easy to change multiple passwords at once in the event of a significant data breach.",
    "The software is packed with features, including a VPN for safe browsing on public Wi-Fi connections, which makes Dashlane much more than just a password manager. Even the free version includes personalized security alerts and a password generator.",
    "Dashlane’s business suite essentially handles every aspect of a company's password security, from password storage and bespoke security ratings for individual team members to security policy management via the in-built Admin Console. From this console, you can “Pinpoint password hygiene problems” from the Password health score that gets generated, along with details of compromised passwords.",
    "Dashlane works with most operating systems, and there is a plugin for all the main browsers, including Chrome, Edge, and Firefox. There is also a desktop app available, but combined, the browser plugin and web app are more than adequate.",
    "The setup process is simple and straightforward and took us under five minutes to complete. The interface is so well-designed it led us seamlessly through the handful of steps required to register a new account and save our first set of credentials.",
    "To begin, we were encouraged to add the Chrome extension. From here, we were directed to the sign-up page.",
    "We were then presented with a list of popular websites with links and logos and asked to select our first site. The software then guided us through the process of selecting and storing passwords using the Chrome extension.",
    "Dashlane’s interface is its biggest selling point, and we had no trouble finding our way around the web app or Chrome extension. Both were clean, logical, and easy to navigate.",
    "The web app can be accessed via the plugin by selecting the vertical dots to the right of the Generator tab, or directly, by logging in at www.dashlane.com.",
    "Here, you can manage and add passwords, view your account information and access the other features that come with your plan. Any changes we made were instantaneous, for example, selecting and deselecting the “Always log me in to this website” feature.",
    "The password generator is accessed through the browser plugin, a nice touch that enables you to create strong passwords whilst browsing for an easy to live with workflow.",
    "Dashlane is the only US-patented password manager and uses military-grade AES 256-bit encryption alongside its patented technology.",
    "Further security is enabled by two-factor authentication (2FA) compatible with common authenticator apps and U2F security keys. Like some other password managers, there is a master password that the user needs to enter to access the service, but only the user has it, and Dashlane has zero knowledge of it, and does not store it.",
    "Dashlane is also keen to point out that it doesn’t trade user data for profit. In fact, it can’t. The technology has been designed so no one at Dashlane can see any of the information it stores.",
    "Dashlane has a well-organized and easy to navigate support page that we were able to access through both the web app and Chrome extension. It has a prominent search bar top and center to look for content, and also plenty of predone articles, including “Buying and using a premium family plan,” “How to update Dashlane,” and “Using Dashlane to autofill passwords with iOS” to solve common scenarios encountered.",
    "FAQs are comprehensive and arranged into categories such as Account & Security, Passwords & Data, and Platforms & Browsers.",
    "Live chat support is available in English between 9 am and 6 pm EST, Monday to Friday, while out of hours, it's possible to consult the chatbot and contact the support team via email. We tested all options and were impressed with each of them, as there was no queue on the live chat and our request was dealt with quickly and professionally. The automated bot provided us with relevant resources, and our email was replied to promptly and included information on when and how to contact the live support staff.",
    "The lacking support options are a direct phone number. We did not find any way to “Reach out and touch someone” via phone, toll free nor fax unfortunately which is a miss on a paid subscription offering.",
    "For individual users, there is a free tiered option, but it only stores up to 50 passwords on a single device. This is a pretty meager plan that only the most basic users will find to be sufficient, and other free tiers are not so limited on the number of passwords and also devices. For most personal users, and for businesses, a paid plan is sure to be essential.",
    "Dashlane Premium is for individuals, costs $6.49 per month on a monthly basis, and, also a discount is available when billed annually which works out to $4.99/month. On top of unlimited passwords and devices, the plan also includes some of Dashlane’s more outstanding features, like an built-in VPN, 1 GB of encrypted file storage, and Dark Web monitoring.",
    "Also, there is the Dashlane Family plan, that covers six separate Premium plans all for one price. At $8.99 per month ($7.49/month when paid annually), it includes all the benefits of Premium such as a Password Changer, unlimited devices and passwords, and the VPN for Wi-Fi protection.",
    "At the business side, Dashlane Team enables companies to manage separate workspaces and monitor security through an Admin Console and costs $5.00 per user per month, billed annually. There is also the Dashlane Business plan that goes up to $8.00/user per month, and adds SAML-based single sign-on (SSO), along with the bonus of a free family plan with each subscription.",
    "Dashlane’s biggest competitor is LastPass, which is consistently voted among the best password managers on the market.",
    "Dashlane has, in our opinion, a cleaner, more user-friendly interface, but LastPass wins on value for money. Its free version is only slightly different from its paid one and enables users to input an unlimited number of passwords. Thus, it could be a better option for users unconcerned by the extra features Dashlane offers.",
    "KeePass is Dashlane’s closest competitor in regards to security. The company sells its service on its security merits, but, unlike Dashlane, this advanced security comes at the expense of convenience. Another strong competitor is Solarwinds Passportal which is a business password manager.",
    "It’s hard to find fault with Dashlane. The simplicity of its interface means even first-time users can benefit from the advanced password management services and security it offers. Our only real criticisms are the price of its paid plans—particularly Dashlane Business, which at $5.00 per user per month is a considerable sum—and the 50 password limit in the free version.",
    "We've also featured the best password manager and best password generator"
  ],
  "headers": {
    "3": "Features and utilities",
    "7": "Setup",
    "10": "Interface and performance",
    "14": "Security",
    "17": "Support",
    "21": "Plans and pricing",
    "25": "The competition",
    "28": "Final verdict"
  },
  "links": {
    "Dashlane": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8484085497981789000&xs=1&url=https%3A%2F%2Fwww.dashlane.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdashlane",
    "best password managers": "https://www.techradar.com/best/password-manager",
    "Password Changer": "https://www.techradar.com/news/dashlane-is-eliminating-the-hassle-of-changing-your-account-passwords",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "online forms": "https://www.techradar.com/best/best-online-form-builder",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "password generator": "https://www.techradar.com/best/password-generator",
    "browsers": "https://www.techradar.com/best/browser",
    "Chrome extension": "https://www.techradar.com/news/the-best-google-chrome-extensions",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "security keys": "https://www.techradar.com/best/best-security-key",
    "Live chat": "https://www.techradar.com/best/best-live-chat-software",
    "Dashlane Premium": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2178096157805029000&xs=1&url=https%3A%2F%2Fwww.dashlane.com%2Fplans&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdashlane",
    "built-in VPN": "https://www.techradar.com/reviews/dashlane-vpn",
    "Dashlane Family": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8757364487316188000&xs=1&url=https%3A%2F%2Fwww.dashlane.com%2Fplans&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdashlane",
    "Dashlane Team": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5834267995344540000&xs=1&url=https%3A%2F%2Fwww.dashlane.com%2Fbusiness%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdashlane",
    "Dashlane Business": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4893472893437835000&xs=1&url=https%3A%2F%2Fwww.dashlane.com%2Fbusiness%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdashlane",
    "SSO": "https://www.techradar.com/best/best-identity-management-software",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "KeePass": "https://www.techradar.com/reviews/keepassxc",
    "Solarwinds Passportal": "https://www.techradar.com/reviews/solarwinds-passportal",
    "business password manager": "https://www.techradar.com/best/business-password-management-software",
    "best password manager": "https://www.techradar.com/best/password-manager",
    "best password generator": "https://www.techradar.com/best/password-generator"
  }
}