{
  "source": "https://www.techradar.com/reviews/ring-video-doorbell-pro-review",
  "title": "Ring Video Doorbell Pro review",
  "category": "smart-home",
  "updated": "2021-06-23T11:31:44Z",
  "author": "luke-edwards",
  "summary": "The Ring Video Doorbell Pro is the smartest way to see and speak to whoever is calling, no matter where you are",
  "verdict": "This is the best video doorbell yet from Ring, bringing full-on security features to a doorbell that doubles as an intercom and plays nicely with your smarthome too.",
  "pros": [
    "Color night vision",
    "Great activity zone personalisation",
    "Mains powered"
  ],
  "cons": [
    "Main powered only",
    "Basic cloud access"
  ],
  "article": [
    "Ring has been been making doorbells for enough generations to have nearly reached perfection. The Ring Video Doorbell Pro isn't just a way to see and speak to whoever is on your doorstep, it now doubles as a home security camera system with smart motion detection and zone controls that make this a real all-in-one solution.",
    "While this review is for the Ring Video Doorbell Pro, Ring has since unveiled a new iteration - the Ring Video Doorbell Pro 2, which features higher resolution video, a 1:1 aspect ratio so you can see more of the person on your doorstep and had motion detection features, so it may worth be considering.",
    "Ring is better known for its battery-powered doorbells but the Pro model is a mains-only unit, which means it has the always-watching capacity to make for a better security system. The benefit of mains power also means you can set Motion Zones to ensure you don't get too many false notifications. Plus this will even work with an internal chime meaning you can get good old-fashioned doorbell noises to alert you. But, yes, even these are customizable. Read on to find out everything you need to know about the Ring Video Doorbell Pro and whether it really is one of the best video doorbells on the market.",
    "The Ring Video Doorbell Pro sure isn't cheap at £229 / $249 / AUS$399. But when you consider this is a home security camera as well as a smart doorbell that takes the sting out of the otherwise steep price tag.",
    "Comparatively, Ring's flagship Video Doorbell Elite is a whopping $349 / £349 AU$499, which gets you the addition of a professional grade Ethernet-powered connection, flush mount and sleek design. That said, the entry-level Ring Video Doorbell Wired costs $59.99 / £49 / AU$119 while the battery-powered Ring Video Doorbell 4 is priced at $199.99 / £179 / AU$329.",
    "To get the most out of the video doorbell, you will need a Ring Protect plan. Prices start from $3 / £2.50 /AU$4 per month or $30 / £24.99 / AU$40 for a year - but you do get a 30-day free trial included with the doorbell. This offers up to 30 days of online storage so you can review any video after it's been captured and also provides access to other features to help reduce unwanted motion alerts.",
    "As doorbells go, this is one very good looking example. Even the button is surrounded by that futuristic blue ring of light that helps give the brand name its double entendre. Wordplay aside, that ring of light is also a nice feedback feature (along with an audible tone) so the person pressing the bell knows it's working and doesn't follow-up by banging on the door too - great for anyone with napping children.",
    "The outer surround is sleek, minimal and can be adapted to suit your front door decor with varying faceplates including Satin Nickel, Pearl, Venetian and Black - all of which come included. The reason for a removable faceplate isn't just for personalisation, it also allows for simple setup.",
    "With the faceplate off you can access the setup button, which is then securely locked away once the faceplate is screwed on. This comes after you've wired in the unit using two simple screws. The wall mounting is more of a faff with drilling required - but all the parts, even the drill bit, come included. So all you need is a drill and then you can mount and wire in, replacing your existing doorbell.",
    "So installation isn't easy, but if you go in with that expectation you'll be pleased it was made as easy as possible by Ring, which supplies everything to help. This includes a transformer as your current non-smart doorbell likely won't be using a 12V connection. All this only has to be done once, unlike the easier to install battery unit that then requires charging maintenance. Then you simply download the app, fill out some details, get connected and you're up and running.",
    "The basics need to be mentioned first as this covers everything you'd expect. That means Full HD 1080 video with two-way talk functionality. This can be done via the smartphone app, meaning you get alerts, wherever you are, when the doorbell is pressed. This can also work with a plug-in chime for more traditional alerting. You also get night vision which, in this model's case, is also in full color for extra clarity.",
    "The more enhanced features, that help to make this a security solution too, include custom motion zones, motion activated alerts, Live View video on demand and Amazon Alexa support. You can also link this in with other Ring security cameras so everything is fed into the one app for easy home monitoring. If you've got a smart lock then you can unlock that, although not within the app.",
    "The most important thing: does this work as a doorbell? Yes it does. However, there can sometimes be a slight delay on opening the app with a connection for two-way video. That said, the alert comes through right away so you can begin walking to the door as the app opens in the case of a slight delay. We're being sticklers here, as this delay is mere seconds - but worth a mention.",
    "Once connected the video quality is superb, no matter the lighting. Faces are very clear, making this a great security camera, even at night. Audio quality wasn't so great with quite a delay and cracking at both ends, despite a strong Wi-Fi connection on both devices. This was in a quiet environment with no street noise to worry about, or winds. It almost makes us think the device is faulty as you'd think audio would be fine when video image quality is so superb. Also, many other reviewers had no issues with audio, although some did have longer delays on connection than us.",
    "Motion Zones are a fantastic addition that work better on this doorbell than the battery powered options. This is because the Pro uses the camera's video sensor to detect movement rather than using the power saving PIR sensor a battery unit does. As such you can set very specific motion zones, allowing your neighbours to pass down the side, or people walk along the street, without setting off an alert.",
    "There are varying levels of sensitivity too, which we adjusted until notifications were fewer - ultimately leaving it on the least sensitive setting. Another nice touch is the ability to pause motion alerts - ideal if you're in and out unloading a car, say. Also a great addition is the option to set alerts only when people are detected, rather than simply movement. This is nice if you've got zones and sensitivity setup but are still getting too many notifications.",
    "Ring plays nice with lots of - mainly US based - services, but it's Amazon's Alexa we enjoyed as this allows you to get notifications through your Echo speakers. If you've got a screen-toting Echo Show you can even see who's at the door and talk to them.",
    "The Ring Video Doorbell Pro is the best that the company has produced so far, without spending lots more on the Elite model. The use of mains power makes it a little more difficult to install but then there are no maintenance requirements and you get to enjoy motion zone detection which makes this a real home security device. That's presuming you opt for the monthly subscription cloud storage, of course. Competition from the likes of the Next Hello, with continuous recording and facial recognition, is strong but this is a very compelling offering.",
    "Video quality is excellent, day or night, with clear detection of faces.The two-way talk does work but the clarity was lacking, in the case of our tests at least. Response times were decent with an easy to use app that offers great features without being too complicated to use. The addition of Amazon Alexa support for use with Echo devices is genuinely useful if you own them. The included chime is another nice touch by Ring that makes this a full home notification system right out of the box.",
    "First reviewed: October 2020"
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design and setup",
    "10": "Features",
    "12": "Performance",
    "17": "Final verdict"
  },
  "links": {
    "home security camera": "https://www.techradar.com/news/best-home-security-camera",
    "Ring Video Doorbell Pro 2": "https://www.techradar.com/reviews/ring-video-doorbell-pro-2-review",
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "Ring Video Doorbell Wired": "https://www.techradar.com/reviews/ring-video-doorbell-wired-review",
    "Ring Video Doorbell 4": "https://www.techradar.com/news/ring-video-doorbell-4"
  }
}