{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
  "title": "Xiaomi Mi 11 review",
  "category": "phones",
  "updated": "2021-09-15T16:23:39Z",
  "author": "tom-bedford",
  "summary": "More than an iterative update.",
  "verdict": "The Xiaomi Mi 11 is one of the best premium phones you should consider buying, as it’s well-specced in almost every department: it has super-fast processing, a high screen resolution with extra display modes, and some camera modes and features the competition lacks. It’s just a shame that the sub-par battery life and unreliable fingerprint scanners mar the experience.",
  "pros": [
    "Fast performance",
    "Some top photography modes",
    "Good-looking screen"
  ],
  "cons": [
    "Temperamental fingerprint scanner",
    "Battery life is lacking",
    "No telephoto camera"
  ],
  "article": [
    "Never has Xiaomi’s rivalry with Samsung been so pronounced: the same year the latter company downgrades the specs of its flagship phones from previous generations (and the price accordingly), Xiaomi’s comes along and turns all those same specs up to (Mi) 11.",
    "At the Xiaomi Mi 11 launch the company announced, with an air of smugness, that it had recently become the third-largest smartphone seller in the world; Samsung still holds top spot by a country mile, far ahead of Apple too, but Xiaomi is rising fast. This third-place position didn't last long: a few months later, Xiaomi had overtaken Apple too, for the silver medal.",
    "The Xiaomi Mi 11 is Xiaomi's 2021 flagship phone: it's the main member of a family completed by the budget Xiaomi Mi 11 5G, mid-range Xiaomi 11T and 11T Pro (both of which were released six months after the Mi 11) and super-top-end Mi 11 Ultra.",
    "The Mi 11 sits at the head of the table though - the phone brings plenty of upgrades over its predecessor, the Mi 10, a big step up that’s the inverse of Samsung’s Galaxy S21 downgrade from the S20.",
    "These upgrades are most apparent when considering the phone’s display. The Mi 11 has a 2.5K resolution, over the 2K of the Mi 10 and Galaxy S21, but there are plenty of other enhancements like automatic video resolution and framerate upscaling, screen HDR modes, and various brightness and reading modes.",
    "There are plenty of other ways the phone trumps its predecessor, and the competition, too. It has improved loudspeakers tuned by Harman Kardon, a faster processor which tops our benchmark charts, new videography modes which are fun to play around with, and super-fast charging speeds.",
    "A standout new Xiaomi Mi 11 feature has to be its 5MP telemacro snapper, for taking close-up shots of subjects. It’s easy to use, takes great photos, and beats similar modes on other devices.",
    "So far this two-minute review has been largely positive, and paints the Xiaomi Mi 11 in a much more favorable light than Samsung’s latest flagship; but that’s not totally the case, as the phone has a few issues too.",
    "The main one we found during our testing was that the Xiaomi Mi 11’s battery life simply isn’t up to snuff – we had to turn off some of the phone’s features if we wanted it to last a day. If you want to enjoy all the unique features you’re paying for, be aware that you’ll need to charge this thing more than once per day.",
    "In our Xiaomi Mi 10 Pro review we complained about its slow fingerprint scanner, and that issue is present here too – and on top of that, the sensor sometimes didn’t pick up our print first time, making it occasionally frustrating to use.",
    "So the Xiaomi Mi 11 is a great smartphone, but certainly not a flawless one. For many people it could be the top choice on the market right now, thanks to its cameras, display and performance, but those couple of problems, which will manifest themselves every day you’re using this phone, are things you need to bear in mind too.",
    "You can buy the Xiaomi Mi 11 with either 128GB storage or 256GB - the former costs £749 / AU$1,099 (roughly $1,040), and the latter is £799 / AU$1,139 (around $1,110). A US release probably isn't on the cards, as Xiaomi doesn't sell its phones there.",
    "For context the Mi 11 Lite 5G costs £399 (around $550 / AU$755), the 11T is £499 (about $690, AU$940), the 11T Pro will set you back £599 (around $830, AU$1,130) and the Mi 11 Ultra kicks the ball way higher, costing - £1,199 / AU$1,799 (roughly $1,600).",
    "The Mi 10 launched at £799 / AU$1,699 (roughly $1,000) and the Samsung Galaxy S21, the Mi 11's closest contemporary rival, starts at $799 / £769 / AU$1,249, so the Mi 11 doesn't vary too far from what we expected.",
    "The Xiaomi Mi 11 isn’t the company’s largest flagship smartphone – the Mi 10T takes that crown – but it’s still fairly large, with dimensions of 164.3 x 74.6 x 8.1mm. At 196g, it’s fairly lightweight for a phone of its size.",
    "The Mi 11 is long and thin as phones go – it’s not quite a Sony Xperia phone in that regard, but it’s not a million miles off. As such, despite its size, it’s fairly comfortable to hold and use one-handed, though people with smaller digits may still find it a stretch to reach the upper part of the screen.",
    "At the bottom the phone has a USB-C port – there’s no 3.5mm headphone jack for wired-audio fans – a power button and volume rocker on the right edge, and an IR blaster at the top. This latter tool is used to send out infrared signals, and finds most use with the Mi Remote app which turns your smartphone into an ersatz TV (or AC, or smart box) remote.",
    "The Mi 11 has a glass front and back, and aluminum frame – the glass is called Gorilla Glass Victus, and the company that makes it (and most glass phone bodies) says it’s extra-protective. Since most glass phones can be fragile, this sturdiness is welcome, and the phone remained free from scratches and marks through our testing. A solid drop or knock could still crack it though.",
    "The phone’s rear camera bump debuts a design we haven’t seen before: it’s stepped, with each lens sticking out by a different amount. It’s certainly novel, and helps set the Mi 11 apart from the crowd – unless Xiaomi decides to use this design for the rest of its 2021 smartphones, which wouldn’t surprise us. Even the most protruding lens doesn’t stick out too far from the phone, at least not compared to those on previous Xiaomi flagships.",
    "With a 6.81-inch display, the Xiaomi Mi 11 is the company’s biggest flagship in terms of screen size, and it also dwarfs almost all of its competitors. The screen is curved at its edges, though not dramatically so, and is broken up by a small ‘punch-hole’ cut-out for the selfie camera in the top-left corner.",
    "In terms of resolution, the Mi 11 screen is 1440 x 3200, which is sharper than those on most flagships of a similar price (including the Mi 10 and Galaxy S21). It’s an AMOLED panel, so colors are particularly vibrant, and there’s also HDR10+ support.",
    "The display has a 120Hz refresh rate, which many flagships now use, though Xiaomi does have a 144Hz phone on the market too. This means the image updates 120 times per second, double the ‘standard’ of 60Hz, and in effect this makes moving images appear smoother. Not everyone cares for the feature though, and you can turn the refresh rate down to 60Hz if you prefer, and this saves battery life.",
    "The phone also has a 480Hz touch input rate, meaning the display scans for your finger 480 times per second, which is eight times faster than the average smartphone. This is particularly good for gaming, as your touch is picked up really quickly, making for more responsive gameplay.",
    "One particularly useful spec is the 1,500 nits max brightness – that’s well up on the roughly 500 nit average we see in smartphones. As a result the Mi 11 can get really bright if you need it to, perfect if you’re out in bright sunshine, or just can’t see too well. This also improves the contrast of on-screen images.",
    "Those specs must paint a pretty picture of the Mi 11’s display, and so they should, as it’s a punchy and sharp screen. It’s the company’s ‘AI imagine engine’ that’s doing the real work, though. This is a suite of AI features that digitally upscales content you view on your smartphone – frames are added to videos to increase the framerate, HDR is added to photos, video resolution is increased.",
    "We found this didn’t always work – sometimes we’d watch a video on a streaming service and see no noticeable quality increase – but on the occasions when it did kick in, it was great to see a video in higher resolution than you’d otherwise get.",
    "While the cameras represent a modest upgrade over the Mi 10, at least compared to the big upgrades in other departments, there are a few key changes that improve the photography experience here.",
    "The main snapper is 108MP f/1.9 – this is the fifth Xiaomi phone to use such a high-res sensor, and they’ve all used this same Samsung one. That doesn’t mean photos look exactly the same as before though, as the results of our testing seemed slightly better, with improved contrast and an overall lighter tone. This is likely the result of improved AI optimization.",
    "We took our best Mi 11 pictures in well-lit environments, and low-light photos were a little noisy, though certainly still usable. This is likely thanks to ‘pixel binning’, in which four pixels are effectively combined into one, to create a 27MP camera that ‘sees’ more light. We’ve produced an in-depth guide to pixel binning if you want to learn more about how this works.",
    "The secondary camera is a 13MP f/2.4 ultra-wide snapper, which we’ve seen Xiaomi use in its smartphones since the dawn of time (well, early 2020). As before, it’s useful for taking in more of a subject, and we found it took a brighter picture too. Photos are lower-resolution though, and often don’t have the contrast of snaps from the main camera.",
    "The final camera is a 5MP f/2.4 ‘telemacro’ camera, and it’s certainly the star of the show. Macro lenses are used for close-up pictures of subjects, but that ‘tele-’ prefix denotes that the lens is designed for snapping far-off objects – put that together, and it’s a camera designed to take pictures of small objects from (relatively) far away - it’s activated when you turn on Super Macro mode.",
    "This solves a big problem with macro lenses on smartphones, which is that by the time you’ve got close enough to see the intricate details in an object, you’ve blocked all the natural light with the phone itself.",
    "We had great fun taking good-looking photos of close-up details on things like plants, foodstuffs and fabrics – in fact, we wrote a whole feature on it. Pictures are bright and fairly well detailed (at least, compared to images from other macro snappers on phones), and the mode is very easy to use.",
    "Xiaomi usually reserves telephoto, or zoom, cameras for its ‘Pro’ models, and that’s the case here, as there’s no lens for optical zoom. You can digitally zoom up to 30x, but the further you zoom the lower the quality of the image, and beyond 5x images are a little too grainy.",
    "The front of the phone sports a 20MP f/2.2 camera for selfies, and this is another snapper we’ve seen in previous Xiaomi handsets. Pictures look good, but you should probably Portrait mode with this camera, as this tweaks contrast, boosts highlights and darkens shadows to create a more striking shot. ‘Bokeh’ background blur in this mode generally looked accurate, although parts of our hair were sometimes blurred too.",
    "The slogan for the Xiaomi Mi 11 is ‘Movie Magic’, and we’ll get on to videography shortly, but there’s an interesting way in which this manifests in stills photography: the default photo aspect ratio is 20:9, a strikingly thin ratio that resembles that of movie screens, and gives a dramatic, cinematic effect to photos of landscapes and certain other subjects. You can change this if you prefer, but few phones let you shoot in this wide format at all, let alone by default.",
    "Standard video shooting on the Xiaomi Mi 11 is fast and easy, as the processor (more on this shortly) lets you shoot 8K video with ease (or 60fps up to 4K resolution). Our video review at the top of this article includes footage shot on both the front and back cameras of the phone, and we’d recommend you check it out as the best example of standard video.",
    "The artistically-minded phone fan will possibly enjoy the various Movie modes the phone comes with. These let you shoot in a few novel ways – one, called ‘Magic zoom’, replicates the classic ‘dolly zoom’ film effect, while another, ‘Parallel world’, mirrors the bottom half of the screen on the top. Again, our video review contains samples of several of these modes.",
    "As well as the video-shooting modes, there are a few ‘Movie filters’ which you can apply when you shoot a video, or afterwards – these seem to replicate a color grade film would get, which is when color range, contrasts, brightness or similar settings are tweaked to create a consistent art style. The available options all seemed pretty stark though, and we’d have liked to see some more subtle filters, or the facility to create your own.",
    "While these movie modes are fun to play around with, some are hard to use. ‘Magic zoom’ requires a human subject and a lot of room, so you can’t do it with a Lego figure on your shelf or a friend in a narrow space. We never managed to get Time Freeze, where a moving object is frozen so a human subject can pretend to interact with it, to work at all, as the phone could never track or remember subjects in the shot.",
    "The Xiaomi Mi 11 is packing the Snapdragon 888 chipset – this is the most powerful chipset Android phones have available to them, at least at the time of the phone’s launch, and it posted suitably impressive processing scores.",
    "The phone returned a multi-core score of 3569 in the Geekbench 5 benchmark test, which is actually the highest of any phone we’ve ranked, beating the 3424 of the iPhone 11 Pro Max and 3401 of the OnePlus 8, although we should point out the iPhone 12 series hasn’t been put through this test yet.",
    "That score backs up our experience in everyday use – the phone is fast in all departments. When fiddling around with the camera app’s movie modes, the phone jumped through them with aplomb; when editing photos or videos, different filters or modes could be selected with split-second loading.",
    "Gaming in particular was a treat, thanks both to the snappy processor and the aforementioned faster touch sampling rate. It felt as though we had an edge in games thanks to this speed, although to what degree that was actually the case, or whether it was just confirmation bias, we can only guess.",
    "In our Xiaomi Mi 10 review we complimented the “seriously good sound” of the speakers, and they’ve only got better in the Mi 11, with tuning from audio specialists Harman Kardon. If you’re used to phone speakers causing calls, movies or music to sound tinny, the Mi 11 speakers will be a treat, as the sound is bassier and can go louder without distorting, at least compared to your average smartphone.",
    "The Xiaomi Mi 11 runs Google’s Android 11 software with Xiaomi’s MIUI 12 software laid over the top. Typically, MIUI can be like a saguaro cactus – lovely to look at, but with many prickles when you get up close. While that’s still the case for the Mi 11, the prickles are comparatively few and far between.",
    "MIUI is notorious for bloatware, or pre-installed third-party apps (a reputation perhaps garnered from our constant complaints about it). Thankfully, there’s far less bloatware on the Xiaomi Mi 11 than we saw on the Redmi Note 9T, which launched just a month prior, though there are still some apps we found ourselves swiftly exorcising.",
    "Beyond the bloatware, MIUI is actually a great Android overlay, bringing plenty of customization options, some of which other phones don’t have. There are a few Live Wallpapers (animated backgrounds), widgets, menu transition effects, different home screen app layouts, various always-on display designs, changes to the quick settings menu and more.",
    "When setting up the Xiaomi Mi 11 we spent a good while delving into these options to fully customize our phone experience, and if you like your smartphone to look truly ‘yours’, you’ll likely enjoy all the choices you have here.",
    "Despite the changes you can make, MIUI still has a distinctive look (as most phone makers’ Android forks do). We’ve included some screenshots of the home menu below, to give you a feel for how the interface looks.",
    "There seems to be an irritating software bug, though, which randomly reverts customizations back to their default form. Several times the Live Wallpaper we chose stopped appearing on the home screen, replaced with the default static wallpaper; similarly, we chose an astronomical always-on display, but it kept reverting to a cactus one instead.",
    "It’s not clear why this was happening, but it repeatedly happened after we’d returned the settings to our preferences, and an update didn’t fix the issue.",
    "The Xiaomi Mi 11 is packed full of features, and these features take their toll on battery life, resulting in the phone losing juice fairly rapidly.",
    "With a 4,600mAh power pack, we’d hoped the Xiaomi Mi 11 would last a day, but this was only the case with light use; if we took lots of pictures and played games, we had to power up the phone now and then to keep it ticking through the day.",
    "It’s likely the phone’s large display, high refresh rate, always-on display and other such features are to blame for this less-than-stellar battery life, and while you can disable one or more of these features if you want, if you do so you’re not really making the most of your feature-packed flagship smartphone.",
    "At least charging is fast. You’re getting 55W wired and 50W wireless powering here, so whether you prefer the plug or the pad, you’ll get from empty to full in around half an hour or less.",
    "You can also take advantage of reverse wireless charging, which turns the phone into a reverse wireless charging pad on which you can power up other devices. The charging here is 10W, so it’s not fast, and it heats the phone up a fair bit too. Still, if you’re only powering up a smartwatch or earbuds, you won’t need to use this feature for long.",
    "First reviewed: February 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Xiaomi Mi 11 price and release date",
    "14": "Design",
    "19": "Display",
    "26": "Cameras",
    "40": "Performance and specs",
    "45": "Software",
    "52": "Battery life",
    "57": "Don't buy it if..."
  },
  "links": {
    "Xiaomi Mi 11 5G": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "Xiaomi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "11T Pro": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Samsung’s Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Xiaomi Mi 10 Pro": "https://www.techradar.com/reviews/xiaomi-mi-10-pro-review",
    "Mi 10T": "https://www.techradar.com/reviews/xiaomi-mi-10t-pro-review",
    "Sony Xperia phone": "https://www.techradar.com/news/best-sony-phones",
    "guide to pixel binning": "https://www.techradar.com/how-to/what-is-pixel-binning-and-how-can-it-help-my-smartphone-photography",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Redmi Note 9T": "https://www.techradar.com/reviews/xiaomi-redmi-note-9t-review"
  }
}