{
  "source": "https://www.techradar.com/reviews/hex-technical-backpack",
  "title": "Hex Technical Backpack review",
  "category": "computing",
  "updated": "2021-11-26T08:00:00Z",
  "author": "john-loeffler",
  "summary": "The Hex Technical Backpack is like a Swiss Army Knife on your back",
  "verdict": "The Hex Technical Backpack is a good deal smaller than most of the best backpacks out there, but loads of pockets, compartments, and dividers give you everything you need to pack it efficiently, even if it can't hold everything you might need.",
  "pros": [
    "Loads of pockets",
    "Solid construction",
    "Comfortable straps",
    "Lightweight"
  ],
  "cons": [
    "Not very spacious",
    "17.3\" laptop barely fits"
  ],
  "article": [
    "We imagine the Hex Technical Backpack is the kind of bag that Jason Bourne would carry traipsing around Europe: lightweight, comfortable for long stretches, and there's a pocket for just about everything you'll need to stay off the grid – at least for a little while anyway.",
    "The capacity of the Hex Technical is just 17.5L, which is fairly small compared to its peers. It looks like a standard-sized backpack until you open it up and go to fill it with a bunch of laptops like we did when we first got it in.",
    "It was then that we realized that the backpack was challenging us, demanding that cast aside the unnecessary and bring only what we needed and find a way to pack it inside nice and secure. If you're cool with that, you'll love this backpack.",
    "Those looking for a commuting bag to secure and carry around essential tech, this is definitely a bag that will get the job done and then some – unless you have a 17.3-inch laptop, that is.",
    "Larger laptops will fit in the Technical Backpack but only just barely and not very gracefully. So to those with hefty workstations or gaming machines, expect your laptop to take up a lot of space in the main compartment.",
    "One other thing to note is the wireless charger pocket up top that is handy for charging a wireless-charging capable device just by sitting it on top of your bag – though please keep an eye on your phone while it's charging. What would Jason think if someone swiped your phone right off the top of your backpack because you were busy checking the time on the departure board?",
    "While any wireless charger that can fit in the pocket should work, Hex also sells one on its site that is guaranteed to fit.",
    "In addition to all the pockets and compartments, we definitely should note the weather-proofing on this backpack.",
    "As far as inclement weather goes, this is probably the best backpack to keep your gear dry thanks to the hideaway rain fly in a discreet bottom compartment.",
    "If the weather takes a sudden turn, the Hex Technical Backpack has you and your precious tech covered – literally.",
    "It also boasts some anti-microbial fabric treatment, so if you have to sit it down on a bus terminal floor somewhere, it's got a shot at least of not getting severely contaminated with who-knows-what.",
    "The Hex Technical Backpack is available now in the US for $159 (about £120/AU$225), with international shipping options available to Australia and several other countries. Hex also has separate distribution in the UK, though the Hex Technical Backpack is not available in the UK at this time."
  ],
  "headers": {
    "0": "Hex Technical Backpack two minute review",
    "12": "Don't buy if..."
  },
  "links": {
    "best backpack": "https://www.techradar.com/news/best-backpack",
    "Hex Technical Backpack is available now in the US for $159": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7203893872546608000&xs=1&url=https%3A%2F%2Fwww.hexbrand.com%2Fcollections%2Fbackpacks%2Fproducts%2Ftechnical-backpack-glacier-camo&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhex-technical-backpack"
  }
}