{
  "source": "https://www.techradar.com/reviews/corsair-hs80-rgb-wireless",
  "title": "Corsair HS80 RGB Wireless review",
  "category": "computing",
  "updated": "2021-08-19T18:23:49Z",
  "author": "matt-hanson",
  "summary": "Does Dolby Atmos make a difference?",
  "verdict": "The Corsair HS80 RGB Wireless is arguably the best gaming headset Corsair has ever made, and considering just how good its previous headsets are, that’s high praise indeed. It offers excellent build quality and a comfortable design, and sound quality is fantastic as well. Dolby Atmos support isn’t just a gimmick either – it can really make a difference.",
  "pros": [
    "Nice design",
    "Fantastic sound quality",
    "Comfortable",
    "Dolby Atmos works well"
  ],
  "cons": [
    "Expensive",
    "Mic arm not easily positioned"
  ],
  "article": [
    "The new Corsair HS80 RGB Wireless headset is the latest entry in Corsair’s HS range of gaming headsets. While Corsair may be primarily known as a component maker, it also does some pretty excellent peripherals as well, and it promises that the Corsair HS80 RGB Wireless builds on its previous headsets, offering greater comfort and audio quality than ever before.",
    "Selling for $149.99/£139.99/AU$219, this is a pricey headset, but it’s not the most expensive we’ve tried. It’s a step up from the Corsair HS60 Haptic’s price of $129.99/£119.99/AU$199.99, so it has its work cut out to prove that it’s worth the extra investment.",
    "When it comes to design, the Corsair HS80 RGB Wireless is a good looking headset, with a similar look to the other HS headsets. Parts of it are made from lightweight machined aluminium, which gives it a solid feel, while still feeling light enough to wear comfortable.",
    "It also has a new floating headband design, which is a piece of fabric that stretches between the left and right earcups, and this rests against your head, rather than the stiffer top of the headset.",
    "This leads to a far more comfortable experience, especially when wearing this headset for long periods of time. The ear pads are made of a premium-feeling fabric, and these again feel comfortable to wear, even after several hours of playing.",
    "The overall design of the Corsair HS80 RGB Wireless are solid and stylish, though it’s not the most exciting-looking headset out there. Crucially, though, it’s very comfortable.",
    "As the ‘RGB’ in the name suggests, the Corsair HS80 RGB Wireless has user-configurable RGB lighting via the iCUE software. If you already have it installed due to you having other Corsair products, then you can sync the lighting to the rest of your gear.",
    "On the left-hand ear cup is a power button and volume wheel, which makes adjusting sounds nice and easy.",
    "The microphone is also attached on the left, and it can be brought down towards your mouth, which automatically unmutes it (and then mutes it when you raise it vertically). The arm of the mic is flexible, but unlike some, you can’t position it either closer or further away from your mouth.",
    "Of course, while the design is important, it’s what the headset sounds like which is essential, and the good news is that the Corsair HS80 RGB Wireless does an excellent job. The headline feature here is Dolby Atmos support on PC.",
    "If you’re not aware, Dolby Atmos is a special audio format, and one which offers sounds above the user, rather than just surrounding the player like traditional 5.1 and 7.1 surround sound setups are capable of.",
    "With a Dolby Atmos setup, then, you can hear the sound of planes flying over you, for example, for a more immersive experience. In games, it can help you better tell where sounds are coming from, and that can give you a competitive advantage.",
    "Traditionally, Dolby Atmos requires additional speakers that are placed above where you’re sitting, however, many setups these days (especially sound bars) use upward firing speakers which ‘bounce’ audio from the ceiling.",
    "With a headset like the Corsair HS80 RGB Wireless, of course, this isn’t possible, therefore the Dolby Atmos support is virtual with the drivers inside the headset offering a virtualised spatial audio experience.",
    "Whilst not as accurate – or impressive – as a full Dolby Atmos setup with physical overhead speakers, this offers an impressively wide soundstage in both games and music.",
    "With the Dolby Access app in Windows 10, you can enable Dolby Atmos for Headphones, and from what we’ve tried, the Corsair HS80 RGB Wireless does a good job of making sounds feel like they are coming from all around you.",
    "An increasing number of games support Dolby Atmos, but even in titles that don’t support it, the virtualised spatial audio still offers an enjoyable experience. With Atmos-enabled films, such as 1917, the effects are also very impressive, with the greater sense of immersion leading to some very intense moments.",
    "It's worth noting, however, that while the Corsair HS80 RGB Wireless can be hooked up to a PC, PS5 or PS4, Dolby Atmos is only available on PC.",
    "Audio is provided by a pair of custom-tuned 50mm high density neodymium audio drivers with a frequency range of 20Hz-40,000Hz, and the sound quality is rich and detailed. When used wirelessly (with an included USB adaptor), the Corsair HS80 RGB Wireless works very well, with no hint of delay or latency.",
    "However, you can also use it as a wired headphone using the included USB lead, and while this also charges the headset, it also means the Corsair HS80 RGB Wireless can get high-fidelity 24bit/96kHz audio quality (when used wirelessly, it resorts to 24bit/48kHz), though this is only for stereo content, and will also disable Dolby Atmos.",
    "So for audiophiles, the Corsair HS80 RGB Wireless offers excellent sound quality, but with a few compromises.",
    "If you don’t mind missing out on the 24bit/96kHz support (and many people will be perfectly happy without it), then you get the benefit of Dolby Atmos, along with being able to go wireless, with a 60ft range and a battery life of up to 20 hours.",
    "Personally, we’d go for that option. Playing Cyberpunk 2077 with Dolby Atmos on, the city feels so much more alive thanks to audio coming from multiple directions. We’re not always taken with virtualised implementations of surround sound, but the Corsair HS80 RGB Wireless really impressed us.",
    "Through the iCUE software you can play around with the equaliser to get a sound that best suits you, and while the Corsair HS80 RGB Wireless is an expensive headset, the audio quality in games, movies and music was fantastic, and for many people will be well worth the price.",
    "The microphone, which Corsair claims is ‘broadcast-grade’, is omni-directional, and recording quality is very good. This is important when it comes to gaming, as you’ll want to be able to communicate clearly with team mates, and it’s also important if you like to broadcast and stream your gameplay as well.",
    "Of course, these days many of us are taking part in more video calls and meetings, so a high-quality microphone is more useful than ever, and the Corsair HS80 RGB Wireless delivers with ease."
  ],
  "headers": {
    "2": "Design",
    "9": "Performance",
    "26": "Don't buy it if..."
  },
  "links": {
    "the Corsair HS60 Haptic": "https://www.techradar.com/reviews/corsair-hs60-haptic-review",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review"
  }
}