{
  "source": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
  "title": "Windows 10 review",
  "category": "computing",
  "updated": "2021-10-11T14:58:46Z",
  "author": "joe-osborne",
  "summary": "Getting niftier with the October 2020 Update",
  "verdict": "With the October Update, Windows 10 becomes more reliable than ever before and comes with fresh – if minor – features. Of course, there’s always room for improvement, but Windows 10 is now better than ever and still continues to progress with a host of constant updates.",
  "pros": [
    "Start menu improvements",
    "Action Center, Cortana are useful",
    "Edge continues to improve",
    "Windows Hello faster, easier",
    "Timeline genuinely useful"
  ],
  "cons": [
    "OneDrive needs work",
    "Improvements also cause issues",
    "Some changes are incomplete"
  ],
  "article": [
    "Windows 10 is Microsoft’s most versatile OS yet. Rather than overhauling an entire OS every year, the company has designed it to receive semi-annual updates that largely focus on adding in new features and offering improvements to stability and overall performance. And, by doing so, it’s given Windows laptop and PC users the option to update incrementally.",
    "Adding to Windows 10’s versatility are its handful of variations to suit different types of hardware, individuals or businesses. There’s Windows 10 Home Edition that is best suited for individual use, as well as Windows 10 Pro whose suite of tools are ideal for businesses and professionals. And, there’s even Windows 10 Education designed for a classroom setting. It’s no wonder this has become Microsoft's most popular operating system to date.",
    "Even with its successor, Windows 11, now available as a free optional upgrade for Windows 10 and Windows 7 users, Windows 10 continues to be among the most widely used operating systems out there – which is likely why Microsoft will continue to update it for the foreseeable future.",
    "It’s simply an operating system like no other, and it’s likely to stay beloved long after its successor has completely taken over. From its key features to its semi-annual updates, here’s everything you need to know about this powerful and extremely versatile OS. Read on and find out what makes it tick.",
    "If you’d like to try out its successor, we show you how to download and install Windows 11 right now.",
    "Unlike the May 2020 Update, which came with a whole new set of features and performance refinements, this October 2020 Update is a relatively minor one. Rolled out on October 21 and now available for download, its main focus is on implementing fixes to the previous update.",
    "That isn’t to say that this October 2020 Update doesn’t come with new features of its own, however. Among those are the full integration of the Chromium-based Microsoft Edge browser into the OS, inclusion of Microsoft Edge tabs into the OS's Alt-Tab menu, and a brand new Start menu as well as more support for high refresh rate gaming monitors, an improved Taskbar, and the addition of app logos in Windows 10 notifications.",
    "New Start menu The October 2020 Update has given the Windows 10 start menu a facelift. While it’s not the drastic redesign that people were hoping for, it does give the start menu a fresh look. The design is more streamlined, removing the solid color backplates behind the logos in the apps list and applying a partially transparent background to the tiles. It makes it blend in better to your desktop theme and easier to find the apps you’re looking for.",
    "Alt + Tab changes This update also changes the Alt + Tab function, one of the most-used keyboard shortcuts. So, now when pressing those keys, you can not only switch between open apps using an on-screen menu, but also scroll through open Edge tabs as well. That makes it easy to switch between websites when you’re using the browser.",
    "Improved tablet experience While not exactly a new feature, this update also improves the operating system’s overall experience on 2-in-1 laptops. Improvements here include automatically switching to the tablet experience when you undock the screen on detachable 2-in-1s as well as better spacing between desktop icons."
  ],
  "headers": {
    "5": "Windows 10 October 2020 Update"
  },
  "links": {
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Windows 10 Pro": "https://www.techradar.com/news/windows-10-pro-vs-windows-10-home-all-the-differences-explained",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "how to download and install Windows 11": "https://www.techradar.com/news/how-to-download-windows-11",
    "May 2020 Update": "https://www.techradar.com/news/windows-10-20h1",
    "available for download": "https://www.techradar.com/news/windows-10-october-2020-update-is-finally-ready-heres-how-to-download-it",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "brand new Start menu": "https://www.techradar.com/news/the-next-windows-10-update-will-give-the-start-menu-a-facelift-and-you-can-get-it-now",
    "gaming monitors": "https://www.techradar.com/news/best-gaming-monitor",
    "Windows 10 start menu a facelift": "https://www.techradar.com/news/the-next-windows-10-update-will-give-the-start-menu-a-facelift-and-you-can-get-it-now",
    "2-in-1 laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451"
  }
}