{
  "source": "https://www.techradar.com/reviews/oppo-find-x3-lite",
  "title": "Oppo Find X3 Lite review",
  "category": "phones",
  "updated": "2021-04-09T14:24:55Z",
  "author": "jennifer-allen",
  "summary": "Solidly dependable if unremarkable",
  "verdict": "The Oppo Find X3 Lite lacks a bit of wow factor but in a way that’s also its strength, offering everything you need in a reliable fashion without quite standing out in either direction.",
  "pros": [
    "Fast charging",
    "90Hz display",
    "Stylish design"
  ],
  "cons": [
    "No wireless charging",
    "No standout features",
    "Average camera"
  ],
  "article": [
    "The lowest spec option in the Oppo Find X3 range, the Oppo Find X3 Lite is also, understandably, the most affordable of the bunch. While the Oppo Find X3 Neo may have found the sweet spot between affordability and power, the Oppo Find X3 Lite is more about offering dependable if unexciting features for a good price.",
    "With the trickling down effect of its specs in full swing, it's smaller than both the Oppo Find X3 Neo and Oppo Find X3 Pro, with a 6.43-inch screen, and offers a slower Qualcomm Snapdragon 765G chipset and a slightly inferior rear camera.",
    "It's also far cheaper than the other two phones, with an official retail price of £379 (around $525 / AU$690). It's all weighted in a way that means it's the natural successor to the Oppo Find X2 Lite - pursuing a similar price point and being a reassuringly affordable 5G device.",
    "The phone looks pretty good too. Available in a few different variants including Galactic Silver, Starry Black, and Astral Blue, it's only the first of those that offers a glass back, but the matte styling of the Astral Blue we reviewed felt good in our hands. It's easier to grip than some other phones too, thanks to its slightly rough surface that gives you something tactile to grip onto.",
    "Its screen looks great too, proving roughly on a par with the Oppo Find X3 Neo thanks to its 90Hz AMOLED display that offers a resolution of 1080 x 2400. It's bright and vibrant and suitably eye-catching in all the right ways.",
    "The screen is punctuated by the small lens for the 32MP selfie camera, but this rests out of the way in the top left corner, so you'll barely notice it when browsing or watching videos. In contrast, the quad-lens rear camera sticks out, but its curved edges mean it doesn't feel too awkward.",
    "Camera quality-wise, the Oppo Find X3 Lite's results initially look pretty great. It does a particularly good job of capturing color in a vibrant manner during daylight, but we did notice a certain graininess to some images too. We also found that low-light images can be a bit unnatural looking, with colors looking a little over the top and garish compared to other phones' night modes.",
    "Still, as a general, all-weather camera, the Oppo Find X3 Lite does the job, and we were certainly impressed by the fairly sharp images that came out of using the zoom feature.",
    "There's no wireless charging functionality on the Oppo Find X3 Lite, but it charges impressively quickly. It's reported to take only about 35 minutes to charge to 100% and we found that to be about right in testing. If you're prone to forgetting to charge your phone, you'll be pleasantly surprised at not being slowed down too much.",
    "Performance-wise, the Oppo Find X3 Lite is also fairly satisfactory. Much like the rest of the phone, it does the job in an oddly unremarkable yet reasonably satisfying way. It's a curious juxtaposition for a phone that never quite stands out for exceptional reasons, but also keenly dodges any of the main issues with a phone at this price point.",
    "While you might not rave about having the best phone for the price, you also won't be disappointed with the Oppo Find X3 Lite. It all feels comfortable. You'll be happy with most of its features even if you never quite feel ecstatic about them.",
    "The Oppo Find X3 Lite is available for £379 (around $525 / AU$690) in the UK, in a choice of three color schemes - Galactic Silver, Starry Black, and Astral Blue. It's available directly from Oppo, as well as selected networks including Three and EE.",
    "At the time of writing, it's not currently available in either the US or Australia, while UK pre-orders ship on April 14.",
    "The Oppo Find X3 Lite looks and feels pretty good. While the Galactic Silver variant promises a smooth glass back, our review unit was the Astral Blue color variant, offering a matte, 'multilayered polymer' finish.",
    "It feels great to the touch, doesn't show up every fingerprint, and feels safer in your grasp than anything with a glass back. For once, you don't feel immediately like you might stain it with your fingertips or drop it because it's slippery. Its rough exterior feels secure and snug.",
    "The rest of the phone is similarly well designed. The front display is only disrupted by a small punch-hole for the selfie camera, sensibly placed in the top left corner. The fingerprint sensor is embedded under the display so it keeps things minimalistic and clean looking.",
    "Similarly, on the back, while the rear camera array sticks out a little, it's mostly unobtrusive and doesn't steal focus. We're not massive fans of the Oppo logo across the back of the handset, but it's not the worst thing in the world.",
    "The dimensions of the phone are 159.1 x 73.4 x 7.9mm, so this isn't a small phone but thanks to that rough back, it's reasonably easy to hold, even with smaller hands. Weighing 172g (or 180g if you go for the Galactic Silver), it's just the right weight to ensure your wrists aren't feeling it after an extended session using the device.",
    "As with the Oppo Find X3 Neo, there's no water or dust resistance here, presumably to keep costs down, so bear that in mind if you regularly hit the beach or pool. This phone is a little more delicate than some despite that rugged exterior.",
    "The Oppo Find X3 Lite's display is bright, vivid, and clear. If a display could be eager, this would be it. It's smaller than the rest of the Oppo Find X3 range, of course, at 6.43 inches, but it maintains the same resolution as the Neo at 1080 x 2400 and looks pretty sharp for it.",
    "There's also the 90Hz refresh rate which makes things look a teensy bit smoother than its predecessor, but don't count on HDR10+ support. It's one of the cost-cutting endeavors here but it's not the end of the world.",
    "The screen still looks bright and clear enough that watching Netflix or YouTube look pretty good. Netflix in particular looks rather punchy on the device, which is presumably why it arrives with Netflix pre-installed and ready to go.",
    "Whether playing a game or watching a video, we didn't spot any noticeable lag or ghosting, and it all feels suitably punchy and vibrant, giving a little extra life to some videos.",
    "As mentioned previously, the punch-hole for the selfie camera is the only noticeable interruption in the display, but it's out of the way in the top left corner. Other than that, this is a sharp display that's ideal for watching streaming content or playing a game on.",
    "The Oppo Find X3 Lite has a quad-lens camera setup, with its main camera offering a resolution of 64MP and a digital zoom of up to 20x. Alongside that there's an 8MP ultra-wide camera, a 2MP macro camera, and a 2MP monochrome camera.",
    "There's also a 32MP selfie camera on the front which works well for video calls and cheeky selfies, along with the capability to record video in up to 4K at 30fps.",
    "At first glance, the Oppo Find X3 Lite is an ideal point and shoot camera. Photos taken on a sunny day look vibrant and exceptionally colorful. That comes at a cost though. The images aren't massively sharp and they can look a bit grainy in places.",
    "That's particularly true when using the digital zoom, and we'd recommend getting the best results by sticking to lower zoom levels, with imperceptible disruption at 2x zoom, for instance. If you've got no choice and you absolutely have to zoom further, the pictures are still good enough for social media kudos, but they're nothing special.",
    "Testing out low light performance produced mixed results. The Oppo Find X3 Lite's night mode does a good job of displaying what you're trying to capture, but the images are a bit unnaturally bright and colorful. Again, it's fine for social media but the photographers amongst us won't be entirely happy.",
    "Where Oppo is definitely on the right track is with its bevy of software features. There are numerous filters to choose from including ways of effectively sprucing up your face if you've taken a few selfies. They make a noticeable difference and are practically instant to add.",
    "An AI scene enhancement mode also aims to improve photos when taking landscape shots, although we had mixed results here. Some scenes looked much improved while others looked a bit oddly enhanced. It's the kind of setting that's worth switching between to see what works best for you and your eyes.",
    "The Oppo Find X3 Lite is powered by the Snapdragon 765G chipset from Qualcomm, which isn't the company's top chipset but is more than good enough at this price. Alongside that there's 8GB of RAM and 128GB of internal storage (with no way to expand upon it). That's all pretty respectable.",
    "In our Geekbench 5 tests, the smartphone achieved a single-core score of 599, with multi-core performance of 1,803. The latter places it just behind the Pocophone F1, which was high-end a couple of years ago but is still more than good enough for gaming or multitasking now.",
    "Benchmarks can offer only so much insight, as real life usage is where it counts. Here, we didn't have a problem. The Oppo Find X3 Lite was able to cope with us playing a number of different games such as Call of Duty: Mobile without a problem or any noticeable lag.",
    "As is customary for Oppo phones, it comes with the Game Space app which is meant to optimize performance. We're still not convinced of whether this genuinely makes a difference, but you won't really have to worry about it anyway.",
    "Performance is similarly speedy when switching between different apps and opening multiple browser tabs.",
    "The Oppo Find X3 Lite comes with Android 11 overlaid with Oppo's own ColorOS, and the latter doesn't add too much bloat. There are a few pre-installed apps such as Netflix, Facebook, and a meditation-style app, but it's nothing too aggravating.",
    "The Oppo Find X3 Lite will comfortably last you all day even with moderate use. That should leave some battery life spare too so you won't have to rush to the charger. If you don't use it particularly often, the Oppo Find X3 Lite's battery decreases incredibly slowly, so odds are you won't have an issue throughout the day.",
    "As expected from Android software, there are also numerous ways to cut down on your power usage with personalized suggestions for those times when every second counts.",
    "There's no wireless charging support but with 65W wired charging a 35 minute charge gets you from zero to 100%, which is truly impressive to watch. When you plug it in, you can see the percentage change rapidly on screen and it's quite the nerdy sight to behold.",
    "We still missed wireless charging, of course. The convenience is unsurpassed so far, but we'll forgive the Oppo Find X3 Lite when it recharges this quickly.",
    "First reviewed: April 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Oppo Find X3 Lite price and release date",
    "13": "Design",
    "19": "Display",
    "24": "Camera",
    "31": "Specs and performance",
    "37": "Battery life",
    "41": "Don't buy it if..."
  },
  "links": {
    "Oppo Find X3 Neo": "https://www.techradar.com/reviews/oppo-find-x3-neo-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Oppo Find X2 Lite": "https://www.techradar.com/reviews/oppo-find-x2-lite",
    "Pocophone F1": "https://www.techradar.com/reviews/poco-f1",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}