{
  "source": "https://www.techradar.com/reviews/tbao-mn25-amd-ryzen-mini-workstation-pc",
  "title": "TBao MN25 AMD Ryzen Mini Workstation PC review",
  "category": "computing",
  "updated": "2021-11-11T18:02:56Z",
  "author": "desire-athow",
  "summary": "An affordable workhorse",
  "verdict": "The TBao MN25 mini PC workstation is a superb example of how to put together an affordable desktop PC that punches well above its weight. We don’t know how they did it but it represents incredible value for money.",
  "pros": [
    "Well designed",
    "Great CPU performance",
    "Incredible GPU performance (for the price)",
    "Astounding SSD numbers",
    "Good price"
  ],
  "cons": [
    "No card reader",
    "No Type-C connector"
  ],
  "article": [
    "The revival of AMD is nothing short of spectacular and that’s entirely due to the Zen architecture and its follow up that trickled down to the refreshed Athlon, Ryzen, Threadripper and Epyc products, all of which are comfortably competitive with their respective Intel counterparts, Celeron/Pentium, Core and Xeon.",
    "Despite having been on the market for more than three years, it’s only recently that Ryzen CPUs have made it to the entry level part of the market. The TBao MN25 was one of the first earlier this year and is powered by the Ryzen 5 2500U and is a follow up to the MN22.",
    "The TBao MN25 mini PC was provided by popular online Chinese retailer Banggood and usually costs just under $350. However, new Banggood users can get it for a jaw dropping $274.99 using the code BGmn2501new or $279.99 using the code BGmn2501.",
    "TBao opted for an unassuming, anonymous design betrayed only by silver chamfered edges that run round the top facia. There’s no logo or logotype on the outside, just a sticker underneath the chassis that doesn’t even call out the MN25. The whole thing felt solid - thanks to its metal construction - and reminded us of Intel’s Next Unit of Computing (NUC); outwardly, it is a square brick that’s 128 x 128 x 50mm in size and weighs less than 1Kg.",
    "There’s plenty of openings to allow air to circulate to cool down the hardware inside on four sides; the device is actively cooled and there are plenty of connectors to augment the capabilities of the box. A Gigabit Ethernet port, a HDMI 2.0 port, a full size DisplayPort, six USB ports (four of them USB 3.0), two audio connectors and a proprietary barrel-type connector to which the 65W brick power adaptor connects.",
    "There are no card reader and no Type-C connector; the latter would have allowed the MN25 to power three monitors in all, with at least two of them 4K. The bottom of the device has four rubber feet and two screw threads for a VESA mount.",
    "The main attraction of the MN25 is the Ryzen 5 2500U processor that powers it. It is a 2017 laptop processor that has four cores and eight threads as well as eight GPU cores making up the Radeon Vega 8 graphics. These are clocked at 1.1GHz while the CPU cores have a base speed of 2GHz and carry 7MB cache at a TDP of 15W.",
    "The AMD part is supported by 8GB DDR4 memory (VLSI-branded) configured in dual channel, a 256GB NVMe solid state drive (ASINT AS806 256GB) and a Realtek chip for the Wi-Fi 5 and Bluetooth 4.2. You can also add an internal 2.5-inch SATA storage device if needed although you will need to get your own cable.",
    "Bearing in mind that this is a sub-$300 computer, the scores that we got in our benchmarks were nothing short of spectacular. The Ryzen 5 2500U is about 110% faster than the Celeron J4115 found in entry level thin clients/mini PCs that usually cost a tad less.",
    "Its graphics performance is equally commendable, in three 3DMark tests, it came within striking distance of the AMD Ryzen 5 4600H, a more powerful, more recent processor that has six cores and powers the Honor MagicBook Pro. It obliterates its equivalent Intel counterparts, leaving them in the dust.",
    "The same narrative carries on for the storage subsystem. Given that it is based on NVMe technology, rather than SATA, we’d expect some good numbers. They were spectacular; its solid state drive reached 1.61GBps and 1.1GBps respectively in read/write speeds in CrystalDiskMark.",
    "The fan noise was not overtly loud under prolonged load, thanks to the active heatsink fan and overall, the system performed beyond the call of duty to say the least.",
    "We’re looking for a compact powerful mini workstation PC with at least 8GB RAM and a 256GB SSD, for less than $300 with either a Ryzen 5 or a recent Core i5 CPU (8th generation or newer).",
    "Embarrassingly, for us and for the competition, we couldn’t find anything that costs less than the MN25. However, there’s one that comes very close when it comes to sheer value for money. The HP EliteDesk 705 G4 (4HX42UT#ABA), a micro PC, is on a special at the time of writing.",
    "At just under $380 at TigerDirect ($400 at Insight), the difference in price with the MN25 is around $100 and yet, because it features a desktop Ryzen (the 2400GE), it is likely to be faster. Add in Windows 10 Pro as operating system, support for Intel vPro management platform, a few more connectors and a three-year onsite warranty and you get a spectacular deal that easily matches what TBao has to offer.",
    "HP’s model however is the exception rather than the rule; most pint-sized desktop PCs with a comparable configuration from Dell or Lenovo tend to cost more than twice what Banggood charges for the MN25.",
    "The TBao MN25 is a great introduction for the AMD Ryzen but through no fault of itself, there is at least one better candidate out there, one that ticks all the boxes for micro, small and medium businesses looking for an enterprise-grade PC without any compromise but it is far, far more expensive.",
    "It is hard to see how TBao can improve its offering as it stands other than offering more of everything (compute, memory, storage) or lowering the already very low price. More ports would be good as would a desktop Ryzen (rather than the laptop version)."
  ],
  "headers": {
    "2": "Price",
    "3": "Design",
    "6": "Hardware",
    "8": "In use",
    "12": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "MN22": "https://www.techradar.com/reviews/tbao-tbook-mn22-amd-ryzen-mini-pc-workstation",
    "TBao MN25 mini PC": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-1138830298954747100&ulp=https%3A%2F%2Fwww.banggood.com%2FT-Bao-TBOOK-MN25-Mini-PC-AMD-Ryzen-5-2500U-8GB-DDR4-256GB-NVME-SSD-Radeon-Vega-8-Graphics-2_0GHz-to-3_6GHz-DP-HD-4K-Dual-WiFi-p-1671869.html%3FakmClientCountry%3DGB%26rmmds%3Dsearch%26ID%3D47184%26cur_warehouse%3DCN",
    "HP EliteDesk 705 G4": "https://www.techradar.com/reviews/hp-elitedesk-705-g4-sff-pc"
  }
}