{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
  "title": "Xiaomi Mi 11 Lite 5G review",
  "category": "phones",
  "updated": "2021-09-15T16:12:55Z",
  "author": "jon-mundy",
  "summary": "Xiaomi successfully iterates to innovate",
  "verdict": "With a sleek design, an excellent 90Hz AMOLED display, and a near-flagship level of performance from its Snapdragon 780G chip, the Xiaomi Mi 11 Lite is one of the best phones available for the money. It’s an extremely well balanced device, with few of the glaring compromises that usually accompany such an affordable phone, though it faces a stiff challenge from its competitors.",
  "pros": [
    "Slim, stylish design",
    "Decent performance",
    "Capable main camera"
  ],
  "cons": [
    "Ultra-wide camera not up to much",
    "MIUI still a little too bloaty",
    "Battery isn’t the biggest"
  ],
  "article": [
    "Xiaomi has confused even us with the sheer number of mid-priced smartphones it’s released over the past 12 to 18 months. The Xiaomi Mi 10 Lite, the Xiaomi Mi 10T Lite, the Xiaomi Redmi Note 10 Pro, and the Xiaomi Poco F3 all lurk around the $400 / £300 price point.",
    "The Xiaomi Mi 11 Lite 5G might represent a small jump up in price, but it could be the classiest mid-ranger of the lot. Well, it was for six months, until the Mi 11 Lite 5G NE came out. This device has a better chipset, comes in a new color, and has a few more camera modes - and that's it.",
    "As an affordable alternative to the flagship Xiaomi Mi 11 (and the luxury yacht that is the Xiaomi Mi 11 Ultra), the Xiaomi Mi 11 Lite is meant to reflect the line’s bold 2021 design refresh, as well as gesture at some of its technical advancements, but for a far more pocket-friendly price tag.",
    "It manages to do just that with a sleek design that’s as skinny as it is light. It might have a plastic frame, but the Mi 11 Lite 5G’s glass back looks and feels reassuringly expensive.",
    "We’re also impressed at how fast the Xiaomi 11 Lite 5G proves to be. By using a new Snapdragon 780G chip, the phone approaches 2020 flagship levels of speed. Mobile gamers on a budget will want to take note.",
    "While a 90Hz display might seem like yesterday’s specs, closer inspection reveals the Xiaomi Mi 11 Lite 5G to have a splendidly vibrant AMOLED panel. It comfortably outdoes entry-level 120Hz displays.",
    "The Mi 11 Lite 5G’s camera system doesn’t perform any Pixel-like miracles, but it is led by a capable 64MP main sensor. Xiaomi’s smart image processing ensures bright, balanced shots in good lighting, and passable night shots. It’s a shame the 8MP ultra-wide is so mediocre, though.",
    "Elsewhere, the Mi 11 Lite 5G’s stamina is solid rather than spectacular, while MIUI continues to impress with its customization options and frustrate with its bloat.",
    "Overall, the Xiaomi Mi 11 Lite 5G is a significant step forward from the Xiaomi Mi 10 Lite and Xiaomi Mi 10T Lite in three key areas: performance, design, and display. This automatically makes it one of the best phones available at the price.",
    "The Xiaomi Mi 11 Lite 5G was announced on March 29, 2021, and it landed in UK shops in April after a fair degree of delay and uncertainty.",
    "It costs £399 (around $550 / AU$755) for the sole model, which gives you 8GB of RAM and 128GB of internal storage.",
    "This places the Xiaomi Mi 11 Lite 5G into direct competition with the OnePlus Nord range, as well as the Pixel 5a / Pixel 4a, the Samsung Galaxy A52 5G, and even Xiaomi’s own Poco F3. It’s a competitive field alright.",
    "The Xiaomi Mi 11 Lite 5G’s design is a considerable improvement over the generic Xiaomi Mi 10 Lite, while it wisely keeps a couple of the bolder elements of the Xiaomi Mi 10T Lite.",
    "Xiaomi has smartly done away with the dated teardrop selfie camera of the Mi 10 Lite, and has shifted its punch-hole alternative over to the left hand corner, like the full-fat Xiaomi Mi 11. The surrounding bezels are fairly minimal, albeit slightly thicker around the chin, which is a telltale sign of a more affordable phone.",
    "Another indicator of the phone’s lower price tag is the thick black plastic buffer between the flat screen glass and the shiny plastic rim. The latter seems like less of a compromise than ever, given that even so-called flagship phones such as the Samsung Galaxy S21 and the OnePlus 9 are rediscovering the cost-cutting joys of plastic.",
    "It’s when you flip the phone onto its front that the Xiaomi Mi 11 Lite 5G really makes its statement though. The satin-finish glass rear, bold colors (our Mint Green model looks suitably fresh), subtle yet reflective logo, and distinctive camera module look and feel like they belong to a much more expensive phone.",
    "This is a seriously easy phone to live with too. At just 6.8mm thick and weighing a scant 159g, it’s blissfully unassuming when sat in a trouser pocket. Don’t get us wrong, it’s not a truly small phone like the iPhone 12 mini. You’re still getting a large 6.55-inch display, and the full-sized footprint that entails. But it feels like sweet relief after the heft of the Xiaomi Mi 10T Lite.",
    "Like that latter phone you’ll have to accept a fingerprint sensor embedded in the power button on the right hand edge. It’s a less overtly premium option than the in-display solutions usually favored for flagship and mid-range phones, but to this writer’s mind it’s preferable to the rear-mounted budget alternative. You can access the phone without picking it up, for one thing.",
    "Xiaomi’s implementation is suitably fast and reliable, even if we prefer the recessed button of the Xiaomi Mi 10T Lite and Sony’s Xperia range.",
    "The Xiaomi Mi 11 Lite 5G packs a 6.55-inch display with a 1080 x 2400 resolution and a 90Hz refresh rate.",
    "That’s smaller and technically less fluid than the Xiaomi Mi 10T Lite before it (which was 6.67-inches and 120Hz), not to mention the much cheaper Poco X3 NFC. But the Mi 11 Lite has the added benefit of being an AMOLED panel. And not just any AMOLED, but one with 10-bit color depth support, which is capable of outputting 1.07 billion colors (64 times more than its predecessor).",
    "You also get the usual AMOLED benefit of being able to output true blacks, which really comes into its own with the always-on display and subtle edge notification lighting animations.",
    "On balance, we’d take this more comprehensive combination over the seemingly faster LCD alternative. 90Hz is still plenty smooth enough, and you won’t even notice the shortfall unless you have a 120Hz phone to hand for a direct comparison. In fact, side by side, we found the Mi 11 Lite's display to feel more responsive than the 10T Lite's, at least in part thanks to its 240Hz touch sampling rate.",
    "A peak brightness of 800 nits tells you that this isn’t a top level OLED (you can almost double that with the Samsung Galaxy S21 Ultra), but a typical brightness of 500 nits makes for comfortable viewing. It’s ready for HDR10+ content too.",
    "This is a dead flat display, which again hints towards a lower price tag, but it does benefit from Corning Gorilla Glass 6 for extra toughness. Some considerably more expensive phones, like the Oppo Find X3 Neo, are still using Gorilla Glass 5.",
    "The Xiaomi Mi 11 Lite 5G has a triple camera setup on the back, which is one fewer than both the Xiaomi Mi 10 Lite and the Xiaomi Mi 10T Lite before it.",
    "Not that we’re complaining - in both cases, two of those were nigh-on useless depth and macro sensors. Here you just have the single 5MP macro sensor to ignore.",
    "Your main attention will be on the 1/1.97-inch 64MP wide sensor, which features an f/1.79 aperture and a 6-element lens system. By default, this captures 16MP shots through using a 4-in-1 pixel binning technique.",
    "These shots can look great in good lighting. On a couple of sunny spring days, we were able to capture some genuinely striking shots of flowers bursting with vibrant color, with that wide aperture yielding buckets of natural bokeh.",
    "Xiaomi’s AI assistant generally does well at picking out the appropriate scene profile, and the color balance - while on the punchier side of natural - rarely rings false. The company’s image processing game is strong.",
    "The 8MP 1/4-inch ultra-wide sensor really isn’t up to anything like the same standard, whether you’re talking about detail levels or color balance. Shots taken with this secondary sensor tend to look murky and distinctly lacking in detail, with bags of mushy noise towards the edges.",
    "Any zoom you apply will be entirely cropped from that main sensor, with no dedicated telephoto lens to speak of. 2x shots actually look pretty good here, however, thanks to the abundance of pixels at its disposal.",
    "There’s a portrait mode, but it’s not the most convincing example we’ve ever used. The defocused background effect looks ever so slightly weird, almost like a painting, and our subjects failed to pop like they do on more expensive phones.",
    "Xiaomi’s 20MP selfie camera isn’t too bad, however, with a fair amount of detail in good lighting.",
    "Night mode is a bit of a mixed bag here. We’re not expecting great results from an affordable phone, but when we took a handful of identical low light shots on the Xiaomi Mi 11 Lite 5G and the Xiaomi Mi 10T Lite, we often preferred the cooler results of the latter. The Mi 11 Lite’s shots looked sickly yellow by comparison.",
    "However, the darkest - and thus most challenging - shot of the bunch was much brighter and better exposed on the Mi 11 Lite. Make of that what you will.",
    "The phone’s video offering is pretty strong for an affordable phone, with 4K at 30fps or 1080p at up to 120fps. The 4K footage we took looked nice and stable, with electronic image stabilization (EIS) readily applied, unlike on the Mi 10T Lite.",
    "The Xiaomi Mi 11 Lite 5G uses a higher grade of processor than the plain Mi 11 Lite that’s available in some territories.",
    "Where the 4G-only model uses a Snapdragon 732G like the Poco X3 NFC, this 5G model that we’re testing adopts the new Snapdragon 780G. Despite what the name might suggest to you, this is a considerably more capable chip that’s been built using the same processing technology and architecture as the flagship Snapdragon 888.",
    "It represents a huge leap over the Snapdragon 750G used by the Xiaomi Mi 10T Lite as well. An average Geekbench 5 multi-core score of 2,922 for the Mi 11 Lite 5G absolutely trounces both the Mi 10T Lite (1,931) and the Poco X3 NFC (1,755).",
    "In fact, it gets impressively close to the Oppo Find X3 Neo (3,147), which is a much more expensive contemporary device running on the Snapdragon 865. That was the go-to flagship chip of 2020.",
    "The only thing that makes us start to question the value proposition of the Xiaomi Mi 11 Lite 5G in performance terms is when we compare it with the Poco F3, which packs the superior Snapdragon 870 (and a 120Hz display) for less money. But the difference isn’t huge, and the Xiaomi wins out in other ways, such as that sleek design.",
    "Paired with a healthy 6 or 8GB of LPDDR4X RAM, the Snapdragon 780G supplies a fast and fluid experience. Everything here, from home screen navigation to app switching, feels close to flagship level.",
    "The true gap between the Xiaomi 11 Lite 5G’s Snapdragon 780G and the flagship brigade would appear to pertain to its Adreno 642 GPU, which falls a little shy of the Adreno 650 in the Snapdragon 865 and the Snapdragon 870. A 3DMark score of 3,120 falls around 2,500 points short of phones running the Snapdragon 888, like the OnePlus 9 and the Xiaomi Mi 11 itself.",
    "Still, gaming performance is strong. Even with the graphical settings cranked up to max, League of Legends: Wild Rift runs at a solid 60fps, with only the odd dip. PUBG Mobile runs well at HDR Graphics and Extreme Frame Rate, too, which are the same max settings we cranked the OnePlus 9 to.",
    "Talking of gaming, you’ll benefit from proper stereo sound here, courtesy of a pair of speakers. You’ll be able to install all your games, music, and movies onto a standard 128GB of internal storage, and there’s also a microSD card slot for expansion purposes.",
    "The Xiaomi Mi 11 Lite 5G runs MIUI 12 on top of Android 11, just like its big brother the Xiaomi Mi 11. And while it’s still not the most tasteful custom Android skin on the market, it’s one of the better all-round performers.",
    "It still suffers from way too much bloat though. If we have to write about our puzzlement at the presence of Xiaomi’s own Mi Browser alongside Google Chrome one more time… well, let’s face it, we’re going to have to. It’s here, and it’s just as pointless as ever.",
    "Xiaomi’s own suite of apps stretches to include its own Music, Video, Gallery, Security, and Themes provisions. You also get a Cleaner for tidying up those memory-hogging apps and files, which is handy, though we object to being shown a full page ad every time we do so. Those ads rear their ugly heads when installing apps, too.",
    "Talking of apps, the likes of Amazon Shopping, Facebook, TikTok, and LinkedIn come pre-installed as standard, whether you want them or not. And they’re all bundled into a More Apps folder through which Xiaomi also tries to push a bunch of iffy games at you.",
    "Bloatware aside, MIUI has grown to become a powerful interface. The ability to split the notification pane into dual drag-down menus - one for notifications, the other for control shortcuts - is welcome, as is the fact that it’s totally optional.",
    "Indeed, customization is MIUI 12’s biggest asset. The Themes store is full of bespoke looks for your home screen, and some of the live ‘super wallpapers’ are really rather impressive. We went with a rings of Saturn theme that seems to swoop into a fresh angle every time we unlock the phone.",
    "This power does seem to come at the expense of clarity, however. Navigating MIUI’s Settings menu can be a counter-intuitive nightmare, with certain everyday options seemingly having gone walkabout.",
    "Wondering where the option to change the screen’s time-to-sleep is? It’s not in Display, where you might expect it. It’s in the separate ‘Always-on display’ menu. While several other options turned out to be roughly where we expected, we still somehow contrived to overlook them several times. There’s just something fundamentally opaque about Xiaomi’s menu design.",
    "The Xiaomi Mi 11 Lite 5G comes with a 4,250mAh battery. That’s not small by any means, but it is a fair bit more compact than the 4,820mAh Mi 10T Lite cell, and way less than the 5,160mAh battery of the Poco X3 NFC.",
    "Of course, the Xiaomi Mi 11 Lite 5G doesn’t have to worry about running a flat-out 120Hz LCD display. Its 90Hz AMOLED is a far more economical component, in theory.",
    "Thankfully the phone lasts well enough in practice, too. A light day with three hours of screen-on time would tend to leave us with a healthy 50% still in the tank. A more intensive period with 4 hours of screen time dropped that amount to 35%.",
    "Media consumption will drain that battery rather faster, of course. Our usual battery test, which involves a 90-minute 720p looping video playing with the screen brightness cranked to the max drained 11% of a full charge. That’s better than your average 120Hz phone, but still not exactly amazing.",
    "You get a 33W charger in box, which isn’t a particular stand out, but it’s still notably better than Samsung’s and Apple’s finest can muster. Half an hour of charging got us from 20% to 82%, which bodes well for those impromptu top-up situations.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Xiaomi Mi 11 Lite 5G price and release date",
    "12": "Design",
    "19": "Display",
    "25": "Camera",
    "37": "Specs and performance",
    "46": "Software",
    "54": "Battery life",
    "59": "Don't buy it if..."
  },
  "links": {
    "Xiaomi Mi 10T Lite": "https://www.techradar.com/reviews/xiaomi-mi-10t-lite",
    "Xiaomi Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "Xiaomi Poco F3": "https://www.techradar.com/reviews/xiaomi-poco-f3",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Samsung Galaxy A52 5G": "https://www.techradar.com/reviews/samsung-galaxy-a52-5g-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Oppo Find X3 Neo": "https://www.techradar.com/reviews/oppo-find-x3-neo-review",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}