{
  "source": "https://www.techradar.com/reviews/razer-anzu-audio-sunglasses",
  "title": "Razer Anzu audio sunglasses review",
  "category": "fitness",
  "updated": "2021-06-08T13:15:28Z",
  "author": "jamie-carter",
  "summary": "Stylish and streamlined glasses for your desktop and days out",
  "verdict": "If there’s such a thing as ‘everyday audio sunglasses’ then the Razer Anzu are it. Comfortable, stylish and with clear voice and excellent hands-free calls, they offer blue-light filtering for WFH and polarized lenses for the great outdoors. But average bass and a puny battery make them seem like house-bound blinkers.",
  "pros": [
    "Subtle and streamlined design",
    "Excellent hands-free calls",
    "Clear podcasts, audiobooks and radio",
    "Blue-light filtering for WFH",
    "Real leather case"
  ],
  "cons": [
    "Average bass response",
    "Proprietary cable",
    "No charging case",
    "Lack volume"
  ],
  "article": [
    "You work from home. You want blue-light blocking, open-ear audio and hands-free calls. Cue the Razer Anzu, a pair of audio glasses clearly aimed at people who want to listen to radio, podcasts, audiobooks, make calls and generally don’t need the greatest sound quality possible.",
    "Though easily the best-looking, sleekest audio sunglasses so far, the Razer Anzu are pretty limited in what they can do and where they can go. They come with built-in down firing speakers and options for popping-in either blue light-blocking or polarised sunglasses-style lenses. They’re water resistant. So can you wear them out? Sure you can, but battery life clocks-in at a mere five hours. That’s more than some of its competitors, but hardly enough to be considered as a main audio device for taking out for the day.",
    "There’s no charging case, and there’s a two-pronged proprietary charging cable. Yuck. Plus, they don’t handle bass-heavy music well at all – how could they?",
    "However, there are three reasons why the Razer Anzu are worth pondering; they block blue light from digital screens, they’re excellent with hands-free calls and they’re open-ear for safer jogging … and for hearing the doorbell go while you WFH.",
    "Add a ‘gaming mode’ that slashes latency to make voice and audio sync while you game or watch video on your phone and the Razer Anzu seems like the perfect audio glasses for the WFH era … if, indeed, you need audio glasses at all.",
    "The price point of the Razer Anzu makes them more affordable than the Bose Frames and the Fauna Audio Spiro Transparent Brown, though true to Razer’s brand these are the only ones to offer a ‘game mode’. They’re also the only ones to come with blue-light blocking lenses in the box.",
    "The Razer Anzu are the best-looking audio sunglasses we’ve seen so far. They are very obviously made of black, glossy plastic, but that enables them to be both super lightweight and super streamlined. Available in either rectangular or round design, both of which look great, the Razer Anzu weighs a mere 43g to 48g (depending on whether you opt for small/medium or large sizes), which is almost exactly the same as the clunkier-looking Bose Frames. Supplied with the option to fit either blue light filtering (for working from home) or polarized sunglass lenses (for wearing outdoors), it's the Razer Anzu’s 140 mm-long temples that contain all of the tech. Each one is home to a battery, a built-in mic and down-firing speaker drivers, though you wouldn’t know it because the temples are surprisingly sleek. That begs a question about exactly how big the batteries inside the Razer Anzu’s temples are, information that’s not forthcoming from Razer … but they must be tiny.",
    "They’re water resistant and splash-proof thanks to meeting the IPX4 specification, which means it’s perfectly possible to go for a run in drizzle and, as a bonus, remain aware of ambient noises going on around you. However, factoring in small batteries, those blue light filtering lenses clearly designed for the WFH era, and a ‘game mode’ and we’re not convinced that the Razer Anzu are going to be doing too much traveling.",
    "They may be compatible with iOS 12 and Android 8.1 (Oreo) upwards and connect to a smartphone or anything with Bluetooth 5.2, but there’s something depressingly retro about the Razer Anzu out of the box. Why? They come with a proprietary cable. Measuring 65cm and with a high quality braid, this Y-shaped annoyance draws power via USB-A and takes it to two proprietary prongs that fit magnetically onto two connectors on the temples of the Razer Anzu. No wireless charging. No charging case. Just something to lose.",
    "Setup is otherwise a breeze, with the glasses audibly stating “power on, pairing” as soon as you put them on your head. If you’re returning The next time we used them we got a “power on, Bluetooth connected” and a ”Disconnect, power off” message afterward. It’s all very reassuring. You can connect up to six separate devices and the Razer Anzu will remember to auto-connect next time you use them nearby.",
    "Like a lot of apps for smart devices, Razer’s Audio app is an app for the sake of it. Sure, it does let you know exactly how much charge is left in each temple – something you otherwise have no clue about (an audible message would be helpful at start-up) – but it performs few other tasks. There’s just a toggle for ‘gaming mode’ and a so-called equalizer that merely contains modes for ‘enhanced clarity’ and a ‘treble boost’. There’s also a short tutorial on how to use gestures to control volume, skip tracks, etc. None of them are complicated and they can all be customized via a remapping option within the app, but some are a little long winded. For example, while skipping track necessitates a single tap, there are some commands that involve triple taps or two-seconds holds. Engaging ‘gaming mode’ requires doing both. We also found that we had to perform some of these gestures twice before they worked, which suggests that the temples aren’t quite touch-sensitive enough.",
    "Although the glasses arrive with polarized lenses in them, in the box is a small packet containing a set of clear blue light blocking along with a QR code enabled guide to swapping them out. However, doing so necessitates touching and smudging the lenses.",
    "Reviews of audio sunglasses largely focus on their lack of bass response and miss what they’re actually good at and thus designed for. Should you be buying the Razor Anzu if you survive on a diet of dubstep, rock or hip hop? No! Obviously not. If you’re into electronic music and heavy basslines go buy a pair of the best headphones. However, if you’re after something that will allow you to listen to audiobooks, podcasts, radio and take hands-free calls – all while not being shut-off from the world of closed-ear headphones with noise-canceling – then the Razer Anzu may be for you.",
    "The 16mm down-firing speaker drivers on each temple are completely separate devices, so in theory the Razer Anzu are no different from, say, a pair of true wireless earbuds like Apple AirPods. In practice it makes little difference; we didn’t notice any syncing issues during our tests.",
    "The Razer Anzu produces a very clear sound that’s ideal for voice while also coping well with music for background. Listen to an audiobook, for instance, and the sound quality is always incredibly clear and precise with enough low frequency sound to give voice plenty of presents and body. It's not a tinny sound with no depth. We also found that hands-free calls worked really well, not only at our end but also at the caller’s end; the Razer Anzu’s microphones are obviously working well. For music the Razer Anzu does lack bass response, of course, but it also sounds a little disjointed, with bass boosted yet vocals seeming a little thin and separated.",
    "Will you disturb others while wearing the Razer Anzu? If you keep the sound levels low, almost certainly not even if the people in question are sitting very close to you. However, there is some sound spillage – after all, that's what down-firing speakers are designed to do – but if you’re listening to a podcast or an audiobook while you walk down the street, or sit on the bus, you're probably only going to have to worry about the person sitting next to you.",
    "Meanwhile, ‘gaming mode’ merely quickens the pace by reducing latency to a mere 60ms, which is enough to avoid any disjointed video and audio. It's certainly worth using not only if you're playing games on your smartphone, but even if you're watching any kind of video, but it's obviously of zero interest to anyone listening to podcasts, radio or audiobooks.",
    "The ‘open audio’ concept behind the Razer Anzu is one we like, even when using them around the home with their blue-light lenses in. It makes it easier to hear the doorbell while you make hands-free calls and/or listen to background music. From a safety perspective the open-ear design is of most use when out and about on a jog or walking through a city, but here the Razer Anzu trip up slightly for their lack of volume. Yes, we know there are limits on volume to prevent damage to our hearing, but surely it's all completely relative; if you’re outside and you need to walk down a busy street full of traffic, the Razer Anzu doesn't help much.",
    "One consequence of the Razer Anzu’s sleek appearance is that they have a short battery life. Razer rates the two batteries inside both temples as lasting for a mere five hours, which proved about right in our tests.They take about90 minutes to fully recharge using the proprietary cable.",
    "So it's a little unsurprising that Razer has eschewed a charging case in favor of something a lot more stylish, but a lot less functional. Instead of a battery-endowed charging case that can add perhaps 10 or 20 extra hours of charge, the soft case in the box contains just a pouch for that annoying charging cable. However, it’s a soft real leather case that’s many times more stylish than expected. Despite its luxurious feel it’s also got some structure so your glasses aren’t going to get easily damaged … though it won’t help much if you sit on them while WFH.",
    "First reviewed June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and release date",
    "6": "Design",
    "8": "Setup",
    "12": "Audio quality",
    "18": "Battery life",
    "21": "Don't buy it if"
  },
  "links": {
    "Bose Frames": "https://www.techradar.com/reviews/bose-frames-review",
    "Fauna Audio Spiro Transparent Brown": "https://www.techradar.com/reviews/fauna-audio-spiro-transparent-brown-sunglasses",
    "the best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "true wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review"
  }
}