{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-watch-lite",
  "title": "Xiaomi Mi Watch Lite review",
  "category": "wearables",
  "updated": "2021-11-09T16:47:31Z",
  "author": "jennifer-allen",
  "summary": "A budget smartwatch that doesn't skimp on features",
  "verdict": "Surprisingly stylish for the price, the Xiaomi Mi Watch Lite looks more expensive than it is. It offers extensive fitness tracking tools, meaning it's ideal for those who want more than just a step counter, even if some of its feedback isn't as accurate as more expensive competition.",
  "pros": [
    "Crisp display",
    "Full GPS",
    "Simple to use interface"
  ],
  "cons": [
    "Sometimes inaccurate tracking",
    "A bit uncomfortable",
    "Plasticky feel"
  ],
  "article": [
    "The Xiaomi Mi Watch Lite demonstrates that you don't have to spend a fortune to get a reasonably good quality smartwatch. Looking more expensive than its price tag, its crisp 1.4-inch LCD display is what you'll first notice. It's large and clear and immediately appealing.",
    "When it comes to hands-on time with the Xiaomi Mi Watch Lite, it feels a little cheaper. Its plastic watch band is molded in a way that means you can't lay it flat on the ground, and it's not the comfiest of straps by any means. However, any time you interact with the screen, it looks classier than you might expect.",
    "Delve deeper into it and you'll see that this is a watch that feels somewhere between a fitness tracker and a true smartwatch. It's not a fashion statement but it's also more than just a fancy pedometer. It has built-in GPS alongside a bevy of other useful features that track your day.",
    "These include heart rate monitoring, counting your steps, calorie intake, and also monitoring your sleep. A series of workout modes along with water resistance of up to 50 meters make this an ideal companion no matter how you plan on staying healthy.",
    "There's also some focus on the mental side of looking after yourself. The sleep monitoring tools analyze how well you're actually sleeping, while guided breathing exercises are also available at the touch of a button. The latter work as well as those on the likes of the Apple Watch 7, even if this lacks regular reminders throughout the day to take a breather.",
    "For those moments of downtime, the Xiaomi Mi Watch Lite also provides a plethora of notifications and the ability to control music via your wrist. None of this is revolutionary, but it means the Xiaomi Mi Watch Lite is far more useful than the basic fitness trackers it's priced up against.",
    "Issues arise when it comes to tracking. Notably, the Xiaomi Mi Watch Lite can be a little inaccurate, often spiking strangely throughout the day and coming up with figures that simply don't match up with other wearables. Also, its step counter seems to be lower than others unless you make sure you swing your arms around even when on a walk, but its foundations are solid.",
    "So, it's not a perfect run for the Xiaomi Mi Watch Lite, but it's well priced for what it offers. Looking mostly good and working speedily, it's a well-meaning smartwatch that's suited to those on a budget looking for something with a bit more oomph than a mere fitness band. Even if it may make you long for a more powerful smartwatch in the future.",
    "The Xiaomi Mi Watch Lite is available now in the UK and Australia. Not currently available in the US, it's priced at £59 / AU$100, which would work out at around $80.",
    "Available in black, white, or navy blue, there are a few different options for color schemes, and it seems likely that one or more could be discounted over time as people favor particular color options.",
    "The Xiaomi Mi Watch Lite is fairly plasticky to the touch. It's lightweight, only weighing about 35 grams, but its plastic casing feels a bit, well, cheap. Mostly because it is.",
    "Where things look far better is when it comes to the display. The 1.4-inch LCD might lack the classiness of an OLED display (hardly surprising at this price) but it's a stylish screen.",
    "It has a curved glass top that looks the part and makes up for the plasticky exterior around it. The sole button on the side is made from metal, so that feels a bit smarter too.",
    "The screen is a 320 x 320-pixel panel which is just what's needed in this price range. It has an automatic brightness sensor too, so it brightens up as and when needed, although we weren't fans of it lighting up when rolling over to sleep.",
    "The wrist band has a fairly rigid structure, which means you can't lay the watch flat on a surface. It's noticeable when you're wearing it too. It's reasonably secure and yet not as comfy or forgettable as some other smartwatches.",
    "The Xiaomi Mi Watch Lite offers the basics of what you could need via the watch interface. A series of clearly laid out squares offer workouts, daily stats, heart rate tracking, and sleep monitoring, along with breathing exercises, music controls, and air pressure monitoring. It's not the most stylish of interfaces but it does the job well.",
    "It's also far superior to the Xiaomi Mi Watch Lite's app, which looks fairly dated and sticks to functionality rather than good looks. It is the best place to go for graphs and more detailed statistics though. Plus you can use it to download additional watch faces for your device.",
    "The greatest strengths here are how the Xiaomi Mi Watch Lite monitors everything. Like with most fitness trackers, it's able to distinguish between deep and light sleep, for instance.",
    "With your heart rate, it's a little flakier, offering up some worrying spikes that simply don't show on other devices. We wouldn't rely on it for heart rate monitoring, and steps can also seem a little off compared to other devices, but this isn't as significant as the heart rate weirdness.",
    "What we do love is the solidly reliable GPS. It works well and means you don't need to take your phone with you while you walk or run. Usually devices at this price rely on connected GPS, so built-in GPS is a welcome addition.",
    "Elsewhere, the Xiaomi Mi Watch Lite is reasonably speedy to navigate. It will also receive notifications from your phone, although you can't reply to them directly, as you would be able to on, say, a Samsung Galaxy Watch 4.",
    "The Xiaomi Mi Watch Lite is expected to last around 9 days without using the GPS, and we found that to be about right. If you switch the GPS on and use it heavily, expect it to last more like 8-9 hours.",
    "That's not a bad trade-off at all, especially with a smartwatch that has such a large screen. In reality, you'll probably find it lasting somewhere between 4-5 days between charges, as it's likely you'll be using it to walk or run as well as for lighter activities.",
    "First reviewed: November 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Xiaomi Mi Watch Lite price and availability",
    "10": "Design and display",
    "15": "Performance and fitness",
    "21": "Battery life",
    "23": "Don't buy it if..."
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review"
  }
}