{
  "source": "https://www.techradar.com/reviews/bark",
  "title": "Bark parental control software review",
  "category": "computing",
  "updated": "2021-06-15T13:23:48Z",
  "author": "mike-williams",
  "summary": "Is this a quality parental control app, or are we barking up the wrong tree?",
  "verdict": "Bark's app content filtering is smarter than most, and the SMS and email monitoring is welcome, but it's otherwise underpowered and there's not enough here to justify the price tag.",
  "pros": [
    "Intelligent content filtering",
    "Monitors texts, emails",
    "Can customize rules depending on the time of day"
  ],
  "cons": [
    "Expensive",
    "No geofencing",
    "Must sideload Android app to get all features",
    "Content blocking failed on one test site"
  ],
  "article": [
    "Just about every parental control app around promises to keep your kids away from the worst web dangers, but often they give you very little choice over how this works. An app might block chat apps completely for under 12s, for instance, but then allow 12 and overs to do whatever they like; not much 'parental control' there.",
    "Bark goes much further, monitoring messages, texts, emails and 30+ top apps and social networks, analyzing text, photos and videos for what it calls 'concerning interactions.' If it picks up anything it feels might be a sign of cyberbullying, predators, sexting, drug use, suicidal thoughts and more, the system sends alerts via email, SMS, or direct to the parent's app.",
    "Bark hasn't forgotten the basics, and it also offers web content filtering, app and screen time management, location monitoring and 'check-in alerts' to let you know when your child arrives at an important destination (home, school, and so forth – you can define as many as you need.)",
    "If there's a catch here, it's that Bark's monitoring abilities vary considerably across available platforms, and they're not always what you'd expect. The iOS edition can't monitor TikTok or Skype, for instance, and the Windows app only supports two browsers: Chrome and Edge (Firefox isn’t catered for).",
    "Check out the official website guide to find out more about what to expect.",
    "Bark's power comes at a price, with its Bark Premium plan costing $14 a month, or $99 annually, to protect an unlimited number of devices.",
    "Bark also offers a cheaper Bark Junior app for $5 a month, $49 annually, but this only includes the more basic parental controls features: content filtering, app management, screen time limits, location monitoring. The intelligent text analysis technologies, the features which make Bark interesting, aren't included.",
    "If you're only looking for the parental control essentials, there are much better deals around. Kaspersky Safe Kids has a decent feature set and protects unlimited devices for $15 a year. Kroha includes some handy monitoring tools, and its annual plan covers up to five devices for just $12.",
    "If Bark's intelligent monitoring tools sound interesting, though, it may well be worth the extra cash. Sign up and Bark doesn't take your money for seven days, giving you a chance to see how it works, and you won't be billed if you cancel before the week is up.",
    "Getting started with Bark seems easy, at least initially. Hand over your email, choose a password, and a simple wizard walks you through the setup process: creating profiles for each child, selecting the device types they use, and providing details on their email account provider, apps, their browser (Chrome or Edge) and more.",
    "The wizard keeps life easy by offering to apply default rules (content filtering, safe search, turning off the internet at a specified bedtime) based on your child's age. That's a helpful way to get you up and running quickly, but you can opt to configure settings individually, if you prefer.",
    "Installing the Android app can take more work, as it's not available on Google Play (Google no longer allows apps to have all the monitoring features Bark requires). You must enable sideloading, then download Bark's APK file and install it directly (check out the instructions here).",
    "Life gets even more complicated with iOS, as you must install the desktop app on Windows or Mac to finish the job. You only have iPhones and iPads? Unlucky. (The Getting Started page explains more about what's involved.)",
    "You won't be able to monitor your child's individual accounts until they give permission by manually connecting them. That's not Bark's fault, but it might cause friction with older children as it highlights everything you'll be able to watch.",
    "There are more complications with other apps. To monitor Chrome on desktops, for instance, you must install Bark's Chrome extension and ensure your child logs into Chrome using a Bark-monitored email account. And hope your kids don't just install Firefox, presumably.",
    "This is a hassle, but it's another consequence of trying to monitor many apps and services. This can get complicated, and the varying rules for each situation can make the app tricky to manage, as well as giving your child more ways to bypass some controls.",
    "Bark's web filtering setup allows you to block or allow web content in various categories: sexual, social media, streaming, games, collaboration, e-commerce and many more.",
    "While the most extreme of these categories just get an On/Off switch (either your child can't see any sites in the Weapons category, or they can see them all), others give you more fine-tuned control. Allow streaming sites and you can still block individual platforms, for instance, maybe only allowing your kids to watch Disney+.",
    "A more advanced 'Unidentifiable Traffic' switch enables blocking anything which Bark doesn't recognize, including apps like VPNs and P2P. That could be useful, but that significantly increases the chance of breaking some legitimate apps and sites, and even Bark warns you that the setting might cause problems.",
    "This is all reasonably straightforward and mostly works as advertised. We had an issue on one Android device, though, where we could access porn on Chrome even when Bark was set up to block sexual sites. The service understood that we were breaking the rules, and sent a notification to our parent's account immediately, but it didn't stop us viewing the site.",
    "Bark organizes its screen time rules into three areas: School Time, Free Time and Bedtime.",
    "The School Time section allows you to define weekday and weekend school or work times, and give these their own web filtering rules. You might want to allow search, educational and collaboration sites, for instance, but block streaming sites, social media and games.",
    "You can define similar time periods for Free Time and Bedtime, and again give them their own custom rules. You could allow games and one or two social media sites in the evening, say, but block everything overnight.",
    "While this works and is simple to use, you're only able to define a single period of each type. If you set weekday School Time to be 8am to 3pm, for instance, then that's automatically applied to all five weekdays. There's no option to add a second 7pm to 8pm period on Wednesdays, say, if you'd like to have a weekly study evening.",
    "Bark's location tracking is just about as basic as you can get. The child's Bark app has a 'Check-In' button; they hit this when they arrive at or leave anywhere important, and you get a near-instant notification on a map. That's it.",
    "This can't match the power you'll get from other apps. There's no geofencing, no location history, not even the ability to directly check the location on demand. You'll only see your child's whereabouts when they tap 'Check-In.'",
    "If you have very young children, or you can't rely on them to use the Check-In system responsibly, this is probably going to be an issue. (Not necessarily a fatal one, though – you can always install another anti-theft or tracking app.)",
    "If you mostly trust your kids to keep you informed, though, choosing an app where you can't track them so easily could be an advantage. You'll still get to hear when they leave or arrive somewhere, but instead of checking up on them every five minutes to see if they're at school yet, you'll get a single notice when they arrive.",
    "Bark's most significant feature is its content filtering, where the app checks emails, messages, texts, document comments and just about everything else for potential issues (bullying, online predators and more).",
    "We found this did a reasonable job of picking up bad language, sexual innuendo and threats of violence, but also raised plenty of false alarms. Many app store reviews mention the same problem.",
    "This really isn't a surprise, though – no AI in the world will spot concerns as reliably as a parent – and Bark tries to help out by providing three Sensitivity settings.",
    "If you're particularly concerned about an issue – anxiety, maybe, or body image issues – then setting Sensitivity to 'All' ensures you'll get an alert for everything Bark spots. But if you've little or no worries in a particular area, change Bark's Sensitivity to 'Moderate and Severe' or 'Severe' and you'll only get notifications for the most worrying signs.",
    "This seemed to help for us, but could also add another layer of complexity to the setup process, as you experiment with different settings to find what works best.",
    "Bark makes strong efforts in some areas – app content filtering, SMS and email monitoring – and maybe they'll be enough for some. We found the alerts overload made it difficult to pick out the most important issues, though, and it doesn't feel as reliable or professional as the top competition."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Setup",
    "16": "Web filtering",
    "20": "Scheduling",
    "24": "Location tracking",
    "28": "Content filtering",
    "33": "Final verdict"
  },
  "links": {
    "parental control app": "https://www.techradar.com/best/parental-control",
    "website guide": "https://www.bark.us/what-bark-monitors/computer",
    "Bark Premium plan": "https://www.bark.us/#pricing",
    "Bark Junior": "https://www.bark.us/#pricing",
    "here": "https://support.bark.us/hc/en-us/articles/360049966432-How-to-Monitor-an-Android-Device",
    "Getting Started page": "https://support.bark.us/hc/en-us/articles/360049965292-Getting-Started-with-Bark"
  }
}