{
  "source": "https://www.techradar.com/reviews/bluetti-ac200p-ac-power-generator",
  "title": "Bluetti AC200P portable power station review",
  "category": "computing",
  "updated": "2021-07-07T10:04:01Z",
  "author": "jack-laurent",
  "summary": "A true powerhouse with some great features but is it worth the price though?",
  "verdict": "The Bluetti AC200P is one of the best 2kW portable power station that you can get right now at a reasonable price. The output options including wireless charging will satisfy most users and thanks to the battery technology, the unit will remain a good investment through the years.",
  "pros": [
    "LiFePO4 Battery Technology",
    "High output power and battery capacity",
    "Color graphic LCD",
    "Wireless charging",
    "Good value for money"
  ],
  "cons": [
    "Heavy",
    "Non-standard socket for high-current 12V output",
    "Always-on LCD"
  ],
  "article": [
    "A portable power station is rapidly becoming an important tool for households and businesses, especially those who need to venture out or work remotely (think outdoor workers, emergency services etc.), bringing the magic of electricity to far-reaching places. For example, modern portable power station can power a small heater in the depths of winter or an air-conditioning unit in summer’s hottest days.",
    "When shopping for one, output power and battery autonomy are the most important criteria we look for while ease of use and the number of outlets are also important factors. The ability to charge quickly together with long-life batteries complete the feature list of a modern portable power station.",
    "The Bluetti Technology company, founded in 2016, focuses on all-in-one power storage products. They recently completed a very successful Indiegogo funding for their flagship product, the AC200P, amassing over $6.7M over the course of the campaign. This is currently viewed as the portable power station to beat by the competition thanks to its long feature list, massive battery system and AC inverter.",
    "The AC200P is also priced below competitive products at $0.9USD/W. It is on sale right now on the Bluetti website at $1,799 with an additional $99 rebate using the code AC200P99, bringing it to $1,700. This is a great price for a product that uses best-in-class power technology.",
    "Out of the box, the AC200P resembles a small travel luggage but at 27.5Kg, its weight puts it in the heavy item category. A black plastic finish with diagonal stripes gives a professional and rugged look while two handles moulded in the frame help move the portable power station around safely.",
    "Four large rubber feet support the case and prevent the unit from slipping. Input power sockets are present on the left side while cooling fans are located both on the left and right sides. Front output sockets are protected by rubber flaps that prevent dust particles from entering the case. The flat top can be used as a small table and incorporates two 15W wireless chargers.",
    "An accessory bag is supplied with the portable power station to store various cables and a power adapter. High gauge low-loss power cables are provided for photovoltaic, car and AC charging with an XT90 mating on one side.",
    "A large color LCD takes center stage on the front panel surrounded by a plethora of output outlets. The touch sensitive display also serves to navigate the menu. The unit is turned on by the only push button present. Once pressed, the display takes a couple of seconds to come alive. With the help of the intuitive menu, the user can change the power station's settings or enable various power outlets. The display also shows important messages pertaining to the system including battery health or any short-circuits present at outputs.",
    "The AC200P is hard to beat in terms of the range of outlets offered. With an emphasis placed on being universal, two extra 12V sockets have been added on top of the ubiquitous cigarette lighter. This increases the usefulness of the unit by powering new classes of electronic devices such as printers and small industrial computers.",
    "Up to five USB devices can be powered simultaneously, with a single Type-C PD2.0 compatible socket supporting 60W max and four Type-A providing an additional 15W. Two wireless charging areas are also included with each supplying up to 15W max.",
    "The unit is also generous in terms of AC outputs. Six outlets providing a combined power of 2000W are available and can have their output voltages set either to 100V or 110V. The output frequency is also selectable between 50Hz or 60Hz. With an inverter efficiency of over 88%, the AC200P minimizes its thermal dissipation even at high loads and reaches 45dB of noise when used below 1500W. All outputs are protected against short-circuit while the AC inverter has built-in overload and temperature protections.",
    "The Bluetti portable power station is based on the latest battery technology using LiFePo4 cells. At around 3500 charge cycles, this has the advantage of lasting longer than the 500 cycles of regular Lithium Polymer chemistry. The drawback is worse energy density resulting in a heavier unit compared to a LiPo-based portable power station with similar battery capacity.",
    "As is standard with modern battery-based portable power station , the AC200P includes a MPPT solar charger controller that maximizes efficiency when connected to solar panels. With a maximum input voltage of 150V, panels can be placed in series hence reducing the number of connections to the portable power station. This greatly simplifies the installation of a PV system.",
    "With the help of a simple yet effective menu system, operating the AC200P is straightforward. Touchscreen inputs are validated with a beep that can be disabled. The always-on LCD backlight along with a high-contrast color scheme allow fast settings and status readings. Charging and discharging dots are animated and give visual cues to what the unit is doing at any moment. The power in and out of the unit are also shown in real-time.",
    "Charging a smartphone has never been easier thanks to two wireless charging pads integrated in the portable power station. With 15W of output power, it takes about two hours to completely charge a phone. The Bluetti portable power stationalso includes a USB Type-C connector that supports PD2.0. At 60W of power, this is the fastest way to charge a phone. Another feature provided only by the AC200P is a 12V DC output that can supply up to 300W through an aviation plug.",
    "There are three ways to charge the AC200P. The most commonly used method is with the supplied 411W AC power block which should take about 4.5hrs to completely charge the batteries. A faster way is through the solar panel input which allows a maximum power of 700W, thus charging the unit in under 3hrs. Finally, the AC200P supports charging from a car battery. This being the slowest, it will take about 9hrs to completely charge the unit with a 24V source. Power inputs can be combined to cut down on charging time.",
    "The AC200P does not have a UPS mode, a feature required for work in an office setting. It will switch between battery charging and powering devices while connected to the grid. This will stress the battery and other internal components while decreasing the lifetime of the unit. A better way would have been to use a large capacitor to supply energy to connected devices while transitioning to the offline mode. Batteries would then take over, hence providing a continuous supply of energy.",
    "The Bluetti portable power station falls into the 2kW portable power station both with a 2kWh battery and a 2kW AC inverter. Based on LiFePO4 battery chemistry, this type of generator is rare with few competitors at this price point.",
    "The Jackery Explorer 1500 is a smaller competitor with a 1488Wh Lithium-Ion battery and an 1800W AC inverter. Even though the Explorer 1500 is lighter and cheaper, it is less power efficient at 85% compared to the AC200P’s 88%. It also comes with fewer features since the wireless charging ports and the high current 12V DC output are missing.",
    "The EF ECOFLOW portable power station Delta is comparable to the Bluetti AC200P and priced similarly. But the inferior battery chemistry, based on the older Lithium-Ion technology, provides only 800 charge cycles. With fewer output ports, the Delta’s only advantage comes from being able to charge quickly using a 1200W AC input.",
    "The GoalZero Yeti 1500X and Bluetti AC200P are very similar, both possessing comparable AC output power, a high current 12V port and a 600W charging capacity. Priced at $1999, the 1500X remains the AC200P closest competitor. That said, the Bluetti has the edge by offering more output options, a bigger battery and more charge cycles with the LiFePO4 technology.",
    "The Bluetti AC200P is a high efficient portable AC portable power station with great specifications. The LiFePO4 battery chemistry will guarantee a long lifetime while the copious amount of output sockets, AC and DC, makes it truly universal. The built-in color graphic LCD sets a new standard for what a user interface should be. The negative are that the unit is heavy and the input power could have been higher to cut down on charging time. Still, at $1799, this is a bargain just for the battery technology provided."
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "13": "In Use",
    "17": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "AC200P": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8015177903440094000&xs=1&url=https%3A%2F%2Fwww.bluettipower.com%2Fproducts%2Fbluetti-ac200p-2000wh-2000w-portable-power-station&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbluetti-ac200p-ac-power-generator",
    "Jackery Explorer 1500": "https://www.techradar.com/reviews/jackery-explorer-1500-power-station-battery",
    "EF ECOFLOW portable power station Delta": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FEF-ECOFLOW-Portable-Station-Generator%2Fdp%2FB083FR3762%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8752934069591301000-20",
    "GoalZero Yeti 1500X": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2775783974570443300&xs=1&url=https%3A%2F%2Fwww.goalzero.com%2Fshop%2Fportable-power%2Fgoal-zero-yeti-1500x-portable-power-station%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbluetti-ac200p-ac-power-generator"
  }
}