{
  "source": "https://www.techradar.com/reviews/space-designer-3d",
  "title": "Space Designer 3D review",
  "category": "computing",
  "updated": "2021-10-18T08:00:48Z",
  "author": "steve-paris",
  "summary": "Design in 2D, preview in 3D",
  "verdict": "A good service which offers all the tools you’d expect to create and customise a building, and furnish it with a vast array of items.",
  "pros": [
    "Works fluidly",
    "Full customisation available"
  ],
  "cons": [
    "Cannot edit or customise in 3D",
    "No free plan"
  ],
  "article": [
    "Fancy doing a little redecorating of your home but feel you lack the skills to achieve your goals? Then why not turn to your computer for a little help. Space Designer 3D is one of many online services aimed at helping your design the home of your dreams, or just furnish a single room, all from the comfort of your browser. Let’s take a look at what this one has to offer.",
    "Unlike other online 3D design services, this one does not come with a free option. All plans are paid plans. The cheapest option is known as ‘Casual’. You pay $10 per project (no monthly commitment), and with that you can create a building with three levels, have access to the standard library of products, can export your work as a PDF file, and render two HD images.",
    "The other 3 options are all based on monthly subscriptions and are more aimed at professional users.",
    "First off is ‘Regular’ at $25 a month. With it, you can create up to 5 projects per month, each with up to 5 levels. You get access to an extended library, can save your favourites for quicker access, renders go up in quality to 4K, and you’re granted up to 25 of them each month.",
    "‘Team’ bumps the price to $100 a month. As its name implies, you can have up to 5 people access the same account. You’re allowed up to 25 projects per month, each with up to 10 levels. There’s a new feature for this level of commitment: being able to keep up to three different versions of the same project. This plan also comes with 2 hours of training, and you can create up to 100 4K renders per month.",
    "Finally, there’s ‘Business’ which is more of a bespoke model and the price is only available on request. There are no limits to the number of team members, projects, levels or versions you can have. There’s even the possibility of having a custom design catalog, export features are beefed up, and you have 500 4K renders to boot.",
    "If you want to see how this service works, they have a demo mode you can play around with. Let’s check it out.",
    "All the tools you require can be found on the right sidebar. If you’re used to this type of service, you’ll recognise them immediately. You start by creating walls - be they exterior or interior ones, and you also have a ‘Room’ option to quickly draw a rectangular shape.",
    "This early process is very simple. Select the tool you require then click and drag on the plan to add your object there. You can then move it around your work area, or alter its values, using the Properties sidebar which appears to the right when you select an object.",
    "This is where for instance you’ll find options to turn a straight wall into a curved one, or find a way to split a wall, change the material used, hide the item from view, or lock it to prevent any further changes to it.",
    "We liked the fact that there are tools that encourage communication between various team members, like the Notes and Arrow tools, to help with a work in progress.",
    "Assembling walls, adding doors and windows, is one thing, but what brings a building to life is the furniture that’s added to it. With that in mind, Space Designer 3D offers thousands of items for you to choose from. Everything is broken down by category, such as Living Room, Kitchen, Multimedia, Lighting, etc. Thankfully there’s also a search field to help you find what you’re looking for quicker.",
    "We appreciated the fact that you have full control over the shape of your furniture: should you be unable to find the exact sofa you require for instance, you can use a generic one instead, and use the Properties section to alter its dimensions and colours.",
    "Should you need to place an object on top of another, like on a table, the Properties tab has a ‘Raised of’ parameter, which lets you do exactly that.",
    "Up to now the whole design process is done in a top-down 2D view. It makes it easy to construct a project - just like working on a plan, really - but it doesn’t give you a sense of being in your creation. But since 3D is part of this service’s name, rest assured that switching to a more immersive three-dimensional view is but a click away.",
    "You actually have two options - 3D Walk and 3D Global. The former is more of an immersive experience as you become the camera and can pan around its position to see all around you. Use the keyboard arrow keys to move around your design - don’t worry about having to go through doors: you’re pretty much a ghost as you travel, effortlessly passing through walls as you explore.",
    "You’ll be able to see notes and comments, but you don’t appear to be able to manipulate the world around you - this is just an observation mode. If you need to make alterations, you’ll have to switch back to 2D view.",
    "3D Global is more of a Sims-like view of the world, where you see your creation in three dimensions, rotate around it, and even zoom in and out, but it doesn’t offer the same immersive experience as 3D Walk.",
    "When it comes to sharing your design with others, you can grab a link from the ‘Share’ menu (top right of the window), give it a Facebook ‘like’, or publish the link directly to Facebook or Twitter. As mentioned earlier, you also have the ability to take screenshots of your creations, the quality of which will depend on the plan you’ve elected to purchase.",
    "Space Designer 3D is a good service, offering a clean, easy to use interface. It’s a shame they don’t offer a free plan as a lot of their competitors do, but it seems from their promotion, that they aim to entice more businesses than individuals. If you’re in the market for a 3D design app, check this one’s demo to see if it offers everything you’re after."
  ],
  "headers": {
    "1": "Plans and pricing",
    "6": "Getting started",
    "11": "Furniture",
    "14": "3D view",
    "18": "Sharing",
    "19": "Final verdict"
  },
  "links": {
    "Space Designer 3D": "https://www.spacedesigner3d.com/",
    "browser": "https://www.techradar.com/best/browser",
    "Casual": "https://www.spacedesigner3d.com/pricing",
    "Regular": "https://www.spacedesigner3d.com/pricing",
    "Team": "https://www.spacedesigner3d.com/pricing",
    "Business": "https://www.spacedesigner3d.com/pricing"
  }
}