{
  "source": "https://www.techradar.com/reviews/samsung-q900ts-qled-8k-tv",
  "title": "Samsung Q900TS QLED 8K TV review",
  "category": "televisions",
  "updated": "2021-07-14T10:57:34.395Z",
  "author": "henry-st-leger",
  "summary": "A step-down 8K TV with most of the bells and whistles",
  "verdict": "For a high-end 8K TV, the Q900TS is a great buy if you don’t want to splash out on the Q950TS, but are looking for largely the same specifications. However, for an 8K TV smaller than 65 inches, or cheaper than £4,499, you’ll want to look elsewhere.",
  "pros": [
    "Amazing upscaling to 8K",
    "Stellar smart platform",
    "Expansive zero-bezel screen"
  ],
  "cons": [
    "Some background grain with HD",
    "Aggressive brightness control",
    "No Dolby Vision"
  ],
  "article": [
    "The Samsung Q900TS QLED 8K might just be the premium 8K TV you need. While it lacks the OneConnect box cabling solution that comes with the Q950TS, nor is it quite as cheap as the Q800T (or Q700T), this middle-child 8K TV walks the line between them, offering flagship performance for a lower cost than its top-end sibling.",
    "You’re getting a zero-bezel infinity screen with the Q900TS, which looks spectacular whether the TV's switched on or off. Four HDMI ports means you won't be hurting for connection options for games consoles, AV receivers, and soundbars, too – even if there’s only one HDMI 2.1 port for next-gen hardware that needs a higher passthrough standard.",
    "The Q900TS boasts simply marvellous audio, too, with Samsung’s new OTS+ sound system propelling effects, dialogue, and pumping your favorite soundtracks in multiple directions. It's not quite the same as the full force of a front-firing soundbar, but the expansive soundstage and multichannel detail on display here is something to behold.",
    "While Samsung is one of 8K's biggest proponents, they aren’t yet the necessity that Samsung probably wants them to be. Understandable, as 8K content is still relatively hard to come by compared to increasingly accessible 4K.",
    "But TVs like the Q900TS still make a strong argument for the advanced resolution, beautifully upscaling both 4K and HD sources to a crisp 8K finish. The added detail should be especially noticeable at larger sizes, if you’re sat at a sufficient distance; it might not be as impactful at smaller sized units you’re sat quite close to, but we’ll go into more detail about this below.",
    "As we’ve reported in several other new Samsung TV reviews, the company is deploying quite aggressive backlight dimming to prevent halos or blooming around bright sections of the screen. This works as intended, but does mean that HDR objects can lose a little of their flare, their full potential kept in check.",
    "For a high-end 8K TV, the Q900TS is a superb alternative if you don’t want to splash out on the Q950TS, but are looking for largely the same specifications. However, for an 8K TV smaller than 65 inches, or cheaper than $4,999 / £4,499, you’ll want to look elsewhere.",
    "Prices for the Samsung Q900TS start at $4,999 / £4,499 for a 65-inch unit, going up to $5,999 / £5,999 for a 75-inch model. The largest 85-inch size is only available in the US at a price of $7,999, meaning those in the UK or Australia won’t get a look in.",
    "By comparison, the flagship Q950TS is only available at 85 inches in the US, costing a mammoth $10,999. So if you want a 65-inch or 75-inch 8K TV in North America, the Q900TS is your set of choice.",
    "The Q900TS, at this point, has been on sale for a while now, and Samsung has since brought out 2021 successors like the QN900A Neo 8K QLED TV. This is Samsung's new 8K standard for 2021, and it's available for the same price that the Q900TS launched at.",
    "The QN900A, then, could be your 8K TV of choice if you're looking for the latest Samsung has to offer. Alternatively, keep an eye out for sales of the Q900TS this year, as the older it gets, the more likely this 8K TV is to be discounted.",
    "There’s plenty to appreciate about the Q900TS’s design. It shares the same 99% screen aesthetic as the Q950TS, with a sleek and minimalist style that’s a treat to look at, even when the screen is turned off.",
    "It’s not the thinnest QLED around, largely due to the full array backlight that sits behind the screen. However, Samsung contains this in a tight rectangular shape, avoiding any unsightly bulges on the back of the set.",
    "The upper edge and sides are a silver/gray color, with a dotted speaker grille from which sound escapes out of its 4.2.2 channel audio system. More detail on this can be found in our ‘Audio Performance’ section – but, suffice to say, Samsung has managed to build in a super-impressive OTS+ sound system without the need for it to sit in your eyeline.",
    "Setup is relatively simple. The TV stand comes in two parts and is assembled with eight small screws. Note that you’ll definitely need two people to lift even the TV’s smallest 65-inch size. A bit more effort than the zero-screw assembly of the Q60T, perhaps, but not quite the ordeal of the Samsung Sero.",
    "In the rear, there are four HDMI inputs, only one of which is HDMI 2.1 (which enables 8K/60Hz and 4K/120Hz video passthrough). It’s a shame that there aren’t more of the latter, especially for those considering to purchase both the Xbox Series X and PlayStation 5 at some point. However, there are still relatively few use cases for the port, especially since there are no 8K Blu-rays anywhere in sight. There is eARC support for directing lossless audio to an external soundbar, though.",
    "There are also two USB ports – rather than the three packed into the Q950TS – as well as RF, Ethernet, and optical inputs.",
    "Two remotes are supplied as standard with a QLED TV. A plastic unit with a full numerical keypad and rubberized buttons, and a metal alternative with more limited inputs. The latter is by far the sleekest, with a neat clasping mechanism for inserting batteries; it’s a real joy to use.",
    "There’s no Samsung OneConnect box cabling solution, though – which is the main difference between this and the Q950TS.",
    "Samsung’s Tizen OS is accomplished on the Q900TS. Much like LG’s webOS smart TV platform, it uses a horizontal line of tile icons to showcase available streaming apps, with more nitty-gritty picture settings, cable inputs, and the free Samsung TV Plus service on the left-hand side.",
    "There’s great app support here, with the likes of Netflix, Amazon Prime Video, Rakuten TV, Apple TV Plus, BBC iPlayer, ITV Hub, All 4, My5, YouTube and more. Also making an appearance is Samsung Health, which landed on Samsung TVs in 2020, packing in a whole lot of fitness and wellness content to enjoy.",
    "Disney Plus is supported, but doesn’t appear on the home screen by default. So, if you do wish to watch it, then head to the Samsung app store to download and pin it to your home screen.",
    "Sadly, there’s no Freeview Play in sight, despite most other TV brands supporting the broadcaster catch-up service in the UK.",
    "The Samsung Q900TS offers up a true flagship 8K picture, no matter the quality of the source. While native 4K – upscaled to 8K, of course – looks best, even HD and SD content is handled beautifully, with all the additional pixels needed to make them approximate to an 8K image.",
    "When watching the Emmy-winning TV series Schitt’s Creek, which is filmed in HD, we were blown away by the detail of the image on display. The furrows of a forehead, the bustle of an eyebrow, the stitching of a lampshade all come into focus in vivid detail.",
    "Samsung saves its AI upscaling for its most high-end TV sets, and it clearly makes a big difference. Traditional upscaling applies some sharpening around grainy objects, but AI upscaling uses an immense bank of high-res and low-res images to make a prediction of how images with a larger pixel count should look.",
    "There are occasional picture defects for low-resolution content. Naturally, Samsung’s picture processing focuses mainly on foreground objects, such as faces. As such, busy scenes can display some grain over the backdrops, especially around background objects in motion. Even slow camera pans can result in some mild screen judder, but it tends to leave as quickly as it arrives.",
    "These issues are pretty minor – you’d have to be actively looking for them – but, if Samsung wants 8K TV adoption to continue increasing, they do highlight areas in which the company will need to make improvements over the coming years.",
    "We stepped up to a 4K source with Netflix’s The Social Dilemma documentary, and can assure you that it looks seamless when upscaled to an 8K screen – to the point where it’s almost startling. A sudden zoom in to someone’s face, for instance, and the ensuing detail displayed in someone’s freckles, or the lines of their irises, shows just how competent Samsung’s upscaling algorithms have become.",
    "The benefits of Samsung’s Wide Viewing Angle technology, introduced on its premium QLED sets in 2019, is clear too. At 45 degrees off-axis, the rich color and contrast holds up brilliantly, meaning that you won’t need to be viewing the TV straight-on for a great picture.",
    "The Q900TS can output plenty of light, with a peak 3,000-nit brightness for high-impact images – even in well-lit or daytime surroundings. This means that even SDR (standard dynamic range) content looks impressive in its color recreation.",
    "We tried out the Q900TS’s 4K HDR capability with the remake of Utopia on Amazon Prime Video. The set was able to display punchy colors, whether they were red tees, green dye, or blue ribbons (it’s a very colorful show). The Q900TS has a particularly bright screen, and that makes it superb for displaying bright colors. Some shadow detail is lost in darker scenes, and at times you’ll find some mild crushing of blacks in dark suit trousers or even beards – but it’s a minor issue.",
    "However, the Samsung Q900TS – along with the Q950TS and Q800T – deploys some slightly aggressive backlight dimming, presumably to limit blooming or halos around bright objects. This can reduce the impact of individual HDR objects, but overall it remains a stunning experience. (Once or twice we witnessed the brightness of the entire screen suddenly drop, too, but this was a rare occurrence.)",
    "There are, as usual, a host of picture settings to choose from – alongside a new option you might not have used before.",
    "The basic picture modes are Standard (default), Dynamic (ramped up contrast), Natural (halfway between the previous two), and Movie (reduced saturation). Movie is likely to be the best choice for most TV and movie content, although Standard or Natural may prove a better bet for reality TV and documentaries. It’s worth flicking through them to get a sense of what you want your picture to look like – as much as we hate Dynamic’s harsh and artificial colors, there are definitely people out there who like it.",
    "Filmmaker mode is another new addition, and it’s designed to evade the usual picture-processing techniques to display TV or movie content “as intended”. Visually, we found it sat pretty close to the Movie preset, but fared worse with moving objects – likely from the removal of motion smoothing technologies. We wouldn’t recommend it.",
    "There’s an Intelligent mode, too, which proactively switches between picture (and audio) settings depending on what’s being displayed on screen – and it should function perfectly well for those of you who don’t want to fiddle endlessly with picture presets.",
    "You get HDR10 as well as the dynamic HDR10+ format, which calibrates the TV’s picture settings on a shot-by-shot basis – but not Dolby Vision, as is the case on all QLED TVs. If you’re a streaming service buff, you’ll likely want HDR10+ for Amazon Prime Video shows, but Dolby Vision to get the best out of Netflix movies.",
    "There’s plenty to recommend the Q900TS’s audio, due to the implementation of Samsung’s OTS+ (Object Tracking Sound) technology.",
    "OTS+ is a 4.2.2 channel audio system, with separate drivers placed around the Q900TS’s screen for a multidirectional sound. There’s no Dolby Atmos support for these speakers, per se, but you can passthrough the format to an Atmos-compatible speaker, should you wish.",
    "The best way to describe the audio is “roomy”. OTS+ throws sound in all directions, for an incredibly wide soundstage that never feels hemmed in – which means the sound feels as unrestricted as the expansive zero-bezel screen.",
    "Some may miss the force of a dedicated front-firing soundbar, since here the sound is designed to fill the room rather than blast you out of your seat. Of course, there is the option to connect a soundbar or other AV equipment, although it might be a waste of the Q900TS’s audio specifications to do so.",
    "Voices are stunningly recreated on the Q900TS’s speakers; even in a documentary, the drivers show the full range of frequencies and peculiar timbre of a person’s voice. The multiple channels, too, mean that dialogue is never lost under a booming soundtrack, and it’s possible to make out a massive amount of distinct information at once.",
    "When watching The Old Guard on Netflix, Charlize Theron’s chains manage to clink delicately and clatter with force all at the same time, giving even the smallest of moments a huge range of aural detail. In the standup special Bo Burnham: Make Happy, the chaotic overlap of Burnham’s monologue, audience laughter, and a pumping techno soundtrack is carefully managed, ensuring nothing is lost for the listener.",
    "Overall, the sound here is clear and controlled, even at high volumes. Some may find that the OTS+ sound system isn’t as dynamic as some AV hardware; the Panasonic HZ2000’s built-in speakers go louder, and a lack of front-firing speakers means the Q900TS can lack immediate impact. But there’s no denying the overall quality and verticality of the sound."
  ],
  "headers": {
    "0": "Two Minute Review",
    "7": "Price and availability",
    "11": "Design",
    "19": "Smart TV",
    "23": "Picture quality",
    "38": "Audio performance",
    "45": "Don't buy it if..."
  },
  "links": {
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "OneConnect": "https://www.techradar.com/news/samsung-oneconnect-box-is-still-a-marvel-so-why-do-so-few-samsung-tvs-get-it",
    "Q950TS": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "Q800T": "https://www.techradar.com/reviews/samsung-q800t-8k-qled-tv",
    "AV receivers": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "QN900A Neo 8K QLED TV": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "Q60T": "https://www.techradar.com/reviews/samsung-q60t-qled-tv",
    "Samsung Sero": "https://www.techradar.com/reviews/samsung-sero-tv-review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Freeview Play": "https://www.techradar.com/news/freeview-play",
    "TV brands": "https://www.techradar.com/best/best-tv-brands",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Panasonic HZ2000": "https://www.techradar.com/reviews/panasonic-hz2000-4k-oled-tv"
  }
}