{
  "source": "https://www.techradar.com/reviews/vitamix-a3500",
  "title": "Vitamix A3500 review",
  "category": "appliances",
  "updated": "2021-07-08T09:36:21Z",
  "author": "helen-mccue",
  "summary": "A large capacity blender with muscle",
  "verdict": "The Vitamix A3500 will blend almost anything you throw at it, it excels at larger quantities but struggled when we tried a very small mayo recipe and it didn’t have the finesse to produce evenly chopped nuts. That said if you’re looking for serious blending power and a strong and sturdy machine, look no further, it can crush ice in the blink of an eye and produces silky smooth smoothies. But it’s a big, heavy blender with an expensive price tag.",
  "pros": [
    "Powerful motor pulverizes most foods",
    "Dishwasher safe accessories",
    "Five auto settings as well as variable speed control"
  ],
  "cons": [
    "Expensive",
    "Large and heavy",
    "Doesn’t blend small quantities well"
  ],
  "article": [
    "Vitamix is a trusted US company specializing in blenders and there are plenty of models to choose from. The Ascent series is the most feature-rich range from Vitamix, with the A3500 sitting at the expensive end of the brand’s offering.",
    "As a top-of-the-range blender, the Vitamix A3500 is expensive and is aimed at serious blending enthusiasts. But for the money, you’ll get a robust powerful blender that’s built to last.",
    "It comes with a large 64-ounce/2-liter jug and there are plenty of compatible accessories available, but you will have to purchase these separately. It has all the features you’d expect, as well as technology that detects what container you’re using and adjusts its settings accordingly. On top of that, you can connect this blender to your WiFi network and use the accompanying app to access recipes and blending tips.",
    "The Vitamix A3500 is available from the Vitamix website, but in the UK and Australia is called the A3500i.",
    "This is an expensive blender, but it’s a top-of-the-range model by a manufacturer renowned for its blenders.",
    "The Vitamix A3500 has quite a boxy, almost industrial styling that looks most at home in a modern kitchen. In the US, there are six color options - four are metallic and there’s also a choice of red or white, though in Australia the A3500 comes in just black or brushed stainless steel, while in the UK it just comes in brushed stainless steel.",
    "As blenders go, it’s chunky and while the footprint on your countertop isn’t huge in comparison to other appliances, it is very tall so may not slide back underneath wall-mounted cabinets, but if it does you’ll probably have to pull it forward to get the lid off. It measures 11 inches / 20.3 cm x 8 inches / 28 cm x 17 inches / 43.2 cm (w x d x h), and it weighs in at almost 15lb/ 8.3kg which is something to keep in mind if you want to store it in a cupboard and get it out each time you need to use it.",
    "It comes with a dishwasher safe 64-ounce/2-liter jug – one of the largest capacity blending jugs we’ve seen and there’s a tamper accessory that can be used to move ingredients around in the jug during blending. You’ll also get a hardback recipe book, ‘Simply Blending’ which has plenty of useful sweet and savory recipes and includes helpful blender settings for each recipe as well as tips on the best order to add ingredients. On the Vitamix website, you’ll also find plenty of optional accessories available to purchase separately such as blending bowls and blending cups. If you purchase any accessories, the blender will automatically detect which accessory you’re using and adjust settings for optimal performance.",
    "The touch screen interface is simple to use and the dial has ten variable speed levels as well as a pulse function, which gives you plenty of control. The programmable timer allows you to set a blending duration, after which the blender will automatically switch off, allowing you to walk away while it blends. Additionally, there are five auto programs: smoothies, frozen desserts, soups, dips and spreads, and self-cleaning.",
    "We found the Vitamix A3500 blender very easy to assemble, simple to use and when it gets going there’s no denying it’s powerful. We tried the auto smoothie program to make a smoothie containing spinach, pineapple, banana, apple juice, and yogurt. These ingredients were completely turned to liquid by this powerful blender and at 84dB, the noise level was comparable to other blenders we’ve tested such as the Nutribullet Blender Combo. The smoothie had absolutely no unblended pieces, not even any tiny specs of spinach or fibrous pineapple strands remained, it was completely smooth and lightly aerated. There were no pieces stuck under the blades or around the jug either.",
    "There’s no auto ice crush setting, but despite this, the A3500 crushed ice cubes quickly and evenly on just level 2 of the manual speed settings. We also filled it to maximum capacity with water and blended at top speed, and reassuringly, no water leaked from any part of the jug or the lid.",
    "We tried chopping hazelnuts in the blender, but the results were a little uneven; a mixture of powder and chopped nuts – but it should be noted that most blenders we’ve tested have struggled to chop nuts to an even consistency.",
    "When it came to making a small quantity of mayonnaise, the blades didn’t reach low enough to blend together two egg yolks with 10ml of vinegar, so we had to double the recipe, which isn’t ideal if you only want a small amount. Having said that, once the recipe was doubled we were able to make a thick glossy, nicely emulsified mayo, but when pouring in oil during blending, it does splash quite a bit out of the lid plug.",
    "We used the auto cleaning cycle to remove the worst of the oily mayo residues from the jug and found it’s simple to use - all you have to do is add water and dish soap to the blender. The program removed most of the mayo, but as it’s very oily we still had to give it another wash in the sink. The jug is also dishwasher safe, so cleaning isn’t a problem.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "30-second review",
    "3": "Vitamix A3500 price and availability",
    "5": "Design",
    "9": "Performance",
    "14": "Don’t buy it if…"
  },
  "links": {
    "blenders": "https://www.techradar.com/best/best-blenders",
    "Nutribullet Blender Combo": "https://www.techradar.com/reviews/nutribullet-blender-combo"
  }
}