{
  "source": "https://www.techradar.com/reviews/hostnine",
  "title": "HostNine review",
  "category": "computing",
  "updated": "2021-01-22T20:30:26Z",
  "author": "mirza-bahic",
  "summary": "Are this US host's plans really worth the price?",
  "verdict": "HostNine is a US-based provider with a fair share of business experience and capability to provide you with everything needed to host and build your website. However, there are many budget-friendly alternatives which will give you equal or greater value for money.",
  "pros": [
    "45-day money-back guarantee",
    "No price hikes upon renewals",
    "Six data center to choose from",
    "One-click installs"
  ],
  "cons": [
    "Higher-than-average prices",
    "Starter plan is pretty limited",
    "Fast customer support costs extra"
  ],
  "article": [
    "HostNine is a US-based web hosting provider which entered the market in 2006 and has since opened multiple data centers in various countries across the three continents. During this time they’ve been offering a wide range of hosting services, including shared, reseller, cloud VPS and dedicated server solutions. Beyond what is written above, finding relevant information about the company felt like full-time detective work.",
    "HostNine’s main website doesn’t offer much beyond the pretty common self-promotional propaganda, so the next logical step was to see what we can find about them on social networks. Although they have LinkedIn, Facebook and Twitter accounts, the last two haven’t been updated for quite some time. Their Twitter (which seems abandoned since 2019) gave us a cause for concern, particularly regarding their customer support services, which didn’t seem to live up to expectations of a number of users. There were several mentions of prolonged downtime as well, so you better be sure to give this a further thought.",
    "It appears that HostNine was a relatively small and privately-owned company employing 10-15 people until they were picked up by EIG (Endurance International Group) in 2012. EIG has been in the business since 1997 and has since then acquired a great number of smaller companies which later became big brands (Bluehost, Hostgator, HostMonster, JustHost and many more).",
    "HostNine’s main website, although pretty plain at first glance, feels modern in design and is intuitive and easy to use, which is always worthy of praise. The locations of HostNine’s data centers can be seen at the bottom of promoted hosting plans: the USA, the UK, Singapore, Canada, Australia and the Netherlands.",
    "While searching for HostNine’s official blog, the only thing we found was a dated-looking blog that has been gathering dust since January 2015. It contains a couple of decent straight-to-the-point written tutorials, though.",
    "There are three levels of plans for each hosting type HostNine provides. Shared hosting plans are labelled as: Personal, Business and Enterprise, while the other types are simply tagged with numbers (where a larger number indicates a more premium plan). The starter plan (labelled as Personal) goes for $10.03 for a month and includes unlimited storage and unmetered bandwidth. However, it excludes free domain (it will cost you additional $15 for a year), free SSL certificate (it will take another $39.99) and the only available data center is in the USA.",
    "While cheapest, the “Personal” plan is quite limited and doesn’t offer much to those who are just starting to create their first websites. On a positive note, with HostNine there is no price hike after the renewal of your hosting plan. Therefore, at least when pricing is concerned, what you see is what you’ll get, now or ever.",
    "If you choose HostNine’s plan for at least a year, you’ll get a 45-day money-back guarantee, which is a bit longer than usual.",
    "When it comes to payment methods, HostNine supports credit/debit cards and PayPal.",
    "Selecting a plan with HostNine is quite simple, since all of them are presented side-by-side with their features, pricing for add-ons, as well as locations of all available data centers. If you want to learn a bit more about the plan before making a decision, there is an option “See all…” for each hosting type. This will inform you about additional features (such as control panel and accessible applications) and differences in prices depending on the billing cycle.",
    "After this you’ll have to register a new domain (a free one is included in more costly plans for shared hosting and all reseller hosting plans) or transfer an old one, provided you have it. The two available add-ons are: Google AdWords (with $100 worth of free credit) and Priority Support (which will make your tickets a priority for $15 per month).",
    "To be perfectly honest, paying $15 every single month just so you can get the support you need quickly enough doesn’t sound like such a great deal. We can’t help but think that users who complained about HostNine’s customer support possibly didn’t take that overpriced ad-on. Even the ID Protection (safety for the personal information and reduction of spam to the inbox) will cost an extra $12.95, though this time for a year.",
    "After checking all details about the purchase, you’ll have to provide: your name, e-mail, phone number, street address, city and state. Those who are opening an account on behalf of the company are required to provide additional VAT information. After this, you’ll create a password, add a payment method, choose if you want to be part of the mailing list, and proceed to checkout.",
    "After taking a look at HostNine’s terms and conditions, we noticed a small (but noteworthy) detail about the 99.9% uptime guarantee. For every 60 minutes of downtime, customers will get one day’s worth of credit on their HostNine’s account as an apology.",
    "Since HostNine provides its users with a cPanel and WHM control panel together with Softaculous one-click app-installer, hundreds of open-source applications and CMSs will be at your disposal in no time.",
    "On the question “Why HostNine?” they give us a few reasons and one of them was related to their performance, where they claim that each of their data centers offers its users “world-class network speeds and reliability”. After witnessing that HostNine indeed knows how to “talk the talk”, we had to check if they “walk the walk” as well.",
    "A repeated GTmetrix speed test on HostNine’s main website gave us a few reasons to question their promises. With the average result of 8.1 seconds, the time it took to fully load the page was 8.2. This may be a mere millisecond longer, but we have to admit that it leaves no impression of “world-class” speed. Additionally, loading the page took 114 requests, which doesn’t look very good in comparison to the average of 87. To conclude the test, GTmetrix ranked the website's speed performance with an F (46%).",
    "However, an uptime test by UptimeRobot that ran on HostNine’s main website for more than a month showed more uplifting results. During the recorded time there was no evidence of downtime and merely one major oscillation in response time. Although one month isn’t representative of a whole year, these results do show promise.",
    "HostNine offers various types of customer support including: e-mail, ticket, live chat and telephone. However, the latter one is reserved for the US citizens and made available only during the working hours. All other forms of support should be available round-the-clock.",
    "If you decide to contact HostNine‘s team by selecting the corresponding option (that is “Contact Us”) on the landing page, you’ll be presented with their knowledgebase. At first glance it looks different in style from the website and a bit old-fashioned, but it is well equipped with a few hundred articles divided into different categories. Some of these are pretty detailed, but others will provide you with the most basic instructions sorted by ordinal numbers. Both appear helpful enough, though.",
    "Judging by the comments of dissatisfied users on social networks, live chat is the weakest link of HostNine‘s customer support. However, our own experience was more positive than expected. We got our reply in less than 30 minutes and couldn’t find anything in it worth complaining about.",
    "Similarly to HostNine, StableHost is another US-based host with a decent variety of hosting-related products, features and options to choose from. Although both of them tend to be on the expensive side when compared with their competition, when starter plans are at play, StableHost offers them at budget-friendly prices and throws in a SiteBuilder as a bonus.",
    "Despite being part of the same umbrella company (EIG), Hostgator and HostNine don’t share a “mode-of-operation”. Hostgator takes an effort to provide the beginners with all the necessary tools without making them feel like they’ve paid a king’s ransom. At the other end, HostNine doesn't shy from (over)charging them for every single thing, although, to be fair, in a commendable and transparent way.",
    "Another fellow EIG brand, Bluehost, is one of the biggest players in the web hosting industry today and, as expected, is able to offer its users more competitive prices than HostNine. If this is not enough to convince you, Bluehost includes a free domain in all of its plans (for the first year) as well as free CDN and an SSL certificate.",
    "Verio and HostNine are somewhat similar when pricing is concerned, since both are unafraid to charge more for their services than most hosts. However, HostNine provides its customers with industry standard cPanel, while Verio offers a plain-looking control panel which is not user-friendly enough, especially in comparison.",
    "HostNine is a perfectly capable host which offers enough hosting options, features and add-ons to meet the needs of most users, no matter how demanding their businesses are. Unfortunately, although it belongs to the same group as Bluehost and Hostgator, HostNine fails to provide equal value for money when it comes to small business owners. Truth be told, HostNine is far from a bad host, but it doesn’t stand out much among other companies."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "15": "Speed and experience",
    "18": "Support",
    "21": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "HostNine": "https://hostnine.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "reseller": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "cloud VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated server": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "starter plan": "https://hostnine.com/shared/",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "StableHost": "https://www.techradar.com/reviews/stablehost",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    ", Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Verio": "https://www.techradar.com/reviews/verio"
  }
}