{
  "source": "https://www.techradar.com/reviews/ipad-mini-2021",
  "title": "iPad mini (2021) review",
  "category": "tablets",
  "updated": "2021-11-05T09:49:25Z",
  "author": "james-peckham",
  "summary": "The return of the miniature iPad",
  "verdict": "The new iPad mini 2021, also called the iPad mini 6, is a powerful device with a crisp smaller screen, 5G connectivity support, and a stylish and compact design that makes it easy to insert into bags and even larger pockets. It won’t be the best iPad for everyone, but it’s undeniably the best small tablet money can buy.",
  "pros": [
    "Stylish compact design",
    "Starts at 64GB storage",
    "Lots of power"
  ],
  "cons": [
    "5G connectivity is limited",
    "Battery life could be better",
    "Doesn’t include stylus"
  ],
  "article": [
    "The defining feature of the iPad mini (2021) is its small stature, and like the iPhone 13 mini this is a device that marries a scaled-down design that will be popular with many users with top-end specs and power.",
    "Think of it like an iPad Air 4, but shrunk down and with a more powerful chipset inside. It inherits a similar design to the iPad Air 4, with square edges, no home button and a USB-C port on the bottom edge.",
    "The 8.3-inch display is crisp, and it’s bright enough for outdoor use, as well as for everything you’d want to do with your tablet indoors. Apple calls this an “all-screen design”, but we’d argue that the thicker bezels mean that’s a rather bold claim.",
    "That said, this iPad mini is easier to hold because of these bezels, so they’re not necessarily a negative. You’ve got the choice of four colors – Purple, Pink, Space Gray or Starlight.",
    "Apple has ensured that the iPad mini shines in the specs department, thanks primarily to the new A15 Bionic chipset, which has impressed us with its performance during our testing time.",
    "There’s also either 64GB or 256GB of storage, depending on which model you opt for.",
    "5G is also now available on the iPad mini, which is a first for Apple’s smaller tablet. That means you can connect to next-gen networks, if you opt for the cellular version and have a supporting carrier.",
    "The changes here over the iPad mini 2019 are incremental, but the sixth iteration of the iPad mini brings improvements in a variety of areas. It isn’t the absolute-best iPad, but it’s out-and-out the best tablet you can buy if you’re looking for a small device.",
    "The new iPad mini (iPad mini 6) was revealed alongside the iPhone 13 range at Apple’s launch event on September 14, 2021 and it came out in the US, UK and Australia 10 days later.",
    "You can order it now from Apple’s website, and we're seeing it in stock at a variety of other retailers too. The price for the iPad mini 6 starts at $499 / £479 / AU$749.",
    "You can see all the prices for the new iPad mini models below, for both the 64GB and 256GB storage sizes, and the Wi-Fi-only or Wi-Fi + cellular options. It’s worth noting that the 2019 iPad mini came in 32GB or 128GB options, so storage has been doubled for the 2021 model.",
    "The new iPad mini isn’t quite mini enough for one-handed use, but it’s noticeably easier to use than even the iPad Air 4 because of its small size. This feels like the perfect compromise, in terms of form factor, between the iPhone 13 Pro Max and a larger tablet like the iPad Air 4.",
    "Its dimensions of 195.4 x 134.8 x 6.3mm (that’s notably smaller than the last-gen mini) make it one of the smallest tablets we’ve ever used, and it’s an enjoyable experience for anyone who doesn’t need a larger screen for watching video and more.",
    "The design here is more like the iPad Air 4 or the new iPhone 13 than the previous mini – it’s a flat-edged design that looks and feels premium, with a brushed metal effect on the rear of the tablet.",
    "There are four color options: Purple, Pink, and Space Gray, plus a cream-like color that Apple is calling Starlight – you’ll see the Purple model pictured throughout this review.",
    "The Purple and Pink colors are more bold and vibrant than the options for the iPad mini 2019 or the iPad Pro 2021, and we’d recommend choosing one of those shades over the more conservative Space Gray if you’re looking for a more eye-catching design.",
    "The iPad mini weighs 293 grams (a touch less than the 2019 model), which means it’s easy to slide into a bag – and even a large jacket pocket – and not feel the extra weight.",
    "Apple has moved the buttons slightly on the new iPad mini, and you’ll now find the volume buttons are on the top edge, at the top right-hand corner. On previous versions, you’d find these on the right hand edge of the device.",
    "There’s also no home button on the iPad mini 2021, which was a staple of past versions of this tablet. Instead, there’s a power button on the top edge in the left hand corner, and this is also home to the Touch ID sensor that enables you to use your fingerprint to unlock the tablet. We’d recommend setting up fingers on both hands so that the unlock button is always within easy reach of one of your digits, whether you're using the tablet in portrait or landscape orientation.",
    "On the bottom edge of the tablet is the USB-C port, which is used for recharging the device as well as for connecting accessories. The iPad mini supports a variety of accessories such as the Apple Pencil, although it’s not as functional as the iPad Pro 2021 with its Thunderbolt connector.",
    "The right edge houses the charger / connector for the Apple Pencil (second-gen), as well as the SIM tray. Note that the Apple Pencil doesn’t come with the tablet, so you’ll be spending more if you want Apple’s stylus.",
    "The iPad mini also gets upgraded stereo speakers, which we found gave full and clear audio when listening to music or watching video on the tablet.",
    "The iPad mini features an 8.3-inch Liquid Retina display, which offers good picture quality.",
    "Apple says it's an “all-screen design”, but we’d argue that that isn’t strictly the case, as there are thick bezels around the outside of the screen. These bezels aren’t necessarily an issue though, as they allow you to more easily hold the tablet without touching the screen. It’s far from an “all-screen” look, though.",
    "The resolution is 2266 x 1488, which works out to 326 pixels per inch. That’s good for a tablet, but it isn’t the best resolution we’ve seen on a slate, and – most noticeably when you’re watching video – the resolution isn’t as strong as on some Android tablets or even the iPad Pro 2021 line.",
    "It’s unlikely that you’ll find this is an issue though, and the screen is suitably bright and the picture quality is clear. Unlike the 120Hz iPad Pro line, the iPad mini features a standard 60Hz refresh-rate display, so you’re not getting a super-smooth experience when scrolling social feeds or playing games.",
    "If you’re looking for a tablet with a smaller screen, the panel here will suit you very well; we’d have liked to see a 120Hz refresh rate, but it isn’t too much of an issue.",
    "The iPad mini 2021 is powered by Apple’s new A15 Bionic chipset – that’s the same processor as in the iPhone 13 series, and it’s powerful enough to run any app or game you’ll find on the App Store, as well as for multi-tasking.",
    "It isn’t as powerful as the iPad Pro’s M1 chipset, but we found it to be more than capable for everything we wanted to do on the iPad mini. If you need top-tier power, you may want to opt for the iPad Pro line instead, but most people will be happy with what’s on offer here.",
    "We don’t yet know how much RAM is inside the iPad mini, but in our testing it proved more than adequate for everyday takes.",
    "The Geekbench 5 benchmarking software gave us a multi-core score of 4700, which is similar to what we’ve seen for the iPhone 13. That’s significantly better than the iPad mini (2019), which scored 2680, but nowhere near as high as the iPad Pro 2021 on 7297.",
    "That iPad Pro 2021 score is remarkably high, and we never expected the iPad mini to be able to compete with the M1 chipset – and the average user won’t need that sort of performance, even if they’re using a lot of power-hungry apps.",
    "You can buy the tablet with 64GB or 256GB of storage – as usual there’s no microSD support, so you’ll be using the built-in storage plus whatever iCloud storage you have. If you’re planning to store a fair amount of media on your device you’ll likely want to go for the 256GB model.",
    "That said, serious power users are likely to find that 256GB of storage isn’t enough. The new iPad Pro goes up to 1TB of storage, so it may be worth looking at that model if you’re intending to fill your tablet with apps and media.",
    "There’s also 5G connectivity on the iPad mini for the first time – although the tablet won’t be compatible with mmWave 5G, so if you’re a Verizon customer you may want to look into this before you purchase the tablet.",
    "The rear camera on the iPad mini is a 12MP wide snapper with an f/1.8 aperture and digital zoom up to 5x. It’s fine, and while it’s no substitute for your smartphone camera, if you’re using it for augmented reality experiences, or with other apps that need to use the rear camera, it’ll be satisfactory.",
    "On the front of the tablet is a 12MP ultra-wide camera with a 122-degree field of view and an f/2.4 aperture. This is a very effective camera for video calling, and we found the quality here is better than from the shooter on the rear of the device.",
    "Apple has also brought its Center Stage feature from the 2021 iPad Pro to the iPad mini. This enables the camera to track you when you’re on video calls, and ensure that you’re always in the center of the frame.",
    "We found this to work well, and it’s especially useful when someone else enters the frame and you want them to be included in the video too.",
    "The iPad mini comes running iPadOS 15 out of the box, and Apple’s tablet-optimized operating system works well on Apple’s smaller-screen tablet.",
    "iPadOS 15 brings updates such as widgets for your home screen, which are welcome on the new iPad mini. There’s also a new way to enable split-screen mode with just a tap, which is another nice improvement.",
    "Both the iPad mini 2015 and iPad mini 2019 are capable of upgrading to iPadOS 15, so it’s likely you’ll see many years of software support if you buy this tablet; that’s not guaranteed, but Apple has a strong record in this area.",
    "Don’t expect super-long battery life from the iPad mini 2021, but it’s good enough to last you for a full day of typical use. We don’t yet know the size of the cell inside the iPad mini as Apple doesn’t reveal these details, although we wouldn’t be surprised if an enterprising teardowner finds out before too long.",
    "Apple estimates that you’ll get up to 10 hours of use when browsing the web or watching video over Wi-Fi, and we found that to be about right. Your iPad mini likely won’t last that long if you’re using the tablet on full brightness and swapping between multiple apps – we were getting around eight hours of battery life with more intensive use.",
    "So the battery life is okay, but it isn’t going to blow your mind. We found that things like sketching with the Apple Pencil also drained the battery life more quickly, and it’s likely to drop even faster if you’re using mobile connections as well.",
    "A USB-C charger and cable are included in the box for recharging your tablet. There’s 20W fast charging here, which we found was able to recharge the tablet pretty quickly, but it’ll still take over an hour and a half to fully recharge your slate.",
    "In our testing, the iPad mini recharged from zero to 17% in 15 minutes, and after half an hour it was up to 36%.",
    "There’s no wireless charging here, and the iPad mini isn’t compatible with the company’s MagSafe accessories that work with a variety of iPhone models.",
    "First reviewed: September 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "iPad mini (2021) release date and price",
    "11": "Design",
    "22": "Display",
    "27": "Specs, performance and camera",
    "39": "Software",
    "42": "Battery life",
    "48": "Don't buy it if…"
  },
  "links": {
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "iPad mini 2019": "https://www.techradar.com/reviews/ipad-mini-2019",
    "Apple’s website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1238518188932270300&sharedId=trd-gb&u=https%3A%2F%2Fwww.apple.com%2Fipad-mini%2F",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "Apple Pencil": "https://www.techradar.com/how-to/apple-pencil-on-ipad-our-full-guide-on-how-to-use-it",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "5G connectivity": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Center Stage feature": "https://www.techradar.com/news/i-loved-the-ipad-pros-center-stage-camera-until-i-lost-control-of-it"
  }
}