{
  "source": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
  "title": "Samsung Q80T QLED TV review",
  "category": "televisions",
  "updated": "2021-07-27T10:46:34Z",
  "author": "steve-may",
  "summary": "Samsung targets gamers with this low-latency stunner",
  "verdict": "Samsung’s premium-priced mid-range QLED barely puts a pedestal wrong, offering vibrant HDR, a forward facing feature set and HD upscaling to die for.",
  "pros": [
    "AI-enhanced 4K Quantum image processor",
    "Ultra-low image lag",
    "Superior OTS sound"
  ],
  "cons": [
    "No Dolby Vision",
    "No Freeview Play",
    "Not the prettiest QLED you can buy"
  ],
  "article": [
    "The Samsung Q80T QLED TV is an excellent jumping-on point if you want one of the cheapest full array backlight QLED TVs in the Samsung TV range.",
    "Strategically positioned just below the Q90T, with which it shares a number of advanced features, and above the edge-lit Q70T, the Q80T sits comfortably in the mid-range, but its performance is far from average. And for its $1,349 / £1,279 / around AU$1,809 price tag, you’d certainly hope so.",
    "We tested the QE65Q80T (65-inch) size – 49-inch, 55-inch, 75-inch and 85-inch models are also available – and found it had bright peaky HDR, gorgeous definition and a wide color gamut. Make no mistake: the Samsung Q80T QLED TV looks every bit as pretty as you’d hope – while packing some surprising extras to boot.",
    "It's worth noting that the Q80T does have a 2021 successor in the form of the Q80A, the 55-inch model of which is available to purchase for $1,299 (around £939 / AU$1,749).",
    "It’s inevitable that the Q80T, which features a FALD (Full Array Local Dimming) backlight, is not going to be the slimmest flatscreen on the shelves, but for most buyers the extra bulk is going to be worth it.",
    "Samsung’s designers have gone some way to mitigating this extra depth by framing the panel with a ridiculously minimal bezel, creating the illusion that pictures are magically hanging in the air.",
    "Connectivity is excellent, too, with four HDMIs that offer advanced and varying specifications. There’s 4K at 120fps support on HDMI 4, and eARC on input 3. The set can handle 4K at 60Hz (expected from PlayStation 5 and Xbox Series X games), 2K at 120Hz, plus VRR (Variable Refresh rate) and ALLM (Auto Low Latency Mode). FreeSync support is included for PC AMD gamers too.",
    "Rounding things out are two USB ports, digital optical audio out, Ethernet to support Wi-Fi and Bluetooth, and a Common Interface slot, for all those territories which require one. You almost certainly won’t need everything on offer, but it’s nice to have them in reserve.",
    "The screen is bundled with two remote controls, one the usual button strewn offering most of us will gravitate to, the other a simplified pointer.",
    "Design TL;DR: The Q80T may not win any beauty prizes, but it sports a bezel barely big enough to contain its images. The futuristic HDMI provision is a cut above the norm too.",
    "Samsung has made some revisions to its Tizen smart TV platform this year to improve usability. The launcher bar is a little smaller, allowing more apps to sit onscreen without a need to scroll. When viewed on the larger Q80T models, this makes perfect sense. There’s also enhanced connected device discovery, making it easier to jump between inputs.",
    "Also new this season is Mobile Multi View with Casting, which enables two screens (the main TV image and your smartphone) to be watched simultaneously.",
    "While there’s no Freeview Play tuner (on the UK edition of the set), all key Catch-up TV channels are supported, along with Netflix, Amazon Prime Video, Disney Plus, Rakuten TV, Apple TV and YouTube (to name but a few).",
    "Samsung’s Ambient mode also makes a welcome return, allowing the QLED screen to serve as a gallery for JPEGs or artworks, or double as a news ticker or clock.",
    "Smart TV TL;DR: Overflowing with bingeable streaming apps, and bolstered by Ambient Mode, this slightly smarter QLED ticks all the right boxes. Newcomer Multi View Mode with casting will probably have limited appeal, but for YouTube tutorial addicts and Twitch gamers, it's undeniably useful.",
    "Normally, it’s 4K HDR performance that steals all the headlines in a TV review. But that’s not entirely the case here. Thanks to the set’s UHD Quantum image processor, which has trickled down from Samsung’s 8K flagships, and some new AI smarts, the Q80T’s performance with HD SDR content is a real showstopper.",
    "The TV is able to interpolate subtle elements of detail into HD and lower resolution content, creating a compelling UHD-style image. The processor works out what is native detail, and then through comparison with a texture database, creates more of the same.",
    "Not only is this talent a godsend in these bit-reduced times, but it also breathes new life (actually interpolates detail) into any non-UHD disc collection.",
    "SDR picture modes comprise Standard, Dynamic, Natural and Movie. Standard and Natural work with most content types, with the latter having the edge in brighter viewing rooms, where its tendency to crush black level detail in order to enhance contrast is less obvious.",
    "The Dynamic mode leads to quite oversaturated images, though, while Movie basically does the exact opposite.",
    "If you don’t want to faff around in menus, and can’t persuade other household members to manipulate image presets, there’s an updated version of the brand’s Intelligent Mode, with adaptive brightness and adaptive sound, that’ll make the most of incoming content.",
    "Motion handling is above average, too, so this a good screen for lovers of sport (where you can find it).",
    "Auto Motion Plus settings can be manually configured, with adjustable blur and judder reduction. If you don’t want things to look overly processed, keep blur reduction low and judder reduction at around 4. Alternatively, leave the system on Auto.",
    "Of course, if you really want to let the Q80T’s 4K Quantum processor off the chain, feed it some native UHD. It boasts a raft of technologies able to maximise colour, detail and specular highlights.",
    "HD/SDR performance TL;DR: If you want to make the most of an existing DVD or Blu-ray collection, or clean up bit-throttled streams, this set does that majestically well. HD SDR upscaling is best in class.",
    "Although it’s tempting to compare the Q80T with 2019’s Q80R, this model is actually an update on last year’s Q70R. (Confused? That’s probably the idea). The Q80T shares the same number of backlight zones as the Q70R (around 50). This puts it some way behind FALD flagships, but it’s still good enough to offer more HDR precision when compared to edge-lit screens, all while maintaining decent screen uniformity.",
    "For the most part, you won’t notice errant screen blooming, except on dark scenes with bright highlights. More often than not, the giveaway is black letterbox bars with movies.",
    "When something bright moves into the space just above or below the picture area, you’ll see some light pollution – but the effect is relatively fleeting.",
    "The set’s overall HDR performance is strong, too. We measured peak brightness just under 900 cd/m (aka nits), using a 10 percent HDR window.",
    "This range covers most commercially produced HDR content, and presents bright highlights that add sparkle and depth to images.",
    "Infuriatingly, though, there’s no support for Dolby Vision. Samsung maintains it doesn’t need it, although its reticence to embrace what is a universal dynamic metadata standard appears more political than practical.",
    "On the plus side, there is provision for HDR10+ – used by Amazon Prime in place of Dolby Vision – as well as static HDR10 and broadcast standard HLG.",
    "4K/HDR performance TL;DR: While this set offers fewer dimming zones than last year’s Q80R model, blooming is minimal while keeping contrast and HDR performance is kept high. The latest iteration of Samsung’s 4K Quantum processor ensures super definition and rich colour, making this a great all-rounder.",
    "While the Q80T looks fairly conservative, it actually boasts a rather radical sound system. Rather than just relying on downward firing stereo drivers, Samsung’s designers have added a second pair at the top left and right of the display.",
    "This enables the screen to produce a soundstage that’s both high and wide. We’re not talking Dolby Atmos immersion – although if you want to bitstream that out over HDMI to a waiting soundbar or home cinema system, you can – but we are talking about an impressive wall of noise.",
    "The implementation dovetails with the brand’s OTS (Object Tracking Sound) audio system, which adds a level of directionality to movement on screen. Dialogue locks to the centre of the picture, while stereo pans enjoy an enhanced sense of spatial movement.",
    "Total audio output is rated at 60W, more than enough for the average movie night. The audio quality itself is mid-fi at best, but the end result remains entirely satisfying.",
    "Stressing the Q80T’s credentials as a gaming display are some truly impressive low latency figures – though one consequence of chasing the lowest possible image lag is a deterioration in image quality. When you turn off all the processing in a panel, you’re sacrificing a lot of the good stuff.",
    "That’s why Samsung offers a dedicated Game Motion Plus, which includes blur and judder reduction, plus optional LED clear motion. Even with this processing suite engaged, input lag is an admirably low 19.7 milliseconds (1080/60). For truly competitive players, this can be switched off, dropping image lag to just 8.7ms. Lag that low is truly remarkable for a consumer TV.",
    "Of course, if you spend most of your time playing Animal Crossing, we advise sticking to the Standard image preset, and enjoying the picture dividends that brings.",
    "A high launch price makes the Q80T vulnerable to some strong competition. Most obviously, there’s Sony’s 65-inch XH95 LED. While this model lacks the same cutting edge processing as the Q80T, it completes with arguably more style, Dolby Vision and IMAX Enhanced support, plus Ambient Optimization, which optimises picture and sound quality for any viewing environment.",
    "Alternatively, you could save a packet and go for Philips 65OLED754, a super value OLED screen with universal HDR (Dolby Vision and HDR10+), excellent image quality and crowd-pleasing Ambilight.",
    "The Samsung Q80T gets just about everything it sets out to do right. Unusually for such a premium set, it’s not specifically tailored for the home cinema crowd, courting gamers and mainstream viewers instead – but this is probably a smart move, not least because the lack of Dolby Vision won’t stick in the craw of that designated audience.",
    "Good contrast and vibrant colour, coupled to sensational upscaling and advanced smart features like Ambient mode, ensure the Q80T warrants frontrunner status."
  ],
  "headers": {
    "4": "Design",
    "10": "Smart TV (Tizen)",
    "15": "HD/SDR performance",
    "25": "4K/HDR performance",
    "33": "Sound and gaming",
    "40": "Other panels to ponder",
    "42": "Verdict"
  },
  "links": {
    "QLED TV": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "55-inch": "https://www.techradar.com/best/55-inch-4k-tv",
    "75-inch": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Q80A": "https://www.techradar.com/news/samsung-qn85a-vs-q80a-qled-tv",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Rakuten TV": "https://www.techradar.com/reviews/rakuten-tv-review",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Q70R": "https://www.techradar.com/reviews/samsung-q70-qled-tv",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "OTS (Object Tracking Sound)": "https://www.techradar.com/news/samsungs-new-qleds-nail-built-in-audio-and-other-tv-brands-should-take-note",
    "input lag": "https://www.techradar.com/news/input-lag-response-time",
    "Animal Crossing": "https://www.techradar.com/reviews/animal-crossing-new-horizons",
    "XH95": "https://www.techradar.com/news/the-sony-xh95-is-the-sony-4k-tv-to-buy-this-year-if-youre-not-sold-on-oled",
    "IMAX Enhanced": "https://www.techradar.com/news/imax-enhanced-an-inside-look-at-the-new-standard-heading-to-home-theaters",
    "Philips 65OLED754": "https://www.techradar.com/reviews/philips-55oled754-tv",
    "Ambilight": "https://www.techradar.com/news/should-i-buy-a-philips-ambilight-tv"
  }
}