{
  "source": "https://www.techradar.com/reviews/ntense-genesis-gaming-desk",
  "title": "NTENSE Genesis Gaming Desk review",
  "category": "computing",
  "updated": "2021-11-04T21:26:11Z",
  "author": "anthony-spadafora",
  "summary": "Get the arcade experience at home with this standing desk for gaming",
  "verdict": "If you’re looking to set up a home arcade or carve out a gaming nook for yourself with limited space, the NTENSE Genesis Standing Desk will allow you to stand up so you can stay active while playing. This non-adjustable standing desk also features plenty of shelves and storage space to house multiple consoles, controllers and all of your other accessories.",
  "pros": [
    "Small footprint",
    "Integrated headphone stand",
    "Plenty of shelves for accessories",
    "Can fit an Xbox Series X / mid-size PC case"
  ],
  "cons": [
    "Expensive",
    "Can’t be adjusted",
    "LED lightstrip could be bigger",
    "Only slim cans and bottles fit in the cup holder"
  ],
  "article": [
    "Sitting at an office desk all day while working from home can have negative effects on your health and this also applies to gaming. This is why more people are turning to standing desks which allow you to switch from a seated position to a standing one to help break up your workday or in this case, your play sessions.",
    "While we’ve reviewed manual standing desks like the Ergotron WorkFit-D and electric standing desks like the ApexDesk Elite Series 60 before, today we’ll be taking a closer look at a non-adjustable standing desk from NTENSE with a focus on gaming. The company has made a name for itself on Amazon over the past few years with its gaming desks, tv stands and other accessories.",
    "In this review we’ll be looking at the features, build quality and storage space offered in the NTENSE Genesis Gaming Desk to see if it could be a good fit for those looking to be a bit more active while playing their favorite retro arcade games, consoles and PC games.",
    "The NTENSE Genesis Gaming Desk is available from Amazon for $249.99 at the time of writing though it did recently go on sale for around $150 just last month. You can also find this desk on sale online from other retailers including Target, Office Depot and Staples.",
    "The NTENSE Genesis Gaming Desk features a total of three shelves made of medium-density fibreboard that are held in place by a sturdy metal frame. The desk has a relatively small footprint as the frame has a narrow 13.8-inch base that extends out to 23.1-inches at its top. While the desk is also available in white, only the black model is currently available on Amazon at the time of writing.",
    "The bottom shelf is divided in two and provides more than enough room to house your controllers, games and other accessories. The middle shelf is both taller and wider and is where you can put either a small form factor PC, a Nintendo Switch or even an Xbox Series X. However, as there is only 14.4 inches between the middle shelf and the top shelf, you won’t be able to fit a PS5 vertically though you could lay it down horizontally.",
    "The top shelf is where you can put your keyboard or even an arcade stick. This shelf also extends back quite a bit so you can put your keyboard and mouse away when gaming with a controller. A cup holder and a headphone holder attach to either side of this shelf as well so you can have an energy drink and a pair of headphones handy during long play sessions.",
    "Finally at the top of the NTENSE Genesis Gaming Desk, there is a riser for your monitor or TV. Keep in mind though that the riser is only 30-inches wide and can support up to 15lbs (6.8kg) so larger and heavier TVs as well as those with legs on either side as opposed to having the stand in the middle will likely be out of the question.",
    "The NTENSE Genesis Gaming Desk sent to us for review arrived in one large box that contained the left and right leg frames, four shelves, a partition, the desk’s back panel, an RGB LED lightstrip, a cup holder and a headphone holder along with all of the screws, bolts and wood dowels needed to put it together.",
    "If you’ve built home or office furniture before, you should be right at home putting together the NTENSE Genesis Gaming Desk. While a hex key is included, you will need a Phillips head screwdriver as well to put it together. NTENSE also recommends that two adults put the desk together but we were able to do it by ourselves without any troubles.",
    "However, our one complaint during setup was that we followed the directions to the letter and didn’t think about how we would set up our PC afterwards when installing the LED lightstrip. NTENSE has you put it under the top shelf in the middle so that you can light up your consoles or PC to show them off. However, as the PC we used during testing is a bit on the taller side, it obscured the lightstrip. Still though, the lightstrip is affixed to the underside of the shelf using small brackets and screws in addition to an adhesive strip to prevent it from falling off which is a nice touch. A longer lightstrip and more flexible positioning options would be something we’d like to see in an update or new version of the NTENSE Genesis Gaming Desk though.",
    "As we mentioned above, we first tested the NTENSE Genesis Gaming Desk out using a small form factor PC. However, we also had room to the right of it for a Nintendo Switch. Although our PC just fit in the space between the two shelves, airflow wasn’t a problem and we didn’t notice any increased temperatures during testing.",
    "We placed a Samsung M5 Smart Monitor on the desk’s riser and a mechanical keyboard and mouse on the top shelf. While the headphone hanger did the job perfectly, the cup holder disappointed us somewhat as it’s too narrow for larger beverages though it’s the perfect size for a Red Bull or a bottle of beer but we ended up mainly using it to hold the remotes for the LED lightstrip and our monitor.",
    "During our second round of testing, we pushed our keyboard to the back of the top shelf and played some retro games on Nintendo Switch Online using an 8BitDo Arcade Stick. There’s even enough room for two arcade sticks side by side so that two people can play together on the NTENSE Genesis Gaming Desk.",
    "As finding alternatives to the NTENSE Genesis Gaming Desk proved difficult due its unique design, those looking to stand while gaming may want to consider a similar non-adjustable standing desk or even an electric standing desk that is adjustable.",
    "The Ameriwood Home Coleton Standing Desk is a much cheaper option at $84 though it’s currently on sale for $70. It has a much simpler design though it's both wider as well as slightly shorter than the NTENSE Genesis Gaming Desk. It won’t look as nice nor will it show off your gaming consoles the same way, but it will allow you to stand while gaming.",
    "For just $5 more at $255, the Flexispot EC1 is an entry-level electric standing desk that can raise from 28 inches to 47.6 inches so you can sit or stand while gaming. Unlike Flexispot’s other standing desks, this one doesn’t feature any presets for storing your preferred sitting and standing heights. Instead it only has a 2-button controller.",
    "The NTENSE Genesis Gaming Desk is a really unique standing desk as it provides an experience similar to using an arcade machine but with a wider range of games since its shelves can house a number of gaming consoles and even smaller desktop PCs. The desk is sturdy when assembled and its smooth black finish gives it a really sleek look. There is also plenty of storage despite its small footprint and cutouts on the top and middle shelf make it easy to run cables.",
    "While the NTENSE Genesis Gaming Desk won’t replace your home office desk and its height can’t be adjusted, it could be the perfect addition for those with less space that want to set up their own little gaming nook. You could also purchase several if you want to create a home arcade in your basement or game room. If ergonomics is something you’re concerned about and want your monitor or TV at eye level while gaming, then you’ll likely need to either get a wall mount or an adjustable height stand.",
    "We've also highlighted the best standing desk and the best gaming desk"
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "8": "Setup",
    "11": "In use",
    "14": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "office desk": "https://www.techradar.com/best/best-office-desks",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "standing desks": "https://www.techradar.com/news/best-standing-desk",
    "Ergotron WorkFit-D": "https://www.techradar.com/reviews/ergotron-workfit-d-sit-stand-desk",
    "ApexDesk Elite Series 60": "https://www.techradar.com/reviews/apexdesk-elite-series-60-standing-desk",
    "gaming desks": "https://www.techradar.com/best/best-gaming-desk-2020-top-standing-l-shaped-and-motorized-desks",
    "tv stands": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "NTENSE Genesis Gaming Desk": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNTENSE-Genesis-Gaming-Arcade-Stand%2Fdp%2FB098Q9TMWZ%3Fref_%3Dast_sto_dp%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7983049660581951000-20",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Samsung M5 Smart Monitor": "https://www.techradar.com/news/samsung-reveals-its-biggest-smart-monitors-yet",
    "mechanical keyboard": "https://www.techradar.com/news/best-mechanical-keyboards",
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-vs-nintendo-switch-online-expansion-pack-which-is-right-for-you",
    "8BitDo Arcade Stick": "https://www.techradar.com/news/best-nintendo-switch-accessories",
    "Ameriwood Home Coleton Standing Desk": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAmeriwood-Home-9872096COM-Coleton-Standing%2Fdp%2FB07BLL9W68%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1222123965319426800-20",
    "Flexispot EC1": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFlexispot-Electric-Workstation-Whole-Piece-Adjustable%2Fdp%2FB0851B8QJ7%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2753422517418642400-20",
    "best standing desk": "https://www.techradar.com/news/best-standing-desk",
    "best gaming desk": "https://www.techradar.com/best/best-gaming-desk-2020-top-standing-l-shaped-and-motorized-desks"
  }
}