{
  "source": "https://www.techradar.com/reviews/sendinblue",
  "title": "Sendinblue review",
  "category": "computing",
  "updated": "2021-01-06T05:16:08Z",
  "author": "alex-mcomie",
  "summary": "Efficient and affordable tools for email, SMS, Facebook, and more",
  "verdict": "Sendinblue is missing a mobile app and a few other notable features, but its price, features, and outstanding interface make it one of our favorite marketing automation providers in 2021.",
  "pros": [
    "Unusually robust free plan",
    "Clear, intuitive interface",
    "Informative Help page"
  ],
  "cons": [
    "No two-factor authentication",
    "Limited content types",
    "No mobile app"
  ],
  "article": [
    "Digital marketing was once seen as a supplement to traditional forms of outreach, but it has gradually overtaken traditional marketing strategies in the past decade. In such an intensely competitive field, it’s critical for marketers to do everything they can to stay ahead of the competition.",
    "Digital marketing solutions can streamline a wide range of marketing tasks, helping brands cut costs while achieving even better results. In our Sendinblue provider review, we’ll take a close look at the platform’s features and see how it compares to other top applications, like Mailchimp and Constant Contact.",
    "In contrast to many other digital marketing tools, Sendinblue offers a free plan with no subscriber limit. That said, free users can only send up to 300 emails per day, which limits the program’s utility.",
    "The Lite subscription costs $25 per month and introduces email support, along with a monthly limit of 100,000 emails. If that’s not enough, you can upgrade to Premium for $65 per month. Premium comes with five landing pages, access for up to three users, phone and live chat support, Facebook ads, automation tools, and a monthly limit of 1 million emails.",
    "Finally, custom Enterprise plans are available for larger businesses that need to send more than 1 million emails per month. Enterprise users can also access priority support, single sign-on, a customer success manager, and other advanced features.",
    "Sendinblue has almost everything that most organizations need to reach customers. On the most basic level, it provides excellent tools for creating and personalizing emails, text messages, Facebook ads, and other types of content. Sendinblue is an all-in-one solution that covers some of the most popular channels.",
    "Depending on your subscription level, you’ll also be able to leverage A/B testing, complex automation workflows, and comprehensive marketing analytics. After setting up a new email, you can streamline future campaigns by reusing the template.",
    "Sendinblue has a clean, professional design that makes it easy to find what you’re looking for. Unfortunately, while a desktop app is available for Windows Vista and above, Sendinblue doesn’t have apps for Mac, Linux, iOS, or Android users.",
    "Overall, though, the Sendinblue interface does an excellent job of simplifying a deep set of complex features. From the web dashboard, you can quickly create a new campaign or template, view marketing analytics, or adjust a variety of settings. Separate pages are available for transactional emails and a list of your contacts.",
    "As mentioned, Sendinblue support varies depending on your subscription. That said, the Help page has detailed answers to numerous questions for both free and paid users. It’s a great place to start if you run into any issues while using the service.",
    "While the pricing page lists email support as a perk for Lite subscribers, it also appears to be accessible for free users. You can create a support ticket by clicking your company name in the upper-right hand corner and selecting Support. Phone and live chat support are available at the Premium and Enterprise tiers. Unfortunately, we weren’t able to find any listed hours or turnaround times for such inquiries.",
    "Sendinblue takes basic security measures, but it’s missing crucial features like two-factor authentication and user activity tracking for team accounts. As an example, Constant Contact offers native two-factor authentication through integration with Okta Verify and Google Authenticator.",
    "On the other hand, Sendinblue is GDPR-compliant, and single sign-on is included with Enterprise subscriptions. You can encrypt incoming connections through the Sendinblue SMTP by using port 465. Whenever possible, Sendinblue automatically uses TLS protocol for outgoing connections.",
    "Sendinblue is a perfectly functional digital marketing provider with enough features for most users, but some alternatives may be more effective in certain use cases. Constant Contact, for example, offers additional content types such as surveys and polls. But access to the platform starts at $20 per month.",
    "Mailchimp offers a free plan that is an intriguing alternative to Sendinblue. Users can send up to 10,000 emails to as many as 2,000 contacts, and mobile apps are available for both iOS and Android devices. Free users also get access to surveys, basic automation tools, and seven marketing channels, including email, Facebook, and Instagram.",
    "All things considered, Sendinblue is an excellent digital marketing automation provider with the tools that most businesses need to oversee emails, texts, landing pages, Facebook ads, etc. That said, it is lacking a few notable tools, including two-factor authentication, content types like surveys and polls, and mobile apps for users who want to manage campaigns on a smartphone or tablet. On the other hand, we expect these to be relatively minor issues for most users, considering the platform’s overall effectiveness.",
    "While there are several strong alternatives, Sendinblue is still among the top marketing platforms in 2021."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "7": "Interface and in use",
    "9": "Support",
    "11": "Security",
    "13": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "Digital marketing": "https://www.techradar.com/best/best-email-marketing-software",
    "Sendinblue": "http://www.sendinblue.com",
    "free plan": "https://www.sendinblue.com/pricing/",
    "Lite": "https://www.sendinblue.com/pricing/",
    "Premium": "https://www.sendinblue.com/pricing/",
    "Enterprise": "https://www.sendinblue.com/pricing/",
    "Constant Contact": "https://www.techradar.com/reviews/constant-contact",
    "Mailchimp": "https://www.techradar.com/reviews/mailchimp"
  }
}