{
  "source": "https://www.techradar.com/reviews/web-hosting-hub",
  "title": "Web Hosting Hub review",
  "category": "computing",
  "updated": "2021-07-16T19:30:52Z",
  "author": "mirza-bahic",
  "summary": "Novice-friendly host with quite a few welcome features",
  "verdict": "Web Hosting Hub is a web hosting provider from the USA with a few appealing shared and WordPress hosting solutions. Although well-structured and pretty generous with its features, Web Hosting Hub’s plans are not the most affordable ones on the market.",
  "pros": [
    "Some much appreciated unlimited features",
    "Generous 90-day money-back guarantee",
    "First domain name is free-of-charge",
    "Superb customer support and comprehensive knowledgebase"
  ],
  "cons": [
    "Above-average prices",
    "Backups cost extra cash",
    "Limited hosting types and options"
  ],
  "article": [
    "Fueled by desire to provide easy-to-setup and budget-friendly web hosting solutions, Web Hosting Hub was founded in 2010. The head office is situated in Virginia Beach (the USA) together with one of their data centers. Since then, the company has expanded to another one, this time in Los Angeles (the USA) and the business has supposedly been on the rise ever since. Along with web hosting services, they are supplying domain names, free and open-source web applications and professional web design services for all sorts of businesses.",
    "At the moment, Web Hosting Hub is providing homes for websites and hosting-related services to more than 40,000 customers throughout the world, with the majority of their client base hailing from the US, Canada, the UK, Germany and India. Nevertheless, Web Hosting Hub’s main website is available in English language only.",
    "As green hosting is gaining an increase in popularity, Web Hosting Hub decided to jump on the bandwagon and try to be a part of the solution to at least one of the more prominent global problems of the times we live in. With this in mind, they are taking steps to downplay their impact on the environment by deploying data centers with more efficient servers which should (as a result) minimize their carbon footprint.",
    "Although Web Hosting Hub has an official blog, it shows all the symptoms of being left to rot, and is suffering from article deficiency, with the newest one being almost three years old as of now. Those who seek relevant and resourceful information related to hosting will probably find something of use there, however, it would be nice if Web Hosting Hub decided to blow the cobwebs away and make the blog more presentable. As their social network accounts (Facebook, Twitter and YouTube) seem to be cut from the same cloth, the same would be advised for these as well.",
    "In addition to shared hosting, Web Hosting Hub has a few attractive WordPress solutions that are made to be as beginner-friendly as possible. Three hosting packages are presented for each type of hosting and labeled as “Spark”, “Nitro” and “Dynamo” (we are sure you can guess which the cheapest one is).",
    "“Spark” starts at $ 5.99 (since it is 50% off at the moment) and puts no limitations on storage, bandwidth or the number of e-mail accounts. If you go one plan above (or two) you’ll get an opportunity to host any desired number of websites and databases. In addition to all this, all plans go along with a free domain registration, a free SSL certificate, over 400 one-click applications and an across-the-board & praiseworthy 90-day money-back guarantee.",
    "On the downside, the billing cycle lacks a flexibility of a monthly option (which is usually appealing to newcomers) and you can decide whether you want to be billed on an annual, biennial or triennial basis only.",
    "Another aspect of hosting with Web Hosting Hub that lacks flexibility is related to the methods of payment, since only payments made via credit cards and PayPal are deemed acceptable.",
    "If you are dreaming about launching your own online store, you’ll be pleased to hear that Web Hosting Hub’s packages come with a variety of ecommerce features (including auto-installed shopping cart) and $150 worth of credit to use on Bing and Yahoo!.",
    "Whatever you had in mind, purchasing a hosting plan from Web Hosting Hub should be an easy-going experience for various reasons. First of all, all plans (well, all six of them) are presented in a straightforward style meaning that all of their features are listed and can be easily compared and contrasted with each other. Here, you can change the billing cycle of every plan and see what the cost for each one is, and how much money you can save by extending the time period.",
    "After opting for the right one for you, you’ll proceed to settle on all the details about your plan (pick out a data center location, one-click installs, whether you want a few add-ons or for your website to be pre-designed by experts). One of these add-ons is automated backups, which will save everything from your hosting account (up to 10GB) every 24 to 36 hours, but for the price of $1 for each month (therefore, $12 for a year, which is a minimum). Although this is as cheap as chips, we wonder why backups aren’t included free of charge like with most web hosting providers today, since they are something any respectable website shouldn’t live without.",
    "Only when you are done with all of this, you’ll be asked what you want to do about your domain name, and besides the expected options (register a new or use an old one), you can decide to postpone your final decision for a more opportune moment in the future. After this, you’ll provide a list of personal data required for the account creation (nothing unexpected here), make a payment, wait for verification and look forward to your new website.",
    "Since Web Hosting Hub utilizes an industry-standard and easy-to-use cPanel that comes with more than 400 free apps, scripts, tools and BoldGrid’s decent website builder, your website should be in full swing without further ado.",
    "Among the numerous reasons for launching your website with Web Hosting Hub, they highlight “quick website speed” as one of their strongest assets. Since they supply all of their users with SSD drives and “top-of-the-line” Dell Servers, the speed of your website (as they claim) should be “up to 20x faster than it would (be) on standard spinning drives”.",
    "After putting this to the test with GTmetrix (a speed testing tool), we got a decent speed performance, although not quite perfect. The majority of vital metrics were a bit above the average, which prompted GTmetrix to rate the speed performance of Web Hosting Hub’s main website with a respectable B (87%).",
    "When it comes to uptime, Web Hosting Hub guarantees 99% of it, which is a bit lower from what we’ve come to expect, even more so when we compared it with the average score of other hosts. Nevertheless, according to UptimeRobot (a tool we utilized to monitor the uptime of Web Hosting Hub’s main website for the month), Web Hosting Hub is going places. Throughout this period, not a single second of downtime was recorded, promising that your website should be up and running all the time.",
    "If you are willing to search for answers by yourself, the primary destination should be Web Hosting Hub’s “Help Center” where you’ll discover solutions for most of the common concerns. There is a separate (and rather simple) section reserved for those who are totally new to all this. Here you’ll find answers to a few FAQs as well as questions from various users (in the comment section), all of which have been (as far as we can see) answered by the staff members in a helpful and polite manner. In essence, this functions as a community forum would.",
    "Besides featuring a photo of the only person not grinning like the Cheshire Cat on the site, their knowledgebase is packed with articles and good ones to boot.",
    "Web Hosting Hub’s support team includes more than 200 staff members and you can reach them via telephone, live chat, support ticket, e-mail and Skype (a fine addition we don’t see as often as we should). All of these should be available round-the-clock and according to the accounts of numerous users (as well as our own) you should be left in good hands.",
    "WebHostingPad and Web Hosting Hub share (besides a name similarity) a product range in which they both cover shared and WordPress hosting types, with several superb features including limitless e-mail accounts, storage and bandwidth. However, if you are in a penny-pinching mood, you better go with WebHostingPad since their hosting solutions will give you a bigger bang for your buck.",
    "In comparison to Web Hosting Hub’s plans, the ones from Bluehost are a bit cheaper, although with both hosts the minimal billing cycle covers one year only, so the price spike after the promotional period may take you by surprise, and not a pleasant one. That being said, when it comes to the most basic entry-level plan, we would go with Web Hosting Hub, since they are less restrictive about their features. With everything else, Bluehost will go above and below to get you covered.",
    "HostGator and Web Hosting Hub are similar in terms of features and both of them offer packages for pocket-friendly prices perfectly fit for a startup. However, HostGator provides a broader range of hosting types and hosting-related services, while with Web Hosting Hub you’ll have to settle for shared and WordPress-oriented hosting options. In addition, HostGator's (cost-free) website builder has drag-and-drop functionality and is better suited for newcomers than the one Web Hosting Hub provides.",
    "KnownHost and Web Hosting Hub are US-based hosts and both are pretty known in the web hosting business, and for the best of reasons. They offer a full list of attractive beginner-friendly features, but KnownHost goes one step further and makes all of its plans 100% managed. In any case, since both hosts provide money-back guarantees, you’ll have enough time to try everything out before reaching a definitive decision.",
    "Web Hosting Hub’s hosting solutions seem well-thought-out and capable of covering all that is necessary for a personal blog or a simple website. Therefore, if you are launching your very first website and are on the lookout for a budget-friendly and reliable host with a polite and proficient support staff, give them a chance. Nevertheless, keep in mind that backups will cost you extra and that some of the work you may take for granted will have to be done on your own. However, if you are looking to update a server of your fast-growing website, you’ll be better off with hosts that provide more advanced hosting options, such as HostGator and Bluehost.",
    "If you are still keen on giving Web Hosting Hub a try, considering that they provide a considerate 90-day money-back guarantee, you’ll have more than enough time to check all of this out for yourself."
  ],
  "headers": {
    "4": "Plans and pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "16": "Support",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Web Hosting Hub": "https://www.webhostinghub.com/",
    "domain names": "https://www.techradar.com/news/best-domain-registrars",
    "web design": "https://www.techradar.com/news/best-web-design-software",
    "green hosting": "https://www.techradar.com/web-hosting/best-green-web-hosting",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "Spark": "https://www.webhostinghub.com/hosting-plans",
    "Nitro": "https://www.webhostinghub.com/hosting-plans",
    "Dynamo": "https://www.webhostinghub.com/hosting-plans",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "shopping cart": "https://www.techradar.com/best/best-shopping-cart-software",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "WebHostingPad": "https://www.techradar.com/reviews/webhostingpad",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "KnownHost": "https://www.techradar.com/reviews/knownhost"
  }
}