{
  "source": "https://www.techradar.com/reviews/htc-vive-pro",
  "title": "HTC Vive Pro review",
  "category": "gaming",
  "updated": "2021-03-11T11:04:44.515Z",
  "author": "nick-pino",
  "summary": "The best VR headset for the ultra-discerning, financially well-off VR enthusiast",
  "verdict": "If you have both the financial and hardware resources for it, the HTC Vive Pro is a thing of beauty. It offers a higher resolution than the standard Vive and can take games from ‘good looking’ to ‘gorgeous’. Similarly, improvements to the weight distribution and the addition of the built-on earphones help the Pro sound - and feel – as good as it makes games look. But, all that said, when it doesn’t work as expected – or during the lengthy and problematic setup process – the Pro is a trial in troubleshooting skills.",
  "pros": [
    "Improved visual fidelity",
    "Built-in headphones",
    "Gradually improving game library"
  ],
  "cons": [
    "Price isn’t absolutely justified",
    "Jitteriness with all non-new hardware",
    "There’s still no must-own title"
  ],
  "article": [
    "Upon release in 2018, we told you that the HTC Vive Pro was the best VR headset for those who had a big budget and high-quality VR ambitions.",
    "Fast-forward to 2021 and it’s since been surpassed by the Valve Index as the best headset we’d recommend, the Oculus Quest 2 in terms of a convenient, standalone VR experience and the Oculus Rift for those with a high-end gaming PC.",
    "It also looks like there might be a new HTC Vive headset on the way soon. A top HTC official said the company plans on producing a new wireless, standalone VR headset in 2021 that is “probably better than what’s out there from any vendor today”.",
    "However, that doesn’t mean the HTC Vive Pro isn’t still one of the best, professional-grade VR experiences money can buy – even if we don’t think it’s the option that makes sense for most people.",
    "When we first tested the HTC Vive Pro back in 2018, we found it to be a powerful VR headset, despite the fact it offers a marginal upgrade in terms of visual fidelity to the original HTC Vive. At the time, we also couldn’t help but draw some parallels to Microsoft’s Xbox One X.",
    "Putting the PC vs. console argument to the side for a moment, if you think about it long enough, the similarities between the two bits of hardware become apparent.",
    "When both first launched, they offered new-and-improved experiences over existing hardware: enhanced visuals and more pixels pushed to the screen. However, despite some upscaling capabilities, neither the Xbox One X nor the HTC Vive Pro brought with them completely new or separate libraries of games, or use new peripherals (a boon for those of us who have heavily invested in our game libraries).",
    "They both offered the most powerful hardware in their respective categories, and they're both significantly more expensive than the standard hardware editions on their respective platforms.",
    "This argument is now a little dated considering we have the next-gen Xbox Series X, but the comparison still stands for those trying to get their heads around where the HTC Vive Pro sits in the small but powerful line-up for VR headsets nowadays.",
    "The HTC Vive Pro wasn’t cheap when it first launched but it has reduced in price since then. It currently retails at a number of different price points depending on which set-up you go for.",
    "Right now, just the headset itself can be found for $599, £599 or around AU$770.48. Although this is only the headset – you’d need controllers and base stations to get it to work properly. There are then a number of different packages on offer that escalate in price all the way up to the HTC Vive Pro full kit, which is $1,199, £1,119 or AU$1,899.",
    "Tack on the price of the recommended GPUs (that’s the processor you’d need in your PC for the VR headset to work) – either the Nvidia GeForce GTX 1070/Quadro P500 or AMD Radeon Vega 56 graphics cards – and the HTC Vive Pro, although reduced since launch, still isn’t cheap. Especially for anyone who still isn’t sure about VR or is a complete beginner.",
    "But, don’t get us wrong, the HTC Vive Pro still remains a top VR headset and, for some time, we considered it the latest and greatest VR experience you could try.. When it’s firing on all cylinders on high-end PC hardware, the HTC Vive Pro continues to offer one of the most beautiful, visually rich games we’ve seen in virtual reality.",
    "If you’re lucky enough to have both the HTC Vive and HTC Vive Pro in the same room like we were while writing this review, it can be difficult to go back to a VR headset with a lower-resolution display once you’ve had a taste of what the Pro can do.",
    "But a few years on now it’s been surpassed by other VR headsets, is the HTC Vive Pro still worth a look? We think so, but read on for our full review to find out more.",
    "While HTC and other VR evangelists will likely focus their attention on the Pro’s uptick in visual fidelity – a native resolution of 2880 x 1600 (615 dpi) versus 2160 x 1200 on the original Vive – the Vive Pro has a number of design changes that are just as valuable as the Dual AMOLED display.",
    "First off, the HTC Vive Pro comes with built-in headphones that sit directly on top of your ears. They’re adjustable in height, and include volume controls which means you’ll no longer have to take off the headset to re-adjust the volume between game sessions.",
    "There’s also the new harness that holds the headset more firmly than the velcro straps did on the original HTC Vive. The harness keeps the headset from moving during particularly intense moments in games like DOOM VFR or Arizona Sunshine, and wards off the infamous head strain that could occur after wearing the original HTC Vive for an extended period of time.",
    "Spin the headset around to the back and you’ll find the new turn knob – a carry-over from the Vive Deluxe Audio Strap that HTC released last year. You can use it to tighten up the headset for a better fit, or loosen it to take the headset off without undoing the top strap.",
    "There’s also the new and improved cable that slims the triple-wire cord on the original Vive to a manageable single wire. If you don't want to shell out for the new $299 / £299 wireless adapter, it's perfectly fine.",
    "In the headset itself, you’ll find new rubber nose guards that prevent light from filtering in the crack between your nose and the headset, while a more durable, plushy foam pad cushions your face for more comfortable extended play sessions.",
    "On the front of the headset you’ll now find a second front-facing camera which will offer improved tracking for developers looking to make AR experiences.",
    "If there’s any downside to the HTC Vive Pro’s design it’s that the headset uses the same peripherals as the original HTC Vive, and that means no new controllers or base stations.",
    "In some ways, this is a potential cost-savings strategy for HTC and a boon for those of us who’ve already invested in the original Vive, as we can just carry over the hardware from the original headset.",
    "That said, at the same time using the HTC Vive Pro with the first-gen trackers and controllers can make the headset seem like a half-step upgrade rather than a fully-featured step-up from the original Vive. It’s a minor issue, obviously, and one that HTC will likely remedy sooner rather than later."
  ],
  "headers": {
    "9": "HTC Vive Pro: release date and price",
    "15": "HTC Vive Pro: design"
  },
  "links": {
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Rift": "https://www.techradar.com/reviews/gaming/gaming-accessories/oculus-rift-1123963/review",
    "a new HTC Vive headset": "https://www.techradar.com/news/htc-vive-successor-wont-rival-oculus-quest-2-when-it-launches-later-in-2021",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "the new $299 / £299 wireless adapter": "https://www.techradar.com/news/htc-vive-goes-wireless-from-september"
  }
}