{
  "source": "https://www.techradar.com/reviews/floorplanner",
  "title": "Floorplanner review",
  "category": "computing",
  "updated": "2021-10-07T08:00:05Z",
  "author": "steve-paris",
  "summary": "Design your room digitally effortlessly",
  "verdict": "Floorplanner is an excellent service with many options and features. The free service will satisfy most casual users, and the more you pay, the more features are open to you.",
  "pros": [
    "Works great",
    "Easy to use",
    "Intuitive",
    "Numerous customisation options"
  ],
  "cons": [
    "Some limitations with the free account, but that’s to be expected"
  ],
  "article": [
    "If you want to redesign one of your rooms, an entire floor, even a whole building, or plan how your furniture will fit in your new home, you can always get a pen and paper and start scribbling. But why not use your trusty computer to do most of the work for you?",
    "Floorplanner is an online service which caters for individuals and companies, and allows you to do just that. It’s web-based so you access it via your favourite browser, and best of all, if your needs are modest, it won’t cost you a thing.",
    "Beyond the free basic plan, you have various subscriptions open to you.",
    "Individuals are offered two. Plus, at $5 a month, removes any timelock on exports (more on that later), and allows you to build a library of favourite objects. You also get 4 credit each month. At $29 per month, Pro grants you the ability to create and reuse your own templates and collections, and also gets you 30 credits per month.",
    "Businesses have Team, Business and Enterprise at $59, $179 and $599 per month respectively. Obviously the more you pay, the more you get. For instance Team allows you to have up to 10 users per account. Business bumps that up to 100 and includes the ability to create custom 3D assets. And Enterprise has no team member limits, API access, and even volume discounts when purchasing credits.",
    "But what are all those credits?",
    "Credits let you perform actions on Floorplanner should you wish to grab yourself some upgraded features that aren’t normally available with your chosen package. This means that free accounts can also purchase credits and make use of features they wouldn’t normally get without paying each month, for instance, higher quality exports. You can also use credits to upgrade our project for instance, and this upgrade is for ever. By default a basic project only allows you to work on a single floor. Use two credits to go to Advanced, and get up to seven, for instance.",
    "We feel this is a good way to balance features and subscription without forcing your clientele to pay for something they might not need all the time.",
    "To sweeten the subscription deal however, credits cost less the higher up you go, with $1.25 per credit with a Free account, down to $0.70 for Enterprise.",
    "As you’d expect, you need to register and create an account prior to using the service. You can use your Google, Facebook or Apple ID, or if you’d prefer not being connected to those behemoths, your email address will do.",
    "Floorplanner encourages you to opt for their Wizard to speed up the starting process. Alternatively, if you know what you’re doing, you can also start with a blank slate.",
    "With Wizard you get to choose a shape for your room from one of six available. But it’s also possible to flip the design vertically and horizontally to give you a few additional variety.",
    "The next step is to customise all the room’s dimensions, creating a totally bespoke design, and to finish it off, you get to add a set of furniture to give your room that already furnished look, or start with an empty space instead. Oddly enough many templates appear to be doubled-up, but that didn’t distract from the process.",
    "Once done, you end up in the design stage, where you get to fine tune your work further. This is the same place as you would’ve got to with the other ‘blank slate’ option, except a lot of the work has already been done for you.",
    "The customisation options open to you are extensive. If we focus on the structural aspect first, mouse over any corner to reveal a large blue dot. Click and drag it to alter the walls’ angles relative to each other. As you do, the connected walls move, grow and shrink in response to your alteration. Want to move an entire wall? No problem: mouse over it and once it turns blue, drag it in or out to decrease or increase a room’s size respectively. If only real building work was that effortless!",
    "You can also add new angles to existing walls, cut one in two, or even turn your straight wall into a curved one. It’s pretty clear that whatever your room looks like, Floor Planner can recreate it for you digitally.",
    "Oh and you’re able to alter the ceiling height too.",
    "There are sections devoted to the most common structures in a room: doors and windows. You have 57 doors and 22 windows available in the free version, which should be more than enough to find the exact one for your needs. But that’s not all, you can also customise their width and height to the centimetre (feet and inches are also available if you prefer less precise measurements).",
    "But what about other structures? Floorplanner has you covered here as well. You can add stairs, fireplaces, ceiling fans, railings, fences, roofs, dormer windows, balconies, escalators (more useful in an office or retail setting, obviously), the list is impressive. And as with the doors and windows above, these can be customised exactly to fit your digital environment.",
    "If you're designing your room to be as accurate and possible, you have signs and symbols available to include specific objects, electrical points, gas connections, and a myriad of other options.",
    "Floorplanner has a vast library of furniture. Thankfully, it is broken down into a few categories, such as Living Room, Plants, Electrical, Garden, and Office to name but a few. But you’ll likely find what you’re looking for more easily via the search field. You can narrow down your results by colour, and also by brand when available.",
    "Like everything else, adding furniture is as easy as clicking and dragging. You also have access to all the item’s parameters, allowing you to alter its dimensions if the generic object you found does not exactly match what you wish to work with. One of these settings is “raise from floor” should you wish to place an object on top of another, but this is often better done in 3D view.",
    "All of this design work is done in 2D, as if you were working on a blueprint (in fact there is even an option to change the look of your work area to one resembling a blueprint). But this is hardly as fun as exploring your design in 3D, and Floorplanner has you covered on that front as well.",
    "With that feature selection, you can rotate around the room, pan and zoom, see it from the outside, through we windows, etc, simply by clicking and dragging your mouse. But your design isn’t static in this view: you are able to select items, rotate them, drag them around, even alter their elevation. In a way it’s more fun to rearrange the furniture in this view.",
    "There’s also a first person view which lets you interact with the room as if you were in it. The settings even allow you to alter the height of the camera, and hence, the viewer.",
    "When it comes to sharing your output with others, you can take 2D and 3D shots of your room. There is a drawback though: free accounts can only take a photo every ten minutes (this limitation is removed once you opt for a paid account, or by spending credits). However, nothing is stoping you from taking a screenshot of your page using your computer’s built-in “print screen” capability to sidestep this limitation (the quality won’t likely be as good, but it’s an option).",
    "Another advantage of going to a paid plan: the more you pay the higher the quality of the exported render.",
    "Floorplanner is an excellent online service, designed to help you create rooms and furnish them with great accuracy. Working with it is fluid and easy, and we didn’t observe any discernible glitches. The fact there’s a free option means many amateur designer will happily use it to configure a room, but there are limitations to that option. The more you pay, the more restrictions are lifted, leading to a versatile service that can cater to the individual and the busy businesses."
  ],
  "headers": {
    "2": "Plans and pricing",
    "9": "Getting Started",
    "14": "Customization",
    "17": "Structural",
    "20": "Objects",
    "22": "3D",
    "25": "Export",
    "27": "Final verdict"
  },
  "links": {
    "Floorplanner": "https://floorplanner.com/",
    "browser": "https://www.techradar.com/best/browser",
    "basic plan": "https://floorplanner.com/pricing/individuals",
    "Plus": "https://floorplanner.com/pricing/individuals",
    "Pro": "https://floorplanner.com/pricing/individuals",
    "Team": "https://floorplanner.com/pricing/companies",
    "Business": "https://floorplanner.com/pricing/companies",
    "Enterprise": "https://floorplanner.com/pricing/companies"
  }
}