{
  "source": "https://www.techradar.com/reviews/tbao-tbook-mn22-amd-ryzen-mini-pc-workstation",
  "title": "TBao TBook MN22 AMD Ryzen mini PC workstation review",
  "category": "computing",
  "updated": "2021-01-30T01:17:25Z",
  "author": "desire-athow",
  "summary": "Could this be the perfect entry level business computer right now?",
  "verdict": "The TBao MN22 is an excellent entry level workstation PC for those businesses looking for something small, very affordable and powerful. The cherry on the cake is its ability to drive two 4K monitors simultaneously.",
  "pros": [
    "Dual Channel",
    "Very solidly built",
    "Very affordable",
    "Can drive two 4K monitors",
    "Excellent overall performance"
  ],
  "cons": [
    "Only Bluetooth 4.1",
    "No Type-C port",
    "No card reader",
    "Can be noisy under load"
  ],
  "article": [
    "AMD has made massive inroads over the past 24 months as its archrival Intel failed to execute its plans, resulting in poor stock allocation and falling behind its nimbler competitor. Demand for AMD’s Ryzen has been so high that it is only recently that its older processors - based on the Zen architecture - are now hitting the market in smaller PC vendors in China.",
    "One of them, TBao, unleashed the TBook MN22 which happens to be a cheaper version of the MN25, a mini workstation PC we recently tested and which nabbed an Editor’s choice thanks to its exceptional value for money. How does the MN22 fare compared to the MN25? Let’s find out.",
    "The TBao TBook MN22 is available from online Chinese retailer Banggood for $290 at the time of writing. A cheaper version is available for $240 with half the onboard storage; it might be a better option for those looking for an absolute bargain.",
    "Barely bigger than a stack of CD boxes (128 x 128 x 51mm), the MN22 is a prime example of how laptop components have now found their way into desktop computers, a clear sign of economies of scale at work. The chassis is made of metal with a bit of plastic and plenty of air vents to help with cooling the internals.",
    "The bottom of the MN22 can be easily removed for easy access to the components (or for adding a hard disk drive/SSD) by removing four screws. Speaking of screws, you can also add a VESA bracket but you will need to screw it on.",
    "Elsewhere, at the back, there’s a barrel-type power port, a Gigabit Ethernet connector, one DisplayPort and a HDMI connector (both capable of displaying 4K content), two audio connectors and six USB ports, two of which are the USB 2.0 type.",
    "There’s no USB-C, no card readers, no Thunderbolt port (remember, it’s an AMD CPU) and no extra legacy ports (VGA, RS232 etc).",
    "It is intriguing that TBao chose one of the slowest AMD Ryzen processors around, the Ryzen 3 2200U, a dual-core, quad-thread processor that comes with the Vega 3 graphics and a low TDP, betraying its original market; laptops. This three-year old product is faster than any of Intel’s entry level non-Core quad-core processors (e.g. Celeron J4125) but would be narrowly defeated against the newer AMD Athlon Gold series.",
    "TBao added a pair of 4GB DDR4 memory modules to make the most out of the dual channel capabilities of the Ryzen processor; which is the absolutely right thing to do. Also included are a Realtek wireless radio chip delivering Bluetooth 4.1 and Wi-Fi 5, an ASInt AS806 256GB NVMe PCIe solid state drive, a 65W power supply unit, Windows 10 and even a spare 2.5-inch slot to take on a SATA drive (SSD or HDD).",
    "The Ryzen that powers the MN22 is still a very capable dual-core processor, easily outflanking quad-core rivals usually found at this price point. Its graphics and storage subsystems are to be commended as they help the MN22 reach some spectacular system test results.",
    "CrystalDiskMark scores were the highlight at 1.95 and 1.18GBps respectively while its Cinebench result placed it above the Core i3-1005G1, a more recent Intel processor, a notable feat. Needless to say that it pulverizes everything in this price range, effortlessly matching more expensive business PCs or entry level workstations. Note that the device can be quite noisy under load.",
    "The MN25 remains the most potent rival of the MN22 despite costing $60 more at the time of writing. The extra premium goes straight into upgrading the processor to a far more powerful Ryzen 5 2500U, which is about 80% faster thanks to four cores.",
    "Now if sheer performance is what you’re after, then for about the same outlay, Dell sells the Inspiron 3880. It lacks a DisplayPort connector, has half the onboard memory, a much bigger footprint, and a spinning hard disk drive. What makes it so special then? Well other than the fact that it comes with a 12-month McAfee LiveSafe subscription, it has onsite assistance - great for small and medium businesses, plus a legacy VGA port, a card reader and its processor, the Intel Core i3-10100, is more than twice faster than the MN22.",
    "The Lenovo IdeaPad Flex 5 is also an interesting candidate, a statement of how even laptops are now competitive with desktop PCs. It costs $329 at Walmart and while it has only half the memory and onboard storage, it does have a far faster processor (Ryzen 3 4300U), a 14-inch full HD touchscreen monitor and whatever you’d come to expect from a laptop (battery, keyboard, touchpad, speakers etc). Sure, you won’t get as many ports as the MN22 but the IdeaPad Flex 5 offers a reasonably attractive alternative to a bog standard desktop PC.",
    "There’s a lot to be liked about the MN22; It is compact, it is quick and it is very affordable. Overall, a very well balanced product, especially if you are buying the cheaper 128GB version. None of the issues we raised are deal breakers: the lack of a USB-C and a card reader are easily remedied using adaptors.",
    "We’re more excited by the dual memory channel configuration, the excellent storage subsystem performance and the fact that you can drive two 4K monitors, something that should be highlighted. Put it simply, you can’t get a better system for your money. Sure, the aforementioned Dell Inspiron desktop PC has a much faster CPU but that doesn’t make it a better system because it is hobbled by a pathetic HDD and an equally pathetic amount of system memory."
  ],
  "headers": {
    "2": "Pricing and availability",
    "3": "Design",
    "7": "Hardware",
    "9": "Performance",
    "11": "Competition",
    "14": "Final verdict"
  },
  "links": {
    "MN25": "https://www.techradar.com/reviews/tbao-mn25-amd-ryzen-mini-workstation-pc",
    "TBao TBook MN22": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-3863492497802253300&ulp=https%3A%2F%2Fwww.banggood.com%2FT-Bao-TBOOK-MN22-Mini-PC-AMD-Ryzen-3-2200U-8GB-DDR4-256GB-M_2-NVME-SSD-Desktop-PC-Dual-Core-Radeon-Vega-3-Graphics-2_5GHz-to-3_4GHz-DP-HD-4K-Dual-WiFi-p-1732788.html%3Fcur_warehouse%3DCN%26ID%3D47184%26rmmds%3Dsearch",
    "Inspiron 3880": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1131556318085578600/https://www.dell.com/en-us/member/shop/desktop-computers/inspiron-desktop/spd/inspiron-3880-desktop/nd3880eejis",
    "Lenovo IdeaPad Flex 5": "https://www.techradar.com/reviews/lenovo-ideapad-flex-5"
  }
}