{
  "source": "https://www.techradar.com/reviews/renpho-smart-body-fat-scale",
  "title": "Renpho Smart Body Fat Scale review",
  "category": "fitness",
  "updated": "2021-10-07T15:39:18Z",
  "author": "rob-clymo",
  "summary": "Take a smarter look at your weight with the Renpho Smart Scale",
  "verdict": "Our increasing desire for better data, especially when it comes to monitoring our health and fitness, makes the Renpho Smart Body Fat Scale a must-have. It’s quick and easy to set up, very accurate, and delivers much more than just your weight as a number thanks to a power-packed supporting app. It’s nicely put together, feels very durable for something with a tempered glass upper surface, and deserves pride of place in your bathroom rather than being hidden away behind the toilet gathering dust. Crucially, the Renpho Smart Body Fat Scale allows anyone keen to take a deeper dive into their weight and associated health stats the ability to do it as often as they like while building up a bigger picture scenario. All thanks to the app’s ability to catalog lots of data over time.",
  "pros": [
    "Very precise readings",
    "Excellent supporting app",
    "Nicely designed and built"
  ],
  "cons": [
    "Works to best effect with the app",
    "Glass top (albeit tempered)",
    "Requires batteries"
  ],
  "article": [
    "Anyone looking for a quick and easy way to monitor their weight will love the Renpho Smart Body Fat Scale. Not only does it make something of a style statement, this tempered glass and plastic smart scale is wonderfully accurate, allowing precise calibration in a couple of seconds and providing very accurate weight readings from there on. You’ll get pinpoint readings in increments of 0.2lb/0.05kg right up to a total 396lbs/180kg maximum weight capacity.",
    "Renpho matches the precision of its digital scales with its app, which (once paired with the hardware via Bluetooth) can provide owners with up to 13 different measures.",
    "Renpho has also designed everything so you can use it in tandem with the likes of Apple Health, Samsung Health, Google Fit and Fitbit too. It’s therefore a great option if you’re serious about monitoring your weight and everything that goes with it.",
    "We tried the Renpho Smart Body Fat Scale in its Basic incarnation, the ES-CS20M-B, which features 3 AAA batteries and has a RRP of $27.99 on Amazon in the US or £37.99 on Amazon UK. That makes it one of the cheapest smart scales we've tested to date, around the same price as the Eufy Smart Scale C1 and Xiaomi Mi Body Composition Scale 2.",
    "There’s also a lithium battery edition, the ES-30M. Both models come with a black finish. Alternatively, check out the ES-32MD model if you want the Renpho Smart Body Fat Scale in white.",
    "Bathroom scales have been around forever and, frequently, sit in a corner of the smallest room hidden from view and gathering dust. Not so the Renpho Smart Scale as it’s one of a new breed of bathroom scales that actually looks very cool.",
    "The scale arrives in a pizza-shaped box containing the scale, three AAA batteries to power it and a very small, minimalist manual. Renpho advises that you download the supporting app where you can take a deeper dive into its innermost workings.",
    "This is a smart scale that feels like a quality purchase, and comes finished in classic black. The platform is made of tempered glass with four metal circles embedded. These contain electrodes that gather your weight data when you’re standing on the unit. There’s a red LED display that shows your weight, while the batteries fit into a slot on the underside. Also underneath are four feet with moveable anti-slip rubberized pads so that it sits firmly on a hard surface.",
    "Its dimensions are 28cm/11-inches by 2.54cm/1-inch, which is about standard for a smart scale. Overall the design looks great and the build quality suggests that the Renpho Smart Scale should last you a while, assuming you keep it plied with batteries.",
    "It’s easy to pick up and put away, weighing in at 2.86lb/1.29kg, although if you’ve got a decent-sized bathroom the overall appearance is so good you may well want to leave it on display. While the scale itself is slick, stylish and minimalistic it’s the accompanying Renpho app, which connects via Bluetooth, where things get rather more interesting. Renpho has developed software that delivers a lot more than the dusty old scale you might be used to. It's nicely designed and proves to be the perfect accompaniment to the scale.",
    "Renpho has created its app (available for iOS and Android) to let you get much more from your scale. For starters, it can work in tandem with Apple Health or Google Fit as well as Samsung Health and Fitbit. That’s great news if you’re serious about your health and fitness, while even if you only have a casual or passing interest in managing your weight these options do allow you much better monitoring of how things are looking.",
    "Better still, the app lets you to do this over time too, so you can see the bigger picture. It makes a lot of sense. In fact, the app is quite good at drawing you in and taking more interest because of the fascinating insights it delivers.",
    "For example, the Renpho app doesn't just give you your weight because on top of that it’ll also offer up information of 13 areas of your personal health. This includes body mass index (BMI), body fat, subcutaneous fat, visceral fat, body water, skeletal muscle, muscle mass, bone mass, protein, metabolic age, BMR (basal metabolic rate) and fat-free weight.",
    "Making it more appealing is the ability to set goals and subsequently track your progress. This is invaluable if you’re looking to shed a little weight on a casual basis, or send a lot of it packing via a regime of regular workouts.",
    "Another benefit of the Renpho app is that it’s possible to create different profiles, so that the scales will offer personalised data sets to whoever steps on it within your family circle. In the time we’ve been trying it the Renpho Smart Scale and app pairing has provided us with some really useful data, which obviously maps your progress from days into weeks and even years if you’re prepared to stick with it.",
    "One point to note is that you may need to recalibrate the unit if it’s moved or turned upside down. This is easily done by stepping onto the scale with one foot and allowing it to reset itself.",
    "Overall, we found the Renpho Smart Scale and app combination very impressive. We’ve also been impressed by the Athlete mode on the app, which delivers those more in-depth stats if you’re someone who exercises regularly.",
    "First reviewed October 2021"
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and release date",
    "5": "Design",
    "10": "Performance",
    "18": "Don't buy it if"
  },
  "links": {
    "smart scale": "https://www.techradar.com/best/best-smart-scales",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "$27.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FRENPHO-Bluetooth-Bathroom-Composition-Smartphone%2Fdp%2FB01N1UX8RW%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4993836352728268000-20",
    "£37.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FRENPHO-Bluetooth-Bathroom-Composition-Smartphone%2Fdp%2FB01N1UX8RW%2Fref%3Dasc_df_B01N1UX8RW%2F%3FlinkCode%3Ddf0%26hvadid%3D309889597107%26hvpos%3D%26hvnetw%3Dg%26hvrand%3D8292365777619634842%26hvpone%3D%26hvptwo%3D%26hvqmt%3D%26hvdev%3Dc%26hvdvcmdl%3D%26hvlocint%3D%26hvlocphy%3D9045717%26hvtargid%3Dpla-348268313242%26psc%3D1%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-4262968295246937000-21",
    "Eufy Smart Scale C1": "https://www.techradar.com/reviews/eufy-smart-scale-c1",
    "Xiaomi Mi Body Composition Scale 2": "https://www.techradar.com/reviews/xiaomi-mi-body-composition-scale-2",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9590541590001578000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Frenpho%2Fid1219889310",
    "Android": "https://play.google.com/store/apps/details?id=com.qingniu.renpho&hl=en_GB&gl=US"
  }
}