{
  "source": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
  "title": "Apple Mac mini (M1, 2020) review",
  "category": "computing",
  "updated": "2021-12-01T15:05:57Z",
  "author": "matt-hanson",
  "summary": "Small, but with big ambitions",
  "verdict": "The Mac mini (M1, 2020) updates Apple's cult Mac with its latest M1 hardware. For many people, this is exciting, as it means the Mac mini no longer feels like it's being neglected by Apple; however, it does come with a few compromises that not everyone will like.",
  "pros": [
    "Same lovely design",
    "Very good performance",
    "M1 hardware has potential"
  ],
  "cons": [
    "Can't use eGPUs",
    "Maximum of 16GB memory"
  ],
  "article": [
    "If any Apple product needed an update, it was its smallest desktop computer. And, with the Mac mini (M1, 2020), the company not only did that but set the bar high for future iterations, especially considering Apple’s claims that its CPU performance is three times faster and GPU performance six times faster than the previous Mini.",
    "What makes this update so special is the introduction of Apple’s in-house M1 system on a chip (SoC) which not only debuted with the Mini but with the MacBook Pro 13-inch (M1, 2020) and MacBook Air (M1, 2020) notebooks. This Mac mini might be just as slim as its predecessor but it is a powerful machine, compiling Xcode up to three times quicker than the prior model, rendering Final Cut Pro projects, and even running intensive games.",
    "Since the Mac mini has developed a following over the years, its fans have surely been excited by the inclusion of the M1 chip in this model. And, considering how much performance has come out of such a small computer since its introduction, we’re pleased with the extra power that the M1 model has. It continues to be among the most versatile options in Apple’s computing line.",
    "The Mac mini is also one of the most unusual devices from Apple, which is what makes it special but is probably why it often gets ignored by the company. Though we had a refresh just a few years back with the Mac Mini (2018), that refresh was four years in the making. So, it’s nice to get such a substantial update, not to mention seeing the macOS 11 Big Sur operating system on display in the Mac mini 2020. Don’t forget there’s a new OS you can upgrade to for free, the macOS Monterey, if you want to make the most of the Mini.",
    "When it comes to price, Apple is asking for $699 / £699 / AU$1,099 for the model with 8GB of RAM and 256GB of storage. This is actually cheaper than the base model of the Mac mini 2018, so to see a performance boost for less money is really impressive.",
    "And, it really has got a performance boost. Even though the M1 chip that powers the Mac mini is Apple's first chip for a desktop PC, it's really knocked it out of the park. This tiny little PC feels fast and responsive, and it was able to punch above its weight when it came to intensive video rendering tasks.",
    "However, we should note that the move to the M1 chip means the memory is capped at 16GB, and you can no longer use external graphic cards (eGPUs). This will disappoint anyone who needed to upgrade their Mac mini.",
    "Overall, the Mac mini (M1, 2020) is an impressive bit of kit, with Apple’s latest hardware and software taking center stage. It’s great to see Apple embracing its quirky little PC, and using it as a showcase for its M1 hardware in a desktop PC.",
    "In many ways it continues to offer what we love so much about the Mac mini: it has a compact, attractive design, with some great components inside, and the ability to run legacy Intel apps, along with M1 apps and iOS apps, is genuinely exciting.",
    "However, for people who want a productivity machine, the fact that the Mac mini no longer supports eGPUs will be a major disappointment. Sure, most owners will never use one, but this is a PC that's developed a cult following amongst video editors and photographers thanks to its scalability via eGPUs. With that feature now missing (and memory limited to 16GB), the Mac mini (M1, 2020) may not offer everything that more demanding users need.",
    "The Mac mini (M1, 2020) is on sale now globally, and starts at $699 / £699 / AU$1,099 for the model with 8GB of RAM and 256GB of storage.",
    "There's also a model with 8GB RAM and 512GB storage space for $899 / £899 / AU$1,399. Both of these have the same M1 chip with an 8-core CPU and 8-core GPU, which is the same chip as the one in the Apple MacBook Pro 13-inch (M1, 2020).",
    "Both models can be further configured to offer up to 16GB of unified memory and up to 2TB of SSD storage.",
    "The base model is also cheaper than the 2018 Mac mini, which started at $799 (£799, AU$1,249), so you’re getting drastically improved hardware for less money. It’s good to see Apple get competitive with pricing, as compact desktop PCs from competitors like Zotac and Intel often cost a lot more – although they are usually more customizable.",
    "Like the MacBook Air and MacBook Pro 13-inch, the Mac mini (M1, 2020) keeps the same design as its predecessor.",
    "With dimensions of 1.4 x 7.7 x 7.7 inches (3.6 x 19.7 x 19.7cm), the Mac mini (M1, 2020) is exactly the same size as the Mac mini (2018), though its weight of 2.6 pounds (1.2kg) is slightly lighter than the 2018 model, which weighed in at 2.9 pounds (1.3kg).",
    "We've criticized Apple for not innovating with the design of the MacBook Air (M1, 2020) and MacBook Pro 13-inch (M1, 2020), but in the case of the Mac mini we feel a bit more relaxed about the fact that its design hasn’t changed significantly.",
    "That’s for two reasons. First, the look and feel of the Mac mini isn’t as big a deal as it is with Apple's laptops. As a desktop PC, the Mac mini is designed to be placed unobtrusively on a desk or behind a monitor; and as long as a desktop PC works well, it shouldn’t matter too much what it looks like.",
    "Laptops, on the other hand, are far more tactile devices. You’ll be carrying them around, and working on the actual devices themselves, so the look and feel is a lot more important – and, whether or not you think it's a good thing, many laptops have become status symbols.",
    "The second reason is that, while the MacBook Air and MacBook Pro’s designs have been outclassed by competitors like Dell and HP, the Mac mini remains one of the nicest small-form-factor PCs ever made. We’re not sure that the MacBook designs fit the “if it isn’t broke, don’t fix it” ethos, but the Mac mini’s certainly does.",
    "There is one slight design change, though, as the M1 Mac mini comes in a new color: Silver. This is lighter than the Space Gray color of the Intel model, and it’s a handy way of differentiating between the two, although if you prefer the Space Gray look (and to be honest, we do), it's not an option with the Mac mini.",
    "So, you’re still getting a great-looking compact desktop PC that will fit on any desk with ease. Port-wise you get Ethernet LAN, two Thunderbolt ports, HDMI, two USB and an audio jack for headphones. Thanks to the M1 chip, the Mac mini can now support up to two displays (one with up to 6K resolution at 60Hz connected via Thunderbolt, and one with up to 4K resolution at 60Hz connected via HDMI 2.0).",
    "It’s worth pointing out that the Mac mini (M1, 2020) doesn’t come with a mouse or keyboard (nor a monitor), so you’ll need to buy these separately.",
    "If you were worried that the move from Intel hardware to its own silicon would be a blow to the Mac mini's performance, you needn't have worried. The Apple Mac mini (M1, 2020) performs incredibly well, with macOS Big Sur running smoothly. We tested a few native and legacy apps (Apple’s Rosetta 2 tool allows you to continue to run older apps without any major issues), and they ran well – you wouldn't notice that some of them are not running natively.",
    "The fact that you can run older Mac apps on the Mac mini (M1, 2020) is commendable, and with the M1 chip allowing iOS apps to be installed as well, it means the Mac mini continues to be a very versatile little PC.",
    "The big selling point for the Mac mini (M1, 2020) is the inclusion of the Apple silicon M1 system-on-a-chip, an 8-core chipset that combines the CPU, I/O, security and more into one.",
    "Apple is making some big claims here, promising that the M1 will offer the world's best CPU performance per watt. The M1 has an 8-core CPU consisting of four high-performance cores and four high-efficiency cores to balance workloads, which Apple claims will enable it to process tasks nearly three times faster than the chip in the previous Mac mini.",
    "Gaming performance is also said to be greatly improved. If (for some reason) you chose to game on your previous Mac mini, the M1-powered Mac mini will play graphically intensive games with up to four times higher frame rates. We dabbled with a few games, both downloaded through Steam, as well as some iOS games from the App Store, and as long as you don't mind tweaking a few settings for the Steam games, you'll get some ok results. The Mac mini certainly isn't a gaming PC, however. It feels much more at home playing iOS games, and these days many of them are graphically impressive and complex games, even though they are designed for iPhones and iPads.",
    "Meanwhile, in good news for graphics designers and videographers, rendering in Final Cut Pro is also promised to be up to six times faster than on previous models.",
    "In our real world tests, the Mac mini did very well, and our benchmark tests also showed just how good this little PC is. In the multi-core Cinebench R23 test, the M1 chip scored an excellent 7,755 points. This put it above the powerful 12-core Intel Xeon X5650, and offers a seriously impressive level of performance.",
    "While performance was on the whole very good, there are reasons why you may want to go for the Intel Mac mini over the M1 version. Unlike with the MacBooks, Apple is still selling its Intel-based mini, and in some ways it could offer better performance than the M1 model.",
    "First of all, while the Mac mini (M1, 2020) can be configured with up to 16GB of unified memory, the Intel version can pack up to 64GB of RAM; and not only is this a lot more, it’s also not unified. The Mac mini (M1, 2020)’s unified 8GB or 16GB of memory is shared between the CPU and GPU, and this has benefits, as Apple argues that the “unified memory architecture gives the CPU, GPU, and Neural Engine access to the same pool of superfast memory”, so data stored in the memory can be transferred between the CPU and GPU without any of the traditional overhead.",
    "However, this could also lead to some issues. First of all, it looks like the M1 chip may have a limit of 16GB, as none of the M1-toting Macs come with more memory than that. Unlike modular memory, it won’t be as easy for Apple to add more.",
    "Also, if there’s a task that’s using up a lot of memory on the graphical side of things, that could have repercussions for CPU performance.",
    "Another thing to note is that with previous models of the Mac mini you could connect up an external graphics card (eGPU), to add extra graphical firepower, and this was a popular choice with video editors and 3D animators; however, you can't use eGPUs with the Mac mini (M1, 2020).",
    "This will be a blow to those who need that extra graphics oomph, as it means you’re stuck with the integrated graphics of the Mac mini (M1, 2020) – and if you've invested in an eGPU then you won’t be able to use it with the model. It makes the Mac mini (M1, 2020) a slightly less versatile machine than its predecessors, which is a shame.",
    "However, the M1 chip did put in a good graphical performance. We've already touched on the fact that it can handle some games, but when it comes to video editing we were very impressed, with the PC able to handle a complex 8K project in Final Cut Pro. Along with having multiple apps open at once, this is a plucky little PC that really does impress when it comes to performance.",
    "One thing we should note, is that throughout our tests the Mac mini stayed virtually silent. You could easily hide it away and forget it was even on."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Price and availability",
    "14": "Design",
    "23": "Performance",
    "38": "Don't buy it if..."
  },
  "links": {
    "M1 system on a chip (SoC)": "https://www.techradar.com/news/apple-m1-chip",
    "MacBook Pro 13-inch (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "MacBook Air (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Mac Mini (2018)": "https://www.techradar.com/reviews/apple-mac-mini-review",
    "macOS 11 Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "macOS Monterey": "https://www.techradar.com/reviews/macos-12-monterey-review"
  }
}