{
  "source": "https://www.techradar.com/reviews/cosori-cp137-af",
  "title": "Cosori CP137-AF review",
  "category": "appliances",
  "updated": "2021-05-10T15:06:30Z",
  "author": "sophie-bird",
  "summary": "We put the Cosori CP137-AF air fryer through its paces",
  "verdict": "The Cosori CP137-AF air fryer is good value for money and packs a lot of features into one machine. It has 11 presets, and operates quietly so it won’t be a nuisance, but with a 3.7-quart/ 3.5-liter capacity, it’s not the biggest on the market.",
  "pros": [
    "Good value for money",
    "Great range of functions",
    "Quiet in operation"
  ],
  "cons": [
    "Overcooks slightly on presets",
    "Only suitable for small households",
    "Homemade fries weren’t very crispy"
  ],
  "article": [
    "The Cosori CP137-AF has plenty of users raving about it, so we wanted to put it through its paces to see if it lives up to the hype - and to find out if it’s a contender for the best air fryer around.",
    "Air fryers offer speedy cooking times by circulating hot air around a frying basket that has holes in it. The holes allow the hot air to reach the sides of the food you place inside, so you’ll end up with a crispy finish on everything from chicken wings to sweet apple wedges.",
    "This model has a 3.7-quart / 3.5-liter capacity, so it’s not the biggest model on the market, but it does offer a generous 11 presets, meaning that whatever you’re cooking you can simply place your food inside the frying basket, press a button, and let the machine do the rest (as with most air fryers you’ll need to shake your food halfway through its cooking time).",
    "If you’re looking for flexibility, you can adjust the temperature in five-degree increments, and set the timer with ease.",
    "The Cosori CP137-AF is one of the brand’s most affordable air fryers, and it’s available in the US, UK, and Australia via Amazon. As mentioned it’s not the largest air fryer on the market, but if you’re happy to spend a bit more Cosori also sells the 5.8-quart / 5.5-liter Air Fryer Max XL for $99.99 / £89.99 / AU$149.56.",
    "The design and overall appearance of an air fryer are going to be important factors if you plan on keeping the appliance on your countertop. This Cosori machine has a simple yet stylish black finish, with a touch-control panel on the front, directly above the frying basket drawer.",
    "It has a 3.7-quart/ 3.5-liter capacity which in turn means the overall machine is smaller than other popular choices including the Instant Vortex Plus air fryer. It measures 31 cm in length, 27 cm wide, and is 27 high, meaning it’s not as tall as many other air fryers at 31cm, so it should fit on your countertop beneath cabinets.",
    "On the back of the air fryer is a vent through which hot air is expelled during the cooking process, so when positioning the machine you’ll need to allow room for this to work properly. The sides of the Cosori do get slightly warm when this machine is working, although it’s certainly not hot enough to burn you or damage nearby appliances.",
    "The Cosori CP317 has 11 preset buttons on its control panel which cover everything from a preset for cooking chicken to keep warm and preheat functions. Once you press the desired button, the temperature and cooking duration will automatically be set for the type of food you’re cooking – and if there isn’t a preset for what you’re making, the air fryer comes with a recipe book with suggested timings for a wide range of foods.",
    "Most air fryers require you to shake your food during the cooking process to make sure the food is evenly cooked, and to help know when to do this, the Cosori features a shake alarm. This will sound halfway through the cooking time, but it’s not switched on automatically, so you will need to select it from the touchscreen menu.",
    "The frying basket has a non-stick coating and slots into a removable tray. Both of these pieces are suitable for placing in the dishwasher, but we found they were also super-easy to wash by hand, as little to no food had stuck to the basket itself.",
    "We tested the Cosori CP317 with a variety of foods, making use of the preset buttons as well as setting customized timings and temperatures. We tried frozen fries first and used the preheat function, which took five minutes, before placing 1.1lb / 500g of frozen fries into the frying basket. While this isn’t the biggest air fryer on the market, it coped well with this fairly generous portion of fries, with the basked not appearing to be overfilled.",
    "There’s a preset function for cooking frozen fries that takes 15 minutes, so after selecting that we switched on the shake alarm and left the machine to it. At the halfway point, the shake alarm sounded, and we duly removed and shook the basket, but we also checked the fries again at the 12-minute mark and they were evenly browned. Trusting the Cosori to know best, we left the fries to cook for the full 15 minutes before we took them out. All of the fries had a decent color, but some looked slightly overdone in places, although these didn’t taste burnt. The outer shells of the fries were crisp, while the inside was lovely and fluffy, and full of flavor.",
    "Next we tried chicken wings, and we were very impressed with the results. No cooking oil was needed, with the natural fats in the chicken sufficing, and the skin was delightfully crisp, while the chicken was so tender it almost fell off the bone. The wings were cooked evenly, with the skin showing a nice coloring all the way around. The excess fat dripped through the frying basket to the larger tray below, which meant cleaning up took just minutes. One thing to note, however, was that despite us not adding any extra oil, the chicken wings released strong cooking smells through the vent.",
    "One of the biggest benefits of air frying is that you don’t need to use lots of oil, and we also made a batch of homemade fries using 1 tbsp/ 15ml of olive oil, following the recipe book’s recommended cooking duration and temperature. After 18 minutes the fries were cooked, but some had burned a little on the ends. When we tasted the fries, and while few were crunchy and tasted overdone, others were soft. We made sure to shake the fries halfway through the cooking process, so it was a little disappointing to find they weren’t very evenly cooked.",
    "The Cosori did an excellent job of cooking sausages and vegetarian sausages, all of which had a lovely crisp finish without the insides being overcooked. We also tried sweet potatoes using the recipe book’s suggestion - these were cooked through, but they could have done with an extra 10 minutes to give them a nice crispy coating.",
    "We were impressed by how quietly this air fryer operates – at 61 decibels it’s about equivalent to background music, so it really isn’t noticeable or disruptive."
  ],
  "headers": {
    "4": "Cosori CP137-AF air fryer price and availability",
    "5": "Design",
    "11": "Performance",
    "17": "Don’t buy it if…"
  },
  "links": {
    "best air fryer": "https://www.techradar.com/news/best-air-fryer",
    "Instant Vortex Plus air fryer": "https://www.techradar.com/reviews/instant-vortex-plus-air-fryer-review"
  }
}