{
  "source": "https://www.techradar.com/reviews/realme-gt-neo-2-review",
  "title": "Hands on: Realme GT Neo 2 review",
  "category": "phones",
  "updated": "2021-11-15T13:23:52Z",
  "author": "tom-bedford",
  "summary": "Neo phone, who dis",
  "verdict": "The Realme GT Neo 2 is a solid budget phone, with a powerful chipset and a good-looking display, but it misses out on some of the top features of the standard GT like its top hand-feel and super-advanced processor. It’s very similar in most ways though, even down to the bright rear broken up by a black stripe.",
  "pros": [
    "Powerful device",
    "Distinctive design"
  ],
  "cons": [
    "Lots of bloatware",
    "Too big for comfort"
  ],
  "article": [
    "We’re a little surprised Realme is launching the GT Neo 2 globally, to be honest - the original GT Neo didn’t come west, and there's no GT 2, making this the third member of the series after the original Realme GT and the Realme GT Master Edition.",
    "So the Realme GT Neo 2 sits differently in the company’s range in Europe to how it does worldwide; this could lead to confusion for loads of people in the west who are still struggling to work out which members of the GT line are, and aren’t, available to them.",
    "Either way, this is a solid low-cost Android phone, which has some key changes from the original Realme GT but a clear common design theme. This is a bigger phone than the others in the GT family, both in its body size and weight - this affects the hand-feel, as does the fact that it has a glass back unlike the optionally faux-leather original.",
    "We’ve tested the phone for a few days, and pending a full review, here are our initial thoughts and feelings on the device.",
    "At the time of writing, we don’t have the Realme GT Neo 2’s price in the UK or Australia, and given Realme’s track record it won’t come to the US at all, but we have the cost in euros.",
    "In Europe, the Realme GT Neo 2 starts at €450 (roughly £380, $520, AU$700) for 8GB of RAM and 128GB of storage, and €550 (around £470, $630, AU$850) for 12GB of RAM and 256GB of storage.",
    "Notably, that makes it the same price as the original Realme GT, at least for the 8GB / 128GB version, though the GT didn’t come in a 12GB / 256GB model in most regions. The main trade-offs between the phones are that the GT has a smaller display and battery but a more powerful processor and cleaner software. The cameras are the same.",
    "The Realme GT Neo 2 is a rather bulky phone - while it’s clearly a GT phone in terms of looks alone, in the hand it definitely seems to have a hint of Redmi DNA.",
    "The handset is bigger than most other GT devices, as while their display sizes hover around the 6.4-inch mark, the Neo 2 stretches up to 6.62 inches diagonally - and ‘stretch’ certainly is the right word, because it’s harder to get your hand around this device as a result of its bigger body.",
    "The handset weighs 200g, which is a fair amount for a smartphone, and the back is glass instead of faux leather like you could optionally get the GT in (though that phone had a glass model too) - these factors combine with the bigger display to make the handset feel substantially heftier than its predecessors.",
    "One of our favorite aspects of the Realme GT was its great hand-feel, as the device wasn’t too big and the faux leather rear felt great to grip. By losing both these perks, the GT Neo 2 isn’t as comfortable to hold.",
    "If there is one clear common point the GT Neo 2 has with the GT, it's the appearance, with a vibrant green rear broken up by a jet-black racing stripe (the GT we tested was yellow, but was similar otherwise).",
    "Well, that’s the GT Neo 2 that Realme is plastering on its promotional materials, and that we tested, but pure blue and black versions are also available.",
    "The phone has a USB-C port but no 3.5mm headphone jack. There’s a power button on the right edge and a volume rocker on the left one, and on the back three rear cameras and two LED flash modules are housed on a slightly protruding bump.",
    "A design feature we should point out is the in-box case - while most phones come packaged with cheap-feeling see-through silicon shells, the GT Neo 2 comes with a tougher protector that means you probably won’t need to buy a separate case.",
    "The screen, as we said, is 6.62 inches diagonally - it has a 1080 x 2400 resolution and a 120Hz refresh rate, with support for HDR10+ and a high max brightness of 1300 nits.",
    "We did a small stint of gaming in our initial testing, and found the display looked good for this, especially with the max brightness and refresh rate complementing the device. It also made the already-vibrant user interface design really pop.",
    "The screen is broken up by a punch-hole cut-out for the front-facing camera - it’s pretty small, and didn’t disrupt the viewing experience much.",
    "The Realme GT Neo 2 has the exact same cameras as the GT, right down to the same sensors and lenses.",
    "That means there’s a 64MP main, 8MP ultra-wide, 2MP macro and 16MP selfie camera. In our Realme GT review we were impressed by the main and ultra-wide cameras, but found the macro a bit redundant and missed the presence of a telephoto snapper for zoom shots.",
    "Our short time testing the GT Neo 2 resulted in fairly similar results to those from the original GT, as you’d expect given the hardware similarities. It’s possible that some software tweaks have been introduced, but we’ll need to test out the phone for longer to find out.",
    "The battery here is 5,000mAh, which is a bit bigger than the ones in the other GT phones, and we’d hope the device easily lasts a full day of use with this, though that’s something we’ll need to test out further.",
    "We’re not super hopeful though, given the battery drain during our hours of testing. Saying that, phones often take a while to even out their power distribution after being set up, as they download all the apps and updates, so when the power consumption evens out we’ll update this review.",
    "Charging is done at 65W, and according to Realme it’ll take 36 minutes to power up the phone to full, and as 65W is pretty fast, it seems likely that this is correct. We’ll get our stopwatch ready for our full review.",
    "The choice of chipset in the Realme GT Neo 2 is a curious one - it uses the Snapdragon 870, which is the most powerful processor found in low-cost devices, though it’s not as fast as the Snapdragon 888 which the Realme GT had.",
    "As a result, the phone is pretty powerful, making it great for gaming, and titles loaded quickly and could render top graphical options. For most games, it’s all you’ll need - and unlike the 888, it doesn’t overheat after even a short stint of gaming.",
    "We had the hard task of testing the phone’s gaming power out, and so tested a few different titles, and can confirm it plays games great.",
    "This processor is paired with 8GB or 12GB of RAM and 128GB or 256GB of storage space - the smaller options will be enough for most people, though prolific gamers might notice the boost that 12GB of RAM gives.",
    "The device runs the Android 11 operating system, with Realme UI 2 laid over the top. We were startled with how many pre-installed apps were on the device when we booted it up: Netflix, Facebook, Amazon Shopping, Prime Video, Amazon Music, Booking.com, Twitter, LinkedIn and PUBG Mobile were all already on the device, along with the expected pre-installed apps like a calculator, game mode, recorder and compass.",
    "We had to go through a deleting spree when setting up the phone to remove quite a few of these apps that we never use; not only that, but part-way through our testing the phone received an update, and TikTok and AliExpress got added too. Previously, Xiaomi’s MIUI has been the worst Android fork for bloatware, but Realme UI is seemingly making a claim for that title.",
    "Otherwise, Realme UI has a fair few customization options, and it felt fluid to navigate because of the processor, the RAM and the 120Hz display.",
    "We can’t help but feel the Realme GT Neo 2 doesn’t quite compare to the original GT - that device felt better in the hand, was more powerful, and cost roughly the same amount, and given the choice between them, we’d buy the GT. Oh, and the Neo 2 seems to somehow have even more bloatware than its predecessor.",
    "Some people might find the Neo 2 preferable though - its Snapdragon 870 isn’t as prone to overheating, and the bigger display will be more useful for gaming and streaming media.",
    "Stay tuned for our full review at some point soon, when we’ll be able to give a full verdict on the phone and how it compares to other similar mobiles."
  ],
  "headers": {
    "4": "Realme GT Neo 2 release date and price",
    "7": "Design and display",
    "18": "Cameras and battery life",
    "24": "Specs, performance and software",
    "31": "Early verdict"
  },
  "links": {
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "Realme GT Master Edition": "https://www.techradar.com/reviews/realme-gt-master-edition-review"
  }
}