{
  "source": "https://www.techradar.com/reviews/huawei-watch-3",
  "title": "Huawei Watch 3 review",
  "category": "wearables",
  "updated": "2021-11-28T19:23:18Z",
  "author": "cat-ellis",
  "summary": "A sleek smartwatch that excels at fitness tracking, and has potential to do much more",
  "verdict": "The Huawei Watch 3 is the first smartwatch to run HarmonyOS, and it's an excellent showcase for the new operating system. Performance is extremely smooth, and the super sharp AMOLED display really shows off what the software has to offer. There's an impressive selection of workout tools pre-installed, but the Watch 3 can't yet compete with the likes of Apple and Google when it comes to additional apps. The lack of third-party tools is a shame, but this should improve over the coming months. This is a smartwatch with a lot of potential, even if it can't fulfil it all just yet,",
  "pros": [
    "Bright, high-res AMOLED display",
    "Reliable GPS tracking",
    "eSIM compatibility",
    "Time-saving voice controls"
  ],
  "cons": [
    "Limited app availability",
    "Heart rate monitoring sometimes inaccurate",
    "Sleep tracking needs work"
  ],
  "article": [
    "The Huawei Watch 3 is a great looking smartwatch, and is the first to use Huawei’s own HarmonyOS. It runs smooth as silk, but as you’d expect, it’s not quite fully polished yet. There’s only a handful of extra apps available to download, and support for third-party services is limited.",
    "Nevertheless, if you’re using an Android handset (or one of Huawei’s own handsets), the Watch 3 is definitely a smartwatch worth your attention – and it’s likely to get even better as the ecosystem develops.",
    "The Watch 3 is built with fitness tracking in mind, and it comes with an impressive suite of tools for monitoring your everyday wellbeing (including sleep, step counts and SpO2) as well as workouts. We found its heart rate monitoring a little inconsistent during intense training sessions, occasionally registering unexpected peaks during interval sessions, but location tracking proved accurate during our pre-measured run, as did pace and cadence.",
    "We can see a lot of potential in the Watch 3; the hardware is very impressive, and its excellent display would lend itself very well to on-screen navigation, as well as guided workouts with animated instructions. It’ll just take time for HarmonyOS to come into its own, with a wider selection of apps and more support for popular third-party services.",
    "The Huawei Watch 3 was released in selected countries in June 2021, and starts at £279.99. That’s about $390 / AU$530, but no US releases is expected, and an Australian release date has yet to be announced.",
    "We tested the standard Huawei Watch 3, but there’s also a premium version – the Huawei Watch 3 Pro – which offers a few extra features such as dual-band GPS for improved accuracy, plus improved battery life. It also has a considerably higher price tag, starting at £499.99 (about $690 / AU$940).",
    "In terms of design, the Huawei Watch 3 is a big departure from the chunky Watch 2, instead bearing more than a passing resemblance to the Watch GT with a large, glossy face, minimal bezels, and glass that curves at the edges to meet the case.",
    "The Huawei Watch 3 active edition (tested here) has a 46mm case, and is supplied with a black silicone band, which isn’t quite as soft as that of the Apple Watch 6, but still comfortable. The band has quick-release pins so you can easily switch it to something a little more stylish, and is secured with a conventional buckle rather than the loop-and-tang style fastening that’s becoming increasingly popular with smartwatches and fitness trackers.",
    "If you’d prefer something a little more stylish for everyday and formal ear, there’s also a classic edition (with a silver-toned case and either a leather or woven nylon strap), and an elite edition (with silver-toned case and metal link bracelet).",
    "The Watch 3 has just two physical controls: a small button the serves to navigate backwards through menus or return you to the home screen, and a crown that you can press to select options and apps, or turn to scroll through text and menus – a feature that was lacking on the Huawei Watch 2.",
    "It’s a system that works well, and scrolling with the crown is smooth and responsive. It’s also just about large enough to make typing feasible with the Watch 3’s on-screen keyboard, though it’s still pretty fiddly – you’ll be thankful for its autocorrect feature.",
    "The Watch 3’s standout feature is its 1.43in AMOLED display, which is crisp and vibrant, allowing you to see plenty of data or text on screen at once. There’s a huge array of watch faces to choose from in the Huawei Health app, many of which are animated to really show off the display, though it’s worth bearing in mind that most of these are paid-for, and very considerably in price.",
    "The Huawei Watch 3 is heavily fitness-focused (which we’ll discuss in more detail shortly), but it also has a good range of tools that make it a practical everyday smartwatch, particularly if you have an Android phone and an Apple Watch is out of the question.",
    "With an eSim installed you can make and receive calls, play music, and download apps without an active Bluetooth connection to your phone (ideal for working out without your handset), but even without that, there’s a lot to appreciate – especially when it comes to time-saving.",
    "For example, you’ll receive detailed app notifications on the watch’s face, eliminating the need to open the relevant app on your phone in many cases, and you can accept or mute calls with hand gestures that make use of the watch’s accelerometer; clench your fist then release it to accept the call, or turn your wrist sideways to mute it.",
    "You can also control calls using Huawei’s voice assistant, Celia (which you can access by saying ‘Hey Celia’). This allows you to perform simple searches too, and control connected devices. Like the operating system itself, it’s not yet as developed as Google Assistant, Siri or Amazon Alexa, but there’s certainly potential and we look forward to seeing where Huawei takes it in future.",
    "Another of our favorite features was the ability to make quick voice recordings through the Notes app, so you can make a record of anything that crosses your mind in a few seconds without using the watch’s on-screen keyboard.",
    "If you want to download additional apps, however, you’ll find Huawei’s AppGallery pretty empty. This is no surprise for a watch running a brand new operating system, and hopefully it’ll soon be filled out with additional tools for the Watch 3. It would particularly benefit from third-party apps from the likes of Spotify for music streaming, and Strava for running and cycling.",
    "The pre-installed apps have been carefully curated though, and include some particularly welcome safety features. Like many modern smartwatches, bike computers, and other fitness-tracking devices, the Huawei Watch 3 can alert an emergency contact if it detects a sudden impact, indicating that you’ve taken a fall. This will start a countdown, which you can dismiss to cancel the alert.",
    "You can also alert the emergency services automatically by tapping the crown button five times in succession – a feature similar to the emergency alert on the Garmin Lily, which helps provide peace of mind if you’re out alone.",
    "The Huawei Watch 3’s main focus is fitness tracking. For everyday motivation, there’s a set of Apple Watch style rings that you should aim to complete before bedtime. You’ll also be prompted to get up and move periodically with the typical inactivity alerts (complete with a nice little animation of a man having a stretch).",
    "For workouts, there’s a comprehensive selection of indoor and outdoor activities (including a triathlon mode to track swimming, cycling and running stages in one go), though there’s no need to scroll through the entire each list each time, as you can customize the menu to prioritize those you use most frequently.",
    "We tested the Huawei Watch 3 for several outdoor runs and indoor spin sessions. It took a while for the watch to establish a GPS lock before we began running (longer than our Garmin Instinct Solar) but once it did, the Watch 3 recorded our pre-measured course fairly accurately, coming up just a few meters short of the expected distance.",
    "We used high-intensity spin sessions to test the Watch 3’s heart rate monitor. It responded fairly quickly to changes in heart rate throughout a session (not as swiftly as a chest strap monitor, but that’s to be expected), but the numbers it recorded were higher than we’d expect from a standard session, with an unexplained peak during one warmup where the watch registered a heart rate of over 170bpm.",
    "You can choose to have the watch announce your time, pace and distance at each mile or kilometer, which it does loudly and clearly. Indeed, with its dependable GPS, clear screen and solid text-to-speech software, the Watch 3 seems ideally suited to navigation for running, cycling and walking, but at the time of writing there are no such tools available.",
    "Guided workouts on the watch, with animations to demonstrate proper form, would be another welcome addition, and one we’re hoping to see in the future.",
    "We always take calorie burn measurements from wearable devices with a grain of salt, but the figures recorded by the Huawei Watch 3 matched a Garmin Instinct Solar. VO2 max figures also match Garmin’s, though again these are only estimates (actual VO2 max testing requires a lot of specialist equipment in controlled conditions.",
    "Sleep tracking seemed fairly accurate in terms of mapping sleep stages, but when we compared the results with those from an Oura ring, we found that the Watch 3 recorded all time in bed as time spent asleep, resulting in a sleep score that was somewhat inflated.",
    "The Watch 3 is charged via a magnetic puck, very much like an Apple Watch 6. Unlike Apple’s chargers, however, Huawei’s has a USB-A connector rather than USB-C.",
    "Huawei estimates that the watch will last around 14 days in power-saving mode, and three days in smartwatch mode with all features enabled (again, much like the Apple Watch 6), though in our tests we found it came up a little short, lasting more like two and a half days when recording a daily workout in addition to everyday steps and heart rate.",
    "The watch connects to the Huawei Health app, which is available for iOS, Android, and comes preinstalled with HarmonyOS. Connecting the watch is a simple matter of creating an account (if you don’t already have one), entering a PIN from the watch face for verification, and granting it the necessary permissions.",
    "We tested the Watch 3 with both a Huawei P40 Pro, and a Fairphone 3 Plus running Android 10. Connecting on the Huawei handset went without a hitch, but we found that the Android app didn’t list the new smartwatch and couldn’t locate it. If this happens, the company advises updating the Huawei health app in AppGallery from your phone to solve the problem.",
    "The app itself is refreshingly simple to navigate, providing all your daily and historic health stats in one location. Unlike Fitbit’s app, Huawei Health doesn’t lock certain statistics behind a paywall; instead, all data is available at a touch of your finger.",
    "There’s also a wide array of training programs in the Huawei Health app – something else you’d have to pay for in the Fitbit app. These include introductory sessions, plus tempo, HIIT and interval sessions to help mix up your training. The app and watch won’t suggest which training plan you should try based on your past activity (though perhaps this will become possible in a future update), but the choice is impressive and on a par with many subscription services."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and availability",
    "6": "Design",
    "12": "Smartwatch features",
    "20": "Fitness features",
    "28": "Battery life",
    "30": "Companion app"
  },
  "links": {
    "eSim": "https://www.techradar.com/how-to/what-is-an-esim-and-why-would-you-need-one",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Strava": "https://www.techradar.com/how-to/use-strava",
    "Garmin Lily,": "https://www.techradar.com/reviews/garmin-lily",
    "Fairphone 3 Plus": "https://www.techradar.com/reviews/fairphone-3-plus",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit"
  }
}