{
  "source": "https://www.techradar.com/reviews/master-and-dynamic-mw08-sport",
  "title": "Master & Dynamic MW08 Sport review",
  "category": "audio-visual",
  "updated": "2021-09-04T18:00:11Z",
  "author": "lewis-leong",
  "summary": "The MW08 Sport sound and work great, but they're pricey",
  "verdict": "The Master & Dynamic MW08 Sport is a small evolution of the MW08. New for this version is the inclusion of wireless charging, as well as a new lightweight case that’s water resistant. While M&D markets the MW08 Sport as an active headphone, the regular MW08 has the same IPX5 rating for the earbuds themselves, making the MW08 the better value.",
  "pros": [
    "Detailed and balanced sound",
    "Excellent physical controls",
    "Wireless charging"
  ],
  "cons": [
    "Mediocre ANC",
    "Still no multipoint pairing",
    "Poor value"
  ],
  "article": [
    "We loved the Master & Dynamic MW08 for its luxurious build, excellent sound quality, and intuitive physical controls. While its mediocre ANC and lack of multipoint pairing left us wanting, there was denying what a pleasure they were to use day to day.",
    "Now Master & Dynamic is back with an off-shoot of the MW08 – the Master & Dynamic MW08 Sport. The major difference between the two is that the Sport model includes wireless charging and a lightweight Kevlar case that’s water resistant.",
    "After spending a few weeks with the MW08 Sport, we think the regular MW08 is the better value, depending on your use case. Here’s why.",
    "The Master & Dynamic MW08 Sport is available worldwide from the company's website for $350 / £329 / €350 (about AU$622). While the MW08 Sport supports wireless charging, you’ll have to provide your own or opt for Master & Dynamic’s MC100 charging pad, which costs $69 / £49 / €69 (about AU$112).",
    "The Master & Dynamic MW08 Sport design remains largely unchanged from its predecessors: the earbuds still feature an aluminum outer frame with plastic antenna lines but the outer face swaps ceramic for sapphire.",
    "This makes sense for a sport-focused headphone as sapphire is a more resilient material than ceramic and thankfully, in terms of weight and size, the earbuds are identical between the MW08 and MW08 Sport.",
    "The biggest design difference is the Sport’s Kevlar case, which is much lighter than the stainless steel cases of the MW08. The Kevlar case is also IPX4 water-resistant, which means it can survive water splashes, but don’t go dunking it in water. The Kevlar is coated in a grippy, rubbery texture, which feels much more secure in the hand compared to the slippery stainless steel case of the MW08.",
    "The weightiness of the MW08’s stainless steel case is what made it feel so luxurious and what helped it stand out from the crowd of plastic-clad true wireless headphones but inductive charging doesn’t work through metal, hence the lack of wireless charging on the MW08.",
    "The MW08 Sport retain excellent physical controls from their predecessor: the left earbud still has a volume rocker, which doubles as buttons to enable/disable ANC and ambient listening. The right earbud has a single button that controls playback, power, and pairing.",
    "There’s also the optical sensor that detects when the headphones are removed from the ear and automatically pauses music. This can be disabled in the app, which also allows users to tweak the ANC strength. Sadly, there’s no EQ ability in the app at the time of writing.",
    "Frustratingly, multipoint pairing is still missing from the MW08 Sport, which means you can only pair to one device at a time. Other headphones on the market like the Jabra Elite 85t allow pairing to two devices simultaneously so you can have audio automatically switch from your phone or tablet (or computer) without having to re-pair every time.",
    "ANC also returns, however, it hasn’t gotten any upgrades from the MW08. To that end, ANC is just mediocre, helping dull ambient noise but unable to go toe-to-toe with a jet engine. Don’t expect Sony WF-1000XM4 levels of noise cancellation here.",
    "The MW08 Sport sound identical to the MW08, which means you still get plenty of detail, dynamics, and a slightly warm tonal balance. The MW08 Sport are easy to listen to all day as the treble is never fatiguing. However, they sacrifice some high frequency sparkle and resolution.",
    "There’s still the typical M&D mid-bass bloom, which adds a bit of excitement in the frequency, which works well with today’s pop, hip-hop, and electronic music. ANC and Ambient Listening modes have no effect on sound quality, which is something not many headphone makers can do.",
    "In terms of call quality, the MW08 Sport are still great, with friends and family reporting clear audio. However, they're not the greatest at canceling out wind noise, so try not to take calls outside whenever possible.",
    "Battery life is still excellent. M&D claims 12 hours of playtime with ANC off and 10 hours with all day ANC or Ambient Listening enabled. The case itself provides an additional 30 hours of playtime for a grand total of 42 hours of listening time. We four their claims to be fairly accurate, getting around 8 hours with ANC enabled. Disabling ANC will net you a couple more hours.",
    "In terms of charging speed, wireless charging is a bit slower than wired: users can get 50% charge in 30 minutes and 100% charge in 100 minutes compared to 50% charge in 15 minutes/100% charge in 60 minutes when plugged in via the USB-C port."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and release date",
    "4": "Design",
    "8": "Features",
    "12": "Audio quality",
    "15": "Battery life",
    "17": "Don't buy them if..."
  },
  "links": {
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds"
  }
}