{
  "source": "https://www.techradar.com/reviews/oneplus-buds-pro",
  "title": "OnePlus Buds Pro review",
  "category": "audio-visual",
  "updated": "2021-08-27T10:56:31.311Z",
  "author": "srivatsa-ramesh",
  "summary": "The best of OnePlus",
  "verdict": "A big leap forward from the original OnePlus Buds, the new OnePlus Buds Pro offer an excellent audio experience, effective active noise cancellation, good battery life, and comfortable fit. While they might not beat the Apple AirPods Pro, the OnePlus Buds Pro represent good value for money and are a great alternative to the Oppo Enco X and the Galaxy Buds Pro.",
  "pros": [
    "Great sound quality",
    "Effective ANC",
    "Good battery life",
    "Wireless charging and IP55 rating"
  ],
  "cons": [
    "No volume control",
    "Some features are limited to OnePlus phones",
    "Boring case design"
  ],
  "article": [
    "The OnePlus Buds Pro are the third pair of true wireless earbuds from the company and these are undoubtedly the best. While OnePlus is best known for its premium smartphone offerings, the company entered the world of wireless earbuds last year with the OnePlus Buds (which didn’t impress us much). Later in the year, the budget-friendly Buds Z were announced, which offered excellent value for money.",
    "The third iteration of the true wireless earbuds from the brand, the OnePlus Buds Pro are by far the most expensive audio product from the company. However, we think they more than justify their price, offering an impressive audio experience, good battery life, and effective noise cancellation – along with additional features like Zen Mode Air, quirky yet functional controls, fast charging, and a handy companion app.",
    "As for the active noise cancellation? The OnePlus Buds Pro do an excellent job at blocking out external noise by up to 40dB and you get to choose from three ANC modes 一 noise cancellation, max ANC, and smart.",
    "The accompanying app, Hey Melody, is available for non-OnePlus phones and iOS devices, bringing a few customization options and the ability to update the earbuds. In terms of battery life, the OnePlus Buds Pro last up to 24 hours with the case and ANC turned off. With ANC turned on, it drops to 20 hours 一 which is still respectable, if not class-leading. A quick 10-minute charge offers up to 10 hours of playback which is quite handy, and there’s also support for Qi wireless charging.",
    "For $149.99 / £139 / Rs 9,990 (about AU$200), the OnePlus Buds Pro are a great choice for anyone looking for noise-cancelling earbuds without a huge price tag. If you are looking for alternatives, earbuds like the Oppo Enco X and the Samsung Galaxy Buds 2 are worth considering.",
    "Announced alongside the OnePlus Nord 2 in July 2021, the OnePlus Buds Pro cost $149.99 / £139 / Rs 9,990 – that works out at around AU$200, though Australian pricing is still to be confirmed.",
    "That relatively low price puts the OnePlus Buds Pro in competition with the likes of the Oppo Enco X, Samsung Galaxy Buds Pro, and Sony WF-XB700 – though cheaper noise-cancelling earbuds are available, like the EarFun Air Pro.",
    "The OnePlus Buds Pro are available in two color options 一 Matte Black and Glossy White. The stems on both these options are silver giving it a dual-tone finish.",
    "The charging case reminds us of a tiny mint box, with a rectangular body with curved edges, and the OnePlus logo on the top. The case weighs 52g 一 which isn’t the lightest we’ve come across. At the back of the case, is a USB-C charging port, though it’s compatible with Qi wireless charging, too.",
    "Like the Apple AirPods, the OnePlus Buds Pro feature protruding stems, and with each bud weighing just 4.35g, they’re comfortable to wear for long periods of time. In the box, you also get additional eartips in case the default ones aren’t right for your ears.",
    "An IP55 water-resistance rating means you can use the Buds Pro for working out without the worry that a little sweat will break them.",
    "The buds and the case are made up of soft plastic material that doesn’t attract fingerprints or dust like glossy materials – which is definitely a plus if you want to keep your buds pristine.",
    "The OnePlus Buds Pro impressed when it came to their audio performance. Tuned with an emphasis on the treble and bass frequencies, they support SBC, AAC, and LHDC codecs, and come with Bluetooth 5.2 connectivity.",
    "There’s also Dolby Atmos support, though it’s limited to certain OnePlus devices (7/7 Pro/7T/7T Pro/8/8 Pro/8T/9/9 Pro) and the same goes for the low-latency mode, which brings down latency to 94ms on select OnePlus devices.",
    "Thanks to large 11mm drivers, you get an extremely enjoyable listening experience from these earbuds, with thumping bass that drives your music without overwhelming the other frequencies overpowering the vocals.",
    "Their clean and energetic sound lends the OnePlus Buds Pro to most genres, with a spacious soundstage – though they aren’t the most detailed earbuds we’ve tested, and audiophiles will probably prefer models like the Cambridge Audio Melomania 1 Plus or the Grado GT220.",
    "As for noise cancellation, the OnePlus Buds Pro offer three levels of ANC 一 noise cancellation, smart mode, and max noise cancellation. With the ability to cancel up to 40dB of external noise, we found the max noise cancellation mode to be very effective, removing the sound of urban traffic, the whir of a fan, and a blaring TV.",
    "The regular noise cancellation mode was far less effective in our testing. Lastly, there is a smart mode that switches ANC levels based on the environment you are in, but we found this didn’t work reliably. Like most modern noise-cancelling headphones, there’s a transparency mode that lets in some environmental sound so you can be aware of your surroundings while listening to music.",
    "Like the AirPods Pro, the OnePlus Buds Pro can be controlled by squeezing their ear stems; it’s a single pinch on either bud to play/pause the music, and a double squeeze to skip a track. A triple squeeze will either skip to the previous track or summon your device’s voice assistant, (this can be configured in the app), and you can switch between the different ANC modes by squeezing and holding the stem. Lastly, a long touch and holding both the stems will take you to Zen Mode Air.",
    "We were worried about the controls on the Buds initially, but once we memorized the controls, they worked flawlessly. The earbuds also make a soft click sound when you squeeze the buds, which is the kind of feedback we wanted to see from the AirPods Pro – it’s nice to know that your touch has been registered. However, it misses out on the volume control gesture.",
    "If you are a OnePlus user, you might be familiar with the Zen mode which allows you to take a break from your smartphone for a short period. Similarly, the Zen Mode Air delivers white noise through the earbuds, which could help you to relax after a hectic day at work or just when you are heading to sleep. For now, there are five soundscapes to choose from, including warm sunshine, meditation, seashore, night camping, and Iceland – you can save one of these to the Buds Pro, allowing you to play it anytime you want without the app.",
    "Another new feature is the OnePlus Audio ID, which plays a series of beeps to analyse your hearing and give you a personalized audio experience. Once completed, you can hear before and after audio samples to see the difference.",
    "If you don’t have a OnePlus phone (if you do, you’ll be able to adjust your buds in your Bluetooth settings) there’s an accompanying app you can download called Hey Melody. This is where you can check your battery status, download firmware updates, switch between different noise cancellation modes, and carry out an earbuds fit test.",
    "The OnePlus Buds Pro last up to seven hours from the earbuds themselves and an additional 31 hours with the case, delivering a total of 38 hours of playback. With ANC turned on, the buds can last five hours and an additional 28 hours with the case 一 taking the total playback time to 28 hours. It is also worth noting that the battery also depends on whether you’re using volume level, low-latency mode, ANC status, and LHDC playback 一 all of which consume more juice.",
    "In our testing, we managed to get six hours of continuous playback with 80% volume and ANC turned off, and we managed to get 4.5 hours with ANC turned on. However, once we turned on the LHDC mode, the battery life dropped to four hours.",
    "The USB-C quick charge feature comes in handy by offering 10 hours of playback including the case. A full charge took just one hour, although OnePlus says it usually takes two hours. You can also charge the Buds Pro using a Qi-certified phone or wireless charger.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "OnePlus Buds Pro price and release date",
    "7": "Design",
    "12": "Audio performance and noise cancellation",
    "18": "App and features",
    "23": "Battery life",
    "26": "Don't buy them if..."
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "premium smartphone offerings": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "OnePlus Buds": "https://www.techradar.com/reviews/oneplus-buds",
    "Buds Z": "https://www.techradar.com/reviews/oneplus-buds-z",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "noise-cancelling earbuds": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "Oppo Enco X": "https://www.techradar.com/reviews/oppo-enco-x",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Sony WF-XB700": "https://www.techradar.com/reviews/sony-wf-xb700-truly-wireless-headphones",
    "EarFun Air Pro": "https://www.techradar.com/reviews/earfun-air-pro",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Cambridge Audio Melomania 1 Plus": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
    "Grado GT220": "https://www.techradar.com/reviews/grado-gt220",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "wireless charger": "https://www.techradar.com/best/best-wireless-chargers"
  }
}