{
  "source": "https://www.techradar.com/reviews/rig-500-pro-hx-gen-2-headset-review",
  "title": "RIG 500 PRO HX Gen 2 headset review review",
  "category": "gaming",
  "updated": "2021-06-29T16:18:05Z",
  "author": "dom-peppiatt",
  "summary": "This reworked headset is the steel deal",
  "verdict": "Reworked, remodeled, and redesigned since its first iteration, the RIG 500 PRO HX Gen 2 supersedes its predecessor in almost every way. Nacon’s takeover of the brand has clearly elevated what the headsets can achieve, and now this mid-range headset certainly impresses compared to other wired hardware in the same bracket. It feels more expensive than it is and delivers mid-range sound without breaking a sweat.",
  "pros": [
    "Premium, stylish finish",
    "Decent sound quality",
    "Responsive, crystal clear voice chat"
  ],
  "cons": [
    "Not hugely comfortable",
    "In-built cable lacks sturdiness"
  ],
  "article": [
    "The RIG 500 Pro HX Gen 2 makes a great first impression; it’s stylish, that steel band over the head does a great job at making the hardware feel more premium than it actually is, and when you pick the headset up, you’ll enjoy just how light and unobtrusive it feels. If you don’t mind an in-built cable that cannot be replaced if it breaks (a common theme in headsets that get daily use), this is a mid-tier bit of kit that will fit right in with any dedicated Xbox player’s setup.",
    "A partnership with the HX model means this headset specifically has been designed to work with Xbox Series X, Xbox Series S, Xbox One and Windows 10 – and that means it works with Dolby Atmos. Each new boxed headset comes with a two-year subscription to the service, meaning a good value headset gives you more bang for your buck if you’re thinking of combing through Xbox Game Pass and seeing which games support the 3D audio app.",
    "The headset may start to pinch your head or feel a bit close after a few hours of play, and the wired connection may be a turn off for some, but other than a few small gripes, it’s hard to put the RIG 500 Pro HX Gen 2 down – especially if you’re playing something booming and deep that really puts those 50mm drivers to work.",
    "The RIG 500 Pro HX Gen 2 headset is available from $79.99 / £69 / AU$129 and it is available now. It fits into the mid-range price for a wired headset, and its closest competition would likely be the Razer Blackshark V2 X or the Razer Kraken Ultimate, with the SCUF H1 also coming in at the top end of the category. The headset can be plugged into any 3.5mm audio jack, and as such is compatible with PS4, PS5, Xbox One, Xbox Series S, Xbox Series X, Nintendo Switch, and PC – though the branding and drivers are geared specifically towards Xbox and PC platforms.",
    "The biggest draw of this headset is that lovely black steel headband. It acts as something of an exoskeleton, with the rest of the hardware seemingly attached to that core chassis and feeling suspended from it. As a result, the whole headset feels light and easy to wear – though we noticed after a while there was a little pinching on the crown of the head and around the ears. We also tried the headset on a glasses-wearing colleague, and they mentioned the lightweight frame worked wonderfully with the glasses frame, too.",
    "The isolated closed-cup design (with each cup boasting dual-material ear cushions on the inside) results in a great sound-excluding barrier, and whilst the headset is too cheap to offer proper, tech-powered noise canceling, the cups themselves do a decent enough job to eliminate ambient noise in most household environments.",
    "Though the cable attached to the headset promises to be resilient and damage-resistant, you’ll notice the connection to the headset is fairly flimsy and vulnerable: bear that in mind if you’re an agitated player and often take your headset on and off – it seems like a weak spot, and one breakage there could cost you $79.99 (especially given how temperamental audio cables have a tendency to be).",
    "Thanks to that powerful 50mm driver, the headset is at its best in complex, multi-layered soundscapes. FPS lovers and shooter aficionados, eat your heart out. The sound stage allows you to quickly and effortlessly pinpoint sound cues and respond to threats without pause – great if you’re a competitive or pro-level player. Sound effects are isolated and delivered clearly, and usually without having to compromise on background music or ambient sound. Moving from a big, loud game to something more ambient and intimate – like Subnautica, for instance – just reiterated how well the headset does with complex and rich sounds.",
    "Music lovers, you’ll be pleased to know that the drivers respond just as well when it comes to music playback as in games. The headset has a tendency to underperform at the very top end, so high-pitched noises and cartoony titles don’t work quite so well with those nice, heavy drivers (the specs say the headset supports a frequency response range of 20 Hz to 20 kHz). That slightly poor high-end may just be another way of saying how good the low-end is, though; the upper end of the spectrum isn’t exactly bad, just not as good as what the headset was clearly designed for.",
    "The detachable microphone is interesting; it’s both removable and flip-to-mute, which is unique in any headsets this reviewer has encountered. The downside of having both, though, is that it’s pretty content to move on its own behalf – if you flip to mute and move too suddenly, you may find it coming back down to rest by your mouth. Not ideal if you’re munching through a pack of chips whilst you wait in the lobby of Call of Duty: Warzone, right?",
    "The mic also feels cheap. In doing these tests, we like to put our headsets through a bit of punishment to see how they’d withstand a normal gaming setup. Throwing the headset onto a nearby couch we instantly discovered the mic is the weakest part of the whole headset’s design – it’ll pick up every whisper you utter, sure, but get careless just once and it is liable to break. We’re not marking it down for that (it’s effectively user error, after all), but you should be aware if you’re thinking of picking this headset up."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "RIG 500 PRO HX Gen 2 headset price and release date",
    "4": "Design",
    "7": "Audio performance",
    "9": "Microphone quality and wireless connectivity",
    "11": "Don't buy it if..."
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Razer Blackshark V2 X": "https://www.techradar.com/reviews/razer-blackshark-v2-pro",
    "Razer Kraken Ultimate": "https://www.techradar.com/reviews/razer-kraken-ultimate",
    "the SCUF H1": "https://www.techradar.com/reviews/scuf-h1-headset-review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "FPS": "https://www.techradar.com/news/best-fps-games",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone"
  }
}