{
  "source": "https://www.techradar.com/reviews/cleer-enduro-anc-review",
  "title": "Cleer Enduro ANC review",
  "category": "audio-visual",
  "updated": "2021-06-02T14:51:11Z",
  "author": "jennifer-allen",
  "summary": "A strong battery life with equally strong sounds",
  "verdict": "The Cleer Enduro ANC offer great value for the price, providing a huge battery life, while still also offering good audio quality. They could be a little comfier, but there's a lot to like here.",
  "pros": [
    "Clear audio",
    "Fantastic battery life",
    "Easy to use app"
  ],
  "cons": [
    "Slightly uncomfortable",
    "Plasticky design",
    "ANC isn't perfect"
  ],
  "article": [
    "Cleer is a name that might not be familiar to many, but it's one we may see a lot more of if the Cleer Enduro ANC are anything to go by.",
    "The San Diego-based firm has a small but growing selection of headphones, earbuds, and wireless speakers, many with battery lives that will blow your mind. In the case of the Cleer Enduro ANC noise-cancelling headphones, we're talking about 60 hours of use. Impressively, that's relatively tame by Cleer's standards with its Enduro 100 achieving (you guessed it) 100 hours.",
    "That's noteworthy at any price, but the fact the Cleer Enduro ANC retail for only $149/ £149 (about AU$210) makes them all the more appealing. That's a low price for such a long battery life, even more so when you factor in everything else these headphones offer.",
    "They weigh about 280g which isn't bad going at all for over-ear headphones. Annoyingly though, they're not the comfiest of headphones, and we found they pinched after extended sessions using them. It's not a massive issue but it's one to be aware of if you're particularly sensitive or know you'll be wearing them for a long time. That's unfortunately jarring given the battery life means you can wear them for seemingly as long as you want.",
    "Despite that misstep, the Cleer Enduro ANC pretty much offer all you could need from a pair of headphones. The sound quality is good, if a little bass-heavy. Listening to music feels exciting with the soundstage feeling like it wraps around your head. The likes of Arctic Monkeys' I Bet You Look Good On the Dance Floor feels suitably vibrant and thrilling, while Childish Gambino's Feels Like Summer still sounds appropriately chilled.",
    "For the pickiest of listeners, these headphones probably aren't quite the best in terms of audio quality, but for the vast majority of users, it won't matter. Everything we listened to sounded clear, crisp, and strong, with enough detail to make your favorite songs shine.",
    "The ANC (active noise cancellation) isn't perfect but it's still very good. While the loudest of sounds will still creep through, for the most part, you'll feel cocooned from the world when using ANC – and we can forgive these headphones for the odd sound bleeding in when we consider how much cheaper they are than other noise-cancelling headphones.",
    "The accompanying Cleer app is simple, yet effective, allowing you to adjust how much ambient sound comes through, and change the sound profile via an equalizer.",
    "That’s also the case with the Cleer Enduro ANC's controls. There's no fancy touch-sensitive pads here; instead you have solid buttons that are clearly labeled to denote power, volume, and an ANC toggle. They’re a little plasticky, sure, but you're never going to accidentally press one of these, and they do the job well.",
    "Other price-cutting concessions include the fact these wireless headphones don't come with a proper carrying case, although there is a small drawstring pouch for storing the USB-C/USB-A charging cable, USB-C to 3.5mm cable, and airplane adapter.",
    "As mentioned, the battery life is impressive. Up to 60 hours of playback means you'll rarely need to plug these in to charge. When you do, a 10-minute charging session gives you two hours of playback.",
    "The Cleer Enduro ANC might not offer the comfiest of fits, but they're an impressively tempting bet for the price. They're solidly designed while offering useful features like ANC that genuinely works well, strong beats, and controls that don't require you to dig out the manual. Whether you're hitting the gym or simply relaxing at home, these are solid all-rounders.",
    "The Cleer Enduro ANC are available in the US and UK. Priced at $149 / £149 (about AU $210), there's no sign of discounts by third-party retailers just yet, but they're not too expensive compared to similarly specced competitors. The headphones aren't currently available in Australia.",
    "Color-wise, you have the option of either light gray or navy. Both colors might not set the world on fire, but they're stylish and sure to match any aesthetic.",
    "You can see where compromises were made with the Cleer Enduro ANC's design to keep the price affordable. The cans are solidly constructed so they can survive the odd knock when out and about, but much of that is down to their distinctly plasticky exterior. Adjusting the headband also emits a slight creaking sound. They're not exactly sleek, although they still look the part.",
    "The Cleer Enduro ANC aren’t the comfiest of headphones to wear for extended periods of time, either. There's a bit of pinching and general irritation due to a relatively snug fit, although we've certainly come across worse culprits in the world of headphones. It's a mild form of discomfort rather than anything overwhelming.",
    "The somewhat cheaper feel continues with the plastic buttons on the side of the headphones, but we do like the fact that they're so simple to use and well labeled. While touch-sensitive controls look cool, they often depend on you remembering some specific gestures or button taps.",
    "These plasticky buttons might seem rudimentary but you'll never have to dig out the manual or Google how to change the volume, for example. Being able to easily get to grips with things is a welcome feature, especially when it comes to tapping ANC on or off.",
    "If we needed to sum up the Cleer Enduro ANC's sound in one word, it would be 'enjoyable'. Whatever you listen to sounds enthusiastic. The bassy beats of The Beatles' Come Together makes you want to at least tap your feet if not do more to get involved.",
    "Meanwhile, the RnB-tinged tones of Childish Gambino's Feels Like Summer sound relaxed, yet well detailed. It's a similar story for David Bowie's Under Pressure, which soon whisks you away to another world thanks to the headphones’ good sound staging here. That's partly thanks to Cleer's use of its proprietary 40mm Ironless Drivers, which provide a clean, clear sound.",
    "The bass is occasionally a little overpowering if you whack up the volume, but on the other end of the scale, the Cleer Enduro ANC sounds great at lower volumes. No detail is lost here.",
    "Those looking for Qualcomm's aptX Adaptive codec support will be pleased to note that these headphones support that too, which is great if you want to stream high-quality audio and have the right equipment to do so.",
    "The ANC is reasonably effective too. While it won't cancel out the loudest of sounds, we felt suitably cocooned away from the world while taking in both music and podcasts. Being able to switch to ambient mode at the touch of a physical button is convenient too, so you won't miss out on anything if you want to quickly tap into your surroundings. Ambient mode works pretty well at picking out voices over unwanted background noises too – plus there's no noticeable effect on sound quality when using any of these modes.",
    "The Cleer Enduro ANC is further enhanced by the Cleer app. Living up to its name, the app is a breeze to use. A slider dictates ambient noise controls while an equalizer allows you to drag sliders around to get the sound how you most like it. At all times, you can see how much battery life is left on your headphones too, which is a convenient added extra.",
    "The Cleer Enduro ANC has truly exceptional battery life. Lasting up to 60 hours on one charge means you'd be likely to forget where you put your charger if it wasn't that a regular USB-C cable will suffice. In real life use, the battery life can dip a bit, particularly if you're regularly switching between ANC and ambient mode, but the effects are pretty negligible. Simply put, you're not going to be disappointed by what these headphones can do.",
    "On those seemingly rare occasions when you do need to recharge, a 10-minute session gives you two hours of playback, while a three-hour charge will provide a full recharge. The latter is a little on the long side but also makes sense given just how hefty the battery actually is.",
    "The Cleer Enduro ANC uses Bluetooth 5 for connectivity, so as you'd expect, we enjoyed a speedy pairing process, and no problems in terms of dropouts."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Cleer Enduro ANC price and availability",
    "14": "Design",
    "18": "Audio performance and noise cancellation",
    "24": "Battery life and connectivity",
    "27": "Don't buy them if..."
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "wireless speakers": "https://www.techradar.com/news/hidden-hi-fi-why-are-wireless-speakers-being-disguised-as-pieces-of-furniture/news/best-speaker",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Enduro 100": "https://www.techradar.com/news/these-wireless-headphones-boast-an-incredible-100-hour-battery-life",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344"
  }
}