{
  "source": "https://www.techradar.com/reviews/volt-pulse",
  "title": "Volt Pulse review",
  "category": "fitness",
  "updated": "2021-05-26T14:34:47Z",
  "author": "rob-clymo",
  "summary": "The Volt Pulse hybrid e-bike has had a much-needed makeover",
  "verdict": "This British bike manufacturer has given its best-selling Pulse model a makeover and the electric cycle delivers a well-rounded battery-powered experience. It combines a sensible and very practical design with plenty of solid features that makes it feel like a good value package. There are some neat flourishes too, which add value and could coax you to buy it over many similarly priced rivals.",
  "pros": [
    "Good level of ride comfort",
    "Dependable power delivery",
    "Feels well built"
  ],
  "cons": [
    "Quite a heavy bike",
    "Computer screen quite reflective",
    "No quick release for saddle"
  ],
  "article": [
    "The new Volt Pulse is a great blend of classic-style bike design and battery-powered tech. The British cycle maker has tweaked the formula of its best-selling e-bike to create a two-wheeler that looks a treat and provides performance to go with it.",
    "The bike is wonderfully easy to use, has the perfect mix of conventional gearing and powered assistance plus excellent brakes. However, the best part of this e-bike is its rideability, with a super comfy saddle, chunky tires and front suspension that all work together to munch up the miles.",
    "Expect plenty of range from the Bafang hub motor and Panasonic battery combination, along with swift and fuss-free shifting through both the manual gears and the electronic assistance options.",
    "As is the case with most e-bikes this is a weighty machine, but its design and power-assistance never makes it feel unwieldy.",
    "The Volt Pulse also comes with everything you need to get going, including full fenders, LED lighting and a rack over the rear wheel for cargo up to 25kg. It’s a great bike complete with a price tag that seems pretty reasonable to us.",
    "At the time of writing (May 2021), the Volt Pulse is available for pre-order. The price is $2,746 / £1,949 (about AU$3,500) for the 36V 400Wh standard battery, or $3,042 / £2,149 (about AU$4,000) for the 36V X-Large 621Wh model.",
    "British bike maker Volt has made quite a lot of progress in a relatively short amount of time, especially when it comes to the design of its e-bikes. We tried its Infinity model about a year ago and the difference between that, and the revitalised Volt Pulse is clear to see.",
    "The biggest improvement is the newer bike feels properly designed, rather than being a compendium of component parts with this model looking much more aesthetically pleasing. While the new Volt Pulse is still quite a chunky looking thing, the battery now clips in to the frame, so it almost appears integral but can be easily removed for charging off the bike. The overall ‘look’ is just a lot more complete.",
    "The styling of this updated best-seller is fairly conventional, and even though our model was finished in a fetching dark metallic color, the bike delivers, rather than dazzles.",
    "We’re pretty impressed with the overall design and build though, with a solid setlist of components on offer. There’s that frame for starters, available in 18 or 20.2-inch variants and fashioned from lightweight aluminium. That also goes some way to helping reduce overall weight, which is 24.7kg with the battery fitted, so it’s still fairly chunky although that means it’s also suitable for riders up to 120kg.",
    "Alexrim DP21 Double Wall Reinforced wheels are either 27.5 or 18-inch and have Schwalbe puncture resistant tires fitted. The saddle is a Velo Sport Comfort affair, so overall this is a bike that offers a very decent amount of comfort when you’re riding. Those SR Suntour NCX Tapered front forks absorb a decent amount of shock out on the road too.",
    "We were also keen on Zoom adjustable handlebars, with grips that were great on longer runs. Gears come courtesy of Shimano and its eight-speed Alivio setup, while disc brake duties are handled capably thanks to Tektro hydraulics.",
    "Rounding it all out is, of course, the power side of things. In this case you get a 250Watt SpinTech rear mounted hub motor from Bafang, which can get you up to the 15.5mph/25kmh limit easily enough.",
    "You can also choose from two battery options; a standard 36V 400Wh unit or, for a couple of hundred more, a 36V XL edition, which is good for 621Wh. Bear in mind the weight difference if you plump for the larger one, which is 4.4kg as opposed to 3.2.",
    "There’s a four-speed Spin Tech computer display on the handlebars, which can be used to control modes (Low, Normal, High, Power) along with monitoring speed and distance. It feels well made, although the screen can be hard to see in strong sunlight, but that’s a common foible with most bike computers. A carrying rack for up to 25kgs at the back, full mudguards front and rear, kickstand, integral lock and Spanninga LED lights round out the package nicely.",
    "Before you go anywhere on the Volt Pulse you’ll need to press the power button on the bottom of the battery pack and scan the computer key or immobilizer to unlock your screen and be given access to the controls. That’s a good thing.",
    "It’s a shame the bike doesn’t have a quick release lever on the saddle stem too though as our model needed adjusting before we could ride it, which meant a trip to the toolbox. The Abus built-in Dutch-style lock on the rear wheel is handy though, which combined with the overall weightiness of this two-wheeler makes the bike hard to move.",
    "All of the above are useful anti-theft measures if nothing else. Minor hassle out of the way and the bike is good to go.",
    "The Volt Pulse delivers a quality ride from the off, made all the better by the saddle and tyre combination outlined above. This is an upright bike that offers a lofty view of the road, while all of the controls are easy to reach and even easier to use. Shimano shifting is invariably fuss-free and it works particularly well on this e-bike.",
    "Used without any power the Volt Pulse is great as-is on the flat, but power can be called upon from the controls on the left-hand side quickly and easily. Power delivery is smooth, consistent and benefits from the push you get from a rear-mounted hub motor.",
    "You can whip up and down the four pedal-assisted speed modes using the plus and minus symbols on the computer unit, while this also shows speed and distance travelled. We found Normal to be perfectly fine for our everyday forays and that, naturally, returns better mileage from the battery pack.",
    "Volt states the Standard one is good for around 60 miles, while the XL version provides 20 miles more. Considering this costs substantially more, we’d be inclined to stick with the standard one, make the saving and just get a little more exercise as and when longer journeys demand it.",
    "Meanwhile, the Bafang hub motor is a common sight on other e-bikes and, so far at least, these units appear pretty reliable. It seems perfectly placed here and we always find them dependable at getting the power down.",
    "Incidentally, there’s a small walk assist lever that can be used for occasional help and comes in useful if you’ve got the bike laden down with a week’s worth of groceries.",
    "Everything else is largely spot-on too really, with great Tektro hydraulic disc brakes and a set of LED lights to get you home after dark without problems. The computer display can be hard to read in harsh light, but that’s a common issue for most screens in outdoor conditions.",
    "Recharging the Panasonic battery off the bike is definitely a practical touch and the charge time came in at under four hours from almost empty, which is line line with Volt’s estimate of between three and four hours.",
    "First reviewed May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and release date",
    "6": "Design",
    "15": "Performance",
    "27": "Don't buy it if"
  },
  "links": {
    "Volt Pulse": "https://voltbikes.co.uk/e-bikes/hybrid/pulse",
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "Infinity model": "https://www.techradar.com/news/shimanos-smart-tech-gives-volts-infinity-e-bike-the-edge"
  }
}