{
  "source": "https://www.techradar.com/reviews/amazon-fire-hd-8-2020",
  "title": "Amazon Fire HD 8 (2020) review",
  "category": "tablets",
  "updated": "2021-06-25T12:38:33.545Z",
  "author": "tom-bedford",
  "summary": "Amazon’s middle-sized tablet gets an upgrade",
  "verdict": "The Amazon Fire HD 8 is a tablet designed for people who are dedicated users of the company’s entertainment offerings, with the tablet working well as a portable media system. However, it’s not a huge upgrade from its 2018 predecessor, with only a few tweaks, so unless you think you’ll make the most of the extra storage and faster charging on offer here, you may not need this newer model.",
  "pros": [
    "Super-low price",
    "Great front camera placement",
    "Headphone jack and USB-C"
  ],
  "cons": [
    "Poor screen quality",
    "Locked to Amazon’s ecosystem",
    "Feels cheap in the hand"
  ],
  "article": [
    "It was about time the Amazon Fire HD 8 got an upgrade, given that tablets from the company tend to be updated roughly every other year, and in mid-2020 it was the turn of the medium-sized tablet from the company, which previously got an upgrade in 2018.",
    "Launched alongside the Amazon Fire HD 8 Plus variant (with wireless charging and more RAM) and a Kids’ Edition (with a protective cover), the Amazon Fire HD 8 (2020) isn’t exactly a huge redesign of the Fire HD 8 (2018) – in fact it’s not a redesign at all, since the slates look virtually identical. Instead, the new tablet gets a few tweaks to help it stay up to date with other 2020 tablets.",
    "It’s clear that Amazon wants its new Fire HD 8 to hit the same ‘cheap tablet’ market it always does, with a low price achieved thanks to relatively slow processing power, unimaginative design, and compulsory use of Amazon’s Android ‘fork’, which locks you into its content ecosystem.",
    "Upgrades to the 2020 model include USB-C connectivity (which brings with it faster charging), more storage, and a longer-lasting battery. These don’t exactly redefine the experience of using the tablet, but they’re all welcome improvements.",
    "Those small tweaks don’t fix some of the issues we’ve had with Amazon’s tablets in the past: the screen quality isn’t fantastic, for example, which can be an issue if you’re looking for a portable entertainment system, although it’s understandable given the price. Similarly, the cheap-feeling build, primarily due to the plastic used for the rear, is just a symptom of the price point.",
    "The bigger issue here is Fire OS, the Android fork that all of Amazon’s tablets use, as it’s quite a limiting ecosystem, especially if you’re not already entrenched in Amazon’s services, like Amazon Prime Video, Kindle and Amazon Music. There are only a few non-Amazon apps available to download, and you certainly don’t get the freedom of customization you would with any other tablet using ‘stock’ Android or a forked version.",
    "If you’re looking for an inexpensive and portable entertainment system, and don’t mind being tethered to Amazon’s apps and a few select games, then perhaps the Amazon Fire HD 8 is right for you, but there are other tablets available at this price point that offer better software.",
    "The Amazon Fire HD 8 (2020) went on sale, alongside the Plus and Kids’ Edition tablets, on June 3, 2020. The 32GB storage option costs $104 / £89 (roughly AU$160, though Amazon’s tablets don’t typically get released in Australia), which goes up to $134 / £119 (roughly AU$210) for the 64GB model.",
    "If you tend to download content that you watch, you may need the higher-storage version, but if you’ll be using your tablet to stream content straight from the internet you should be fine with 32GB. It’s worth pointing out that, because Amazon keeps its older tablets on sale for a while at a reduced price, you need to make sure you’re looking at the right model: this is the ninth-generation build.",
    "For context, the Amazon Fire HD 8 Plus costs $20 / £20 (about AU$30) more than the non-Plus model for each storage version, and if wireless charging is a big deal to you then perhaps it’s worth the extra.",
    "The Amazon FIre HD 8 (2020) doesn’t bring anything new to the table design-wise – it’s a big rectangle with a screen. This particular rectangle has dimensions of 202 x 137 x 9.7mm and a weight of 355g – that’s fairly average for such a tablet, although the device is lighter than many competitors.",
    "Unlike on most tablets, the front-facing camera here is halfway down on the left side when you’re holding the slate in portrait orientation, not on the top – this actually means it’s in a great position for video calling, as you can look at the screen while also appearing to look at the camera.",
    "In this orientation, the USB-C port, 3.5mm headphone jack, power button and volume rocker are all on the top edge of the tablet. The inclusion of a 3.5mm port will impress people who like their wired headphones, while the USB-C port ensures fast charging; however, we had an issue with the volume rocker.",
    "When the Amazon Fire HD 8 is in portrait, the right half of the volume rocker turns the volume up, and the left half lowers it – sounds simple, right? Well, when you flip the tablet to landscape, these functions are actually reversed. This took us quite a while to get used to, and it was especially confusing early on before we became aware of the problem.",
    "The back of the tablet is bare save for Amazon’s smile-tick logo and the rear camera. The material here is plastic, which is another symptom of the low price, but it does make the slate feel a little cheap.",
    "The Amazon Fire HD 8 (2020) has an 8-inch screen, denoted by the 8 in its name. It’s an LCD screen with a 800 x 1280 resolution, which is rather low-res given most cheap phones, which have screens smaller than 8 inches, have similar resolutions.",
    "As a result, the slate isn’t perfect for all types of media – we found that games looked especially pixelated, and TV shows and movies didn’t look fantastic. However, if you use the Kindle e-reader or Amazon Music functions you won’t care as much – not everyone needs a top-end screen, and if that’s you, you won’t mind the Fire HD 8 display.",
    "One benefit of LCD panels is that they’re easier to view outdoors in direct sunlight, so this is a tablet that should serve you well if you want to use it outside.",
    "The Amazon Fire HD 8 (2020) has a MediaTek MT8168 chipset, which is a processor designed for inexpensive tablets and e-readers, so it’s right at home here. Suffice to say the tablet isn’t exactly snappy to use, but with only 2GB RAM on board it was never going to be a powerhouse.",
    "There’s a slight delay when you’re navigating the tablet or opening apps, as you’d expect from an inexpensive tablet with a weak chipset, but we encountered the most problems when playing games. There are very few demanding games available in Amazon’s ecosystem, but PUBG Mobile is one, and we experienced issues with lag and crashes when playing it. Even Hearthstone – a card game – was prone to frequent crashing.",
    "If you’re just using the Amazon Fire tablet to listen to music or watch movies, though, you won’t suffer the wrath of this weak chipset, and since those are the main functions of this tablet we can give the processor problems a pass.",
    "We should also point out that we found the tablet had a little more trouble connecting to the internet than other devices, and we had to be closer to the router to get a reliable network connection. This only really became an issue when playing online games, although it also meant TV shows sometimes took a little while to buffer.",
    "Amazon doesn’t announce the battery capacities of its tablets, but there’s supposedly a 12-hour battery here, according to the company, up from the 10-hour estimated life of the previous version. It’s unclear what kind of use that estimate is based on – watching content, listening to music, gaming, or a mix, but from our experience with the tablet we’re inclined to suggest it’s mainly watching content.",
    "By that we mean you’ll probably be able to watch about 12 hours of content before having to charge the tablet; if you’re listening to music or reading books the slate will last longer, but if you play games a lot it won’t last you as long.",
    "Charging isn’t exactly snappy, although it’s faster here than via the older microUSB port. We’d estimate it takes roughly an hour and a half to fully charge the device from empty.",
    "There’s a 2MP camera on both the front and back of the Fire HD 8 (2020), although it’s unlikely you’ll be using the rear snapper, as nearly all smartphones have better capabilities. As mentioned, the front camera is at the top when you’re holding the slate landscape, as you likely will be for video calls, which we appreciated since it made it easier to look at the camera and screen at the same time.",
    "When you’re using the Amazon Fire HD 8 (2020), or any Amazon Fire tablet, you’re locked to FireOS, Amazon’s Android fork. Although your mileage may vary, we’d say this isn’t a great operating system.",
    "Fire OS has no home screen customization options – instead, your interface looks more like an online storefront. You can switch between Home, Books, Video, Games & Apps, Shop, Music, Audible and Newstand, and you can probably tell from that list nearly all those content options are ones Amazon has its fingers in.",
    "If you go to Video, for example, you’re presented with Amazon Prime Video, and if you’re a Prime subscriber you’ll find shows and movies here you can watch for free, and more which you’ll have to pay to access; non-Prime users will only find a list of things they have to pay to watch. It’s generally the same with all the options on the aforementioned list.",
    "Only ‘Games & Apps’ gives you non-Amazon options, although the collection of apps you can download is far more limited than in the standard Google Play Store. There are some social media apps like Facebook and TikTok, some Amazon rival services like Spotify, Netflix and Disney Plus (so at least Amazon can’t be accused of stifling competition), and a few popular games like PUBG Mobile, Crossy Road, Roblox, Hearthstone, Clash of Clans and Minecraft.",
    "The games list is very limited, and other than those big titles you’re not going to be able to play many of the popular Android games. Unless the selection here ticks off all the games you like to play, you might find your phone or a different tablet better for mobile gaming; most of the other titles available on this Amazon tablet seem lacklustre."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Amazon Fire HD 8 (2020) price and availability",
    "10": "Design",
    "15": "Display",
    "18": "Specs, performance and camera",
    "26": "Software",
    "31": "Don't buy it if"
  },
  "links": {
    "Amazon Fire HD 8 Plus": "https://www.techradar.com/reviews/amazon-fire-hd-8-plus-2020"
  }
}