{
  "source": "https://www.techradar.com/reviews/amazfit-zenbuds",
  "title": "Amazfit Zenbuds review",
  "category": "fitness",
  "updated": "2021-11-11T16:53:22Z",
  "author": "cat-ellis",
  "summary": "An affordable alternative to Bose Sleepbuds, with added sleep tracking smarts",
  "verdict": "The Amazfit Zenbuds are very small, and very impressive. They aren't true wireless headphones, so you can't use them to stream music and podcasts from your phone, but that's not what they're designed for. They're more like smart earplugs, playing soothing sounds (selected from a large collection in the Zepp mobile app) to help you drift off at night, and monitoring your sleep stages and restlessness overnight. Their tiny size and slim profile makes them comfortable even for side sleepers, and their sleep tracking smarts mean there's no need to wear a chunky watch or fitness tracker on your wrist overnight. They don't block out ambient sounds as effectively as earplugs with active noise cancelling, but they're otherwise hard to fault, and a great value alternative to the Bose Sleepbuds II.",
  "pros": [
    "Huge array of soundscapes",
    "Very small and comfortable",
    "Cheaoer than Bose Sleepbuds II",
    "Impressive sleep tracking"
  ],
  "cons": [
    "No active noise cancelling",
    "Electrical contacts can be fiddly"
  ],
  "article": [
    "There’s a lot to like about the Amazfit Zenbuds, which pack a remarkable amount of sleep tech into a very small space. They aren’t headphones for listening to your own music and podcasts at night, and we won't hold that against them (for that, you’ll need something like the AcousticSheep SleepPhones). Instead, the Zenbuds work much like the Bose Sleepbuds II, playing a selection of pre-loaded sounds to help you drift off to sleep more easily and (hopefully) stay there.",
    "There are some significant differences between the two, though. For starters, the Zenbuds are smaller, making them more comfortable to wear at night. In addition to lulling you to sleep with soft sounds of rainfall and snoring kittens, they also track your sleep stages, and even your changing sleep position throughout the night. It’s impressive, and means there’s no need to wear a cumbersome watch in bed, or slide a sleep tracker under your mattress to find out whether you’re getting a proper night’s rest. The Zenbuds are cheaper as well, costing $100 / £100 / AU$150 less than their Bose counterparts.",
    "If you struggle with a particularly loudly snoring partner then the Bose buds might be a better choice, as they block external sounds more effectively. Alternatively, you could check out the QuietOn 3 sleep earplugs, which don’t play any sounds of their own, but have active noise cancelling.",
    "For everyone else who just wants to mask some annoying ambient noises, or benefits from some gentle sound to help stop their mind racing, the Zenbuds come highly recommended.",
    "The Amazfit Zenbuds were crowdfunded on Indiegogo, and began shipping in September 2020. They’re now on general sale direct from Amazfit, and cost $149.99 / £119 / $229.90.",
    "That’s considerably cheaper than the Bose Sleepbuds II, which have a recommended retail price of $249.95 / £229.95 / AU$379.95.",
    "The Amazfit Zenbuds are far smaller than the Bose Sleepbuds – tiny gray earplugs (approximately 1cm in diameter and less than 1g in weight) that fit snugly into soft silicone covers. The covers come in four sizes, and it’s well worth spending some time choosing the right ones so they’re secure and comfortable at night. Soft ‘fins’ like those used by some sports headphones help keep them in place at night, and the Zenbuds’ slim profile means you’ll barely feel them, even if you sleep on your side.",
    "There are no controls on the Zenbuds themselves. They begin playing sound the moment they’re taken out of the case, and stop when they’re replaced. Sleep tracking happens automatically as well; just insert then in your ears and the data will be available to check in the morning. All other operations (including changing the audio sample and volume) are performed through the Zepp app.",
    "The buds are supplied with a smart-looking charging case with a rotating lid, which is powered up via a USB-C cable. The Zenbuds are held in place with small magnets, though in our tests we found that the electrical contacts on the right bud didn’t always align with those in the case, preventing it from charging. If you’re struggling to connect the buds to your phone, try repositioning them in the case and waiting for them to charge.",
    "Like all Amazfit devices, the Zenbuds are controlled through the Zepp smartphone app. If you have one of the company’s running watches or fitness trackers, all your health and fitness stats will be collected together in one convenient place.",
    "Once you’ve chosen the silicone earpieces that fit your ears best and slipped the tiny Zenbuds inside, you’re ready to peel the adhesive covers off their battery contacts and settle them in their case to charge. As mentioned earlier, we struggled to get the right bud to connect at first, but aligning the contacts by hand rather than relying on the magnet to snap them into place solved this problem. It took about an hour for the Zenbuds to charge completely from flat.",
    "When you remove a charged bud from the case, you’ll notice that it starts playing sound immediately, whether it’s connected to your phone or not. This is a very handy feature; you can set up your preferred sound effect and volume during daylight hours, and when you’re ready to settle down for the night there’s no need to touch your phone and risk being distracted.",
    "To change the sound, open the Profile section of the Zepp app and tap ‘My tunes’. Here you’ll see a list of effects that are already installed on your Zenbuds, and ready to go. Select one to hear a preview on your phone, then slide the tap down to adjust the volume. There’s a good range of options provided, from simple pink noise to the obligatory rain noise, but if you’re not inspired by what’s offered by default, tap ‘Music library’ to see some more esoteric options.",
    "Here you can choose from clips including ASMR, whale song, two types of flute, and (charmingly) a snoring cat. Uploading these clips to the buds takes several minutes, but it’s worth the wait; the clips are sufficiently long that you shouldn’t notice where they loop or be distracted by repeating sounds. There's scope for Amazfit to add more options in the future as well.",
    "You can simply allow the Zenbuds to play continuously, or use the Rest option, which will play for a set duration (up to two hours) before waking you up. It's a shame there's no Fitbit-style alarm that will wake you in the morning when the buds detect that you're in light sleep, but the Zenbuds' tiny batteries drain relatively quickly, so it's perhaps best not to rely on them to prevent you oversleeping.",
    "There's also a Focus option that works a little like a Pomodoro timer, playing audio for a certain length of time before reminding you to take a break. After you've rested for between five minutes and an hour, the sound will resume so you can get back to work.",
    "If that's not enough, the Zenbuds also offer sleep tracking. There's no need to activate this manually, either on the buds themselves or during the app; it will start automatically once you've dropped off.",
    "The results are surprising detailed, and are based on data from the buds' heart rate monitors and accelerometers. In the morning, you'll be able to see the time spent in deep sleep, light sleep, and awake, plus an overall sleep score (much like the one you'd get from a Fitbit).",
    "The Zenbuds don't detect REM sleep, but the results are otherwise on a par with those you'd get from most fitness trackers, and there's no need to wear an uncomfortable device on your wrist while you sleep. Impressively, the Zenbuds also tell you how your sleep habits compare with other users, which is data you have to pay for with some other fitness trackers. It's not as granular as the stats you get from Fitbit Premium (you aren't given benchmarks for people of the same age and gender), but it's useful guidance nonetheless.",
    "The Zenbuds even detect how long you spend lying on each side, and how often you turn during the night. This is data that can't be accurately gathered by a watch, and usually requires a dedicated sleep tracker that sits underneath your mattress like the Withings Sleep Analyzer. The nature of the earplugs means it's extremely accurate, and the results can be surprising (we hadn't realized we spent so long lying supine, on our back).",
    "Of course, the sleep tracking will only work if the buds remain securely in your ears, so it's particularly important to make sure you've selected the correct silicone cases before settling down for the night.",
    "First reviewed October 2021",
    "This article is part of TechRadar's Sleep Week 2021, our in-depth look at sleep and how to snooze better. We've teamed up with experts in their field to bring you proven sleep techniques and tips to help you drift off easier, and to stay asleep for longer, and have rounded-up the very best sleep kit to transform your bedroom into a den of zen. So from Sunday 31 October to Sunday 7 November we'll be sharing interviews, features and essential buying guides with the aim of helping you to sleep better than ever."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "6": "Design",
    "9": "Performance",
    "22": "Don't buy it if"
  },
  "links": {
    "Amazfit Zenbuds": "https://www.amazfit.com/en/zenbuds",
    "AcousticSheep SleepPhones": "https://www.techradar.com/reviews/sleepphones",
    "Bose Sleepbuds II": "https://www.techradar.com/reviews/bose-sleepbuds-ii-review",
    "QuietOn 3": "https://www.techradar.com/reviews/quieton-3",
    "sleep earplugs": "https://www.techradar.com/best/the-best-sleep-earplugs",
    "Indiegogo": "https://www.indiegogo.com/projects/amazfit-zenbuds-fit-right-sleep-tight#/",
    "on general sale direct from Amazfit": "https://www.amazfit.com/en/zenbuds",
    "running watches": "https://www.techradar.com/best/running-watches",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "sleep tracker": "https://www.techradar.com/best/best-sleep-tracker",
    "TechRadar's Sleep Week 2021": "https://www.techradar.com/news/welcome-to-techradars-sleep-week"
  }
}