{
  "source": "https://www.techradar.com/reviews/raven-pro-document-processing-scanner",
  "title": "Raven Pro Document Processing Scanner review",
  "category": "computing",
  "updated": "2021-11-25T09:20:31Z",
  "author": "mark-pickavance",
  "summary": "An Inexpensive document processing solution",
  "verdict": "While the Raven Pro doesn’t offer the whole document management experience, it does provide a valuable facility to those bent on removing old paperwork from their workspaces. With a little work, it could be so much more.",
  "pros": [
    "Easy to use",
    "Good quality scans",
    "Raven Cloud storage"
  ],
  "cons": [
    "Lacks real workflow processing",
    "No smart page separation",
    "Poor screen viewing angles"
  ],
  "article": [
    "Document processing first became popular in the 1990s, when companies handling large amounts of correspondence realised that misplacing a single piece of post could have substantial financial and legal implications.",
    "It was the financial sector most impacted with its reliance on paper communications so systematically ingrained.",
    "But document processing is about more than simply scanning all the mail onto an internal server each day. It’s about what happens once that has happened, and because of those complications, many in IT weren’t keen on managing the large amounts of data or the specialist hardware that proper document imaging demands.",
    "Those venturing on the document processing journey need reliable equipment and easy management to get the early wins that justify the investment, and that’s what the Raven Pro Document Processing Scanner promises.",
    "Is this the first step to an office devoid of folders and piles of paper or another device that will soon gather dust in a filing cabinet?",
    "Raven offers four scanners designated as Original, Standard, Compact, and the Pro model reviewed here. The Pro design comes directly from the makers in black and white colour schemes and costs $649.85 with free 2-day shipping in the USA. That price comes with free access to Raven Cloud Document Storage included, and at this time, there are no limits to how many scanned documents you can store on this facility.",
    "Unlike other scanners, document scanners designed for document processing workflow aren’t like the cheap and flimsy hardware printer makers throw on their multi-function printers.",
    "That’s because a sheet of paper might appear smooth to most people, but when a million sheets are pulled through a scanner, it has a similar impact to having scanned sandpaper repeatedly.",
    "The robust mechanics of the Raven Scanner Pro deflect some of those concerns, though most users might easily confuse this hardware with a small fax machine.",
    "Out of the box, the machine only requires the document in-feed tray to be added and the power block to be attached to be ready for use.",
    "In addition to the power block and cable, a USB line and an ink stamp with the word ‘Scanned’ cut into it are also provided.",
    "One way to use the scanner is via the 8-inch touch panel on the front of the scanner that dwarfs those on multi-function printers but dominates this hardware.",
    "This display is large and bright, but it has a viewing angle issue where it is pretty difficult to see when you are sitting in front of the scanner. It’s more easily viewed standing.",
    "It’s interesting to note that one of the available accessories is a stand for the scanner that increases the angle, and using this item ($29.85) might address that issue.",
    "While you can use this machine with a computer, connected by USB or networking, it will also operate in isolation if you provide a WiFi password or connect a LAN cable to enable it to access the internet.",
    "Internet connection is necessary to access updates to the Android system, but also to send scans to Cloud or email destinations.",
    "When you first connect the scanner to the internet, you can sign up to have an account with Raven enabling access to the Raven Cloud from the machine and through web access.",
    "Raven Cloud is one of the possible destinations for documents scanned, and you can configure those, the type of scanning needed and the quality from the touch interface.",
    "When we first powered our review hardware, it identified that an update was required, and during that update, it revealed that the operating system is Android. Not that you can install any apps on this system, but it shows that the touch screen is an Android tablet with a customised interface.",
    "All these functions can also be performed away from the scanner using the Raven Desktop application. This functionality allows the scanning job to be easily divided between a person loading and unloading the documents and another managing the scanning. That’s a much more efficient way of handling the job and maintains higher scanning throughput.",
    "From a scanning perspective, this machine is remarkably straightforward to deploy and use. Up to 100 sheets can be loaded onto the sheet feeder at the top and subsequently ejected from the front as it works its way through them.",
    "There seems little appreciable difference in scanning speed between the single-sided and double, colour, monochrome or the different resolutions available.",
    "The difference comes in how long it takes to dispatch those to their destination based on the increased size of higher resolution scans and the use of colour.",
    "The maximum scanning resolution is 600dpi, but if you want to save space and accept the reduced detail, a scanning dpi of 400, 300 or 200 can be chosen.",
    "Pages can be grouped into a single PDF file and organised by folder if the destination is storage. You can scan to JPG format, but that format doesn’t allow multiple images to merge into a single file.",
    "A significant strength of this system is the number of possible destinations that scanned documents might have.",
    "For those that trust cloud storage, possible destinations include Raven Cloud, Box, Dropbox, Evernote, Google Drive, OneDrive, OneNote, QuickBooks Online and SharePoint.",
    "If the intention is to keep files internally, custom destinations based on the file system of the Raven Desktop computer or any network destinations can also be used.",
    "You are not exclusively required to have a single destination, as a scan can go to multiple destinations automatically.",
    "Documents can also be OCR processed in the Cloud, allowing them to be searched for keywords that might help identify the source.",
    "The only problem with the OCR solution used here is that it only works for those documents sent to the Raven Cloud, as there isn’t any mechanism to search locally stored PDFs.",
    "Raven did include a self-inking rubber stamp, but some competitor designs have stamping built into their scanners to streamline this process.",
    "We also noted how American the software solution is, as paper sizes don't even mention A4 or A5. As many outside the USA don't use Letter sized paper, this is something that needs addressing.",
    "The scanning hardware is mostly about scanning the pages, but document processing is also about handling those documents, once scanned.",
    "With any document processing solution, the objective isn’t just a scan of a document. Equally important is the extra information that connects that document to a business process.",
    "The Raven Pro is specified to scan up to 6,000 pages a day, and that’s a substantial amount of scanning to perform on one machine in a working day.",
    "While each page might only take a second, it’s the organising of where the content goes and what happens with it that takes the genuine effort, as it is pointless scanning documents and then not being able to find the one that you need later.",
    "Raven has an OCR processing capability that can index the contents of a document allowing it to be searched for those words. That’s a good start and appreciated, but it’s only a tiny part of the wider process.",
    "Most companies that utilise document scanning have a specific mechanism to link those documents to a particular contact or task.",
    "The Raven approach to this requirement is called a ‘Workflow’, and different workflows are accessible from the Raven Desktop application. A Raven workflow defines what type of documents to expect, sets the quality of scanning and the destination for those files once they’re created.",
    "What’s good about these definitions is that they can also tailor the naming of the files and the folders they are sent, along with having multiple destinations.",
    "Therefore, it’s possible to have a document scanned and have a copy sent to a local server plus Raven Cloud in addition to being emailed to a specific address.",
    "That’s a useful feature and one reason for using the Raven Desktop application rather than the touch interface on the scanner.",
    "However, this isn’t the true definition of ‘workflow’ in this context, as it doesn’t embrace how the document might be the initial point of an internal business process.",
    "For full integration, the scanning of the documents needs to be connected to an external database or CRM solution, and the scanning team needs to tag each document in some way to create that link.",
    "Ideally, that might be identifying a quoted account number or reference, but the Raven system has no means to use the OCR in this way.",
    "We also noticed was that even if the Raven Pro scanner can accept 100 pages on the feeder, there isn’t any way to tell the system that these are, for example, ten different documents with separation pages in between.",
    "The scanner can be instructed to ignore blanks, but it can’t use them to identify a new document set, and that’s an unfortunate omission. What Raven users are forced to do is not reject blank pages and then use them as a guide to subsequently cut up the combined PDFs in Raven Cloud.",
    "That’s a clunky approach that could be significantly improved with either an option to initiate a new document on a blank page or a page with a special symbol on it, but this isn’t currently an option.",
    "And, while the Raven Desktop app supports lots of targets, what it fails to offer is any database interactions creating a record to prime a correspondence handling system that a letter has arrived that might need a swift reply.",
    "Most CRMs do have a mechanism that can take incoming emails and create tasks from them, but then dividing up that job for multiple departments from a single point of entry can be decidedly hand-cranked.",
    "The ability to interact with a database to create a record indexed by other workers viewing the scans would be beneficial for many companies.",
    "The upshot of these limitations is that the Raven Pro document handling solution isn’t appropriate for businesses that want to use document scanning to drive a team of response staff. It’s a very general solution that is more suitable for those that need to scan a collection of pages with the limited chance that these will need reviewing or connecting to other events in the future.",
    "For the modest amount of money it costs, the Raven Scanner Pro is an impressive piece of equipment that could handle scanning a reasonable number of documents daily.",
    "However, it’s mostly plastic, and we’re unsure exactly how long it might last if you sent 6,000 pages a day through it. In our experience, never underestimate the abrasive potential of paper.",
    "We’re also not sure that the interface of the Raven Cloud would cope well with that number of documents, as it only displays them in a maximum of 100 per web page.",
    "You can create folders to structure the contents, but an automatic folder generation function where folders are created by year, month and day by default would be massively helpful for volume users.",
    "Probably the best aspect of this solution is Raven Cloud, as it currently isn’t limited in how much you can place on there, and there is no subscription cost to using it, incredibly.",
    "It’s also the only way that OCR functionality works, enabling the searching of scanned documents. Scanned documents held locally can have third-party OCR software used on them, but that’s outside the scope of this product.",
    "The other missing piece of this jigsaw is that the Raven Pro scanner can’t separate multiple documents intelligently, slowing the scanning process. Each set of pages must be loaded individually and not in bulk, regrettably.",
    "That undermines the efficiency of the scanning workflow and having to manually stamp each page as ‘scanned’ is also time-consuming for those operating it.",
    "Because of these limitations and the inability to link to databases, this system isn’t well-positioned for the types of document processing done in the insurance and returns handling operations.",
    "What it’s ideal for are those jobs where senior people decide that they don’t like the space that many filing cabinets occupy with documents that must be kept reside. With the proviso that they’d like to send all that paperwork to be warehoused or shredded but still be searchable if need be.",
    "For a scanning blitz project, the Raven Pro and its associated Cloud and app are perfectly suited and affordably priced."
  ],
  "headers": {
    "5": "Price and availability",
    "6": "Design and build",
    "34": "Workflow",
    "53": "Final verdict"
  },
  "links": {
    "Raven": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3852227297324086300&xs=1&url=https%3A%2F%2Fwww.raven.com%2Fproducts%2Fraven-scanner-pro&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fraven-pro-document-processing-scanner"
  }
}