{
  "source": "https://www.techradar.com/reviews/acer-swift-x",
  "title": "Hands on: Acer Swift X review",
  "category": "computing",
  "updated": "2021-05-27T13:45:00Z",
  "author": "bill-thomas",
  "summary": "Another affordable Acer workhorse",
  "verdict": "The Acer Swift X looks to be a budget-friendly laptop that brings some serious power to a no-frills laptop chassis. It might be bland with some large bezels, but if you just want something that gets the job done, the Acer Swift X should probably be on your list.",
  "pros": [
    "Solid spec sheet",
    "Durable construction",
    "No gimmicks"
  ],
  "cons": [
    "Bland design",
    "Could use an SD card slot"
  ],
  "article": [
    "Ahead of Computex 2021, the Acer Swift X looks to bring the Acer Swift brand's affordability to the creative laptop world, and it's all about delivering solid specs at a great price, without relying on the extra features that make some of the best laptops so expensive.",
    "So the Acer Swift X isn't the thinnest or lightest laptop, it doesn't have a fancy OLED display, and its bezels aren’t the thinnest in the world. But what you do get is a speedy AMD Ryzen processor and up to an Nvidia GeForce RTX 3050 Ti, which will help you get your work done, even if you can't shell out for the fanciest laptop on the shelf.",
    "The Acer Swift X we have is an early version of the laptop, so we don't know how it will actually perform in the real world, but we can already tell that this is going to be a great laptop for anyone who just wants something that'll get the job done.",
    "The Acer Swift X will be available starting June 2021, beginning at $899 (about £640, AU$1,160). We’re not sure what the configuration will look like at that price point, though, but we expect it won’t include the fancy RTX 3050 Ti that the top-shelf config will have.",
    "We also don’t know how much that configuration will cost once it hits store shelves in June, though it will likely be a bit more expensive. But with the added GPU power, it’s probably going to be worth it if you plan to use the laptop for creative workloads.",
    "The Acer Swift X basically just looks like any other laptop, and that's what works in its favor. It keeps things simple, but it's not ugly, and you won't feel ashamed to have it out in a coffee shop - whenever working on a laptop in a coffee shop is a thing we can actually do again.",
    "The Acer Swift X is just 0.7 inches (17.9mm) thick, and weighs in at 3.06lb (1.39kg). That's bog-standard laptop design in 2021, but it's still the perfect size for throwing in your bag for your morning commute.",
    "Luckily, even though the Acer Swift X is a bit on the plain side, the chassis is extremely solid. We don’t know for sure, but it definitely feels like an aluminum case, and there is little to no flex anywhere. Even the display is extremely solid, and you shouldn’t have to worry about this laptop breaking if you accidentally drop it from your lap.",
    "But the standard thickness of the laptop does allow for a good selection of ports, especially by today's standards. Over on the left side of the laptop, you get an HDMI, a USB-A, a USB-C which can also be used for charging, and a dedicated charging port. Over on the right, there's another USB-A, a combo 3.5mm audio jack and a Kensington Lock port.",
    "While a lot of laptops these days are trimming larger ports, we're happy to see standard ports remain on the Acer Swift X, but given that the company is pitching the laptop to creative workers and students, we're a bit disappointed that there's no SD card reader here. There's plenty of room over on the right side of the laptop.",
    "The Acer Swift X has a 14-inch 1080 display, that hits 300 nits of brightness and 100% of the sRGB color gamut. It's fine for what it is, but a more colorful or higher-resolution display might be needed if you want to use it for creative work. But, if you're working on schoolwork or messing around with emails, it's basically perfect.",
    "The keyboard is also perfect to get some writing done, and is incredibly comfortable. Travel is nice and deep, and it doesn't make our fingers hurt when we bottom out. A lot of laptops skimp on a comfortable keyboard, but the Acer Swift X definitely doesn’t.",
    "The speakers are basically the bare minimum, though. You’re not really going to be able to fill a room with sound, but they will be fine if you want to hop on a quick call without scavenging to find your headphones. But as soon as you want to listen to some music, they will fall flat. We listened to “Kasvetli Kutlama” by She Past Away, and the bassline basically evaporated into the background, and not in a particularly good way.",
    "But that’s not necessarily what this laptop is even for. Just be ready to make sure you pack some headphones in your bag, especially if you need good audio for creative work.",
    "Because we don’t have our hands on a final production version of the Acer Swift X, we can’t run any of the benchmarks we typically would. However, we do have a spec sheet available, and it looks extremely promising.",
    "The Acer Swift X will have AMD Ryzen 5000 processors, with up to 8-cores and 16-threads, which means multitasking is going to be a breeze. And while the integrated graphics for those processors are extremely strong, Acer is pairing these CPUs with up to an Nvidia GeForce RTX 3050 Ti. Don’t think that this is really a gaming laptop, though.",
    "It seems more like this discrete graphics card is there to boost creative workloads like Adobe Premiere and Photoshop, rather than trying to play Cyberpunk 2077 on your lunchbreak – even though that option is open to you.",
    "But if you do want to do some light gaming in your downtime, the RTX 3050 Ti is a great fit for the 1080p display. With that GPU you should be able to play pretty much anything at native resolution, though you might have to lower quality settings in a couple games here and there.",
    "Again, though, because we don’t have our hands on a final version of the laptop, we can’t run it through our usual cadre of benchmarks and tests to see exactly what the Acer Swift X can do. But, just looking at it on paper, there probably isn’t much it can’t do.",
    "The Acer Swift X is an unassuming little workhorse of a laptop. It’s not exactly going to turn heads when you visit your local coffee shop, but that’s not really what it’s there for. If you’ve been looking for a laptop that will just get the work done without any extra bells and whistles, this might be a great laptop for you.",
    "And while we haven’t had a chance to fully test the Acer Swift X, it follows in the footsteps of the Acer Swift lineup, and that’s something that we’ll never have a problem with. This is the laptop you get when budget and productivity are at the top of your list – and these days, that’s all we can ask for."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and availability",
    "5": "Design",
    "14": "Performance",
    "19": "Early verdict"
  },
  "links": {
    "Computex 2021": "https://www.techradar.com/news/computex-2021",
    "creative laptop": "https://www.techradar.com/news/best-laptops-for-video-editing",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Nvidia GeForce RTX 3050 Ti": "https://www.techradar.com/news/nvidia-geforce-rtx-3050-release-date-price-and-mobile-version-what-do-we-know"
  }
}