{
  "source": "https://www.techradar.com/reviews/ricoh-document-management-solution",
  "title": "Ricoh document management solution review",
  "category": "computing",
  "updated": "2021-08-25T16:41:10Z",
  "author": "daniel-blechynden",
  "summary": "Can this company match up with the big players?",
  "verdict": "Despite nearly six decades of experience in the evolving digital world, our in-depth review shows that Ricoh USA clearly can’t match up with the best when it comes to document management.",
  "pros": [
    "All-in-one document management solutions",
    "Uses leading Docuware and Laserfiche software"
  ],
  "cons": [
    "Little to no information about security practices",
    "Support is average at best"
  ],
  "article": [
    "The best document management software is designed to help you take control of important business documents, ordering and storing them in a safe and secure manner. There are numerous different systems available, with managed and unmanaged options for businesses of all sizes.",
    "In our Ricoh USA, Inc. review, we take a close look at this company’s document management solutions. It isn’t the most popular option among modern businesses, so we wanted to see just how well it stacks up against the industry giants.",
    "Like many companies working in the document management space, Ricoh provides custom solutions based on the size of your business and your exact needs. Therefore, you will need to fill out an online form to request a consultation with a sales agent.",
    "One thing you should be aware of is that Ricoh partners with third-party platforms to provide its document management solutions. For example, it uses the Laserfiche and DocuWare storage platforms, which are leaders in the field, along with various other programs for document scanning and workflow management.",
    "Unfortunately, Ricoh provides little information about exactly what its document management solutions include. This is partly because it offers custom solutions, but we would have liked to see some sort of breakdown.",
    "Overall, the company focuses on three separate parts of the document management process: managed printing, content storage and organization, and automated business workflows.",
    "For starters, the managed printing aspect covers everything from print permissions to ensuring that only relevant documents are printed. By setting clear printing rules, you can minimize paper use and ensure that sensitive documents aren’t stolen or lost.",
    "Content management involves full storage, organization, and sharing solutions. These are provided through the third-party DocuWare and Laserfiche programs.",
    "Lastly, you can automate document workflows to make sure they are passed from department to department with maximum efficiency. Reduce long processing times, and ensure that all documents are dealt with quickly and efficiently.",
    "To get started with Ricoh, you will need to speak with a sales team member to figure out your exact requirements and which platform will be best suited to your needs. Because Ricoh offers a selection of software options, different clients will experience significantly different user interfaces.",
    "Fortunately, though, since the company almost exclusively uses Laserfiche and DocuWare, you can rest assured that your management dashboard will be streamlined and fully functional.",
    "Ricoh USA offers various support options, including phone, email, and live chat services, for all existing customers. That said, we tested the live chat and received a message stating that support is only available between 8:00 am and 5:00 pm CST, Monday to Friday.",
    "Unfortunately, the self-help resources aren’t much better. The main content on the support page is dedicated to downloading new products. The actual support links are at the bottom of the page.",
    "The knowledge base appears to contain excellent information, but a closer look reveals that it’s more limited than it seems. There are few resources devoted to document management and virtually none exploring the Laserfiche and DocuWare platforms.",
    "Unfortunately, Ricoh USA doesn’t appear to provide any publicly available information about its security practices. This is concerning because you would be trusting the company to work with your sensitive documents and other information. A security breach could be devastating, especially if personal or private documents are stolen.",
    "That said, Ricoh does offer a range of managed security solutions, which suggests that it at least takes the idea seriously. In our opinion, the best thing to do here would be to speak with the sales team about the company’s security practices before committing to using its services.",
    "There are numerous document management platforms on the market that you might like to consider for your needs, including Templafy and M-Files, two of our favorites.",
    "Templafy is a beginner-friendly document management platform that’s designed to make your life easier. It comes with a suite of excellent tools and enables you to connect from a range of different devices. On top of this, your business will benefit from automatic compliance checks related to your field.",
    "M-Files is an excellent option for those working with large document volumes. It focuses on improving business efficiency and internal workflows. With great file categorization tools, third-party app integrations, and more, there’s much to like here.",
    "Unfortunately, we can’t recommend Ricoh as a leading document management solution provider. It does everything that it needs to, but there’s nothing to make it stand out from the crowd.",
    "For example, the company provides little information about exactly what its solutions include. It uses third-party software (albeit high-quality ones), provides no information about its security practices, and has below-average support services.",
    "The bottom line is that we recommend considering another provider for your document management needs."
  ],
  "headers": {
    "2": "Ricoh USA: Plans and pricing",
    "4": "Ricoh USA: Features",
    "9": "Ricoh USA: Interface and in use",
    "11": "Ricoh USA: Support",
    "14": "Ricoh USA: Security",
    "16": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "best document management software": "https://www.techradar.com/best/best-document-management-software",
    "Ricoh USA, Inc.": "https://www.ricoh-usa.com/en"
  }
}