{
  "source": "https://www.techradar.com/reviews/steelseries-arctis-prime-gaming-headset",
  "title": "SteelSeries Arctis Prime gaming headset review",
  "category": "computing",
  "updated": "2021-06-28T22:36:48Z",
  "author": "mark-knapp",
  "summary": "A little too simple for Arctis",
  "verdict": "The SteelSeries Arctis Prime borrows a lot from the rest of the Arctis family, particularly benefiting from the premium design and Hi-Fi drivers of its more expensive siblings. It does the job when it's time to game, but the basic wired connection and lack of any SteelSeries software integration leave out some of SteelSeries’ most handy features for team communication.",
  "pros": [
    "Upgraded drivers",
    "Noise-isolation",
    "Comfortable"
  ],
  "cons": [
    "No Sidetone",
    "No ChatMix",
    "A bit creaky"
  ],
  "article": [
    "The SteelSeries Arctis line of gaming headsets is seemingly never going to end, and the SteelSeries Arctis Prime adds itself right into the middle of the mix at $99 (£99, AU$119) while offering a very focused package that competitive gamers might like.",
    "At this price, the Arctis Prime competes directly with the Arctis 1 Wireless, but the two headsets offer different experiences. The Arctis Prime is focused on competitive play and brings some of the Arctis line’s most premium elements to a lower price point, having more in common with the $89 (about £65, AU$115) Logitech G Pro gaming headset. Meanwhile, the Arctis 1 Wireless goes for a simpler design but brings with it wireless connectivity on a budget.",
    "The Arctis Prime borrows the steel headband design found on the Arctis 7, 9, and Pro series, and naturally includes the same ski band suspension system found on those headsets. As a result, it remains perfectly comfortable on the crown of our head thanks to the even distribution of weight. Despite the visually similar structures, the Arctis Prime ear cups are considerably creakier than those on the Arctis Pro Wireless and Arctis 9X we have on hand, despite those latter headphones having seen considerable use already. The other thing it borrows is the Hi-Fi speaker drivers of the Arctis Pro family to offer an extended frequency response range.",
    "Beyond this, the Arctis Prime is a fairly simple headset. It uses a wired connection (still using SteelSeries’ odd connector on the headset-end, as well as a second standard 3.5mm port that works for both input and sharing audio) with a 3.5mm combo connector as well as a mic/headset splitter included in the package. The headset continues to offer on-ear controls with a volume dial and a mic mute switch, but it doesn’t have a light to visibly indicate when the mic is muted like other premium Arctis headsets. It also has the retractable ClearCast boom mic that’s featured prominently on this series.",
    "The headset differentiates itself a little from the other Arctis headset by skipping the comfy, breathable AirWeave fabric for its ear pads and instead goes for a noise-isolating leatherette finish that makes them a little hotter but definitely cuts down on external noise better. The headset also more prominently features the SteelSeries logo on each ear cup, whereas past headsets stuck to smaller and more subtle branding.",
    "The Arctis Prime holds up quite well in play. We’re able to keep our own back covered in Counter Strike: Global Offensive by picking up on enemy footsteps coming around a corner. We can also separate out enemy bullets hitting the ground nearby even as we sprint across fields and listen to our teammates chatter in Call of Duty: Warzone – an important cue to detect. The headset can really boom with the action, too.",
    "Sometimes, the low-end sucks a bit of the life out of the high-end, though it doesn’t quite muddy it or drown it out, but we notice it lowering the energy of the high-end – particularly in music if there’s ever loud bass. Of course, this headset is focused on gaming more than music.",
    "That said, the Arctis Prime does miss out on two SteelSeries features we find really useful while gaming competitively: mic sidetone and ChatMix. Sidetone lets you hear your own voice through your microphone, which can really help us avoid shouting when the game audio gets loud (and thereby communicate better with our team), and ChatMix makes it easy to balance game and comms audio levels on the fly, ensuring the game never drowns out your team comms and vice versa. This exclusion makes the equally-priced Arctis 5 a particularly attractive alternative.",
    "There may be a niche for the Arctis Prime where the exact tuning of the drivers and leather-like ear cushions really matter, but where they don’t, the Arctis 5 and Arctis One Wireless appear to be offering more functionality for gamers to enjoy."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Don’t buy it if…"
  },
  "links": {
    "gaming headsets": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "Arctis 1 Wireless": "https://www.techradar.com/reviews/steelseries-arctis-1-wireless",
    "Logitech G Pro gaming headset": "https://www.techradar.com/reviews/logitech-g-pro-gaming-headset"
  }
}