{
  "source": "https://www.techradar.com/reviews/ninja-foodi-11-in-1-smartlid-multi-cooker",
  "title": "Ninja Foodi 11-in-1 SmartLid Multi-Cooker review",
  "category": "appliances",
  "updated": "2021-11-24T11:00:45Z",
  "author": "helen-mccue",
  "summary": "An expensive multicooker but it’s innovative features come in handy",
  "verdict": "The Ninja Foodi 11-in-1 SmartLid Multi-Cooker is the smallest of Ninja’s new innovative multi-cooker range, yet it still has plenty of cooking functions and a decent 6.5 quart/ 6 liter capacity. Combining functions such as air frying and baking with pressure cooking and steaming using just one lid is a fantastic innovation from Ninja. This model has fewer features than its bigger brother and it’s chunky but it’s still a great versatile multi-cooker albeit with a high price tag.",
  "pros": [
    "One lid for all cooking functions",
    "Dishwasher safe accessories",
    "Versatile and easy to use"
  ],
  "cons": [
    "Expensive",
    "Lacks some of the features of the more premium model",
    "Cooking pot doesn’t have a flat base"
  ],
  "article": [
    "Ninja is a brand that prides itself in its ability to continually innovate and come up with solutions to some of your biggest kitchen frustrations. It’s already a go-to brand for some of the best Instant Pot alternatives, but its new range of SmartLid multi-cookers has taken the already versatile kitchen appliance to the next level.",
    "The Ninja Foodi 11-in-1 SmartLid Multi-Cooker is known as the Ninja Foodi 14-in-1 6.5 quart Pressure Cooker Steam Fryer with SmartLid in the US. The two models are very similar, but the US model has additional proof and sous vide functions and comes with a cook and crisp plate instead of a basket.",
    "The slider on the lid has three positions, each one unlocking different functions, so it’s always correctly sealed for the cooking function you’re using, it couldn’t be simpler. And not content with the innovative new lid, Ninja has also introduced new combination steam functions that mean you can steam and crisp at the same time for the juiciest results.",
    "This model is the smallest in the range, but at 6 litre / 6.5 quart it’ll still be big enough for four-person households. And while it’s still an expensive multi-cooker, it’s cheaper than the most premium model in this range, but it does lack the meat probe and the automatic steam release as well as some of the cooking functions that you get with the top-of-the-range model in the Ninja SmartLid multi-cooker line-up.",
    "It’s a great multi-cooker that produced excellent results during testing, it’s very easy to use and really would suit most people looking for a multi-cooker that can also air fry and bake, but if you’re on a budget there are less expensive options so long as you’re happy to switch lids.",
    "As we mentioned above the Ninja Foodi 11-in-1 SmartLid Multi-Cooker is known as the Ninja Foodi 14-in-1 6.5 quart Pressure Cooker Steam Fryer with SmartLid in the US, and it’ll set you back £229.99 / $279.99. It’s available from the Ninja Kitchen website in both the US and the UK.",
    "This is the smallest and least expensive of the innovative SmartLid range of multi-cookers from Ninja. However, it is still an expensive option. The Ninja Foodi Max 15-in-1 SmartLid Multi-Cooker, which is known as the Ninja Foodi 14-in-1 8-qt. Smart XL Pressure Cooker Steam Fryer with SmartLid in the US, is the most expensive model in the line-up at £299.99 / $349.99.",
    "It might be the smallest multi-cooker in the range but the Ninja Foodi 11-in-1 SmartLid Multi-Cooker isn’t exactly petite. It measures 33 x 35 x 36cm /13.07 x 14.21 x 15.39 inches (h x w x d) and at 10.9kg / 24 lb it’s not light either, so you won’t want to move it in and out of a cupboard every day.",
    "This SmartLid range from Ninja utilizes a slider on the lid with three positions, and it allows you to select cooking functions based on the position of the slider. This ensures the lid is always correctly locked or unlocked for the function you’re using.",
    "The UK model has 11 cooking functions: pressure, steam air fry, steam bake, air fry, grill, bake, dehydrate, sear/ sauté, steam, slow cook and yogurt. The US model has all of the same cooking functions plus proof and sous vide.",
    "The removable cooking pot has a non-stick coating to make it easy to clean but it’s also dishwasher safe. The other accessories are also dishwasher safe and include a reversible rack and a Cook & Crisp basket in the UK or Cook & Crisp plate in the US.",
    "We found the menus and settings very intuitive to use. It doesn’t have preset programs for different foods or meals, but instead comes with a recipe booklet that includes cooking charts detailing how best to cook all of your favorite foods.",
    "We used several different cooking methods and made some delicious meals with this easy-to-use appliance.",
    "We started off by making chunky fries using the air fry function. One of the great things about this multi-cooker is that it comes with lots of cooking charts giving advice on times and settings, so we followed the suggestion for chunky fries and set it for 22 minutes. During cooking, we turned and stirred the fries three times to help with browning. At the end of the 22 minutes, we added an additional three minutes to increase the browning to our liking which gave us deliciously crisp fries with fluffy centers.",
    "To steam broccoli, we again followed the advice in the cooking chart, adding water to the pot and putting our broccoli florets on the reversible rack. The rack is fine for chunky veg but won’t work for smaller pieces as they’ll fall through. We set it to steam for six minutes, there was a seven-minute preheat but after the 13 minute total cook time, the broccoli was perfectly cooked and al dente. During cooking, steam vents out of the back of the appliance so it’s best to be near a cooker hood or window, if you place it under a shelf or wall cupboard you’ll get condensation collecting from all the steam.",
    "Cooking brown basmati rice to the perfect texture was easy. The cooking chart didn’t let us down, giving the perfect time for pressure-cooked rice, but you may need to experiment if you want to make more or less than the suggested quantity. Setting it to pressure cook on high was easy, it preheated for seven and a half minutes, then cooked for a further seven minutes. The chart suggests a delayed pressure release so we left it for 10 minutes before flicking the valve into the vent position which quickly released any remaining steam. The 25 minute cook time is only slightly longer than cooking it on the stove, but the results were perfect and it’s nice not to have to watch over it.",
    "We utilised the pressure cooker again to make a Thai red curry, browning chicken legs first using the sauté function. The base of the pot isn’t flat, and we noticed that all of the oil settles around the outer edges, meaning we had to place the chicken at the edges to ensure it was fried in the oil. This was probably the biggest downside while using this appliance. That said, the chicken browned well and it’s not too much of a problem if you keep moving and stirring your ingredients.",
    "Once the rest of the curry ingredients were in the pot, we set it to pressure cook on high for 20 minutes. The preheat was nine minutes and at the end of cooking, we flicked the pressure release valve to the vent position which took three and half minutes and registered 77dB on our decibel meter, which is equivalent to the sound a car traveling at 65mph makes.",
    "The pressure release is easy but does involve putting your hands near the area where the steam is released, you can make this safer by using tongs to move the valve. The chicken was beautifully cooked and fell off the bone at the end of cooking.",
    "To make a slow-cooked chili we used the sauté function again to brown the beef and vegetables before setting it to slow cook on high for six hours. The chili thickened up significantly during cooking, giving us a rich and tasty dinner for very little effort.",
    "Finally, we had a go with the new steam air fry function which claims to crisp foods as well as steam to keep them moist and succulent. Following the suggestions in the cooking chart, we added water to the pot and placed two skin-on chicken breasts onto the rack. The steam preheat took six minutes and then it started counting down our 20 minute cook time.",
    "Like when using the steam only function it emits lots of steam from the vent at the back and the noise level is similar to air frying. The sides of the lid reached 45 C /113 F, which is the hottest temperature we recorded on the exterior of this appliance during any of our tests, for the most part it stays cool enough to touch. At the end of cooking the chicken was moist and succulent on the inside but with very crisp golden skin on top, an excellent result."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Ninja Foodi 11-in-1 SmartLid Multi-Cooker price and availability",
    "7": "Design",
    "12": "Performance",
    "22": "Don't buy it if..."
  },
  "links": {
    "best Instant Pot": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers"
  }
}