{
  "source": "https://www.techradar.com/reviews/tcl-20s",
  "title": "TCL 20S review",
  "category": "phones",
  "updated": "2021-10-07T02:42:29Z",
  "author": "david-lumb",
  "summary": "A budget phone with a great screen",
  "verdict": "The TCL 20S is an impressive budget phone for its price, with a crisp Full HD Plus display, decent camera suite, big 5,000mAh battery, and other features that are more in line with a mid-range handset. While nothing particularly stands out about the phone (besides the display), it isn’t lacking in any category either, making it a strong all-rounder.",
  "pros": [
    "Crisp, vibrant display",
    "Respectable cameras",
    "Big 5,000mAh battery"
  ],
  "cons": [
    "No telephoto lens",
    "Battery is slow to charge",
    "Night photography isn’t great"
  ],
  "article": [
    "The TCL 20S is proof that TCL’s approach bringing mid-range and flagship features to a budget price point isn’t just possible, it makes other phonemakers look like they aren’t trying hard enough.",
    "The TCL 20S is one of the brand’s best combinations of a quality 6.67-inch LCD display and refined design yet, and comes at a very competitive price.",
    "It’s a reasonably powerful phone, too, packing a Snapdragon 665 chipset, either 4GB or 6GB of RAM, and 128GB or 256GB of storage (expandable up to 1TB via microSD). While not outstanding, those specs are great for the price, and the 20S is easily zippy enough for browsing the internet and bingeing media.",
    "Like other TCL phones released in 2021, one of the TCL 20S’s strongest points is its 6.67-inch Full HD Plus display, which has a remarkably vivid and crisp picture, often rivaling or even exceeding the quality of video on current flagship phones like the Google Pixel 5 and iPhone 12 Pro.",
    "The TCL 20S has a decent suite of cameras, too, with a 64MP main shooter and 8MP ultra-wide camera to take care of the essentials (plus 2MP macro and 2MP depth sensors to assist your photography). They take crisp photos, both close up and at longer distances using digital zooming, albeit with darker and more underexposed shots taken with other phones.",
    "The 5,000mAh battery is also respectable, though there are other budget phones around that have the same, or greater, capacity, like the Moto G Power. But that’s representative of the TCL 20S overall – it’s as good as other phones but in pretty much every category, making it a budget handset without many weaknesses.",
    "After being announced in April 2021, the TCL 20S release date was May 20 in some regions. While TCL sells the 20S on its store in the US, it's unclear where it's sold in other countries, as the phone isn't listed on its UK or AU stores, for instance.",
    "The TCL 20S price starts at $249 (around £180 / AU$345) for the 4GB RAM and 128GB storage version. While we know it comes in a slightly better-specced 6GB RAM and 256GB storage version (and have seen listings of such), it's unclear what TCL's official pricing is for that configuration.",
    "The TCL 20S comes in two colors: Milky Way Gray and North Star Blue.",
    "The TCL 20S’s design has been refined over its predecessors, and it looks more like a mid-range phone than a budget device. At 199g, it’s not light, but plenty of flagship phones are heavier.",
    "It’s on the larger end of the smartphone spectrum with a 6.67-inch display, which has noticeable but not excessively large bezels. The rear cover is plastic, and feels plastic, but has a matte finish for a classier look.",
    "The camera block at the top-left of the rear is long and thin, with four lenses aligned vertically – it’s the only feature on the rear of the phone besides a TCL logo at the bottom-left. Sandwiched between the front and back casings, the phone’s plastic side rim has a chromed appearance for a more refined look.",
    "The phone has a wide lock button in the middle of the right side that also serves as a fingerprint scanner, and it’s lightning-quick at recognizing prints. It’s convenient to reach, located roughly where the thumb rests when the phone is held in the right hand, which means the volume rocker just above the lock button is a little tougher to reach.",
    "On the left side there’s a button that summons Google Assistant, although regrettably, this isn’t customizable – we’d much prefer a function button that can be set to a shortcut to open apps or other features. On the bottom of the phone there’s a USB-C port in the center with speaker grilles to either side, while on the top there’s a 3.5mm headphone jack on the left and a microphone on the right.",
    "Like the other 20-series phones TCL has released this year, the TCL 20S’s 6.67-inch LCD Full HD Plus (2400 x 1080 resolution) display is one of its strengths, offering a vibrant and crisp picture. While the display only has the ‘standard’ 60Hz refresh rate – many phones, including mid-range handsets, are now 90Hz or faster – it’s a higher resolution than other TCL budget phones (the TCL 20SE only has standard HD at 1640 x 720).",
    "It’s a testament to TCL that the 20S’s display has a picture that rivals far pricier phones. In a side by side comparison watching a 4K video on YouTube, the phone showed very clear detail in subjects and landscapes on the same level as displays of other flagship phones, like the iPhone 12 Pro.",
    "The display is broken up by a punch-hole for the 16MP f/2.2 selfie camera in the top-center of the screen, and, as we’ve mentioned, it has noticeable but not overly deep bezels all around. It looks more premium than its price would suggest, even if bezels have been slimming on even budget phones for years now.",
    "The TCL 20S’s suite of cameras offers respectable variety for a budget phone. While it doesn’t have a telephoto lens, not many phones at this price point do, so its main and ultra-wide cameras handle all photos, and they do so impressively.",
    "The TCL 20’s rear array comprises a 64MP f/1.8 main shooter and an 8MP f/2.2 ultra- wide camera, supplemented by 2MP f/2.4 macro and 2MP f/2.4 depth sensors.",
    "Images look pretty respectable, with good detail. The TCL 20S’s images are noticeably a bit dimmer than those taken with pricier phones, but aside from a slight lack of clarity in shadows, the 20S takes decent daylight shots with its main and ultra-wide lenses.",
    "While the lack of a telephoto lens is evident, the digital zoom on the primary cameras isn’t that much worse than that on handsets that also have limited optical zoom, like the iPhone 12 Pro. In daylight and at maximum zoom, distant subjects showed the same degree of slight blur as in zoomed shots taken with phones much pricier than the TCL 20S.",
    "The TCL 20S has good daylight photography, even if its coloring changes between main and ultra-wide cameras.",
    "The phone doesn't have a telephoto lens, but crops in the image to zoom decently well:",
    "The phone also takes decent food photos, though it might be tough to get the subjects lit enough.",
    "The TCL 20S has respectable specs, on par or better than other budget phones at the same price point. The phone runs on the Snapdragon 665 chipset, and comes with 4GB RAM and 128GB of storage or 6GB and 256GB (though the storage is expandable up to 1TB via microSD card).",
    "Those middling specs deliver correspondingly middling benchmark scores. On Geekbench 5, the TCL 20S scored an average 1343, which is a bit lower than the 1582 scored by the comparably-priced and specced OnePlus Nord N200 5G. But that doesn’t mean this phone is a slouch when it comes to performing everyday tasks: on the contrary, it plays online games like Wild Rift and streams shows on Netflix just fine.",
    "The phone runs Android 11 out of the box with TCL’s own overlay, which is pretty light on bloatware but does rearrange the settings somewhat. These include some TCL-only NXTVISION display options for more vibrant color, although we didn’t notice much difference when they were turned on.",
    "The TCL 20S packs a 5,000mAh battery, which is quite large for a budget phone, and should comfortably last you a day and change from a full charge. It’s good for sustained media watching and playing – a 20-minute Wild Rift match, for instance, drained just 5% battery, while a 30-minute TV show took a mere 3%.",
    "That 5,000mAh capacity isn’t especially remarkable – the Moto G Power also has a 5,000mAh battery (and the Moto G9 Power sold in other regions has a 6,000mAh battery) – but it’s still great for this price range.",
    "The in-box charger isn’t particularly fast, recharging the phone to 66% in an hour, 79% after 90 minutes, and fully charging it in under two hours. While other phones have much faster chargers – the Asus ROG 5’s 65W charger can refill 90% of that phone’s massive 6,000mAh battery in just 45 minutes – it’s the TCL 20S’s large capacity that will be more important to most users at this price point.",
    "First reviewed: October 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "TCL 20S price and release date",
    "9": "Design",
    "14": "Display",
    "17": "Cameras",
    "21": "Camera samples",
    "24": "Performance and specs",
    "27": "Battery life",
    "30": "Don’t buy it if…"
  },
  "links": {
    "listings": "https://phoneaqua.com/tcl-20s-6gb-ram-5632.php"
  }
}