{
  "source": "https://www.techradar.com/reviews/astro-a20-wireless-gen-2",
  "title": "Astro A20 Wireless Gen 2 review",
  "category": "gaming",
  "updated": "2021-03-06T04:41:38Z",
  "author": "nick-pino",
  "summary": "A solid stereo headset for Xbox Series X and PS5 with good connectivity and sound",
  "verdict": "Thanks to its incredible flexibility, mid-range audio and ease-of-use, the Astro A20 remains a great choice for gamers. However, there are a few other alternatives that offer better comfort, virtual surround sound and longer battery life for only a little bit more money.",
  "pros": [
    "Plug and play design",
    "Fantastic mid-range audio",
    "Lift-to-mute microphone",
    "Multiplatform (with two dongles)"
  ],
  "cons": [
    "Rubber padding on bridge",
    "Not a great audio range",
    "No Bluetooth or 3.5mm jack",
    "Middling battery life"
  ],
  "article": [
    "The Astro A20 has long been seen as the gold standard in wireless gaming headsets. For years it has been the go-to gaming headset if you didn’t want to drop a ton of money thanks to its incredible vocal clarity, strong connectivity and a plug-and-play USB dongle.",
    "Its latest incarnation, the Astro A20 Gen. 2, offers compatibility with both next-gen consoles – the PS5 and Xbox Series X – as well as PC and Mac. You’ll need to buy a separate dongle for both Xbox and PlayStation if you want the headset to work across all platforms, but it is a decent solution if you’re tired of buying different headsets for each console.",
    "While it doesn’t do much to shake up the A20’s design besides swapping out the charging port to USB-C and ups the wireless range from 30 feet offered by the first-gen model to 50 feet in Gen. 2, it does lower the price from $150 to an even more reasonable $120 (£99, AU$279). That means the new Astro A20 Gen. 2 is cheaper than its two main competitors, the SteelSeries Arctis 9X and HyperX Cloud II Wireless, but it’s missing a few connectivity options and comes with a few caveats in the design and performance departments.",
    "If you can overlook the rubber padding on the bridge, lack of both Bluetooth and 3.5mm audio jacks, and don’t mind its limited battery life, the new Astro A20 Gen. 2 is a solid stereo headset that can still compete with more recent models while retaining a lot of what made the headset so great when it came out a few years ago.",
    "The Astro A20 Gen. 2 is a hardware refresh of a headset that came out back in 2017 for Xbox One, PS4 and PC. The new Astro A20 Gen. 2 was released at the end of 2020 for the launch of the PS5 and Xbox Series X at a new lower price of $119 (£99, AU$279).",
    "The Astro A20 Gen. 2 comes in two variants: one that works for PC/Mac and PlayStation consoles (PS4 and PS5), and another that works on PC/Mac and Xbox consoles that include the Xbox One, Xbox One X, Xbox One S, Xbox Series X and Xbox Series S.",
    "There’s a slight difference in how the two technologies connect, but otherwise you can tell the two variants apart by their color schemes. The PlayStation version is white and black with blue accents while the Xbox version is white and black with green accents.",
    "Regardless of which color scheme you get, the construction is the same - and it’s all plastic with bits of rubber and soft fabric earpads. The plastic build is a bit disconcerting as plastic headsets are more prone to snapping than their metal counterparts, but as a tradeoff they’re a bit lighter and can be more comfortable, too.",
    "That, largely, is the case for the Astro A20 but we did feel that the rubber pad along the bridge can pull on your hair and isn’t as comfortable as a foam pad would’ve been.",
    "Attaching the bridge to the earcups are plastic extendable hinges that should fit most head sizes. My slightly smaller dome fit in their pretty snugly - which isn’t always the case for headsets - and I felt that there was just the right amount of clamping force keeping them on my head. That might not be the case for you, however, so it’s worth paying extra attention to their fit before you get too far outside of a potential return policy.",
    "Along the earcups, you'll find a few different buttons on the headset's right can, including Voice and Game audio buttons that nudge the balance towards one or the other, as well as a general volume dial right in between them. There's also an equalizer button for swapping through presets, as well as an overall power on-off button.",
    "Like other Astro headsets, the microphone has flip-to-mute capabilities, meaning it's automatically silenced when you turn it up so that it's flush with the connecting arm. That's so much better than fumbling for a mute button while playing, though it would’ve been nice if the mic was completely detachable like it is on other headsets in the same price range.",
    "Unsurprisingly, the Astro A20 Gen. 2 sounds just as good as its predecessor. It brings a particular focus to the mid-range, helping dialogue and footsteps cut through intense gunfire and explosions. Sometimes this can come at the expense of the lower and higher frequencies, but the Astro A20 Gen. 2 feels perfectly tuned for a chat headset.",
    "We tried a number of different games while wearing the Astro A20 Gen. 2, but we spent the most time with Cyberpunk 2077 and Fortnite on the Xbox Series X, and a new co-op game called It Takes Two on the PC. We took a number of meetings with the headset on, and everyone we spoke to said we sounded crisp and clear.",
    "The experience, largely, was the same for each – clear dialogue and decent bass response. Cyberpunk 2077’s Night City felt more alive with the headset on and firefights became more intense. It was easier to locate treasure chests in Fortnite when we could hear their radiating aura from further away. In It Takes Two, we had no problems hearing our co-op partner and they didn’t have a hard time hearing us, either.",
    "The only downside? All of these sounds were limited to the horizontal audio plane. We really never got a sense of verticality with the headset, which is something that’s offered on some of Astro’s competitors.",
    "We’d also say that this really isn’t the most musically oriented gaming headset out there, either. The soundstage is relatively limited when it comes to audio due to the closed-back design of the headset, and there’s a distinct lack of detail.",
    "Playing around with the EQ button on the side of the headset can sometimes help add a little oomph to the highs and lows of the audio spectrum, but there’s no way to tell which EQ setting you’re using without an updated version of the Astro Command Center. (The version available on the Microsoft Store currently doesn’t recognize the Astro A20 Gen. 2.)",
    "Frustratingly, the only way to connect the headset is through the included dongle. There’s no built-in Bluetooth that you could use to pair the headset to your phone for phone calls, and there’s not even a 3.5mm headphone jack if you run out of battery.",
    "Speaking of battery life, A20 Gen. 2 has enough juice for 15 hours of playback, according to Astro. That’s a number that we found mostly accurate, if a little on the high side. We were able to get about two work days with it playing music and gaming before it needed to be re-charged.",
    "While 15 hours is definitely enough to get you through a weekend, it’s half the length of time that the Astro A20 Gen. 2’s rivals, the SteelSeries Arctis 9X and HyperX Cloud II Wireless, offer. Both of those clock in at around 30 hours wireless, and the battery life here is a far cry from the Sennheiser GSP 370 that claims to reach up to 100 hours of playback before needing a charge.",
    "The good news here is that the Astro A20 Gen. 2 does have an auto-shutoff feature that will kick in after 10 minutes, reducing the amount of battery wasted in standby mode – though it only seems to work on PC, not on consoles. When it works it’s a nice feature if you often forget to turn off your headset, and it helps maximize battery life.",
    "Recharging takes a little over an hour and uses the aforementioned USB-C port."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Release date and price",
    "5": "Design",
    "12": "Performance",
    "19": "Battery life",
    "23": "Don’t buy it if…"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "SteelSeries Arctis 9X": "https://www.techradar.com/reviews/steelseries-arctis-9x",
    "HyperX Cloud II Wireless": "https://www.techradar.com/reviews/hyperx-cloud-ii-wireless"
  }
}