{
  "source": "https://www.techradar.com/reviews/aoc-agon-ag493ucx2",
  "title": "AOC Agon AG493UCX2 review",
  "category": "computing",
  "updated": "2021-12-06T16:31:14Z",
  "author": "jeremy-laird",
  "summary": "49-inch ultrawide gaming on an epic scale",
  "verdict": "AOC’s revised 49-inch panel brings ultrawide gaming on an epic scale with improved 165Hz refresh performance but also poor HDR performance and dubious value for money.",
  "pros": [
    "Epic ultrawide gaming experience",
    "Fairly quick and responsive",
    "Lots of inputs"
  ],
  "cons": [
    "Poor HDR performance",
    "Pretty pricey"
  ],
  "article": [
    "Can you have too much of a good thing? Such is the question posed by the epic, immense, AOC Agon AG493UCX2, a 49-inch beast of a gaming monitor. It’s actually a moderate update of AOC’s existing AG493UCX, though that makes it no less immediately impactful.",
    "As before, the star of the show is the massive 49-inch super-ultra-whatever-wide VA panel with an aspect ratio of 32:9 and 5,120 by 1,440 pixels. This time around, AOC has upped the refresh ante from 120Hz to 165Hz.",
    "As before there’s basic HDR support in the form of DisplayHDR 400 certification, but the claimed peak brightness has actually dropped from 550 nits to 400 nits. We suspect that reflects a change in the way brightness is measured rather than any actual substantial dimming. Whatever, this revised model still has a single, monolithic backlight with no local dimming, so expectations regarding HDR performance ought to be kept in check.",
    "Elsewhere, the highlights remain the same. Pixel response is rated at 1ms MPRT and 4ms GtG, the panel curvature is relatively gentle at 1800R (it’s nothing like as tight as the 1000R Samsung G9 and variable rate refresh support is provided by AMD FreeSync Premium Pro certification. Nvidia graphics card users will still be able to run variable refresh through G-Sync, just without official support.",
    "Finally, connectivity is well catered for with not only HDMI and DisplayPort interfaces, but also USB-C with DisplayPort alt mode and 65W of power delivery for single-cable connectivity to a laptop. The slight snag here is that you’ll need one heck of a laptop to drive this huge, high-resolution monitor in modern games. Any such portable PC will need far more than 65W of power delivery.",
    "That niche caveat aside, what to make of this mega-monitor's actual performance? The use of VA rather than IPS panel technology is immediately obvious in the form of strong inherent contrast. In standard SDR mode, it’s punchy, bright and very colorful.",
    "What it’s not, is a great HDR performer. Overall, the panel looks subdued in HDR mode. In fact, games that support HDR like Cyberpunk 2077 actually look better in SDR mode on this panel. It’s probably a calibration issue and it’s really not a major problem given no monitor with mere DisplayHDR 400 certification is really a true HDR panel.",
    "The only real drawback is that it makes the display a bit less flexible. Being able to decode HDR content with the correct colors is handy. The AG493UCX2 can indeed do that, but at the cost of some vibrancy.",
    "Anyway, what about speed? AOC offers user-configurable overdrive in the OSD menu. In truth, the various levels of overdrive don’t look terribly different subjectively. But at least the fastest mode doesn’t suffer from obvious overshoot and inverse ghosting. In any case, response is best considered good but not quite as sharp as the best 1ms IPS gaming monitors.",
    "As for latency, with 165Hz refresh, this monitor will be quick enough for all but the most demanding online gamers. But what everyone will notice is how the field of view is distorted in most online shooters. That’s done by the game itself to prevent owners on monitors like this having an unfair advantage in the form of a wider field of view. Anyway, just know that the super-wide aspect can cause a few gaming niggles.",
    "The other take-away is much more positive. The gaming experience on a panel of this size and shape is incredibly immersive. It’s one of those things that you have to try to really appreciate. It’s spectacular.",
    "Less impressive is the pixel density. 5,120 by 1,440 sounds like a decent native resolution. But spread across an ultrawide 49-inch panel it only makes for 109DPI. If you like lots of details and really crisp fonts, this is not the monitor for you. As for pricing, it’s currently yours for £940 in the UK (its predecessor goes for $1,200 is the US, but availability was limited at the time of writing), which perhaps makes for a tricky comparison with the first-gen Samsung G9, which can now be had for $1,000."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Don't buy it if..."
  },
  "links": {
    "HDR": "https://www.techradar.com/news/photography-video-capture/hdr-explained-better-results-from-multiple-exposures-1035035",
    "G-Sync": "https://www.techradar.com/news/computing-components/graphics-cards/nvidia-g-sync-vs-amd-freesync-1289637",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "ultrawide": "https://www.techradar.com/news/ultrawide-monitor"
  }
}