{
  "source": "https://www.techradar.com/reviews/asus-rog-zephyrus-g14-alan-walker-special-edition",
  "title": "Asus ROG Zephyrus G14 Alan Walker Special Edition review",
  "category": "computing",
  "updated": "2021-11-03T11:54:21Z",
  "author": "jeremy-laird",
  "summary": "Gaming meets music in Asus’s latest powerful portable PC",
  "verdict": "Asus and Alan Walker have collaborated on this unusual portable that combines the power of the existing ROG Zephyrus G14 with some unusual music DJ features",
  "pros": [
    "Fantastic CPU performance",
    "Compact and beautifully built",
    "Good battery life"
  ],
  "cons": [
    "Expensive for the spec",
    "Fun features are also irrelevant",
    "Slightly disappointing gaming performance"
  ],
  "article": [
    "Give it up for the new Asus ROG Zephyrus G14 Alan Walker Special Edition. It’s a new version of the second iteration of what was already a great laptop. The original Asus ROG Zephyrus G14 was something of a genre buster when it arrived last year with its compact 14-inch proportions, awesome AMD CPU and great gaming performance.",
    "This new second generation Special Edition model carries over that basic proposition, but adds an unusual twist, namely collaboration with the eponymous DJ and musician Alan Walker. As we type these words, Walker currently has the 19th most popular video on Youtube with no fewer than 3.2 billions views, not to mention over 10 billion channel views. Not bad.",
    "Anyway, Walker has collaborated with Asus to produce a new version of the G14 that fuses music with gaming. The basic design of the G14 is carried over, complete with the funky Anime Matrix programmable LED feature on the rear of the display. But various tweaks including a change to metallic grey, fabric inserts and new colours for the keyboard make for a distinct new look.",
    "Arguably, what really sets this version of the G14 apart from its siblings are the extras in the box, not the laptop per se. Or rather the box itself. Yes really. The box actually doubles as a sort of synth or mixing pad. It connects to the laptop via USB-C and works with a dedicated app on the laptop to allow music content creation. Touch sensitive pads on the box include controls for track speed, sample loading and sound effects and it all ties in with optional visual effects that can be run on the laptop’s screen or output to an external display.",
    "How well it works from a music content creation perspective is arguably a moot point. It’s a fun extra that adds to the sense of this being a special and unusual laptop, rather than a spec-led, boxing-ticking affair. Which is probably just as well, because at least in one area the spec is slightly disappointing. Highlights include the AMD Ryzen 9 5900HS CPU, which is incredibly powerful. The 14-inch 2,560 by 1,440 pixel IPS display is a 120Hz beaut, too, and a great compromise between detail and performance, though it could be a little brighter.",
    "At least it would strike that balance nicely were it paired with a more powerful GPU. Asus has gone with an Nvidia GeForce RTX 3050 Ti for this special edition G14, despite the chassis being good for up to the RTX 3060 in other models. That’s a pity because the 3050 Ti isn’t really up to the job of driving the display at native resolution at playable frame rates, let alone the panel’s 120Hz refresh. Games still look decent interpolated at 1080p. But an RTX 3060 would round the package out much more effectively.",
    "All that said, this is still a gorgeous little laptop, with fantastic design and build quality, plus great battery life of over eight hours in PCMark 10, especially given the huge CPU on offer. Oh, and the sound quality from the integrated speakers is great. It rivals Apple’s MacBook’s for dynamic range and quality, there’s actually some real bass on offer, albeit not so much for outright volume. A tiny bit more punch would be appreciated.",
    "At $1,999 (£1,750, around AU$2,650), this Alan Walker special edition of the Asus ROG Zephyrus doesn’t make great sense from a pure computing and gaming perspective.",
    "For the same money, you could have a ‘regular’ G14 with 32GB of RAM and an RTX 3060 GPU. But then you wouldn’t have the unique look, the box that doubles as a mixing and all that fun stuff. OK, this isn’t a strong value proposition by conventional measures. But it’s still a very attractive and powerful laptop.",
    "The Asus ROG Zephyrus G14 Alan Walker Special Edition has everything that makes the standard G14 such a great little portable. It’s compact given the performance on offer. It’s very, very solidly built. It’s nicely styled. It’s just beautifully put together.",
    "Granted, it doesn’t quite tick every box. Just as a for instance, it lacks any kind of webcam, which is a fairly glaring omission in this increasingly work-from-home age. But the slim-bezel design keeps the size in check and ensure good portability, especially given the amount of portability on offer.",
    "The port selection is decent, too, with two USB-C sockets (only one can deliver power and / or drive a display), two USB-A and HDMI. Content creators will note the lack of an SD or microSD slot.",
    "The keyboard is also a highlight, not just for the funky color scheme, but also the stability of its bed and quality of the key action. But it’s the rear of the display that’s actually most exceptional.",
    "For starters, there’s the Anime Matrix feature with 1,215 programmable mini-LEDs. It’s ultimately totally pointless, being able to create your own animated shows on the rear of the display. But it’s also very slick and awfully fun.",
    "The performance of the Asus ROG Zephyrus G14 Alan Walker Special Edition is mixed. The grunt of the eight-core AMD Ryzen 9 5900HS CPU simply can’t be argued with. As it happens, storage performance from the 1TB Samsung M.2 NVMe drive is good, too, clocking in around 3GB/s read speeds.",
    "The less convincing aspect involves the Nvidia GeForce RTX 3050 Ti GPU. It’s not a bad graphics chip. But it’s hard to overlook the fact that this chassis is available with the superior RTX 3060, a GPU that would be a better fit with the 14-inch 120HZ QHD display.",
    "The 3050 Ti does an OK job playing modern games at 1080p. And, admittedly, 1080p interpolated on the 14-inch QHD display doesn’t look half bad. But even 1080p at high detail settings can be a struggle in some games for the 3050 Ti.",
    "Speaking of the display, for the most part it’s a class act. 120Hz is plenty for all but the most demanding gamers, ditto the QHD 2,560 by 1,440 native res. The colors, contrast and response from the IPS panel are decent, too. But we’d prefer it to be a bit brighter. It struggles to compete with typical indoor office ambient lighting, let alone anything outdoor. Still, it’s a nice display with loads of detail and great font rendering, it just deserves a more powerful GPU in a gaming context.",
    "It’s a testament to the power and efficiency of the AMD Ryzen 9 5900HS CPU that it packs so much pure processing grunt while still enabling great battery life. The Asus ROG Zephyrus G14 Alan Walker Special Edition clocks up over eight hours in PCMark 10. That’s fantastic given the performance on offer.",
    "It’s probably helped by the fact that the screen’s backlight is relatively weak. But even with today‘s crazy-long three-hour feature movies, this laptop will be good for at least three full-length films on the proverbial long-haul flight. In short, all-day battery life is a realistic expectation for consuming content and browsing the web. Dip into the performance of the eight-core CPU or engage in any gaming, of course, and you’ll see battery life cut in half or worse."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "9": "Design",
    "14": "Performance",
    "18": "Battery life",
    "20": "Don't buy it if..."
  },
  "links": {
    "Asus ROG Zephyrus G14": "https://www.techradar.com/reviews/asus-zephyrus-g14",
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972"
  }
}