{
  "source": "https://www.techradar.com/reviews/amazon-echo-show-review",
  "title": "Amazon Echo Show (2018) review",
  "category": "audio-visual",
  "updated": "2021-11-07T23:28:55.931Z",
  "author": "basil-kronfli",
  "summary": "The second-generation Echo Show improved on the original in a number of ways but still had a few minor bugbears",
  "verdict": "The updated Show is a big step in the right direction thanks to a better design, screen, sound experience and feature set. It's still hampered by some patchy skills and limited support for third-party streaming services, but if you’re a Prime Video fan living in a smart home full of Echos, you should definitely check it out.",
  "pros": [
    "Big, bright, responsive touch screen",
    "Competent smart home hub",
    "Much better audio than 1st gen Show"
  ],
  "cons": [
    "Screen apps lack polish",
    "Audio is bass heavy",
    "Video calling still limited"
  ],
  "article": [
    "The Amazon Echo Show can seem confusing for those not used to smart home gadgets. At heart, it's a smart speaker, like the Amazon Echo, but also builds in a large screen – adding in video and touch functionality alongside the Echo's usual audio capabilities.",
    "A new update even extends its ability to make calls to mobile and landline phones to the UK, after a successful rollout of the feature in the US.",
    "While this review is for the second-generation Echo Show, there are technically three other screen products you may be considering. For one, there's the new Amazon Echo Show 10, which comes with a new design, the ability to turn to face you as you move around the room, and Netflix support. It was released on February 25, and will set you back $249.99 / £239.99 / AU$399.",
    "Then there's the Echo Show 5 and Echo Show 8: smaller Show models to fit tighter spaces.",
    "The 1st generation Echo Show was quite a hard sell at launch, shipping with an Alexa assistant that didn’t make the most of the bigger screen and having middling audio given both its price and its size.",
    "This second-generation model saw Amazon iron out most of the issues we had with its predecessor. It well and truly went back to the drawing board. And it was worth it. Everything about this Echo Show – its design, screen and functionality – is better than before.",
    "You can order an Echo Show 2nd generation now for $229, £219.99 or AU$349.",
    "It costs more than the smaller, Google Home Hub which has weaker speakers, but still undercuts the Lenovo Smart Display running Google Assistant.",
    "When designing the Echo Show this time around, Amazon has put the speakers on the back, making the Show’s front almost all screen.",
    "This move has added some depth, with the 2nd gen Show being around 17mm thicker than last year’s model, but it’s a great call that means Amazon can get a bigger screen onboard and, as we’ll come onto later, better sound too.",
    "Ports and buttons are simple enough. At the top are volume controls and there's a privacy button, on the back is a DC power port, a microUSB port and a Kensington lock while on the front, it’s 10-inches of touchscreen goodness.",
    "There’s a front camera bookended by four dots. These are four of the Show’s eight microphones - which are excellent, while around the back is a fabric jacket over the speakers.",
    "In a way, it actually looks a bit less weirdly wonderful than the old show, losing some of the marmite 70’s design-factor in favor of a more tablet-like design. From a functionality point of view though, the bigger screen is much more comfortable to interact with and easier to see from across the kitchen.",
    "Speaking of the screen, it’s a 10-inch 1,280 x 800 resolution LCD panel that won’t blow your socks off up close, but looks absolutely fine at a distance - which is where you’ll likely always be viewing the Show from.",
    "More importantly than the resolution, viewing angles are on-point and it’s super responsive. Sure, if this was a Samsung Galaxy Tab S4 OLED screen with inkier blacks and colors that jump it would have been even better, but the Show sports what we’d expect in terms of quality for the asking price.",
    "Featuring adaptive brightness, the Show can detect the ambient light in the room and dial the screen brightness up or down automatically. As with most Android smartphones, there’s a familiar brightness slider, accessible by pulling down from the top of the screen for more manual brightness control.",
    "This feels sufficient for this type of product, but there isn’t more granular control over things like white balance or contrast in case you were wondering.",
    "In the settings, you can also customise what appears on the screen, with pre-set illustrations, a slideshow of Prime Photos or a simple black background being the current three options available.",
    "Despite its screen, voice is still the primary way Amazon wants you to interact with the Echo Show. You can choose from a range of buzzwords to fire her up, and she can do everything an Echo Smart speaker can and more.",
    "This means you get a great Zigbee smart home hub (a feature previously exclusive to the Echo Plus in the range) that can manage smart lights and plugs right through to compatible heating systems and locks. Set-up is a piece of cake with the help of the Alexa app on your phone, and in many respects, smart home management is where Alexa edges ahead of Google’s Assistant.",
    "The benefits of the screen are obvious when you pair the Echo Show with visual smart home hardware like cameras and smart doorbells, even if you don’t touch it. You can see who’s at the door, for example, with a simple voice command.",
    "If you’re in a household of Echo Shows, or indeed have friends with them, you can also video call or drop in on them, permissions permitting, by just saying “Alexa, call Sean” or “Alexa, drop in on the nursery”.",
    "While the Amazon and smart home ecosystem are areas where the Echo Show shines, skills however vary wildly in terms of quality.",
    "Taking cooking as an example, we made a couple of recipes using the Recipedia app, the default search app for recipes, and it was infuriating. For example, it was unable to resume a recipe after I left it for five minutes despite multiple “Alexa, next step”, “Alexa, open Recipedia” “Alexa, next step” commands.",
    "That said, other apps like Daily Stretch are really simple, charming and nice to use, but that you have to wade through a lot of frustration to get to a skill that’s usable is a pain. Alexa also can’t search the web using voice commands, a simple task that a screen and web browser should make a no-brainer.",
    "Without interacting with it, the Show will cycle through trending stories automatically – full bleed pictures paired with captions. You can disable these, or enable additional home screen content easily in the settings, with options including sports schedules and scores, notifications for Alexa skills, upcoming event info and more.",
    "The pulldown bar from the top of the screen gives you quick access to your home screen, alarms, smart home hardware and routines, as well as the settings. There’s also a brightness slider as well as a do not disturb function, which is different from the privacy function, accessible by pressing the hardware key atop the Show.",
    "Amazon has resisted including an app drawer on the Show, or a list of all Alexa’s skills accessible by touch. Instead, it’s clear that the Show is meant to be voice first, touch second.",
    "Irrespective, the inclusion of a web browser is incredibly welcome. You have the option of either Amazon’s Silk browser or Firefox, and can interact with a full-sized keyboard or voice typing to search for stuff.",
    "This is a key area where the 2nd gen Echo Show takes advantage of the extra screen size on offer, and makes it feel like much more of a centrepiece when with friends than the original did. This also opens up YouTube to the Echo Show for the first time, which is something of a game changer.",
    "Speaking of YouTube, if you want to search YouTube by voice, it’s out of bounds - you have to go through the browser. This isn’t necessarily Amazon’s fault (Google, we’re looking at you), but it is a sad fact. YouTube is also lower resolution than we’d like it to be, with the service recognising the Echo Show browser as a mobile device and tuning resolution accordingly.",
    "You can now search Vevo music videos by voice which is great, but other services we would have expected to be onboard - Netflix for example - are inaccessible, even through the browser.",
    "In the UK, BBC iPlayer is available through a web browser, and in the US, there's support for Hulu, which could make all the difference if you're thinking about this as a media consumption device.",
    "If you’re not in either of these regions, definitely check what content is available to you locally.",
    "Apple Music or Tidal fans can also forget about it from a music point of view, but thankfully, Spotify support is available across the Echo line and of course, Amazon Music is also supported, with both services working excellently with voice integration.",
    "Default sound settings are massively bass-heavy, and this can make spoken word content sound a bit off, but this is easy to fix in the EQ that you can also control by voice.",
    "If you’re using the Echo Show as a music device, the extra bass may also be welcome. The Show can fill up a room and make everything from classical piano music through to 90’s R&B sound banging with minimal distortion even at higher volumes.",
    "There were a few other little bits that stood out for us in our time with the Show.",
    "Privacy mode, for example, results in an annoying thick red line that persists at the bottom of the screen while it’s on - visually strong-arming you to keep your mic on when watching content. Amazon, if you're reading this, just having the red LED illuminated up top would have sufficed.",
    "The camera and video calling capabilities are also only really useful if your family and friends have Echo Shows, with no support for other video services like Skype or Hangouts. Skype is said to be on the way though, so watch this space.",
    "The Amazon Echo show isn't perfect. And it's screen isn't likely to appeal to everyone. But the final word is a positive one: “Alexa, well done”.",
    "The new Show takes the Echo range’s excellent smart home powers and combines them with a fit-for-purpose design to create a great smart screen.",
    "There are still some niggling issues – there’s no Netflix support and some skills aren't as polished as we'd like them to be. But if you’ll be using this primarily as an Alexa device, radio, music/Prime Video player and occasionally as a YouTube watcher and web browser, it will nail it.",
    "The latest version of the Echo Show is an evolving product, and we fully expect these services and Skills to improve over time. We look forward to revisiting the Echo Show in the coming months to see just how much better it could possibly become.",
    "Image Credits: TechRadar"
  ],
  "headers": {
    "6": "Price and availability",
    "8": "Design",
    "13": "Screen",
    "18": "Talking to Alexa",
    "25": "Touch functionality",
    "30": "Echo Show video services",
    "34": "Sound performance",
    "37": "What else you need to know",
    "40": "Verdict"
  },
  "links": {
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Amazon Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Echo Show 5": "https://www.techradar.com/reviews/amazon-echo-show-5",
    "Echo Show 8": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "1st generation Echo Show": "https://www.techradar.com/reviews/amazon-echo-show",
    "Google Home Hub": "https://www.techradar.com/reviews/google-home-hub",
    "Lenovo Smart Display": "https://www.techradar.com/reviews/lenovo-smart-display"
  }
}