{
  "source": "https://www.techradar.com/reviews/withings-sleep-analyzer",
  "title": "Withings Sleep Analyzer review",
  "category": "fitness",
  "updated": "2021-10-15T08:58:20Z",
  "author": "cat-ellis",
  "summary": "The Withings Sleep Analyzer is a sleep tracker you can set and forget",
  "verdict": "The Withings Sleep Analyzer gives you the same type of data you'd get from a fitness tracker on your wrist, without the need to wear a cumbersome watch to bed. The one-time setup is very convenient, and it's surprising how much data can be gathered through your mattress. Most of the results proved consistent with other sleep trackers, though we found estimated wake-up time occasionally inaccurate.",
  "pros": [
    "One-time setup",
    "Impressive level of detail",
    "Can't be felt at night"
  ],
  "cons": [
    "Has to be plugged in",
    "Some inaccuracies in results"
  ],
  "article": [
    "Even the best mattress doesn't guarantee a perfect night's sleep, but the Withings Sleep Analyzer can help. It's a thin mat that slips under your mattress, where it records changes in pressure and noise during the night. Calibration is a one-off process, and once it’s set up and connected to your phone and Wi-Fi network, it will record your sleep patterns each night with no further input.",
    "It’s a good choice if you find wearing a fitness tracker on your wrist at night uncomfortable, or want something that you can simply set and forget.",
    "You’ll receive slightly more detailed results than you would from a wrist-based sleep tracker (largely due to the noise detection). Results are easy to review in the morning, and seem quite consistent with those from wrist-based fitness trackers. We wouldn't rely on the estimated wake-up time, though that's perhaps the least important data point, as you can check it yourself when you wake.",
    "It's easiest to use if your bed has a solid frame (like a divan). If you have a slatted bed frame, you'll need to place the mat on something sturdy on top of the slats.",
    "The Withings Sleep Analyzer is available now, and costs $99.95 / £119.95 (about AU$145). It can be purchased directly from Withings, but is also available from Amazon.",
    "Sleep apnea detection wasn’t available at launch (likely due to the need for FDA approval), but was added in 2019 via a software update.",
    "The Withings Sleep Analyzer is a narrow, gray mat that you place under your mattress at the same level as your chest and connect to your phone via Bluetooth using the Withings Health Mate app.",
    "The Sleep Analyzer doesn’t contain a battery, which is understandable as the heat generated might make it a fire risk with the lack of air circulation under a mattress. This does, however, limit where you can use it – although the cable is quite long (around three meters) you’ll need an electric outlet relatively near your bed to keep it plugged in overnight.",
    "The way it works is interesting, and very different to wrist-based sleep monitors. Most data is gathered from its pneumatic sensor, which identifies and separates different types of movement. For example, it can differentiate between the changes in pressure caused by your pulse, your breathing, and any tossing and turning during the night.",
    "The device also contains sound sensors, which isolate the noise of snoring and can separate it from other sounds like traffic outdoors, your washing machine’s spin cycle, and your partner’s snoring.",
    "Calibrating the device is a little time-consuming, but only needs to be done once. Place the mat under your mattress at chest level (keeping it on your side of the bed if you share with a partner), plug it into a mains outlet, then install the Withings Health Mate app (available for both Android and iOS) and connect to the mat via Bluetooth.",
    "If you don’t already have a Health Mate account, you’ll need to create one, which will require your name, email address, a password, and your current height and weight. You’ll also need to connect the Sleep Analyzer to your home Wi-Fi network, so have your password to hand when setting it up.",
    "This is the same app used by other Withings devices, including fitness trackers and smart scales, so you can manage them all from one location.",
    "Once that’s done, the mat will take a few minutes to configure. During this time you might hear some whirring noises underneath your mattress, but this is nothing to worry about. Don’t sit on your bed while this is happening. The app will inform you when the process is complete.",
    "Once that’s done, just go to bed as normal, and your sleep stats will appear in the app once you get up in the morning. Remember that you’ll need to leave the mat plugged in.",
    "When you get up, you’ll be presented with a bevy of statistics on your slumber. You won’t always have time to fully digest these, so it’s good to see that you’re presented with an overall score to begin with, with more in-depth analysis available if you choose to drill through further.",
    "You will be given overall ‘sleep score’, which is then broken down into duration, time to sleep, depth, time to get up, interruptions and regularity (measured over a period of several nights). This is more in-depth than the data you’d get from a Fitbit device, which will only rate your sleep’s duration, quality (time spent in deep and REM sleep) and restoration (a combination of sleeping heart rate and restlessness).",
    "Tapping each of these scores will reveal a graph showing the data recorded by the Sleep Analyzer throughout the night. This is accompanied by advice on how to improve that aspect of your sleep (such as getting to bed earlier and keeping more regular sleep patterns).",
    "The pattern of light, deep and REM sleep) represented what we’d expect from a typical 90-minute sleep cycle, resting heart rate was consistent with data from our Fitbit Charge 4. The ‘time to wake’ score seemed odd though, reporting that we were still asleep when we were definitely awake and drinking a cup of tea. This might be due to us having quite a low resting heart rate while awake (around 52bpm).",
    "It’s worth noting that while snoring can often be an indicator of sleep apnea, the condition can also be silent, so if you find yourself feeling uncommonly tired even after a good night’s sleep, it’s always wise to seek medical advice."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and availability",
    "6": "Design",
    "10": "Setup and use",
    "15": "Results",
    "20": "Don't buy it if"
  },
  "links": {
    "best mattress": "https://www.techradar.com/best/best-mattress",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "directly from Withings": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1036869173390365800/https://www.withings.com/us/en/sleep"
  }
}