{
  "source": "https://www.techradar.com/reviews/internxt-cloud-storage",
  "title": "Internxt cloud storage review",
  "category": "computing",
  "updated": "2021-07-23T06:30:00.926Z",
  "author": "joanne-heng",
  "summary": "A cloud storage provider that’s big on privacy and security",
  "verdict": "Internxt is a secure cloud storage provider with a clean interface, comprehensive support, and multiple pricing plans. The lack of advanced file-sharing features, however, is a drawback.",
  "pros": [
    "Advanced security features",
    "Reliable customer support",
    "Multiple pricing options"
  ],
  "cons": [
    "Lack of advanced features"
  ],
  "article": [
    "Not too long ago, being able to remotely upload content and store and retrieve the data as and when you needed it seemed like a futuristic dream. But today, the best cloud storage services offer you that and so much more. If you’ve been thinking about storing your data in the cloud, Internxt—a cloud storage service with a focus on privacy and security—is a viable option.",
    "In this Internxt review, we aim to give you information about its pricing, features, interface, security, and support so that you can decide if it’s the right cloud storage service for your needs.",
    "Internxt’s basic free plan offers 10GB of storage. Beyond that, seven other pricing plans are available for individuals and for businesses.",
    "Depending on the storage space needed, individual users can opt for a 20GB plan for €0.95/month ($1.13/month), a 200GB plan for €3.99/month ($4.75/month), or a 2TB plan for €9.49/month ($11.29/month).",
    "Businesses and teams can choose from a 200GB plan priced at €4.99/user/month ($5.94/user/month), a 2TB plan at €9.99/user/month ($11.89/user/month), or a 20TB plan for €95/user/month ($113/user/month).",
    "Internxt also has an Enterprise plan for an unlimited number of team members. You’ll have to contact the support team for a quote based on your needs. It’s also easy for you to upgrade your plan at any time—you’ll never have to worry if your storage requirements change.",
    "All plans offer complete use of all of Internxt's secure services, including Internxt Drive, a zero-knowledge file storage service, Internxt Photos, which enables you to store photos privately and securely, and Internxt Send, a platform for you to send files safely and seamlessly.",
    "As a relatively new offering, Internxt’s features are pretty basic. We’ve broken down some of the key ones here.",
    "Internxt is available on desktop, mobile, or tablet, so you can conveniently access your files on any device. With its automatic syncing capability, Internxt ensures your information will be updated and saved regardless of the device you’re using.",
    "Internxt enables you and your team to store files with total security. You can collaborate privately with other members and toggle your admin features. You can even decide how many times you want a given link to be valid/shared so that your file won’t be accessible outside of its intended audience. This is particularly useful for sensitive documents.",
    "Internxt offers its users handy offline access to their files. This means that you don’t have to frantically search for a network connection in order to access your documents out of range. You can enable selective offline access to all the files in your inventory.",
    "Choosing a plan and creating an account on Internxt is quick and fuss-free. Upon logging in to your Internxt account, you’ll find a handy introductory guide that you can access to get a quick tutorial on how the service works.",
    "Internxt’s interface on mobile, web, and desktop is clean, intuitive, and user-friendly. On its main page, you can view all your files at a glance. You can also easily customize your folders with different colors and icons. A useful search function helps you quickly locate files without having to spend time scrolling through your entire drive.",
    "Uploading new files onto the cloud is also a breeze with a drag-and-drop interface. Similarly, you can easily share your files through a link. Overall, Internxt’s intuitive dashboard is easy to use and streamlines your workflow.",
    "A pop-up live chat box will instantly appear when you navigate to Internxt’s site. Chat support is pretty responsive—we got a reply in eight minutes. If you’d prefer to troubleshoot on your own, you can access Internxt’s Help Centre from the same pop-up box as the live chat function. On the search bar, type any keyword that you’re looking for and you’ll be greeted with dozens of helpful articles from the team.",
    "If you still can’t find what you’re looking for, Internxt’s support team is contactable via email 24/7 and provides support in English, Spanish, and Russian.",
    "Security is where Internxt shines. The zero-knowledge file storage service is based on absolute privacy and uncompromising security. When you upload a file on Internxt, it’s instantly encrypted on your device. Unlike other mainstream services that encrypt customer data in transit or at rest, Internxt encrypts all your data before it leaves your device.",
    "Additionally, Internxt doesn’t store user data in any central location. Instead, data gets fragmented prior to being uploaded, and the encrypted file shards are then uploaded onto servers based in different locations around the world. A single server never holds a whole file, making Internxt very secure, robust, and private.",
    "With its AES-256 CTR encryption model, no one else other than you holds the key to your data. If Internxt were to be hacked, intruders wouldn’t be able to access your data either.",
    "Dropbox is a competitor that gives Internxt a run for its money with its advanced file-sharing capabilities and software integration. Similarly, OneDrive is a great alternative with its files-on-demand feature.",
    "The two competitors offer a range of useful tools and great functionality at about the same price point. To enjoy these features, however, you may have to compromise on privacy and security: Dropbox and OneDrive do not offer zero-knowledge encryption.",
    "Internxt’s affordable pricing plans, intuitive interface, and reliable support make it a great cloud storage service to consider. While it does not offer the same advanced features that you’ll find with Dropbox and OneDrive, individual users and businesses that prioritize security will enjoy the cloud service provider’s advanced security features and commitment to privacy."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "11": "Interface and in use",
    "14": "Support",
    "16": "Security",
    "19": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Internxt": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1334569723515037400&xs=1&url=https%3A%2F%2Finternxt.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Finternxt-cloud-storage",
    "free plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5435082610701096000&xs=1&url=https%3A%2F%2Finternxt.com%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Finternxt-cloud-storage",
    "20GB plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5704260072574690000&xs=1&url=https%3A%2F%2Finternxt.com%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Finternxt-cloud-storage",
    "200GB plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1010952710854697500&xs=1&url=https%3A%2F%2Finternxt.com%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Finternxt-cloud-storage",
    "2TB plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1326810453155959000&xs=1&url=https%3A%2F%2Finternxt.com%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Finternxt-cloud-storage",
    "20TB plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1104061065957128200&xs=1&url=https%3A%2F%2Finternxt.com%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Finternxt-cloud-storage",
    "Enterprise plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4424331221277199000&xs=1&url=https%3A%2F%2Finternxt.com%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Finternxt-cloud-storage",
    "send files": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365"
  }
}