{
  "source": "https://www.techradar.com/reviews/epson-workforce-wf-7715dwf",
  "title": "Epson WorkForce WF-7715DWF review",
  "category": "computing",
  "updated": "2021-05-20T15:33:56Z",
  "author": "jim-hill",
  "summary": "All-round A3 ability",
  "verdict": "This flexible 4-in-1 does everything a good A4 office printer can do, but with A3 paper.",
  "pros": [
    "Dual-side A3 photocopies",
    "Easy to use",
    "NFC for Android users",
    "Wide media compatibility"
  ],
  "cons": [
    "Only one paper tray",
    "Photos fall a little flat",
    "Noisy in operation"
  ],
  "article": [
    "The Epson WorkForce WF-7715DWF is a big A3 all-in-one inkjet for the home or small office. With a large user-friendly interface, fast print speeds and every business feature you can think of, it seems to justify its bulk by answering all of your printing needs. From auto duplexing and dual-side scanning to sending super-sized faxes, this flexible printer can do anything an A4 printer can do, but with A3 paper.",
    "For around £180 (US$250, AU$327), it’s one of the most affordable devices to offer this level of A3 ability. It’s also among the first of Epson’s printers to come with ReadyPrint Go compatibility, which is a service that sends you replacement ink cartridges specific to your printer when your printer detects that it is running low.",
    "Side-by-side, the bulbous Epson WorkForce WF-7715DWF looks almost exactly like the A4-sized Epson WorkForce WF-2750DWF, except that it’s about fifty percent bigger in all directions. The display, buttons, scanner, even the Epson logo has simply been scaled up almost as though the whole thing was inflated by a cartoon bicycle pump.",
    "The main paper tray has to be extended forwards by a few inches to accommodate A3 paper and you can fit up to 250 sheets in here.",
    "The scanner bed is also A3+ sized as is the 35-sheet ADF (automatic document feeder) on top and the rear paper tray. The output tray can hold 150 printed sheets when extended.",
    "The large 10.9cm touchscreen is mounted on a flap that tilts up for easy access along with all the other hard button controls. To the left of this is a USB Host port for printing directly from a flash memory thumb drive.",
    "There’s another USB port at the rear for connecting a data cable (not included) alongside ports for Ethernet and fax cables. It’s a large and let’s face it, ugly, lump of plastic, but it feels fairly well made and functionally designed with the oversized controls making it particularly easy to use.",
    "As part of Epson’s WorkForce line the WF-7715DWF is aimed at business rather than family use and comes with all the functionality you need in the office. It can print, scan, copy and fax with any size of media up to A3+ and it can both duplex print and duplex scan at that size too. Wi-Fi is built in with Wi-Fi Direct and wireless protocols such as AirPrint and Google Cloud Print catered for. It also has an NFC chip for Android users to make a one-tap connection with their device.",
    "There’s a USB Host port at the front for walk-up printing from a USB thumb drive, a touchscreen interface and a 35-sheet ADF. For a printer of this size, it is slightly disappointing that there is only one paper tray, which limits the paper capacity to 250 sheets. If you want two paper trays, you should look at the slightly more expensive Epson WorkForce 7720DTWF instead. Otherwise there are no other features missing that we could think of. Our only regret is that this WorkForce printer uses disposable cartridges and is not part of Epson’s excellent refillable EcoTank line instead.",
    "It prints quickly for an A3 inkjet at 18ppm in black and white and 10ppm in color. It’s fitted with the latest PrecisionCore print head which employs 800 black ink nozzles and 256 color nozzles to achieve a maximum resolution of 4,800 x 2,400 dpi, which is about as good as it gets at this level. The scanner resolution is almost as sharp at 1,200 x 2,400.",
    "The DURABrite Ultra inks used here are pigment based and available in high yield XXL sizes (at least for the black ink), which makes the running cost quite competitive for a cartridge-based inkjet at around 7.1p per page. The brochure says that this CPC (cost per page) beats most laser printers, though that’s debatable. It’s also worth noting that inkjets rarely achieve their quoted maximum yields because they don’t account for the ink wasted when cleaning the nozzles. Inkjet printers hate being left idle and when our pre-loved review unit arrived, we had to perform four nozzle cleaning cycles to clear the dry ink before it would print satisfactorily and that used up a significant amount of ink.",
    "One new feature here is ReadyPrint Go, which is Epson’s answer to HP’s Instant Ink subscription service. By registering your eligible device, your replacement ink cartridges will arrive by post just before you run out. The printer itself lets Epson know directly when your ink level is low. It differs from HP’s service in that there’s no subscription fee. You pay as you go instead. However, the cost of the cartridges is not discounted and your old cartridges are not automatically recycled, so there seems little incentive to sign up.",
    "The Epson WorkForce WF-7715DWF is an easy printer to set up thanks to the especially large tilting control panel and generous 10.9cm touchscreen. You just need to insert the four ink cartridges and follow the on-screen prompts, which will get the printer onto your Wi-Fi network without any fuss. The LCD interface is sensitive and intuitive, making it a painless process to select your printable media type from the list, or type in the percentage by which you want to reduce or enlarge a photocopy.",
    "In operation, the Epson WorkForce WF-7715DWF is a little noisy when manipulating large pieces of paper, but it’s still quieter than the average laser printer. We experience no paper jams or misprints during the test, except for a couple of sheets of recycled paper that came through at the same time.",
    "The print quality achieved by the Epson WorkForce WF-7715DWF is, in general, very strong. Black and white text documents look crisp and dark and free of smears, even when printing at the very smallest point size. Color documents appear similarly well contained and clear, though the DURABrite Ultra inks used here are not the brightest. They look very good with graphs and images made up of blocks of color, where the consistency is quite impressive, but are not so great with photographs. These pigment-based inks produce a matt finish that looks a little dull and disappointing when printing on glossy photo paper. Matt photo paper gives a better result.",
    "The main tray is fine for plain paper, but photo paper and card stock fare better in the rear tray where the paper path is much flatter. We managed to print satisfactory on some quite thick card this way and without pressing a curl into the printed card.",
    "The Epson WorkForce WF-7715DWF is an accomplished office printer, performing tricks with A3 paper that few A3 printers can manage, such as duplicating both sides of an A3 document automatically. As cartridge-based inkjets go, it’s fairly economical to run too and the print quality, though not great with photos, is fine overall. With every business feature we can think of built in, we have no hesitation in recommending this all-in-one to anyone who frequently prints at this larger size."
  ],
  "headers": {
    "2": "Design and build",
    "7": "Features and specifications",
    "12": "Setup and operation",
    "14": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "Epson WorkForce WF-7715DWF": "https://www.epson.de/en/products/printers/inkjet-printers/for-home/workforce-wf-7715dwf"
  }
}