{
  "source": "https://www.techradar.com/reviews/amazfit-powerbuds-pro",
  "title": "Amazfit Powerbuds Pro review",
  "category": "audio-visual",
  "updated": "2021-09-02T11:09:29Z",
  "author": "cat-ellis",
  "summary": "A set of true wireless earbuds to keep tabs on your health at work and in the gym",
  "verdict": "Anyone looking for a pair of true wireless earbuds is spoilt for choice right now, so Amazfit has decided to do something a little different by packing as many fitness and wellbeing tools into the Powerbuds Pro as possible. Like the original Powerbuds, they can track your heart rate during runs, but they also monitor you while you're working, checking your posture to protect your spine, reminding you to take regular breaks from your desk, and ensuring you don't listen too loud, or for too long. It's a unique package, and with good, bass-heavy sound and impressive active noise cancellation, they're well worth investigating if you only want a single set of headphones for both work and workouts, and you don't already use a sports watch to track your heart rate.",
  "pros": [
    "Great, bass-heavy sound for working out",
    "Effective active noise cancellation",
    "Posture-protecting tech works well"
  ],
  "cons": [
    "No optional over-ear loops",
    "Heart rate measurements too high",
    "Some tools redundant if you have a running watch"
  ],
  "article": [
    "The market for true wireless earbuds is increasingly crowded, and Amazfit is seeking to carve itself out a niche with the Amazfit Powerbuds Pro – a set of headphones designed to take care of your health both at your desk and while working out.",
    "Like the original Amazfit Powerbuds, released in July last year, the Powerbuds Pro are fitness-focused true wireless earbuds that can measure your heart rate during runs. This time, however, they’re not just for training sessions, and double as a useful tool for anyone working from home.",
    "Not only do the Powerbuds Pro offer active noise cancellation to block out distractions, they can also a warning if they detect that you’re slouching at your desk, and alert you when you’ve been sitting still for too long.",
    "It’s an unusual package of features, and one that makes these headphones really stand out, avoiding the need for separate buds for work and play. The heart rate monitoring isn’t quite perfect though (its measurements were consistently higher than those recorded by a dedicated heart rate monitor), and we have to question its usefulness for regular runners.",
    "One of the Powerbuds Pro’s key features is the ability to sync your stats with third-party running apps like Runkeeper and Endomondo, but if you’re doing that then you’re likely to be wearing a dedicated running watch or fitness tracker that will do the same thing. There will be occasions when you want to run with your wrists free while you run, but if you’re serious about your training then an extra device monitoring your heart rate is likely to be redundant.",
    "The Amazfit Powerbuds Pro were released on 14 July 2021. They’re available direct from Amazfit or from Amazon in the US, and at the time of writing are discounted from $189.98 to $149.99, with a free Amazfit Band 5.",
    "In the UK, they're available from Amazon for £112.31. There's no launch date or price yet for Australia.",
    "As we'd expect, that's higher than the launch price of the original Powerbuds, and more in line with the 2019 Apple Airpods.",
    "The Amazfit Powerbuds Pro look quite different to the original Powerbuds, with a design that takes a lot of cues from Apple’s Airpods. The buds are white, with short stems, and are supplied in a smart flip-top charging case. Unfortunately there’s still no wireless charging – instead the case has a USB-C port and is supplied with a USB-A to USB-C cable.",
    "You also get four different sized silicone tips to choose from. so you can pick a pair that fit comfortably and snugly, though we found the Powerbuds Pro did occasionally feel a little loose while running hard. Unlike the original Powerbuds, the Powerbuds Pro don't come with optional over-ear hooks to keep them secure during workouts, which is a shame and makes them a little less practical.",
    "Touch controls are responsive, and can be customized within the Zepp app. By default, tapping the stem of either bud will allow you to control the music, while touching and holding (you’ll hear a gentle click to confirm that you’ve held it long enough) will switch between regular, ANC (active noise cancelling), and Thru Mode, which uses the buds’ microphones to replicate ambient noise so you remain aware of your surroundings.",
    "Many people have to separate sets of headphones – one for their desk and another for workouts – but with the Powerbuds Pro, Amazfit is aiming to cover both at once. It’s a pretty unusual combination, and we’ve not seen anything quite like it before.",
    "The Powerbuds Pro connect to the Zepp mobile app (Zepp Health being Amazfit’s parent company). This is the same app used by other Amazfit devices including smartwatches, fitness trackers and smart scales, and will collate data from all of these together in one location. This is where you access and configure the buds’ various features.",
    "When you’re working, you’ll not only get active noise cancellation to block out distractions, but also a new feature that aims to correct your posture by detecting the position of your head relative to your cervical spine (the vertebrae that make up your neck).",
    "To try this, open the tool in the Zepp app, insert both earbuds, and the software will automatically detect the amount of pressure being placed on your spine, and the degree by which you’re angling your head. Slump too much, and the app will warn you that you’re effectively adding the weight of a small child to your vertebrae – a rather graphic warning to stop slouching. The buds don’t monitor this in real time, though – you’ll need to open the app and check your posture manually to see whether you need to sit up straighter.",
    "Sitting for a long time can be detrimental to your health, and most fitness trackers have a feature that buzzes on your wrist to alert you when you’ve been still for a long time. The PowerBuds Pro have a similar tool, which plays a snippet of music when you’ve been sedentary for too long and it’s time to get up and stretch.",
    "We found this quite loud by default, and there’s a chance that it could interrupt your flow if you’re working hard, but it’s not enabled by default and can prove useful if you’re working from home and perhaps not taking breaks as frequently as you would in the office.",
    "When it’s time for a workout, the PowerBuds Pro will detect when you begin to run based on the movement of your head and begin monitoring your heart rate. In our tests the automatic run detection worked very well, and the headphones began tracking our heart rate almost immediately after we set off. Unfortunately, while the overall trends tallied with those from our chest strap heart rate monitor, the heart rates registered by the Powerbuds Pro were higher than we’d expect, coming in around 5-10bpm faster.",
    "Heart rate data can be synced with third-party apps like Endomondo and Runkeeper if you search for the Powerbuds Pro in the appropriate app. However, if you’re using one of these apps then it’s likely that you already own a sports watch or fitness tracker, which makes the Powerbuds’ heart rate monitoring somewhat redundant.",
    "More useful is the Powerbuds’ ability to alert you if your heart rate exceeds a certain limit (which you can set yourself). This is handy not just to avoid general overtraining, but also if you want keep your exertion below a particular level during a long session. If you exceed this limit, you’ll hear a tone with heartbeats in the background over the top of your music – a gentle reminder to relax your pace.",
    "Overall, we found the Amazfit Powerbuds Pro's sound fairly bass-heavy, which works well when you're out running. When you're back at your desk, the various genre-specific equalizer presets within the Zepp mobile app make it easy to choose a more balanced mix if you prefer.",
    "The app also lets you tinker with hearing protection settings – yet another tool that helps these headphones keep tabs on your wellbeing. The Powerbuds Pro actively monitor sound levels, and can keep them within recommended levels to protect your hearing.",
    "More interestingly, the app can also advise on suitable 'listening time', which is similar to 'screen time' for apps like YouTube. The idea is that the louder your music (or calls), the less time you should spend listening.",
    "It's not something we read about often, but according to the American Osteopathic Association, it's something we should be more aware of, and limiting time spent listening to music using headphones (particularly above certain volumes) can be very important for preventing hearing loss.",
    "Unlike the original Powerbuds, the Powerbuds Pro have active noise cancellation, which you can activate within the Zepp app, or by pinching and holding the stem of the right earbud. We found it very effective at cancelling out most ambient noise while working and at the gym, though it didn't work well while running outdoors as the microphones picked up too much wind noise.",
    "Some other true wireless earbuds turn off some of the microphones used for noise cancelling in particularly windy conditions, and this may be a feature that's offered in future Powerbuds models, but for now your best option is to turn off ANC when you hit the pavement on a blustery day.",
    "Thru Mode was very effective at letting us hear ambient sound, and makes them a good alternative to bone conduction headphones if you want to be able to stay aware of your surroundings, but don't want to buy a separate headset for the privilege."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Amazfit Powerbuds Pro price and release date",
    "8": "Design",
    "11": "Features",
    "20": "Audio performance and noise cancellation",
    "27": "Don't buy them if"
  },
  "links": {
    "Amazfit Powerbuds": "https://www.techradar.com/reviews/amazfit-powerbuds",
    "running apps": "https://www.techradar.com/news/5-brilliant-running-apps-to-take-the-hassle-out-of-getting-fit",
    "Runkeeper": "https://www.techradar.com/how-to/runkeeper",
    "running watch": "https://www.techradar.com/best/running-watches",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "direct from Amazfit": "https://www.amazfit.com/en/powerbuds-pro",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FAmazfit-PowerBuds-Pro-Cancelling-Headphones-White%2Fdp%2FB0989TXP54%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-7930288521360356000-21",
    "Amazfit Band 5": "https://www.techradar.com/news/amazfit-band-5-with-alexa-is-available-to-pre-order-now-and-its-super-cheap",
    "Apple Airpods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "American Osteopathic Association": "https://osteopathic.org/what-is-osteopathic-medicine/headphones-hearing-loss/",
    "bone conduction headphones": "https://www.techradar.com/news/best-bone-conduction-headphones"
  }
}