{
  "source": "https://www.techradar.com/reviews/sony-wf-c500",
  "title": "Sony WF-C500 review",
  "category": "audio-visual",
  "updated": "2021-10-11T16:25:17Z",
  "author": "simon-lucas",
  "summary": "Sony's budget wireless earbuds impress",
  "verdict": "Yes, making the WF-C500 so affordable has led to compromises - but Sony’s kept them to a minimum, and delivered a very perky sound from very comfortable earbuds. They’re far from your only choice, mind you, with lots of competing budget wireless earbuds on the market.",
  "pros": [
    "Informative, organized and lively sound",
    "Neat and comfortable",
    "Proper control app"
  ],
  "cons": [
    "Battery life is nothing special",
    "Could sound both deeper and wider",
    "Not short of rivals"
  ],
  "article": [
    "A company needs to be either very brave or very confident to enter the budget wireless earbuds market. Can you guess which one Sony is?",
    "The Sony WF-C500 are sensibly specified, very light and comfortable, and have a choice of control methodologies that all work well. At 20 hours, the all-in battery life isn’t that impressive - but 10 hours from the buds alone isn’t bad at all. And their sound - rapid, detailed and thoroughly engaging - has some areas of real expertize.",
    "But the WF-C500 are not short of proper competition from equally brave and confident companies - and their relative lack of bass extension, so-so battery life and rather confined soundstage has left the door open, just a crack, for those competitors. For once, Sony doesn’t get the true wireless in-ear action all its own way.",
    "The Sony WF-C500 true wireless in-ear headphones are on sale now, and they’re priced at an extremely competitive $79 / £89 / AU$149.95.",
    "The proliferation of very worthwhile true wireless in-ear headphones below the $100/ £100 / AU$150 mark obviously hasn’t escaped Sony, and the company fancies a piece of the sizable action. But while it has the cachet, and some much more expensive true wireless models with which to sprinkle some reflected glory over the WF-C500, Sony is pitting itself against some extremely capable opposition.",
    "The likes of Cambridge Audio, Jabra, Panasonic, Samsung and Sennheiser (to name just a few) all have similarly priced and very decent true wireless earbuds to sell you - and, on paper at least, some of these models have some advantages over the WF-C500. Nothing’s ever straightforward, is it?",
    "It’s not often we get to criticize Sony for the way its products are designed and built - and we’re not about to start now. The WF-C500 are extremely tidy earbuds, compact and light (just 5.4g per earbud) and are easy to position comfortably no matter the specific size and shape of your ear. A choice of three sizes of eartip only makes getting comfortable easier.",
    "Despite their tiddly dimensions, Sony has found room for a relatively large physical control surface on each WF-C500 earbud - it’s a ‘push/push’ button and covers ‘play/pause’, ‘skip forwards/backwards’, ‘volume up/down’, ‘answer/end/reject call’ and ‘wake up voice assistant’. There’s also a mic opening on each earbud for voice assistant interaction and telephony - both Google Assistant and Siri are available.",
    "If you prefer, control is also available via Sony’s exemplary ‘Headphones Connect’ app. As well as dealing with all the broad functions, this is where you can adjust EQ settings, set your Bluetooth priorities, let the app have a good look at the shape of your ears (the WF-C500 are compatible with Sony’s ‘360 Reality Audio’ spatial audio algorithm) and toggle the Digital Sound Enhancement Engine on or off. DSEE is supposed to ‘upscale’ standard audio files until they’re ‘almost’ of high-resolution standard. The ability to switch it on or off in the app allows you to decide on its effectiveness (or lack thereof) yourself.",
    "Battery life is an unremarkable 20 hours all in - although the 10 hours stored in the earbuds themselves isn’t bad at all. A quick 10-minute blast of power will deliver another hour of playback - there’s a short USB-C to USB-A cable in the (easily and fully recyclable) packaging for this purpose. The WF-C500 use Bluetooth 5 for wireless connectivity, and once your digital audio information is on board, it’s delivered by a pair of 6mm full-range drivers.",
    "IPX4 makes them nicely resistant to moisture and water-splashes, and a choice of four colors (properly vibrant green or orange are available as well as humdrum old black or white) is welcome too. Add in ‘fast pair’ connectivity with Android devices and ‘swift pair’ with Windows 10 PCs, and you’ve a very pleasingly specified product.",
    "Of course, it’s pretty obvious where Sony has made the compromises necessary to bring the WF-C500 in for under $100 / £100 / AU$150. There’s no active noise-cancelling, there’s no wireless charging, the charging case itself (while perfectly well made) is nothing special… but as long as the Sonys have it where it counts, of course, that’s all completely fair enough.",
    "The WF-C500 are perfectly capable of dealing with big MQA-powered TIDAL Masters digital audio files - so a listen to The Magnetic Fields’ You Must Be Out Of Your Mind seems as good a place as any to start. Certainly, the Sonys don’t find it all that much of a challenge.",
    "Talking about stereo focus and separation might seem redundant where headphones are concerned - but there are enough designs around that can’t properly describe the layout of a soundstage to demonstrate that these things aren’t a given. The WF-C500 have no problem explaining what’s what, though - although the song is packed with instruments all occupying more-or-less the same part of the frequency range, and although the Sony don’t have the out-and-out scale of some rivals, following individual elements is simple.",
    "Low frequency sounds are slightly short of ultimate extension, but they’re nicely shaped and informative. And they don’t hang around or crowd the midrange, either, which means there’s proper expression of rhythms and tempos here - the WF-C500 are pleasingly straight-edged on their way into and out of bass notes. The opposite end of the frequency range is rolled off just a little, presumably in the name of politeness, but it still musters just enough bite and shine to keep things interesting.",
    "In between, the midrange is pretty deft where vocalists are concerned. Stephin Merritt’s baritone voice fluctuates between bass and midrange, but it’s loaded with detail of his vocal toil, and consequently is chock-full of character. It’s contained in a neat little pocket of space, too, which makes it all the more immediate and communicative.",
    "Switch to the more wide-ranging, if rather less satisfying, sound of Kanye West’s Jail and the WF-C500 are more than able to describe the dynamics of the recording. They do good work in making the silences and spaces in the song every bit as significant as the actual sounds, too - and they show a nice clean noise-floor while they’re at it.",
    "All of this assumes an EQ that’s set flat all the way across the board, it should be said. You’ve any number of opportunities to skew the sound to your personal taste in the app - but, for our money, ‘flat’ is where the Sony sound best. And by all means, investigate the ‘clear bass’ setting - but be assured there’s nothing ‘clear’ about it."
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Sony WF-C500 price and release date",
    "6": "Design and features",
    "12": "Audio performance",
    "18": "Don't buy them if..."
  },
  "links": {
    "budget wireless earbuds": "https://www.techradar.com/best/the-best-budget-wireless-earbuds",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around"
  }
}