{
  "source": "https://www.techradar.com/reviews/duckduckgo-search-engine",
  "title": "DuckDuckGo search engine review",
  "category": "computing",
  "updated": "2021-08-05T06:05:20Z",
  "author": "lindsay-pietroluongo",
  "summary": "Minimalistic search engine with major privacy promises",
  "verdict": "DuckDuckGo is a simplified search engine with basic functionality, a handful of customization options and tracker-free, super-safe browsing.",
  "pros": [
    "Zero online tracking",
    "Fast and easy installation",
    "Smooth, bloat-free functionality"
  ],
  "cons": [
    "Limited customization options",
    "Unattractive search results"
  ],
  "article": [
    "Some people love the idea that everything you do online is cataloged because it means you get 100% tailored offers when you’re watching YouTube, scrolling through Facebook or searching online. On the other hand, there are plenty of people who definitely don’t like all of that personalization. Being watched by a so-called digital Big Brother, to the point where every ad and offer you see is exactly related to something you were just looking for, can give people the creeps. And on top of feeling over-watched, it can also make users feel like their security is at risk.",
    "Enter tracker-free browsing from DuckDuckGo, a barebones search engine with one main goal: To keep you as anonymous as possible when you’re online.",
    "DuckDuckGo is a pretty minimalist search engine (which is the point), but it has a handful of features and settings that can help you customize it. Basically, the settings let you adjust how the pages appear, like whether or not you want to see page numbers, for example. You can also tailor settings for the following:",
    "There are also a lot of appearance settings to tweak, like alignment, colors, font, font size, page width, etc. If you do a lot of online searching, being able to decide exactly how you want your search engine results to look is a nice option.",
    "Plus, you can save your settings to the cloud to easily apply them in the future. This is helpful if you want to use DuckDuckGo on multiple computers and browsers or if you want to use different themes for different purposes. For example, maybe you like working with a light theme but browsing articles with a dark theme, or you have different settings based on whether kids or adults are using the browser.",
    "Bangs are DuckDuckGo’s shortcuts that deliver search results from other sites, like Amazon or Wikipedia. For example, if you wanted to search for records on Amazon, you’d input “a! vinyl” – the a! tells DuckDuckGo that you want to search on Amazon. Know this, though – DuckDuckGo can’t protect your privacy if you’re searching on those other sites; your info will be subject to that search engine’s policies.",
    "DuckDuckGo’s whole pitch is that it’s an extremely safe-to-use search engine and that you can search online without worrying about being tracked. They don’t store personal info or follow you with ads. According to the website, “We don’t track you. Ever.”",
    "DuckDuckGo’s products also offer site encryption. Plus, the Privacy Grade tells you if a site can be trusted before and after DuckDuckGo applies its Privacy Protection.",
    "You don’t have to do anything to get these privacy features working. They’re all built-in and ready for you to take advantage of as soon as you start using DuckDuckGo. The privacy settings you can alter are minimal.",
    "Since I was using the Safari browser, I had customized “Add DuckDuckGo to Safari” buttons on pretty much every page of their website (and then tailored for Chrome when I checked out the site using that browser). This completely took the guesswork out of how to find and download the right version for my computer.",
    "After clicking the button to add it, I got a pop-up with the steps to set DuckDuckGo as my default search engine. It’s super easy – on Safari, you just click the magnifying glass in the search bar and then choose DuckDuckGo from the drop-down.",
    "When you download the app for Mac, you have to enable the features within your browser. The app will walk you through how to do that. You don’t even have to find the menus in your browser preferences – DuckDuckGo opens them for you.",
    "Other than that, searching with DuckDuckGo is the same as with any other search engine – you enter a word or phrase, hit Search and it does its thing. The mobile app is especially nice to use, though. It has the duck mascot pop up with chat bubbles to show you around the app, and everything is fast and smooth.",
    "DuckDuckGo has two options for using it:",
    "Browser Extension - If your only concern is enabling private search, then you just need to enable DuckDuckGo as your default search engine in your browser.",
    "App - If you want extra privacy, then you’ll want to download and install the app. This blocks hidden trackers and connects you to a website’s encrypted version (if it’s available).",
    "If you want to use DuckDuckGo on your mobile device, there’s an app for that, too.",
    "DuckDuckGo’s search results don’t look nearly as nice as Google’s. Compare the two below:",
    "That shouldn’t be too much of a turn-off, though. When I played around with searching for similar keywords (like “Beach Boys albums,” I had richer results from DuckDuckGo, similar to what I saw on Google and Yahoo the first time around.",
    "We love what DuckDuckGo strives for – worry-free anonymity and safety online. And the fact that the search engine has limited options isn’t a bother; instead, it’s a nice change to be able to download, personalize and start using software in under 30 minutes. While search results may not always look as busy and vibrant as on other search engines, the information you’re returned is often just as thorough and reliable. Plus, we can’t help but be wooed by the mobile app, which, on top of being safe, feels ultra-light and quick.",
    "You may also want to check out our article on how to keep your email inbox safe from trackers using DuckDuckGo."
  ],
  "headers": {
    "2": "Features",
    "5": "Bangs",
    "6": "Privacy",
    "9": "In use",
    "13": "Platforms",
    "17": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "DuckDuckGo": "https://duckduckgo.com/",
    "Bangs": "https://duckduckgo.com/bang#bangs-list",
    "safe-to-use search engine": "https://duckduckgo.com/privacy",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "browser": "https://www.techradar.com/best/browser",
    "how to keep your email inbox safe from trackers using DuckDuckGo": "https://www.techradar.com/news/duckduckgo-wants-to-kill-off-email-spying-for-good"
  }
}