{
  "source": "https://www.techradar.com/reviews/oneplus-9-review",
  "title": "OnePlus 9 review",
  "category": "phones",
  "updated": "2021-04-26T14:02:30Z",
  "author": "david-lumb",
  "summary": "Finally: a great-value option with no major drawbacks",
  "verdict": "The OnePlus 9 comes with a fix for the most glaring flaw of prior OnePlus flagships: courtesy of a partnership with Hasselblad, the cameras offer better color correction, and both regular and ultra-wide photos look great. The lack of a telephoto lens and other flagship perks found on its Pro sibling aren’t missed too much, given the relatively low price you're paying for high specs and very fast charging. If you’re hunting for a flagship Android phone at an affordable price, the OnePlus 9 is worth considering.",
  "pros": [
    "Great specs for the cost",
    "Good camera",
    "Fast battery recharging"
  ],
  "cons": [
    "No telephoto camera",
    "No expandable storage",
    "Lack of flagship-material polish"
  ],
  "article": [
    "The OnePlus 9 is the latest flagship - alongside the OnePlus 9 Pro - from a brand that, despite shifting its phone strategy to compete directly with other premium handsets, had until now kept coming up short in one category: cameras.",
    "To address this deficiency, OnePlus has partnered with legendary photography company Hasselblad in a three-year plan to improve the photo capabilities of its smartphones.",
    "The OnePlus 9 is the first attempt to right the ship, and the improvements are noticeable, with better color fidelity and improved low-light performance. The digital zoom has also been improved, while there are some fun new tricks like the macro-simulating close-range effect on the ultra-wide camera.",
    "As much as the cameras have changed, the rest of the phone hasn’t: the design is virtually the same, from the placement of the buttons to the display to the size, which is nearly identical to that of its immediate predecessor, the OnePlus 8T, and the OnePlus 8 before that. The display hasn’t changed, either, but there’s no complaining about the sharp 6.55-inch Full HD Plus resolution AMOLED display.",
    "The OnePlus 9 packs the new Qualcomm Snapdragon 888 chipset, and while the 8GB / 128GB or 12GB / 256GB RAM and storage options are the same as for its predecessor, they're on a par with other flagship phones in its price range (most notably, the Samsung S21).",
    "What the OnePlus 9 does better is recharge its 4,500mAh battery extremely quickly – from empty to 100% in around half an hour with its Warp Charge 65T charger.",
    "Ultimately, the OnePlus 9 provides great performance and battery life for its price, while shoring up its camera offering, and it all makes for a serious-value package. Sure, the phone inherits a lot from the OnePlus 8T, but with its greatest weakness addressed, the newest affordable flagship makes a strong case to be the best phone at its price tier.",
    "The OnePlus 9 launched on March 23, and is available to buy now in the US. It's also now available to buy in the UK, though the wait was longer there, with the phone not going on sale until April 26. It isn't on sale in Australia, and nor will it be, as the company doesn't sell phones there currently.",
    "The OnePlus 9 starts at $729 / £629 (about AU$940) for the 8GB of RAM / 128GB of storage model, while bumping that up to 12GB of RAM / 256GB of storage raises the price to £729 (about $829, AU$1,070).",
    "You can buy both models in the UK, but those in the US are only able to buy the 8GB of RAM variant. That price makes the OnePlus 9 slightly cheaper than, and competitive with, the Samsung S21, which starts at $799 / £769 / AU$1,249.",
    "But it also makes the phone very good value compared to the OnePlus 9 Pro; while it misses out on a couple of key features and flourishes (telephoto lens, 50W wireless charging), it's much more affordable than its pricier sibling, which starts at $969 / £829 (about AU$1,250).",
    "In the US, it is sold by online vendors Amazon, Best Buy, B&H, and on OnePlus.com. Only T-Mobile carries the phone, and it will work on Verizon (LTE and 5G, though the phone doesn't support mmWave) and AT&T (LTE only so far).",
    "The OnePlus 9 comes in three colors: the light-purple Winter Mist with a gradient effect, the light-blue Arctic Sky with matte finish, and the glossy Astral Black.",
    "There’s no getting around it: the OnePlus 9 has a very similar design to its predecessor, the OnePlus 8T, aside from the obviously different camera block.",
    "It has the same glass-fronted 6.55-inch display and glass back as its predecessor, and the same lock button and signature OnePlus ring/vibrate/silent toggle on the right side and volume rocker button on the left, all of which are in easy reach when you're casually holding the phone. There's also the same USB-C port on the bottom with the speaker to the right, as well as a second speaker out of the earpiece.",
    "There is one difference between the OnePlus 9 and its predecessor: its frame is plastic, not metal. Also, the OnePlus 9 is IP68-rated for dust and water resistance – if you get it from a carrier like T-Mobile, that is; otherwise it's conspicuously unrated, although identical in design, winkingly providing the same protection but without the costly certification.",
    "Inheriting so much from its predecessor isn’t a bad thing: the OnePlus 9 looks much like other flagships in its more affordable tier, like the standard Samsung S21 – that is, the materials are high-quality, but it lacks some of the flourishes of the priciest phones. To wit, both phones have AMOLED displays, but they’re flat, without the 'waterfall' curved edges of their premium siblings.",
    "The OnePlus 9 does have a glass back, unlike the S21’s plastic (or 'glasstic') back, but not all glass is equal: the former phone’s rear doesn’t have the same density and classy feel as the glass backs of other flagships. Tap the back of the OnePlus 9 and it sounds a bit hollow, like plastic backs. This isn’t a major drawback, just something to keep in mind: affordable flagships are made with affordable-flagship materials.",
    "As previously mentioned, the OnePlus 9 has a 6.55-inch AMOLED display, with a Full HD Plus-resolution (2400 x 1080) screen. It produces sharp, vibrant visuals, much like the display on its predecessor.",
    "The screen is only broken up by a punch-hole in the top-left corner for the front-facing camera. It has an in-screen fingerprint sensor, which we found only read our print reliably when our finger was upright in relation to the phone – don’t be surprised if you have to unlock the phone via face or passcode every so often.",
    "The display has a 120Hz refresh rate, which in practice means a much smoother visual experience when you're browsing apps or scrolling your social feeds. Games that support up to 120fps should also benefit from this feature.",
    "The OnePlus 9 does miss out on a pair of features that are exclusive to the OnePlus 9 Pro. One of these is low-temperature polycrystalline oxide (LTPO), a backplate to the display that enables the phone to dynamically set the refresh rate based on what you're doing, dialing it down for low-intensity activities like browsing photos to save battery (a feature first seen in Samsung phones).",
    "The other, Hypertouch, reduces the latency of touch controls by 25-30ms, conceivably improving performance in competitive online games like PUBG; if you're playing on the OnePlus 9 you'll have to rely on your reactions rather than software.",
    "The OnePlus 9 has a triple rear camera setup, though you’ll probably only realize that you’re using two of them. The 48MP main camera and 50MP ultra-wide camera are what you’ll use most, while the 2MP monochrome sensor helps with low-light photography, and with black-and-white photos if you set the correct filter.",
    "The big news in the cameras department is OnePlus’ three-year partnership with noted camera brand Hasselblad, with the OnePlus 9 and 9 Pro cameras bearing the first fruits of this collaboration. It may be a year (or more) before Hasselblad lenses end up in the company’s phones, though, and its big contribution this time around is in the area of color calibration. As with most tweaks, this is mostly apparent in side-by-side tests, with images showing more vibrant and true-to-life colors.",
    "While we found the color reproduction to be slightly less precise than in images taken on last year's iPhone 12 Pro – still the high-water mark for phone photography in 2021 – the OnePlus 9 unquestionably takes better photos than its predecessors. In side-by-side comparisons (below), the color range is not just more true-to-life, the camera captures more detail in surface textures and shadows.",
    "This improved color reproduction is evident in images taken with both rear cameras, the 48MP main and 50MP ultra-wide. The latter camera also packs an extra surprise: a specialty macro mode that captures up-close photos that are easily better than those shot on other phones with designated macro lenses, including the OnePlus 8T. It also comes with a freeforming lens, which OnePlus claims corrects barrel distortion – the warping at the sides of images from some ultra-wide cameras – down to 1%, and it appears to work, as we didn’t notice any distortion.",
    "There's also another cute photo mode: tilt-shift, which allows you to keep the center strip of the scene of subject in focus and blur the rest. It's a neat trick, even if it doesn't have too many applications.",
    "There’s also a 16MP front-facing camera that shoots admirable photos, with good color and sharp detail, although these have weirdly narrow dimensions. Portrait selfies are pretty spectacular though, especially given that there's only one camera pointing out of the display.",
    "That’s not all from Hasselblad – the phone’s Pro Mode has been customized to resemble the screen on Hasselblad cameras (even up to the yellow shutter button), and a shutter sound has been added that simulates the sound of a 'proper' camera. There aren’t just cosmetic effects though: the Pro Mode has more controls, allowing you to manually adjust ISO, white balance, shutter speed, focus, and more, although tinkering with them one at a time takes a little bit of finagling. Better still, you can save images in the 12-bit raw format for optimum quality and editing flexibility.",
    "The OnePlus 9’s main camera shoots video in 8K 30fps, providing 16x the pixel count of the standard 1080p. The ultra-wide camera can shoot time-lapse videos, and there’s a low-light video option called Nightscape Video 2.0.",
    "The OnePlus 9 packs the same top-tier specs as the OnePlus 9 Pro, and aside from an updated chipset, the same RAM and storage options. It’s fast, running games and loading apps without a hitch.",
    "The OnePlus 9 has a Qualcomm Snapdragon 888 and 8GB or 12GB of LPDDR5 RAM and 128GB or 256GB of UFS 3.1 storage, which puts it on par with the Samsung Galaxy S21, at least on paper.",
    "Where you live will dictate which variant you can buy, and those in the US are only able to buy the 8GB of RAM version. Those in the UK can buy both options.",
    "In performance benchmarks, it certainly holds its own with a Geekbench 5 multi-core average score of 3654 - outperforming nearly every other Android phone on the market.",
    "Frustratingly, the OnePlus 9 doesn’t have expandable storage, meaning you’ll have to live with either 128GB or 256GB and rely on the cloud if you run out of room.",
    "The OnePlus 9 runs Android 11, as well as OnePlus’ UI, presenting the usual combination of clean interface and helpful menu features. The OnePlus 9 is a 5G-capable hone, but it doesn’t support mmWave – only mid and sub-6 bands.",
    "The OnePlus 9 has a 4,500mAh battery, which is substantial, and should get you through the day, though there are other flagship phones with larger batteries.",
    "The OnePlus 9’s real advantage lies in its charging speeds. You get the Warp Charge 65T charger in the box, which OnePlus CEO Pete Lau claims will charge the phone to 100% in just under half an hour, and also has 15W Qi wireless charging.",
    "In our tests, we found much the same results for wired charging. These wildly fast recharging speeds are partially due to the battery's construction, as the 4,500mAh unit is actually split into two roughly 2,250mAh cells that are charged in parallel by the 65W wired charger.",
    "It’s a development that debuted in the OnePlus 8T, which recharged from zero to 100% in just under 40 minutes with its Warp Charge 65 charger – the OnePlus 9 shaves nearly 10 minutes off that time with improvements to the power brick, hence the ‘T’ in the Warp Charge 65T name.",
    "First reviewed: March 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "OnePlus 9 release date and price",
    "13": "Design",
    "18": "Display",
    "23": "Camera",
    "31": "Specs and performance",
    "37": "Battery life",
    "41": "Don’t buy it if…"
  },
  "links": {
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "Samsung S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "and 5G": "https://twitter.com/GLKCreative/status/1375542717577576452",
    "Android 11": "https://www.techradar.com/news/android-11",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "claims": "https://twitter.com/PeteLau/status/1372543685586485250"
  }
}