{
  "source": "https://www.techradar.com/reviews/oral-b-genius-x",
  "title": "Oral-B Genius X review",
  "category": "fitness",
  "updated": "2021-08-02T13:46:34Z",
  "author": "cat-ellis",
  "summary": "A great brush whether used with or without Oral-B's smartphone app",
  "verdict": "The Oral-B Genius X is a robust, well designed electric toothbrush that neatly bridges the gap between 'smart' brushes and regular ones. The Oral-B app adds some excellent tools to help improve your brushing technique and ensure you don't miss a spot (it tracks the brush's position in your mouth in real time with surprising accuracy), but the Genius X also delivers a thorough clean if you prefer not to connect it to your phone. It's perhaps not the best brush if you have particularly sensitive gums, as the cleaning action is pretty vigorous and it takes a quite a lot of pressure to activate the warning sensor, but it's an otherwise great all-rounder. Its cleverly designed charging case is a highlight too, and gives regular travellers extra options for keeping their brush powered up.",
  "pros": [
    "Works well with or without app",
    "Very accurate location detection",
    "Excellent charging case"
  ],
  "cons": [
    "Rather noisy",
    "No display on handle",
    "Pressure sensor not very sensitive"
  ],
  "article": [
    "If you're on the fence about smart toothbrushes, the Oral-B Genius X could be the one for you. Just like top-end electric toothbrushes such as the Philips Sonicare 9900 Prestige and the Oral-B iO Series 9, the Genius X can provide real-time brushing guidance as you work your way around your mouth via a smartphone app – but even if you decide to forego the bells and whistles, you're still getting a very good, powerful electric toothbrush.",
    "Skipping the app means you lose out on feedback that could help improve your technique, but you aren't missing any of the key features. Some other brushes only allow you to change modes or see pressure warnings through the app, but the Genius X puts all this on the handle, where it's visible at a glance.",
    "The Genius X also has a particularly well designed charging case. Whereas many premium toothbrushes have a case that only holds a single replacement head, this one can hold two. It also has two different charging ports, which is a small feature, but could be invaluable if you're somewhere without a shaver socket, and need to rely on USB instead.",
    "If you do decide the install the app, you'll find that it tracks the brush's location with impressive accuracy in real time. In fact, we found its positioning better than that of many top-end toothbrushes. Once you're done, you'll receive a report on your progress, and over time the app will build up a picture of your brushing habits that will help give useful practical suggestions to improve your oral health.",
    "It's not quite as sleek as the Oral-B iO Series 9, and it's less advanced motor means it's considerably louder, but the Genius X strikes a good balance. The Bluetooth connectivity and brush positioning can help improve your technique, but its practical design means it's also a good choice if you simply want a good quality, dependable electric toothbrush for everyday use and travel.",
    "The Oral-B Genius X was released in June 2019, priced at $199.99 / £339.99 (about AU$270) for the handle with one brush head, charging base, and charging travel case. It's dropped substantially since launch though, and can now be found for half price or less at third-party stores like Amazon.",
    "The Genius X uses standard Oral-B brush heads, which are priced at around $20 / £20 (about AU$30) for a pack of four, but are also often available for a discount.",
    "For comparison, the top-end Oral-B iO Series 9 cost around $300 / £500 / AU$400 at launch, and its specialized replacement brush heads are about $35 / £30 / AU$35 for a set of two.",
    "The Oral-B Genius X is about a standard size for an electric toothbrush, and fits comfortably in the hand. It comes in three colors: blush pink (tested here), black, and rose gold. The handle accepts standard Oral-B brush heads, which helps keep cost down long-term compared to higher-end brushes like the iO Series 9, and means you can keep using your stock of heads if you're upgrading from an older Oral-B model.",
    "Unlike the Oral-B iO Series 9, the Genius X has no screen. Instead, the brush's six modes are marked on the handle, and the currently selected one is backlit. A battery indicator at the bottom of the handle shows the remaining charge.",
    "The Genius X has a pressure sensor, with a bright light just below the brush head that illuminates if you press too hard. The light's color is customizable through the Oral-B smartphone app (the same one used by all of the company's smart toothbrushes).",
    "The brush is supplied with a travel case, which can be charged via a bathroom shaver socket. There's also a USB socket for charging the case if you don't have ready access to a suitable socket, but there's no USB cable included.",
    "The induction charging base is standard for a mid-range electric toothbrush, with a plug for a shaver socket and a large pin that fits into the base of the brush handle. This keeps it securely in place (some higher-end toothbrushes have flat magnetic charging stands that are easy to knock over), but there's no removeable plastic cover for easy cleaning, so you'll need to take care to dry your toothbrush carefully after use to avoid build-up of water deposits.",
    "The case is larger than that of the Oral-B iO Series 9, but has a similar robust design, with space inside for the brush handle and two heads. The choice of charging options is a welcome addition (not all hotels and Air BnBs will have a suitable shaver socket), though it's a shame there's nowhere in the case to stash the cable.",
    "The Oral-B Genius X gives a thorough clean, as we found in our tests using disclosing tablets, and even its everyday cleaning mode is quite powerful. In fact, you may prefer to start with the sensitive option, which uses a slower speed, to get a feel for its intensity before you begin using it regularly.",
    "It's also considerably louder than the Oral-B iO Series 9, which uses a frictionless magnetic motor. If you're concerned about waking your family with early morning brushing, it may be worth paying the extra for the higher-end brush.",
    "That's a minor quibble though, and the Genius X is an excellent all-rounder – particularly since, unlike some smart toothbrushes, it works perfectly well without its app: its pressure sensor will illuminate to warn you if you're pressing too hard, it pulses to alert you when it's time to move to a different quadrant of your mouth, and the brush powers off automatically after two minutes by default.",
    "If you decide to check out the smart features (which we highly recommend) then the process is refreshingly straightforward: just install the Oral-B app, create an account, then press your toothbrush's power button and it will be paired with your phone automatically.",
    "Once that's done, you'll be prompted to select a color for the brush's pressure sensor and choose which settings you want to use – in which order. This isn't as intuitive as it is on the iO Series 9, which has an LCD display. Instead, each of the Genius X's modes is marked directly on the brush handle, so although you can re-order them in the app, doing so will mean pressing the down button no longer cycles through them in a logical way.",
    "There are six modes to choose from (daily clean, intense, whiten, sensitive, gum care, and tongue clean), though the app doesn't describe the differences between them. The fundamental difference is the speed of the pulsing and oscillating motion, with modes such as intense and whiten being faster, and sensitive and gum care being slower.",
    "Once you're ready to begin cleaning, turn on the brush and a graphic will appear on-screen showing a set of teeth divided into six sections, which will gradually turn from dark blue to white as you brush. Interestingly, we found its positioning actually worked better than that of the iO Series 9, detecting when we moved to a different section of our mouth with impressive accuracy.",
    "The Oral-B Genius X has a less sophisticated pressure sensor than the iO Series 9. The Genius X will only alert you if you're not pressing hard enough (which takes quite a lot of force), whereas the iO Series 9 will also let you know if you're not applying enough pressure. If your dentist has advised you that you have a tendency to be heavy-handed then this (combined with the rather vigorous brushing action) might make a higher-end brush like the iO Series 9 or Philips Sonicare Prestige 9900 a better choice.",
    "If, on the other hand, you've been told that you tend to miss a particular spot, then the Genius X could be exactly the tool for you, at a very reasonable price.",
    "As we've mentioned above, the Oral-B app works with the Genius X to give real-time feedback on your brushing, showing how well you're cleaning each section of your mouth as you move around each surface.",
    "Even if you'd rather not use it every time, the app is still worth installing so you can tweak the way the brush behaves when not connected to your phone. For example, if you find that a thorough clean often takes you longer than two minutes, you can disable the timer that turns it off once that time is up.",
    "After you've finished cleaning, the app will rate the effectiveness of your cleaning, and suggest some extra steps that you can take to further improve your oral hygiene: flossing, brushing your tongue, and using mouthwash. These details are all logged, and you can check your brushing history in a calendar view to track patterns.",
    "You will also be awarded badges for certain achievements, such as brushing your tongue for a certain number of days in a row; something that could well prove useful if you want to encourage your kids to take better care of their teeth."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and release date",
    "8": "Design",
    "14": "Performance",
    "23": "Smartphone app",
    "27": "Don't buy it if"
  },
  "links": {
    "electric toothbrushes": "https://www.techradar.com/best/electric-toothbrushes",
    "Philips Sonicare 9900 Prestige": "https://www.techradar.com/reviews/philips-sonicare-9900-prestige",
    "Oral-B iO Series 9": "https://www.techradar.com/reviews/oral-b-io-series-9"
  }
}