{
  "source": "https://www.techradar.com/reviews/square-pos-system-review",
  "title": "Square point of sale (POS) system review",
  "category": "computing",
  "updated": "2021-10-28T11:50:32Z",
  "author": "anthony-spadafora",
  "summary": "An iconic POS system, known for it's efficiency and minimal design. But how suitable is it for your business?",
  "verdict": "Square POS is well-suited to meet the needs of small business owners and vendors on the go, but it’s not such a good fit for those organizations with larger volumes of transactions.",
  "pros": [
    "No monthly fees",
    "Wide range of hardware options",
    "Supports Android and iOS",
    "Can operate in offline mode"
  ],
  "cons": [
    "Possibility of account freezes or suspensions",
    "High fees for larger businesses"
  ],
  "article": [
    "Get a quote for a POS system today.",
    "Back in 2009, a small startup called Square (co-founded by Twitter’s Jack Dorsey) devised a simple solution that enabled merchants of all sizes to accept payments on their mobile devices.",
    "By inserting its Square Reader into the 3.5mm headphone jack on a smartphone or tablet, the company allowed users to take payments via its app for the first time on a mobile device.",
    "Square turned the POS system industry upside down with the release of its first product a decade ago, and since then the company has produced new hardware and software to further empower small businesses, even during the coronavirus outbreak.",
    "Indeed, Square POS recently introduced a new self-service ordering feature that can be used by Square Online sellers, particularly those selling food and drink. So, you may be wondering how the firm stacks up against rivals now, and whether or not Square is the right payments solution for your business. Let’s explore these issues in more detail.",
    "Looking for an alternative to Square POS? Competitor POS (point of sale) systems are offered by the likes of Lightspeed POS, EposNow, First POS, Shopify and Square POS.",
    "Square may not charge its users a setup fee or monthly fees but it does take a percentage of each transaction with the rate of the transaction depending on which Square hardware product you decide to use. Here are how the prices shape up depending on your choice of hardware:",
    "Customers with a Square Reader and Stand are charged 2.75 % per transaction.",
    "Customers with a Square Terminal pay 2.6 % plus $0.10 per transaction.",
    "Customers with a Square Register pay 2.5 % plus $0.10 per transaction.",
    "All of these charges occur when a customer pays by tap, dip or swipe for payments taken on Square's hardware.",
    "Square’s prices may be higher than other credit card processing companies, but there are no overhead costs to deal with, and all retail and mobile customers get a Square Reader for free. The company does not charge users a monthly fee and there are no monthly minimums to be met, which makes the service a great fit for businesses that only occasionally need to process credit cards.",
    "Getting started with Square is a straightforward and simple process. First things first, you will need to register on the company’s site where you’ll be prompted to enter your name, email address and some information about your business.",
    "Next you need to provide your banking details including your routing number so that Square can pay you for sales made using its platform, though note that it can take up to a week to verify your bank account. The company will also send you a free Square Reader in the post in seven to ten business days.",
    "New users will have to set up their account on Square Dashboard which serves as the online headquarters for their business. Here, it is possible to add locations, employees, items and more, as well as taking care of the likes of setting up inventory management.",
    "To get started taking payments, though, you have to download the Square Point of Sale app from either Apple’s App Store or Google’s Play Store depending on your device. Once you’ve downloaded the app, go ahead and sign in to your store (the app also works with multiple stores) and you will be presented with a grid that shows the products you’ve set up on Square Dashboard in the center, with your product categories on the left and the sales receipt on the right.",
    "When you choose a product, a pop-up window lets you specify the size, quantity, taxes and discounts for each item. A button at the top-right of the app labeled Split lets you easily split a bill between customers, and can also come in handy if a customer wants to use several payment methods such as cash plus a gift card.",
    "Once a customer is ready to pay, they can swipe their card or dip their chip depending on which piece of Square’s hardware is being used. If you’re using the app on a tablet, simply turn the device towards your customer so that they can sign and tip, completing the transaction.",
    "The exact setup process will vary depending on which of Square’s systems you’re using, but overall it’s easy enough for any small business owner to get up and running in a short amount of time. The Point of Sale app also guides new users through how to conduct a transaction when they open it for the first time.",
    "Square POS hardware covers all bases when it comes to taking and processing payments. If you need a fully-integrated point of sale and payments terminal then the Register is ideal, featuring as it does a dedicated customer display. Alternatively, get the Square POS stand and you can simply turn your own iPad into a Square point of sale location.",
    "Meanwhile, the Terminal is a compact device that enables you to accept payments and also print receipts, while the very common readers that are already commonplace offer compact and convenient processing of payments. Square also has numerous accessories to boost the usefulness of its service, with everything from cash drawers and barcode readers through to printers and scales being available.",
    "The Square POS system also bristles with cool features, such as the company’s Card on File which allows users to safely and securely store customer card information. This can be quite useful for repeat customers who are tired of swiping their cards, and because the company hosts and secures this customer data, you are still PCI compliant.",
    "Card on File also works with Square Invoices as well as e-commerce using Square’s APIs. You will have to pay extra to use this feature as Square charges you the keyed entry rate, but it’s still a nice addition.",
    "Square is also able to operate in an offline mode in the same way that more complex POS systems offer (such as NCR Silver POS). This feature is a godsend for small vendors that need to operate in venues with poor internet connections such as festivals or in remote areas.",
    "Square’s Virtual Terminal gives vendors the ability to enter credit card payments from any internet-connected device with a web browser. This feature is free and retailers only need to pay the processing costs for each transaction just as they normally would. Virtual Terminal can even be used to store card data to charge customers without them having to re-submit their payment information.",
    "Invoicing can be taken care of using Square’s built-in tools, but third-party integration is also supported if you want to use other invoicing software. The company’s invoicing tools support both one-off and recurring invoices as well as installment payments.",
    "There’s even a wide range of templates available for creating contracts with Square POS. Purchase orders, images and other files can easily be attached to your invoices so that you can keep everything neat and tidy in one place.",
    "For merchants that wish to use their funds from Square right away, the company has created the Square Card. This MasterCard debit card gives sellers immediate access to their funds without the need for a bank transfer. The card works at stores, online, and even at ATMs with Square providing an automatic 2.75% discount when you shop with other Square merchants. As mentioned earlier, Square also recently unveiled a new feature for Square Online sellers that allows businesses to print their own QR codes on signs, tables, menus and so on.",
    "Aimed mainly at food and drink outlets that have suffered badly during the pandemic, it offers a contactless and largely touch-free way of boosting orders. Customers can use Apple Pay, Google Pay or indeed Square Pay to settle up once an order is completed.",
    "Square may have shook up the market with its first card reader, but since then other similar services have launched to compete in the mobile payments space. While we could list every one of the company’s competitors, it’s a more worthwhile exercise to highlight a couple of key providers which offer similar solutions geared towards small businesses looking to accept credit cards.",
    "Online payments company PayPal launched its PayPal Here POS service back in 2012. While its Chip Card Reader for $14.99 is not as elegant as the Square Reader, its new Chip and Tap Reader for $59.99 is almost identical to Square’s device, but it comes in black.",
    "PayPal Here’s standard rate for swipe and dip is 2.7%, although there is an additional cost for processing international cards from outside of the US.",
    "Intuit (of QuickBooks fame) has also released its own mobile payments solution called Intuit GoPayment. If you’re already heavily invested in the QuickBooks ecosystem, then the fact that the company’s mPOS offering integrates perfectly could be a big selling point.",
    "The Intuit GoPayment app for Android and iOS is free and the company sends you a free card reader just like Square does. However, you’re probably better off spending $49 for Intuit’s All-in-One reader that accepts chip, swipe and contactless.",
    "The fact that Square provides the necessary software and even the hardware to start accepting card payments means the service’s barrier to entry is quite low. Anyone can register on the site, receive their Square Reader in the mail and start accepting card payments in no time, which is perfect for small businesses looking to try out new ways of taking payments.",
    "However, the company is quite strict when it comes to investigating fraud or other illegal activities on its platform. Just bear in mind this could potentially mean that if a business suddenly starts doing incredibly well, its Square account could be subject to a review, freezing its cashflow.",
    "Mobile vendors or small businesses that want to accept card payments occasionally will likely be quite pleased with Square. However, if your business processes a huge volume of transactions, you’re better off looking for a more advanced POS system better suited to your requirements."
  ],
  "headers": {
    "6": "Square POS pricing",
    "12": "Square POS setup",
    "19": "Square POS features",
    "29": "Square POS competition",
    "34": "Square POS final verdict"
  },
  "links": {
    "Get a quote for a POS system today.": "https://www.techradar.com/news/get-a-quote-for-a-pos-system-today",
    "POS system": "https://www.techradar.com/news/the-best-pos-system",
    "Square Online": "https://www.techradar.com/news/squares-new-self-service-ordering-system-offers-help-to-the-hospitality-industry",
    "payments solution": "https://www.techradar.com/best/best-payment-gateways",
    "Lightspeed POS": "https://www.techradar.com/reviews/lightspeed-point-of-sale-pos-review",
    "EposNow": "https://www.techradar.com/reviews/epos-now-pos",
    "First POS": "https://www.techradar.com/reviews/first-pos-systems",
    "Shopify": "https://www.techradar.com/reviews/shopify-pos",
    "Square POS": "https://www.techradar.com/reviews/square-pos-system-review",
    "fully-integrated point of sale": "https://www.techradar.com/news/why-integrated-pos-systems-are-a-must-for-your-business",
    "NCR Silver POS": "https://www.techradar.com/reviews/ncr-silver-point-of-sale-pos-review",
    "Square Card": "https://www.techradar.com/news/square-launches-debit-card-for-smbs",
    "PayPal Here POS": "https://www.techradar.com/reviews/paypal-here-pos-point-of-sale-review",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-pos-point-of-sale"
  }
}