{
  "source": "https://www.techradar.com/reviews/activeimage-protector-data-loss-prevention",
  "title": "ActiveImage Protector data loss prevention review",
  "category": "computing",
  "updated": "2021-07-21T05:09:12Z",
  "author": "daniel-blechynden",
  "summary": "A versatile data loss prevention program with a few too many flaws",
  "verdict": "On the surface, ActiveImage Protector appears to be a solid product. However, its lack of security tools, difficult setup process, and average support services mean that we just can’t recommend it.",
  "pros": [
    "Versatile program for Linux and Windows",
    "Great selection of advanced features"
  ],
  "cons": [
    "Terrible technical support",
    "Lack of security tools or information"
  ],
  "article": [
    "With the best data loss prevention software, you can secure your devices and IT systems, creating regular backups that can be restored in the event of a system failure. Having some sort of backup program is essential for many businesses, especially those working with sensitive or valuable data.",
    "In our ActiveImage Protector review, we take a close look at this data loss prevention program. By analyzing its main features, user interface, prices, support, and more, we aim to help you decide whether or not you should be using it.",
    "There are eight different licensing options for ActiveImage Protector, and each comes with its own specific use cases. There are options for both Windows and Linux users, although there’s no support for Mac operating systems.",
    "At the cheapest end of the spectrum, the Windows Desktop edition is available for just $59 for a perpetual license. This only supports one desktop device, making it a good option for personal or small business users.",
    "If you use a Linux device, expect to pay significantly more. A basic Linux lifetime license costs $999, a Virtual Edition lifetime license comes in at $1,299, and a high-end Hyper-V Enterprise lifetime license will set you back $1,899.",
    "Advanced Windows options include the Server edition, which costs $999 for a perpetual license, and the Cluster edition, which comes in at $1,899 for lifetime use.",
    "A powerful IT Pro Edition is available for IT professionals who work with numerous clients, but this will set you back a huge $3,500 per year. Custom-priced ActiveImage Deploy USB solutions are also available on request.",
    "A 30-day free trial is available with all programs. All packages except for the Windows Desktop edition support multiple devices, server networks, or virtual drives, which means that they represent powerful options for high-end users.",
    "There’s a lot to like about ActiveImage Protector. It includes all of the expected data loss prevention features, such as regular backups and straightforward restoration, but there are also a few other tools that stand out.",
    "For one, it uses a block-based backup system, which essentially means that absolutely everything is backed up—all the way down to your operating system. You can restore an entire backup or specific files and folders, and the program’s Smart Sector technology results in smaller backup files and faster backups.",
    "On top of this, you can schedule backups to occur whenever you want them to. Set up daily, weekly, monthly, or custom schedules, and have all files stored locally, on another physical device, or via some cloud storage service. Note, though, that cloud storage isn’t included with an ActiveImage Protector license.",
    "To get started with ActiveImage Protector, we’d recommend downloading a free trial so you can test the software to see if it’s right for your needs. A 30-day free trial is available with all licenses, although installation packages are large and will likely take at least a few hours to download.",
    "Once you do get the program downloaded and installed, you will have to sign in with the provided trial license key. Then, you will be taken to the management dashboard, where you can schedule and manage backups and restorations.",
    "The user interface is tidy and intuitive, and you shouldn’t have any problems finding your way around. Navigate via the menus on the left of the screen, and take advantage of the great selection of tools that’s available here.",
    "Unfortunately, ActiveImage Protector support services are quite limited. An email address is provided, but don’t expect fast replies or anything more than basic help. Live chat also appears to be available, although we were unable to reach an agent at any time.",
    "There’s also a knowledge base and technical documentation, but we found these quite bare and confusing, to say the least.",
    "Unfortunately, ActiveImage Protector provides absolutely zero information about its security practices. While this is a little concerning, it’s probably nothing to be too worried about.",
    "This is largely because, once you have a license, nothing is transmitted through or stored on the platform’s servers. Instead, you can choose to have backups stored locally or uploaded to a cloud service such as Google Drive or Dropbox.",
    "ActiveImage Protector appears to be a decent product on the surface, but it’s not a popular option, which can make it hard to gauge its long-term viability.",
    "We’d recommend going for an alternative such as Acronis, which is designed to help you back up data locally, to the cloud, or to another physical device. Various operating systems and cloud platforms are supported, and excellent 24/7 customer support is available across the board.",
    "Another great option is CoSoSys, which really focuses on data security and regulatory compliance. It’s a favorite among large businesses whose main aim is to protect sensitive information from theft or accidental release, and it comes with a suite of advanced tools to help you do exactly this.",
    "Unfortunately, we just can’t recommend using ActiveImage Protector. Sure, it comes with a decent selection of backup features, is relatively competitively priced, and is available across Linux and Windows operating systems, but there are just too many flaws.",
    "For one, the poor technical support and knowledge base are a major concern. The lack of information about the company’s security practices also poses some questions, and the large download packages are frustrating, to say the least.",
    "The bottom line: If you’re looking for a reliable data loss prevention program, look elsewhere."
  ],
  "headers": {
    "2": "Plans and pricing",
    "8": "Features",
    "11": "Interface and in use",
    "14": "Support",
    "16": "Security",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "best data loss prevention software": "https://www.techradar.com/news/best-data-protection-companies-2020",
    "ActiveImage Protector": "https://www.actiphy.com/en-us/product/activeimage-protector-desktop-edition/",
    "Windows Desktop edition": "https://www.actiphy.com/en-us/purchase/price-activeimage-protector/",
    "Linux lifetime license": "https://www.actiphy.com/en-us/purchase/price-activeimage-protector/",
    "Virtual Edition lifetime license": "https://www.actiphy.com/en-us/purchase/price-activeimage-protector/",
    "Hyper-V Enterprise lifetime license": "https://www.actiphy.com/en-us/purchase/price-activeimage-protector/",
    "Server edition": "https://www.actiphy.com/en-us/purchase/price-activeimage-protector/",
    "Cluster edition": "https://www.actiphy.com/en-us/purchase/price-activeimage-protector/",
    "IT Pro Edition": "https://www.actiphy.com/en-us/purchase/price-activeimage-protector/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "Acronis": "https://www.techradar.com/news/acronis-data-loss-prevention",
    "CoSoSys": "https://www.techradar.com/news/cososys-data-loss-prevention"
  }
}