{
  "source": "https://www.techradar.com/reviews/500px",
  "title": "500px cloud storage review",
  "category": "computing",
  "updated": "2021-04-29T22:37:03Z",
  "author": "jonas-p-demuro",
  "summary": "Discover and share the world’s best photos",
  "verdict": "500px offers a photo sharing service that is on target for pro photographers, but those just looking for cloud storage of images may be put off by the pricing or limited upload option for the free tier.",
  "pros": [
    "Choice of plans",
    "Free tier",
    "Available quests"
  ],
  "cons": [
    "Jpg images only",
    "No editing options without additional subscription",
    "No support for videos"
  ],
  "article": [
    "There are plenty of options currently available for an online cloud storage service, and it is easy to end up with more than one. Some folks just want a service that focuses on backing up their photos for cloud storage. However, 500px does not focus on just backup, but goes in the direction of sharing photos- both for rising amateurs and professionals alike. In case you are wondering, this service is pronounced as “Five hundred p-x.”",
    "500px was launched over a decade ago in 2009. It functions as a photo sharing site for photographers to discover and also be able to share photos. It also has photo contests, and even opportunities for licensing photos. It is based out of Ontario, Canada and has a global presence as well as millions of users.",
    "500px offers a choice of tiered plans for users to use its service. We appreciate the free tier to allow the users to try the service, and of course upgrade as their needs change.",
    "The free tier does limit uploads to seven each week, which restricts this tier to lower volume users. Users can still license their work, create a directory listing, create and share galleries. Support can be accessed, but the paid tiers get a higher priority. Users can still submit to quests, and join groups.",
    "The lower paid tier gets designated as Awesome, and adds a number of useful features. For example, it becomes ad free, and the support is now priority level. Users can also create gallery slideshows, get a profile badge, and have access to their statistics. Perhaps the most valuable benefit is that the upload restriction gets lifted, and users can take advantage of unlimited uploads to stock their portfolio. There is also offline viewing, available on Android. The cost for this tier is $4.99 (GBP 4) monthly with an annual subscription, and is currently on sale for $3.99 (GBP 3) monthly which provides a significant discount, or a higher $6.49 (GBP 5) monthly without the commitment of an annual membership.",
    "Moving up to the higher paid tier is Pro, which includes all the functions and features of the free, and Awesome tiers. The additional functions added include the ability to create a Portfolio website, to add resources to the resource hub, to customize your profile, and a priority directory listing. The cost for this top package is $7.99 (GBP 6) monthly with an annual subscription, or $12.99 (GBP 9) monthly without the contract. When we first logged onto 500px and created our account, we were given a time limited two week trial of the Pro tier, which is a nice way to test drive all the upgraded services.",
    "Even at the higher tiers, there are no editing options at all included with these subscriptions which is a miss. However, there is an editing package, an additional option known as Luminar 4, which costs an additional $69 (GBP 50) on an annual basis.",
    "500px encourages its users to be on the quest of the perfect photo. As some photographers do their best work when given an assignment, 500px has its Quests feature. This allows the user to upload an entry organized around a theme. The entries are judged, and the winner gets not only some serious bragging rights, but also a cash prize, which currently range from $150 to $500 for the winner. The contests generally run for about a month. Current Quests include “Rainy Refresh,” “In Honor of Mothers,” and “Earthly Delights.” Users should be aware that the quality of the submissions tends to be quite high, which gives them an opportunity to hone their skills, but also means that a quick smartphone snap is unlikely to win any one of these.",
    "A key aspect of 500px is the ability to upload an image. While the image can be up to 200 megapixels, the format is limited to .jpg only. Also, if you plan to license the image, it must be at least 3 megapixels, be free of watermarks, logos or borders, and also be free of NSFW content.",
    "Uploading the image was a simple process, and there is an option to delete the image if you change your mind. Users get a choice if the image should be Public and available everywhere including the profile, Unlisted and available everywhere except the profile, or Limited Access which means it is only available to the user (unless added to the Gallery). The location of the image gets added automatically in the form of a street address.",
    "500px also automatically adds keywords, with an opportunity to add more by the user, or to remove incorrect ones. The keywords added were better than expected, although somehow the most obvious one, Duck, had to be put in manually. The user also has to put in a title for the image, and a brief description, along with designating a choice of category, with choices that range from Abstract, Fine Art and Landscape (for our image we selected Animals).",
    "Images can also be designated as NSFW, and there is an option to add a 500px watermark to protect the image. Finally, there is an option to add the image to a Gallery.",
    "With the image uploaded, a neat feature is to be able to see the Statistics for your images. This includes info on the image over the last 7 days, including the number of photo views, likes and new followers.",
    "500px is a professional quality photo sharing service, more than pure cloud storage of images. The pluses include the choice of tiers, the Quests with cash prizes, and the ease of use. Misses include that the better features are reserved to the paid tiers, the add on required for even basic photo editing, and the significant upload restriction for the free tier. Overall, 500px is worth a look, realizing it is a niche product catering to professional (and aspiring amateurs) who want to share their images."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Quests",
    "8": "Uploads",
    "13": "Final verdict"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "500px": "https://500px.com/",
    "free tier": "https://500px.com/upgrade",
    "Awesome": "https://500px.com/upgrade",
    "Pro": "https://500px.com/upgrade",
    "Portfolio website": "https://www.techradar.com/news/best-website-builder-portfolio",
    "Luminar 4": "https://500px.com/upgrade"
  }
}