{
  "source": "https://www.techradar.com/reviews/masterclass",
  "title": "MasterClass learning platform review",
  "category": "computing",
  "updated": "2021-09-15T03:26:46.936Z",
  "author": "jonas-p-demuro",
  "summary": "Classes taught by notable masters in their fields",
  "verdict": "MasterClass has just over a hundred courses, many of which are taught by celebrity instructors. For those that want a much more professional experience than found in free streaming options, it will fit the requirements.",
  "pros": [
    "Celebrity instructors",
    "Toll free phone support included",
    "30-day satisfaction guarantee",
    "Cross platform support"
  ],
  "cons": [
    "Lacks some support options",
    "Annual billing only",
    "Limited number of classes",
    "No certificates issued"
  ],
  "article": [
    "MasterClass is an online educational platform, with streaming content available across several different categories. It indicates that it has over 100 classes, in multiple categories. Also notable is that the classes are taught by instructors that are celebrities. Classes are designed to be accessible on multiple platforms.",
    "MasterClass is an online streaming platform that offers a selection of classes. The content fits into one of 11 areas that cover such topics as Sports & Gaming, Arts & Entertainment, and Design & Style to name a few examples. Across these areas there are over 100+ classes.",
    "What is notable about MasterClass is that much of this content is taught by well known experts, in many cases celebrities, unlike other sites where you would not necessarily recognize the teachers involved. For instance, celebrity chef Gordon Ramsay teaches a course in “Restaurant Recipes at Home,” Shonda Rhimes from Grey’s Anatomy teaches “Writing for Television,” and celebrity physicist Neil de Grasse Tyson’s course is “Scientific Thinking and Communication.” Additional classes are added monthly.",
    "MasterClass’ formula is a little different than the competitors. While some of them have thousands upon thousands of different classes, here you will find considerably less topics covered. However, rather than a single video on the topic, we find with MasterClass that it gets broken up into smaller sections, with each averaging about 10 minutes, and each class is about 20 lessons long, so this ends up being a more comprehensive view of the subject.",
    "You can easily preview the class with a trailer, and the ones watched had cinematographic value, with soundtracks, and tight editing. While completing a class does get you an email for proof, there is no certificate issued. Also, each class also has a PDF workbook to accompany it and provide supplementary material.",
    "The topics covered are more of casual interest than for hardcore professional topics. For example, in the Design topic, we find courses on Photography, and also on Interior Design, but not anything on web design, or more business oriented topics.",
    "MasterClass has a three tiered plan for individuals. The lowest, designated as Standard, starts at $15 monthly, and is billed annually. This plan has the limitation that you can only watch on a single device at a time, and also does not support offline viewing on the iOS platform which is useful when there is no internet access. However, even this lowest plan has access to the entire catalog of over 100 classes spread out among the eleven categories. It also has the bonus workbooks and content, along with discussion of the course among learners in the members-only community area. Content can be viewed on multiple platforms that include a PC, a TV, a smartphone, or a tablet.",
    "The middle plan is the Plus plan, and the cost goes up to $20 monthly, also billed annually. This has all the features of the lower plan, but upgrades it to allow two devices that can view content simultaneously, and enables offline viewing on the iOS platform, which would be useful on an airplane, for example.",
    "The top plan is known as Premium, and runs $23 monthly, again billed annually. This plan adds all the features of the lower two plans. The feature added is that this highest plan supports viewing of content across 6 devices.",
    "A discount is offered for the MasterClass Plus for Students Plan. This is essentially the middle tier plan, with the exact same feature set, at a reduced cost of $10 monthly- essentially a 50% savings from the full price.",
    "Support for MasterClass has but a few options. One is a toll free number, and also of note it was easy to find. The other option to get some help is via an online portal to submit a query, and a file can be uploaded as well. There are also some FAQ’s that can answer the common questions.",
    "Lacking in the armamentarium of support options are a chat box, a direct email, a fax number, and forums. We also did not see any whitepapers, eBooks, or online support videos.",
    "MasterClass has highly rated smartphone and tablet apps for both the iOS and Android platforms. This includes the iOS app that garners a particularly high 4.9/5 star rating with over 97k reviews. However, despite the stellar rating, while iOS app users are more than satisfied with the content, there are some issues with the app itself, which includes a buggy interface, as it can be difficult to find and use the content.",
    "The Android app also has a high rating, at 4.7/5 stars, with over a million downloads, and 17k ratings. The content is well received on this platform, but users point out two issues: that it is difficult to cancel a subscription, and that on Android they are not able to download content for viewing when offline (which in MasterClass’ defense, is clearly stated that download is supported for iOS).",
    "When it comes to video streaming courses done on a professional level, MasterClass raises the bar. After all, who wouldn’t want to learn about filmmaking from James Cameron? Other pros include the cross platform support, the highly rated apps, and the PDF workbooks. The cons encompass the annual subscription requirement (especially for those that want only a single course), the limited breadth of course topics, and the lack of course completion certificates. For those that have an interest in the topics presented, MasterClass takes video streaming education to the next level."
  ],
  "headers": {
    "1": "Features",
    "6": "Plans and pricing",
    "10": "Support",
    "12": "User reviews",
    "14": "Final verdict"
  },
  "links": {
    "MasterClass": "https://shareasale.com/r.cfm?b=1454302&u=1338591&m=62509&afftrack=trd-us-8089047165471427000&urllink=https%3A%2F%2Fwww.masterclass.com%2F",
    "online educational platform": "https://www.techradar.com/best/best-online-learning-platforms",
    "Standard": "https://shareasale.com/r.cfm?b=1454302&u=1338591&m=62509&afftrack=trd-us-1397122707871230700&urllink=https%3A%2F%2Fwww.masterclass.com%2F",
    "Plus": "https://shareasale.com/r.cfm?b=1454302&u=1338591&m=62509&afftrack=trd-us-9316165602044056000&urllink=https%3A%2F%2Fwww.masterclass.com%2F",
    "Premium": "https://shareasale.com/r.cfm?b=1454302&u=1338591&m=62509&afftrack=trd-us-4826511894578914000&urllink=https%3A%2F%2Fwww.masterclass.com%2F"
  }
}