{
  "source": "https://www.techradar.com/reviews/wacom-mobile-studio-pro",
  "title": "Wacom Mobile Studio Pro review",
  "category": "computing",
  "updated": "2021-12-05T23:29:33Z",
  "author": "jess-weatherbed",
  "summary": "The Wacom Mobile Studio Pro brings full-fat features to creatives",
  "verdict": "The Wacom Mobile Studio Pro isn't for everyone, but it ticks almost every box for the niche demographic it's targeting, allowing creatives who need access to the full versions of applications like Adobe Photoshop to take their devices on the go.",
  "pros": [
    "Accurate 4K display",
    "Runs full versions of software",
    "High-quality stylus",
    "Macro buttons are a great time saver"
  ],
  "cons": [
    "The display can be a little dim",
    "Heavy for a portable tablet",
    "Eyewateringly expensive",
    "Disappointing battery life"
  ],
  "article": [
    "The Wacom Mobile Studio Pro looks fairly unremarkable by graphics tablet standards on the surface, so if you’ve come across a listing for it then you might be wondering why it costs so much. Thing is, this highly specialized device isn’t just a drawing tablet, it’s an entire portable workstation, allowing those in professional creative careers to take full versions of popular applications on the go.",
    "It’s fairly safe to say that with a price tag of $3,500 / £3,200 / AU$5,000 for the 16-inch version or $2,600 / £2,400 / AU$4,200 for the smaller 13-inch model, this pen computer isn’t going to be for everything, but it wasn’t designed to be.",
    "There are scenarios where people will need access to the full-fat versions of things like Adobe Photoshop or Zbrush when away from a desktop computer, and the current 2-in-1 devices on the market don’t shine a light against the creative capabilities of a real graphics tablet. Pairing a full Windows 10 computer with the high standard of pen technology we’ve come to expect from Wacom is a real game-changer for architects, 3D artists, Video Editors and Photographers that might need to work on projects while out in the field.",
    "That doesn’t mean you should shy away from buying it if there’s cash burning a hole in your pocket, but there are a good mix of pros and cons to go over that might mean you’re better spending your cash on either another Wacom project or elsewhere in the creative hardware space.",
    "The biggest con is obviously going to be the price, but if you’re just looking for a great graphics display tablet then Wacom also has the Cintiq and Cintiq Pro range (targeting professional creatives) and the more affordable Wacom One series (a great choice for a first display tablet). Both of these ranges will require you to plug the device into a laptop or desktop though, so another option would be the Huion Kamvas Studio 22, another tablet computer for creatives but this is less powerful and less portable than the Wacom Mobile Studio Pro.",
    "There’s also the argument that many illustrators these days use an iPad Pro in combination with the Apple Pencil, but this restricts you to using watered down ‘lite’ versions of official applications, or in some cases being unable to use your desired software at all. In short, if you do opt for the Wacom Mobile Studio Pro, you get what you pay for.",
    "This is the second generation of the Wacom Mobile Studio Pro, providing you with a bright 4K display and a recognizable Wacom stylus. The pen is much thicker than the Apple Pencil or Microsoft Surface Pen, but you don’t need to charge the Wacom stylus and if you’re purchasing the Mobile Studio Pro, chances are high that you’ve used a Wacom tablet previously which should help with any adjustment period.",
    "You also get some replacement nibs and some colored rings to customize your stylus if you work in a design team that leaves the pens around so you can recognize yours more easily. Wacom makes very high-quality pens for its range of tablets and this is no different, with 8192 pressure levels and a rubber grip, though you can use other Wacom branded pens with the Mobile Studio Pro if it doesn't suit your needs.",
    "There are two sets of four buttons across the side of the tablet (that can be rotated depending on your dominant hand or preference) with a circular button between them. That circular button has navigational buttons surrounding it and the middle section doubles as a fingerprint scanner, as well as yet another button in its own right, in this case as a Windows Home key. That’s a lot of macro capabilities right there, something that will help speed up any creative process.",
    "The fingerprint scanner is reliable and detected the correct user without fail on several tests, whilst barring entry for unauthorized users. On the opposing side, you’ll find a 5-megapixel camera and the embossed ‘Wacom’ logo, and to spoil you there’s also an 8-megapixel camera on the underside of the tablet computer.",
    "These work about as well as you’d assume for a webcam built into a drawing tablet, but if you’re forced to take a call then the forward-facing camera actually provides a better image and viewing angle than any pop-up chin camera seen on some laptops these days.",
    "The rear camera has too few frames-per-second (something not listed in the device’s technical specs) to be of much use, but it can take sufficient enough images if you’re using it in a brightly lit environment for you to use as a reference for your projects.",
    "Alongside the pen, you get a few other accessories alongside the display computer itself: A travel case for the stylus and a simple mount to attach it to the tablet itself are all included, as well as a height-adjustable stand that snaps into the back of the device.",
    "We found this to be a little fussy, but that’s mostly down to how heavy the Mobile Studio Pro is, weighing in at 4.6 pounds (2KG), making it heavier than the M1 MacBook Pro 13-inch (3 pounds / 1.4kg), but placing it at around the same weight of many gaming laptops on the market.",
    "It’s certainly not lightweight but it’s around the same dimensions as some laptop devices so you can easily slip it into most laptop backpacks, which is good because Wacom doesn’t sell a specific bag or carry case for it.",
    "Something we did notice is that despite its otherwise solid build quality it would appear the chassis is easy to damage. After traveling around town for a few hours with it in the same backpack used to test the portability of laptops, we noticed a small mark of exposed metal where the chassis’s black coating had been scratched.",
    "As we had never experienced this issue with laptops or devices using the same backpack, it was a little perplexing, but it’s worth bearing in mind that you might need to invest in an additional form of protection if you like your gadgets to look as good as new.",
    "There are three USB-C ports on the side closest to the Wacom logo; two of which support Thunderbolt 3. You’ll also find a Kensington security slot for you to either lock up the device and hook it to a bag or desk, or you can attach the provided stylus mount. On the other side you’ll find a sliding on/off switch, volume controls, a standard audio jack and an SD card reader.",
    "You can connect additional displays to the Mobile Studio Pro via either of the Thunderbolt 3 ports, including additional graphics tablet devices should you wish. On the flip side of this, you can also use it exactly as you would any other graphics tablet by pairing it with a desktop PC, which means you could connect it to a powerful workstation in the office and then take it on the go where required.",
    "There’s a lack of standard USB-A ports so you’ll need to grab an adapter if you have a specific peripheral you wanted to use, but many wireless Bluetooth accessories are available these days so it shouldn’t prove to be too much of an issue.",
    "On that note, if you need to do some typing on the Mobile Studio Pro, do consider pairing it with a decent wireless keyboard – the digital Windows keyboard is very unreliable in certain applications which can make logging to services or emailing clients a nightmare.",
    "Being able to run the full-fat version of applications on what is essentially a very chunky tablet is a real blessing, but it does come with some caveats. The Mobile Studio Pro is packing an Intel i7-8559U CPU, a Nvidia Quadro P1000 graphics card and 16GB of RAM so it's a fairly capable device (even if the processor is a little dated), and we managed to run programs like Adobe Photoshop and Blender with very little fuss.",
    "That said, there's a very slight (but noticeable) lag when using the stylus for something like sketching. It's not enough to cause any real issues when working and we found we were still able to doodle and illustrate just fine, but anyone particularly sensitive to response times with tablet pen devices may find it a little frustrating.",
    "There's a hatch that can be accessed at the back of the device that allows you to upgrade internal components like the RAM and SSD, which should help keep the device up to date for at least a few more years, but a mobile computer is always going to become outdated much faster than a separate graphics tablet will, which is worth bearing in mind before you purchase.",
    "The display itself is 85% Adobe RGB which is less than the Wacom Cintiq Pro, which offers 99% Adobe RGB by comparison, but it's worth noting that Adobe RGB has a wider range than sRGB, which is the standard scale of color space usually used to advertise monitors or laptop displays.",
    "As it's 4K, the display does look pretty darn good though, and photo or video editing on this is certainly better than on a 1080p 2-in-1 device, but for such a steep asking price we would have preferred a brighter display with something closer to the Cintiq's Adobe color range.",
    "We found that the display was a little dim, but this only proved to be an issue when we tried to use the Mobile Studio Pro in an outside space. The screen does have a slightly matte finish to it which not only helps with glare but also provides a lovely texture that's similar to paper and makes it ideal for sketching and illustrating.",
    "We ran a few benchmarks out of sheer curiosity, and while you wouldn't ideally use this as your main computing device, it did perform better than we anticipated.",
    "In PCMark 10, the Wacom Mobile Studio Pro achieved a score of 4,335 which puts it into the same ballpark as products like the MSI Summit E13 Flip Evo, but both the PCMark 10 battery test and our own hands-on experience revealed a rather disappointing result, benchmarking at 3 hours and 12 minutes.",
    "We found that depending on what you're doing with it, you can expect between 2 1/2-4 hours of real-world use for sketching and image editing against Wacom's stated 5 hours of potential, so while it's certainly portable, you won't want to be too far away from a power source.",
    "We also wouldn't recommend resting the device on your lap if you like to work away from a desk as the underside of the Mobile Studio Pro can get veeeery toasty. This is greatly reduced when you use the stand that comes with the device, and the heat kicked out isn't dissimilar to that of typical creative laptops, but you won't be able to perch this on your knee like you would an iPad.",
    "In all, there are a few things we're nit-picking but the Wacom Mobile Studio Pro only has a singular goal, and that's to give professional creatives a truly mobile graphics device that meets the standard of other Wacom drawing tablets – and it absolutely nails that target.",
    "You might also want to check out the ReMarkable 2 tablet review."
  ],
  "headers": {
    "0": "Wacom Mobile Studio Pro two minute review",
    "6": "Design",
    "21": "Performance",
    "32": "Don't buy it if..."
  },
  "links": {
    "Adobe Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2021",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Cintiq and Cintiq Pro": "https://estore.wacom.com/en-GB/screens/screens-displays.html",
    "Wacom One": "https://estore.wacom.com/en-GB/wacom-one-13-pen-display-dtc133w0b.html",
    "Huion Kamvas Studio 22": "https://store.huion.com/products/kamvas-studio-22",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Apple Pencil": "https://www.techradar.com/how-to/apple-pencil-on-ipad-our-full-guide-on-how-to-use-it",
    "M1 MacBook Pro 13-inch": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "MSI Summit E13 Flip Evo": "https://www.techradar.com/reviews/msi-summit-e13-flip-evo",
    "ReMarkable 2 tablet": "https://www.techradar.com/reviews/remarkable-2-tablet"
  }
}