{
  "source": "https://www.techradar.com/reviews/lg-nano-90-65nano906",
  "title": "LG Nano 90 (65NANO906) review",
  "category": "televisions",
  "updated": "2021-07-14T13:27:19Z",
  "author": "john-archer",
  "summary": "LG finally gets its LCD game on with the Nano 90",
  "verdict": "While the LG Nano 90 doesn’t quite turn established LCD wisdom entirely on its head, it does deliver a big enough step forward for LG’s LCD technology and transforms it into a genuine contender in the hugely competitive mid-range LCD TV market.",
  "pros": [
    "Strong color performance",
    "Easy to use",
    "Wide viewing angle support",
    "Much improved black levels"
  ],
  "cons": [
    "Missing key UK apps",
    "Mild backlight blooming",
    "Backlight flickering",
    "No HDR10+ support"
  ],
  "article": [
    "Thanks to their typically slim designs and aggressive price points, LG's LCD TVs have secured spots in a huge number of living rooms in the past few years. Their usage of the so-called IPS type of LCD panel technology, however, has presented a barrier to LG LCDs being widely adopted by TV buyers who are, understandably, motivated first and foremost by picture quality.",
    "While IPS technology is great when it comes to supporting wide viewing angles, the way it works makes it harder to control light adequately. This makes it harder than alternative methods like (narrow viewing angle) VA LCD technology to deliver the sort of contrast and black tones AV enthusiasts are typically after.",
    "With the LG Nano 90 series and, specifically its 65-inch 65NANO906, though, LG has finally come up with a solution: an intricate power control system that works well enough to put its LCDs back on the premium TV radar.",
    "The LG Nano 90 Series has been on sale for a while now, and comes in four sizes: 55-inch, 65-inch, 75-inch and 86 inches. What we're reviewing here is the 65-inch LG 65NANO906, or the LG 65NANO90 in America.",
    "In terms of pricing, the 55-inch 55NANO90 is $1,049/£999; the 65-inch 65NANO90 is $1,499/£1,299 and the 75-inch 75NANO90 is $2,499/£1,999. Finally, in the US, you can get the 86-inch 86NANO90 for $2,499.",
    "Compared with some of the ultra-slim, gleamingly metallic LCD TVs LG has produced over the years, the 65NANO906 is a bit… normal. Its dark frame is narrow but does little to hide how much plastic it contains, while its rear sticks out miles by modern TV standards.",
    "We're more than happy to cut it some slack for its rump, though, given that it accommodates a direct LED lighting system, where the LEDs are placed directly behind the screen. This sort of lighting always delivers better contrast than edge lighting, and is especially important with IPS TVs like the 65NANO906.",
    "The TV can be placed on a pair of basic-looking feet, but looks much prettier if it’s hung on your wall. Despite its fairly deep rear.",
    "Connections are strong for a mid-range TV. Of the four HDMIs provided, two can handle enough data bandwidth to support the 4K, 120Hz, HDR 4:4:4 10-bit images we’re hoping may become useful when the PS5 and Xbox Series X launch later this year. These are joined by three USBs and a digital audio output.",
    "The 65NANO906 uses LG’s own webOS platform. This hasn’t changed much from the 2019 version. The only new things of note are a sports feature that lets you track the results and live matches of your favorite sports teams; the option to customize the notifications webOS gives you; a better designed ‘Home Dashboard’ for tracking and controlling all your connected and networked devices; and improved search and recommendation systems.",
    "The biggest and most surprising webOS change is actually something the 65NANO906 has lost: the catch up apps for the UK’s main terrestrial broadcasters.",
    "This is because LG and Freeview Play were for some reason unable to renew their usual deal, leaving LG having to try and get the BBC iPlayer, ITV Hub, All4, My5 and so on added individually. Something LG is saying it is working on, but without any confirmed timescale.",
    "WebOS continues, though, to be one of the easiest to use, most customizeable and most economical (in terms of the screen real estate it uses) smart platforms around. And aside from the missing terrestrial broadcaster catch up apps, it supports all the key streaming platforms you’d hope it would. Including Disney Plus and Apple TV Plus.",
    "Note, though, that since LG doesn’t support the HDR10+ HDR format, services that carry that system, such as Amazon Prime, will default to the lower quality baseline HDR10 format when they play into the 65NANO906. LG’s set does, though, support both the premium Dolby Vision HDR system, and the HLG system favored by the BBC.",
    "There’s mixed news to report in this section. Starting with the good news, the 65NANO906 handles standard dynamic range color and contrast superbly.",
    "At this point we should talk in more detail about the 65NANO906’s key picture features: First, its direct LED lighting system is backed up by local dimming. This only supports 32 separately controlled zones; hardly a bounty. Combined with a new power management system that diverts power from dark parts of the picture that don’t need it to bright areas that do, though, those 32 zones prove unexpectedly effective. Even though they’re having to contend with an IPS screen.",
    "In other words, SDR video containing a mixture of dark and bright picture elements enjoys deeper black levels than I’ve seen from any IPS TV before. And bright highlights appear with much less obvious backlight ‘blooming’ around them than I’d have thought possible from an IPS screen with just 32 dimming zones.",
    "What’s more, bright highlights typically appear against dark backdrops with plenty of brightness; the 65NANO906 doesn’t have to dim bright areas drastically to keep backlight blooming in check.",
    "Another key 65NANO906 feature is its Nanocell color technology. This essentially uses an array of tiny dots to filter out unwanted color wavelengths - and the resulting color purity and finesse reminds you of just how much refinement and richness SDR can fit into its limited (relative to HDR) light and color space. Especially now that the 65NANO906’s Nanocell colors are further unlocked by the set’s improved black levels.",
    "The 65NANO906 carries LG’s Alpha 7 Generation 3 processor. This isn’t as powerful - especially, actually, when it comes to color - as the Alpha 9 processor found in most of LG’s prior OLED TVs. Yet the Nanocell system is good enough in itself to deliver SDR color very effectively.",
    "The Alpha 7 Gen 3 processor is less successful at upscaling HD sources. For while the AI-powered Alpha 9 processor upscales superbly, the Alpha 7 system leaves sub 4K sources on the 65NANO906 looking a little soft and noisy compared with the best upscalers. Especially if the HD source is a heavily compressed digital broadcast.",
    "The arrival of HDR has been particularly challenging for IPS screens, putting even more strain on IPS’s inherent contrast controls. The 65NANO906’s new backlight power management system, though, truly transforms LG’s LCD HDR fortunes.",
    "Here we have HDR pictures that look bright (brighter, actually, than the measured peak light output of around 520 nits), but also manage to typically hit decently deep black levels. Even more unexpectedly, the 65NANO906 can show bright-on-dark HDR highlights, such as the moon in a night sky, without having to dim the bright highlight down excessively or creating a big, bold distracting cloud of greyness around it.",
    "In this latter respect, in particular, the 65NANO906 is a revelation compared with previous IPS screens.",
    "The extra brightness, contrast and colour range associated with HDR sources also gets even more value out of LG’s Nanocell technology, helping it generate lots of colour vibrancy without losing any of the impressive subtlety that stood out so much while watching SDR.",
    "There are rival LCD TVs out there that can go much brighter than the 65NANO906. But you’d be hard pushed to argue that its HDR pictures lack impact and dynamism. This is another welcome side effect, perhaps, of LG’s new power management system, as the local dimming array gets the maximum value it can from the power available to it.",
    "Native 4K pictures look crisp and detailed - and LG’s latest Cinema Clear motion option ensures that detail levels stay high even when there’s a lot of motion in a 24p movie. Even if you turn the motion processing off, the TV’s motion clarity with 24p movie sources looks more natural than it has been in its ‘native’ state on previous LG LCD generations.",
    "While the 65NANO906 has transformed the fortunes of LG’s LCD TVs with HDR, it doesn’t completely overcome all the old flaws. There is, for instance, still some visible backlight blooming around stand-out bright objects. This is way fainter than ever before with a locally dimmed IPS LCD TV, but it’s there, and it can be slightly distracting at times.",
    "The way the 65NANO906 keeps adjusting its backlight to try and optimise black levels can lead to some instability during dark scenes, too. And the screen has a bad habit of turning off its backlight entirely during fade to blacks - a process which certainly boosts black levels, but also causes distracting flickers as the backlight flicks off and then on again.",
    "Overall there are still enough backlight issues with the 65NANO906 to give you cause for thought if you often find yourself watching TV in a dark room, where backlight flaws are more noticeable.",
    "I can wrap this section up with a couple of positives, though. First, the bright, colourful HDR pictures lose precious little of their contrast and intensity when viewed from even a wide angle - as per the IPS promise. Second, in Game mode the 65NANO906 suffers with only around 18ms of input lag.",
    "Provided you use LG’s AI Sound setting, the 65NANO906 sounds pretty good. The idea behind AI Sound is that it combines LG’s own virtual surround sound processor with the sort of close understanding of the capabilities of a TV’s speakers that you only get from the people who actually built them. The result is a soundstage of substantial scale and dynamics that has much more room-filling, forward-throwing impact than you hear with most TVs.",
    "Voices are well rounded and remain locked to the screen, and the speakers can go loud without becoming harsh or distorting.",
    "Note that the AI Sound option has more dynamism and range, surprisingly, when listening to Dolby Atmos soundtracks than the default Dolby Atmos mode.",
    "Still available at the time of writing is the LG B9 OLED - the brand’s entry level 65-inch OLED TV from 2019. Because it’s a year old, it’s now only slightly more expensive than the 65NANO906, despite bringing the gorgeous black levels and immaculate local contrast that only OLED can (currently) provide. Be aware, though, that the B9’s screen is very reflective of ambient light. Also, if you watch a lot of stuff containing static logos you may need to take care with your viewing habits to avoid the potential for permanent OLED image retention.",
    "A more expensive option would be the Samsung Q95T. This goes way brighter - up to nearly 1500 nits - yet thanks to its excellent local dimming system it also manages OLED-grade black levels. It dims bright objects quite heavily in some settings to retain those black levels, though.",
    "The 65NANO906 is by far LG’s best ever LCD TV. It finally finds a way to massively improve - if not quite fully solve - LG’s long-running LCD contrast and backlight problems. It does this, too, without sacrificing the viewing angle benefits of IPS LCD screens, while also bringing out the strengths of LG’s Nanocell color technology in a way we’ve never been able to appreciate before."
  ],
  "headers": {
    "0": "30-second review",
    "3": "Price and availability",
    "5": "Design",
    "9": "Smart TV (webOS)",
    "14": "HD/SDR Performance",
    "21": "4K/HDR Performance",
    "31": "Sound",
    "34": "Other panels to ponder...",
    "36": "Final verdict"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "LG B9 OLED": "https://www.techradar.com/reviews/lg-b9-oled-tv-oled55b9-oled65b9",
    "Samsung Q95T": "https://www.techradar.com/reviews/samsung-q95t-4k-qled-tv"
  }
}