{
  "source": "https://www.techradar.com/reviews/renpho-r3-mini-massage-gun",
  "title": "Renpho R3 Mini Massage Gun review",
  "category": "fitness",
  "updated": "2021-11-03T12:45:18Z",
  "author": "rob-clymo",
  "summary": "Get muscle relief on the move with the Renpho R3 Mini Massage Gun",
  "verdict": "The Renpho R3 Mini Massage Gun has quite a lot going for it if you're after a portable. It arrives in a neat little travel bag complete with all the accessories you’ll need and offers the flexibility of USB charging. It makes frugal use of power, allowing it to handle massage sessions of up to six hours, while the five different operating speeds are well suited to the handful of massage heads inside the box. While it’s not beefy enough for professional use, there’s more than enough power for home users.",
  "pros": [
    "Great performance",
    "Well put together",
    "Easy to charge"
  ],
  "cons": [
    "Basic collection of heads",
    "Not a pro-level solution",
    "Integrated battery"
  ],
  "article": [
    "There are countless massage guns on the market, and the Renpho R3 Mini could be easily overlooked until you take a closer look at what’s on offer. It’s compact and lightweight, tipping the scale at less than a kilo, so you can easily pack it into your bag for the office or the gym. Charging is easy too, thanks to a USB charging cable for when a mains outlet might not be a viable option.",
    "Add on up to six hours runtime, a great collection of five assorted massage heads and the same number of speeds, and you’ve got a super little unit. It’s pretty quiet during operation too, and the price tag makes it one of the most affordable massage guns around.",
    "The Renpho R3 Mini Massage Gun was released in 2021, and although it has a RRP of $139.99 / £119.99 (about AU$190), it can often be found more cheaply at retailers like Amazon.",
    "That's somewhat cheaper than the Power Plate Mini+, another excellent portable massage gun, which costs $179.99 / £179.95 (about AU$250) and also comes highly recommended thanks to its compact design and surprisingly powerful action.",
    "The Renpho R3 Mini Massage Gun has all the accessories you need to target sore muscles, but is also compact enough to take just about anywhere. It comes in a zip-up carry case, which looks quite stylish and contains everything you need to get started, including the massage gun along with an assortment of five massage heads. There’s also a USB cable for charging, plus a user manual that takes you through the setup process.",
    "Renpho has done a nice job with the massage gun's design. It feels nicely balanced, weighs just 675g, and features a smooth, durable plastic finish. There’s a chunky handgrip with a USB charging port at the base, and around at the back is a circular button that allows you to switch it on and pick a setting. This can be done by pressing the power button repeatedly to move through the five different modes. Holding the button for a few seconds will power down the device.",
    "A small bank of blue LEDs indicate the level of massage being delivered, and another row of LEDs on the handle indicate available battery power.",
    "The business end of the Renpho R3 Mini Massage Gun features the usual circular slot, into which you guide your chosen massage head. This is a push-and-play type of design, and heads lock into place as you push them in. You employ the same technique to remove heads when you’re done. In that respect the Renpho R3 Mini Massage Gun is very simple and straightforward to set up and use, and the assortment of five well-made heads offer everything you need to carry out most types of massage and muscle relief.",
    "Usefully, the manual bag contains two spare seals that can be called upon if any of those on the heads fail over time. The design is also practical if you want to carry the massage gun with you for use after training sessions, or at the office.",
    "The USB-C charging cable makes charging quick and easy, and once fully powered up, the Renpho R3 Mini Massage Gun can still deliver around six hours of continuous massage. That should be more than enough for most needs, outside a professional setting.",
    "Although the Renpho R3 Mini Massage Gun is small enough for easy carrying, it’s no slouch in the performance department. In fact, it can deliver between 1,800 and 3,200 pulses per minute and boasts amplitude of 9mm. That means it’s more than capable of providing a good level of massage across the range.",
    "The medium torque brushless motor is very capable too, with a smooth power delivery. It’s very potent at the higher settings, and has a 10-minute auto shut-off limit, which is par for the course for this type of device.",
    "We were impressed with the overall performance of the Renpho R3 Mini Massage Gun. It’s a fairly quiet machine, which makes it appealing if you’re looking to enjoy a session of percussive massage while you’re relaxing on the sofa watching TV. Similarly, the range of massage heads is more than enough for most needs, with the diverse collection proving useful for both self-massage and also for carrying out restorative sessions on others. There are no heated heads, but given the affordability of this package that’s no surprise either.",
    "Although those heads push in, rather than twisting and locking like some models on the market, we got on fine with the Renpho R3 Mini Massage Gun. The runtime lives up to the manufacturer’s claims too, and being able to recharge via USB is handy, especially when you're on the move",
    "Longer-term use is also more than doable thanks to the slick design of the unit. The handle in particular makes holding this gun a breeze for prolonged massage sessions.",
    "First reviewed November 2021"
  ],
  "headers": {
    "0": "30-second review",
    "2": "Price and availability",
    "4": "Design",
    "10": "Performance",
    "16": "Don't buy it if"
  },
  "links": {
    "Power Plate Mini+": "https://www.techradar.com/reviews/power-plate-mini"
  }
}