{
  "source": "https://www.techradar.com/reviews/hetzner-online",
  "title": "Hetzner Online review",
  "category": "computing",
  "updated": "2021-11-09T06:10:51Z",
  "author": "mike-williams",
  "summary": "A German web hosting veteran offering some pocket-friendly solutions",
  "verdict": "If you’re in search of robust, reliable, and reasonably priced hosting solutions in Germany or Finland, Hetzner Online might be the host for you. If not, keep on searching.",
  "pros": [
    "Good range of features",
    "Free SSL certificates with all plans",
    "Eco-friendly approach",
    "Reasonably priced plans",
    "Wide scope of hosting options and services"
  ],
  "cons": [
    "No website builder",
    "Data centers in Finland and Germany only"
  ],
  "article": [
    "Founded in 1997, Hetzner Online (or Hetzner for short) is a German web hosting provider and data center operator aimed at individual users and businesses alike. The company bears the name of its founder, Martin Hetzner, whose vision was to make a perfect mix of strong and stable technology, flexible services, pocket-friendly pricing, and competent customer support. For the most part, this vision appears to be realized.",
    "Hetzner offers everything from simple shared hosting solutions to managed servers, cloud hosting, VPS, dedicated server hosting, domain registration, colocation services, as well as on-demand custom solutions. They also offer a server auction site where you have a chance to rent dedicated servers with a bit older hardware, which is a sensible solution both from an economic and ecological point of view. The price tags of Hetzner’s products are also quite appealing, however, we have yet to see how competent their customer support is.",
    "The company is headquartered in Gunzenhausen (Germany), and its data centers can be found in Nuremberg (Germany), Falkenstein (Germany), and Helsinki (Finland). You can find all technical specifications about the data centers on their site, and even take a virtual tour (in 360°) through their Nuremberg center. Striving to set an example of eco-friendliness, Hetzner uses energy from renewable sources only, including hydropower in Germany, a combination of wind and hydropower in Finland, and investing in energy-efficient hardware.",
    "Hetzner’s official site looks a bit old-fashioned (but in a good way), user-friendly, and is available in English, German, and Russian language.",
    "If you want to find Hetzner on social media sites, check out Facebook, Twitter, LinkedIn, Instagram, and YouTube.",
    "On Hetzner’s official site you’ll find a decent variety of dedicated servers, VPS packages, shared hosting, custom solutions, as well as colocation, management, and other services. The smallest shared hosting solution called “Level 1” starts at €1.60 ($1.85) per month, but you’ll have an additional once-off setup fee of €8.32 ($9.65) which spikes up the price pretty quickly. With more expensive plans this setup fee drops, and with the biggest plan going for €16.72 ($19.35) per month there are no setup fees at all.",
    "The “Level 1” plan includes one free domain name (.de, .com, .net, .org, .at, .be, .info, .biz, .eu, .name and .nl are available), 10GB of disk space (NVMe SSD), unlimited traffic, 50 sub-domains, daily backups (for 14 days), an SSL certificate, and daily compilations of detailed log files. “Level 1” plan is the only one that doesn’t allow any add-on domain, while you can have between 5 and 20 of them with other plans.",
    "If you cancel Hetzner’s plan within 14 days, you should receive a refund, although the company gives close to no information about its money-back guarantee.",
    "As for payment methods, Hetzner accepts all major credit cards, PayPal, SEPA, and bank/wire transfers.",
    "Since Hetzner’s hosting solutions are properly presented with all of their features and fees, opting for one of them shouldn’t be too time-consuming. If you’re new to Hetzner, you’ll be asked to create an account before you can purchase any of their products. To do so, you’ll have to fill in a rather lengthy form containing your full name, title, organization, postal address, telephone/fax, email address, and come up with a password.",
    "After this, you’ll receive a client number to use when logging in, both on the next page and in an email in case you forget it (and of course you will). Upon logging in, you'll be taken to Hetzner’s control panel called konsoleH where you can continue with your purchase or add other products (domain name, hosting packages, additional storage space, management services, SSL certificates, and so on). Before making a purchase you’ll also need to select a billing cycle (monthly, quarterly, semi-annually, annually), and a payment method.",
    "Although far from being a looker, once you understand how konsoleH works, you’ll be navigating your way around it without any trouble. It may not be as user-friendly as industry-leading cPanel but it’s as simple as custom-made control panels can get. If you get stuck along the way, be sure to check out how-tos that are available on konsoleH or get in touch with the support staff.",
    "KonsoleH also offers a WebFTP feature with which you can upload your website (given you have one), or you can do it by using the usual FTP system. Hetzner provides easy installation for WordPress, BigBlueButton, Docker, GitLab, LAMP, and a handful of other handy apps. However, there is still no no-code website builder which would be very much appreciated by all less experienced users out there.",
    "Although Hetzner doesn’t talk much about speed, in its “Data Centers” section it promises “speedy load times and top performance”, which we’re about to check in a minute. After performing a GTmetrix speed test on Hetzner’s site, we were presented with a top-notch performance. The site fully loaded in 1.7 seconds (the average result is 8.1) requiring a total of 55 requests and resulting in an A (90%) as a final GTmetrix grade.",
    "As for uptime, Hetzner guarantees a minimum of 99.9% of it with all of its plans, which puts its data centers on a Tier III level at least. To test this out, we performed a two-week-long test on Hetzner’s official site and got somewhat underwhelming results. There was one instance of downtime making the site unreachable for 14 minutes straight which ultimately led to 99.93% uptime. Although these results fit into the guarantee, they don’t instill much confidence when we recall that the test was carried out for two weeks only.",
    "Hetzner’s “Support Center'' offers personal support via telephone, live chat (for customers only), and ticket/contact form. You are also invited to write them an email for general inquiries. Eleven telephone numbers are available for different types of support, from general questions to technical advice and expertise, and some of them are available on weekdays during working hours, while others are working 24/7.",
    "Those who prefer to fend for themselves will find everything they need in “Hetzner Docs”, a collection of guides and documentation among which you’ll also find a commendably comprehensive FAQ section. Most of the how-tos are well done, but some of them seem a bit too short.",
    "“Hetzner Online Community” features both a forum and a tutorial area, where users are encouraged to create their own how-tos for their fellow users (and for a reward, of course, which can go up to €50 in credit). The community forum is available for Hetzner’s customers only, and it appears to be a pretty active one.",
    "Both OVHcloud and Hetzner are European hosts with a long track record of providing robust, reliable, and well-rounded web hosting solutions for all sorts of paying customers. Although Hetzner comes a bit cheaper and richer in freebies than its competitor, OVHcloud scores in terms of performance and wins when it comes to data center availability.",
    "Digital Ocean is an amazing alternative to Hetzner and one with which you’ll find a worldwide data center network. That being said, DigitalOcean doesn’t have any refund policy and is more expensive than Hetzner, which makes it harder to recommend it to users that are fine with Europe-based servers.",
    "Bluehost is more beginner-friendly than Hetzner, but Hetzner is friendlier towards one's budget, particularly in the long run (when the one-time setup fee evens out). On the other hand, Bluehost won't hesitate to drop a bombshell with a significant price spike when the promotional period ends.",
    "Much like Bluehost, HostGator is one of the most beginner-friendly hosts out there, and the one that will equip you with superb support and all the free features sure to get you off to a flying start. However, if you’re looking for customizable cloud hosting packages that provide great value for money, Hetzner is more likely to fit the bill.",
    "Hetzner is a reputable and reliable web hosting provider with a variety of hosting products, and a soft spot for environmental issues. If you’re looking for a feature-rich solution for an online business with a customer base in Germany or Finland, Hetzner might be worth a look.",
    "If this is not the case, check out HostGator and Bluehost, because they can give you almost everything Hetzner can while extending a helping hand to less tech-savvy users."
  ],
  "headers": {
    "5": "Pricing",
    "9": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "18": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Hetzner Online": "https://www.hetzner.com/?country=gb",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "domain registration": "https://www.techradar.com/news/best-domain-registrars",
    "colocation services": "https://www.techradar.com/news/best-colocation-hosting",
    "Level 1": "https://www.hetzner.com/webhosting",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "OVHcloud": "https://www.techradar.com/reviews/ovh",
    "Digital Ocean": "https://www.techradar.com/reviews/digitalocean",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator"
  }
}