{
  "source": "https://www.techradar.com/reviews/skyvpn",
  "title": "SkyVPN review",
  "category": "computing",
  "updated": "2021-01-22T16:28:44Z",
  "author": "sead-fadilpasic",
  "summary": "Budget-friendly and super-fast",
  "verdict": "SkyVPN has plenty to like: a free plan, low prices, great speeds, access to geo-restricted services and support for torrenting (albeit not on all servers). However, we slightly resent the absence of manual installation options for non-mainstream devices, as well as the lack of proper customer support.",
  "pros": [
    "Very budget-friendly",
    "Excellent download speeds",
    "Unblocks Netflix, BBC iPlayer",
    "Free version(s) and free trial",
    "Thousands of servers"
  ],
  "cons": [
    "Limited platform support",
    "Not many features",
    "Modest support section",
    "Non-responsive customer support",
    "Some logging"
  ],
  "article": [
    "SkyVPN is a VPN provider with over 20 million active users worldwide, to whom it offers bank-grade encryption, access to all sorts of content and outstanding performance at low prices.",
    "The 36-month subscription will cost you only $1.99 per month (billed $71.64 every three years), making this provider one of the cheapest in the VPN business.",
    "Users that don’t want to pay for the VPN service may sign up for SkyVPN’s Free Basic Service, which will get them access to 1 server and support for 1 device, but with a 500MB monthly traffic limit and ad-filled apps.",
    "There’s also Free Premium Service that provides access to most paid servers, supports 1 device, but allows you to acquire free data through in-app tasks like daily check-ins, watching ads, playing games and inviting friends.",
    "The paid Premium Service supports up to 5 devices at the same time and provides access to all servers, with no limitations on monthly data traffic.",
    "This service is subject to a 30-day money-back guarantee in case you end up disappointed after the purchase. SkyVPN also offers a 7-day free trial purchase option.",
    "Accepted payment methods include credit/debit cards, PayPal, Alipay, UnionPay, TOP, Bitcoin and more.",
    "While SkyVPN has its advantages, you may also want to consider other options. For instance, whereas SkyVPN only has apps for four major operating systems, NordVPN supports a wider array of options, including routers. CyberGhost is also a worthy competitor, with support for almost any device in existence and a generous 45-day money-back guarantee.",
    "But the true ruler of the VPN market is ExpressVPN, which provides outstanding performance, gorgeous and feature-rich native apps, as well as speedy and professional customer service.",
    "Streaming video content from the likes of Netflix, Hulu, and BBC iPlayer is a beloved pastime for many people, but they sometimes face obstacles in terms of this content not being available in their region. Thanks to VPNs like SkyVPN, these netizens can enjoy their favorite geo-restricted streaming content.",
    "The provider’s website and software are managed by SkyVPN, Inc. from its headquarters in Hong Kong. The company offers access to over 3,000 servers in 10 countries, including India, Singapore, United States, Australia, and Hong Kong.",
    "This VPN vendor allows P2P and torrenting, but such activities are forbidden on the US, UK, CA, and FR servers and may get you banned from the service.",
    "Even though it could have more features and extras, SkyVPN still does a solid job with its kill switch and split tunneling. A kill switch will block your internet access if the VPN connection is compromised, keeping your data safe in the process. Split tunneling allows you to choose which of your apps can (or need to, like banking apps) bypass the VPN protection and run on your normal connection.",
    "SkyVPN’s Privacy Policy details all the information that may be collected while you’re using its services, some of which is collected for real-time analysis but noted logged permanently.",
    "The list is a little extensive for our liking, so if you’re not comfortable with a provider that collects this amount of information, you may want to choose a different one.",
    "SkyVPN has native apps for Windows, Mac, Android, and iOS, but that’s as far as it goes. There’s no mention of manual installation on other operating systems and devices like routers.",
    "At the time of writing, the provider’s Android app has a rating of 4.3 stars (out of 5), as rated by 177,429 users (out of more than 10 million who downloaded it).",
    "Its iOS app has 4.7 stars and has been rated by 28.6K users. The latest update included upgrades to connection stability and speed, and added servers.",
    "Finally, the SkyVPN’s Mac app had a slightly poorer score: 3.2 stars, as rated by 42 people.",
    "Should you require assistance, you can try your luck with the Support section that includes FAQs and setup manuals, but it isn’t exactly plentiful. If you need more concrete information directly from the source, you have at your disposal the online chat or email option. We tried the latter and still haven’t received a response at the time of writing.",
    "SkyVPN’s apps are very intuitive and easy to use, and server switching only requires one click on the chosen server. Curious about the platform’s download speeds, we conducted tests on a 45.81Mbps testing connection.",
    "The results were outstanding: the server in Germany gave us a blazing 29.01Mbps, while a server in the US did somewhat worse but still delivered a very fast 14.92Mbps (considering the testing connection). Finally, Hong Kong gave us an expectedly worse 4.46Mbps, but still a solid result for a server so far away from us.",
    "The best part of SkyVPN is its blazing speeds, closely followed by its very affordable pricing and the existence of a free plan. It even has a relatively deep server network.",
    "The only aspects we didn’t like are the very modest customer support options and the lack of support for manual installation on devices that aren’t Windows, Mac, iOS, or Android."
  ],
  "headers": {
    "1": "Price",
    "7": "Alternatives",
    "9": "Streaming",
    "10": "About the company",
    "11": "Privacy and encryption",
    "15": "Support",
    "20": "Speed and experience",
    "22": "Verdict"
  },
  "links": {
    "SkyVPN": "https://www.skyvpn.net/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Privacy Policy": "https://www.skyvpn.net/privacy-policy",
    "Android app": "https://play.google.com/store/apps/details?id=me.skyvpn.app",
    "iOS app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5227555379666895000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fid1225558991",
    "Mac app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1167579270885711600&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fskyvpn-fast-vpn-proxy-shield%2Fid1322822884",
    "Support section": "https://www.skyvpn.net/support",
    "FAQs and setup manuals": "https://www.skyvpn.net/faq",
    "email": "mailto:support@skyvpn.net"
  }
}