{
  "source": "https://www.techradar.com/reviews/rig-nacon-pro-compact",
  "title": "Rig Nacon Pro Compact review",
  "category": "gaming",
  "updated": "2021-06-29T10:31:29Z",
  "author": "adam-vjestica",
  "summary": "The Rig Nacon Pro Compact is an affordable Xbox controller with Dolby Atmos included",
  "verdict": "The Rig Nacon Pro Compact isn’t going to beat the official Xbox Wireless Controller that comes with every Xbox Series X and Xbox Series S console, but it's a fine alternative if you’re looking for a cheaper, wired option. It also comes with the added bonus of granting users access to Dolby Atmos, which is a plus if you want to sample the spatial audio tech. However, we wouldn’t recommend it to players with large hands, or for those who want a reliable D-Pad for fighting games.",
  "pros": [
    "Oversized face buttons",
    "Dolby Atmos license included",
    "Customizable profiles"
  ],
  "cons": [
    "Small D-Pad",
    "Grips feel too short",
    "Slippy, sensitive analog sticks"
  ],
  "article": [
    "The Rig Nacon Pro Compact is a solid product for the price. It doesn’t match the ergonomics of the official Xbox Wireless Controller, but if you’re after a second pad with good build quality, the Rig Nacon Pro Compact is well worth considering. You also get a Dolby Atmos license as part of the deal, which might be a tempting proposition for those interested in spatial audio, and the customization options are pleasing and not something you tend to get at this price point.",
    "However, the controller’s smaller form factor means players with larger hands may find Rig Nacon Pro Compact slightly awkward to hold due to its less pronounced grips, and we weren’t a fan of the controller’s D-pad, either, due to its small size and placement near the controller’s share button, or the slippery analog sticks.",
    "Still, for a price of $49.99 / £44.99, and with many retailers selling the controller well under the RRP, the Rig Nacon Pro Compact is great value and well worth a look.",
    "The Rig Nacon Pro Compact is a wired controller that costs $49.99 / £44.99, and comes with a generous three meter long cable. All the buttons from the new Xbox Wireless controller are accounted for, including the share button, oversized face buttons (which this reviewer particularly enjoyed), and you’ll find a 3.5mm headphone jack at the bottom of the pad. On the back is a toggle to switch between two customizable profiles, which we’ll get to below, and the overall build of the controller was very impressive – it withstood our best attempts to flex and twist the plastic housing without issue.",
    "With a shape more akin to a PS4 DualShock controller, the Rig Nacon Pro Compact feels slight in the hand – and it definitely takes a bit of getting used to at first, especially if you have larger hands. The controller’s grips are rather short, which means the Rig Nacon Pro Compact rests higher in your palms than the Xbox Wireless Controller or PS5 DualSense controller do. Thankfully, though, it’s fairly comfortable due to its light weight and textured matte plastic build.",
    "The analog sticks are placed asymmetrically, which is this reviewer’s preference, and are accented by a tasteful gold trim. The sticks are also concave, with unique textures on the left and right stick, but we found they felt rather slippy under the thumb.",
    "Overall, it’s a nice enough looking controller, with surprisingly good build quality for the price and two colour options available: white or black.",
    "The Rig Nacon Pro Compact lets you customize the pad to your liking using the Pro Compact app, which we found to be very intuitive and easy to use. You can adjust a variety of features such as remapping buttons, adjusting stick and trigger sensitivity, and you can even change the rumble intensity.",
    "We particularly liked how the app gives you set profiles, such as 'FPS' for first person shooters or 'Racing' for driving games, with clear pictures of the response curve you’ll be selecting.",
    "One of the other perks of choosing the Rig Nacon Pro Compact over other controllers on the market is that you get Dolby Atmos for free, which typically costs $15 / £15 for a license. You simply need to download the Dolby Access app from the Microsoft Store on your PC or on Xbox Series X, connect your controller and the application should automatically recognize the pad and activate the free license.",
    "After testing the Rig Nacon Pro Compact in a number of our favorite titles, we found that the controller was responsive, easy to use, but lacking in a few areas. While we love the customization options available, we found that the analog sticks were a touch too loose for our liking, and we didn’t enjoy using the D-Pad when playing fighting games or platformers. Compare this to the official Xbox Wireless Controller’s D-Pad, where the contoured design lends itself well to inputting special moves or performing precise jumps, as a couple of examples.",
    "We loved the chunky face buttons, though, which remind us of the Nintendo Switch Pro Controller, and the triggers, while different to the official Xbox Wireless Controller, are more than serviceable. There’s nothing too egregious to complain about, then, and we’d happily game using the Rig Nacon Pro Compact as our main controller. But a few gripes such as the small frame, slippy analog sticks and average D-Pad stop it from trumping the pack-in Xbox pad."
  ],
  "headers": {
    "0": "Two-minute Rig Nacon Pro Compact review",
    "3": "Design and price",
    "7": "Features",
    "10": "Performance",
    "12": "Don't buy it if..."
  },
  "links": {
    "Xbox Wireless Controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Dolby Atmos": "https://www.techradar.com/news/hear-the-difference-the-best-dolby-atmos-xbox-series-x-games",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "PS4 DualShock controller": "https://www.techradar.com/news/gaming/consoles/dualshock-4-deals-find-a-cheap-ps4-controller-today-1298590/reviews/gaming/games-consoles/controllers/dualshock-4-controller-1157615/review",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch Pro Controller": "https://www.techradar.com/reviews/nintendo-switch-pro-controller"
  }
}