{
  "source": "https://www.techradar.com/reviews/user1st",
  "title": "User1st review",
  "category": "computing",
  "updated": "2021-06-22T06:00:37Z",
  "author": "jonas-p-demuro",
  "summary": "Open the door to accessible digital content",
  "verdict": "User1st offers both an automated, along with an expert driven approach to making any website more accessible to both users with disabilities, and to seniors. Advice is provided both to bring a site out of compliance up to standard, along with avoiding the issue in the future.",
  "pros": [
    "Customer service options",
    "SaaS approach",
    "Free demo",
    "DevOps integration"
  ],
  "cons": [
    "Below average user reviews for cost",
    "Opaque pricing"
  ],
  "article": [
    "User1st is based in Washington, DC, with a diversely trained team that includes everything from computer programmers and developers to social advocates, with some academics and accessibility experts sandwiched in between. This company endeavors to make digital assets compliant with the ADA via “Opening the digital door” to individuals with either permanent disabilities, or with temporary barriers to accessing content.",
    "This increase in accessibility gets accomplished via ADA compliant software solutions that are sustainable, and cloud based. Notable customers of User1st include the likes of Ikea, the National School Boards Association, and Toys for Tots.",
    "User1st provides several different services to assess digital content for accessibility for individuals with challenges with the goal of increasing access. This can answer the need, both in situations to increase the customer base, or for compliance with web accessibility laws. A number of the User1st offerings are a SaaS, to analyze a website for accessibility remotely.",
    "Under the User1st umbrella is Check1st, a “comprehensive automated web accessibility testing tool” that makes the bold claim to find more accessibility errors than its competitors. It allows for customizable filters, with labels that foster better project management, and communication. It also has reporting functions to keep the team up to date on the latest web accessibility issues with full integration into DevOps pipelines.",
    "When trying to remediate a website, or in response to a lack of compliance notification, such as a letter from a governmental agency, the uRemediate tool is offered. This powerful tool can increase the accessibility of a website by providing a snippet (single line of code) that can be integrated into the site. The code provided will then create an accessibility button- branded as needed, and with a choice of locations on the page. When a user visits a site and needs an accommodation, they can hit the button, and the website can then be used up to WCAG 2.1 AA standards, fully compliant with the ADA. Customers can then provide feedback about the accessibility, and a back end portal generates statistics for tracking usage. It can also be configured to several different languages.",
    "The uRemediate code does a comprehensive program survey, with benchmarking to industry standards with a full analysis of any gaps. There is also comparative maturity scoring provided along with best practice guidance.",
    "uRemediate is more than just an automated SaaS as User1st has its accessibility experts test with assistive tech including JAWS (Job Access With Speech, a screen reader popular with low vision users). A complete audit is performed by these accessibility experts, with certification of accessibility fixes to the website code, suitable to show governmental agencies in case of any noncompliance issues. In fact, uRemediate indicates that it is certified to provide all the necessary fixes for web accessibility, which will provide a defense against an audit. It also provides “Legal, regulatory, and industry updates” to maintain compliance with the shifting sand of changing regulations.",
    "Looking at a smattering of user reviews on various sites reveals that User1st generally gets higher marks on the areas of customer service, and ease of use. When it comes to training and features, the ranks get more average, and on scores for value and cost, they fall below average.",
    "As is fairly typical for the segment of accessibility software and services, User1st does not provide any pricing information. We find this limiting as it requires contact with the company to obtain the quote, and some folks prefer to do initial pricing online prior to contact. Looking online, we also did not find any pricing info.",
    "There is an offer of a free demo.",
    "User1st does offer a variety of methods to establish contact with them. For initial contact, such as to work on pricing, there is a portal to enter your info, such as a name and email address for User1st to get back in touch with you.",
    "For ongoing contact needs, such as queries related to the product, there is a direct email address, and a direct number, and we will also point out that it is toll free. There is also a direct snail mail address, although it is a PO Box.",
    "While there are a handful of resource documents to download, for example, “Web Content Accessibility Guidelines,” they can’t be directly downloaded, and rather require providing an email address and name to get the info. We also did not find any educational video content, eBooks, or forums to support the offerings.",
    "While User1st can be contacted via social media, on Facebook, they have about the high 600’s of followers and likes, and the last update was from late last year in 2020.",
    "User1st provides two pathways to allow corporations to increase web site accessibility to the disabled, and to seniors with its fully automated Check1st, and expert driven uRemediate offerings. The pros include the expertise for dealing with complex governmental regulations including the ADA, the ease of deployment, and that it can be customized to the website, and to the language. The cons include that the cost of either of these offerings is quite opaque, and some aspects of the user reviews, such as cost and value give User1st below average scores. Balancing this out, User1st is worth a look, and the offer of a free demo makes this simple to do."
  ],
  "headers": {
    "2": "Services",
    "7": "User Reviews",
    "8": "Pricing",
    "10": "Support",
    "14": "Final verdict"
  },
  "links": {
    "User1st": "https://www.user1st.com/"
  }
}