{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-10t-pro-review",
  "title": "Xiaomi Mi 10T Pro review",
  "category": "phones",
  "updated": "2021-09-15T16:01:55Z",
  "author": "tom-bedford",
  "summary": "Xiaomi returns to what it does best",
  "verdict": "The Xiaomi Mi 10T Pro is a great phone for its price, with a main camera that takes good pictures, a powerful processor and a fairly long-lasting battery. It’s not perfect - we had issues with its size, screen quality and the way the back picked up fingerprints too much, but some might not mind these shortcomings at all. In general it’s a pretty good handset, but it’s not for everyone.",
  "pros": [
    "Good main camera",
    "Snappy fingerprint scanner",
    "Top processing power"
  ],
  "cons": [
    "Few differences to non-Pro model",
    "Too big for all users",
    "Back is a fingerprint magnet"
  ],
  "article": [
    "The Xiaomi Mi 10T Pro is the top model of the Mi 10T range, three new phones from the Chinese company, released in late 2020 to complement the Mi 10 line from the beginning of the year. Joined by the Xiaomi Mi 10T and Mi 10T Lite, the Mi 10T Pro sits just below the Xiaomi Mi 10, and just above the ‘standard’ Mi 10T, in the company’s line-up of handsets.",
    "This phone is typical ‘Xiaomi’, in that it has a mid-range price but some advanced specs, namely a high-res main camera and a flagship processor, with corners cut in other areas to achieve the price. Xiaomi has put out many such phones via its different brands in 2020: there was the Poco F2 Pro, Black Shark 3, and a few others.",
    "This isn't the most recent phone from the company by a long shot - the Xiaomi 11T Pro, launched in September 2021, is both a follow-up to the Mi 10T Pro and a mid-range take on the Mi 11, just as how the 10T Pro takes the Mi 10's specs and makes them more accessible.",
    "There's still reason to consider the Xiaomi Mi 10T Pro though - the 11T Pro has a worse battery life, a lower refresh rate display and a processor that's prone to overheat. Still, it has a fantastic telemacro camera for close-up shots, much faster charging and a few more camera modes.",
    "The Xiaomi Mi 10T Pro has a few strong suits and a few weaker parts too; that’s how these Xiaomi mid-rangers are, and our buying advice is to consider what the handset does right and wrong, and question what you mainly use your phone for, to see if your priorities line up.",
    "Firstly, as with many Xiaomi phones, the Mi 10T Pro has a pretty impressive main camera, with the same 108MP snapper we’ve seen in a few of the company’s other phones. This is certainly a ‘brute force’ tactic to getting on our best phones list, with sheer resolution prioritized above nuanced AI software or huge-pixel-size sensors, but it gets the job done. The auxiliary cameras don’t add much though.",
    "The Snapdragon 865 processor used here provides snappy speeds, useful for editing those super-high-res photos you just took or playing games. It would work well with the high-refresh-rate screen, as 144Hz is usually great for gaming, though few mobile games are actually optimized for that just yet.",
    "We’ve got a few other good things to say about the phone. We found its fingerprint sensor easy to use, the battery life was great, and there seemed to be fewer pre-installed third-party apps, which tend to fall under ‘bloatware’, than we see on most Xiaomi phones.",
    "It’s not all fun and games though - we took particular issue with a few points in the phone’s design. It’s big, and we imagine some users will find it too much so. Plus, the back is a fingerprint magnet that has a better memory of accidental touches than a pedantic referee, and the camera bump is absolutely massive. So some might be put off by the phone’s appearance, and we wouldn’t blame you.",
    "This phone also represents a bit of a downgrade from the Mi 10 series, particularly in the screen department - gone is the curved-edge AMOLED display of those handsets, and instead there’s an LCD panel which is boringly flat. Prospective buyers should also know that this phone has a lot in common with the non-Pro model, with the main difference being that device has a lower-res main camera and is a bit cheaper.",
    "Some don’t mind LCD or flat displays, though, and won’t mind these issues; similarly, some won’t care for a high-res camera or 144Hz refresh rate, and won’t find these important reasons to buy the Xiaomi Mi 10T Pro. Like we said, decide on what you’re looking for in a new phone, and check the respective section in this review to see if the Mi 10T Pro delivers.",
    "The Xiaomi Mi 10T Pro was launched alongside its more affordable siblings on September 30. It’s currently available in Europe - we wouldn’t expect a US release, as Xiaomi generally doesn’t offer its phones there, though Australian availability is possible because the company frequently launches devices there.",
    "You can buy the Xiaomi Mi 10T Pro for £599 (roughly $780, AU$1,100) - that puts it between the £799 / AU$1,699 (roughly $1,000) of the Xiaomi Mi 10 and the £469 (around $610, AU$860) of the Mi 10T - though the latter phone has nearly identical specs to this one, with the only differences being the Mi 10T has a 64MP main camera, not 108MP, and has 6GB of RAM and 128GB of storage instead of 8GB / 256GB in the Pro.",
    "The Xiaomi Mi 10T Pro has a fairly average mid-range price, but it’ll mainly appeal to people who want a pricey phone without actually paying such a price. It's worth pointing out the newer Xiaomi 11T Pro starts for the exact same price.",
    "The Xiaomi Mi 10T Pro is a fairly big phone - we’re talking dimensions of 165.1 x 76.4 x 9.3mm and a weight of 218g, so it’s pretty heavy as well as big. With a glass front and back, and a metal frame, it feels fairly solid in the hand.",
    "There’s a fingerprint scanner mounted in the power button on the right edge of the device by the volume rocker. We found this scanner worked well, as it was placed in a position that made it easy to reach, and picked up our finger quickly. That said, due to the size of the phone, some with smaller hands than us might find the fingerprint scanner a little hard to reach.",
    "There’s no 3.5mm headphone jack, so if you used wired headphones you might need to get an adaptor - the only port is a USB-C one.",
    "The back of the phone was a fingerprint magnet, and we had to wipe it frequently to stop the phone from looking messy. The camera bump is absolutely giant, sticking out a good few millimeters from the back of the device, so there’s no chance you’ll be able to put this thing flat on a table without it rocking loads. The main camera's lens is huge too - it looks like a cyclops staring back at you.",
    "Despite not having a curved display (as we’ll describe in our next section, ‘Display’) the phone is pretty comfortable to hold, thanks to its rounded edges.",
    "The Xiaomi Mi 10T Pro has a 6.67-inch LCD display with a FHD+ resolution, 144Hz refresh rate, HDR10+ and 650 nits max brightness. Now let’s unpack that so you know what the display is like.",
    "The use of LCD tech, instead of AMOLED, is a contentious one; the former is typically used in cheap phones, and shows less vibrant colors and images with poorer contrast. Xiaomi justified the change by pointing out that many users have trouble looking at OLED displays, so this phone is good for people with vision problems that may rule out AMOLEDs.",
    "That’s a fair reason for using LCD, but the issues with that screen tech remain in that colors don’t look as vibrant as we’ve seen on other displays, and most things look a bit dimmer. The HDR10+ here only goes so far to offset the issue, and the max brightness feels a little low too.",
    "We also noticed that, by default, the display uses a much warmer color scheme than most other devices we’ve tested. You can alter that in the settings menu though if you want.",
    "One of the biggest selling points of the handset may be its 144Hz refresh rate - other than a few gaming phones, the Xiaomi Mi 10T Pro was the first ‘mainstream’ phone to have this kind of high refresh rate display. Because of it, motion looks smoother - at the moment most media apps don’t have 144Hz compatibility, so it’ll mainly be useful for social media and menus, though over time you might enjoy silky gaming and movies too.",
    "High refresh rates can take their toll on battery life, though that’s not as much of an issue with the Mi 10T Pro since the ‘top’ mode is actually variable, so it’ll change the refresh rate to match what you’re doing. In any case, you can downgrade to 90Hz or 60Hz if you prefer.",
    "After using the Xiaomi Mi 10T Pro we have mixed feelings about the display - the 144Hz refresh rate elevates even basic social media use, and it’ll only get better when more games get compatibility. However the display doesn’t look as good as that on the Mi 10, thanks to the use of LCD, so people who won’t reap the eyesight benefits of this type of screen might not benefit from it.",
    "The Xiaomi Mi 10T Pro’s main camera has the same 108MP f/1.7 sensor we saw in the Mi 10 and Mi Note 10 - if you subscribe to the belief that ‘more megapixels are better’, then Xiaomi is the real camera champ for you. Pictures taken by these phones tend to be good, though the brute-force approach to photography only goes so far, and Samsung and Apple generally have better results with their lower-res sensors.",
    "Still, the Xiaomi Mi 10T Pro’s camera is nothing to turn your nose up at, especially at this price, and we got some good results taking pictures in well-lit conditions. Images were sharp with good depth, and colors looked vibrant. The benefit of this 108MP sensor is that you can zoom, or crop, into a picture you’ve taken and still get sharp results.",
    "Moving into low-light settings, however, caused results to be a little less impressive, though certainly not poor either. Details weren’t picked up in leser-lit areas, and color accuracy got poorer the darker your subject, but we’ve seen plenty of worse night performers, even at higher price points.",
    "The other two rear cameras are a 13MP f/2.4 ultra-wide and a 5MP f/2.4 macro snapper, though both are a little situational, so you won’t find yourself using them all the time. We found the ultra-wide generally good for capturing wider scenes, but the macro had an issue with dynamic range, as the camera samples below will show. We’ve seen some pretty dreadful macro snappers before though, and this definitely isn’t one of the worst.",
    "Xiaomi usually saves telephoto lenses for its top devices, but there isn’t one on the Mi 10T Pro - as a result all zooming is digital, or via cropping of the ‘main’ 108MP picture. This isn’t too much of a problem up to 5x zoom, but beyond that you’re losing quite a bit of detail, and snaps look a little grainy. This is most noticeable when you reach the max zoom of 30x. Since zooming is a super-useful feature for framing shots well, we felt the absence of a telephoto snapper when testing the camera.",
    "Lots of the photography power of the Xiaomi Mi 10T Pro comes from its software, which has a hand in tweaking pictures and also brings in a few extra modes. Generally we’re fans of Xiaomi’s AI optimization, as it can edit shots to make them look just that little bit better, but it’s not as smart as that of Samsung, Apple or Huawei - for example, sometimes the resulting images can look a little bit too saturated.",
    "There are some pretty fun camera modes in the Xiaomi Mi 10T Pro, including returning ones like Vlog (which helps you shoot loads of mini-videos and edits them together) and Front and Back (so you can shoot a video from the front and back cameras at the same time).",
    "Two new ones here are Clone, which lets you take two pictures or videos of the same scene and mashes them together (so people can move about, and appear in the resulting video or picture multiple times), and Sky, which automatically detects the sky in a photo and lets you change it, so you can add weather effects or just change an overcast day to a sunny one.",
    "These modes won’t revolutionize your videography or photography, but they’re fun to play around with.",
    "Talking of videography, you can record video at up to 4K at 60fps or 8K at 30fps - there are some tools like motion tracking and stabilization but they only work at 1080p 30fps, so we found ourselves ignoring them. Videos looked pretty good - in fact, we used the Mi 10T Pro to record some videos for the TechRadar YouTube channel, which you can find here.",
    "The 20MP f/2.2 selfie camera works pretty well, capturing enough detail that you can crop your selfies down without it looking low-res. You’ll probably find yourself using this with Portrait mode mostly, which blurs the background of shots and also slightly tweaks the colors of the subject. We found it mostly worked well, though this bokeh background blur sometimes erroneously smudged parts of our hair, or failed to blur nearby background objects.",
    "The Xiaomi Mi 10T Pro comes with a Snapdragon 865 chipset, which was the best Android chipset available for 2020 Android phones until the 865 Plus was released late in the year, but given the 865 Plus doesn’t bring hugely improved processing, many manufacturers seem content with the 865. It certainly brings impressive processing power to the Mi 10T Pro.",
    "When we put the phone through a benchmarking test, it returned an average multi-core score of 3,292. The fastest phones have scores above 3,000, so the Xiaomi Mi 10T Pro is in line with the likes of the Oppo Find X2 Pro (3295), Motorola Edge Plus (3344), and the US version of the Samsung Galaxy S20 Ultra (3286), all of which have the same Snapdragon 865 processor.",
    "With this high score, the phone won’t really let you down for high-intensity tasks - gaming feels smooth, with games defaulting to high graphics and high frame rate settings when possible, and we never felt much lag or slow loading while playing. The handset also managed image editing easily, even when we used the super-high-res 108MP pictures from the main camera.",
    "There’s 8GB of RAM here, which might sound like a small number compared to the 12GB or 16GB in some other smartphones, but given the diminishing returns of extra RAM in smartphones, you don’t really need more than this.",
    "The Xiaomi Mi 10 speakers were great for a smartphone, but it seems like Xiaomi hasn’t brought this tech back in the 10T Pro - the sound through its speakers isn’t rubbish, but it isn’t fantastic either. Music was distorted when you got to higher volumes, and bass felt a little lacking.",
    "Usually when we review a Xiaomi phone, we’re quick to criticize the amount of bloatware or pre-installed apps which come with the handset - however the Mi 10T Pro doesn’t exhibit this issue nearly as much as some of the company’s other phones.",
    "Sure, there will be a few apps you might not want - WPS Office, eBay, LinkedIn and AliExpress are among the applications which come installed on the phone, all four of which we completely ignored, but gone is the huge roster of third-party apps which clutter up your home screen.",
    "The Xiaomi Mi 10T Pro comes with MIUI 12, the latest software from Xiaomi, which is laid over Android 10. This is largely a graphical overhaul, but there are some layout and option changes too. For example an app drawer isn’t enabled by default, though you can switch one on if you like; three-button navigation likewise is automatically enabled, though you can switch to gesture navigation via an option hidden in the menus.",
    "MIUI’s most annoying feature is one seemingly inspired by iPadOS - if you swipe down from the top left of the screen, you get your notification list, and if you swipe down from the top right, you get the quick settings. Since most Android phones bundle these together into one menu that you can summon by swiping down anywhere from the top of the phone, this might take a lot of getting used to if you’ve come from another Android device.",
    "MIUI brings a few tools that might be useful to intensive smartphone users, like Cleaner, which axes background apps that might be using too much RAM, Boost speed, which does something similar to improve gaming performance, and a scanner function which scans apps for malware when you install them.",
    "This latter feature is useful for people who are security-conscious, but the ‘all-clear’ alert does appear over whatever else you’re doing, which can be quite annoying.",
    "Android 10 brings features like a system-wide dark mode, digital wellbeing tools and smarter reply suggestions, which you can make the most of via MIUI 12 too.",
    "Thanks to the processing speed and high refresh rate, navigating the Xiaomi Mi 10T Pro’s menus felt fluid and snappy - the actual swiping animations of MIUI feel quicker than on other custom UIs from other companies too, adding to this feeling of speed.",
    "The Xiaomi Mi 10T Pro’s battery life likely won’t let you down - with its 5,000mAh battery, which is one of the biggest you’ll find in a smartphone, the handset will easily last you a day.",
    "No matter how much gaming, photography or video or music streaming we did, the Mi 10T Pro always lasted a full day if it had an overnight charge. Frequently the device reached a second day with a decent amount of power too, though it couldn’t really be relied on to last that day to its end.",
    "This long battery life is likely thanks to some of the display features - LCD tends to be less power-intensive than AMOLED, and the ‘Auto’ refresh rate mode guarantees the phone isn’t operating at 144Hz too much of the time, avoiding the common high-refresh-rate issue of excessive power drain.",
    "The charging speed is 33W, so it’s not quite as fast as some other phones from Xiaomi or competitors at this price point (the Realme 7 Pro has 65W charging, for example, and it costs a fair amount less), but not everyone will mind. It took less than an hour for the phone to get from empty to full power, which is still speedy.",
    "Unlike the Mi 10 Pro, the Mi 10T Pro has no wireless charging though, so fans of this cable-free means of powering might have to look elsewhere.",
    "First Published: November 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Xiaomi Mi 10T Pro price and availability",
    "14": "Design",
    "19": "Display",
    "26": "Camera",
    "37": "Specs and performance",
    "42": "Software",
    "50": "Battery life",
    "55": "Don't buy it if..."
  },
  "links": {
    "Xiaomi Mi 10T": "https://www.techradar.com/news/xiaomi-mi-10t-release-date",
    "Xiaomi Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Poco F2 Pro": "https://www.techradar.com/reviews/xiaomi-poco-f2-pro-review",
    "Black Shark 3": "https://www.techradar.com/reviews/xiaomi-black-shark-3-review",
    "Xiaomi 11T Pro": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "here": "https://www.youtube.com/watch?v=FSBGzDpQmvo&t=8s",
    "Oppo Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "Motorola Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Realme 7 Pro": "https://www.techradar.com/reviews/realme-7-pro-review"
  }
}