{
  "source": "https://www.techradar.com/reviews/mac-pro",
  "title": "Apple Mac Pro review",
  "category": "computing",
  "updated": "2021-04-15T05:19:07Z",
  "author": "steve-paris",
  "summary": "Is Apple’s workstation powerhouse the computer for you?",
  "verdict": "An extremely well designed workstation, with many innovative features, to push its processors to its limits - for a price.",
  "pros": [
    "Very well designed",
    "Lots of useful touches",
    "Designed for high-end work",
    "Whisper quiet"
  ],
  "cons": [
    "Expensive",
    "Hasn’t been updated since December 2019"
  ],
  "article": [
    "The Mac Pro is Apple’s high end computer, its most powerful machine, advertised as designed without compromise for the professional user - or more accurately, for the professional user’s company. It’s important to understand from the start what you’re getting with the Mac Pro. It’s easy to look at its tower construction, and conclude this is Apple’s high end desktop machine. But in fairness, now that the iMac Pro has been officially retired, that title actually belongs to the iMac. The Mac Pro is not a desktop. It’s a workstation. It’s a machine that’s designed for high end work like 3D graphics, machine learning, or high end editing of multiple streams of 8K video at full resolution, for instance. That sort of thing. And the eye watering price reflects that focus.",
    "The latest models were released in December 2019. Sixteen months since the last update may seem like an eternity in computer years, but it’s not too bad when it comes to Apple’s top of the line machines: the previous update occurred six years prior! The version Apple kindly loaned us was a mid range model, sporting a 3.2GHz 16-Core Intel Xeon W processor, with 192GB of RAM, two AMD Radeon Pro Vega II 32GB graphics cards, and 4TB of storage. This configuration clocks in at £17,099 ($17,599).",
    "We were also given a 32” Pro Display XDR - a beautiful piece of engineering which costs well over £5,500, including its stand (around $6,000), but to be fair, you can connect the Mac Pro to a different screen, so we haven’t included its value in the price above, nor have we reviewed it.",
    "The machine has a metal frame and the handles at the top are part of that frame, making it feel incredibly sturdy when moving around. The sturdiness is heightened by just how heavy it is - which would explain the need for those painfully expensive but thankfully optional casters if you plan on moving your Mac around a lot. It doesn’t look as bulky as it might seem in the photos, and the tower could rest comfortably on top of your desk, just as much as it can under it.",
    "The holes on the side might make the Mac Pro look like an overgrown cheese grater, but they serve a crucial function: they allow as much air as possible to flow inside the enclosure to cool the electronics down, without compromising on its rigidity.",
    "The whole casing is easily removable to get to the insides, thanks to a very handy retractable handle at the top, although this can only be done when the computer is powered down. Inside, you’ll notice three large fans, which cool the PCI cards, the RAM and the CPU. Each work independently from the others. Apple being Apple, they also designed the fans so that even if they have to spin loud enough to be heard, their pitch is one that is less annoying to most humans’ ears. A nice touch.",
    "Noise pollution is something we often forget about, but it’s actually quite important in a working environment, and in the few tests we ran - tests which would make another computer’s fans scream - the Mac Pro remained whisper quiet. For a machine designed to be constantly pushed 24 hours a day, 7 days a week, 365 days a year, this is a crucially important factor to consider.",
    "In order to get the most out of the computer’s processor, its power supply is specifically designed to constantly offer 300W of power to the CPU, ensuring that it performs in turbo boost mode, and hence at full capacity, all the time.",
    "Another thing to bear in mind with the Mac Pro, is that everybody’s needs are different, and so it can be customised to an substantial amount, from the type of Intel Xeon W processor (from 8 to 28 cores), to the amount of memory (up to 1.5TB of RAM), to the type of graphics card (you can even have two of them installed), to the storage (up to 8TB of SSD storage), and more.",
    "For instance, if you work in video, you could add an Afterburner card (£2,000 / $2,000), which is a hardware accelerator that can process up to 6.3 billion pixels per second, turning your Mac Pro into a system capable of handling 6 streams of 8K Pro Res RAW, or 23 streams of 4K, according to Apple’s own tests. A huge advantage for high end editors.",
    "When two graphic cards are installed, another piece of hardware is used to connect them together, enabling them to talk to each other directly. Not only does this speed up processing functions between them, but by bypassing the main CPU, it takes the pressure off the system, allowing it to devote itself to other functions, speeding up performance.",
    "The Mac Pro offers a 64-lane PCI system, which is composed of 8 PCI slots. These can be taken up with any standard 3PP PCI cards, be they full length or double width cards. Alternatively, Apple’s own MPX cards can be installed instead. These are designed for the Mac Pro and offer up to 500W of power.",
    "You’ll notice that everything inside the enclosure is placed in very compact and space saving ways, and yet top right is a cavity that’s usually left empty - this area is normally set aside for the installation of additional hard drives, for instance.",
    "You’ll also find a USB port there, which we thought was a thoughtful part of the design: since the case itself can be locked, it’s a great place to connect your copy-protection dongle, so you don’t have to worry about this extremely expensive piece of equipment… disappearing. Although only a single port is there, it’s possible to connect a hub to it, enabling you to have up to 12 internal USB slots that way.",
    "If you know Apple, you’ll be familiar with their unbelievably thin enclosures, with proprietary screws, where almost nothing is user replaceable. You could argue that this makes sense for laptops, but it’s frustrating when this philosophy is applied to desktops, and it would be an absolute dealbreaker if this extended to their workstation.",
    "Thankfully, they’ve gone in the absolute opposite direction when to comes to the Mac Pro. Each component can be easily removed, and conveniently replaced should they become faulty or need to be upgraded. This makes sure that in a worse case scenario, your workhorse wouldn’t be down for long - just swap the faulty part and keep going. When every second counts, this is a vital and totally necessary part of the Mac Pro’s design, and overall reliability.",
    "The Mac Pro comes with a striking wireless silver keyboard with black keys, a colour combination you can’t actually purchase separately. Using it feels good. Key presses work well, and it functions just like the other keyboard models Apple makes. But like all of them, we found the angle a little too shallow - practically flat - for our comfort.",
    "A black Magic Mouse 2 is also included, but the problem with that device is the same since its introduction back in 2015: it cannot be used while recharging which still feels like a massive misstep six years later. Yes, charging it for a couple of minutes will give you hours of use, but when working with an expensive machine designed to save you as much time as possible, even losing a few minutes feels off. You do have the option of swapping the mouse for the trackpad for an additional £50 ($50), which is an excellent input device, and best of all, can be used while it’s recharging!",
    "Benchmark results for this, and all other computers, are available on a plethora of websites, and just looking at the results from Geekbench could make you raise an eyebrow as to the Mac Pro’s worth, especially when these models haven’t been updated since December 2019, and when compared to the frankly staggering results of the latest consumer Macs bearing Apple’s new in-house M1 chips.",
    "We ran some of our own speed checks using a top of the line MacBook Pro for comparison, equipped with a 2.3GHz 8-Core Intel Core i9 processor, 64GB of RAM, a AMD Radeon Pro 5500M 8GB graphics card. It’s a machine that’s 3.6 times cheaper than the MacPro, has half as many cores, three times less memory, and a single much inferior graphics card.",
    "We used MAXON’s Cinebench software to see how well both computers performed - with no other apps open, after a restart. The Mac Pro was the clear winner, being slightly over 2.5 times faster than its laptop counterpart: 18,564 vs 7,182.",
    "But benchmarks can only give you an impression of a computer’s performance. How did these machine do when working on real-world tasks?",
    "We ran a handful of tests. The first one was exporting two projects from Apple’s own Final Cut Pro as Master copies. One was three and a half minutes long, and the other nearly twenty. Both were filled with effects (mostly colour correction and keying), and both had all their render files deleted (to force each computer to recreate them on export).",
    "The Mac Pro easily beat the MacBook Pro, and interestingly enough, performed much better for the longer project: 1.68 faster for the shorter one, and 2.97 faster for the longer one.",
    "Our second test involved using the open source Handbrake application to convert those master files into MP4. The speed difference was practically the same: 2.96 faster for the shorter one, and 2.79 for the other.",
    "And our final test involved a simple upscaling conversation in Pixelmator Pro. We used a 12MP 4.9MB file and increased it to 109MP using the software’s ‘ML Super Resolution’ feature. The Mac Pro did it 2.5 times faster than the MacBook Pro.",
    "All these tests pretty much confirmed Cinebench’s findings: the Mac Pro was at least 2.5 times faster, and was nearly three times faster in some real life tests. But it’s important to note that this doesn’t tell the whole story.",
    "As you can see from the tests we ran, we performed actions that any Mac can do, and in a way, even though the Mac Pro won them all, it also puts it at a disadvantage, as it doesn’t highlight what makes the Mac Pro truly shine.",
    "A recent post by Sheffield-based company Lunar Animation, highlights this perfectly: in working conditions, where the Mac Pro is placed in a high end situation performing at peak efficiency for long periods of time, the advantages shine through. These are not situations most computer users face, but was what this machine was built for. Lunar Animation have been using the Mac Pro for a little over a year, and have seen first hand what this computer offers.",
    "For instance, if you need to multitask between complex applications, “rather than having to close the heavy scene, load up the 3D model we want to adjust and then close that and reopen the original scene to continue working, we are able to simply switch spaces in macOS, add a light to a 3D model and quickly switch back and check the update with the interactive IPR renderer.”",
    "Or if you’re looking for a reason to have more than one GPU, “cloth and grain is typically calculated using the GPU, and if you have four GPUs in your Mac Pro then you can utilise all of them working away in the background.”",
    "This company originally worked with the now retiring iMac Pro, and were struggling designing a long sequences for an end-credit scene. Then their Mac Pro arrived, and everything changed:",
    "“Not only is two minutes a long time, but 28 high resolution photorealistic objects - each with a lot of high resolution textures and geometry - can start to cause issues. One of the immediate things we noticed as soon as we began the animation stage on an iMac Pro, is that we were struggling to get all of the assets into a scene with all of their high resolution texture maps without running out of Graphics RAM. […]",
    "“we opened the same scene on the Mac Pro and all of the textures loaded up completely fine. This makes sense, as there is double the graphics memory for textures (32GB instead of 16GB). We were then surprised to see that it was playing back in real time without pre-caching, because even with clamped textures on the iMac Pro, we weren’t getting a consistent 24 frames-per-second during playback.",
    "“We then unlocked the 24 frames-per-second cap on the playback and got speeds of up to 134 frames-per-second. This allowed us to review, change and preview everything at lightning speed avoiding the need to create proxy textures and models, and we were able to work with the content directly.”",
    "There’s really no clearer example as to the advantages of the Mac Pro than with real life examples of professionals using this workstation as it’s meant to be used.",
    "Another highly useful feature of such a powerhouse would be in virtualisation, depending on the specs, of course, you would have enough power to run MacOS natively, and Windows and Linux in virtual environments, saving you having to have multiple computers to test out your latest software, update or patch (it will be interesting to see how this particular advantage plays out if and when the Mac Pro moves to Apple’s own brand of CPU).",
    "The price and performance comparison, although useful to some degree, can be misleading. As stated from the start, this is not a tower, but a workstation, a high-end, top of the line, powerful computer, which is beyond the needs of nearly all of us. Despite this, the Mac Pro is notably faster than the machine we compared it with, and taking into account Lunar Animation’s assessment - a company which does high end work in the film industry - you can see the clear advantages of this computer. It’s expensive, yes, but there’s a reason behind the expense. Just don’t think it’s Apple’s answer to tower computers."
  ],
  "headers": {
    "3": "Hardware design",
    "8": "Expandability",
    "14": "Easy replacements",
    "16": "Clicks and presses",
    "18": "Performance checks",
    "27": "Caveat",
    "37": "Final verdict"
  },
  "links": {
    "Mac Pro": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1334488822169371100&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fmac-pro%2F",
    "iMac Pro": "https://www.techradar.com/reviews/imac-pro",
    "iMac": "https://www.techradar.com/reviews/apple-imac-27-inch-2020",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "32” Pro Display XDR": "https://www.techradar.com/news/pro-display-xdr-first-look-a-monitor-not-for-mere-mortals",
    "trackpad": "https://www.techradar.com/reviews/pc-mac/peripherals/input-devices/general-input-devices/apple-magic-trackpad-713555/review",
    "M1 chips": "https://www.techradar.com/news/apple-m1-chip",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-13-inch-2020",
    "Final Cut Pro": "https://www.techradar.com/reviews/final-cut-pro-x-1048",
    "Handbrake": "https://www.techradar.com/reviews/handbrake",
    "recent post": "https://www.lunaranimation.com/lunar-blog/2021/03/02/mac-pro-a-year-in-the-studio",
    "GPU": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "everything changed": "https://www.lunaranimation.com/lunar-blog/2019/12/23/using-the-new-mac-pro",
    "virtualisation": "https://www.techradar.com/best/best-virtual-machine-software"
  }
}