{
  "source": "https://www.techradar.com/reviews/threema-encrypted-messaging",
  "title": "Threema encrypted messaging review",
  "category": "computing",
  "updated": "2021-08-06T03:28:57Z",
  "author": "joanne-heng",
  "summary": "Highly secure messaging app with a reasonable price tag",
  "verdict": "Threema is a highly secure messaging platform with basic features, a simple interface, and comprehensive customer support. The lack of advanced features, however, is a drawback.",
  "pros": [
    "End-to-end encryption",
    "Responsive customer support",
    "Intuitive interface"
  ],
  "cons": [
    "Not free",
    "Lack of advanced features"
  ],
  "article": [
    "When we think about messaging platforms, most of us will not forget popular apps like Telegram and WhatsApp. A lesser known messaging app is Threema—a secure and anonymous platform from Switzerland.",
    "In this Threema review, you'll find information about the platform’s pricing, features, interface, security, and support so that you can decide if it is the encrypted messaging platform that fits all the criteria you’re looking for.",
    "Unlike popular apps like Signal, Whatsapp, and Telegram, Threema is not a free app. You’ll have to pay a one-time fee of $2.99 to download it. This may be a dealbreaker for some users, but to Threema’s 8 million active users, that’s a small price to pay for the security and privacy that the platform offers.",
    "Like most messaging apps, you can use Threema to send text and voice messages, share files, media, and locations, and make voice or video calls. Compared to popular apps like Telegram, though, Threema’s features are pretty basic. Here are some of the platform’s best features.",
    "Threema allows you to protect your individual chats and hide them from the chat list on Threema's main screen so that no one else can view your confidential messages. Notifications that you receive for messages in a private chat also contain no message preview.",
    "Long-press a chat that you’d like to make private, and select Mark as private chat. You’ll then be prompted to create a PIN, which you’ll have to enter each time you want to show a private chat.",
    "On Threema’s integrated media gallery, users can conveniently send images and videos by tapping on the paper clip icon in a chat. A media gallery will appear and you can select the photos you wish to send. You can even add captions and edit the photos right from the app to crop, add text, or apply a filter to your image.",
    "The media gallery is also equipped with image recognition so that you can search for images by entering certain keywords. This saves you the trouble of sieving through the endless scroll of images on your device. Because image recognition is carried out locally, the images never leave your devices. But if you’re uncomfortable with this feature, you can always choose not to activate it.",
    "In terms of professional team communication, Threema offers useful features like polls and agree/disagree tools. You can use them to ask a question and quickly get an idea of what others in the group might feel about it. Beyond these simple tools, however, Threema’s team communication features pale in comparison to screen sharing features and basic project management tools offered by team chat apps like Slack or Discord.",
    "Threema is available on Apple's App Store and the Google Play Store as well as in the Threema Shop. You can also access Threema on your desktop simply by scanning a QR code with your mobile.",
    "Setting up your Threema account is a simple process. Unlike platforms like WhatsApp or Telegram, you’re not required to provide your phone number, email, or any personal information during setup.",
    "Instead, all you need to do is create a username and password and generate a Threema ID, which you can receive by starting the app and tapping around on the main screen. You’ll need to know a user’s Threema ID to start a conversation with them.",
    "On all operating systems, Threema’s interface is simple and without frills. Those coming from WhatsApp will find that the two platforms have a similar interface. On the main screen, you’ll find all your active conversations. Click on a conversation you want to open and you’ll find that message bubbles are neatly arranged and easy to read. Overall, Threema’s interface holds no surprises and is easy to use.",
    "Threema’s support comes in the form of a database of more than 150 frequently asked questions. Its FAQ is neatly separated into categories like Security and Privacy, Purchase, Features, and more. If you are unsure where your query lies, simply enter some keywords into the search bar at the top of the screen.",
    "German speakers can also choose to get assistance from the German-speaking Threema community on the unofficial Threema Forum.",
    "If you can’t find an answer to your question in the FAQ section, you can get in touch with Threema’s support team by filling out a form. We found the support team friendly and helpful. They got back to us about our queries after one working day, which is fairly responsive.",
    "Threema was designed with security in mind. All forms of communication on the platform—messages, photos, videos, files, voice calls, and even status messages—are end-to-end encrypted. Because users are in control of the key exchange, no third party can decrypt your messages.",
    "In addition, Threema doesn’t store your information on its servers. Your contact lists are managed on your device and messages are not stored after they have been delivered. No log files are created, and no personal information is collected in the process. You don’t have to worry about data misuse.",
    "Threema apps are also open source to ensure full transparency—anyone can verify Threema’s security.",
    "If you are determined to use a free platform as your go-to messaging app, Threema may not be an option for you. In that case, free-to-use apps like WhatsApp or Telegram may appeal to you. But with these apps, you’ll have to compromise on privacy and security.",
    "WhatsApp, for one, shares your account details, like your name and IP address, with Facebook. Similarly, Telegram’s privacy policy states that the service collects data such as your IP address, devices and more.",
    "Threema’s intuitive interface, focus on security and privacy, and comprehensive customer support make the messaging platform easy to recommend.",
    "While its price tag of $2.99 and lack of advanced features may be a turn-off for those looking for a free and feature-rich messaging app, privacy-conscious users will enjoy Threema’s unrivaled security and privacy."
  ],
  "headers": {
    "2": "Plans and pricing",
    "3": "Features",
    "9": "Interface and in use",
    "13": "Support",
    "16": "Security",
    "19": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "Threema": "https://threema.ch/en",
    "encrypted messaging": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "8 million active users": "https://threema.ch/press-files/1_press_info/Press-Info_Threema_EN.pdf",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "WhatsApp": "https://www.techradar.com/how-to/use-whatsapp",
    "Telegram": "https://www.techradar.com/reviews/telegram-encrypted-messaging"
  }
}