{
  "source": "https://www.techradar.com/reviews/msecure",
  "title": "mSecure password manager review",
  "category": "computing",
  "updated": "2021-11-09T07:11:09Z",
  "author": "michael-graw",
  "summary": "A flexible and affordable password manager",
  "verdict": "mSecure is a quality password manager targeted at individuals, with customizable templates and syncing across devices. The only major thing missing is secure password sharing for families and teams.",
  "pros": [
    "Free tier available devices",
    "Sync using Dropbox or mSecure Cloud",
    "Supports Apple Watch",
    "Pro tier is affordable as a one time purchase"
  ],
  "cons": [
    "Password generator only produces random strings",
    "Doesn’t support secure password sharing",
    "Lacks business plan",
    "Lacks direct support options"
  ],
  "article": [
    "On the hunt for the best password manager? mSecure is worth a closer look. This capable password manager works seamlessly across all your devices. Thanks to a recent redesign, the interface is extremely intuitive and makes it easy to organize your data. mSecure is a product of mSeven Software, a private company from Lake Oswego, Oregon, that was founded in 2008.",
    "In our mSecure review, we’ll help you decide whether this is the right security software for you.",
    "To start, mSecure covers all the essentials you need from a password manager. There’s no limit on how many entries you can keep and the built-in categories enable you to store much more than passwords. All entries support custom fields and you can also separate entries into groups in lieu of simple tags.",
    "The password generator included in mSecure works well, but it wasn’t our favorite. There’s no option to force it to produce human-readable words. As a result, every password is a truly random string that’s hard to type if you don’t have auto-fill enabled. Notably, you also can’t access the password generator without creating a new record in mSecure.",
    "One of the things that’s unique about mSecure is its cross-device syncing. You can sync new data entries across all your devices using the mSecure Cloud, Dropbox, or your home Wi-Fi network. Alternatively, the software enables you to create encrypted backups of your database at any time, which can be ported across devices.",
    "Getting started with mSecure is fast and easy. You just need to enter your email and a master password to launch the software for the first time.",
    "From there, you can import records from a CSV file or restore a backup database made by mSecure on another device. Note, though, that mSecure can’t easily import records from another password manager without copying them into an unsecured CSV file first.",
    "mSecure’s desktop and mobile apps recently underwent a full redesign, so they now sport a modern and sleek user interface. One of the best things mSecure added is auto-downloading of logos when you create an account online. That makes it very easy to find the entry for a specific login, like Netflix or Amazon, when you’re scrolling through your database.",
    "We also liked that mSecure has added flexibility into the data entry process. You can not only add custom fields to every individual record but also redesign the templates for entire data categories.",
    "The only major thing that we found mSecure to be missing is a way to securely share passwords. Although you can categorize login credentials into groups, these are solely for organization. Unfortunately this means that support for families and teams is not to be found here, and that mSecure is limited to only individual use.",
    "mSecure stores your data locally on your device and offers several features to ensure it can’t be compromised such as “Auto-lock, Auto-backup, Password Generator, Touch ID (Mac & iOS) and Nexus Imprint (Android).” This includes that both the data and the passwords are “Behind industry standard AES-256 encryption.” The platform enables you to set an inactivity time, after which it will automatically log out. You can also choose a self-destruct setting, which will destroy your database after several failed login attempts. We’d rather just see two-factor authentication, but self-destruct works as long as you have a backup of your database on another device.",
    "If you take advantage of syncing, your data security becomes much more dicey. mSecure offers its own cloud service in part because the company doesn’t trust that services like Google and Dropbox are fully safe from hacks. But it’s not clear that mSecure’s cloud is any more protected. So, one of the most convenient features of this platform is also potentially its most vulnerable.",
    "mSecure provides support by email only using an online ticket system through a support portal- in other words there is no direct email address provided. However, we will state that when we emailed, the company got back to us by the following day.",
    "If you need more immediate support, it is more the ‘Self service variety,’ as the company’s website includes a detailed knowledgebase with topics such as “Getting started with mSecure for Windows,” and “Does mSecure store any data on their servers if I disable the mSecure Cloud Sync feature?” There’s even an mSecure user forum—most of the discussions are more than two years old, but you can easily search through threads such as “Import from a different password manager” to find answers to issues that other users have worked through.",
    "However, the more direct support options are lacking. We did not find a direct phone number, let alone a toll free number. Also, we did not find a fax number, nor a chat agent.",
    "mSecure offers one free and one paid plan option. The free plan includes all the password manager essentials, such as unlimited data entries and a password generator. It can also be used on both desktop and mobile devices.",
    "The Pro plan costs a one-time fee of $19.99, as opposed to the usual subscription model that most of its competitors use. The most important thing it adds is syncing between your devices, which ensures your secure data is always up to date. This plan also adds an auto-fill/auto-login feature, Touch ID & Face ID support, Apple Watch support and lets you customize the included data entry templates.",
    "If secure password sharing is important to you, it’s worth checking out LastPass. This popular password manager offers sharing with one other user for free. You can share passwords with an unlimited number of users for as little as $3 per month. We also like that LastPass includes multi-factor authentication (MFA) for added security. However, keep in mind that a monthly subscription is much more than mSecure’s lifetime paid plan in the long run.",
    "mSecure is a good password manager that makes it easy to keep records across multiple devices. We appreciated the redesigned interface and the ability to fully customize data fields and category templates. We’d love to see mSecure implement a way to securely share passwords rather than just sync across your own devices. But, even without that feature, mSecure is an affordable password manager that’s more than capable enough for plenty of individual users.",
    "We've also featured the best password manager"
  ],
  "headers": {
    "2": "Features and utilities",
    "5": "Setup",
    "7": "Interface and performance",
    "10": "Security",
    "12": "Support",
    "15": "Plans and pricing",
    "17": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "best password manager": "https://www.techradar.com/best/password-manager",
    "mSecure": "https://www.msecure.com/",
    "password generator": "https://www.techradar.com/best/password-generator",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "database": "https://www.techradar.com/best/best-database-software",
    "Pro plan": "https://www.msecure.com/pricing/",
    "Apple Watch": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "MFA": "https://www.techradar.com/news/lastpass-upgrades-mfa-options-for-businesses-and-consumers-alike"
  }
}