{
  "source": "https://www.techradar.com/reviews/lenovo-legion-phone-duel-review",
  "title": "Lenovo Legion Phone Duel review",
  "category": "phones",
  "updated": "2021-01-25T12:42:47Z",
  "author": "tom-bedford",
  "summary": "Probably the best gaming phone we’ve seen",
  "verdict": "If you’re looking for a great 5G gaming phone you won’t go wrong with the Lenovo Legion Phone Duel – it has top specs, a long-lasting battery and a good-looking display. It brings a few extra gaming features too, like side triggers, dual USB-C ports, and bespoke gaming software. It has a few rough edges, especially in the software department, but its only real issues are the price (higher than some other gaming phones) and the fact that you can’t utilize its super-fast charging at the time of release.",
  "pros": [
    "Great gaming phone",
    "Fastest-charging phone so far",
    "Well optimized for use in landscape orientation"
  ],
  "cons": [
    "Software issues",
    "Pretty expensive",
    "LEDs may be divisive"
  ],
  "article": [
    "A new contender has entered the gaming phone market, but while the Lenovo Legion Phone Duel is the first of its line, its existence isn’t totally out of the blue. Lenovo is the company that markets Motorola phones, so it’s no stranger to mobiles, and Lenovo Legion is already a line of gaming-focused PCs and laptops – so this smartphone is a logical marriage of those product lines.",
    "The Legion Phone Duel is probably the best gaming phone we’ve tested in 2020. We say that because Lenovo has created a device without many of the issues we’ve seen on other gaming-oriented handsets when it comes to ‘everyday’ features, while also ticking all the ‘gaming phone’ boxes.",
    "It has the top chipset available when it launched, the Snapdragon 865 Plus, paired with 12GB or 16GB RAM, an AMOLED screen with a 144Hz refresh rate for vivid colors and smooth gameplay, and dual front-facing speakers for powerful audio. It’s also got a long-lasting battery which will easily see you through hours of gaming.",
    "These specs all put the Lenovo Legion Phone Duel on a par with other gaming phones, but it’s the non-gaming aspects that elevate it above the pack. While most phones designed for mobile gamers have issues when it comes to features and performance outside of gaming, this is as good a day-to-day smartphone as it is a gaming device.",
    "The Lenovo Legion Phone Duel is a touch smaller than many other gaming smartphones, and its power button is located low down on the right side so it’s easy to reach when you want to wake the handset, making this a generally better one-hand device than its rivals. Its software also feels clean; while it’s not technically stock Android it feels very similar, offering Google’s suite of apps and forgoing bloatware.",
    "The Lenovo Legion Phone Duel is the first phone to come with 90W fast charging, in the case of the 16GB RAM version – this utilizes both USB-C ports of the phone, and takes less than half an hour to get the phone powered from empty. There’s also a more affordable 12GB RAM model of the phone, which maxes out at a still-speedy 65W charging.",
    "Our one major problem with the Legion Phone Duel is, thankfully, one that Lenovo should be able to fix via patches: software issues. These ranged from the amusing, like untranslated text in the Legion gaming app, to the annoying, like text in notifications sometimes being the wrong color and hard to read, to the truly troublesome, with the phone frequently shutting down for no apparent reason.",
    "The Phone Duel price is also a touch on the high side for a gaming phone – it’s one of the priciest phones in that market, and is undercut by a few phones, such as the Nubia Red Magic 5G and Black Shark, that have similar specs. Sure, the Legion Phone beats them in a few respects, but some may not deem that worth the extra cost.",
    "In some ways then, the Lenovo Legion Phone Duel is the ‘whack-a-mole’ of the gaming phone market: it comes without some of the problems other games phones have, but a few other issues have popped up as a result. Still, it’s great for gaming and is a valiant first effort for the Lenovo Legion phone arm.",
    "You can pick up the Lenovo Legion Phone Duel in the UK and Europe right now – the handset hasn’t yet been confirmed for the US or Australia, but since the company generally operates in those territories, we won’t rule it out.",
    "For the 12GB RAM / 256GB storage space version of the phone you’ll be paying £799 (roughly $1,060, AU$1,440). There’s also a 16GB / 512GB option, which offers the aforementioned 90W fast charging, and which will cost you £899 (about $1,200, AU$1,620). Since that fast charging isn’t available just yet, and few people will really appreciate the extra RAM, we’d say the base model is probably fine for most people, but competitive gamers, or people who want the absolute maximum storage space possible, might prefer the pricier model. For this review we tested the specced-up handset.",
    "The Legion Phone Duel competes with the Nubia Red Magic 5G, which gets you 8GB RAM / 128GB storage for $579 / £539 / AU$579; the Xiaomi Black Shark 3, which has the Red Magic’s RAM and storage specs but a price tag of $599 / £539 (around AU$950); and the 12GB / 256GB Black Shark 3 Pro, which costs £799 / AU$1,999 (about $1,060). So as you can see, the Lenovo Legion Phone Duel’s price positions it as one of the pricier gaming phones, although its higher specs and features should go some way to justifying that.",
    "You’re not going to look at the Lenovo Legion Phone Duel and confuse it with a non-gaming phone. Its design isn’t as in-your-face as that of some other gaming phones, but it still has a rather brutalist and angular look, with a holographic ‘X’ and a light-up LED ‘Y’ on the back.",
    "It’s not a huge phone as gaming handsets go, with dimensions of 169.2 x 78.5 x 9.9mm, although someone who’s unused to handsets in this market would likely find that pretty big. It weighs 239g, which is definitely on the chunky end of the scale.",
    "On the right is a side-mounted power button, and it’s pretty low down, so we imagine that most people will find it easy to reach. The higher volume rocker on the left side isn’t as handily placed though. There’s also a second USB-C port below the volume volume, in addition to the ‘main’ one on the bottom of the phone – this lets you plug in a second accessory, or charge faster from two ports at once.",
    "Also on the right edge of the phone – or on the top when you’re holding it landscape – are two triggers for gaming. These aren’t physical buttons that stick out, but rather haptic areas that you squeeze, similar to the Active Edge feature on some Google Pixel phones. You’d be forgiven for not noticing these triggers just by looking at the phone, as the only signs that they’re there are two small patterned areas towards the top and bottom of the right side.",
    "This is a gaming phone, and that means you’re getting light-up LED patterns on the back. Some hate this, others like it ironically, and a few people genuinely do like phones that look like this. Whichever category you fall into, the rear LEDs aren’t too big or obnoxious compared to those on some other gaming devices.",
    "We get the impression the Lenovo Legion Phone Duel is designed to be predominantly used in landscape orientation (both when gaming and for regular use), and two key design decisions back this up. First, the two camera lenses, which are flush with the glass back of the phone, are very low down, which ensures that you don’t accidentally cover them with your hand when taking photos in landscape.",
    "Second, the pop-up selfie camera is technically on the side of the phone, at least when you’re holding it in portrait orientation, which of course means it’s on the top of the phone when it’s in landscape. It’s a pretty wide pop-up segment, making it feel more robust than most, and it doesn’t poke out too far.",
    "The Lenovo Legion Phone Duel has a 6.65-inch display – that’s a touch smaller than the screens on some other gaming phones, but not by much. It’s a FHD+ HDR10+ AMOLED display, so images look fairly high-resolution with punchy colors. It’ll display any game at the maximum graphical settings the title can support, and streamed video looks great too.",
    "The handset has a 144Hz maximum refresh rate, the same as some other gaming phones, which means the display image is updated 144 times per second. In theory that’s great for gaming, as it makes motion look smoother, although as of the handset’s release not many games support this high refresh rate. You can turn this down to 120Hz, 90Hz or 60Hz when you don’t need it, which prolongs battery life.",
    "Gamers will appreciate the fact that, due to the phone having a pop-up camera, the screen isn’t broken up by a notch, cutout or punch-hole, allowing you to play without the distraction of that feature at one corner or side of the screen.",
    "The Lenovo Legion Phone Duel has two rear cameras, a 64MP f/1.9 main and 16MP f/2.2 ultra-wide snapper, and they’re both perfectly good, although you won’t be taking particularly stunning snaps with this phone.",
    "We found that our pictures looked fine, but nothing to write home about. Overall quality was good, with plenty of detail, but the snaps didn’t have a wide dynamic range, and many shots had a yellowish cast – this was most obvious in lower-light settings, including most interiors, but it was noticeable in exterior shots too.",
    "Low-light images, and darker parts of photos, tended to look a little grainy, and lack detail. This was particularly true for snaps taken with the ultra-wide camera, although the main snapper wasn’t entirely free of the issue.",
    "Depth effects were sometimes muddled too, particularly with food shots – the depth of field tended to be too shallow, which resulted in lots of the dish we were trying to snap being out of focus.",
    "One interesting feature here is that by default, pictures taken are in a 19.5:9 aspect ratio (the same as the phone screen), not 4:3 as on most other smartphone cameras, although you can select that aspect ratio if you prefer. Wider shots like this tend to look more cinematic – movies are in similar ratios – and we felt that photos we took looked a bit ‘cooler’, for lack of a better word, as a result.",
    "The pop-up selfie camera is 20MP and f/2.2, and we were able to get some pretty good selfies, though the lack of a Portrait mode (on either the front or rear cameras) could be an issue for some. There are beauty modes that you can tweak, but no background blurring or similar.",
    "We didn’t take any award-worthy photos on the Lenovo Legion Phone, but we did take a few that we liked, and we generally found it fit for social media posting and the like.",
    "The camera app is pretty barebones, with photo or video settings the only two main modes you can choose from. Video recording goes up to 4K, but only at 30fps.",
    "The Lenovo Legion Phone Duel’s internals are really the ‘point’ of this device, as the entire phone is tailored to deliver a great gaming experience.",
    "It makes sense, then, that the phone uses the Snapdragon 865 Plus chipset, which was the best gaming-optimized processor available to Android phones at the time of its launch. This is paired with 12GB or 16GB RAM, depending on which model you opt for, although as we’ve mentioned it’s unlikely many people will notice a demonstrable difference between the two.",
    "When we put the 16GB model through the Geekbench 5 benchmarking test it returned a multi-core score of 3335. That’s a high score, and while it’s beaten by the Asus ROG Phone 3 it’s by a mere five points.",
    "At this high end of the benchmark spectrum, five points isn’t going to make a lick of difference to performance, and the Lenovo Legion Phone Duel is as fast and powerful as you could want.",
    "Games run as well as they can on any smartphone right now. Every title we tried defaulted to the highest graphical options available to it, and we never encountered any lag or stuttering, even in relatively intensive titles.",
    "We’ve also got to praise the virtual trigger buttons, as they were really easy to use in gameplay – they didn’t take too much squeezing, and their location means they fall naturally under the fingers. You can assign a particular function to each trigger, as with third-party phone controllers, although you do have to re-map your selection between games, which could be annoying for some.",
    "The Lenovo Legion Phone Duel has dual speakers, one at the top and one at the bottom of the display, and for phone speakers they’re very good – the soundstage they create is impressive given the size of the device and audio can go quite a bit louder without distorting than on most devices.",
    "The Lenovo Legion Phone Duel runs Android 10 with Lenovo’s LegionOS laid over the top. This is the debut of LegionOS but users might find it familiar – it’s actually very similar to stock Android, which Lenovo uses in Motorola phones.",
    "As mentioned in the Design section, it feels like the Legion Phone was designed to be used primarily in landscape mode, to match the format of most of the games you’ll be playing, and that’s most apparent in the software department. It can be used in landscape for functions not normally possible on a phone – for example, if you rotate the phone 90 degrees the home page will reorient. Many of the built-in apps work in landscape, and some third-party ones too, and it makes picking up the phone, doing a few routine tasks like checking your messages, and then jumping into a game a seamless experience, as you don’t have to rotate the device.",
    "We did encounter quite a few problems – let’s call them teething issues – with LegionOS, which was a little buggy. Often when we unlocked the phone it would open in landscape mode, even when we weren’t holding the device that way. Text in notifications was sometimes the wrong color, making it hard to see – for example the Spotify widget tended to display text in the same color as the album artwork in the background, making the song title, and the controls, impossible to make out.",
    "The biggest issue we found, though, was that the phone frequently turned off for no reason when we hadn’t used it for a while. We’d frequently – maybe a few times a week – pick up the phone and press the power button, only for it not to respond. Turns out the thing had given up on us.",
    "The phone also crashed now and then during normal use, taking us to a boot screen and requiring us to restart it. This was particularly annoying during phone calls, as it seemed to happen more frequently then. This isn’t an issue we’ve had with any other phone we’ve tested, making it rather curious, and we hope this is something Lenovo will be able to fix via a software patch.",
    "Like many gaming phones, the Lenovo Legion Phone Duel has dedicated gaming software. This runs in the background when you’re playing and mutes notifications, frees-up processing power for the game, and tweaks some display settings. Unlike on many other phones, Lenovo’s gaming mode launches automatically when you open a game, without you having to toggle it – as such, we didn’t even notice it in our initial testing, and we like the fact that you can ignore it if you want, while still enjoying its benefits.",
    "We have to point out that we couldn’t utilize all the features of the Legion gaming app, as some of the text in it wasn’t in English, so we couldn’t tell what some options did. Lenovo probably should have checked this before shipping the phone, though it’s something the company can easily address via a patch.",
    "We were fairly impressed with the Lenovo Legion Phone Duel’s battery life, both when in everyday use and when gaming. The phone has a 5,000mAh battery capacity, which is high for a smartphone, although average for a gaming device.",
    "When we weren’t gaming, the phone easily lasted a day without needing to be charged, and often made it a fair way through a second day – and if you can’t go a day without playing, you’ll be pleased to know that the handset will still last you a day if you play a few hours of games throughout.",
    "After long bouts of gaming the device did heat up a bit, but not so much that it became a concern.",
    "The maximum charging speed of the phone is 65W for the 12GB RAM version of the phone, and a super-speedy 90W for the 16GB version. While 65W is incredibly fast, 90W is the fastest we’ve seen in a commercially-available smartphone.",
    "You can achieve this 90W speed by utilizing both USB-C ports, using the 60W and 30W chargers that come with the phone – so even if you only choose to use the former in order to free-up a port, you’re getting snappy powering. The 12GB phone does have two ports too, so you can modify your speeds by only using one at a time if you want.",
    "Even if you opt for the more affordable version of the phone, 65W is an incredibly quick charging speed, and it takes well under an hour to power up to full. It’s worth pointing out the side-mounted port isn’t as fast for charging as the ‘main’ one on the bottom of the phone, so if you’re only using one of the ports, make sure it’s the latter.",
    "Super-fast powering ensures that you can keep your phone charging while you game, as sometimes gaming can consume more power than a charger can provide – in those circumstances, plugging a phone in only reduces the rate the battery is used, and doesn’t increase the charge at all.",
    "First reviewed: January 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Lenovo Legion Phone Duel price and availability",
    "12": "Design",
    "19": "Display",
    "22": "Cameras",
    "30": "Performance and specs",
    "37": "Software",
    "44": "Battery life",
    "51": "Don't buy it if..."
  },
  "links": {}
}