{
  "source": "https://www.techradar.com/reviews/apple-watch-3-review",
  "title": "Apple Watch 3 review",
  "category": "wearables",
  "updated": "2021-06-17T06:03:21Z",
  "author": "gareth-beavis",
  "summary": "The Apple Watch 3 is still a powerful wearable",
  "verdict": "The two versions of the Apple Watch 3 impress - but the cheaper, non-4G version of the wearable delivers good value for money and top fitness capabilities from the wrist.",
  "pros": [
    "Good smartwatch battery life",
    "Clear, bright screen",
    "Fantastic fitness features"
  ],
  "cons": [
    "Only iPhone compatible",
    "Siri still patchy",
    "High price for 4G model"
  ],
  "article": [
    "The Apple Watch 3 (or Apple Watch Series 3 if you're being particular) has been superseded several times over, most recently by the Apple Watch 6, and Apple Watch SE - the latter of which could be a real rival for it, since they're both budget models.",
    "But the Watch 3 remains for sale on Apple's official store - which is more than we can say for the Apple Watch 4 or even the Apple Watch 5 - and it has been discounted heavily now, too. Specs and features-wise, it's about on par with the newer Apple Watch SE, though likely for a lower cost.",
    "That cost could drop even more during Amazon Prime Day 2021, where older gadgets like the Apple Watch 3 reliably get discounted. Check our guide to see what to look for in Apple Watch deals when Amazon Prime Day starts on June 21.",
    "The Watch 3 is available in two forms – one with cellular connectivity, and one with just GPS. As the replacement for the Apple Watch 2, this device was the flag-bearer for fitness and longevity, with run and cycle tracking on board and a water-resistant casing for swimming, plus the same heart rate monitor on the underside.",
    "And while newer models pack in extra features and faster chipsets, Apple has kept supporting the Apple Watch 3 with software updates, most recently watchOS 7, which adds sleep tracking, new workouts, and a whole lot more.",
    "Update: watchOS 8 was announced at WWDC 2021, bringing more software and features when it fully launches later this year – and yes, it's compatible with the Apple Watch 3. Eager fans can get the developer preview now if they're part of the developer program, or join the public beta in July.",
    "At launch in late 2017, the Apple Watch 3 was the most expensive wearable the company sold but now the price has shrunk since the launch of the Apple Watch Series 4 and Apple Watch 5. It's still not an inherently cheap smartwatch, but it's a lot more affordable now.",
    "There are two variants of the Apple Watch 3, one with LTE / cellular capabilities and one with just GPS onboard.",
    "The former costs £299 / $299 / AU$469 / AED 1,199 or £329 / $329 / AU$519 / AED 1,329 (for the 38mm and 42mm bands respectively) these days thanks to a serious discount after the release of the Apple Watch 5.",
    "The 3 series GPS version is much cheaper at £199 / $199 / AU$319 for the 38mm and £229 / $229 / AU$369 for the 42mm.",
    "It's worth noting also that while Apple has discontinued the Apple Watch 4 and 5, you can still get the Apple Watch 3 direct from the company, so it's easy to get hold of.",
    "The biggest upgrade the Apple Watch 3 brought was its own cellular connection inside, so it can work independently of your phone.",
    "Does that mean you can buy one without owning an iPhone? Sadly not… not by a long way. In reality it means that you can receive phone calls and some app notifications when your phone is at home, but otherwise it’s totally dependent on your handset.",
    "In terms of notifications, if the app you want to use hasn't been upgraded to work in 'standalone mode' (as in, doesn't need a phone connection to function) then you won’t get updates and notifications even if the LTE connection is enabled.",
    "The ability to connect to a cellular network is fine, but doesn't feel like the most crucial feature to add in - although some people have already reported it's saved their life.",
    "The call quality from such a small device is really rather impressive – we conducted a phone chat with someone while running, and both the voice quality out of the speaker and the sensitivity of the microphone were excellent.",
    "It meant we could run pretty much normally and still hold a conversation without having to hold the Watch 3 to our head. In fact, it was so loud you’ll need to move quickly to stop people listening in.",
    "It's less useful when driving - the ambient noise makes it harder to hear what's being said - but it'll do in a pinch and save you from illegally grabbing your phone. We would question whether you really need the functionality – not least because you have to pay extra for it.",
    "It’s particularly galling that you need to spend between $5-$10 / £5 / AED 25 per month to have your data - that you’re already paying for - pumped to your device.",
    "If adding data to the Watch was free and just naturally extended to the wrist, it would be fine, but the added cost makes it hard to recommend the LTE version for this reason.",
    "One other upgrade is the addition of music streaming, something that was announced at launch of the Apple Watch 3 but curiously wasn't there at launch.",
    "This feature - if you've paid all the money to have the LTE-enabled variant of the Watch 3 and are paying out extra cash each month to have the data - is actually quite a good addition.",
    "You're getting two things with the new Apple Music streaming capabilities: Apple Music directly, and Beats Radio. These are both accessed the most simply through Siri - you can tap through the Watch to get there, but it's very fiddly.",
    "The easiest way is to ask Siri on the go to play the kind of music you want - whether that's by genre, a playlist you've already created but not synchronized, or just a certain song.",
    "It's not perfect - especially when outside and walking or running - but when it works it's a dream, a futuristic scenario where you command almost any song in the world via a chat with your wrist.",
    "You definitely need to be embedded in the Apple Music system for this to work well - you can't browse playlists on the wrist, for example, and just asking Siri to 'Play some running music' results in some odd choices. However, a running playlist you've already created can be accessed in a second.",
    "Well, we say in a second... far too often Siri would have a problem connecting and would tell us to 'Hold on... I'll tap you when I'm ready'. And then not connect for ages, forcing a retry.",
    "The whole Apple Music streaming setup is brilliant when it works, when you ask for some music you'll enjoy and it plays something you enjoy.",
    "It's a little too glitchy at times to fully feel like you're constantly connected to so many songs - and you'll generally have your phone with you, which is a far better way to access songs, but it's a nice feature and one that will only improve.",
    "Despite the Apple Music streaming capabilities, we still can’t really see a good reason to recommend the LTE variant of the Apple Watch 3, as the notion of not needing your phone to go running was taken care of by adding GPS to the watch with the second-generation model.",
    "Do we want another time when we're always connected? Isn't a workout a time to switch off? And are you willing the pay the much-larger price premium to have the capability to listen to music or use apps away from the phone?",
    "With that in mind you should only consider the Apple Watch 3 LTE variant if you’re worried about not being contactable when out exercising, or inexplicably leave your phone in places.",
    "The design of the Apple Watch has become pretty iconic, in the way that people just know you’re wearing the iTimepiece. When you see a footballer wearing a Fitbit you'll have to peer to see which model it is, but with the Apple Watch it's instant recognition.",
    "Unlike the iPhone, we don't see the need to upgrade the design that much with a watch, and Apple's done pretty well to keep the chassis almost identical given that it's now packing in a new chipset and cellular connectivity in the two sizes of device (38mm and 42mm).",
    "It's done so by integrating the antenna into the screen, which is an innovative way of saving space... although the Watch couldn't have stood to be made any chunkier, such is its square, curved design.",
    "There has been a slight upgrade in the manufacturing process though, as clicking the Digital Crown or the power button feels firmer than on the Apple Watch 2.",
    "This is subtle, but it's something we've noticed every time we've used the Watch 3. Apart from that, the only key difference is on the Digital Crown, which now sports a red dot to signify it's the new model.",
    "It's nothing major, but we did get a question about it when wearing the Watch, showing that people are interested when a new Watch appears.",
    "It’s elegant and light, and while some have yearned for a circular display, the 1.65-inch display (on the 42mm version) is certainly the optimal size and shape for displaying more data – and as mentioned, Apple has brute-forced acceptance of its watch design into the market.",
    "The screen itself, which uses OLED technology, has always been one of the most attractive on the market. It’s clear, vivid and bright, and we never had an issue with not being able to see it when out and about.",
    "Well, that’s not entirely true – the screen does switch itself off to preserve battery when needed, and that means you have to flick your wrist to see the display.",
    "While this is far from ideal, Apple has tuned the algorithm to such an extent that even a tiny little flick will fire up the display – and while this isn’t always as accurate when running, for example, it’s a lot, lot better than we saw with the first version of the Apple Watch.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "6": "Apple Watch 3 price and release date",
    "11": "Do we need LTE?",
    "20": "50 million songs on the wrist",
    "32": "Design and screen"
  },
  "links": {
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "our guide": "https://www.techradar.com/news/apple-watch-on-prime-day-is-now-the-right-time-to-buy-a-new-smartwatch",
    "Apple Watch 2": "https://www.techradar.com/reviews/wearables/apple-watch-2-1323213/review",
    "watchOS 7": "https://www.techradar.com/news/watchos-74-news",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "although some people have already reported it's saved their life": "https://www.techradar.com/reviews/apple-watch-3-review"
  }
}