{
  "source": "https://www.techradar.com/reviews/splitit-payment-solution",
  "title": "Splitit payment solution review",
  "category": "computing",
  "updated": "2021-01-26T18:50:30Z",
  "author": "rob-clymo",
  "summary": "The digital payment solution offered by Splitit gives businesses and customers lots of flexibility to pay",
  "verdict": "If you're in business then offering Splitit’s services for giving customers more buying power makes a lot of sense and avoids a whole lot of hassle too.",
  "pros": [
    "Simple to implement",
    "Encourages greater spend",
    "Can be integrated into your site"
  ],
  "cons": [
    "Some interface tweaks needed"
  ],
  "article": [
    "Splitit is a payment method solution, which allows customers to pay for their purchases using an existing credit card and then split the billing cost into interest and fee-free monthly payments. The great thing about this is that Splitit lets you do it without requiring additional registrations or applications. It’s simple. Businesses can make life much easier for their customers by offering Splitit, which means they can spread out payments via monthly installments using a credit card they already use.",
    "The bonus for customers is that they use the existing credit and Splitit takes the strain, while consumers also avoid credit checks. Splitit reckons that as a result businesses that offer the service can enjoy up to 30% higher shopping cart conversions, which is obviously good for company turnover.",
    "In some ways there are two sides to the pricing story when it comes to Splitit. For consumers using the Splitit service it’s more of a storefront-based position as they will get charged for the installments they choose as an option at checkout. They’ll enjoy 0% interest and no late fees as a bonus of the Splitit system.",
    "However, if you're a business owner looking to implement Splitit into your own e-commerce website then there’s a slightly different tangent. You’ll need to contact Splitit’s sales team, who will then work out a plan for your business, based on its size, turnover and so on, although you can check what’s in store by taking a look at the Splitit pricing page.",
    "Splitit is an innovative twist on credit that allows both businesses offering the service and customers taking advantage of the plan to squeeze the best from flexible payments. Consumers really benefit from the way Splitit is set up and run. This is mainly because everything is pretty much done for them by the business they’re purchasing from and the latter’s agreement that they have with Splitit.",
    "If you're running a business, be it an online e-commerce store or a more traditional bricks and mortar retail outlet combined with online then Splitit can be a real boon too. The main appeal for business users is the way that Splitit can encourage customers to carry out their purchase by taking up the option for splitting payments over time.",
    "One of the big issues with shoppers is that they can often pull out of an online transaction if there is no option to pay by installments. Businesses also gain from the Splitit model as customers tend to spend more if they're able to get flexible payment terms, which this digital payment solution offers. Ultimately, businesses can take advantage of the service because Splitit effectively takes on all of the risk.",
    "If you’ve got plans to integrate Splitit into your e-commerce website then the process for getting set up is actually fairly straightforward. Integrating the system can be done using free tools, including a standard Web API, which effectively allows you to connect to Splitit while you keep the interface in the same style as your existing website.",
    "Alternatively, you’ll get solid performance from using embedded code. This route means that all you're really doing is connecting to Splitit and removing the need for making any significant changes to your website. Business owners can add a button to their checkout page and the checkout form is basically connected to Splitit.",
    "The third option lets you use a plug-in that that works with all of the major e-commerce platforms, including the likes of Magento, Shopify, WooCommerce, PrestaShop and so on. Again, going down this avenue is similarly easy to implement and performance is dependable.",
    "If you’re running an online business and have signed up and implemented Splitit as an option during the checkout process then it’s really pretty simple to use. Basically, the customer will see that Splitit is available as one of their options during the checkout part of a purchase. All the customer needs to do is select it at checkout using an existing payment card while there’s nothing else to do in terms of additional forms.",
    "Better still, the customer will also know right away if they’ll be able to make use of the service. So a customer can spread the cost of buying an item over, say, 12 months and they incur no fees or penalties just as long as they settle each monthly payment on time.",
    "If you’re running a business and need assistance with the implementation of Splitit, or indeed help further down the line, there are numerous options. Spilitit has an impressive Knowledge Center, where you can find out about best practices and gen up on using the system thanks to a raft of tips and insights. If you need more specific help then the Help Center should be the next port of call, with a searchable database that holds the answers for many common queries.",
    "There are also three separate sections, with help available for merchants, along with consumers and a community area that makes for a useful stop too. It’s always possible to raise a support ticket from the website, or contact support using the in-page chat tool.",
    "Splitit seems like a really neat idea that benefits both consumers who want to spread the cost of goods and also businesses that offer it. The latter get the benefit of safeguarded payments, while Splitit handles all of the risk. The digital payment solution is already a hit with many consumers, and indeed plenty of businesses now offer this option.",
    "There are certainly plenty of benefits with Splitit, with customers enjoying the benefit of no credit check, zero interest, no late fees and instant approval. They can also use an existing card plus there is no application or registration needed. For business that want to offer the services of Splitit then the implementation is pretty straightforward and it’s perfect for persuading customers to perhaps spend a little more than they might have done thanks to the flexible option of paying by installments. What’s not to like?"
  ],
  "headers": {
    "2": "Pricing",
    "4": "Features",
    "7": "Performance",
    "10": "Ease of use",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "Splitit": "https://www.splitit.com",
    "billing": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "shopping cart": "https://www.techradar.com/best/best-shopping-cart-software",
    "pricing page": "https://www.splitit.com/pricing/",
    "e-commerce store": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "e-commerce website": "https://www.techradar.com/news/best-ecommerce-hosting",
    "Magento": "https://www.techradar.com/news/adobe-boosts-experience-cloud-with-magento-commerce-purchase",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "WooCommerce": "https://www.techradar.com/reviews/woocommerce",
    "PrestaShop": "https://www.techradar.com/reviews/prestashop-ready"
  }
}