{
  "source": "https://www.techradar.com/reviews/iphone-xr-review",
  "title": "iPhone XR review",
  "category": "phones",
  "updated": "2021-06-07T19:38:06Z",
  "author": "gareth-beavis",
  "summary": "The iPhone XR has decent battery life and lower price tag",
  "verdict": "If you're looking for an affordable iPhone, the iPhone XR is a strong contender boasting the latest software, enough power and surprisingly good battery life... for an iPhone. With the introduction of the iPhone 11, the XR price has dropped further, making it great value for money.",
  "pros": [
    "Great battery life for an iPhone",
    "Attractive array of colors",
    "A great value option"
  ],
  "cons": [
    "Portrait camera mode doesn't impress",
    "Some apps still not fully optimized",
    "Lower-res screen"
  ],
  "article": [
    "The iPhone XR is no-longer the core 'affordable' option in Apple's smartphone line-up, but that's not to say the handset is past its prime. In fact, it remains on sale and has proven itself to be one of the most popular of Apple's phones.",
    "While the new iPhone SE (2020) may now have the crown as the firm's 'affordable' choice, the iPhone XR is still widely available, with a more modern full-screen design than the SE.",
    "With the iPhone 12 series here, including the iPhone 12 mini, iPhone 12 Pro and iPhone 12 Pro Max, it's far from the newest Apple smartphone. But it's still a core part of the company's device line-up, and sold as a still-powerful device between the iPhone SE and iPhone 11. That said, we wouldn't be surprised if it's discontinued before long.",
    "The iPhone XR does one-up the iPhone SE in terms of design however, as it keeps the all-screen display and Face ID notch, while the newer SE reverts to the older iPhone style of chunky bezels above and below the display, a home key and Touch ID fingerprint scanner.",
    "Not only that, but it's also received the latest iOS 14 update - which means it runs the same software as the iPhone 12 range and iPhone SE (2020).",
    "Apple's latest operating system update brought many new features to the iPhone XR, such as redesigned widgets and an App Library, allowing you to make the most of your iPhone experience.",
    "So if you're looking for the latest Apple design language in an affordable package, look no further than the iPhone XR.",
    "Update: iOS 15 will come to the iPhone XR. Apple announced the software at WWDC 2021, revealing all sorts of features, such as the ability to have Android users on FaceTime calls, improvements to Maps, statuses and photo collages in Messages, a redesigned weather app, and more. Look out for it \"this fall\" (likely September).",
    "Announced on September 12, 2018, the iPhone XR launch price started at $749 / £749 / AU$1229 for the 64GB model, $799 / £799 / AU$1299 for 128GB of storage and $899 / £899 / AU$1479 for the 256GB version.",
    "However, it's since received multiple price drops, most recently with the launch of the iPhone 12 range. At the time of writing then, the iPhone XR starts at $499 / £499 / AU$849 for the 64GB model, rising to $549 / £549 / AU$929 for the 128GB one.",
    "Apple is no longer making the 256GB variant, which means you're unlikely to find stock of that model - unless you're looking at a refurbished handset - so if you need a larger storage variant you may want to consider the iPhone 12 or SE.",
    "The best iPhone XR prices however can be had on contract, and the cheapest prices can be found in our best US iPhone XR deals and best UK iPhone XR deals guides.",
    "Compared to the iPhone XS, the iPhone XR was a 'downgrade' in a number of ways to hit a lower price point.",
    "That said, there are a number of key features that are the same: an update to iOS 13 means both handsets have the same operating system, and it's backed up by the powerful A12 Bionic chipset inside.",
    "The notch contains all the same front-facing cameras and sensors as the iPhone XS, and the dual speakers still face the same way when pumping out sound.",
    "To the untrained eye, or someone not holding the iPhone XR and XS side by side, it might even be hard to instantly tell the two apart – but there are a number of key differences that we need to dig into.",
    "While the iPhone XR offers the same 'standard' lens as the XS, it lacks the telephoto second sensor, so has to do some fancy tricks with software to compensate.",
    "This means you aren't able to zoom in as far with the XR, as the telephoto lens offers (relatively) lossless photography at two times zoom, while portrait mode, where the background is blurred out, isn't as effective.",
    "You can still take a portrait shot and have the background attractively blurred to keep the focus on the subject, but unlike with the iPhone XS, you can’t take pictures of objects and animals in the same way.",
    "This is due to the fact the software can’t identify those subjects as easily from the single sensor, where the additional hardware on the more expensive XS is able to draw on more info.",
    "Apple is never one to shy away from some marketing hyperbole, and the iPhone XR comes with a different type of LCD, a screen that's been designed to allow it to make this curved, 'all-screen' display.",
    "The effect is much like the LCD screens Apple has made before, to be honest, as they’ve always been colorful and sharp, but with the 'Liquid Retina' display things are supposed to closer to the high-end OLED screen.",
    "We'll delve more into the quality of the screen later in this review, but it's one of the key differences you'll want to consider if you're thinking about going for the less-costly iPhone.",
    "There’s one way to know if you use a feature on an iPhone, and that’s to take it away, and see if you miss it. Anyone coming from a later-series Apple handset will have had access to 3D Touch, where pressing the screen harder opens menus or activates different features in apps.",
    "This feature has been removed for the iPhone XR, presumably to save money – instead you have to do a 'long press' to do the same thing. So if you ever accessed shortcuts by pushing harder on an app, or opened the torch with a harder prod on the lock screen… well, that’s gone.",
    "We didn't realize how much we used that feature before – and it's irritating to not have something that feels like a real button to open the camera – but it doesn’t take long to get used to the alternative… it just feels a bit less premium.",
    "The iPhone XR has a thicker design, with chunkier bezels around the side of the phone – hold it side by side with an iPhone XS and you’ll feel it’s clearly the cheaper model, with a thicker feel in the hand.",
    "However, looking at it and handling it in isolation you’ll just feel that it’s a smooth, rounded design that apes the popular form of the iPhone 7 or iPhone 8 – basically, the iPhone XR is the all-screen version of those handsets, bringing a screen the size of those on the iPhone 7 Plus or 8 Plus in a form factor that’s more akin to the smaller models.",
    "The iPhone XR is the first in a long time to come in so many colors: (product) RED, which is the sample we have, blue, white, yellow, coral and black - to some, this would feel like the natural successor to the iPhone 5C.",
    "It's a nice look, although it would be nice to have some more flashes of color on the front of the phone too.",
    "If you're thinking of buying an iPhone from a fashion point of view, this could well be the way to do it, with the colors chosen impressing when we checked them all out at the launch event.",
    "Apple believes you'll be able to get 90 minutes more battery life out of the iPhone XR than the 8 Plus, which is a big jump in real terms.",
    "Well – and we don't want to spoil the surprise a little later – we'd say it's even better: the iPhone XR finally achieves the holy grail of all-day battery life in an iPhone. A year on, and the iPhone XR is still regularly getting through a day on a single charge.",
    "If you play a lot of games, or watch a lot of videos, you'll likely need to charge it before bed, but on average the iPhone XR battery life is reliable.",
    "Perhaps that's giving Apple a little too much credit – after all, there are plenty of Android phones out there that can utterly smoke the iPhone range for power longevity, giving you far longer between charges.",
    "Apple has offered terrible battery life for years, incrementally improving it to be 'just good enough', and the iPhone XR is the first iPhone we haven’t had a real worry about day to day."
  ],
  "headers": {
    "8": "iPhone XR price and release date",
    "12": "Key features",
    "16": "A single camera",
    "20": "The Liquid Retina screen",
    "23": "No 3D Touch on the iPhone XR",
    "26": "Chunkier design",
    "28": "Multiple colors",
    "31": "Improved battery"
  },
  "links": {
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "best US iPhone XR deals": "https://www.techradar.com/deals/best-iphone-xr-deals",
    "best UK iPhone XR deals": "https://www.techradar.com/deals/iphone-xr-deals"
  }
}