{
  "source": "https://www.techradar.com/reviews/ueni",
  "title": "UENI website builder review",
  "category": "computing",
  "updated": "2021-06-09T04:20:34Z",
  "author": "steve-paris",
  "summary": "Would you let someone else design your business site for you?",
  "verdict": "UENI is slow to set up with limited functionality and lacks some basic features but this website builder does produce clean looking sites.",
  "pros": [
    "Produces clean sites",
    "Nice booking options"
  ],
  "cons": [
    "Takes days for the service to get the site ready",
    "Extremely limited editing options",
    "More complex to edit than it should be"
  ],
  "article": [
    "UENI offers a website builder service that promises to “grow your small business”.",
    "Plans start with a free option called ‘Starter’ which includes up to 10 bookings and/or leads, up to 5 images in your gallery, and a maximum of $250 in sales, per months.",
    "Basic (not available if you pay monthly), includes an SSL certificate, 2 email addresses, some access to the premium website design service, unlimited bookings, and up to $500 in sales. You can also get VIP priority support. This ill cost you $129 annually.",
    "The Plus plan, gives you unlimited bookings, sales, and images. It comes with full access to premium website designs, $10 in ad spending, and access to a 1-on-1 call with a website expert and a call to help you grow your business. All for $39 per month or $349 per year.",
    "Finally, we have Reputation ($499 per year or $59 per month) which opens up all other features, including the Reputation Manager, and Request a Review services.",
    "We’ll be taking a look at the Free plan and see if it’s worth exploring further.",
    "Choosing that plan lets us straight into the creation process. You set up an account and answer a series of questions so that UENI better understands your business. We did encounter a glitch: even though we put our phone number as coming from the UK, we were still forced to choose a US state as part of our address. Somehow, choosing one at random appeared to let us through to the next series of questions.",
    "Another limitation is when you’re asked what you want to do with your site - you can’t for instance choose ‘blog’ and ‘online sale’, or any other option: you can only select one, which feels very limiting.",
    "And after having answered all their questions and supplied any and all images, links to a video, maybe a little bit of text about your business, you’re ready to go!… in “three days”.",
    "Wait - what?",
    "This is because your site is being designed by a human being, not an automatic computer-driven template, but it’s nevertheless highly unusual… On the plus side, an advertised three day wait is but a paragraph away for you, dear reader…",
    "Last time we checked UENI out, it took a little over 24 hours for our site to be ready. This time it was nearly a five day wait, although to be fair, that included a weekend. In an online world accustomed to instant gratification, it’s a really, really long time to wait.",
    "Let’s take a look at the results…",
    "With your site ready, you’re taken to your Hub on the UENI website. You can use it to go to your website, or, more importantly for us, to click on ‘Edit Website’ and start tinkering.",
    "At least that’s what we were hoping.",
    "Yes, you have a choice of themes, but of the four on display, only one is available with the free plan - it’s possible to click on the other three and see what your site will look like to give you an idea of it’s worth spending money on.",
    "Each theme has a choice of colours you can select. These dual colour options are different for each theme. ‘Origins’ (the free one), has 9, but the other three have 5 each.",
    "As for fonts, just like the colours, they come in combinations of two, and you have 30 pairs to choose from, but only one such pair is free. All others are premium.",
    "OK, so our theme customisation is extremely limited, how does editing the content of your page fare?",
    "You page is divided into sections. Each can be accessed by a navigation bar located at the top. This doesn’t take you to a new page, but is a quicker way to get to that section rather than scrolling down a very long page.",
    "Your options are pretty limited here too, and not very intuitive. You can alter the description, and add new photos, which is great because most of the current text is AI generated. There’s nothing wrong with the wording per se, but it doesn’t feel unique, and you may feel a little tweaking is necessary to make it more you. All this can be done via the sidebar on the left.",
    "Basic formatting such as Bold, Italics, Underline, and bulleted or numbered lists are accessible, but if you want to add a hyperlink, sorry, that’s extra, and the service will immediately prompt you to upgrade.",
    "What was a bit puzzling for us was the photos UENI chose to use. We elected to create a site for an IT service, and had uploaded several shots during the initial process. But weirdly, once the site was done, none of the photos we’d uploaded we present. Instead, stock images was used. Thankfully, changing this is easy. You find the shot in one of the sections, click on Update, and choose a different one.",
    "There is no link to an online royalty free library, so there still was no explanation where those mysterious photos came from. Your only options are to upload them from your computer or paste the URL if the shot is already available online.",
    "There is no image editing options, nor can you select which section of the image to crop - that’s done automatically for you.",
    "The inability to edit directly on the page, when so many competing services allow you to do, is frustrating, and reminds you constantly that you can do your customising work quicker and better elsewhere.",
    "Although creating an e-commerce store is not part of the free plan (some other services allow you to try this part of their offering with a handful of products), setting up services is.",
    "We did like the ability to book a session which is toggled very easily, and is part of the free tier, but that’s about all we liked about this service.",
    "We tried to locate any kind of blogging tool but failed. No section hinted at the possibility, nor were there any info in the Settings - which is limited to choosing your currency, adding a favicon, connecting an existing domain name, and editing your shopping cart (these last two can only be used if you upgrade to a paid plan).",
    "But no blogging tool.",
    "So we hopped on to the Help Centre where we did find some information: blogging appears to only be available with the ‘Classic’ theme. This feels remarkably restrictive: what if you want a blog but prefer another theme? Add the fact blogging is only available on a paid plan when so many other services offer that functionality for free, and you’ve got a very disappointing experience.",
    "This service is supposed to make it easy to set up an online presence, but we found it frustratingly slow to get started, difficult and even restrictive to edit, and incredibly limiting in its options. Despite its apparent simplicity, it does require a certain level of computer experience to get what you want out of it, which seems to be a contradiction, since those confident enough to do this would likely use a different service, and those that aren’t would get lost on their own here.",
    "We feel this is more of a curiosity than anything else."
  ],
  "headers": {
    "6": "Getting started",
    "11": "Interlude",
    "13": "Themes",
    "19": "Sections",
    "26": "Services",
    "28": "Blogging and support",
    "31": "Final verdict"
  },
  "links": {
    "UENI": "https://ueni.com/en-us/pricing/",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Starter": "https://ueni.com/en-us/pricing/",
    "Basic": "https://ueni.com/en-us/pricing/",
    "Plus plan": "https://ueni.com/en-us/pricing/",
    "Reputation": "https://ueni.com/en-us/pricing/",
    "online royalty free library": "https://www.techradar.com/best/free-stock-photos",
    "e-commerce store": "https://www.techradar.com/news/the-best-ecommerce-platform"
  }
}