{
  "source": "https://www.techradar.com/reviews/hitman-3",
  "title": "Hitman 3 review",
  "category": "gaming",
  "updated": "2021-01-19T17:32:38Z",
  "author": "james-peckham",
  "summary": "Agent 47’s return offers more classic locations",
  "verdict": "Hitman 3 adds little twists on the series' formula, but doesn’t stray too far from what made the 2016 reboot and its sequel great. The stealth, combat and the way you murder your victims remain almost identical to previous iterations, but the new locations include some all-time greats. Hitman 3’s locations mix up the formula with more experimental objectives, which see you doing more than just murdering your victims in exotic locations like Argentina, China and Dubai. The storyline is more gripping than previous installments, too, with a bigger focus on Agent 47’s journey and relationships rather than all the focus being taken up by the story of your targets. This final entry in the trilogy gave us some of the greatest jaw-drop moments that we’ve ever experienced from IO Interactive’s murder simulator.",
  "pros": [
    "Great living and breathing locations",
    "Looks fantastic on next-gen",
    "Tweaks to the expected formula"
  ],
  "cons": [
    "Cutscenes don’t look the best",
    "Could be more replayable",
    "New camera tool doesn’t add much"
  ],
  "article": [
    "Hitman’s stealth action hybrid formula has been on a tremendous journey over the last decade. After the overly-scripted misstep of Hitman: Absolution in 2012, IO Interactive took the series back to its roots with 2016’s sublime reboot, which reimagined Hitman as a densely simulated sandbox game that just happened to encourage you to murder people.",
    "Hitman 3 continues on that road with the same engine, mechanics and more from the 2016 reboot - much the same as 2018’s Hitman 2. While these core elements haven't really changed, the mission objectives are a little more experimental this time around, offering the player types of experiences they haven't had in Hitman before. This means fans are kept on their toes more so than in the last installment.",
    "It also features some of the best levels of the entire trilogy, with highlights including a densely-packed nightclub in Berlin and a murder mystery set in Dartmoor, England that sees Agent 47 take on the role of detective as well as assassin. Each of these missions, and a couple of others in the game, offer additional challenges that keep the Hitman template fresh.",
    "Hitman 3 isn't the kind of sequel that reinvents the series, but it’s very likely to satisfy you if you’ve previously enjoyed these games and are happy with some minor tweaks rather than a drastic overhaul.",
    "Plus, if you’ve never played a Hitman game before, this is the perfect moment to jump in. Hitman 3 allows you to play every past level in the trilogy from its menu screen, so you’re able to jump from maps in 2016's Hitman all the way through to this game's final level in one big download – assuming you already own all three games.",
    "If you’ve played Hitman or Hitman 2, you’ll know all the trappings you’ll find here. There are six levels to explore and targets to kill in each one, and while you’ll be able to complete the game in under six hours with ease, the focus here is on replayability with the intention being that you'll want to return to every area and truly explore the possibilities of each setting.",
    "Mild spoilers are coming up for the locations you’ll be visiting on your murder simulation holiday, but Hitman 3 takes us to even more exotic locales. While no single level took our breath away like the expansive and possibility-filled Sapienza in the original Hitman reboot, these are interesting backdrops that add a few entries into the pantheon of great Hitman levels.",
    "The locations themselves aren’t as thrilling as what the game does with these new places. IO Interactive has created a few different scenarios you haven't seen in the past two Hitman titles, which find new and exciting ways to deliver story to the player.",
    "You’ve likely seen Dubai - the game’s first mission - in the extended marketing for Hitman 3, but the game also includes locations like Dartmoor in England, Berlin in Germany and a wine vineyard in Argentina.",
    "Dubai doesn’t change the Hitman model much, and you’ll find after a few playthroughs that it feels like a reprise of the original game’s Paris level with a similar structure and two separate targets that are hard to access.",
    "The joy of working out how to get close to each target remains, though – whether you do it by your own means, or you follow the game’s clear storyline pathways that give you easy access to your marks.",
    "The game comes into its own with missions like Dartmoor, which sees you taken to a mansion in the middle of the English countryside for a murder mystery plot that - if you choose it to - allows Agent 47 to embody Columbo and take on the role of a detective.",
    "Think half Knives Out, half Agatha Christie - with your own plot to murder your target on the side. Your first playthrough of this is likely to be among your highlights of the entire series.",
    "This mission doesn’t feel similar to any other we’ve played within Hitman before. Without giving anything away, this level offered up a solution to its main objective that genuinely made our jaws drop. It's worth playing the game just to find it.",
    "Dartmoor shows just how much mileage there is left in Hitman's murder puzzles, and how a few twists can reinvigorate the series' long-established formula.",
    "Berlin is up next, and again it mixes things up with a cat-and-mouse-style plot that sees you taking down multiple targets in a German nightclub. The location itself seems based on the capital city’s infamous Berghain nightclub, and we found ourselves taking to the dancefloor and enjoying the setting before even garroting a single target.",
    "Further levels include Argentina and China, plus a final mission that takes place in the Carpathian mountains, but we’ll let you explore those levels for yourselves rather than offer any more hints of what to expect.",
    "Still, the overall approach to mission design means they're just different enough when it comes to objectives that you'll never feel like IO Interactive is repeating itself. Dartmoor's murder mystery is a notable example of that, but Berlin's unusual approach to tracking down your assassination targets is innovative, too.",
    "Almost every mission in Hitman 3 wants to try something different, and they mostly succeed.",
    "While the story-led format of some levels means that they aren't as exciting to replay as past favorites, the game does tweak elements for return playthroughs to keep them feeling more sandbox-y.",
    "It’s very unlikely you’ve been playing the recent Hitman games for the story, but those who have will be pleased to know that Hitman 3 sees IO Interactive ramping up the narrative element for the final installment in the World of Assassination trilogy. The developer has even switched back to full blown cutscenes to tell the tales of Agent 47 and Diana, rather than the comic book-like structure found in Hitman 2.",
    "The cutscenes aren’t anywhere near as impressive-looking as the core game itself, which takes the power of next-generation consoles and runs with it, throwing in some phenomenal lighting effects, especially in Berlin’s nightclub scenes and China’s neon-lit streets.",
    "The general level of detail in Hitman 3's levels is extremely high, with Dartmoor standing out as a true highlight. We found ourselves exploring the mansion’s great halls, taking in the knick-knacks sprawn over the walls and even admiring some of the artwork by staircases throughout the setting.",
    "While the story may not have been the highlight of previous games, we found ourselves connecting with these characters on a level we haven’t done before. The writing has always been strong throughout this reboot of the franchise, but this takes the story to new heights and we found ourselves genuinely excited to see how it all ends.",
    "Hitman 3 does more to mix up the formula of these games than its previous installment, and while it doesn’t step too far outside its comfort zone, many returning fans will be happy with the new locations here. The levels are just different enough when it comes to solving them that this third game avoids feeling repetitive.",
    "As a final bow to this trilogy of excellent games, Hitman 3 offers some all-time classic levels and a thrilling storyline. While some of these missions aren't instantly replayable as Sapienza or Miami from past entries, it still offers plenty of evidence that Agent 47 is truly at the top of his game."
  ],
  "headers": {
    "5": "More globetrotting",
    "15": "The Berghain Butcher",
    "20": "New focus on story",
    "24": "Verdict"
  },
  "links": {
    "Hitman 2": "https://www.techradar.com/news/hitman-2-hands-on-dropping-drug-lords-in-colombia"
  }
}