{
  "source": "https://www.techradar.com/reviews/brother-dcp-j1140dw-3-in-1-multifunction-printer",
  "title": "Brother DCP-J1140DW 3-in-1 multifunction printer review",
  "category": "computing",
  "updated": "2021-10-27T22:04:53Z",
  "author": "jim-hill",
  "summary": "Mini business printer for the micro office",
  "verdict": "Brother’s budget 3-in-1 prints well and crams in most of the key business features, but its cartridges are less cost effective.",
  "pros": [
    "Prompt printing",
    "Touchscreen interface",
    "Competitive price",
    "Easy set-up and operation"
  ],
  "cons": [
    "No multipurpose input",
    "No front USB port",
    "No Ethernet port",
    "Small inkjet cartridges"
  ],
  "article": [
    "With office workers around the world responding to the pandemic by working from home, printer brands have responded by offering more models aimed at the home office. Brother has unveiled six ‘mini business’ printers for all kinds of home workers. This compact personal all-in-one is aimed at those who find they now need to accommodate a printer where space is limited.",
    "The Brother DCP-J1140DW is a 3-in-1 multifunction printer costing a very reasonable £154.80 (about US$213, AU$284) with a footprint not much larger than a sheet of A4 paper. There’s no fax facility, but it will print, scan and copy in full resolution and at quite fast speeds, while essential features such as an auto duplex mode, Wi-Fi with Wi-Fi Direct and AirPrint are all built in.",
    "Sadly, Brother is not bundling any of its economical oversized ink cartridges with this budget model. Unlike the upper-end Brother MFC-J4540DW which came with enough ink for 1,500 colour pages, this one will give you just 200. As with any affordable cartridge-based inkjet, your ongoing running costs will be the biggest expense, so let’s find out if it’s worth the initial saving.",
    "The Brother DCP-J1140DW is both compact and lightweight for a multifunction device and could conceivable be packed away in a drawer when not in use. It’s a very conventional design with the lid lifting to reveal the glass A4 scanner bed and the inkjet cartridges accessible through the front flap.",
    "There’s room for 150 sheets of A4 paper in the main tray and 50 sheets in the output tray. There is no ADF (automatic document feed) and no single-sheet multifunction feed. If you really need that, then the slightly more expensive DCP‑J1010DW 4-in1 is the model for you. What you get here is a decent 6.8cm touchscreen interface, which is quite a bonus at this price point.",
    "The only socket on show is for the power cable because there is no Ethernet port and the port for the USB data cable is actually located under the hood of the machine to stop the cable from being accidentally unplugged.",
    "Overall it looks and feels like a low budget model, however, the neat cable management, the dust-proof design of the paper cassette and the colour touchscreen all combine to lift this printer above most other models competing at this level.",
    "The Brother DCP-J1140DW ticks off most of the features you might need in the office and has respectable specifications. It can print both sides of the page (auto duplex), it has Wi-Fi built in with AirPrint and Wi-Fi Direct catered for. There’s a decent companion app available for iOS and Android devices that makes printing away from home easy. It can print on a wide variety media up to A4 in size and that includes photo paper and heavy paper stock up to 220gsm in weight.",
    "What it lacks is a multipurpose tray for feeding in single sheets of paper, which means you have to reload the main paper tray each time you want to print on an envelope or a sheet of headed paper. There’s no USB Host port at the front either, so no printing directly from a USB flash drive. There’s no Bluetooth or NFC connectivity either, although those are luxuries usually found on more expensive machines anyway.",
    "It prints quite quickly at 17ipm (images per minute) in mono and 16ipm in colour, while the first page out time of 6 seconds is impressive. The print resolution is respectable at 1,200 x 600dpi and the 128MB of memory is ample. It doesn’t manage the enhanced print quality that you would expect from a good photo printer, but it’s fine for a business printer where printing on photo paper is not the priority.",
    "The four inkjet cartridges are quite small and will give you only around 200 colour pages. A replacement set of standard ink cartridges will buy you another 200 pages for around £30 (US$41, AU$55) which is not a very competitive per page cost. Choosing Brother’s extra high yield carts will bring that cost down a little.",
    "It takes only a few minutes to install the four inkjet cartridges and get the printer online. The touchscreen interface makes it easy to input the date and time and the password for your wireless network. The only tricky part is typing on the cramped touchscreen keypad.",
    "The setup process includes the chance to print out a test page to check that all your inkjets are firing. You can also scan the page so that the printer itself can check the nozzles are aligned correctly. Our sample was printing perfectly right away.",
    "Like most of Brother’s printers, the DCP-J1140DW is supported by the Brother Mobile Connect app available for iOS and Android which gives you convenient remote control. You can use the app to print remotely from the cloud wherever you are in the world, or check the printer’s ink levels at any time. All printers have a companion app, but this one is particularly strong.",
    "The Brother DCP-J1140DW put in an admirable performance for such an inexpensive machine. The claimed print speed of 17ppm for single-side black and white pages is accurate and that’s fast enough for the needs of a home office. And it doesn’t slow down much for colour documents or duplex printing, so this is not one of those annoying budget printers where you have to wait ages for results.",
    "Pages of black and white text appear with uniform boldness and clarity. Individual characters are darker than you get from a laser printer and almost as sharp. There was no smearing visible under the magnifying glass. Colour documents looked equally crisp and smudge-free although the dye-based coloured ink cartridges are not especially bright, so don’t expect the colours to pop.",
    "Photos printed on glossy photo paper look perfectly acceptable. The colours are not the brightest and the resolution is not enhanced to the levels you find on dedicated photo printers, but the overall effect is very pleasing. You can load any kind of photo paper into the main paper tray, but when you come to select your paper type from the menu, the list is limited. Where a photo printer will ask if its matte, gloss or high gloss, the Brother has only one option.",
    "When copying using the flatbed scanner, you’ll find your duplicates are accurate enough, but just a little paler. Overall the performance was very good for the price point, with no problems or paper jams during the test. It printed quite quickly and quietly and was easy to use thanks largely to the touchscreen. The feature that we missed the most was a multipurpose tray for feeding in individual sheets of paper or envelopes.",
    "If you find that you need to print work documents from home, the low-budget Brother DCP-J1140DW could be the ideal personal printer for you. It’s not exactly innovative and still relies on expensive cartridge-based ink rather than refillable tanks, but it does have most of the features you need to work from home. The touchscreen interface, convenient cable management and above average all-round print quality give this all-in-one an edge at the budget end of the business printer market.",
    "We've also featured the best all-in-one printer"
  ],
  "headers": {
    "3": "Design and build",
    "7": "Features and specifications",
    "11": "Setup and operation",
    "14": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "printer": "https://www.techradar.com/news/best-home-printer",
    "Brother MFC-J4540DW": "https://www.techradar.com/reviews/brother-mfc-j4540dw-4-in-1-colour-inkjet-printer",
    "USB flash drive": "https://www.techradar.com/news/best-usb-flash-drives",
    "best all-in-one printer": "https://www.techradar.com/news/best-all-in-one-printer"
  }
}