{
  "source": "https://www.techradar.com/reviews/duda",
  "title": "Duda website builder review",
  "category": "computing",
  "updated": "2021-06-08T05:17:10Z",
  "author": "mike-williams",
  "summary": "Personalize your website the way you want it",
  "verdict": "Duda is a good website builder with great opportunities to personalise your website. It has an impressive selection of tools, and you can try most of it free for 14 days.",
  "pros": [
    "Excellent personalization",
    "Offers ecommerce add-ons",
    "Professional templates"
  ],
  "cons": [
    "Limited integrations in the Basic plan",
    "Some page editing issues"
  ],
  "article": [
    "Launched in 2010, Duda is a popular website builder which allows users to create fast, modern and mobile-friendly sites. Pay particular attention to that mobile-friendly aspect. Unlike some of the competition, that doesn't just mean 'we have a few mobile-oriented templates' – Duda was designed from the very beginning with full support for building quality responsive websites.",
    "Their site includes plenty of information about the service and does a good job helping you understand its features before you sign up. You don't just get a few thumbnails of templates, for instance: viewers can browse everything the service has to offer and preview each template in desktop, tablet or mobile views.",
    "Duda includes a 14-day free trial with the features in the Team plan. You can test out their service without even sharing your credit card information. Four plans are available:",
    "Basic costs $19 per month (or the equivalent of $14 per month when paid yearly). It includes one website, email support for all your questions, and HTTPS encryption. You can also create a multilingual website and choose from tons of free (or premium) images. This plan is great for personal websites, blogs, or freelancers who want to share their ideas all in one place.",
    "Team costs $29 per month (or $22 per month when paid yearly). It includes all the features in the Basic plan plus the ability to add up to four team members (who can edit your website with you). This plan has additional client management features including analytics and marketing materials.",
    "Agency goes up to $59 (or $44 per month when paid yearly). On this plan you can create up to four websites, collaborate with up to 10 team members, and design customised widgets.",
    "And then there’s the Custom plan. The price is bespoke for a totally customised service, and you’ll need to contact Duda directly to let them know what features you’re looking for.",
    "When you start your trial, and after you’ve verified your email address (par for the course these days), you’ll be asked about your business - are you a freelancer, a design agency, are you a web designer, or developer, that sort of thing. You’re then promptly sent to Duda’s template selection.",
    "It’s incredibly easy to locate the theme you’d like from Duda’s long list. It’s even possible to preview its look on any type of device with just a click. Once you’ve found the template that’s right for you business, Duda will start setting it all up for you.",
    "The interface is mainly the site you’re building. To the left is a toolbar from which you can add additional pages, widgets and more content, and at the top is a more utilitarian section, where you have preview controls, undo and redo buttons and a menu to navigate through your pages, among others.",
    "A thoughtfully designed editing interface keeps most operations simple and intuitive. Hover your mouse over any control and handles and buttons appear to resize it, delete it, add a new section and more. Right clicking any page element displays a detailed menu of actions you can take, including changing alignment and applying various animations. Many elements are active in the editor, too, so for instance you can switch pages simply by clicking the appropriate item in your navigation menu. It's all very natural and comfortable to use.",
    "Adding additional components to your page (known as widgets) is a simple matter of dragging and dropping. As you move onto the main preview section, you’ll notice parts of the page that highlight in light blue, indicating where the widget will be inserted when you release the mouse button.",
    "Browse the interface and you'll find a few surprising extras. A Personalise feature can modify site behaviour depending on the visitor's device, location, time, the number of times they've visited you, and more. You could set up promotions to run at specific times of year or display a notification bar for specific users.",
    "The blogging feature offers you pretty much everything you need. You have the ability to add a featured image, your editing tools are as you’d expect, with a choice of font type, size and weight, links, bullets, numbers, etc. If you need it, you probably got it. You can also include images, set up comments and schedule when you want your post to be published. It’s a good, all-round blogging tool.",
    "The e-commerce side of things is also pretty comprehensive, with numerous options available to you to fully customise each page to suit your needs.",
    "Your media library is where you can of course upload your own images, and we like the fact all the photos are stored in a central repository, meaning you don’t need to upload them multiple times if you use the same image in more than one place on your site.",
    "But if you don’t have your own shots, you also have access to stock images, either free ones or premium ones, and we did appreciate that those two categories were neatly divided, so if you’re on a budget, you won’t bump into photos you love but can’t afford.",
    "Unlike most website builders, Duda also comes with a good array of image editing tools. You have numerous Instagram-like filters, and access to regular image adjustment tools (such as brightness, gamma, exposure, etc). There’s even text, stickers and paint tools available. It’s pretty impressive.",
    "Video can also be added to your site, as long as it’s hosted on YouTube, Vimeo or Daily Motion (we don’t see many services that support Daily Motion, so this is a win for flexibility and versatility).",
    "Duda is a very user-friendly website builder with some great personalisation options. You can purchase e-commerce add-ons if you want to create a web store, and the Team plan allows you to add up to four members to edit your site. Check out the free trial to explore what this service has to offer.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Getting started",
    "9": "Interface",
    "13": "Blogging and selling",
    "15": "Media",
    "19": "Final verdict"
  },
  "links": {
    "Duda": "https://shareasale.com/r.cfm?b=523421&u=1338591&m=49768&afftrack=trd-us-1282154875085702000&urllink=https%3A%2F%2Fwww.duda.co%2F",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "14-day free trial": "https://shareasale.com/r.cfm?b=523421&u=1338591&m=49768&afftrack=trd-us-9726054108347849000&urllink=https%3A%2F%2Fwww.duda.co%2Fplans",
    "Basic": "https://shareasale.com/r.cfm?b=523421&u=1338591&m=49768&afftrack=trd-us-6876387302444259000&urllink=https%3A%2F%2Fwww.duda.co%2Fplans",
    "Team": "https://shareasale.com/r.cfm?b=523421&u=1338591&m=49768&afftrack=trd-us-2118606911400014300&urllink=https%3A%2F%2Fwww.duda.co%2Fplans",
    "Agency": "https://shareasale.com/r.cfm?b=523421&u=1338591&m=49768&afftrack=trd-us-3782036600747540000&urllink=https%3A%2F%2Fwww.duda.co%2Fplans",
    "Custom": "https://shareasale.com/r.cfm?b=523421&u=1338591&m=49768&afftrack=trd-us-2360195756124580000&urllink=https%3A%2F%2Fwww.duda.co%2Fplans",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "stock images": "https://www.techradar.com/best/free-stock-photos"
  }
}