{
  "source": "https://www.techradar.com/reviews/canon-pixma-gm4050",
  "title": "Canon PIXMA GM4050 review",
  "category": "computing",
  "updated": "2021-04-07T22:43:31Z",
  "author": "jim-hill",
  "summary": "Mono MegaTank fills its niche well",
  "verdict": "It’s slow and Apple-unfriendly, but with so much ink in the box, mono printing was never so economical.",
  "pros": [
    "18,000 page yield",
    "35-sheet ADF",
    "Optional colour upgrade",
    "Decent print quality"
  ],
  "cons": [
    "Slow to print",
    "No photo paper",
    "Not Mac compatible",
    "Small display"
  ],
  "article": [
    "Canon has extended its cartridge-free inkjet line with two mono MegaTank models. The Canon PIXMA GM4050 is an A4-sized multifunction printer equipped with a scanner, ADF, Wi-Fi and all the other features you might need in a small office, except colour. And you can have that too if you buy the optional tri-colour cartridge.",
    "In essence though, this is a basic, black and white multifunction device whose headline feature is the remarkable page yield. One bottle of black ink gives you 6,000 printed pages and there are three bottles in the box. Costing around £300 (US$411, AU$538) that makes this inkjet more economical to buy and run than most lasers. It looks at first glance like this relatively affordable all-in-one device really does have it all, but there are a few features missing. We should probably warn you from the start that it is not Mac compatible.",
    "The Canon PIXMA GM4050 attempts to hide its bulk with curved corners and a fairly low profile (it’s 23cm high), but it’s still a considerable lump of black plastic. It’s certainly not going to win a Red Dot design award like its key competitor, the Epson EcoTank ET-M2140.",
    "Sticking with the more traditional form factor, Canon has placed the ADF (automatic document feeder) on top of an A4-sized flatbed scanner, which is on top of the printer. If you are only interested in the printer section, then the Canon PIXMA GM4020 is the model for you.",
    "The whole control panel folds outwards, making it easier to see when you are standing over the printer. However, the display is a very small two-line affair, which is hard to read from any distance.",
    "There are connections for an Ethernet cable and USB data cable at the rear, but there’s no front USB port, or memory card slots. The first thing you notice about the design is probably the clear plastic reservoir in the front left corner which makes it easy to see how much black ink you have left.",
    "If this were a colour model, like the Canon PIXMA G6050, there would be three more tanks on the right hand side, but being mono, there’s just an empty space in this case. This space is just large enough to store a spare cartridge. That’s right, Canon’s refillable MegaTank printers are not completely cartridge-free. They use a small small black cartridge that is topped up by the bottled ink. You also have the option of installing a tri-colour cartridge beside it when you want to upgrade to colour printing.",
    "The Canon PIXMA GM4050 is a three-in-one multifunction device, which is to say that you can print, scan and copy. There’s no fax facility, but we’re guessing that’s not going to be a problem for the majority. It also offers a 35-sheet ADF for scanning or copying multiple documents. Wi-Fi is built in, there’s an auto duplex mode, a two-line display and the ability to print on paper sizes up to A4, including envelopes.",
    "This is not a premium model, so there are a few features missing. There’s no touchscreen for example, no front USB port for walk-up printing, no NFC or Bluetooth connectivity and sadly, no dual-side scanning. And unlike other inkjets, it can’t print on photo paper. As mentioned, this model is primarily intended as a mono printer, although you can add a tri-colour cartridge if the need arrises.",
    "Canon supplied an optional CL-541XL cartridge, costing around £27 (US$37/AU$48) so we were able to test its colour printing credentials too. It’s worth noting though, that this 15ml cartridge is capable of printing just 400 colour pages, while a bottle of black ink, costing £13 yields 6,000 mono pages. So that’s 7p per colour page and 0.2p per mono page.",
    "Some specifications are impressive, like the terrific 18,000 page yield with the included black ink and the 250-sheet paper capacity. Other specifications, like the slow print speed and limited print resolution are disappointing. With no AirPrint support and no drivers for Mac, Apple-users should stop reading now. There’s no Google Cloud Print either by the way, only Canon’s own PIXMA Cloud Link. To print from a smartphone, you will need to download the free Canon PRINT app for iOS/Android.",
    "Setting up this MegaTank printer is no more difficult than the average cartridge-based printer and the instructions, available in the box or via a QR code sticker on the printer itself, are very clear. It’s just a case of removing all the pieces of orange transport tape and then loading your paper and ink.",
    "Pouring one bottle of ink into the reservoir was a painless and splash-free process for us, and it already feels like a much better system than the old overpriced inkjet cartridges.",
    "Getting the printer to join our local Wi-Fi network took us much longer. The helpful companion app allows you to type your Wi-Fi password into your phone rather than trying to do it via the printer’s crude control panel, but for some reason we made more than ten attempts before the connection was made. If all else fails, there is at least a USB port available at the back of the printer, but note that a data cable is not included in the box.",
    "In operation, the Canon PIXMA Cloud Print is quite quiet and rather slow. Pages are printed at a reasonable speed, but the processing and turning over of each page is ponderous. The two-line display is hard to read and without touchscreen control, it’s not the easiest multifunction printer to operate. Luckily it was also printed reliably for the duration of the test, so there was not much need to use the printer’s own interface anyway.",
    "The Canon PIXMA GM4050 performed well in most our tests, particularly when it came to pages of text. Type looks exceptionally crisp and bold thanks to the use of a pigment black ink. The Canon prints words with the consistency of a laser printer, but with bolder, darker type. If only it could achieve the speed of a laser printer this would be the best of all worlds. Unfortunately the print speed is very slow even for an inkjet and the claimed 13ipm (imprints per minute) is optimistic.",
    "Black and white photos are handled reasonably well. They look more realistic than many laser printers, but not as sharp as most inkjet printers. The Canon’s resolution is actually relatively low for an inkjet at 600 x 1,200 dpi. That’s fine for printing text, but barely enough for photos. Our test images also suffered from horizontal banding. You cannot load photo paper into this printer, so photos that are very dark end up soaking your paper in black ink. Luckily Canon’s bottled ink is relatively cheap, but if this were a cartridge-based inkjet, you would think twice about printing photos at all.",
    "Canon calls the PIXMA GM4050 as a mono printer and that’s what the M stands for in its model name, but with the optional colour cartridge installed, we were able to print all of our usual full colour test pages. It still won’t function as a photo printer, however, because its not compatible with photo paper and it cannot do borderless printing either. What it can do is print decent colour documents on those occasions when you really need colour. The results are rather good, considering that colour was always an afterthought for this model. The pallet is muted rather than bold, and there is visible horizontal banding, but it’s fine for most purposes. If you intend on printing more than just the occasional colour document, however, we would point you towards the more expensive Canon Pixma G6050, which uses bottled colour ink to great effect.",
    "As a photocopier, the Canon PIXMA GM4050 proved reliable, making faithful copies and offering useful features like zooming and reducing the image. You can blow-up A5-sized documents onto A4 paper for instance and you can use the ADF to copy a stack of pages. We experienced no smears, creased paper or jams during the test.",
    "Mono inkjet printers are an uncommon proposition and ones that can be upgraded to print in colour are rarer still. It’s also unusual to find a printer that shuns AirPrint and Mac users so completely. It all adds up to quite a niche product and yet it will still make sense in some situations. Pages of black text look great and cost just 0.2p per side and the ability to add colour on occasion could be useful. However, if you are looking for a mono inkjet then we would urge you to also check out the Epson EcoTank ET-M2140 which does nearly everything the Canon can, but a lot faster."
  ],
  "headers": {
    "2": "Design and build",
    "7": "Features and specifications",
    "11": "Setup and operation",
    "15": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "Canon PIXMA GM4050": "https://www.canon-europe.com/printers/pixma-gm4050/",
    "multifunction printer": "https://www.techradar.com/news/best-all-in-one-printer",
    "Epson EcoTank ET-M2140": "https://www.techradar.com/reviews/epson-ecotank-et-m2140"
  }
}