{
  "source": "https://www.techradar.com/reviews/steelcase-solo-height-adjustable-standing-desk",
  "title": "Steelcase Solo height-adjustable standing desk review",
  "category": "computing",
  "updated": "2021-04-28T16:02:30.986Z",
  "author": "joel-khalili",
  "summary": "An affordable height-adjustable standing desk for fidgets and pacers",
  "verdict": "There’s plenty to like about this height-adjustable standing desk from Steelcase, from its generous size to its easy assembly. However, for a standing desk designed for the home office, the aesthetics leave something to be desired.",
  "pros": [
    "Sturdy",
    "Generous desktop",
    "Extremely easy assembly"
  ],
  "cons": [
    "Overly formal design",
    "Lacks 'smart' features"
  ],
  "article": [
    "With the rise of remote working having eliminated almost all exercise from daily routines, ensuring you remain active during the working day has become all the more important. However, this is easier said than done for people whose jobs tie them to a computer screen for hours each day.",
    "Despite the company's background in office-specific furniture, the Steelcase Solo standing desk is very clearly built with remote workers in mind, combining an affordable price tag with extremely easy assembly and single-button operation.",
    "An excellent range of motion means the Solo allows people of all different heights and ergonomic preferences to stretch their legs while working. And the desk is strong enough to lift pretty much any equipment you might need.",
    "However, there is a distinct lack of extra features that might help you get the most out of a standing desk - such as customizable height presets - and the aesthetics also leave something to be desired.",
    "The Steelcase Solo is available in North America and costs between $599 and $699, depending on the model you go for. At the time of writing, however, Steelcase is offering a 10% discount on the MSRP.",
    "The Solo is delivered in two separate boxes; one for the legs and electronic components and another for the work surface.",
    "Note, if you’re going to ship the Solo standing desk to the UK, you’ll also need to get hold of a voltage converter. Unlike many modern devices, the Solo is only able to operate at the native US voltage (120V), so cannot be powered directly from UK mains.",
    "The Solo comes in a range of different models, all of which pair a laminate desktop with a set of either black or white legs. The desk is also available in a selection of different sizes, from 24 x 48 inches to 30 x 60 inches.",
    "For a standing desk designed for the home office, the aesthetic feels a little too plain and formal. Although some colors are more homely than others, the acacia",
    "model we reviewed would certainly be better suited to a corporate office setting.",
    "The build quality is decent (with the exception of the paddle control, which feels plasticy) and the desk feels nice and sturdy, suffering from just a modest sidewards wobble when extended to full height. The slimness of the tabletop, combined with the lack of drawers, also means this desk is perfect for mounting monitors via clamp.",
    "Assembling the Solo couldn’t really be any easier, taking under five minutes and requiring very few tools. To prepare the desk for use, the legs need to be inserted at an angle and lifted upwards until they click into place. From here, all you need to do is screw in the paddle that controls the upwards and downwards motion.",
    "Our main criticism on this front is that cable management could be made easier. While Steelcase provides a couple of tabs on the underside of the desk for wiring to be tucked into, the length of the cable means you’ll need to recruit a zip- or twist-tie to neaten everything up.",
    "Once the desk is plugged into an outlet, raising and lowering the worksurface is as simple as lifting upwards or pressing downwards on the paddle.",
    "The desk raises by a total of 26.1 inches (roughly 66cm) to a maximum height of 48.8 inches (124cm), taking roughly 20 seconds to travel from bottom to top. This may sound like a long time, but in normal circumstances you’ll only need to use a portion of its range of motion.",
    "The single motor is capable of lifting a healthy 269lbs (122kg) in weight, which is more than enough to accommodate even the most ostentatious monitor and speakers.",
    "When the Solo is active, the motor makes a slight but mostly inoffensive whirring. And while it’s probably advisable not to keep full drinks on your desk while it’s being raised or lowered, we found the motion was smooth enough not to cause any spills.",
    "Just bear in mind, you’ll need to ensure your monitor and computer peripherals have long enough cables to account for the maximum desk height, or else risk damaging ports or snapping weaker cable.",
    "You’ll also need to select your monitor particularly carefully, because at maximum extension we found some displays suffered from an annoying wiggle when typing vigorously. But this isn’t necessarily the fault of the desk.",
    "The Solo lacks a few “smart” features on offer with other standing desks, such as Bluetooth, customizable height presets or a system to remind you to rise out of your seat. But at this price point, these omissions aren’t all that surprising.",
    "The Steelcase Solo will tick plenty of boxes for anyone after a plain and uncomplicated standing desk for their home office. In all aspects of the design, Steelcase has prioritized simplicity; the single lever control and lack of drawers and other moving parts means there is little that can go wrong.",
    "In motion, the desk performs just as you would expect it to, raising and lowering with minimal noise and limited juddering, which means objects sitting atop the tabletop are unlikely to be disturbed.",
    "However, simplicity is a double-edged sword. The design is lacking in any real personality and feels too severe for the home. We were also a little disappointed by the lack of cable management features, which is particularly noticeable when the desk is raised to a standing position."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design",
    "13": "In-use:",
    "20": "Verdict:"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "standing desk": "https://www.techradar.com/news/best-standing-desk",
    "Steelcase Solo": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1261828779480432000&xs=1&url=https%3A%2F%2Fwww.steelcase.com%2Fproducts%2Fheight-adjustable-desks%2Fsolo-sit-stand-desk%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsteelcase-solo-height-adjustable-standing-desk",
    "monitors": "https://www.techradar.com/news/best-business-monitor"
  }
}