{
  "source": "https://www.techradar.com/reviews/outriders-review",
  "title": "Outriders review",
  "category": "gaming",
  "updated": "2021-04-15T07:24:57Z",
  "author": "adam-vjestica",
  "summary": "Outriders assemble",
  "verdict": "Outriders is a peculiar game. It makes a horrible first impression – a cheesy, B movie-style story accompanies what appears to be nothing more than a bland, cookie-cutter cover shooter that unashamedly borrows elements from its competitors. But after spending more than 40 hours on the hostile planet of Enoch, blasting enemies into bloody smithereens, there’s an undeniable charm to Outriders’s take on the looter shooter genre.",
  "pros": [
    "Genuinely enjoyable superpowers",
    "Cross-play support",
    "Excellent waypoint system and intuitive menus"
  ],
  "cons": [
    "Rough around the edges",
    "Repetitive by design",
    "Lacks originality",
    "Always online"
  ],
  "article": [
    "Outriders is a perfect example of why reviewing a game at launch – particularly one with potentially hundreds of hours of gameplay on offer – seems more and more like a futile endeavour. The game was practically unplayable on release, with server issues meaning many players were unable to login for a number of days. Even when the server issues were eventually ironed out, bugs, glitches and game-breaking problems remained. Cross-play between consoles and PC was also disabled, further adding to the less-than-complete feel of the game.",
    "On April 9, the game received a sizable patch that not only significantly improved the overall experience, but one that made the above complaints only applicable to those who were there on day one. It’s another reminder that the majority of games are no longer the finished article after release, with many developers slowly improving and often changing how a game plays dramatically down the line.",
    "While issues in Outriders certainly remain, there’s already a substantial difference in how the game plays compared to launch, therefore our review can only reflect the current state the game is in now. However, Outriders’s always-online nature means there’s a real possibility that more frustrations could arise in the future, which is worth bearing in mind.",
    "Speaking of bugs, which we’ll quickly address here, we continue to encounter audio issues such as popping, had a possessed controller that wouldn’t stop vibrating during one playthrough, suffered the odd hard disconnect during a mission, and kept seeing weird graphical glitches during cutscenes. Characters’ faces can turn into a nightmarish horror due to textures freaking out, and any cloth-based piece of equipment tends to comically reload in every time the camera cuts to a new angle. It’s just sloppy, really.",
    "Questionable quality control aside, then, what does developer People Can Fly’s more chaotic take on the looter shooter genre have to offer? And does it do enough to stand out against its more established peers, many of which continue to attract millions of players.",
    "It’s immediately obvious from the outset that Outriders takes liberties with some of its source material. If you’ve ever dabbled with Destiny, The Division or Gears of War, it’s hard not to draw comparisons between Outriders and the aforementioned games. I generally despise pitting ‘Game A against Game B’ when it comes to a review (nothing is truly original after all), but Outriders’s inspirations are so obvious that it’s impossible to ignore.",
    "This feeling of familiarity doesn’t do Outriders any favors, either. A predominantly brown, war torn world awaits the player after a clunky introduction, and harkens back to the insipid period where every video game developer suddenly forgot that other colors were available. There are countless bits of cover to huddle behind during firefights and various guns to collect with different rarity values, power and stat-boosting bonuses; the familiar circular cursor that’s used to navigate most of the menus is alive and well, and there’s crafting, gear and bullet-sponge bosses to take down. If it all sounds a bit samey compared to other games, that’s because it is.",
    "You’d be forgiven for thinking that Outriders was nothing more than a poor tribute act, then, particularly as the game’s outlandish characters and fairly forgettable story do little to help its plight. But underneath the cringe-worthy dialogue and generic premise is a game that’s fundamentally fun, but one that only rewards players who have the time to invest in it, and patience to endure the game’s sludgy start. It’s also infinitely better when you’re playing with friends, so if you’re traditionally a solo player, be warned.",
    "Outriders’s story does little to draw you in. Earth is deemed inhabitable due to one too many wars and natural disasters, so the human race sets forth to find a new home on a planet called Enoch. What was supposed to be a paradise soon turns into a deadly hellscape, and your player-created character, known as an Outrider, is plunged into cryosleep after barely surviving the catastrophic events that transpire. You awake over 30 years later, only to discover that the human race is still battling to survive, and its fate rests largely in your hands.",
    "All the usual tropes are here, with corny one-liners, frequent f-bombs and truly awful facial animations that make the cutscenes feel like a chore to sit through, rather than serving as a pleasant break from the action. The plot becomes slightly more interesting towards the end of the game, but any evocative moments completely misfire. That’s not to say the entire world and setting is a bust – Enoch is generally engaging enough to run around, and there’s countless amounts of additional lore and context for players to discover. But the execution leaves a lot to be desired.",
    "Fundamentally, Outriders is a looter shooter, but one that thankfully doesn’t feature any microtransactions (at least not yet, and hopefully never). If you’re not a fan of the genre by now, it’s unlikely that Outriders will change your mind; however, it’s easily one of the most accessible.",
    "You’ll embark on various quests and wield countless weapons like shotguns, SMGs, sniper rifles and high-powered pistols, and equip new gear that helps give you more health and armor. Drops can be found in crates scattered across each level, but are also dropped by more powerful enemies. Each loot has a ranking, too: common, rare, epic and legendary. You can also buy loot from vendors and craft better gear using resources you collect by defeating enemies, mining or by disassembling items.",
    "As you move through the game’s many biomes, which range from a frozen wasteland to a lush and vibrant forest, your character will level up, as will the game’s world tier. The world tier dictates how difficult the enemies you encounter will be, but higher tiers are the only way to get the best rewards. You also can’t progress to tier 15 if you play below the highest tier you have available. We found that we were able to play through the majority of the campaign at tier 8 until we hit a wall and had to drop down.",
    "You’ll gain experience as you complete quests and beat up baddies, of course, which unlocks skill points for you to assign to your character. There are three main branches to choose from, so you can make your character more destructive, defensive or a team player if you like. Pleasingly, you can reassign your skill points at any time so you’re not restricted to one path should you decide to mix it up in the future.",
    "That flexibility is particularly handy as there are four classes to choose from – Devastator, Technomancer, Trickster and Pyromancer – which means there is plenty of replayability on offer. You can create multiple characters, each with their own strengths and weaknesses, and create a build that suits you. Whether you want to act as a human shield as the Devastator, pick off enemies from afar as the Technomancer, or debilitate the enemy with multiple time-shifting abilities as the Trickster, Outriders’ four classes should suit every type of playstyle.",
    "The abilities, known as Anomalies, are extremely fun to pull off as well. As the Devastator, you can fly into the air and slam down into a crowd of enemies below, only to watch them explode in a shower of blood and guts. The Technomancer can conjure a rocket launcher or minigun out of nowhere, and the Pyromancer has the ability to burn enemies to a crisp. Whichever class you choose, Outriders does a good job of making each one appealing.",
    "It might seem like a minor point, but we also loved Outriders’s waypoint system. In a game which tasks you with visiting multiple locations, NPCs and lets you take on a number of quests at a time, the waypoint system removed a lot of frustration that would have otherwise been caused if it wasn’t up to scratch. We did notice the waypoint system got a little confused on a few occasions, but overall it’s really well done.",
    "Outriders’s defining quality by some margin is its onus on aggressive play. Your character is blessed with incredibly destructive supernatural powers after all, but you’ll need to utilize them to their fullest if you’re to overcome the many threats that are found on planet Enoch. Essentially you’re akin to a God, and making you feel like one is where Outriders excels the most.",
    "Even though cover is plentiful across Outriders’s hostile world, you won’t be cowering behind it very often other than to reload or to occasionally take a breather. Instead, you’ll need to take the fight to your enemies as vanquishing foes actually heals your character. With rapid cooldowns and various abilities to unlock, Outriders doesn’t force you to wait an age to unleash a super like in Destiny 2 – you’re encouraged to use them as much as possible for crowd control, interrupting more powerful enemy attacks and essentially to obliterate anything that gets in your way.",
    "Various weapons and gear can help boost your Anomaly powers, and higher-level weapons can inflict a number of effects such as freeze, burn, and slow, which adds a pleasing level of strategy to encounters. Experimentation is encouraged, of course, and determining what weapons suit your character build is a process which takes time but is undoubtedly rewarding.",
    "Gunplay in Outriders is also thankfully solid. There’s a pleasing sense of pride when you pop an enemy's cranium with a well-aimed sniper rifle, but it’s your character's unique powers that will ultimately dictate whether you survive. It’s a careful balancing act, though, as you’ll be peppered with bullets whenever you leave cover, so you can’t just run in with reckless abandon. You’ll have to fight tooth and nail to survive some of the more testing encounters, but again, you can lower the difficulty at any time if it gets too much.",
    "When you’re engulfing enemies in a sea of flames, shattering frozen creatures into tiny little icy pieces or watching a hapless foe suspended in motion as you riddle them with gunfire, Outriders can be a really good time. But then you’re tasked with doing it again, and again, all with the focus on grinding better loot as you go. Again, we’d highly recommend teaming up with a friend, as playing solo can be a repetitive and sometimes monotonous task.",
    "Outriders’s cross-play support works admirably, and it’s something that is crucial to the health of game, which will live and die based on its player count. We were able to play with someone on PS5 while on Xbox Series X without any problems, and the game really shines when multiple characters are unleashing abilities against an impressive amount of enemies that litter the screen. Again, we’d highly recommend playing the game with two other players in tow.",
    "Outriders offers hours of entertainment for those who stick with it, and the campaign alone took upwards of 20 hours to complete. Side quests are also enjoyable because you’re not only rewarded with experience, but you also get to choose between three random pieces of loot at the end of a mission. They’re not always worthwhile, however.",
    "However, it’s the meaty end game known as Expeditions where veterans players will spend most of their time. Expeditions challenge you to complete a level as quickly as possible to unlock higher tiers and gather Drop Pod resources. If you win, you’ll get better loot, but you’ll still get some gear for trying if you fail. Complete every expedition, and you can make your way to the game’s final boss fight – something which we predict only the most dedicated of players will witness.",
    "Outriders doesn’t redefine the looter genre, then, but it does offer a more casual and accessible alternative. It manages to deliver a steady drip of endorphin-raising loot as you progress and its over-the-top abilities and gore-laden explosions certainly made us smile on more than a few occasions. It can be a blast with friends, but solo play exposes the game’s grindy nature, which is more a criticism of the looter shooter genre as a whole.",
    "Sure, there are more refined and technically accomplished experiences out there that Outriders has to compete against, but it’s a game that doesn’t take itself too seriously – and honestly, neither should you.",
    "We just wish developer People Can Fly would have committed more to its own ideas instead of following the same old formula we’ve played before. After all, this is a dev who gave us such off-the-wall creations such as Painkiller and Bulletstorm, which were both praised for their ingenuity and ability to shake up the first-person shooter genre."
  ],
  "headers": {
    "5": "Rough ride",
    "8": "Enoch is enough",
    "10": "For the love of loot",
    "17": "Here comes the boom",
    "21": "Power trip",
    "25": "Verdict"
  },
  "links": {
    "game-breaking problems": "https://www.techradar.com/news/outriders-inventory-wipe-bug-remains-unfixed-and-a-seriously-scary-prospect",
    "Cross-play": "https://www.techradar.com/news/10-cross-play-games-to-play-across-ps4-xbox-one-pc-and-nintendo-switch",
    "Gears of War": "https://www.techradar.com/reviews/gears-5-review",
    "four classes": "https://www.techradar.com/how-to/outriders-class-guide",
    "Devastator": "https://www.techradar.com/how-to/outriders-devastator-class-guide",
    "Outriders’s waypoint system": "https://www.techradar.com/news/outriders-waypoint-system-is-a-work-of-art",
    "Outriders’s cross-play": "https://www.techradar.com/how-to/how-to-enable-outriders-crossplay"
  }
}