{
  "source": "https://www.techradar.com/reviews/hydrow",
  "title": "Hydrow review",
  "category": "fitness",
  "updated": "2021-04-01T13:07:36Z",
  "author": "suzanne-baum",
  "summary": "A super premium rowing machine that offers an immersive fitness experience",
  "verdict": "The Hydrow is by far the best rowing machine we've tested to date. It has a sleek, modern design, and the fact it makes only the very slightest of noise is a huge bonus – but then again at such a steep price tag, you’d expect nothing more. The seat glides smoothly, providing a natural rowing experience as you take your pick from hundreds of classes. It’s most certainly the live aspect of the Hydrow that is the most interesting – you can join real-time classes with an instructor on the water, where the passing of a dolphin is just part of the live experience. If you’re looking for a high-performance rowing machine and you’re happy to part with the money, this is for you.",
  "pros": [
    "Immersive experience",
    "Excellent classes and music",
    "Makes no noise"
  ],
  "cons": [
    "Expensive",
    "Takes up a lot of space",
    "Requires monthly subscription"
  ],
  "article": [
    "The Hydrow is a smart, modern rowing machine that offers live and on-demand workouts that you can follow along we home. It's not a simple Peloton clone though, and is the best rowing machine we've reviewed to date.",
    "Whereas other rowing machines create resistance through fans or water, the Hydrow operates on the world’s first algorithm designed to simulate the smooth feeling of rowing on water. This tech means it's barely audible in use, and even the seat makes no sound as it glides up and down smoothly due to its built-in 12 foam rollers.",
    "In terms of features, the Hydrow covers everything we’ve come to expect from a premium digital workout machine: it boasts a 22-inch touchscreen display, an electromagnetic computer-controlled drag mechanism that auto-adjusts up to 240 times per second to mimic the sensation of rowing on the water, and has front-facing speakers. The music system is top quality, and the integrated speakers means the sound is crystal clear and enables you to hear both the music and the instructor as you row.",
    "Everything about the machine is aesthetically pleasing. The curvaceous and sleek design is so striking that even when not in use, it does not look an eyesore like other large fitness equipment can do.",
    "As for the classes, there are over 2,000 available, from beginner lessons right up to advanced level rowing competitions. And if you want a break from rowing, the Hydrow app can also provide you with numerous mat exercises.",
    "The price is definitely premium, particularly when you factor in the monthly subscription fee on top of the initial cost of the machine, but it’s important to remember that the Hydrow has leading technology in the market and this is what you’re splashing out on.",
    "The Hydrow is available in the US and UK, and costs $2,245 / £2,295 (with a $63 / £38 monthly subscription). It launched in the US in March 2019, and the UK in March 2021.",
    "The Hydrow arrives in a large box and requires two people to assemble. Although it's quite a heavy piece of equipment, it's on wheels so once set up can be moved around the room quite easily. Keep in mind though that the machine is 2.2m long so can be a bit tricky to manoeuvre.",
    "The stand out design feature of the Hydrow is the built-in 22in touchscreen, but the machine as a whole is aesthetically pleasing too. The compact aluminum and steel frame has been designed in a way that it looks super slimline and elegant. The frame itself rests on soft, rubberized feet to prevent scratching the floor.",
    "The Hydrow has adjustable foot rests and a comfortable, cushioned seat that supports users up to the weight of 375lb. It's been specially engineered with 12 rollers to make it smooth and quiet when the seat glides up and down, and because it sits nicely at a height of 16.5in off the floor, it is easy for the user to get on and off the seat.",
    "Unlike other rowing machines, that often look quite bulky because of the air fan that powers them, the Hydrow uses a computer to control the resistance.",
    "Before you begin, you'll need to sign up for the monthly Hydrow membership that gives you access to all the classes available. It's very simple, and only takes a few minutes.",
    "Once that's done, you can use the touchscreen to scroll through the classes. As beginners, we found it useful to start off with the 15-minute introduction class where you can watch the teacher in their boat and learn to mimic their movements to gain an understanding of what the Hydrow is all about and familiarize yourself with the rowing mechanism.",
    "As soon as you click on a class, you get a one-minute countdown that gives you enough time to fasten your shoes into the foot pads and get yourself ready to go. The seat rolls smoothly backwards and forwards and because there is no wheel to power the machine as with other rowing machines, it's a seamless process.",
    "The class videos are slick, with most showing an athlete rowing on a particular stretch of water, filmed up close enough to enable you to match them stroke for stroke. Depending on what location you pick, you can find yourself rowing along the Charles River in Massachusetts, the East River in New York, or even – for a few of the sessions – alongside the Houses of Parliament on the Thames.",
    "During every class we chose – from the beginner’s one to the strength training introduction – we enjoyed being motivated by the on-screen metrics, including your 500 meter split time (speed), rhythm number (strokes per minute), average 500 meter split time, total meters covered, estimated calories burned, and heart rate.",
    "There are a couple of live rowing sessions a day, led by a coach on the water, when you can race against other people. On the right side of the screen is the leader board, which you can optionally filter by gender and age group. Live classes definitely need to increase to make the high price tag more justifiable.",
    "To supplement your rowing workouts, Hydrow offers a range of mat-based classes that you can access through downloading the free app. There are functional movement, mobility, pilates, strength, and stretching sessions. Most are just 5-10 minutes, though there are a few 30-minute mat classes. The app also enables you to track your activity, read blog posts and check the live schedule. You don't need the app to actually do a Hydrow rower workout on the machine, which is a good thing"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and release date",
    "7": "Design",
    "11": "Performance",
    "18": "Don't buy it if"
  },
  "links": {
    "Hydrow": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9294969047646607000&xs=1&url=https%3A%2F%2Fhydrow.co.uk%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhydrow"
  }
}