{
  "source": "https://www.techradar.com/reviews/oura",
  "title": "Oura (Generation 2) review",
  "category": "fitness",
  "updated": "2021-11-05T14:28:31Z",
  "author": "cat-ellis",
  "summary": "A tiny smart ring that gives personalized, practical advice for a more balanced lifestyle",
  "verdict": "The best fitness tracker is the one you wear everyday, and the Oura smart ring makes it easy to do just that. Over the course of several weeks, it builds up a detailed picture of your activity levels and rest using a combination of biometric data, and gives you practical advice on how to balance the two. Its sleep tracking is particularly impressive, and each morning you'll receive a Readiness score that helps you decide how to tackle the day ahead. It's a genuinely useful little tool, and the ring form factor makes a real difference.",
  "pros": [
    "Comfortable all day",
    "Excellent sleep tracking",
    "Well designed app",
    "Detailed health insights"
  ],
  "cons": [
    "Sometimes slow to sync"
  ],
  "article": [
    "Smart rings are a great idea in theory – small, discreet and unobtrusive – but difficult to get right. That's partly due to the difficulty of manufacturing them and obtaining components small enough, but it's also down to the difficulty of creating a device that's genuinely useful enough for people to be interested in.",
    "That's where Oura comes in: neat little ring that's all about balancing activity and rest. It's lined with sensors that collect biometric data 24 hours a day, and sync it with a mobile app where it's processed to help you understand what's happening in your body, and make sensible lifestyle changes. That might sound like nothing new, but the ring form factor gives Oura a real advantage.",
    "The best fitness tracker is the one you wear every day, allowing it to build up a complete picture of your health and wellbeing over time. Oura looks just like an ordinary piece of jewelry, and can be slipped onto your hand in a second. You barely need to think about it, and once you're wearing it, you'll soon forget it's there.",
    "Rather than simply comparing your data to average measurements for someone of your age and gender, as many fitness trackers do, Oura spends a few weeks establishing a baseline, which it can then use to give personalized guidance. Your heart rate may be lower than average, but if it's normal for you, then there's probably no cause for concern.",
    "Oura tracks metrics throughout the day, but it does its best work at night. In our tests, sleep tracking proved extremely accurate, correctly detecting exactly when we fell asleep rather than just when we lay down for the right. The lack of movement overnight means the ring can gather more accurate data, and do so more frequently, providing you with more useful insights in the morning.",
    "When you check the app first thing, all that data is there, together with practical advice that can help you plan the day ahead, and adjust your plans to suit your readiness. It's simple, but very effective – even more so than a smartwatch.",
    "Update: Oura has now announced its third-generation smart ring, with new sensors and improved sleep tracking. We'll be putting it to the test very soon.",
    "This is the second-generation Oura ring, which launched in 2018. It's available direct from Oura with worldwide shipping. The plain ring costs $299 (about $220 / AU$410), and the diamond version is $999 (about £720 / AU$1,400). Both have exactly the same features inside; the only difference is a line of stones on the face of the more expensive ring.",
    "At the time of writing, that makes the Oura about the same price as the stress-detecting Fitbit Sense, and a little more expensive than the Fitbit Versa 3. However, although both the Oura and the Sense are focused on wellbeing, the two are very different devices.",
    "In late October 2021, Oura opened pre-orders for a third-generation smart ring, which will include an SpO2 sensor, plus new optical heart rate sensors for 24/7 monitoring. There's also a paid membership program on the way, which will give you extra insights into your health, plus audio content, and will cost $5.99 (about £4.50 / AU$8) per month.",
    "The Oura ring is made from lightweight titanium, and weighs between 4g and 6g depending on size and style. It has a smart, clean look and comes in two shapes: Balance (tested here), which has a pointed face, and Heritage, which is flat. Heritage is available in silver, black, gold, or a dark gray matt finish called Stealth, while Balance comes in plain silver, black, or silver with a row of diamonds.",
    "The ring is water resistant to 100m, so you can wear it while swimming, bathing, and washing your hands, There are three small sensor bumps on the inside, but these are impossible to feel when wearing it.",
    "To make sure you get the right size, you'll be sent a free sizing pack containing eight plastic ring blanks of the same width and thickness as the real ring, and with the same small bumps on the inside. You're advised to try wearing the blank all day and while sleeping to make sure you choose the best fit. We'd definitely agree, and recommend trying them during your regular workouts to make sure you're happy with the fit.",
    "You can wear the ring on any finger, or your thumb. We started out wearing it on our left index finger, but switched to our thumb after a few days. It was easy to wear all day during running, hiking and cycling (including with cycling gloves), and didn't slip off even with wet or cold hands.",
    "The ring is supplied with an induction charging stand, with a USB cable. Just slide the Oura ring onto the peg and an LED in the base will illuminate to show charging is in progress.",
    "There's no light, display, or haptic feedback mechanism on the ring. Instead, all your interaction happens through the Oura app, which is available for iOS and Android. Unlike Fitbit. there's no premium membership tier; all your historic data and trends are available to view free of charge.",
    "Data is synced from the ring whenever you open the app, though in our experience this was a little hit-and-miss. Sometimes it took several minutes for the ring to finish syncing, though it never actually failed to complete.",
    "As we mentioned earlier, Oura is all about striking the right balance of activity and rest – getting plenty of exercise, but also allowing enough time for quality sleep and recovery afterwards.",
    "Wearing your ring all day will allow the app to build up a picture of your activity levels. You'll receive occasional prompts to get up and move if you've been sitting stationary at your desk for too long, and you'll be set daily activity goals, which you can meet by performing a moderate to high intensity activity each day.",
    "You can also choose to add workouts to the Oura app manually. The ring itself has no specific activity tracking modes (and there are none that you can trigger in the app itself) but you can enter an activity type, such as cycling, a duration, and a level of perceived exertion. The app will use this to calculate an estimated calorie burn (which was usually slightly higher than that measured by our Garmin Instinct Solar).",
    "Oura really comes into its own at night, though. As the company's CEO Harpreet Singh Rai explained to TechRadar in a recent interview, sleep is incredibly important for health (more so than many of us realize) and wearables can track data much more accurate at night due to the lack of movement to interrupt the signal (something that sports watches have to compensate for using specially developed algorithms).",
    "Each morning you'll receive a Readiness score, based on your activity and sleep patterns, plus biometrics including resting heart rate, heart rate variability, and body temperature. Many running watches (including those from Garmin and Polar) offer a similar figure to help athletes balance rest and training sessions, but Oura was one of the first to bring a similar score to an everyday fitness tracker.",
    "It's a very useful figure, and it's interesting to note that Fitbit has chosen the exact same name for its own readiness metric, announced during the launch of the Fitbit Charge 5 in September 2021.",
    "Glancing at the Readiness score in the Oura app each morning will help you see how much energy you have for the day ahead, and let you manage your tasks accordingly. If your readiness score is low, for example, the app will advise that you take it easy.",
    "If you spend a little longer, you can browse through the details to see the factors that affected your score for even more insight and advice. If any metric looks unusual (for example, you might be sleeping less, or your resting heart rate may be higher than usual, indicating that you might be under stress), the app explains what they mean, and what lifestyle changes you might consider.",
    "We were also particularly impressed by the Oura's sleep tracking. Unlike many devices (whether they're watches or non-wearable devices that are placed under your mattress), the ring was able to accurately differentiate between time spent in bed awake, and time actually sleeping.",
    "Oura can also detect naps, and factor them into your Recovery score (though the app will also advise you that they're a bad idea if you take then too late in the day). Many other fitness trackers only track one period of sleep per day, so this is a real advantage.",
    "Everything is personalized to you, based on trends from previous nights. The app can even suggest the ideal time for you to go to bed (which may not always be before midnight). Occasionally you may see gaps in the data. This means the ring has lost connection temporarily – possibly because you moved, or because the sensors were dirty – so it's worth making sure it's clean and securely positioned before nodding off.",
    "Other than the occasional lag in syncing data, the Oura is hard to fault. It's successfully carved itself a new niche in wearables, and is sufficiently different to sports watches that we could easily justify having both - one for workouts and the other for recovery.",
    "However, if you already have a device like a Fitbit, you may find that there's a little too much crossover between the two. In our experience the sleep data from the Oura will be more accurate and the insights more detailed, but we'd advise choosing between the two rather than wearing both.",
    "There are a few features that we'd like to see in a future Oura ring. It would no doubt be very difficult to implement due to the ring's size, but a vibration motor would allow the ring to wake you during the optimum point in your sleep cycle, when you are in light sleep, without disturbing your partner. It could also remind you when it's time to get up and stretch (something the app currently tells you through a push notification that could be easy to miss.",
    "This article is part of TechRadar's Sleep Week 2021 (running from Sunday 31 October to Sunday 7 November), our in-depth look at sleep and how to snooze better. We've teamed up with experts in their field to bring you proven sleep techniques and tips to help you drift off easier, and have rounded-up the best sleep kit to transform your bedroom into a den of zen.",
    "Read more:"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Oura price and release date",
    "10": "Oura design",
    "17": "Health tracking",
    "31": "Don't buy it if"
  },
  "links": {
    "Oura": "https://ouraring.com/",
    "direct from Oura": "https://ouraring.com/",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "third-generation smart ring": "https://www.techradar.com/news/oura-challenges-fitbit-with-next-gen-fitness-tracking-smart-ring",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1388592526101205800&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fgb%2Fapp%2Foura%2Fid1043837948",
    "Android.": "https://play.google.com/store/apps/details?id=com.ouraring.oura&hl=en_GB&gl=US",
    "Garmin Instinct Solar": "https://www.techradar.com/reviews/garmin-instinct-solar",
    "in a recent interview": "https://www.techradar.com/news/oura",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "Fitbit Charge 5": "https://www.techradar.com/reviews/fitbit-charge-5",
    "TechRadar's Sleep Week 2021": "https://www.techradar.com/news/welcome-to-techradars-sleep-week"
  }
}