{
  "source": "https://www.techradar.com/reviews/power-plate-mini",
  "title": "Power Plate Mini+ review",
  "category": "fitness",
  "updated": "2021-07-22T16:39:41.106Z",
  "author": "cat-ellis",
  "summary": "A compact but powerful massage gun for the gym, your desk, or anywhere else",
  "verdict": "Compact but solidly built, the Power Plate Mini+ is a portable massage gun that has real kick when you need it, but can also loosen tight muscles more gently than a full-sized version. It will give hours of use on a single charge, and is ideal for keeping in your gym bag for post-workout massage, or at your desk to loosen tight muscles while working. It's beginner-friendly too, with an excellent set of instructional videos available in the Power Plate mobile app, and a very reasonable price tag. The best massage gun we've tested to date.",
  "pros": [
    "Smart, compact design",
    "Good range of intensity settings",
    "Affordably priced",
    "Very quiet",
    "Great companion app"
  ],
  "cons": [
    "A little warm while charging"
  ],
  "article": [
    "The Power Plate Mini+ is a brilliant tool for easing tight muscles and working out knots at the gym, your desk, or anywhere else. It's a smart little massage gun that you can carry anywhere, and although it packs a punch when you need it, it's also ideal for complete beginners.",
    "It's one of the smallest massage guns around, but is thoughtfully designed, with a wide range of power options ranging from gentle to genuinely intense. It can't give you quite the same therapeutic pummelling as a full-sized massage gun, but its highest setting still has a substantial kick.",
    "It's supplied with two attachments (one for large muscles and another for knots), which simply push onto the handle. Despite the simple design, they don't budge in use, and are never in danger of coming loose.",
    "If you're not sure the best way to use the massage gun, or just want some more ideas, the free Power Plate app is packed with short videos explaining how to make the most of it, and target specific muscle groups safely and effectively.",
    "All in all, it's a great little package for easing aches and loosening up tight muscles at home or on the move, even if you're going to be off-grid for a while, as a single charge of its built-in battery will provide around three to five hours of use depending on the intensity setting.",
    "The Power Plate Mini+ was released in March 2021, and costs $179.99 / £179.95 (about AU$250) direct from Power Plate, or from a handful of third-party stores.",
    "This makes the Power Plate Mini+ one of the most affordable massage guns of its type, costing around half the price of a full-sized model. While you can find cheaper devices on Amazon, Power Plate has been in the home business for 20 years, and it shows in the quality and customer support; this little machine is particularly well made, and comes with a one-year manufacturer’s warranty.",
    "As its name suggests, the Power Plate Mini+ is a compact massage gun, measuring 15cm x 9cm for the device alone, with no attachments. The box includes the gun itself, two massage attachments, a USB-C charging cable, and a robust drawstring carry bag.",
    "It’s fairly weighty for its size due to its high-capacity battery and powerful motor (the gun weighs around 440g), but comfortable to hold, and a loop at the bottom means you can attach it to a carabiner and clip it to a backpack if carrying its drawstring bag isn't convenient.",
    "The power button is located on the bottom of the handle, and is also used to control the gun’s speed. There are four intensity settings, which you can cycle through by pressing the power button while the gun is on. The power button is surrounded by eight LEDs: four red ones on the right that indicate the battery charge level, and four white ones on the left show the intensity.",
    "The massage gun’s round attachment (approximately the size of a golf ball) is good for hitting larger muscles, while the smaller one works well for targeting knots.",
    "For comparison, its nearest competitor, the Theragun Mini, comes with just one head, and has only three speed settings compared to four for the Power Plate Mini+.",
    "Despite its compact size, the Power Plate Mini+ is a versatile little machine. It certainly packs a punch when you need it, but we also appreciated the more gentle massage of its lower intensity settings. When testing the Hydragun recently we found even its lowest intensity too aggressive for sensitive areas, but with the Power Plate Mini+ that’s not an issue.",
    "The attachments simply push into the gun, and unlike the Core Balance Massage Gun we tested recently, they fit securely in place; in our tests they never came loose during our tests or felt likely to detach.",
    "Although there are only two attachments to choose from, they’re well designed and should serve most users well. If you ever spend time rolling your foot on a tennis ball to relieve plantar fasciitis, the round massage head is ideal. It's also particularly good for reaching around and hitting sore muscles in your shoulders and back, and you can target knots (caused by a build-up of lactic acid) with the smaller attachment.",
    "The Power Plate Mini+ is also a useful tool for practicing sports massage on another person; if you find a knot with your hand, you can use the massage gun to focus on it if you find it hard to apply the appropriate pressure yourself.",
    "The machine's small size makes it handy for taking to the gym, but it's also handy to keep by your desk, whether you're working at an office or from home. The USB cable means you can charge it from your computer, and have it to hand when your muscles feel tight after sitting at your keyboard too long.",
    "Whichever attachment and intensity setting you choose, the Power Plate Mini+ is surprisingly quiet",
    "There’s no Bluetooth connectivity, but there’s a lot to be gained by installing the free Power Plate app (available for iOS and Android). Here you’ll not only find videos explaining how to use the massage gun safely and effectively on different muscle groups.",
    "After installing the app, you’ll need to create an account, then enter a few details about your fitness aims (toning, building muscle, weight less etc) and favorite type of workout classes, then register the device. Once that’s done, you'll be presented with a list of videos; scroll down a little way to 'Targeted vibration products', tap 'Mini+' and you'll see a list of one-minute videos covering biceps, calves, feet, forearms, hips, glute, and more.",
    "We found that the end of the device became quite warm while charging, but that’s the only criticism we could level at it. If you've been thinking of investing in a massage gun, this is a great beginner-friendly choice.",
    "First reviewed July 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Price and availability",
    "7": "Design",
    "12": "Performance",
    "22": "Don't buy it if"
  },
  "links": {
    "Power Plate Mini+": "https://powerplate.com/collections/targeted-vibration/products/mini-plus",
    "direct from Power Plate": "https://powerplate.com/collections/targeted-vibration/products/mini-plus",
    "Core Balance Massage Gun": "https://www.techradar.com/reviews/core-balance-massage-gun"
  }
}