{
  "source": "https://www.techradar.com/reviews/panasonic-gh5-mark-ii",
  "title": "Panasonic GH5 Mark II review",
  "category": "cameras",
  "updated": "2021-06-10T10:09:17Z",
  "author": "sam-kieldsen",
  "summary": "A minor upgrade with unique live-streaming talents",
  "verdict": "If you're looking for a well-built, lightweight mirrorless camera with excellent handling, a fantastic range of video shooting options and solid stills performance, the GH5 Mark II his well worth a look. The GH5 was already a great choice, and the tweaks here just make it all the more appealing. If you own the original GH5, though, the GH5 Mark II seems slightly redundant: aside from minor performance upgrades and the addition of live streaming, it’s largely unchanged. Unless you really need that live-streaming functionality, you’re better off waiting for the Panasonic GH6.",
  "pros": [
    "Wireless live streaming built in",
    "Strong all-round image quality",
    "Many small improvements to an already great camera"
  ],
  "cons": [
    "Few reasons for GH5 owners to upgrade"
  ],
  "article": [
    "The Panasonic GH5 II's predecessor, the original GH5, was a landmark camera for video makers. It offered gorgeous 4K footage quality, a wide variety of shooting options and good handling, as well as valuable features like in-body image stabilization and dual SD card slots. It was also a solid stills camera, with decent all-round imaging performance, despite its small Micro Four Thirds sensor.",
    "The GH5 II doesn’t do anything to spoil the party. It comes with everything that made its predecessor a success, plus a little bit extra. But only a little bit: with more or less the same sensor and same range of video resolutions, frame rates and bitrates, there’s no great leap forward here.",
    "For some, the addition of built-in wireless video live streaming might make it worth the upgrade, but generally speaking we don’t think owners of the GH5 shouldn’t bother replacing it with the GH5 II; the improvements are too minor.",
    "For others, particularly those looking to take their first steps into “serious” video production, the Panasonic GH5 II represents a great buy. By retaining all the benefits of the first model while adding quality-of-life updates like internal battery charging and the aforementioned wireless live streaming, it instantly establishes itself as Panasonic’s new go-to model for demanding content creators.",
    "It can shoot everything from pristine 10-bit 4:2:2 videos to buttery smooth slow motion Full HD clips, and its videos can look superb with minimal post-production editing required.",
    "Compact, lightweight, weatherproof and a joy to use at home or in the field, the GH5 II represents great value for money. It’s got serious video chops, is strong on stills too, and is built to last.",
    "The Lumix GH5 Mark II will be available from the end of June in two main packages: a body-only option for $1,699.99 / £1,499 / AU$2,699 and an L kit (including a 12-60mm f/2.8-4 Leica lens) for $2,299.99 / £1,999 / AU$3,799.",
    "Some regions like the UK and Australia will also have the extra option of an M kit (including a 12-60mm f/3.5-5.6 Lumix lens) for £1,699 / AU$2,999. There's even a Pro kit available in Australia that comes with a 12-35mm Lumix G lens and will set you back AU$3,799.",
    "This means the GH5 Mark II is actually cheaper at launch than the original Panasonic GH5, which arrived in 2017 for $2,000 / £1,699. Then again, it does share much of the same hardware four years on, so this was to be expected.",
    "The GH5 Mark II is nigh-on indistinguishable from its predecessor: it has the same dust-proof, splash-proof and freeze-proof magnesium alloy body with the same 138.5 x 98.1 x 87.4mm dimensions, and at 727g (including battery and memory card) weighs just 2g more.",
    "To be fair to Panasonic, this is one area where change didn’t feel required. The quasi-DSLR shape of the camera fits well in your hands, and all the main controls (including the large red video stop/start button) are situated within easy reach of your fingers or thumbs. Dials give quick access to a wide range of shooting modes, including four user-customizable configurations, and a cursor-nub for your right thumb allows for fast menu navigation or autofocus point movement.",
    "As with the original GH5, there’s a full-size HDMI output (able to transport a C4K 4:2:2 10-bit video feed to an external recorder, should the internal 4:2:0 recording not meet your needs), mic and headphone jacks, a dedicated remote, two SD card slots and a USB Type-C port. The USB connection on the GH5 Mark II is a level above its predecessor’s though, capable of recharging the battery and supplying power; it's a really useful upgrade, particularly given the live-streaming feature.",
    "The touchscreen size has been slightly reduced, from 3.2-inch to 3-inch, but gets slight bumps to its brightness and resolution that we think make up for this. It keeps the extremely flexible tilt-and-swivel design, allowing it to flip around the side to face fully forward – essential for vlogging and live-streaming, really. The electronic viewfinder remains exactly the same as the GH5’s, which isn’t a problem as it’s bright, crisp and does its job perfectly well.",
    "Wireless live streaming might not seem like a huge craze yet, but Panasonic has made it a big promotional point of the GH5 II’s launch. At the time of writing, it’s the only high-quality mirrorless camera with built-in wireless live streaming, so vloggers and other content creators should take note.",
    "The camera’s live streaming setup uses the standard RTMP/RTMPS protocol, which means it can be used on a variety of platforms. For those who want to get started with a minimum of fuss, YouTube and Facebook streaming comes built in: download the Lumix Sync app for your phone or tablet, go through the simple steps to get your device paired with the GH5 II, then log into your Facebook or YouTube account and you’re basically there.",
    "You will need to connect the camera to the internet via Wi-Fi for this; this can be your smartphone’s Wi-Fi hotspot if you’re out and about, and having tested it we can confirm that this works pretty well. Whether you’re using a home Wi-Fi connection or a hotspot, you can get a stream up and running in a matter of minutes, particularly once you’ve gone through the initial setup and saved your login details for whatever platform you’re using.",
    "Streaming quality is limited to a maximum of 1080p/60fps, but will automatically adapt to its connection. Our Facebook stream downgraded the resolution to 720p, for instance – but the connection remained solid, running with a 15-second or so delay.",
    "Those who want to stream via an RTP/RTSP wired connection will have to wait for a promised firmware update, which will also add USB smartphone tethering. In a pinch the GH5 II, as with a lot of Panasonic cameras, can be used as a wired webcam using the company’s Lumix Webcam software, albeit with a resolution limited to 960p.",
    "The GH5 II’s autofocus setup has been largely retained from the GH5, albeit with the addition of head, body and animal recognition (the original only had eye recognition).",
    "Our testing suggests this AI-based detection approach is generally successful: human faces, heads and bodies are quickly picked up, but while a seagull got the attention of the autofocus our own sitting cat seemed to fox it slightly.",
    "The AF setup uses Panasonic’s own DFD (Depth From Defocus) system rather than the hybrid contrast and phase detection setup favored by the likes of Sony, Canon and Nikon. DFD uses an AI-based algorithm in tandem with contrast detection, and we’d say it’s not quite as reliable as its hybrid rivals when it comes to nailing a fast, perfect focus every time. Is it likely to hinder your photography or filmmaking too much? No, we suspect not.",
    "There are 225 selectable focus points spread across the sensor, and a pleasingly large range of AF modes to choose from. As is customary with most touchscreen-equipped cameras today, you can tap the display to select an AF area or point, including on an object you’d like the system to track as it moves around the frame.",
    "In terms of stills shooting speed, the GH5 II is about average – at least if you’re talking about shooting full-resolution images. It can manage a brisk 12fps with manual focus and live view turned off, or an acceptable 9fps with autofocus engaged.",
    "Dial down the resolution, however, and it becomes something of a speed demon. The 6K Photo mode offers up to 30fps bursts, and in 4K Photo it goes as fast as 60fps. The downside, of course, is a drop in pixels: in 6K mode your images will be 18MP in size; in 4K, they’re 8MP. Also, these shots are actually frames taken from MP4 videos rather than traditional stills, so you can’t shoot them in raw.",
    "The GH5 II’s batteries have a slightly larger capacity than the GH5’s (2,200mAh rather than 1,860mAh), but the real-world differences are negligible, suggesting the new model is a little more power-hungry. With normal use, you can expect a charge to last for about 400 stills or around an hour of 4K video recording.",
    "What has changed is the way the battery is charged. It can now be done internally, with the GH5 II’s USB-C port able to carry a constant power supply to the camera or recharge the battery. That’s a big quality-of-life improvement over the original GH5, which required external charging.",
    "Due to the small physical size of the GH5 II’s Micro Four Thirds sensor, it’s not the greatest stills performer if you’re looking for superb low light performance or ultra-detailed landscape images. An APS-C, full-frame or medium format camera can easily outperform it in these areas.",
    "That being said, it can hold its own pretty well in most situations. The performance of its 5-axis in-body image stabilization system has been slightly improved over that of the GH5 (Panasonic claims it can now offer the equivalent of 6.5 stops of compensation) and that helps a lot with low light photography, as does the large extended ISO range of 100 to 25600.",
    "Despite having the same 20.3MP resolution, the sensor isn’t exactly the same as the GH5’s. Panasonic has added an anti-reflective coating this time around, which the company says reduces flare from bright light sources.",
    "Stills can be shot in raw format for those who want maximum post-production control, but even its fresh-from-camera JPEG images look engaging and lively. The GH5 II comes with a range of Photo Style picture profiles (the effects of which can also be applied to videos), including Standard, Vivid, Flat, Monochrome and V-Log L, and you can create up to four custom preset profiles if you want more control. In addition to that, there are 22 filters to add instant character to photos.",
    "Like the GH5 and GH5S before it, the GH5 II is packed to the gills with video shooting options. For starters, you can choose to record video in either MOV or MP4 formats, with either H.264 or H.265 compression. Video shooters actually get a fair few new options here, particularly where frame rates are concerned. You can now record 4:2:0 10-bit C4K and 4K video at 60/50fps and anamorphic 4:2:0 10-bit clips at 50fps. It's also possible to record internal 4:2:0 10-bit video while simultaneously outputting 4:2:2 10-bit video via HDMI for external recording.",
    "Recording in MOV offers the widest range of resolutions, frame rates and bitrates. Resolutions include C4K (4096 x 2160) and anamorphic 6K (4992 x 3744) as well as 'standard' 4K and 1080p Full HD. Frame rates available are 23.98fps, 24fps, 25fps, 50fps and 59.94fps when shooting standard video, and there’s also a Variable Frame Rate mode for fast- and slow-motion output. In VFR mode the sensor can capture video at much slower or faster speeds (up to 180fps), and when the resulting video is played back at standard frame rates, it looks either ultra-fast or smoothly slow.",
    "In MP4 you’re limited to 100Mbps or lower and just two resolutions: standard 4K (3840 x 2160) or Full HD (1920 x 1080). Frame rates available are 23.98fps, 25fps, 29.7fps, 50fps and 59.94fps.",
    "Both formats offer 8-bit and 10-bit options, with the highlights being the internal 10-bit 4:2:2 ALL-Intra and LongGOP settings. These offer the highest bitrates the camera can record internally, with the LongGOP being more compressed (150Mbps opposed to ALL-Intra’s 400Mbps). It therefore takes up less storage space (and is easier to work with on your computer in post-production), without being a noticeable step down in image quality.",
    "Video image quality is of an extremely high standard, especially considering the small sensor size of the camera. With minimal or no post-production editing, it’s possible to produce rich, detailed and dynamic clips. We wouldn’t say there’s a notable leap in quality over the GH5’s already impressive offering, however, so if you already use that camera for filmmaking don’t look to the GH5 II for a major upgrade."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Panasonic GH5 Mark II price and release date",
    "9": "Build and handling",
    "13": "Live streaming",
    "18": "Autofocus",
    "22": "Performance",
    "26": "Image quality",
    "30": "Video performance and quality",
    "35": "Don't buy it if..."
  },
  "links": {}
}