{
  "source": "https://www.techradar.com/reviews/chuwi-hi10-go-2-in-1-windows-tablet",
  "title": "Chuwi Hi10 Go 2-in-1 Windows tablet review",
  "category": "computing",
  "updated": "2021-11-11T17:42:28Z",
  "author": "desire-athow",
  "summary": "The first Intel Jasper Lake processor lands but is it worth the wait?",
  "verdict": "Chuwi’s Hi10 Go is a train wreck partly because of the N4500 that powers it. A dual processor inside a tablet in 2021 is an anachronism that shouldn’t happen while the use of eMMC storage is simply unwarranted.",
  "pros": [
    "Super bright screen",
    "Great value for money as a bundle"
  ],
  "cons": [
    "One of the Type-C connectors is USB 2.0",
    "Poor overall performance",
    "Poor battery life"
  ],
  "article": [
    "Like Marmite, 2-in-1 convertible tablets in a 10.1-inch form factor can be divisive. They are the most compact way to run WIndows 10 (and soon Windows 11) on the move and yet, for many, they come with too many compromises. It is Chuwi’s second attempt in less than a year as it toys with this category; the Hi10 XR was a half-hearted attempt at reviving a format Chuwi investigated in 2016 with the original Hi10and left to try new things like the Corebox Pro.",
    "The Hi10 Go feels like a much more mature product but is hampered by its choice of processor (a dual-core one) and storage subsystem (eMMC). The end result is a promising mobile device let down by a poor choice of components.",
    "The obvious alternative to the Chuwi Hi10 Go is the Microsoft Surface Go 2 which retails for 50% more (with or without accessories). It is heavier, has less memory or storage capacity and an older but faster processor. However, its battery life, enterprise features (including guaranteed upgrade to Windows 11) and expansive support options make it a more attractive choice for most businesses.",
    "The Chuwi Hi10 Go is available directly from Chuwi’s Aliexpress Store for $307 (about £230, AU$432), a price that includes a keyboard and the H6 stylus. The tablet, on its own, costs about $257 (£185, AU$347) Note that while shipping is included, you may have to pay extra import fees (levied by the couriers) and local taxes.",
    "The body of Chuwi’s latest Windows tablet is, according to the manufacturer, constructed using “6-series aviation aluminum alloy with a CNC sandblasted oxidation”. As such, it feels premium and solidly built with absolutely no flex.",
    "The display is a 10.1-inch fully laminated model with a full HD resolution and a 16:10 aspect ratio. There’s no oleophobic layer to minimize the impact of fingerprints on the viewing experience; therefore, it can and will get quite dirty. Note that there’s no Windows button which means that there’s no oversized bezel.",
    "All four sides have edges less than 10mm thick with a 2-megapixel perched on the top one. Speaking of edges, they’re all curvy and round, which is in sharp (pun intended) contrast to what the competition offers. The rear of the device contains a protruding 5-megapixel camera sensor.",
    "On the right hand side are located the ports (microSD card slot, two Type-C connectors (one is USB 2.0 but both can charge the device), an audio jack and a microHDMI one). On the opposite side are located the buttons, the power one and the volume rocker.",
    "The top edge houses a pair of microphones and upward-firing speakers, well hidden behind grills. At the bottom are POGO connectors for the clip-on keyboard cover.",
    "Note that there is no kickstand like Microsoft’s surface range. Instead, you will need to use another cover with an integrated stand which adds to the cost and weight.",
    "The biggest selling point of the Hi10 Go is the new processor that powers it, the Celeron N4500 which is based on the new Jasper Lake architecture. Launched earlier this year, it uses a newer 10nm lithography which in theory allows for higher burst frequencies and lower power consumption/dissipation.",
    "Shockingly though, Intel has decided to halve the number of cores and threads on the N4500, a move that could in theory, impact negatively on overall performance. Will that be the case? Read on. The two CPU cores are paired with an Intel UHD graphics processor graphics that has a far higher base frequency and 16 Execution units (25% than the previous generation).",
    "Elsewhere, there’s 6GB LPDDR4x system memory plus 128GB eMMC 5.1 system storage. Wireless connectivity is handled by a Realtek RF chip that offers Wi-Fi 5 technology and Bluetooth 5.1. Add in a 22.4Whr battery, a detachable keyboard, a plastic cover, 24W power supply unit and a HiPen stylus to complete the picture.",
    "Chuwi claims that the Hi10 Go display reaches 400 nits of brightness. Well, even if that’s true, the sheer glossiness of the display makes it very difficult to view content on the screen in sunny outdoors.",
    "The use of a dual-core processor, in this day and age where even entry level smartphones run on eight cores, is simply unacceptable. Single thread performance was adequate, easily the best amongst any Celeron processors to date, but was not enough to move it from the last position on our benchmark. The overall performance of the device was made worse by the use of eMMC memory which, at its best, is about half what SATA-based SSD can achieve.",
    "Battery life is reasonable for the form factor and for the battery capacity. Its small battery capacity (22.42WHr) lasted only 222 minutes in our test which shows that the tablet itself uses less power per unit time compared to anything we tested before. That’s because of the components it uses (eMMC, a small display, low power DDR memory and a 6W CPU).",
    "As for the typing experience, well, opting for a 10.1-inch form factor for such a task is akin to choosing a van for car racing. You can do it but it does come with big issues; touch typing is a pain because of the nature of Chuwi’s detachable, passive keyboard, the touch pad is barely usable (too small and not responsive enough). One bright spot though is the stylus which is a treat and works rather well with its 4096 levels of sensitivity.",
    "Buy it if:",
    "You want something small",
    "At less than 600g, it is one of the lightest Windows 10 tablets and works well as a convertible 2-in-1 tablet should you accept its physical limitations.",
    "You are shopping on a budget",
    "At just over $300 all inclusive, the Chuwi Hi10 Go is a fantastic budget buy for those looking for a device that can hit the ground running. Just make sure that you’re aware of its shortcomings.",
    "Don’t buy it if:",
    "You’re buying for business or work",
    "Businesses or anyone that aspires to use the Hi10 for work will use it at their own risks. Chuwi doesn’t offer the level of support that top manufacturers like Dell or Lenovo offer. There’s no next business day support, accidental or multiple-year warranty; options that are essential to keep businesses ticking.",
    "You need long battery life",
    "The size of the tablet meant that compromises had to be made and the battery capacity (and therefore the battery life) was one of them.",
    "You want a fast device",
    "The dual-core N4500 processor and use of eMMC memory mean that the Hi10 just won't offer the speed and performance most users have come to expect from a device running Windows 10."
  ],
  "headers": {
    "0": "Two minute review",
    "3": "Pricing and availability",
    "4": "Design",
    "10": "Hardware",
    "13": "Performance and in use",
    "17": "Should I buy the Chuwi Hi10 Go?"
  },
  "links": {
    "Hi10 XR": "https://www.techradar.com/reviews/chuwi-hi10-xr-2-in-1-convertible-tablet",
    "Hi10": "https://www.techradar.com/reviews/pc-mac/tablets/chuwi-hi10-windows-tablet-1315022/review",
    "Corebox Pro": "https://www.techradar.com/reviews/chuwi-corebox-pro-mini-workstation-pc",
    "Microsoft Surface Go 2": "https://www.techradar.com/reviews/microsoft-surface-go-2",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Chuwi Hi10 Go": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-7283450311117950000&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F1005002897611872.html"
  }
}