{
  "source": "https://www.techradar.com/reviews/tp-link-smart-wi-fi-plug-with-energy-monitoring-hs110",
  "title": "TP-Link Smart Wi-Fi Plug with Energy Monitoring HS110 review",
  "category": "smart-home",
  "updated": "2021-06-03T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Control your electrical devices when you’re away from home, and review how much energy they’re using too",
  "verdict": "The TP-Link Smart Wi-Fi Plug with Energy Monitoring HS110 is an affordable smart plug that allows you to control any electrical appliance connected to it from your smartphone, even when you’re not at home. It integrates with Alexa and Google Assistant, and will even keep track of the energy consumption of the device connected to it – but it’s a bulky device and doesn’t come with support for HomeKit.",
  "pros": [
    "Simple to use",
    "Energy monitoring feature",
    "Compatible with Alexa and Google Assistant"
  ],
  "cons": [
    "Bulky design",
    "No HomeKit support"
  ],
  "article": [
    "TP-Link has been associated with networking products such as routers and powerline adapters for more than 20 years. However, in 2015, the brand also turned its attention to the best smart home devices, now offering a range of affordable gadgets to automate your home – from the best smart light bulbs and home security cameras to smart plugs.",
    "The Smart Wi-Fi Plug with Energy Monitoring HS110 is TP Link’s top-of-the-range single-socket smart plug, which not only allows you to control any device plugged into the socket from your smartphone, but you can do so even when you’re not at home. This is great news if you’ve realised after leaving the house that you may have left your radio or your straighteners on. The Smart Wi-Fi Plug with Energy Monitoring HS110 is also compatible with Alexa and Google Assistant, so you can use your voice to control it. In addition, it will even keep track of the energy consumption of any devices plugged into it.",
    "Like all smart plugs, the TP-Link HS110 connects to your home Wi-Fi network and allows you to turn it on and off through the Kasa app. You can also set timers and schedules for when the plug should be switched on or off. If you have other TP-Link smart home devices, it can be grouped together with said devices through the app, so several devices can be controlled at once.",
    "The TP-Link Smart Wi-Fi Plug with Energy Monitoring HS110 is priced at $24.99 / £15 / AU$27, and is available worldwide through Amazon and a selection of electrical retailers.",
    "TP-Link also offers a version of this smart plug without energy monitoring, which comes in at $16.99 / £10 / AU$19.99",
    "The TP-Link Smart Wi-Fi Plug with Energy Monitoring HS110 is one of the bulkier smart plugs we’ve reviewed, measuring 3.9 x 2.6 x 2.5 inches / 10.03 x 6.63 x 6.4 mm (h x w x d). Made from white plastic and oval in shape, it’s a plain device, but its chunky design means it’s fairly noticeable when plugged into an electrical outlet – particularly if the outlet is finished in chrome. Note, too, that if it’s plugged into a vertically aligned dual-power outlet, the top outlet will be unusable if the smart plug is placed in the bottom position; however, plugged in horizontally aligned outlets, it won’t obstruct the use of other sockets.",
    "On the front of the plug you’ll find a single socket and a power button that glows green when the plug is switched on. A tiny Wi-Fi icon above this also glows green when connected to your network, or orange if it has encountered any issues. On the top of the plug is a tiny Settings button that’s used to initiate set-up mode or a factory reset. The plug only supports 2.4GHz, so those installing it in a different room to their router may find they suffer connection issues.",
    "Setting up the TP-Link Smart Wi-Fi Plug with Energy Monitoring proved relatively easy, simply plugging the device into an electrical outlet that’s switched on, then downloading the Kasa app. Adding the device to the app took a couple of minutes; we had to connect our phone to the plug’s own Wi-Fi network before it was detected by the app. We welcomed the fact that for each step of the installation, a help option in the app was visible; if tapped, it would provide information in those instances set-up wasn’t going to plan.",
    "Once set-up was complete, interaction with the device itself was minimal, with everything done through the Kasa app. Throughout testing, the plug responded instantly when we used the app to control it, making a reassuring click every time it was switched on or off.",
    "The Energy Monitoring function details the consumption in kilowatt-hours (kWh) and hours for the day in question, as well as the past seven and 30 days, with a running total from the point it was set up. However, we were disappointed that there’s no way to add the price per kWh to provide a monetary value of your energy usage – something that is possible with rival smart plug, Eve Energy.",
    "However, the Away mode was useful, allowing you to turn the smart plug on and off at random intervals. This is great if you have a lamp connected to the smart plug and want to have it come on and off to give the appearance you're at home, even though you may not be.",
    "The Kasa app is simple to navigate. Launch the app and you’ll be presented with a screen that displays all of your TP-Link smart home devices. For the smart plugs, you can tap the power icon to the right to switch the smart plug on or off, or create a group of devices that can be controlled at one time.",
    "Selecting the device itself will bring up a number of options, including the ability to set a timer, schedule, activate ‘Away’ mode, or check the energy consumption. The Scenes tab lets you create automations that can be actioned by uttering a specific word or phrase, while Smart Actions ensures you can create automations based on motion-sensing from TP-Link cameras, or schedule when a certain scene should be activated.",
    "The app also allows you to integrate the smart plug with Amazon Alexa, Google Assistant, IFTTT and SmartThings. The only service missing here is Apple HomeKit.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "3": "TP-Link Smart Wi-Fi Plug with Energy Monitoring HS110 price and availability",
    "5": "Design",
    "7": "Performance",
    "11": "App",
    "14": "Don't buy it if..."
  },
  "links": {
    "routers": "https://www.techradar.com/news/networking/routers-storage/best-router-9-top-wireless-routers-on-test-1090523",
    "powerline adapters": "https://www.techradar.com/news/the-best-powerline-adaptors",
    "best smart light bulbs": "https://www.techradar.com/news/best-smart-lighting",
    "home security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "smart plug": "https://www.techradar.com/news/best-smart-plugs-and-switches"
  }
}