{
  "source": "https://www.techradar.com/reviews/dell-xps-8940-special-edition-review",
  "title": "Dell XPS 8940 Special Edition review",
  "category": "computing",
  "updated": "2021-04-05T19:24:43.401Z",
  "author": "john-loeffler",
  "summary": "Compact. Powerful. Gorgeous.",
  "verdict": "The Dell XPS 8940 Special Edition desktop PC matches a highly customizable system across a wide range of price points with a solid build, compact form factor, and and gorgeous design. This is a Dell desktop PC at its best.",
  "pros": [
    "Gorgeous design",
    "Affordable extry-level build",
    "Powerful high-end build",
    "DVD or Blu-Ray drive option"
  ],
  "cons": [
    "Best configuration is expensive",
    "Keyboard/Mouse are basic",
    "Not available in the UK/AU",
    "Cards larger than RTX 3070 won't fit"
  ],
  "article": [
    "The Dell XPS 8940 Special Edition desktop PC is the kind of PC that made Dell such a dominant player in the computer market. Matching its well-earned reputation for building solid, stable, and powerful systems with an increasingly keen eye for elegant design, this PC is definitely one of the best PCs Dell has ever produced.",
    "This is a Dell, so this is definitely more at home in an office or a campus library than an eSports tournament. That said, the higher end configurations can get you some pretty powerful hardware – up to an RTX 3070 and an Intel Core i9-11900K – so it will game with the best of them.",
    "The abundance of ports on both the front and the back make it an excellent workstation with plenty of options for USB peripherals, a full-sized SD Card slot, an easily accessible USB Type-C port on the front, and even an optional DVD drive – upgradable to Blu-Ray – for those times when you still need to install software from a CD or even burn data/video to a disc.",
    "The real showstopper is the chassis. It's simply a beautiful PC, as far as office systems go. You won't get anything of the razzle dazzle of RGB lighting like with other systems, but this is definitely a more elegantly designed PC than the black monolith look of most XPS desktops.",
    "The keyboard and mouse are standard issue Dell keyboard and mouse combo, and while they match the look of the system itself, they are absolutely adequate for the job at hand but nothing beyond that. There's nothing wrong with swapping these out for the best keyboard and best mouse that suits your tastes.",
    "To get the most out of the Dell XPS 8940 Special Edition, you're going to have to spend some money though, with more than $2,000 separating the entry-level configuration from the highest end build, but that also means that there is an XPS 8940 Special Edition model for just about every price point, and none of them are lightweights when it comes to hardware for the price.",
    "If you are looking to replace the family computer, upgrade your home office space, outfit or upgrade your business or organization's workstations, or simply want a powerful computer without turning your desk space into a carnival, than we can't recommend the Dell XPS 8940 Special Edition highly enough.",
    "The Dell XPS 8940 Special Edition is available now on Dell's website, with a wide range of configuration options to choose from. With the release this month of Intel's Rocket Lake-S processors, all of the Dell XPS 8940 models have upgraded to the 11th-generation chips, while the model we tested used the 10th-generation Intel Core i9-10900K, otherwise, there was no other difference.",
    "In the US, the base configuration starts at $1,099 (about £790, AU$1,430), and comes with an Intel Core i5-11400, the Nvidia GeForce GTX 1650 Super, 360W Mineral White chassis with DVD R/W-drive, 8GB DDR4 RAM, a 256GB SSD with a 1TB hard drive, and Windows 10 Home.",
    "The highest-end US configuration sells for $3,424 (about £2,460, AU$4,470) and features an Intel Core i9-11900K, an Nvidia GeForce RTX 3070, 500W Mineral White chassis with Blu-Ray drive, 64GB DDR4 RAM, a 2TB SSD with a 7200RPM hard drive, and Windows 10 Pro.",
    "Unfortunately, the Dell XPS 8940 Special Edition is not available in the UK or Australia, but the standard Dell XPS desktops are with similar specs and somewhat comparable pricing, starting from £799/AU$1,608 and going as high as £1,999/AU$3,298.",
    "The design of the Dell XPS 8940 Special Edition is one of its biggest appeals. The compact form factor – for a desktop – makes it easy to work into just about any workspace set up you have.",
    "The several ports on the front of the PC – including a USB Type-C port and an SD card slot – make it very versatile regardless of the kind of work you're using it for and the large number of back-facing ports mean it can handle whatever you throw at it.",
    "The inclusion of a DVD/Blu-Ray drive is also pretty handy and isn't something you see a lot of these days, even though some business software and records still use the disc format. Long-term solutions are important for enterprise users especially, but are just as relevant for home users who might have a ton of software or data they still need to access.",
    "Moving away from function, the chassis is beautiful. The Dell XPS 8940 Special Edition's Mineral White chassis is a definite change of pace from the characteristic black chassis on most Dell computers. In fact, the XPS 8940 Special Edition immediately reminded us of the Dell XPS 13, which is easily one of the best laptops we reviewed last year in large part because of its design, making this model an excellent complement as a desktop counterpart.",
    "Given the hardware in the configuration we tested, it's no surprise that the Dell XPS 8940 Special Edition scores very high in our benchmarks. This is thanks to the RTX 3070 and Intel Core i7-10700K CPU, but there is something to be said about building a stable system to get the most out of these two key pieces of hardware.",
    "The Lenovo Legion Tower 5i we reviewed late last year had the same CPU and scored nearly as high as the XPS 8940 Special Edition in Geekbench 5, though the XPS consistently squeezed out 50-60 more points in our tests. It's not blowing the Legion Tower 5i out of the water, but a consistent lead is a consistent lead.",
    "The RTX 3070 obviously shines, scoring very well in our 3DMark tests, as we expected. While the RTX 3070 lags behind the RTX 3080 and RTX 3090, it's no slouch when it comes to content creation and gaming.",
    "In our Metro: Exodus benchmark, the XPS Tower Special Edition averages 170 fps on low settings at 1080p, 87 fps on ultra settings at 1080p, and manages 74 fps on ultra settings with ray tracing turned on.",
    "In our Total War: Three Kingdoms battle benchmark, the Dell XPS 8940 Special Edition pumped out 278 fps on low settings and 97 fps on ultra settings, both in 1080p."
  ],
  "headers": {
    "0": "Two minute review",
    "7": "Price and availability",
    "11": "Design",
    "15": "Performance",
    "20": "Don't buy it if..."
  },
  "links": {
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Intel Core i9-11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "best keyboard": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011",
    "best mouse": "https://www.techradar.com/news/computing-components/peripherals/what-mouse-10-best-mice-compared-1027809",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Lenovo Legion Tower 5i": "https://www.techradar.com/reviews/lenovo-legion-tower-5i",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}