{
  "source": "https://www.techradar.com/reviews/lg-cx-oled-tv",
  "title": "LG CX OLED TV (OLED65CX) review",
  "category": "televisions",
  "updated": "2021-12-03T10:13:37Z",
  "author": "john-archer",
  "summary": "No longer the newest, the LG CX OLED remains one of the best TVs on the market",
  "verdict": "LG OLED TVs have always been good – great, even. With the LG CX OLED, though, LG has truly outdone itself, as a host of small but important improvements add up to a TV experience movie fans will struggle to tear their eyes from.",
  "pros": [
    "Stellar picture quality",
    "Gorgeous super-slim design",
    "Strong gaming features",
    "Good value for OLED"
  ],
  "cons": [
    "Heavy bass can distort",
    "No HDR10+ support",
    "Missing UK catch-up apps",
    "Requires careful use"
  ],
  "article": [
    "UPDATE: There's a better TV in town! The LG CX OLED has been succeeded by the LG C1, an iterative update with a new processor and upgraded interface. The changes are pretty small, though, so anyone looking for the most bang for their buck may want to consider opting for 2020's LG CX model regardless – and you can read all about it below.",
    "The LG CX OLED TV might not look like a huge step forward in comparison to the LG C9. However, under the hood, LG has done a great job at focusing on the flaws that we saw in the previous model.",
    "What that means is that the LG CX OLED TV is substantially better in every way. The result is an extremely engaging cinematic performance that gives movies and TV shows the loving treatment they truly deserve.",
    "Significant changes to the Alpha a9 Gen 3 Processor have cleared up any issues leftover from the LG C9 OLED, too – as well as improving the way that faces are displayed by the chip's processing.",
    "While the LG CX OLED has since been surpassed by the more recent model, the LG C1 OLED, the CX is still a fantastic TV to buy, and remains a great pick for gamers who own the PS5 or Xbox Series X and want one of the best gaming TVs.",
    "The LG CX OLED comes in a mix of sizes, from a new-for-2020 48-inch size to a massive 77-inch screen. The 48-inch model now retails at $1,299 / £1,099, with the largest 77-inch size now retailing for $2,999 / £2,999.",
    "It's the 65-inch model we reviewed, which originally retailed for $2,499 / £2,799 (around AU$3,800) but has since dropped to just $1,899 / £1,799 – roughly the original RRP of the 55-inch model.",
    "Increasingly hard to find now it's been superseded, you may see it at a considerable discount in some places.",
    "The OLED65CX is gorgeous. The star of the show, as usual with OLED TV technology, is how incredibly thin its screen is: for around two-thirds of its rear area it’s insanely skinny – just a couple of millimetres deep. Though of course, unless you’re fond of looking at the back of your TV rather than the front, you probably won’t notice this much once you’ve installed the set for the first time.",
    "The bottom third or so of the OLED65CX’s rear sticks out quite a bit more than the rest. But the design still wears this pretty well - and the set’s speakers, connections and processors do have to go somewhere.",
    "The screen attaches to one of the centrally mounted metallic sheet stands we’ve seen for a few C-series generations now. This is nicely finished and well built, but perhaps looks a touch chunky compared with the incredible slimness elsewhere.",
    "Connections on the OLED65CX are plentiful and well specified - especially when it comes to HDMIs. There are four, all capable of handling 4K at up to 120Hz in 10-bit HDR with 4:4:4 chroma sampling. Something which might become important with the next generation of games consoles.",
    "One of the HDMIs can also support ARC/eARC (audio return channel), so that the TV can output Dolby Atmos from streaming services or 4K Blu-rays to compatible soundbars or AV receivers.",
    "One last design point worth mentioning is the OLED65CX’s remote control. This is one of LG’s so-called Magic remotes, meaning you can point it at onscreen menu options rather than having to use cursor buttons to navigate all the menus. There’s also a spinning wheel in the remote’s center that lets you quickly cycle through vertical menu lists.",
    "The point and click approach can be a bit imprecise, and the stiffness of the scrolling wheel can cause you to accidentally press it (for select) rather than just spinning it. But it’s still overall a winning remote control design.",
    "Design TL;DR: The LG OLED65CX’s mind-bending slimness makes it a stunning addition to any living or home cinema room.",
    "Like the rest of LG's OLED TV lineup, the LG OLED65CX inevitably deploys LG’s WebOS interface for its smarts. As usual, this is mostly a very good thing. The economical, no-nonsense home screen, with its row of icons connected to different content sources, is instantly accessible and easy to use and customize.",
    "Highlighting one of the main content apps usually brings up a second tier of icons containing direct access to shows or films from the app you’ve highlighted. Though this feature only works with apps that have worked with LG to enable it.",
    "I guess the sheer volume of content apps available these days could make WebOS’s long scrolling bar of apps a bit unwieldy for some content-hungry households. But this is a small negative against all the good stuff.",
    "It’s worth adding, too, that LG also leads the way when it comes to voice recognition, with the OLED65CX supporting LG’s own ThinQ AI platform, Amazon Alexa and Google Assistant. Support for all these is built in, too, which means there’s no need for an external listening device.",
    "In terms of supported apps, you'll find relative new additions to the streaming landscape such as Disney+ and Apple TV+, as well as all the usual suspects like Hulu, Netflix and Amazon Prime.",
    "The most gimmicky of webOS' new features is the Sports integration where, if you tell the CX what your favorite sports teams are (from a preset list), the TV will give you score updates and remind you when broadcasts featuring your team are coming on. It's not super useful unless you're a sports fanatic, but it doesn't detract from the experience either.",
    "The Home Hub screen that provides info on and control over other smart devices on your network benefits from an improved layout, and you can now customize the icons that appear when you press the Settings button. You can also customise how often the TV gives you onscreen prompts to help you discover new features and, perhaps most usefully, the Recommendations system for helping you find new things to watch has been improved and made more readily accessible.",
    "Smart Features TL;DR: LG’s webOS system continues to be slick and easy to use.",
    "OLED TVs have always being particularly well suited to standard dynamic range (SDR) technology. So it’s no surprise to see the OLED65CX looking stunning with every SDR Blu-ray or broadcast we threw at it.",
    "Colors are rich and vibrant, but also nuanced and balanced. Contrast is pretty much perfect, as OLED’s ability to have every single pixel produce its own light brings out shadow details and dark tones with a degree of intensity and authenticity LCD screens can’t match.",
    "The color and contrast performance are both founded on a spectacular black level performance that’s free of the greyness and localized clouding problems you get with pretty much all LCD TVs. Just as importantly, bright highlights of mostly dark images retain a consistent level of intensity. There’s no sacrificing of any of their brightness to keep the dark areas around them looking neutral, as you often see with premium LCD TVs that use local dimming.",
    "In short, the OLED65CX’s deft touch and per-pixel light reproduction ekes out every drop of quality from SDR content. And with high quality SDR sources such as a good Blu-ray, you may well be amazed at just how much the limited color and light range of SDR can deliver when a TV is good enough to unlock it all.",
    "LG has also improved its upscaling. Presumably thanks to the new AI-based upscaling engine introduced by LG’s new third-generation Alpha 9 chipset, there’s a cleaner, more consistent and more detailed look to HD content after it’s been converted to the screen’s native 4K resolution.",
    "The improved upscaling is particularly effective in the most detailed areas of HD pictures, which look noticeably cleaner and more densely textured than they did last year. In fact, in these areas, at least, LG’s upscaling is as good as anything I’ve seen from any 4K TV to date.",
    "HD/SDR Performance TL;DR: The peerless per-pixel light control of OLED technology joins with improved LG picture processing to make the OLED65CX’s SDR/HD pictures a joy to behold.",
    "Great though the OLED65CX is with HD SDR images, it’s the improvements it brings with 4K and HDR images that really count in the premium TV world.",
    "For starters, the OLED65CX’s black level performance improves on 2019’s LG C9 OLEDs in two ways. First, black levels get even deeper, and retain that depth and neutrality more consistently. Just occasionally a really extreme dark shot can suddenly appear infused with a low-level yellowish-grey tone. This is faint though, and doesn’t occur very often at all.",
    "Second, the CX combines its improved black levels with more shadow details and dark color shading subtlety than last year’s B9s (which actually delivered deeper blacks than the more expensive C9s). So basically the CX’s handling of black level and dark scenes combines the best bits of both the B9 and C9. And the results are beautiful.",
    "The OLED65CX also suffers less with noise in dark areas and much less with exaggerated compression blocking artefacts when viewing dark scenes on some streamed shows than previous LG OLEDs have. The blocking has been reduced, too, without the loss of shadow detail that was created by LG’s early attempts to fix this widely publicized blocking phenomenon.",
    "The LG OLED65CX also improves on its predecessors at the opposite end of the brightness spectrum. For while it doesn’t actually measure any brighter than last year’s models using an HDR test signal (just over 800 nits in Vivid mode, or 784 and 760 nits in the more natural Standard and Cinema modes), side by side comparisons reveal that bright peaks in HDR pictures look punchier on the OLED65CX than they did on the OLED65C9. It’s not a night and day difference, but it’s enough to make HDR pictures look more intense, expressive and realistic.",
    "Talking of local contrast, the way the OLED65CX really can put the brightest pixels of an HDR image right next to the darkest ones without any sort of compromise. So unlike with LCD TVs, contrast-rich scenes don’t suffer with such distracting inconsistencies as sudden fluctuations in overall brightness, heavy dimming of small stand-out bright image elements, or obvious bands or haloes of light around stand-out bright objects.",
    "The OLED65CX improves LG’s color performance, too. The enhanced brightness management, for instance, helps the brightest colors of HDR images retain a more natural look. Washes of color across the screen look more consistent. Color blends look more consistently subtle and nuanced, with more tonal subtlety retained in the brightest picture areas.",
    "Native 4K pictures look blisteringly sharp and detailed too, without the clarity looking forced or artificial (so long as you avoid the Vivid picture preset, anyway).",
    "The detail doesn’t take a heavy hit when there’s motion to handle either. The OLED65CX’s latest motion processor - at least in its Cinema Clear setting - does a good job of reducing judder without causing the picture to either look too fluid, or throwing up too many unwanted side effects.",
    "Very complex motion, such as small objects moving within a panning image, can still cause a few glitches. So AV enthusiasts will be pleased that turning the motion processing system off finds the OLED65CX suffering less panel-related judder than previous LG OLED generations.",
    "4K/HDR Performance TL;DR: A roster of small but ultimately telling improvements make the OLED65CX a brilliantly immersive screen.",
    "The OLED65CX boasts two new picture modes: The Filmmaker Mode has arrived through a collaboration between the UHD Alliance and movie creatives, and is designed to recreate on the TV the sort of settings creators use when mastering content. Broadly speaking, this means turning many of the TV’s picture processing tools off, resulting in pictures which some may find a little juddery, and too dull to watch in a bright room. There’s also not much difference at all, in truth, between Filmmaker Mode and LG’s Cinema Home preset.",
    "Where Filmmaker Mode might become more interesting is if discs start carrying the flags needed to turn the OLED65CX’s version of Filmmaker Mode on automatically. Though I’m yet to hear of any disc that carries such flags.",
    "The other new picture mode is Dolby Vision IQ. This is essentially a Dolby Vision mode that combines the extra HDR picture information and screen optimisation elements of Dolby Vision HDR with an assessment of room conditions provided by a built-in light sensor. The idea being to adjust multiple aspects of the picture in real time to make sure the resulting image achieves a consistent look no matter how much your viewing conditions change.",
    "Note that LG doesn’t actually label a picture preset ‘Dolby Vision IQ’. The mode kicks in if you have both the Dolby Vision Cinema Home mode and LG’s AI Brightness feature active. The mode works well if the TV is in a fairly regular living room environment, where the TV is likely to get watched in a wide variety of lighting situations. In a dark dedicated movie room, though, you won’t need it.",
    "The OLED65CX is not, inevitably, perfect. For instance, it doesn’t support the HDR10+ HDR system designed as a rival for Dolby Vision. It also doesn’t miraculously overcome the brightness limitations associated with OLED technology – even though its outstanding local contrast compensates massively for that. There’s still a little room for further improvement with its handling of near-black imagery too, and its screen can be quite reflective of bright objects in your room.",
    "That said, the LG OLED65CX is an excellent gaming display. In its Game mode it only suffers with a puny 13ms of input lag. And unlike some LCD TVs, calling in its Game preset doesn’t lead to any obvious reduction in color and contrast performance. There’s support for both automatic low latency mode switching and variable refresh rates too. The PS5, Xbox Series X, and next-gen PCs can make use of the OLED65CX’s 4K/120Hz/4:4:4/HDR support.",
    "Of course, as with any OLED TV you’re expected to take some care with what you watch on it to reduce the possibility of permanent image retention. In particular, try to avoid spending too long at any one time watching content with bright logos or static bright image elements.",
    "In most ways the new CX Series sounds superb – especially when it comes to the volume levels and the scale of the soundstage it somehow manages to cast out from its incredibly skinny body: there’s genuine width and even some verticality to the sound the set produces, especially if you ditch the default Dolby Atmos sound setting and use LG’s excellent AI Sound Pro option instead. This mode optimizes the sound to the capabilities of the TV’s speakers, and the result is a much more dynamic, loud and impactful sound.",
    "The only issue we had with the OLED65CX’s audio is that really heavy duty bass in a movie soundtrack can cause the speakers to start crackling and dropping out. Fortunately there isn’t much content around that’s extreme enough to cause this problem, so the strengths of the sound system typically rein supreme. The bass crackle is certainly distracting when it happens, though.",
    "The LG OLED65CX is an outstanding TV – especially if you’re a serious film fan prone to dimming the lights for movie nights. It doesn’t reinvent the OLED wheel, but the small improvements it makes in a number of areas add up to a pretty profound impact on how much you get lost in whatever it is you’re watching. And if that isn’t the definition of a great TV, I don’t know what is."
  ],
  "headers": {
    "0": "One minute review",
    "5": "Price and release date",
    "8": "Design",
    "16": "Smart TV (webOS with ThinQ AI)",
    "24": "HD/SDR Performance",
    "31": "4K/HDR Performance",
    "42": "New picture modes",
    "49": "Audio performance",
    "51": "Final verdict"
  },
  "links": {
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "LG C9": "https://www.techradar.com/reviews/lg-c9-oled-oled55c9-oled65c9-oled77c9",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "LG C1 OLED": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "gaming TVs": "https://www.techradar.com/news/best-gaming-tv",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book"
  }
}