{
  "source": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-carbon-gen-9",
  "title": "Lenovo ThinkPad X1 Carbon Gen 9 review",
  "category": "computing",
  "updated": "2021-08-10T15:54:20Z",
  "author": "john-loeffler",
  "summary": "The ultralightweight champ defends its title",
  "verdict": "The Lenovo ThinkPad X1 Carbon delivers outstanding performance in an incredibly thin, lightweight, and stylish package, showing once again why the X1 Carbon is one of the best Ultrabooks ever made – if you're willing to pay for the best.",
  "pros": [
    "Incredible performance",
    "Phenomenal battery life",
    "Highly portable",
    "Very stylish"
  ],
  "cons": [
    "Expensive",
    "Integrated graphics struggle with creative workloads"
  ],
  "article": [
    "The Lenovo ThinkPad X1 Carbon Gen 9 is the latest refresh of one of the most popular business laptops out there and this year's model shows why it's such a desirable machine. For those who need to get outstanding performance on the go in a highly portable (and stylish) package – whatever the cost – the X1 Carbon needs to be the first laptop you pick up and consider.",
    "When it comes to the design of the X1 Carbon Gen 9, Lenovo further refined its already phenomenal predecessors by adding 11th-gen Intel processors and Intel Evo-certification, providing the outstanding performance, battery life, start up time, and security features that the Evo-certification entails.",
    "What remains the same are all of the parts we like about the X1 Carbon line, including the lightweight carbon fiber chassis with its super-slim profile, outstanding keyboard, top-notch security features, top-firing speakers, and enough ports to embarrass many of the best Ultrabooks on the market that claim you can only fit one or two USB Type-C ports onto a chassis so thin.",
    "The 14-inch display is fantastic, even at 1200p, and multi-touch support is worth the upgrade as the ThinkPad X1 Carbon can still fully open to 180 degrees to lay flat on a table, making it easy to collaborate with colleagues when needed.",
    "The 4K display is also an option, but honestly, at this size you'll barely be able to tell the difference, so you'd be better off putting that extra money towards more RAM, which will make this even more of a powerhouse that it already is.",
    "We can't leave off without noting that the battery life on the Lenovo ThinkPad X1 Carbon Gen 9 far surpasses its rivals, like the Razer Book 13, Dell XPS 13, and even its siblings like the Lenovo ThinkPad X1 Nano.",
    "This is an all-day, away-from-an-outlet ultrabook that can easily go the entire day moving from conference room to conference room at major conventions without missing a beat. What's more, you'll only need 15-30 minutes plugged in to get another few hours of battery life out of the X1 Carbon thanks to its rapid charge battery.",
    "All this comes at a cost, however, and the ThinkPad X1 Carbon definitely isn't cheap. It's also not for professional, especially creatives. The integrated Intel Iris Xe graphics are great for modest video playback and conferencing, light multimedia creation like slideshows for a presentation, or working with documents, spreadsheets, and databases. Without a discrete GPU, it will struggle with creative workloads, especially the more heavy duty work like video editing and encoding.",
    "When all is said and done, though, if you are a business professional who expects to be on the move far more often than not and you need one of the best business laptops you can find, then you should be taking a long hard look at the Lenovo ThinkPad X1 Carbon Gen 9 and asking if its rivals really even come close to matching it.",
    "The Lenovo ThinkPad X1 Carbon Gen 9 is available now in the US, UK, and Australia, starting at $1,426, £1,499, and AU$2,089, respectively.",
    "In the US, the base model starts out with an Intel Core i5-1135G7 processor running Windows 10 Home, 8GB LPDDR4X RAM, 256GB PCIe SSD, 720p webcam without IR, and a 14-inch 1200p display (16:10) with up to 400 nits brightness. In the UK, the base model is slightly different in that it comes loaded with Windows 10 Pro, 16GB LPDDR4X RAM.",
    "The Australia base model is also slightly different from the US base model in that it comes with an Intel Core i5-1145G7 processor instead of the i5-1135G7, and it only comes with a 1-year warranty, rather than a 3-year warranty that covers the US and UK models.",
    "The Lenovo ThinkPad X1 Carbon Gen 9 is also very customizable through Lenovo's site, so you have a lot of options to choose from. The configuration we tested runs about $2,008 / £1,869 / AU$2,868.",
    "The maximum currently available configuration in the US, meanwhile, has an Intel Core i7-1185G7 with vPro running Windows 10 Pro, 32GB LPDDR4X RAM, a 1TB PCIe SSD, and a 14-inch, 16:10 4K non-touch display with up to 500 nits of brightness for $2,715. The UK and Australia models can max out at 2TB PCIe SSD with the same specs otherwise for £2,669 / AU$4,592.",
    "The Lenovo ThinkPad X1 Carbon Gen 9 is as pretty as it has ever been, thanks to its carbon fiber chassis and modest but stylish presentation. The all-black carbon fiber lid with its ThinkPad X1 logo in the corner (with a familiar red LED dot above the 'i') definitely has a different aesthetic than a MacBook Air, but that's definitely a point in its column. If this laptop could wear a tie, it would, and it would look damn good in the process too.",
    "Like with pretty much every Lenovo laptop keyboard, the X1 Carbon is a dream to type on, with excellent key travel, roomy key spacing, a responsible cursor button and mouse buttons over the trackpad, as well as a responsive trackpad for those of us who could never quite get the hang of the bright red button on most business laptops.",
    "All those roomy keys doesn't get in the way of putting a pair of top firing speakers on either side of the keyboard deck, giving remarkably good sound quality for a laptop this size. If Lenovo can do it, so can everyone else, and we really wish they would.",
    "Speaking of other Ultrabooks whining that they can't fit something onto a chassis so small, the Lenovo ThinkPad X1 Carbon Gen 9 is just 0.59-inches thick (8.72 mm), yet somehow manages to squeeze in not just two USB Type-C ports like a lot of recent ultrabooks, but two USB Type-A ports and an HDMI 2.0 connector in addition to a Kensington lock and a 3.5mm combi jack. What's everyone else's excuse?",
    "An Ultrabook this thin and light shouldn't have this kind of performance, not really. While it's graphics performance is a bit underwhelming compared to more powerful – and bigger – laptops, among Ultrabooks its only real challenger is the Asus ZenBook 13 (2021), which is running a Ryzen 7 5800U processor.",
    "On certain benchmarks that rely heavily on multicore performance, like PCMark 10, GeekBench 5, and CineBenchR23, the AMD processor in the ZenBook 13 is unquestionably better.",
    "In CineBench, the ZenBook 13 scored an impressive 7,773 to the X1 Carbon's 5,389; in GeekBench 5's the ZenBook 13 put up a 6,824 to the X1 Carbon's 5,506; and in PCMark 10, the ZenBook 13 scored 5,963 to the X1 Carbon's 5,168.",
    "The ZenBook 13 also beat the X1 Carbon by a healthy margin in our creative benchmarks using Blender, with the ZenBook 13 rendering Fishy Cat and Classroom roughly 30% faster.",
    "Meanwhile, the X1 Carbon is still well ahead of just about any other rival Ultrabook on these same tests, even those running the same i7-1165G7 processor like the Razer Book 13, and on every other benchmark, the X1 Carbon trounces the ZenBook 13 by an equally wide margin.",
    "What this ultimately means is that while the ZenBook 13 is going to be a better multitasker overall and is definitely going to chew through multiple concurrent workloads, when it comes down to brass tacks and you need to put some serious computing power into your work for an extended stretch, the X1 Carbon is going to get you across the finish line quicker.",
    "When it comes to battery life, there's no question that the Lenovo ThinkPad X1 Carbon Gen 9 is about as good as a laptop battery life gets without running an ARM chip – and even then, it's competitive against the newest MacBook Air running the ARM-based Apple M1 chip.",
    "The fact that the X1 Carbon's only real competition here is an entirely different processor architecture build around energy efficiency pretty much speaks for itself. Against its rival Intel or AMD processors, the X1 Carbon squeezes more life out of its 57Whr battery than we thought possible.",
    "It lasted 15 hours and seven minutes, on average, during our PCMark 10 battery test, with the ZenBook 15 falling more than an hour short at 13 hours 50 minutes even with a significantly larger 67WHr battery.",
    "Last year's Dell XPS 13, meanwhile, managed just 11 hours 47 minutes, and the Razor Book 13 made it 11 hours 42 minutes, both with batteries roughly comparable (though still smaller) than the X1 Carbon's.",
    "All we can say is we have no idea where the X1 Carbon is getting that extra juice from, but you love to see it.",
    "We're not yet at the point where 1080p cameras are standard for laptop webcams, so the 720p webcam on the Lenovo ThinkPad X1 Carbon Gen 9 is par for the course. It's not something we can really fault the ThinkPad X1 Carbon for since it's an industry wide problem and we've collectively decided that thinner bezels were better than a higher resolution webcam.",
    "For what it is, it's fine for teleconferencing thought proper lighting will be tricky. You can upgrade to an IR 720p camera that you can use with Windows Hello to log in effortlessly as well, and is probably worth the investment.",
    "It's always, always, worth noting that the webcam has a physical privacy shutter that you can slide over the webcam. Even for a basic consumer laptop at this point, a physical cover for your webcam should be non-negotiable, but for a business laptop, it's a deal breaker. Fortunately, Lenovo has been well ahead of its rivals in this regard and we're happy to see that trend continue.",
    "The microphone array for the ThinkPad X1 Carbon, meanwhile, is clear enough to carry us through during meetings and interviews, but there's not much to note here as laptop microphones are never going to be as good as a professional mic set up.",
    "Fortunately, there wasn't much in the way of bloat on the Lenovo ThinkPad X1 Carbon Gen 9, which we honestly didn't expect anyway owing to it being a much more premium business laptop.",
    "There are a host of security features that pretty much come standard with the ThinkPad line, including Windows Hello and fingerprint log in, and for the sake of future-proofing, the ThinkPad X1 Carbon does come with TPM 2.0 so it's ready for Windows 11 when that releases later this year."
  ],
  "headers": {
    "0": "Two minute review",
    "9": "Price and availability",
    "14": "Design",
    "18": "Performance",
    "24": "Battery life",
    "29": "Webcam and microphone",
    "33": "Software and features",
    "35": "Don't buy it if..."
  },
  "links": {
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Razer Book 13": "https://www.techradar.com/reviews/razer-book-13-2020",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Lenovo ThinkPad X1 Nano": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-nano-review",
    "best business laptops": "https://www.techradar.com/news/best-business-laptops",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Asus ZenBook 13 (2021)": "https://www.techradar.com/reviews/asus-zenbook-13-2021",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro"
  }
}