{
  "source": "https://www.techradar.com/reviews/bowers-and-wilkins-px7-wireless-headphones",
  "title": "Bowers & Wilkins PX7 Wireless Headphones review",
  "category": "audio-visual",
  "updated": "2021-06-23T11:23:13Z",
  "author": "becky-roberts",
  "summary": "Strong all-rounders, and aptX Adaptive support is icing on the cake",
  "verdict": "If you’re looking for class-leading wireless, noise-canceling headphones and you're not put off by a premium price tag, Bowers & Wilkins’ latest flagship pair are well worth considering. The cheaper Sony WH-1000XM3 rivals may be slightly better value, but with best-in-class sound quality and design, not to mention very decent ANC and battery life, the PX7s are stellar acts indeed.",
  "pros": [
    "Best-in-class sound quality",
    "Competitive battery life",
    "Robust Bluetooth connection",
    "Dapper design"
  ],
  "cons": [
    "Earcups don’t collapse",
    "No swipe/touch playback controls"
  ],
  "article": [
    "Noise-cancelling headphones aren’t what they used to be; they’re far superior. Gone are the days where they required AAA batteries and their noise cancelation was a simple on/off affair.",
    "Today, we have adaptable noise-canceling for numerous real-world scenarios, built-in batteries that can comfortably last an entire transatlantic flight (and, in some cases, back again) from one charge, and new technology that makes them more efficient, convenient and better-sounding than ever before.",
    "Most, of course, are now wireless too. The new Bowers & Wilkins PX7 Wireless Headphones fly the flag for such progression.",
    "They arrive as successors to the PXs that, upon their arrival in 2017, we called “an impressive first noise-canceling effort” by the British brand. Bowers is now over two years into the game, then – and it shows.",
    "By bringing more sophisticated noise-canceling, much-improved sound quality, a honed aesthetic, and even a world first (more on that later) to the table, Bowers has produced a premium pair of headphones that give the market’s very best (we’re looking at you, Sony WH-1000XM4) a run for their money.",
    "[Update: These headphones now come in a new version: the Bowers & Wilkins PX7 Carbon Edition uses a composite carbon exterior, just like the material used to build the arms in the original model. They also boast a diamond-cut edge around the logo on the outer housings of the headphones, giving them a luxe finish.]",
    "The curtains were drawn on the PX7s in September 2019, alongside the brand's more compact and affordable new arrival, the Bowers & Wilkins PX5 Wireless Headphones.",
    "They launched at $399 / £349 / AU$600 – more or less in-line with the class-leading likes of their Sony WH-1000XM3 (which top our best headphones list), the Sennheiser Momentum Wireless (2019) and the Bose Noise Cancelling 700 rivals – although now they’ve had some shelf life you can expect to pick them up for a little less.",
    "If you’re familiar with the PXs, or any Bowers & Wilkins products for that matter, you won’t be surprised to read that the PX7s are smart. Not smart/casual, as you may describe the aforementioned Sonys – smart.",
    "Aesthetically they aren’t too dissimilar from the original PXs – what with their clearly branded, elliptical ear cups, solid framework, and fabric finish – but they do make significant headway when it comes to comfort. That’s thanks to the replacement of the PXs’ metal construction with a custom carbon fibre composite, making them lighter and, as a result, more pleasant to wear. Over a matter of weeks, our noggin never feels too burdened, and our ears become quite accustomed to being enveloped by the soft leather pads.",
    "As with anything brand-spanking-new – sneakers, a phone, a wallet – you may fear spoiling their gleaming exterior at first, but know that the PX7s are chunky and well-built enough to handle being slung into a bag if you forget (or choose not to carry around) the included hard case. What’s not ideal, however, is that the earcups can’t fold inwards to give the PX7s a more compact and bag-friendly form.",
    "Headphones peppered with playback control buttons, as these are, may not look very 21st-century either, but we do like the certainty of a physical button – and in our experience touch and swipe controls can sometimes be hit and miss.",
    "Otherwise, the PX7s are very up to the minute indeed. While the PXs were among the first headphones to adopt Qualcomm’s aptX HD Bluetooth technology, the PX7s (and their PX5 siblings) launched as the first headphones to market with support for the next-gen aptX codec, aptX Apdative.",
    "Theoretically, that means improved stability and latency between the headphones and your smartphone or tablet, in addition to the high-quality (24-bit) streaming aptX HD brought to the table.",
    "The codec essentially promises a smoother, glitch-free experience by overcoming potentially disruptive, busy radio frequency environments, and by automatically adjusting the streaming bitrate based on the content you’re playing.",
    "Taking your phone in and out of your pocket? There shouldn’t be any hiccups in your ear as you’re doing so. Playing a game on your tablet? Audio (through your headphones) and video (on your screen) should be excellently synced. It appears to translate in practice, with dropouts very rare (we do get the odd one on the bus), and lag while watching Netflix and playing Bubble Shooter (guilty) almost indiscernible.",
    "As is becoming increasingly customary in the top-brass competition, B&W has also considered where you are and what you’re doing in its approach to noise cancelation.",
    "The PX7s have three modes – low, medium, and high – that you can cycle through by pressing the dedicated button on the left earcup, while a fourth, activated by holding down that button, helpfully lets the outside world in for a moment so you can hear, for example, a train platform announcement.",
    "Go down the manual route by actually taking the headphones off, and thanks to proximity sensors, your music is automatically paused, only to come to life again once they’re returned to your head.",
    "Each mode seems worthwhile and effective, whether we’re applying ‘low’ to distance ourselves from overly chatty co-workers or using ‘high’ to drown out plane or train clatter. The degrees of isolation, and the peak levels of seclusion, aren’t as sophisticated as the Bose Noise Cancelling Headphone 700’s superlative system is capable of, but nonetheless the PX7s do the job admirably.",
    "The check box for battery life doesn’t go unticked either, with the PX7s going joint-top of the class next to the Sonys with a claimed 30 hours. Also similarly to its lofty rival, the PX7s promise five hours of playback from just a 15-minute charge through their USB-C port.",
    "Decent design, effective noise cancelation, competitive features: check, check, check. Now all they need to do is sound good – which, as those who’ve spied our star rating will no doubt have guessed, they do.",
    "The PX were sonic high fliers when they came along two years ago, but since then rival headphones brands caught up – ‘tis the way in the ever-evolving tech world, after all. The good news for Bowers & Wilkins, and of course consumers, is that the PX7s push that performance parameter along with a sound that is as accomplished and thus enjoyable as they come in a pair of wireless noise-cancelers.",
    "Tonally, everything is democratically represented: highs are crisp, mids are fleshed out, and bass is substantial yet supple. While they’re a little on the rich side, with the warmth and neutrality that’ll please with the majority, die-hard bass junkies may want to look elsewhere.",
    "Class-leading insight – both in terms of texture and dynamics – appears to come easily to the PX7s (and there’s no shortage of it), but unlike some headphones that over-scrutinize at the expense of liveliness, they don’t get too bogged down with the details.",
    "Instead, they exude just the right amount of bubbliness – like a fizzy drink at optimum effervescence – ensuring your music is as entertaining as it’s designed to be.",
    "In absolute terms, the PX7s demonstrate a pinch more drive and clarity than the Sonys – even if they aren’t quite as refined in their delivery.",
    "Our repeat mentions of rival headphones throughout this review just goes to show how competitive it is at the top of the premium wireless noise-canceling headphones market.",
    "Make no mistake though, up top is exactly where the Bowers & Wilkins PX7s deserve to sit.",
    "It’s true, the cheaper Sonys represent slightly better value for money as current pricing stands, and the Boses deliver more advanced noise cancelation. But the PX7s tick all the boxes, and suffice it to say, look the best doing it."
  ],
  "headers": {
    "6": "Price and availability",
    "8": "Design",
    "12": "Features",
    "21": "Performance",
    "27": "Final verdict"
  },
  "links": {
    "Noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "we called": "https://www.techradar.com/reviews/bowers-and-wilkins-px-wireless-noise-cancelling-headphones",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Bowers & Wilkins PX7 Carbon Edition": "https://fan.go2jump.org/aff_c?offer_id=6243&aff_id=1&source=trd&aff_click_id=trd-us-8557312054218279000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fbowers-and-wilkins-px7-wireless-headphones&url=https%3A%2F%2Fwww.bowerswilkins.com%2Fen-gb%2Fheadphones%2Fpx7",
    "Bowers & Wilkins PX5 Wireless Headphones": "https://www.techradar.com/reviews/bowers-and-wilkins-px5-wireless-headphones-review",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sennheiser Momentum Wireless (2019)": "https://www.techradar.com/reviews/sennheiser-momentum-wireless-2019-review",
    "Bose Noise Cancelling 700": "https://www.techradar.com/news/bose-noise-cancelling-headphones-700-plummet-to-cheapest-price-ever",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows"
  }
}