{
  "source": "https://www.techradar.com/reviews/hyper-x-pulsefire-dart-wireless-gaming-mouse",
  "title": "Hyper X Pulsefire Dart wireless gaming mouse review",
  "category": "computing",
  "updated": "2021-05-24T11:34:08Z",
  "author": "rosario-blue",
  "summary": "Wireless and wired",
  "verdict": "The HyperX Pulsefire Dart wireless gaming mouse is a well-built high-end mouse, perhaps hampered by an overly-conventional design. You can’t argue with the build quality: it tracks well, has responsive buttons and has a very nice squishy thumb rest. And it supports Qi charging, which is still unusual in 2021.",
  "pros": [
    "Extra comfortable side padding",
    "Impressive battery life",
    "Wireless and wired, with Qi charging"
  ],
  "cons": [
    "Not the most interesting design",
    "Not suitable for left handers"
  ],
  "article": [
    "The HyperX Pulsefire Dart wireless gaming mouse is a little pricey, but you can’t argue with its build quality.",
    "Its design is attractive, if a little conventional: black with a soft matte finish; glossy plastic is used for the thumb buttons, and the three-level DPI switcher located below the scroll wheel. By default these levels are 800, 1,600 and 3,200 DPI, and you can set them to whatever you want (below its 16,000 maximum DPI). The side grips were a surprise: plush, and pleasant to touch.",
    "The package comes with a USB nano receiver and USB-C cable for wireless and wired operation. You can charge with the wire, but you can also, unusually, use a Qi charger, which unfortunately is sold separately.",
    "Had the optional cable been braided, it would have earned the Pulsefire Dart extra points with us, but the fact that it’s not only wireless will definitely be appreciated by anyone who worries that the battery may run out during a game.",
    "Also included in the box is a wireless signal extender, which plugs into your PC and gives you a few more meters of range, which can be useful for watching Netflix on the couch.",
    "But the best thing about the Pulsefire Dart is its performance, which, let’s face it, is what you really want to know about when you’re looking for a gaming mouse.",
    "We put the Pulsefire Dart through its paces in FPS, MOBA and RTS games, and found no issues with it. In fact, we were very impressed: it tracks perfectly, even on wood, and the Omron switches lead to a satisfying click, and crucially are fast and responsive.",
    "The scroll wheel is probably the best one we’ve used: grippy, light, but precise – when you scroll, you don’t sometimes accidentally middle click, which happens to us with other mice and drives us wild.",
    "The HyperX Pulsefire Dart wireless gaming mouse comes with a two year warranty and is normally priced at $100 (£90, AU$129). Right now, it’s available for $75 on HyperX’s US website, and, for UK customers, on its UK website.",
    "HyperX’s NGENUITY software, available to download from the Microsoft store can be used to rebind your keys and set up macros. It lets you customise the lighting, but there are only three lighting effects available.",
    "Weighing in at 110g wireless and 150g with cable, the mouse is a little heavy, but not egregiously. We didn’t have an issue with it, especially since it didn’t impact gaming.",
    "We've got some bad news for left-handed gamers, though, as the mouse is assymetrical, ergonomic, and there’s no left-handed version.",
    "Hopefully, a left-handed version comes out in the future.",
    "If you’re looking for a high-end wireless gaming mouse with noticeable gaming-grade specs, then the HyperX Pulsefire Dart will be right up your street, particularly if you’re interested in Qi charging.",
    "The only big criticisms we have are the price and the lack of a left-handed version. The other issues we have – the generic visual design, the lack of braided cable – won't be deal breakers for many people."
  ],
  "headers": {
    "0": "Two-minute review",
    "15": "Don’t buy it if…"
  },
  "links": {
    "HyperX’s US website": "https://www.hyperxgaming.com/unitedstates/us/mice/pulsefire-dart-wireless-gaming-mouse",
    "UK": "https://uk.hyperx.com/products/hyperx-pulsefire-dart-wireless-gaming-mouse",
    "Microsoft store": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1185744340025117700&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fhyperx-ngenuity-beta%2F9p1tbxr6qdcx%3Factivetab%3Dpivot%253Aoverviewtab"
  }
}