{
  "source": "https://www.techradar.com/reviews/headspace",
  "title": "Headspace review",
  "category": "fitness",
  "updated": "2021-10-15T09:16:10Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Meditation and relaxation for every stage of the day",
  "verdict": "A delightfully multi-faceted app, Headspace covers so many bases and interests that you're pretty much guaranteed to find something that suits you. This isn't a case of quantity over quality, though – all of the content is of an extremely high standard and is a pleasure to work with.",
  "pros": [
    "A great range of guided mediations",
    "Yoga and meditation for beginners and pros alike",
    "Superb guidance throughout the day"
  ],
  "cons": [
    "Can feel too rigid and structured",
    "Free trial gives access to little content",
    "Verging on the expensive side"
  ],
  "article": [
    "It would be easy to accuse Headpace of taking something of a scattergun approach because it has fingers in so many pies. But whether we're talking about guided meditations, yoga and workouts, guided sleepcasts, or any of the other content the app has to offer, there is a sense that serious care and attention has been put into creating something of real value.",
    "But while the content is great, it comes at a premium. The free version of Headspace is going to be too limited for most people, so an upgrade to the paid-for subscription is pretty much essential. While not extortionate, it's priced at a level that will make some people think twice – but if you can afford it, it really is worth it.",
    "Headspace is available for both iOS and Android, and in each case there is a limited free version or a paid-for premium edition. A subscription to the premium edition will cost you $12.99 (about £10 / AU$18) per month or $69.99 (about £50 / AU$100) per year, and gives you access to the full library of content.",
    "With its well-organized library of content, Headspace is packed with varied sessions in a wide range of fields. Meditations and yoga guides are easy to follow, and the soothing narration used throughout is a pleasure to hear.",
    "There's a focus on audio content, but there are also some videos when the medium is more appropriate. The lack of sleep monitoring or proper journaling is something of a disappointment, but you should find that your sleep noticeably improves without you having to keep track of what may or may not have been influencing things. Trust the app, and it will work wonders for you.",
    "There are five sections to explore in Headspace. The Today section is where you will find your curated content for the day. There are mindfulness activities to kickstart your day, relaxing meditation sessions, pieces of carefully timed invigorating music to help you gain focus, and sleepcasts to help you drift off at night.",
    "This is certainly the section you will visit most regularly, but there's plenty more to explore as well.",
    "In the Meditate section, you will find a massive range of guided meditations. Some of these are one-off sessions, while others are multi-part courses. There are meditations are many different lengths, and some have customizable lengths so you can tweak them to suit your availability.",
    "The Sleep section is home to guided meditations, stories, relaxing sounds, and ASMR content to help you to switch off at night. There's even a sleep-radio feature to provide you with hours of soothing sounds throughout the night.",
    "Similarly packed and varied is the Move section where you'll find everything from simple stretches and yoga to cardio workouts and dance sessions. There is something for everyone at every time of day.",
    "Rounding things off if the Focus section, which includes music, soundscapes and meditations to help you to improve and maintain your focus when it matters most. If you need a quick boost, just dip in for a quick refresher.",
    "You are invited to check in with the Journey component of the app once a month. This question-led journaling system gives you a way to monitor your stress over the course of a month, and presumably you're discouraged from checking in more frequently to avoid this being a trigger for stress."
  ],
  "headers": {
    "0": "30-second review",
    "2": "Price and availability",
    "3": "Features",
    "5": "Experience",
    "12": "Don't download it if"
  },
  "links": {
    "Headpace": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1058291377098847000&xs=1&url=https%3A%2F%2Fwww.headspace.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fheadspace",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6792108327895101000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fheadspace-meditation-sleep%2Fid493145008",
    "Android": "https://play.google.com/store/apps/details?id=com.getsomeheadspace.android"
  }
}