{
  "source": "https://www.techradar.com/reviews/amd-radeon-rx-6600-xt",
  "title": "AMD Radeon RX 6600 XT review",
  "category": "computing",
  "updated": "2021-10-12T19:42:35Z",
  "author": "jackie-thomas",
  "summary": "RDNA comes to the mid-range",
  "verdict": "The AMD Radeon RX 6600 XT is an absolute 1080p powerhouse, easily able to power the latest games at max settings. However, its proximity to the Nvidia GeForce RTX 3060 Ti makes it hard to recommend for most people.",
  "pros": [
    "Great 1080p performance",
    "Low power consumption",
    "Excellent thermal performance"
  ],
  "cons": [
    "Too expensive",
    "Not far enough ahead of RTX 3060"
  ],
  "article": [
    "Now that the current generation of graphics cards has been around for a while, and we have the Xbox Series X and PS5 inadvertently pushing the standards for PC games higher, it's not just 4K gamers that are going to need an upgrade. The AMD Radeon RX 6600 XT is meant to power next-generation games at 1080p, taking the Nvidia GeForce RTX 3060 head-on, especially when it comes to traditional rasterization without shiny ray tracing effects.",
    "However, the Radeon RX 6600 XT also comes at a time where it's harder than ever to buy any graphics card, let alone the latest and greatest. Because of this, AMD bumped the suggested price above what the competing RTX 3060 comes with. And it's not hard to see why - it's not like you're going to find any graphics card at the retail price either way right now, so why not make it a bit more expensive?",
    "But the current graphics card situation won't last forever, so the big question is whether or not the AMD Radeon RX 6600 XT will be worth it in the long-term, especially if you're still fine waiting a bit to buy a graphics card.",
    "The AMD Radeon RX 6600 XT is available starting August 11, with a suggested retail price of $379 (about £270, AU$520). That price will, of course, go up from there and this time around AMD isn't selling its own version of the graphics card.",
    "Instead, just like the Nvidia GeForce RTX 3060, the 6600 XT will exclusively be available through third-party graphics card manufacturers like XFX and MSI - and the one we tested was the MSI Gaming X, which will set you back $569 (about £510, AU$773).",
    "That extra price does get you some nice bells and whistles like a backplate, RGB lighting and MSI's excellent Twin Frozr cooler design. But, as we've seen with the same design on all kinds of graphics cards this generation - from the RTX 3080 to the Radeon RX 6700 XT, it doesn't really add much to your performance unless you're planning to overclock your graphics card.",
    "But then again, because we haven't been able to test a reference spec AMD Radeon RX 6600 XT, we can't really say how much of a performance boost this version of the card is, or how much you're losing out if you go with a $379 (about £270, AU$520) version of the AMD Radeon RX 6600 XT.",
    "Then there's the elephant in the room: the Nvidia GeForce RTX 3060 and the RTX 3060 Ti. At $379 (about £270, AU$520), the RX 6600 XT is a full $50 more than the RTX 3060 - again, just going by suggested prices - but it is around 10% faster in our testing, which isn't a bad trade-off.",
    "However, where the Radeon RX 6600 XT's value proposition falls apart when you look at the RTX 3060 Ti. That graphics card's suggested retail price is $399 (about £299, AU$540), but it's around 20-30% faster, so most people should just spend the extra cash for the RTX 3060 Ti – if they can find it in stock, at least. There's a reason why it's our pick for the best graphics card.",
    "Like the rest of the Radeon RX 6600 graphics cards, the Radeon RX 6600 XT is based on AMD's 7nm RDNA 2 graphics architecture. AMD's main focus here was to optimize RDNA, working in new features like hardware-accelerated ray tracing and boosting power efficiency. AMD also included Infinity Cache with RDNA 2 graphics cards, which massively improves memory bandwidth.",
    "This means that these AMD graphics cards can have more memory for less cash, even though with the RX 6600 XT, at least, AMD opted for 8GB of GDDR6 memory, rather than the 12GB of GDDR6 that the Nvidia GeForce RTX 3060 brings to the table.",
    "The AMD Radeon RX 6600 XT has 32 RDNA 2 compute units (CU), which means you're getting 2,048 Stream Processors (SP) and 32 ray accelerators – one per CU. That's quite a step down from the Radeon RX 6700 XT, which has 40 CUs, with 2,560 SPs. That's a 25% reduction in cores, and that pretty much correlates with the performance.",
    "But at least you get quite a high clock speed. The AMD Radeon RX 6600 XT has a Boost clock of 2,589MHz, and a Game Clock of 2,359MHz. The boost clock is basically how fast the GPU will get in short bursty workloads, while the Game Clock is usually what you're see while actually playing games.",
    "One huge feature has been added since the Radeon RX 6600 XT dropped back in March 2021, though: FidelityFX Super Resolution, or FSR. This is AMD's answer to Nvidia's Deep Learning Super Sampling (DLSS), and will basically upscale a game from a lower resolution to your native resolution. This is supported by the Radeon RX 6600 XT, but it's also available on pretty much any DirectX 11-ready graphics card – though performance will be much better on AMD's GPUs, at least for now.",
    "Of course the features present on other AMD RDNA 2 graphics cards are still available. Smart Access Memory is a big one, and will let you squeeze out a bit of performance out of the Radeon RX 6600 XT. If you want to enable this feature, you're going to have to go into your BIOS and enable Resizable BAR.",
    "This will give your CPU direct access to your GPU's memory, which should improve latency, and thus gaming performance. We look at it like overclocking, as you have to navigate your BIOS in order to enable it – at least for now – but if you're comfortable doing so, it's kind of a no-brainer to enable this technology.",
    "Another great software feature here is Radeon Boost, especially if you play a lot of fast-paced competitive shooters like Rainbow Six Siege or Apex Legends. This will basically lower the resolution in scenes with a lot of movement, where you wouldn't necessarily notice the extra detail anyway. This then boosts framerate, and in games like these, a high framerate can be the difference between winning and losing, so definitely worth enabling.",
    "Unlike the other graphics cards in the RDNA 2 lineup, AMD is not launching its own version of the Radeon RX 6600 XT. Instead, it's exclusively available through third party card partners like MSI and XFX. The version of the card we were sent for review was the MSI Radeon RX 6600 XT Gaming X.",
    "For the most part the MSI Radeon RX 6600 XT Gaming X has virtually the same aesthetic as the MSI Radeon RX 6700 XT Gaming X, though it's just a bit smaller. Unlike the 6700 XT, the Radeon RX 6700 XT Gaming X is just a dual-slot card, rather than a 2.5 slot design. This should make it fit better in smaller cases, and allow for easier installation of other expansion cards – like a capture card or a sound card (yes, those do still exist).",
    "The graphics card is 10.9 inches long, and 5 inches tall, which means the cooler extends a bit past the PCIe installation bracket, and you'll need about 2 inches of clearance between the side of your case and where you mount your graphics card to fit the Gaming X. There are more low-profile versions of the Radeon RX 6600 XT if you are going with a compact build.",
    "This graphics card has two fans, both with the MSI dragon logo in the middle. Between the fans are some RGB accents, and the card has a very gamer aesthetic, with a black and silver colorway. On the side of the shroud, there's more RGB lighting, with the MSI logo lighting up.",
    "On the back of the card, you get a full metal backplate, with little cutouts near the back of the card. Due to the low power requirements, the PCB doesn't extend for the full length of the card, which allowed MSI to cut out some gaps in the backplate here to promote better airflow through the heatsink.",
    "The cooler here is frankly overkill for this GPU. Through all of our testing, the MSI Radeon RX 6600 XT Gaming X topped out at just 67°C, which is extremely cool for a graphics card with a 160W TGP.",
    "Though, in our experience, this version of the graphics card stayed well under that 160W threshold, even in extremely demanding games like Metro Exodus Enhanced Edition, peaking at 146W of power. That's less than the RTX 3060 or the RTX 2060 Super, which peaked at 169W and 183W, respectively.",
    "You should be able to just toss this GPU in your build and forget about it, without ever worrying about the MSI Radeon RX 6600 XT getting too hot.",
    "As far as ports, you're getting three DisplayPort outputs and one HDMI 2.1 port. So, while this graphics card is definitely aimed at 1080p gaming, it is capable of outputting 8K video at 60Hz. Just don't go expecting to play games at that resolution.",
    "For power, you just need one 8-pin PCIe power cable and AMD is recommending at least a 500W power supply.",
    "With the Radeon RX 6600 XT, AMD is targeting 1080p gamers, and at that resolution the Radeon RX 6600 XT absolutely knocks it out of the park. Every game we ran at that resolution had great performance.",
    "Even in Metro Exodus Enhanced Edition, which is definitely more geared towards Nvidia graphics cards, thanks to the always-on ray tracing, the RX 6600 XT was able to get 52 fps at 1080p, which is more than playable. And while in that title, the RX 6600 XT is just barely beat out by the Nvidia GeForce RTX 3060, AMD's card regularly trades blows with Nvidia's card.",
    "In Dirt 5, the RX 6600 XT is 16% faster than the RTX 3060, and in the original Metro Exodus, it has a 15% lead at 1080p. However, the AMD graphics card is basically tied with the RTX 3060 in Final Fantasy XIV and Horizon Zero Dawn – which isn't a good look with its price difference.",
    "Things get rough for the Radeon RX 6600 XT when you compare it to the Nvidia GeForce RTX 3060 Ti, though. At 1080p, the RTX 3060 Ti is typically around 15% faster than the Radeon RX 6600 XT, despite costing just 5% more. And, in Metro Exodus, the Radeon RX 6600 XT lags a whopping 38% behind Nvidia's card, which is a huge difference.",
    "We get that not a lot of PC gamers are going to go all-out for ray tracing, but it doesn't make sense to pick up the RX 6600 XT unless you can find one that's more than 20% cheaper than the RTX 3060 Ti. And while there are some that would argue that we should compare the prices once the card actually goes live and we see how much prices go up, these MSRP prices are what AMD sets the price at, and where it will sit in the market.",
    "And right now, the AMD Radeon RX 6600 XT is placed basically at the same level as the RTX 3060 Ti, and that's a competition that AMD does not win in any situation."
  ],
  "headers": {
    "3": "Price and availability",
    "9": "Chipset and features",
    "17": "Design",
    "27": "Performance",
    "33": "Don't buy it if..."
  },
  "links": {
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Nvidia GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Radeon RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "best graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458"
  }
}