{
  "source": "https://www.techradar.com/reviews/tcl-6-series-2021-8k-qled-tv-review",
  "title": "TCL 6-Series 2021 8K QLED TV review",
  "category": "televisions",
  "updated": "2021-12-03T11:35:07.881Z",
  "author": "nick-pino",
  "summary": "The world’s cheapest 8K QLED TV... but maybe not its best",
  "verdict": "The 8K version of the TCL 6-Series has nearly everything we’d want specs-wise: 8K resolution, Mini LED backlights and a quantum dot filter for better color at the lowest price for any 8K TV. Its audio performance is far from perfect and only two ports have 4K/120Hz support for PS5 and Xbox Series X, but for the price there’s no TV out there with higher specs.",
  "pros": [
    "Mini LED backlight",
    "Quantum dot colors",
    "8K resolution",
    "Built-in Roku TV"
  ],
  "cons": [
    "8K upscaling isn’t perfect",
    "Motion artifacting",
    "Only two ports are HDMI 2.1",
    "Sound balance issues"
  ],
  "article": [
    "Over the last four years, the TCL 6-Series has become synonymous with fantastic performance at an unbeatable price. Until now, that’s been limited to 4K models that have progressively gotten better over the previous years, with technologies like QLED introduced in 2019 and Mini LED thrown into the 6-Series in 2020. This year, however, we’re adding 8K resolution to the list.",
    "The TCL 6-Series 8K (R648) is officially – by our count at least – the cheapest 8K TV on the market at $2,199 for the 65-inch version of the screen and $2,999 for the 75-inch model. That undercuts the likes of Sony, Samsung and LG by hundreds of dollars (a real feat) and continues the 6-Series’ trend of underpricing the competition.",
    "Unfortunately, though, despite underpricing the likes of the Samsung Q900TS, LG QNED 99 and Sony Z8H, the TCL 6-Series 8K doesn't outperform them in every metric – especially when it comes to upscaling and motion processing, two of the TV's weakest areas. Sound quality, too, has balancing issues and the TV only has two full-spec HDMI 2.1 ports that support 4K/120Hz or 8K/60Hz.",
    "Even though it doesn't outshine the best 8K TVs from other manufacturers, the TCL 6-Series 8K offers us a glimpse of what an affordable 8K TV looks like – and it’s absolutely fantastic.",
    "The TCL 6-Series 8K is part of TCL’s new 2021 TV lineup and started arriving in August 2021 at most American retailers. It costs $2,199 for the 65-inch version of the screen and $2,999 for the 75-inch model.",
    "In terms of the competition, the TCL 6-Series R648 is much cheaper than the competition by several hundred dollars. LG’s QNED 99 starts at $3,499 for the 65-inch version of that TV and rockets up to $4,799 if you want the 75-inch version. The Sony Z8H is $3,999 for the 75-inch version while Samsung’s Q900TS starts at $4,499 for the 65-inch version.",
    "All that being said, the entry-level 8K Samsung Q800TA is the closest in price to the TCL 6-Series: it’s $2,999 for the 65-inch QN65Q800TA while the 75-inch version of the TV is currently on sale on Samsung’s website for $2,899 – $100 less than the 6-Series.",
    "So what’s one to make of all this? The TCL 6-Series is the cheapest on the market ahead of Sony, LG and Samsung– but maybe not quite as cheap as we had hoped it’d be – and there are alternatives out there for just a little more.",
    "So what are you paying for, exactly, with this 8K TV? Well, a good chunk of it is its higher resolution and better AIPQ Processor that we’ll cover below, but also the quantum dot filter and Full Array Local Dimming Mini LED lighting that has hundreds of contrast control zones. Specs-wise there’s a lot to like here.",
    "Of course, packing all of this stuff into a TV makes it heavy and less slim than, say, an OLED that can go down to a few millimeters in depth thanks to the way its self-illuminating pixels work. It’s a TV that requires two people to unpack and weighs much more than other 65-inch 4K TVs we’ve tested this year.",
    "The good news is that, thanks to the included stand, it’s rock-solid when you’ve got it on its base and doesn’t wobble at all. Installing the base is incredibly easy and the total setup process including updating the software only takes a few minutes if you already have a Roku account setup for a Roku Ultra, Roku Express or Roku Streaming Stick+.",
    "To go along with the Roku TV interface is the included premium TCL TV remote that is actually very different from the regular Roku remotes you may have in your house. The remote is all silver with side buttons for raising and lowering the volume, and quick buttons for Netflix, Disney, Hulu and Amazon Prime Video. It’s well-built and feels good in the hand, however it doesn’t have the 3.5mm auxiliary jack for private listening like other Roku devices have, and that’s kind of a bummer.",
    "Last but not least, we have to cover the inputs and outputs and it’s here we found the first potential issue with the TCL 6-Series 8K: its HDMI ports. The good news here is that, thankfully, two of the HDMI ports support HDMI 2.1 and accept 4K/120Hz signal from a game console like an Xbox Series X or PS5. The bad news? Those are the same two ports that can accept 8K signals as well. What that means is, down the road, you’re only ever going to have two ports that accept 8K/60 or 4K/120 – the two other ports will top out at 4K/60.",
    "Like the 6-Series before it, the 6-Series 8K uses Roku TV as its smart platform. While there’s nothing different about the version of Roku TV on the 8K TV and any other Roku device, the UI does look pretty nice spread out across all those pixels and it’s always great to see the plethora of supported streaming apps at your fingertips.",
    "The interface, if you haven't seen it before, is incredibly intuitive with all your apps located on the single home menu that can be reorganized to your liking. That means you can put the apps that you use the most at the top, and always be a few button presses away from your most-used apps.",
    "Because of the processor, Roku's interface populates quickly and is extremely responsive – which really speeds up the time it takes to find something to watch. Also around to help is the built-in voice assistant who can help you track down something specific using the remote's microphone.",
    "Roku's egalitarian search results will show you results from dozes of apps – and even prioritizes the ones that are available free with ads or available with your subscriptions. That's an advantage that Roku has over platforms like Apple TV and Amazon Fire TV that would prefer if you stuck to their digital video stores.",
    "In terms of app selection, Roku TV brings all the major players to the table including Disney Plus, Apple TV Plus, Netflix, Hulu, Amazon Prime, Peacock and more. The only real missing link on Roku right now is YouTube TV – and that's due to some on-going contract negotiations between the two companies and will be resolved (most likely) in the near future.",
    "The only major problem we have with Roku TV is that it's a bit plain compared to content-first smart platforms like Google TV that is constantly recommending the latest and greatest TV shows and movies that it thinks you're going to like. Seeing a list of new shows and movies every time you start up the TV feels fresher than Roku's old app-based approach, but many Roku customers appreciate that uniformity in the UI year after year.",
    "If you’ve never seen an 8K TV before, you’ll be blown away by the TCL 6-Series. When it’s fed 4K content – especially content shot in HDR or in Dolby Vision – it really shines. The 6-Series has this perfect way of balancing vivid colors, striking contrast and great black levels all without haloing, light bleed or oversaturation.",
    "The secret to the TV’s success lies in its Mini LED lighting that can accurately control how much light is going to any one portion of the screen at a given time and how much of the screen’s LED zones need to be turned off. That gives an LED almost OLED levels of control over the contrast and reduces issues like blooming that you’d find on other LED-LCD TVs.",
    "In terms of color and contrast, the new 6-Series has all the tools for the job.",
    "In fact, the only problems we’ve had with the TV’s performance are with its motion processing (some judder on medium settings) and its upscaling – especially when feeding it HD or sub-HD content. Watching the new Masters of the Universe animated show on Netflix had serious issues with its motion until we simply turned off the motion processing from the menu, while HD shows like Kim’s Convenience looked more like a decent 4K image rather than a beautifully upscaled 8K image.",
    "In both cases, the TV's issues are noticeable. If you're watching an upscaled HD show, you might see a bit of grain in the background where the processor didn't have enough data to work with while motion artifacting can make movement look janky in animated shows or leave a blur in fast-motion live-action content.",
    "It’s here that a lot of folks would argue that this is a problem inherent to all 8K TVs – namely the lack of actual 8K content. But that argument only holds true when upscaling algorithms don’t do a great job and make content look less than stellar on the supersized screens. That isn’t exactly the case here – even the worst HD upscaling to 8K looks better than some TV’s 4K upscaling performance – it just hasn’t lived up to the high bar set by other 8K TVs.",
    "Out of the box, the 6-Series 8K defaults to a normal audio mode that does its best to balance the audio spectrum. The problem we found there was that bass dominated the mix and left dialogue hard to hear. If we changed the sound settings to focus on dialogue, it drew everything else way too far back, making movies feel significantly less cinematic. Basically, on either setting, it's not ideal.",
    "The best option we’ve found so far is to set the sound settings to Music, and deal with a slight uptick in the trebles for clear mids and strong – but contained – bass response.",
    "What that means for you, most likely, is that you'll want to pick up a good Dolby Atmos soundbar with the TCL 6-Series 8K and connect it via the eARC port. It's an extra expense, yes, but you'll be much happier with the results."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and release date",
    "8": "Design",
    "13": "Smart TV (Roku TV)",
    "19": "Picture quality",
    "25": "Sound performance",
    "28": "Don't buy it if..."
  },
  "links": {
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "Samsung and LG": "https://www.techradar.com/news/samsung-vs-lg-tv-which-tv-brand-is-better",
    "Samsung Q900TS": "https://www.techradar.com/reviews/samsung-q900ts-qled-8k-tv",
    "Sony Z8H": "https://www.techradar.com/reviews/sony-z8hzh8-8k-tv",
    "best 8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "Samsung Q800TA": "https://www.techradar.com/reviews/samsung-q800t-8k-qled-tv",
    "65-inch 4K TVs": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "Roku Ultra": "https://www.techradar.com/reviews/roku-ultra-2020",
    "Roku Express": "https://www.techradar.com/reviews/roku-express",
    "Roku Streaming Stick+": "https://www.techradar.com/reviews/roku-streaming-stick",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Masters of the Universe": "https://www.techradar.com/news/masters-of-the-universe-revelation-part-1-is-the-subversive-revival-that-he-man-deserves"
  }
}