{
  "source": "https://www.techradar.com/reviews/nexdock-360",
  "title": "Nexdock 360 review",
  "category": "computing",
  "updated": "2021-12-06T12:27:42Z",
  "author": "mark-pickavance",
  "summary": "Turns a phone into a laptop",
  "verdict": "A portable display successfully designed to make a phone into a laptop. It works well with a small selection of phones, but would a Chromebook be a better investment?",
  "pros": [
    "1080p IPS touch display",
    "Reversible hinge",
    "5,800 mAh battery"
  ],
  "cons": [
    "Price of a Chromebook",
    "Limited phones work via USB-C"
  ],
  "article": [
    "Portable monitors are a niche market since laptops come with them already attached.",
    "But for those that only want to carry only a phone and have one that’s powerful enough to be used as a computer, the addition of a product like the Nexdock 360 could open up new possibilities.",
    "Nexdock 360 is only available directly from Nexdock, and they currently will send this to customers in the USA, Canada, the EU and the UK. The cost is $369, and that price includes free express shipping within 4-8 business days from Nexdock in California.",
    "Anyone unfamiliar with this product will probably conclude that the Nexdock 360 is a very expensive Ultrabook. Because that’s exactly what it feels and looks like.",
    "At just 1190 grams, it’s a highly portable solution where the weight of the screen and keyboard are roughly equal.",
    "Construction is high quality, being an attractive combination of aluminium and plastic that are more about appearance than robustness.",
    "The display is a 13.3-inch fully laminated IPS display with a natural resolution of 1080p and a touch capability. Higher resolutions are good, but for this scale of screen, 1080p is probably the practical choice for readability.",
    "Our review hardware came with a US keyboard layout, having the @ symbol on the 2 key and the # symbol on 3. Not a complete dealbreaker for Europeans, some regional options on keyboard layout would be preferable.",
    "What’s great about the keyboard is that it uses the entire width of the Nexdock, enabling the keytops to be well sized and spaced. Its associated trackpad gets less space, and it lacks visible mouse buttons. It has buttons, but they’re under the leading edge of the pad.",
    "On the left side of the base is a USB-C port meant for connecting a phone, more of that later, and a mini-HDMI input. Conversely, on the right is two more USB-C ports, one that is intended for charging with the provided charger, a 3.5mm audio jack, a MicroSD card slot and the power on/off button.",
    "Along the top edge near the bottom of the screen are four 1W speakers for those that like sound but don’t care for headphones.",
    "Internally a 44 Wh (7.6 V, 5,800 mAh) battery provides power to drive the screen when away from mains power, and it will also charge any attached phone.",
    "Battery life depends on whether the connected phone is charged by the Nexdock 360 or not. If charging is disabled and screen brightness isn’t set to 100%, there is enough battery to operate for 11 hours approximately.",
    "With a function keypress on the keyboard, a battery gauge can be seen, but it doesn’t tell you how long, based on current use that it will last. It’s also possible for the phone to charge the screen if that is considered the priority.",
    "Connecting the screen and keyboard are fully reversible hinges that enable the panel to operate in tent mode or with the keyboard folded underneath, turning it into a 13.3-inch tablet.",
    "What might confuse the uneducated is that this might appear to be a computer, but it has no independent capability whatsoever. Inherently this is merely a screen with an unbuilt USB hub, keyboard, and trackpad. But as limited as that choice might initially seem, it’s a strength of its design in many respects.",
    "What cables you get with a product can make or break that initial experience, as there is much less that’s worse than investing in a product that you can’t initially use.",
    "Nexdock considered this based on the number of cables included as standard, covering all the standard use cases.",
    "In the box is a dual-standard HDMI cable, a USB-C to USB-A converter (great for those with a wired mouse), and two USB-C cables. One of those is a long one for connecting the wall socket PSU, and another braided shorter one with one L-shaped end for connecting a phone.",
    "Our only hardware disappointment was that the PSU was a tiny 18W design with fold-out prongs designed for a US power inlet and therefore requires an adapter for use outside of those regions.",
    "There are two basic ways the Nexdock 360 can be used, a simple one that uses only the display and another more complex option that leverages the keyboard and USB hub functionality.",
    "In the simpler scheme, the connection method is HDMI, and a full-size HDMI to mini-HDMI cable is provided for this purpose. Using this, you can connect the Nexdock to a laptop or desktop PC and get a second external display. This mechanism could also connect a streaming service device like a Chromecast with Google TV, Amazon Firestick or similar.",
    "Other potential devices include Nintendo Switch, or any battery-powered console that has HDMI out would also work.",
    "A variation on this theme could be to use a Raspberry Pi alongside the Nexdock, where the computing power of the Pi can be used as if it was a Linux laptop. Doing this requires plugging both the HDMI and USB into the Nexdock. The advantage of the dual connection is that not only the screen but also the keyboard and trackpad became active, and battery power from the Nexdock drives the Pi.",
    "That should work with both the Pi 4 and 3B, but we’d recommend you have the Pi in a case to protect it.",
    "These features are useful, but where this solution can be even more transforming is when you use it with an Android phone. Specifically, a phone that offers a ‘wired display’ through USB-C, like those made by both Samsung and Huawei.",
    "Samsung DeX has been available on Galaxy phones since the S8, and Note models since the Note 8, and the Fold series devices. Equally, Huawei added ‘wired projection’, as it is branded, to the Mate 10 and 20 Series, and the P20, P30, P40 and the Honor Note 10 and View 20 designs.",
    "The latest to join this gang is Motorola with its ‘Ready For’ technology on the G100 and Edge+ models. It is expected that with the release of Android 12, Google will make this an inherent feature for all future phones and tablets.",
    "We tested it with a Huawei P30 Pro, and it worked flawless, generating a desktop environment from the phone that can be operated much like any laptop computer.",
    "When the phone is connected, it then doubles as a touchpad, which is very useful for those that don’t care for the pad on the Nexdock. And, the phone is still required for fingerprint recognition.",
    "For those that want the most elegant solution, Nexdock recommends Mountie, a clamp made by Ten One Design that enables the phone to be attached to the side of a laptop, or in this case, the Nexdoc 360.",
    "The experience is close to that of a Chromebook, where the apps have a phone-like feel yet function in a windowed GUI. Our only disappointment about Huawei desktop mode was that while all our other Google applications can be used in Desktop mode, the Chrome browser isn’t available.",
    "Another limitation is that some technology requires full access to the USB-C port on the phone to work, and it won’t do that if the display is sending video to the Nexdock.",
    "A good example of this limitation is the DJI Mini 2 drone that uses USB-C to connect the phone/tablet to the remote control. Unfortunately, you can’t connect the remote indirectly to the Nexdock and get it to work. If you have a drone that has HDMI output, like the Phantom 3 Pro and Phantom 4, or the DJI Smart Controller on the DJI Mavic 2 Pro, then you could use the HDMI input on the Nexdock and still have the controller connected.",
    "If this had worked on the DJI Mini 2, it would have been epic, but alas, it didn’t. And we should say this is a DJI constraint and not a Nexdock issue.",
    "Maybe they exist, but we’ve not seen a portable display with an inbuilt keyboard from another hardware maker yet.",
    "Battery-powered displays are more widely available, and solutions like the Asus ZenScreen MB169C+ are about half the cost of the Nexdock 360. The Asus monitor also uses a USB Type-C connector (DP Alt mode), allowing it to work with phones that support that functionality.",
    "What most of these portable displays lack is the ability to be a USB hub, forcing the user to also invest in a Bluetooth keyboard and mouse to get the complete desktop experience.",
    "For around the same price as the Nexdock, we found the best alternative under the UPERFECT brand. It makes a 1080p 17.3-inch panel with DisplayPort, USB and HDMI connectivity.",
    "There is a slew of other brand names that offer similar products, and they are generally cheaper than the Nexdock 360.",
    "Branded competitors include the aforementioned Asus MB169C+, Viewsonic VG1655, AOC I1601FWUX, Lenovo ThinkVision M14 and HP EliteDisplay S14. These designs are less than $300, and some are less than $150. But, none of them is precisely offering what Nexdock 360 provides.",
    "We don’t often say this about products we review, but the Nexdock 360 is everything that it promised to be, and in some respects even more.",
    "The flexibility of this solution means that if one purpose ends, another inevitably opens, making this unlikely to be the hardware that’s bought and then discarded.",
    "It would be better if more phones worked with it by default, and some means to connect Apple phones existed, but this situation should improve over time.",
    "If you do own a phone that works now and occasionally needs to type something more than a two-line message, then this might be the perfect product for you.",
    "The only caveat is probably the price. Not that it's costly, but it is enough that you could buy a good Chromebook for the money and get a very similar experience.",
    "However, a Chromebook won’t operate as a second screen or a portable display for a games console and only replaces the phone and Nexdock combination.",
    "That’s a discussion about how you intend to use this product that needs having before investing, we’d suggest."
  ],
  "headers": {
    "2": "Price and availability",
    "3": "Design",
    "16": "In Use",
    "35": "Competitors",
    "41": "Final verdict"
  },
  "links": {
    "Nexdock": "https://nexdock.com/",
    "Mountie": "https://tenonedesign.com/mountie.php"
  }
}