{
  "source": "https://www.techradar.com/reviews/realme-8-pro",
  "title": "Realme 8 Pro review",
  "category": "phones",
  "updated": "2021-03-24T15:00:21Z",
  "author": "tom-bedford",
  "summary": "A great reason to pay attention to Realme",
  "verdict": "The Realme 8 Pro is a superb phone for its price, which is to say, it’s surprising that it only costs this much. Compared to its rivals it feels snug in the hand, takes impressive photos, and charges really quickly.",
  "pros": [
    "Feels snug in the hand",
    "Cameras are good for the price",
    "Fast charging"
  ],
  "cons": [
    "Included case barely fits",
    "No 5G",
    "Screen 'only' 60Hz"
  ],
  "article": [
    "While Realme isn’t currently a huge name in the West, if it keeps putting out phones like the Realme 8 Pro, we can’t see that remaining the case for much longer – it’s a fantastic affordable phone, and one which Motorola, Nokia and Redmi should take note of.",
    "Launching alongside the Realme 8 in early 2021, and following on from 2020’s Realme 7 series, the 8 Pro is likely to be the top affordable phone from the Chinese brand in 2021.",
    "It would be most accurate to class the Realme 8 Pro as a ‘premium budget phone’ like the Moto G9 Plus or Redmi Note 10 Pro – while it sits just above the cut-off point for our ‘best cheap phones’ list in terms of price, it’s still definitely a low-cost handset.",
    "The Realme 8 Pro doesn’t feel like it belongs at its price tag, however, and if it had launched with a higher price we wouldn’t have batted an eye – it has a super-high resolution main camera and incredibly fast charging, and it looks great too.",
    "Our favorite aspect of the phone is its design – where most low-cost phones are relatively thick, hard to hold in one hand, and clad in cheap-feeling plastic, the Realme 8 Pro is slender, easily-holdable, and has a lovely rear textured effect.",
    "This is also possibly one of the best budget camera phones on the market, thanks in no small part to the main snapper with its whopping 108MP resolution. This takes super-high-res photos that give you plenty of scope for subsequent editing and cropping.",
    "There’s 50W fast charging here too, which powers up the battery in what feels like no time at all, and much quicker than most other budget phones. The battery will also reliably last a day between charges.",
    "These positive points all highlight ways the Realme 8 Pro beats its competition, while it matches some similarly-priced phones in other ways: its processing power and display are all on par with Redmi and Motorola competitors. There are no departments in which this phone is significantly weaker than its competitors.",
    "What gripes we do have with the phone are incredibly minor: there’s no wireless charging or 5G connectivity, and the silicone case which comes with the phone is so tight it’s hard to get on the phone – and in the grand scheme of things, they’re barely problems at all.",
    "So the Realme 8 Pro is the affordable phone we’ll be comparing all other premium budget phones to in 2021. More than that, though, it’s a good reason to pay attention to Realme as a phone brand, and it gets us excited for future devices from the brand.",
    "The Realme 8 Pro launched in many regions around the world, including the UK, but not the US or Australia. Realme doesn’t sell its phones in the States, so don’t expect to see it there, but an Australia launch is possible.",
    "The phone costs £279, which converts to around $390, AU$500, which puts it in what we’d broadly term the ‘premium-budget’ category.",
    "For some context, the Moto G9 Plus, and the 128GB model of the Xiaomi Poco X3 NFC, both cost £250 (around $325 or AU$460), and they’re arguably the Realme 8 Pro’s closest competitors.",
    "Though it’s certainly not a compact phone, the Realme 8 Pro feels pretty small compared to its competitors, and that’s a great thing for people who don’t want a giant smartphone. It’s relatively thin and light, and has a smaller body than we’re used to.",
    "This body is clad in plastic, but with a textured layer that both looks and feels better than a ‘standard’ plastic rear. The rear has the words ‘Dare to Leap’ – Realme’s motto – emblazoned across it in rather large capital letters, which some may find garish, while others may not mind.",
    "The phone has a USB-C port and 3.5mm headphone jack, and its volume rocker and power button are both situated on the right edge of the phone. Thanks to its size, and the button locations, the Realme 8 Pro felt easy to use one-handed.",
    "The Realme 8 Pro’s screen is 6.4 inches across, which makes it a touch smaller than many other similar-price phones, and it’s interrupted by a punch-hole cut-out for the front camera at the top left.",
    "The display has a 1080 x 2400 resolution, which is pretty standard for… well, for any smartphone. It’s the same resolution as most games, apps or streaming services you’ll be using, though lower than the resolution of most top flagships.",
    "The refresh rate is 60Hz, which is generally standard for handsets at this price, though some push it up to 120Hz. If you're bothered about having a high refresh rate, you should shop around.",
    "We found the screen looked quite good, with nice vibrant colors, which is to be expected since it’s an AMOLED display. Now and then auto-brightness was a little off though, causing us to have to manually change how bright the display was.",
    "Surprisingly for a phone of this price, there’s an in-screen fingerprint scanner here, which we found to work well. It was fairly fast to use and barely ever failed to pick up our thumb on our first attempt to unlock.",
    "The Realme 8 Pro has a 108MP main camera, and it’s not the first low-cost phone to have such a high-res main camera, with the Redmi Note 10 Pro beating it to the punch. That’s joined by an 8MP ultra-wide, 2MP depth-sensing and 2MP macro camera, with a 20MP front-facer.",
    "‘High-res’ doesn’t always equal ‘good-looking’ when it comes to smartphone cameras, but we were impressed by the photo chops of the Realme 8 Pro. In well-lit environments, pictures looked good, with rich detail and fair contrast. This was the case for vistas and closer subjects too.",
    "Thanks to being so high-res, we could easily download photos from the Realme 8 Pro onto a computer and edit and crop them, without ending up with a low-res or messy-looking snap.",
    "Not everyone will care to take 108MP pictures though - they take up a lot of storage space, and some low-res cameras have bigger sensors, which ‘see’ more light. But in well-lit settings this is great.",
    "The ultra-wide camera also performed quite well, though colors looked noticeably different than on the standard camera. We actually preferred the color profile of ultra-wide snaps, as they were richer and a bit darker, but that’s just preference.",
    "We sound like a broken record on this point, but 2MP auxiliary cameras rarely add anything to smartphones, and that’s the case here too. Macro snaps were so noisy as to be practically unusable.",
    "Thanks to having a high-res main sensor, the Realme 8 Pro is afforded up to 20x digital zoom - as that’s just cropping in on pictures - though we wouldn’t recommend going this far, as pictures get hideously noisy. Pictures up to 5x zoom are fine, though.",
    "We’ve got to commend the front-facing camera, as selfies looked great - they were full of light and color. Portrait mode was surprisingly accurate when it came to adding background blur and tweaking a picture’s settings.",
    "Video recording here goes up to 4K at 30fps or 1080p at 60fps. There’s a novelty camera mode called AI Mixed Portrait, which lets you video a landscape and then yourself, and stitch them together - it’s not exactly a professional-grade mode but it’s fun to play around with.",
    "The Realme 8 Pro has the mid-range Snapdragon 720G chipset paired with 8GB of RAM, so it’s not exactly a processing powerhouse, but we never found it slow.",
    "With the Geekbench 5 benchmark test, the Realme 8 Pro returned a multi-core score of 1679, which is a fair mid-range result. That’s only a sliver below the Moto G9 Plus’ 1690, and above the Google Pixel 5’s 1600.",
    "We had no issues with the phone for gaming, as while it didn’t always default to the highest graphical settings in games, it was always snappy when in game and rarely lagged or stuttered.",
    "It’s the same story when navigating the phone, whether that’s opening and closing apps or scrolling through social media - while we were never blown away by the phone’s navigation speeds, we were never disappointed either. Unless you’re moving to the Realme 8 Pro from a super-premium flagship, you’ll find it great.",
    "The Realme 8 Pro comes with Android 11, running the Realme UI overlay - this seems startlingly similar to Oppo’s ColorOS, a ‘coincidence’ which is perhaps explained by the fact that Realme and Oppo are sibling companies.",
    "The main difference from ‘stock’ Android is the color scheme, as the default app icons and wallpapers are very bright in Realme UI - we liked this, but some may not, and luckily you can change it. There is a big suite of customization options, whether that’s app icon shapes or the fingerprint scanner icon.",
    "When we booted up the phone for the first time, we did find the home screen a bit cluttered, with apps like ‘Phone Manager’, ‘Game Space’ and ‘File Manager’ taking up room. There are no third-party apps pre-installed, though, and it doesn’t take long to throw these extra apps in their own little folder (which we then promptly ignored).",
    "The Realme 8 Pro has a 4,500mAh battery, and we found the phone easily lasted us a day, even if we were going on a little photoshoot or playing lots of games. A second day of use seems unlikely, though, unless your use is very limited.",
    "Charging is snappy at 50W, and it took us less than an hour to power the phone back up to full. There’s no wireless charging here, but that’s to be expected for a phone at this price point.",
    "Realme is a champion at offering fast charging for budget phones, so 50W is not a huge surprise, though it is still welcome. It’s worth pointing out, though, that the Realme 7 Pro hit 65W."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Realme 8 Pro price and availability",
    "13": "Design",
    "16": "Display",
    "21": "Cameras",
    "30": "Specs and performance",
    "34": "Software",
    "37": "Battery life",
    "40": "Don't buy it if..."
  },
  "links": {
    "Realme 7": "https://www.techradar.com/reviews/realme-7-review",
    "Moto G9 Plus": "https://www.techradar.com/reviews/moto-g9-plus-review",
    "Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Realme 7 Pro": "https://www.techradar.com/reviews/realme-7-pro-review"
  }
}