{
  "source": "https://www.techradar.com/reviews/websecuritas-vpn",
  "title": "Websecuritas VPN review",
  "category": "computing",
  "updated": "2021-03-19T16:16:35Z",
  "author": "sead-fadilpasic",
  "summary": "A VPN service that no longer appears to be active",
  "verdict": "We were disappointed to discover that the Websecuritas platform does not work and customer support did not respond to our queries. There's not much we can say without sampling the service, but the lack of native clients, no-logging policy and support for torrenting suggests this VPN would not have been worth the cost regardless.",
  "pros": [
    "N/A"
  ],
  "cons": [
    "Doesn’t work",
    "Poor customer support",
    "Lacks no-logging policy",
    "Doesn’t support torrenting",
    "No native clients"
  ],
  "article": [
    "Websecuritas is a German VPN platform that is either experiencing serious technical issues or has withdrawn its service, but it's still taking payment from customers.",
    "We tried contacting customer support on many occasions and via multiple avenues, but so far have received no response.",
    "There are three subscription options if you decide to risk it with this provider, the cheapest of which is still pretty expensive: €7.99 or $9.61/mo if you opt for yearly billing. One subscription apparently supports up to 7 simultaneous VPN connections.",
    "After your billing period is over, the VPN account is not renewed automatically, so at least you don’t have to bother canceling recurring subscriptions if you don’t wish to retain your account.",
    "Accepted payment methods include credit/debit cards, PayPal, Sofort, GiroPay, SEPA, and Bitcoin. The provider claims to have a two-week money-back guarantee, but we contacted customer support about it (even in German) and never got a response.",
    "Websecuritas also offers a VPN-equipped router, but we have serious doubts given that regular service was never delivered.",
    "Websecuritas has plenty of alternatives and you’d be better off with any of them. The best VPNs around are ExpressVPN, NordVPN, Surfshark, and CyberGhost, none of which will take your money without offering a premium next-level VPN experience, at an even lower cost than Websecuritas.",
    "Regardless of which one of them you opt for, you can count on gorgeous native apps for all the major platforms, with an abundance of features and options to customize your experience, access to thousands of VPN servers, support for torrenting and all the popular geo-restricted streaming services, tried and tested no-logging policies, generous money-back guarantees and more.",
    "Websecuritas makes no mention of its support for geo-restricted streaming services like Hulu, HBO Go, or BBC iPlayer, but it does claim you’ll be able to access Netflix and Amazon Prime Video with its US IP addresses.",
    "Unfortunately, we had no chance to test whether this is actually the case.",
    "Websecuritas.com is a project of Holudeck UG, “a small IT company in the middle of the Palatinate Forest” (a low-mountain region in southwestern Germany). The vendor claims to offer access to servers in 19 countries, including Singapore, Chile, Russia, Romania, and others.",
    "On its website, Websecuritas details its supposed privacy mechanisms, including 2048 to 4096-bit encryption, adblock, and antimalware features. The connection protocols include OpenVPN (TCP and UDP) and L2TP/IPSec. There’s no mention of support for P2P traffic or torrenting on the website, so it’s safe to assume it isn’t supported.",
    "There is something resembling a Privacy Policy, but it doesn’t even mention what data is and isn’t logged when you’re using the provider’s VPN service.",
    "The provider claims its service can be used on Windows, Mac, Android, iOS, Linux, Solaris, NAS devices and routers. Our experience was different.",
    "Also, there are no apps except for on Windows (called HideMachine). The app is terribly basic and wouldn’t connect us. We also tried to set up the platform manually on Windows and Android, but to no avail.",
    "The website wasn’t of much help either. Despite it being in German, it was easy to navigate with the help of Google Translate and we located the FAQ section, but it was very modest and filled only with general information about the provider.",
    "There’s no email listed on the website, but Websecuritas customer support is supposedly available to its customers via a ticketing system. However, we tried this path in our client dashboard and only received a weird error message: “No support departments found. Please try again.” We succeeded in accessing the system when we logged out of the client profile, but after two messages, there’s still been no response.",
    "We even tried messaging them in German with the help of good ole’ Google Translate, but to no avail.",
    "We paid for a subscription, downloaded the app, and that’s where our problems started. No matter how long we waited, or how many different ways we tried to creat a connection, we just couldn’t get the platform to connect.",
    "Unfortunately, all our support tickets were ignored and emails bounced, so we couldn’t get any help with the issue, which leads us to believe that the provider is no longer active but forgot to tell anyone and is still charging for its subscriptions.",
    "Websecuritas VPN simply doesn’t work, regardless of the ways you attempt to connect to its servers. Radio silence from customer support leads us to believe the company is no longer active, but it will still take payment from customers.",
    "Other problems also begin to reveal themselves upon closer inspection, such as the lack of native apps (except for Windows), information about logging adn support for torrenting.",
    "For all these reasons, we recommend that you sign up for a well-established VPN service instead."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "8": "Streaming",
    "10": "About the company",
    "11": "Privacy and encryption",
    "13": "Support",
    "18": "Speed and experience",
    "20": "Verdict"
  },
  "links": {
    "Websecuritas": "https://www.websecuritas.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://www.websecuritas.com/datenschutz/",
    "FAQ section": "https://www.websecuritas.com/vpn-faq/"
  }
}