{
  "source": "https://www.techradar.com/reviews/samsung-q90t-qled-tv",
  "title": "Samsung Q90T QLED TV review",
  "category": "televisions",
  "updated": "2021-06-23T10:22:09Z",
  "author": "nick-pino",
  "summary": "A versatile TV that can fit in both a darkened home theater or super bright living room",
  "verdict": "The Samsung Q90T QLED TV doesn’t need to use its intense brightness to dazzle viewers and instead goes for natural colors and exceptional black levels. It lacks some of the features of the Q95T and some modes are a bit darker than we'd like, but the Dynamic setting delivers some of the brightest images on any LED-LCD TV.",
  "pros": [
    "Dynamic Mode is super bright",
    "Accurate colors in most modes",
    "One HDMI 2.1 port for 4K/120Hz"
  ],
  "cons": [
    "Some modes are too dark",
    "No OneConnect Box",
    "Bixby still needs work"
  ],
  "article": [
    "For years, we’ve subscribed to the basic principle that bright TVs were better for bright rooms and darker TVs are better for darker rooms. Traditionally that’s meant we’ve recommended QLED TVs for folks with bright, open living rooms and OLEDs for folks who have a home theater or light-controlled basement.",
    "But is it possible for the Samsung Q90T QLED to excel at both? The answer, with a few caveats, looks to be yes.",
    "That’s because the Samsung Q90T is built to be a bright TV – especially if you’re using it in the Dynamic picture setting where it can hit over 2,000 nits of peak brightness. But, turn it to another setting like Movie or Natural, and suddenly the brightness drops down to appropriate home cinema levels, making it somewhat of a double threat. You'll need to tweak the settings to find the perfect balance between brightness, color accuracy and contrast, but when you do it really shines.",
    "So what's wrong with it? It's a bit of a middle-child. The Samsung Q95T QLED TV got the OneConnect Box that bundles all your connections into a single, nearly invisible wire that runs to the TV while the Samsung Q80T does a lot of the same stuff for a lot less. Still, it's cheaper than last year's Samsung Q90R and mostly just as good.",
    "Despite being an older model, we'd still recommend the Q90T as a solid purchase option, especially since we weren't wowed over by its Samsung QN90A successor's sound or stand stability. So why not get an older model for that little bit cheaper?",
    "The Samsung Q90T QLED TV is part of the Samsung 2020 TV catalog and sits at the top of the manufacturer's 4K QLED lineup. There’s higher-end 8K QLED TVs like the Q800T and Q950T, but the Samsung Q90T is as premium as you can get with a 4K resolution.",
    "Despite being less expensive at launch than last year’s Samsung Q90R QLED TV, The Samsung Q90T isn’t exactly what we’d consider cheap. The Q90T comes in four sizes – 55, 65, 75 and 85-inches – starting at $1,499 (£1,399) for the 55-inch QN55Q90T and shooting up to $4,499 for the monstrous 85-inch screen, though it's only available in the US at that size. The model we were sent for review is the 65-inch QN65Q90T that will set you back around $2,199 (£2,199).",
    "Of course, if that’s a bit more than you wanted to spend, you could always pick up the similarly-specced Samsung Q80T QLED TV that also uses full array local dimming, or drop down to either the Samsung Q70T or Q60T that use edge lighting instead. You’re compromising on contrast if you do that, but the Samsung Q60T/Q70T are half the price of the Q90T.",
    "The Samsung Q90T is actually a fair bit cheaper than last year’s Samsung Q90R flagship because Samsung has made a few cuts in terms of the design of the TV – there’s no OneConnect Box and there are fewer local dimming zones than last year. Moreover, it’s still a fairly chunky screen, especially when you have it sitting next to a razor-thin OLED.",
    "In terms of the exterior design of the TV, you’re looking at an almost invisible bezel that stands (quite solidly) on a metallic pedestal. It gives the screen a space-age look and can make for a real conversation starter when it’s in Ambient Mode.",
    "Spin it around to the side and you’ll see the aluminum brushed siding that sits at around one-and-one-quarter inches deep. Compare that to the quarter-inch-deep design of the LG CX OLED and the Samsung looks massive by comparison. The reason for the Samsung Q90T’s extra girth is that it’s packing a FALD LED backlight rather than a self-emissive panel – but we’ll come back to explain what that means and why that’s important in a minute.",
    "Spin it around all the way and you’ll find the ports for the TV. This year, the Samsung Q90T is packing a single HDMI 2.1 port with three HDMI 2.0b ports, two USB ports, a digital optical out and an ethernet port alongside a coaxial connector for older cable boxes or antennas. It’s a bit of a shame that only one port is HDMI 2.1, however that’s better than none at all.",
    "While cables do tuck nicely behind the screen, it’s kind of a bummer that Samsung has removed the OneConnect Box from the Q90 Series. That allowed you to slot all your HDMI connections into a single box, then run a small, nearly invisible wire to the TV itself. It’s not a deal breaker, but it’s definitely a tangible downside for anyone who plans on wall-mounting it.",
    "Setting up the TV is done either with the remote or, if you’re feeling a bit more adventurous, through the SmartThings app on your phone or tablet.",
    "Setting the TV up through the SmartThings app takes nearly as long as it does when you use the remote, and there’s not a huge benefit to using the app if you don’t plan on tapping into Samsung’s smart home ecosystem.",
    "That said, Tizen itself is a solid smart TV platform. It’s fast, responsive, supports two assistants and carries most major streaming services. The only downside is that, compared to Roku TV or even Android TV, Bixby search still isn’t great.",
    "In terms of app support, you’ll find all the mainstream apps – Netflix, Amazon Prime Video, Disney Plus, Rakuten TV, Apple TV, Hulu and YouTube – with few, if any, exceptions. All the apps that you’d expect to do 4K HDR like Netflix and Prime do so, however because it’s Samsung you won’t find Dolby Vision support here and will be stuck with HDR10+. On top of all that, there’s Mobile Multi View with Casting that enables you to see the TV image and your smartphone simultaneously, and Ambient mode, which returns this year and helps your TV blend into the background when it’s not being watched.",
    "In fact, the only big new addition we found on Tizen this year is the addition of the Samsung Health app that was announced at CES 2020. Connect the TV to the Samsung Health app on your phone and you’ll get up-to-the-minute fitness data that’s tracked across devices. The app itself includes classes in yoga, mindfulness, strength training, stretching, barre, pilates, dance, cardio and more, with more partners to potentially arrive later down the line.",
    "The problem we have with Tizen is that, when you’re using Bixby as the default assistant, searching for movies can be sort of a headache. Say, for instance, you want to watch the 2014 film Exodus: Gods and Kings (for whatever reason) but you can’t remember the subtitle. Simply saying “Find Exodus” or “Show me Exodus” doesn’t return any results – which can be incredibly frustrating. The same is true if you say \"Show me Apple TV Plus\" or \"Go to Disney Plus\", to which Bixby replies that it can't help you, despite those apps existing on the store. Another example we’ve found in the past is that Bixby thinks you’re saying “Four” instead of “Thor” when searching for the Marvel films.",
    "All of that may sound like minor inconveniences, but when you depend on your smart assistant to deliver you relevant search results, Bixby on Tizen just can't compete with the other players in the filed.",
    "So, what exactly is Full Array Local Dimming (FALD) and why does it matter?",
    "As opposed to edge-lit LED-LCD, TVs with a direct full array panel enable better contrast thanks to a number of LED zones that can be turned on and off individually. That's great for HDR content where you have an incredible bright part of the scene next to some really dark part (an open door with sunlight streaming into a darkened room, for example) where you might have previously seen grayness or a halo-like effect now looks exactly as it should.",
    "It's actually the FALD panel that makes Samsung Q90T so incredibly versatile. As we mentioned before, it absolutely can reach 2,000 nits of peak brightness and fill your living room with light. But if that’s too bright, you can always lower the brightness and, along the way, improve color accuracy as well.",
    "To start you on that path, the Q90T offers five different preset picture modes – Dynamic, Normal, Natural, Movie and Filmmaker Mode – and the difference between Dynamic and Movie could very well be over 700 nits. That’s how big of a difference these settings make.",
    "On some level, this versatility is incredible. It allows you to be flexible in where you put the TV and in what lighting conditions adversely affect the picture quality. It’s similar in many ways to Sony’s flagship X950/X95 Series that can please every AV enthusiast simply because of how many ways there are to tweak and play around with the settings.",
    "Straight out of the box, however, it can lead to a frustrating dilemma: Dynamic is going to be too bright for dark rooms, Natural and Movie modes are too dark for bright rooms, and Filmmaker is straight up impossible to see in almost anything but a home cinema. That means you’ll mostly be using Normal mode, as it presents the best balance, but is merely mediocre compared to other TVs.",
    "No matter where you land on the picture modes, you’ll at least need to tweak Samsung’s aggressive motion processing and judder settings (called Auto Motion Plus) that overprocess slow moving scenes. At their default settings they can make content look a bit sped up and the only remedy we've found is to set both the de-blur and de-judder settings to less than five.",
    "While 4K HDR content looks as amazing as you'd expect on this TV, the HD SDR isn't bad either thanks to the Samsung Quantum Processor 4K. Watching Jeopardy on Netflix in HD looked great when upscaled and older films looked like they were made 10 decades later than they actually were. It's a huge accomplishment.",
    "Not all content looked perfect - in fact, streaming NFL Redzone on Sling TV was an absolute mess at some points - but the good far outweighs the bad.",
    "The same is true for 4K HDR gaming on this TV using the PS4 Pro. The world of Final Fantasy 7 Remake looked lush and foreboding, and thanks to Game Mode's auto-low latency passthrough and VRR it played great, too.",
    "The good news is that there aren't any audio issues to speak of. The TV has eight(!) built-in speakers and uses Samsung's new Object Tracking Sound feature that helps give the illusion of object-based surround sound straight from the TV. We don't recommend tossing out your Dolby Atmos system for the TV speakers, but OTS is a nice feature for folks who aren't able to spend on a standalone system.",
    "Speaking of object-based surround sound, the Samsung Q90T does support Atmos and DTS:X, which is great if you plan on picking up one of Samsung's Dolby Atmos soundbars like the new Samsung HW-Q70T, HW-Q950T or HW-Q900T or if you plan on providing your own Atmos-based system."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Price and release date",
    "8": "Design",
    "13": "Smart TV (Tizen)",
    "20": "Performance",
    "30": "Sound",
    "32": "Don't buy it if..."
  },
  "links": {
    "Samsung Q95T QLED TV": "https://www.techradar.com/reviews/samsung-q95t-4k-qled-tv",
    "Samsung Q80T": "https://www.techradar.com/reviews/samsung-q80t-qled-tv",
    "Samsung Q90R": "https://www.techradar.com/reviews/samsung-q90-qled-tv",
    "Samsung QN90A": "https://www.techradar.com/reviews/samsung-qn90a-neo-qled-tv",
    "Samsung 2020 TV catalog": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Q800T": "https://www.techradar.com/reviews/samsung-q800t-8k-qled-tv",
    "Q950T": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "Samsung Q70T": "https://www.techradar.com/reviews/samsung-q70t-qled-tv",
    "LG CX OLED": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained"
  }
}