{
  "source": "https://www.techradar.com/reviews/feelmore-labs-cove",
  "title": "Feelmore Labs Cove review",
  "category": "fitness",
  "updated": "2021-10-15T09:27:07Z",
  "author": "rob-clymo",
  "summary": "Cove is the wearable designed to help you sleep better and stress less",
  "verdict": "Feelmore Labs Cove is a premium product, with a price tag that seems rather too high for what you get in return. While our own experience with the device suggests there may be something to the power of Cove, particularly when it comes to helping you relax, it’s hard to judge exactly how well it works. If you’re not in a position to simply go out for a run, which is our own go-to method for relaxing, beating stress and gearing up for a better night’s sleep, Cove could provide the answer. Indeed, its creators suggest you’ll get better results with regular 20-minute sessions over time. There is, of course, the placebo-effect nature of the Cove too: when it’s not digging into your head those comforting vibes do at least make you feel like you’re calming down.",
  "pros": [
    "Quirky soothing appeal",
    "Can be used anywhere",
    "Variable intensity settings"
  ],
  "cons": [
    "Design could be improved",
    "App is rather underwhelming",
    "High price for what it is"
  ],
  "article": [
    "Cove is just one of a raft of gizmos on the market aimed at helping you to relax and reduce your stress and anxiety levels. It comes as a combination package with a wearable headset and a supporting app making up the bundle. Following initial setup, simply pop the headset on, select a soothing 20-minute session from the app and enjoy the sensatory powers of this wearable on your nervous system.",
    "While Cove is a use-anywhere option, it also needs some refinement, with a headset that could be more fun to wear and an app that needs some tweaks on the functionality front too. We enjoyed its soothing powers but, personally, it’s not going to replace a 30-minute jog around the block for us. If you’re not willing, or able to go down that route though Cove is worth investigating, despite its high purchase price.",
    "Cove costs $490 / £369 (about AU$674) purchased direct from Feelmore Labs, and the first iteration appeared during 2020. The company is also working on a revised model, which it says will address some of the issues with the original incarnation.",
    "Wearable tech is hardly a new thing, but it’s surprising just how many of the latest devices still feel as though they’re in development. Out of the box, Cove appears a little like that too. The wireless/Bluetooth wearable headset part of the relaxation puzzle comes in a foldout plastic container, so you can store it safely when it’s not in use.",
    "The headset itself is largely plastic too, but with a sort of rubberized finish that contains all of the technology. As you’ll see from the images, the design is a headband-meets-headset-meets-spectacles arrangement. We had to consult the website to see exactly how to fit it, but once it was in place the unit felt comfortable enough. However, you widen it using a slider in the middle of the flexible bit, which feels decidedly cheap and cheerful considering the Cove’s high price tag.",
    "The other slightly annoying bit about having the Cove on the back of your head is that you end up resting on it if you want to lie back and relax. Surely that’s the last thing you want during a stress-busting session.",
    "However, the Cove has been designed to allow you to do other things while you enjoy its soothing charms, so it’s just as good if you’re standing up at the kitchen sink doing the dishes.",
    "Aside from the nodules that sit comfortably on the side of your face, just in front of the ears, there’s a power button on one side along with a plus and minus control on the other to alter intensity settings. There’s a port for recharging purposes right next to that, with a cable that comes supplied while the light flashes green once it’s fully charged. Cove suggests you’ll get four sessions per charge and it can be fully charged in 60-80 minutes.",
    "If you’re not a big fan of apps then walk away right now though, as the other part of the design involves the Cove app and registering for a free account. You’ll need this to configure and operate the device, as well as getting the best from it moving forwards.",
    "The app is slick and pretty simple, although you can’t operate the overall setup until you’ve done the latest firmware update. We had to do this and it took longer and was more of a faff than expected, with the LED blinking white for what seemed like ages.",
    "If you’re eager to start busting those stress levels, or crave better sleep, then the initial performance of Cove might leave you wondering why it costs so much for what it does. However, before that, we had to endure the issues with the firmware update. This didn't work first time and on the second occasion it took so long we wondered if the unit had perhaps crashed. It did eventually work on the third attempt, after we quit the app and launched it again.",
    "Fiddling with the headset to get the fit feeling right is also not an exact science. Nevertheless, once everything is ready to go the Cove works as expected. It does seem to affect different people in different ways. That’s hardly surprising given that everyone is individual, but it was interesting to see just how much the intensity levels affected three different people trying it out in our household.",
    "In that respect Cove does feel a little like you’ll want to try it before you buy it, especially given the cost. Feelmore Labs does have a 45-day return policy though in order to alleviate that concern.",
    "If you wear glasses you might find they conflict with the over-the-ears nature of the design, but those little vibrating motors do work to good effect delivering varying levels of intense buzzing into the right places on the side of your head.",
    "Crucially, it’s best to select the lowest vibration level you can, whilst still being able to notice it. Hone this correctly and Cove experts claim the sensory experience will be one that taps into your insular cortex, thereby helping you to de-stress, relax and melt away anxiety.",
    "While there appears to have been plenty of research done on just how well this works, there doesn't seem to be anything concrete to go on. Based on the feelings we got during our time with it Cove does seem to help soothe a stressed freelancer. It’s great that you can do other things with the Cove on your head and a 20-minute program running (you can reduce or stop these sooner if needed). We’ll certainly be using it over the coming months in search of that elusive sea of tranquillity, which somehow always seems to be just out of reach.",
    "First reviewed September 2021"
  ],
  "headers": {
    "0": "Feelmore Labs Cove one-minute review",
    "2": "Feelmore Labs Cove price and availability",
    "3": "Feelmore Labs Cove design",
    "10": "Feelmore Labs Cove performance",
    "17": "Don't buy it if"
  },
  "links": {
    "direct from Feelmore Labs": "https://www.feelcove.com/"
  }
}