{
  "source": "https://www.techradar.com/reviews/gmk-nucbox-thin-client-mini-pc",
  "title": "GMK NucBox thin client mini PC review",
  "category": "computing",
  "updated": "2021-05-17T11:48:21.628Z",
  "author": "desire-athow",
  "summary": "A rival to the Chuwi Larkbox has emerged",
  "verdict": "Based on what we have seen, the NucBox easily deserves an editor’s choice. It has a too-good-to-be-true feel to it because of its extraordinary value for money and we just hope that GMK is not a fly-by-night, one-off operation. We shall keep a very close eye on that one.",
  "pros": [
    "Tiny form factor",
    "Type-C connector",
    "Incredibly affordable",
    "Very good performance",
    "Type-C power connector"
  ],
  "cons": [
    "Bluetooth 5.1 would have been preferred",
    "Lack of VESA mount option"
  ],
  "article": [
    "The Chuwi LarkBox was hailed as the smallest 4K mini PC when it launched earlier this year on Indiegogo. It rapidly gained momentum and by August, had secured more than $1 million from nearly 8,000 backers globally.",
    "Such a success rapidly grabbed the attention of others with the XCY X51 and the GMK NucBox (a clear allusion to Intel’s Next Unit of Computing) rapidly coming out of the ranks to grab what looks like a brand new form factor. We are reviewing the NucBox which like the LarkBox, has just debuted on Indiegogo.",
    "Unlike Chuwi though, GMK is a bit of an unknown quantity; we have known the former for more than four years. GMK was only created in 2019 but, based on its company page, the core team members seem to have a rich industry experience, coming from Meizu, Teclast, Chuwi and Alldocube, companies we’ve come across before.",
    "Take this with a pinch of salt though and be mindful of the many risks that backing an Indiegogo project may involve.",
    "The GMK NucBox is available from Amazon for $290 for the 8GB/512GB model and $120 for the 8GB/128GB SKU. Use the promocode 506PTCF2 at checkout to get this 50% discount. Only 100 units are available at this price.",
    "The GMK NucBox is almost identical to the XCY X51 and the LarkBox both in size and port placement which leads us to believe that they come out from the same ODM (original design manufacturer). Its gray gunmetal colour scheme with a silver ring will not please everyone but its metal body is refreshingly different.",
    "At 62 x 62 x 42mm (161 cubic centimeters or around half a can of your favourite fizzy drink) for a weight of 125g, it is positively tiny and will hold comfortably in one’s palm.",
    "The top has a circular fan opening while you can find the power button (and a status light), a microSD card slot, an audio port, a USB Type-C connector (that doubles as a power port), a full size HDMI port (v2.0) and two USB 3.0 connectors.",
    "The 24W (12v2A) power supply unit has about the same footprint as the NucBox but is thinner, similar to a smartphone charger.",
    "Inside the NucBox is an Intel Celeron J4125 which is a quad-core, quad-thread processor with a base frequency of 2GHz, 4MB cache and a burst frequency of 2.7GHz; as such, it should be faster than the N-series Celeron (N4000, N4100, N4120) which is one of the foundational elements of many entry level laptops. Expect it to be faster than a 6th generation Intel Core i5 especially when you factor in the Intel UHD Graphics 600 video subsystem.",
    "All models come with 8GB LPDDR4 memory (Micron), Intel Dual Band Wireless-AC 7265 (WiFi-5, 2x2 TR/RX streams with Bluetooth 4.2) and a Goke GK2301 SATA controller. The memory chip on the M.2 2242 SSD was rather intriguing; “29f64b2amcmg4” corresponds to a 256Gb part found in the Intel P4608 which is an enterprise-grade SSD. It is however labelled as C100 in Windows’ Device manager.",
    "The NucBox performed in line with our expectations. The slight speed bump (200MHz) combined with the use of a SATA-based SSD means that it was faster than the Chuwi, the only nanoPC that we tested, by a small but still significant margin. The J4125 remains the second fastest non-Core processor ever launched, after the Pentium J5040.",
    "That is to say that it is plenty fast and capable. Combine this with 8GB of RAM and 128GB and you have a very, very capable device that should be able to perform more than just basic front-desk functions. Expect the performance to nudge up slightly when increasing storage capacity.",
    "The obvious competitor is the Chuwi Larkbox which garnered a solid 4/5 but is significantly inferior to the NucBox (slower CPU, less system memory, less storage and use of eMMC). It is also far, far more expensive at $239 at the time of writing.",
    "The XCY M1K PC HDMI stick is another strong contender at a lower price but it has half the memory and storage and an inferior processor. With a total volume of 91 cubic centimeters, it is also far smaller (and lighter) than the GMK NucBox.",
    "Ironically, the only real competitor we could find at this price, regardless of the form factor is a … laptop. The Kuu Xbook costs $269 (for the 256GB version), has a slightly inferior CPU but matches the NucBox on memory and storage capacity.",
    "The NucBox is an impressive first step for GMK; it is faster and provides much better value than its rivals but only time will tell whether it is a safe bet. Even at normal retail prices, it is very, very competitive and we see no problem using it as a thin client or a desktop replacement mini PC.",
    "We would have loved to see a VESA mount option offered, something that Chuwi has. Likewise, a Bluetooth 5.1-capable Wi-Fi card would have been a better option. We would love to see a flatter version, one that increases the dissipation surface area for the CPU and eliminates the need for an active heat sink.",
    "The pipedream remains swapping the processor for an AMD Ryzen-based. AMD doesn’t have a 4-core SKU that can compete against the J4125. The closest one is the AMD 3020e which is a dual-core CPU with a TDP of 6W, so a quad-core 10W Ryzen is not out of question."
  ],
  "headers": {
    "4": "Pricing and availability",
    "5": "Design",
    "9": "Hardware",
    "11": "In use and performance",
    "13": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "Chuwi LarkBox": "https://www.techradar.com/reviews/chuwi-larkbox-thin-client-mini-pc",
    "NucBox": "https://www.indiegogo.com/projects/gmk-nucbox-most-powerful-palm-sized-4k-mini-pc?create_edit=true#/",
    "Indiegogo": "https://www.indiegogo.com/projects/gmk-nucbox-most-powerful-palm-sized-4k-mini-pc?create_edit=true#/",
    "its company page": "https://gmktec.com/pages/our-story",
    "GMK NucBox is available from Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNucBox-Windows-Computer-128GB-512GB-Bluetooth%2Fdp%2FB08VJ6TH8Z%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1026975547579429600-20",
    "N4000, N4100, N4120": "https://www.techradar.com/news/intel-celeron-n4000-vs-n4100-vs-n4120-whats-the-difference",
    "Chuwi Larkbox": "https://www.techradar.com/reviews/chuwi-larkbox-thin-client-mini-pc",
    "XCY M1K PC": "https://www.techradar.com/news/this-is-the-cheapest-128gb-windows-pc-and-it-looks-like-a-usb-drive"
  }
}