{
  "source": "https://www.techradar.com/reviews/acer-swift-3-2020",
  "title": "Acer Swift 3 (2020) review",
  "category": "computing",
  "updated": "2021-07-08T16:29:04Z",
  "author": "john-loeffler",
  "summary": "The Acer Swift 3 punches above its ultralight-weight...again",
  "verdict": "The latest Acer Swift 3 (2020) is an excellent ultrabook for the masses, made better thanks to its accessible price, thin and lightweight design, and pretty decent battery life.",
  "pros": [
    "Highly portable",
    "Excellent multitasker",
    "Very affordable for an Ultrabook"
  ],
  "cons": [
    "Speakers are \"meh\"",
    "Not great for gaming"
  ],
  "article": [
    "It might be a budget machine, but the Acer Swift 3 (2020) outperforms other laptops in its price range. Whereas most cheap laptops will provide a barely passable computing experience, the Swift line proves that just because a machine comes with a low price tag doesn’t mean it can’t be a solid computer as well. Additionally, it also makes for a solid Ultrabook.",
    "However, budget laptops do come with more limitations than their more expensive siblings, and the Acer Swift 3 (2020) is no exception. It’s inherited some of its predecessor’s flaws, such as weak-sounding, downward-facing speakers. But, it’s improved on its predecessor as well, by updating the performance and battery life, without adjusting the price. The Swift 3 might not be the Dell XPS 13, but it will get you fairly close for a fraction of the price.",
    "Basically, if you want that Ultrabook form factor for a fantastic value, the Acer Swift 3 (2020) is an excellent choice, particularly if you’re on a limited budget.",
    "The 14-inch Acer Swift 3 (2020) model we reviewed is the $699 model (around £565, AU$1070), which features a 10th Gen Intel Core i5-1035G1 processor, 8GB of DDR4 RAM, integrated Intel UHD graphics, and a 512GB M.2 PCIe SSD.",
    "The cheapest Swift 3 configuration, available for $499 (around £405, AU$765), features an AMD Ryzen 5 3500, 4GB of DDR4 RAM, and AMD Radeon Vega 8 graphics.",
    "For the $799 version (around £645, AU$1220), the Acer Swift 3 comes packed with a 10th Gen Intel Core i5-1035G4 CPU, 8GB of DDR4 SDRAM, an M.2 PCIe 512GB SSD with Intel Iris Plus graphics.",
    "Acer continued its minimalist design aesthetic with this year's Acer Swift 3. Definitely taking a cue from the Apple MacBook Air, the thin, lightweight aluminum chassis should feel familiar to anyone acquainted with earlier Acer Swift 3 models.",
    "The matte-silver finish with polished Acer logo on the back is about as flashy as the laptop gets, and – for some – that's exactly what they're looking for. Needless to say, you will have to supply the personality yourself.",
    "The Swift 3 measures in at 12.6 x 8.5 x 0.6 inches and weighs 2.7 pounds, making the device incredibly portable without feeling flimsy. In fact, once our cat got bored with the box and decided to investigate the power cable, she brought the open, running laptop down off a three and a half foot tall desk onto a hardwood floor and bolted, leaving no visible or noticeable damage to the exterior or the internals of the laptop.",
    "While not in any way recommended as a test to run on your own machine, its good to know that there's a chance that the Acer Swift 3 will survive in the real world.",
    "Speaking of opening it up, the island-style keyboard features responsive, chicklet keys and a Windows Hello-enabled fingerprint scanner. While some might find the keyboard to be a bit cramped, the keys are spaced well for a laptop of its size and the black keys are backlit with soft white LEDs for better visibility.",
    "The trackpad is a good size and responds well during everyday, general use. It also handled itself pretty well in a few PC gaming sessions of Stellaris and Civilization VI, but anything more than that will need a separate mouse or gamepad.",
    "As for ports, Acer loaded up 2020's Swift 3 with a USB 2.0, a USB 3.0, and a USB-C Thunderbolt 3 port to go along with an HDMI port and headphone/mic jack. There's no SD card reader or optical drive, but that's pretty typical of an Ultrabook nowadays.",
    "The Swift 3 features a 14-inch Full HD (1920 x 1080) display that isn't the crispest on the market, but which is more than enough for most purposes. Several hours of HD streaming movies looked excellent bright enough in all but the most direct sunlight.",
    "The display's color profile doesn't stand out necessarily, but it feels like it at least meets the standard of a modern 1080p display. The bezels along the sides and top aren't the thinnest available right now, but they aren't the thickest either. The bottom bezel is the largest but it isn't awful.",
    "The total screen real estate feels appropriate for the overall size of the laptop so it never gets to feeling like things are more cramped than they should be for a 14-inch display. In fact, having two application windows open side-by-side on screen was absolutely doable with minimal horizontal-scroll on Chrome or Microsoft Word.",
    "As for the webcam and built-in mic, both are functional, if modest. Neither are good enough for Twitch streaming, professional YouTube broadcasting, or anything along those lines but they are more than adequate for teleconferencing through Zoom or similar for work purposes.",
    "After running the Acer Swift 3 through a suite of benchmark tests for its CPU, GPU, and battery, we're pleased to say that there's a measurable improvement over last years model.",
    "When it comes to playing video and general use, there's little to complain about with the Acer Swift 3. Running the notoriously resource-hogging Google Chrome with two dozen tabs open was handled smoothly by the Swift 3, even when one of those tabs was playing through a Udemy course and another had an active Slack channel going.",
    "The system seemed to struggle a bit when trying to run several advertising-heavy tabs, but the same can be said of most systems and — really — that's more of a societal problem than one limited to a single Acer laptop.",
    "The Acer Swift 3 2020 also handled some light gaming through Steam without any trouble and kept a solid frame rate going through the mid-point of a game of Stellaris, but when that end-game crisis hits and the Intel UHD graphics GPU is trying to track 200+ corvettes and destroyers weaving between a couple of dozen capital ships shooting lasers and fusion torpedos, the fans are going to kick in and you will get a noticeable drop in responsiveness.",
    "Meanwhile, the Swift 3 handled multimedia content creation pretty well for a system with 8GB of RAM. Loading up Photoshop and doing basic photo editing with a dozen or so open files was pretty smooth without any hang-ups.",
    "The biggest improvement we saw over last year's Acer Swift 3 came in the battery department. Our battery life test, where we loop a 1080p video, ran for 7 hours and 6 minutes, about the same as older models of the Swift 3, but on the PC Mark 10 battery test, the Swift 3 ran for 6 hours and 12 minutes on performance mode with a balanced power profile and made it a full eight hours on a modest battery saver mode and balanced power profile.",
    "As far as thermal performance, the Swift 3 runs comfortably and never gets noticeably warm, even under duress, and the laptop's fans are effective and whisper-quiet while actively cooling everything.",
    "The hottest part of the laptop is on the bottom rear of the machine by the battery, so the most likely time you'll notice any heat build-up will be if you're gaming or video-editing a project while sitting up in bed with the laptop on your legs. Even then, it won't get uncomfortably \"hot\" the way others might.",
    "Where the Swift 3 comes up short is its speakers, unfortunately. The audio from the laptop is tinny with almost no low-end, so it all comes off sounding somewhat flat. It's fine for listening to Spotify or YouTube while working on a project or typing up a report, but on max volume it's barely audible a room or two away.",
    "And that's assuming the Swift 3 is sitting on a flat table with no obstruction or table cloth to muffle it. With the downward-facing speakers, sitting the Swift 3 on a bed significantly muffles the sound. This has been a recurring problem with a lot of laptops over the years and the Acer Swift 3 is no different, but its something that should have been addressed by now."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "17": "Performance",
    "22": "Battery life",
    "27": "Don't buy it if..."
  },
  "links": {
    "Ultrabook": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "budget laptops": "https://www.techradar.com/news/the-best-laptop-deals",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-2020",
    "Apple MacBook Air": "https://www.techradar.com/reviews/macbook-air-2020",
    "Acer Swift 3": "https://www.techradar.com/reviews/acer-swift-3-2019"
  }
}