{
  "source": "https://www.techradar.com/reviews/thunderdrive",
  "title": "ThunderDrive review",
  "category": "computing",
  "updated": "2021-01-12T07:50:03Z",
  "author": "john-faulds",
  "summary": "If something seems too good to be true, it probably is",
  "verdict": "ThunderDrive may draw you in with its cheap prices but if your looking for features, you'll be better off looking elsewhere.",
  "pros": [
    "Simple pricing",
    "Easy file sharing"
  ],
  "cons": [
    "No apps",
    "No versioning",
    "No demo or free trial",
    "Based on a publicly available PHP script"
  ],
  "article": [
    "ThunderDrive is a cloud storage service that focuses on making it easy to store and share your files from any device in a secure manner. It’s a relative newcomer to the market, going up against some of the best cloud storage providers in the business.",
    "In this ThunderDrive evaluation, we find out how well the service compares to the competition, as we look at its pricing, features, support, and how it works.",
    "ThunderDrive is available in two plans, Pro and Personal, which can be purchased as an annual subscription or for a lifetime.",
    "The annual plans, paid in a lump sum each year, are $5/month or $10/month. Lifetime plans are $600 or $1200. The Personal plan comes with 500 GB of space and a bandwidth of 2 TB; the Pro plan offers 2 TB of space and bandwidth. Both plans include 30-day trash recovery.",
    "From looking at the home page of the ThunderDrive website, it seems that pricing is straightforward. The lifetime plans are quite a lot of money to pay up-front, but if you plan on having an account for a long time, the pricing might seem attractive.",
    "But when you click on the Get Started button for one of the lifetime plans, things get a bit strange. For example, after choosing the Personal plan, on the next page, the price has been reduced to just $29! And then, on the next page, you can add a further 2 TB of storage for $39. So in other words, you can get 4 TB of storage for a lifetime for just $68.",
    "For some, this may seem like an absolute steal and cause them to dive headlong into a purchase. For us, it started ringing alarm bells, as it didn’t seem like the way a reputable business would go about things.",
    "So let’s assume you’re one of those not put off by the way prices drop so dramatically, and you are still interested to know how ThunderDrive works. Unfortunately, there’s no free trial or demo for you to test it out before purchasing. And no money-back guarantee.",
    "But if you want to know how it works, you can buy the BeDrive PHP script that ThunderDrive is based on for just $29. BeDrive aims to enable anyone to set up their own self-hosted file-sharing website with no technical knowledge required.",
    "Essentially, the only thing that ThunderDrive offers that you probably wouldn’t get if you decided to install BeDrive yourself is access to a large amount of disk space for such cheap prices.",
    "ThunderDrive states on its own website that its service doesn’t offer the same “bells and whistles” as offered by other competing providers. Its focus is on simplicity and unbeatable prices.",
    "It’s good that ThunderDrive at least admits to not being packed with features, because it really isn’t. ThunderDrive is only accessible through a web browser, and there are no desktop or mobile apps.",
    "Because there are no apps, there is no automatic file synchronization. The only way files get added to your account is if you do it manually, and if you edit that document on your computer, you’ll have to upload it again. So it can’t really be used as a backup service.",
    "One thing that ThunderDrive does do reasonably well is file sharing, with functionality common to most cloud storage services. You can create sharing links to files or folders, which can be given expiry dates and password protected. You can also allow people with access to the shared links to edit file contents or to download files.",
    "But another missing feature that is common to most similar services is file versioning. Most cloud backup providers will save different versions of your files as they’re updated. With ThunderDrive, there are no previous versions of files available, and you’ll only be able to retrieve files from the trash for up to 30 days after they are deleted.",
    "Another area in which ThunderDrive disappoints is its support. You can send an email directly to their support email address, fill in a form, or use a chat widget powered by Intercom. When we went to use the chat widget, it said they were offline and would be back tomorrow. But there was no indication as to what the hours of operation are or exactly what time support would be back online.",
    "The cloud storage market is a crowded one, and there is no shortage of reputable alternatives to consider. As we’ve already discussed, ThunderDrive has very few features, so almost any competitor you choose will come out ahead in that department.",
    "Mega has plans for both individuals and businesses. Individual plans range in price from $5.87/month up to $35.26/month for storage ranging from 400 GB to 16 TB. There is also a free plan that offers 15 GB of permanent storage. There is just a single business plan, which costs $11.80/user/month for unlimited storage.",
    "Box, likewise, has individual and business plans. There is a choice of either a free individual plan with 10 GB of storage or the Personal Pro plan for $10/month with 100 GB of storage. Businesses can choose from four plans with prices ranging from $5/month up to $35/month. Other than the Starter plan, which has a storage limit of 100 GB, the other plans have unlimited storage capacity.",
    "ThunderDrive has a nice-looking website, but everything else about the service just feels off. Quoting lifetime prices of several hundred dollars, then reducing the price by more than 95% when you go to purchase while offering to double the amount of storage for just a bit more, seems like dodgy, used-car-salesman sort of tactic.",
    "And then you find that they’re using a cheap, publicly available PHP script that you can set up for yourself to power their service. What you get has far fewer features than the competition is offering, and comes with very little in the way of support. This severe lack of functionality might also explain why the vast majority of online reviews for this product are scathing.",
    "ThunderDrive might be cheap, but we believe the service would be a case of “you get what you pay for.” We wouldn’t recommend it to anyone."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "How it works",
    "10": "Features",
    "15": "Support",
    "16": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "ThunderDrive": "https://thunderdrive.io/",
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Personal plan": "https://thunderdrive.io/",
    "Pro plan": "https://thunderdrive.io/",
    "BeDrive": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9840408547150731000&xs=1&url=https%3A%2F%2Fcodecanyon.net%2Fitem%2Fbedrive-file-sharing-and-cloud-storage%2F12700384&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fthunderdrive",
    "Mega": "https://www.techradar.com/reviews/mega",
    "Box": "https://www.techradar.com/reviews/box"
  }
}