{
  "source": "https://www.techradar.com/reviews/vanmoof-s3",
  "title": "VanMoof S3 review",
  "category": "fitness",
  "updated": "2021-05-12T11:51:22Z",
  "author": "rob-clymo",
  "summary": "The VanMoof S3 is a premium-grade fully automatic e-bike",
  "verdict": "Overall, we love the appeal of the VanMoof S3. It packs in plenty of innovation, provides a fully automatic electric bike riding experience and boasts one of the best anti-theft systems you can get already built-in to a cycle. The front hub motor pulls you along with ease, while the boost button makes steep hills even more of a doozy. Meanwhile, the automatic four speed transmission is, by and large, excellent. Lookout, however, for occasional slipped shifts that can leave riders puzzled by its vagueness. The VanMoof S3 is also great to look at, without being ostentatious and attracting too much attention. And, thanks to its price tag, this is a bike that now seems like very good value indeed, especially compared to the expensive model it replaces. If you’re looking for something that just works, and provides a well-rounded solution for many different cycling scenarios then, once you’ve unlocked it, the VanMoof is perfect at devouring the miles.",
  "pros": [
    "Superior quality",
    "Keenly priced",
    "Super smart"
  ],
  "cons": [
    "Occasionally vague auto shifting",
    "Pretty heavy to lug around",
    "Battery can’t be removed"
  ],
  "article": [
    "The VanMoof S3 is a hugely likeable electric bike that, once you’ve got to grips with its onboard tech and associated app simply eats up the miles. Comfort levels are good and, even though there’s no suspension, the bulbous tyres and comfy saddle make amends for a non-sprung experience. Power levels and battery range are similarly impressive.",
    "Despite the fact that this is quite a heavy bike, it’s also good on a variety of terrain – though it works best on nicely manicured cycle lanes, which is hardly surprising given its Dutch heritage.",
    "While we largely got on with the automatic four-speed shifting the system did seem a little unsure of itself on occasions, with the odd slip occurring. It’s not enough to put you off the bike, but it can be a bit disconcerting especially if you’re making a manoeuvre. VanMoof has delivered a great bike and also given it a keener price than expected, which makes it pretty good value when you weigh it up against similarly priced competition.",
    "It’s not showy, but the S3 does catch the eye, although it’s still suitably understated enough to hopefully not attract the attention of thieves, which given the current demand for electric bikes is a good thing.",
    "The VanMoof S3 was released in April 2021. The bike costs £1,798 / $1,998 / AU$3,250.",
    "VanMoof has two bikes in its range, the S3 and X3, and the designs are striking. Our test bike, the S3, arrived in all-black or ‘Dark’, which isn’t quite satin and isn’t quite matte either. The finish and the overall design make it seem quite low-key, which is good from a not-getting-it-stolen point of view. Aside from a few shiny flourishes from the likes of the front and rear disc brakes and the aluminium pedal inserts it’s all pretty dark and moody looking. There’s a ‘Light’ edition available too, if you fancy something a little more upbeat.",
    "Our model was suited to riders between 5’8” and 6’8” and features distinctive straight-frame geometry. It’s actually a great blend of old-school Dutch ‘Granny bike’ thinking meets modern-day elegance.",
    "The materials used in the construction of the VanMoof S3 impress too, with high-quality components all round. We couldn’t find anything that seemed cheap, appeared as though it wouldn’t stand the test of time or looked like it would fall off. In fact, this bike is very well built, as we discovered while trying to adjust the saddle via its adjustment bolt that was hidden behind a rubber cover.",
    "Incidentally, the supplied toolkit is not only comprehensive but is a work of art in itself. Top marks for that.",
    "Considering the VanMoof S3’s price tag, we think this bike is now excellent value, especially compared to the company’s earlier VanMoof Electrified X2 model that was hugely tempting, but downright expensive.",
    "Picking over the rest of the design, it’s all good too. The battery is a 504Wh affair, which supplies power to a 250 watt front hub motor. That means you’re effectively pulled, rather than pushed along. The brakes look like they’re more than capable too, but it’s not until you get, quite literally, into the dynamics of the frame that the VanMoof S3 reveals its best feature. There’s a multi-dot display built in to the top tube, which can give you visual indications of the various features and functions once you’ve gained access to the bike.",
    "You have to unlock the bike when it gets delivered though, and we can certainly vouch for the impenetrable nature of the built-in VanMoof anti-theft system. On arrival, our bike was locked and we hadn’t been given the code. After spending a weekend attempting to bypass the locked hub, which prevents the back wheel from turning, we got the code and unlocking the bike was a two-second job.",
    "However, this escapade also highlighted how heavy the S3 is. At 19kg it’s not easy to move the bike around with a locked hub, but that’s also a handy theft deterrent too.",
    "Once you can access the bike it’s a revelation, especially with the accompanying VanMoof app. This is nicely designed and is a one-stop shop for controlling everything about the bike. However, the real bonus with the S3 is its automatic gearing, which is done using a four-speed Sturmey Archer hub system. You can set this up in the app, so once you’re cycling it’s a fully dynamic experience, choosing Flat, Hilly or Custom depending on the landscape. A boost button on the handlebars takes care of anything particularly steep when you need it.",
    "Lights are automatic, but can be set to be always on, or off, while the digital bell offers ‘VanMoof’, ‘Ding Dong’ or ‘Party’ tones to choose from. It’s loud too but, oddly, slower to chime than a conventional bell. Optional front and rear carriers seem like worthwhile add-ons for boosting the versatility of the S3, while full mudguards come as standard.",
    "The VanMoof has an irresistable charm that invites you to try it. While the bike looks pretty simplistic thanks to that minimalist design it’s actually super clever, with enough tech built-in to impress geeks and show-offs, but keeping all of it easy enough to use so as to not deter Luddites. In fact, once you’ve navigated past the setting up bit, and unlocked the bike, there’s not much to it. Get on and ride is the best advice.",
    "Once we did, it was hard to stop, although that wasn’t down to the braking, which is actually excellent thanks to those hydraulic front and rear discs.",
    "Choosing a route that featured quite a few gradients we selected the Hilly option on the app, which adapts the assistance to suit. Setting off, the S3 conveniently selects an easy gear to get going and then switches automatically as you ride. We did a 16 mile round trip the first time and the auto shifting is largely excellent.",
    "We did, however, experience the odd occasion when the bike didn’t seem quite sure which gear it wanted to be in. This resulted in some clunking of the chain, not dissimilar to the experience you’d get as a kid riding a Raleigh bike armed with a three-speed Sturmey Archer gear hub.",
    "For the most part though, the VanMoof S3 delivers a great ride. The Schwalbe Big Ben tyres are just chunky enough to smooth the ride while the saddle is pretty comfy too. Overall, the riding position is upright but relaxed, with handlebar grips that feel fine even on longer runs.",
    "We loved the boost button on the right side, which can be pressed for extra assistance on steeper gradients. It’s actually a bit awkward to push for longer periods, but you’ll end up with a flat battery pretty quickly if you do that anyway.",
    "Our first foray also involved cycling home at dusk and the 40 Lux automatic LED lighting system proved to be excellent. You can change the settings on the app to ‘Always On’ or ‘Always Off’ too. Another boon when you stop for a break is the immobiliser system, which can be activated by kicking a button on the left rear hub. Cleverly, the bike will subsequently disengage this if you’ve got the app and Bluetooth switched on and you’re about to get back on it.",
    "There’s a kickstand for convenience too. The only thing that’s not so great is the weight of the bike as it’s heavy to lift around or up over high curbs.",
    "The VanMoof S3 can get up to 25km/h and getting there can be aided with the benefit of 59Nm of turbo boost torque to use the manufacturer’s description. We found it nippy when it needed to be, but it’s also a great cruiser. VanMoof’s range figures cite between 37 and 93 miles and quite how much you get presumably relies on how much you milk the battery and motor combination, plus that boost button. A full charge takes four hours."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and release date",
    "5": "Design",
    "15": "Performance",
    "24": "Don't buy it if"
  },
  "links": {
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "VanMoof Electrified X2": "https://www.techradar.com/reviews/vanmoof-electrified-x2"
  }
}