{
  "source": "https://www.techradar.com/reviews/htc-vive-flow",
  "title": "Hands on: HTC Vive Flow review",
  "category": "vr",
  "updated": "2021-10-15T10:13:41Z",
  "author": "axel-metz",
  "summary": "Portability over power",
  "verdict": "HTC has made impressive strides to make its Vive Flow headset a truly portable VR machine, but its comfort and form factor come at the expense of power and performance, resulting in ‘immersive eyewear’ that is undoubtedly innovative, but not particularly immersive.",
  "pros": [
    "Incredibly light and comfortable",
    "Portable size"
  ],
  "cons": [
    "Mediocre performance",
    "Expensive for what it is"
  ],
  "article": [
    "It’s official: HTC has finally announced the Vive Flow, a lightweight and portable VR headset that offers users entertainment, wellness and gaming experiences while on the go.",
    "Given the impressive internal specs boasted by the company’s more expensive VR offerings – like the Vive Focus 3 or mainline HTC Vive Pro 2 – it’s certainly a surprise to see HTC Vive divert to a much more stripped-back product that will do little to threaten the crowns of the best VR headsets on offer right now.",
    "Instead, the brand has put all its eggs in the portability basket with the Vive Flow, a product that combines a lightweight and comfortable design with several use cases to bring to market a genuinely innovative VR alternative that is almost a jack of all trades, but most definitely a master of none.",
    "It’s worth noting that, in our (very) brief hands-on time with the device, the Vive Flow was still in beta stage, so the below simply represents our early impressions – which are therefore subject to change upon review of the final product.",
    "For starters, HTC Vive makes no bold claims about the power of the Vive Flow. In fact, it doesn’t even describe the device as a headset, rather ‘immersive eyewear’ that straddles the line between headset and smart glasses.",
    "As such, it’s difficult to compare the Vive Flow to other VR products on the market. Instead, the device occupies its own space as a portable, versatile yet unashamedly limited machine that can’t match its larger VR counterparts for power, but can trump the latest smart glasses for functionality.",
    "It’s no surprise, then, that its internal specs aren’t anything to write home about. In our short demo session with the Vive Flow, HTC reps weren't totally clear about what hardware powers the brand's latest device under the hood, likely because that hardware is a last-generation Qualcomm XR1 chipset.",
    "The Vive Flow can therefore only lay claim to a 75hz refresh rate and two LCD screens operating at 3.2k resolution, which, though passable for a VR device in 2021, restricts the fidelity of its games and wellness experiences.",
    "Admittedly, we didn’t get to try a whole load of those experiences, but those we did play were more like glorified mobile games and apps than bona fide VR showstoppers. Part of that insubstantial feel definitely comes from the Flow’s lack of controller – with the device instead requiring an Android-enabled smartphone to function – but both this and its lack of power mark just a few of the many trade-offs the Flow is forced to make in its commitment to portability.",
    "Luckily, the Vive Flow lives up to its billing in that respect. At just 189g – which is lighter than most of today’s best smartphones – the device is refreshingly easy to carry around, taking up a large pocket of rucksack space as opposed to the entire bag. Its arms fold, too, so the Flow can be slipped into its accompanying storage canister and placed on a desk or bedside table in a way that actually looks pretty smart.",
    "It’s also really comfortable to wear. The Vive Flow sports a dual hinge fit system and snap-on face cushion to eliminate slippage, while adjustable diopter lenses mean those who wear glasses won’t need to when using the device. These neat features mean the headset should fit comfortably on the skulls of most users.",
    "Those aforementioned LCD screens offer an adequate 100-degree field-of-view, which does well to make the best of the Flow’s lacklustre refresh rate and less-than-impressive graphics. The spatial audio in its arms, too, isn’t all that great – though when paired with Bluetooth-connected earphones, the audiovisual experience is heightened dramatically.",
    "Naturally, we weren’t able to test the Vive Flow’s battery life, but HTC claims you’ll get up to five hours from its USB-C compatible battery pack – which seems more than enough for the headset’s moment-to-moment use cases.",
    "And that last point really sums up the appeal (or not) of the HTC Vive Flow. It didn’t bowl us over with any of its varied virtual experiences – the wellness sessions, the games, the virtual cinema – but for a portable headset designed with casual use in mind, it’s an undeniably innovative VR device.",
    "In a press statement release alongside its announcement, Cher Wang, CEO of HTC, said the Vive Flow “is taking technology in a new direction, focusing not on what we do, but on how we feel, [providing] the perfect opportunity to escape our four walls and immerse ourselves in our ideal ambience.”",
    "If you don’t mind that “ideal ambience” being a little grainy and a little tinny-sounding, you’ll likely find lots to love with the HTC Vive Flow. As a device that can be taken on a plane, to the office or used in the comfort of your bedroom, it’s a success – but if you’re after a more substantial VR experience, this isn’t the product for you.",
    "Less easy to swallow is its price. At $499 / £499 (around AU$675), the Vive Flow is even more expensive than some of the most popular – and far superior – VR headsets out there right now, like the Oculus Quest 2 and PlayStation VR.",
    "Admittedly, that’s nowhere near the price of other HTC devices like the mainline HTC Vive, but $499 for a VR device that should really have a ‘lite’ moniker attached to its name is a little excessive in our eyes."
  ],
  "headers": {
    "4": "Design and features",
    "13": "Early verdict"
  },
  "links": {
    "finally announced": "https://www.techradar.com/news/htc-vive-officially-unveils-its-vive-flow-immersive-eyewear",
    "Vive Focus 3": "https://www.techradar.com/reviews/htc-vive-focus-3",
    "HTC Vive Pro 2": "https://www.techradar.com/reviews/htc-vive-pro-2-review",
    "best VR headsets": "https://www.techradar.com/news/the-best-vr-headset",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "PlayStation VR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review"
  }
}