{
  "source": "https://www.techradar.com/reviews/levertrm",
  "title": "LeverTRM review",
  "category": "computing",
  "updated": "2021-11-15T01:30:50Z",
  "author": "mike-jennings",
  "summary": "A single package that manages applicant tracking and candidate relationships",
  "verdict": "CleverTRM is a smart and broad product but it is missing some features despite its expensive price. However, if you have the budget, it's a slick and efficient recruitment and HR solution.",
  "pros": [
    "Good range of features",
    "Easy to use and efficient",
    "Good automation"
  ],
  "cons": [
    "Potentially expensive",
    "Not great with integrations",
    "Fewer screening options"
  ],
  "article": [
    "LeverTRM delivers a total Applicant Tracking System (ATS) alongside a Candidate Relationship Management (CRM) product inside one recruitment platform package that has been been used by Netflix, Mercedes-Benz and KPMG – so it’s clearly got pedigree when it comes to getting the job done.",
    "You’ll find a big focus on a streamlined, user-friendly product here, so LeverTRM could be the ideal option if you’ve not used an ATS or other kinds of HR software in the past.",
    "LeverTRM uses the term Talent Relationship Management, or TRM, to encompass the ATS and CRM parts of its product. It’s a smart idea, and it gives way to a broad selection of features.",
    "LeverTRM’s ATS allows you to create and post vacancies to hundreds of websites and job boards, and you can design and customize every step of the hiring process – ideal if you want to match LeverTRM’s tools up with your existing processes.",
    "There’s a resume parsing tool that can automatically extract essential information from resumes that can help you narrow down a field of candidates, and LeverTRM can track the source of applications and referrals. It’s got a Chrome extension that can track your candidate’s profile throughout the hiring process, and you can create a candidate archive for future use.",
    "LeverTRM has an extensive and powerful automation hub that can use workflows, filters, and triggers to tackle everyday tasks without taking up any of your time, and LeverTRM also has a broad suite of data analytics tools that can make your hiring processes more successful and efficient. There’s a huge concentration here on improving your hiring process and saving time, which makes it a practical choice for larger businesses that do lots of hiring.",
    "LeverTRM has dedicated modules that can help you ensure that your hiring process is equitable and that you’re doing everything possible to ensure you’ve got a diverse and inclusive hiring process, and you can survey every candidate to find out how your hiring procedures could be improved.",
    "Switch over to LeverTRM’s Enterprise product, and you can also gain access to bulk candidate options, improved collaboration, and a more extensive selection of automation options alongside impressive compliance abilities.",
    "LeverTRM also goes big on integrations. The firm currently offers more than one hundred integrations. They’re available in loads of distinct categories, from sourcing and job board tools to onboarding utilities, assessment and background check tools, and communication utilities.",
    "That always helps, but it does highlight a couple of areas where LeverTRM is less impressive. Rivals like Greenhouse have more integrations, and LeverTRM doesn’t have native background screening or the extensive candidate assessment options you’ll find elsewhere. LeverTRM also doesn’t have dedicated Android or iOS apps.",
    "LeverTRM is not unusual in that it doesn’t supply up-front pricing information for its services. If you’re interested in any of the products offered by LeverTRM, it’s best to get in touch with the company to have a demo of the software and develop a bespoke package.",
    "The company does have a slightly unusual approach to packaging its products, though. At the core is the LeverTRM, which encompasses its ATS and CRM strands alongside reporting, analytics, diversity, and inclusion options. You can also get access to LeverTRM’s full integration abilities here.",
    "If you want to go deeper in any of the core areas, though, then you’ll have to pay extra for some of LeverTRM’s add-on products. Here you’ll find advanced modules for automation, recruitment, nurturing staff, and data analysis. Not every company will need these, but it’s a neat way to customize your package – albeit with some extra cost.",
    "If you step up to the LeverTRM Enterprise product, then you get some of those add-ons included for a single price.",
    "LeverTRM takes an intelligent approach to combining ATS and CRM abilities, and that means you get a broad swathe of abilities from this product – it’ll tackle every critical component of your recruitment process. It’s easy to use and very efficient, too, so it’s a good choice if you need to save some time.",
    "You’ll find more integration abilities elsewhere, though, and other services do offer more in terms of background screening and candidate assessment. You also don’t get full access to LeverTRM’s features unless you buy the advanced modules.",
    "If you’ve got budget to burn and want a slick and efficient recruitment and HR solution, though, LeverTRM is an impressive and dependable choice.",
    "We've also featured the best recruitment platforms, best HR software and best background check services"
  ],
  "headers": {
    "2": "Features",
    "10": "Plans and pricing",
    "14": "Final verdict"
  },
  "links": {
    "LeverTRM": "https://www.lever.co/",
    "recruitment platform": "https://www.techradar.com/best/recruitment-platforms",
    "HR software": "https://www.techradar.com/best/best-hr-software",
    "job boards": "https://www.techradar.com/best/free-job-boards",
    "resume": "https://www.techradar.com/best/best-resume-builder",
    "Chrome extension": "https://www.techradar.com/news/the-best-google-chrome-extensions",
    "background check tools": "https://www.techradar.com/best/background-check-services-sites-online",
    "best recruitment platforms": "https://www.techradar.com/best/recruitment-platforms",
    "best HR software": "https://www.techradar.com/best/best-hr-software",
    "best background check services": "https://www.techradar.com/best/background-check-services-sites-online"
  }
}