{
  "source": "https://www.techradar.com/reviews/ecs-liva-q1d-nano-pc",
  "title": "ECS LIVA Q1D nano PC review",
  "category": "computing",
  "updated": "2021-03-16T15:26:53Z",
  "author": "desire-athow",
  "summary": "The tiny PC that wants to take over the world of WFH",
  "verdict": "ECS delivered a decent mini PC (or nano PC) at an affordable price tag but despite the presence of Windows 10 Pro and dual 4K video outputs, there are other alternatives that deliver better performance for less.",
  "pros": [
    "Windows 10 Pro",
    "Dual 4K video output"
  ],
  "cons": [
    "Lack of audio connector",
    "No ability to add extra storage",
    "Very old processor",
    "The use of eMMC",
    "Proprietary power connector"
  ],
  "article": [
    "Small computers are nothing new but a new generation of nano PC push the boundaries farther than ever before. The ECS LIVA Q1D nano PC is the latest of a crop of tiny Windows-based PCs that use laptop and tablet parts to offer ultra compact computing in the palm of your hand. This one however comes with a unique feature that sets it apart from the rest of the competition.",
    "The ECS LIVA Q1D that we tested came with a Pentium N4200 and Windows 10 Pro, all for $199.99 at Amazon. Note that there’s a model with a much slower Celeron N3350 processor for tad less; we’d strongly encourage you to avoid the latter.",
    "The LIVA Q1D is a fair bit different compared to the competition. It combines two seldom used colours (dark blue and champagne gold) with a plastic and metal enclosure to produce a box that is 74 x 74 x 34mm in dimension; a more traditional black version is also available.",
    "There’s plenty of air vents all around to facilitate airflow; the base houses four rubber feet and screw holes to affix a VESA bracket. Elsewhere there’s three USB ports (one of which is USB 2.0), a HDMI connector, one card reader, a Gigabit Ethernet port and last but not least, a full size DisplayPort connector.",
    "So that tiny PC can - in theory - drive two 4K monitors; whether its graphics is fast enough to assume that role - beyond basic productivity work - is something we sadly couldn’t test. All this is powered by a small 24W (12v,2a) power supply unit. Compared to the competition, it lacks a Type-C connector and an audio jack.",
    "Embracing the nano/ultra mini/tiny form factor comes with its fair share of problems; top of which is power dissipation. That explains why ECS opted for a low power processor, the Intel Pentium N4200, a quad-core, quad-thread CPU with 2MB cache and an Intel HD Graphics 505 GPU.",
    "Despite the latter’s 6W power dissipation, we’d still prefer either a Celeron N4120 or a Celeron J4125 both of them offer superior burst frequency, twice the cache and all-round better performance, not surprising given that they were launched three years later and benefited from technological improvements.",
    "Elsewhere, there’s 4GB of LPDDR4 RAM and 64GB eMMC storage (Sandisk SLD64G) with no ability to upgrade. You can’t open the device and say, add an M.2 2242 SSD. One surprise is the presence of the Qualcomm Atheros QCA61x wireless 802.11ac chipset, the first time we’ve encountered this component in lieu of the ubiquitous Intel Wireless AC chipset. As mentioned earlier, the LIVA Q1D is paired with Windows 10 Pro, although on our test system, it was not activated.",
    "The heteroclit assemblage of components that form the Q1D meant that it performed slightly worse than a newer J4115/N4120-based product. That’s made worse by the use of only 4GB of RAM and slower eMMC; not to mention the fact that there’s only 64GB. Windows 10 Pro, with all the trimmings, takes a big portion of that and performance turns to the worse as the amount of free storage decreases.",
    "We tried to take off the base to see what’s inside but our attempt to do so failed miserably. One last screw, for some reasons, seems to be helplessly stuck. Note that the Q1D can be a tad loud under load because of the fan; that was particularly noticeable when running Sandra Sisoftware.",
    "There are three competitors to the LIVA Q1D on the market: the Chuwi Larkbox, the GMK NucBox and the XCY Portable Mini PC. None of them carry Windows 10 Pro and none of them can drive two 4K monitors.",
    "However, if you want something similar, then the Larkbox with 6GB memory and 128GB eMMC storage (expandable to 256GB via an SSD slot) is the cheapest at less than $180 at AliExpress. XCY proposes a slightly slower portable PC but with 8GB RAM and a true 128GB SSD, all for $244. Last but not least is the GMK NucBox, the most powerful of the lot with an Intel J4125 processor; it trumps the rest of the competition by offering up to 512GB SSD, all for a not so expensive $350.",
    "The Mele PCG02 gets an honorable mention; it has a different form factor (being a compute stick) but can drive two 4K monitors, comes with Windows 10 Pro, has an audio jack, twice the memory and storage (albeit eMMC) and a much faster J4125 processor. Even more impressive is that it is far cheaper ($216) and is powered by a 5V3A power supply unit that connects to the chassis via a Type-C connector. In other words, you should be able to use a recent smartphone charger to power it.",
    "Despite not being a household brand, ECS is one of the largest technology companies in Taiwan and a very close partner to Intel. Even then, it hasn’t shown the type of forward thinking that its nimbler rivals have adopted and it shows.",
    "The Q1D may run Windows 10 Pro and dual 4K video outputs but unless these two are absolutely essential for you, other cheaper alternatives will deliver far better value for money. As a business computer, a thin client or an entry-level workstation, though this mini PC will fit the bill especially as ECS is a known brand that has been in the business for more than three decades."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "5": "Hardware",
    "8": "Performance and in use",
    "10": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "ECS LIVA Q1D": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FECS-Elitegroup-Q1D-N3350-2-4Ghz%2Fdp%2FB08T1YK3GZ%2Fref%3Dpsdc_13896591011_t1_B08T235QTL%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4785915653545515000-20",
    "4K monitors": "https://www.techradar.com/news/best-4k-monitors",
    "Chuwi Larkbox": "https://www.techradar.com/reviews/chuwi-larkbox-thin-client-mini-pc",
    "GMK NucBox": "https://www.techradar.com/reviews/gmk-nucbox-thin-client-mini-pc",
    "XCY Portable Mini PC": "https://www.techradar.com/news/this-miniature-desktop-pc-fits-into-a-pocket-and-delivers-decent-performance",
    "AliExpress": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-3491364113066021400&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F4001359847145.html",
    "all for $244": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-3328495224853042700&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F4001282716642.html",
    "$350": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-1453190099223612000&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F1005002076391409.html",
    "$216": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-2900339502618790000&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F4000764751978.html",
    "business computer": "https://www.techradar.com/news/best-business-desktop-pcs",
    "thin client": "https://www.techradar.com/best/best-thin-client",
    "workstation": "https://www.techradar.com/best/best-workstations"
  }
}