{
  "source": "https://www.techradar.com/reviews/avaya-onecloud",
  "title": "Avaya OneCloud review",
  "category": "computing",
  "updated": "2021-08-11T12:35:16Z",
  "author": "catherine-miller",
  "summary": "VOIP telecoms for your business at a flexible price",
  "verdict": "Avaya OneCloud offers a range of VOIP telecoms solutions to allow easy digital communications either inside or outside of your business.",
  "pros": [
    "Wide range of products and services to suit any business",
    "Easily integrate voice and messaging into your applications and customer journey"
  ],
  "cons": [
    "Support is difficult to access"
  ],
  "article": [
    "Many businesses are looking for the best VoIP phone system for their telecoms needs. VoIP can be cheaper, faster to set up, and more flexible than other systems, especially as remote working increases.",
    "Avaya has been around as a telecoms business since 2000, but its recently rebranded Avaya OneCloud is a comprehensive digital option offering a range of communication tools.",
    "In the years since Avaya’s founding, the company has offered several cloud communications and workstream collaboration solutions. Today, Avaya has more than 100,000 customers worldwide, including national governments in 40 countries. Avaya is able to claim numerous high-profile clients, such as the top 10 commercial banks in the US, as well as some of the world’s top airlines, health service providers, and automotive manufacturers. In addition, Avaya currently holds more than 4,300 patents and applications worldwide.",
    "Part of Avaya’s success can undoubtedly be attributed to its OneCloud solution. OneCloud represents a unification of the Avaya brand, encompassing CCaaS, UCaaS, and CPaaS solutions. More than just a standalone VoIP solution, Avaya OneCloud aims to meet all the communication and collaboration needs of the modern business.",
    "In this review, we’ll explore whether Avaya OneCloud could be the VoIP solution for you. Although its support center can be hard to navigate, it’s a multi-faceted platform with plenty of flexibility to allow for quick innovation.",
    "Avaya OneCloud’s Communications Platform as a Service (CPaaS) package is designed to integrate cloud-based calls and messaging into your business’s applications and user experience. It has pay-as-you-go pricing, meaning you’ll only pay for the minutes and messages you use. Local SMS messages cost $0.005 to send, rising to $0.015 for MMS. Calls are $0.015 to make and $0.02 ($0.03 toll free) to receive.",
    "You can also purchase a local ($1) or toll free phone number ($2). Payment can take the form of credit or post-pay billing, based on usage each month. This can make it a more economical choice than other providers with a set subscription fee, especially if you’re operating at scale.",
    "If you’d like to access a broader range of services through one platform, Avaya OneCloud’s Unified Communications service (UCaaS) could be more appropriate for you. The subscription fee will depend on exactly which Avaya OneCloud services you want, and is available on request.",
    "Avaya OneCloud makes it easy to integrate voice calls into your business’s applications, with a range of features to suit your needs. For example, you can create automated Interactive Voice Response (IVR) menus, enable conference calling, and manage caller IDs.",
    "Avaya OneCloud has clearly thought about evaluation: the CPaaS package provides real-time analytics, transcription, and call-tracking to give crucial feedback on performance. There’s also no need to change your SIP endpoints or PBX, as Avaya OneCloud can integrate with your existing devices. Avaya OneCloud’s CPaaS focuses on voice conference calls, so if you’re looking for video conferencing solutions, you might need to invest in the more comprehensive UCaaS instead.",
    "With Avaya OneCloud’s CPaaS, you can add SMS or MMS to your application for a range of uses. You can set this up according to your needs, for example, bulk messaging or two-way messaging so you can receive replies from your customers. You can even implement automated polling or use SMS to add two-factor authentication to your application.",
    "Avaya OneCloud enables you to purchase additional phone numbers and instantly provision them. The range of options will suit a variety of businesses, whether you need toll free, local, or short code numbers.",
    "If you’re looking for a unified communications solution to encompass all your business telecoms needs, you can subscribe to Avaya OneCloud for access to their UCaaS package. With Avaya OneCloud, it’s easy to run a cloud-based phone system across desk or mobile devices. It enables multi-experience communications both between colleagues and with customers, suitable for up to 250,000 users. And the CloudOffice app integrates voice, text, video, and fax into one digital hub.",
    "The Avaya OneCloud CPaaS legacy interface isn’t the most attractive, but luckily you can switch to the new portal once logged in. Toggle between call and message logs and your recordings and transcripts. Developers have a dedicated section of the platform with more sophisticated tools for API integration. Getting set up requires two layers of phone verification, but once you’re in, you can explore the system for free.",
    "The admin portal presents a roles-based self-service administration portal that allows users to activate and configure their services. Routine user-level changes can also be carried out and the fact that the interface is browser-based is a significant plus for remote workers.",
    "Although the Avaya OneCloud interface sounds good on paper, in reality, there is a lot of interaction that the operator needs to go through that could be automated. In fact, numerous users have complained that the interface is in need of an upgrade. This adds inefficiencies into your employees’ workflows, which will ultimately result in lower productivity levels. That being said, the interface does have a nice graphical look and new additions are being made all the time - including a recent AI workflow capability - so there’s still time for existing flaws to be ironed out.",
    "Avaya OneCloud has a somewhat cluttered support page that can be hard to navigate. You can search for a specific product in its vast directory, then download the relevant product patches and documentation. There’s also a dedicated support forum with posts from other customers.",
    "Unfortunately, live support chat is only available to paying customers, and you’ll need to register for an Avaya Single Sign On login and provide proof of your customer status. This is a frustrating barrier to accessing help quickly.",
    "When you’re dealing with potentially sensitive customer information, or having confidential conversations with colleagues, you’ll need your VOIP service to meet high security standards.",
    "All of Avaya OneCloud’s cloud-based solutions meet US Department of Defense security standards. For businesses needing an especially high level of security, the private cloud can be configured specially using standards designed for the US Federal Government.",
    "It’s always worth comparing providers, and there are several other established players in the VOIP market to consider.",
    "RingCentral Office also offers HD voice call functions, with fairly similar customization, but charged on a monthly subscription basis. This gives a more reliable monthly cost but less flexibility, especially when the basic packages put limitations on the number of calls and users you can have. Like Avaya OneCloud, RingCentral Office has an all-in-one UCaaS to enable remote team communication. Support is easy to access.",
    "Mitel MiCloud Business is another VOIP service, targeted at SMBs. It’s also a monthly subscription option with team collaboration tools, and video and audio conferencing features. The number of users is somewhat limited: even the most expensive option only allows 24 people for video conferencing. You’ll also need the Premier package or above to access transcriptions and call recording. It’s got a user-friendly interface and contact center options.",
    "Avaya is a long-standing player in the VOIP space, for good reason. Avaya OneCloud offers a wide range of solutions to suit different business needs. The CPaaS package makes it easy to integrate voice calls and messaging into your applications and customer journey. With all the features you’ll need for customization and evaluation, you’ll only pay for what you use.",
    "And, if you need an all-in-one solution for communications, it’s easy to take your company digital with Avaya OneCloud’s UCaaS, available by subscription. Support may be tricky to access, locked away behind logins, but the sheer breadth of Avaya OneCloud’s solutions makes this a solid investment for a growing company that’s looking to digitize."
  ],
  "headers": {
    "23": "Final verdict"
  },
  "links": {
    "best VoIP phone system": "https://www.techradar.com/news/best-voip-service",
    "Avaya OneCloud": "https://www.avaya.com/en/onecloud/",
    "Communications Platform as a Service (CPaaS)": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Unified Communications service (UCaaS)": "https://www.techradar.com/best/best-ucaas",
    "Interactive Voice Response (IVR)": "https://www.techradar.com/best/best-interactive-voice-response-ivr-services",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "cloud-based phone system": "https://www.techradar.com/best/best-cloud-phone-systems",
    "AI workflow capability": "https://www.avaya.com/en/about-avaya/newsroom/pr-us-210429/",
    "Single Sign On": "https://www.techradar.com/best/best-identity-management-software",
    "RingCentral Office": "https://www.techradar.com/reviews/ringcentral-office",
    "Mitel MiCloud Business": "https://www.techradar.com/reviews/mitel-micloud-business"
  }
}