{
  "source": "https://www.techradar.com/reviews/lenovo-ideapad-duet-chromebook-review",
  "title": "Lenovo IdeaPad Duet Chromebook review",
  "category": "computing",
  "updated": "2021-12-02T14:35:00Z",
  "author": "john-loeffler",
  "summary": "The Lenovo IdeaPad Duet Chromebook is everything that netbooks should have been",
  "verdict": "The Lenovo IdeaPad Duet Chromebook strikes the perfect balance between tablet portability and Chromebook utility, all while keeping the price ridiculously low - and somehow packing in a Lich King of a battery that simply refuses to die",
  "pros": [
    "Lightweight and portable",
    "Long battery life",
    "Very affordable",
    "Huge library of available software"
  ],
  "cons": [
    "Tiny keyboard and finicky track pad",
    "Magnetic components can pop off with normal use",
    "Charger and headphones share a single port",
    "Limited memory and lightweight processors"
  ],
  "article": [
    "The Lenovo IdeaPad Duet Chromebook is easily one of the biggest surprises of 2020 by far, at least when it comes to the 2-in-1 laptop market. This tablet-laptop hybrid packs a lot into its tiny frame – functionality, portability and longevity – so while it’s not without its flaws, none of its shortcomings can take away from the value you’re getting.",
    "This is one of the best Chromebooks we've ever used. If you are a Chromebook skeptic, the Lenovo IdeaPad Duet Chromebook just might be the device that wins you over.",
    "The Lenovo IdeaPad Duet Chromebook is one of the 2-in-1 laptop hybrid to hit the market in 2020, but where others lack software support or sacrifice portability by loading up on more heavy-duty hardware, the Duet manages to strike the perfect balance between functionality, portability, longevity, and – perhaps most importantly – affordability.",
    "Taking the utility of Google's Chrome OS and packing it into a 10-inch keyboard-enabled tablet, the Duet is absolutely one of the best 2-in-1 laptops we've ever seen for its price. There's even a case to be made that it's one of the best Chromebooks of the year.",
    "While Chromebooks on average get about 10 hours of life on a fully-charged battery, the Lenovo Duet lasted nearly an entire day of looped HD video.",
    "And not the 9-to-5-workday-plus-a-commute that people usually mean when they say their battery lasts all day – we're talking about an actual, fully-rotate-the-entire-frickin-planet-on-its-axis kind of day.",
    "We tried to kill it, we really did. We were really, really exhausted by the end. So when the battery finally gave up the last of its charge 21 hours and 29 minutes after we began our test, it could very well have been out of pity.",
    "All that battery life gives you a greater opportunity to take advantage of the Lenovo Duet's full access to the entire Android app ecosystem on top of all the other Google apps built into Chrome OS.",
    "This would already put the Duet well ahead of the competition, but it still has more to offer on the software front. Chromebooks now come with a downloadable beta version of a Linux virtual machine, so you can use an actual terminal interface and all the Linux software accessible through it.",
    "Simply put, you just don't see this robust of an OS packed into a tablet. Not until now.",
    "Finally, it does all this for less than $300. As far as Chromebooks and 2-in-1 laptops go, this is the best value you're going to find in a portable device of its kind, hands down. It's the computer that last decade's netbooks promised to be - but couldn't quite become - while taking the Chromebook to its next logical step.",
    "Nothing is perfect, however, and the Lenovo Duet definitely comes up short in some important areas. The keyboard is the physical embodiment of a touchscreen's compact, virtual keyboard, so it definitely takes some practice to accurately use it.",
    "Unfortunately, this will be very difficult for nearly everyone accustomed to full-sized keyboards and, for some, it might be physically impossible to effectively use.",
    "The track pad is also lackluster, though functional. Its responsiveness is noticeably lower than that of a traditional laptop's touch pad, which are already tricky widgets to begin with, so the track pad's problems become all the more glaring.",
    "Our other major issue with the Lenovo Duet is the way its magnetic kickstand cover and keyboard attach to the tablet. The two rely solely on magnets to lock them in place, so they will sometimes pull apart from each other during normal use when you least expect it.",
    "Those issues aside, unlike the Microsoft Surface Go 2, Lenovo at least gives you a kickstand cover and keyboard instead of selling them as separate peripherals.",
    "The speakers are about what you'd expect from a tablet which means you'll likely need headphones to get satisfying audio.",
    "Since the Lenovo Duet has just the single USB-C port and nothing else, you'll need the included USB-C adapter to use standard headphones. This means you can't charge the device and use headphones at the same time, which might be a sore spot for a lot of people, but this is likely to be a rare conflict given the Lenovo Duet's battery life.",
    "Overall, none of these were deal breakers for us, but for some the keyboard and track pad issues are insurmountable hurdles. Since we can't recommend the Lenovo Duet to everyone, we have to knock a couple points off its final score. Otherwise, for a vast majority of people in the market for an ultra-portable 2-in-1 laptop, we really can't recommend the Lenovo Duet Chromebook enough.",
    "The Lenovo IdeaPad Duet Chromebook is available through major retailers starting at the ridiculously low price of $279.00 (about £225/AU$405). This entry-level model comes with only 64GB of storage capacity, so we highly recommend dropping the extra $20 (about £16/AU$28) to double that to 128GB of storage.",
    "As we mentioned up top, the kickstand panel and keyboard come bundled with the tablet, so you will only need to make a one-time purchase to get the full 2-in-1 laptop as intended.",
    "Shipping out a complete system shouldn't have to be a selling point for any device, but since you need to buy a keyboard and cover for the competing Surface Go 2 separately, Microsoft makes this a live issue.",
    "As such, we commend Lenovo for being sensible enough to do the bare minimum by packaging a 2-in-1 laptop with all the necessary components to actually make it a 2-in-1 laptop.",
    "The biggest shortcomings of the Lenovo IdeaPad Duet Chromebook come in its design.",
    "The magnetized kickstand cover and keyboard felt firmly-secured to the tablet as we tested it, but we still found ourselves pulling the keyboard free without meaning to or pushing the entire back cover off while trying to extend the kickstand.",
    "These aren't earth-shattering failures and fixing it is as simple as slapping the cover or keyboard back on, but it happened often enough that we can see some people getting frustrated with it.",
    "Unfortunately, the biggest problem with the Lenovo IdeaPad Duet Chromebook will be a dealbreaker for some people: the restrictive size of its keyboard and - to a lesser extent - the responsiveness of the track pad.",
    "By laptop track pads' already-low standards, the Lenovo IdeaPad Duet Chromebook's can be sluggish and even lifeless at times. As for the keyboard, the keys are packed in very tight, given the limited real estate it is working with.",
    "The keyboard and track pad also don't have the same degree of tactile feedback that a lot of other laptops have. That means that touch-sensing your way as you type can leave you all over the place for a while as you acclimate yourself to the key spacing.",
    "Meanwhile, tapping an unresponsive track pad will quickly become frustrating for some people since there's no feedback to tell if a \"click\" is even physically registering. The vast majority of the time, the track pad responds just fine, but when it doesn't, we have no real sense as to why.",
    "A much bigger issue is accessibility. For those with lower manual dexterity - such as those with a physical disability or even just older folks who're not as nimble as they used to be - these problems aren't just amplified; in some instances, it would be all but impossible to ever overcome them.",
    "It's the kind of design flaw that just can't be overlooked anymore. Accessibility has been a major blind spot in tech for a while now, but it's something that we know how to fix. The industry is even making significant strides to address this longstanding problem - just not with the Lenovo IdeaPad Duet Chromebook, which is a real shame.",
    "Aesthetically, the Duet has a certain minimalist charm to it with its near total absence of ports and buttons along the sides. The 10-inch FHD (1920 x 1200) IPS display is bright and vibrant, and the Chrome OS interface is simple to navigate.",
    "The roughly half-inch black bezels around the display are noticeable, but not egregiously so. Games and HD video run smoothly, and text is crisp and clear on the screen, making it less of a strain to read for extended periods.",
    "The physical volume rocker on the side is responsive, as is the power button next to it. There is a USB Type-C port, which is good to see, but otherwise, that's it as far as ports and physical controls go. This helps keep things simple beneath the surface, which is always good for performance.",
    "The forward-facing, two-megapixel camera sits on the longer edge of the tablet while the backward-facing, eight-megapixel camera is located at the top-left corner of the tablet. Both provide excellent image quality, and the forward-facing camera beats out just about every integrated laptop webcam you're going to find.",
    "The outward-facing side of the Duet's kickstand panel also has an attractive fabric cover that gives the device a much classier look than the typical silicone or faux-leather exteriors of other tablet cases or the hard plastic or metal finishes of a traditional laptop.",
    "On paper, the performance of the Lenovo Duet Chromebook lags behind its bigger and more expensive cousins, but nobody is out here trying to play Metro: Exodus on a 2-in-1 Chromebook.",
    "When it comes to general web browsing, video streaming, and basic productivity use, the Duet does exactly what you want it to do without so much as a hiccup. You can't load up on Chrome tabs with reckless abandon, but you can still have a handful going at once and not grind everything to a halt.",
    "The Lenovo IdeaPad Duet even manages to put out a very respectable performance when it comes to light-to-moderate mobile gaming. This isn't a gaming laptop by any means, but if you can play it on your phone or dedicated tablet, you can play it just as well on the Duet.",
    "We absolutely can't talk about performance without bring up the Lenovo IdeaPad Duet's battery life. Our TechRadar movie test looped an HD film at half brightness and half volume until the Duet died.",
    "Similar devices typically shut off after 8 to 12 hours, with around 10 hours being the average battery life of a typical Chromebook. The Duet blew way, way past that mark, completely lapping the Chromebook average with a total time of 21 hours and 29 minutes. This just isn't the kind of battery performance you ever see in the wild.",
    "Clearly, no two batteries are exactly the same and performance will degrade over time, so you shouldn't expect a nearly 22-hour battery life to be typical. Still, repeated testing and anecdotal evidence indicates that the Duet's longevity isn't a fluke. Even though it is officially rated by Lenovo for 10 hours of general use, in reality the Duet will run for significantly longer than that out of the box.",
    "This is likely due to the lightweight hardware in the Lenovo IdeaPad Duet, which doesn't draw a lot of power. The lighter-duty CPU and GPU don't use as much energy as an Intel or AMD processor, so the power the Duet stores in its battery stretches far longer than it would in other laptops.",
    "Where it saves on battery use, though, it loses in high-end performance. With only 4GB RAM, letting your Chrome tabs get out of hand can quickly slow the Lenovo IdeaPad Duet's performance, as will running a dozen apps in the background while playing a game or watching a movie.",
    "With the Lenovo IdeaPad Duet, you have to turn the metaphorical lights off when you leave the room to keep everything running smoothly.",
    "When it comes to lightweight 2-in-1 laptops, the available software options can be hit or miss, and even then your options are more limited than with a traditional Windows laptop or MacBook. Fortunately, Chromebooks have access to the entire Android app ecosystem - the largest digital marketplace in the world.",
    "Contrast this to the Surface Go 2, which has to go through the less-popular Microsoft Store (which has some pretty slim pickings), and the Duet comes out way ahead on the software front.",
    "In fact, there is so much available software that you will find yourself running out of storage pretty quickly if you're not mindful of the size of the apps you're downloading. We definitely recommend spending the extra cash to get the higher capacity unit with 128GB rather than the meager 64GB offered on the base model. You will use every bit of that space before long, which is a nice problem to have.",
    "We are particularly excited about Google's ongoing implementation of a Linux virtual machine in Chrome OS, the beta version of which is accessible on the Duet. Installing it is as easy as flipping a switch in the system settings.",
    "From start to finish, we got a fully-operational Linux command line terminal up and running on the Duet in about 5 minutes. That opens up even more software options by adding in a large chunk of the Linux software ecosystem into the mix, which for many is one of the strongest points in the Lenovo IdeaPad Duet's favor."
  ],
  "headers": {
    "2": "Two-minute review",
    "19": "Pricing and availability",
    "23": "Design",
    "37": "Performance",
    "46": "Software",
    "51": "Don't buy it if..."
  },
  "links": {
    "2-in-1 laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "best 2-in-1 laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Microsoft Surface Go 2": "https://www.techradar.com/reviews/microsoft-surface-go-2",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471"
  }
}