{
  "source": "https://www.techradar.com/reviews/moonfruit",
  "title": "Moonfruit website builder review",
  "category": "computing",
  "updated": "2021-05-17T02:36:49.983Z",
  "author": "mike-williams",
  "summary": "The veteran website builder has a new, responsive editor. But is it any good?",
  "verdict": "Moonfruit has been around for a long time, but its current products disappoint in almost every area. Our advice? Move on – there's nothing here that deserves your attention or cash.",
  "pros": [
    "YouTube video backgrounds",
    "Integrated animations"
  ],
  "cons": [
    "Basic features",
    "No blogging features",
    "No e-commerce"
  ],
  "article": [
    "Moonfruit is a popular website builder service, whose options are a little more basic than some of the competition, with the company offering only a small number of responsive templates. Still, these can be customised by tweaking individual details or dragging and dropping full content blocks. Your pages can include image galleries, forms, maps, social feeds, embedded videos and more.",
    "Moonfruit's Basic plan gets you a single site with 500MB of storage, unlimited pages, but no specific bandwidth limits. Even though it costs £6.38 ($9.59) a month, this still includes Moonfruit branding.",
    "Moonfruit's Professional plan loses the ads, thankfully. It supports up to five sites, a maximum of 10GB storage, and gives you a free domain voucher. As we write, the Professional plan looks to be good value at £5.39 ($6.99) a month, but this is a \"limited offer\". Normally it's a more average £10.79 ($13.99). It must be noted however that this “limited offer” has been available for nearly three years as far as we can tell.",
    "Back in January 2018, two further plans, Ecommerce Lite and Ecommerce Pro, were listed as \"coming soon\". Neither of these are present since at least January 2020.",
    "Moonfruit offers a free 14-day trial, and even if you sign up after that, the company says it will refund your money if you cancel within 14 days. This isn't automatic – you must ask the support team via live chat – and if you've registered a domain through the plan, that cost will be deducted. But overall, the Moonfruit policy is much like any other, and you should have no difficulty getting a refund, if you need one.",
    "Creating your Moonfruit account is easy, and works much like most other services: enter your email, a username and password, or sign up directly using your Facebook or Google accounts. Follow up by choosing your preferred Moonfruit subdomain (yourname.moonfruit.com) and once you’ve verified your email address, you're taken directly to the editor, which almost looks like a blank page.",
    "There’s a section for the Header, one for the Footer, and a middle section to design your page. But where are all the elements you need to start building? If you're hoping for an instant site you can modify and use right away, there's a good chance you'll be disappointed.",
    "There’s a sidebar to the left which reveals options to add more pages to your site, insert new sections to an existing page, and an upload feature to include files to your site.",
    "In the Settings section, you can add a favicon (the small icon that represents your site in a browser tab), and images that would appear on Facebook when your site is shared there. There are also built-in options to connect your site with Google Analytics and Google Search Console, potentially giving you much more information about your website and its visibility on Google.",
    "The closest to templates we could find were in the sidebar’s ‘Sections’. From there you’re offered a long list of thumbnails. Being tiny, they’re not that easy to see and don’t even zoom in when you click on one to offer you a better idea of what you’re choosing.",
    "There are eye-catching Hero sections (an important element to highlight a key feature of the site), page bodies in various styles, navigation tools, and layout sections which organise your content in various column formats.",
    "Drag one you like to the main section of your blank site. It’s then ready for you to customise.",
    "Some website builders impress you immediately with their flashy visuals and depth of features. Moonfruit, well – not so much. We’ve already explored the left sidebar, but now that you’ve added a template to your page, clicking on any element reveals a contextual menu on the right, as well as a few buttons at the top of your selected element.",
    "These buttons are there for quick edits and shortcuts: Copy, Duplicate, Delete, and a Help button which opens the support page for that object type. There are undo and redo buttons top right of the page, and you can save the project whenever you like.",
    "The contextual menu on the right changes its options depending on what’s selected. Click on a text box for instance and you get Text, Position, Background, Links, Outline, and Animation. Select an image instead, and those are replaced by Link, Settings, Position and Animation.",
    "Clicking on any of these menus reveals the parameters that can be changed. We particularly liked the Animation options as they give your page a bit of visual flair which can be fun.",
    "Prior to adding a template to your page, the left Sidebar’s Elements section was greyed out. But now, you can select it and see all options available to you.",
    "You’re able to drag new objects to your page via that menu: text, images, galleries, buttons, video (YouTube, Vimeo), music (Spotify, SoundCloud), Google services (Maps, Search, Calendar), social media elements (Facebook pages, comments and likes, Twitter feeds, Instagram, Pinterest and more), and a good range of form-related services that includes Wufoo, Google Forms and Moonfruit's own form objects.",
    "Some basic edits are still very straightforward. Not happy with that button caption? Double-click it, type a new one, press Enter. You can edit the contents of text boxes in much the same way, including changing text styles and colours, inserting lists and adding links.",
    "Moonfruit limits the customisations you can apply to many page objects. You can't manually resize, or drag-and-drop a button, for instance. The most you can do is set it to align to the left, right or centre of the page, and to size it automatically, or to set the width to a percentage of the page.",
    "But on the plus side, the editor does have many integrated ways to tweak each object. Even a simple button allows customising text style, size, colour, hover colour, button shape, border style, link type and destination (new or same window).",
    "Whatever changes you make can be previewed at any time in desktop, tablet or mobile views.",
    "Moonfruit's media handling abilities are much like the rest of the service – they cover the basics, but don't have quite the power or customisation options you're likely to want.",
    "Add a single image, for instance, and you can't precisely resize or position it. Image editing features are restricted to settings for brightness, contrast and saturation. Even those are only available in limited 25% increments from 0% to 200%,",
    "An Image Gallery control supports filmstrip, gallery and slideshow views. There are a few tweaks – enable or disable autoplay, set various arrow styles – but nothing to set your design world alight.",
    "Video support is limited to embedding single YouTube or Vimeo clips. There's no video wall or anything more complex, although we did find one interesting option in the menus: you can set the background of any element to a stock or YouTube video.",
    "Audio support is a little more capable, with the ability to embed Spotify playlists or SoundCloud content.",
    "Bonus options include the ability to embed Instagram and Pinterest content, as well as PhotoSnack slideshows, and an HTML Snippet option may allow you to use content from some other sites.",
    "While this will cover simple websites, other builders give you much more. Moonfruit does provide a decent file manager for managing your content. Upload website images and you can organise them into folders, view them as grids or lists, and sort your media by name, size, or age (the newest first, or oldest). Files can then be added directly to images boxes or galleries without having to re-upload them every time.",
    "Moonfruit doesn’t offer any type of blogging features. There is an Element designed to integrate a WordPress.com blog though. Essentially, you must create and manage your blog on WordPress.com (which you can do for free), and the Moonfruit widget simply displays the URL of that blog in a box on your site.",
    "This approach works in the most basic of ways, but it doesn't look great, and not being able to manage the blog and website together could make your life more complicated. Even something as basic as coordinating the images and colour schemes of both sites will take some time and thought.",
    "Moonfruit also has no e-commerce solution. Not even a PayPal button.",
    "Moonfruit provides a web knowledgebase where you can search for details on any part of the service. It's always accessible from a Help icon within the editor, or you can browse it at any time from help.moonfruit.com.",
    "We moved on to explore Moonfruit's knowledgebase, anyway. This has a reasonable number of articles, but they're generally short and lacking in detail.",
    "Confusingly, the knowledgebase covers the same topics for both Moonfruit's old editor and the new one, so most keywords will return a lot of articles that won't help you. Worse still, the site doesn't clearly explain which is which, beginning some titles with 'V6', others with 'Responsive Editor', and hoping users will guess correctly.",
    "('Responsive Editor' is the latest of the two, and yes, that would have been our first guess, too. But we shouldn't have to guess at all, and at the very least, all V6 articles should now have a top line explaining that they refer to the old editor, not the current one, making it clear to everyone what's going on.)",
    "It can be confusing since the older ‘V6’ editor had blogging features, and even years after upgrading to ‘responsive’, those instructions are still there even though blogging is no longer supported. Talk about confusing your customers.",
    "Moonfruit is a basic website builder which currently lags well behind the competition in terms of power, features, ease of use, support, visual appeal and just about everything else.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "5": "Getting started",
    "9": "Editor",
    "22": "Media",
    "29": "Blogging and e-commerce",
    "32": "Support",
    "37": "Final verdict"
  },
  "links": {
    "Moonfruit": "https://www.moonfruit.com/",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Basic plan": "https://www.moonfruit.com/pricing",
    "Professional plan": "https://www.moonfruit.com/pricing",
    "WordPress.com": "https://www.techradar.com/reviews/wordpresscom"
  }
}