{
  "source": "https://www.techradar.com/reviews/amazfit-gts-2-mini",
  "title": "Amazfit GTS 2 Mini review",
  "category": "fitness",
  "updated": "2021-03-11T14:17:04.887Z",
  "author": "michael-sawh",
  "summary": "The Amazfit GTS 2 gets smaller, but still offers great value for money",
  "verdict": "The Amazfit GTS 2 Mini sacrifices some more desirable smartwatch features and attractive design flourishes you will find on the GTS 2. The core experience though is still a familiar one and for the price, it’s a very pleasing one where few rivals can match it.",
  "pros": [
    "Safe, but nice design",
    "Bright, good quality screen",
    "Solid 24/7 fitness tracking",
    "Useful new pomodoro tracker"
  ],
  "cons": [
    "Slightly short on 7-day battery life",
    "Heart rate accuracy for high intensity workouts",
    "Misses out sleeker GTS 2 design",
    "Notification support still basic"
  ],
  "article": [
    "The Amazfit GTS 2 Mini is, as the name suggests, a smaller version of the GTS 2, the top square smartwatch in Amazfit’s fashion watch category.",
    "Huami has dropped the price of the square watch to $99.99 / £79 (about AU$130) making it a more affordable option that does make some sacrifices in the smartwatch and the designs department, though it still manages to retain a lot of the features there are to like with the Amazfit GTS 2.",
    "While there’s now a smaller 40mm case, it still uses the same titanium alloy and plastic case combo, though there’s a little more of the plastic on show. It’s moved to a smaller 1.55-inch AMOLED screen that has seen a resolution drop but still offers a bright, colorful place to glance at your fitness stats and features like weather updates.",
    "It matches the GTS 2 and GTS 2e for health and fitness features, including packing Huami’s latest BioTracker health sensor that works best for continuous heart rate monitoring as opposed to tracking your heart during high intensity exercise. That sensor also enables blood oxygen measurements, though it’s a feature not for medical use.",
    "It performs best for 24/7 fitness tracking and holds up well against the best Fitbit’s rich sleep monitoring features for accuracy. For sports tracking, built-in GPS performs well in general, though some additional metrics did seem a little off on the accuracy front. It is nice to see that it does work with third party apps like Strava if you want your data to live elsewhere.",
    "Smartwatch features take the biggest hit with the offline voice assistant, built-in music player and ability to take Bluetooth calls that were included on the GTS 2 all absent. Features like notification support albeit basic, works well enough and music controls can be used during workouts. There’s a nice collection of customizable watch faces here too and the new pomodoro tracker is a nice addition if you struggle to stay productive during the day.",
    "In terms of battery life, Huami says you should get a week’s worth of use with heavy usage, which worked out to about five days in our testing. If you’re willing to disable power-hungry features like continuous heart rate monitoring and advanced sleep monitoring, you’ll get closer to the claimed seven days and maybe push closer to the double digit days in typical use, but even then that it feels optimistic.",
    "For the money, the GTS 2 Mini does offer a lot of what you get in the more expensive GTS 2 and GTS 2e, which sits above it. It's not the best fitness tracker in the world, and you'll have to live without the extra smartwatch features and a design that doesn’t feel quite as stylish, but that core experience still feels familiar and that’s a good thing. Especially when you compare it to other watches that cost around the same price point.",
    "The Amazfit GTS 2 Mini is available to buy now in black, pink and green version for £79 / $99.99 (about AU$130). In the UK, the GTS 2 Mini is available to buy from Argos.",
    "With the GTS 2 Mini, you’re getting as the name suggests, a smaller sized watch than the standard GTS 2 and the newer GTS 2e. You’re still getting a square look and similar materials used in the watch case, though it has a profile that’s more in line with the first Amazfit GTS that launched in 2019.",
    "It’s dropped to a 40mm case that weighs lighter at 19g and slimmer at 8.95mm compared to the slightly thicker and heavier 42mm one on the other GTS 2 models. You’re getting a titanium alloy in the case and plastic around the back that lacks the curved edge finish on the GTS 2 and the 2e. There’s a solitary physical button in the place you’d usually find a watch crown that can twist but annoyingly doesn’t let you scroll through screens with it.",
    "That’s matched up with a familiar removable 20mm silicone strap and as a package it’s water resistant up to 50 metres, making it safe to take for a swim and into the shower. You’re getting a pick of Midnight Black, Flamingo Pink, Sage Green colours, which does mean a set of different colour options compared to the other GTS 2 models.",
    "It's more of a stocky, square look compared to the GTS 2 and the best way to describe it is that it’s a tidy, safe design. It misses out on that more attractive curved design you get on the pricier GTS 2 watches, but it looks nice enough and feels well made, especially for the price.",
    "There’s also a drop in screen size and resolution, with a 1.55-inch AMOLED touchscreen display at 354 x 306 pixels. You can also have that display in always-on mode, though at the detriment of battery life.",
    "That’s compared to the 1.65 inch, 348 x 442 resolution AMOLED packed onto the GTS 2 and 2e. It’s still on the whole a very good screen to look at and interact with, but there’s a little drop down in the vibrancy and colour richness. It’s clear on some of the icons that it lacks some of the added UI polish you do get on the other GTS 2 watches. For the money though and what else can be found at this price, it’s a very good screen to find on a smartwatch.",
    "While the GTS 2 Mini might not bring any big new ideas to the watch design table, it feels nicely made, is a good-looking square watch on the whole even if it does lack some of the more alluring qualities of its pricier counterparts.",
    "To its credit, Huami does its best to keep fitness and health tracking features consistent across its watches, and that doesn’t really change with the Mini.",
    "On the sensor front, you’re getting the key motion sensors to track movement like accelerometers and a gyroscope, Huami’s latest BioTracker 2 biological data sensor that serves up heart rate and blood oxygen measurement data and built-in GPS for outdoor exercise tracking.",
    "It will track steps and sleep, there’s the ability to keep tabs on your stress, you’ve got female cycle tracking, the PAI Health Assessment system to make sure you’re regularly getting that heart pumping and access to guided breathing exercises. Switch to sports tracking mode and there’s the promise of over 70 modes, though most of those outside of core sports modes will only track workout duration and real-time heart rate data.",
    "As a fitness tracker, it’s very similar to what we’ve found before with the other GTS 2 watches. From an accuracy point of, it was within 500 steps of the fitness tracking on a Garmin Fenix 6 Pro and the Fitbit Sense, which we’d say is a pretty good showing and felt reliable. Though the distance covered during those days seemed to be a little lower in comparison. Resting heart rate monitoring was in line with the Sense too and felt like data that largely could be relied on. You get some simple inactivity alerts when you’re not moving enough during the day, but it goes pretty basic on the motivational side of things as far as keeping you moving.",
    "When it’s time to go to bed, you can expect some pretty detailed information to wake up to. There’s sleep stages including REM sleep time, recommendations on helping you get a better night’s sleep, sleep scores and is currently beta testing breathing quality tracking. Against the Fitbit Sense, it generally seemed to capture the same sleep duration data and suggest a similar breakdown of sleep stages. It did tend to suggest quite nominal awake times, though on the whole, the sleep tracking experience felt very good and in tune with the time we went to bed.",
    "For tracking exercise, we largely put it to the outdoor running and home workout test and it fared pretty similarly to other GTS 2 watches. On runs it was about 0.5 miles out from a Garmin running watch, which is a good showing, though metrics like average pace had us clocked going much faster than we were. Diving into the heart rate data, and average heart rate was usually 6-7 bpm higher while maximum heart was at times almost 20bpm out from a Garmin HRM Pro chest strap.",
    "It’s a pretty good performer in general when you move the exercise indoors. For indoor rowing sessions, it was able to match up with the stroke rates on a Garmin and the Echelon smart rowing machine. While testing with the Fiit workout app it was far more in line with the HR data from the Apple Watch Series 6 and that chest strap as well.",
    "As a smartwatch, the GTS 2 Mini does miss out on some of the bigger new features included on the GTS 2 and 2e. There’s no music player, offline smart assistant, ability to make calls over Bluetooth or the LTE connectivity that looks to be on the way on the Amazfit GTR 2e, which Huami hasn’t officially unveiled yet.",
    "What you do get does still make for a competent smartwatch experience that should be fine for most. Your stream of notifications are accessed from a swipe on the main watch screen. You can’t respond to those notifications and some are so limited that they are more prompts than letting you read entire messages. Particularly for emails.",
    "Where Huami does a nice job is with watch faces. There’s over 50 to choose from with around 30 that offer corresponding options for then you’re using the always-on display mode. There’s a good mix of analogue and digital options here with many that are customizable, letting you add in extra data widgets.",
    "Hit the physical button on the watch and you’ll see that Huami has now nudged all of the smartwatch features into a second menu screen. Here you’ll find access to things like weather forecasts, music controls (that can be accessed during workouts), the camera remote and world clock modes. Many of these can live as dedicated widgets to swipe through from the main screen as well.",
    "One new notable addition is the productivity-focused Pomodoro clock, which is by no means a new concept, but proved to be a useful addition for us staying productive and hopefully will be added to other Amazfit watches too.",
    "While it’s a bit of a stripped back experience from what is on offer on the other GTS watches, the features that do make the cut do a good enough job. Notification support is a little basic, though music controls work well and weather updates and watch faces are nicely executed, so there’s plenty to still like here.",
    "With the GTS 2 Mini, you’ll unsurprisingly get a smaller capacity battery than the one packed into the GTS 2 and the GTS 2e. There’s a 220mAh one, which matches what was included in the original GTS.",
    "That promises to deliver 7 days in heavy usage, which is defined as using features like continuous heart rate monitoring, sleep breathing monitoring, stress monitoring and using GPS for three 30-minute workouts a week.",
    "Interestingly, Huami suggests those with dark skin would see battery life further reduced with heavy usage. We asked for some clarification on this and were told this is tied to the fact that this optical sensor has to work harder on dark skin to get readings for aspects like heart rate. It’s an issue that’s been prevalent in wearables for some time and tied to using green light based sensors. Though there’s no indication of how much worse that battery life will be.",
    "There’s also a 14 days typical usage claim if you disable sleep monitoring from the criteria for heavy usage. That jumps up to 21 days if you ditch the Bluetooth connection with your phone and turn off continuous heart rate monitoring and sleep monitoring.",
    "In our experience, the GTS 2 Mini maxed out to about five days. That was with the screen not set to always-on mode and with notifications, sleep monitoring and continuous heart rate monitoring enabled. Also, we used GPS 2-3 times for 30 minutes to an hour a day. There was generally a 20% daily drop off, while an hour of using the GPS would knock things by about 10-15%.",
    "It’s definitely a watch that’s capable of making it to seven days, if you’re happy to restrict what features you use. Sleep monitoring and all-day heart rate monitoring clearly have a big impact, so those are the kinds of things that would likely have to be sacrificed first. Keeping the display on 24/7 is something you’ll need to live without too, which was something we were able to do as the raise to wake gesture is pretty responsive.",
    "When it comes to charging, it uses the same charging cable as the other GTS 2 watches that magnetically connect to the back of the case. It could perhaps do with something that fits a little more securely, though we didn’t have any issues of it falling off and not properly charging. That charging time from 0-100% will take 2 hours, matching how long it takes to do the same on the GTS 2 and GTS 2e.",
    "First reviewed February 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and release date",
    "9": "Design and display",
    "16": "Fitness tracking features",
    "23": "Smartwatch features",
    "29": "Battery life",
    "36": "Don't buy it if"
  },
  "links": {
    "Amazfit GTS 2": "https://www.techradar.com/reviews/amazfit-gts-2",
    "best Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "GTS 2e": "https://www.techradar.com/reviews/amazfit-gts-2e",
    "best fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Garmin Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "Amazfit GTR 2e": "https://www.techradar.com/news/amazfits-new-gts-2e-and-gtr-2e-cheap-smartwatches-are-official-and-coming-soon"
  }
}