{
  "source": "https://www.techradar.com/reviews/micros-point-of-sale-pos-system-review",
  "title": "Micros point of sale (POS) system review",
  "category": "computing",
  "updated": "2021-10-25T08:10:05Z",
  "author": "amanda-akien",
  "summary": "We review the Oracle Micros POS system, or Micros Simphony POS, built for complete restaurant, bar or hotel management.",
  "verdict": "Micros POS solution is a staple in the restaurant industry thanks to durable equipment, fast service transactions, and user friendly inventory management. Smaller enterprises may feel this system is one to ‘grow into’.",
  "pros": [
    "Established POS software for the hospitality industry",
    "InMotion mobile analytics app for iOS and Android",
    "Hardware deals from $1",
    "FREE product tour available",
    "Heavily customizable"
  ],
  "cons": [
    "System dashboard can look outdated compared to others",
    "Customer Support can be slow",
    "One of the most expensive options on the market"
  ],
  "article": [
    "Get a quote for a POS system today.",
    "Micros POS system is perhaps one of the best point of sale (POS) systems for restaurants, hotel resorts, bars, cafés, and casinos. The Oracle point of sale software provides stable, reliable and secure payment management services. As well as transaction operations, we decided to review everything about Oracle's Micros Simphony POS system: including its many employee administration, ordering, inventory and reporting tools.",
    "A strong sign for the POS is that its client list include Starbucks, Dunkin' Brands, Outback Steakhouse, TGI Fridays, MAX Burgers and hotel chains like Scandic Hotels. Micros has been a staple of the restaurant POS system market for years. This all-in-one cloud point of sale platform helps restaurateurs to optimize their online and in-house operations in real time, from any device.",
    "Oracle has an established global presence, with the Micros Simphony POS platform already operational in 180 countries, processing 25,000 transactions every minute and 5.9 billion transactions annually.",
    "Oracle Micros has been named a leader in the IDC MarketScape Worldwide assessment for the third year running. As you would expect, Oracle brings POS technology and architecture expertise, bolstered by big investments in R&D.",
    "As most POS software is rarely ‘one size fits all’, and with many solutions available on the market, it can be difficult to choose the right one for your business. Our Micros POS review looks at its key features, to enable you to decide if it is the right product for your company.",
    "The costs for PCI DSS compliant Micros POS are quote-based, but the basic pricing associated with their Simphony POS products are listed online. With a choice of three plans, Micros POS is similar to other systems.",
    "Micros Simphony Essentials",
    "Starting at $55, Essentials is their entry level plan. It’s aimed at small hospitality businesses who need a reliable POS system. It includes:",
    "Micros Simphony Plus",
    "The Plus plan is $75, aimed at multi-location and franchise operations, and has additional flexibility, advanced analytics and marketing features.",
    "Micros Simphony Single Tenant",
    "For businesses that want to run their own technology and connect to Micros POS, the Single Tenant Plan is quoted on demand.",
    "Simphony POS enables your business to thrive with powerful restaurant point of sale system software, but how? Let's examine the standout features that will help you to keep running a successful hospitality outlet.",
    "Other Micros POS hardware",
    "Oracle also provide self-service kiosks, secure credit card processors and Kitchen Facing Displays.",
    "All hardware provides secure employee controls, and modern design which includes Oracle's POS extras like weight scales, barcode scanners and receipt printers. The website proudly promotes ‘Upgrade Your POS Hardware for $1’, which is an attractive offer for new customers.",
    "With plenty of rich restaurant POS features to help your business not only function efficiently, but maximize operations, Micros POS helps lead the way in hospitality tech. We've highlighted the most relevant features they offer above, but many others including Kitchen Display Systems, table management, and Waitlist and Reservations organisation tools are also available from Oracle.",
    "One of our favourite features, though not flashy, is the ability to customize the look and language of your POS system. Being a large and long established tech company, you have to appreciate that Oracle keep up with POS trends and offer SMB owners the ability to design a bespoke POS interface to match their branding. When your food business is just starting to make a name for itself, consistency and style is important.",
    "The Micros POS system was developed for ease of use. It’s simple to navigate, which is key in a busy hospitality environment. It’s not the most complex or aesthetically pleasing dashboard on the market, though.",
    "The interface is designed with your restaurant in mind and this helps to streamline controls like employee onboarding and staff training. Simphony puts engaging, real-time information at the fingertips of your customers and your staff. Ordering is intuitive. Updates to daily specials, menu details, and personalized promotions are delivered to each touchpoint automatically.",
    "Although there is a telephone number provided, support can be found through the portal ‘My Oracle Support.’ Users are required to register to enable them to search the knowledge base, and to find help resolving issues.",
    "Online criticism of Oracle suggests they need an open dialog with their customers to reduce complexity, something Oracle is looking to address through an online community forum.",
    "There is a 378-member ‘Oracle Micros Support Group’ on Facebook, but it appears that members with similar issues are helping each other, rather than Oracle’s own support staff!",
    "When it comes to point of sale solutions specifically for food outlets, also take a look at Toast. While other POS systems are split between industries, Toast has always been focused on addressing the specific challenges of hospitality providers. The cost comes in at $165 per month, with the pricing model per feature. There is also a free version, to enable a small company to get up and running with the system.",
    "Low cost hardware is a selling point of Micros POS. An industry-leading point-of-sale workstation is supplied for just $1 with every license. Toast’s hardware starts at $899.",
    "For this price, you'll receive one 10-inch terminal, a flip stand and a magnetic card reader. Like Lavu's restaurant POS system, both companies provide well-designed hardware, built to withstand the rigors of any restaurant environment.",
    "Once configured and implemented, the Micros POS software is easy to use. It's heavily customizable, enabling the system to adapt to changes within your business and products. Combined with their $1 hardware match, you can upgrade all your technology for an incredibly low cost.",
    "Micros POS particularly excels at data capture, storage, and reporting. The POS platform is also well-positioned to help grow hospitality businesses with modern restaurant brands who favour high-tech Kitchen Display Systems and menu management. Such brands have the potential to scale and be the next generation of restaurants, including those built around virtual kitchen and digital concepts.",
    "Despite the hardware offer, for the smaller business Micros POS can be expensive when starting out. Fortunately, if your food business has a sufficient retail footprint, Micros restaurant POS pricing can be negotiated to more competitive rates.",
    "The sheer size of Oracle as a company means that it is somewhat out of touch with SMBs, and sometimes slow to adapt to their requirements. All things considered, Micros POS is a secure, reliable POS system which is superbly put together, but it's best suited to larger hospitality companies and growing food vendors."
  ],
  "headers": {
    "6": "Micros POS: Plans and pricing",
    "13": "Micros POS: Features",
    "19": "Micros POS: Interface and ease of use",
    "21": "Micros POS: Support",
    "24": "Micros POS: the competition",
    "27": "Micros POS: Final verdict"
  },
  "links": {
    "Get a quote for a POS system today.": "https://www.techradar.com/news/get-a-quote-for-a-pos-system-today",
    "best point of sale (POS) systems": "https://www.techradar.com/news/the-best-pos-system",
    "": "https://www.techradar.com/news/the-best-pos-system",
    "choose the right one": "https://www.techradar.com/news/the-best-pos-system",
    "PCI DSS compliant": "https://www.techradar.com/news/what-is-pci-dss-compliance",
    "Simphony POS products": "https://www.oracle.com/industries/food-beverage/restaurant-pos-systems/simphony-pos/",
    "Toast": "https://www.techradar.com/news/touchbistro-inc-pos-system",
    "Lavu's restaurant POS system": "https://www.techradar.com/reviews/lavu-point-of-sale-pos-review"
  }
}