{
  "source": "https://www.techradar.com/reviews/3cx-review",
  "title": "3CX review",
  "category": "computing",
  "updated": "2021-08-24T11:52:46Z",
  "author": "john-faulds",
  "summary": "PBX software that stands out for its simplicity and flexibility",
  "verdict": "3CX combines impressive features with simplicity, flexibility, and attractive prices.",
  "pros": [
    "Free for small companies",
    "Simple to use"
  ],
  "cons": [
    "You have to pay for support",
    "Web conferencing functionality not as good as others"
  ],
  "article": [
    "3CX is a provider of private branch exchange (PBX), video conferencing, and live chat software. 3CX can be deployed on-premises on either Windows or Linux, or it can be hosted in your own cloud account or by 3CX. That sort of flexibility is great, but how does it compare to the best VoIP services on offer? That’s what we’ll find out in this 3CX review, as we take a closer look at its features, pricing, support, and ease of use.",
    "The great thing about 3CX’s pricing is that it’s completely free for the first year. The not-so-good is that its pricing page isn’t very well designed and it’s a bit confusing. This is because there are monthly per-user prices listed, but they’re only indicative, and they change if you enter a number in the No. of Users field (pictured below). The actual prices you pay are listed in the table below that.",
    "Pricing for 3CX is based on the plan you choose and the tier. Tiers are for the number of simultaneous calls (SC) and users. The first tier is for four SC and 1–16 users, while the top tier is for 1,024 SC and 3,072–4,096 users. 3CX advises that one simultaneous call between three to four extensions is enough.",
    "Then there are three plans: Standard, Pro, and Enterprise. The Standard plan is completely free for the first year, and is still free for the first two tiers of pricing after that. Prices range from $395/year for the third tier (16 SC and 48–64 users) up to $9,995/year for the top tier. Pricing on the Pro plan goes from $250 up to $32,992, and for Enterprise, from $303 to $39,990.",
    "With the standard plan, you get unlimited extensions, mobile apps, auto-provisioning, and 25 web conferencing participants. You can also choose your own SIP trunk. The Pro plan increases the number of web conferencing participants to 100 and adds Office 365 and CRM integration, call queues, reports, and recording, and a contact center. Finally, the Enterprise plan increases the number of web conferencing participants to 250 and adds controls over call recording, in-built fail-over, stand-by license, and a custom IP phone logo.",
    "Apart from the low prices, one of the key features of 3CX is that it’s an open platform, giving you a lot of freedom of choice. You can choose your own phone numbers, SIP trunk, cloud provider, and hardware, and whether you want to host it in the cloud or on-premises.",
    "Other companies also make software-only PBX products, but most will only run on Linux computers, whereas 3CX also supports Windows, including XP and Vista operating systems.",
    "To give your employees the ability to work from anywhere, apps for Android and iOS are included. You’ll also be able to conduct video conferencing and have the ability to call, conference, or chat from your computer desktop or web browser. Using a headset, 3CX can act as a replacement for your desk phone. And you can manage calls with the 3CX switchboard which can be used to drag and drop calls to transfer them to others and gives you a receptionist view of incoming calls.",
    "To get started with 3CX you sign up for an account, then choose how you want your instance hosted, along with a preferred subdomain. This is followed by a wait of about 15 minutes for the set-up to complete.",
    "You’ll then be able to log in to your dashboard, which displays information about system and PBX status and an event log as well as links to all the main sections of the account for setting up phones, extensions, groups, SIP trunks, and inbound and outbound rules.",
    "Before you’ll be able to start using your 3CX instance, you’ll need to choose a VoIP provider that supports 3CX and offers SIP trunks. Then, you can configure the SIP Trunk and run tests on the 3CX-hosted instance.",
    "To make and receive calls you’ll need IP-enabled handsets, but you can use any SIP-compatible phone or ordinary handsets that can use adaptors to work with VoIP. 3CX provides detailed configuration instructions for different handsets from a number of leading vendors. You can also use SIP softphones, and a free one is included with all 3CX plans.",
    "3CX offers a few self-help support methods including user guides and community forums.",
    "If you want direct technical support, you can contact a partner near your location, or you can purchase support directly from 3CX at $75 per ticket. To find a partner, you can enter your current location into a search field and the results will be displayed on a map with each partner’s address, email, and phone number listed.",
    "3CX has a number of security features built in to protect your PBX system from attack. All traffic to 3CX clients is encrypted via SBC, with voice traffic encrypted via SRTP. Secure certificates to encrypt data between web servers and browsers are generated automatically, and there is also automatic detection and blacklisting of SIP attack tools.",
    "If you’re looking for alternatives to 3CX that offer similar solutions, RingCentral Office and Aircall are worth considering.",
    "RingCentral Office is a combined message, video, and phone service. It comes in a choice of four plans, which start with the Essentials plan at $19.99/user/month for up to 20 users and go up to $49.99/user/month with unlimited users for the Ultimate plan. All plans except Ultimate are available for a 15-day free trial. Standard features include unlimited calls within the US, unlimited SMS, voicemail to text, team messaging, and document sharing.",
    "Aircall is a cloud-based phone system with a choice of just two plans: Essentials and Professional. Essentials is $30/user/month and Professional $50/user/month (plans are billed annually). Both come with a seven-day free trial and boast unlimited inbound, internal, and outbound domestic calls, software for desktop or mobile, and integrations with popular apps like Slack, Zendesk, and HubSpot.",
    "3CX has an impressive array of functionality and is very easy to set up and use, both the app itself and the web-based control panel. The pricing listed on the 3CX website is a bit confusing at first, but the prices themselves are quite attractive.",
    "Due to the complicated nature of SIP trunks, if you don’t have experience in that area, you’ll likely need support from a local integrator. If you need direct technical support, you’ll have to pay extra for each issue. But once you get the system set up and running, its simplicity, flexibility, and ease of use will be worth the initial effort."
  ],
  "headers": {
    "1": "3CX: Plans and pricing",
    "5": "3CX: Features",
    "8": "3CX: Interface and in use",
    "12": "3CX: Support",
    "14": "3CX: Security",
    "15": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "3CX": "https://www.3cx.com/",
    "best VoIP services": "https://www.techradar.com/news/best-voip-service"
  }
}