{
  "source": "https://www.techradar.com/reviews/privadovpn",
  "title": "PrivadoVPN review",
  "category": "computing",
  "updated": "2021-11-10T13:39:44Z",
  "author": "mike-williams",
  "summary": "This Swiss-based VPN has some strengths, for sure, but also weak points",
  "verdict": "PrivadoVPN delivers on the unblocking front, and we're always happy to see free VPN plans, but weak performance levels and multiple app annoyances let the service down. Take a look, but use the free plan first, and see how it works for you before signing up.",
  "pros": [
    "10GB a month free plan",
    "Unblocks US Netflix, BBC iPlayer, Disney Plus, Prime Video",
    "P2P support with a SOCKS5 proxy",
    "Effective kill switch"
  ],
  "cons": [
    "Very slow connect times on some platforms",
    "Below average speeds",
    "Apps need work"
  ],
  "article": [
    "Every VPN provider loves to boast about its brilliance, and Swiss-based PrivadoVPN is no exception. 'The Fastest And Most Private VPN Service On The Planet', yells the over-enthusiastic website. Look past the pushy marketing, though, and it does have some eye-catching and appealing features.",
    "The network is a decent size, for instance, with locations in 44 countries. There are apps for Windows, Mac, Android, iOS, Fire TV and Android TV, and a subscription covers up to 10 devices.",
    "Editor's update (10 November 2021): Since our original review, PrivadoVPN has added the WireGuard protocol to both its Windows and Android clients.",
    "Protocol-wise – there's OpenVPN and IKEv2, and WireGuard on Windows and Android – although PrivadoVPN more than covers the basics elsewhere. There's P2P support, for example, with a SOCKS5 proxy to maximize torrenting speeds, and a kill switch to protect you if the VPN drops.",
    "Privado's plans start with a likeable free option. This gives you a choice of 12 locations, a maximum of 10GB data per month, but covers only one device and drops SOCKS5 (although it still supports P2P).",
    "It's a decent free plan which outperforms many big names. Avira's Phantom VPN free plan limits you to 500MB a month, for instance (ouch). Avast One's free app has a generous 10GB a week data allowance, but it doesn't allow you to choose a location. But Privado can't beat ProtonVPN's free plan, which has no data limits at all.",
    "Paying $7.99 a month (card or PayPal accepted) for Privado's monthly subscription gets you unlimited data, the SOCKS5 proxy and support for up to 10 simultaneous connections. Most providers ask around $10-$13 for monthly-billed accounts, so this looks like a good deal.",
    "Buying an annual plan cuts the cost to an equivalent $4.99 a month. There are no longer-term plans. That's fair pricing, although you can save a significant amount of cash with some budget providers. Privado asks an upfront $59.88 to cover you for one year; give Ivacy $59 and it'll cover you for two. The company also offers a 30-day money-back guarantee.",
    "PrivadoVPN claims to offer two major layers of privacy. It's based in Switzerland, allowing you to benefit from 'the strongest consumer privacy laws in the world.' And even if PrivadoVPN is served with a court order asking for information, it's a zero-log service so there's nothing to hand over.",
    "Sounds good to us. Unfortunately, PrivadoVPN hasn't put itself through any security or logging reviews, so we're left to take this on trust.",
    "PrivadoVPN's privacy policy details some of the information the service collects. You must provide your email address to sign up, and its mobile apps grab your device identifier and use crash reporting libraries to receive reports if an app fails. The policy doesn't mention any data collection by desktop apps, but we later found these also contained crash reports.",
    "If you're more interested in the big picture, though, it's summed up in this one line: 'We are not able to connect activity originating from an IP address from our VPN servers to activity conducted by an individual user.'",
    "Meaning that, although there's some logging, PrivadoVPN doesn't keep enough information to identify who carried out any particular action.",
    "PrivadoVPN's Windows app made a bad first impression with its tiny 300 x 400-pixel interface. This makes for cramped operations and a lot of unnecessary scrolling (there are 44 locations, but you can only view six at one time).",
    "The developer managed to squeeze in the VPN basics, anyway. Click a button to connect or disconnect, choose your location from a list, view your current IP address and city at any time; you know the drill. It's not difficult to use, but it's also missing some of the usability features we see elsewhere.",
    "Double click a country in the list, for instance, and PrivadoVPN doesn't connect: it expands the country to display one or more city locations.",
    "So, you double click the city, right? Well, yes, but that just takes you back to the main screen with your city selected. You must then click Connect to finally get online.",
    "In other apps, you can at least speed up connections by choosing a server from your Favorites or Recent lists. But Privado doesn't have either, so forget that idea.",
    "During the review we noticed PrivadoVPN had a regular and annoying connection issue.",
    "Sometimes the app displayed a 'Connected' message, but failed to get an IP address. We'd see a 'cannot retrieve IP' message instead.",
    "When this happened, we weren't able to access any other internet resource. Presumably that's why the app couldn't get an IP, as well: our internet connection was dead. But it didn't realize, and we were left with the 'Connected' message.",
    "If we waited for a minute or two, though, the app appeared to notice something was wrong, disconnected, and tried to reconnect. Sometimes this worked, sometimes it didn't.",
    "We've no idea why this happened, but it cropped up multiple times, way more than the occasional connection issues you might see with any VPN. Maybe we were unlucky, and the network happened to have issues during the review. But maybe there is an underlying issue. Either way, if you're planning to try PrivadoVPN, we'd recommend you attempt to connect multiple times to all the locations you'll normally use, just to confirm everything works as you'd expect.",
    "Privado's Settings box gave much the same impression as the rest of the service. It's not bad, exactly, just a long way behind the big names.",
    "We're happy to see a kill switch, for instance, along with OpenVPN and IKEv2 support, and assorted troubleshooting logs and tools. But you don't get much beyond the bare essentials. There's no configurable DNS or other leak protection, no split tunneling, and no option to automatically connect when you access insecure Wi-Fi.",
    "We also noticed the Windows app collects and sends crash reports by default, something which isn't explained in the privacy policy. You can turn this off if you look in the Settings box and notice the option, but we'd guess plenty of people won't. We prefer an 'opt-in' policy, like ExpressVPN's, where the installer explicitly asks if you want to send app usage information.",
    "We checked PrivadoVPN's OpenVPN and IKEv2 connection setup, and everything looked good: AES-256-CBC encryption, DNS and IPv6 leak protection, plus your credentials aren't stored locally.",
    "Connections times were surprisingly slow at an average of 20 seconds for OpenVPN, 12 seconds for IKEv2. ExpressVPN managed 10 (OpenVPN) and 8 (IKEv2) seconds on the same system, and we've seen IKEv2 connections made in just 2 seconds.",
    "PrivadoVPN's Windows kill switch worked as advertised. Whatever we did to make the VPN drop, it blocked our internet connection and reconnected automatically. Our traffic was never exposed.",
    "The kill switch is one of the absolute variety, though, which can be inconvenient. Once you've turned it on, your internet is blocked, even after you manually close a connection or shut down the app.",
    "PrivadoVPN's Android app looks and feels much like the Windows app, with a couple of welcome improvements.",
    "The first is that the app uses your full device screen size, which means far less scrolling.",
    "The second is that country selection now works properly. Tap a country, it's selected, and you can tap Connect immediately, no need to choose the city first (unlike the Windows app).",
    "There's a small downside in that the app doesn't have a kill switch, but you can still set one up manually.",
    "The iOS app is a near clone of the Android build, but with one major plus: it connected in 2-3 seconds, much faster than the Windows or Android apps. It looks like PrivadoVPN could behave very differently between platforms, and maybe device types. Keep that in mind if you're thinking of signing up, and try the service on every one of your devices before you part with any cash.",
    "PrivadoVPN hadn't impressed us so far, but could our unblocking tests give the service its chance to shine?",
    "It got off to a good start with BBC iPlayer, as we managed to stream content using both PrivadoVPN's UK servers.",
    "And it only got better from there, with PrivadoVPN getting us access to US Netflix, Amazon Prime Video and Disney Plus with no issues at all.",
    "That's good news, and puts PrivadoVPN ahead of many big names. Even IPVanish, NordVPN and TunnelBear failed to unblock US Netflix in our latest reviews, for instance.",
    "If unblocking results are a priority, though, there are other providers you can consider. CyberGhost, ExpressVPN, Hide.me, Hola, Private Internet Access, ProtonVPN and Surfshark all unblocked every one of our test sites.",
    "We measure VPN performance with several benchmarking services – SpeedTest's website and command line app, SpeedOf.me, nPerf – from both a UK data center and a US residential location with a 1Gbps connection.",
    "Each benchmark is run five times with our normal connection (that's with the VPN off) to establish a baseline, then five times while connected to the VPN using WireGuard, and five more using OpenVPN (where available). All tests are repeated again later (that's a minimum of 120 speed checks), then we analyze the data to see what's going on.",
    "PrivadoVPN's results began with a relatively disappointing 160-180Mbps for OpenVPN connections. You'll have no problems browsing or streaming with that, but many providers deliver a lot more. ExpressVPN reached 310Mbps in recent UK testing, Hide.me managed 390Mbps, and ProtonVPN hit a supercharged 400-460Mbps.",
    "Switching to IKEv2 lifted UK speeds a little to 210-240Mbps. Again, that's not slow, but it can't begin to compete with the best of the competition. In recent reviews, ExpressVPN's Lightway hit 570-580Mbps, CyberGhost WireGuard connections reached 760-770Mbps, and NordVPN's NordLynx soared to 760-880Mbps.",
    "Testing issues in the US meant we were only able to benchmark PrivadoVPN's free plan, but that turned out to be a plus. Although OpenVPN speeds were lower at 120Mbps, IKEv2 managed a reasonable (for the protocol) 310Mbps. It still can't match the speed leaders, but at least PrivadoVPN appears to treat free users fairly, allowing them to access the same servers as everybody else.",
    "PrivadoVPN is a love-it or hate-it service which is really strong in some areas (unblocks everything, capable kill switch) but really poor in others (below par speeds, annoying app problems). Try it, but take the free plan for a spin before you spend any cash."
  ],
  "headers": {
    "4": "PrivadoVPN pricing",
    "8": "Privacy and logging",
    "13": "Apps",
    "18": "Connection issues",
    "23": "Settings",
    "30": "Mobile apps",
    "35": "Netflix and streaming",
    "40": "Performance",
    "45": "PrivadoVPN review: Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ProtonVPN's free plan": "https://www.techradar.com/reviews/protonvpn-free",
    "monthly subscription": "https://signup.privadovpn.com/",
    "annual plan": "https://signup.privadovpn.com/",
    "privacy policy": "https://privadovpn.com/privacy-policy",
    "ExpressVPN's": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN's": "https://www.techradar.com/reviews/nordvpn"
  }
}