{
  "source": "https://www.techradar.com/reviews/dxracer-master",
  "title": "DXRacer Master review",
  "category": "gaming",
  "updated": "2021-07-20T13:11:01Z",
  "author": "andrew-williams",
  "summary": "A gaming chair for grown-ups",
  "verdict": "The DXRacer Master is an excellent choice for all-day, everyday mixed use as a work and gaming chair. There's good support for your posterior and lower back, and comprehensive recline features for your chill-out time. However, if you don't intend to use your gaming chair as a work-from-home seat you might want something with a softer feel.",
  "pros": [
    "Good built-in lumbar support",
    "Excellent foam support",
    "Great back health and ergonomics"
  ],
  "cons": [
    "Trades luxurious feel for support",
    "Likely not suitable for short folk",
    "Fairly high cost"
  ],
  "article": [
    "The DXRacer Master is marketed as a gaming chair and is shaped like one. But it also has a lot in common with operator chairs. That’s the fancy name for expensive office chairs.",
    "While relatively costly it lets you get away from those low-class, strap-on neck and lumbar pillows that ship with just about every gaming chair. The DXRacer Master’s back has a built-in adjustable lumbar support system and a sliding headrest.",
    "All the usual higher-end gaming chair features are here too, including dual recline. The base and the back tilt independently, letting you sit in a more relaxed position without just slouching in the seat.",
    "The DXRacer Master is a good fit for long sessions sat in front of a monitor, whether that’s a full workday or just hours spent in front of a game gradually working on your short-sightedness.",
    "However, we do know the DXRacer Master does not have what some of you will want. Its base padding is quite firm. This is good for your health, just as a firmer mattress is usually considered superior to an ultra-squishy one.",
    "But lots of people love softer mattresses, just as many will prefer seat padding that seems to hug your butt like a supportive cloud. That is just not the DXRacer Master way.",
    "This style matches the sober appearance. And it means we actually prefer the DXRacer Master as a work chair than as one to relax in. You should consider buying one if you’re more concerned with getting a chair to help you avoid the hell of low back pain than sitting on a chair with overtly plush-feeling padding.",
    "The DXRacer Master costs $519 in the US. At the time of review, it is only available via the DXRacer Germany website for those in Europe and costs €469 (roughly £406). It is currently unavailable in Australia.",
    "DXRacer is trying to do something a little different here too, with the Master chair supporting a few different accessories. DXRacer calls it a modular system.",
    "Add-ons include a cup holder, a footrest and a chunky arm that will hold a laptop out in front of you. We haven't tried these. They haven't factored into the review score, but we are reasonably happy with their pricing. The footrest costs an additional $59, which is much less than you might expect to pay for something similar from office chair master Herman Miller. Would a Herman Miller be better made and more cleverly designed? Probably, yes.",
    "The DXRacer Master feels firm. It’s closer to the Steelcase Leap operator chair, which we use as a reference, than the lovely and squishy Andaseat Fnatic Edition we used in the weeks before starting this review.",
    "This is because the seat pad mainly consists of high-density cold-cured foam. There’s no obvious lower-density top layer or memory foam layer, which would make it seem as if you’re sinking into the seat.",
    "One of the main questions you need to ask yourself before buying a DXRacer Master is whether you want that cloud-like soft padding or not. The Master does not offer it.",
    "However, high-density foam is good news for both the seat’s longevity and for your legs over long periods. Softer foams and memory foams can end up causing pressure hotspots, although we have not noticed any of this in the softer Anda Seat Fnatic Edition, despite spending hours upon hours sat on the thing.",
    "The DXRacer Master does, however, have very good synthetic leather covering the foam. It’s microfiber leather.",
    "The term “microfiber” may make you think of a soft, suede-like effect, but this is actually the underlay on which the top polyurethane plastic layer sits. This makes this “fake” leather much stronger than the basic PU of cheap gaming chairs. And it would also make it feel more realistic, were the differences not somewhat hidden behind the layers of foam underneath. You can’t appreciate the “3D-ness” of the fake leather when on top of a soft backing.",
    "If you see gaming chairs marketed as having 3D, advanced, luxury, ultra-hardwearing synthetic leather, it’s likely similar to the stuff used here.",
    "DXRacer does use a very pleasant leather-emulating texture on top, though. It is a much finer pattern than that of some other gaming chairs, including the Andaseat Fnatic Edition. This fits in perfectly with the DXRacer Master’s lower-key appearance, in this category at least.",
    "The Master comes in black, brown and red. There are no cut-outs at the top, padding contours are restrained. We think a flat, non-stitched back like the Secretlab Titan’s would look classier. But if you removed the ‘wings’ from this chair, those stick-out parts based on a racing car seat, this could almost pass for a normal executive’s chair.",
    "If you’re wondering why the DXRacer Master is so expensive, at least some of the cost is down to its integrated lumbar and neck support.",
    "It is standard procedure in gaming chair land to make seats with questionable ergonomics, and then fix them with strap-on pillows at the lower back and neck. The DXRacer Master has an entirely sound, largely straight seat back with a lumbar support system hidden behind it.",
    "You can remove the seat padding to get a closer look. It uses a shaped plastic panel controlled by a knob on one side. Turn it for greater lumbar support and the top of this plastic part is pulled down, pending the center outwards more.",
    "This feels much better than the pillows used in most gaming chairs, or the original hard sponge lumbar support of a Harman Miller Aeron. That is, if you actually want a relatively firm lower-back support, and don’t demand the pampered experience DXRacer rejects elsewhere. Once again, this is a much less fluffy chair than some of its rivals.",
    "The lumbar support feel is slightly springy, initially leading us to wonder if the entire Master back was sprung. It’s not, there’s just a slab of foam in front of the lumbar system, but the plastic offers a good amount of useful and firm lower-back support.",
    "Up top, the DXRacer Master also has a neck support pillow. This is the one part of the chair that makes obvious use of memory foam, letting you sink into it a little when you sit back and relax to play.",
    "Again, we find this much better than a strap-on support pillow, some of which are barely adjustable. This one moves along a vertical ratchet mechanism, and there are 8-10 settings depending on if you count the top-most ones where the pillow is held in place a little less securely.",
    "I’m somewhere between 5ft 11 inches and six feet tall and tend to use one of the settings right in the middle. There’s lots of scope for people significantly taller and shorter.",
    "Most gaming chairs at this level have exactly the same suite of adjustments. The notable part missing from some lower-end chairs is two types of recline. You can tilt the back and the seat pan independently, and lock them independently too.",
    "This functionality is one of the top things you want in a chair that can go from a serious upright seat to a gaming one where you can lean back comfortably but still have it set in place, not trying to turn upright the whole time.",
    "There’s just one problem here. We think the DXRacer Master pneumatic base doesn’t quite go low enough for some. Set it back to the max seat pan recline and, even pushing 6ft, your feet might be partially hovering above the floor with the seat pan as low as it can go. It’s no issue at zero or moderate base tilt, for us, but may well be for the shorter folk out there.",
    "The piston itself is great, though, with a confident action. It’s a classic four hydraulics system, but you’ll find one of these in pretty much any higher-end gaming chair.",
    "The DXRacer Master’s “4D” armrests have the usual adjustments too. You can slide the ultra-dense PU-covered foam pads back and forwards, tilt them or move them further away or closer to you. Their up-down travel is good and — this one is less commonplace — two of the three buttons on the rests are metal instead of plastic.",
    "While we should already be more interested in the longevity of these controls, we won’t say no to the nice chunky “clonk” of the armrest raise release.",
    "The last DXRacer Master control is on the underside, a big knob that alters how much the chair wants to return to its upright position, when not locked in place. And the maximum seatback recline is 155 degrees, which in use feels close to laying back flat.",
    "The DXRacer Master is a mid-size all-purpose gaming chair with a maximum recommended user weight of 275lb, although the maximum recommended height is an accommodating six feet six inches. That’s mirrored by our experiences with the generous seat elevation and nicely customizable headrest.",
    "DXRacer makes a specialist chair range for larger folk, the Tank Series. This has a “heavy-duty” tilt mechanism and is rated for people up to 400lb.",
    "We’d recommend thinking twice if you’re near the upper end of the height limit. Go far beyond 6 feet and you may be left wishing for a little seat pan depth. And unlike some of the top-end office chairs, the seat pan position is not adjustable.",
    "Similarly, while we don’t think the ultra-large coasters or tough frame will struggle for those beyond the 275lb soft weight limit, the DXRacer Master does not have an ultra-wide seat either. We do like that the conservative contouring here makes it easier to sit with your legs crossed, though.",
    "Gaming chairs are not difficult to construct. It's an easier job than building a piece of IKEA furniture and the only real issue is that parts are quite heavy, as in any good office chair.",
    "However, DXRacer's instruction booklet is below average and misses out on a couple of steps. The instructions are also not specific to this particular model, which may result in some confusion.",
    "We don't think this is a reason not to buy the DXRacer Master, as we're weighing up 20 minutes of frustration against years of use. But you may want to check out YouTube for some help. The company has posted its own how-to video there, which is nicely done."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "10": "Design",
    "19": "Integrated lumbar and neck pillow support",
    "27": "Adjustability",
    "34": "Fit and size",
    "38": "Building the thing",
    "41": "Don’t buy it if..."
  },
  "links": {
    "gaming chair": "https://www.techradar.com/news/best-pc-gaming-chair-5-best-chairs-to-game-in-comfort",
    "DXRacer Germany website": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8695108952603653000&xs=1&url=https%3A%2F%2Fwww.dxracer-germany.de%2FProdukte%2Fdxracer-master%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdxracer-master",
    "Andaseat Fnatic Edition": "https://www.techradar.com/reviews/anda-seat-fnatic-edition"
  }
}