{
  "source": "https://www.techradar.com/reviews/sennheiser-rs-5200-wireless-tv-headphones",
  "title": "Sennheiser RS 5200 wireless TV headphones review",
  "category": "audio-visual",
  "updated": "2021-11-11T14:35:08Z",
  "author": "jamie-carter",
  "summary": "This stethoscope-style wireless headset with transmitter makes TV sound spectacular",
  "verdict": "It may look odd, but if you often have trouble hearing your TV, then this wireless headset with transmitter provides clear and immersive stereo sound.",
  "pros": [
    "Dialogue is emphasised",
    "Immersive movie soundtracks",
    "Long range",
    "Battery lasts 12 hours"
  ],
  "cons": [
    "Odd stethoscope-style design",
    "No Bluetooth",
    "Interferes with zips",
    "Very expensive"
  ],
  "article": [
    "Here are some wireless headphones, but not as we know them. Instead of Bluetooth, the RS 5200 relies only on radio frequency (RF) to connect to a rather unusual source of audio – your TV.",
    "It’s about time. Wireless TV headphones have always been a niche. That’s despite many millions of people struggling to hear their TV, who suffer hearing problems in one or both ears. Combine that with the reduction in speaker size and quality on many modern flatscreen TVs, and you have a perfect storm that the Sennheiser RS 5200 is here to address.",
    "So does it achieve it? Kind of. The RS 5200 is basically an audio sender – a long, slim base station attaches to either the optical or analogue audio outputs on a TV, and wireless transmits the sound to the earphones. Not any old earphones, mind. This contraption is Y-shaped, with a receiver and battery on its stem and two arms that each host a rather large, protruding ear tip. Yes, it looks like a doctor’s stethoscope, and it does take some time to get used to … but it works.",
    "You can blindly toggle between TV mode (which pushes dialogue), movies (which are surprisingly immersive) and music (which seems a little flat). It will last for about 12 hours before needing to be recharged, which takes three hours.",
    "Offering clear, concise stereo sound (albeit with some underwhelming background audio-dampening tech), the RS 5200 is a standout product. Just be careful you don’t sit on it …",
    "Launched in October 2021, the Sennheiser RS 5200 is designed specifically to enhance TV sound. Comprising a wireless headset and a bulky transmitter, the latter also doubles as a charger for the headphones. Also in the box you’ll find a plethora of ear tips in different sizes and in foam, silicon and memory foam.",
    "The RS 5200’s two devices have an odd look about them. A Y-shaped contraption that looks like a stethoscope, the RS 5200 headphones (102 x 265 x 23mm) consist of an 8cm long RF receiver with two arms protruding from its top. Each measures 20cm and features an earphone, although you get to choose the type of tip – foam, silicon or memory foam – that affixes onto the end. Which you opt for is an important decision, because unlike neckband or headband earphones, the RS 5200 are effectively upside down; they only stay in place if shoved in your ears. Luckily, the RS 5200 is very light, weighing just 64g.",
    "The TR 5000 base station/transmitter also has an unusual look. This tapered 231g device (50 x 42 x 270mm) is designed to go in front of, beside, or possibly behind a TV. It’s basically an RF sender with inputs for digital optical audio and 3.5mm analogue audio on one end, a few buttons at its centre, and a small charging cradle for the RF receiver on the lower end.",
    "Sennheiser says the headphones are designed to not interfere with glasses or hair. They’re certainly unusual, but not necessarily in a bad way. That said, we’re not sure anyone searching for an immersive pair of headphones specifically for watching TV and movies is going to give the RS 5200 a second glance. This is a functional product designed for one type of person – those who have trouble hearing their TV and/or have hearing problems in one or both ears … and who don’t mind wearing a stethoscope to solve the problem.",
    "In the box are three packs of ear tips as well as a 150cm optical audio cable and a 150cm 3.5mm mini-jack cable. If your TV has stereo audio outputs then you’ll be happy to learn that a 30cm adapter is also supplied.",
    "There are basically two types of TV headphones: those that communicate with a Bluetooth transmitter attached into a TV, and those that use an RF (radio frequency) base station that’s connected to a TV’s wired audio outputs. The RS 5200 is the latter, which increases the bandwidth, and therefore the sound quality; but reduces its versatility. After all, you can’t easily take the RS 5200 into your home office after you’re done watching TV – not without taking its base station with you.",
    "Either way, the RS 5200 is easy to set up. You just attach the requisite cable to your TV and plug the transmitter station into the mains – it immediately sends the signal via radio to the headphones in the 15-16,000Hz range. There’s no app, just buttons on the base station to set the volume for each ear, and another to toggle between presets for TV, movies and music. The latter is replicated on the receiver, which adds tactile volume buttons.",
    "The BAP 800 lithium polymer rechargeable battery inside the base station takes three hours to recharge the headphones from empty.",
    "The RS 5200’s sound is excellent, with a few caveats. There are three presets – one each for TV, movies and music – but since they can only be toggled through, it’s never completely obvious which one is ‘live’. If anything, the music preset is a little flat; but this isn’t the case with the other two.",
    "The TV mode audibly centers the dialogue, cutting out any extraneous stereo sound and effects, pushing speech to the fore. That’s the key job of the RS 5200 – and it works well; its Speech Clarity mode is integrated, not optional, which helps simplify the RS 5200. It helps to know that Sennheiser’s claim that the RS 5200 removes background noise refers to the sound in the TV mix, not ambient noise in the room.",
    "Or, at least, that’s what we presume, since it doesn’t do anything about the latter. As a bonus, the Movie mode is surprisingly immersive, with excellent stereo and even a hint of spatial audio.",
    "One thing we did notice is that the receiver is at chest height, which can interfere with zips and buttons on shirts and cardigans. It works best when left to rest on a t-shirt or jumper. It also helps if you lean back slightly, which is generally a natural position for watching TV.",
    "After a TV session is over, it’s important to put the RS 5200 back onto the receiver – not only to recharge it, but to stop anyone sitting on it."
  ],
  "headers": {
    "5": "Sennheiser RS 5200 price and release date",
    "6": "Design",
    "10": "Setup",
    "13": "Audio performance",
    "18": "Don't buy them if..."
  },
  "links": {
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "TV": "https://www.techradar.com/news/best-tv",
    "Wireless TV headphones": "https://www.techradar.com/best/headphones-for-tv-watching",
    "earphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "spatial audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services"
  }
}