{
  "source": "https://www.techradar.com/reviews/hp-e27d-g4-monitor",
  "title": "HP E27d G4 monitor review",
  "category": "computing",
  "updated": "2021-01-11T09:24:30Z",
  "author": "jeremy-laird",
  "summary": "An impressive but pricey 1440p USB-C monitor",
  "verdict": "HP’s latest 27 incher combines extensive USB-C hub functionality with a decent 1440p IPS panel, but at quite a price.",
  "pros": [
    "Slick design",
    "Comprehensive USB-C hub",
    "Strong productivity feature set"
  ],
  "cons": [
    "Limited color coverage",
    "Expensive for a QHD model"
  ],
  "article": [
    "A good productivity panel isn’t just about image precision. At least, that’s the sales pitch for the new HP E27d G4, a 27-inch IPS monitor packed full of useful features but a little short on high-end image fidelity.",
    "Productivity-relevant plus points include full USB-C docking functionality complete with support for 100 watt device charging, ethernet passthrough and display daisy chaining, plus an integrated webcam with Windows Hello IR-powered facial recognition. A high quality stand with great build quality doesn’t hurt, either.",
    "Less impressive given the relatively lofty price point us the QHD 2,560 by 1,440 pixel resolution and limited color coverage. The latter is probably only a major concern for content creation professionals. But given 4K IPS 27-inch monitors are available for significantly less money, those productivity features will have to really deliver to justify the cost of the HP E27d G4.",
    "At $479 in the US and £478 in the UK, the HP E27d G4 looks pricey for a mere QHD rather than full 4K 27-inch IPS monitor. Especially one with relatively modest color coverage. HP counters with extensive productivity features including USB-C docking and Windows Hello support. The catch is that the likes of the Lenovo Q27H-10 offers most if not quite all the same features for dramatically less cash.",
    "The new E27d G4 is straight out of HP latest’s design playbook, with crisp edges, slim bezels on three sides of the panel, minimalist detailing and a premium feel. That’s just as well given the upscaling pricing.",
    "Beyond the purely aesthetic, there’s a strong feature set that starts with the 27-inch IPS panel. It’s a QHD item with 2,560 by 1,440 pixels, otherwise known as 1440p, so there’s no 4K action available. However, that probably won’t compromise desktop real estate given the high pixel density of 4K in a 27-inch form factor will require most users to bump Windows scaling feature up a little to achieve reasonable ergonomics and legibility. What you do lose out on for sure is sharpness and detail compared to 4K.",
    "Another relative weakness involves overall image fidelity and color coverage. Like the similar but cheaper Lenovo Q27H-10, HP merely claims the E27d G4 is good for 99 percent of the modest sRGB gamut. Figures for more demanding and relevant gamuts, such as Adobe RGB and DCI-P3 are not quoted.",
    "Nor does HP apply any pretense regarding HDR capability. This is a conventional SDR panel with 300cd/m2 rated brightness and 1,000:1 contrast and 5ms response. All standard stuff for this kind of type of IPS monitor. In short, this monitor is not aimed at serious content creation workflows.",
    "Instead, it’s intended to have a broader productivity remit, for which the USB-C hub feature is critical. As with most USB-C hubs, it combines video connectivity with charging and peripheral attachments in a single cable. So you can hook up a laptop, drive the monitor, charge and attach devices like mice and external storage with a single cable.",
    "But the HP E27d G4 goes a little further than most by several measures. For starters, there’s charging support up to 100 watts, where many monitors top out at 65 watts. What’s more, the E27d G4 has a DisplayPort out socket to enable daisy chaining. Thanks to DisplayPort 1.4 alt mode support within its USB-C interface, you can attach anything up to a 4K 60Hz panel to the HP E27d G4, with both it and the additional display being driven off that single USB-C cable.",
    "The HP E27d G4 also has an integrated ethernet port, which again can be forwarded via the USB-C interface. So, that’s charging, peripherals, networking and a multi-monitor setup, all with one cable. Nice.",
    "Finally, the HP E27d G4 has both a pop-up webcam with IR facial recognition and WIndows Hello support and a fully adjustable stand with rotation into portrait mode that feels like a quality item. As standard, the HP E27d G4 supports audio passthrough but does not have speakers. A sound bar is available separately.",
    "By many metrics, HP makes modest claims for the HP E27d G4’s performance. There’s limited gamut support, no HDR support at all, for instance. However, what you get is a nicely calibrated if conventional IPS panel with natural, vibrant colors and no signs of compression in either white or black tones.",
    "In fact, if anything, it looks punchier than the modest 300cd/m2 rating. Viewing angles are predictably good, even if a little characteristic IPS glow is apparent from some perspectives, however pixel response is not a particular strong point. HP’s OSD menu offers fully four levels of pixel overdrive. The first three are hard to differentiate and deliver only adequate response. The fastest noticeably improves response but also introduces some pretty ugly overshoot and ghosting.",
    "Speaking of the OSD menu, it’s entirely bereft of presets for commonly used color spaces, like Adobe RGB or DCI-P3. Not even sRGB gets a look in. That just underlines what was already pretty obvious. This is not a display designed for professional content creation.",
    "As for the QHD rather than 4K native resolution, it inevitably makes for a loss of detail and sharpness compared to a 4K monitor of the same size. If you’re after a true high-DPI experience, this isn’t it. However, it wasn’t all that long ago that QHD was cutting edge on a 27-inch panel and it still provides decent screen real estate. Working on two documents or apps in parallel is very comfortable. Three-way action would require a larger panel.",
    "Overall, the HP E27d G4 is a very appealing package. From a productivity and usability perspective, it really scores thanks to the USB-C hub complete with 100W charging, display daisy chaining and networking support.",
    "It’s a nicely designed and built monitor and feels worth the asking price in that regard, too, and offers good SDR image quality even if color coverage is relatively limited. It is expensive, however, especially given you can have a very similar monitor from other big brands that matches the HP E27d G4 in nearly all regards. The Lenovo Q27H-10 can be had for $200 / £200 less and only lacks daisy chaining, ethernet passthrough and full stand adjustability.",
    "If those features are mission critical, the HP E27d G4 may be worth the premium. Otherwise either the HP E27d G4 needs a price adjustment or there’s better value to be had elsewhere."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design and features",
    "12": "Performance",
    "16": "Verdict"
  },
  "links": {
    "webcam": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "Lenovo Q27H-10": "https://www.techradar.com/reviews/lenovo-q27h-10",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "external storage": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives"
  }
}