{
  "source": "https://www.techradar.com/reviews/homebyme",
  "title": "HomeByMe review",
  "category": "computing",
  "updated": "2021-10-11T08:00:22Z",
  "author": "steve-paris",
  "summary": "Create your dream home virtually with this online service",
  "verdict": "A good and versatile service with a great free option, marred by an extremely slow render and watermarking of low res photorealistic images.",
  "pros": [
    "Vast number of choices",
    "Simple to use",
    "Huge customisation",
    "Can design an entire house for free"
  ],
  "cons": [
    "3D pan can make some objects temporarily disappear",
    "Switching between measuring systems is not simple",
    "Low res photorealistic images take ages to render and are watermarked"
  ],
  "article": [
    "HomeByMe is another web-based 3D home design tool. The photos on its front page sure make for an enticing service, so let’s take a look at it and see how good it really is.",
    "One good thing is the inclusion of a free option called the Starter Plan. With it, you can create up to three projects and can have HomeByMe render 3 HD photorealistic images (you can have as many lower quality ones as you like, although there’s a caveat - more on that later).",
    "Next up, we have One-Time Pack. As the name suggests, this is a one-off fee. $16.50 (£12.50) gets you 5 projects, 15 HD photorealistic, and one 360˚ image.",
    "Then there’s the Unlimited Plan. This is a subscription service worth $29.99 (£24.99) per month or $299.99 (£249.99) when paid yearly. For that you get unlimited projects and basic images, five 360˚ images, and professional usage rights.",
    "You have options to purchase additional images, and there is even a service that can decorate your home for you, or even draw your room or dwelling, starting at £65 and £14 respectively.",
    "Before you can start taking advantage of HomeByMe, you need to register and create an account. This can be done by piggybacking off of your Google or Facebook account. Alternatively, giving them your email address and a password will also do just as well.",
    "You’re offered a very quick and silent optional tutorial, which might confuse more than it elucidates, and then you’re ready to dive in. In order to speed things up, you can elect to work with the service’s ready-made room templates (‘Room by Room’), or build all walls manually (‘Draw Walls’).",
    "There aren’t that many templates to choose from, but they can help you get started, especially if you’re new to 3D home design. But whatever option you choose, you will end up in the same building environment. Everything is fully customisable. You can alter the distance between walls, add additional points on a wall to break it up and extend it, the freedom is there for you to turn these 2D lines into your ideal room, or even your entire house.",
    "The freedom offered you is to be expected for a 3D design program, and the level of choice is quite impressive. You are given 67 front doors to choose from, for instance, 10 different garage doors, 41 different types of simple windows, 37 different straight staircases, etc.",
    "Not only that, but you can fully customise each object once it’s added to your home to create exactly what you need.",
    "The same applies for any of the furnishing you’ll be including in your design. The list is vast, with thousands of items waiting for you to use. Not only are the objects broken down by category, you can also narrow down your search by brand. Take a peek at the ‘Brand Corner’ and you’ll find hundreds of companies, although many have only a single item in their inventory. Nevertheless, there are enough items there to make sure no two home will ever look the same.",
    "When it comes to painting your walls, forget generic shades: you have at your disposal well over a thousand colours from nine different brands, or over five hundred ‘generic’ ones as well.",
    "Once you find the object you need, it’s a simple matter of selecting it for it to appear in your project. Drag and drop it to the right location, rotate it, even change its elevation. It you need to alter the dimensions of any object, select it and click on ‘Edit’ to reveal a sidebar with a list of customisable fields.",
    "By default, you are working on a top-down 2D plan, but just click on 3D at the bottom of the page for your construct to appear in three-dimensions instantly. You’ll see a figure representing the centre of the rotation (which you trigger by clicking and dragging your mouse). Altering your design can be done either in 2D or 3D. You’ll find it’s much easier to work with elevation while in 3D.",
    "Click on the feet icon to see the room from that virtual person’s point of view. There’s a slider to alter their height, the keyboard’s arrow keys let you navigate through the building, while you can look around your location by clicking and dragging the mouse or trackpad.",
    "One thing we found a little annoying while working in 3D is that depending on where the person is placed, some objects will disappear unless you rotate back to a specific viewpoint. We don’t mind walls disappearing during this action, but furniture can be another matter. There’s not even a hint that a chair, table or even a bed are there in certain circumstances.",
    "Another source of frustration was the convoluted way of changing between feet and metres. It would’ve been convenient if this were an option available straight on the plan itself. Instead, you need to go to your profile information, edit said profile, and change the units there. If you have family members who are more comfortable with imperial measurements while others prefer the metric system, you can’t just flick from one to the other. It’s as if HomeByMe just expects you to stick to one and not change it, and maybe that works for most clients, but not for all.",
    "HomeByMe offers a very affordable service with a myriad of options. We particularly appreciated the fact that the free plan doesn’t appear to limit your design options, and lets you work on up to three different projects. The limit on the number of HD photorealistic images (1920x1080) is somewhat compensated by offering an unlimited number of lower quality ones (640x360 pixels). However, it takes hours to render a low quality images. It’s definitely not for the instant gratification crowd. Worse still, although the results are most impressive, the free account pastes a giant watermark all across the image, rendering the effect pointless. The HD images are rendered in minutes, and don’t have that watermark.",
    "This service has a lot to offer, and if you’re not too fussed about those images (which are a pretty big selling point when they’re trying to entice you to register), you can explore and create very complex designs with the greatest of ease."
  ],
  "headers": {
    "1": "Plans and pricing",
    "5": "Getting started",
    "8": "Customization",
    "12": "Adding to your design",
    "17": "Final verdict"
  },
  "links": {
    "HomeByMe": "https://home.by.me/en/",
    "Starter Plan": "https://home.by.me/en/offers",
    "One-Time Pack": "https://home.by.me/en/offers",
    "Unlimited Plan": "https://home.by.me/en/offers",
    "3D design": "https://www.techradar.com/best/best-3d-modelling-software"
  }
}