{
  "source": "https://www.techradar.com/reviews/oppo-band",
  "title": "Oppo Band review",
  "category": "fitness",
  "updated": "2021-05-11T11:37:57Z",
  "author": "becca-caddy",
  "summary": "This budget-friendly fitness tracker is a solid choice",
  "verdict": "This is the first fitness tracker from smartphone brand Oppo. It’s a budget-friendly wearable ideal for those who want a no-frills way to keep tabs on their fitness and collect health data, too – there’s SpO2 monitoring, breathing exercises and heart rate tracking on board. It can’t compete with the best of the best fitness wearables but that’s not the goal.",
  "pros": [
    "Cheap",
    "Simple design, good screen",
    "Tracks HR and SpO2"
  ],
  "cons": [
    "Frustrating controls",
    "Screen is small",
    "Looks a bit boring"
  ],
  "article": [
    "The Oppo Band is the first fitness tracker from Chinese smartphone manufacturer Oppo to launch in the UK (at the time of writing, details of its launch in other countries outside China are yet to be confirmed). Although it’s not the brand’s first wearable, Oppo already released a smartwatch called the Oppo Watch in 2020.",
    "The main selling point of the Oppo Band is it tracks a lot of health and fitness data in a slim and simple design for less than £40 (about $60 / AU$70). This doesn’t make it the cheapest fitness tracker you can buy, but it’s certainly a budget choice.",
    "Design-wise, the fitness tracker is super simple. It has a black band and a small body pops in and out of the band for charging. One of the best features is its bright, crisp OLED display, which is responsive and perfect for stats and workouts. Although it’s not the best choice if you like reading notifications from your wrist – they’re here and work well, but the size of the screen makes it tricky to see them.",
    "The Oppo Band offers up to 12 days of battery life. I found this was optimistic and got around ten days of use out of it instead. However, I did have all the health tracking features turned on, which Oppo warns could affect battery life, so it’s still a reliable option.",
    "The Oppo Band can track 12 different workouts, including running, indoor cycling and yoga, and does a good job. There are also many health features on board, including breathing exercises, stand-up alerts, heart rate monitoring, sleep tracking and an SpO2 sensor.",
    "Overall, it’s a solid option if you want a cheap and straightforward device that tracks your health and fitness. There are better alternatives if you have the cash to spare, want lots of smart features, crave something more stylish or if you’re very serious about training. For everyone else, this is a good fitness tracker that’s bound to have mass appeal.",
    "The Oppo Band was launched in the UK in early 2021, and costs £39.99 (about $60 / AU$70). At the time of writing we've yet to hear details of its launch elsewhere outside China. There are different colour options on the Oppo website, but for now the black version is the only one available.",
    "This makes the Oppo Band cheap compared to other fitness trackers. For example, the recently-released Fitbit Inspire 2 is $99.95 / £89.99 / AU$179.95 and Garmin’s Vivosmart 4 is $129.99 / £99.99 / AU$219.",
    "However, it’s similar in price to fitness trackers that look alike and pack a lot into a simple package. We’re thinking specifically of the Xiaomi Mi Smart Band 5 (£29.99 / $50 / $99.95AUD), the Honor Band 5 ($36.99 / £29.99 / AED 110 (roughly AU$55) and the Samsung Galaxy Fit 2 ($59 /£39 / AU$135).",
    "The Oppo Band doesn’t get any points for an exciting design. But then again, that’s what gives it a broad appeal. This fitness tracker will look at home in the gym, paired with formal workwear and everything in-between. The device consists of a small body measuring 40.4mm x 17.6mm x 11.95mm – that’s the bulk of the tracker – which you pop into a strap.",
    "It has a heart rate monitor on the rear and a 1.1 inch AMOLED screen on the front, which is crisp and bright. However, when you use it outside, you might find it’s a little too dark – we had trouble reading it in direct sunlight.",
    "There are five different watch faces to choose from by default, but there are plenty more you can download from within the app. Because the screen is narrow and vertical, it also means text gets chopped off at times. This is unlikely to be a problem for most people but isn’t ideal if you’re looking for a tracker that’ll allow you to read many notifications on the move. In which case, you should opt for a smartwatch or a device like the Fitbit Versa 3, which is technically a smartwatch but with a fitness tracker style.",
    "There are no buttons here. The design of the Oppo Band relies entirely on the touchscreen. This is (mostly) fine, the screen is responsive, and it’s easy to remember which swipe takes you to which menu after a few uses. However, it’s a little infuriating that ‘swipe left’ and ‘swipe right’ – two key actions that take you to essential menus when you use other trackers – change the Oppo Band’s watch face. Who wants to change their watch face more than visit a menu? This feels like wasted functionality.",
    "The strap is made from TPU (thermoplastic polyurethane), a kind of plastic, and has a slight matte finish. This means it doesn’t feel like those gummy bracelets you wore as a kid – plenty of other fitness trackers do. It sits flush against your wrist when you put it on, which means it doesn’t get caught on clothes or furniture.",
    "The Oppo Band is water-resistant to 5ATM, which means avoid wearing it for diving or watersports, but leave it on in the shower or when you go for a swim – there’s swim tracking functionality built-in.",
    "The fitness tracker’s band is comfortable, with a soft and flexible feel. The fastening style keeps it in place without pinching and keeps the strap neatly secure too. The only snag is I had some trouble wearing the band at night. To keep tabs on your resting heart rate and SpO2, the band needs to be worn throughout the night, and the optical sensors on the back flash green when they take readings. Even though I wore the band tightly against my wrist, there was significant light leakage, which made it difficult to sleep without keeping my arm tucked away under the covers.",
    "To charge the Oppo Band you need to pop the body of the tracker out of the strap. This is easy. Gold pins on the underside of the body then match up with a small charging cradle that charges up via USB. According to Oppo, the tracker can last 12 days. Because I used a lot of fitness tracking and health data monitoring throughout the review, it lasted 10, which is still a solid and reliable amount of time between charges compared to the competition.",
    "There are plenty of smartwatch features, like message notifications, stopwatch, alarms, music playback control and find my phone. These all worked well but were challenging to read and navigate at times due to the small, vertical screen.",
    "The Oppo Band can track 12 different workouts. These include obvious ones, like running and cycling, as well as indoor versions and activities, like cricket, badminton and yoga. The tracking feels responsive, accurate and consistent no matter whether I was putting the band through its paces with a sweaty HIIT workout or opting for a calm yoga flow.",
    "You get a lot of data from fitness tracking and, with some workouts, you can customise the data you see on screen. For example, you can see the time, calories, distance and average stride frequency just for walking. The heart rate tracking for workouts felt accurate and consistent when compared with a Fitbit Versa 2 – as do the continuous readings that are taken throughout the day.",
    "At times, pausing and stopping workouts felt fiddly. You have to swipe, long press and then hit stop. This is mostly fine because you don’t want to stop a workout accidentally, but it didn’t feel like the most intuitive set of steps – particularly after a taxing workout.",
    "GPS worked well most of the time. You need to make sure the band has recently synced to the app, and sometimes this took just 30 seconds to connect. Other times, GPS didn’t work at all. However, this did occur in spots that are occasionally patchy with other trackers too. As well as a three-axis acceleration sensor to track movement and an optical heart rate sensor for heart rate, there’s also an optical SpO2 sensor on board. Simply put, this measures the oxygen saturation of your blood and can be an indicator for sleep apnea.",
    "When I was able to sleep through the optical sensor’s light show, this did provide me with interesting insights and was consistent throughout the night. The general sleep tracking data was also accurate, identifying different sleep stages – like deep and light – thanks to the data collected by the heart rate sensor.",
    "There are also a bunch of other cool health features, like get-up reminders and breathing exercises.",
    "The Oppo Band works with the Oppo HeyTap health app. Connecting up to the app for the first time was seamless and straightforward, as was syncing the device with it throughout testing.",
    "Like the Oppo Band, the app is simple but does everything it needs to. It has a clean white and grey design with colourful accents. There are tiles on the dashboard with important data in them, including heart rate, sleep and workouts. Click through and you’ll find additional information within each of these sections, including details to help you make sense of your SpO2 readings and sleep, as well as graphs that present your heart rate readings throughout your workout.",
    "There’s a section of the app dedicated to the band itself, which provides details about remaining battery life, as well as health settings, notifications settings, watch face customization options and a few other preferences to make the fitness tracker feel more like your own.",
    "First reviewed May 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Oppo Band price and release date",
    "9": "Design",
    "15": "Everyday use",
    "18": "Fitness tracking",
    "24": "Companion app",
    "28": "Don't buy it if"
  },
  "links": {
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Oppo Watch": "https://www.techradar.com/reviews/oppo-watch-review",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Inspire 2": "https://www.techradar.com/reviews/fitbit-inspire-2",
    "Garmin’s Vivosmart 4": "https://www.techradar.com/reviews/garmin-vivosmart-4-review",
    "Xiaomi Mi Smart Band 5": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-5",
    "Honor Band 5": "https://www.techradar.com/reviews/honor-band-5-review",
    "Samsung Galaxy Fit 2": "https://www.techradar.com/reviews/samsung-galaxy-fit-2",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3"
  }
}