{
  "source": "https://www.techradar.com/reviews/fossil-gen-6-smartwatch-review",
  "title": "Fossil Gen 6 review",
  "category": "wearables",
  "updated": "2021-10-28T22:10:28Z",
  "author": "david-lumb",
  "summary": "A solid Wear OS watch, though not much is new",
  "verdict": "The Fossil Gen 6 is a powerful smartwatch that will run the new Wear OS 3 in 2022, so it’s already easier to recommend than older devices stuck using aged software. But until it has the new operating system update, the watch doesn’t have enough to distinguish it among the other top non-Apple smartwatches like the Samsung Galaxy Watch 4 and TicWatch Pro 3. The sleek design is in the Gen 6’s favor, and its 1.28-inch AMOLED display is one of the best, but its barely-one-day battery life keeps us from recommending the watch over other longer-lasting wearables, even if you can recharge it to full in just under an hour. For those who want a top watch that works with both iOS and Android, though, the Fossil Gen 6 is a decent choice that will get better once Wear OS 3 arrives...eventually.",
  "pros": [
    "Sleek design",
    "Fast speeds and smooth navigation",
    "Great display"
  ],
  "cons": [
    "Short battery life",
    "Wear OS 3 not coming until 2022",
    "Little changed from predecessor"
  ],
  "article": [
    "The Fossil watches have been solid Wear OS devices leaning on sleek design rather than pioneering new features. The new Fossil Gen 6 follows in this tradition, packing a few new perks that few others do: the Snapdragon 4100 Plus chipset and, eventually (in 2022), the new Wear OS 3, better known as the version that combines Google’s wearable operating system and Samsung’s Tizen OS.",
    "You could get Wear OS 3 now in the Samsung Galaxy Watch 4, but that wearable only works with Android phones, and some features won’t even function unless the device is linked to Samsung handsets. Thus, the Fossil Gen 6 is the main alternative for folks who own an iPhone or just like the sleek Fossil look.",
    "That look has been only minorly altered from the Fossil Gen 5, but if you felt the last smartwatch was a bit too sleek, the new Fossil Gen 6 has more pronounced pusher buttons that seem a bit easier to press, plus guards around the crown, and a ridge on the bezel. It’s still classy, though it doesn’t look too different.",
    "It’s the internal updates that really set the watch apart. In addition to the Snapdragon Wear 4100 Plus chipset, which pushes the smartwatch to what Fossil claims is 30% faster speeds than the Fossil Gen 5, the new Fossil Gen 6 has 1GB of RAM and 8GB of storage. You’ll notice these speeds when switching smoothly between apps. The 1.28-inch AMOLED display seems unchanged from its predecessor, but it’s still top quality.",
    "On the sensor side, the Fossil Gen 6 adds an SpO2 sensor to track blood oxygen levels, as well as an upgraded heart rate sensor for periodic tracking. Without much in the way of first-party software, though, you’ll probably rely on the Google Fit apps to track your fitness and health. Again, it would be nice to see more added to the Wear OS experience, but if you have been fine with its interface and Google’s suite of apps, you’ll be fine here.",
    "The battery is another mixed bag. You’ll be lucky to last more than a day with casual use, putting the watch at a disadvantage against the Samsung Galaxy Watch 4, which can get up to three days, and it even struggles against the 18 hours you’d get from an Apple Watch 7. There is a bright side: the Fossil Gen 6 comes with a new, faster charger that juices your watch from zero to full in under an hour, so you could conceivably top up during the day to mitigate the low battery life.",
    "Overall, the Fossil Gen 6 has several advances on its predecessor, but with a limited battery life, a price tag rivaling the top non-Apple smartwatches, and Wear OS 3 still many months from coming to the watch, we don’t think the Gen 6 will top the absolute best smartwatches on the market. But we do think there are situations where it could be the best option available to some consumers, and will serve them well.",
    "The Fossil Gen 6 was released on September 27, 2021, and it comes in one 42mm size with several color options for the case, including Black, a grayish Smoke, and Rose Gold.",
    "The standard version with basic watch bands including silicone and leather has a price tag of $299 / £279 (around AU$410), while buying a model with a stainless steel watch band is priced at $319 / £299 (around AU$439). Just a heads up that the Fossil Gen 6's watch bands are 22mm wide, meaning they won't be compatible with the 20mm watch bands used by other smartwatches like the Apple Watch 7 or Samsung Galaxy Watch 4.",
    "The Fossil Gen 6’s design doesn’t change much on its predecessors – it’s still a black-cased round smartwatch with varying watch bands (like the default black flexible plastic watch bands) and a crown on the right side flanked by pusher buttons on either side. The new wearable has gotten a few tweaks to set it apart from the Gen 5, so it’s not exactly the same, but you’d have to get close to tell the difference.",
    "The most obvious change is the small ridge on the edge of the bezel, which is certainly more visually interesting than the clean edges of the Fossil Gen 5 – and before you ask, no, it doesn’t rotate like the Samsung Galaxy Watch 4 Classic, so it’s more of an aesthetic touch you may or may not appreciate. Given how few smartwatches have physical dials, the lack of one on the Gen 6 isn’t exactly a flaw, but it’s a bit disappointing that the bezel design looks like it would rotate.",
    "The crown appears slightly flatter and wider, but there are now two guard lugs rising to flank it, which hopefully means the crown will catch less on pockets or sleeves. You can still click into the crown to get to your app list. Twisting the crown gives just enough resistance that it won’t rotate accidentally, and browsing through apps and menus is actually pretty pleasant.",
    "The pusher buttons on either side of the crown have wider ends, which means more surface area and, presumably, an easier time pushing than the same buttons on the Gen 5. It all gives the watch a bit more of an industrial look, which we like, though we didn’t find ourselves using the pusher buttons much at all (they serve as customizable shortcuts for apps).",
    "Otherwise, the watch design follows its predecessors, with big lugs reaching from either side of the case to secure the watch bands, as well as a set of sensors on the bottom of the body, which are flush with the skin. The watch is undeniably sleek, and while it feels heavier than other smartwatches that are either lighter (like the Samsung Galaxy Watch Active 2) or balance their weight better (like the Apple Watch 7), it doesn’t awkwardly weigh down the wrist. You’ll be able to work out with it – but if you’re wearing it on your left hand, rotating your hand during exercise may lead to inadvertently long-pressing the crown and summoning Google Assistant.",
    "The Fossil Gen 6’s display seems to be the same 1.28-inch AMOLED screen as that on its predecessor, and it’s still darn good. The 416 x 416 resolution with 328 pixels per inch density rates among the screens on the best smartwatches, showing a clear picture and graphics.",
    "Our only big gripe is that the screen doesn’t extend to the edge of the bezel – there’s a several-millimeter gap between where watch faces end and the metal begins, but that rim is such a deep black that it’s not a distracting flaw.",
    "The Fossil Gen 6 isn’t a fitness smartwatch, but you can certainly take it on runs and workouts. The first-party health software is pretty limited – the Cardiogram app periodically measures and charts heart rate, and there’s a blood oxygen-tracking tile if you swipe left on the home screen, as well as a workout tile that simply asks if you’re indoors or outdoors without specific exercise tracking.",
    "Thus, most users will probably opt for the installed-by-default Google Fit suite of apps to track exercise and other health metrics. That includes Fit Workout, which has multiple exercise types to track, as well as other apps for monitoring heart rate, sleep, fitness goals, and meditative breathing.",
    "Taking the Gen 6 out for workouts is just fine – its design and buttons aren’t too cumbersome and nor is the smartwatch weighty enough to get in the way while exercising, though you’ll feel it while swinging your arms on intense runs. A more svelte fitness-minded smartwatch like the older Samsung Galaxy Watch Active 2 or a newer Fitbit Versa 3 might be easier on the wrist during lengthy workouts, but for strength training or other low-movement exercises, the Fossil Gen 6 is fine with workouts.",
    "The Fossil Gen 6 packs some of the best specs we’ve seen in a non-Apple smartwatch. The Snapdragon Wear 4100 Plus chipset is the star of the show, and with 1GB of RAM, as well as 8GB of storage for onboard apps and data, the smartwatch has hardware rivaling that on the best smartwatches.",
    "With such specs, the Fossil Gen 6 is very speedy, switching from app to app and screen to screen swiftly and without lag. Transitions are smooth, and there isn’t any input delay. It will eventually run the new Wear OS 3 after an upgrade sometime in 2022, but until then, we have the tried-and-true (and barely-changed in years) Wear OS 2 to use.",
    "The battery life is a big weakness in the smartwatch, at least if you compare it to other Wear OS watches – it lasts about as long as an Apple Watch 5, meaning you’ll need to recharge it before the end of the day. That’s if you keep all the fancier features switched on; if you turn off the Always-On Display, extend the periodic heart rate check to the maximum interval (every 15 minutes), and switch to a simpler Fossil watch face (no Facer ones, specifically), you’ll be able to eke out just over a day of use, which is enough to fit in sleep tracking.",
    "The flip side to that is much faster charging: the Fossil Gen 6 improves on its predecessor with the in-box recharger that juices up the smartwatch from zero to full within an hour (Fossil claims it goes from 0% to 80% in 30 minutes). One pro-tip: the charger’s nubs connect with capacitive half-circles on the back of the Fossil Gen 6, which have a slight gap between them – and if you rotate the nubs over the gap, the watch stops charging. Just magnetically snap the charger on to the back of the smartwatch and don’t spin it around."
  ],
  "headers": {
    "7": "Fossil Gen 6 price and release date",
    "9": "Design and display",
    "16": "Fitness and health",
    "19": "Performance and battery",
    "23": "Don’t buy it if…"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
    "Apple Watch 7": "https://www.techradar.com/reviews/apple-watch-7",
    "Samsung Galaxy Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "best smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review"
  }
}