{
  "source": "https://www.techradar.com/reviews/blackview-bv9800-pro-rugged-smartphone",
  "title": "Blackview BV9800 Pro rugged smartphone review",
  "category": "phones",
  "updated": "2021-08-24T15:59:54Z",
  "author": "desire-athow",
  "summary": "Another phone with the awesome “Predator” heat-viewing mode",
  "verdict": "The Blackview BV9800 Pro marks a watershed moment when thermal imaging has reached mainstream. Predator vision is now available without the premium. For that alone, the BV9800 Pro gets our coveted Best-in-class award badge.",
  "pros": [
    "3.5mm headphone socket",
    "Wireless charging",
    "Push to talk functionality",
    "FLIR doubles as night camera",
    "IR blaster",
    "48-megapixel Sony camera",
    "Free translation app",
    "Big battery"
  ],
  "cons": [
    "No upgrades to Android 11"
  ],
  "article": [
    "Blackview, one of the most prominent rugged smartphone vendors, has been busy lately. They have announced that they will launch a 5G rugged device in 2020, probably at Barcelona for MWC and it will likely be called the BV10000.",
    "They launched the BV9700 Pro, a flagship handset, just a few months ago and now pulled a surprise out of the bag in the shape of the BV9800 Pro. It is a smartphone with a twist; it is the first mobile outside of the CAT smartphone family that comes with a thermal camera.",
    "There is not much to be said about the BV9800 Pro when it comes to its design. It is a variation on a theme that we’ve seen countless times before. A rugged smartphone with a metal frame, round reinforced edges and plenty of textured rubber/plastic to protect from shocks and improve grip. It adheres to IP68/IP69K and MIL-STD-810G certifications; Blackview hasn’t said whether they’ve been tested to these ratings.",
    "There’s some significant heft partly due to the added electronics for the thermal imaging feature and partly because of the extra big battery. The BV9800 Pro weighs 322g and is up to 15mm thick. With a footprint of 169 x 81mm, putting it into your back pocket could be a tight fit.",
    "There’s a 16-megapixel front facing camera shaped as a raindrop and a 48-megapixel one at the back which is teamed up with the FLIR Lepton sensor and a 5-megapixel sensor to assist the former. Worth noting that unlike the CAT S61, Blackview managed to integrate the thermal imaging optics in the body of the device. In comparison, the S61 has an unsightly bulge on top.",
    "A Type-C connector can be found at the bottom of smartphone with a fingerprint sensor, the SIM tray and the power button located on the right edge. On the opposite edge is a dedicated customisable button and the volume rocker.",
    "The IR sensor and the headphone socket - protected by a flap - are located at the top of the BV9800 phone.",
    "Make no mistake, adding thermal imaging capabilities to the BV9800 Pro has likely pushed the bill of material, the cost price of the components, up by a bit. So it is no surprise that Blackview has had to cut back on some hardware; the processor used is the Helio P70, rather than the P90 found in top end devices.",
    "Glued to it are 6GB of memory (low power DDR4) and 128GB onboard storage. Flagship models usually carry up to 8GB of RAM and 256GB memory. Elsewhere, you get a 6.3-inch 1080 x 2340 pixels IPS display with an oleophobic layer with a 6.58Ah battery, 802.11ac, Infrared, Push to Talk,, NFC and Bluetooth 4.1.In use and performance",
    "The BV9800 Pro runs on a stock version of Android and does wireless charging as well. You will have to fork out for an extra wireless charger though as the device only comes with a fast charger.",
    "Other than the usual Google and system apps, there’s hardly any bloatware. The ubiquitous toolbox (that can be found on almost all rugged smartphones) includes a night camera thanks to the thermal sensing capabilities of the FLIR Lepton, one of a dozen or so “tools”. Also worth mentioning is a free translation app that offers a large array of languages and the ability to do real-time translation.",
    "The only other FLIR capable smartphone on the market is the Cat S61 which retails for more than £720 (about $950), twice the price of the BV9800 Pro. It has an older but still capable Qualcomm Snapdragon 660 with half the storage. It does however have an indoor air quality monitor as well as a laser-assisted distance measuring tool. Oh and it was the first rugged smartphone we reviewed that earned a well-deserved 5/5 stars.",
    "All the other highly rated rugged smartphones that we reviewed like the AGM X3 or the Doogee S95 Pro do not have FLIR capabilities. You could add thermal imaging capabilities via a FLIR adapter but (a) it is expensive (b) it will break if it falls down.",
    "Note that there is a BV9800 that costs $400 and swaps the FLIR camera for a 16-megapixel ultra-wide angle camera at the back.",
    "There’s no two ways to put it; the BV9800 Pro remains the best way to get a FLIR/thermal imaging device; it is cheaper than buying the separate FLIR accessory that plugs into a smartphone although you will be able to pick up the older Cat S60 for as little as $353.",
    "As a smartphone, it is a very decent mainstream midranger with a few highlights like the 48-megapixel Sony camera, IR Blaster, a massive battery push-to-talk and wireless charging.",
    "Any improvements? Well, we’d love to see FLIR being an integral part of flagship models in the future. We would also like to see more advanced features like VOC and laser measurements - both features of the CAT S61 - integrated alongside thermal imaging.",
    "Put it simply, we wish that the BV10000 will be the near perfect all-in-one smartphone for handymen, DIYers and field workers operating in challenging environments.",
    "All in all, the BV9800 Pro is a fantastic smartphone that shows how far Chinese rugged device manufacturers have achieved over the past four years, so much so that this smartphone is a worthy recipient of our best-in-class award."
  ],
  "headers": {
    "2": "Design",
    "7": "Hardware",
    "11": "Competitors",
    "14": "Final verdict"
  },
  "links": {
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "BV9700 Pro": "https://www.techradar.com/reviews/blackview-bv9700-pro-rugged-smartphone",
    "BV9800 Pro": "http://bit.ly/35imbIk",
    "CAT smartphone": "https://www.techradar.com/reviews/cat-s61",
    "Cat S61": "https://www.techradar.com/reviews/cat-s61",
    "AGM X3": "https://www.techradar.com/reviews/agm-x3-rugged-smartphone",
    "Doogee S95 Pro": "https://www.techradar.com/reviews/doogee-s95-pro-rugged-smartphone",
    "BV9800": "https://store.blackview.hk/en/buy/bv9800",
    "Cat S60": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-9631664362464975000&murl=https%3A%2F%2Fwww.newegg.com%2Fp%2FN82E16875610008"
  }
}