{
  "source": "https://www.techradar.com/reviews/motorola-edge-20-pro-review",
  "title": "Motorola Edge 20 Pro review",
  "category": "phones",
  "updated": "2021-09-03T10:44:35Z",
  "author": "tom-bedford",
  "summary": "A phone that lacks a competitive edge",
  "verdict": "The Motorola Edge 20 Pro has a worthy processor, good cameras and a fairly long-lasting battery, which on paper combine to make it a capable device. However, it’s bulky and doesn’t sit comfortably in the hand, and it doesn’t have anything truly unique to offer, making it hard to recommend amid the multitude of similar devices in the competitive mid-range market.",
  "pros": [
    "Well-rounded cameras",
    "High screen refresh rate",
    "Battery easily lasts a day"
  ],
  "cons": [
    "Too big to hold comfortably",
    "Side buttons hard to reach for many",
    "Better-value competitors"
  ],
  "article": [
    "The Motorola Edge 20 Pro is the top-end model in Moto’s 2021 line of flagship phones, which are the successors 2020’s Edge and Edge Plus. Don’t worry, you didn’t miss 18 generations of phone in between – the company has jumped straight up from the original series to 20.",
    "Positioned as the top-end sibling to the Motorola Edge 20 and Edge 20 Lite, the Pro offers a few features that the cheaper versions don’t, including a periscope camera for greater camera zoom range, a bigger battery and an improved chipset.",
    "Off the bat, we need to point out one thing: regardless of the specs and its relatively affordable price, this isn’t as interesting a phone as those in the original Edge series. It lacks their distinctive super-curved-edge screen, and therefore the extra features that brought, and it doesn’t feel as premium to hold.",
    "Looking beyond comparisons to the 2020 Edge series, is the Edge 20 Pro a good phone and worthy of your money? Well, that’s a question that’s hard to answer – it’s a decent phone, but also one with a lot of issues, and we didn’t find ourselves won over by the device by the end of our testing period.",
    "Our main issue is in the ‘hand-feel’ department – what the device actually feels like to hold and use. It’s a massive device, with quite angular sides, and buttons on the side that are hard to reach unless you’re willing to employ both hands. Compared to the super-curvy original Edge, the 20 Pro feels uncomfortable and awkward.",
    "While that’s our chief complaint, others may take issue with the features that are missing, but which are present in other similarly-priced phones. There’s no wireless charging, no 3.5mm headphone jack, and no fast-charging (the 30W option is slow compared to some competitors).",
    "There are things to like about the phone. Its cameras perform well for a Moto device, the high screen refresh rate makes motion look smooth (and beats many competitors) and we found that the battery comfortably saw the device through a day of use.",
    "The chipset, a Snapdragon 870, is another welcome inclusion. In terms of raw performance it’s only slightly less capable than the top-end Snapdragon 888, but it allows the device to be cheaper, and it also doesn’t suffer from the overheating issues that have plagued the 888.",
    "So if you want a capable device that misses out on some premium features, you could do a lot worse… but you could also do better. At this price point handsets like the OnePlus 9 beat the Moto in many areas, and you can get better phones for cheaper. Even the standard Motorola Edge 20 is arguably a better-value proposition, as it’s a more affordable device that doesn’t miss too many of the Pro’s features.",
    "So the Motorola Edge 20 Pro is a phone that’s worth considering, and you might find it to your taste, but it’s by no means the most competitive handset on the market.",
    "The Motorola Edge 20 Pro costs £649 (about $900, AU$1,230) which makes it a fair amount more affordable than the $999 / £1,050 (roughly $1,550) Edge Plus from 2020. Motorola has explained that the jump from ‘Plus’ to ‘Pro’ was intended to reflect this price shift.",
    "For comparisons to the other members of the Edge and Edge 20 line, you can see a table below which compares them all:",
    "At its launch price, the Edge 20 Pro is competing most directly with the OnePlus 9, another phone with a price tag that sits on the border between the mid-range and premium categories.",
    "The Motorola Edge 20 Pro was first announced for the UK and Europe, and rumors suggest it’ll be released in the US too, though an Australian launch looks unlikely due to the Edge phones not reaching there in 2020.",
    "However, it sounds like the Motorola Edge 20 will be sold as the Motorola Edge (2021) in the US , perhaps with slightly different specs, and it’s not clear if this Pro model will ever go on sale there.",
    "The Motorola Edge 20 Pro is a big phone; we had trouble using it one-handed, especially thanks to its width and button placement, and it didn’t sit comfortably in our hand.",
    "It measures 163 x 76 x 8mm. We put it side-by-side with the Xiaomi Mi 11 Ultra – one of the biggest devices we’ve tested – and it was taller and wider.",
    "The size brings with it several issues. We had to stretch to reach much of the screen at all; the side-mounted fingerprint sensor was so high that we couldn’t reach it easily; and when stretching our hands, the flat edges of the device dug into our palms enough that we could feel it, which wouldn’t be the case if we weren’t stretching. The Edge 20 Pro’s hand-feel was just ‘off’.",
    "Above the fingerprint scanner on the phone’s right edge is the volume rocker, and we found this impossible to reach without changing how we held the phone, or using our other hand. There’s also a Google Assistant button opposite, and again we found it impossible to reach with one hand, but unlike on some other Moto phones, it’s also small so you’re unlikely to press it accidentally.",
    "The phone has a USB-C port at the bottom, but there’s no 3.5mm headphone jack, in quite a rare turn for Moto phones.",
    "On the back is a rectangular camera bump housing the three lenses, flash, and zoom microphone (for audio zoom – more on that in the Cameras section). It’s not too thick, so while it does stop you from laying the handset flat on a table, it doesn’t make pocketing the phone tricky.",
    "The handset has a glass front and back, unless you opt for the Vegan Leather version which has a back clad in faux leather, and both the leather or glass options are blue. Neither model has an IP rating, but according to Motorola the phone is water repellant (don’t take it for a swim, then).",
    "With a 6.7-inch screen, the Motorola Edge 20 Pro offers quite a bit of viewing real estate, as does every other member of the Edge family. Unlike on the last-gen models, the screen is flat all the way to the edges, and is broken up by a circular cut-out for the front camera.",
    "It’s an OLED display with a 1080 x 2400 resolution and support for HDR10+, which is about in line with most competing devices.",
    "One surprise spec is the 144Hz refresh rate, which means the screen image updates 144 times per second. For a long time 60Hz was the norm, but in recent years lots of handsets have come out with 90Hz or 120Hz displays; 144Hz is faster again, and only a handful of phones match or exceed this number.",
    "As a result, motion on the Edge 20 Pro’s display looks pretty smooth, a feature some phone fans will really appreciate, although not everyone will notice the difference, or care much.",
    "The Motorola Edge 20 Pro has a strong array of cameras – which is a weird thing to write about a Moto phone, given that their snappers are usually sub-par. It’s not a fantastic camera phone, due to some questionable optimizations, but we were still impressed with the pictures it took.",
    "We’ll start with the 32MP, f/2.3 selfie camera, which took pictures that were bright and colorful. We found ourselves avoiding Portrait mode, however, as its background blur effects weren’t always accurate, and it optimized facial features in a curious way.",
    "Case in point: compared to the same selfie taken with Portrait mode disabled, in Portrait mode, highlights were boosted for our hair, making each strand visible, while a global brightness boost not only lightened our face but also our clothes, reducing overall contrast and making the image a little less striking.",
    "Now onto the main cameras. The headliner is a 108MP f/1.9 snapper, which is joined by a 16MP f/2.2 ultra-wide camera, and a 8MP f/3.4 periscope camera that takes 5x optical zoom snaps.",
    "Pictures taken with the main camera were full of detail, especially if we used the 108MP mode (normal pictures are only 12MP unless you enable High-Res mode). They seem to have quite a naturalistic look, more like images from a Huawei device than the auto-saturated shots that Samsung Galaxy phones tend to produce, which some may like and some may not.",
    "To get the best snaps, we did need to take pictures into an editing app, as ‘naturalistic’ can very easily mean ‘dull’ in low-light settings or on overcast days. But, thanks to the plentiful color and brightness information captured by the sensor, we could often turn a snap into a great Insta post.",
    "We took some low-light photos as well, and these often looked good, with Night mode doing a good job of balancing exposures and brightening shadows. Unfortunately the mode automatically jumps into action, whether you toggle it or not, and we were unable to take comparison shots as a result. This doesn’t sound like a problem, but strong contrast can make for striking images, and by automatically brightening dark areas the camera doesn’t give you the option to optimize contrast",
    "Photographs taken with the ultra-wide camera retained the same color profile as those from the main snapper, though sometimes they looked a little more saturated, and as you’d imagine given the lower sensor resolution compared to the main camera’s High-Res mode, you’re losing a little detail too.",
    "The periscope camera lets you zoom up to 5x optically, or 50x digitally, although as you get closer to the max digital zoom snaps become unusably blurry. 5x zoom pictures looked… well, they were okay, but the relatively low-res sensor can leave pictures looking a little fuzzy. Plus, colors didn’t look as bold as in images taken with the main or ultra-wide cameras.",
    "Video recording can be done at 1080p, 4K or 8K, and at 24, 30, or 60fps, though if you want to record in 8K the framerate tops out at 24fps. We found the device surprisingly capable for recording high-res footage for fairly long amounts of time without heating up or capturing stuttery footage.",
    "The phone offers a modest range of capture modes including Portrait, Night, 108MP and document-scanning photography. Portrait (on the main camera) was useful for pictures of people, as the software tweaked image settings to make the subject stand out more, though sometimes the changes were subtle.",
    "The ‘brains’ of the Motorola Edge 20 Pro’s operation is the Snapdragon 870 chipset. Now technically this isn’t the best processor available to Android phones, with the Snapdragon 888 besting the 870 in terms of power. However, the difference between the two is slight, and the 870 doesn’t bring with it the oft-reported overheating issues with the 888, making the not-quite-as-top-end chipset a great pick for many budget phones.",
    "We found the Edge 20 Pro powerful enough to handle all the games we threw at it, from top-end experiences like PUBG Mobile with all the settings maxed out, to Rome Total War: Barbarian Invasion, and for long stretches of play.",
    "The phone surprised us by returning a multi-core score of 2878 when we put it through a benchmark test; that’s almost exactly the same score as the 2875 of the Moto G100 (which has the same chipset), but far below the 3369 of the Poco F3 or the 3381 of the Vivo X60 Pro, both of which also use the 870. However, such differences are unlikely to be noticeable in real-world use.",
    "The chipset is paired with 12GB RAM, which is a fair amount, as well as 256GB storage, which again is a decent offering, though there’s no way to expand on it.",
    "This is a 5G phone, so you’ll be able to connect to next-gen networks, although this depends on your contract and where you live, so your mileage depends more on those factors than the Edge 20 Pro itself. We used the handset to connect to 5G networks operated by the UK’s Vodafone just fine.",
    "This is one of the few Motorola phones not to have a 3.5mm headphone jack, and while the loudspeaker is fit for purpose, it’s not going to give you the sonic quality headphones will. We’d recommend splashing out on a USB-C to 3.5mm adaptor, or even better some wireless earbuds, for the best audio experience.",
    "Like all Motorola phones, the Edge 20 Pro uses a clean version of Google’s Android operating system, with the device running Android 11 out of the box. It’ll almost definitely be eligible for the upgrade to Android 12, and maybe future builds of the software too, when they roll out.",
    "That means the software looks how it would on a Pixel phone, without the overlays and design tweaks some companies add. Icons are circular, downloaded apps are stored in an app drawer, and the notifications list is split up into media, conversations, ‘standard’ app notifications and ‘silent’ pings (ie, reminders from certain apps).",
    "Motorola does bring a few of its own tricks, in the form of its super-useful time-saving actions. These let you quickly trigger functions with specific gestures, our favorite of which is doing a double ‘karate chop’ action to turn on the flashlight.",
    "If you’re new to Motorola phones it may take you a little while to get used to actions, but once you do it’s hard to go back.",
    "The phone ships with a cable for, and is therefore compatible with, Ready For. This is Motorola’s Dex rival, which lets you connect your device to an external monitor such as your computer screen or TV for certain functions.",
    "You can use Ready For for work, using apps on the bigger screen; for entertainment, casting content from streaming apps onto a big screen, for video calls, and for a few other applications. It’s potentially a very useful service, although some will get more use out of it than others.",
    "The Motorola Edge 20 Pro’s 4,500mAh battery does its job, and we found the phone to generally last a day between charges. This wasn’t the case when we used the device heavily, but with average use – occasional social media, streaming music, the odd photo – the battery easily made it through to the end of the day.",
    "Given the screen’s large size and high refresh rate, a full day of battery life is commendable, although some other Moto devices will last you up to two days.",
    "Charging is 30W, which is faster than Samsung’s and Apple’s top phones, but pales in comparison to the 65W, 90W or 120W charging that other devices at this price (and lower) offer. We found it took the device about an hour to fully charge from empty at 30W.",
    "However, there’s no wireless or reverse wireless powering, as we saw with last year’s Edge Plus, likely due to Motorola wanting to bring this phone in at a lower price point."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Motorola Edge 20 Pro price and availability",
    "15": "Design",
    "22": "Display",
    "26": "Cameras",
    "37": "Specs and performance",
    "43": "Software",
    "49": "Battery life",
    "53": "Don't buy it if..."
  },
  "links": {
    "Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "Motorola Edge 20": "https://www.techradar.com/news/motorola-edge-20",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Poco F3": "https://www.techradar.com/reviews/xiaomi-poco-f3",
    "Vivo X60 Pro": "https://www.techradar.com/reviews/vivo-x60-pro",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Ready For": "https://www.techradar.com/news/ready-for-what-is-motorolas-dex-alternative-and-how-does-it-work"
  }
}