{
  "source": "https://www.techradar.com/reviews/liquid-web",
  "title": "Liquid Web review",
  "category": "computing",
  "updated": "2021-12-01T11:12:08Z",
  "author": "mike-williams",
  "summary": "An expensive and exquisite host backed by an excellent support team",
  "verdict": "Liquid Web is a US-based host offering premium managed web hosting solutions that exceed many standards in terms of speed, safety, sophistication, and support. Consequently, its products are considerably costlier than what is found with other similar providers.",
  "pros": [
    "Several control panels to choose from",
    "Fine range of hosting options",
    "Bold 100% uptime guarantee",
    "Free white-glove website migration",
    "Splendid 24/7/365 support"
  ],
  "cons": [
    "Expensive",
    "No shared hosting",
    "No free trial"
  ],
  "article": [
    "The story of Liquid Web begins with one man by the name of Jim Geiger and his dream to create “the most loved hosting provider in the world”. This dream was made into reality in 1997 when the company was founded. Nowadays, it employs more than 500 on-site hosting professionals and serves over 45,000 customers in more than 150 countries across the world. Taking all this into account, it’s no surprise Liquid Web has received Inc. 5000 Fastest Growing Companies award for nine years in a row.",
    "As its founder likes to emphasize, Liquid Web puts its focus on meeting the needs of small and mid-size businesses while keeping the customer at the center of its strategy. Specialized in fully managed VPS and dedicated server solutions, it is not a company you would describe as a beginner-friendly one. With Liquid Web you’ll get your money's worth, more so if you are ready to pay handsomely.",
    "Liquid Web’s head office is located in Lansing (Michigan, the USA) and their data centers can be found in Lansing (Michigan, the USA), Phoenix (Arizona, the USA), and Amsterdam (the Netherlands). If this doesn’t cover you or your intended users, worry not since Liquid Web also provides a global CDN (content delivery network) with server locations in more than 120 countries.",
    "Liquid Web’s official site features something we haven’t seen in a while, and that is pictures of people laughing out loud at jokes they haven’t shared with us (or they may just be happy working at Liquid Web). Besides this, the site is everything you would expect from a veteran web hosting provider, professional-looking and well-polished. It also features a blog and a pretty good one to boot.",
    "As for social networking sites, you can follow Liquid Web on Facebook, Twitter, LinkedIn, and YouTube, and all these accounts are still in the land of the living.",
    "Given that Liquid Web is specialized in providing powerful managed hosting solutions aimed at professionals and businesses, it’s no wonder that simple shared hosting is not an option. The options are cloud hosting, managed WordPress, managed VPS (the top-seller), and dedicated server hosting solutions. For each type of hosting more than plenty of pretty powerful plans are at your disposal, and they will cost a pretty penny.",
    "If you’re working on a tight budget, the cheapest choice is to go with the smallest out of managed WordPress plans or comparable plans for managed WooCommerce-oriented hosting. On the monthly billing cycle, they are both offered for an introductory price of $9.50 per month (which is valid for 6 months), after which the price will rise to the regular $19 per month. If you submit for a year, it will be billed at $190, which is a bit over $15 per month.",
    "The smallest WordPress plan called “Spark” will supply you with the ability to host a single site, use 15GB of storage space, 2TB of bandwidth, 30-day backups, unlimited email accounts, Beaver Builder Lite, iThemes Security Pro, and iThemes Sync.",
    "As it usually is with similar premium providers, Liquid Web offers no risk-free trials for its products but it does offer a “no-hassle” money-back guarantee for the first 30 days of use for cloud, cloud dedicated, and VPS packages. They also add that if you happen to discover that their solutions are not right for you within a few days, you can get in touch with their support staff and get your monthly investment refunded. On the other hand, if you’ve subscribed for an annual plan, you’re out of luck.",
    "The methods of payment which Liquid Web accepts include credit cards (VISA, MasterCard, American Express, and Discover), PayPal, check and wire transfers.",
    "When you’re ready, pick out a plan, a billing cycle and prepare to surrender your email address, come up with a strong password and prove to them that you’re not a robot. After this, you’ll be asked to wrap up your account with Liquid Web by providing your personal information, a phone number, and a physical address.",
    "If there is an introductory discount for the product you are purchasing, make sure to copy the code and paste it into the appropriate field before making a buy, since it can get up to 50% off the original price for a couple of months.",
    "If you don’t own a domain name (or you just want to register a new one), you can do it via Nexcess (which is a part of the Liquid Web family of brands) and it will cost you $20 per year (a bit pricey if you ask us). Another thing you can get through Nexcess is a shared hosting package since we already concluded that Liquid Web is not exactly an entry-level host.",
    "Liquid Web’s dashboard design is clean and simple, and everything you’ll need for monitoring and managing all aspects of your website (or websites) is laid out in the main menu on the left tab. If you already have a site elsewhere, Liquid Web's technical team will transfer it for you at no additional cost (you just need to ask), and this is true even if you’ve purchased their cheapest hosting package.",
    "As we write, Liquid Web provides a selection of easy-to-use control panels including InterWorx Unlimited, Plesk, cPanel, and WHM/cPanel, together with enough information about each of them. The panel you’re interested in will already be covered by the pricing, but only if you went with an annual or a biennial plan. However, if you want to put your technical expertise to the test, you can even choose a server with no control panel and/or choose to install your own.",
    "Liquid Web doesn’t offer a website builder, therefore, if you want to use one you’ll have to install it on your own or use an online service such as Weebly, Wix, or Squarespace.",
    "When Liquid Web described its solution as “lightning-fast”, it wasn’t exaggerating by any means. Before putting the speed of Liquid Web’s official site to the test (via GTmetrix) we did have high hopes, however, we didn’t expect to get thunderstruck with a perfect speed performance crowned with an A (100%) as a final score. Although the time the page took to fully load was 6.8 seconds (which is slightly above the average), all other vital web metrics were well ahead of the curve, resulting in a perfectly presentable performance.",
    "As for uptime, Liquid Web provides an SLA-backed guarantee of 100% across the board, which means that all major routing devices within Liquid Web’s network will be available from the global internet 100% of the time. To test this out we employed UptimeRobot, a tool with which we monitored and measured the availability and responsiveness of Liquid Web’s official site for two weeks. Unsurprisingly, our report showed no traces of downtime.",
    "The report also reveals a few major spikes in response time, but since the average one was around 107 milliseconds, these spikes can be safely ignored.",
    "If you find yourself needing a helping hand, Liquid Web’s stellar support staff can be reached 24/7 via telephone, live chat, and e-mail. Liquid Web provides a 59-second support response guarantee (for phone, chat, and helpdesk) with all of its plans, which means you’re not going to waste virtually any time waiting for help. Even Liquid Web describes its in-house support team as “the most helpful humans on hosting”, with which we can’t argue.",
    "If for some reason you want to search for solutions on your own, Liquid Web has several options on offer. The most obvious one is the knowledgebase, to which we can’t do enough justice by describing it as merely comprehensive. It comprises over 1700 in-depth guides covering everything from the most common to more complex issues, all of them described in detail and backed by suitable screenshots.",
    "Besides this, you can also check out their YouTube channel with over 300 videos (although most of them are already featured in written guides), watch their webinars, download e-books, guides, case studies, and more (the “Insight” section) or return to Liquid Web’s ever-resourceful blog.",
    "Both HostGator and Liquid Web are among the most well-known web hosting providers out there. However, while HostGator rocks its feature-full shared hosting solutions with an attractive price tag, Liquid Web is more focused on providing premium managed hosting solutions with a full list of premium features at an equally premium price. Therefore, if you are looking for a budget-friendly hosting solution, HostGator might be right up your alley.",
    "Much like HostGator, Bluehost has managed to make a name for itself as an affordable yet well-rounded host, particularly in terms of basic features and user-friendliness. Like Liquid Web, Bluehost offers a variety of hosting types, features, and options in general. Unlike Liquid Web, it is ideal for bloggers, start-ups, and small business sites. In contrast, Liquid Web takes a luxury approach and supplies its users with everything needed for a successful site (superior support included), but for a small fortune as a price tag.",
    "If you are in search of high-quality fully managed WordPress hosting, both SiteGround and Liquid Web will do the trick. However, if you have a budget to worry about, SiteGround might be the right choice. They even offer five-star shared hosting packages for a reasonable price.",
    "Another excellent alternative to Liquid Web is InMotion Hosting, a US-based host with solutions aimed at pretty much everyone from bloggers to medium-sized businesses. That being said, all of InMotion Hosting’s data centers are located in North America, which makes them less convenient for customers globally. In addition to this, they don’t provide servers for Windows, so if that is what you want, you’ll have to go with Liquid Web.",
    "If you consider yourselves a bargain-hunter, you’ll soon find out that you’re out of luck with Liquid Web. Their services will cost you an arm and a leg, and even more, if you intend to enjoy all the advantages of their “crème de la crème” hosting solutions. Nevertheless, with Liquid Web you get precisely what you pay for in terms of service quality and support.",
    "Those who are looking for an easygoing host that offers some superb entry-level plans that will save you a few bucks without forcing you to make a compromise on the quality, check out HostGator, Bluehost, and SiteGround before saying yes to any of them."
  ],
  "headers": {
    "5": "Plans and pricing",
    "10": "Ease of use",
    "16": "Speed and experience",
    "19": "Support",
    "22": "The competition",
    "26": "Final verdict"
  },
  "links": {
    "Liquid Web": "https://liquidweb.i3f2.net/c/221109/278394/4464?subId1=trd-us-3856313153691597300&sharedId=trd-us&u=https%3A%2F%2Fwww.liquidweb.com%2F",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated server": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "managed hosting": "https://www.techradar.com/web-hosting/best-managed-web-hosting",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "WooCommerce": "https://www.techradar.com/best/woocommerce-hosting",
    "Spark": "https://liquidweb.i3f2.net/c/221109/278394/4464?subId1=trd-us-2588507237556294000&sharedId=trd-us&u=https%3A%2F%2Fwww.liquidweb.com%2Fproducts%2Fmanaged-wordpress%2F%23pricing",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Weebly": "https://www.techradar.com/reviews/weebly",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "SiteGround": "https://www.techradar.com/reviews/siteground",
    "InMotion Hosting": "https://www.techradar.com/reviews/inmotion-hosting"
  }
}