{
  "source": "https://www.techradar.com/reviews/apple-tv-4k",
  "title": "Apple TV 4K (2017) review",
  "category": "televisions",
  "updated": "2021-12-02T15:07:17Z",
  "author": "gareth-beavis",
  "summary": "Apple's first 4K streaming box is still a wonder",
  "verdict": "The long-overdue Apple TV 4K acts as the ultimate set-top box upgrade if you're locked into (or loving) the iPhone ecosystem and want to pair it with a new HDR-touting Ultra HD television.",
  "pros": [
    "Dolby Vision and Atmos support",
    "tvOS interface is clean and simple",
    "Plays well with other Apple devices",
    "Remote is responsive"
  ],
  "cons": [
    "Siri can frustrate",
    "Few benefits for non-4K owners"
  ],
  "article": [
    "Yes, the Apple TV 4K (2017) isn't the latest iteration of Apple's streaming box hardware – and those after the most up-to-date model will want to check out the Apple TV 4K 2021 now on the market, coming as it does with an improved Siri remote, upgraded processor, and high frame rate capability.",
    "But even the Apple TV 4K (2017) felt like a confident step forward for Apple's little streaming box – and that's especially true if you've recently invested in a slightly-too-fancy-but-go-on-it’s-a-treat 4K HDR TV.",
    "The 2017 model is still one of the best options you've got to place under that TV, with a few caveats. It can handle all 4K resolution content, with HDR10 and Dolby Vision supported, so the main new standards are covered – and (depending on the TV you’ve connected it to) the pictures look fantastic. From the flyover screensavers to the menu interface, everything packs in more pixels and looks sharper for it.",
    "Apple TV 4K is also the only video streaming device to support both Dolby Atmos and Dolby Vision formats. The announcement came during Apple's WWDC 2018 keynote and came alongside the news that iTunes will now stock Dolby Atmos-enabled films and TV shows.",
    "Since tvOS (the operating system that both the Apple TV 4K and standard Apple TV use) first appeared. it's really improved. Universal search is getting better all the time, and if you subscribe to Apple Music it makes the Apple TV a competent jukebox as well as a top-tier movie streamer.",
    "The speedy A10X processor means you should be able to navigate the interface and load apps a hair faster than before, and Dolby Vision is a real asset to the streaming device as it's a format that few streaming devices support right now.",
    "Of course, whether you should choose Apple TV over a competing streaming device largely depends how deeply tied you are into the Apple ecosystem, your TV's limitations and just how much of that scrumptious 4K content you can wrangle up.",
    "The Apple TV 4K isn't a flawless system, but if you're looking for a 4K streamer with a few future-facing technologies, a deep-rooted connection to all of your iDevices and a decent app selection, it might just be the perfect streamer for you.",
    "In terms of price, the Apple TV 4K isn’t the cheapest streaming box on the market (an honor that currently belongs to Google's Chromecast). But that premium price is largely to be expected with Apple products, mostly due to the polish and extras on offer.",
    "The new box comes in two storage options: 32GB and 64GB, and unless you plan on going heavy on the apps, the 32GB should be fine for most folks.",
    "That being said, it's worth noting that Apple has recently raised the size limit for apps permitted on the box to 4GB, so if you’re thinking of having this as a micro-console then you might want to scale up to be on the safe side.",
    "The ‘new’ interface on the Apple TV 4K is basically a cleaned up version of the one that adorned the previous box – it’s been upgraded to pack in more pixels and look sleeker on a UHD TV.",
    "It’s been designed with ease of use in mind, mirroring across devices from iPad to iPhone (using the new TV app, which is coming to parts of the world other than the US by the end of the year) for a consistent experience.",
    "The other upgrade here is that coverage of live sports (in the US) has been enhanced to deliver tailored content: you can now see live scores and be notified of exciting moments in games that the Apple TV thinks you might like, making it easier to not miss a beat of the key stuff.",
    "We couldn’t test this in the UK or Australia as the functionality isn’t available yet in these territories (Apple is yet to confirm its release plans outside of the US), but if your box can properly work out the things you like to watch it could really cause some arguments when you’re in the middle of an enthralling film, and have to turn casually to your partner and say “Honey, can I just…?”",
    "The overall performance of the Apple TV 4K was a touch slow at times, with a spinning loading wheel appearing when transitioning between apps or calling up different shows. However, when we started to stream the interface was snappy, suggesting that the issue was not with our fiber optic internet connection.",
    "This lag can be irritating when you’re navigating around the TV and moving from game to TV show, or trying to browse new titles, but it wasn't a prevalent occurrence overall.",
    "Of course, streaming videos isn't the only thing the Apple TV 4K can do: It's also a great center for your burgeoning smart home thanks the integration of HomeKit, Apple's proprietary technology that brings the IoT to iOS.",
    "Not only can it control your Homekit devices, which are starting to make their way into the home quietly in the form of speakers, smart plugs or Philips Hue bulbs, but the ease with which an iPhone or iPad syncs with the Apple TV is impressive.",
    "Screen mirroring is instant, and makes it really easy to share content on the big screen. It’s not quite as useful as Chromecast if you want to use something like Google Photos – which is superior to the onboard Apple Photos app in terms of the sheer amount of stuff you can save – but it can show pretty much anything else instantly.",
    "The only thing that’s locked is content from some streaming services – at least that's the case in the UK. Sky Go couldn’t be mirrored onto the screen, so it’s not a catch-all solution to getting content onto the living room television.",
    "It’s hard to review the Apple TV 4K and not keep accidentally reviewing the TV instead, because the look of the Ultra HD footage is so clear and crisp. 4K HDR is just the tops if you’ve got the right TV to watch it on – we went for the Philips 901F OLED TV, and everything looked just sumptuous.",
    "We tested the Apple TV 4K on an older Full HD LCD set to start with, and the picture quality there was already decent – the images were bright and clear, and the colors looked well-reproduced.",
    "However, boosting up to the 4K HDR version, things took a turn for the brighter. Watching Ghost in the Shell in 4K HDR was showroom quality – the fluid motion of the action, the difference between the brightest and the darkest elements of the scene and the sheer quality of the colors on display were mind-blowing.",
    "If you’re new to the 4K game – which we suspect many might be if they’re buying the Apple TV 4K as an upgrade to an old 1080p streamer – then it’s the perfect partner, with the ability to instantly detect what kind of display is on offer and calibrating the output accordingly. (Well, it can at least tell if it's connected to a 1080p TV or a 4K UHD one.)",
    "This auto-calibration feature, while convenient, doesn't always make for the most pristine images, however: noth Ghost in the Shell and The Defenders on Netflix were hard to see even with the brightness turned up (which is possibly due to the OLED technology on offer from the Philips 901F).",
    "It wasn’t that you couldn’t see the action, more that the contrast ratio was so strong that your brain had a little trouble processing the information.",
    "When we compared that to a non-HDR movie (in this case Guardians of the Galaxy Vol. 2) we found that everything looked brighter and, well, easier to see. Faces in shadow weren’t as obfuscated, and the overall effect was just clearer.",
    "That said, it also made everything look a little washed out in comparison, so it depends how you like your content. Perhaps brighter HDR films, where shadows are less prevalent, will impress more – we’ll update this review when tested the Apple TV 4K on an LCD TV with 4K HDR capabilities.",
    "Having Dolby Vision supported alongside HDR10 is a nice move from Apple, especially as some will probably buy this box to improve the look of content on their current ‘standard’ TV, with a view to upgrading in the future.",
    "It’s a shame that Dolby Atmos wasn't supported to begin with, but Apple has now brought the premium audio format to the service (with the release of tvOS 12), so that's another feature you can put in the positives column.",
    "One thing Apple excels at is navigation of content.",
    "It’s great that Netflix is there from the start as a 4K HDR offering (dark scenes in some shows aside) and being able to search through the service from the home screen, with Siri able to dive straight into Netflix directly, was a really neat touch.",
    "Siri isn’t able to find the 4K HDR movies and shows, just those in 4K, but even that capability was impressive.",
    "Apple has opened a 4K HDR ‘room’ within its iTunes movies app to make it easier to discover the content – and the best part is that any titles you’ve previously purchased in Full HD will be automatically upgraded to 4K HDR when they’re made available.",
    "Exactly when they’ll be available is another key issue, however. At the time of writing, in the UK and Australia the 4K HDR range is sparse, with far more on offer in the US. This will obviously change over time as movie studios start bringing their 4K content to the market, and to streaming boxes such as the Apple TV 4K.",
    "But it isn't all about iTunes – a large amount of 4K HDR content can be found in the Netflix app, as well as on YouTube. In Australia, the Stan app also offers 4K resolutions on a steadily-growing number of shows, though high-dynamic-range content has yet to make an appearance.",
    "With Apple's new Apple TV Plus streaming service arriving this Autumn, too, we're going to see a lot more content come to the service – though there'll be an additional paywall to get through to access it.",
    "Apple TV 4K will also pull in content from whichever catch-up apps you happen to have have access to. For instance, if Australian users have SBS On Demand, 9Now, Tenplay, ABC iview, PLUS7, AnimeLab or any other content app installed on their unit, the shows from those apps will come up as suggestions in a large, overarching library within the Apple TV app. Think of being a bit like Netflix, only with a library pulled from a number of separate content sources.",
    "In the Watch Now section, you'll find a list of the shows you've been watching, and Apple TV will remember where you're up to regardless of where the content comes from. Once you're up to date on a show, it will disappear from the list, only to pop up again when a new episode is available.",
    "The design of the Apple TV is identical to the previous model, coming in at 35 x 98 x 98mm (H x W x D) to fit snugly beneath most TVs without any worry.",
    "It’s a little weighty – although that doesn’t matter too much given that you’re going to wedge it beneath a monster television anyway. Unless your stand is already creaking under the weight of a formidable AV setup we think it’s unlikely that the Apple TV 4K will be the streaming straw that breaks the AV camel’s back.",
    "The matte black top and shiny sides are only broken by a single LED that blinks with input, and signifies the unit is out of sleep mode; it’s understated, and only the height really makes it noticeable – otherwise, it’s a very discreet box.",
    "The remote feels like a good balance between lightweight and well-made – although it can be tossed around easily it’s comfortable to hold, with the tactile, brushed feel and rounded edges make it something you want to play with in your palm without thinking.",
    "Well, don’t – there’s a touch-sensitive pad at the top that will register your slightest quiver, and which clicks to register an input. It’s accurate, and seems improved over the previous iteration, where we noted some slight inaccuracy when playing a game.",
    "We did have one moment where the input was confused when playing SkyForce Reloaded, a title that needs careful caressing of the touch pad, but that was the only instance of inaccuracy.",
    "The other feature of the Siri remote is the voice access it offers – for the most part, it’s brilliant. Want to watch something on Netflix? You can just ask Siri to start playing it. In fact, even when you search for something that's available on multiple sources, such as Netflix or iTunes, Siri will always prioritise the version you don't have to pay for.",
    "Downloading apps, restarting a film or just flipping to the settings are a simple tap of the Siri button away, and it’s much easier than navigating through using your fingers.",
    "However, Siri isn’t always accurate – for instance, asking her to ‘search for 4K HDR films’ came out with ‘search for 4K HD are films’ every so often.",
    "It’s the same with using voice to input passwords… it’s good, but not always accurate, and passwords are often hidden with asterisks or dots, so it’s hard to tell what you did wrong. Sometimes it worked, but more often than not we just entered them using the touchpad to ensure accuracy.",
    "Similar functionality is offered on the Amazon Fire TV with its Alexa remote, and we found that Alexa offered a consistently more accurate experience than Siri when searching for content.",
    "The Apple TV 4K is designed to be more than a TV-streaming box, as a device that can function as a music player and a basic console too.",
    "At its launch event Apple made a big deal about the new games that are coming to the new TV box, with the A10 Fusion chip from last year’s iPad offering better graphical performance – the power on offer here should really give developers some grunt to work with.",
    "However, the game Sky, which did look beautiful in the demos at the launch event, still isn't available on the Apple TV, which is slightly worrying (it's out in beta form for iPhone and iPad). Game developers don't seem to have embraced the device as much as Apple hoped they would.",
    "The motion control of the Siri Remote means the Apple TV has an instant advantage over other streaming sticks and boxes – while fairly rudimentary, the ability to play tennis games or the fun Beat Sports with actual swings of the hand is great.",
    "These games do often cost though, and seem a little pricey for what’s on offer – although you do get access on your iPhone or iPad, too.",
    "Many of the titles supported are ones that developers have taken from the iPad or iPhone and turned into something that works well on the big screen, like Alto's Odyssey.",
    "We played Dark Echo, a game that’s designed to be used with a pair of Bluetooth headphones, and it was terrifying – combined with the OLED screen of the Philips 901F, it literally had our hairs standing on end.",
    "The simplicity of using the touch remote to pace around the invisible land of terrors (trust us, you need to play this game if you get an Apple TV, or you just want to freak yourself out late at night on an iPhone) really works on this title.",
    "If Apple could find a way to start filling the Apple TV App Store a little quicker, it would give the box the kind of asset that helped propel the iPhone to the sharp end of the smartphone race.",
    "The Nvidia Shield TV has many dedicated games, and while Apple doesn't have its own proprietary controller, it advocates for a few Made for iPhone units like the Nimbus SteelSeries – a necessity for the many games show up as needing a dedicated controller to work correctly.",
    "Where the Apple TV 4K is already excelling is in the fitness space. Through its intelligent use of Bluetooth and easy-to-pair sensors you can get some smart on-screen help with working out.",
    "We used the Wahoo 7 Minute fitness app, which uses the Tickr X heart rate monitor. This chest strap can not only show your heart rate during a workout, it can count your reps using the inbuilt accelerometer, and store your progress to let you know how you’re getting on in future workouts.",
    "It’s a little rudimentary, and we’d like to see more apps and sensors taking advantage of the sensor connectivity – and they are coming, with indoor cycling powerhouse Zwift the latest to launch on tvOS.",
    "The Apple TV 4K can also function as a HomeKit hub, so a quick word to your Siri Remote will shut curtains, turn off lights or start whichever system you’ve got connected smartly – and that alone is a good reason to have the box.",
    "But, once again, the issue here is that all this can also be found on the previous Apple TV box, which is still on sale. The functionality is excellent and entertaining, but it can be had for cheaper if you’re not bothered about the 4K performance.",
    "If you don’t have a 4K HDR TV it’s hard to recommend the Apple TV 4K, because it really only adds a bit more grunt and higher-res output capabilities.",
    "Beyond that, it’s almost identical to the previous model, and the price is a lot higher than the competition – so it probably makes sense to go for 2015’s Apple TV if you have no aspiration to improve your set up.",
    "That said, those who've brought 4K HDR-ready televisions into their living rooms already will find that the Apple TV offers plenty of 4K content, along with some terrific upscaling capabilities that make everything look as sharp as possible.",
    "However, if you’ve got any inclination to upgrade to a 4K HDR TV in the future – and especially if you’re entrenched in the Apple ecosystem – then the Apple TV 4K is a pretty obvious choice.",
    "Yes, it’s pricey, but it’s slick, works well with an iPad or iPhone (or even a pair of AirPods), and the range of content is good enough right now. When Apple Arcade and Apple TV Plus both launch in Autumn 2019, there'll be a huge expansion of content you'll be able to sign up for, if the additional costs don't put you off.",
    "The Siri Remote is a real boon, offering helpful voice navigation and motion controls for basic games that children will enjoy, and the facility to connect sensors makes this an effective next-generation fitness machine as well.",
    "To reiterate: if you’ve not got a 4K TV, then you might as well just go for the older model of Apple TV, as the speed increases and higher capacity aren’t really offering enough.",
    "The speed of the interface is better, but still not perfect, and the App Store definitely needs more titles – we’d have expected a wider range by now, although it does seem that the trickle is becoming a steadier stream if the cross-platform offerings are anything to go by.",
    "If you’re already in the Apple-sphere and want a streaming box, the Apple TV 4K makes the most sense. It’s costly, yes, and there are cheaper options on the market if you just want to get high-quality images beamed into your eyeballs.",
    "But if you also want the wider app ecosystem, and the ability to connect sensors and use it as a workout trainer, play games with kids or control your smart home, then the Apple TV 4K is an easy choice.",
    "Even if you just want to make sure you’re future-proofed, the cost of the 4K version of the box isn’t that much more than the older model, and you’ll know you’ve got more grunt if you want to start using it as a micro-console.",
    "It’s not perfect, but the Apple TV 4K is now clearly far more than a hobby – it’s a real competitor, and a nice choice for the Apple fan with a fancy TV."
  ],
  "headers": {
    "8": "Price and release date",
    "11": "New 4K interface",
    "21": "4K performance",
    "31": "Content selection",
    "40": "Design and Siri remote",
    "51": "Gaming, music and fitness",
    "66": "Should I buy the Apple TV 4K (2017)?",
    "69": "We liked",
    "72": "We disliked",
    "74": "Final verdict"
  },
  "links": {
    "Apple TV 4K 2021": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "tvOS": "https://www.techradar.com/news/tvos-15",
    "Google's Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Philips 901F OLED TV": "https://www.techradar.com/reviews/audio-visual/televisions/philips-oled-901f-55-inch-4k-tv-1327621/review",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Amazon Fire TV": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-fire-tv-1304511/review",
    "Nvidia Shield TV": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it"
  }
}