{
  "source": "https://www.techradar.com/reviews/surespot-encrypted-messaging",
  "title": "Surespot encrypted messaging review",
  "category": "computing",
  "updated": "2021-12-07T17:30:09Z",
  "author": "lindsay-pietroluongo",
  "summary": "A no-frills encrypted messaging app",
  "verdict": "Surespot may sacrifice style and flashy features, but it's no-cost, ad-free and super-safe platform make it worth your while.",
  "pros": [
    "Free, with no ads",
    "End-to-end encryption",
    "No personal information needed"
  ],
  "cons": [
    "Limited features",
    "No group chat option",
    "Not as attractive as other messaging apps"
  ],
  "article": [
    "Surespot is a secure messaging app with end-to-end encryption for all images, text, and voice messages sent in a two-person conversation. Not even Surespot can see what you send because its servers aren’t able to access your private key to decrypt your messages.",
    "Surespot is completely open source, with all of its code on display for you to review — and even add to if you’d like. For non-coders, the fact that Surespot is open source should at least offer some peace of mind because it’s so transparent (and there’s an easy-to-understand explainer of how it works on the website).",
    "Surespot does what you’d expect a messenger app to do. Invite other users to chat with you via their username or an invite link, then assign them an avatar. Send emoji, text, and images, and you choose to lock images so they can’t be saved to the recipient’s gallery. Record a voice message and then either send or cancel it. When receiving voice messages, they’ll auto-play if the chat tab is open — so either have your headphones in or navigate away from the tab if you don’t want others to hear.",
    "Friend and message options can be accessed by long-pressing. There isn’t much, though. For your contacts, you can do things like close the tab, assign an alias, and delete them from your contacts. There are even fewer message options, which we’ll talk about in the User Experience section.",
    "If you head to Settings > Identity Options, there are a handful of changes you can make, like setting a background image, toggling confirmation notices on and off, and generally choosing how your communications function.",
    "Surespot isn’t associated with your email address or phone number — you can’t even reset your password, so make sure to save it somewhere off-device.",
    "You can create multiple identities for use on a single device if you want to keep communications separate. Your identity is also portable, and it can be securely transferred to other devices.",
    "Because of Surespot’s encryption and high-level privacy, there are guidelines for what can and cannot be accessed should you lose your phone, uninstall the app or restore an old backup. When you get started, you’ll be asked to back up your identity to your documents or Google Drive.",
    "There’s a 1,000-message history, and once that threshold is reached, your oldest messages will start getting deleted. You can also manually delete messages and block users you don’t want to communicate with any longer.",
    "Message options on Surespot are very limited — you can only copy or delete a message, even the ones you send. There’s no option for editing a message once you send it. What’s nice, though, is that if you delete a message you sent, it’ll be deleted from the receiver’s history, too.",
    "When sending media, you can search for a GIF, upload an image from your device or take a picture in-app. The in-app camera is as basic as they come — you can turn the flash on and off, change the orientation to take a selfie, and snap — that’s it.",
    "All in all, Surespot works as it says it does, even if it doesn’t feel as smooth or intuitive as other apps. There also isn’t any way to see that the other person is typing a response, which some users may like or dislike based on their preferences.",
    "Surespot is available in the Apple App Store and on the Google Play Store for iOS and Android devices.",
    "Surespot is completely free, but you can support it with contributions. You don’t have to make a decision about contributing to sign up, but it’s available on the website if you’re interested. There’s not even advertising on the app — other than taking donations in cryptocurrency, Surespot isn’t monetized and it doesn’t track you around the internet.",
    "Surespot’s main competition are other messaging apps like Snapchat, WhatsApp, and Voxer, though they don’t all offer the same high level of encryption, security, and transparency that Surespot does. Also, it’s hard to find any app that doesn’t have advertising to bombard you every few minutes.",
    "Surespot can be used whether you want a simpler, safer way to chat with friends or to hold discussions that require a high level of anonymity or security. Push notifications can be turned on or off, letting you keep your convos as visible or hidden as you want. And being able to delete your own messages from the other person’s history is a huge benefit, especially for an app that doesn’t offer disappearing messages as an option. Unfortunately, a major drawback of Surespot is the lack of a group text option — you’re relegated to just one-on-one conversations.",
    "The app can be a little finicky. I had a hard time getting it set up on one of my devices, but the other one went smoothly. Typing and adding images can be a bit laggy or non-intuitive at times. And clicking around the app, while there’s not much to explore, isn’t as responsive as you’d want. The design and color scheme also make it somewhat tricky to move around the app at times.",
    "It’s also both a blessing and a curse that it’s incredibly hard, if not impossible, to recover your password and Surespot identity. This is what makes it so secure, but from a user-friendly perspective, it is a pain if you misplace your info. It’s necessary to write down your password somewhere you can always access it like a password manager because when you log out of Surespot, it clears stored passwords.",
    "We've also featured the best encrypted messaging apps"
  ],
  "headers": {
    "1": "Features",
    "5": "Privacy",
    "9": "User experience",
    "12": "Platforms",
    "13": "Plans and Pricing",
    "14": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "Surespot": "https://www.surespot.me/",
    "secure messaging app": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "open source": "https://www.techradar.com/best/best-open-source-software",
    "explainer": "https://www.surespot.me/documents/how_surespot_works.html",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "WhatsApp": "https://www.techradar.com/reviews/whatsapp-encrypted-messaging",
    "password manager": "https://www.techradar.com/best/password-manager",
    "best encrypted messaging apps": "https://www.techradar.com/best/best-encrypted-messaging-app-android"
  }
}