{
  "source": "https://www.techradar.com/reviews/dust-encrypted-messaging",
  "title": "Dust encrypted messaging review",
  "category": "computing",
  "updated": "2021-11-28T19:34:58Z",
  "author": "wisdom-sablah",
  "summary": "Secure messaging at no cost",
  "verdict": "Dust allows you to send secure and encrypted messages for free. However, the fact that your messages disappear when using its service makes it hard to have ongoing conversations using Dust. Still if you're looking for a secure messaging service that won't break the bank, Dust is certainly worth checking out.",
  "pros": [
    "Secure messaging",
    "Free messaging"
  ],
  "cons": [
    "No video calls",
    "Limited features"
  ],
  "article": [
    "With an encrypted messaging app, you can send secure messages without having to worry about anyone intercepting and/or reading them. This is very useful for a number of different people, particularly those who deal with sensitive information regularly.",
    "In our Dust review, we take a closer look at this encrypted messaging app to see if it’s worth using. Along with secure messaging, Dust also comes with a selection of web search and identity theft protection tools, which stand out as very useful.",
    "Like most encrypted messaging apps, Dust is 100% free, forever. You won’t ever be asked to sign up for a premium account or to pay for extra features, which is nice to see. All tools are available from the start, and there aren’t even paid add-ons or any other premium features.",
    "With Dust, you can send messages and make calls without worrying about your data being compromised. While the app isn't exactly feature-packed, here are some key features to take note of.",
    "Dust has a profile feature that allows you to see your followers and all the people who follow you. You can keep track of your blasts (explained below) from your profile. From the settings button under your profile, you can add a headshot and your bio. You can also add your business or personal website.",
    "Dust's Secure Sync feature helps you find contacts and friends who are also Dust users. It's a secure feature so you don't have to worry about your contacts being compromised.",
    "Dust is not the most popular messaging app, so you might not find lots of friends on it. Dust has a standard invite feature that enables you to send invites to your friends using text messages.",
    "With the blast feature, you can send messages—including text and pictures—to several contacts all at once. The advantage of blasts on Dust is that each message is read privately, even if you send the same message to hundreds of people.",
    "Dust is incredibly easy to download and set up on your mobile phone. Whether you’re using an iPhone or an Android phone, the entire process can take less than five minutes.",
    "After installing Dust on your phone, you’ll be asked to sign up. All you need to do is to enter your phone number for a verification process that takes about a minute. Right after, you’ll add a username, and you’re good to go. You can start a chat by hitting the compose button.",
    "Dust uses a feature called Secure Sync that uses your phone contacts to help you find friends who are on Dust. There’s also an option to invite your contacts to join Dust.",
    "We found the app extremely simple and easy to use. It has four key tabs: friends, chats, blasts, and settings, making it easy to navigate the app. If you want to customize the look of Dust, you can choose from a number of available themes, including Dark Mode, Classic, Azure, Magenta, and Cardinal.",
    "Dust provides technical support to all users. If you have any queries, you can start finding answers by checking out Dust’s support page on their website. Their knowledge base is populated with articles under three key sections: FAQs, Sign-Ups & Sign-In, and Tips & Shortcuts. We found the articles and guides very resourceful and easy to follow.",
    "Although Dust’s knowledge base includes sections titled People Tab, Chat Tab, and App Settings, there were no articles or resources there at the time of writing.",
    "If you want to directly reach out to the company, you can send the team a message using a contact form on their support page. Unfortunately, we spotted a broken link to their contact form on their support page.",
    "However, when you do eventually send a message, you’ll receive fast replies. For example, we received a response within one business day when we sent a dummy query.",
    "Dust’s claim to fame is security; the company touts itself as the most secure messenger in the world. While we can’t validate that claim, Dust is certainly one of the most secure messaging apps out there.",
    "Using a suite of features, including end-to-end encryption, the company ensures that your communication is always secure. Much like Snapchat, all messages disappear after 24 hours. Messages are typically deleted after 100 seconds once read.",
    "Once a message is deleted, it can never be recovered. Not even Dust has access to your messages and your contacts can’t save or store any of your messages and images. Even if a screenshot is taken of your texts, Dust notifies you almost immediately so you can take the appropriate action.",
    "The messaging app also has a privacy-watchdog feature and a stealth feature that enables you to search the internet without compromising your privacy.",
    "All these features make Dust a safe choice for sending sensitive information, including credit card information, hospital records, and sensitive work data.",
    "Dust has some strong competitors on the market, including Snapchat, Telegram, Signal, Discord, and WhatsApp. Dust is like Snapchat in many ways, but Snapchat has more features and is more popular. For example, Snapchat has a live video chatting feature and offers several filters for editing pictures.",
    "Another competitor worth looking at is Telegram. Backed by a suite of features, including chat locks, two-step verification, and proxy servers, Telegram edges Dust if you are on the hunt for a feature-packed messaging app.",
    "In our opinion, Dust is a useful messaging app if you prioritize secure communication above all else. However, it’s not exactly a platform to socialize and engage with contacts as it’s hard to have social conversations when your messages disappear. For that purpose, other messaging apps like Snapchat, WhatsApp, and Telegram are much better.",
    "You might also want to check out our Element secure messenger review."
  ],
  "headers": {
    "2": "Plans and pricing",
    "3": "Features",
    "8": "Interface and in use",
    "12": "Support",
    "16": "Security",
    "21": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "encrypted messaging app": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "Dust": "https://usedust.com/",
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Snapchat": "https://www.techradar.com/how-to/phone-and-communications/how-to-use-snapchat-1307080",
    "Signal": "https://www.techradar.com/reviews/signal-encrypted-messaging",
    "Discord": "https://www.techradar.com/reviews/discord",
    "WhatsApp": "https://www.techradar.com/how-to/use-whatsapp",
    "Telegram": "https://www.techradar.com/news/telegram-is-looking-more-and-more-like-a-business-app",
    "Element secure messenger": "https://www.techradar.com/reviews/element-secure-messenger-review"
  }
}