{
  "source": "https://www.techradar.com/reviews/vari-standing-desk",
  "title": "Vari Standing Desk review",
  "category": "computing",
  "updated": "2021-08-10T18:28:20Z",
  "author": "anthony-spadafora",
  "summary": "A manual sit-stand desk with a unique rowing-lift mechanism",
  "verdict": "Vari has simplified the process of adding a sit-stand desk to your workspace and those in the market for a manual standing desk will likely be pleasantly surprised with just how easy the Vari Standing Desk is to assemble. More color options would be a welcome addition but the unique design of the Vari Standing Desk more than makes up for this.",
  "pros": [
    "Simple assembly",
    "Nine height settings",
    "Solid construction",
    "Cable management tray"
  ],
  "cons": [
    "Only white color option available",
    "Desk only supports up to 45lb (20.4 kg)",
    "Takes up additional space when raised"
  ],
  "article": [
    "Sitting at a computer desk all day has been proven to have negative effects on your health and even your well-being which is why standing desks have seen a recent surge in popularity over the last few years. Whether you’re working from home or have already returned to the office, opting for a standing desk could very well help improve your productivity as well as your health.",
    "Based in Coppell, Texas, Vari has been making both standing desk converters as well as standalone standing desks since 2013. The company’s first product, the VariDesk sit-stand desk converter, was actually created for a colleague that needed a simple way to stand up at work in order to relieve his back pain. The standing desk converter was so popular that it inspired a whole new category in office furniture and Vari now makes manual standing desks, electric standing desks, traditional desks, tables, chairs, file cabinets, lockers and of course, several models of standing desk converters.",
    "Vari currently makes both an Electric Standing Desk as well as a manual Standing Desk. Today we’ll be looking at the Vari Standing Desk, it’s assembly process and whether or not it can earn a place in your home office or workspace.",
    "The Vari Standing Desk is available on Vari’s website for $595 at the time of writing. Thankfully though, the company offers free shipping in the contiguous US, so you won’t have to pay anything extra for shipping even though the desk weighs approximately 102.2lb (46kg).",
    "Vari’s Standing Desk immediately sets itself apart from the competition due to its unique design. While other manual sit-stand desks feature a crank system or a lever to raise or lower them, Vari has incorporated a dual-handle design right into the desktop itself with cutouts on either side of the desk.",
    "The desktop itself has a smooth white finish and is 48 inches (122cm) wide with a depth of 32 inches (81cm). There are 33.5 inches (85cm) between the front and back legs and there are also 33.5 inches (85cm) between the left and right legs. Vari’s Standing Desk can be lowered to a height of 29.25 inches (74.5cm) and can be raised to a maximum height of 43 inches (109cm).",
    "Another thing that sets this desk apart from other manual sit-stand desks is that it features a rowing lift system where the desktop extends further out in front the higher you raise the desk. The desk’s piston and spring-assisted lift mechanism adjusts to nine different height settings and to raise the desk, one simply needs to grip both handles and pull up.",
    "Although this is an entirely manually operated desk, Vari has still included a cable management tray at the back of the desk in case you want to use it with a desktop computer and a monitor. The cable management tray is also quite flexible as it has openings on either end and a hole at the back to make it easy to run cables.",
    "Vari’s Standing Desk arrived in a single box and the desktop and rowing lift mechanism were secured with large square pieces of cardboard to prevent them from moving during shipping.",
    "The box also contained the desk’s legs, a welcome booklet with 12 cable ties, a box with two headphone hangers, a coaster for a coffee mug and an instruction booklet.",
    "Vari claims on its website that the desk can be assembled in minutes and in our testing we found this to be true. The fact that no tools are needed also helps set this desk apart from the competition. To assemble the desk, you simply need to screw in the four legs which already have threads on each end that screw into the desk.",
    "From there, simply flip over the desk and you’re ready to go. If you notice that the desk isn’t level after doing so, the base of each leg can be adjusted to accommodate for uneven floors.",
    "Overall setting up Vari’s Standing Desk was quite simple and while the company recommends that two people put it together, it can be done on your own. The addition of the numerous cable ties to tidy up your setup, the coaster to keep your desk looking fresh and the two headphone hooks was also a nice touch.",
    "After setting up Vari’s Standing Desk, we first tried it out using a Chromebook and were pleasantly surprised by all of the extra room available. The two handles to raise and lower the desk didn’t get in our way during use either.",
    "When it came to raising and lowering the desk, it did take a few tries to find the optimal height for us while standing and sitting. However, you’ll easily get a handle for raising and lowering Vari’s Standing Desk after doing so several times. While there are only nine different height settings, finding one that works for you won’t be a problem given how little effort it takes to raise and lower the desk using its spring and air-lift piston system.",
    "According to a large sticker attached to the desktop, the desk itself has a max weight of 45 lbs (20.41kg). In our second round of testing, we set up an ultrawide monitor along with a desktop PC in a mini-ITX case. Although our 20lb monitor and 20lb PC put us close to the 45lb weight limit, the desk remained sturdy both while lowered and raised. As we mentioned before, cable management was also a breeze thanks to the cable management tray at the rear of the desk.",
    "It’s worth noting that Vari’s Standing Desk is a bit different from the company’s Electric Standing Desk in the way that it raises and lowers. While the Electric Standing Desk goes straight up and down, the manual Standing Desk comes out a bit when raised. By no means is this a deal breaker but you will need to leave extra space in front of the desk to accommodate for this.",
    "As the Vari Standing Desk is available for just under $600 and isn’t electric, we’ll be looking at other manual standing desks that offer similar features and come in at under $1000.",
    "The ModTable Hand Crank Standing Desk is available for $519 with a medium desktop that measures 48 inches in width and 24 inches in depth. Unlike the Vari Standing Desk, this desk is available in four different colors and there is also a smaller desktop option for those with less space. However, what could be a potential turnoff is the fact that it uses a hand crank to raise and lower the desk. You’ll also need to purchase a cable management tray separately for the high price of $79.",
    "Another more expensive option worth considering if you’re specifically looking for a manual standing desk is the WorkFit-D Sit-Stand Desk from Ergotron. However, this desk is more expensive at around $900 and you will need to find a reseller to purchase it. The WorkFit-D has a lever on the right side of the desk which is used to raise and lower it. One interesting thing about this desk is that it uses integrated brake locks to prevent tipping or sway. Despite its higher price, you’ll still need to purchase a cable management kit separately as well as mounting solution to attach a power strip to the desk.",
    "The Vari Standing Desk does an excellent job of checking all of the boxes one would look for in a manual sit-stand desk. The desk’s spring and air-lift piston system makes it easy to adjust and finding a suitable height while sitting or standing is easy thanks to its nine height settings. Assembly couldn’t be simpler and the fact that no tools are required is an added bonus.",
    "If Vari decides to make a second edition of its manual Standing Desk, we would like to see more color options for the desktop and perhaps even additional height settings to better cater to a wider variety of users.",
    "Still though, with cable management built in from the get-go and solid build quality all around, Vari’s Standing Desk will likely be a good fit for users not interested in an electric standing desk that don’t want to be bothered turning a crank each time they want to lift or lower their manual standing desk."
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "8": "Setup",
    "13": "In use",
    "17": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "standing desks": "https://www.techradar.com/news/best-standing-desk",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Vari Standing Desk": "https://www.vari.com/standing-desk-48x32/FD-SD4832.html",
    "desktop computer": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "ultrawide monitor": "https://www.techradar.com/news/ultrawide-monitor",
    "ModTable Hand Crank Standing Desk": "https://www.multitable.com/product/multitable-manual-mod-table/",
    "WorkFit-D Sit-Stand Desk": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2520451962322296000&xs=1&url=https%3A%2F%2Fwww.ergotron.com%2Fen-us%2Fproducts%2Fproduct-details%2F24-271%23%3Fcolor%3Dbirch&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvari-standing-desk"
  }
}