{
  "source": "https://www.techradar.com/reviews/homedics-pro-physio-massage-gun",
  "title": "HoMedics Pro Physio Massage Gun review",
  "category": "fitness",
  "updated": "2021-10-11T16:05:13Z",
  "author": "rob-clymo",
  "summary": "Enjoy potent relief from muscle fatigue with the HoMedics Pro Physio Massage Gun",
  "verdict": "The HoMedics Pro Physio Massage Gun boasts many of the usual features seen on many of its rivals. Unlike most massage guns though, it has the advantage of a heated head option, which delivers soothing warmth to problem areas. On top of that, it has a stylish ergonomic design, which although quite bulky to hold over time, delivers uncompromising performance. Using the HoMedics Pro Physio Massage Gun is a breeze thanks to its robust plug-and-play heads, precise three-speed handle control and long-battery life. Expect up to five hours of run time, or about 3.5 if you’re making use of that wonderful heated head option. While there are other massage guns that will get the job done, many with slightly less oomph than the performance on show here, there’s no doubt the HoMedics Pro Physio Massage Gun will be ideal for anyone serious about tackling muscle fatigue in all of its many guises.",
  "pros": [
    "Powerful assertive massage",
    "Excellent head selection",
    "Heated massage option",
    "Quality design and build"
  ],
  "cons": [
    "Might be a bit too potent",
    "Heads can pop out if not screwed in properly",
    "Defty to hold over time"
  ],
  "article": [
    "The HoMedics Pro Physio Massage Gun is an impressive box of tricks that aims to take the strain out of muscle fatigue. It comes in a cool carrying case that contains everything needed to tackle aches and pains via three powerful massage settings.",
    "Choose from six different massage heads that can cover a raft of problem areas including all of the usual suspects such as quads, calves, glutes and more besides.",
    "There’s the added boost of a heated head feature, which delivers soothing warmth via a dedicated pulsing head. However, the HoMedics Pro Physio Massage Gun can also home in on cellulite too, with another head designed specifically to address this common issue.",
    "With a runtime of up to five hours runtime (or three and a half if you’re making use of the warmth), this is a massage gun that looks and feels great, with impressive performance to match.",
    "The HoMedics Pro Physio Massage Gun was released in January 2021, and has a recommended retail price of £299.99 (about $410 / AU$550), although at the time of writing it's being advertised on the HoMedics website with £50 off, making it just £249.99 (about $340 / AU$460). It’s also available via Amazon.",
    "Readers in the US should head to the HoMedics website for updates on its availability, or the equivalent in Australia if you're in that territory.",
    "In design terms, the HoMedics Pro Physio Massage Gun follows a similar theme to many other massage guns. It certainly feels solid and well made, though as a result it’s also quite heavy. The gun's design is nicely balanced so that weight is well distributed, but if you struggle to hold hefty devices like this it may be wise to look for a lighter alternative.",
    "There’s a port at the bottom of the handle for the power cord, with a small light bar that shows progress when it comes to recharging. The base of the massager also has a twist action for powering up and cycling through the three different intensity levels. Low operates at 2100rpm/35Hz, Medium delivers 2400rpm/40Hz while the High setting has 3000rpm and 50Hz of power. The turning action to change these settings is smooth and very precise. Up on the back of the bend the The HoMedics Pro Physio Massage Gun indicates which of the three modes you’re in by lighting up a circle around the logo.",
    "Meanwhile, the business end of the gun has an opening where you push in the different massage heads. It wasn’t immediately obvious how you get the heads in and back out again, although the action seems to be twist and push/pull now we’ve been using it for a while. This is often an area of weakness for massage guns but the design here works well. The device grips the heads effectively while stopping them popping out mid-massage thanks to the threaded design.",
    "The HoMedics Pro Physio Massage Gun comes with six different heads to choose from depending on your requirements, all of which push into the slot and lock there while you’re using them. There’s a well-rounded selection, with Barrel, Cool, Ball, Arrow, Heat and Cellulite on offer. The heads all seem well designed and engineered, with the Cool Gel Head featuring a distinctive soft blue vinyl-in-feel cushioned tip. The Heated head, meanwhile, displays a pulsing red band around it during use, which is fairly self-explanatory.",
    "It all comes in a rather stylish zip-up soft vinyl carrying bag too with foam cutouts that hold everything in place while you’re in transit. Another small but useful addition is a poster-sized sheet that shows which head does what. There are also great illustrations indicating areas of the body that will benefit from each head. A power adapter and cable completes the package, although aside from the poster and a guarantee leaflet there didn’t seem to be a manual.",
    "The benefit of spending a little more on the HoMedics Pro Physio Massage Gun is self-evident as soon as you start using it. This is a powerful device, which even on its lowest setting delivers solid and uncompromising massage. In fact, if you’re only in need of mild massage it might seem almost too powerful but, with some practice, this turns out to be very beneficial in getting the best from those massage heads. These travel 10mm backwards and forwards during use, so the effects are immediately obvious.",
    "We tried out all of the heads across the range of their massage uses. The Barrel head is good for medium intensity massage covering the IT band, upper back, pecs, calves and forearms. The Ball head can be used with medium intensity for quads, hamstrings, glutes, pecs, deltoids, feet and hands. The Cool Gel head, with its distinctive blue tip, can apply low intensity massage to the IT band, shins and hip flexor. The uncompromising Arrow head is a high intensity option worth trying too, covering hip flexors, traps, forearms, hands and feet.",
    "Anyone fretting about cellulite issues will also get some comfort from the dedicated Cellulite head, which on the medium intensity setting can tackle quads, hamstring muscles, upper arms and glutes.",
    "Naturally you’ll need to use it regularly over time to get the real benefit from this, as is the case with any other issues. However, as the poster also underlines, any of these massage options shouldn't be used instead of proper medical advice.",
    "One of the obvious benefits of the HoMedics Pro Physio Massage Gun over rivals is its ability to deliver heated massage using the dedicated head. However, it’s worth bearing in mind that if you are applying heated massage this will lessen the power range of the battery. Homemedics suggest this slips from around five hours down to three and a half, which during our experience with it seemed to be a pretty accurate estimate.",
    "Nevertheless, the heated mode is very effective. Switch it on and the warmth starts to come through almost immediately and offers a very soothing boost to the otherwise potent massage capabilities of this machine. It is perhaps the main feature that gives The HoMedics Pro Physio Massage Gun an edge over rivals out there.",
    "First reviewed October 2021"
  ],
  "headers": {
    "0": "30-second review",
    "4": "Price and availability",
    "6": "Design",
    "11": "Performance",
    "18": "Don't buy it if"
  },
  "links": {
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FHoMedics-Power-Handheld-Physiotherapy-Massager%2Fdp%2FB08TC9X4J3%2Fref%3Dsr_1_7%3Fadgrpid%3D109867288053%26dchild%3D1%26gclid%3DCjwKCAjw2P-KBhByEiwADBYWCrrLoHm2ynvKsbgBbkuAM1cD3FhDXgCHQZ6EfaD0s_jbJr0g1hAwPxoCeoIQAvD_BwE%26hvadid%3D469191469913%26hvdev%3Dc%26hvlocphy%3D9045717%26hvnetw%3Dg%26hvqmt%3De%26hvrand%3D15466504491291999443%26hvtargid%3Dkwd-950739730781%26hydadcr%3D4878_1796736%26keywords%3Dhomedics%2Bphysio%2Bmassage%2Bgun%26qid%3D1633680443%26sr%3D8-7%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-9356297839615523000-21",
    "HoMedics": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1111345591211369200&xs=1&url=https%3A%2F%2Fwww.homedics.com&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhomedics-pro-physio-massage-gun",
    "Australia": "https://www.homedics.com.au/"
  }
}