{
  "source": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
  "title": "Apple AirPods review",
  "category": "audio-visual",
  "updated": "2021-03-03T14:06:55Z",
  "author": "olivia-tambini",
  "summary": "Are the original Apple AirPods still worth buying?",
  "verdict": "The Apple AirPods are still a perfectly respectable pair of true wireless earbuds – even now that the upgraded AirPods (2019) have replaced them. With decent sound quality and seamless device pairing, all you have to worry about is if they fit your ears and if you can deal with the lack of an in-line remote to control your music.",
  "pros": [
    "Battery life is exceptional",
    "Sound is great",
    "Pairing is quick and easy"
  ],
  "cons": [
    "One-size-fits-all design",
    "No in-line remote",
    "Controversial looks"
  ],
  "article": [
    "Hold up. Before you fall in love with the original 2016 Apple AirPods, it's important to note that these super popular true wireless earbuds were upgraded with the more recent AirPods (2019), and then the even newer AirPods Pro. Plus, the brand has just released the first Apple over-ear headphones, the AirPods Max, and we're hoping for the rumored AirPods Pro Lite and the Apple AirPods 3 in the near future.",
    "This doesn't mean we don't still recommend the original AirPods, though – especially given how much of a discount you can get on the original model these days (if you can still find them, that is).",
    "The Apple AirPods could be your best solution if you're an iPhone owner, with every new model, from the iPhone 7 to the iPhone 11, lacking a 3.5mm headphone jack.",
    "Although we think these wireless earbuds were impressive for their time (and we still recommend them for those on a budget), that doesn't mean they're the best true wireless earbuds you can buy.",
    "One bugbear is that they rely almost entirely on Siri for controlling audio playback, which isn't convenient for many of us – especially if chatting to Apple's voice assistant has never really become second nature to you.",
    "This is why they remind us of Apple’s button-less 3rd generation iPod Shuffle, which relied entirely upon the included headphones’ in-line remote to be controlled at a time when no other headphones included this functionality.",
    "Saying that, there's still plenty to love about the Apple AirPods – read on for our full review.",
    "The AirPods were expensive upon their release on December 12, 2016.",
    "Back then, they cost $159 / £159 / AU$229, which is relatively expensive for a pair of true wireless earbuds – although wireless earbud prices can range from $50 / £50 to well over $200 / £200.",
    "However, since the AirPods (2019) resulted in the discontinuation of the original AirPods, you may find cheap AirPods deals at some retailers – that's even more pertinent now that the AirPods Pro have been released and the world is waiting for the AirPods 3.",
    "Apple has a very distinctive style, and the AirPods, for better or for worse, adhere rigidly to this aesthetic.",
    "In fact, if you’ve used Apple’s wired EarPods (which come as standard with the company’s phones and iPods) then you’re probably familiar with how the AirPods look, since the they're are almost identical, minus any cables.",
    "The biggest difference between the two is the small arm which comes down from the earbud section. The AirPod’s arm is significantly thicker than that of the EarPods to fit the device’s battery and microphone.",
    "This thickness means that the AirPods aren’t as stylish as the classic Apple buds, which is unfortunate given Apple’s history of treading the fine line between technology and fashion.",
    "Sticking with the classic EarPod design also means that the AirPods dispense with modern conveniences like replaceable silicon eartips that secure the earphones firmly in your ears.",
    "Instead, the AirPods rely entirely on their one-size-fits-all plastic housing to keep themselves sat firmly in your ears.",
    "We tried the earphones in a number of the TechRadar team’s ears, and they sat well in each of them. Everyone was able to shake their heads without the AirPods falling out, but none agreed that they felt completely secure.",
    "This was an ongoing theme with the AirPods, which was that although they never physically fell out of our ears, they never felt all that secure either, and we’d think twice before leaving the AirPods in while we ran for the train.",
    "We forgive this when it comes to the standard EarPods, but when there’s no cable to catch the earbud when it falls we think it’s more important for that extra feeling of secureness.",
    "The downside of a lack of silicon is the fact the AirPods don’t feel secure, but the upside is that because they’re not pressing on the insides of your ear, they feel very comfortable over long listening periods.",
    "For all our reservations about the fit and feel of the AirPods, they actually sound pretty good.",
    "The days of weak, tinny sound are over. Listen to a track like Turbowolf’s Nine Lives, and the bass nicely cuts through the track without overwhelming the mid and treble notes.",
    "It means the headphone’s sound has energy and rhythm to it, whether you want to relax with some Slayer, or get pumped up with Enya.",
    "There’s also a good amount of space in the soundstage. Turn on Back to Black by Amy Winehouse, and the layering in the orchestral backing is impressive. Instruments are able to share the soundstage without it feeling overcrowded.",
    "There’s not quite the same crispness or detail across a track as a similarly priced pair of wired headphones, but the AirPods nevertheless provide an impressive listening experience.",
    "The AirPods blow the Lightning-equipped EarPods, the ones bundled with recent iPhones, out of the water in terms of sound quality. The EarPods offer a flat and thin sound experience compared to the AirPods, which is comparatively buzzing with energy.",
    "To be clear, this sort of performance difference is absolutely warranted when the AirPods cost over five times the amount of the EarPods, but it’s reassuring to know all the same.",
    "Connectivity has historically been a bit of a mixed bag with Bluetooth headphones on iPhones.",
    "We’ve found that some will happily connect automatically just by being turned on, while others will require you to dig into your phone’s Bluetooth menu every time.",
    "The AirPods, in contrast, are a dream.",
    "Simply open the AirPods’ case next to your phone, then select the option on your phone screen to pair them.",
    "The AirPods themselves will then happily automatically pair each and every time you put them into your ears, and will automatically disconnect when you take both out.",
    "Of course, Android users have enjoyed the delights of NFC pairing for some time now, and the AirPods don’t quite feel as revolutionary when paired with non-iPhone devices. You’ll have to press the Bluetooth pairing button on the case to get them paired, but after this is done they work almost identically.",
    "It’s fast, it’s simple, and frankly we think this is how all wireless headphones should work.",
    "This convenience also carries across other Apple devices including iPads and the Apple Watch.",
    "Unlike most portable headphones released nowadays, the AirPods don’t include remote controls.",
    "Instead, you’ll rely almost entirely on Siri (activated by a quick double-tap on either bud) to adjust volume and skip tracks, in addition to performing a number of other voice-activated functions.",
    "We say ‘almost’ because taking a single AirPod out of one of your ears will automatically pause whatever you’re listening to.",
    "This pause functionality is excellent, but we wish the AirPods had just a couple of buttons to handle other common music playback tasks.",
    "Having to double tap one of the earbuds just to skip a track or raise the volume never feels as quick or easy as using a simple in-line remote, and worse still, feels embarrassing in public, which is where you’re likely to spend the most amount of time listening to these headphones.",
    "The AirPods are small and convenient due to the way they pair quickly and easily with your phone, but it’s unfortunate that you feel the need to take your phone out of your pocket to perform most controls if you don’t want to look like you’re talking to yourself on the bus.",
    "Outside of music controls, Siri works very well. We were able to use voice-dialing to make calls, which were nicely audible to the person we were speaking to, and Siri felt just as accurate as using it on the phone itself – which is to say it’s good, but isn’t the best voice-assistant out there.",
    "The long stems protruding from the bottom of each earbud might be bulky, but the plus side of that bulk is that the AirPods’ battery life is really great.",
    "Apple’s claim of five hours battery life from the AirPods appeared to be completely accurate in our tests, and even better was the amount of time it took to recharge them using the charging case, meaning that charge was never far away whenever it did dip low.",
    "This convenience is only going to improve in the future with the rumored addition of a wireless charging case that will allow you to charge your AirPods wirelessly.",
    "The current charging case is an excellent work of design. You charge the case up via its Lightning port, and once fully charged the case holds enough power to fully charge your AirPods over four times.",
    "A small LED underneath the charging case’s lid glows red or green to indicate the AirPods’ charge status, and you can open the lid near a paired phone to see the relative charge levels of both pop up on the screen.",
    "In short, the battery life of the AirPods is great, and much better than the competition. It’s just a shame that they’ve had to be made so big to accommodate the battery.",
    "The pairing process is a breeze, and we were very happy with the way the AirPods were able to automatically pair without having to delve into a Bluetooth settings menu. We wish other Bluetooth headphones were this easy to pair with Apple devices.",
    "Sound quality is the best we’ve ever heard from an Apple-branded pair of headphones.",
    "The built-in microphones pick up your voice loud and clear, and are as good as the phone for using Siri.",
    "The AirPods’ single biggest problem is an over-reliance on Siri to control music playback, and though Siri has gotten much more capable over the years, it’s hard to argue that it’s the ideal means of controlling music on the go, which is where you’re likely to spend the most time listening to their ultra-portable pair of earphones. It’s just not responsive enough to use reliably.",
    "We’ve grown to love having an in-line remote with our headphones, and having to constantly pull out our phone to skip to the next track feels like a step backwards.",
    "We’d also like to have seen a silicon eartip which we could switch out to find the best fit for our ears. The hard plastic just doesn’t feel secure enough. The AirPods are also bulkier than we’d like, and don’t feel fashionable in the way Apple’s products have in the past.",
    "There’s a lot about the AirPods that we like. They sound great, their battery life and charging speeds run laps around the competition, and it’s hard to overstate just how seamless the pairing process is.",
    "But ultimately the AirPods end up disappointing because other Bluetooth earphones allow you to control your music more quickly, and more easily. Siri is no match for a dedicated in-line remote, and it feels counter-productive having to constantly take your phone out of your pocket to control music.",
    "There’s no getting away from the fact that these are an expensive pair of headphones, and for that kind of money we think that you can find better products elsewhere.",
    "Original review by Jon Porter."
  ],
  "headers": {
    "7": "Price and release date",
    "10": "Design and comfort",
    "20": "Sound quality",
    "27": "Connectivity",
    "35": "Siri controls",
    "42": "Battery life",
    "48": "We liked",
    "51": "We disliked",
    "54": "Final verdict",
    "58": "Need an alternative?"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "AirPods (2019)": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "AirPods Pro Lite": "https://www.techradar.com/news/airpods-pro-lite-true-wireless-earbuds-may-be-on-the-way-this-year",
    "Apple AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "iPhone 7": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-7-1327947/review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "cheap AirPods deals": "https://www.techradar.com/news/cheapest-airpods-prices",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Apple Watch": "https://www.techradar.com/reviews/wearables/apple-watch-1264567/review",
    "a wireless charging case": "https://www.techradar.com/news/brand-new-airpods-wireless-charging-case-discovered-in-ios-12-beta-images",
    "Bluetooth earphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}