{
  "source": "https://www.techradar.com/reviews/apptivo-crm-review",
  "title": "Apptivo CRM review",
  "category": "computing",
  "updated": "2021-11-08T17:16:36Z",
  "author": "annmarie-mcqueen",
  "summary": "A scalable CRM that will grow with your business",
  "verdict": "Apptivo is a scalable CRM solution that grows with your business, offering a customizable platform and advanced features for a low price.",
  "pros": [
    "Cost-effective price plans",
    "Scalable and customizable app structure",
    "Highly responsive customer support",
    "Intuitive and customizable interface"
  ],
  "cons": [
    "Initial set-up may be challenging",
    "Very limited free starter plan",
    "Could have more third-party integrations"
  ],
  "article": [
    "Apptivo is cloud-based software consisting of a series of apps designed to help businesses thrive, including a customer relationship management (CRM) platform.",
    "With its intuitive interface and scalable functionality, Apptivo is a good option for small- to medium-sized businesses looking to grow, with enough advanced features to appeal to larger enterprises. In this Apptivo review, we evaluate how this CRM compares with some of the best CRM software on the market.",
    "Apptivo offers a scalable CRM platform that will grow with your business, enabling you to build a CRM solution that suits your specific business needs. Apptivo’s unique app structure is its key strength, as it gives the platform a level of customization and scalability that makes it relevant to SMBs as well as enterprises.",
    "Whether you’re looking for a feature-rich CRM with project management tools, a marketing suite, or finance tools, Apptivo’s apps can cover it. Compared to competitors Insightly and Zoho, Apptivo also works out as more cost effective, although its free starter plan is weaker than those of other offerings. It also boasts excellent customer service",
    "With all of the essential CRM features you might need on a daily basis at a low price, Apptivo is certainly worth considering if you’re in the market for a versatile CRM platform to help your sales team thrive.",
    "Score: 4.5/5",
    "Read on for the full review.",
    "Apptivo boasts an easy-to-use, intuitive interface that makes it an attractive CRM solution, giving you the option to customize the main navigation menu and page layouts to your liking. The CRM has a unique structure, consisting of a series of apps that bundle together related tools, with more expensive price plans giving you access to a larger number of apps.",
    "The apps cover everything from lead management to project management to invoicing. Apptivo's starter plan gives you access to eight CRM apps, while the enterprise plan offers access to 65 apps that go beyond standard CRM functionality to include marketing, HR, finance, and supply chain features.",
    "The main benefit of Apptivo's unique app structure is that it makes the CRM incredibly customizable and scalable for growing companies, especially those looking to coordinate different areas of the business through one system. However, the sheer breadth of customization on offer may also be overwhelming for some, as the initial setup can be challenging and time-consuming.",
    "Apptivo: Key features and highlights",
    "Alongside the Apptivo apps, there are over 40 integrations with third-party apps available, including Google Workspace, Office 365, and Slack. The Google account integration is particularly useful, as it enables automatic syncing of contacts, tasks, calendar appointments, and documents between the two systems.",
    "Despite this, the range of Apptivo's third-party integrations is lacking in comparison to competitors such as Insightly, which offers over 250 third-party integrations.",
    "In terms of CRM functionality, Apptivo offers a robust CRM platform with advanced functionality in lead and opportunity management. The system supports multiple sales pipelines, custom reports and dashboards, automated workflows, product catalogs, mass emailing, and more.",
    "There are also various ways to capture new leads, from inputting them into the system manually to bulk importing contacts. You can also embed a lead capture form on your website or automatically create leads when people email to a specific object.",
    "Another key advantage of Apptivo is its mobile app, which enables you to manage your contacts, opportunities, tasks, and projects from your phone.",
    "Apptivo releases new updates on a weekly basis, and publishes detailed explanations of these updates in regular blog posts. Most of these changes involve small improvements to Apptivo apps, offering additional customization options and useful new features.",
    "One of the recent features that has been added is a de-duplication function that prevents you from importing duplicate records. There's also a new automated schedule report feature that enables you to automatically send scheduled reports to recipients via email.",
    "As well as adding new features, Apptivo is continuing to grow its range of third-party integrations and extend the functionality of existing integrations. In a recent update, Apptivo announced an extension to its Quickbooks online integration to enable enhanced syncing.",
    "Apptivo offers a free starter plan, and four paid price plans ranging from Lite (the basic plan) to Enterprise (most advanced). Plans can be billed monthly or annually, with a 20% saving on annual billing. All prices shown in the table below are per user.",
    "Compared to key competitors such as Insightly and Zoho, Apptivo is a very cost-effective CRM solution, and is excellent value for money. However, you should be aware that the free starter plan is very limited, and does not include most essential CRM features. For a fully functional CRM, we recommend choosing a paid plan.",
    "To effectively evaluate Apptivo against its competitors, we tested some of the CRM’s key features and selling points from the perspective of a new user. An intuitive interface and responsive customer support can make a big difference when you’re considering which CRM is right for your business.",
    "Apptivo offers a relatively user-friendly experience, with most features categorized under two main navigation menus. Although it may take some time for beginners to learn where everything is, when you’re familiar with the interface it’s generally pleasant and easy to use.",
    "Once logged in, you start off on your agenda page, which works similarly to an Outlook calendar and shows you all of your upcoming tasks and appointments. You can switch between different views to see only upcoming tasks or only overdue tasks.",
    "Along the side navigation are several project management tabs to help you manage your workload, such as tasks, emails, notes, follow-ups, work queue, and news feed. The top navigation is where all of your apps are organized into their relevant functions: CRM, marketing, financials, etc. This menu will look different depending on which apps you’ve installed. Here, you can delve into the CRM functions and add new records with relative ease.",
    "While some functions, such as reports and dashboards, may be a little harder to find, the great thing about Apptivo is that the interface is very customizable. Although this process of customizing apps and layout may be initially challenging, it does reap rewards later on, as it means being able to personalize this CRM to suit your needs.",
    "Apptivo’s web-based CRM system also boasts fast page-load speeds. When tested on Google PageSpeed Insights, it achieved a score of 91 out of 100 for desktop, which is considered excellent. This test was conducted on a MacBook Air with a 1.6GHz Intel Core i5 processor and an internet speed of 33Mbps.",
    "As well as a comprehensive knowledge base, Apptivo offers 24/7 customer support on all paid plans through email and live chat. In addition, it offers live phone support on weekdays.",
    "To test the responsiveness of Apptivo's customer support, we engaged with the live chat, asking a few simple questions about the interface. We received instant replies from a knowledgeable and friendly support rep, who gave clear answers and directed us to further resources on the knowledge hub.",
    "Overall, Apptivo offers an excellent level of customer support.",
    "Apptivo’s paid plans prove tough to beat in terms of value for money. While competitor Insightly offers fantastic project management tools and an impressive range of third-party integrations, it comes at a steep price, with fewer CRM features on the basic plan.",
    "That said, Apptivo boasts superior opportunity and pipeline management, and is well known for its exceptional reporting. This makes it great for larger pipelines, where advanced analytics can bring good insights.",
    "Zoho CRM is another close competitor, and is a match for Apptivo in terms of customizability. However, it offers fewer project management tools in comparison to both Insightly and Apptivo, and is more expensive than the latter.",
    "Where Zoho stands out from Apptivo is its starter plan. While Apptivo’s free offering is limited to lead and contact management, Zoho offers these features plus deal management, workflows, reporting, and more.",
    "Overall, Apptivo is a strong contender in the CRM market, both for SMBs and enterprises. Compared to its competition, it’s highly cost effective, and offers a comprehensive set of advanced features for its price, including mass emailing, workflow automation, multiple sales pipelines, and custom dashboards.",
    "It also offers a great user experience, with an intuitive and customizable interface, although the initial setup may be challenging due to the breadth of customization options.",
    "Apptivo’s unique app structure makes the platform scalable and customizable for larger organizations, enabling you to build a CRM that suits your business needs exactly. Project management tools, invoicing features, and marketing functions can all be added with an Apptivo app.",
    "Though it would be nice to see Apptivo offer more third-party integrations, it seems that the company is very proactive about updates, and these are likely in the works.",
    "Finally, compared to many of its competitors, Apptivo offers some of the best customer support we’ve encountered, with a live chat option that enable you to speak to a support rep 24/7.",
    "For all of these reasons, we recommend Apptivo as a versatile all-in-one CRM solution that will grow with your business and foster collaboration to close deals more effectively.",
    "If you’re in the market for CRM software, check out our guides to the best free CRM software, the best CRM for real estate, and the best CRM for small business. Want to learn more about CRMs? Check out our features asking what is a CRM, and what is a CRM in real estate?"
  ],
  "headers": {
    "2": "Apptivo review: Snapshot",
    "7": "Apptivo: Key features",
    "16": "Apptivo: What’s new?",
    "19": "Apptivo: Pricing",
    "21": "Testing Apptivo",
    "22": "Is Apptivo easy to use?",
    "27": "How responsive is Apptivo's customer service?",
    "30": "Alternatives to Apptivo",
    "34": "Apptivo: Final verdict",
    "40": "Further reading on CRM software"
  },
  "links": {
    "Apptivo": "https://www.apptivo.com/",
    "best CRM software": "https://www.techradar.com/best/the-best-crm-software",
    "Insightly": "https://www.techradar.com/reviews/insightly-crm-review",
    "Zoho": "https://www.zoho.com/crm",
    "four paid price plans": "https://www.apptivo.com/app-pricing/",
    "Zoho CRM": "https://www.techradar.com/reviews/zoho-crm-review",
    "best free CRM software": "https://www.techradar.com/best/best-free-crm-software",
    "best CRM for real estate": "https://www.techradar.com/best/the-best-crm-for-real-estate",
    "best CRM for small business": "https://www.techradar.com/best/best-crm-for-small-business",
    "what is a CRM": "https://www.techradar.com/features/what-is-crm-software",
    "what is a CRM in real estate?": "https://www.techradar.com/features/what-is-a-crm-in-real-estate"
  }
}