{
  "source": "https://www.techradar.com/reviews/atari-vcs",
  "title": "Atari VCS review",
  "category": "gaming",
  "updated": "2021-07-26T11:40:37Z",
  "author": "shaun-prescott",
  "summary": "Atari re-enters the console race, but retro fanatics only need apply",
  "verdict": "It would require an outsized affection for the Atari brand to justify buying the Atari VCS. Sure, it looks great and does what it advertises, but the Atari VCS fails as a real contender in the console race, and isn't a great value proposition as a home PC. But, if you're fanatical about Atari and price is no object, it's a curioso you might want to invest in anyway.",
  "pros": [
    "An AMD PC disguised as an Atari",
    "Antstream Arcade is great",
    "Stream Netflix, Disney+ and more",
    "An Atari nostalgia-fest"
  ],
  "cons": [
    "Struggles with some games",
    "UI is cumbersome",
    "Limited apps",
    "Poor value proposition"
  ],
  "article": [
    "The Atari VCS is a PC/console hybrid that comes pre-loaded with a ton of classic Atari games, its own storefront, 4K content streaming, and the ability to boot into Windows or another operating system from an external drive. It does what it sets out to do – as a retro machine with a strong focus on Atari emulation, it ticks boxes adequately, and with the addition of the Antstream Arcade app – still missing on Xbox Series X and PS5– there's every possibility that retro game fanatics of a certain vintage will have a good time with the VCS.",
    "Aside from some critical user-experience hiccups, such as the inability to multitask in the device's bespoke user interface, the Atari VCS does mostly what it promises. The value proposition is a struggle though: by way of comparison, the VCS console with controllers bundled-in costs the same as the base model Valve's newly announced Steam Deck in the United States ($399.99), which promises compatibility with the vast majority of existing PC games, as well as the ability to boot into any operating system you like with all the emulation opportunities that entails.",
    "As a desktop gaming PC, the Atari VCS can run undemanding indie games no problem via Windows 10 and Steam, or the Epic Games Store, but most modern blockbuster games can be ruled out if you're looking for stable frame rates. If you're especially fond of Atari's logo – and plenty of retro fans are – you could feasibly buy the VCS as a desktop productivity PC that can play some Windows 10 games, and doubles as a modern Atari console.",
    "And that's the thing: If you're not extremely fond of the Atari branding, and if you're not too fussed about booting into Windows or Linux and just want a device for gaming, you're better off sticking with a Sony or Microsoft console, either last-gen or current-gen. Better still, Valve's Steam Deck betters most of the Atari VCS's strengths as a platform you can open up and tinker with.",
    "The Atari VCS is available now in the US, Australia and select other regions – although not the UK.",
    "It costs $399.99 / AU$849.95 for the all-in-one bundle featuring an Atari VCS 'Modern Controller' and Classic Joystick, or $299.99 / AU$699.95 for the base model without any included controllers. The latter isn't a bad option, as other modern controllers like the Xbox Wireless Controller and Sony's DualShock 4 will work fine when paired to the VCS.",
    "In terms of what the Atari VCS has going for it, its appearance is among its chief attractions. We tested the Black Walnut edition – a ribbed all-black affair except for its front panel, which is decked in a wooden veneer similar to older models of the Atari 2600. There's also an all-black Onyx version of the VCS that lacks a bit of retro flair but is functional enough.",
    "The unit itself is 29cm wide, 15cm deep and about 5cm thick. Because it somewhat mimics the sloping shape of the 1986 '2600 Jr' model, the VCS is slightly thinner at the front: 3.5cm. It's small – in other words: smaller than an Xbox Series S.",
    "In terms of connectivity, there are four USB ports in total, with two on the front and two on the back of the machine. There are also Ethernet and HDMI ports, but only one of the latter. Two fan grates sit on the back of the unit, and these tend to run extremely loud, most notably when used in PC mode.",
    "The Atari VCS is marketed as a gaming console, but it's also a mini-PC. And while its strengths as a console are vastly inferior to anything offered by Microsoft, Sony or Nintendo, there are some merits to using this as a PC.",
    "Let's start with the console experience though, which will largely depend on the user's fondness for both first-party Atari classics and retro gaming in general. The console's home menu is a grid affair, displaying in seemingly no particular order the unit's installed apps. Our review unit had a range of apps pre-installed, and the order of the apps displayed would always shift around, though never according to the most recently accessed or installed. It's bizarre.",
    "But these quibbles aside, retro gamers who enjoy a certain vintage will have some fun here. In addition to the Atari VCS Vault compilations, the unit also has an Antstream Arcade app – arguably one of the biggest (albeit negligible to most) advantages it has over the bigger consoles. This is a streaming service offering a huge range of games from platforms including the Commodore 64, Amiga, Sega and more, in addition to a trove of Atari 2600 games not available in the VCS Vault collections. It's a genuine joy to browse, though you could easily access it on PC, or an Amazon Fire Stick if you've got one. The Atari VCS Vault games are already available on Steam for $10 / £7 / AU$14.50, while the VCS Vault 2 list can be purchased as DLC on Steam for half that price.",
    "Aside from these retro offerings, the selection of games available on Atari's dashboard store is meager. There are some good titles there, including Mutazione, but the vast majority are extremely far from system sellers, let alone appetizing as quick palette cleansers. Sure, the idea is that this library will grow, but it doesn't seem likely to grow very much, and the selection as of early July 2021 doesn't fill us with confidence. There are modern retro-aping platformers (Sir Lovealot, available on Steam), schumps (ThrustLander, coming to Steam in November) and experimental games (SuperMash, available on Steam), but very little that will appeal to modern sensibilities.",
    "The app selection is pretty good for a TV-centric device: Netflix, Disney Plus, YouTube, Amazon Prime Video and Twitch are all there ready and raring, as are Plex, Discord and Apple TV Plus. Still, even if you don't have a smart TV, you probably already own a device that can throw these apps to a bigger screen.",
    "Also: if you do want to use some of these apps, most notably Disney Plus and Netflix, you're going to need to use the Atari VCS Companion app, or else a keyboard and mouse to sign-in, because you can't do it with an attached controller. The VCS Companion app isn't bad, but it's a little tedious to have to reach for a different device for such trifling tasks. Add to that the fact that you can't access the VCS home dashboard without completely closing the app or game you're in, and the unit's console credentials are diminished considerably.",
    "The unit's internal storage is a mere 32GB of eMMC storage, but that's not actually a huge problem given the tiny size of the apps available, at the time of writing, and the fact that booting into PC Mode requires an external drive anyhow.",
    "The Atari VCS lets you boot into Windows 10 or any other ‘signed’ (aka supported by the hardware) operating system via its PC mode. If you want to use this as a Windows 10 machine, you'll need to buy Windows 10 separately, but once you do, it's a decent productivity machine that can also play the vast majority of low-demand indie games available on Steam or the Epic Games Store.",
    "But don't buy it expecting to play anything more demanding at comfortable resolutions or framerates. We booted Rocket League and even with all graphics settings set to 'Performance' (as opposed to 'Quality' or 'High Quality'), the game didn't run perfectly. Frame rates were above 30 and the game is playable, but it's not optimum: you'll get much better performance on the last generation of consoles. But titles like Super Meat Boy, Among Us and Celeste, among troves of other similarly undemanding games, run fine.",
    "The question really is: why would you? These games also run fine on a laptop without a dedicated graphics card. It's possible to get the likes of Grand Theft Auto 5 and Fortnite running on the Atari VCS in PC mode, but it's definitely not the best way to play, and there are better and cheaper alternatives.",
    "As for what it's actually rocking, the VCS has an AMD Raven Ridge 2 APU, an AMD Ryzen GPU and 8GB DDR4 RAM which is upgradeable.",
    "As mentioned above, it's possible to buy the Atari VCS box as a standalone, but it can also be purchased with a modern Atari controller, which mimics the layout of the Xbox or DualShock controller, and a joystick controller.",
    "Thanks to its relative uniqueness, the Atari VCS Classic Joystick can't really be faulted, and it feels natural to use one while playing games like Centipede or Secret Quest. It's also a lot more responsive and elegant than Atari joysticks of old. It's obviously a very limited affair, and you'll probably put it aside once the nostalgia rush has subsided, but it betters its forebear and does what it advertises.",
    "The Atari VCS Wireless Modern Controller is an entirely different thing. It just can't hope to compete with the Xbox or DualShock / DualSense controllers. It feels light and cheap in the hand, like many third-party console controllers. The design is perfectly sound, and the branding is there for retro lovers, but if you're in the market for a VCS you might consider using another controller you already have in the house. Both Atari controllers have Bluetooth and wired capability."
  ],
  "headers": {
    "0": "One-minute review",
    "23": "Don't buy it if..."
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Xbox Wireless Controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "DualShock 4": "https://www.techradar.com/reviews/gaming/games-consoles/controllers/dualshock-4-controller-1157615/review",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review"
  }
}