{
  "source": "https://www.techradar.com/reviews/specialized-turbo-creo-sl-expert",
  "title": "Specialized Turbo Creo SL Expert review",
  "category": "fitness",
  "updated": "2021-03-17T11:39:22.961Z",
  "author": "rob-clymo",
  "summary": "Eat up the miles in style with this premium electric road bike",
  "verdict": "If you’re serious about your cycling, and you’ll need to be given its cost, the Specialized Turbo Creo SL Expert e-road bike is a seriously tempting prospect. It’s fast, lightweight and agile with the benefit of a battery and electric motor combination that delivers dynamic assistance when, and if you need it. Riding this bike without using its power pack is a treat, but when you’ve got the assistance deployed the Specialized Turbo Creo SL Expert is a two-wheeler that eats up the miles without leaving you broken as a result. This isn’t a cheater’s machine; it’s a godsend.",
  "pros": [
    "A striking design",
    "Performance to match the looks",
    "Quality components throughout"
  ],
  "cons": [
    "Unforgiving ride",
    "Some motor noise",
    "A sizeable investment"
  ],
  "article": [
    "The Specialized Creo SL Expert is a ride-like-the-wind performance bike that’s made even better with the addition of a battery and motor combination integrated into the stunning design. It’s the sort of electric bike that could even persuade cycling purists that having power assist is a good thing, while the obvious appeal is for riders who want, or indeed need a boost from time to time.",
    "The e-bike boasts a lightest in its class rating and comes with all of the trimmings we expect from the Specialized brand, including flamboyant styling, beautiful build quality and a choice of components that help to deliver the goods in terms of performance.",
    "The writing on the frame tells you all you need to know in terms of what to expect: California design; Swiss engineered; handmade in Taiwan. Despite its high price the Specialized Creo SL Expert justifies every penny by rolling everything into one hot-to-trot package. It’s an e-bike with a design that gives you proper oomph, although the slightly invasive motor noise turns heads as much as the bright red frame does.",
    "Specialized Turbo Creo SL Expert was released in July 2019. The launch price was £7,500 (about $10,500 / AU$13,500).",
    "Like other models from the Specialized stable the Turbo Creo SL Expert is certainly distinctive. Opening the box that contained our test model we were greeted with a dazzling red finish, complemented by white Specialized logos and supplemented by plenty of black flourishes.",
    "The styling definitely attracts attention, but the design is also practical featuring a range of materials and component parts that come together to make this a true performance bike. Central to this is the Fact 11r carbon frame, which features a Specialized SL1-320 battery that unsurprisingly offers 320Wh of power that’s integrated into the down tube. There’s integral wiring too, which means most of the cables are tucked away inside the frame, only making an appearance when they’re needed to connect to one of the components.",
    "And what a collection of components they are: 46T chainrings, Shimano Deore XT Di2 Shadow Plus, 11-speed rear derailleur, Shimano Ultegra Di2 Disc R8070 shift levers, Praxis Alloy Cranks and a Shimano XT, 11-speed, 11-42t cassette.",
    "Meanwhile, Shimano Ultegra hydraulic discs front and rear provide the stopping power. Striking carbon wheels from Roval and Specialized Turbo Pro tyres further compliment the performance stance nicely.",
    "The riding position is tempered nicely too, with Specialized’s alloy Hover Expert 125mm drops wrapped in suitably grippy Supacaz Super Sticky Kush tape augmented by a Body Geometry Power Expert saddle. In fact, everywhere you look on this bike the choice of components is impressive, which is reassuring given its lofty price tag.",
    "Rounding it all out is Specialized’s own SL 1.1 motor that dominates the bottom of the frame. It’ll probably be the first thing that gives the game away when cycling purist’s spot you overtaking them with ease. The bike arrives minus pedals out of the box, allowing riders to make their own choices on that front.",
    "Special mention should also be made of the forks, which come with the added bonus of the Future Shock 2.0 damper system. It’s similar to that used on another Specialized model we’ve looked at, the Specialized Turbo Vado SL though the newer edition feature a knob on the top of the stem that provides precision tweaking should you need it. There’s a supplied charging kit and cables inside the box too, which connects to the bike via a port, hidden by a flip-up plastic cover that sits above the motor.",
    "We were big fans of the Specialized Turbo Vado SL when we tested it a while back. That’s a different kind of bike to the Turbo Creo SL but there are similarities, especially when it comes to the powertrain. In fact, the battery and motor arrangement delivers an assisted experience that’s just as impressive, but in the case of the Turbo Creo SL you’ve got a road bike that really lets you tap into the benefits of having electric power.",
    "Controlling the three core power functions is done via the same module on the top of the frame as found on the Turbo Vado SL. Press the button, wait for the purple power bars to illuminate and you’re in business. Fizzy fun levels are immediately dispensed as you push off down the road.",
    "The great thing about the Specialized engineering is that power is delivered really dynamically. You know you’re getting help, but it also feels like you’re involved as opposed to some e-bikes that tend to make you feel like a passenger. Perhaps that’s more to do with the design of the Turbo Creo SL, which once you get into your stride allows you to eat up the miles. It handles like a dream, which is even more remarkable when you consider there’s a battery and motor combination incorporated into the frame you’re perched on.",
    "Specialized claims you can get up to 80 miles from the battery though it offers an optional range extender that adds another 40 miles to the figure. We found the battery pretty resilient during our experiences with it, although you could tell that it was always glad of a refresh judging by the diminishing light in the purple power bars we got each time it was used.",
    "Those forks, incidentally, do offer some respite from bumps in the road but the performance wheels and tyres don’t make for a magic carpet ride. Get yourself onto a decent surface though and it’s another story.",
    "Indeed, if you’re angling for performance, which you will be with the Turbo Creo SL then it’s a good idea to arm yourself with the Mission Control App. Specialized has done a fine job with this software that lets you to squeeze all the best bits out of the technical setup while also monitoring your own performance too.",
    "That said, the bike works just as well without it. Despite their puny size those brake rotors, by the way, are fantastic while changing gear is fast, fluid and instant. Add everything together and the package provides great all-round performance.",
    "First reviewed March 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and release date",
    "4": "Design",
    "11": "Performance",
    "19": "Don't buy it if"
  },
  "links": {
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "Specialized Turbo Vado SL": "https://www.techradar.com/reviews/specialized-turbo-vado-sl"
  }
}