{
  "source": "https://www.techradar.com/reviews/11-mywebsite-basic",
  "title": "1&1 IONOS MyWebsite website builder review",
  "category": "computing",
  "updated": "2021-06-13T23:32:11.559Z",
  "author": "mike-williams",
  "summary": "Build professional websites at speed – no experience required",
  "verdict": "The prices can be high, but MyWebsite's excellent editor and professional features won us over. Demanding users should give it a try.",
  "pros": [
    "Powerful editor",
    "Customizable templates",
    "Useful widgets"
  ],
  "cons": [
    "No free option",
    "Higher prices"
  ],
  "article": [
    "1&1 MyWebsite is a drag-and-drop website builder from German web hosting giant 1&1 IONOS. MyWebsite's Starter plan covers the basics for personal sites. You get unlimited pages and web space, a simple built-in blog, limited SEO settings and website backup and restore.",
    "After registering and handing hover your credit card details, you get to choose your domain (it’s included in the price for the first year, and as with all other services of this type, is not part of the money back guarantee).",
    "The first month is heavily discounted for all of IONOS’ plans. There are three available, each with an option for an online store at an additional cost. All plans are payable 12 months in advance.",
    "The cheapest is called ‘Starter’ at $5 per month (first month is $1, and adding an online store bumps the price to $12 for all subsequent months). It includes your domain name, as well as email. It’s designed with speed in mind, letting you use and customise templates so your business can be online rapidly.",
    "Next is ‘Plus’ at $10 per month (first month is $5, and adding a store increases the price of other months to $20). It offers more customisation tools than ‘Starter’, allows you to edit HTML and CSS, adds support for multilingual sites, and lets you include video backgrounds and animations.",
    "Finally we have ‘Pro’ at $15 per month (first month is $10, and adding a store increases the initial price to $25 and the full price to $35). The main addition is targeted content delivery and personalisation.",
    "The interface is straightforward, and you're able to choose from hundreds of responsive templates. These are grouped by topics or you can search the collection by keyword, and most of our test searches returned plenty of good-looking designs.",
    "If you’d rather start from scratch, you can select a blank template instead. You still get all the core layouts, but no graphics. These could make it easier to create your own vision, as you're no longer distracted by the big photo of a dog, or a skier, or a pizza, or whatever else is plastered over the front page of a regular template.",
    "Click a template thumbnail and you're able to view larger images of the desktop, tablet and mobile views of the sites. Unfortunately, and unlike most of the competition, there doesn’t appear to be an option to preview the template as an active site in your browser.",
    "Depending on the plan you choose, you have two different editors at your disposal, called Now and Creator. Now is designed to make everything easy and fast, with limited options to get you up and running quickly. It looks simple and clean, and you can create something that looks pretty good in next to no time.",
    "If you want more control though, you need to go with a plan that offers Creator. It has a very professional look and feel. A preview of your website enables clicking and editing images, text and more. A toolbar allows for the addition of content, changing layout options and customising site-level settings. You have options to choose the page you want to work on, set a view type (desktop, tablet, mobile), undo the current action, preview the site and publish it when you're finished.",
    "There are many features that we liked, like the ability to add your own images, or stock images, if you prefer. There are also many tools available for image editing which is not a feature that is present in most website creator services, and is most welcome - it prevents you from having to take a detour in an image editing app, keeping you on the site you’re creating and helping you stay focused.",
    "We found a good amount of useful and well-designed context-sensitive menus. This included standard options to replace the image, customise its layout, change alignment or copy the image to the clipboard. An animation tool enables the addition of custom animations, such as fading the image in from the left, or bouncing it in from the right. We were able to selectively hide the object on desktops, tablets or mobile devices, a hugely powerful feature. Experts can even edit the object's HTML and CSS, giving detailed low-level control over functionality.",
    "This might feel overwhelming for less experienced users, but you don’t have to use this functionality if you don’t want to, and there are many features available, from the basics like editing, adding and removing links, to changing format, customising style (borders, shadows, rounded corners) and add a range of hover effects, without ever needing to see a single line of code.",
    "One feature that makes the 1&1 IONOS builder stand out is the blogging tool. It comes with a simple blogging platform which can be added to your site in seconds. Unusually, this doesn't force you to start with a blank template. If you have an existing blog, point IONOS at its RSS feed and it can import your posts, images and Disqus comments, ideal for ensuring a smooth migration from your previous host. There’s a lot of different website builders out there (Webs.com, RIVYT, Odoo, and DreamHost). But not all website builders have blogging tools with multiple features.",
    "It's a little more expensive than some, but IONOS's appealing templates, well-designed editor and powerful bonus features enable anyone to build feature-packed and professional websites.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Interface",
    "9": "Features",
    "14": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "1&1 MyWebsite": "https://acn.ionos.com/aff_c?offer_id=1&aff_id=1007&aff_click_id=trd-us-1420231113129498600&url_id=2",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Starter": "https://acn.ionos.com/aff_c?offer_id=1&aff_id=1007&aff_click_id=trd-us-5399776107034953000&url_id=2",
    "Plus": "https://acn.ionos.com/aff_c?offer_id=1&aff_id=1007&aff_click_id=trd-us-1167036739426990300&url_id=2",
    "Pro": "https://acn.ionos.com/aff_c?offer_id=1&aff_id=1007&aff_click_id=trd-us-1125122067729278300&url_id=2",
    "Webs.com": "https://www.techradar.com/reviews/webscom",
    "RIVYT": "https://www.techradar.com/reviews/rivyt",
    "Odoo": "https://www.techradar.com/reviews/odoo-website-builder",
    "DreamHost": "https://www.techradar.com/reviews/dreamhost-website-builder"
  }
}