{
  "source": "https://www.techradar.com/reviews/google-pixel-5a-review",
  "title": "Google Pixel 5a review",
  "category": "phones",
  "updated": "2021-08-17T17:15:38.602Z",
  "author": "david-lumb",
  "summary": "Few improvements but still a solid mid-range camera phone",
  "verdict": "The Google Pixel 5a isn’t much different than its predecessor aside from a bigger battery and a rating for water and dust resistance, making it an underwhelming upgrade, but still a solid mid-range phone with fantastic cameras. If you don't mind going without the Pixel 5's zoom camera, it’s a good if unexciting choice.",
  "pros": [
    "Great cameras and software",
    "Good specs for the price",
    "Big battery"
  ],
  "cons": [
    "Few improvements over predecessor",
    "No zoom camera",
    "Low-powered in-box battery charger"
  ],
  "article": [
    "The Google Pixel 5a is finally here, and it’s… a lot like the Google Pixel 4a 5G that came before it, in both looks and internal specs. There are a few upgrades this time around, but it feels like the slightest refresh of last year’s model.",
    "At least the Pixel 5a’s price hasn’t gone up from the 4a 5G, and for owners of last year’s Google Pixel 4a (without 5G) – and even more so if you have an older Pixel phone – there’s plenty of reason to pick up the new Pixel 5a. It’s a great mid-range phone at a reasonable price.",
    "The Pixel 5a has the same Snapdragon 765G chipset, 6GB RAM and 128GB storage as the Pixel 4a 5G, so there’s no advancement in its specs. The Pixel 5a also has the same cameras as its predecessor: a 12MP main camera and 16MP ultra-wide shooter on the rear, along with an 8MP front-facing camera.",
    "What’s different? The battery, for one: the power pack in the Pixel 5a has more capacity (4,680mAh) than the one in the Pixel 4a (3,140mAh) or the Pixel 4a 5G (4,080mAh). The phone is also slightly bigger, with a 6.34-inch Full HD Plus OLED display (compared to the 4a 5G’s 6.2-inch screen), and – in a first for Google’s cheaper ‘a’-series phones – it has a dust and water-resistant rating (IP67, so your phone will be safe submerged up to one meter of water for 30 minutes).",
    "In short, then, the phone brings few improvements over its predecessor, but it’s still one of the best mid-range devices you can buy. It’s unlikely to impress anyone who’s looking for true innovation, but it’s probable that Google is keeping back the big upgrades for the Tensor chipset-powered Google Pixel 6 coming later this year.",
    "The Google Pixel 5a launched on August 17, 2021 and is available for preorder now, while the Google Pixel 5a release date will be August 26 in the US and Japan. There is currently no reason to think this phone will come to the UK or Australia.",
    "The phone comes in a single configuration – 6GB RAM and 128GB of storage – and costs $449 (around £325 / AU$610).",
    "That’s actually a bit cheaper than the Google Pixel 4a 5G’s price of $499 / £499 / AU$799. And given that we’re hearing rumors that the Google Pixel 6 will be a more premium phone, you may not get the company’s next flagship for as cheap a price as the Google Pixel 5’s $699 / £599 / AU$999 – meaning the Pixel 5a may pale in comparison when it launches.",
    "The Pixel 5a comes in a single color: Mostly Black, with ‘forest green undertones’ as the promotional material describes it – and that’s a pretty accurate description, with the green hues only coming out under certain light.",
    "If you’re thinking the Google Pixel 5a’s design hasn’t changed from the Google Pixel 4a, you’d be mostly right. The new phone looks nearly identical to the old; technically, it’s slightly taller and slightly narrower and slightly thicker, but nobody would be able to tell the difference between the models aside from the aforementioned new color and the Pixel 5a’s gray, ridged lock button (the 4a 5G only comes in a solid black color with a flat gray lock button).",
    "The phone has a glass front with a punch-hole in the top-left corner. The back is a matte-textured plastic that wraps around the sides, top, and bottom. It feels fine to the touch – not cheap but not premium either, with a simple style that hasn’t changed since the Pixel 3a. On the rear, the glossy glass-covered camera block at the top-left stands out, and there’s a circular indent in the back-center for the fingerprint sensor, which is every so slightly deeper than the one on the Pixel 4a 5G – otherwise, both aspects feel very similar to that on last year’s phone.",
    "On the right side is the aforementioned lock button, with a volume rocker below it. On the left side towards the bottom is a SIM slot, while at the top of the phone the microphone is on the right and the 3.5mm headphone jack on the left – exactly where they are on the Pixel 4a. On the bottom, the USB-C port is in the middle, with speaker grilles on either side.",
    "For the first time in the a-series phones, the Pixel 5a has dust and water resistance with an IP67 rating, which means it can be submerged in up to one meter of water for half an hour. It’s a small improvement, but will reassure those who are worried about resistance to the elements.",
    "The Google Pixel 5a packs a 6.34-inch Full HD Plus (2400 x 1080) OLED display, which is pretty identical to, although slightly larger than, the one on the Pixel 4a 5G (6.2-inch, 2340 x 1080).",
    "The display is bright and vibrant, and it’s good for watching media and playing games. It doesn’t have the faster refresh rates (beyond 60Hz) of some speedier phones, but since few mid-range handsets have 90Hz or 120hz displays, it’s not a particular weakness.",
    "The display has the aforementioned punch-hole in the top-left corner, which is slightly smaller than the one on the Pixel 4a 5G, though the noticeable but minimal bezels surrounding the display are more or less unchanged.",
    "The Pixel 5a has the same cameras as the Pixel 4a 5G: a 12.2MP f/1.7 dual-pixel main camera with autofocus and both optical and electronic image stabilization, and a 16MP f/2.2 ultra-wide camera.",
    "There’s no telephoto lens (the main camera is capable of up to 7x digital zoom), but aside from that the Pixel 5a’s camera setup is as good as its predecessor’s and the rest of the Pixel line, taking shots that have stunning clarity and realistic colors. And thanks to Google’s near-magic photo software, in even complete darkness you can capture decently-lit images without much noise. The Pixel 5a keeps its predecessor’s crown as one of the most affordable phones with a great night camera out there.",
    "There’s also an 8MP selfie camera, which takes fairly detailed photos for a front-facing camera, likely also thanks to Google’s exemplary image software.",
    "The Pixel 5a has respectable specs, headed up by last year’s Snapdragon 765G chipset – although this is the same silicon that powered the Google Pixel 5 and Google Pixel 4a 5G. In other words, it may not rival flagship phones featuring the latest Snapdragon 888 chipset, but with 6GB RAM and 128GB storage, you’ll have no trouble browsing, playing games, watching videos, and more.",
    "The Pixel 5a runs Android 11 out of the box, and as a Google phone it has the most limited bloatware you’ll find on any Android phones – just the Google suite of apps, as you’d expect. That makes the phone clean and simple to use, without much in the way of frills. Best of all, as a Pixel phone, the Pixel 5a will be one of the first phones to get Android 12, which we expect to arrive in September or October.",
    "The phone has sub-6 5G connectivity, and that’s it – unlike some versions of the Pixel 4a 5G, there isn’t any mmWave 5G capability. This won’t affect too many consumers outside the US, and only Verizon and T-Mobile customers would be affected, though they’ll still get higher speeds on each carrier’s sub-6 5G networks anyway – just not the blindingly-fast speeds mmWave is theoretically (but not always practically) capable of.",
    "One of the most noticeable improvements in the Pixel 5a is its 4,680mAh battery, which has a capacity noticeably higher than the batteries in the Pixel 4a 5G (3,885mAh) and the Pixel 4a (3,140mAh). Larger capacity generally translates to a longer battery life, and that’s the case here.",
    "In practice, the Pixel 5a lasted over a day. Gaming or watching media drained the battery at a typical rate for phones – playing a 10-minute match of Wild Rift sapped 4% charge, while a 30-minute Netflix show drained just 3%.",
    "The phone comes with an 18W fast charging adapter in the box, which isn’t especially impressive, recharging 33% in 30 minutes – given the larger capacity this may be less of an issue, but it’s still not the fastest-charging of phones by a long shot. Like its predecessor, the Pixel 5a does not offer wireless charging, let alone reverse wireless charging.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Google Pixel 5a price and release date",
    "9": "Design",
    "13": "Display",
    "16": "Camera",
    "19": "Specs and performance",
    "22": "Battery",
    "25": "Don’t buy it if…"
  },
  "links": {}
}