{
  "source": "https://www.techradar.com/reviews/mozilla-firefox",
  "title": "Mozilla Firefox review",
  "category": "computing",
  "updated": "2021-08-12T06:28:24Z",
  "author": "lindsay-pietroluongo",
  "summary": "Lean, safe browsing for privacy enthusiasts",
  "verdict": "Firefox may not be flashy, but it’s swift, safe and welcomingly sparse. Mozilla also continually adds new privacy and security features to its browser to prevent tracking across websites.",
  "pros": [
    "Fast performance",
    "Simple, clean aesthetics",
    "Unmatched security features"
  ],
  "cons": [
    "Lacks advanced settings",
    "Could be too plain for some users"
  ],
  "article": [
    "Mozilla Firefox was originally created to be a faster, safer alternative to popular late-90s browsers, like Internet Explorer. Today, Firefox is still revered for its performance and privacy.",
    "When it comes to safety, the benefit is obvious, and with Firefox, very little data is collected about you. Plus, even if a hacker makes their way into your browser, Firefox has built-in protection to still keep you safe.",
    "Firefox shines when it comes to its security features, but in terms of its regular features, there’s not much that’s beyond the pale. While you won’t choose Mozilla based on these, they’re certainly nice (and necessary) to have in a browser, and there are one or two extras you probably won’t find elsewhere.",
    "With Firefox, you can search in the address bar, get smart search suggestions, and get bookmarks, history, or open tabs in your search results. There’s also auto-suggest for URLs, and you can tweak your search bar settings to have more control over your browsing experience.",
    "Other features include blocking auto-play of audio and video and viewing picture-in-picture pop-out videos separate from your browser window to stream something while multitasking. There’s also a built-in screenshot tool, dark mode and custom themes, extensions, form autofill, pinned tabs, reader mode, and spell check.",
    "Lastly, Firefox is available in 90+ languages, is compatible with Google products (like Docs and Gmail), and will sync across all of your devices.",
    "According to their website, the browser “collects so little data about you, we don’t even require your email address to download.” That’s true … kind of. Once you download Firefox, they do ask for your email to fill out your Account Settings though this isn't necessary to use Mozilla's browser. Hopefully, these other security features will impress you even after you’ve handed over a space in your inbox:",
    "Firefox also has automatic updates, breached website alerts, a built-in password manager, encrypted data, fingerprint blocking, individual protection reports and third-party cookie blocking.",
    "Firefox is very minimalist, with a fresh white background and easy-to-read, larger-than-normal black text for much of the default font.",
    "When you open a new tab, you’ll see your shortcuts and a list of top articles from Pocket. Clicking the Settings gear on the top-right of the page lets you customize this page, too. You can add more rows of shortcuts, opt-in or out of seeing sponsored content and Recommended by Pocket stories, and toggle on or off your recent activity and snippets (which are tips and news from Mozilla/Firefox).",
    "The rest of the browser settings are easy to go through, too. There are enough that you can play with how the browser behaves and looks, but not so much that you feel like you’ll miss something because you don’t want to read through them all.",
    "Google is the default search engine, which is nice, but you can switch to Amazon, Bing, eBay or Wikipedia (and others you may have installed, like DuckDuckGo).",
    "There’s nothing particularly special about how search results are displayed, but like we said before, you go with Mozilla for a lean and safe experience, not a feature-packed one. Some may find this perfectly zen-like.",
    "Firefox is compatible with Mac, Linux and Windows machines, and there are also mobile browsers for Android and iOS. You can sync Firefox – your bookmarks, history and tabs – on all of your devices, so long as you have a Firefox account. More details about system requirements are available here.",
    "It’s hard to find some features that Firefox has all in one browser, like text-to-speech, reading mode and the ability to block cryptominers. Let’s go over the main comparisons between Firefox and other leading browsers.",
    "When compared to Safari, Firefox’s standout features are its in-browser screenshot tool and the primary password requirement.",
    "When compared to Google Chrome, Firefox blocks third-party tracking cookies and social trackers. (Chrome doesn’t have a primary password option, either.) And according to Mozilla, Firefox uses less RAM than Chrome.",
    "When compared to Microsoft Edge, Firefox’s main competitive feature is blocking auto-play.",
    "While some people have a love-hate relationship with Firefox (or a hate-hate one, even), we can’t help but find it endearing. It’s the simplest browser around while still being attractive – the bold black font that’s a little larger than the norm makes it modernly minimalist, not boring or plain. You feel like you’ve got a lot of protection on your side when you’re using it since it goes overboard (thankfully) with privacy and security features. And it does just what a browser should do: Find what you’re searching for and react quickly when you interact with it."
  ],
  "headers": {
    "2": "Features",
    "6": "Privacy",
    "8": "User experience",
    "13": "Platforms",
    "14": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Mozilla Firefox": "https://www.mozilla.org/en-US/firefox/new/",
    "browsers": "https://www.techradar.com/best/browser",
    "picture-in-picture pop-out videos": "https://www.techradar.com/news/firefox-will-soon-let-you-have-multiple-picture-in-picture-video-windows",
    "password manager": "https://www.techradar.com/best/password-manager",
    "fingerprint blocking": "https://www.techradar.com/news/firefox-set-to-ban-fingerprinters",
    "third-party cookie blocking": "https://www.techradar.com/news/mozilla-firefox-update-protects-users-against-redirect-tracking",
    "DuckDuckGo": "https://www.techradar.com/reviews/duckduckgo-search-engine",
    "available here": "https://www.mozilla.org/en-US/firefox/90.0.2/system-requirements/#mac",
    "Safari": "https://www.techradar.com/news/macos-monterey-the-best-new-safari-features",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review"
  }
}