{
  "source": "https://www.techradar.com/reviews/asus-tuf-dash-f15",
  "title": "Asus TUF Dash F15 review",
  "category": "computing",
  "updated": "2021-06-01T18:31:48Z",
  "author": "jackie-thomas",
  "summary": "A gaming laptop that's lightweight AND affordable? No way",
  "verdict": "The Asus TUF Dash F15 is a masterclass in mixing an attainable price with an elegant form factor. It has strong performance in a chassis that won't weigh you down when you need to go somewhere. And it doesn't hurt that it has some of the longest battery life in a gaming laptop today.",
  "pros": [
    "Long battery life",
    "Super thin and light",
    "Strong gaming performance",
    "Plenty of ports"
  ],
  "cons": [
    "No webcam",
    "Keyboard lighting color can't be changed"
  ],
  "article": [
    "Gaming laptops like the Asus TUF Dash F15, that packed mid-range performance in a thin and light package, have traditionally been much more expensive than your traditional gaming portable. Typically, if you wanted a gaming laptop that could power the latest AAA PC games at high settings and you wanted to comfortably carry it around with you in your backpack, you were looking at dropping a couple grand on it.",
    "However, this time, thanks in large part to Intel's new 11th-generation Tiger Lake-H35 processors, the Asus TUF Dash F15 brings a luxurious gaming experience to an affordable $1,099 (about £800, AU$1,400) price point to start.",
    "There are a couple of compromises made to make this laptop work at this low price, though. The most noticeable is going to be the lack of a webcam. This isn't the first time we've seen this in an Asus gaming laptop either, the Asus ROG Zephyrus G14 from 2020 – still one of our favorite gaming laptops – made this compromise, too. It was worth it then, and it's still worth it now.",
    "It's also important to highlight that, because of the lightweight design of the laptop, the Asus TUF Dash F15 probably won't be the most powerful RTX 3070-powered gaming laptop on the market – but it was more than powerful enough to run everything in our test suite at a solid framerate.",
    "If you've been waiting for a portable gaming laptop that both can play the latest games at high settings, and didn't cost as much as a down payment on a car, the Asus TUF Dash F15 should be near the top of your list.",
    "The Asus TUF Dash is available starting January 2021 and the base configuration will set you back $1,099 (about £800, AU$1,400). For that price, you'll get an Intel Core i7-11370H processor, 16GB of RAM, a 512GB SSD and an Nvidia GeForce RTX 3060, all of which is behind a 15-inch 1080p 144Hz display.",
    "This is probably one of the best value laptops with an RTX 3000 GPU on the market right now, especially when you consider the long battery life and super-portable design that the TUF Dash F15 brings to the table.",
    "The configuration we're reviewing here, listed to the right, will set you back $1,449 (about £1,060, AU$1,890), and is probably the sweet spot for most people. At this price point, you probably won't see many other gaming laptops with equivalent hardware, especially not in a laptop this well-built.",
    "There is a $1,699 (about £1,249, AU$2,200) configuration available, too, but the only things it changes is moving the processor from the Intel Core i7-11370H to the Intel Core i7-11375H and bringing a sleek white colorway. If you really want a flashy white laptop, it's an option that's available for you, but really, you're not going to get much considering how much extra cash you'll be throwing down on it.",
    "When opening the Asus TUF Dash F15, we had to do a double take to make sure that this was a TUF product and and not an ROG Zephyrus. For a bit of background, Asus' TUF lineup of gaming laptops and accessories is aimed at a budget audience that just wants the most bang for their buck. These products typically take a utilitarian approach to their design, but the Asus TUF Dash F15 is anything but.",
    "This laptop is just 0.8 inches (20.3mm) thick, weighing in at just 4.5lb (2kg), making it extremely thin and light for a gaming laptop. Both the keyboard deck and the lid of the laptop are made of aluminum with a gorgeous gray colorway, so it doesn't lose rigidity for the sake of portability. The bottom of the laptop is still plastic, though, so don't think you're getting a unibody design or anything - that's something still reserved for much more expensive devices, unfortunately.",
    "It does make the laptop easier to service, however. While the Asus TUF Dash F15 is incredibly thin and light, you can still pop off the back of the laptop to upgrade your storage and memory. All you need to get inside the laptop is a screw driver, and the bottom half of the underside will pop off, giving you quick access to the M.2 ports, two of them, should you need more storage in the future.",
    "You will have to remove the entire bottom of the laptop to get to the RAM, however, but you can still upgrade it, with up to 32GB of DDR4. This makes the low entry price even more appealing, as you can upgrade it as you go, rather than having to fork over a ton of cash up front.",
    "The Asus TUF Dash F15 also has a wealth of ports on offer, with two USB-A ports on the right side of the laptop. Over on the left, you get one more USB-A, along with a Thunderbolt 4, HDMI, Ethernet, a 3.5mm combo jack, and a dedicated port for charging. Now, while Asus does use a dedicated port for charging, you can still charge the TUF Dash F15 via USB-C, it's just not quite as fast.",
    "The display is a FullHD panel, with a 240Hz refresh rate, making it perfect for esports, especially paired with an RTX 3070. With an average peak brightness of around 265 nits and hitting 110% of the sRGB spectrum, it's also bright and colorful enough to do justice to the single-player hits, too.",
    "The bezels around the display are far from the thinnest in the world, but they're definitely not thick enough to be distracting. Still, we can't help but wonder why Asus couldn't fit a webcam in the top bezel. It's more than thick enough, but this is likely just a cost-cutting measure to keep the price of the Asus TUF Dash F15 so low. It's disappointing, but it's not the end of the world, especially if you're not looking to use this thing in video calls or streaming on Twitch. If you do want to do those things, you're going to have to invest in one of the best webcams.",
    "The keyboard is comfy to type on, with plenty of key travel, considering the thin build of the laptop. Spacing is also on point, though we wish the lighting was a bit different. There's no RGB lighting on offer, again likely compromise for the price. Instead, it's just teal backlighting, and it's not the most attractive color in the world, and it looks worst around the WASD keys, which are clear. It makes sense that these keys would be highlighted, because, you know, gaming, but the backlighting makes it look kind of gross.",
    "In a laptop that's as gorgeous as the Asus TUF Dash F15, these clear keys really stand out, and we wish it was either optional or just not there at all.",
    "What's cool is that there are some dedicated keys above the keyboard that are genuinely useful. You can control volume without having to awkwardly straddle between the Fn key and the function keys, along with a dedicated mic mute button and one that opens the Asus Armoury Crate software.",
    "The trackpad is, you know, fine. It's big enough to use gestures and the clicking mechanism feels sturdy enough, but with a gaming laptop, you really should be going with a gaming mouse anyway. But, it'll do in a pinch.",
    "Asus has opted to put the speakers on the bottom of the laptop, one on the left and the other on the right. This is one of our pet peeves, especially when there is ample space on each side of the laptop like there is here. They don't sound as bad as many other laptops that go with this design choice, but it's still not ideal.",
    "They are loud enough to power through the fan noise while gaming, though. With the \"Performance\" profile - selected through Armoury Crate - the fans aren't nearly loud enough to be distracting. You'll definitely still hear them when the laptop is under heavy load, but it's nothing too extreme.",
    "And they do their job, too. Even after hours of benchmarking, the keyboard deck wasn't uncomfortably hot, thanks to the vents all around the sides of the laptop.",
    "When it comes to gaming laptops, we tend to think of them in one of three different categories: there are the ultra-powerful desktop replacements, the ultra-portable ones that let you get some gaming done on the road, and the ones in the middle that give you a little of column A and a little of column B. The Asus TUF Dash is definitely what we'd call an ultra-portable gaming laptop.",
    "So, while it does pack the latest silicon from both Intel and Nvidia, the hardware is configured in such a way that it won't burst into flames in such a tiny chassis, so you're not going to get the fastest RTX 3070 laptop on the market here.",
    "That doesn't mean that the Asus TUF Dash F15 can't tear through the latest AAA games, though. No matter what game we throw at this thing, it pulls an acceptable framerate, whether it's Watch Dogs with RTX on, Assassin's Creed Valhalla or even Dirt 5.",
    "The RTX 3070 here is built on Nvidia's Ampere architecture, too, which brings along the second-generation implementation of its ray tracing tech. And, the performance is helped out a lot by this in games that support it. For instance, we benchmarked Metro Exodus at Ultra settings where it scored 59 fps average without ray tracing. When we turned it on, thanks to Nvidia's brilliant DLSS tech, only drops down to 48 fps.",
    "That's not the ideal 60 fps that you might be hoping for, but it's still more than playable. Considering that you can get that performance in a computer that can easily fit in your backpack, we consider it a win.",
    "CPU performance isn't quite as strong as you'll get in other laptops, in large part because of the inclusion of a Tiger Lake-H35 processor. The Core i7-11370H is a 4-core, 8-thread part that can boost up to around 4.8GHz. It's more than enough for gaming – we're not running into any problems with the GPU being bottlenecked or anything – but for creative professionals that are looking to use a gaming laptop as a workstation, as is becoming more and more popular, you may want to look elsewhere.",
    "Gaming laptops kind of have a reputation for having short battery life, though they have been improving recently. Most notably, in early 2020, the Asus ROG Zephyrus G14 came out with an AMD Ryzen 4000 processor and an RTX 2060 and managed an amazing 8 hours of battery life in our video playback test.",
    "The Asus TUF Dash F15 is even better, nearing 10 hours of battery life, with an even more powerful GPU and a faster 240Hz display. Even in the PCMark 10 battery tests, which simulates a wide range of different computing workloads, the laptop lasts around 9 hours, which means that this gaming laptop should have absolutely no issue getting you through a full work day. And, with how heavy the charging brick is, being able to bring this to work with you without it is a huge plus.",
    "The Asus TUF Dash F15 provides just the bare essential software features, and that's actually a good thing. There isn't much in the way of bloatware, beyond the Asus utilities for drivers and the Armoury Crate software, which is genuinely useful. This little program will let you customize the lighting – though there is only one color available – and will also give you control over performance profiles so you can decide whether you want quiet fans or the best performance the laptop can squeeze out.",
    "It also has a game launcher built into it, so you have one program you can launch games from, rather than having to constantly juggle between Steam, GOG, Epic and whatever other launchers you need to play your favorite PC games.",
    "Because there's no webcam on this laptop, there's no IR facial recognition, and there isn't a fingerprint reader here either. That means no biometric login, but given this laptop is such a bargain for the hardware on offer, that's not really a feature we'll begrudge the absence of."
  ],
  "headers": {
    "0": "Two minute review",
    "5": "Price and availability",
    "9": "Design",
    "23": "Performance",
    "29": "Battery life",
    "31": "Software and features",
    "34": "Don't buy it if..."
  },
  "links": {
    "Gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Asus ROG Zephyrus G14": "https://www.techradar.com/reviews/asus-zephyrus-g14",
    "best webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "Assassin's Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review"
  }
}