{
  "source": "https://www.techradar.com/reviews/withings-body-weight-and-bmi-wi-fi-scale",
  "title": "Withings Body Weight & BMI Wi-Fi Scale review",
  "category": "fitness",
  "updated": "2021-02-24T12:02:42Z",
  "author": "cat-ellis",
  "summary": "A smart choice if you don't need body composition data",
  "verdict": "If you're only interested in tracking weight and BMI, and aren't concerned about the minutiae of body composition, this Wi-Fi-enabled smart scale is easy to work into your morning routine. Data syncs wirelessly with the Withings Health Mate app, which can also pull in data from other Withings devices, plus all the major health and fitness apps. You won't get data on body fat and muscle mass, but if that's not a concern then this scale makes keeping tabs on your weight as close to effortless as possible.",
  "pros": [
    "Excellent companion app",
    "Simple setup",
    "Works via Wi-Fi or Bluetooth"
  ],
  "cons": [
    "No body composition data"
  ],
  "article": [
    "This is the simplest of Withings' three smart scales. Unlike the more sophisticated models (The Body+ and Body Cardio), it only measures weight and BMI, not body composition, but there are still lots of reasons to consider it.",
    "The scale itself is thoughtfully designed, with features including a large platform, a high contrast display, and directional arrows to help you stand in the correct position. Once it's set up, minimal interaction is necessary; just step on, and your weight and BMI will be transmitted to your phone automatically.",
    "The Withings Health Mate app is excellent, not least because of its integration with all the major health and fitness apps, including Fitbit, Samsung Health, Google Fit and Apple Health. Data recorded by any of these apps can be imported seamlessly, so you can see your activity levels and workouts right alongside data from the scale.",
    "If you want to keep tabs on your weight but aren't concerned about the nitty gritty of fat and muscle composition, this scale is a well designed tool that's easy to work into your morning routine.",
    "Like most smart scales, the Withings Body Weight & BMI Wi-Fi Scale has a toughened glass platform and rubberized feet to avoid scratching your floor.",
    "This scale has a particularly minimalist design with no clear markings, but is still easy to use thanks to some thoughtful touches. Its platform is large, measuring 33 x 33mm, which is helpful for anyone who struggles with balance, and if you’re not standing in quite the right position, small arrows in the corners of the display will show you where to move to get an accurate reading.",
    "The display is also big, and its high contrast makes for easy reading even in poor lighting. It takes four AAA batteries, which are included.",
    "Setting up a Wi-Fi smart scale is always a little more complicated than configuring a Bluetooth-only one like the Eufy Smart Scale C1, but Withings makes it as straightforward as possible.",
    "Install and launch the Health Mate app (available for iOS and Android), then turn on the scale by holding the button on the underside for three seconds when prompted, then log into your account if you already have one, or create a new one if not",
    "You’ll then be prompted to enter your Wi-Fi password. You can skip this step and use Bluetooth instead, but using Wi-Fi means you can sync your data when your phone is out of range, see weather reports on the scale, and receive firmware updates. Speaking of which, the scale is likely to require a sizeable update during the initial setup, so make sure you allow time for that.",
    "You can choose which data you’d like to see on the scale when you use it, including weight, BMI, weather (useful first thing in the morning), weight trend, and steps if you've connected a fitness tracker or third-party fitness app to Health Mate. More on that shortly.",
    "If you’re intending to lose weight you’ll be asked to set a goal weight, a pace at which you’d like to lose it. This step is optional, and can be skipped if you're simply aiming to maintain a healthy weight.",
    "You can create profiles for up to eight users, and when you step onto the scale, it will select the correct one automatically.",
    "The scale also offers pregnancy and baby modes. We haven’t been able to test these, but they are intended to help you check your baby’s growth. Some other scales have a dedicated mode for children, but few have a dedicated tool for expecting mothers and new parents, and it’s a welcome addition.",
    "In our tests, the Withings scale gave almost identical results to more expensive devices, and showed the same daily fluctuations. Results were consistent when weighing several times in quick succession.",
    "The Withings Body BMI Wi-Fi Scale syncs with the Withings Health Mate app on your phone. If you have another Withings device, like the Withings ScanWatch or Sleep Analyzer, that data will all be pooled together in one convenient dashboard.",
    "The Health Mate app also integrates seamlessly with the Google Fit, Apple Health or Fitbit app on your phone, so even if you don’t have a Withings fitness tracker, you can see your daily step count and week’s workouts all in one location. Just grant permission when prompted, and all your data will be transferred automatically. It’s refreshingly straightforward, and makes good use of available information.",
    "Your weight is plotted on a graph, which you can pinch to zoom in and out. Your goal weight (if set) will be clearly presented, along with recommended weight ranges. Not all apps give you this information, and it provides useful context beyond raw numbers.",
    "The app’s homescreen will show Health Insights letting you know if your weight is stable or changing, whether it’s healthy for your height, and whether you should consider making any lifestyle changes. You can also choose to read advice from a certified fitness and nutrition coach if you’re trying to lose weight, to help you do so in a healthy and sustainable way."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Design",
    "7": "Performance",
    "15": "Companion app",
    "19": "Don't buy it if"
  },
  "links": {
    "smart scales": "https://www.techradar.com/best/best-smart-scales",
    "Withings ScanWatch": "https://www.techradar.com/reviews/withings-scanwatch",
    "Sleep Analyzer": "https://www.techradar.com/reviews/withings-sleep-analyzer"
  }
}