{
  "source": "https://www.techradar.com/reviews/asus-rog-strix-scar-17-g733",
  "title": "Asus ROG Strix SCAR 17 G733 review",
  "category": "computing",
  "updated": "2021-03-05T11:19:41Z",
  "author": "matt-hanson",
  "summary": "The best of AMD and Nvidia",
  "verdict": "The Asus ROG Strix SCAR 17 G733 is one of the most powerful gaming laptops money can buy right now, and will play any modern game with ease. Its design is unashamedly in-your-face – and while that may not appeal to everyone, if you want a gaming laptop that will get a reaction with its resplendent RGB lighting, then this may be for you. However, the price is high, and will be hard to justify for many people.",
  "pros": [
    "Very powerful",
    "Excellent performance",
    "Cool design",
    "Brilliant mechanical keyboard"
  ],
  "cons": [
    "Expensive",
    "Design won't be for everyone",
    "Poor battery life"
  ],
  "article": [
    "The Asus ROG Strix SCAR 17 G733 is a gaming laptop that isn't ashamed to appeal to gamers. After a run of such laptops offering minimalist, even boring, designs – which meant you could also use them as a professional laptop without being embarrassed – it’s refreshing to see a model that really embraces the gamer aesthetic.",
    "So, there’s RGB lighting, customizable faceplates and even a see-through portion on the body that reminds us of limited edition consoles from the 90s. It also means the Asus ROG Strix SCAR 17 G733 is packed with some of the best gaming hardware around, including an super-powerful AMD Ryzen 9 5900HX 8-core overlocked processor, an Nvidia RTX 3080 GPU and a 300Hz 1080p screen – one of the fastest you’ll get on a laptop.",
    "However, this all comes at a price. A very high price. We're talking $2,999.99 / £2,499 (around AU$3,900). Sure, for that you get some killer specs, but it also means that for many, this laptop will be unattainable.",
    "The Asus ROG Strix SCAR 17 G733 is a fantastic bit of kit, though. It isn't as slim and light as the likes of the Razer Blade Pro 17, but not does it come packing cutting-edge mobile components, it also has a fast, bright and vibrant 1080p screen with a 300Hz refresh rate and 3ms response times. The screen isn't 4K, but we believe 1080p is a good call here. The RTX 3080 laptop GPU doesn't quite have the power to drive graphically intensive games at their highest settings at 4K with ray tracing on. At 1080p, however, it has no issues at all.",
    "Its optical mechanical keyboard is also one of the best we've experienced on a laptop. Not only does it make typing on this device a joy, but you'll see the benefit in games, too.",
    "Overall, gaming performance is excellent – this laptop really does offer one of the best gaming experiences right now. Being able to play any new game and whack every setting to max is wonderful. However, be warned that the fans kick in loudly.",
    "Battery life isn't great, either, which isn't a huge surprise. Nevertheless, we've come to expect a little bit more from gaming laptops these days.",
    "Overall, though, the Asus ROG Strix SCAR 17 G733 is one of the best gaming laptops money can buy right now – for those who can afford its eye-watering price, anyway.",
    "Brace yourselves…. the model we got in for review costs a whopping $2,999.99 / £2,499 (around AU$3,900). Immediately, then, this is a laptop that many people simply won't be able to afford. It’s a shame, since with a specs list including a 17.3-inch 1080p screen with 300Hz refresh rate, an AMD Ryzen 9 5900HX CPU, Nvidia RTX 3080 16GB laptop GPU, 32GB of RAM and optical mechanical keyboard, this is an incredibly impressive bit of kit.",
    "Yet for the price, we simply can’t recommend it to the majority. It’s also worth noting that RTX 3000 laptops are difficult to get hold of at the moment, therefore pushing the price of the Asus ROG Strix SCAR 17 G733 even higher than its already expensive asking price.",
    "However, with specs such as these, you really are getting one of the most powerful gaming laptops in the world right now – which, for some folk, will make it worth the money. In addition, with this kind of fire power on offer, along with 32GB of RAM, it’s a great laptop for content creation as well. If you’re looking for a powerful workstation as well as a device to game on, then the high price becomes much more palatable.",
    "The screen lacks the 100% Adobe RGB coverage of similar laptops such as the Razer Blade Pro 17 (2021), but it's cheaper. However, this definitely isn't a laptop for gamers on a budget, even considering one of the more ‘affordable’ models with RTX 3060 or RTX 3070 laptop GPUs.",
    "One of the strongest selling points of the Asus ROG Strix SCAR 17 G733 is its design. This is a gaming laptop that simply screams ‘gamer’. It’s loud and proud, with lots of RBG lighting, sharp edges and a customizable ‘Armor Cap’ in the left-hand corner. This can be swapped out for alternative colors available with the laptop, or you can 3D print your own to incorporate any logos or names you like.",
    "A portion of the keyboard deck is translucent, allowing you to see the hardware beneath. It brings to mind those special edition games consoles from the ‘90s and early ‘00s. It’s brash, geeky, maybe even a bit tacky – and we love it.",
    "This definitely isn't a gaming laptop that’s ashamed to be one. Pull the device out at an event or at a LAN party, and they’ll know you mean business. When it comes to ports, the Asus ROG Strix SCAR 17 G733 is pretty well equipped. On the left-hand side are two USB-A ports and audio jack, but there are no ports on the right. Instead, there’s more RGB lighting (of course), and a glowing (of course) ‘Keystone’ port. The ROG Keystone (sold separately) is an NFC stick that stores one's personalization settings, and can also unlock an encrypted ‘Shadow Drive’ for private storage on your machine.",
    "This will only be of interest to people heavily invested in the ROG ecosystem, with several different compatible devices. If this isn't you, then you'll just view it as a bit of wasted space on the body.",
    "So, this means that the rest of the ports are positioned along the back of the laptop. You get another USB-A port, USB-C port, HDMI and Ethernet (handy for those aforementioned LAN parties). The power supply also plugs in at the rear.",
    "It’s a good selection of ports, then, but the placement around the back isn’t the most convenient, especially for the USB-C. It's a design decision that doesn't appear to have been made with the user in mind. However, there are others that do feel pro-consumer.",
    "The fact that you can upgrade the SSD and RAM is great, and means the Asus ROG Strix SCAR 17 G733 is more future-proof than many other gaming laptops. In a few years, if you feel that performance is taking a dip – or, you’re running out of storage space and don’t want to delete any games – then it will be possible to add in new components.",
    "While you can’t swap out the GPU or CPU, arguably the two most important components for gaming performance, the Asus ROG Strix SCAR 17 G733 does offer a degree of flexibility to up the performance of the laptop – and we’re glad to see the option included here.",
    "Another design element we appreciate is the keyboard. It’s easily one of the best we’ve used on a laptop – with optical mechanical switches and 1.9mm travel, which makes typing on the Asus ROG Strix SCAR 17 G733 satisfying and responsive.",
    "Of course, you’ll likely to be doing more gaming on the Asus ROG Strix SCAR 17 G733 than typing, for which the keyboard works a treat as well. It really blows away the keyboards on many other gaming laptops, which often feel like an afterthought. If you’re someone who has found themselves plugging an external keyboard into a gaming laptop, then you’re going to love the Asus ROG Strix SCAR 17 G733.",
    "The laptop's screen is bright and vibrant, with impressively thin bezels surrounding the display. These thin bezels come at a price, however; there’s no built-in webcam. However, you can get an external webcam included with certain packages.",
    "Ordinarily, the lack of a webcam wouldn’t be too much of an issue, and although streaming while playing has become increasingly popular, for the best possible quality, you will still be better off buying a dedicated webcam (check out our best webcams guide for our picks).",
    "But this isn't just about gaming. We now live in a world in which we're working and learning remotely, keeping in contact via video-conferencing. The lack of an integrated webcam means the Asus ROG Strix SCAR 17 G733 won't be a suitable option for many people. Yes, you can buy an additional unit, but it isn't as convenient as a built-in one, and it’s an extra expense on an already very expensive purchase.",
    "Overall, then, the design of the Asus ROG Strix SCAR 17 G733 impresses, and many gamers will appreciate not only the RGBs and aesthetics, but also the optical mechanical keyboard that can really make a difference when gaming.",
    "However, the awkward placement of some ports at the rear of the laptop, and the lack of webcam, mean it's unlikely to appeal to everyone.",
    "The Asus ROG Strix SCAR 17 G733 is one of the latest gaming laptops to come with Nvidia’s new RTX 3000 series of laptop graphics cards, and the model we had in for review comes with the RTX 3080 laptop GPU – currently the most powerful graphics card you can get in a gaming laptop.",
    "Paired it with an overclocked 8-core Ryzen 9 5900HX processor and 32GB of RAM, and you have a laptop, on paper, that is easily one of the most powerful gaming notebooks you can buy right now.",
    "The good news is that the Asus ROG Strix SCAR 17 G733's performance lives up to the potential suggested by its specs, easily playing the latest games with all graphical bells and whistles turned up to max.",
    "Metro Exodus, a very graphically demanding game, scored on average 84.62fps on Ultra settings. This offers a fantastically smooth gaming experience, while also being visually impressive. And, since the Asus ROG Strix SCAR 17 G733 comes with an Nvidia RTX GPU, it means you can also enable advanced ray tracing lighting effects – although that does come at a cost to overall performance.",
    "There’s DLSS support, too, which is a great feature from Nvidia that uses machine learning to cleverly upscale the image, allowing you to achieve even better performance without noticeable impact to graphical fidelity.",
    "Since the Asus ROG Strix SCAR 17 G733 comes with a 1080p screen, you should be able to play pretty much any new game at the highest possible settings, and still achieve well over 60fps. The higher the frames per second, the smoother and more responsive a game will feel.",
    "The model we reviewed comes with a 300Hz refresh rate screen. As such, with older or less graphically intensive games, you'll be able to achieve higher frame rates still, really benefitting from faster, more responsive gameplay. This is especially important with competitive multiplayer games – and with the 3ms response time (and that lovely responsive keyboard), this laptop really feels like it could help you improve your game.",
    "Of course, you can lower a few games settings to get even higher frame rates as well.",
    "The Asus ROG Strix SCAR 17 G733 definitely offers one of the best gaming experiences available on a laptop right now – although you’re paying for it. Note that while playing games, the components inside will be working hard, and this will result in the fans spinning up to keep everything cool. The noise can be a bit distracting.",
    "We also noticed that once you've closed the laptop's lid following a gaming session, the Asus ROG Strix SCAR 17 G733 LEDs can remain on if the device is plugged in. This can be distracting, but it's nothing that a few tweaks won’t fix.",
    "In day-to-day use, Windows 10 performs brilliantly. The 32GB of RAM ensures that this is an impressive multitasking laptop, so it's great for content creators, or for those who wish to stream while they play. However, if this laptop will only be used for gaming, that amount of RAM is overkill.",
    "As with other Asus ROG laptops, the Asus ROG Strix SCAR 17 G733 comes with the Armoury Crate software (which can be brought up by pressing a dedicated key just below the screen). This app allows you to tweak various settings, including RGB lighting, fan speeds and power consumption. As such, you'll be able to quieten down the fans if they become too loud, or give your hardware a bit of a boost to eke out some more frames. It’s one of the better examples of pre-installed software (unlike the McAfee trial, which keeps bugging you as soon as you load up Windows 10), and can be genuinely useful.",
    "Battery life in gaming laptops, especially in models such as the Asus ROG Strix SCAR 17 G733 that put performance above all else, has always been found wanting. This is due to the power consumption of cutting-edge components; but recently, we’ve seen launches that can go for almost a whole work day.",
    "Unfortunately, the Asus ROG Strix SCAR 17 G733 isn’t one such model. In our own battery test, where we run a looped 1080p video at 50% brightness, the laptop managed just 4 hours and 43 minutes. So, even if you're using it for a relatively non-intensive task such as watching a video, you’re not going to get the laptop to last the duration of a long-distance flight.",
    "In day-to-day use, we never felt confident using the Asus ROG Strix SCAR 17 G733 for any length of time far from the mains. Despite tweaking some of the settings, including switching to the integrated AMD Radeon graphics, this laptop continued to drain battery life quickly.",
    "This shouldn't be a huge surprise, and in some ways it’s the price you pay for such a powerful laptop. However, there are devices available that show that poor battery life isn’t a compromise you have to make with modern gaming laptops."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and availability",
    "12": "Design",
    "27": "Performance",
    "39": "Battery life",
    "43": "Don't buy it if..."
  },
  "links": {
    "Razer Blade Pro 17": "https://www.techradar.com/reviews/razer-blade-pro-17-2021",
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471"
  }
}