{
  "source": "https://www.techradar.com/reviews/withings-body",
  "title": "Withings Body+ review",
  "category": "fitness",
  "updated": "2021-02-24T12:02:16Z",
  "author": "cat-ellis",
  "summary": "Track weight, body composition and activity in a matter of seconds",
  "verdict": "The Withings Body+ is a feature-packed smart scale that strikes an ideal balance of price and features. It gives you all the tools you need to monitor your weight and body composition over time, together with activity data from third-party apps and expert advice to help you develop better lifestyle habits. It's not the cheapest smart scale around, but it's easily one of the best.",
  "pros": [
    "Large non-slip platform",
    "Feature-packed app",
    "Syncs data without Bluetooth"
  ],
  "cons": [
    "Not the cheapest option"
  ],
  "article": [
    "The Withings Body+ is a body composition smart scale that gives you the best of all worlds. It's affordable (much more so than the top-end Withings Body Cardio), it has both Bluetooth and Wi-Fi connectivity (whereas the Withings Weight & Body BMI scale just has Bluetooth), and it gives you accurate, consistent readings synced with an excellent, user-friendly app.",
    "It's a particularly good smart scale for families, with support for up to eight users, each of whom is recognized automatically. There's a large non-slip platform with live guidance to help you stand in the right position, and the display is bright and clear.",
    "Data syncs with the Withings Health Mate automatically with no extra input, and can be pooled together with information from apps like Google Fit, Apple Health and MyFitnessPal so you can see all your health and activity metrics in one place.",
    "It's not just numbers either; the app also provides expert advice to help you understand what it all means in practical terms, and guide you towards healthier lifestyle choices (not only weight loss).",
    "If you're on a tight budget then a Bluetooth-only scale like the Eufy Smart Scale C1 might be a better choice, but you'll be hard pressed to find a better smart scale with Wi-Fi connectivity.",
    "The Withings Body+ was released in 2017 and costs $99.95 / £74.96 / AU$179, putting in the middle of the company's range of smart scales.",
    "The Withings Body+ has a toughened glass platform, with marking to help you position your feet correctly. If you're not in quite the right place, arrows on the scale's display will guide you into the optimal position. As with Withings' other scales, the platform is quite large, measuring 12.8 x 12.8in and the bright display measures 2.4 x1.6in.",
    "Unlike the Withings Body Cardio, the Body+ scale has conventional feet underneath, with a textured non-slip surface to avoid marking your floors. Like the vast majority of electric scales it's only suitable for use on hard floor, but carpeted bathrooms are a rarity so that's unlikely to present an issue.",
    "The scale takes three AAA batteries (included) and comes with a two-year warranty. Withings also offers a 30-day returns policy if you're not happy.",
    "Install the Withings Health Mate app (available for iPhone and Android devices) and create an account, then turn on the scale and follow the in-app instructions to connect it via Bluetooth. Once that's done, you'll be prompted to add the scale to your home Wi-Fi network. This isn't an essential step, but means the scale can sync your data when your phone is out of range.",
    "When we tested the scale, there was no need to carry out a firmware update, but the Wi-Fi connectivity means it would be possible to receive any important feature upgrades or safety patches in the future.",
    "Once that's done, select the data you'd like to see each time you weigh in, which can include weight, body fat, muscle, water, steps (synced from third-party apps like Google Fit or Apple Health) and even the weather.",
    "You're then ready to step on. Your weight will be shown almost instantly, and after a couple of seconds the scale will cycle through your elected stats. There’s no need to select a user ID before weighing; the scale will recognize you based on your body composition, and your name will appear on the display to confirm this.",
    "Body composition data is synced to the app automatically, and will appear on the app's homescreen with options to drill down for further information. More on that in a moment.",
    "In our tests, data was consistent throughout multiple weigh-ins, and matched that taken by other Withings scales (including the top-end Withings Body Cardio). There were no unexpected peaks or troughs, which we've experienced with some of the cheaper smart scales we've tested, and composition scores were in line with those from the scales at our gym.",
    "The scale supports up to eight users, making it a good choice for large households (the Body Cardio only supports four), and the display is bright and easy to read. All different stats are presented clearly, with icons where appropriate (steps are represented by footprints, for example), which is a thoughtful addition.",
    "The Withings Health Mate app is one of the best we've seen for syncing, managing and tracking data from a smart scale. Your current weight is shown clearly on the app’s homescreen, along with a chart of your last seven weigh-ins so you can easily track trends. You’ll also be able to see your current step count at a glance, and stats for recent workouts.",
    "Workout and step data is gathered by third-party apps like Apple Health or Google Fit, and seamlessly imported.",
    "To see your detailed body composition data, tap the ‘Dashboard’ link. Details from your last weigh-in are presented, along with an arrow to show whether the general trend for each metric is up, down, or stable. It’s well designed, and a handy way of checking progress without delving deeper into the numbers if you’re in a hurry.",
    "You’ll see Health Insights in the Withings Health app, letting you know if you should make any changes to your goals (if they appear too high or too low), or if you’re on the right track. You can tap on these for advice from health experts. Alternatively, you can choose to unsubscribe if you’d rather focus on the numbers.",
    "Tapping on any measurement will reveal a more detailed chart of your changing body composition over time. Tap any of these charts for detailed insight into what that particular metric means, why you should measure it, and how it’s calculated by the scale and app. There’s a lot more information than you’ll find in most fitness apps, and it’s presented in plain English, which adds important context to the raw figures.",
    "A blue band on each chart that represents the recommended ranges defined by the World Health Organization, so you can see where your numbers fit, but you can choose to turn this feature off if you prefer (which you might choose to do if you’re a bodybuilder or athlete, for example).",
    "The app also provides advice on when and how to weigh yourself (ideally at the same time each day, 30 minutes after waking up, and just once or twice a week).",
    "You can choose to log your heart rate, blood pressure and food intake as well. The only omission we can see is a lack of tools for logging your menstrual cycle, which can have a noticeable effect on water retention and therefore overall weight during the course of the month."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and release date",
    "6": "Design",
    "9": "User experience",
    "16": "Companion app",
    "24": "Don't buy it if"
  },
  "links": {
    "smart scale": "https://www.techradar.com/best/best-smart-scales",
    "Withings Body Cardio": "https://www.techradar.com/reviews/withings-body-cardio",
    "Withings Weight & Body BMI": "https://www.techradar.com/reviews/withings-body-weight-and-bmi-wi-fi-scale",
    "Eufy Smart Scale C1": "https://www.techradar.com/reviews/eufy-smart-scale-c1"
  }
}