{
  "source": "https://www.techradar.com/reviews/amazon-lightsail",
  "title": "Amazon Lightsail review",
  "category": "computing",
  "updated": "2021-07-19T05:51:26Z",
  "author": "mike-williams",
  "summary": "Amazon's VPS solutions offer swift setup and simple management",
  "verdict": "Amazon Lightsail is an excellent budget-friendly choice for small businesses and well-versed webmasters from the software industry who are able to get things done without a helping hand. Less experienced users looking for a round-the-clock specialist support will have to pay a pretty penny or keep on looking.",
  "pros": [
    "Simple and swift setup",
    "Pocket-friendly plans",
    "Easily connects with other Amazon services",
    "One-month free trial",
    "Worldwide data centers"
  ],
  "cons": [
    "No automatic backup system",
    "Not too beginner-friendly",
    "Top notch technical support costs extra cash"
  ],
  "article": [
    "Amazon Lightsail (a part of AWS, which is short for Amazon Web Services) started out in 2016 and (as its name implies) is a subsidiary of Amazon, a multinational technology company from the USA. Besides being a market behemoth, its objective is to provide all-in-one and easy-to-use virtual private servers (VPS) to all that are in need of them and wherever they are, to put it simply.",
    "The company is headquartered in the USA, although it has offices and (more importantly) data centers all over the globe. These include 80 availability zones within 25 different geographic regions including three locations in the USA (Virginia, Ohio and Oregon), one in central Canada, five in Europe (two in the UK, and one of each in Germany, France and Sweden) and five in Asia-Pacific (Australia, Japan, South Korea, Singapore and India). AWS also announced its plans to expand to 15 more availability zones inside 5 regions and to support more coverage in Australia, Indonesia, India, Spain and Switzerland.",
    "Amazon Lightsail's website is simple in design yet not short on looks. With its familiar layout and an abundance of information distributed throughout the site, you'll find a solution best fit for your needs without much difficulty. In addition to English, the site is completely translated into 15 different languages.",
    "There is also an official blog and what it lacks in terms of aesthetics it compensates with informativeness, quality writing and enthusiasm with which it publishes new content, most often on a day-to-day basis.",
    "Although with somewhat lesser enthusiasm, Amazon Lightsail keeps alive multiple social networking accounts including Twitter, Facebook, Twitch and YouTube. Hence, if you are a fellow user, be sure to check them out.",
    "Additionally, you can keep track of AWS' podcasts aimed at developers and IT professionals in search of the latest news and trends in storage, security, infrastructure, serverless computing, and so forth.",
    "Along with many providers of the same caliber, Amazon Lightsail hosting plans are billed using an on-demand hourly rate and as a result, you pay only for what you use. For each of their plans you decide to use, you will be charged the fixed hourly price which can only go up to the maximum monthly plan cost.",
    "The most budget-friendly option with Amazon Lightsail will cost you $3.50 per month (with Linux/Unix) and it includes 512 MB of memory, 1 core processor, up to 20GB of disk space (SSD) and 1TB of data transfer allowance (the limit is lower in Indian and Australian region at 0.5 TB).",
    "Currently, there are seven different-sized VPS plans for Linux (ranging from $3.50 to $160 per month) and the same number for Windows (from $8 to $240 for a month). Here, you can also purchase containers, managed databases, CDN, load balancer and block storage.",
    "Amazon Lightsail also provides a free trial with the least-expensive plans for Linux and Windows, and they are valid for 750 hours. However, be careful not to exceed the monthly limits, because that is the point at which the word \"free” will begin to lose its meaning. In other words, you'll have to pay by the standard pay-as-you-go service rates.",
    "As one might expect, there is no money-back guarantee, but you can cancel Amazon Lightsail's services at any time and pay for the past usage only.",
    "Methods of payment with Amazon Lightsail include all major credit cards, ACH direct debit (for customers from the USA) and SEPA direct debit (for customers from Europe). Oddly enough (and to the dissatisfaction of a number of their users), PayPal is not available.",
    "To start your story with Amazon Lightsail, you'll have to create your AWS account or log in if you already have one. What is important is that by signing up you can get an entire year of free tier access which includes a free trial of Amazon Lightsail's hosting packages (both for Linux and Windows) for a period of one month.",
    "Creating an AWS account runs as smoothly as possible, although it will require some time and a bit more personal information and involvement than one might expect. This includes providing your full name, home address, telephone number, postal code, all payment details and so forth. You’ll also be required to confirm your identity through verification via mobile phone where you can decide between a text message and a voice call.",
    "After this, you can finally choose a hosting plan and if you want to make use of their free trial before making further commitment, you’ll have to opt for a basic one.",
    "Amazon Lightsail’s interface is stripped down to the simplest form and is, consequently, inviting, intuitive and incredibly user-friendly. All you need to do is click on “Create instance” and decide on the details about your virtual server. These include picking a location (the nearest one will be marked), making a choice between Linux/Unix and Microsoft Windows, deciding if you want to have apps included, and which of those you want to come pre-installed and configured for you.",
    "If you want to make a WordPress site, here is where you can mark it to make things easier for yourselves. Besides WordPress you can select from LAMP, Joomla, Magento, MEAN, Node.js, Nginx, Durpal, GitLab CE, Redmine, Nginx and Plesk Hosting Stack on Ubuntu. In addition, you can add a launch script, change your SSH key pair or add automatic snapshots (point-in-time backups).",
    "In conclusion, you'll name your instance, click on \"create“ and wait a little while before your server is ready for action. Tech-savvy users will probably find everything from now on as easy as anything, however, everybody else may have trouble with some basic things such as pointing out your domain name to the server. If your domain isn't managed by Amazon, this may be even more complicated.",
    "If, all of a sudden, you feel an urge to upgrade your plan to a more ambitious one (or just the opposite), Amazon Lightsail has made this process pretty easy, and there are (fortunately) enough guides to make things even easier.",
    "With the amount of global data centers Amazon Lightsail provides, and the availability of solid-state drive and resources, we found it reasonable to expect lightning-fast speed performance. After testing the speed of AWS' main site (via Gtmetrix), we found out we were right to think so.",
    "The page fully loaded in 2.6 seconds (the average result being 8.1) and almost all of the vital web metrics were in the green zone, that is, pretty much above the average score. However, total blocking time (or the amount of time blocked by scripts during the page loading process) was an absolute disaster, requiring 665 milliseconds, while the recommended amount ought to be 150 or less. Nevertheless, Gtmetrix evaluated the overall speed performance of AWS' site with a B (83%) which is one of the better results we have seen so far.",
    "When it comes to uptime, Amazon Lightsail sets out a 99.99% guarantee backed by SLA. According to it, all of their users are entitled to be compensated from 10% to 100% depending on the downtime their site has suffered during the month in question. To test this out, we monitored uptime of AWS' main site (via UptimeRobot) for a whole month but all of our efforts were (fortunately) in vain, since we failed to record any downtime at all.",
    "If you find yourself stuck and want to stay self-sufficient, the first-and-foremost option will be AWS' knowledgebase, documentation center, FAQ section (for simpler issues) or their community forum. The knowledgebase and documentation are equally equipped with both informative and easy-to-follow articles, however, finding your way around might feel like doing chores.",
    "As for Amazon Lightsail's support staff, it can be reached via support ticket where they tend to respond within 24 hours. If you are a user of Amazon Lightsail's cheapest plan, that's about it, since its support is divided into four levels (Basic, Developer, Business, and Enterprise) and to get more support channels you are required to purchase pricier plans. Therefore, if you are prepared to pay a king's ransom, you'll be treated like a proverbial king by getting your own advisors, including technical account manager, short-termed infrastructure event management, proactive reviews, in-depth guides and so on.",
    "Round-the-clock telephone and chat support (included in most expensive plans) are not included in all languages supported on Amazon Lightsail's website.",
    "Those looking for a well-rounded VPS solution will find both Bluehost and Amazon Lightsail worthy of consideration. Amazon Lightsail offers VPS plans ranging from $3.50 to $160, easy upgrade/downgrade, hourly billing and a free trial, while Bluehost provides three VPS plans (where its cheapest option is considerably pricier than the cheapest one with Amazon Lightsail), month-to-month billing and a 30-day money-back guarantee.",
    "Much like Bluehost, HostGator offers a variety of hosting types, options and features, and all with a very beginner-friendly approach. However, in terms of pricing, the cheapest VPS package with Amazon Lightsail is comparable with shared hosting solutions with either of them. Therefore, if you are looking for a cheap and cheerful VPS solution, have some experience and don’t mind getting your hands dirty, Amazon Lightsail is a number one pick. If that is not the case, you’re better off with Bluehost or HostGator.",
    "Like Amazon Lightsail, DigitalOcean is best suited for somewhat tech-savvy users who can deal with “non-existent” customer support so they can deploy a cloud infrastructure without doing much damage to their budget. Both offer free trials, so you can check everything out for yourselves before committing to either of them.",
    "GreenGeeks is one of the most popular picks for VPS, as well as the industry's leading eco-friendly web hosting provider. Although their VPS packages are not as pocket-friendly as those with Amazon Lightsail, you’ll be getting an amazing array of features (free SSL certificate, free website transfer, user-friendly cPanel and superb 24/7 managed support being some of them) and an opportunity to help our planet along the way.",
    "Amazon Lightsail provides an easy path for all those who want to learn more about cloud hosting or get themselves integrated into the AWS ecosystem. Their VPS hosting solutions are simple to set up and are easily scalable to meet most needs, but those who want to launch mission-critical high-performance websites should keep their options open for now.",
    "We advise the same to newcomers working on a tight budget, since Amazon Lightsail’s staff won’t try to spoil you with sensible support unless you’re willing to pay top dollar. Thankfully, there is a 30-day free trial, so you can set up your instance, install all the apps you want and check how everything works before shelling out your hard earned cash."
  ],
  "headers": {
    "6": "Plans and pricing",
    "12": "Ease of use",
    "19": "Speed and experience",
    "22": "Support",
    "25": "The competition",
    "29": "Final verdict"
  },
  "links": {
    "Amazon Lightsail": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1032061475266905900&xs=1&url=https%3A%2F%2Faws.amazon.com%2Flightsail%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Famazon-lightsail",
    "AWS": "https://www.techradar.com/news/aws",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "DigitalOcean": "https://www.techradar.com/reviews/digitalocean",
    "GreenGeeks": "https://www.techradar.com/reviews/greengeeks",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel"
  }
}