{
  "source": "https://www.techradar.com/reviews/level-access",
  "title": "Level Access review",
  "category": "computing",
  "updated": "2021-06-16T04:50:54Z",
  "author": "jonas-p-demuro",
  "summary": "A roadmap to an inclusive digital experience",
  "verdict": "Level Access is clearly a competent partner to navigate the complicated world of compliance with ADA requirements to make content available to all. While it has plenty going for it, we give it pause for the lack of objective user reviews after decades in the space, and the totally opaque pricing model.",
  "pros": [
    "Free risk assessment",
    "AMP software",
    "Access to Accessibility Experts"
  ],
  "cons": [
    "Limited support options without hours listed",
    "Lack of user reviews",
    "Opaque pricing"
  ],
  "article": [
    "Level Access is a private company that was founded in 1997, and through the many years has worked with over 2,000 organizations, including government agencies, private corporations and schools to increase their digital accessibility with the goal of digital equality for all users, specifically the elderly, and people with disabilities. It has been on Inc.’s list of the 5000 Fastest Growing Companies for several years, and in 2014 got designated with the prestigious White House “Champion of Change” award.",
    "The company headquarters are based in Vienna, Virginia. Level Access has a number of notable clients that includes Adobe, Costco Wholesale, Nike and the Federal Communications Commission.",
    "At its core, Level Access provides web accessibility services to increase access to websites for users, which also includes compliance with applicable regulations and laws. The services offered include:",
    "The process starts with a free risk assessment which matches the potential client up with an ‘Accessibility Expert,’ your website gets an objective assessment with Level Access’ proprietary accessibility tools, and a report gets generated for potential issues with resources provided to choose a digital accessibility vendor.",
    "Level Access indicates that it has expertise in multiple industries. This encompasses education, financial services, eCommerce/retail, healthcare, hospitality/travel, public sector, and technology. For example, in the healthcare sector, it is pointed out that healthcare websites, whether from a provider, hospital or insurance company need to be accessible to all to eliminate barriers to those with disabilities receiving healthcare. A specific issue is that at an urgent care center, if you have a check in kiosk, it would need to be accessible to a patient with low vision, including options to allow the patient to zoom in, and also for it to offer text to speech functionality. Another example given, is that videos offered by an insurance company would need closed captioning in order to be accessed by hearing impaired patients.",
    "There is plenty of expertise provided by Level Access in dealing with compliance with the complicated regulations to accommodate those with disabilities. Much of the centers around the Americans with Disabilities Act (ADA), often in response to a letter, or in situations where there could be potential exposure to ADA compliance litigation. The situation can arise from a potentially inaccessible website or an issue with the mobile app. This is also in response to the exponential growth lawsuits due to web accessibility issues that has reached an average of one every hour across the United States. Also, for those organizations that have been through such a lawsuit, they are hardly immune, with Level Access pointing out that “More than 1 in 5 lawsuits in 2020 were repeats against the same organization.”",
    "A popular software offering from Level Access is its Accessibility Management Platform, which gets dubbed ‘AMP.’ This is designed to act as an “Organizational Command Center,” that then provides, via unlimited scans on unlimited pages, tools that can test pages for their accessibility. It can even provide automated tests for PDF content, or pages that are in development so issues can be addressed at an early stage, rather than requiring a redesign.",
    "Getting reviews from users of Level Access is a bit of a black box. The internet search engines simply did not find any. Furthermore, looking at the social media pages linked on the Level Access main page, which sent us to YouTube, Facebook, Twitter, and LinkedIn did not find any user reviews either, although the Facebook Level Access was not publicly available, and the YouTube channel had comments disabled on a significant number of videos.",
    "The pricing for Level Access is not listed on its website, and is completely opaque. Apparently, and not surprisingly, the services get priced out at what the organization needs from this company. Searching the internet did not find us any pricing information either, so contact with the company is a requirement to quote the services out.",
    "Getting in touch with Level Access is simple enough, and the toll free phone number is put prominently on the website in the upper right hand corner. There is also a direct email address listed, and there is also a web portal to enter company information to establish contact. Finally, there is a physical address listed for snail mail. The hours for contact are not listed.",
    "However, while Level Access has the basic contact methods all covered, it simply ends there. They are lacking a chatbot, and forums. However, we did find other support which includes online videos, resource whitepapers, eBooks and webinars on its site.",
    "Web accessibility is an important topic, and Level Access provides a crucial service for increasing accessibility of digital content to all individuals. The pros cover the expertise across a variety of industries, a free risk assessment, the AMP software for automated scans and reports, and the wide breadth of services that include web remediation, and legal compliance issues. The cons to be factored in encompass the totally opaque pricing, the complete lack of user reviews, and the limited support options. Putting this all together, Level Access offers a full variety of services that cover a large spectrum of industries, with a high level of expertise to help in navigating this complex, yet critical area."
  ],
  "headers": {
    "2": "Services",
    "7": "User reviews",
    "8": "Pricing",
    "9": "Support",
    "11": "Final verdict"
  },
  "links": {
    "Level Access": "https://www.levelaccess.com/"
  }
}