{
  "source": "https://www.techradar.com/reviews/ipad-102",
  "title": "iPad 10.2 (2019) review",
  "category": "tablets",
  "updated": "2021-06-07T20:00:38Z",
  "author": "matt-swider",
  "summary": "Apple’s cheapest iPad gets a slightly bigger screen",
  "verdict": "The iPad 10.2 (2019) is Apple’s refreshed and still-reasonably-priced iPad with a marginally bigger screen, Smart Keyboard Cover compatibility, and extra RAM. Even though it’s not very different from last year’s iPad 9.7, which now also runs iPadOS, this 7th-gen iPad continues to be brilliant at the basics.",
  "pros": [
    "Great price for a new iPad",
    "Slightly bigger screen",
    "Works with Smart Keyboard Cover"
  ],
  "cons": [
    "Marginally better than iPad 9.7",
    "Older iPads may be cheaper",
    "iPad Air is superior for sketching"
  ],
  "article": [
    "The iPad 10.2 continues from where its predecessor, 2018's entry-level iPad 9.7 left off: offering Apple’s best value for a brand-new iPad at a ridiculously reasonable price – and a price that’s often discounted by third-party retailers.",
    "This isn't the newest member of Apple's entry-level iPad family - that's the new iPad 10.2 (2020). The new tablet is the same size as the one you're in the review for, but with a few spec improvements.",
    "We’d describe the 2019 iPad 10.2 in three succinct ways: bigger, budget and basic. New is the 10.2-inch display that’s marginally bigger than the classic 9.7-inch screen size of the predecessor. Every fraction of an inch helps if you’re planning to use Split View on iPadOS, and the actual iPad dimensions aren’t much larger.",
    "There’s also compatibility with Apple’s fabric Smart Keyboard Cover, which we’ve always found to work better than often-unreliable Bluetooth keyboards, no syncing or charging needed. It simply snaps onto Apple’s Smart Connector (the first time the pogo-pin port has appeared on a basic iPad). Note: the keyboard is sold separately, as is the Apple Pencil, and it’s quite expensive.",
    "That’s basically it. Besides having more RAM tucked into the iPad 10.2, you won’t find any other upgrades over the iPad 9.7 from March 2018, and that’s okay. Most people don’t need all of the premium bells and whistles of the bezel-reduced iPad Pro 11 and iPad Pro 12.9, or have a need for the thinner, laminated display of the 10.5-inch iPad Air 2019 (though we highly recommend this version if you’re serious about sketching with the Pencil).",
    "What’s important is that the iPad 10.2 can do all of the basics – and a bit more than you may realize thanks to the iPadOS update. In our tests, it ran all of the same apps, supported hardware-intensive augmented reality (AR) games, displayed the tweaked home screen, and even acted as a second Mac display thanks to the macOS Catalina ‘SideCar’ feature.",
    "Buying the iPad 10.2 is a no-brainer if all you need is a brand-new iPad – and can find it at the same price as last year’s iPad. That’s going to be our one caveat for everyone.",
    "If you find the older iPad model at a great price it would make sense to buy it, given so little has changed. But, on an even price playingfield, there’s just enough here to ensure that this year’s entry-level iPad continues to be brilliant at the basics.",
    "Update: iPadOS 15 has been unveiled for tablets, and the iPad 10.2 is one of them. Apple's new operating system update, coming towards the end of the year, brings an app library, changes to multitasking and improvements to widgets.",
    "The iPad 10.2 was a surprise announcement at Apple's iPhone 11 launch event, and its official release date was September 29, 2019. It actually started shipping early for some people on September 25, the day after the iPadOS update came out.",
    "The most important thing is how much it costs: the iPad 10.2 price starts at $329 (£349, AU$529) for the rather-limited 32GB version, and $429 (£449, AU$689) for the 128GB version. You can get away with just 32GB if you plan on streaming most things and using iCloud.",
    "Serious work from the iPad 10.2, with a desire to save and edit photos and video, begs for the 128GB version, and maybe investment in the Smart Keyboard Cover $159 (£159, AU$235), the Apple Pencil $99 (£89, AU$145), or maybe the cellular version of this iPad starting at $459 (£479, AU$729). Even for the ‘cheap iPad’ things can add up when you go for the extras.",
    "It's worth pointing out that during deals and sales periods - take for example, Black Friday or Cyber Monday- the price of the iPad 10.2 can go down a little. We'd recommend checking out our best iPad Black Friday deals article when the time is right for deals.",
    "This is the 7th-generation iPad and it shows, with a solid-feeling, yet familiar design that, at first blush, looks as if it hasn’t changed in several years. There’s a durable aluminum shell, glass on top, and the traditional home button. It comes in three colors: Silver, Gold and Space Gray.",
    "New this year, Apple has made its iPad enclosure from 100% recycled aluminum, and it grew ever-so-slightly thanks to the 10.2-inch screen size. The height and width are actually identical to the bigger 10.5-inch iPad Air 2019 – it’s just not as noticeably thin and light as the Air.",
    "The Smart Connector is the biggest perk if you plan to upgrade. It makes the iPad 10.2 the cheapest iPad to work with Apple’s Smart Keyboard Cover, Logitech’s Slim Combo Keyboard Case and a few other accessories. They never need to be charged and they pair instantly.",
    "The iPad 10.2 uses the same Smart Keyboard as the new Air, so we already knew we loved the one-piece laser-etched fabric keys. They’re water- and stain-resistant, and impervious to debris. Last iPad review we ate a crumbly croissant and easily wiped away the many pieces that didn’t make it into our mouths. This time, same deal, but with Doritos. Again, it checks out by cleaning up nicely.",
    "We do have reservations with Apple’s Smart Keyboard. It’s expensive and none of the keys are backlit. That makes it hard to use in the dark (think: college students who have roommates and are pulling all-nighters on projects with the lights turned off). There are more shortcuts as part of the iPadOS update, but none of the 64 keys are customizable like they are on a MacBook.",
    "There’s exactly half an inch of extra display real estate on the iPad 10.2, and we found it to be a modest improvement over the classic iPad screen size. It won’t change your life or your viewing habits, but it’s nice to see more screen-to-body value from the entry-level iPad.",
    "What’s important is that Apple increased the LCD’s resolution to keep the same pixel density as its iPad predecessors, so it continues to look great in its stretch to 10.2 inches. It’s colorful, bright and supports the Apple Pencil, the latter being a new feature as of the iPad 6th gen.",
    "This makes the new iPad a fine choice for watching Netflix and playing mobile games (see: our Apple Arcade review), and its 4:3 aspect ratio is primed for reading. That extra half-inch does come in handy with iPadOS changing up the home screen and pushing Split View, or if you use macOS Catalina’s ‘Sidecar’ feature that turns your iPad into a second Mac display.",
    "You are, however, going to get more out of the 10.5-inch iPad Air if you plan to seriously use the Apple Pencil. Its fully laminated display reduces the gap between the screen and glass, so you feel as if you’re drawing directly on the display. The iPad 10.2 screen isn’t pressed up against the glass so tightly, making the Pencil tip feel as if it’s floating a bit.",
    "We found the new iPad 10.2 capable of handling the same rigorous apps, high-end 3D games and light video editing as the iPad 9.7 in our tests. That’s not a big surprise since it contains the same A10 Fusion chipset, which also happens to power the iPhone 7 and iPod touch 7th gen.",
    "Apple did increase the memory from 2GB to 3GB of RAM in a year’s time, and we did see better Geekbench multi-score results: (5,921 on the iPad 9.7 vs 6,047 on the iPad 10.2). So the A10 chipset is aged-but-completely-adequate for the basic iPad. Our desire is for more internal storage than the given 32GB or 128GB is more pressing and sorely missed.",
    "Its extra RAM is a modest upgrade, but all the more important as Apple pitches the 2-in-1 form factor using the Smart Keyboard as a laptop replacement for some people. Yes, you’ll get more grunt and video editing power out of the iPad Air and iPad Pro, which have A12 and A12X chipsets, respectively. But at this price point, you can’t complain about lag-free performance.",
    "The iPad 10.2 has an unchanged 8MP rear camera that’s serviceable for capturing photos and videos. But serious photographers should rely on their smart-HDR-equipped iPhone and avoid using the 1.2MP selfie camera that looks soft and blows out backgrounds.",
    "More importantly for a tablet, the camera acts as a fully operational AR gaming tool. We tested it using new Pokemon Go-like Harry Potter: Wizards Unite and robot-filled multiplayer affair Machines. It’ll become a nicely-sized 10.2-inch window into the world of Minecraft Earth too.",
    "The iPad 10.2 offers the first taste of the iPadOS software update for a lot of people, especially those upgrading from the iPad 4 and original iPad Air that are forever stuck with iOS 12.4.1.",
    "iPadOS makes multi-window app support more robust with Slide Over and Split View easier to manipulate, and the new App Exposé helpful for realizing all of the apps that are open. Long overdue: the ability to have two of the same apps open side-by-side. It’s finally here.",
    "That new home screen boils down to you being able to pin the Today View widgets, previously on the left-most screen, right next to the first set of apps. It’s not as dramatic of a change as we’d hoped when first hearing the words ‘new home screen’, but seeing your next calendar appointment and the weather forecast at a glance is positive nonetheless.",
    "The biggest iPadOS change is actually one that arrives with the macOS Catalina update. It’s called ‘Sidecar’ and it made our iPad 10.2 a fully-functional second screen when we tested it with our MacBook Pro. We were able to offload Slack and spreadsheets from our main monitor to the iPad, treating it as a second display in a tight New York City coffee shop.",
    "Sidecar makes carrying an iPad a must for productivity-focused travelers. Ever wish your laptop had a second monitor when you were on the road? This is the solution you’ve been waiting for. And at its rock-bottom price, the iPad 10.2 is going to make an ideal choice to fill this need.",
    "Here’s another way that the new iPad 10.2 hasn’t changed, and we’re thankful: it has the same excellent battery life we found in the iPad 9.7. It’s again rated for 10 hours of video playback or web surfing, and we found that to be true in our tests.",
    "Moreover, the iPad lasted us a solid three days with intermittent use – playing games, watching two shows on Netflix and writing this review using the Smart Keyboard. We did see that battery percentage took a hit when we were playing AR games, as expected, but overall it held up when we used it for half of our work day – roughly four hours a day.",
    "We have good news and bad news to report based on our recharging tests: the iPad 10.2 takes forever using the included 12W charger. You’re going to need nearly four hours to go from 0% to 100%. In an age where new iPhone 11 Pro phones come with an 18W fast-charger in the box and charge full in a little over 90 minutes, this feels painfully slow.",
    "Here’s the good news: when we swapped out the 12W charger for Apple’s 30W USB-C charger, (the one that comes with the iPad Pro) we were able to get much faster charging speeds. You can even use the 18W iPhone Pro charger to juice back up more quickly.",
    "So the iPad 10.2 is fast-charge compatible, which is something we found out about the iPad Air and iPad mini 5 earlier this year. But all come with 12W iPad 4-era adapters, so you need to make an investment – or borrow a higher-watt iPhone, iPad or Mac charger."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "iPad 10.2 release date and price",
    "13": "Design",
    "18": "Display",
    "22": "Specs, performance and camera",
    "27": "iPadOS and apps",
    "32": "Battery life",
    "37": "Don't buy it if..."
  },
  "links": {
    "iPad 9.7": "https://www.techradar.com/reviews/new-ipad-2018-review",
    "new iPad 10.2 (2020)": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "iPadOS": "https://www.techradar.com/news/ipados-release-date-and-news",
    "iPad Pro 11": "https://www.techradar.com/reviews/ipad-pro-11",
    "iPad Pro 12.9": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "iPad Air 2019": "https://www.techradar.com/reviews/ipad-air-2019",
    "macOS Catalina": "https://www.techradar.com/news/macos-catalina-is-here-everything-you-need-to-know-about-macos-1015",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "best iPad Black Friday deals": "https://www.techradar.com/uk/black-friday/black-friday-ipad-deals",
    "Apple Arcade review": "https://www.techradar.com/reviews/apple-arcade",
    "Minecraft Earth": "https://www.techradar.com/news/minecraft-earth-takes-the-original-game-and-blends-it-with-pokemon-go",
    "iPad 4": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-4-1107194/review",
    "original iPad Air": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-air-1191350/review",
    "iOS 12.4.1": "https://www.techradar.com/news/ios-12",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro"
  }
}