{
  "source": "https://www.techradar.com/reviews/sonos-amp",
  "title": "Sonos Amp review",
  "category": "audio-visual",
  "updated": "2021-09-22T09:29:44Z",
  "author": "tom-parsons",
  "summary": "Punchy sound for movies and music",
  "verdict": "It’s not quite as hi-fi as hoped, but we think the amp is still the best-sounding Sonos yet.",
  "pros": [
    "Fun, punchy sound",
    "Open and spacious",
    "Works beautifully with a TV"
  ],
  "cons": [
    "Slight lack of hi-fi sophistication",
    "Pricey"
  ],
  "article": [
    "Sonos has been focused on all-in-one streaming speakers for so long, it’s easy to forget that it started out building devices designed to work with other hi-fi kit.",
    "In fact, so long has it been since the company’s Connect products (the Connect and Connect:Amp) were lavished with any attention, we were fairly sure that chapter in the company’s history was destined to stay in the past, with the present and future dedicated to super-simple and convenient one-box solutions.",
    "Well, more fool us, because not only has Sonos finally seen fit to revisit its roots, it’s done so with the most hi-fi-like product it’s ever produced – and one that even embraces the custom install market that Sonos itself was originally conceived to circumvent.",
    "So, does that make the just-add-speakers Sonos Amp a return to the company’s roots or an about-turn in approach? Honestly, it doesn’t really matter. What matters is that it’s the best-sounding, most serious and yet most flexible Sonos product yet.",
    "The Sonos Amp is available to buy right now for $699 / £699 / AU$1099 - and yes, that price has increased since it launched in 2019, when it cost $699 / £599 /AU$999. Of course, if you don’t already have a pair of capable speakers to connect to it, you’re also going to have to budget for those.",
    "We’d recommend setting aside at least $200 / £200 / AU$250 for speakers, but the best stereo speakers can vary wildly in price, ranging from around $100 / £100 / AU$150 to well over $1,000 / £1,000 / AU$1,350.",
    "The Amp’s appearance is at once more serious and more svelte than that of the Connect:Amp. In terms of volume it’s very marginally the smaller of the two, but its proportions are markedly different, with its shorter, deeper and slightly wider design making it better suited to placement on a hi-fi rack or being hidden out of sight.",
    "The new dimensions are apparently borne of conversations that Sonos has been having with custom installers, who’ve long used the Connect:Amp in customer setups, despite that never really having been its intended use.",
    "These same conversations have lead to the Amp being stackable, so that a tower of them can be created and hidden in a central location, with speaker cables snaking into various rooms of the house.",
    "We can’t imagine many non-audiophile buyers finding themselves with the need or desire to stack Amps, but it’s an option all the same.",
    "Sonos products have always been intentionally inconspicuous in design, but the Amp is the stealthiest yet.",
    "Only available in matte black and with just three, touch-sensitive ‘buttons’ on the front (play/pause and two that are context-sensitive, but usually used for changing volume), it blends in incredibly well.",
    "You won’t hear it in action, either, thanks to a chimney-like design that passively keeps the densely-packed innards cool and quiet.",
    "Predictably, the rear of the Amp is where you’ll find its connections, which are almost identical to those of the Connect:Amp. You get a pair of speaker terminals, of course, two ethernet sockets (the amp can act as an ethernet bridge for other devices, should you require), a stereo analogue input, and a subwoofer output.",
    "It’s perhaps the latter that’s most interesting, because it means you can add a sub to an Amp-based system without the need to fork out for Sonos’s own, expensive, wireless Sub.",
    "But yet more interesting and useful is the addition of an HDMI socket that gives the Amp all of the TV-partnering features of the dinky Sonos Beam soundbar.",
    "Plug the Amp into your TV and HDMI-CEC will be used so that the two become interoperable: the Amp will automatically switch to TV sound whenever you turn on your TV, and your telly’s remote will change the Amp’s volume, for example. There’s almost no setup required, and the result is a seamlessly integrated AV system.",
    "Like the Beam, the Amp is intended for quite simple systems with only a couple of sources that are connected directly to the TV, with the audio then being stripped out and sent to the Amp via HDMI ARC.",
    "That will make it too limiting for power users with umpteen sources, but that’s sort of the point.",
    "That said, ‘proper’ surround sound is an option, should you want it. You can either, as you can with Sonos’s soundbars, add two of the company’s speakers (Play:1s make the most sense), or you can add a second Amp and two standard, passive speakers of your choosing.",
    "The latter is actually the better choice, sonically speaking, as it enables you to create a system using four identical speakers, or at least four from the same range. That will make for a far more consistent surround sound presentation than mixing traditional hi-fi speakers and Sonos’s wireless speakers.",
    "And yes, we really are talking four-speaker systems here: the Amp is designed to work without a dedicated centre channel. Instead, it creates a so-called ‘phantom’ centre through clever processing.",
    "Surround-rear and Dolby Atmos setups are predictably unsupported, too. 4.0 or 4.1 (with a subwoofer) is the maximum system possible, and we think that will suit the intended audience just fine.",
    "At the other end of the audio spectrum, the Amp can also be set to output in dual mono, so each of the two speakers connected to it receive the full, stereo signal. This can be useful if you’re using the Amp to power ceiling or outdoor speakers from which you’re not intending to create a proper stereo image.",
    "On the subject of ceiling and outdoor speakers, Sonos has partnered with Sonance to create a range of speakers under the Sonos Architectural by Sonance banner.",
    "It’s important to note that these are not typical Sonos speakers - they’re simply passive speakers designed to work well with Sonos components from aesthetic and audio perspectives.",
    "If you connect the Amp to a pair of Sonance speakers, you can use the Trueplay feature to tune the sound to your room. With other speakers this isn’t possible.",
    "Generally speaking, though, the Amp is designed to be very flexible when it comes to partnering speakers. The biggest improvement in this regard over the Connect:Amp is an increase in power from a very respectable 55W to a genuinely substantial 125W. That makes it far more capable of powering bigger, more demanding speakers.",
    "It’s got some proper hi-fi credentials, then, but the Amp also has all of the music streaming skills of its siblings in the Sonos family.",
    "That means it can play practically all of the music under the sun, from more or less every music streaming service you’ve ever heard of (and a load you haven’t), and can work in concert with other Sonos devices to fill your entire house with tunes.",
    "The Sonos app is as fluid and intuitive as ever, and still leagues ahead of the oceans of imitators, but the company is moving more and more towards a hands-free future.",
    "The Amp doesn’t have microphones built-in, but it will respond to commands issued via Alexa- or Siri-powered devices. Spotify Connect and AirPlay 2 are on board, too, so you need never open Sonos’s own app should that be your choice.",
    "Overall, Sonos is simply the best at multi-room music streaming, and the Amp doesn’t change that.",
    "The one potential oversight in the eyes of the serious hi-fi crowd will be the continuing lack of hi-res music support, but we don’t imagine many people in Sonos’s target market being overly put off.",
    "Having done the legwork so you don’t have to, we can confirm that the Sonos Amp is capable if driving a wide variety of speakers. Even a pair of fairly huge, $9,00 ATC SCM50s don’t sound under-driven.",
    "That said, the Amp doesn’t really have the subtlety or nuance to do real justice to a speaker such as that, and a pair of quality speakers in the $200-$400 range makes the most sonic sense.",
    "The $200 (£199 / around AU$370) Elac B5.2s are a good choice, or, if you can stretch the budget a bit, the diminutive B&W 607 standmounters ($600 / £400 / around AU$750) or the similarly priced Fyne Audio F302 floorstanders work wonderfully.",
    "Once you’ve connected your chosen speakers, it’s worth experimenting with the Loudness feature, which you’ll find in the Room Settings section of the app and which is switched on by default.",
    "In our experience, turning it off results in a slightly subtler, more nuanced delivery, but with your specific speakers in your specific room, the Amp may sound better with Loudness left on.",
    "Once that’s settled, you can get into the real business of enjoying your music – and enjoy it you will. The Sonos Amp majors on entertainment, delivering everything you send it with thrilling punch and attack.",
    "Not that the presentation is all bark and no bite: there’s detail behind the initial hit of each note and an overall tonal balance, from deep, textured bass to sparkly, never bright treble, that makes the Amp a fun and faithful friend to all genres of music.",
    "It’s an impressive movie machine, too. That phantom centre speaker works well, delivering more focus than typical two-channel systems can manage, particularly when it comes to dialogue.",
    "But the overall soundstage is also fabulously broad and spacious, delivering atmosphere in spades, yet with individual effects that are precisely placed in three-dimensional space.",
    "All of that said, the Amp isn’t perfect, and compared to the best-sounding streaming components (the Bluesound Powernode 2i, for example), it’s just a touch unsubtle. That low-level dynamic nuance that really conveys the emotion of a track is missing, and the result is a presentation that doesn’t satisfyingly reward repeated, analytical listening.",
    "It can get a bit flustered by the most built-up sections of a track, too, such as the chorus to Alt-J’s 'Every Other Freckle', which sounds messy and disorganized, rather than precisely arranged.",
    "Perhaps that level of hi-fi sophistication isn’t what you’re looking for, and that’s fine, but the Amp’s premium price and premium ambitions warrant premium comparisons, and the truth is that there are alternatives out there that can better organize a track and transport you to the emotional core more effectively.",
    "Let there be no doubt; paired with a good pair of speakers, the Amp is the best-sounding, most hi-fi like component Sonos has ever produced. But it’s also typically Sonos in the way it’s a joy to use and live with.",
    "What’s surprising is how excellent it is when used in conjunction with a TV. Certainly, if you’re already eyeing up a Playbar or Playbase, we urge you to consider the Amp and a pair of speakers instead.",
    "The outlay will be a bit higher, but you’ll end up with a system that sounds substantially better and also integrates with your telly way more effectively.",
    "But for all it’s strengths, we can’t help but criticize the Amp for a slight lack of subtlety when compared to the best streaming components of a similar price and good hi-fi components that cost much less.",
    "The Sonos Amp is oodles of fun, but it doesn’t quite deliver the subtlety and sophistication that you’re entitled to expect when spending this sort of money on hi-fi kit.",
    "All that being said, there are lots of reasons you might choose Sonos over a rival such as Bluesound as a whole-house system, and if you’re firmly in the Sonos camp but looking for something a bit more serious, the Amp will likely demand your attention."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "13": "Features",
    "34": "Performance",
    "46": "Final verdict"
  },
  "links": {
    "best stereo speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "conversations that Sonos has been having with custom installers": "https://www.techradar.com/news/first-look-sonos-amp",
    "Sub": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-sub-1082735/review",
    "Sonos Beam soundbar": "https://www.techradar.com/reviews/sonos-beam-review",
    "Play:1": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-play1-1189345/review",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Sonos Architectural by Sonance": "https://www.techradar.com/news/sonos-new-outdoor-speaker-lets-you-take-the-party-outside",
    "Elac B5.2s": "https://www.whathifi.com/reviews/elac-debut-b52",
    "B&W 607": "https://www.whathifi.com/reviews/bandw-607",
    "Fyne Audio F302 floorstander": "https://www.whathifi.com/fyne-audio/f302/review",
    "Bluesound Powernode 2i": "https://www.bluesound.com/products/powernode-2i/",
    "Playbar": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-playbar-1130807/review",
    "Playbase": "https://www.techradar.com/reviews/sonos-playbase"
  }
}