{
  "source": "https://www.techradar.com/reviews/sumatra-pdf-reader",
  "title": "Sumatra PDF review",
  "category": "computing",
  "updated": "2021-09-28T03:39:36Z",
  "author": "collin-probst",
  "summary": "A fast, lean PDF viewer with some extra tricks hidden up its sleeve",
  "verdict": "If you don’t need every feature of a full fledged PDF Editor, Sumatra might just be a perfect fit.",
  "pros": [
    "Clean interface",
    "Minimalist",
    "Speedy"
  ],
  "cons": [
    "Very hard to make changes to preferences",
    "Not a full blown editor"
  ],
  "article": [
    "Whenever a specific brand of a product becomes immensely popular, it becomes the standard. For example, Kleenex is the standard in the tissue world. Everything is compared to the Kleenex in one way or another. Everyone knows Kleenex. In some ways, Kleenex and tissue are — though wildly inaccurate — near synonymous.",
    "The same can be said about PDF readers and editors with Adobe Acrobat Reader. Everyone knows Adobe Acrobat Reader, and while conversations about PDF readers do not plague the streets, Adobe Acrobat Reader seems to be the yardstick with which the PDF world is measured. What is truly remarkable though, is that just because it is the best known does not make it the best. Adobe Acrobat Reader is great at a lot of things, but regarding speed, it has given PDF readers a bad name. PDF readers, as technology advances, have gotten leaner, faster, stronger, and smaller. Sumatra PDF is the textbook example of the PDF readers of today. It is ridiculously fast, remarkably lightweight, and all around really cool — there’s no better way to say it.",
    "The fascination for the best has always been in us. We want to find the best or fastest way to get something done — even though best does not always mean most well known.",
    "Reading the abilities Sumatra has, the real shock comes with the price tag. The sheer seamless nature of the boasted features is astounding. So, the price tag of $0.00 came as a complete and total shock — however warmly accepted.",
    "Right off the bat, the “boot speed” or speed at which this program launched will be surprising. Especially in light of other big name companies’ startup times. Yet, though the literal start was impressive, that does not mean that Sumatra is out of tricks just yet.",
    "Sumatra PDF is designed to help with PDFs and EBooks of all kinds. One of the best parts of Sumatra is the organization aspect. Allowing for a customized library of EBooks all within this lightweight application. If Sumatra becomes a digital library of one’s collection of books, the ability to take said collection with them would be incredibly helpful. That is where Sumatra comes in handy yet again with another feature. Sumatra is designed to be transportable via USB drive. Meaning one could take their E-Library with them with merely a USB drive.",
    "To allow for the best EBook experience, Sumatra can view a handful of file formats. These include PDF, EPUB, XPS, CHM, MOBI, CBZ, CBR, and DjVu. Additionally, if you are reading a book and want to get back to it quickly, Sumatra has a recently viewed window that opens with the application, allowing you to get back to your digital story quickly and efficiently.",
    "As a true PDF reader, Sumatra is about as smooth as it is with EBooks. Simply opening a file with Sumatra works wonderfully for a plethora of file types. Once opened, it’s as simple as reading and scrolling. If more features are desired, there is a quick toolbar with a few key tools.",
    "If more customization or setting adjusting is desired, the only way to make these changes is via the HTML code. If the first thought that comes to mind is why would it be that difficult when everything else is so easy, you’re not alone. While everything else seems to be remarkably easy and straightforward, any advanced setting changes prove remarkably difficult.",
    "Nevertheless, Sumatra is still one of the more impressive light PDF readers. What it lacks in robust, feature packed menus and add-ons, it makes up for in its simplicity and ease of use for the basic use case. One of the additional features that can come in handy for a few scenarios that come to mind is the choice to email the viewed files directly from Sumatra. For anyone who might frequently proof PDFs before sending off via email to a coworker, superior, or subordinate at work, this could be a phenomenal timesaver. In a world where time is money, every second saved can be a huge advantage.",
    "This is not the PDF reader for everyone. Applications as robust and comprehensive as Adobe Acrobat Reader have their lane in the marketplace. Yet, not every individual looking at PDFs needs to be able to manipulate the intricacies of the font and letter spacing of the footnote. So, for those looking for the basics — but the basics done very well — Sumatra PDF is a wonderful solution."
  ],
  "headers": {
    "3": "Plans and pricing",
    "4": "Interface",
    "7": "In Use",
    "10": "Final verdict"
  },
  "links": {
    "PDF readers": "https://www.techradar.com/news/the-best-free-pdf-reader",
    "Sumatra PDF": "https://www.sumatrapdfreader.org/free-pdf-reader",
    "USB drive": "https://www.techradar.com/news/best-usb-flash-drives"
  }
}