{
  "source": "https://www.techradar.com/reviews/startpage",
  "title": "Startpage search engine review",
  "category": "computing",
  "updated": "2021-05-25T04:46:55Z",
  "author": "sofia-wycislik-wilson",
  "summary": "A search engine that makes big claims about protecting user privacy",
  "verdict": "Startpage is a privacy-focused search engine that aims to deliver search results that are as good as Google's without any of the unwanted tracking, third-party cookies or targeted ads. While the service delivers on these claims, quitting Google may be difficult for some users.",
  "pros": [
    "No user tracking",
    "Contextual instead of behavioral ads",
    "Anonymous View lets you visit sites completely anonymously"
  ],
  "cons": [
    "Lack's Google's helpful info boxes",
    "Based in one of the Nine Eyes countries"
  ],
  "article": [
    "In the world of search engines, Google is undeniably king. It is not without good reason that the company's name has become a synonym for searching, after all. But Google is a company that makes its money, largely, from advertising, and the collection of user data plays an important role in delivering carefully ads at people.",
    "This is one of the reasons there are privacy concerns about the search engine, and one of the reasons alternatives such as Startpage exist. \"Google\" and \"Privacy\" are not, generally speaking, words that people tend to associate with each other.",
    "But Startpage's relationship to Google is interesting. Despite pitching itself as an alternative to Google and as a search engine with a focus on privacy, it actually makes use of Google search. So does turning to Startpage mean getting the best of both worlds? Is it possible to enjoy the power of Google without the negative side effects? This is precisely what Startpage claims to offer – specifically, \"Google search results with added privacy protection\".",
    "And the search engine does indeed offer search results that are the same as Google. But while the results are the same – something for which Startpage pays – there are some differences. First of all, using Startpage seems very slightly – albeit noticeably – slower than Google. In recent years, Google has started to adorn its famously sparse result pages with helpful info boxes displaying everything from information about celebrities you search for, to summaries and reviews of movies. Similar page additions are to be found in Startpage's results, but they are presented differently and some come from different sources to Google's.",
    "Of course, as is the case with any company, particularly one that needs to pay a giant like Google in order to exist in the form it does, Startpage has to make money. Like Google, the company does so through advertising. So how does this sit with the idea of \"Google search results with added privacy protection\"?",
    "Startpage points out that a key difference between its business model and that of Google is that while it displays advertising to users, it does so in a very different way. The ads you see in a Startpage search are contextual (i.e. based on keywords that you have searched for) rather than behavioural (i.e. your search and browsing histories) meaning there is no tracking of users or building up of user profiles.",
    "For anyone with concerns about companies building up user profiles based on online activity, this is great news, and only really something that will prove problematic for people who are keen on the idea of seeing ads that are very specifically tailored to them. In reality, however, few people will mourn the loss of creepily knowing ads, and will be happy to see more generic, search-term-related ones instead.",
    "There is further good news for privacy advocates. In addition to its pleasing contextual rather than behavioural advertising, Startpage also neglects to record the IP addresses of its users. But the site takes things even further with its Anonymous View option which – unsurprisingly – makes it possible to visit sites completely anonymously.",
    "This is made possible by rerouting traffic through a proxy, and it is delightfully easy to use. The feature can be accessed from any page of search results rather than being a setting that has to be enabled or a mode that has to be activated. Clicking a standard link in Startpage's result will enable you to visit the site in question normally. But if you click the mask icon that appears next to every result, you're able to visit in the extremely secure and private Anonymous View.",
    "You'll know that you're using this special mode as every page you visit in this way is bordered in blue. When using Anonymous View, the sites you visit only see a hit from Startpage, and social trackers, cookies and other unwanted privacy invaders are also stopped in their tracks. Startpage points out that this special mode \"essentially acts like a VPN, but without an account or the fees\", although it does neglect to mention the additional (small) speed hit involved..",
    "It's certainly hard to argue with the philosophy of Startpage – to the point that what it is offering seems almost too good to be true. As internet users, we have become so used to the idea of giving up part of ourselves as the fee for using free services, that the natural reaction to any company that operates in a different way, or that claims to be \"one of the good guys\" is met with suspicion.",
    "Of course, it is natural to have doubts and suspicions, and an abundance of caution is often a very good thing. But Startpage's transparency is not only refreshing, it leaves it open to the kind of scrutiny that would very quickly expose any wrongdoing or underhand activity.",
    "There really is a lot to love about Startpage. For anyone who has become entirely reliant on what Google has to offer but has concerns about the privacy implications of using the company's services, this search engine offers a compromise that really doesn't feel like much of a compromise. Of course, the presentation is slightly different, some features vary and there are no Google-style extras like a calendar or email service.",
    "But there are plenty of privacy-related extras that are very pleasing to see. The ease with which Startpage make it possible to visit individual pages anonymously is to be applauded and the lack of user tracking is a very refreshing change.",
    "It would be easy to dismiss this search engine out of hand, to do so without testing it out really does it a disservice. Give it a whirl and you're almost certain to be impressed by what you experience."
  ],
  "headers": {
    "4": "Ads and money",
    "7": "Privacy all the way",
    "12": "Final verdict"
  },
  "links": {
    "Google": "https://www.techradar.com/news/google-reveals-more-on-how-it-helps-deliver-speedy-search-results",
    "Startpage": "https://www.startpage.com/en/",
    "Anonymous View": "https://www.techradar.com/news/privacy-search-engine-startpage-launches-anonymous-browsing-feature",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}