{
  "source": "https://www.techradar.com/reviews/powweb",
  "title": "PowWeb review",
  "category": "computing",
  "updated": "2021-01-08T06:24:05Z",
  "author": "mike-williams",
  "summary": "Can a single shared hosting plan offered by an experienced host deliver the goods?",
  "verdict": "PowWeb is a decent and highly experienced web host provider, brave enough to offer to all of its customers a one-and-only hosting solution. While it presents a good value for money on initial purchase, the price hike upon renewal might make you change your mind.",
  "pros": [
    "30-day money-back guarantee",
    "Easy-to-use website builder included",
    "Free domain registration for new users",
    "Transparent pricing"
  ],
  "cons": [
    "Considerable price hike upon renewal",
    "Not enough hosting options",
    "No option for monthly billing"
  ],
  "article": [
    "PowWeb is a US-based web hosting company with more than two decades of experience in the market. It was founded in 1999 and the main office is located in Burlington (USA). From the beginning they have targeted small-to-medium sized businesses, and today they claim to have established a “leadership position” when it comes to budget-friendly web hosting. Along with many similar companies, they have also become part of EIG (Endurance International Group).",
    "Nevertheless, one thing stayed the same: PowWeb has offered its customers one hosting plan “to rule them all''. There is no doubt that it is an affordable one for most budgets, but whether it offers a good quality for money we shall soon find out.",
    "PowWeb seems to be a bit reluctant when sharing information on itself, but we did manage to find enough about their only data center. It is presently located in Los Angeles and the company claims they use “load balanced” servers to make sure their customers won’t experience any downtime because of the reboots, upkeep phase or possible hardware failures. Additionally, PowWeb’s staff is supposed to be monitoring its servers round-the-clock, or so they claim.",
    "The visual design of PowWeb’s main website feels old-fashioned (almost in a good way), but its functionality is not an issue whatsoever. If you are curious about their products, you are free to look at a little presentation by selecting the “Take A Tour” option on the “Products” section. Although it isn’t anything mind-blowing, it does offer a good insight into all the features their products provide, making the final choice a bit easier for its potential users.",
    "To this day PowWeb has no official blog and their presence on social networks seem to have faded to non-existence.",
    "PowWeb makes decision-making rather simple, since it puts forward a “one plan-one price” model. It's only shared hosting plan comes at a competitive price of $3.88 per month, but will cost you $11.95 upon renewal, which is considerably more. Even when we take into account every most welcome feature, the price hike is twice as high as you would expect by the industry average.",
    "PowWeb provides a 30-day money-back guarantee with its hosting plan, but it is valid with credit card payments only. If you’ve registered a new domain with PowWeb and are eager to keep it after seeking a refund, you’ll be able to do it only if you’ve paid a non-refundable domain additional fee. Otherwise, your domain will be lost to you.",
    "You are able to choose which currency (USD, EUR, GBP, CAD or AUD) you want to use to pay for PowWeb’s product and you can do it via a credit card or PayPal.",
    "Instead of offering its customers a few hosting plans to choose from, PowWeb proposes one plan to meet all of your needs. To achieve that goal, this plan includes many attractive features: free domain registration upon signup, unlimited disk space and scalable bandwidth, user-friendly and charge-free website builder and a 30-day money-back guarantee. If you want to see all the details, you can do so by selecting the “See all features” option just below the ones that are highlighted. All included features are presented in a quite clear and straightforward way.",
    "If you decide to go with this plan, you’ll proceed with registering your new domain or transferring an old one, if you have it. One-year free registration includes enough domain names to choose from, so you should find the right one for you without any trouble.",
    "After this, you’ll have to provide PowWeb with an expected amount of personal information, a payment method and a billing cycle. It should be noted that available billing cycles are annual, biennial, and triennial, with a noticeable absence of an option for a month. This choice, however, varies depending on the location you selected on the websites’ landing page. For instance, if you choose the UK, triennial billing isn’t one of the options.",
    "Before proceeding to check out, you can checkmark some of the “website essentials” or deselect those which came pre-checked. As one would expect, committing for a longer period will provide you with a significant drop in the total cost.",
    "Rather than using industry standard cPanel (or Plesk for Windows users), PowWeb provides a custom control panel based on vDeck, which isn’t the most user-friendly nor the most feature-packed solution out there. From there, you can install WordPress and other popular applications via Mojo Marketplace, which gets the job done, but not as effortlessly as Softaculous, for instance. On another note, a drag-and-drop website builder is included and it will get your website up and running as swiftly as possible.",
    "When giving us top ten reasons why we should put our trust in them, PowWeb promises “no more embarrassing downtime” and a “lightning speed”, all with much confidence. To make sure it was truly justified, we had to put everything to the test.",
    "The GTmetrix test, which helped us analyze PowWeb’s main website’s speed performance, wasn’t too impressed with the results, and nor are we. The time it took for the page to fully load was actually good: 4.3 seconds in comparison to the average result of 8.1. However, it also took the total of 90 requests, which is a bit above the average of 81. In addition, when we consider performance in relation with other parameters, such as total blocking time, it comes as no wonder that GTmetrix decided to grade the website with an E (43%), which is embarrassingly close to the rock bottom.",
    "On the bright side, our uptime test that monitored PowWeb’s main website’s performance for more than a month recorded no downtime at all, yet with more than a few oscillations in response time. Even if the monitored time period isn’t indicative of a full year performance, it seems that PowWeb has fulfilled its promise and spared us that “embarrassing downtime”.",
    "When seeking support on PowWeb’s website, you’ll be presented with their knowledgebase as well as various options to get in touch with their support agents.",
    "For those who want to rely on themselves only, PowWeb’s knowledgebase offers a plenty of step-by-step tutorial-styled articles and, as far as we can see, they are written in a simple yet helpful way. Users can browse this knowledgebase by using the search box or by selecting one of 15 chosen categories and, in our judgement, are more than likely to find it useful.",
    "If you would rather have an agent deal with your questions, concerns and issues, customer support via toll-free telephone and live chat is available 24/7. An interesting and rare addition is a screen sharing application (provided by Glance) which allows PowWeb’s agents to take a look at customers' screens, understand the issue first hand, and lead them directly to a solution.",
    "While PowWeb offers an all-in-one shared hosting solution, Just Host offers at least three plans for every type of hosting it provides (VPS and dedicated server in addition to shared hosting). However, if you are seeking a pretty good entry-level solution, PowWeb has more to offer: a free domain and SSL certificate, unlimited disk space and bandwidth, a website builder, and much else at almost the same rate.",
    "One of the more popular “children” of EIG is certainly Hostgator, and with a good reason. PowWeb’s one-size-fits-all hosting plan is far from bad, but it fails to measure up to Hostgator’s hosting solutions, in both quality and quantity. In addition, Hostgator offers a more flexible billing cycle (for one, three or six months) while with PowWeb you are expected to commit for a year at a minimum.",
    "StableHost is a fellow US-based host, but an independent one. PowWeb’s “One Plan” offers a good value for money, but that could change after a steep price hike upon renewal. Although the similar price hike comes packaged with StableHost, its initial plan starts at a very budget-friendly $1.75 per month, so the price following the hike ($3.50) is still lower than the initial price for the PowWeb’s plan ($3.88). In addition, StableHost’s cheapest hosting plan provides its users with unlimited disc space, unmetered bandwidth and a user-friendly site builder.",
    "Bluehost is another market player picked up by EIG, but is a company with its own strong reputation. Interestingly, when it comes to pricing, both PowWeb and Bluehost suffer from the same problem. With both hosts, the price hike after the initial period is more than three times the discount price, which is something to consider. However, since Bluehost is less costly overall and provides its users with a user-friendly cPanel, the choice is clear.",
    "PowWeb proudly declares that keeping their customers happy is their number one priority, and this does seem to be true for the most part. All details about their feature-packed One Plan are presented clearly, their pricing policy is transparent and the plan itself does seem attractive enough as it is. However, the outrageous renewal cost calls everything previously mentioned into question. With hosts such as Hostgator or Bluehost you can get all of this at lower price and with the industry standard easy-to-use cPanel."
  ],
  "headers": {
    "5": "Plans and pricing",
    "8": "Ease of use",
    "13": "Speed and experience",
    "16": "Support",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "PowWeb": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3117018436488270300&xs=1&url=https%3A%2F%2Fwww.powweb.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpowweb",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "one plan-one price": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2006722629732969200&xs=1&url=https%3A%2F%2Fwww.powweb.com%2Fpowweb%2Fhosting.bml&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpowweb",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "Just Host": "https://www.techradar.com/reviews/just-host",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "StableHost": "https://www.techradar.com/reviews/stablehost",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}