{
  "source": "https://www.techradar.com/reviews/ovh",
  "title": "OVHcloud web hosting review",
  "category": "computing",
  "updated": "2021-11-12T00:58:43Z",
  "author": "mike-williams",
  "summary": "A word-class cloud hosting provider geared toward tech-savvy users",
  "verdict": "Although OVHcloud’s cloud hosting solutions have managed to put an affordable price tag on their top-notch services, there is a hidden price to be paid that becomes evident when dealing with their customer support staff.",
  "pros": [
    "Easy to set up",
    "Over two decades of industry experience",
    "Pocket-friendly pricing with most plans",
    "Wide variety of different cloud-based servers",
    "Worldwide network of data centers"
  ],
  "cons": [
    "No automatic backups",
    "Not novice-friendly at all",
    "“Standard” customer support is almost non-existent"
  ],
  "article": [
    "Founded in 1999 by Octave Claba, OVHcloud is a French web hosting company with an international presence thanks to its network of data centers that connects the whole world. Although not the biggest fish in the web hosting sea, OVHcloud is still the largest provider in Europe today, the third-largest in the world based on its physical servers, and one with the world's largest data center network in terms of surface area it has covered so far.",
    "This network currently spans over 400,000 servers spread across more than 30 data centers in four continents and offers a wide variety of cloud-based solutions to over 1.6 million seemingly satisfied customers. The company is headquartered in Roubaix (France) and its data centers can be found in the USA, Canada, the UK, Ireland, Germany, Poland, France, Singapore, and Australia.",
    "In December of 2010, OVHcloud was revealed to the public as a web hosting provider for WikiLeaks, making them a small part of the story that shook the world. In October of 2021, the company enhanced its public cloud portfolio with a Database as a Service (DBaaS) catalog of services with which its customers would be free of tedious tasks such as database configuration, the set-up, software, and hardware maintenance, and so forth.",
    "OVHcloud’s official site uses a monochrome palette that plays with different shades of blue making itself quite easy on the eyes. It also utilizes a familiar page layout, provides plenty of information and features an up-to-date blog, all of which creates a user-friendly experience. The site is available in French, English, Spanish, Italian, Portuguese, Polish, and Dutch.",
    "Fans of social networking sites can find OVHcloud on Facebook, Twitter, LinkedIn, and YouTube, where all accounts look very much alive.",
    "OVHcloud’s scope of cloud hosting solutions includes a public cloud, a private cloud, and a bare-metal cloud, under which you’ll find VPS, dedicated servers, managed bare metal hosting, as well as additional storage, backup, network, security, email, and big data solutions, domain name registration, and management services.",
    "The cloud solutions start relatively cheap with the “Personal” coming at $3.99 per month with an annual subscription. This plan can supply you with five websites, a free domain name for the first year, 100GB disk space (SSD), unlimited bandwidth, 10 email accounts (up to 1GB per account), one SQL database (up to 200 MB), support for Python (CGI), MySQL 5.6, PHP (8.0 / 7.4 / 7.3), optimization for WordPress, anti-DDoS protection, and a Let's Encrypt SSL certificate. If you want more features and fewer restrictions on resources, you’ll have to purchase a bigger plan.",
    "Unlike other hosts, OVHcloud doesn’t provide any free trials or money-back guarantees with its services, which means that if you decide to cancel their services, you can say goodbye to any money you’ve invested so far, including additional setup fees.",
    "As for payment methods, with OVHcloud you can pay via credit/debit cards (Visa, MasterCard, and Maestro), PayPal, cheques, postal orders (in value of up to £250), and bank transfers.",
    "After selecting a plan you want to use, you’ll be asked to pick out a pre-installed CMS from WordPress, PrestaShop, Drupal, Joomla, or to go without one. As for add-ons, you can include a CDN, and extra SSL certificates (Let’s Encrypt SSL comes free of charge). After this, you can choose your domain name, where one is included for free for the first year with all OVHcloud’s plans.",
    "If you have an account with OVHcloud, now is when you need to log in. If not, it’s time to create one, and doing so will need your full name, email address, and password. It’s also advisable to go through the “Terms of Service” before making any further steps. After this, you’ll have to pass a verification via email, and surrender all the additional data (your telephone number, country, city, postcode, and language) to finish up creating your account.",
    "When all of this is done, you’ll gain access to OVHcloud’s dashboard, from which you can complete your purchase if you haven’t done so already. From here you should be able to monitor and manage all aspects of your account, such as changing passwords, creating/restoring backups, creating/deleting databases, and so forth. We didn’t use the word “should” because of a lack of belief in your abilities but due to the somewhat slow, painfully plain, and not too novice-friendly dashboard.",
    "Unfortunately, even if you are willing to invest some cash into an intuitive industry-standard control panel, you can choose between cPanel, Plesk, DirectAdmin, and ISPconfig3 with some plans only. For instance, industry-leading cPanel is only available with dedicated server hosting plans that start at $56.75 per month and this isn’t something most users that look for simple solutions will be willing to pay.",
    "An abundance of data centers scattered across the globe typically predicts blazing speed performance, and this is true with OVHcloud. A GTmetrix test performed on OVHcloud’s main site shows that it took 2.9 seconds for it to fully load, whereas the recommended time is less than 3.5 seconds (and the average one is 8.1). On top of this, all other web vitals (speed measuring metrics) showed a presentable performance building-up to a near-perfect A (95%) as a final GTmetrix grade.",
    "As for uptime, OVHcloud offers a 99.9% uptime guarantee backed by SLA across all VPS ranges, which isn’t that much, actually. They also claim all of their data centers are designed to Tier 3+ standards, meaning that the maximum amount of downtime a site should suffer throughout a year should be less than 1.6 hours in total (or 99.982% uptime). During a two-week-long uptime test on OVHcloud’s main site (via UptimeRobot), we recorded a single case of downtime only, but one that lasted for 15 minutes straight. This amounted to 99.93% of uptime which is a bit lower than we expected but still in line with the uptime guarantee.",
    "Although OVHcloud claims to be completely committed to its customers, this doesn’t seem to be the case with its customer support. There are four levels of support, and the lowest level called “Standard Support'' consists of several self-help options including a brief FAQ section, a knowledgebase, and a community forum.",
    "The knowledgebase contains plenty of step-by-step guides (some of which contain videos and others screenshots), which is fortunate since there’s barely anything to help and encourage beginners. On the other hand, the community forum seems active enough although there are more than enough months-old questions that are still left unanswered.",
    "We should note that “Standard Support” is the only level of support that comes with every single hosting solution without any additional charges. “Premium Support” costs $56 per month, “Business Support” starts at $300 per month, and to find what fortune you’ll have to pay to get “Enterprise Support” you’ll have to request a callback from the sales team.",
    "Anyway, you are free to contact OVHcloud’s sales team via telephone (on weekdays from 9 AM to 5 PM) and email/ticket, however, don’t expect to get anything but basic information here. OVHcloud also claims they’re planning to launch live chat support “soon” but they’ve been claiming that forever and ever.",
    "All those looking for a cloud-based solution can find an amazing alternative to OVHcloud in a US-based host called DigitalOcean. Both hosts are geared toward developers and tech-savvy users in general, to whom they offer a nice variety of web hosting products, and the similarities stop there. OVHcloud may be much cheaper than its competitor, but with DigitalOcean you’ll get better value for money and a bit better customer support.",
    "Another popular alternative could be Linode, a US-based host with a data center network that parallels the one of OVHcloud. However, while Linode offers a 7-day trial to new users (and a 60-day credit), you won’t get anything similar with OVHcloud.",
    "When it comes to user-friendliness, availability of customer support, and beginner-friendly features (such as free domain registration, industry-standard control panel, and money-back guarantee), HostGator wins the day. That being said, since HostGator has data centers in the USA only, it is less convenient to users elsewhere.",
    "While OVHcloud stays outside the beginner’s comfort zone, Bluehost strives to boost the confidence of less experienced users by offering a full list of beginner-friendly features, round-the-clock support, a one-click installer with lots of apps, a drag-and-drop website builder, and a 30-day money-back guarantee. This means that you’ll have enough time to try everything out for yourself without a need to worry about your budget.",
    "With over two decades of experience, OVHcloud seems committed to supplying its customers with a variety of keenly priced cloud-based necessities including VPS, dedicated servers, bare-metal servers, hosted private cloud, public cloud, as well as hybrid solutions. On the downside, OVHcloud isn’t geared towards beginners at all, their customer support seems to have fallen asleep at the switch, and if you aren’t happy with their services - tough luck, forget about your money.",
    "If you think this could be a deal killer for you, check out more beginner-friendly hosts such as HostGator and Bluehost before parting with your money."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "13": "Speed and experience",
    "15": "Support",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "OVHcloud": "https://us.ovhcloud.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "DBaaS": "https://www.techradar.com/news/ovhcloud-launches-autonomous-managed-cloud-database-with-software-firm-aiven",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "bare metal hosting": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Personal": "https://www.ovhcloud.com/en/web-hosting/personal-offer/",
    "domain name": "https://www.techradar.com/news/best-domain-registrars",
    "anti-DDoS protection": "https://www.techradar.com/news/best-ddos-protection",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "CMS": "https://www.techradar.com/best/cms",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "dedicated server hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "DigitalOcean": "https://www.techradar.com/reviews/digitalocean",
    "Linode": "https://www.techradar.com/reviews/linode",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}