{
  "source": "https://www.techradar.com/reviews/imac-pro",
  "title": "Apple iMac Pro all-in-one computer review",
  "category": "computing",
  "updated": "2021-04-16T20:37:42Z",
  "author": "matt-hanson",
  "summary": "Is this the ultimate AIO for professionals?",
  "verdict": "The iMac Pro is a powerful, professional all-in-one that may only be for a very particular clientele. It offers a lot of raw power and a premium price tag to match. Still, if the iMac Pro is ideal for your needs, then you’ll get a lot of mileage out of this computer.",
  "pros": [
    "Most powerful Mac ever",
    "Excellent design",
    "Keeps cool",
    "New Space Gray color is ace"
  ],
  "cons": [
    "Very expensive",
    "Non user-upgradable",
    "Magic Mouse 2 still frustrating"
  ],
  "article": [
    "The iMac Pro isn’t just one of the best Macs to have ever been released; it’s also among the best all-in-one computers to hit the streets. Thanks to the top-of-the-line PC components inside that slim chassis and all the awesome features that Apple packed it with, it holds its own against the newer iMac 27-inch (2020) and even the behemoth known as the Mac Pro 2019.",
    "All of this comes at a price – it goes for much more than what most consumers would be willing to drop on a general computer. However, for professionals needing a dedicated workstation to streamline a heavy-duty workflow though, the price is worth it.",
    "Finely tuned to take any creative workflow to the next level, the iMac Pro deserves all the praise it gets. So, while Apple has recently discontinued it, this 2017 model is still suited for both content creators and professionals. Plus, with Apple's \"Spring Loaded\" Event happening on Tuesday, April 20 2021, we could get a new model soon or see a third premium that might follow in its footsteps.",
    "In spite of the iMac Pro looking like your classic iMac, its internal components are targeted purposely at professionals, with its workstation-level hardware that can absolutely take on a lot more than most people need for their day to day workload without any issue.",
    "With all that great power comes a great price to match. But, if you’re a professional photographer, game designer or architect, then the iMac Pro is undeniably a solid purchase.",
    "So, how much does the iMac Pro cost exactly? Well, as you’d predict from a machine designed for professionals, the iMac Pro is highly configurable, allowing you access to a range in price when curating the perfect iMac Pro for your needs, as well as your wallet.",
    "This machine begins with its base model going for $4,999 (£4,899, AU$7,299), which admittedly is already pretty expensive for mainstream consumers. If you do have the funds, though, that base model is definitely more than enough for many creative endeavors. It touts its 27-inch 5K Retina display, an 8-core Intel Xeon W processor (CPU), AMD Radeon Vega 56 (8GB) graphics (GPU), 32GB of error-correcting code (ECC) memory and a 1TB solid-state drive (SSD).",
    "If you require more than those specs, you can go for a maxed-out iMac with a 10-core Xeon W CPU, 32GB RAM, AMD Vega 64X graphics and a gargantuan 2TB SSD. This will set you back $7,099 (£6,789, A$10,659).",
    "Finally, the kitted-out iMac Pro is sporting an 18-core Intel Xeon W chip, 256GB of RAM, 4TB of SSD storage and the same AMD Radeon Vega 64X GPU for $15,699 (£14,529, A$24,419). That’s a substantial investment, but with it, you’re getting a lot of power and storage.",
    "Of course, you can also fine-tune each of these configurations even further, picking any combination of storage amount, processor and graphics card type, and memory size that will fulfill your needs and budget. Just bear in mind that the final price will change as well.",
    "The specs and high price alone will give you an idea of whether or not the iMac Pro is right for you. If spending almost as much as a new car on a computer seems extreme, then look elsewhere. If you seldom use graphic-intensive programs, and you wouldn't know what to do with a GPU with 8GB – let alone 16GB of HBM2 memory, then you’re better off with a less powerful but more affordable machine.",
    "However, if a pro-level workstation is unquestionably vital for work, you’re already invested in the Apple ecosystem and you’re attached to the all-in-one design of the iMac, then the iMac Pro is your only practical option. Even a fully maxed out Mac mini won’t reach the same level of power and, thus, won’t satisfy your needs.",
    "The cost will be warranted, especially if you’ve found yourself often wasting a lot of time waiting while your current computer renders 3D images, compiles code and renders videos agonizingly slow. Spending this kind of cash to radically drop that downtime is an easy sell for the right buyer.",
    "And, if you’re on a budget and looking for a bargain on the iMac Pro, you might find a refurbished iMac Pro for 15% off the list price, if you know where to look.",
    "With the sheer power behind the iMac Pro, particularly next to the regular iMac, Apple has really outdone itself, all the while maintaining the design of the all-in-one machine. All those powerful internal components are tucked away behind the 27-inch display, resulting in a sleek, stark machine that looks attractive in any office or studio.",
    "The fact that Apple has kept the body as slim as it has is a proof of the blood, sweat and tears – not to mention, meticulous design considerations – they’ve put into designing the iMac Pro. At its edges, the iMac Pro is just 5mm (0.2 inches) thick, which means it won’t take up a lot of room on your desk. It comes in at just 0.7kg (21.38 pounds) as well, so you won’t break your back transferring it from one desk to the other when you have to.",
    "Touting such formidable components need more power and naturally produce more heat. This means that inside the slimline design of the iMac Pro, an effective cooling system is critical. Luckily, Apple’s engineers have designed a dependable cooling solution for it, utilizing dual fans that not only help circulate cool air over components, but expel hot air as well.",
    "According to Apple, this cooling system, which integrates a high-capacity heat sink and additional venting on the back of the computer, provides almost 75% more airflow and an 80% increase in system thermal capacity. All the while, the iMac Pro consumes 67% more power than a 27-inch iMac.",
    "This design efficiently cooled the iMac Pro when we tested it, which involved editing 4K HDR content in Final Cut Pro X, all while keeping the fan noise down. Yes, this computer will generate a lot of heat under pressure, but isn’t that the whole point of a cooling system?",
    "It’s also astonishingly quiet. You don’t want any distracting fan noises while you work, particularly in an all-in-one PC that’s right in front of your face, and the iMac Pro does a splendid job of minimizing that.",
    "If you’re a fan of the iconic look of previous iMacs, but need a machine that’s filled with some serious specs for professional use as well as a cooling system that’s very good at its job, then you’re going to be very content with the iMac Pro.",
    "One key distinction with the iMac Pro’s design, compared to regular iMacs, is that it is available in a new color scheme: Space Gray. As expected, the Space Gray iMac is stylish. The included Magic Mouse 2, Magic Keyboard and Magic Trackpad 2 also come in this new color so you can keep a color theme going, if you so choose.",
    "Of course, as important as the form factor and accessories are, one of the most critical aspects, particularly for professional photographers, video or image editors, is the display. The 27-inch 5K screen was declared by Apple as its ‘best ever,’ boasting 500 nits of brightness, an increase of 43% over previous iMacs’ brightness.",
    "The 5,120 x 2,880 resolution is just as delightful here as it is on high end iMacs, which also come with this resolution. In addition, the improvement over standard 4K resolution means video editors can work on 4K video at full resolution and still have a lot of extra space for their editing tools, browser or a music player.",
    "It’s in the small details that turn the iMac Pro into such an astonishing tool for professionals. It helps speed up, not to mention, make more seamless, your workflow by minimizing the need to enter and exit full-screen mode if you’re on a 4K – or lower – monitor.",
    "Because the iMac Pro is created for professionals, color reproduction needs to be as accurate as possible. This is crucial for photographers, graphic artists and video editors, amongst others. To offer accurate color reproduction, the display supports the P3 wide-gamut color space, an RGB color space that is widely used in digital movie production.",
    "If you work with digital film, then this feature is undeniably appreciated, though not too surprising. Apple iMacs have supported it since 2015, as does the iMac’s rival: all-in-one by Microsoft, the Surface Studio.",
    "Still, while P3 is wider than sRGB, it’s not as wide as Adobe RGB. If Adobe RGB is essential to your work – for example, if you work in printing and publishing – then you might be frustrated by the lack of Adobe RGB support. For many people, however, the P3 color space will more than suffice, not to mention a big improvement over sRGB. Like with other iMacs, the FaceTime camera is positioned on the bezel above the top of the screen, and flaunts a few major enhancements. To start, it can record in 1080p resolution, whereas previous FaceTime cameras on iMacs were 720p.",
    "This increase in resolution is amazing when using the iMac Pro for video calls. And, for client meetings or chatting with work colleagues, this increase in video quality is greatly beneficial.",
    "Moreover, the webcam also features four microphones, compared to a single one on the 5K iMac. This array of microphones really helps reduce background noise, and, since they are placed at the top of the screen (rather than at the bottom with earlier iMacs), they do a superb job of noise cancelling. Of course, if you work in very loud and busy environments, you’ll still want to use a headset for the best possible sound quality. Still, these enhancements are absolutely appreciated.",
    "Apple has gotten flack for the limited ports present in its professional-oriented MacBook Pro. However, the iMac Pro has no such issues since its selection of ports are more than enough to allow you to hook up many peripherals to the device.",
    "Behind, at the base of the iMac Pro, you get a 3.5mm headphone jack, SDXC card slot, four full-size USB 3.0 ports, four Thunderbolt 3 USB-C ports and a 10Gb Ethernet port, which affords blazing fast network speeds. The four USB 3.0 ports are perfect for older, legacy peripherals and devices, while the Thunderbolt 3 USB-C ports support Thunderbolt USB 3.1 devices as well as devices with up to 40Gbps data transfers.",
    "The Thunderbolt 3 ports can be utilized to connect to additional displays as well, such as two 5K external displays at 60Hz, or four 4K UHD displays at 60Hz. Essentially, you’re pretty much set for ports, and we’re more than happy to see that Apple hasn’t skimped on them here.",
    "However, while the slimline all-in-one design definitely looks stunning, it does mean that this won’t be an easily customizable and upgradeable system. This isn’t a big deal for most people; however, if you do want an easily-upgradable device for further future-proofing, then you might want to take a look at a different, more modular, easily customizable computer.",
    "Overall, the design of the iMac Pro is everything you’d expect from Apple: tastefully made, with some truly innovative features and outstanding details geared towards professionals. All of that combined will more than justify the steep price tag.",
    "The iMac Pro is fitted with the Magic Keyboard with Numeric Keypad, Magic Mouse 2, and optionally, the Magic Trackpad 2 – all of which come in the new (to the iMac range) Space Gray color. Apart from this new color, these peripherals should be generally familiar.",
    "We were thrilled to see the Magic Keyboard touting a numeric keypad, since that’s a handy feature for writing up sums. While we might not call the typing experience on the keyboard ‘magic’, despite its thin keys and shallow travel, it is comfortable enough for our typical typing needs. However, if you do a lot of typing for work, then you might find a laptop with a more tactile keyboard an even better fit.",
    "In our opinion, the Magic Mouse 2 is much better at its job. While the design is essentially the same (again, apart from the color) since its debut in 2015, many would maintain that it’s already as close to perfection in its current iteration as it can be.",
    "The mouse feels smooth and responsive during use and handles very well on several surfaces. If you’re used to using Macs, then you’ll be right at home. Then again, for certain tasks, you might find it better using a specialized pointing device.",
    "There is one downside that still needs to be fixed on the Magic Mouse 2: to charge the mouse, you still need to connect the Lightning cable to the bottom of the mouse.",
    "Not only is this a rather inelegant way to charge, but it also means you won’t be able to use the Magic Mouse 2 while it’s charging, a baffling design decision that Apple still hasn't been fixed.",
    "Finally, there’s the Magic Trackpad 2. It’s a great peripheral with an edge-to-edge surface that lets you control the iMac Pro in a similar fashion as a MacBook. Used alongside the mouse and keyboard, it’s a terrific solution for scrolling through files and websites, as well as zooming in and out of photos (among other things).",
    "The shortage of updates on these peripherals will be great news to anyone who’s already a fan of them. However, it will likely disappoint anyone else who isn’t, and was hoping for something much improved for the iMac Pro.",
    "It has to be said however, that the new color does look great, and the Magic Keyboard and Magic Mouse 2 should pair beautiful with the iMac Pro without full as soon as they are turned on.",
    "Oddly enough, the Magic Trackpad 2 didn’t pair automatically the very first time – we had to plug it into the iMac Pro via the included Lightning cable (which comes in black) before we could use it with the iMac Pro wirelessly."
  ],
  "headers": {
    "3": "Price and availability",
    "14": "Design",
    "35": "Magic peripherals"
  },
  "links": {
    "best Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "best all-in-one computers": "https://www.techradar.com/news/best-all-in-one-computer",
    "PC components": "https://www.techradar.com/how-to/pc-components",
    "iMac 27-inch (2020)": "https://www.techradar.com/reviews/apple-imac-27-inch-2020",
    "Mac Pro 2019": "https://www.techradar.com/news/mac-pro-2019-first-look",
    "Apple's \"Spring Loaded\" Event": "https://www.techradar.com/news/apples-april-20-event-is-official-heres-what-to-expect-including-ipad-pro",
    "bargain on the iMac Pro": "https://www.techradar.com/news/hunting-imac-pro-deals-refurbished-models-are-your-best-bet",
    "Surface Studio": "https://www.techradar.com/reviews/surface-studio",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro",
    "MacBook": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-1287806/review"
  }
}