{
  "source": "https://www.techradar.com/reviews/sonos-one-review",
  "title": "Sonos One review",
  "category": "audio-visual",
  "updated": "2021-09-22T09:40:43Z",
  "author": "jon-porter",
  "summary": "The Sonos One is the best smart speaker you can buy today",
  "verdict": "Sonos’ debut smart speaker is a cleanly designed, feature-rich and great-sounding device that brings together the best of both ecosystems. You’ve got ever-improving voice assistants, including Alexa and Google Assistant, on the one hand, and on the other you’ve got Sonos with its own multi-room smarts. If you’re prepared to pay the price premium over Amazon’s or Google's first-party speakers, the One is the best smart speaker bar none.",
  "pros": [
    "Full-bodied, rich sound",
    "Alexa / Google Assistant",
    "Plays music while Alexa is muted",
    "AirPlay 2 support"
  ],
  "cons": [
    "Pricey"
  ],
  "article": [
    "The Sonos One started a revolution. It was one of the first smart speakers that didn't force users to choose between smarts and excellent sound quality (it features both), as well as the first that didn't make users choose between Alexa and Google Assistant.",
    "Even without that, however, the Sonos One is a spectacular speaker, and the best smart speaker on the market in 2021. In our time spent with it in our home, we were consistently impressed with the sound quality in both standalone and stereo speaker modes and how voice assistant integration has continued to grow.",
    "Sonos speakers have also been given a hefty upgrade, as the company launched a new operating system and accompanying app that brings support for Hi-Res Audio to its newer wireless speakers.",
    "The new Sonos S2 app also brings a feature called 'room groups' – this means your wireless speaker system will be able to remember frequently grouped players (like your bedroom speakers and your living room speakers). This should allow you to get entire areas of your home – downstairs, for example – playing music much more quickly than before.",
    "However, Sonos speakers have also increased in price - and that includes the Sonos One. Once $199 / £179 / AU$299, it's now $219 / £199 / AU$319.",
    "Even as Google and Amazon are making better and better sounding speakers in-house (see: Amazon Echo Studio and Google Home Max), the Sonos One remains the best wireless speaker of 2021.",
    "What Sonos has working to its advantage, though, is its multi-room ecosystem that goes a long ways toward filling the gaps left in Alexa and Google Assistant's ecosystems.",
    "One day Amazon and Google's Hi-Fi speakers might overtake the Sonos One - but, until that day comes, you can rest assured knowing that Sonos, with its wealth of experience and brilliant inter-connectivity, still holds the top spot.",
    "Although the Sonos One’s design is broadly based on the company’s existing Play:1 smart speaker, there have been a number of improvements made.",
    "On the top you’ll find a touch-sensitive surface that’s a great deal sleeker than the Play:1’s trio of volume and play/pause buttons. Swiping right or left skips forward and backwards through your current playlist, while tapping in the center of the surface plays and pauses your music. Finally, tapping the left and right halves of the panel raise and lower the volume.",
    "It might be a simple series of controls but, as has always been the way with Sonos speakers, you’ll spend most of your time controlling them via the app. The physical controls are nice when you want to quickly skip a track, but you’re unlikely to use them much, especially now that voice control is also an option.",
    "To facilitate this voice control, Sonos has equipped the speaker with six internal microphones to allow it to hear you drunkenly ask to play ‘Hey, Jude’ just one more time, and these are joined by more or less the same guts as the Sonos Play:1; namely its pair of Class-D amplifiers and a tweeter / mid-woofer driver combo.",
    "On the top of the device you’ve also got a power-indicating LED alongside a small light to let you know when Alexa is listening. This second LED is hardwired to the microphones, and Sonos promises that the microphones cannot listen to you if it’s not illuminated.",
    "Thanks to the combination of Amazon’s and Sonos’ services, the setup of the Sonos One is a little more involved than your average Echo device, but thankfully not horrifically so.",
    "The process involves installing the Sonos and Alexa apps, and you’ll need to sign into both your Sonos and Amazon accounts, as well as any other music streaming services that you’ll want to listen to using the speaker.",
    "You’ll also be encouraged to go through a ‘Trueplay Tuning’ process, which requires you to walk around your room with your phone as your speaker plays a number of test sounds. Your phone listens to how the speaker sounds in its environment, and tunes its sound accordingly.",
    "Of course, you can also manually adjust the treble and bass levels of your speaker if you have more specific preferences, although we were content to leave them at their default levels.",
    "You’ll also need to assign the Sonos One a room to allow you to identify it from the Sonos app, and it’s here that you’ll also have the ability to pair the Sonos One up with another speaker to have them play music in stereo. Unfortunately you can’t pair it with a Sonos Play:1, despite the similarities in form-factor.",
    "Given that this is a Sonos speaker, you won’t be surprised to hear that the Sonos One sounds pretty fantastic.",
    "Throw Elegie by Mouse on the Keys at the speaker, and sound has real punch and energy to it. The song’s kickdrum...well...has kick to it, and drives the energy of the song. It’s an impressive amount of power from such a small speaker.",
    "The speaker even deals admirably with more complicated pieces of music. Silent Earthling by Three Trapped Tigers sounds clear and crisp, despite the multiple layers of instruments circulating throughout the song.",
    "That said, the speaker doesn’t offer the separation of a pair of stereo speakers with the way the music is squashed into a single channel, but it does a solid job at its size and price point, and naturally its ability to be paired with more Sonos speakers enhances its sound further still.",
    "Of course, much of what’s written above could also have been said of the original Play:1 when it was first released back in 2013. The real story here is about how voice control is integrated – it is simply wonderfully executed.",
    "Almost, nearly perfect.",
    "While at launch the functionality seems a little more limited than we were expecting due to the absence of its integration with Spotify, this has now been rectified via a software update.",
    "It's great news, as Spotify is one of the more popular streaming services out there. Being able to simply request songs by using your voice is far more convenient than having to dig into an app on your phone.",
    "With Spotify now added, the Sonos One is an impressively featured multi-room speaker. It’s backed by the same great Sonos app that has seen continuous improvement and development over the years, and now integrates with all major music streaming services.",
    "Otherwise the speaker acts pretty much as you’d expect a smart speaker to. It integrates with all the same smart home products, you can ask it about the weather, or just have it tell you stupid facts and jokes.",
    "You can also, thanks to the recently released Sonos Alexa skill, use voice commands to get music playing on other Sonos speakers throughout your home. The skill is still in beta and is hence a little buggy (it refused to play the radio on “kitchen speaker”, but was fine with “kitchen”), but when this sees a full launch it will be another helpful feature.",
    "Essentially, we think the Sonos One is the best Alexa speaker on the planet – and the best Google Assistant speaker, too. Fundamentally this is because it’s underpinned by audio quality that’s a step above what’s available on Amazon’s current generation of Echo hardware, but it’s a speaker that also integrates fantastically well with the rest of Sonos’s multi-room lineup.",
    "Yes, it was certainly a shame that it launched without support for the most popular streaming service in the world, Spotify, but kudos to Sonos for bringing out the update in good time. The speaker is now just as effective as an Amazon Echo at playing your music, and sounds much better than Amazon's own speaker.",
    "If you need to take your music on the go, check out Sonos' portable speakers, including the Sonos Move and the Sonos Roam."
  ],
  "headers": {
    "8": "Design",
    "13": "Setup",
    "18": "Sound quality",
    "22": "Alexa, the Sonos app and future developments",
    "29": "Final verdict"
  },
  "links": {
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "best smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "new Sonos S2 app": "https://www.techradar.com/how-to/how-to-update-your-sonos-speaker-to-the-latest-os-and-get-hi-res-audio-support",
    "wireless speaker": "https://www.techradar.com/news/best-speaker",
    "Sonos speakers have also increased in price": "https://www.techradar.com/news/sonos-speakers-are-getting-more-expensive-for-no-real-reason",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-plus-review/reviews/amazon-echo-studio-review",
    "Google Home Max": "https://www.techradar.com/reviews/google-home-max",
    "best wireless speaker": "https://www.techradar.com/news/best-speaker",
    "Play:1": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-play1-1189345/review",
    "best Alexa speaker": "https://www.techradar.com/news/the-best-alexa-speakers",
    "portable speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "Sonos Roam": "https://www.techradar.com/reviews/sonos-roam"
  }
}