{
  "source": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
  "title": "Nvidia GeForce RTX 3080 review",
  "category": "computing",
  "updated": "2021-10-12T17:37:18Z",
  "author": "jackie-thomas",
  "summary": "4K gaming enters the mainstream with the RTX 3080",
  "verdict": "The Nvidia GeForce RTX 3080 is an absolute powerhouse of a graphics card, bringing about one of the largest generational leaps in GPU history. Anyone that's interested in 4K gaming should be paying attention to this graphics card – even if the benefits diminish at lower resolutions.",
  "pros": [
    "Excellent 4K gaming performance",
    "Low temperatures",
    "Plenty of useful non-gaming features",
    "Price didn't increase over RTX 2080"
  ],
  "cons": [
    "Still kind of expensive",
    "Dongle is a little annoying",
    "No USB-C in Founders Edition"
  ],
  "article": [
    "Along with the rest of the Nvidia 3000 series, the Nvidia GeForce RTX 3080 has proven to be a considerable improvement over the company’s previous generation of graphics cards. In fact, it’s probably the largest generational leap in power we’ve witnessed in quite some time.",
    "With the RTX 3080, 4K gaming is much more accessible than it’s ever been. Additionally, it delivers impressively better performance over the GPUs it’s replaced. With over a 50-80% performance boost compared to the RTX 2080 and 20-30% compared to the RTX 2080 Ti, playing the best PC games in high resolutions and fast refresh rates has never been easier.",
    "Nvidia has done more than just taken the performance to the next level. You get all that performance at a much better price than the 2000 series. It’s almost half the price, actually. So, not only is the RTX 3080 more robust but, along with the rest of the Nvidia 3000 series, it’s more affordable to gamers.",
    "The RTX 3080 is one of the greatest releases from Nvidia, and it’s a compelling upgrade for anyone who wants to get the most out of their gaming experience.",
    "The Nvidia GeForce RTX 3080 is available on September 17, starting at $699 (£649, about AU$950) for the Founders Edition. However, as with any major graphics card launch, there will be dozens of aftermarket graphics cards from companies like MSI, Asus, Zotac and more.",
    "Just be aware that some of these aftermarket card designs may see steep price increases over this Founders Edition, based on things like exotic cooling solutions and factory-tuned overclocks. But every RTX 3080 should more or less be in the ballpark of performance as the one Nvidia itself launches.",
    "The Nvidia GeForce RTX 3080 is based on the new Nvidia Ampere graphics architecture, which brings huge improvements to both raw performance and power efficiency. The fact that Nvidia has increased the power budget so much over the RTX 2080 while boosting power efficiency means that the overall performance profile is far above what any Nvidia Turing graphics card was capable of.",
    "There have been obvious improvements to the RT and Tensor cores – we're on the second and third generation, respectively – but perhaps the biggest improvement has been to the rasterization engine.",
    "Through some clever optimization, Nvidia was able to double the amount of CUDA cores present on each Streaming Multiprocessor (SM) by making both data paths on each SM able to handle Floating Point 32 (FP32) workloads – a vast improvement over Turing, where one data path was dedicated entirely to integer workloads. This effectively doubles raw FP32 throughput core for core, though this won't directly translate into double the frame-rate in your favorite PC games – at least, not for many of them.",
    "What this means is that, while the Nvidia GeForce RTX 3080 only has 46% more SMs than the RTX 2080 at 68, it more than doubles the CUDA core count, from 2,944 to 8,704. This translates to nearly three times the theoretical FP32 throughput from around 10 TFLOPs to 29.7 TFLOPs – an absolutely massive generational leap.",
    "When you pair the uplift in CUDA cores, with massive boosts to Cache, Texture Units and Memory Bandwidth – thanks to the move to faster GDDR6X memory on a 320-bit bus – gaming performance gets one of the biggest generational jumps in years, even if it does fall a bit short of that '2x performance' target that we're sure some folks were hoping for. But more on that later.",
    "Nvidia RT cores are also back – that's why Nvidia has the RTX name, after all – and they also see massive improvements. Nvidia Ampere graphics cards, including the RTX 3080, include second-generation RT cores, which will function similarly to the first generation RT cores, but will be twice as efficient.",
    "When ray tracing, the SM will cast a light ray in a scene that's being rendered, and the RT core will take over from there, where it will do all the calculations necessary to find out where that light ray bounces, and will report that information back to the SM. This means that the SM is left alone to render the rest of the scene. But, we're still not at a point where turning on ray tracing doesn't have any impact on performance. Maybe some day.",
    "Tensor cores are also twice as powerful this time around, which has led Nvidia to only include 4 in each SM rather than the 8 you would find in a Turing SM. Coupled with the fact that there are now more SMs in general, DLSS performance also gets a massive boost.",
    "This generation of graphics cards isn't all about gaming, however, and Nvidia has brought a couple of new features to the table that will make life better for pretty much everyone with an RTX card.",
    "For instance, we were already big fans of RTX Voice, and Nvidia has finally brought it out of beta and worked it into a fully-featured broadcasting app. While RTX Voice filtered background noise out of your microphone, you can set up Broadcaster to filter backgrounds out of your webcam – or even just apply a blur.",
    "The video section is still in beta, and we did see some glitches, but it's way better than any other solution out there for blocking out your background without a green screen.",
    "One of the features we're most excited to see implemented, however, is Nvidia RTX I/O, which is an API that will work in tandem with Microsoft's DirectStorage API, to route data straight from your SSD to your graphics card. In next-generation games, this should not only massively reduce loading times, but also mirror the groundbreaking I/O performance that has been teased with next-generation consoles like the PS5 and Xbox Series X. Far more than high frame rates or pretty graphics, this technology is critically important to future gaming tech.",
    "Unfortunately, this is a technology that needs to be implemented by game developers in their games, and we weren't actually able to see what kind of real-world difference it will make. Though it is something we will be actively testing once the technology is widely implemented – and because the consoles are going to be using similar tech, we expect it will have a faster turnaround than ray tracing did.",
    "For the actual Founders Edition graphics card, Nvidia went with an all-new cooler design, which is way more practical than anything it's ever done with a reference design before. The company used a shorter, multi-layered PCB in order to have the back end of the card just be all heatsink. By doing this, Nvidia was able to mount a fan on the back of the graphics card that will suck cool air through the heatsink, and expel it up and out of the case.",
    "We were a bit worried when we first saw this fan design that it would affect CPU and RAM temperatures, as it's blowing hot air directly over these components, but even in our personal rig, where we have a Noctua NH-12UA air cooler on an AMD Ryzen 9 3900X, we didn't observe any difference in performance. We guess it helps that most PC games don't really stress both the GPU and CPU to the same extreme – not yet at least.",
    "As far as power delivery goes, that new 12-pin power connector is definitely there, and we have some mixed feelings about it. It's clear that the new PCB design of the Founders Edition card needs this smaller connector to make this new cooler work, we just wish that the 2 x 8-pin PCIe to 1 x 12-pin dongle Nvidia includes was a bit longer. As it stands, it's kind of hard to tie it out of the way to not be immediately visible, but at least aftermarket cards won't be using it right away. It's worth noting, though, that Nvidia is making the 12-pin power connector design available to any manufacturer – even AMD – that wants to use it.",
    "The Founders Edition also has three DisplayPort and one HDMI 2.1 output for displays, which is good. However, we don't like that Nvidia got rid of the USB-C output here, as creators will definitely still want to use this incredibly powerful card, and many pro-grade monitors out there are, in fact, USB-C monitors.",
    "Despite our little issues with the Founders Edition – and despite thinking it was ugly when it was first shown off – it's an attractive piece of hardware in person. All black with silver accents, the RTX 3080 looks like a professional-grade piece of hardware.",
    "The only lighting is the 'GeForce RTX' logo on the side of the graphics card in white, which will surely please any anti-RGB users out there. Plus, gamers that really want to go all-out with rainbow lighting will have that option with third-party cards.",
    "Just from Nvidia's own (overblown) marketing, we were already expecting the RTX 3080 to be a fast graphics card, but calling it \"fast\" is a bit of an understatement. From the moment we opened the box, it's been in our personal machine, running everything from Final Fantasy XIV to Control, only coming out of our personal rig to be plugged into our test bench for actual benchmarking.",
    "Before the 3080, we had an Nvidia GeForce RTX 2080 Ti in that machine, and the difference was immediately apparent before we even start measuring performance in a quantifiable way. For instance, one of the games we play the most is Final Fantasy XIV – it's a problem – and in that game, particularly in the latest expansion, there were moments where the RTX 2080 Ti would drop below 60 fps at 4K. That doesn't happen with the RTX 3080. In fact, the game is typically running anywhere from 75-100 fps at 4K with Maximum graphics settings, where the RTX 2080 Ti typically chilled around the 60 fps mark – a massive jump in performance at around half the price.",
    "This story just kept repeating itself over and over no matter what game we played. Metro Exodus maxed out with Ray Tracing and DLSS? Smooth locked 60 fps at 4K. Control with the myriad ray tracing effects? Silky smooth. Even Final Fantasy XV with all the weird optional graphics effects sits pretty at a steady 60 fps at 4K. Accessible 4K60 gameplay is here – even if we are using the term \"accessible\" very loosely here.",
    "While the thermals in our benchmarks aren't too exciting, you should keep in mind that those were recorded on an open-air test bench. In our closed tower, with two 240mm fans serving as intake, temperatures peaked around 60°C – way cooler than the mid-80°C temperatures we would typically see with the RTX 2080 Ti Founders Edition.",
    "When looking at the actual benchmark results, it's clear that the Nvidia GeForce RTX 3080 is in a class of its own, standing head and shoulders above even the RTX 2080 Ti. Right off the bat in 3DMark Time Spy Extreme, the RTX 3080 is a whopping 63% faster than the RTX 2080 and 26% faster than the 2080 Ti – a massive generational leap when you consider that the RTX 2080 was only 40% faster than the GTX 1080 when we reviewed it back in 2018.",
    "But Time Spy Extreme isn't even even the best-case scenario for the RTX 3080's gains. In Red Dead Redemption 2, where we basically maxed out every single option that wasn't MSAA – multi-sample anti aliasing is very expensive and not worth it – we saw a massive 87% improvement gen-on-gen.",
    "This falls short of that 2x performance leap that was teased at the RTX 3080 reveal, but it's definitely closer than we thought it would actually get. The RTX 3080, all told, is between 50-80% faster than the RTX 2080, while only falling below that in Fire Strike Ultra, where it only managed a 29% lead – but that's still a meaty advantage.",
    "That wide gap in performance is only really present at 4K, however, when the graphics card is free of bottlenecks. There are many titles in our testing suite where even the AMD Ryzen 9 3950X, paired with 64GB of RAM at 3,600MHz, held back the RTX 3080. This is why, for instance, the RTX 2080 Ti and the RTX 3080 are virtually identical at 1080p in Metro Exodus, but opens up to a 19% performance advantage at 4K.",
    "For this reason, we really don't recommend anyone actually buy the Nvidia GeForce RTX 3080 unless they're going to be playing at 4K, or possibly 3,400 x 1,440 Ultrawide. The gains are just not going to be there at lower resolutions, so you're better off just waiting for the Nvidia GeForce RTX 3070.",
    "The performance on offer with the Nvidia GeForce RTX 3080 even further widens the gap that exists between Nvidia and AMD on the high end, more than doubling the performance of AMD's most powerful consumer graphics card, the Radeon RX 5700 XT in many tests. AMD Big Navi is going to have a big fight on its hands if it wants to try to claim the 4K crown that the RTX 3080 just won.",
    "Originally published in September 2020"
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Features and chipset",
    "25": "Performance",
    "35": "Don't buy it if..."
  },
  "links": {
    "3000 series": "https://www.techradar.com/news/nvidia-ampere",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 2080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080",
    "RTX 2080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-ti-review",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "USB-C monitors": "https://www.techradar.com/deals/best-usb-c-monitors",
    "Final Fantasy XIV": "https://www.techradar.com/news/theres-never-been-a-better-time-to-jump-into-final-fantasy-xiv",
    "Control": "https://www.techradar.com/reviews/control-review"
  }
}