{
  "source": "https://www.techradar.com/reviews/soundmagic-p23bt",
  "title": "SoundMagic P23BT review",
  "category": "audio-visual",
  "updated": "2021-12-03T15:32:49Z",
  "author": "jennifer-allen",
  "summary": "Flimsy design, solid features",
  "verdict": "The SoundMagic P23BT might feel cheap in your hands but in use, there's a lot to like here. Decent sound quality and remarkable battery life means these are some excellent value budget headphones.",
  "pros": [
    "Comfortable fit",
    "Good audio quality",
    "Fantastic battery life"
  ],
  "cons": [
    "Flimsy design",
    "Basic features",
    "No app support"
  ],
  "article": [
    "A reliable name in headphones and earphones despite not being the first brand you'd probably think of, SoundMagic has released its first wireless over-ear headphones in the form of the SoundMagic P23BT and done quite a remarkable job.",
    "Sure, they feel as cheap as you would expect from a pair of headphones that only cost $55 / £50 (about AU$100), but they work well where it counts.",
    "That means a surprisingly wide soundstage with reasonable bass and modest mid, a comfortable fit and an astonishing battery life of up to 60 hours.",
    "Other features include aptX, aptX HD, AAC and SBC codec support and a closed back design that does a decent job of blocking out surrounding sounds. There's no active noise cancellation here but we would hardly expect it at this price admittedly. Similarly, there's no app support so no way of tweaking the EQ or similar but again - this is a barebones collection of the essentials that you'll want to see from any headphones.",
    "The SoundMagic P23BT are comfy too. Granted, they feel cheap at first thanks to a plastic headband and a foldable design that's useful for storing away but feels a bit flimsy, but the ear cups feel good on your ears. There's no sign of premium materials here and the power button feels incredibly cheap but it all works well enough.",
    "Controls on the headphones are touch sensitive and work on a gesture based system. It's reasonably easy to remember what command does what though and it's also fairly responsive.",
    "Other features include a wired boom mic that can be attached as and when needed if you want to start using the SoundMagic P23BT for calls.",
    "The SoundMagic P23BT won't win prizes for looks or complex features to lure in audiophiles. For the average user simply looking for a cheap way to listen to music on the move and well, however, these do the job. Even better, that extraordinary battery life means a week's worth of the longest of commutes still won't require you to dig out the charging cable.",
    "The SoundMagic P23BT are priced at $54.99 / £49.99 / about AU$95, making them very cheap for wireless headphones.",
    "They're available from pretty much all third-party retailers with the only color option being black.",
    "The SoundMagic P23BT are very lightweight to the point that they feel pretty flimsy. They have a foldable design so that they easily bend together to fit into your bag when you're not using them. The ear cups are made from memory foam so while - to the touch - they don't feel premium, they feel good on your ears and the lightweight design ensures that they never feel cumbersome.",
    "Buttons wise, the SoundMagic P23BT feels suitably cheap yet functional. One physical button dictates power and Bluetooth connectivity depending on how long you hold it down while the outside of the right ear cup offer touch-sensitive controls that can adjust volume, skip tracks, take calls and so forth. These work fairly well, proving intuitive and memorable.",
    "The headphones use 40mm drivers that we'll go into detail about later but they do the job well. There's no active noise cancellation but the covered ear design means that these still block out surrounding sound reasonably well for the price.",
    "The SoundMagic P23BT are a little light on extra features so don't count on voice assistant support or a separate app for dictating EQ. However, it is possible to attach a wired boom mic as and when needed. It's also an option to plug them in and listen away, although this should be rarely needed given the impressive battery life that we'll talk about later.",
    "The SoundMagic P23BT aren’t going to rival more expensive headphones but they still sound quite good. The bass isn't overwhelming when listening to the likes of Billie Eilish's Bad Guy and while it could also offer a bit more punch, we're mostly grateful it doesn't overwhelm like other cheap headphones. Instead, you can still hear some decent lows and enjoy some reasonably crisp mids.",
    "The soundstage is also reasonably wide so you certainly don't have to crank up the volume here to get the most from it. We felt suitably cocooned while listening to the likes of David Bowie's Under Pressure and Soft Cell's Tainted Love continues to sound wide reaching and engaging.",
    "There's no app support here so you can't tweak anything which is a mild shame but hardly surprising. Where things are much more promising is that the SoundMagic P23BT support aptX, aptX HD, AAC and SBC codecs, which is always useful.",
    "Impressively, the SoundMagic P23BT promise 54-60 hours of battery life when listening to music, and it achieves it too. It's long enough that you almost forgot how long ago it was that you last charged up your headphones which is pretty remarkable. Talk time is estimated at between 39 to 45 hours but we don't talk to enough people to be able to accurately check that for a good few months yet.",
    "For those rare times you do need to recharge, a 10-minute charging session gives back five hours of playtime. Also, the headphones can last for 50 days in standby mode. It's all very impressive and easily one of the best things about the SoundMagic P23BT. You simply don't have to think much about them.",
    "The SoundMagic P23BT only use Bluetooth 5 rather than the latest 5.2, but clearly that isn't bothering battery life by any means. We didn't suffer any drop outs either while using it."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "SoundMagic P23BT price and availability",
    "10": "Design",
    "14": "Audio performance",
    "17": "Battery life and connectivity",
    "20": "Don't buy them if..."
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "earphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "cheap headphones": "https://www.techradar.com/news/best-cheap-headphones"
  }
}