{
  "source": "https://www.techradar.com/reviews/furo-systems-furo-x",
  "title": "Furo Systems Furo X review",
  "category": "fitness",
  "updated": "2021-09-13T15:00:20Z",
  "author": "rob-clymo",
  "summary": "The Furo X delivers potent e-bike thrills from its diminutive fully folding design",
  "verdict": "Furo Systems has done a cracking job with the Furo X folding e-bike. It looks and feels well made with a feast of quality components helping to justify the $2,399 / £1,799 (about AU$3,300) asking price. Better still, the fact that it can be folded up and unpacked again with ease is a real bonus, especially compared to rivals that require an engineering degree to get the hang of come fold-up time. Out on the road the Furo X performs admirably, using the nine-speed Shimano gearing, battery power or a combination of the two. Battery life is solid, the comfort level is very good and, when you’re done for the day, the e-bike is easily stored just about anywhere. Small wheels and narrow handlebars do tend to remind you that this is a folding bike though, so it’s not made for lengthy adventures into the countryside. However, the Furo X can handle rural lanes if you’re content to give it a try, just watch out for less than perfect surfaces. Around town though this agile little e-bike is nigh on unstoppable.",
  "pros": [
    "Lightweight design",
    "Easy to fold up and down",
    "Solid e-bike performance"
  ],
  "cons": [
    "Usual folding bike compromises",
    "Narrow handlebars",
    "Small wheels"
  ],
  "article": [
    "The Furo X e-bike arrives at a time of change when it comes to commuting. Not everyone is planning on going back to the office, which might compromise the appeal of this electric two-wheeler.",
    "However, the good news for British cycle manufacturer Furo Systems is that the Furo X is still a very useful proposition, even if you’re not going to be using it for trips to and from the office. What we’ve got here is a lightweight folding e-bike, weighing just 15kg, that collapses with remarkable simplicity and can be put up again just as easily.",
    "It’s well built, has some very practical design features and provides you with a comfortable ride despite the small commuter bike wheels. The Furo X can also handle a wide range of riders, between 5’2” and 6’2” up to a maximum weight of 100kg.",
    "While the bike can be pedaled perfectly happily using the Shimano Sora 9 speed gears, the rear-mounted Bafang hub motor and Samsung Lithium-ion battery combination can propel the e-bike easily up to the usual 25kmh/15.5mph regulatory speed. The Furo X can stop on a dime too, thanks to beefy Shimano M315 hydraulic disc brakes. All told, it’s a potent package for the money.",
    "The Furo Systems Furo X folding e-bike costs $2,399 / £1,799 (about AU$3,300) and was released mid-2021. That's a little more than our current favorite folding e-bike, the MiRider One, but less than the latest GoCycle GX.",
    "Furo Systems already has the full-size Aventa e-bike, which we tested a while ago and, alongside its Fuze electric scooter, the British brand is building up a distinctive portfolio of products. The Furo X has an eye-catching design that emulates the style of those other bikes, but with a fully folding frame.",
    "One of the best things about the Furo X is its weight, or rather lack of it. At only 15kg it's very reasonable, although much like a Brompton M6L, you still wouldn’t want to carry it too far despite the proliferation of carbon fiber in the design.",
    "However, unlike Brompton’s e-bike, the Furo X is very easy to fold and unfold. Indeed, there are three main points to contend with including the folding handlebars, the fold in the main frame and the folding pedals. Mercifully, thanks to push buttons and nicely crafted clips, getting the Furo X up and down again is very straightforward, and you don’t spend half an hour sitting amidst a tangle of tubes and wheels not knowing what to do first. Full marks to Furo Systems for making this procedure as painless as possible.",
    "Once assembled and upright, the Furo X looks the part with its largely black finish, though the gray and chrome flourishes make it stand out from the crowd. There’s a very comfortable saddle, surprisingly pleasing handlebar grips and the bike feels nicely balanced with a rear wheel hub-mounted Bafang motor and a lithium-ion battery pack sitting on the frame under the saddle. The handlebars are also home to an onboard computer, which has a neatly laid-out LCD display showing all of the features and functions.",
    "There are some innovations to be found on the bike too, with integrated wireless turn indicators being a neat touch. These can be activated by a pad on the handlebars. Meanwhile, the small key lock on the battery pack allows quick and easy switching on, while there’s an integrated USB charger to be found in this location too.",
    "Rounding out the key design feature set is the Shimano nine-speed gearing setup, Shimano hydraulic disc brakes and a pair of durable all-terrain tires.",
    "On its website, Furo Systems says that the Furo X currently comes with a free front and rear mudguard, rear luggage carrier, kickstand and complete lighting kit. Our model featured all of these apparent added extras, although note that further down the line they might be add-ons that need to be paid for.",
    "Folding bikes offer a slightly different riding experience to regular bicycles, and the Furo Systems Furo X is no exception. It’s got dinky wheels and fairly stubby handlebars, which (if you’re old enough) will evoke memories of trying to handle a Raleigh Chopper. This is most noticeable when you’re moving in and around objects and turning sharp corners but with practice the Furo X proves nimble and agile.",
    "Straight line pedalling meanwhile is wonderfully simple, with smooth and seamless gear changes coming from the nine-speed Shimano system. That’s all before you’ve powered up the battery too, because thanks to its light carbon fiber frame, this is an e-bike that can do without the power if you fancy a little exercise. If you’ve had a bad day at the office, however, you can simply press the button and engage the battery power, which is a real surprise.",
    "There’s a standard Furo X, which comes equipped with a 8.7Ah 314kWh Samsung battery, but if you need even more range there’s a 10.5Ah 378Wh option too. Our model came with the standard pack and it proved very impressive, with five levels of assistance on offer via the computer.",
    "While it’s quite small, due to the design of the bike, we got some great performance from it and good mileage too, although Furo’s estimate of 30 miles slipped by about 10% when we were really milking the battery. Recharging took us around five hours.",
    "The Bafang rear-mounted hub motor can pump out over 500W peak power, which is more than enough to get you through most everyday cycling scenarios. We found the Furo X to be very comfortable on longer runs too and the luggage rack makes it a great little option for quick forays to the store if you’ve got a safe and secure way of lashing some groceries on board.",
    "Riding in and around town proved fuss-free, and the indicators are a novel addition, although we tended to stick to hand signals just to be sure we’d been seen before making a manoeuver.",
    "Perhaps the best thing about the performance of the Furo X e-bike is the way it takes the strain when you need it to. If you use a folding commuter bike for work there’s nothing worse than getting hot and bothered if you’ve got some strenuous sections of road to navigate to and from the office. We tried a few commute-style journeys and, thankfully, arrived each time without having broken into a sweat. That can be a real win if you’ve got meetings to attend when you reach work in the mornings.",
    "Equally though, we found that the Furo X is perfectly handy for general cycling excursions, with plenty of go juice from the battery and more than enough stopping power from the hydraulic brakes. Even if you don’t commute, this is a great option if you’re short on space for storing a regular sized bike and, best of all, it folds up so, so easily.",
    "First reviewed September 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and release date",
    "5": "Design",
    "12": "Performance",
    "21": "Don't buy it if"
  },
  "links": {
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "folding e-bike": "https://www.techradar.com/best/best-folding-e-bikes",
    "MiRider One": "https://www.techradar.com/reviews/mirider-one",
    "GoCycle GX": "https://www.techradar.com/reviews/gocycle-gx-2020",
    "Aventa e-bike": "https://www.techradar.com/reviews/furosystems-aventa",
    "electric scooter": "https://www.techradar.com/best/best-electric-scooters",
    "Brompton M6L": "https://www.techradar.com/reviews/brompton-m6l-electric"
  }
}