{
  "source": "https://www.techradar.com/reviews/xgimi-aura-4k-ultra-short-throw-laser-projector",
  "title": "Xgimi Aura 4K Ultra Short Throw Laser Projector review",
  "category": "televisions",
  "updated": "2021-12-06T21:16:12Z",
  "author": "mark-knapp",
  "summary": "The Xgimi Aura makes building a home theater dead simple",
  "verdict": "The Xgimi Aura delivers a highly competitive option for those in need of an ultra-short throw projector. Its laser projection system is bright and it makes for a great image alongside powerful speakers and on-board Android TV. But those who can fit a standard projector can stand to save a ton of money.",
  "pros": [
    "Monumental image",
    "Powerful sound",
    "Easy setup"
  ],
  "cons": [
    "Slow Android TV",
    "Expensive",
    "Needs space"
  ],
  "article": [
    "The Xgimi Aura is a premium 4K, ultra-short throw laser projector that puts everything you need for a home theater into a small box. 'Small' is relative here, as this is Xgimi’s biggest projector at 606 x 401 x 139.5 mm and 32.9 pounds, however it takes up less space than even a 50-inch TV while providing a much bigger picture and audio that can compete with soundbars.",
    "The Xgimi Aura easily provides a massive image that’s bright enough for casual viewing during the day, though best enjoyed in a darker room. A lot of shadow detail will be lost in a brighter room, but you'll gain that back in a light-controlled room. The projector doesn’t get too fancy with the image, though, offering only HDR10 and not featuring things you might take for granted on $2,000+ TVs, like high and variable refresh rates, AI upscaling, and granular settings to tailor the picture exactly to your liking. That said, you won’t find a lot of 150-inch TVs for this price.",
    "How does it stand up to the competition?",
    "At $2,499 / £2,149 (around AU$3,550), the Aura isn't cheap, but it’s priced competitively against other short-throw laser projectors in the field like the Samsung LSP7T, Vava 4K, and Epson EpiqVision Ultra LS500. With a bright and color 4K picture, it’s also competitive from an image standpoint, the Epson’s offering is brighter (and 60% more expensive). Though there’s no shortage of bright 4K projectors that can offer a competitive picture at a lower price, like the Optoma UHD38, albeit without the ultra-short throw ratio.",
    "The Aura offers a fairly complete package as well with powerful speakers that can readily fill a room and built-in Android TV. The Android TV performance leaves a little to be desired, but a number of HDMI ports on the back of the Aura leave room for alternative video sources.",
    "This projector is most compelling for its simplicity. It provides a stunning picture that will fill a room as long as you’ve got the space for it, and it doesn’t come with the same extra setup steps of longer-throw projectors. It’s further bolstered by the 25,000-hour lifespan of its laser light source. You can get a comparable or better picture from a cheaper TV or projector, but the TV won’t match the Aura’s size and the cheaper projector won’t match its incredible simplicity.",
    "The Xgimi Aura is available now for $2,499 in the US and £2,149 in the UK on Xgimi.com and Amazon.",
    "The Xgimi Aura continues with the stylish design found across most of Xgimi’s product line. This is the brand’s biggest product currently, so there’s more room for stylish accents. The unit looks almost like a blimp-shaped soundbar, and in some ways it is exactly that. The combo of silver and black are classy, and the design doesn’t look like an overly technical piece of equipment sitting in the living room.",
    "The Aura includes an extra premium remote control that’s functionally similar to the plastic ones that come with its other projectors, but this one has a heftier design and metal construction that simply looks and feels great. As the Aura comes running Google’s Android TV operating system, the remote provides the controls needed for that interface and a Google Assistant button for voice control. The OS is very useful, and makes the Aura a true all-in-one device, though Xgimi still hasn’t managed to get Netflix to support its hardware, so a workaround or external source is required to watch Netflix on the Aura.",
    "The hardware running the Android TV operating system could stand to be more powerful. It’s not always perfectly responsive, takes a bit of time to start listening to voice commands, and it can stall out majorly when scrolling through video timelines. Trying to skip to the last half of Dune, the playback simply wouldn’t start up until we shifted it around a half dozen times, and when it did, the audio and video wouldn’t sync up.",
    "Though the Aura doesn’t need any other connections beyond power, it has ports on the back for different setups. There are three HDMI 2.0 ports for external sources. An Ethernet port will let you run a wired internet connection to the projector, though it can connect to 2.4GHz and 5GHz Wi-Fi as well. You can power a streaming dongle with any of three USB 2.0 ports. The unit also has a 3.5mm and optical jack for audio output. Of course, the built-in set of four 15W Harmon Kardon speakers will let you forget about external speakers.",
    "The Aura uses ultra-short throw DLP projection with a laser light source and 0.47-inch DMD. It provides a max brightness of 2,400 ANSI Lumens and a 4K image. The projector doesn’t require any manual focusing, but depending on your setup, may require manual keystone adjusting using its 8-point keystone correction — a tool that can actually help accommodate for curvature as well as off-angle projection. The projector doesn’t provide a means of reframing the image to fit a certain space, something the Xgimi Elfin featured, but owners should really plan on dedicating a space with either a clear wall or a projection screen for this projector.",
    "Given the power of the laser light source and danger of direct eye exposure, Xgimi has built an aggressive IR sensor onto the top of the projector that can detect when something comes near and automatically dim the display. It doesn’t always activate as soon as the projector is blocked, though, so caution is advisable.",
    "The projector’s positioning is going to be very important for any setup. The Aura has a 0.233:1 aspect ratio, so it’s beaming out at a very wide angle. Having any objects nearby, like a plant, or decorations on the wall can easily get in the way of the projection. At just a few inches away from the wall, the Aura will be casting an 80-inch diagonal projection. Bump that up to a foot (11.7 inches to be precise) away from the wall and you’ll have a 120-inch picture.",
    "One of the key assets of the Xgimi Aura is its ability to provide a massive image with ease. It’s ready to go as a home theater projector, and its colorful image and crisp 4K visuals make for an appealing image.",
    "There’s no denying the projector musters plenty of brightness. Even during the daytime in a well-lit room, we’re able to watch brighter content with ease. Cartoons like Bob’s Burgers are as easy to see as ever while being that much larger through projection. TV shows and movies that can skew a little darker from time to time still look decent if the room lights are off and any shades are drawn, even if the room isn’t entirely blacked out.",
    "The black levels aren’t stunning, though. There’s really no winning with the black levels, as turning out all the lights to make shadow detail easier to see makes it clear just how bright “black” actually is, and leaving the room bright makes it hard to see shadow detail. Game of Thrones’ infamous The Long Night episode was just as unwatchable as ever because of how impossible the dark scenes were to see in a semi-bright room. Thankfully, the bright, massive image is so easy to get lost in, the dark gray of letterboxes and the small border around the whole projected image can become easier to overlook. Though Xgimi is using DLP projection on the Aura, it hasn’t run into the same dithering issues we saw on the Halo and Elfin — perhaps thanks to the different, 0.47-inch DMD display chip used.",
    "Dune is a stunning showcase of the Aura’s capabilities. The dessert shines, characters’ blue eyes glow, and the rich details throughout are easy to spot. Blown up to fill an entire wall in our living room, the experience is wonderfully theater-like. The night attack by the Harkonnen on Arrakis looks stunning despite having a ton of dark-armored soldiers squaring off against each other. Details remain relatively visible in darker areas while the projector manages to make the explosions really flare up.",
    "Sound is also exceptional from the Aura. It’s four speakers can pump out a load of sound and are well balanced. Even at 50% volume, the speakers boom so much through action scenes that we worry about our neighbors trying to sleep. They do a good job drowning out the fans, though there is a high-pitch whine that sometimes sneaks through.",
    "The projector offers a motion compensation feature that generally manages to make the visuals worse. Animation looks truly awful, and live action video gets some motion smoothed out while other movements become incredibly stuttery. Action is generally smooth enough with this feature turned off, thankfully.",
    "This isn’t quite the projector for those that like to tinker and get the perfect picture, though. The settings are a bit limited. Brightness, contrast, saturation, and sharpness can all be controlled, but there’s no dialing in RGB color values. Home theater aficionados may be disappointed, but those who simply want a great picture they can enjoy straight out of the box without fiddling will be pleased.",
    "You’ll want to stick to higher definition content to make the most of the Aura. There’s no fancy AI upscaling action happening to improve the picture quality of lower-resolution content as you’ll find on many TVs. Watching The Fresh Prince of Bel-Air looks much like watching it on an old CRT TV back in the ‘90s, only now it’s bigger.",
    "You want a no-fuss home theater A bare wall or large projector screen are the only things you need to make a solid home theater with the Xgimi Aura. It’s got a great image, powerful speakers, and Android TV built-in.",
    "You can’t stand a small picture You can’t get a small picture with the Aura. Even just a few inches from the wall, and the Aura will project an image bigger than almost any TV you’ll find at the shop. You’ll never have to settle for a small screen again.",
    "You plan to project a lot The Aura uses a laser as a light source, which offers a considerable lifespan advantage over lamp and even LED light sources. It can run for up to 25,000 hours, so you won’t have to worry about burning out the bulb by accidentally leaving it running now and then.",
    "You want some flexibility in your setup The Aura is built to live in one spot and cast a huge image. It’s larger and heftier than typical projectors, so won’t be as easy to move from room to room, and you won’t really get the option to occasionally have a small image.",
    "You can’t darken the room This projector is good and bright, but if you can’t get the room very dark, you’ll always be losing a lot of detail in darker scenes.",
    "You don’t have a clear wall You’re going to need a sizable space for the Aura’s projection. Anything to the side of the projector can easily get in the way, and you won’t want to have to take down hangings from the wall all the time if you don’t have a big enough space for the 80-150-inch picture."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and availability",
    "7": "Design and features",
    "14": "Picture quality",
    "22": "Buy it if...",
    "25": "Don't buy it if..."
  },
  "links": {
    "50-inch TV": "https://www.techradar.com/best/best-50-inch-tvs",
    "Vava 4K": "https://www.techradar.com/reviews/vava-4k-laser-projector",
    "Optoma UHD38": "https://www.techradar.com/reviews/optoma-uhd38-4k-projector"
  }
}