{
  "source": "https://www.techradar.com/reviews/iphone-se",
  "title": "iPhone SE (2020) review",
  "category": "phones",
  "updated": "2021-11-27T10:47:12Z",
  "author": "gareth-beavis",
  "summary": "The 2020 iPhone SE is slim, affordable and future-proofed",
  "verdict": "This is the phone to get if you just want a iPhone that will last you a few years, but don’t want to pay a lot for it. It might not be the newest model any more but the iPhone SE 2020 offers ‘decent but not top-end’ performance: a good camera, enough power, a great App Store to plunder and a lighter iPhone than most recent models. Battery life and screen tech could be better, the headphone jack is a miss, but - for the price - this is one of the best iPhones Apple has ever made. Even now.",
  "pros": [
    "Lightweight frame",
    "Low price for iPhone",
    "Powerful chipset"
  ],
  "cons": [
    "Battery life could be better",
    "Old screen technology",
    "No headphone jack"
  ],
  "article": [
    "The iPhone SE 2020 was built around one goal: to launch an iPhone for less money than ever, and it achieved that well. For just $399 / £389 / AU$679 you can have a brand-new handset from Apple – it’s one of the best iPhones ever created and you can pick one up for less than half the price of a new flagship phone.",
    "The design of the phone is going to be familiar to anyone that’s used an iPhone recently – unless you’ve not held a handset from Apple since 2013, you’ll have seen this 4.7-inch frame before, complete with bezels top and bottom and a home button with a fingerprint scanner built in.",
    "This isn't the newest smartphone from Apple - that's the iPhone 13 series, including that phone, the iPhone 13 mini, iPhone 13 Pro and iPhone 13 Pro Max. You can find reviews for each of them by clicking the linked names, but they're all pricier and more premium devices than the SE.",
    "The iPhone SE (2020) is seen as the ‘smaller’ iPhone form factor given the all-screen designs of the more recent models, and it’s both more lightweight and pocketable than any other modern Apple phone besides the iPhone 12 mini and iPhone 13 mini, which are marginally smaller (despite packing in a larger screen), but also pricier than a mid-range phone.",
    "The SE is pleasingly water resistant, but does have some drawbacks: it lacks a headphone jack at the bottom, and because the display technology is slightly dated (as it comes from the iPhone 8) it can suffer in bright light when you’re trying to watch videos or the like.",
    "Apple might have stuck with the same design as the iPhone 8, but the innards are much improved – notably the new A13 Bionic chipset inside, which adds speed nearly everywhere and really does improve the performance over the older 4.7-inch models. It’s not quite at the level of the iPhone 12 range, but it’s not far off – and getting the recent silicon means the iPhone SE has years of iOS updates head of it.",
    "That A13 chipset has improved the camera performance too, despite no discernible change to the specs of the sensor since the iPhone 8 (there’s just a single lens on the iPhone SE 2020).",
    "It takes decent, bright photos that will please most people, although it doesn’t quite offer the same color reproduction or clarity as the iPhone 11 Pro Max, for example, let alone the iPhone 12 Pro Max or iPhone 13 Pro Max.",
    "The portrait mode doesn’t work as well as on phones that pack a second, depth-sensing sensor for precise bokeh effects , and as a result you can be left with some odd-looking fringing around the edges of subjects. But overall the camera – and especially for the price – takes impressive pictures in most scenarios.",
    "Battery life is probably one of the biggest issues we found with the iPhone SE 2020 – it’s not going to easily last you a day unless you’re a light and sedate user.",
    "Given the number of power-hungry apps available that will make the most of all that power provided by the A13 chipset, we would have liked to have seen at least an all-day battery in there, even for the lower price.",
    "However, don’t let that detract from the fact that the iPhone SE 2020 follows on from its predecessor by bringing you a new iPhone, with not a lot of compromise, for less money than you might expect.",
    "While it doesn’t hit many heights in terms of power or performance, it more than offsets that by being the cheapest iPhone Apple has ever launched while still packing refined and useful hardware, making the new iPhone SE a splendid option for those either on a budget or just wanting to find an easy route into the Apple ecosystem.",
    "The iPhone SE is available now around the world including the US, UK and Australia. The release date was April 24, 2020, with pre-orders going live the week before.",
    "Although it was rumored to be called the iPhone SE 2, the iPhone SE is the official name that Apple opted for for its 2020 device. You won't see it referred to as the iPhone SE 2020 on Apple's website - that's just our way of distinguishing it from the 2016 device.",
    "The iPhone SE price starts at $399 / £389 / AU$679, which is a slight price drop in some regions from its launch price of $399 / £419 / AU$749 / Rs 42,500. The base model comes with 64GB of storage, with 128GB and 256GB models also available for a higher price.",
    "The 128GB model costs $449 / £439 / AU$759 while the 256GB one costs $549 / £539 / AU$929.",
    "In the US, Apple is offering the new iPhone SE at $16.62/month through its financing plan or, if you have an older iPhone to trade in, you can get it for less.",
    "The iPhone SE has exactly the same design and display as the iPhone 8 from 2017. Using this form factor and screen hardware allowed Apple to keep the cost of the device as low as it has, as it didn’t need to invest in a whole new manufacturing process.",
    "It feels like the iPhone world has moved on in three years though – now the 4.7-inch screen with the chunky bezels above and below feels like it belongs to the past.",
    "In that time the flagship iPhone range has moved to an all-screen design – barring a notch at the top, you’re presented with barely any bezels – while with more premium aluminum inside, things have got a little weightier in recent years.",
    "So returning to the iPhone 8 design means Apple is bringing back its more lightweight phone, bridging the gap between the older iPhone SE and the behemothic (but impressive) iPhone 11 Pro Max, for example.",
    "Indeed, picking up the new iPhone SE , the first thing you’ll notice is how lightweight it is. Again, some might not notice the change if they’re coming from a smaller phone from 2016/17, but trust us: it could have been a lot worse, as the devices in the newer all-screen iPhone ranges are a lot heavier.",
    "While the iPhone 8’s design might feel like an archaic choice for a new iPhone, it makes a lot of sense in the iPhone SE 2020 – and for some who don’t particularly care for the latest features, this more familiar design will be a lot more desirable.",
    "One suspects that if Apple had rebooted the original iPhone SE shape, with the smaller 4-inch screen and clickable home button (the new iPhone SE 2020 features a haptic button that doesn’t move), it would still have sold well; but the larger 4.7-inch LCD screen is more useful for today’s apps, which make good use of the extended display.",
    "One thing that many will miss is the 3.5mm headphone jack. We’ve been lamenting its loss for many moons now, but as the original iPhone SE (or other cheaper phones that are 2-3 years old, that you might be upgrading from) had this feature we can see it might still cause consternation.",
    "While some phone buyers might have accepted this loss by now (barely any handsets are being launched with the port now) it might still be something of a shock for those using phones from a few years ago, in spite of the plethora of true wireless earbuds.",
    "Apple has put its EarPods in the iPhone SE box, which use the phone’s Lightning connector in place of the 3.5mm headphone jack, but those who already have wired headphones that they’re happy with will need to spend $9 / £9 / AU$15 on an adapter. Otherwise, you could use a pair of wireless earbuds.",
    "The display on the iPhone SE 2020 might not be the most feature-rich, but it’s fine. Given the target market this phone is aimed at – those who want a new iPhone, but don’t want to spend a huge amount of money on one – there’s not really an expectation of a fancy OLED display here.",
    "The resolution of the iPhone SE screen might not be top-end (it’s far less sharp than more recent iPhones, or even a number of cheap Android phones), but it’s not something that’s really that obvious in most use-cases.",
    "The only thing that we would like to see improved is the brightness of the display: in the years since the iPhone 8 launch the color and vividity of the screens on phones has improved hugely, and they appears brighter at default settings – and forcing the brightness right up has a strong (and negative) effect on the battery life.",
    "That brightness does need to be increased a little too often as well – there’s no escaping the fact that this is an older display on offer with the iPhone SE 2020, and there were more than a few occasions when we needed to shelter the phone from brighter light to see what was on the screen – something that isn’t an issue with newer iPhones.",
    "The big change with the iPhone SE 2020 (and we don’t use the italics lightly there) is the upgraded engine from the iPhone 8. While the external design is nigh-on identical, Apple has supercharged the insides, with an improved chipset running the show.",
    "That extra power is designed to allow the new iPhone SE to rival the iPhone 11 range in terms of speed when flipping between apps, and editing snaps and video, and should also improve the camera performance (thanks to upgraded computational power from the new chipset).",
    "Apple looks to have implemented some serious performance improvements while keeping the cost of this phone down, and that impression has been borne out in our experience with the iPhone SE: it matched the iPhone 11 Pro Max for speed when exporting an iMovie, and actually compressed a 1080p four-and-a- half minute video at an almost identical speed.",
    "We compared it to the older iPhone 8 Plus with the same test, and when compressing and exporting a movie down to a smaller size, the iPhone SE 2020 managed the task so much quicker.",
    "If you’re going to tax the phone to its limits, then the iPhone 11 Pro handsets are more able to handle graphically intensive tasks and apps - but even when playing more powerful games like Pascal’s Wager, we didn’t feel the new iPhone SE losing any performance. The average user will notice little difference unless intentionally trying to tax the SE 2020.",
    "Of course, the newer iPhone 12 range has it beat whatever you're doing, thanks to an even newer A14 Bionic chipset, but the iPhone SE 2020 isn't far behind.",
    "What's interesting is the way that the iPhone SE has been 'angled' by Apple in terms of power output. Our benchmark testing showed that the newest iPhone doesn't quite have the raw grunt or speed of the iPhone 11 range, suggesting that Apple is balancing power output with battery performance.",
    "Those benchmark scores saw an almost identical single-core (for low-impact tasks) score of 1300 for the iPhone SE, and 3100 for the multi-core test. That's less than the 3500 for the iPhone 11 Pro range, but not far off the standard iPhone 11.",
    "All the benchmarks we ran painted a similar picture, proving that the iPhone SE 2020 doesn't have the raw grunt of the Pro range, perhaps designed to provide the most battery life possible.",
    "You can see the same thing on the iPhone 11 vs the iPhone 11 Pro - small differences in benchmark scores, likely in a bid to make sure each experience is tailored to different target users.",
    "Those interested in the Pro model will want the absolute max power (which is why there's a larger battery to compensate) but the more 'regular' user might be fine with more of a balance - the new iPhone SE also has 3GB of RAM, rather than the 4GB the iPhone 11 and iPhone 12 are packing, likely again to minimize costs.",
    "We experienced very little in the way of slowdown during our time with the new iPhone SE – apart from in the camera, where the phone took a second or two to process each image we took. That’s not a huge problem in the grand scheme of things, but if you want to instantly check out a snap you’ve taken it takes the shine off somewhat.",
    "It’s hard to know what else to say about the upgraded chipset (which will have an impact on the performance of some apps in the future), but based on side-by-side comparisons we couldn’t fault the power of the new, cheaper iPhone.",
    "The iPhone SE launched with iOS 13.4 on by default, but it's received numerous updates since then, including a major one to iOS 14 and iOS 15 - with the latest available version for the phone at the time of writing being iOS 15.1.",
    "In our view, the make-or-break feature for the iPhone SE – and so the key focus of this review – is the iPhone SE camera and how well it performs in day to day use – given that there’s ‘old’ hardware on offer here, Apple has taken a gamble that it can improve photo quality using image processing powered by the A13 Bionic chipset.",
    "Spoiler alert: the gamble has paid off handsomely. The new iPhone SE can often stand up to the iPhone 11 Pro Max in terms of general snapping, and only struggles when it comes to the areas where the hardware is lacking.",
    "We’ll explain more about that in a moment, but we’ve compared the iPhone SE 2020 to the iPhone 11 Pro Max, the iPhone XS Max and the iPhone 8 Plus, and it holds its own well.",
    "Before we go into more detail about the camera’s performance, let’s look at the hardware: the iPhone SE camera is basically using the same set of lenses, and megapixel count, as the iPhone 8, with a 12MP camera, a six-element lens and a sapphire glass cover for strength.",
    "We don’t know the exact sensor that’s being used - Apple wouldn’t confirm whether it had upgraded the hardware there - but the same 12MP camera and f/1.8 aperture remains, so it seems that there’s very little change to the sensor.",
    "However, Apple has kept the same hardware specs for the ‘normal’ wide-angle lens on the iPhone range since the iPhone 8, but hugely improved the quality of the pics – which suggests the processor is doing a lot of the heavy lifting. So just how much difference does imbuing the iPhone SE with the same A13 Bionic chipset, complete with that improved image signal processor inside, make?",
    "The short answer is: a lot. Put photos from the iPhone SE 2020 next to snaps taken with the iPhone 8 Plus, for example, and you can instantly see improved sharpness, more accurate color reproduction, and an overall ‘better’ photo whether taken in brighter or darker conditions.",
    "Apple’s ‘tuning’ of images from the new iPhone SE – the way it thinks a photo should look – is interesting, with the processing appearing to follow in the footsteps of that in the iPhone 11 range, favoring a cooler-looking scene.",
    "This results in images that look less warm compared to those from even the iPhone XS from 2018 (which, to our eye, are more visually appealing), but the processing does produce snaps with good levels of sharpness and clarity.",
    "In a side-by-side comparison with the iPhone 13 Pro Max, one of the most feature-packed phone Apple has ever created, the iPhone SE doesn’t perform as well… but that’s understandable for the price. It’s clear that the SE has a tendency towards overexposing in some scenarios, with some of the color and vividness lost in a few pictures.",
    "One in particular saw us having to massively drop the exposure of a nature scene taken under forest cover. Despite the darker conditions, the image was far too bright – it seemed the new iPhone SE camera was trying too hard to compensate. We often found that the images on the viewfinder were much brighter than in real life, which usually meant we had to tweak the exposure.",
    "However, in a direct comparison with the best iPhone on the market, there wasn’t as much of a difference as the massive gulf in terms of price tag would suggest. You don’t get things like night mode (which is superb, and worth looking into if you’re considering the iPhone 11) or the additional ultra-wide and 2x zoom cameras.",
    "In terms of the image quality you do get, the differences are small, but still there to see. Not all the tricks have come off – for instance, the depth of field capabilities on the iPhone SE aren’t as strong (due to the aforementioned lack of a depth-sensing lens).",
    "This means portrait mode doesn’t always quite work out the edges of the subject (and it can only manage to use the background defocusing on humans, not on objects).",
    "The new iPhone SE camera will blur around the edges of a subject at times, meaning using one of the smart effects, like Stage Light Mono, look quite strange, with parts of the hair missing at the sides. It’s not terrible, but it’s not easy to get the smart-looking snaps Apple uses in its marketing.",
    "While any phone that can algorithmically work out a subject using machine smarts alone is impressive, there’s a gulf in quality between a portrait mode photo taken with a phone with two-cameras compared to a single sensor.",
    "Elsewhere, the low-light detail isn’t as robust, and the color reproduction is behind that of the behemothic iPhone 11 Pro Max or above.",
    "But when you consider the relative cost of the phones, and the fact that the new iPhone SE is about a third of the price of the 11 Pro Max, it’s easy to forgive some of these mild deficiencies, and instead be impressed that Apple has managed to improve things so well just by putting a new engine inside what is in many respects an old handset.",
    "The front-facing camera, a 7MP affair, has also been given smarter capabilities: you’re able to take the aforementioned portrait mode pictures, meaning the background blurs away and you can arrest the world with only your dazzling features.",
    "There’s no ‘slofie’ (read: slow-motion selfie video) option here, and we can’t say we miss it – although that may just be because we’re still slightly sickened by the invention of the word ‘slofie’.",
    "The quality of the images is good – they’re sharp and clean, and even look decent in low-light too. Apple has applied its photography algorithms well here, and improved the capability of the front-facing camera to take smooth, well-lit photos.",
    "Again, using any of the portrait mode options will mostly lead to a closely-cropped image, with hair looking somewhat unnatural or blurred – but standard selfies come out well.",
    "In terms of video too, the overall power of the iPhone SE 2020 is as good as anything Apple is offering elsewhere in its lineup: you can shoot 4K video at up to 60 frames per second (fps).",
    "The 60fps option should only be used in good light though, as movies will look dark in lower light. The slickness of the footage looks a bit odd – it almost looks too slick – but it gives a nicer look for fast-moving scenes.",
    "The new iPhone SE battery size hasn’t been announced by Apple (it never reveals this spec), but we do know that the iPhone 8 came with a 1,821mAh power pack, and we anticipate something similar for the iPhone SE 2020.",
    "And if that is indeed the case then it’s a potential issue, because the iPhone 8 didn’t have stellar battery life – it could just about last a day in normal use, with the charger needing to be in reach towards the end of the evening.",
    "The new iPhone SE should, in theory, have a longer-lasting battery as it’s got a more efficient engine at its heart, and iOS 13.4 is better at managing power consumption.",
    "However, Apple says the iPhone SE “lasts about the same as iPhone 8”, which is surprising and suggests that you should see about 2-4 hours’ less battery life in normal use than an iPhone 11, and up to 25 hours less if just using the iPhone for audio.",
    "In practical use, we saw a mixed performance from the new iPhone in terms of battery life: it certainly wasn’t in the same power-use bracket as the impressive iPhone XR and iPhone 11 range, and we found ourselves having to regularly reach for the charger in the evening.",
    "However, on low-usage days, where we didn’t use the iPhone for a heavy amount of photography or web browsing, we got to the end of the day with over 30% left in the tank, and we saw little power-drain overnight too, suggesting that the iPhone SE is pretty power-efficient in standby mode.",
    "You'll get around 5% performance drain overnight depending on what devices you have linked via Bluetooth (we had two wearables linked, which caused more of a drop.",
    "But, overall, we felt that the iPhone SE was indeed a throwback to the older, 4.7-inch iPhone models, where it just felt like the power pack inside wasn’t big enough to comfortably last the day – we definitely didn’t have the confidence in this handset that we’ve come to enjoy with more recent iPhones.",
    "However, if you’re coming from an original iPhone SE or older iPhone model you won’t notice any issue (and you’ll probably see a slight improvement) – it’s just a shame that this feels like an opportunity to improve things that Apple has surprisingly missed.",
    "One way of alleviating this issue is to invest in a fast charger. Anything with USB-C PD or 18W power delivery (such as the charger that comes in the box with the iPhone 11 Pro and is available for an extra $29 / £29 / AU$49) will charge the phone rapidly – we’re talking getting you from empty to over 50% in around 30 minutes.",
    "The overall charging speed is around one hour and 50 minutes for a full, dead-to-100% recharge, but the 5W charger that comes in the box will be a lot slower. We’d suggest picking up a fast iPhone charger from Apple or Anker to suit your speedier charging needs.",
    "Then again you could buy a wireless charger instead, as the iPhone SE 2020 is Qi-charging enabled. Grab a cheap wireless pad or two, for home and when (eventually) at work, and you’ll never have an issue with power levels again.",
    "It’s not ideal – we’d rather the iPhone could just easily last a day without you needing to reach for the charger, giving you some breathing room going into the next day or in case of emergency, but that’s not the case here for some reason.",
    "First reviewed: April 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "iPhone SE price and release date",
    "18": "Design and display",
    "32": "A13 Bionic chipset",
    "46": "Camera",
    "70": "Battery life",
    "83": "Don’t buy it if..."
  },
  "links": {
    "best iPhones": "https://www.techradar.com/news/best-iphone",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone 13 Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review/reviews/iphone-11-pro-max-review",
    "new iPhone": "https://www.techradar.com/reviews/iphone-13",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "iPhone 8 Plus": "https://www.techradar.com/reviews/iphone-8-plus-review",
    "iPhone 11 vs the iPhone 11 Pro": "https://www.techradar.com/news/iphone-11-vs-iphone-11-pro-vs-iphone-11-pro-max",
    "iOS 15.1": "https://www.techradar.com/news/ios-15-update",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "wireless charger": "https://www.techradar.com/best/best-wireless-chargers"
  }
}