{
  "source": "https://www.techradar.com/reviews/1-voip",
  "title": "1-VoIP business VoIP review",
  "category": "computing",
  "updated": "2021-11-09T15:39:40Z",
  "author": "barclay-ballard",
  "summary": "We review 1-VoIP, a VoIP business telecommunications provider with a reliable, quality service and affordable prices.",
  "verdict": "1-VoIP's business offering is suitable for organizations of all sizes and its anti-spam feature is a great way of protecting staff from unwanted distractions.",
  "pros": [
    "Affordable pricing plans",
    "Excellent customer service with service level guarantee",
    "Quality: Fantastic HD voice audio clarity",
    "Expertise: 1-VoIP have specialised in VoIP for 15+ years",
    "Reliable: 99.999% Network Uptime",
    "No contract or cancellation fee",
    "Password protection and voicemail available",
    "Installation assistance provided",
    "Able to keep your existing number"
  ],
  "cons": [
    "No built-in video conferencing solution",
    "Phone not included on all plans",
    "Complex softphone configuration",
    "No SMS ability"
  ],
  "article": [
    "More experienced VoIP users may remember 1-VoIP in one of its previous incarnations: VoIP Your Life or VYLmedia. While the company may be operating under a new name, it is still able to draw on years of experience meeting customers’ communication needs.",
    "Unlike some VoIP providers that prefer to specialize in either the residential or business market, we're reviewing 1-VoIP: a VoIP provider who cater for both home and company use. In our 1-VoIP review however we'll be analyzing the service purely from a business use perspective.",
    "1-VoIP's strength in the business world is that is services for work business of every size, from start-ups to enterprises. Perhaps then, that is why 1-VoIP is being favoured over bigger VoIP providers like Nextiva and RingCentral. In our 1-VoIP review we look into which unique advantages, such as Anti-Spamming ability, give 1-VoIP the competitive edge for your business.",
    "That being said, larger businesses may decide to go with a slicker, more feature-rich solution. In particular, as a modern business owner, you should be on the look out for VoIP providers who offer integrated video conferencing options.",
    "Thanks to the likes of Microsoft Teams, Slack, and Zoom, video meetings are the standard in recent business communications. For other popular VoIP providers with video-conferencing as a feature, see our Nextiva vs. RingCentral VoIP comparison review. Alternatively, view our guide to the best VoIP phones.",
    "1-VoIP offers three pricing plans for businesses: Metered, Corporate, and Professional.",
    "Interestingly, 1-VoIP does not differentiate between the number of features it offers to users of these plans - with all customers gaining access to every single 1-VoIP feature.",
    "In addition, customers are sure to welcome the inclusion of the Nomorobo anti-spam calling service. Nomorobo is a third-party service specifically designed to block spam calling such as telemarketers and other well-known, blacklisted numbers.",
    "You likely know all too well that unwanted calls can cause a significant drain on productivity, so integration with this service is sure to be appreciated. It’s also customizable, so organizations can easily toggle the feature on and off, as well as report new spam numbers for review.",
    "For businesses that run IP PBX software, it is also worth noting that 1-VoIP makes SIP Trunking services available. Almost any mainstream PBX system (such as Asterisk, 3CX, Elastix, and FreePBX) can utilize 1-VoIP SIP Trunking to enjoy significant cost savings, which may be particularly noticeable for businesses that manage high call volumes.",
    "The fact that 1-VoIP does not charge additional fees for any of its features is likely to appeal to businesses that want a VoIP service that offers a simple pricing scheme. There are no hidden charges here, and the fact that there is no contract or cancellation fee also means that businesses don’t need to be worried about being tied down into long-term commitments that they can’t easily get out of.",
    "Particularly with the COVID-19 pandemic limiting the number of face-to-face interactions that can safely go ahead, telephone communications have become increasingly important. As a result, ensuring that your VoIP service of choice is working reliably is essential.",
    "Fortunately, 1-VoIP offers a robust customer service offering, promising 100% US-based support, and a dedicated live answer service. Promising that customer care is in its DNA, 1-VoIP offers a 24/7 support center so organizations can get assistance at any time of day should disruption strike. Given that businesses may have international clients or customers to connect with, the ability to receive customer support outside of the typical US work hours is a nice addition.",
    "Perhaps most impressive of all, 1-VoIP offers a 99.999% Network Uptime guarantee, so hopefully, customer support won’t be needed on too many occasions. This means that customers can expect less than six minutes of downtime over an entire year. Three fully redundant co-located switching facilities deliver another reliability boost.",
    "Another aspect of 1-VoIP’s service that means users probably won’t have much need for customer support is its ease of setup. Pre-configured equipment can be ordered and the accompanying brochure makes it incredibly easy to get everything up and running. As long as your phone has an RJ-11 cable, users should not have any configuration issues.",
    "The web portal that customers use to manage the VoIP service is also extremely straightforward. Once users have logged in, they can easily navigate to the My Account page to see their phone number, calling plan, and any other essential bits of information.",
    "That isn’t to say that 1-VoIP is perfect. The service doesn’t come with softphone, texting, or mobile capabilities built-in. This means that customers will need to install a supported third-party app to gain access to these features.",
    "While 1-VoIP does recommend certain providers that offer these services, of course, it can’t vouch for the customer support on offer should any of these features face disruption.",
    "Nevertheless, 1-VoIP customers are likely to enjoy an intuitive, straightforward experience when using the service. 1-VoIP’s owners have a telecom background spanning more than 40 years, so they certainly know what pleases customers and what doesn’t. Plus, should disruption occur across any of the features on offer, 24/7 customer support is on hand to offer assistance.",
    "As with all VoIP services, the utility of 1-VoIP all depends on whether it has the kinds of features that modern businesses require. Fortunately, 1-VoIP offers more than 40 different services, so it’s quite likely that the feature your organization needs is provided. As we’ve already mentioned, however, there’s no integrated video conferencing solution, which may be an issue for some.",
    "Nevertheless, there are plenty of features for users to get to grips with. There’s customizable hold music, call recording features and the option of creating a queuing system so that certain members of staff receive calls before others. In addition, users are given the option of configuring their hours of operation, so they can determine when their phones ring, forward or go to voicemail, based on the date and time.",
    "Furthermore, there’s also extension-to-extension calling. As all of your employees will have their own four-digit extension, it is easy to contact colleagues, wherever they are, as long as they are online.",
    "Similarly, digital call forwarding allows individuals to forward calls to other lines, including other extensions, cell phones, or landlines. Users can also decide whether they want alternative numbers to ring concurrently or if they’d prefer their VoIP phone to ring first before automatically transferring to other numbers.",
    "Of course, with the option of transferring calls to personal cell phones, some employees may be concerned that they will be forced to take calls that may not necessarily be relevant to them. Fortunately, there is a call parking feature that allows individuals to transfer calls to a parking lot extension.",
    "That way, anyone can dial in and take the call - and it’s easy to ensure that the call is answered by the right person. Alternatively, a call pickup group is available that lets anyone pick up any of the phones that are ringing in the office - something that is particularly helpful when a lot of colleagues are away from the desks, such as during lunchtime.",
    "Although 1-VoIP may not have access to some of the glitzier features provided by some other business VoIP solutions, it does offer customer announcements, meaning that each member of staff can create their own message to keep callers updated with pre-recorded announcements. Customizable auto-attendants can also be employed to ensure that callers are connected quickly to the department that they need.",
    "While the list of available features is unlikely to amaze phone users (or callers). they’re more than adequate for most businesses. The fact that all pricing plans come with the same repertoire of features also means that it’s easy to work out what package is required for your business needs.",
    "Even if 1-VoIP may not come with some of the more advanced features that some businesses require, the service does come with a clean, easy-to-use interface that means even inexperienced VoIP users should be able to get to grips with things quickly. Users are first confronted with their log-in page before being taken to their account details, which contain information about their username, phone number, calling plan, and customer support details.",
    "In total, the 1-VoIP interface contains six tabs to help with navigation. These are: Update E911 (a US emergency call service), My Account, Call Activity, Voicemail, Billing, and Configure Device. Together, these provide all the options a user might need to adjust their settings or look up important information related to the service.",
    "1-VoIP also makes it easy for users to explore the features it offers. Towards the left-hand side of the dashboard, a menu allows for the configuration of the features mentioned above. The entire platform comes across as a stripped-back version of the Mitel and Phone.com dashboards, so users that have experience with either of those VoIP services should feel right at home here.",
    "1-VoIP certainly values simplicity. While the shift to VoIP telephony may sound confusing when compared with traditional desk phones, 1-VoIP’s straightforward user interface shows that businesses have nothing to worry about.",
    "To improve the user-friendliness of 1-VoIP even further, the VoIP service is accompanied by several videos and walkthroughs to provide additional support for users when setting up the service. Plus, as we’ve mentioned above, an impressive customer support offering should be able to help if any problems do arise.",
    "There’s certainly a lot of competition out there in the VoIP business space but 1-VoIP certainly holds its own. The service mostly keeps things simple with a solid, if unspectacular, list of features.",
    "Larger businesses may want a more extravagant VoIP service, but local firms or those with less intensive telephone needs will surely find enough on offer here. The straightforward interface and setup are undoubtedly appealing, and the offer of 24/7 customer support is likely to prove useful at some point. Plus, the option of integrating an anti-spam feature should help businesses ensure that their staff aren’t pestered by nuisance calls."
  ],
  "headers": {
    "32": "Our overall verdict"
  },
  "links": {
    "VoIP": "https://www.techradar.com/best/best-ip-phones/best/best-voip-service",
    "1-VoIP": "https://www.1-voip.com/",
    "Nextiva": "https://www.techradar.com/reviews/nextiva-voip-services",
    "RingCentral": "https://www.techradar.com/reviews/ringcentral-office",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Nextiva vs. RingCentral VoIP comparison review": "https://www.techradar.com/news/nextiva-vs-ringcentral",
    "best VoIP phones": "https://www.techradar.com/best/best-ip-phones",
    "Nomorobo": "https://www.nomorobo.com/",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "PBX system": "https://www.techradar.com/best/pbx-phone-systems",
    "VoIP phone": "https://www.techradar.com/best/best-ip-phones",
    "Mitel": "https://www.techradar.com/reviews/mitel-micloud-business"
  }
}