{
  "source": "https://www.techradar.com/reviews/okayfreedom-vpn",
  "title": "OkayFreedom VPN review",
  "category": "computing",
  "updated": "2021-01-26T15:45:39Z",
  "author": "sead-fadilpasic",
  "summary": "The speeds are excellent, but the plans could be more varied",
  "verdict": "There's a lot to like about the OkayFreedom VPN service: it unblocks geo-restricted content, allows torrenting, its 1-year plan is among the cheapest in the business, and there’s a free tier for casual browsing. However, the lack of mobile apps and variety in its pricing options are somewhat disappointing, as is the inconsistency of its pricing across currencies.",
  "pros": [
    "Excellent speeds",
    "Free tier",
    "Inexpensive",
    "30-day money-back guarantee"
  ],
  "cons": [
    "Only a 1-year subscription",
    "No mobile apps",
    "Inconsistent pricing across currencies",
    "No customer support"
  ],
  "article": [
    "OkayFreedom is a VPN service provided by German company Steganos, well-known in the industry for its diverse selection of products, which includes a password manager, digital vault, and PC tuning software.",
    "Only one subscription option is available: a one-year, one-device license at the price of $29.95 (equating to $2.50/month), which is actually considered very cheap in the VPN industry, especially for a 1-year option. You can pay using a credit/debit card, PayPal, wire transfer or Sofort.",
    "Do note that the prices don’t seem to be properly balanced across currencies. For instance, if you change the pricing to GBP (British Pound), the number remains the same as in USD, even though £29.95 is worth much more than $29.95. The same goes for EUR; the website lists the price at €29.95. The logic behind this escapes us, so do be careful.",
    "There’s also an ad-supported free version of the service that gives you 2GB of VPN traffic per month, just enough for testing the service or some casual browsing.",
    "Additionally, the provider offers a 30-day money-back guarantee, so you’ll have plenty of time to see if it truly works for you.",
    "If you’re exclusively looking for a VPN with a free tier, Windscribe is a better option than OkayFreedom as it gives 10GB of free VPN traffic per month and sends email reminders when your traffic allowance is renewed.",
    "If you don’t mind paying for an unlimited service but still don’t want to go too crazy, we recommend Surfshark, which currently offers a 2-year subscription at the price of $2.21/month.",
    "NordVPN is more expensive but more advanced as well, while ExpressVPN is the best of the best if your budget allows.",
    "OkayFreedom is a VPN service capable of providing its customers with access to today’s popular VOD platforms, such as BBC iPlayer and Netflix, which aren't available in all parts of the world. Its excellent download speeds will facilitate bufferless access to this video content.",
    "This VPN service is offered by Steganos Software GmbH, headquartered in Berlin, Germany. The company offers access to its servers located in 19 countries: Australia, Austria, Brazil, Canada, France, Germany, Great Britain, Italy, Japan, Netherlands, Poland, Romania, Russia, Singapore, Spain, Sweden, Switzerland, Turkey, and the USA.",
    "OkayFreedom uses the highly secure AES 256-bit encryption algorithm to keep your true identity hidden and your data safe from snoopers, even in public hotspots, and regardless of what you’re doing, be it torrenting or just some light browsing.",
    "Even though its app is very minimalistic, it does have several handy options, among which the most relevant in terms of privacy is the “AlwaysProtected” mode, which ensures that “the unsecured connection will not be automatically restored if a VPN connection fails” - so basically a kill switch.",
    "Its Privacy Policy is adamant about no logging, stating that the service doesn’t save “addresses nor content accessed by the user, the IP address that OkayFreedom assigned to them; nor the user’s own IP address through which they are using OkayFreedom.” Sounds good, but it would’ve been even better if the claims had been verified by an independent auditor.",
    "Once you download and start installing OkayFreedom on your PC, you’ll also be able to choose which browser(s) you want it installed on - Chrome, Firefox, or Internet Explorer.",
    "The Chrome extension has been installed by over 30,000 users so far and has an average rating of 3.6 stars (out of 5), as decided by the votes of 57 users. It was last updated on December 4, 2018.",
    "Should you require assistance or just some general info, you’ll be able to locate it in the Support & FAQ section provided by the VPN’s owner company, Steganos. Here, you’ll find some information about installing and using the service, but it can hardly be called plentiful.",
    "If you need to get in touch with customer support directly, you can try sending an email, which we tried, but our message just bounced for some reason.",
    "OkayFreedom is minimalistic, exceptionally easy to use, and available in three languages - English, German, and Japanese. The installation process went smoothly and we connected in a matter of seconds.",
    "We first tested a server in Romania and it gave us a download speed of 22.75Mbps, which is very good considering our testing connection measured 45.65Mbps. We then wanted to see how Great Britain would fare and it did well again: 20.70Mbps.",
    "Then it was time to move to a different continent; a server in the US held on nicely, delivering 13.85Mbps.",
    "We usually like to go to a more exotic location as well, which is why we rounded out our tests with a server in India. We got a very good 10.68Mbps and were quite impressed, honestly, as it’s rare for a VPN to deliver such a good download speed for a location so far away from our own.",
    "OkayFreedom is fast and inexpensive, but more work is needed if it aims to compete with the industry’s super-performers, primarily in terms of mobile apps, subscription lengths, currency balancing and customer support."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "10": "Privacy and encryption",
    "13": "Support",
    "17": "Speed and experience",
    "21": "Verdict"
  },
  "links": {
    "OkayFreedom": "https://www.okayfreedom.com/en/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Windscribe": "https://www.techradar.com/reviews/windscribe",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Privacy Policy": "https://www.okayfreedom.com/en/privacy",
    "Chrome extension": "https://chrome.google.com/webstore/detail/okayfreedom/hfnbbbkabnehoejfhcbbhdicagcoobji",
    "Support & FAQ": "https://steganos.zendesk.com/hc/en-us",
    "email": "mailto:support@okayfreedom.com"
  }
}