{
  "source": "https://www.techradar.com/reviews/mddhosting",
  "title": "MDDHosting review",
  "category": "computing",
  "updated": "2021-02-28T20:30:36Z",
  "author": "mirza-bahic",
  "summary": "Cloud-based host from the USA with a few unique selling points",
  "verdict": "MDDHosting is a relatively new web hosting provider from the US with a cloud-based VPS as its forte and “state-of-art” server solutions with which performance should become the last of your worries.",
  "pros": [
    "30-day money-back guarantee",
    "Budget-friendly cloud hosting",
    "Blazing fast speed",
    "Free SSL certificate for life",
    "Free daily backups with all plans",
    "Price upon the renewal is rather reasonable"
  ],
  "cons": [
    "Extra services will cost you extra cash",
    "Not many support channels",
    "No free domain registration"
  ],
  "article": [
    "In comparison with veterans of the web hosting industry, MDDHosting is practically a newcomer in the business. The company was launched in 2007 and is headquartered in Mooresville, Indiana with a mission to provide an alternative to hosting services they saw as overpriced and therefore out of reach for many potential customers.",
    "To add a note of sentimentality, they insist that they do not see their clients as a number or a dollar sign, and will provide the highest quality service and support to each and every individual. A noble goal, but how much of it they have managed to fulfill needs to be checked.",
    "Today they take pride in being a home of more than a few thousand websites over the world which they host from their network data centers situated in Denver, Colorado. On this subject, as many others, MDDHosting has been rather open, providing a substantial amount of information on its main website. The website itself looks rather blue-ish, feels fresh and is simple to use, which is always an encouraging sign.",
    "As is usually the case with younger hosts, the website features an official blog which contains latest news about the company, announcements and special offers. However, you won't find extensive textual content such as introductions, product analysis, guides, and stories related to hosting, nor anything of that sort.",
    "Although present on several social network platforms, MDDHosting doesn’t seem particularly active, which is probably the primary reason why these accounts aren’t more prominently featured on its website, we reckon.",
    "Since MDDHosting’s main focus is on cloud hosting and cloud-based VPS, those who are looking for more traditional options may find their skepticism about this provider justified. Beside these two options (each of them provides a few plans differing in sizes and purposes), MDDHosting presents three reseller hosting solutions.",
    "Regardless of the type of hosting, all plans share a few rather appealing features, including website security extension with an SSL certificate, StorPool-powered storage and daily offsite backups. The most economical plan among these is tagged as “CloudStarter” and it will cost you $4.00 per month (sounds pretty cheap?), but only if you commit for three years (yes, it was too good to be true). Otherwise, its price ranges from $4.50 to $5.99, depending on the billing cycle, which is (to be fair) rather affordable for a cloud hosting service that will get you unlimited domain names and unmetered bandwidth, as well as features we already mentioned.",
    "If you go with MDDHosting and change your mind along the way, there is an “unconditional” 30-day money-back guarantee, under the condition that you are a first-time user, and it applies to all MDDHosting’s plans.",
    "As for the methods of payment, they are glad to accept all major credit cards and PayPal.",
    "Deciding on a plan with MDDHosting feels like a child's play, since all options are properly presented in a way that is easy to comprehend and make a comparison. All cloud hosting plans apart from “CloudStarter” include unlimited SSD storage and a promise of blazing speed, therefore, if saving some bucks is not an imperative for you, go for a bigger plan.",
    "“CloudStarter” is best fit for personal blogs or simple websites with low traffic and just a few plugins, but if your site begins to grow (or you simply change your mind), you can upgrade your package to “Cloud1” in no time and at any time.",
    "Unfortunately for the newcomers, MDDHosting isn’t generous to a fault when it comes to domain names, since anyone who doesn’t already own one, will have to purchase it. Otherwise, you can transfer it or use it without the need to trade your current manager with a new one.",
    "After this, you’ll proceed to your chart where you’ll be able to check everything in detail and decide if you want a few add-ons, some of which are free of charge. Here is where you decide if you want access to SSH/sFTP or not, which doesn’t affect the overall cost.",
    "The billing cycle is pleasantly pliant and covers every expected period from one month to three years. One the next page you’ll be offered to add even more add-ons (some free, some affordable) and after this (guess what?) even more add-ons. To tell the truth, all of them are good to have (CodeGuard’s daily website backups, SiteLock, spam filter and so on) and are fairly priced. To complete the order, you’ll have to create an account with MDDHosting by providing them with a number of personal information you ought to be used to by now if you dealt with similar hosts in the past.",
    "After the checkout, you can move to your control board without a hitch where you can manage and maintain the details about your package and account, which you can upgrade or downgrade with a few clicks. From here you are able to log in to industry-standard cPanel with which you should be able to control (with a bit of practice, if you are a newbie) all aspects of your new website with ease. Because of free access to Softaculous, hundreds of advantageous apps can be yours in an instant. In addition, and as an alternative, there is a drag-and-drop website builder with more than fifty themes and just as many widgets.",
    "Although MDDHosting doesn’t make a lot of promises on its speed performance, the specifications about their data centers (LiteSpeed servers for the win!) they chose to highlight hint at the answer.",
    "In search for more empirical evidence, we tested the speed of MDDHosting’s main website with the help of a much appreciated tool going under the name of GTmetrix. The results were picture-perfect, which actually came as no surprise. The time it took for the page to completely load and for the largest element of it to become visible, with the total blocking time and other metrics showed not only above-average, but virtually perfect results. Conclusively, GTmetrix rated MDDHosting’s main site with a well-deserved A (100%).",
    "MDDHosting puts a brave front by offering a 1000% uptime guarantee which is backed up by SLA (Service Level Agreement). This implies that a user is entitled to a credit worth ten times the amount of actual downtime your website has suffered. We must say, this will certainly ease the trauma of being disconnected from the rest of the world.",
    "Anyway, after monitoring the uptime of MDDHosting’s main website throughout the month, UptimeRobot made us sigh with relief. During the recorded time, the total amount of downtime was 43 minutes, which means the website was up 99.991% of the time (a welcome news indeed).",
    "All fellow introverts out there will be pleased to hear that MDDHosting has provided us with all essential self-help options. The Network Status page makes the information about the servers available as well their overview in real time. Knowledgebase uses a familiar well-structured layout and is chock-full of articles on various interrelated subject matter. The articles themselves are inconsistent in length (some are text-heavy and stuffed with pictures while others are made up of a single sentence), but generally go directly to the point and provide a satisfactory solution to the issue.",
    "Finally, there is a community forum as well, but as of recently it has been filled with announcements related to server status and a few customer reviews. One of them caught our eyes with a witty (yet pretty accurate) description of MDDHosting’s support team portraying them as “support ninjas” that are always “quick, kind, and knowledgeable”.",
    "These “support ninjas” can be reached via ticket or e-mail, but you don’t try hiring them to do the dirty job for you, if it isn’t related to hosting, that is. Those who have questions regarding the sales and billing can contact them via telephone from 8AM to 4PM (EST) during the business days.",
    "Children of the 2000s, both MDDHosting and Hostinger today are success stories in the landscape of web hosting. There are certain similarities between the solutions they provide, although Hostinger includes e-mail hosting, WordPress-optimized packages as well as Minecraft servers for all the fans. In addition, its solutions come with a whole collection of options for a control panel and are on the cheaper side.This being said, the performance of MDDHosting’s servers (in terms of speed and uptime) is hard to beat, even by Hostinger.",
    "MochaHost and MDDHosting have data centers in the US, but while MochaHost deploys a couple of them, MDDHosting has only one. Both of them are more than recommendable hosts, although MDDHosting lacks a dedicated hosting option, which is a must for fast-growing businesses.",
    "Bluehost is one of MDDHosting’s greatest competitors and rightly so. While MochaHost can brag about its “perfect” performance and “insane” SLA-backed uptime guarantee of 1000%, Bluehost is a more beginner-friendly option with cheaper entry-level plans, free domain registration, necessary one-click installs and more support channels.",
    "As US-based providers, both HostGator and MDDHosting are the most convenient solution to the customers from the US. While both represent a good value for money, HostGator may be a better choice for newcomers, while MDDHosting's extensive list of features may attract web developers. And since both provide a money-back guarantee, you are free to change your mind without compromising your budget.",
    "MDDHosting’s hosting solutions are fast, feature-packed and reliable products that are (although not the most affordable product on the market) unlikely to force you to break the bank. The whole process of picking a plan, creating your account and launching your website is surprisingly and enjoyably straightforward and you can update your plan at any moment, as smoothly as possible.",
    "However, when it comes to being beginner-friendly, MDDHosting has its fair share of strengths and weaknesses. The most notable one is the absence of live chat as a support option, which is a shame since it is one of the most popular channels for the customers to reach out for help. Therefore, if you are new to all this, explore some of its alternatives (such as HostGator, Bluehost or WebHostingBuzz) before trying out MDDHosting."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "15": "Speed and experience",
    "19": "Support",
    "22": "The competition",
    "26": "Final verdict"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "MDDHosting": "https://www.mddhosting.com/",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "reseller hosting": "https://www.techradar.com/web-hosting/best-reseller-hosting",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Hostinger": "https://www.techradar.com/reviews/hostinger",
    "MochaHost": "https://www.techradar.com/reviews/mochahost",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "WebHostingBuzz": "https://www.techradar.com/reviews/webhostingbuzz"
  }
}