{
  "source": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
  "title": "Lypertek PurePlay Z3 (Tevi) review",
  "category": "audio-visual",
  "updated": "2021-06-28T11:50:59Z",
  "author": "gerald-lynch",
  "summary": "It’s hard to find fault with these incredible, affordable earbuds",
  "verdict": "Huge battery life, great sound, USB-C charging, and IPX7 waterproofing at a bargain basement price? The Lypertek PurePlay Z3 true wireless earbuds are almost too good to be true.",
  "pros": [
    "Incredible value",
    "Neutral audiophile-like sound",
    "Great battery life"
  ],
  "cons": [
    "Design is a bit plain"
  ],
  "article": [
    "Just when you think you’ve seen all that the true wireless earbud market can offer, along comes a little gem. You may not have heard of up-and-coming audio brand Lypertek yet, but expect to hear a lot from it soon – its Lypertek PurePlay Z3 (previously known as the Lypertek Tevi) true wireless earbuds are among the best we’ve tried, especially given the low price tag.",
    "With USB-C charging, a well-balanced sound, lengthy battery life, and waterproofing, it ticks every box you could ask for, from what are basically a pair of budget buds. The Lypertek PurePlay Z3, surprisingly, might just blow you away.",
    "[Update: Lypertek has announced the follow-up to its fantastic true wireless earbuds – and in spite of a host of improvements, they won't cost you any more than their predecessors.",
    "The Lypertek PurePlay Z3 2.0 come with the latest Qualcomm QC3040 chipset, which allows for Bluetooth 5.2 connectivity, better quality connections, and aptX and AAC codecs.]",
    "The Lypertek PurePlay Z3 true wireless earbuds are on sale now, an absolute steal at £99 (about $130 / AU$185).",
    "While it’s not quite a pocket-money purchase at that price, it’s very much a bargain given the quality of what’s on offer, and still very much in the realms of what we’d consider a budget price. You’ll be hard pressed to find a better sounding pair of earbuds for the money, and with a similar feature set.",
    "For comparison, the Apple AirPods (2019), cost $159 / £159 / AU$249, and are still the most popular true wireless earbuds out there – even if that title is likely to quickly fall to the Apple AirPods Pro, regardless of Apple’s lack of audiophile credentials. Read our round up of the best true wireless earbuds to see how the rest of the competition compare, but note that the PurePlay Z3 hold their own with practically all the competition on that list.",
    "The Lypertek PurePlay Z3 don’t break the mould when it comes to function and design of a pair of true wireless earbuds. Left and right buds are placed in a pill-shaped charging case, slotting into place magnetically. The case itself has a battery in it, and placing the buds inside will recharge them, provided the case itself has been topped up with power.",
    "Pairing the Lypertek PurePlay Z3 is slightly different to some other true wireless buds we’ve used. Making use of Qualcomm’s TrueWireless Plus tech, you first pair the right earpiece (over Bluetooth 5.0), before being prompted to pair the left earpiece separately.",
    "After this point they work like any other pair of true wireless earbuds – remove them from their case and they’ll automatically re-pair with your source device of choice, pop them in the case and they’ll switch off and begin charging. But it does also open up the possibility for using them as a single mono earpiece independent of each other, thanks to their discrete connection to the source – handy if, for instance you just want to use them as a Bluetooth headset for calls.",
    "So far, it’s pretty much standard fare. But the first point to make the Lypertek PurePlay Z3 stand out from the crowd is their claimed 70 hour battery life. That’s 10 hours in the buds, and a further six full charges housed in the case. That’s a remarkable amount of juice packed in here, and while your mileage will vary depending on the volume you play your tunes at, most rival true wireless buds would be in a respectable position if they offered half as much.",
    "You’d think that would lead to cumbersome, bulky buds and a giant charging case, but that’s not true of the Lypertek PurePlay Z3. While it’s not tiny at a rough 8cm x 3cm x 4cm, its case is perfectly pocketable, and even includes USB-C charging, which is superior to the cheaper microUSB, thanks to its reversible nature and fast-charging characteristics. Likewise, the buds themselves (which eschew the stem-like prongs of the AirPods for a bud-only aesthetic) are relatively small, protruding out of your ear just a small amount.",
    "Some fatigue is inevitable over longer listening sessions, but the buds are lightweight enough that it’s hours before any real discomfort kicks in. Plus, you get four eartip styles to pick from – small, medium and large in silicone, and a one-size-fits-all set of ‘Flexfit’ foam tips, akin to the material you find with disposable earplugs. As such it’s easier to find a comfortable fit – our money is on the foam tips, which offered the best isolation from external noise.",
    "The buds themselves also house physical buttons, controlling everything from playback to volume, to call-answering and summoning your voice assistant of choice. While it can be a bit uncomfortable to press on things literally stuck in your ears, they’re far more reliable than touch sensitive controls. Note also that the volume controls on the earbuds are independent of your source device – while initially confusing, it actually proved beneficial, giving you more granular control of volume levels, and allowing the Lypertek PurePlay Z3 to hit very high volume levels if you desire.",
    "What the Lypertek PurePlay Z3 doesn’t have is a flashy design. The fabric-covered case is grey and nondescript (apart from an optional cord attached to one end, presumably for hanging off a keychain or similar), and the buds are likewise functional, with a small silver ring surrounding the button area where the subtle Lypertek logo lives. But we’d rather a pair that fade into the background than call attention to themselves anyway, and the fabric-covered case actually makes it easier to find when hidden at the bottom of your bag.",
    "And though the Lypertek PurePlay Z3 don’t offer wireless charging or noise-cancelling, we wouldn’t expect them to at this price, making the fact that they do offer IPX7 waterproofing – enough to see them survive a shower without fuss – is the cherry on a bargain-offering design.",
    "For a long time we became used to making concessions for the audio quality of true-wireless buds – a nascent technology, the form factor was convenient enough to overlook any failings in audio. But that’s not an excuse anymore, thanks to fantastic audio from the likes of the Sony WF-1000XM3 and Cambridge Audio Melomania 1.",
    "That a £99 / $130 set of buds can challenge this storied competition is a fantastic and welcome shock. The Lypertek PurePlay Z3's 6mm graphene drivers, with the buds supporting SBC, AAC and aptX codecs, offer some of the most natural and well-balanced audio we’ve enjoyed from a pair of earphones all year.",
    "Where the Lypertek PurePlay Z3 excel is in their near-neutral sound. It’s what audiophiles crave – the ability to hear songs and soundtracks as their creators intended, without tuning that exaggerates elements of a mix unnecessarily. As a result, bass lovers may want to look elsewhere, as the low end does not overpower the soundstage here, but for everyone else it’s a very true representation of the tunes its presenting.",
    "The Lypertek PurePlay Z3 are wonderfully detailed. Listening to an all-time favourite, Bjork’s Hyperballad, a wonderful mesh of sub-bass, sparkling samples, strings, beats and synths, and the whole song is opened up. The decay of the processed drum, the swell of a synth stab, the dance of an arpeggiated computeristic lead line between the ears – the PurePlay Z3 know exactly how to handle them and where to place them.",
    "Jump to something a little more delicate and it is just as adept. The opening bars of Phoebe Bridgers’ ‘Motion Sickness’, with its rumbling sustained guitar chord and rhythmic palm-muted lead notes being distinct and wide. A little more depth to the soundstage could be found, but that’s a minor concern, with Bridgers’ velvety vocals sitting comfortably in front.",
    "Onto Daniel Avery’s electronic ‘Naive Response’ and the range of the PurePlay Z3 is revealed. Snapping into step with every digital hand clap and synth arpeggio, it reveals just how tight the bass can be when pushed by something a little more mechanical.",
    "There’s a little bit of unwanted hiss at extreme volume levels, but it’s truly hard to find fault with the presentation otherwise. It’s exceptional, and outrageous given the price.",
    "It’s not often we get caught off guard with a newcomer brand taking it to the big boys, but Lypertek’s PurePlay Z3 earbuds are a fantastic entrant in the true wireless wars.",
    "Affordable without being cheap in their presentation, feature-filled without bloating, and considered in their sounds, the Lypertek PurePlay Z3 punch well above their weight, and their price tag. Even if you’ve enough cash for far more expensive buds, the PurePlay Z3 will likely be well worth the saving, provided you don’t need noise cancelling tech. They’re superb."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design",
    "16": "Sound",
    "23": "Verdict"
  },
  "links": {
    "true wireless": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Lypertek has announced the follow-up to its fantastic true wireless earbuds": "https://www.techradar.com/news/lypertek-pureplay-z3-20-improve-on-top-wireless-earbuds-without-a-price-hike",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods (2019)": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Cambridge Audio Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1"
  }
}