{
  "source": "https://www.techradar.com/reviews/hivelocity",
  "title": "Hivelocity review",
  "category": "computing",
  "updated": "2021-07-26T05:31:05Z",
  "author": "mirza-bahic",
  "summary": "Premium provider with a world-class network and a praiseworthy technical team",
  "verdict": "Hivelocity is a US-based, high-tech, enterprise-level web hosting provider aimed at big businesses that require first-class performance, perfect uptime and the highest level of support one can get. However, to get all of this you’ll have to pay top dollar, since Hivelocity couldn't care less about your budget.",
  "pros": [
    "Almost instant server deployment",
    "Worldwide network of colocation data centers",
    "High level of flexibility with the ability to scale",
    "Superb on-site support staff available 24/7",
    "Unparalleled uptime backed by 99.99% SLA guarantee"
  ],
  "cons": [
    "Not suitable for small businesses",
    "Pretty expensive"
  ],
  "article": [
    "Set up in the sunny state of Florida, Hivelocity has been collecting valuable industry experience since 2001. Headquartered in Tampa (the USA), together with its first data center, the company today provides cloud hosting solutions, dedicated servers and colocation services to thousands of companies in more than 130 countries all over the world. They claim that the philosophy of their company hasn’t changed since the early days in line with their “the more successful our customers are the more successful we will be” motto.",
    "At this moment, Hivelocity employs around 70 staff members and operates eight world-class data centers covering Los Angeles, New York, Dallas, Atlanta, Tampa and Chicago (the USA), Amsterdam (the Netherlands) and Frankfurt (Germany). Each of these data centers is SSAE-16 SOC1 and SOC2 certified, with HIPAA and PCI compliant services available as well. Hivelocity’s team is led by Mike Architetto (CEO), Ben Linton (CTO) and Steve Eschweiler (DOP and one of the company’s creators).",
    "Although Hivelocity has been around for two decades now, its official site looks and feels refreshingly modern, while providing all the information you need to get down to business. The same goes for their official blog, which makes for both an informative and interesting read.",
    "In case you use social media sites, you can find Hivelocity on Facebook, Twitter, Instagram, LinkedIn and YouTube, although the latter’s account hasn’t been updated in years.",
    "We should also note a massive amount of positive reviews from Hivelocity’s past and present customers on consumer review sites such as Trustpilot and HostAdvice, which is always welcome news.",
    "At this time, Hivelocity maintains and manages more than 15,000 physical and virtual servers and provides managed solutions on dedicated, cloud and virtual private servers (VPS) as well as colocation services.",
    "Even at first sight it’s apparent that Hivelocity’s hosting solutions are aimed at well-to-do customers looking for powerful high-tech solutions they can tailor to their own needs. Pricing for “instant” bare metal servers ranges between $94.00 and $155.00 per month, but including add-ons in the mix can spike up the price fairly quickly. The same goes for their dedicated server solution which can cost you anything between $135.00 and $451.00 per month, both pre-build and customized ones. However, Hivelocity frequently offers packages at a discount of around 20-25% off its original price, so be sure to check it out.",
    "Like many premium providers, Hivelocity offers no money-back guarantee nor do they provide refunds in general.",
    "They accept payments via credit cards (Visa, MasterCard and American Express), PayPal, checks, Wire Transfer, ACH, and Bitcoin.",
    "To get the ball rolling, the first thing you want to do is create an account with Hivelocity, and it will be up and running in a matter of minutes. You’ll only have to provide your e-mail address, produce a password and run through the terms of service, where you’ll find everything (although a lengthy read) explained in pretty straightforward manner without small print or similar annoyances.",
    "After this, you’ll proceed to myVelocity, which is Hivelocity’s own control panel. It looks rather simplistic, but in a good way. It makes deploying, monitoring and managing your devices, billing information, DNS, networking, storage, and all the essentials pretty easy. While deploying your first server, keep in mind that Hivelocity’s technical team is available 24/7 to extend a helping hand, so don’t hesitate to ask for help at the first sign of trouble.",
    "Here, you’ll have an opportunity to decide on a server location and if the one you want is out of stock (and you are not in any hurry) get in touch with Hivelocity’s team and see if they can get back to you when the server is available again. If it’s available for the taking, make sure to select a location, a server (all specifications are listed together with the price), an operating system (a few versions of Ubuntu, CentOs and Windows are available and more), followed by entering a hostname and choosing a payment method.",
    "As for optional settings, later on you’ll be able to add user data, customize SSH key access, and choose a control panel and a type of license you want. A full list of control panels is at your disposal, including cPanel, DirectAdmin, Parallels Virtuozzo, SolusVM, ProxMox, Webmin, Plesk and WebsitePanel. Therefore, with what ease you’ll manage all aspects of your website(s) is directly proportional to your experience with the chosen control panel. All servers include 10GB of cloud storage which is free-of-charge, but you are free to upgrade it at any time (for an extra price).",
    "All in all, our experience with Hivelocity as a whole was more easy-going than we expected in our wildest dreams, both in terms of user-friendliness of their website, the UI and the support we have received along the way.",
    "Hivelocity offers an uptime guarantee for 99.99% of the time, which means all users are eligible to receive a 5% credit (upon request) if they experience anything less than promised. However, scheduled maintenance is excluded from this. Keeping this in mind, we monitored uptime of Hivelocity’s main website (via UptimeRobot) for a period of one month and were delighted to see a report displaying a spotless 100% of uptime.",
    "When it comes to speed, we called upon the services of good old GTmetrix to check out how fast Hivelocity's main site is. After multiple tests carried out from multiple server locations we were hit with pretty much the same level of poor performance in terms of speed, while the site’s structure received a round of applause. The time the site required to fully load was 4.6 seconds, which outshines the average result of 8.1. However, total blocking time and time it took for the largest content element to become visible have exceeded the recommended so much that GTmetrix decided to punish the site with an E (41%), leaving us lost for words.",
    "Although some things have changed with Hivelocity through the years, their customer support seems to have stayed exactly the same, showing competence, courtesy and (above everything else) commitment. This all-star technical team is available round-the-clock and can be reached via toll-free telephone number, live chat (that functions more as a support ticket) and e-mail. According to Hivelocity, their average response time for chat should never take longer than 15 minutes, which corresponds with our own experience. For all remaining inquiries, you can get in touch with the sales or billing departments Monday to Friday from 9AM to 5PM.",
    "For those of us who want to remain as self-sufficient as we can, the best bet is Hivelocity’s knowledgebase. It uses the same user-friendly page layout as their blog, making the search simple and satisfactory. Since the knowledgebase consists of a whopping 1388 articles covering all important issues, there wasn’t enough time to inspect each and every one of them. Nevertheless, the ones we took a closer look at were easy to follow and truly useful.",
    "In terms of services, Hivelocity and Liquid Web seem somewhat similar, however, when we speak about pricing, they couldn’t be more different. While Liquid Web is aimed at large and small businesses alike, Hivelocity is more focused on providing plans for medium-sized to enterprise-level businesses that need high performance servers with 100% uptime and first-class support. As a result, Liquid Web’s hosting packages are much more affordable and include all beginner-friendly features one would expect from such a provider.",
    "OVHcloud is another provider of cloud-focused hosting solutions that gets compared a lot with Hivelocity, although they aren’t as similar as they seem to be. For instance, OVHcloud’s packages are notably less expensive, but will force you to make a compromise in terms of performance and customer support (which has at times been described as “absolutely abysmal”).",
    "Those who are looking for a novice-friendly host to launch their blog, little webstore or a small business are likely to find Hivelocity’s packages a bit of an overkill. In that case be sure to check out some of the more versatile hosts like HostGator and Bluehost, and since both provide a money-back guarantee, you can do it without worries.",
    "Hivelocity is far too expensive for someone with simpler needs and no shiny infrastructure, special features and superior support is going to make up for that. However, if you own a business which is demanding enough to require a dedicated server and don’t mind paying good money for it, you can't go wrong with Hivelocity.",
    "However, if you have a budget to keep an eye on, take a look at hosts such as HostGator, GoDaddy and Bluehost. They will supply you with everything necessary to get off to a good start and all without burning too large a hole in your pocket."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "14": "Speed and experience",
    "16": "Support",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "Hivelocity": "https://www.hivelocity.net/",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "colocation services": "https://www.techradar.com/news/best-colocation-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "cPanel": "https://www.techradar.com/news/what-is-cpanel",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Liquid Web": "https://www.techradar.com/reviews/liquid-web",
    "OVHcloud": "https://www.techradar.com/reviews/ovh",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy"
  }
}