{
  "source": "https://www.techradar.com/reviews/nokia-x20",
  "title": "Hands on: Nokia X20 review",
  "category": "phones",
  "updated": "2021-04-09T14:04:47Z",
  "author": "tom-bedford",
  "summary": "Nokia’s new champ",
  "verdict": "The Nokia X20 should be great if you like years of Android updates, but other than its three-year update pledge there’s nothing it does better than any of its same-price rivals in the processing, camera or charging departments.",
  "pros": [
    "Years of promised updates",
    "Big screen"
  ],
  "cons": [
    "Slow to use",
    "Beaten by rivals"
  ],
  "article": [
    "One of the most fiercely contested market segments is the ‘premium-low-end’ one, of budget phones with competitive specs that are priced on the border of the low-end and mid-range tiers. Recent entries include the Moto G9 Plus, Xiaomi Redmi Note 10 Pro and Realme 8 Pro, all with impressive specs and features.",
    "The Nokia X20 is a new phone which fits right into this segment, as the top-end model of the six new handsets Nokia owners HMD Global unveiled in April 2021. The X line is to be Nokia’s new top-end one, sitting above its C- and G- ranges, and the X20 is, at the time of writing, the top model. It’s not clear what’s happening with the Nokia 8.3 5G in this new system, though.",
    "It doesn’t look like HMD Global was aware of how competitive this market segment was though, and the Nokia X20 flags in a few key areas compared to those aforementioned devices - its chipset is quite a bit weaker, its charging is slower, and the design feels a little more ‘budget’, compared to the aforementioned rivals.",
    "Still, there are some things going for the phone - HMD Global promises the Nokia X20 will get three years of Android updates, which is much more than we can say for many other Android phones, and its screen is nice and big too.",
    "We’ve briefly tested the Nokia X20, in time for its launch - we should point out we were provided an early unit with non-final software, so we’ll avoid touching on that subject as much as possible, and you should take this early review with a pinch of salt.",
    "The Nokia X20 goes on sale in May 2021, at least in the UK, though we know the phone will be available in the US at some point too.",
    "In the UK, the phone costs £300 for 6GB of RAM and 128GB of storage, which converts to about $410, AU$540. There’s also a £320 model which bumps that RAM up to 8GB, a price which converts to roughly $440, AU$580.",
    "For some context, we’ll provide the prices of those other phones we mentioned as close competitors: the Realme 8 Pro costs £279 (roughly $390, AU$500) while the Moto G9 Plus costs £250 (around $325 or AU$460), and the Redmi Note 10 Pro is $279 (around £200 / AU$360). Those are the RRP prices, at least.",
    "The Nokia X20 feels pretty big, mainly because of its large screen. It has a plastic body, and we tried out a version with a bronze hue. The rear has a circular camera bump, which has become a staple for Nokia phones, with the Zeiss logo in the middle.",
    "There’s a side-mounted fingerprint scanner embedded in the power button on the right edge, with the volume rocker just above it. The scanner is a little high, but depending on your hand size you might reach it fine. The phone also has a USB-C port and 3.5mm headphone jack, and on the left edge there’s a Google Assistant button.",
    "We don’t know an IP rating just yet, but will update this article when we hear one.",
    "If you’re looking for a big-screen phone this could be a good choice - it’s 6.67 inches across, broken up by a punch-hole cut-out for the front-facing camera, and surrounded by a relatively thick bezel.",
    "The resolution is 1080 x 2400, with a 60Hz refresh rate - if you like high-refresh-rate devices, which you can easily find at this price, the X20 isn’t one for you. We found the LCD screen looked pretty good for its price, as images were relatively sharp, though the max brightness was a little low at 450 nits.",
    "There are four rear cameras on the Nokia X20, which is a large number but not an unusual one. They are: a 64MP main, 5MP ultra-wide, 2MP depth-sensing and 2MP macro snapper. There’s also a 32MP front camera. If you know your phones, you’ll know this combo is pretty similar to the Moto G9 Plus, but with a lower-res ultra-wide and higher-res selfie camera.",
    "Photos we took were… okay, but a few issues we’ve found with previous Nokia phones are back. Images look a little over-sharp, and the dynamic range leaves a lot to be desired too. This latter problem was doubly the case on the ultra-wide camera.",
    "Selfies looked a bit better, but the same issues still linger. The Portrait mode was a bit prone to blurring our hair, as well as the background, but maybe that’s our fault for our particular ‘do’.",
    "It's worth pointing out software can be quite influential on how phone photos look, and as we said we used an early unit of the phone, so perhaps some of our issues will be ironed out for the final model.",
    "Video recording goes up to 1080p at 60fps. There’s a Cinema mode, meant to imitate the Pro videography modes some other smartphones have, but with a max resolution of 1080p we don’t envision many people using it professionally.",
    "The battery here has a 4,470mAh capacity, which is a fair size for a phone at this price point, and from our initial testing, it feels big enough to easily see the phone through a day of use.",
    "Charging is far less impressive though, at a measly 18W, which guarantees a several-hour charge time. That’s slow even for a phone at this price, where at least 30W is the norm and some phones go up to 50W or even 65W.",
    "Something different here, though, is that the Nokia X20 doesn't come with a charging cable or block in the box - you’ll have to provide your own. Clearly HMD Global is following in Apple and Samsung’s footsteps, in an act to cut down on e-waste, though the company’s quest for environmental conscientiousness would seem more genuine if the Nokia X20’s five contemporary siblings followed suit.",
    "As such, you’ll have to use your own USB-C charger to power up the phone, and buy one if you don’t already own one, though given the vast majority of gadgets already use USB-C, we imagine few people don’t own such a cable.",
    "Now for the big issue with the Nokia X20: it’s far weaker than its rivals. It uses the low-end Snapdragon 480 chipset, while the three phones we listed earlier all use Snapdragon 700-series processors (for context Qualcomm has five lines of Snapdragon chipset, from the super low-end and hardly used 200-series, up to the low-end 400-series, then the 600, the 700, then 800, with each line getting more powerful).",
    "The phone feels fairly slow to use, and when put through the Geekbench 4 benchmark test, it returned a fairly low score of 1,529, where we’d expect a phone at this price to be closer to 1,700.",
    "So this isn’t quite a phone for mobile gamers, or people who’ll need lots of power for anything. But it’s not ideal for other users either, as scrolling through menus feels just a bit slower than on many other phones, thanks to irregular stutters and freezes.",
    "As with the camera performance, though, the low score could be a result of our early production unit, and perhaps software optimizations could bump that 1,529 a little higher. Stay tuned for our full review to see.",
    "One potential redeeming feature is that the phone supports 5G, so if you need next-gen connectivity it’s a low-cost option.",
    "As we’ve said, we tested the phone on non-final software (which may also explain the stutters), but we can cover the basics: the phone runs on Android 11, and it’s ‘stock’ Android as Google designed it, without an interface laid over the top. Expect basically the same experience as on Pixel phones.",
    "One real benefit to getting the Nokia X20, is that it’s guaranteed to receive three years of software updates, so you’ll definitely be able to run Android 14 on it - this comes from HMD Global itself, as a pledge to support its older devices for longer.",
    "The Nokia X20 would be a fine phone for its price, if it wasn’t for how competitive the premium-mid-range market segment has become - as it stands, the phone doesn’t have the features or specs to really compete with its rivals.",
    "If the phone was £100 (or equivalent) cheaper than it is, it’d be really easy to recommend. But it isn’t. Of course, our impressions are based on an early model of the phone which could have its rough edges sanded down for the final release, and our full review will clear this all up.",
    "If you really care about getting the newest version of Android as soon as possible, you might be able to ignore that verdict - HMD Global’s three-year promise is really great, as you’ll be receiving software updates far longer than most other phones.",
    "If that’s you, it might be waiting for the Nokia X20 to hit the sales, though, so it hits that value-for-money proposition a little more."
  ],
  "headers": {
    "5": "Nokia X20 price and availability",
    "8": "Design and display",
    "13": "Cameras and battery life",
    "22": "Performance and software",
    "29": "Early verdict"
  },
  "links": {
    "Moto G9 Plus": "https://www.techradar.com/reviews/moto-g9-plus-review",
    "Xiaomi Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "Realme 8 Pro": "https://www.techradar.com/reviews/realme-8-pro"
  }
}