{
  "source": "https://www.techradar.com/reviews/zte-axon-30",
  "title": "ZTE Axon 30 review",
  "category": "phones",
  "updated": "2021-11-15T13:51:06Z",
  "author": "david-lumb",
  "summary": "A phone with a massive screen... and no notch",
  "verdict": "The ZTE Axon 30 is a great value for its price, and while all attention is on its under-display camera that disappears from the screen when the camera isn't in use, it's a great phone even without thanks to good specs and a great display. While the body and design aren't too premium, it's a good competitor for phones at its price range.",
  "pros": [
    "Great under-display camera",
    "Fantastic big display",
    "Good specs"
  ],
  "cons": [
    "Plastic back",
    "No telephoto lens",
    "No wireless battery charging"
  ],
  "article": [
    "The Axon 30 is ZTE’s next flagship phone that packs a ton of impressive specs alongside its standout feature: a truly edge-to-edge screen. Unlike nearly every other phone on the market, the Axon 30’s display doesn’t have a notch or cutout for the front-facing camera.",
    "To achieve this, ZTE has incorporated an under-display camera, one of the few in mainstream phones, which is visible when you’re taking front-facing photos but - disappears completely when not in use.",
    "Well, almost completely, for if you look closely there’s a small off-color square that the camera hides behind.",
    "It’s effective in hiding the selfie camera for an uninterrupted screen, which leads to an inarguably better display experience than any other phone on the market with a notch or punch-hole. For many, the absence of a screen notch or other cutout alone will be enough to sell them on this phone, but that undersells its quality as a massive 6.92-inch Full HD Plus AMOLED screen that’s great for watching media or playing games.",
    "The Axon 30’s cameras are also impressive for its price, capable of capturing great daylight photos with its range of ultra-wide and macro capabilities. It doesn’t have a telephoto lens, and its night mode requires some light to function – which pales compared to the flagship capability of phones like the iPhone 13 Pro and the Samsung Galaxy S21.",
    "Overall, the ZTE Axon 30 is a great mid-range phone that offers excellent value compared to more expensive handsets – and has a feature that won’t come to other flagship phones until 2022 or later.",
    "The ZTE Axon 30 was released on September 9, 2021, and costs $499 / £429 (around AU$680) for 8GB RAM and 128GB of storage, or $599 / £519 (around AU$819) for 12GB RAM and 256GB of storage, and two colors – a black-and-gray hue and aqua (a greenish teal).",
    "Compare that to the ZTE Axon 30 Ultra 5G released back in June 2021, which retails for $749 / £649 (around AU$965) for the 8GB RAM and 128GB storage configuration, and up to $849 USD, £739 GBP (around AU$1,095) for the 12GB RAM and 256GB configuration",
    "There's currently no word on whether the phone will be made available in Australia.",
    "The ZTE Axon 30 is a big phone, and while it doesn’t have the premium touches of flagship phones, it’s a sleek device with a design and materials comparable to competitors at its mid-range price tier. It’s less refined than its flagship sibling, the ZTE Axon 30 Ultra, but it’s much bigger, too.",
    "In fact, the Axon 30 is bigger than most phones on the market. Not quite big as a foldable phone, but its size (with a nearly 7-inch display) means it’s almost too large to hold comfortably. But the plastic sides, which narrow to a thin ridge, are easy to get a grip on. While squeezing them isn’t too comfortable, it’s enough of a hold to help prevent you from dropping the phone.",
    "The front of the Axon 30 has the 6.92-inch glass display, which is the phone’s best feature. In 2021, there are few phones without a notch or a punch-hole, and methods to keep the display clear like retracting selfie cameras on the OnePlus 8 Pro have quietly disappeared. The Axon 30 manages to do this like its predecessor did with an under-display camera, which is unnoticeable during normal use and is only barely visible when the camera mode is activated.",
    "The Axon 30’s back is plastic, and it’s the cheapest part of the phone with a very thin feel. The camera block is in the top-left corner of the phone’s back cover, with two differently sized circles. The r top one has a single camera lens, while the bottom has three lenses in a triangular arrangement.",
    "A stripe of hashmarks descend the back cover, which is broken up by a big Axon logo – an effect that looks more at home on a VHS tape than a smartphone. There’s also a ZTE 5G logo on the bottom right of the back.",
    "Volume control is on the right side of the ZTE Axon 30 and, below it, there’s a lock button with texture to make it easier to find. They’re both thin buttons and not comfortable to press, but given they barely fit in the aforementioned thin plastic ridge that the sides raise up to, it makes sense they aren’t bigger. There’s a microphone on top and a USB-C port in the center of the bottom, with a SIM slot on the right and speaker on the left.",
    "The ZTE Axon 30 packs an expansive 6.92-inch Full HD Plus (2460 x 1080) AMOLED display, which is the phone’s signature feature. It has its predecessor’s under-display camera, which means there’s no notch or punch-hole to get in the way – but ignoring that, it’s a great screen for watching media and playing games.",
    "While the Axon 20’s selfie shooter was visible as a slightly discolored patch at the top of the display, the Axon 30’s made it nearly invisible when the screen isn’t in camera mode. While browsing the internet or watching media, you can’t point out the camera lens unless you tilt the phone to catch the light just right. Even then, you can barely see the patch.",
    "If you've switched to the front-facing camera in the camera app, a teardrop notch will briefly appear as the phone transitions when swapping to and from the camera app, after which you won’t see the selfie camera anyway – it’s covered by a thick black bar, which has some photo options like aspect ratio and flash.",
    "But when the under-display camera wasn’t intentionally hidden, and the top of the display was visible in all its unblemished glory, we didn’t notice the extra space. At times, we forgot there wasn’t a notch or punch-hole there, like while gaming and our thumb blocked the left side of the screen. The extra room is a nice-to-have addition, rather than a game-changing improvement.",
    "It’s almost a shame that the no-notch situation is so captivating because the display is pretty stunning for watching media and playing games. That 6.92-inch size is colossal, noticeably dwarfing average-sized phones like a 6.1-inch iPhone 12 Pro. The picture is beautiful, too, showing vibrant colors with crisp detail, and the up to 120Hz refresh rate is great to have for smooth scrolling and games which support high frame rates.",
    "The ZTE Axon 30 has a respectable array of cameras, handling casual daytime photography with ease. While it doesn’t have a zoom lens and its night mode leaves something to be desired, the Axon 30’s cameras get the job done if there’s enough light available.",
    "The phone’s 64MP f/1.8 main shooter with Sony IMX682 sensor is the star of the show, taking great bright daylight shots with crisp detail. The color balance was respectable, though it tended toward less vibrant hues than photos from other phones. The portrait depth worked just fine, though nothing too exciting.",
    "The phone’s trio of other cameras and sensors expand the range, with an 8MP ultra-wide lens with 120-degree field of view and 2MP depth sensor helping out more than the 5MP macro lens, which we couldn’t get to reliably focus on up-close subjects. (We had an easier time shooting macro shots with the phone’s pricier sibling, the ZTE Axon 30 Ultra, suggesting this could be a software issue.)",
    "As expected with phones below flagship prices, the ZTE Axon 30 was less than impressive with night photography. Any modicum of light will help its night mode tremendously, so consider low-light environments instead of no-light if you’re shooting photos after the sun goes down.",
    "The 16MP front-facing under-display camera takes clear photos for a unit that is practically unseen when the phone isn’t in camera mode. While it takes photos that lack as much vibrancy as the rear shooters, and there’s a slight gauzy layer over subjects that aren’t in focus (like in the background), photos taken with the selfie lens are sharp enough to put online.",
    "The ZTE Axon 30 takes great daylight photos thanks to its 64MP main camera, capturing vibrant color and nuanced shadow. While the phone doesn't have a telephoto lens, the high detail of images taken by the main camera means it crops in on images to zoom in and still manages to capture reasonably crisp shots of subjects at a distance. (Remember that the watermark is turned on by default, though, or you'll end up with 'ZTE Axon 30' at the bottom-left corner of each photo; ask me how I know.)",
    "The ZTE Axon 30's cameras take good photos of food and drink in the daytime, too. When properly positioned, the portrait mode (seen below) adds good depth, though it requires some finessing – see the second sandwich photo below.",
    "The Axon 30 does take very crisp wide shots in bright daylight, though those details can diminish in the distance (second photo).",
    "And that front-facing camera under the display works well enough, though its color balance isn't quite as good as the rear cameras:",
    "Finally, an example of night mode, which seriously benefits from ambient light:",
    "The ZTE Axon 30 has respectable specs to compete in the mid-range phone market. Fronted by a Snapdragon 870 chipset, the handset has 8GB RAM and 128GB storage, though some regions have a higher-spec configuration of 12GB RAM and 256GB storage.",
    "This may sound a little lackluster compared to phones powered by the Snapdragon 888 Plus and packing 12GB RAM (and even 16GB RAM in the Asus ROG 5), but the Axon 30 is still pretty powerful. In terms of benchmarks, its Geekbench 5 score of 3,148 puts it around last year’s pricey OnePlus 8 Pro, for instance, though the phone’s higher-specced sibling, the Axon 30 Ultra, scored 3,594.",
    "In practical terms, the ZTE Axon 30 didn’t slow down no matter what we put it through, from browsing the internet to watching shows to playing games.",
    "The ZTE Axon 30 runs Android 11 out of the box, and uses ZTE’s MyOS11 overlay to bring its own take to the operating system. It’s pretty minimal without much bloat in terms of extra apps or interface options – unlike other Android overlays, MyOS11 keeps a lot of the settings direct instead of nesting frequently toggled things like Display and Battery options within vague umbrella subcategories.",
    "There are some flaws in the execution, though – we didn’t believe we only had 52 minutes left before our 72% full battery went kaput, for instance.",
    "The ZTE Axon 30 packs a 4,200mAh battery, which is good if not exceptional. You should be able to last a full day with casual use, and into the second before you need to recharge.",
    "The standout feature is the 65W charger included in the box, which recharges wildly fast – from a nearly dead (1%) battery, the phone charged to 52% in 15 minutes, up to 82% in half an hour, and was fully charged in 45 minutes.",
    "Extremely speedy recharging is much better to have than a giant battery, in our opinion, allowing you to top up in minutes when other batteries can take more than an hour to recharge. And while you could feel some heat beneath the plastic rear cover during recharging, it was far from hot or uncomfortable to touch.",
    "You want a phone with a no-notch, no-punch-hole display",
    "The most obvious reason to buy a ZTE Axon 30 is to get a phone featuring a blemish-free screen with an under-display camera. It’s a great screen for watching media, too.",
    "You want a well-rounded mid-range phone",
    "Even in a competitive mid-range phone market, the ZTE Axon 30 is a strong contender with few flaws at its price.",
    "You want a phone that recharges blindingly fast",
    "Yes, long battery life is good, but it’s rare to get recharging rates as blindingly fast as the ZTE Axon 30’s 65W charger. If you want to juice up your phone in far under an hour, pick the Axon 30.",
    "You want a zoom lens and decent night photography",
    "The ZTE Axon 30 takes good daylight photos at close range, but if you want to take any distance photos using a zoom lens or better night photos, you might want to pay more for the ZTE Axon 30 Ultra’s telephoto zoom or pay a lot more for the Samsung Galaxy S21 Ultra.",
    "You want a smaller phone",
    "The ZTE Axon 30 and its 6.92-inch screen is, quite frankly, huge. If you’re looking for an Android phone at the same price that’s a bit more reasonably sized, go for the Google Pixel 5a.",
    "You want a more easily-sourced Android phone",
    "The ZTE Axon 30 may not be sold by carriers in your country or necessarily easy to acquire, so the standard Samsung Galaxy S21 or OnePlus 9 would be good alternatives.",
    "First reviewed: November 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "ZTE Axon 30 price and release date",
    "9": "Design",
    "15": "Display",
    "20": "Camera",
    "25": "Camera samples",
    "30": "Performance and specs",
    "35": "Battery life",
    "38": "Buy it if…",
    "44": "Don’t buy it if…"
  },
  "links": {
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "ZTE Axon 30 Ultra": "https://www.techradar.com/reviews/zte-axon-30-ultra-5g-review",
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "nice-to-have addition": "https://www.techradar.com/news/the-zte-axon-30s-under-display-camera-proved-that-notch-hate-is-overblown",
    "Asus ROG 5": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}