{
  "source": "https://www.techradar.com/reviews/mu6-ring",
  "title": "Mu6 Ring review",
  "category": "fitness",
  "updated": "2021-11-10T13:53:52Z",
  "author": "jamie-carter",
  "summary": "'Air conduction' headphones that give good value audio for working out and working from home",
  "verdict": "Designed for use at home and during workouts, this set of headband-style headphones claims ‘air conduction’, which basically means it's like bone conduction, but without the weird sensations (and without the bass). At its best with music, podcasts, talk radio, hands-free calls and video calls, the Mu6 Ring is well made, easy to use and good value. It’s also extraordinarily lightweight and malleable, though the downside is a sound quality that doesn’t suit bass-heavy music. There’s also significant sound leakage.",
  "pros": [
    "Light, open design",
    "Comfortable during exercise",
    "Good all-round audio",
    "Long battery life"
  ],
  "cons": [
    "Recharges via micro USB",
    "Flimsy carry bag",
    "Not waterproof",
    "Not audiophile sound"
  ],
  "article": [
    "The Mu6 Ring will suit anyone after a pair of comfy, easy to use and hassle-free headphones for working out, working from home and video calls. Does that sound like your regular kind of day?",
    "Using an open design and eschewing the bone conduction headphones technology used by competitors, the makers of the Mu6 Ring have crafted a flexible, versatile and easy to use product that excels in some specific scenarios.",
    "Working at home but need to be able to hear the front doorbell? Tick. Working on your own, or with someone quiet? No problem (though there is a little sound leakage). Regularly work out or want a set of running headphones? The Mu6 Ring excels at all of these things, and if that’s your normal day then they could easily become the headphones that you wear all the time. The eight-hour battery life helps with that, too.",
    "Weighing just 34g, it's easy to wear for long periods and simple to control with just one button to pause and skip tracks. It also can also links to two devices (for example, your computer and your smartphone), so you can switch between them easily.",
    "When working out, The Mu6 Ring is all about safety, with an open design ensuring that the wearer isn’t completely isolated from traffic noise. Obviously that does come with cons, with the Mu6 Ring unable to block out ambient noise.",
    "he speakers themselves move through 120 degrees so you can position them close to your ears. It also means that the Mu6 Ring works with any size of head, which is rare for headband-style headphones like this.",
    "Though missing the audio oomph to block-out passing traffic while out for a run, what the Mu6 Ring really lacks is bass. Nor does it offer pin-sharp audiophile-grade sound, but then we wouldn’t expect them to at this price.",
    "Best considered as an all-round audio device that can do a job both for work and working out, the Mu6 Ring comes highly recommended for what it is, though don't go throwing away your best headphones.",
    "The Mu6 Ring originally went on sale in 2021 for $89 (about £65 / AU$120), but has since been slightly reduced in price since then. It's sold by GadgetPlus, with storefronts on Amazon UK and Amazon US (where you can save 5% using the code MURING05). It's available in one color: dark blue.",
    "The Mu6 Ring is extraordinarily light and slightly odd-looking. It weighs just 34g, in fact, which is only a few grams heavier than this product’s main competitor, the AfterShokz OpenMove, which clocks in at 29g.",
    "Unlike a lot of headband-style headphones, which tend to bite when worn around the neck, the Mu6 Ring has rather more malleability and can be worn very comfortably for long periods on the head or around the neck. It's fairly flexible and well-built, too, so can be treated pretty roughly.",
    "As well as being light, the Mu6 Ring is evenly weighted, with no extra heaviness on the earbuds. However, what’s most unusual is that those earbuds can be angled down and back through 120 degrees. Essentially, that means you can angle them closer to your ear; the distance between the tiny speakers in the earbuds to your ears is crucial if you’re going to hear much.",
    "That ability to angle them also means it can fit different sized heads. However, it does have a rather odd look when it's being worn. Just above each rotating speaker is a soft silicone temple pad, just to add a touch of grip (it works well even when caked in sweat during a long run), with the right-hand speaker also housing a microphone for hands-free calls. The back 50% of the headband also has a soft silicone strip. The upshot of all this is that the Mu6 Ring is barely noticeable when being worn, and doesn’t move at all during a run.",
    "Crucially for those wearing glasses or wanting to wear the Mu6 Ring with sunglasses while out and about or when running, each revolving speaker has a groove that acts as a passthrough for the arms of glasses.",
    "Well, sort of. In practice the grooves are too shallow; another millimeter and they would work a treat. Instead, our Mu6 Ring was lifted away from the head slightly, with the end result being the speakers were a tiny bit further from our ears, with consequences for sound quality.",
    "Inside the Mu6 is a 200mAh battery. That’s not a lot to play with, but the manufacturers reckon it will last for between six and a half and nine hours. In our real world test we found that they went for just shy of eight hours – so most of a full day in the office – before it needed more juice, which is pretty decent.",
    "The presence of a micro USB slot to recharge the Mu6 Ring is initially annoying. After all, a USB-C clot would be so much more convenient. However, given that so many audio sunglasses and smartwatches appear to think that proprietary charging cables are acceptable, we’re just glad that the manufacturer has gone for a mainstream connector that most people will be able to find around their home.",
    "What is ‘wireless air conduction’? Well, it’s little more than the makers trying to hit home that their product isn’t that weird bone conduction headphones technology that AfterShokz uses. Because who wants the weird sensation of low-frequency sound waves going through their bones?",
    "The downside of not sending low frequency sound waves into the inner ear via the jawbones, of course, is that it goes nowhere. The Mu6 Ring does actually cling to your temples, just like bone conduction headphones do, so it’s not bereft of bass, but it’s certainly better with talk radio, video calls (thanks to its built-in mics) and podcasts than with bass-heavy music.",
    "Either way, we never experienced any distortion when using the Mu6 Ring even at high volumes. Music is surprisingly bassy and well balanced. That the angle of the speakers can be adjusted, and that they’re barely noticeable when being worn, are also huge plusses.",
    "It's thus perfect for providing personal audio in quiet places where you need to remain aware of ambient sounds. Used in a home office where you work alone, they perform really well; for taking video calls and for listening to audio from a computer or phones – including music – they excel. To that end, they can link via Bluetooth to two devices, such as a PC and a smartphone.",
    "However, there are drawbacks. For starters, it lacks high volume, so if you’re out on a run the music you’re listening to is never going to drown out passing trucks (though it’s fine for most cars). That’s down to the open-ear design, of course, but it could definitely go a little louder.",
    "This has consequences at home, too, where those who share a home office will find the Mu6 Ring less than ideal. As well as the open-ear design lacking any kind of noise isolation, it leaks significant audio, too, so anyone sharing your space will likely hear your audio.",
    "In terms of usability, the Mu6 Ring is simplicity itself; it has one button on the right-hand side, which turns the product on and off, initiates Bluetooth pairing, accepts and reflects calls, tweaks the volume, and pauses the music. Sure, you do have to learn a few techniques, mostly double-hits and long presses, which are simple to master. Considering how important it is, it’s a shame that this button is so small and fiddly.",
    "The most useful command of all headphones such as these – especially when worn running, or when out and about shopping – is to be able to pause the music quickly so you can pay attention to your surroundings properly. After all, the Mu6 Ring does have that function, but the button is fairly small, needs to be almost pinched, and is positioned on a part of the chassis that’s lifted up slightly by glasses.",
    "It’s a rare design slip on an otherwise impressive, if less than ambitious, set of everyday headphones for working out and working from home.",
    "First reviewed September 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Mu6 Ring price and release date",
    "9": "Mu6 Ring design",
    "15": "Mu6 Ring battery life",
    "17": "Mu6 Ring audio performance",
    "27": "Don't buy it if"
  },
  "links": {
    "bone conduction headphones": "https://www.techradar.com/news/best-bone-conduction-headphones",
    "running headphones": "https://www.techradar.com/best/best-running-headphones",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "GadgetPlus": "https://www.gadgetplus.com/collections/audio-video/products/mu6-ring-open-air-wireless-air-conduction-sports-headphone",
    "Amazon UK": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FMu6-Headphones-Microphone-Conduction-Waterproof%2Fdp%2FB08ZY71CZ9%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8616073715946635000-21",
    "Amazon US": "https://pxle.me/CMoh8z7D",
    "AfterShokz OpenMove": "https://www.techradar.com/reviews/aftershokz-openmove",
    "audio sunglasses": "https://www.techradar.com/reviews/razer-anzu-audio-sunglasses",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "AfterShokz": "https://www.techradar.com/reviews/aftershokz-aeropex"
  }
}