{
  "source": "https://www.techradar.com/reviews/oukitel-wp9",
  "title": "Oukitel WP9 rugged smartphone review",
  "category": "phones",
  "updated": "2021-06-02T14:33:22Z",
  "author": "desire-athow",
  "summary": "A large battery is the main highlight of an otherwise average rugged smartphone",
  "verdict": "The WP9 suffers from a high suggested retail price that makes it look very average compared to the rest of the competition. Its big battery is its main unique selling point but spend a bit more and you can grab a better rugged smartphone.",
  "pros": [
    "Large battery",
    "Dedicated audio port",
    "Good system performance",
    "Oleophobic screen"
  ],
  "cons": [
    "No Wi-Fi 5",
    "Android 10"
  ],
  "article": [
    "Oukitel is one of the most recognized rugged smartphone vendors, alongside the likes of CAT, Blackview, Ulefone and Doogee. Its flagship waterproof mobile 5G handset, the WP10, received a well deserved 4.5/5 earlier this year and the WP9, its newest device, aims to replicate the same critical success but for a midrange audience.",
    "The WP9 is currently available directly from Oukitel for just under $160 until further notice. Note that additional taxes and fees may apply depending on your location.",
    "This is a rugged smartphone with an IP68/69K & MIL-STD-810G rating and as such we’ve got some very clear expectations as to what to expect from it when it comes to the design. At 160 x 79 x 19mm for a weight of 322g, it is a chunky piece of kit especially for something that sports a 5.86-inch display.",
    "Lots of plastic stuck on a metal frame, with a dash of bright yellow colour and thicker rubber on the corners to protect from the bumps. Deja-vu? Definitely. Likewise, the industrial looks make it a bit more boring but at the same time, reminds us of the fact that Oukitel, well, means business.",
    "The rear of the device hosts three camera sensors placed side by side, above a LED bar and a fingerprint sensor. Near the bottom, a tiny grill hides a lonely speaker and further down, one can find a USB Type-C connector behind a rubber flap. On the opposite edge is another input hidden by a flap, in that case a 3.5-mm audio jack.",
    "On the longer edges are the SIM card trays, a customizable button and an emergency SOS one, a volume rocker and the power button. The front of the WP9 is adorned with a 5.86-inch HD+ display with a large notch for the front facing camera; it is protected by a layer of Corning Gorilla glass and seems to have an additional oleophobic material.",
    "The WP9, unlike the WP10 and the WP11, tries to appeal to a mainstream audience looking for a midrange smartphone with a big battery; hence the headline 8Ah battery. The smartphone is powered by the Helio P60, a three-year old 4G chipset hailing from Mediatek’s massive portfolio. It is accompanied by 6GB of LPDDR4 RAM and 128GB UFS memory (no eMMC here). You can add a microSD card to bump the internal storage but you will lose the ability to add a second SIM card.",
    "The rest of the hardware list includes 802.11n (no AC/Wi-Fi 5 here), a front-facing 8-megapixel selfie and a rear 16-megapixel sensor flanked by a 2-megapixel plus a 0.3-megapixel one. It does have NFC, a standard 24W (12v, 2A) power supply unit but no earphones or accessories.",
    "We were disappointed to see that it runs on Android 10 rather than the newer Android 11. On the other hand, Oukitel judiciously opted for the standard, cleaner, unobtrusive user interface; no custom UI here. Since this is a Mediatek-powered rugged smartphone, we’re handed the usual set of apps.",
    "A toolbag that contains nine useful applications (e.g. a protector, a sound meter or a plumbline) as well as Duraspeed - which shuts down background applications to save resources. There’s no Kids mode though which was a useful way of segregating your apps.",
    "As far as benchmarks are concerned, the WP9 performed decently bearing in mind that it features a mid-range Mediatek processor. Its relatively low resolution means that it will not be sluggish for the vast majority of non-gaming applications. A couple of things: two 3DMark benchmarks repeatedly refused to run while the Passmark CPU numbers we recorded were abnormally low.",
    "The WP9 faces some stiff competition in the hotly contested $150 to $200 price range with Ulefone being conspicuously absent.",
    "Newcomer Umidigi offers the most compelling rival at $170 at the time of writing. The Bison is thinner than what you’d expect from a shockproof smartphone and offers better hardware at a lower price range. A 48-megapixel Sony shooter, 8GB of RAM and a full HD display makes it a firm favourite of ours even if it sports a smaller 5Ah battery.",
    "The Blackview BV6300 Pro has a better processor (the Mediatek P70), wireless charging, an altogether more pleasing design and a lower price tag. But it fails to match the WP9 gargantuan battery life, offering one that’s barely half the capacity.",
    "Last but not least is the Doogee S88 Pro which at $210 is a worthy, slightly more expensive upgrade to the WP9. Not only does it have an even bigger battery than the WP9 at 10Ah, it has a more powerful chipset, a vastly improved display, wireless charging and enhanced photography capabilities. It is significantly larger as well though.",
    "It is not difficult to recommend the Oukitel WP9 over its other rivals at this price especially if you need/care about the oversized battery. The hardware that powers it offers good performance at times but perplexing numbers at others, which points to an unbalanced specification sheet. As such, expect Oukitel to slash the price of the WP9 sooner rather than later especially as Amazon Prime Day looms.",
    "Other than the pricing conundrum, the WP9 needs to have Android 11 to be taken seriously. Will it come in a future update? We wouldn’t count on it given the poor historical record of Chinese rugged smartphone vendors in general when it comes to firmware."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "6": "Hardware",
    "8": "In use and performance",
    "11": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "WP10": "https://www.techradar.com/reviews/oukitel-wp10-5g-rugged-smartphone",
    "Oukitel": "https://bit.ly/3hJ0VV0",
    "microSD card": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards",
    "Doogee S88 Pro": "https://www.techradar.com/reviews/doogee-s88-pro-rugged-smartphone",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}