{
  "source": "https://www.techradar.com/reviews/mario-party-superstars-review",
  "title": "Mario Party Superstars review",
  "category": "gaming",
  "updated": "2021-10-28T13:00:10Z",
  "author": "gerald-lynch",
  "summary": "The best Mario Party has been in years",
  "verdict": "By looking to the past, Mario Party Superstars emerges as the best the long-running board game franchise ever has been on Switch – and the best it’s been for a long time, period.",
  "pros": [
    "A classic selection of boards and minigames",
    "Great modernizations",
    "No more motion controls, Switch Lite fans!"
  ],
  "cons": [
    "Little is brand new",
    "Underlying Switch online play remains a faff"
  ],
  "article": [
    "Do you remember the first time you bumped balls in Mario Party? Bumper balls, that is – the classic minigame from the 1998 Nintendo 64 original. For more than 20 years we've cursed at unlucky dice rolls, delighted in stealing stars and enjoyed madcap sessions of minigames in Nintendo’s take on the board game genre. And with Mario Party Superstars for Nintendo Switch, we’ve finally got something like a greatest hits package for the series as a whole.",
    "Taking five of the best boards from the N64 era of the series along with 100 great minigames from the N64 through Wii U eras, Nintendo has polished up some of the greatest moments from across Mario Party history and delivered a multiplayer gem, just in time for Christmas. It may not have much brand new content for those that have stuck with the series since its conception, but for everyone else. It’s the gaming equivalent of a chocolate box.",
    "For the uninitiated, Mario Party Superstars carries on in the tried and tested tradition of the series – four players join a Nintendo-themed board, and roll dice to move around it.",
    "The object is to collect coins by moving around the board and by winning the minigames that take place at the end of a turn, in order to buy more stars than your rivals and win the game. Each board has its own unique style, challenges and multiple paths to the star, with everything from a giant Cheep Cheep fish appearing to steal the stars to a giant laser beam fired by Bowser to blast away your hard-earned coins.",
    "Landing on certain spots on the board can trigger these events, change the minigames from 1v1v1v1 to 2v2 or 3v1 battles, or even summon Bowser himself to bestow some penalty on players.",
    "Its turn-based format and relatively approachable minigames make this a genuine family game. While each board and minigame has different rules to learn, all can be figured out in a few minutes, and there’s little punishment for jumping in unprepared. Games quickly become heated, and even less experienced video gamers will be surprised at how competitive and ruthless it will make them. Don’t let Mario Party Superstars kid-friendly visuals fool you – multiplayer here is cutthroat. It’s flexible too, with customizable game lengths running from roughly 30 minutes to hours long, or even quicker minigame playlists.",
    "Mario Party Superstars doesn’t really do anything new, though – this is a touched-up revisiting of some of the series' highest points, with some quality of life improvements thrown in. Considering how relatively inaccessible some of these older games are now, that’s no bad thing, and Nintendo has done a good job of making the mixture of elements from different titles fit together in one cohesive game.",
    "Five boards are available to play through in the main game, all originating from the N64 era, and available to play from the outset in any order. Depending on how you count them, this is the lightest Mario Party game in terms of the number of playable boards. But they’re all top-tier offerings, representing the best of the series. Here’s a quick rundown of each:",
    "Yoshi’s Tropical Island: A beginners course from the first Nintendo 64 Mario Party, this beach getaway-themed board has you paying tolls to Thwomp blocks and chasing the star-carrying Toadette around the map as a Cheep Cheep fish keeps taking her away.",
    "Peach’s Birthday Cake: Another OG board, and one for the sweet-toothed. It’s adapted a little from the original though to include more player choice on the pathing they take around the otherwise circular board.",
    "Woody Woods: A Mario Party 3 addition here, Woody Woods has plenty of space for exploration around its board, but includes a selection of Monty Moles that pop up to change your direction of travel, and trees that can bestow the odd bonus to you.",
    "Space Land: An entry from Mario Party 2, this criss-crossing board features a few quirks to spice things up, from a countdown timer threatening a coin-sucking laser blast from Bowser, to speeding Thwomp Blocks and Shy-Guys in hover cars, ready to knock you off course.",
    "Horror Land: Perhaps the most complex board in the game, this one first appeared in Mario Party 2. It has a day and night cycle that will make the thieving King Boo more aggressively steal your belongings after dark, and also Thwomp tolls that will lock immovably in place when the sun goes down.",
    "Mixing things up a little is the ability to add additional turns during play to extend the length of a game. This can be done from the pause screen at any time except the last turn of a game. Trying to convince the leading player that extending a near-complete game is a good idea could end up being an entire game all of its own, however.",
    "The minigame offering is even more varied, taking in 100 minigames from all Mario Party eras right up to the Wii U – though the N64 and GameCube games make up the bulk of the minigame library here. There are some all-time classics back here, from Bumper Balls to the palm-blistering Tug o’ War. Each lasts just a few minutes, and while the quality inevitably varies, it’s Nintendo magic throughout – inventive challenges that can’t help but bring a smile.",
    "Note that there’s no traditional single-player campaign mode here. While you can play against the computer, your main motivation to do so is to earn post-game coins for spending in an in-game store. This unlocks some stickers (more on these later) and lore cards, as well as customization options for your online profile, but not much else to justify a huge grind of investment from a player. It’s very much a multiplayer game then.",
    "Each minigame and course has been given a fresh lick of paint to bring them up to the standard we’d expect from a modern Switch title, and Nintendo’s toy-like art style does them proud. These are the boards as they existed in your head, and when compared to the blurry reality of the N64 originals, they’ve been polished up a treat.",
    "Those that always felt like they were playing catch up during a game with Mario Party veterans will appreciate the inclusion of a preview play mode before each minigame too. A smaller picture-in-picture version of a minigame fires up before the main event, letting you get some practice in before it truly counts. It levels the playing field a bit and is much appreciated.",
    "As you’d expect from a modern Mario Party game, there’s also online play for up to four players. For those that like to indulge themselves with a longer Mario Party session, Superstars finally lets online games be saved if you need to take a break mid-game. It’s a much-needed and requested feature. But Nintendo’s underlying archaic approach to connecting friends makes online play more clunky than we’d expect in this day and age.",
    "The boards and minigames themselves may not be new, but there’s some new additions beyond the core game all the same.",
    "Perhaps the most surprisingly fun new feature is the inclusion of emote-like stickers that can be sent at any point during the board game portion of Mario Party Superstars. A flick of the right stick lets you scroll through the character-themed stickers, from a Bowser ‘Bwahaha!’ to a Birdo wink, along with an accompanying sound effect. They’re more charming than they have any right to be and will make communicating online easier for those without access to a headset. We worry they may be spammed a little by trolls, and they can sometimes obscure elements of the interface, but overall, we’re into them.",
    "Mount Minigames is where you’ll head if you want to ditch the board altogether and just focus on the 100 included minigames. You’ll be able to choose from Free Play, Coin Battle, Tag Match 2v2, Trio Challenge 3v1, Score Attack Sports and Puzzle-themed minigames, an online Survival mode, and a Daily Challenge online mode with a new rotation of minigames each day.",
    "Collecting coins across the boards and Mount Minigame will let you buy collectibles from Toad’s Shop for viewing in Kamek’s Data House, and as you play you’ll slowly build up a ‘Mario Party Level’ – a rank that collates your ongoing playtime and skill with the game. There are also achievements to unlock (with a selection only earnable online), tied to certain boards and minigame performance.",
    "Mario Party Superstars is the most Switch-friendly of the Switch Mario Party games so far, and ironically that’s because it eschews one of the Nintendo console’s most advanced features – its motion controls.",
    "All the minigames in Mario Party Superstars can be played by button input alone, with no need to waggle Joy-Con controllers or point cursors on the screen. As a result, the entire game can be played in all of the Switch’s modes, be that docked on the big screen, in tabletop mode with Pro Controller or Joy-Con in hand, or even in handheld mode.",
    "As a result, whether you’re playing on an original Nintendo Switch, the Nintendo Switch OLED or the Nintendo Switch Lite (which required separate Joy-Con controllers to be paired for Super Mario Party Switch), anyone can play right the way through Mario Party Superstars without issue.",
    "In addition to the above play modes and online play, multiplayer parties can also enjoy local play on their individual consoles if they are gathered together locally. It’s the most versatile Mario Party yet in this respect.",
    "Mario Party Superstars plays out like a love letter to the franchise. With a greatest hits collection of boards, lovingly modernized for the Nintendo Switch console, it’s a great introduction to the series for newcomers, and a wonderfully competitive race down memory lane for old-school fans.",
    "While there isn’t anything new going on here in gameplay terms, and it could do with at least one more board, it’s the most polished Mario Party to date, with streamlined play modes, lovely visuals and smart support for all currently-available types of Switch console and controller.",
    "The only downside remains Nintendo’s system-level online tools, which make settling down for a competitive game over the web a clunky experience. But, seeing as we all know that Mario Party is best enjoyed side-by-side with your screaming pals, perhaps that’s not such a big loss anyway."
  ],
  "headers": {
    "2": "Old games, new fun",
    "6": "Greatest hits",
    "16": "Modern conveniences",
    "19": "New features",
    "23": "Modes of play",
    "27": "Verdict"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review"
  }
}