{
  "source": "https://www.techradar.com/reviews/aftershokz-opencomm",
  "title": "AfterShokz OpenComm review",
  "category": "audio-visual",
  "updated": "2021-11-11T14:43:46.130Z",
  "author": "mark-pickavance",
  "summary": "Ear friendly Headphones for long period use",
  "verdict": "AfterShokz OpenComm headphones use bone conduction to offer decent audio without covering your ears, making them better for situations that require the hearing of local sounds. They’re also comfortable to wear for long periods.",
  "pros": [
    "Excellent for long wear",
    "Better for situational awareness",
    "Easier to sanitise",
    "Magnetic charging"
  ],
  "cons": [
    "Doesn’t include a Bluetooth adapter",
    "Biased to lower-frequency sound"
  ],
  "article": [
    "Most of us have used conventional headphones that either encompasses the ear with a foam pad or fit inside the ear canal and can recognise the limitations of both solutions.",
    "The pads are initially the comfortable option, but they’re not nice when the weather is warm, and those that go inside the ears can become uncomfortable with prolonged use since the ear canal was never meant to have things jammed into it.",
    "And both approaches have a limitation in that they tend to block out local sounds making them potentially dangerous when situation awareness is vital, like when you might be cycling across a busy city.",
    "There is an alternative available that was discovered long ago, bone conduction, which solves both the comfort and the awareness issue.",
    "In this review, we try some bone conduction headphones and see if they’re up to the job of delivering sound without making the recipients ears hurt.",
    "The price directly from AfterShokz is $159.95 for US customers, £149.95 in the UK and €169.95 across the rest of Europe. This design come in black, slate grey and light grey.",
    "In addition to direct buying, these can also be purchased via Amazon and other online resellers, but typically the cost remains unchanged.",
    "Before we dive into the design of the AfterShokz OpenComm headphones, let’s talk about bone conduction, how it started and how it works.",
    "According to several scholars, the documented use of bone conduction dates back to 2AD or even further, but the concept came into broader popularity in the 1500s to address deafness in the elderly.",
    "It is believed that to continue composing after the loss of his hearing, Ludwig von Beethoven would rest a rod on the lid of his piano and grip it in his mouth allowing the sound to propagate through the bones of his skull.",
    "Thankfully the OpenComm doesn’t go in the mouth but instead contacts the skull in an area just in front of the ears. This is where the skin and muscle coverings are relatively thin, allowing vibrations to propagate to the bone more easily.",
    "Therefore, while you wear them over the ears, they don’t cover the auditory openings, allowing sound entering them to be heard alongside anything being transmitted through the headphones.",
    "Removing the headphones from the protective case that AfterShokz packages them inside, our initial reaction was that they appear remarkably flimsy.",
    "A flexible band that’s only 3.2 mm in diameter separates the two thicker sections where the electronics and batteries reside and then end in two bone-contacting elements, with one having a short and equally thin microphone boom. Most of the controls are on the left side pad, and this is also the section where they are charged.",
    "According to the makers, titanium is extensively used in construction, which should make them more durable than their elegant design might infer.",
    "Other than some paper instructions covering the basic controls and pairing the device, the only other item in the case is a charging cable that links USB to a proprietary connector on the headphones.",
    "Normally, we’re not huge fans of proprietary connectors. If you misplace the cable, then replacing it might be a big issue, but the way this one worked we unreservedly loved.",
    "It’s magnetic, making it not only easy to connect and disconnect but also highly unlikely to damage the OpenComm, however clumsy you are.",
    "The number of USB connect devices we’ve seen where a perfectly useable piece of equipment is trashed because the charging port became worn is numerous, so we’re all for innovative connection technology that won’t break so easily.",
    "There is one critical item missing from the OpenComm box to our mind is a Bluetooth adapter. Yes, anyone using this with a phone, tablet or most laptops will have this technology already embedded in their machine, but that’s not a given for desktop computer users.",
    "In the sort of volume that these are made, adding a small USB Bluetooth adapter might have added a dollar to the cost of manufacturing, if that, so it is disappointing that AfterShokz didn’t include one.",
    "The features of this design are basic yet sufficient for most users. Two easily accessible buttons adjust volume, and the increase volume button also instigates Bluetooth pairing if held down when the OpenComm are turned off.",
    "Pairing is very straightforward in Bluetooth 5.0, and it can be even easier as the OpenComm has a small NFC chip in them to facilitate this if you bring them close to a phone with this capability.",
    "All the buttons are on the right side, along with a multifunction button that can be used to answer calls, navigate through audio tracks depending on how it is pressed. Their placement is very convenient if you are righthanded and less helpful if you are not.",
    "Charging is via the magnetic port I’ve already mentioned, and a full charge can be achieved in a couple of hours. That should give you, according to Aftershokz, 8 hours of listening time and up to 16 hours of talking pleasure.",
    "The playback times hint that listening to music will exhaust the headset more rapidly than a conversation, twice as quickly, to be precise. They last about ten days on standby, should you not need them for a while.",
    "We should also mention that these are IP55 Water-Resistant, which means they can handle a light shower, but we wouldn’t swim in them.",
    "Sound quality is the Achilles heel for bone-conducting headphones. Because as much as we liked these, they’re not ever going to replace any conventional headphones for frequency range.",
    "That said, the range they do offer is much better than we anticipated, and unless you are an obsessive audiophile, they’re more than adequate for listening to music or TV audio.",
    "The only output caveat is that if you take them off and they remain connected, it is possible to hear the music from them when you put them on any hard surface. Placing them on something soft, you’ll hear very little, but any table will amplify the sound and make the OpenComm move with the vibrations.",
    "But where they truly shine is when used for phone or streamed conversations, where the voice of others is very crisply represented. The boom microphone has dual sensors on it and uses these to create external noise reduction, making your voice distinct from surrounding background noise to those at the other end.",
    "This noise reduction technology isn’t anything new since it is in all Aftershokz headphones, but it works very well in these making them highly suitable for calls and conferencing.",
    "From an audiophile perspective, bone conduction is a mixed bag. The density of human skulls is suitable for transmitting some frequencies, mostly the low range, and less amazing at relaying the high treble end.",
    "This division makes perfect sense since it would never be a positive evolutionary direction to make the human skull ring like a bell if stuck, transmitting that energy to the soft squishy contents.",
    "That makes music with extensive bass seem good, but pieces with high end appear clipped and less dramatic. We noticed that adjusting the position of the contact pads did make for better results, but if you are running or moving, this placement might easily move to a less perfect position.",
    "Therefore, if you want an epic soundscape, then spend $800 on some wire connected cans and live with the other practical limitations of those devices.",
    "Where the AfterShokz OpenComm come into their own is for those that need to hear digital audio for long periods without discomfort and need a microphone to communicate freely.",
    "After a few uses, these are second nature to pull on and position, and once you no longer need them to remove and connect to be recharged.",
    "They’re significantly nicer to wear for a prolonged session and almost entirely devoid of the soreness that in-ear designs and cans can generate.",
    "We’d have liked greater battery life, but it should get most people through a working day, especially if they charge them during a lunch break.",
    "Our only minor concern is that AfterShokz has the OpenMove, a remarkably similar product that is sweat-resistant that omits the boom microphone for nearly half the price, and as good as the mic is on this design, is it worth that much extra?",
    "If you don’t need to talk, only listen, the OpenMove might be the AfterShokz product for you, but for those that need to listen and also be heard, the AfterShokz OpenComm are an excellent choice.",
    "We’re not unique in having this opinion, as currently they out of stock at AfterShokz in the UK. Thankfully, other regions and sources still have stock, but this design is likely to be extremely popular this year, we suspect."
  ],
  "headers": {
    "5": "Price and availability",
    "7": "Design",
    "21": "Features and battery life",
    "27": "Sound performance",
    "32": "Final verdict"
  },
  "links": {
    "bone conduction headphones": "https://www.techradar.com/news/best-bone-conduction-headphones",
    "OpenMove": "https://www.techradar.com/reviews/aftershokz-openmove"
  }
}