{
  "source": "https://www.techradar.com/reviews/surfbouncer-vpn",
  "title": "SurfBouncer VPN review",
  "category": "computing",
  "updated": "2021-02-04T22:22:42Z",
  "author": "sead-fadilpasic",
  "summary": "A capable VPN, if you can stomach the price",
  "verdict": "SurfBouncer VPN is a touch expensive, lacks a money-back guarantee and there are no feature-rich native apps. However, it offers excellent privacy and good download speeds, as well as unblocking capabilities for the popular geo-restricted services.",
  "pros": [
    "Unblocks Netflix, BBC iPlayer, more",
    "Solid download speeds"
  ],
  "cons": [
    "A tad expensive",
    "Doesn’t support torrenting",
    "No free trials or money-back guarantee",
    "No native clients",
    "No response from customer support"
  ],
  "article": [
    "Established in 2006, SurfBouncer is a VPN provider that offers access to high-encryption servers that secure your connection and unblock online content. It offers several VPN options to meet various user needs.",
    "SurfBouncer operates a wide range of service packages, named as follows: Personal VPN Service, WireGuard VPN Service, Dedicated WireGuard and Dedicated Servers. We were most interested in the first two, as they are the best fit for most VPN users.",
    "The WireGuard VPN Service is the cheapest, costing $80/year (the equivalent of $6.67/month), while the Personal VPN Service can be had for $120/year ($10/month) for the same plan.",
    "Although it’s not listed among the subscription packages, there’s also the OpenVPN Lite package, which excludes Netflix unblocking capabilities but costs the same as the WireGuard VPN Service.",
    "These prices place SurfBouncer among the more expensive VPNs on the market. Under one account, you can run up to 5 simultaneous VPN connections.",
    "Unfortunately, there are no free trials or money-back guarantees. The reasoning behind this, according to SurfBouncer, is that hackers typically use free trials to get their hands on free IP addresses to send out spam and make purchases on fake credit cards.",
    "In addition to providing its VPN service, SurfBouncer also offers VPN routers for securing your entire home or small business network, a VPN Flash Drive for portable VPN service, a Static and Dedicated IP VPN Service and more. You can even get a discount for 4 users (and up to 20 simultaneous connections) if you take the VPN Family Plan.",
    "Accepted payment options include PayPal, credit/debit cards, Amazon Payments and even Bitcoin.",
    "Despite the high price-tag, SurfBouncer is not on the same level as services such as ExpressVPN, which is far more advanced and offers intuitive clients, 24/7 live chat, torrenting support and more.",
    "NordVPN, which costs half as much as SurfBouncer, also offers a very competitive platform, close to ExpressVPN in its capabilities. It's also worth considering the super-cheap Windscribe, which even gives you 10GB per month for free, so there’s no lack of choice at more attractive prices.",
    "Many users look for a VPN service that will enable them to stream localized content from channels like Netflix, Hulu, HBO Go, or BBC iPlayer, which may be actively blocked in their regions. SurfBouncer is able to unblock all of these servies, as we ourselves have witnessed.",
    "This provider states it doesn’t have any fixed offices or a call center. In fact, the company and its offices are virtual and span across several time zones. However, we learned in its Terms of Service that it is registered in the UK.",
    "SurfBouncer offers access to an undisclosed number of servers all over the world, including in Bulgaria, Hungary, Ireland, Serbia, UAE, Vietnam, Turkey, Kenya, Israel, Moldova, Russia, South Africa, and more. We counted 41 server locations in 36 countries listed on the website.",
    "This VPN vendor uses all the usual connection protocols, and then some. Most of its servers work with OpenVPN, IKEv2, and L2TP protocols. A few locations are reserved for Stealth (OpenVPN Scramble) protocol, and a good number of them use the WireGuard VPN. We aren’t told what encryption exactly is used.",
    "This is a great solution for users living in countries where internet access is more heavily censored. However, since it makes absolutely no mention of torrenting on the website and we never got a response from customer support on the issue, we wouldn’t recommend such activities with this provider.",
    "The Privacy Policy suggests that the only information SurfBouncer monitors when you log into its VPN is related to the process of establishing a connection. It doesn’t record the IP address and doesn’t “know or ever record anything about the actual data you are transmitting.” What little information is contained in the connection logs is deleted within 7 days “and no long term logs are kept”.",
    "SurfBouncer VPN can be set up and used on Windows, Mac, iOS, Android, and Linux devices. Depending on your chosen package, you’ll be directed to download third-party software and configuration files.",
    "Should you require assistance with anything related to the platform, you’re welcome to check out the provider’s general FAQ or VPN Privacy and Personal FAQ section, where you’ll find some general information, as well as advice on how to make your presence online even more anonymous.",
    "If the website fails to answer your questions, then you can contact customer support via email for more general questions and email for technical support. Its orders and technical support requests are handled between 7:00 and 22:00 US Pacific time, 365 days a year. Sadly, our email has been left unanswered.",
    "SurfBouncer doesn’t set up your account instantly. The provider claims that this is to protect your privacy and personal information as “other VPN companies that provide for instant setup of the purchase have been hacked recently and their users’ information including email addresses and identities stolen”. In our case, the activation took just over half an hour.",
    "We tested its WireGuard package or “SurfBouncer Lite VPN”. The welcoming email directed us to download and install the WireGuard app, after which we were asked to import the configuration files (sent in the email). The process went quickly and smoothly, and soon we were ready to start our speed tests.",
    "Our first visit was to a server in Poland, which we tested on a 45Mbps testing connection. The download speeds were variable, ranging from 12 to 22Mbps. Then it was time to try our luck with a server in the UK, which delivered a very strong 29.52Mbps.",
    "We didn’t have as much luck with the server in Canada, which only gave us 4.83Mbps, and a server in Hong Kong handed us an above-average 7Mbps.",
    "SurfBouncer still has a lot to learn from the industry giants, which offer support for torrenting, feature-rich apps for every device, as well as free trials (or at least a money-back guarantee).",
    "That said, if you need access to popular streaming content at high speeds, SurfBouncer will do the trick."
  ],
  "headers": {
    "1": "Price",
    "8": "Alternatives",
    "10": "Streaming",
    "11": "About the company",
    "13": "Privacy and encryption",
    "16": "Support",
    "19": "Speed and experience",
    "23": "Verdict"
  },
  "links": {
    "SurfBouncer": "https://www.surfbouncer.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Windscribe": "https://www.techradar.com/reviews/windscribe",
    "Terms of Service": "https://www.surfbouncer.com/service.htm",
    "Privacy Policy": "https://www.surfbouncer.com/privacy.htm",
    "general FAQ": "https://www.surfbouncer.com/more_information.htm",
    "VPN Privacy and Personal FAQ": "https://www.surfbouncer.com/personal_vpn_faq.htm",
    "email": "mailto:support@surfbouncer.com"
  }
}