{
  "source": "https://www.techradar.com/reviews/xgimi-elfin-mini-led-projector",
  "title": "XGIMI Elfin Mini LED Projector review",
  "category": "audio-visual",
  "updated": "2021-09-02T13:19:59Z",
  "author": "mark-knapp",
  "summary": "Smaller and lighter – yet somehow less portable",
  "verdict": "The XGIMI Elfin made itself more and less portable at the same time by ditching the internal battery. It’s a solid, compact projector for home use, but its portability is less useful without battery power, and other home theater projectors easily win out in picture quality.",
  "pros": [
    "Handy, automatic features",
    "Mid-range pricing",
    "Vibrant, poppy color",
    "Compact"
  ],
  "cons": [
    "Noticeable dithering",
    "Still no Netflix",
    "Sign-in required"
  ],
  "article": [
    "The XGIMI Elfin is bringing the well-regarded XGIMI experience to a smaller package. It’s not falling behind in features or picture quality from some of its siblings, but it skips out on being a true portable projector by ditching the internal battery and instead focuses on being small. It’s a curious position to be in, an incredibly portable XGIMI projector, but also one of the few you can’t use on the go.",
    "This model is just under two pounds and under two inches thick. In spite of that size, it boasts bright visuals with punchy colors. It even has surprisingly powerful speakers. And, those speakers are given all the more room to shine given how quiet the projector is in operation. We might have expected a louder fan in this footprint to keep the projector cool, but we almost never hear the fan while we’re watching, and that’s with the projector just a couple feet from our head.",
    "Picture quality is good, though some issues crop up in darker portions of the image. Noticeable dithering in large, dark, single-color areas is distracting and makes the projector a poor pick for gaming and anime. But, the high brightness levels help with visibility if you’re not always in a dark room and want to watch brighter content.",
    "The Elfin comes running Android TV 10.0, though has a glaring lack of built-in support for the Netflix app. Between the built-in streaming software, the speakers, and the projector, it’s a strong all-in-one package.",
    "The XGIMI Elfin is available for $649 from Xgimi and Amazon, and £649 from Xgimi in the UK. At that price point, the Elfin can offer a compelling alternative to mid-range 4K TVs as it boasts a much bigger picture while being much easier to move from room to room or even travel with.",
    "In terms of the competition, the Anker Nebula Solar Portable is a close competitor that brings a battery for added functionality, but the Elfin is brighter and therefore better suited to home theater use. That said, if portability isn’t key, the Optoma HD39HDR and BenQ TH585 offer brighter pictures, more powerful speakers, and enhanced gaming experiences in the same price ballpark as the Elfin, though they aren’t as compact. The XGIMI Halo is also an upgrade for audio and packs a considerable battery for just $150 more.",
    "The XGIMI Elfin boils down XGIMI’s other projectors into a more compact package that doesn’t make major sacrifices to get there.",
    "Though the XGIMI Elfin is just 1.98 pounds and only 1.97 inches thick, it’s able to hit a bright 800 ANSI Lumens. The design is reminiscent of Apple’s Mac Mini, albeit white plastic rather than silver metal. The chassis has a barren top and sides, leaving the front, back, and bottom to house the important bits.",
    "You’ll find the projector lens behind a hard glass protector on the front as well as sensors for handling automatic keystone and image framing. The XGIMI Elfin boasts the ability to actually frame the image within the bounds of a projection screen or shrink it to avoid obstacles, like paintings or other wall art, automatically. It can quickly manage horizontal and vertical keystone adjustments as well as focus, saving a lot of fuss in setup.",
    "The rear of the XGIMI Elfin includes an HDMI 2.0 port, USB 2.0 port, 3.5mm audio jack, and a power button. There’s also a vent for exhaust. Even more venting is on the bottom.",
    "Notably absent from the design are any sort of control buttons beyond power. There’s no HDMI source switching, volume control, or focus control available without the remote.",
    "Speaking of, the included remote handles all interfacing with the Android TV 10.0 operating system installed, and the remote does a fine job, though the system can be a little slow to react to Google Assistant commands. The interface is fairly intuitive, but XGIMI has still failed to deliver Netflix support.",
    "Another nuisance is that running the XGIMI requires an Android account signed-in before you can do anything with the projector, even if you plan to use it 100% with an external HDMI device.",
    "The XGIMI Elfin has 3W stereo speakers built in, so it can handle your video and audio together. The speakers offer surprisingly impactful audio for their size. They can get more than loud enough for a modest living room, say 200 sq ft, just fine. Though don’t plan on letting your friends talk over the speakers, because they may succeed.",
    "Unlike a number of other XGIMI projectors, this one doesn’t run on any battery, so you’ll still need to keep it plugged in to enjoy content.",
    "The XGIMI Elfin isn’t breaking any records for picture quality, but it puts on a good show for a projector of its size. Even while maintaining almost imperceptible noise levels, the XGIMI Elfin is able to cast an image at up to 800 ANSI Lumens. Even with our ceiling lights on, the image can get bright enough to see plainly, so it may serve well for brighter content, such as children’s cartoons or sports.",
    "The Elfin is still just a 1080p projector, though, so it does fall a little bit short when going for the extreme projection sizes. Jagged edges on text and simple geometric shapes are quite apparent at large sizes, and sometimes those jagged edges can appear on even straight vertical or horizontal imagery because of the contortions from keystone correction.",
    "In action, the visuals are sharp enough, though. The Elfin also provides a picture with color that pops. This may be because it is a bit oversaturated, particularly when yellows are prominent in a scene, but the picture never appeared garish.",
    "But, the Elfin suffers in the same ways as the XGIMI Halo when it comes to darker content. It doesn’t provide a lot of detail in the dark, making it hard to see. And, for static areas in the dark, it has the same dithering issue we’d seen before, where we see a color rapidly switching between shades to simulate a color but failing to switch fast enough to be imperceptible.",
    "Again, it shows itself most on darker shades of a color that fill a large area. That’s bad news for anime fans, but it won’t always rear its head in live-action content where textures and fine details preclude the flat colors that run into the dithering problem.",
    "Fortunately, it’s still easier to overlook when you keep the picture smaller. We notice it plainly when the display is stretched upwards of 80 inches, but it will hide better if your aim is a more TV-like 50- or 60-inch projection.",
    "Though the Elfin boasts of HDR10+ visuals, the poor shadow detail makes the promise of any HDR sort of bunk."
  ],
  "headers": {
    "0": "One-minute review",
    "4": "Price and availability",
    "6": "Design",
    "11": "Features",
    "15": "Picture quality",
    "22": "Don’t buy it if…"
  },
  "links": {
    "Xgimi": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6443844177340475000&xs=1&url=https%3A%2F%2Fus.xgimi.com%2Fproducts%2Fbuy-elfin&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fxgimi-elfin-mini-led-projector",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB098WT6DW2%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9690752925559466000-20",
    "£649 from Xgimi in the UK": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1234919457519677000&xs=1&url=https%3A%2F%2Fuk.xgimi.com%2Fproducts%2Fbuy-elfin&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fxgimi-elfin-mini-led-projector",
    "Anker Nebula Solar Portable": "https://www.techradar.com/reviews/anker-nebula-solar-portable",
    "XGIMI Halo": "https://www.techradar.com/reviews/xgimi-halo-portable-projector",
    "Mac Mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020"
  }
}