{
  "source": "https://www.techradar.com/reviews/whatsapp-encrypted-messaging",
  "title": "WhatsApp encrypted messaging review",
  "category": "computing",
  "updated": "2021-08-10T04:56:16Z",
  "author": "sarah-rogers",
  "summary": "This massively popular messaging service comes with one big security concern",
  "verdict": "WhatsApp is a simple way to send encrypted messages over Wi-Fi, but its connection to Facebook means it’s not for the security-minded.",
  "pros": [
    "Free and easy to use",
    "End-to-end encryption"
  ],
  "cons": [
    "Shares some information with Facebook",
    "Vulnerable to scams"
  ],
  "article": [
    "WhatsApp is a popular encrypted messaging service that mimics the interface of traditional text messaging, but uses Wi-Fi instead of cellular data. This is useful for users who want more security than regular text messaging, or who want to keep in touch with family, friends, or colleagues in other countries without the expense of international data plans.",
    "WhatsApp has become extremely popular in recent years, but does it live up to the hype? In this WhatsApp review, we’ll look at the app’s pricing, features, interface, support, and security to help you decide if it’s right for you.",
    "WhatsApp is available for iPhone and Android, as a desktop app for Mac or Windows, or to use in a web browser (although you must have one of the phone apps to access WhatsApp on other devices.)",
    "As long as you are connected to Wi-Fi or have cellular data available, WhatsApp is free to download and use. However, if you are not connected to Wi-Fi or you are roaming, your carrier may charge you depending on your cellular plan. You should double-check your cellular plan to ensure you won’t be charged before using the app.",
    "For businesses looking to message customers, WhatsApp offers a free app for businesses, called WhatsApp Business.",
    "WhatsApp enables users to send encrypted messages over Wi-Fi to any other WhatsApp user. Just like regular text messaging, you can also attach photos, send voice memos, share documents up to 100 MB, or even drop a pin of your location. A big draw of WhatsApp is the ability to create group chats of up to 256 people, letting you chat with the entire family or easily send the latest quarterly report to your whole team.",
    "Unlike traditional text messaging, WhatsApp users can set a status like “at the movies” or “in a meeting,” letting other users know when they are unable to respond.",
    "WhatsApp has a Wi-Fi-based voice and video call feature, which is useful to replace expensive international phone calls or if you have a cellular data plan that limits your calling minutes.",
    "WhatsApp Business users can link their WhatsApp to their business’s Facebook and Instagram pages, giving customers an easy way to ask questions or schedule services. On WhatsApp Business, you can set up a business profile with hours and contact information, create a catalog of products and services, and set up automatic replies to give customers quick responses.",
    "One annoyance for small business owners is that you cannot use the same phone number for both a WhatsApp and a WhatsApp Business account, meaning you will need to create a separate phone number if you want to use both.",
    "WhatsApp is extremely easy to set-up and use. You will need either an iPhone or Android phone to get started, even if you plan to primarily use the service on a desktop. Once you download the app on your phone, you will be prompted to create an account linked to your phone number. By enabling access to your contacts, you can immediately see users you know who are also using WhatsApp, and begin chatting.",
    "Once you have set WhatsApp up on your phone, you can link your account to the desktop app or web browser via QR code.",
    "As WhatsApp’s interface mimics traditional text messaging, it should be extremely intuitive for most users.",
    "On both the mobile app and web browser, WhatsApp offers a fairly comprehensive database of FAQs. The mobile app also allows you to submit questions directly to WhatsApp and attach screenshots of the problem you are encountering. This feature is available on a web browser too, but users are encouraged to submit concerns via the app.",
    "WhatsApp boasts that it uses end-to-end encryption, meaning it doesn’t store or log your messages. Only you and the person you’re messaging can see what you send.",
    "However, there are still some security concerns, primarily because WhatsApp is owned by Facebook. While WhatsApp does not share your personal messages, your shared locations, or your contacts with Facebook, they do share your account details, like your name and IP address. This may be enough to turn off the extremely security-minded.",
    "WhatsApp’s large user base makes it a primary target of scams, and the service has been subjected to several high-profile hacks and security vulnerabilities. In April of 2021, Forbes reported on a security vulnerability that enabled hackers to access a WhatsApp account just by knowing the account holder’s phone number.",
    "Users concerned about WhatsApp’s security might look into Signal, which offers a similar encrypted messaging service but without the ties to Facebook. Like WhatsApp, Signal is free to use.",
    "Threema is an alternative for users who want an even more private experience than Signal. Signal requires users to enter a phone number or email address, whereas Threema users can remain completely anonymous. However, unlike WhatsApp or Signal, Threema costs $2.99 to download, but is free to use after the one-time fee.",
    "WhatsApp is an easy-to-use option to start group chats or connect with friends and family abroad. However, WhatsApp’s connection to Facebook means it is not the right pick for users who are primarily concerned with privacy.",
    "But for businesses looking to engage with customers, Facebook may be an asset to WhatsApp, as it enables businesses to easily connect to their Facebook and Instagram pages.",
    "Overall, an encrypted messaging app is only worthwhile if the people you want to message are using it. Since WhatsApp is one of the biggest encrypted messaging services, that makes it worth considering."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "10": "Interface and in use",
    "13": "Support",
    "14": "Security",
    "17": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "WhatsApp": "https://www.whatsapp.com/",
    "encrypted messaging service": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "web browser": "https://www.techradar.com/best/browser",
    "WhatsApp Business": "https://www.techradar.com/news/whatsapp-business-users-will-soon-be-able-to-hide-from-needy-customers",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Forbes": "https://www.forbes.com/sites/zakdoffman/2021/04/10/shock-new-warning-for-millions-of-whatsapp-users-on-apple-iphone-and-google-android-phones/?sh=551f5bae7585",
    "Signal": "https://www.techradar.com/reviews/signal-encrypted-messaging",
    "Threema": "https://www.techradar.com/reviews/threema-encrypted-messaging"
  }
}