{
  "source": "https://www.techradar.com/reviews/eufy-solocam-e40",
  "title": "Eufy SoloCam E40 review",
  "category": "smart-home",
  "updated": "2021-07-30T10:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "With free built-in video storage and direct Wi-Fi, is this the best wireless home security camera you can buy?",
  "verdict": "The Eufy SoloCam E40 is the most affordable 2K battery-powered home security camera on the market. The footage is detailed and clear, but the addition of built-in storage for video, which does away with the need to pay subscription costs, is the real plus point here. However, night-time footage is black-and-white rather than color, and the built-in battery results in the camera becoming unusable when it needs recharging.",
  "pros": [
    "Affordable",
    "Extremely detailed video",
    "Free video storage"
  ],
  "cons": [
    "Lacks HomeKit support",
    "Night video isn’t in color"
  ],
  "article": [
    "Eufy, the smart home brand from Anker, is a company that’s most well known for tech peripherals such as USB cables and power banks. Although relatively new to the home security market, the brand has quickly gained a reputation for offering some of the best home security cameras that are more affordable but just as effective as those from rivals Arlo and Ring.",
    "The Eufy SoloCam E40 is one of the brand’s newest wireless home security cameras. It’s a weather-proof battery-operated device that will push a notification to your smartphone if it detects motion in its 130-degree field of view, allowing you to log in and view the camera’s live feed.",
    "On detecting motion, the SoloCam E40 records 2K color footage during the day and, thanks to infrared, black-and-white video at night, allowing you to review an incident at a later date. However, unlike many of its rivals, the footage is stored on the 8GB of memory built into the camera itself, which means you don’t need to subscribe to a monthly cloud storage service to get the most out of this home security camera. Eufy says this equates to around 30 days of motion detection clips based on 30 detections a day, with each video lasting for 10 seconds.",
    "The Eufy SoloCam E40 has on-device AI that can identify whether the motion is caused by a human or another source, and a built-in microphone and speaker enables you to also converse with anyone in the camera’s field of view.",
    "In addition, integration with Amazon Alexa and Google Assistant mean you can use a compatible smart display to review the camera’s feed and use the camera in home automation, too.",
    "Unlike EufyCam 2, which is Eufy’s previous range of wireless home security cameras, the SoloCam E40 doesn’t require a base station to connect to the internet. Instead, the camera comes with built-in Wi-Fi and can connect directly to a router. It’s powered by a battery, which Eufy says will last up to 120 days between charges.",
    "At 129.99 / £119.99 / AU$229, the EufyCam SoloCam E40 is one of the most affordable battery-powered 2K home security cameras on the market, and the inclusion of free on-board storage makes it ideal for anyone who wants detailed footage of their home without the burden of on-going costs.",
    "The Eufy SoloCam E40 will set you back $129.99 / £119.99 / AU$229 through Eufy’s website and select electrical retailers including Amazon in the US and the UK. Eufy says it will be released in Australia at the end of the year.",
    "Eufy also offers a more affordable Full HD version of the wireless security camera. Known as the Eufy SoloCam E20, it costs $99.99 / £99.99 (around AU$135) and is available now in the US and the UK.",
    "The Eufy SoloCam E40 is one of the bigger battery-powered weatherproof home security cameras we’ve tested, measuring 1.9 x 3.9 x 1.9 inches / 4.9 x 10 x 4.9 cm (w x d x h). The camera comes with a compact screw mount that attaches to the back of the camera and allows it to be wall-mounted. The mount includes a ball and socket joint that can be angled to capture everything you want in its field of view. It’s also possible to use the camera freestanding, placing it on a surface without the mount. However, used in this way, there’s no way to angle the camera. You may find yourself balancing the unit on piles of books to ensure the lens captures everything in its field of view.",
    "On the front of the camera is the 130-degree camera lens, along with an LED that illuminates blue when the camera battery is being recharged. There’s also a microphone, so you can converse with anyone in its field of view. A sync button on top of the camera is used for setup, or to perform a factory reset of the camera. On the back, covered by a silicon flap, is a micro-USB socket for charging the battery.",
    "As we’ve already mentioned, the Eufy SoloCam E40 comes with 8GB of built-in storage, which can hold up to 30 days of video clips (based on 30 events a day, with each lasting 10 seconds). Unfortunately, the battery isn’t swappable, which means SoloCam E40 will be out of action when it's being recharged. Eufy says this can take up to eight hours. It’s also worth noting that the camera comes bundled with a charging cable, not the power adapter for a wall outlet.",
    "Like other Eufy wireless home security cameras, the Eufy SoloCam E40 is simple to set up. Just download the app on your smartphone or tablet and create an account. Once you’ve done this, you’ll need to press the sync button on the camera, enter your home Wi-Fi password and use the camera’s lens to scan a QR code that will be displayed on your phone. Follow the on-screen steps to name your camera, and it’s ready to start monitoring for motion.",
    "On test, the Eufy SoloCam E40 recorded clear, super-detailed footage both during the day and at night. There’s a slight fish-eye effect on the video, but not so much that it detracts from the detail on display. During the day, footage is captured in color, but since the camera lacks any built-in spotlight – such as the Arlo Pro 4, for example – video recorded at night is in black-and-white.",
    "We found the built-in AI was accurate when it came to identifying people in its field of view, even providing a small thumbnail of the human in the Events list. We found the two-way talk function clear, plus it’s possible to manually trigger a 90dB siren in the camera when viewing the live feed.",
    "There are a range of modes that allow you to arm or disarm some or all of your Eufy cameras at the same time. In addition, you can set a schedule for when the camera should be recording.",
    "Just like other Eufy home security cameras, the SoloCam E40 uses the Eufy Security app, which we found simple to use. Once the app is launched, you’ll see a list of devices installed in your home, along with a snapshot of the most recent motion detection. From here, you can access a number of quick actions for each device, including snoozing notifications for set durations, viewing a list of motion detections from today, and the most common settings for each camera – such as creating activity zones, so you’re only notified about motion in these sections, which reduces unwanted alerts.",
    "An Events tab offers a list of past footage in chronological order, while the Security section allows you to control how a camera behaves when you're home or away. There’s also an Explore tab that provides more details on Eufy products.",
    "The SoloCam E40 offers integration with Amazon Alexa and Google, allowing you to view its live feed on one of the best smart displays – although, unfortunately, unlike Eufy’s other cameras, this camera doesn’t come with support for HomeKit.",
    "According to Eufy, the battery in the Eufy SoloCam E40 will last up to 120 days between charges, as we’ve already mentioned. This figure is based on 30 events a day, with each lasting 10 seconds. We put the camera through heavy testing in a short period of time for this review, so can’t therefore confirm this ‘typical use’ figure. However, battery life will depend on how often motion is detected, how many times the live feed is viewed, if the siren is triggered, and the number of times the two-way microphone and speaker are used.",
    "The camera comes with a handy Power Manager feature that allows you to prioritize battery life by reducing the footage length and reducing the frequency of motion detection. Unfortunately, the battery isn’t swappable, so the Eufy SoloCam E40 will be out of action when it needs charging. It took around eight hours to fully recharge using the bundled USB cable.",
    "First reviewed: July 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Eufy SoloCam E40 price and availability",
    "9": "Design",
    "13": "Performance",
    "16": "App",
    "19": "Battery life",
    "21": "Don't buy it if..."
  },
  "links": {
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera"
  }
}