{
  "source": "https://www.techradar.com/reviews/ultenic-u11-cordless-vacuum-cleaner",
  "title": "Ultenic U11 cordless vacuum cleaner review",
  "category": "appliances",
  "updated": "2021-07-15T09:52:54Z",
  "author": "sean-cameron",
  "summary": "Big on extras, low on power",
  "verdict": "The Ultenic U11 is an affordable cordless vacuum that comes packed with extras and a charging base that can be placed anywhere in the home with ease. But with a real lack of power, only middling battery life and a poorly designed dust chamber it isn’t ready for prime time quite yet.",
  "pros": [
    "Lots of included extras",
    "Useful charging base",
    "Relatively quiet"
  ],
  "cons": [
    "Lacks power",
    "Middling battery life",
    "Inefficient at cleaning difficult surfaces"
  ],
  "article": [
    "From Miele to Dyson and more, a sea of seasoned brands currently dominate the cordless vacuum market, but this hasn't deterred Ultenic, a relatively new floorcare brand looking to make waves in the UK and US.",
    "The Ultenic U11 cordless vacuum is the brand’s top-of-the-range cordless model - it also offers robot vacuums too - and it hopes to give those rivals’ machines a run for their money. It has a 260w motor that can generate up to 25,000 pa of suction, and like most cordless vacuums, can be converted from a stick vacuum into a handheld device - it even comes with four tools, too.",
    "It’s got an LED touchscreen that can display the remaining runtime - in a nod to one of the best vacuum cleaners to date; the Dyson V15 Detect, and offers up to 55 minutes of cleaning time - which is the same as some cordless vacuums cleaners that are more than twice the price of the U11. On top of that, a free-standing charging base makes stowing the cleaner a breeze too.",
    "The Utenic U11 is enough for a bi-weekly run-through in order to keep things clean in a small home, but won’t suffice for those with more challenging needs, or situations. It will work well to complement a main plug-in model but simply isn’t ready to be the main vacuum cleaner in your home.",
    "The Ultenic U11 will set you back $219 / £199 (around AU$280) and is available in the US and UK from Amazon. It’s one of two vacuum cleaners offered by Ultenic; the U10 has slightly less suction power and doesn’t have an LED touchscreen but is slightly more affordable at $199.99 / £189.99.",
    "The Ultenic U11 is a compact cordless vacuum - weighing in at 2.2kg, it’s one of the lighter models on the market. It comes in a relatively anodyne shade of turquoise, managing to ape the look of a more expensive model quite convincingly.",
    "The U11 ships with four attachments, a cleaning head for using the device as a stick vacuum, and three additional tools designed for handheld mode. A charging base is also included, and whereas much of the competition requires a wall charging mount that is screwed in, the base of the U11 is free-standing and so can be placed anywhere.",
    "There are three power modes available, which can be selected using the responsive touchscreen on the top: Auto, Eco, and Turbo. The first purports to detect what surface it is cleaning and adjusts its intensity accordingly. Following on, the second prioritizes battery life while the last dials up the power to provide deeper cleaning. There’s also a Carpet Boost mode, designed for well, carpets, and a 0.14-gallon / 0.65-litre dust canister.",
    "As we’ve mentioned already, Ultenic says the battery will last up to 55 minutes between charges, but this is on the lowest power setting, and the battery can’t be swapped out for a fully-charged one as they can on other cordless vacuums.",
    "Cleaning across carpet and laminate, we found that to make any significant headway against dirt it was necessary to use the Ultenic U11 in Turbo mode. On lower power settings, we found the vacuum cleaner struggled to remove pet hair, especially when used on carpet. When it came to larger debris, food particles were sucked up successfully, but the challenge of plaster dust proved too much for the U11. It also struggled on thick-pile carpets too, even when Carpet Boost mode was activated.",
    "We also found the main motorized head doesn’t offer enough ‘spread’ in its dirt collection, and while it collected dust and debris in a direct line with the center of the head, easily, it required several passes to collect the dirt in line with the edges of the cleaning head.",
    "It was simple to construct the vacuum initially, and convert it into handheld mode, however, while the included manual makes the process of emptying the chamber seem quite simple, in practice the opposite is true. The components stick together, the door at the bottom is wont to fly open at a whim, and clearing the chamber fully takes longer than might reasonably be expected.",
    "As we’ve mentioned, Ultenic claims the battery will last up to 55 minutes on the lowest-power setting, which we found to be true. However on Turbo mode it lasted just 13 minutes, and considering on test we found Turbo mode was a must, its clear this vacuum will need regular recharging. It took more than two hours to fully recharge the battery using the bundled charger, too.",
    "While we found the LED screen on top of the vacuum handy for seeing how much runtime was left, we were disappointed the battery wasn’t swappable, so you could reduce interruptions to cleaning session by replacing an empty battery with an additional fully-charged battery, a function other cordless vacuums offer.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "4": "Ultenic U11 cordless vacuum cleaner price and availability",
    "5": "Design",
    "9": "Performance",
    "12": "Battery life",
    "14": "Don't buy it if..."
  },
  "links": {
    "robot vacuums": "https://www.techradar.com/news/best-robot-vacuums",
    "cordless vacuums": "https://www.techradar.com/news/best-cordless-vacuum-cleaner",
    "best vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners",
    "Dyson V15 Detect": "https://www.techradar.com/reviews/dyson-v15-detect-absolute",
    "s": "https://www.techradar.com/news/best-cordless-vacuum-cleaner"
  }
}