{
  "source": "https://www.techradar.com/reviews/folder-lock-version-7",
  "title": "Folder Lock version 7 review",
  "category": "computing",
  "updated": "2021-11-08T08:53:44Z",
  "author": "mark-pickavance",
  "summary": "A prescription for encryption",
  "verdict": "Simple to use and deploy encryption tool that relies on hiding files from prying eyes as much as encryption to protect sensitive documents. Sadly, it transgresses many security standards by making the serial number a master password.",
  "pros": [
    "Trial version",
    "Easy to use",
    "USB Locker distribution"
  ],
  "cons": [
    "Lax password enforcement",
    "Files and Folders are hidden, not encrypted",
    "Lacks 2FA security"
  ],
  "article": [
    "Given the number of people who earn a living hacking and making money from the files they discover while doing that, we should all take the protection of our private data much more seriously.",
    "An approach where you cross your fingers or convince yourself that nothing you have is worth the effort to take it might suffice, but at some point, almost inevitably, your computer will be compromised, and you will wish that you had taken more care of its contents.",
    "Folder lock is software designed to let even a non-technical user take control of files and folders on their system, and even USB key stored content, and secure it from those that might want access with nefarious intent.",
    "It’s relatively inexpensive, you get minor updates included in that price, and there isn’t a subscription required for most of the functionality it includes.",
    "Is Folder Lock the answer to your security concerns or just another making money from facilities you inherently have?",
    "The standard price of a Folder Lock licence is $49.95, but at the time of writing, it can be purchased for just $39.95. A single-user license allows you to use Folder Lock on only one computer, requiring an additional license for each one that you intend to use it on.",
    "Some basic functionality is available in the trial version, but to get all the functionality that Folder Lock offers requires a license.",
    "Beyond this purchase, to use the Secure Backup functionality need a monthly subscription defined by the amount of storage needed. These monthly costs start at $5 for 10GB, and progress to $10 for 20GB, $20 for 50GB, $30 for 100GB, $60 for 200GB, $100 for 500GB, $200 for 1TB, and $400 for 2TB, making it one of the more expensive cloud storage facilities.",
    "What’s excellent about Folder Lock is that you can get it installed and working in a remarkably small about of time. And, once the application is on your system, it can lock files and folders easily.",
    "But protecting sensitive data isn’t the only trick that Folder Lock can perform. It can also secure those files to the Cloud or to a secure USB key, manage Password Wallets and Shred files. And, it also offers some housekeeping functionality to erase the Windows paper-trail of temporary files and usage history.",
    "File security is provided in two distinct approaches, one where the items are locked in place and another where you drag them to a managed Locker where they are encrypted.",
    "The functionality that most will use for convenience is Lock Folders, where you can drag files and folders to the application and apply password protection to them in the application.",
    "In this mode, the file or folder doesn’t move from where it usually lives. Instead, while a lock is active, it temporarily disappears, only to reappear when you choose.",
    "If you then decide the contents no longer needs security, you can unlock an item, and it will return to the normal status and location.",
    "The alternative protection method is the Locker, where files and folders reside to a virtual encrypted drive, and to access them can be controlled by opening the Locker.",
    "This solution is helpful if you want to centralise all your sensitive files in one folder structure, though this might not work for those files that need to exist in specific places on your system.",
    "Working alongside the Locker encryption model is Secure Backup, a service to copy the encrypted drives to the Cloud. From the Secure Backup online storage, they can be recovered following a system theft or hardware failure.",
    "A free monthly trial where 100GB of space is included is available, and the cost of this facility is based on the amount of space you need, scaling up to Terabytes. However, if you were expecting Secure Backup Cloud storage to cost the same as it might from Google, Microsoft, or Amazon, then you will be disappointed.",
    "For comparison, Microsoft charges $99.99 per year for Microsoft 365 Family, including Office 365 for six installations and 1TB of online storage backup, almost the exact cost as 500GB of capacity for one month on Secure Backup.",
    "Lockers can also travel away from the host system using a USB storage device, though curiously, you can drag files from external storage to be Lock Folder encrypted.",
    "The protected USB functionality bundles a locker onto a USB drive with sufficient software to unlock it on a system that doesn’t have the main application installed.",
    "This feature might seem an obvious extension to the platform, but it is probably the best means to keep sensitive files secure but allow them to be easily transported. And you don’t specifically need a drive that supports any special security or hardware encryption technology. The limitation of the Folder Lock USB technology is that to use the flash drive requires a PC, as the software is specific to Windows-based computers.",
    "The first question that most would ask about Folder Lock is how secure it is?",
    "Our answer to that is complicated. No system is entirely secure, and the level of security in this product is more about the customer expectations than concrete security standards.",
    "The people that created this tool were very focused on making it easy to use and not confusing the customers, possibly to the detriment of the security side of this equation.",
    "For starters, files and folders locked by the software aren’t encrypted. As an alternative, they’re cleverly hidden from Windows using kernel-level filtering. Alongside this sleight-of-hand, the software also offers a stealth mode, so anyone searching through the computer won’t easily find it or any of the files or folders that have been locked. Or, that’s the theory.",
    "The snag, if you didn’t guess already, is that this invisibility will also stop a backup application from seeing those structures to copy them unless you disable Folder Lock before initiating a backup.",
    "As a rule, a truly secure solution would involve both hiding the content and protecting it through encryption, but Folder Lock only offers the first mechanism using Lock Folder mode.",
    "The more secure technology is offered by the Lockers, as this option does encrypt the content and not just hide it. Better than the Lock Folders, encrypted files can’t be accessed without a password. Each Locker can be given a unique password, but a single master password can unlock any locked files or encrypted Lockers.",
    "In some security products, if you forget that master password, you would be out of luck, but with Folder Lock, you can use the license serial number as the master password.",
    "That doesn’t sound overly secure, and that there isn’t a two-factor authorisation mechanism is also a bit disappointing. In our testing, it also accepted some poor passwords as acceptable, like ‘PasswordPassword’. That it doesn’t insist on special characters and allows repeated words make it far from being impenetrable.",
    "In this respect, we’d classify Folder Lock 7 as suitable for home users, but insufficiently secure for business customers.",
    "Performance ranged from excellent to being somewhat sluggish, depending on what we tried to do. Our general perception is that if you compared a local desktop system with the same amount of processing cores and RAM, then it would be quicker than the virtual session. Therefore, you might want to allocate a reasonable virtual machine from the outset and then enhance it if the performance isn’t acceptable.",
    "Where this solution is slightly disappointing is how long it can take for the instance to be rebooted and its occasional petulance in disconnecting if it deems the connection isn’t optimal. Developers working on code that can crash their OS will probably find the downtime between resets too much, and ill-timed disconnections are always unwelcome.",
    "What’s all missing here is the ability to pool desktop solutions for workers in multiple time zones and to have temporary instances for those that come to work for short periods or occasionally. And, that lack of flexibility is indicative of Amazon starting with AWS and wondering how it can best monetise it, rather than starting with a virtual desktop solution and then making it work with AWS.",
    "The Elephant in this locked and encrypted room is that if you have a Windows 10 Professional or Enterprise license, then inherently, that includes a file and folder encryption tool. It’s called Encrypting File System (EFS), and you can get to that functionality through File Explorer.",
    "That said, Microsoft doesn’t have an admirable record of accomplishment on security, and EFS only works on drives formatted with NTFS. Move a file or folder from an EFS location onto a FAT32 file system, as an example, and it will be decrypted in the process.",
    "Therefore, the solution offered by File Locks is significantly easier to understand and able to handle moving files between file systems without unexpected and unwelcome side effects.",
    "It also includes other technology than folder encryption, so the two aren’t equivalent.",
    "One issue with File Folder is the licensing model it uses, as the cost only covers a single user on one computer. That’s exclusively a Windows machine since the application isn’t available for Apple Mac or Linux.",
    "Many users have multiple systems, and therefore if you want to cover all this equipment with this functionality Folder Locker could become a significant investment. The cost of Secure Backup to the Cloud is high, especially if you’ve more than just a few gigabytes of data to keep safe.",
    "Where the strength of the solution lies is in how easy it is to use and understand, making it good for those who don’t have a deep understanding of computers and encryption.",
    "But, without better password protocols, 2FA and taking away the safety net of a license-number master password, it isn’t as secure as it potentially could be."
  ],
  "headers": {
    "5": "Price",
    "8": "Features",
    "22": "Security",
    "35": "Final verdict"
  },
  "links": {}
}