{
  "source": "https://www.techradar.com/reviews/taxact",
  "title": "TaxAct review",
  "category": "computing",
  "updated": "2021-01-11T23:31:39Z",
  "author": "rob-clymo",
  "summary": "Call on TaxAct to get you through tax filing time",
  "verdict": "TaxAct has done a decent job uprating its latest edition that comes with improved features and functions that help to make it a little more appealing.",
  "pros": [
    "Improved integration",
    "Live tax advice option",
    "Handy dip in and out setup",
    "New Xpert Help option"
  ],
  "cons": [
    "Less ideal for complex affairs",
    "You’ll need to pay for better features",
    "Help pages patchy in places",
    "Support is adequate"
  ],
  "article": [
    "TaxAct, like all of the other tax filing software packages, has been updated to reflect the challenging times we all face during the coronavirus crisis. The online tax solution packs in several enhancements for this year that take into account the likes of stimulus payments and there are improved tools for speeding up the time it takes to complete tax returns.",
    "Perhaps more importantly, given just how many people are struggling currently, TaxAct aims to remain competitively priced for anyone filing a federal return, which is always going to be welcome news. There are also plans to add one-on-one help with TaxAct Xpert Help, which isn’t quite live as of yet but is due for implementation shortly.",
    "Being an online software solution it follows a similar path to others in the field including TaxSlayer, Jackson Hewitt Online, Credit Karma Tax and FreeTaxUSA, with a step-by-step series of screens that walk you through the hurdles for filing your taxes.",
    "TaxAct has done a sterling job of late too, with plenty of refinements that make the whole process as painless as is realistically possible. If you’re a novice user you’ll still be able to make solid progress in not much time, which is clearly a boon for those of us who procrastinate when it comes to tax return time.",
    "As is the case with any tax filing software package, price is everything. Little wonder then that TaxAct has moved to make its pricing look more appealing in light of the competition, although package prices have actually increased. On top of that, the Premier and Self-Employed options don’t include live agent support from CPAs or other tax experts, although this will be tempered by the rollout of TaxAct’s Xpert Help service in due course.",
    "The TaxAct website gets you off to a great start in that it lets you select various scenarios such as if you have children, have retirement income and investments too. There are the more obvious considerations too, with the free W-2 jobholders edition (State included) proving ideal if you’ve got fairly basic requirements. The free version also covers filers with dependents and if you have college expenses or retirement income to declare.",
    "Next up, the Deluxe package costs $29.95 (+ $39.95 per state filed) delivers everything in the free edition plus more besides. It’s ideally suited to homeowners plus those with deductions, credits and adjustments to file. The Premier model comes in at $39.95 (+ $39.95 per state filed), which includes everything in Deluxe with added features for investments, rental property and prioritized support. Top of the tree is the Self-Employed package, which for $74.95 (+ $49.95 per state filed) adds on Deduction Maximizer and year-round tax resources.",
    "Changes have been implemented on the TaxAct feature front for 2021, with improved integration, better workflow and the capacity for importing data directly into the application. This is particularly useful in the case of 1099 forms, but the same goes for W-2’s and 1099-NEC’s too. As before, TaxAct still allows you to enter business income, rental/royalty income and, basically any other income that is relevant to completing your return in a timely and accurate fashion.",
    "However, while the basic edition is free and offers support for 1040 and retirement income with state returns being gratis, you’ll need to pay for the more powerful feature set editions. Getting the paid for version of TaxAct will arm you with more options, but it can be a little tricky to squeeze the best out of the system, particularly if your tax situation is less than pedestrian.",
    "One of the criticisms of earlier incarnations of TaxAct was that the filing software was a little too hard to get your head around. However, the TaxAct developers have taken this on board and the latest edition has had some improvements made in terms of usability. Navigation is snappier, with less faff involved than with previous editions and users can pick through stages much more swiftly than the clunkier way things worked before.",
    "Boosting the user-friendly appeal is the way it is now easy to import forms, such as W-2, 1099 and 1099-NEC’s. Indeed, you can also add in tax returns from earlier years, which makes much lighter work of the overall filing process. Granted, TaxAct still can't be described as a doddle to navigate, and there are still some clunky aspects to the experience. Nevertheless, TaxAct is on the up in terms of ease of use.",
    "While some of the questioning might prove a little more trying for the less confident, there is also a decent level of help along the way that allows you to master the nuances of TaxAct. Given that the design setup is basically screen after screen, TaxAct has done quite a nice job of making the process workmanlike but, dare we say it, quite good on the eyes too.",
    "Mention should also be made of the app version, which can work hand-in-hand with the desktop edition so you can switch between the two as and when time allows it.",
    "Along with numerous other improvements, TaxAct has been spruced up in the support department too. Users should lookout for handy videos that offer pointers into getting the best from key areas of the tax filing software. In fact, TaxAct’s knowledge base area has definitely improved and its pro-level tips come in mighty handy as you work your way through the various stages.",
    "Due to some of the clunkier areas of TaxAct we think that it’s entirely likely you’ll need to call upon the help that’s available within this package. That’s not to sell TaxAct short of course as it’s a potent performer but you might need assistance to get to the final return stage.",
    "Enter then the TaxAct Answer Center, which is a very comprehensive area of the site that has multiple topics that will answer many of your questions and queries. The other benefit with TaxAct is that it has a constant Help and Tools area over on the right side of the page while you work.",
    "Quick and easy access is therefore just a click away. Email support is available across the different editions, while phone support is also on hand towards the filing deadline, details of which can be found on the TaxAct website.",
    "TaxAct has had a much needed dust down and the designers have clearly been hard at work making improvements where needed for 2021. While we’re yet to see first hand what the Xpert Help option brings to the table, or indeed how much it’ll cost, the rest of the modifications to TaxAct have beefed up its appeal.",
    "While there’s clearly a ways to go in terms of the tax filing package as a whole, the overall feeling generated from the newest edition of TaxAct is a positive one. That said, it’s up against the low budget FreeTaxUSA and H&R Block at the other end of the spectrum, plus a host of other tax filing software inbetween.",
    "Nevertheless, the interface and usability have both been tweaked to work better for a variety of different subscribers using it in 2021, so the benefits are clear to see. Plus, TaxAct has also been given a once over to bring it bang up to date in light of coronavirus and the resulting changes to legislation. Tax reforms can be difficult to keep up with, so it’s reassuring to know that the TaxAct team have that base covered."
  ],
  "headers": {
    "4": "Pricing",
    "7": "Features",
    "9": "Ease of use",
    "13": "Support",
    "17": "Final verdict"
  },
  "links": {
    "TaxAct": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1231037866751630000/https://www.taxact.com",
    "tax filing software": "https://www.techradar.com/best/best-tax-software",
    "online software": "https://www.techradar.com/best/small-business-tax-software",
    "TaxSlayer": "https://www.techradar.com/reviews/taxslayer",
    "Jackson Hewitt Online": "https://www.techradar.com/reviews/jackson-hewitt-online",
    "Credit Karma Tax": "https://www.techradar.com/reviews/credit-karma-tax",
    "FreeTaxUSA": "https://www.techradar.com/reviews/freetaxusa",
    "filing your taxes": "https://www.techradar.com/news/6-top-tips-for-filing-your-taxes-online",
    "tax return": "https://www.techradar.com/best/small-business-tax-software/best/best-tax-software",
    "TaxAct website": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5172919167415140000/https://www.taxact.com/?promo=HT010521VA",
    "Deluxe package": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7926295398623684000/https://www.taxact.com/?promo=HT010521VA",
    "Premier model": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1275629972358276600/https://www.taxact.com/?promo=HT010521VA",
    "Self-Employed package": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1186058821616586000/https://www.taxact.com/?promo=HT010521VA",
    "H&R Block": "https://www.techradar.com/reviews/handr-block"
  }
}