{
  "source": "https://www.techradar.com/reviews/apple-watch-5-review",
  "title": "Apple Watch 5 review",
  "category": "wearables",
  "updated": "2021-06-07T23:47:31Z",
  "author": "gareth-beavis",
  "summary": "The new always-on display impresses, but not much else",
  "verdict": "The Apple Watch 5 is a premium smartwatch, but one that doesn't offer a huge upgrade over the Watch 4, apart from the very welcome always-on display. It hasn't risen in price, and there's more storage on offer – but many will find the cheaper Apple Watch 3 a more attractive device.",
  "pros": [
    "Always-on display",
    "More storage",
    "WatchOS 6 brings decent upgrades"
  ],
  "cons": [
    "Too similar to Apple Watch 4",
    "Battery life poorer",
    "Always-on display too bright at night"
  ],
  "article": [
    "The Apple Watch 5 is no longer the latest Apple Watch, that honor goes to the Apple Watch 6 (and the cheaper Apple Watch SE). So if you're looking for Apple's top-end smartwatch, this isn't it anymore - to see how it compares to the new model, check out our Apple Watch 6 vs Apple Watch 5 article.",
    "Not only is this no longer the newest Apple Watch, but on paper the Apple Watch 5 was one of the most underwhelming upgrades Apple had ever unveiled. It’s essentially the Watch 4 – one of our best smartwatches, admittedly – with a compass, more cellular bands to call emergency services worldwide (a noble achievement, if not something people will rip it off the shelves for) and not much more.",
    "Oh – except the screen now never switches off, dimming to an ambient, always-on display when you’re not raising it to look straight at it. Apple has fixed one of the biggest bugbears about its smartwatch, and that’s by far the biggest feature of this newer device.",
    "The always-on display is really useful, and we quickly got used to glancing at the Watch to see the time. It’s actually a little too bright, as in dark conditions it glows rather alarmingly – so we found ourselves turning off the always-on feature regularly.",
    "Update: watchOS 8 was announced at WWDC 2021, bringing more software and features when it fully launches later this year. Eager fans can get the developer preview now if they're part of the developer program, or join the public beta in July.",
    "The Watch 5 design is exactly the same as the previous year’s model, which isn’t unexpected given that 2018 saw a big overhaul. Ceramic and titanium options now join the 40mm and 44mm Watch range (for different wrist sizes) and they look pretty sweet, although they do command a premium price.",
    "The fitness capabilities of the Watch 5 haven’t been improved, but it’s still a terrific health tracker: the heart rate monitor is accurate, an ECG feature offers further heart health monitoring, and the onboard GPS is pretty accurate (although not quite as high-performing as on dedicated running watches).",
    "You can swim, do high-intensity interval training, cycle and even practice yoga with the Watch 5 to fill up those all-important rings that monitor your daily active performance. However, this is all true of the slightly-smaller Watch 3, which is cheaper and still being sold by Apple.",
    "The music and podcast playback of the Watch 5 is strong, and with 32GB of space on board (an upgrade from 16GB last year) you can load up more Apple Music tunes or download more podcasts – although getting content onto the Watch can still be a struggle.",
    "WatchOS 7 brings some cool new features, with a noise meter and cycle tracking for women among our favorites: you can protect your hearing and get better period and fertility predictions right from the wrist, with both features feeling slick, and useful in a smartwatch.",
    "We’re not huge fans of the new App Store on the Watch though, as it seems like the screen is still too small to access the portal properly.",
    "Battery life is the biggest issue we encountered on the Watch 5, with the always-on display pulling more life out of the smartwatch. The Watch 4 could easily make it past 24 hours, but the Watch 5 struggles to match that, and we were definitely reaching for the charger more regularly here.",
    "Given that the Watch 4 is off-sale, the Watch 5 is simply an upgrade, with more storage, a compass and an always-on display… turn that off and it’s just a slightly-updated smartwatch for 2019.",
    "We found that it still excelled in some areas, and it's another hugely competent device for your wrist, but the Apple Watch 5 still feels like an underwhelming upgrade, and we’d point you towards the now reasonably-priced Watch 3 as a great alternative.",
    "The Apple Watch 5 was introduced alongside the iPhone 11 range on September 10, 2020 and it's on sale now around the world. It costs $399 / £399 / AU$649 for the GPS-only model in the smaller 40mm size. The 44mm size costs a bit more, at $429 / £429 / AU$699.",
    "The 40mm cellular model starts at $499 / £499 / AU$799, and goes up to $529 / £529 / AU$849 for the 44mm size. Most people won't need the LTE version if they're always carrying their iPhone with them, but the larger 44mm size usually nets you better battery life, and offers larger touch points on the slightly bigger screen.",
    "The Apple Watch 5 starting price is for the aluminum case, which comes in three familiar finishes: Gold, Space Black, and Silver. One new perk is that this year's case is made of 100% recycled aluminum.",
    "You can also pick it up in stainless steel for a higher price – $699 with a sport loop or sport band, $749 with a Milanese loop, or $799 with a leather loop. The all-new titanium Apple Watch 5, in light and dark finishes, starts at $799 with a sport loop and goes up to $899 with a leather loop.",
    "The Watch will once again come in a white Ceramic finish, starting at $1,299 with a sport loop and going up to $1,399 with a leather loop.",
    "All that said, with the launch of the Apple Watch 6, the company has discontinued the Watch 5 - that said, you can still get it from third-party retailers, theoretically for the prices above, though we'd expect to see it getting discounted soon.",
    "Let’s get something out of the way right now: the always-on display rocks. It’s a brilliant upgrade from Apple, and it’s been well thought-out in a number of ways.",
    "It’ll take owners of previous-gen Watches about five minutes to go from automatically raising / flicking their wrist to activate the screen to expecting to see the time when their eyes just wander down to their Apple Watch 5.",
    "This ease of transition is because that’s how we all know a watch is supposed to be used: you look at it, you see the time. That’s what the Watch now offers, and it means that rather than you having to rely on muscle memory it works like a regular watch when you want to, you know, see the time.",
    "Apple should have taken this a little further though – the display dims when not in use, but not enough. If you’re in a darker environment the Watch 5 still shines like a beacon on your wrist – and if you want to wear it at night then it’s highly distracting.",
    "We found ourselves activating Cinema Mode in darker conditions – Apple should have added an ultra-low brightness mode, something akin to the luminescent watch hands on some regular watches – easily visible to others, but not distracting. This would have saved power, too.",
    "Apple talked up the new low-temperature polycrystalline oxide (LTPO) technology used in the Apple Watch 5 as the reason it could make the device run for longer – when actually it’s the same tech used in last year’s OLED display from the Apple Watch 4.",
    "While the Apple Watch 5 has new display drivers and an improved light sensor to allow the screen to dim more efficiently and preserve battery, we can’t help but feel that this could have been done on the Watch 4. Was Apple holding off from unveiling this tech until 2019 so it could provide an upgrade to its smartwatch range, or did it need the extra 12 months to develop the necessary components to make it work?",
    "Either way, the use of LTPO means one thing: the Apple Watch 5 can go from a fast, 60Hz refresh rate (where the refreshes at 60 frames per second) down to just 1Hz, where it will only change every second.",
    "The tricky thing for smartwatch manufacturers is to make a display that can alter this dynamically, switching refresh rate seamlessly depending on the situation – and Apple’s managed that well. Going from ‘dim‘ to ‘full’ mode is instantaneous, and the raise-to-wake functionality is as fluid as ever.",
    "However, there is one issue: this always-on functionality isn’t available with every app. Every watch face will brighten and dim accordingly, and during a workout using Apple’s dedicated app the Watch 5 won’t turn off – which is brilliant when you’re running fast or trying to do a plank or press-up.",
    "But, beyond the home screen or workout app, the always-on display will just blur out what’s underneath and place a boring digital clock on the screen.",
    "This even includes Apple’s own apps, like timers. We’d have liked to see Apple improve all the relevant apps on the Watch to work with the ambient mode – and enable developers to integrate this functionality into their apps too.",
    "That last point is particularly infuriating in the case of apps like Strava, which many people use to get more functionality out of their Watch, and it means the always-on display isn’t as fully implemented as some might have hoped.",
    "We’d have understood if the apps hadn’t been adapted yet, but to learn that no such updates are on the horizon is pretty disappointing. Apple says the situation will be reviewed as time goes on, and we can see Apple announcing new ‘ambient’ modes for its own apps in new updates, but it’s going to be a while before third-party developers are able to get on board – if they ever can.",
    "It’s hard to say anything new at all about the design of the Apple Watch 5 because it’s so similar to how the range has looked since its inception (the larger screen launched last year notwithstanding).",
    "You’re getting the same curved aluminum frame (in the base Watch model) around the outside, a square display, and the Digital Crown – a button you can twiddle or press to scroll through menus or access other functions – on the side.",
    "Below that a lozenge-shaped button allows you to see your most recent apps, as well as activate Apple Pay so you can buy things without needing to whip out your wallet or purse (or phone).",
    "The design has quickly become iconic, fusing the bright and colorful OLED display with the shiny frame – and this year, ceramic and titanium options will be added to the mix if you fancy paying a little more for a premium finish.",
    "While it’s coming to most of the Apple Watch range, WatchOS 6 shines brightest on the latest model, and the Apple Watch 5 uses its new features well That said, these features will be landing on the older Watches as well, meaning that if you’re simply buying a Watch for fitness use – and if you can take or leave the new always-on display – you’d be well served by the Watch 4, or even the Watch 3, which remains on sale from Apple.",
    "There are a few new features that the OS brings, beyond little design tweaks (the Now Playing screen that controls your phone’s music is clearer and more feature-rich, and the Walkie-Talkie mode now tells you to press and hold the yellow circle to talk, as clearly that was confusing some people), and they do add more to the Watch’s functionality.",
    "One of the new features, Activity Trends, requires you to use the watch for at least 90 days before it can track what you're up to – it did pull in some historical data, but it was scattered and inaccurate. When it’s working, though, these trends will tell you whether you’re getting faster, fitter, doing more stair climbing… essentially the trends of your activity.",
    "Noise meter",
    "Something we do like – a lot – is the noise meter that’s now built into the watch. Wearing this all the time means you’re constantly tracking the ambient noise around you – a protection system for your hearing.",
    "You can set up notifications to let you know if you’re in an environment that’s too noisy, although we rarely noticed these when they came through.",
    "What’s of more use is seeing in the app how your day-to-day environment is affecting your hearing, whether you’re in noise environments too much. We’re already being told we’re in places that are too noisy regularly, but it’s hard to work out where – so perhaps monitoring the watch a little more would make sense.",
    "Cycle tracking",
    "This new feature added to the Watch comes directly from the health app, where women can set up notifications on when their period is likely to start, or monitor fertility windows.",
    "It’s one of those apps that’s perfect for the smartwatch, as you can easily enter when your period begins, whether you’ve noticed spotting, any symptoms you’ve experienced – all being used to build a predicted picture of when your period is likely to start.",
    "The interface is simple on the Watch 5, with the stylish icon allowing you to tap when your period begins, and each day it continues, with options to monitor whether it’s light, medium or heavy. A simple tap is all it takes, which is far more convenient than having to drag your phone out each time.",
    "You can even log sexual activity to help you monitor possible fertility – while the main benefit is the information displayed in a larger way on the iPhone health app, it’s a nice addition to the watch to help make sure you can log the key information easily.",
    "App store",
    "Being able to download apps right to the Watch is neat; for the most effective searches you’ll want to use your voice, rather than drawing the letters one by one using the Scribble input option.",
    "Downloads happen fairly quickly, although you’ll need to have your iPhone handy to log in to your Apple ID, unless, again, you want to draw every letter with your finger. (Doing this actually caused our Apple Watch 5 to crash momentarily, although it was back up and running in a few seconds).",
    "Scrolling through the available apps is fun for a moment, but you'll soon decide that this is something you’d rather do on the phone. Except… you can’t. The App Store is now locked to the Watch, and can't be accessed on your phone’s larger screen.",
    "On top of that, some apps will need the main app installed on the phone anyway in order to function, so having the App Store on the small Watch screen doesn’t currently seem all that useful.",
    "The Apple Watch 5 has received precisely zero upgrades to its fitness capabilities in terms of hardware, so the GPS, heart rate monitor and accelerometer (to track your steps) inside are exactly the same as in the Apple Watch 4.",
    "There is one small hardware upgrade here – there’s now a compass inside the Watch, which allows you to see which way you’re going, and which uses GPS to work out your elevation, or height above sea level.",
    "While this will be a good feature for hikers – we did notice that the compass was slick, and seemed effective at finding true north – it’s not something we used very often, and trying it with apps like Night Sky, which uses the compass to navigate around, didn’t feel like much more than a novelty.",
    "What would be great is if this feature were added into a ‘home beacon’ option on the Apple Watch, so that if you get lost it tells you which direction to follow back to where you started (which would be useful if you don’t have your phone on you, or don't have a data connection).",
    "However, while there aren’t any strong fitness upgrades with the Watch 5 (well, none at all, actually) it’s still a great watch for those who are into exercising.",
    "We tested a few different activities over the course of our review, and generally we found everything to work as advertised. Taking the watch on four runs, we saw that the GPS was pretty accurate (around 0.03 miles out from our calibrated Garmin watch) and the heart rate monitor was strong enough to pick up our heart rate with relative accuracy, including during sprint sessions.",
    "During swimming, things were equally useful – counting the lengths and distance we’d covered was pretty accurate, although annoyingly the Watch told us that we were always doing breast-stroke when it was clearly front crawl.",
    "The one thing that’s missing from the mix is sleep tracking. Apple says this isn't an issue, as there are a bunch of third-party apps that can perform this function, but come on... having an integrated app would be far better.",
    "If Apple could extend the battery life beyond the 18 hours it’s advertising to something approaching 2-3 days, that could easily allow for sleep tracking and help to provide a more holistic view of your health.",
    "Knowing how many zzz’s you caught would give better context to your heart rhythm info, and allow for better fitness motivation at the right times – Apple is clearly hell-bent on making the best health and fitness watch out there, but it’s still got a way to go before it’s got all the necessary elements in place.",
    "Battery life is one of the key things we’re interested in on the new Apple Watch, simply because is has to be worse, right? The display is always on, so that must mean the battery takes a hammering?",
    "We know we sound like we’re setting this up to say \"No, it was actually better!\" but in fact the battery life on the Watch 5 isn’t as good as we found on the previous iterations.",
    "Where before we could make it to the evening, around 9-10pm, with 50% left, here we’d more often have around 5% less than that, with 40-45% in the tank.",
    "While that is worse, it’s not dramatically so – Apple has only ever claimed 18 hours of use from a full charge, and while it’s progressively extended the battery life with each new model, the latest Apple Watch will still crest 18 hours, even when you're running the battery down by exercising and using GPS.",
    "That doesn’t mean we’re impressed with the battery life at all – a day’s use is par for the course for most rivals, and given that a lot of those rivals are compatible with the iPhone, Apple really needs to step up and find a way to get 2-3-day battery life out of its smartwatch.",
    "The Apple Watch 5 certainly hasn’t got the stamina of the Watch 4, which is clearly down to the always-on display. We estimate that this draws about 2% power per hour, which means you’ve lost close to 50% over a 24-hour period before you’ve even started using the Watch.",
    "That said, going for a run while listening to music and using the GPS tracking on your Apple Watch is one of the most battery-draining things you can do – and yet here we found the Apple Watch 5 was slightly more efficient.",
    "Pounding the parks for an hour while listening to some mesmerizing tunes downloaded to the Watch 5 drew 20% power, with the display on the whole time, yet last year the Apple Watch 4 dropped 22% – even taking into account some slight fluctuations in the numbers, we expected a far worse performance from the new Watch.",
    "This suggests that Apple has optimized the Watch 5 better for exercise and GPS use – and being able to glance at a workout on the go was certainly handy.",
    "We mentioned music just now, and that’s another key area where the Watch 5 has been improved – you can download tunes and podcasts to your device and listen to them without a phone.",
    "To really make use of this feature, though, you need to activate the LTE data capabilities inside the phone (if you buy the more expensive Watch 5 variant), and this will cost more per month.",
    "However, if you can afford it, we suggest you do so, as it means you can listen to all manner of music through Apple Music or the included Radio app; without data on the Watch you can only listen to downloaded content, which is rather limiting.",
    "It’s also hard to sync things to your Watch – you need to have it on charge and have your phone nearby, and even then there feels like an element of hoping about the situation.",
    "Too often we’d go out on a run without our phone, listening to a new podcast, and we'd find that it started playing just fine, but when we got out of range of our phone we'd realize we hadn't downloaded it – and it’s hard to check what's actually saved on the Watch. It’s just not a simple system, and it really should be improved.",
    "First reviewed: September 2019"
  ],
  "headers": {
    "0": "Two-minute review",
    "14": "Apple Watch 5 release date and price",
    "20": "Always-on display and design",
    "38": "WatchOS 6",
    "55": "Fitness and a new compass",
    "65": "Battery, music and podcasts",
    "79": "Don’t buy it if..."
  },
  "links": {
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Apple Watch 6 vs Apple Watch 5": "https://www.techradar.com/news/apple-watch-6-vs-apple-watch-5",
    "Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "WatchOS 7": "https://www.techradar.com/news/watchos-74-news",
    "Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "OLED": "https://www.techradar.com/news/oled-vs-qled",
    "phone": "https://www.techradar.com/news/phone-and-communications/mobile-phones/20-best-mobile-phones-in-the-world-today-1092343",
    "Garmin watch": "https://www.techradar.com/best/garmin-watch"
  }
}