{
  "source": "https://www.techradar.com/reviews/hp-officejet-8012e8010e-inkjet-all-in-one-printer",
  "title": "HP OfficeJet 8012e/8010e all-in-one printer review",
  "category": "computing",
  "updated": "2021-09-20T07:00:17Z",
  "author": "jim-hill",
  "summary": "Affordable all-in-one with added HP+",
  "verdict": "An inexpensive inkjet all-in-one with a decent touchscreen and ADF, but it’s a little light on features and in-box ink.",
  "pros": [
    "HP+ eligible",
    "35-sheet ADF",
    "Strong app support",
    "Tilting touchscreen"
  ],
  "cons": [
    "Not much ink in the box",
    "No multipurpose tray",
    "Single-side scan",
    "Cannot scan offline"
  ],
  "article": [
    "The latest additions to HP’s range of affordable office all-in-one printers come with a free trial of HP+ which adds functionality and discounted consumables sent in the mail when you sign up. It’s a useful service that gives this budget model an edge in the competitive home office or small business category. We’ll call it the HP OfficeJet 8012e in this review, but our American friends will know it as the HP OfficeJet 8010e.",
    "At around £113 (US$155, AU$210) the HP OfficeJet 8012e comes with a generous set of features including a 35-sheet ADF (automatic document feeder), self-healing Wi-Fi, a tilting touchscreen interface and the ability to print on any kind of paper up to A4 in size. It’s not especially fast at printing and it lacks a multipurpose paper tray, but HP recommends it for use in a shared workgroup of up to five people and suggests a hefty maximum monthly duty cycle of 20,000 pages. It’s worth pointing out though that you only get enough ink in the stingy starter cartridges for 225 mono pages or 270 in colour.",
    "HP has a bewildering array of multifunction OfficeJet printers that all look much like this and the differences in design and functionality are subtle. The seemingly identical HP OfficeJet Pro 9015e/9010e is slightly larger, has several more ports and you access the ink cartridges through the front flap.",
    "Here you have to open the front flap and then lever open the printer to insert the cartridges.",
    "It’s quite a smart and functional design, though it’s not especially compact and the plastic panels feel quite wobbly and insubstantial. Apparently 15% of the plastic is recycled so it can forgiven the wobbliness, but 15% doesn’t sound like very much. We noted that this printer’s packaging was made of polystyrene rather than recyclable cardboard and included a lot of unnecessary plastic. At least HP is recycling the ink cartridges, so long as you sign up for an instant ink subscription and send them back.",
    "The main paper tray ejects awkwardly and it only holds 225 sheets of A4. There’s no multifunction paper tray or a front USB Host port and it feels as though the build quality here is being squeezed in order to meet that aggressive price point.",
    "We were impressed to see a 35-page ADF included though, and it performed perfectly well during the test.",
    "The HP OfficeJet 8012e is a 3-in1, which is to say it can print, scan and copy. There’s no phone line input for faxing although it can send a fax via your smartphone. It has a 35-sheet ADF for scheduled single side copying. It cannot dual scan, but it can of course duplex print automatically. The quoted speed is 18ipm in mono and 10ipm in colour. It is equipped with 1,760 nozzles in its four print heads which can print at a maximum resolution is 4,800 x 1,200 dpi when optimised for colour photos or documents.",
    "Wi-Fi is built in with Wi-Fi Direct, AirPrint and Mopria compatibility. There’s a USB port at the back if you prefer to use a data cable (not supplied), but no USB Host port. The tilting touchscreen looks the same as that of the HP OfficeJet Pro 9015e/9010e but it is smaller at 5.6cm and not colour. The processor is 1.2GHz with 256 MB of memory.",
    "There’s room for 225 sheets of paper in the main tray, which is reasonable, but without an additional multipurpose tray, which most all-in-ones tend to offer, you will have to reload the tray every time you want to print on a different kind of media. It can handle anything from 4x6 photo paper and envelopes to thick A4 paper with a maximum weight of 280g/m2.",
    "To set up the HP OfficeJet 8012e, you simply need to plug it in and follow the on-screen prompts that show you how to install the four ink cartridges.",
    "Once you’ve loaded some paper, the printer will suggest printing out a test page which can then be examined by the flatbed scanner to check that the printheads are aligned correctly. It’s a neat way to check that everything is working as it should.",
    "To get the printer online and complete the setup, you need to download HP’s companion app called HP Smart onto your iOS or Android phone, Mac or PC. The software is very well designed to make setting up and operating your printer a breeze. You can use it to order Instant Ink supplies, send a fax, scan a document to print or create a photo book. Mobile printing and scanning was never so easy, so long as you have a robust internet connection.",
    "If, however, you have a weak Wi-Fi connection, or you’re offline, the HP OfficeJet 8012e is much more limited. You simply cannot scan to your Mac or PC via a data cable. Nor can you cannot scan to a USB flash drive because there’s no USB Host port. There’s no Ethernet port either, so you can forget about running a cable from your router. We had to relocate the printer to a position where our Wi-Fi was strong enough in order to test the scanner. It’s the first printer we’ve come across where a feature as fundamental as the scanner becomes redundant when you’re offline.",
    "The lack of a multipurpose tray is annoying too because it means you have to keep reloading the main tray which does not slide open very smoothly. It is at least quiet in operation with no problems passing paper through the ADF or making good copies. The only small issue we experienced was with inaccurate positioning of smaller paper sizes. For example, the border around photos printed on 10x15cm photo paper was never quite even.",
    "The HP OfficeJet 8012e performed well in our tests with no paper jams or smudging. There is often quite a long pause before the print job is processed and printed. HP claims a first page out time of 13 seconds for a black and white print and 17 seconds for colour, but we found that to be optimistic. The print speed of 18ppm for mono prints is about right and it takes twice as long in auto duplex mode.",
    "Text looks very dark and clear with characters clearly legible at small point sizes. It is perhaps a bit heavy on the ink and you will probably find that draft mode is fine for most jobs. Mixed colour documents also look crisp with no running between colours. The pigment-based inks used in the black and colour cartridges have the advantage of being more smudge-resistant than dye-based inks, but the disadvantage is that they are not so bright. As a result colour documents and particularly photographs look a little subdued. Photos printed on photo paper look sharp enough, but lack the vibrancy a good photo printer can achieve. Areas of plain colour show faint horizontal lines and all photos look a little grainy, even on the finest print setting. This is a little disappointing given the claimed print resolution when optimised is 4,800 x 1,200 dpi.",
    "Copies of our test pages made using the flatbed scanner, or stacked up in the ADF all printed without incident and looked like slightly softer focussed versions of the original. The copy resolution of 600dpi is good enough for day to day copying, though other all-in-ones offer more dots per inch. In short, the HP OfficeJet 8012e does a good job with mono text pages, while turning out reliable copies and colour documents and printing average quality photographs.",
    "On the surface, the HP OfficeJet 8012e looks like a whole lot of printer for the money and it certainly does come with most of the key features. The touchscreen interface and 35-sheet ADF are great features to find at this price. There are a few things missing though. The absence of a multipurpose tray for single print jobs and a USB Host port for walk-up print jobs. It’s a little slow to start up and print the first page and that main paper drawer is somewhat awkward for loading smaller paper sizes. It also ships with very little ink in the box, so you have to consider the cost of new cartridges, which is £43 (US$59) for a standard set, or £87 (US$120) for four XL cartridges. An HP+ subscription will lower that cost, but it will still be more expensive to run than a laser printer or a an inkjet with refillable tanks."
  ],
  "headers": {
    "2": "Design and build",
    "7": "Features and specifications",
    "10": "Setup and operation",
    "15": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "all-in-one printers": "https://www.techradar.com/news/best-all-in-one-printer",
    "HP+": "https://www.techradar.com/news/hp-streamlines-the-printing-experience-with-new-service",
    "HP OfficeJet Pro 9015e/9010e": "https://www.techradar.com/reviews/hp-officejet-pro-9010e"
  }
}