{
  "source": "https://www.techradar.com/reviews/roberts-revival-rd70-dab-radio",
  "title": "Roberts Revival RD70 DAB radio review",
  "category": "audio-visual",
  "updated": "2021-08-20T15:52:06Z",
  "author": "jamie-carter",
  "summary": "Great DAB radio, so-so Bluetooth speaker",
  "verdict": "Buy the RD70 if you want a great sounding, 1950s-styled ‘wireless’ for your kitchen. It also works as a portable Bluetooth speaker, though only on AA batteries when away from the mains. Better in the kitchen than the bedroom, this is nevertheless an excellent attempt at a DAB radio with extras.",
  "pros": [
    "Retro style",
    "Large colour LCD",
    "Bluetooth streaming",
    "Portable design",
    "Line-in and headphones jack"
  ],
  "cons": [
    "Bulky design",
    "Not suitable as a bedside radio",
    "Bluetooth streaming lacks volume",
    "Uses AA batteries",
    "Bass-heavy out of the box"
  ],
  "article": [
    "The best DAB radios are all about the simple things in life. Classic tunes while you create in the kitchen, football commentary in the bath and Test Match Special in the garden.",
    "Cue the Roberts Revival RD70, a retro-styled DAB/FM radio that attempts to bring the ‘wireless’ bang up to date by adding a large colour LCD display and Bluetooth streaming from smartphones.",
    "Since it can also run on battery power, the RD70 is also a well-disguised portable Bluetooth speaker. Is this the go-anywhere all-in-one of your dreams? Well, perhaps not. The RD70 is great as a DAB and FM radio. It’s faux leather-covered wooden speaker cabinet gives plenty of mid-range and bass (a tad too much, even) and it looks good on a kitchen counter or in a bathroom.",
    "However, it’s not as portable as you might think, thanks to its use of four AA batteries – no easily rechargeable battery here. It’s also not waterproof and its Bluetooth streaming is also quiet and underwhelming.",
    "So what should we make of the RD70? Well, don’t buy it for its portability or for its basic Bluetooth features – both of which are the wrong side of retro – and focus on its core skill as a DAB radio for a kitchen or bathroom. Yes, it’s expensive and misfires on a couple of features, but the vintage-styled RD70 is one of the best-looking, easiest to use DAB radios for the home.",
    "The original Revival had been around for years and was one of the UK’s best-selling portable radios.",
    "This new version originally launched in 2018 updates the tech inside, but barely touches the retro design. It’s available in red, black, dove grey, duck egg blue, leaf green and pastel cream.",
    "If there is an iconic design in the world of DAB radios, it’s Roberts’ Revival. Styled as a 1950s ‘wireless’ in the old sense of the word, the RD70 now tackles the modern meaning of that phrase to add Bluetooth streaming from smartphones.",
    "Do you remember what radios were like in the 1950s? Nope. Nor us. In fact, you could argue the vintage styling is a tad overdone, and the RD70 more museum piece than truly retro – but either way there are few more design-led DAB radios out there, save for the Ruark R1 Mk4.",
    "It’s mostly aimed at kitchen sides, window sills, bathrooms and bedside tables. The latter is obvious from its provision of a sleep timer (for up to 90 minutes), two alarms and a snooze function (you just hit the right-hand knob), though we think its bulky size is a little too much for the average bedside table.",
    "There is another reason to keep it away from the bedroom; its 36 x 48mm colour LCD display is ranged on the top of the device so it makes for a less than perfect clock radio.",
    "Measuring 106 x 250 x 160mm and weighing 1.7kg, the RD70 looks like it’s covered in leather. It’s not – it’s merely a synthetic faux-leather – and on older incarnations of the Revival this layer hasn’t aged well. Cracks and tears have appeared in the covering after a few years. We’re hoping that has been addressed on the RD70, though only time will tell.",
    "It’s an eye-catching look and the designers have gone all-in on the 1950s look, right down to a soft faux-leather carry handle, bronze-coloured speaker grille and knobs that turn and click to navigate menus. It will probably appeal more to older users than younger.",
    "However, there are plenty of contemporary touches on its top-mounted control panel, from that great-looking colour LCD display to playback buttons that let you control your music when streaming from a smartphone. Also on that panel is a headphones jack and a 3.5mm line-in for attaching other audio devices.",
    "The RD70 has a telescopic aerial extending to a maximum of 60cm, but it only feeds upwards. While that adds a little stability (side-ranging aerials tend to droop after a while), it’s not great news for anyone wanting to put the product on a kitchen surface underneath cupboards. That goes doubly so because in our tests the aerial was mostly required to get a stable signal.",
    "We managed to tune-in myriad DAB radio stations using the auto-tune function and found the combination of clicks and turns of the left-hand knob fairly intuitive. We were then able to set specific stations as presets and easily navigate between stations, though the RD70 lacks dedicated preset buttons that take you straight to a specific radio station.",
    "A colour display is pretty advanced for retro products like this and it comes with some interesting options. It offers six display themes to choose from, including ruby, emerald and sapphire-coloured backlights. It makes use of the sheer size of its color display to show a digital version of a clock face. In theory you get album artwork on the display from DAB and via Bluetooth, but this didn’t work in our tests. It’s hardly a necessary feature, anyway.",
    "Bluetooth streaming is easy enough. You just toggle to Bluetooth on the source button and find the RD70 in your phone’s settings. Does the RD70 work well as a portable Bluetooth radio? It can, but it comes with a catch. In place of a built-in lithium-ion battery that’s easy to recharge, the RD70’s undercarriage includes a slip-off hatch for four AA batteries.",
    "They’ll add up to 25 hours of portability. If you only plan to use them irregularly that’s fine, but think twice before you buy the RD70 intending to take it everywhere, since you’ll need a stash of rechargeable AA batteries and the patience to frequently replenish them. We would expect the next version of the RD70 to be a rechargeable unit. The RD70 is also not waterproof, so be careful taking it outside.",
    "FM and DAB broadcasts sound excellent on the RD70, but it won’t be for everyone. A result of its wooden cabinet housing a mid-size driver, the sound quality is warm, detailed and has plenty of bass, but isn’t designed for high volumes.",
    "As its styling suggests, you’ll hear warm, round tones perfect for voice, and for music radio, too. However, it will be a little bassy for some; in our test a DJs with a low voice did sound rather boomy.",
    "You can dive into the RD70’s EQ settings if it’s too much; here you’ll find classic / jazz / pop / rock / news sound presets (though none are standout) alongside basic tweaks to treble and bass.",
    "We found that for DAB radio – music and voice – the bass needs to be at -4. For Bluetooth streaming we settled on -2 for bass and +3 for treble, though the major issue we had with this mode was volume.",
    "It’s just so quiet when you swap to playing podcasts or music from a smartphone, even with the smartphone on full volume. As well as lacking volume, the sound appears slightly muffled, too. This unfortunately isn’t rare on DAB radios, which roundly fail to treat Bluetooth streaming with any kind of skill.",
    "If you want a ‘new’ wireless speaker, go elsewhere, but if you want a good ‘old’ wireless, the RD70 impresses."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Roberts Revival RD70 DAB Radio price and release date",
    "7": "Design",
    "14": "Setup",
    "19": "Audio performance",
    "25": "Don't buy it if …"
  },
  "links": {
    "The best DAB radios": "https://www.techradar.com/news/audio/hi-fi-radio/best-dab-radio-which-one-should-you-buy-901928",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "original Revival": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/radio-tuners/roberts-revival-dab-rd60-907193/review",
    "Ruark R1 Mk4": "https://www.techradar.com/reviews/ruark-audio-r1-mk4-dab-radio-review",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "wireless speaker": "https://www.techradar.com/news/best-speaker"
  }
}