{
  "source": "https://www.techradar.com/reviews/dyson-v15-detect-absolute",
  "title": "Dyson V15 Detect Absolute review",
  "category": "appliances",
  "updated": "2021-05-27T07:44:32Z",
  "author": "carrie-ann-skinner",
  "summary": "Is this Dyson’s most advanced vacuum yet?",
  "verdict": "The Dyson V15 Detect is the brand’s most powerful vacuum to date, sucking up dust and debris with ease. The laser highlights dust on hard floors that the human eye can’t see, and it’ll even count the dust particles, displaying the information on-screen for those who want evidence that their home is spotlessly clean. It’s expensive, and one of the heavier cordless vacuums we’ve tested, but we think it’s worth every penny.",
  "pros": [
    "Powerful suction",
    "Laser highlights microscopic dust on hard floors",
    "Compact and lightweight"
  ],
  "cons": [
    "Expensive",
    "Average-sized dust canister"
  ],
  "article": [
    "Dyson makes some of the best vacuum cleaners on the market, featuring impressive suction power and a range of high-tech features to make one of the most monotonous household chores as quick and painless as possible.",
    "Its latest cordless vacuum, the Dyson V15 Detect Absolute, is no exception – it’s the most powerful cordless vacuum the brand has ever produced, and Dyson has also redesigned the hard-floor cleaning head to include a laser that highlights microscopic dust particles that would otherwise remain invisible to the naked eye.",
    "The V15 Detect Absolute can also count and identify the size of the dust particles it collects, displaying the information on a LCD screen, so you can see evidence that your vacuuming session is giving your floors a truly deep clean.",
    "The LCD display, which was first seen on the V15’s predecessor; the Dyson V11 range, also presents information on the remaining run-time and the power level selected. And, like the V11 range, the V15 Detect Absolute can automatically adjust the power to suit the type of floor it’s cleaning when used with the High Torque cleaning head.",
    "Dyson says the battery will last up to 60 minutes between charges when the cleaner is used on the lowest power setting, although this decreases to 15 minutes if you’re using the maximum level. The battery is also removable, so you can swap it for a fully-charged one (you’ll need to purchase an additional battery separately) to minimize interruptions to your cleaning sessions.",
    "The extra tech in the Dyson V15 Detect means it weighs in at just over 1lb / 500g heavier than the V11 Absolute, so are the extra weight, and the hefty price tag, justified by the vacuum's cleaning power and smart features? We put it to the test to find out.",
    "The Dyson V15 Detect Absolute, which is called the Dyson V15 Detect in the US, and the Dyson V15 Detect Total Clean in Australia, is priced at $699.99 / £599.99 / AU$1,399. It’s available to buy now worldwide.",
    "In the US and the UK, a second model is also available. It has a larger 0.5-gallon / 1.9-litre dust bin but doesn't have the acoustic dust sensor. It's called the Dyson Outsize Absolute+ in the US and comes with two batteries for $899.99 (around £650 / AU$1,200), while in the UK it's known as the Dyson Outsize Absolute and is priced at £699.99 (around $990 / AU$1,275), although it only comes with one battery.",
    "In Australia, the second model is called the Dyson V15 Detect Absolute Extra; this comes with a free-standing dock and an extra HEPA to trap even more microscopic particles. It is priced at AU$1,449 (around $1,125 / £800).",
    "As we’ve mentioned, the battery is swappable, and additional batteries are priced at $149 / £85 / AU$199.99",
    "On the surface the Dyson V15 Detect Absolute looks very similar to the V11 range, comprising the motor, 1-inch / 2.6cm color LCD display, the motor, which creates the suction, the cyclones that generate centrifugal force to ensure dust and dirt stay in the canister, and the 0.2-gallon / 0.75-liter dust bin at the top. Weighing in at 6.8 lb / 3.1kg, it's one of the larger, heavier cordless vacuums we’ve tested.",
    "Under the hood, however, the V15 Detect Absolute gets some serious upgrades over its predecessor, with the motor generating 230 air watts – that’s 24% more suction power than the V11 range – while the acoustic piezo sensor uses sound to track the number and type of dust particles the vacuum collects, displaying this information on the LCD screen along with the remaining battery level and the power level selected.",
    "TheV15 Detect ships with two cleaning heads; the Laser Slim Fluffy cleaner head, which has a soft brush bar to ensure hard floors aren’t damaged, is among the tools bundled with the vacuum cleaner. This features a class 1 laser diode (so it’s safe for humans and pets) mounted at an angle of 1.5 degrees and 7.2mm off the ground, which projects a beam of green light in front of the cleaning head to highlight microscopic dust particles that are invisible to the eye.",
    "The V15 Detect also comes with the High-Torque cleaning head, that when used on Auto Mode, will adjust the power to suit the type of floor you’re cleaning when using. However, unlike the version that ships with the V11 range, it now has 56 polycarbonate teeth that shred hair into small sections, to stop it getting tangled around the bristles of the cleaning head.",
    "The V15 Detect Absolute has three power levels, which can be selected using the button on top of the vacuum cleaner; and like other Dyson cordless vacuums, you can convert the V15 Detect Absolute into a handheld cleaner by removing the main wand and attaching any of the eight tools it comes with directly to the dust canister.",
    "One of which is the anti-tangle hair screw tool - this compact conical brush has tufts of bristles angled at 45 degrees, ensuring that strands of pet and human hair automatically move towards the slimmer end of the tool, where they’re sucked into the dust canister, rather than getting caught around the brush itself.",
    "The V15 Detect Absolute has a swappable battery built into the handle, to reduce interruptions to your cleaning session, assuming you purchase an additional battery. Dyson says the battery lasts up to 60 minutes between charges, but this depends on what power setting you’re using the vacuum on. A docking station and charging cable are also included with the vacuum cleaner.",
    "On all power levels, the Dyson V15 Detect Absolute sucked up all the fine dust, biscuit crumbs and cereal we sprinkled on carpets and hard floors with just one slow pass, and it glided easily over both flooring types too. When we used the High Torque cleaning head and switched to Auto mode, the vacuum cleaner automatically increased the suction when the acoustic piezo sensor detected high levels of dust, and reduced it when it sensed the dust levels dropping.",
    "We were able to see the type and amount of dust sucked up by the V15 Detect on the LED display, which depicted the different dust particles as a colorful bar graph, while the remaining runtime is shown below the graph. We were also able to use the button on the top of the vacuum cleaner to adjust the suction power.",
    "On top of that, we were impressed by just how much dust the Laser Slim Fluffy cleaner head really did highlight on our hard floors. We deliberately missed the edges of a room with hard floors, and then pushed the head towards these edges – with the green laser illuminated we were shocked by just how much dust, which wasn’t previously visible, was on the floor.",
    "As mentioned, the Dyson V15 Detect Absolute also ships with the new anti-tangle hair screw tool, which is designed for removing pet and human hair from smaller surfaces such as sofas and car seats. During our testing, we deliberately removed a clump of human hair from a hair brush and placed it on the sofa, then used the vacuum with the anti-tangle tool attached to hoover it up – we were impressed to see that it was sucked straight into the canister without getting tangled around the bar in the tool.",
    "Converting the vacuum to handheld mode and back again was simple – as on other Dyson cleaners this requires removing the main wand – although we did find it was slightly heavier to use in this mode than previous Dyson vacuums, and we weren’t able to clean up high for long before our arm began aching.",
    "We found the V15 Detect Absolute easy to empty too – once the wand and any cleaning attachments were removed, we were able to use the lever on the back of the dust canister to open the lid and eject the debris in the bin in one swift move.",
    "The vacuum was pleasingly quiet when used on lower power settings, but at the maximum suction our decibel meter registered 81db, which is similar to a truck travelling down the road at 40mph, making it one of the louder cordless vacuums we’ve tested.",
    "As we’ve mentioned, Dyson claims the battery will last up to 60 minutes on the lowest-power, Eco, setting, and during our testing we managed a respectable 59 minutes before the vacuum needed recharging. It took around five hours to fully recharge the battery using the bundled charger.",
    "As we’ve mentioned, the battery, which attaches to the handle of the vacuum cleaner, can be swapped out to ensure that your cleaning session isn't interrupted – provided you purchase additional batteries of course.",
    "First reviewed: May 2021"
  ],
  "headers": {
    "6": "Dyson V15 Detect Absolute price and availability",
    "10": "Design",
    "17": "Performance",
    "24": "Battery life",
    "26": "Don't buy it if..."
  },
  "links": {
    "best vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners",
    "Dyson V11": "https://www.techradar.com/reviews/dyson-v11-absolute"
  }
}