{
  "source": "https://www.techradar.com/reviews/canon-eos-m50-mark-ii",
  "title": "Canon EOS M50 Mark II review",
  "category": "cameras",
  "updated": "2021-04-12T23:46:19Z",
  "author": "sharmishta-sarkar",
  "summary": "Canon misses the mark the EOS M50 Mark II",
  "verdict": "Canon’s EOS M50 Mark II is a confusing little camera – while it is feature-packed, it’s only a very minor update on the first EOS M50 camera. Other than the addition of eye AF and the ability to shoot vertical video, there’s not really a whole lot different between the two versions. So while we wouldn’t recommend owners of the EOS M50 to upgrade to the newer model, it’s great for those just starting out on their photography and content creation journeys.",
  "pros": [
    "Vertical video recording",
    "Eye AF for stills and video",
    "Great stills"
  ],
  "cons": [
    "Heavily cropped 4K video",
    "Limited native lenses",
    "100fps shooting at only 720p"
  ],
  "article": [
    "The Canon EOS M50 Mark II is a puzzling one – it’s a feature-rich camera by itself, but most of those specs are already available on the original EOS M50, with only a few added benefits to indicate it’s an updated model.",
    "The M50 Mark II is identical to its predecessor, both internally and externally – what’s new is all software-based and could be of great significance to up-and-coming content creators. There’s the added benefit of eye-detect autofocus for both stills and video, and the ability to shoot vertical videos for social media platforms.",
    "Another advantage the M50 Mark II offers over the older camera is a new video-recording button available on the touchscreen, and a movie self-timer that gives you between 2 to 10 seconds to prepare yourself before the camera starts to record. If you happen to have over 1,000 YouTube subscribers, the M50 II will also allow you to wirelessly live stream to YouTube.",
    "While its video prowess looks good on paper, the M50 II suffers from the same heavy 1.5x crop for 4K video as its predecessor, and also uses a slower phase-detect autofocus system that can be an issue if you’re recording fast-moving subjects. Although the camera's eye AF isn't as fast as, say, the Canon EOS R6, it is quite good for a camera that’s been labeled as an entry-level model and works well for stills and 1080p video – it's a bit hit-and-miss while shooting in 4K.",
    "For those interested in just stills photography, the M50 II performs exactly the same as the older M50 – it produces very good results, offers the same (and rather respectable) 10fps burst speed, with good dynamic range and decent noise performance. So if you already own the EOS M50 and are a photographer, it’s hard to recommend the Mark II, but for videographers – specifically content creators – who don’t need fancy specs, the new model is worth considering.",
    "While Canon announced the EOS M50 Mark II originally back in October 2020, it was only for select markets, including the US and India. It took until the end of March 2021 for the camera maker to spread the joy of the camera worldwide, with the mid-range mirrorless camera now available to purchase globally either as a body-only package or as a kit.",
    "The body alone (which is not available in Australia) will set you back $599 / £599, while the single-lens kit – packaged with the EF-M 15-45mm – can be had for $699 / £699 / AU$999, which is good value for money if you don’t already own the original M50.",
    "Canon has informed us that the EOS M50 Mark II replaces the older model, and the M50 will be discontinued by mid-2021.",
    "Considering the EOS M50 Mark II is a replica of its predecessor, you can read our EOS M50 review to get a rundown on most of the features you’ll find in the new model. Not only does it inherit the M50's body, it also brings over the older model's 24.1MP APS-C sensor and the now-slightly-aging Digic 8 imaging engine.",
    "So you’re still getting the same ISO sensitivity range of 100-25,600 (expandable to 51,200) and a maximum burst speed of 10fps. While the number of autofocus points remains the same at 143 usable points, the Mark II model benefits from some software updates that give it a slight advantage over the M50.",
    "Eye detection and tracking is now available for both stills and video, and it works quite well, thanks to Canon’s Dual Pixel sensor that uses phase-detection autofocus. It manages to keep up with fast-moving subjects for stills and 1080p video. When shooting in 4K, however, only contrast-detect AF is available and slows the autofocus down a little.",
    "Speaking of 4K recording, the M50 II has the same specs as its predecessor, being able to capture 3840x2160 resolution footage at 25fps, and features 4K timelapse recording that allows you to save stills from the video. Unfortunately, the M50 II also inherits the heavy 1.56x crop when shooting in 4K mode, which increases to 1.75x if you enable digital image stabilization (IS), and 2.26x if you use enhanced IS – making this a 4K camera in name only. If 4K video is your priority, we’d recommend the Canon EOS M6 Mark II instead. High-speed video is also available at 100fps, but this tops out at 720p resolution.",
    "To cater to content creators, Canon has taken a leaf out of its PowerShot G7X Mark III playbook and added its vertical video recording capabilities to the M50 II. This is the format favored by social media platforms like Instagram and TikTok, and makes it easier for content creators to upload to their preferred site. And, as mentioned, it has the ability to stream directly to YouTube, although there are caveats that Google has placed for live streaming that you will need to fulfil before you can use this feature. The camera is also compatible with Canon’s EOS Webcam Utility, so the M50 II can be used as a webcam or for streaming.",
    "To make recording video easier, the M50 II now features a virtual recording button on the touchscreen as well, and a handy movie self-timer. This last feature is great for single-person use, giving you between 2 and 10 seconds to get yourself in front of the lens before the camera starts to record.",
    "Considering the M50 II is identical to the older M50, we’ll keep this short. It’s the same well-built body, with a small, compact form factor that makes for an excellent traveling companion. In fact, it’s even smaller than some Micro Four Thirds cameras. That also means you’re not getting a very deep grip, although it’s enough to make sure you don’t drop the camera.",
    "You’ll get the same sharp 2.36-million dot viewfinder, a 1.04-million dot fully articulating LCD touchscreen, and the same single-dial control layout. All the controls you need are available via the touchscreen, including touch-and-drag focusing, or via the rear buttons.",
    "Despite being a new model, there’s still no weather sealing here, but don’t be fooled by the camera’s plasticky look – it has a sturdy build and doesn’t feel fragile in the hand.",
    "(Read more about the camera’s build and handling in our Canon EOS M50 review.)",
    "The EOS M50 was the first Canon camera to get the Digic 8 imaging engine in 2018 (incidentally, it was also the first Canon camera to offer 4K video) and, despite being three years old, the Mark II version inherits the same processor. That means the M50 Mark II can shoot at up 10fps bursts in Single AF mode, while tracking slows that down a bit to a still strong 7.4fps when in Continuous AF mode.",
    "While the battery is rated for 305 shots (strangely more than the 235-shot rating for the M50 despite the same battery), you can squeeze more out of it. During our testing (which we did while on a trip to Tasmania), we got a very respectable 375 images from a single charge.",
    "There’s not much to complain about when it comes to AF performance either. It may not match the performance on the EOS R5 or the R6, but it definitely holds its own, locking onto a subject and tracking it well. It does have trouble with very fast-moving objects, but Canon’s trusty Dual Pixel AF continues to do well here.",
    "However, the contrast-detect AF used while shooting 4K video is slow, and it does struggle to find the subject. That said, the camera wasn’t designed to keep up with action, and does well for most situations, particularly for vlogging. It’s 1080p performance, though, is pretty darn good.",
    "There’s no in-body image stabilization here, so you might need to use a tripod for some scenarios.",
    "If it ain’t broke, why fix it? There was absolutely nothing wrong with the 24MP sensor in the older M50 and using it again in the Mark II was a good call. It produces some really clean and crisp images that we saw with the M50, with excellent color rendition and lots of details.",
    "We were able to take the camera and a couple of EF-M lenses with us to Tasmania, Australia, and needless to say, we were very happy with the results.",
    "There’s plenty of resolution here for A3 prints or some serious cropping before you start losing image quality.",
    "While the M50 II’s dynamic range can’t match that of more advanced cameras, it still puts in a solid performance in raw files. In fact, we were able to retrieve a lot of lost details in highlights and shadows in JPEGs as well.",
    "Noise is well controlled at up to ISO 6400, although up to ISO 12,800 is usable even though there’s evidence of grain and loss of details at that sensitivity level. It’s only at ISO 25,600 that noise becomes an issue and it’s a setting we wouldn’t recommend using, even if you resize for use on the web.",
    "The camera’s auto white balance setting is dependable, as is it’s evaluative metering system which delivers balanced exposures and can handle most scenes quite well.",
    "Aside from its 4K constraints, M50 Mark II’s video quality is pretty good too, matching the camera’s stills performance."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Canon EOS M50 Mark II price and availability",
    "8": "Canon EOS M50 Mark II: features",
    "14": "Canon EOS M50 Mark II: build and handling",
    "18": "Canon EOS M50 Mark II: performance",
    "23": "Canon EOS M50 Mark II: image quality",
    "30": "Don't buy it if..."
  },
  "links": {
    "EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "Canon EOS R6": "https://www.techradar.com/reviews/canon-eos-r6-review",
    "EOS M50 review": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "Canon EOS M6 Mark II": "https://www.techradar.com/reviews/canon-eos-m6-mark-ii-review",
    "PowerShot G7X Mark III": "https://www.techradar.com/reviews/canon-powershot-g7-x-mark-iii",
    "Canon EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "EOS R5": "https://www.techradar.com/reviews/canon-eos-r5"
  }
}