{
  "source": "https://www.techradar.com/reviews/bose-sleepbuds-ii-review",
  "title": "Bose Sleepbuds II review",
  "category": "wearables",
  "updated": "2021-10-07T12:25:45Z",
  "author": "lee-bell",
  "summary": "Built to help you sleep",
  "verdict": "In a bid to make up for the mistakes the original Sleepbuds made, Bose’s latest sleep-masking earbuds bring plenty of improvements, such as a much better, comfier fit, increased battery life and a better range of sounds to help you drift off. The design is exactly what you’d expect from Bose, with everything exuding a high-end, sleek aesthetic you’d be proud to sit on your bedside table. Performance is just as good, too, successfully masking the annoying sounds that keep you from getting some much-needed rest. However, this comes at a cost - one which might prove just a little too much for those looking to get a decent night’s rest. If you suffer from poor sleep and you’ve got the money to throw at it, the Bose Sleepbuds II could be the gadget of your dreams.",
  "pros": [
    "Extremely comfortable",
    "Great build quality",
    "Masks external noises very well"
  ],
  "cons": [
    "Expensive",
    "Not for everyone",
    "Limited number of sounds"
  ],
  "article": [
    "The second iteration of Bose’s earphones that are designed for sleeping in, the Sleepbuds II, improve on the original release (named simply Bose Sleepbuds) with a bunch of fresh features and also correct the issues users were having which led to them being discontinued.",
    "For those unfamiliar with the original release, the Sleepbuds II (that we'll also call the Sleepbuds 2 in this review) haven’t been made for listening to your fave tunes under the covers - these are sleep earplugs designed for relaxing you and preparing you for a good night’s sleep through a specific selection of soothing sounds.",
    "Just when we thought they couldn’t get any better than the originals, the Sleepbuds 2 design offers even better ergonomics. They're super lightweight and delicate and so go completely unnoticed in your ears.",
    "The new soft and springy silicon tips help here, adding an extra feeling of comfort in the ears. This is all packed up superbly in a sleek and minimal-looking anodized aluminum charging case.",
    "The Bose Sleepbuds 2 don’t disappoint when it comes to performance, either. They successfully mask external sounds which helps keep you asleep for longer and are operated by a really use-to-use companion app. On the app you’ll find a selection of 35 relaxing sounds to help you sleep, up from the 10 in the original Sleepbuds model.",
    "However, we found it quote irritating that you have to install these onto the buds first before using them to go to sleep, which is quote time consuming, and then only a limited number of sounds can only be stored on the earphones at one time.",
    "Nevertheless, massively improved battery life means you’ll likely get four nights’ worth of use between charges, which will be a welcome improvement for users of the previous model as this was one of the biggest complaints.",
    "All-in-all, this is a fantastic piece of hardware that does exactly what it says on the tin, but will set you back a pretty penny and thus will likely prove too expensive for those who only have minor issues with sleep.",
    "Bose launched the Sleepbuds 2 globally on October 13, 2020, and they are available to buy now with an RRP of £229.95 / US$249.95 / AUS$379.95 from the official Bose website and a host of other online retailers.",
    "As you can probably guess from the name, the Sleepbuds II aren't the company's first foray into sleep-focused earbuds. Bose’s second attempt looks to right all the wrongs made in the original release, which launched back in 2018.",
    "Although it received critical acclaim initially, numerous quality-control problems were reported later down the line, with users complaining of inconsistent battery life, squeaking sounds, shutdowns, and buds that wouldn't charge properly.",
    "However, this time around Bose has vastly improved on the predecessor by adding a host of new features such as a more ergonomic and lightweight design, new proprietary ear tips for a snug all-night fit, better battery life and an expanded list of 35 tracks for more choice of sounds. They’re also now backed by lots much research, being clinically proven to help you fall asleep faster.",
    "These don’t come cheap though, especially when there are other, less expensive options around like the QuietOn Sleep. However, the upgrades in this second iteration certainly do make them more enticing.",
    "The Sleepbuds 2 don’t only fix the performance issues experienced by users in the first release, they introduce an improved design which Bose says is more ergonomic and thus increases comfort levels.",
    "We’d have to agree. These two tiny, truly wireless buds slip into the ears with ease and are barely noticeable once they’re in there. And we think this is exactly what you need from a pair of earbuds for sleeping in.",
    "Some people (us) can be quite fussy when it comes to sleep routine. Adding something new to the equation at bedtime, no matter how small, can easily throw you off. For example, a different feeling in the ears, even if only a slight change to the norm, could - quite easily - prove irritating and make it much harder to drift off.",
    "Bose has obviously taken this into consideration, and has ensured the Sleepbuds are especially delicate. They are ultra-lightweight at just 1.35g per bud, and measure approximately 6.35mm deep, which helps to reduce the feeling of any contact when your head is resting on a pillow, even on your side.",
    "The new silicon tips help here, too, which are super soft and extremely comfortable in the ears. They've also been designed with pressure equalization to block out more noise than ever from entering your ear.",
    "For re-juicing, the Sleepbuds 2 come in a solid anodized aluminium charging case that not only exudes the usual premium feeling you’d expect from Bose, but adds an extra 30 hours of battery life between needing to be plugged into a USB port, which we are pleased has been upgraded to a USB Type-C - thankfully.",
    "The buds sit nicely in place within the case through magnetic connectors, pulsing an orange light to show they are charging, and a mechanism sees that the case slides shut in a satisfyingly smooth action.",
    "The Bose Sleepbuds 2 aren’t meant to be used in the same way as normal Bluetooth earphones that are designed for music playback. Instead, they’ve been designed to get you off to the land of nod in a more relaxed manner by masking unwanted, external noise and replacing them with gentle, soothing sounds. Consequently, Bose doesn’t allow you to hook them up to your usual music streaming platforms - they only work through a companion app called Bose Sleep.",
    "Like the buds themselves, the Sleep app is minimal, well designed and easy to use. There’s not much to have to look for within the app; controls are limited but not limiting - which makes using it a breeze. It’ll tell you if the buds are successfully connected, the battery life left and the sounds available to help you get to sleep.",
    "These sounds are sorted into three categories: Noise Making for blocking out annoying, external noises, Naturescapes to help transport you into a world of sleep, and Tranquilities to calm your mind. In the original release, there was only a choice of 10 sounds available in total. Now, this has been upgraded to 35, each of which Bose says have been “methodically produced and tested” to help you relax and/or drift off.",
    "As before, you can choose how long you’d like these sounds to play for in the app’s Sleep Timer option in the general settings tab. This can range from, from 30 minutes to “all night long”, and you can also decide whether you’d like to set an alarm so the earphones can gently wake you up in the morning - a nifty tool considering the buds are likely to mask your phone’s alarm.",
    "Overall, the Sleepbuds II are able to successfully block, cover, and replace the audible distractions from things like loud snoring partners, neighbors, dogs, and traffic really well, to the point where you can’t hear them at all. The better scope of sounds along with the improved design also means the buds offer better noise-masking performance than their predecessor. We’re really impressed with their performance.",
    "The only downside is that the earbuds have to store the sounds onboard (to reduce battery consumption, we assume) and you can only store a certain number of sounds at a time. This means that if you’re looking to try a new sound, you’ll have to transfer it over to the buds first (which can take a good few minutes) and if when you reach the maximum amount (around 10) you’ll have to delete one first. Kinda irritating, if you ask us!",
    "In terms of battery performance, the Sleepbuds 2 gave us no cause for concern. Even after a solid eight hours of sleep with the buds wedged deep in our ears playing sounds at around 75% volume, the app's battery indicator showed just under 50% of charge remaining, which users of the original model will be pleased to hear.",
    "First reviewed: January 2021"
  ],
  "headers": {
    "0": "One-minute review",
    "8": "Bose SleepBuds 2 price and release date",
    "13": "Design",
    "20": "Performance",
    "27": "Don’t buy them if..."
  },
  "links": {
    "Bose Sleepbuds": "https://www.techradar.com/reviews/bose-sleepbuds",
    "sleep earplugs": "https://www.techradar.com/best/the-best-sleep-earplugs",
    "£229.95": "https://www.awin1.com/awclick.php?awinmid=2741&awinaffid=103504&clickref=trd-us-1391308427579678700&p=https%3A%2F%2Fwww.bose.co.uk%2Fen_gb%2Fproducts%2Fheadphones%2Fnoise_masking_sleepbuds%2Fnoise-masking-sleepbuds-ii.html#v=noise_masking_sleepbuds_ii_white",
    "US$249.95": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1244332220310672100/https://www.bose.com/en_us/products/wellness/noise_masking_sleepbuds/noise-masking-sleepbuds-ii.html#v=noise_masking_sleepbuds_ii_white",
    "AUS$379.95": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-7420163320703528000/https://www.bose.com.au/en_au/products/headphones/noise_masking_sleepbuds/noise-masking-sleepbuds-ii.html?mc=20_PS_EE_BO_00_GO_&gclid=CjwKCAiA-_L9BRBQEiwA-bm5fo7BkKMW08e2STZyp-M_Xki3rPlS--nPQ9JDBWf5uGLhSqCi5SWSYRoCDHEQAvD_BwE&gclsrc=aw.ds#v=noise_masking_sleepbuds_ii_white",
    "QuietOn Sleep": "https://www.techradar.com/reviews/quieton-sleep"
  }
}