{
  "source": "https://www.techradar.com/reviews/zenfolio",
  "title": "Zenfolio website builder review",
  "category": "computing",
  "updated": "2021-10-04T12:10:57Z",
  "author": "daniel-blechynden",
  "summary": "An attractive portfolio builder for photographers",
  "verdict": "Although it’s certainly not the biggest name in the world of website building, Zenfolio’s excellent portfolio builder and advanced tools make it an option worth considering.",
  "pros": [
    "Excellent photo-specific tools",
    "Beginner-friendly editor"
  ],
  "cons": [
    "Designs are a little simplistic",
    "No free forever version available"
  ],
  "article": [
    "Selecting the best website builder for your needs is a crucial first step if you want to create your own site. There are numerous options available, including some targeted at absolute beginners, some that are more powerful, and some, like Zenfolio, that are designed for specific uses.",
    "In our Zenfolio review, we take a close look at this popular portfolio website builder. We analyze its prices, main features, user interface, support, and more to help you determine whether or not it’s a good option for your needs.",
    "Zenfolio offers three paid plans with both monthly and annual payment options. There’s also a 14-day free trial that you can use to test the platform.",
    "At the cheaper end of the spectrum sits the Starter plan, which costs $8 per month ($6 with an annual plan). It includes a great selection of templates, unlimited video and photo uploads, and the ability to connect your own domain name.",
    "Upgrading to the Pro plan will cost you $30 per month ($22 with an annual plan). You will have access to everything in the Starter plan, along with a more powerful site editor, online store tools, and custom watermarking.",
    "Finally, the Advanced plan starts from $44 per month ($32 with an annual plan). Along with everything in the Pro plan, you will gain access to a suite of powerful features designed for professional photographers, including a post-shoot green screen.",
    "Zenfolio’s photography portfolio website builder is backed by a suite of advanced features to help you get the most out of your site. Below we list some of the most noteworthy.",
    "When you sign up for a new Zenfolio account, you will have access to a suite of free photography website templates, mobile-friendly themes, a drag-and-drop editor, and more.",
    "Showcase your work through public galleries to help you gain more clients. Then, you can create custom photo galleries complete with password protection to help you share work with existing clients. Alternatively, set up a simple online store to sell photos, videos, or other content.",
    "You will also have access to a suite of advanced marketing tools, with a focus on helping you grow your social followings. Integrations are available for all major social media platforms, and there’s even a range of SEO tools to help you increase your organic search traffic.",
    "Zenfolio recently launched an enhanced version of BookMe, an advanced tool that automates booking, scheduling, gallery creation and commerce for professional photographers.",
    "BookMe streamlines and simplifies a photographer’s daily workflow by automating a multitude of functions that traditionally added hours to a photographer’s workday.",
    "The BookMe button can be added to any photographer’s website, even those not hosted by Zenfolio, and can be customized with the photographer's logo and color palette.",
    "To get started with Zenfolio, you can either sign up for a premium plan or take advantage of the 14-day free trial. No credit card information is required to begin the free trial, and the only things you need to provide are a name and email address.",
    "Once you’re signed up, you will be guided through a simple four-step setup process. Here, you will be able to specify the type of site you want, select an initial design, upload a few photos, and add SEO information.",
    "The website editor itself is quite simplistic, but it does come with enough tools for you to customize your design. Change color schemes, rearrange or re-order design elements, and add your own content for a truly personalized portfolio.",
    "Finally, there’s an impressive media management area that lets you upload and organize your photos and videos. Create custom galleries on different pages, add password-protected client galleries, and showcase your work for prospective customers.",
    "Zenfolio offers numerous support services, including live support and a range of self-help resources. Reach out to the customer service team via live chat, online ticket submission, or email, and expect an answer quite quickly.",
    "You can also book a free one-on-one setup session to get connected with a Zenfolio expert who can help you get your site started.",
    "Or, take advantage of the great range of self-help resources, which include detailed guides, full webinars, and more.",
    "As far as portfolio website builders go, Zenfolio certainly isn’t a bad option. However, there are some alternatives that are certainly worth considering.",
    "For example, Wix is known as the world’s most powerful website builder. Take advantage of the platform’s power to build a highly functional, personalized portfolio. It’s similarly priced to Zenfolio, and there are numerous add-ons available through the Wix App Market that you can use to add extra portfolio functionality to your site.",
    "Squarespace is another decent option, particularly for those who value high-quality designs over all else. It’s known for its excellent portfolio templates, highly attractive designs, and impressive editing tools. And while Squarespace certainly isn’t the easiest website builder to use, its section-based editor allows a passable amount of design flexibility.",
    "At the end of the day, there’s a reason why Zenfolio is one of the world’s top-rated portfolio website builders. It offers an array of tools to help you showcase photo and video content, along with eCommerce features to help you sell your work, a beginner-friendly editor, and more.",
    "On top of this, Zenfolio is very competitively priced, has great customer support, and boasts a noteworthy media organization portal.",
    "The bottom line: If you’re looking for an affordable, highly functional portfolio website builder, Zenfolio should certainly be among your top options."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Features",
    "13": "Interface and in use",
    "17": "Support",
    "20": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "best website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Zenfolio": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4530204802262226000/https://zenfolio.com/",
    "Starter plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1431442007009052000/https://zenfolio.com/zen-plans",
    "Pro plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2155262132571531300/https://zenfolio.com/zen-plans",
    "Advanced plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1070487228386200000/https://zenfolio.com/zen-plans",
    "online store": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "marketing tools": "https://www.techradar.com/best/best-content-marketing-tools",
    "SEO tools": "https://www.techradar.com/news/best-seo-tool",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Squarespace": "https://www.techradar.com/reviews/squarespace"
  }
}