{
  "source": "https://www.techradar.com/reviews/moto-g50",
  "title": "Moto G50 review",
  "category": "phones",
  "updated": "2021-06-15T16:28:07Z",
  "author": "jennifer-allen",
  "summary": "Dependable if unexciting",
  "verdict": "The Moto G50 is a dependable if mostly unremarkable phone. However, if you're looking for 5G connectivity and a 90Hz screen on a budget, you'll be fairly happy with these results.",
  "pros": [
    "5G support",
    "Good battery life",
    "90Hz screen"
  ],
  "cons": [
    "Mediocre camera",
    "Unremarkable performance",
    "Safe design"
  ],
  "article": [
    "Theoretically the superior version of the Moto G30 if you were to listen to product names, the Moto G50 is another one of Motorola's cheap Android 11 phones for 2021, coming in at £199.99 (around $275 / AU$360).",
    "As a 5G phone it's one of the cheapest ways to jump on the 5G bandwagon, but elsewhere its feature set is a little more unassuming.",
    "While everything about the Moto G50 is just fine - from its 90Hz screen to its Snapdragon 480 chipset and trio of main cameras - nothing actually stands out as much as we'd like it to.",
    "At this price, that's less of an issue than you might think given the Moto G50 is solidly dependable in every way. Just don't expect to be wowed at any point. This is the phone to buy when you're on a budget and you don't mind not having a phone to show off to others.",
    "Solidly plastic is the best way to describe the style of the Moto G50. It has a plastic back and frame, and it's a fairly chunky device, offering dimensions of 164.9 x 74.9 x 9mm and weighing just under 200g.",
    "The back of the phone houses a fingerprint sensor which is a little on the high side for those with small hands, but is otherwise fairly responsive. On the side there's a volume rocker, power button, and a Google Assistant button that, frustratingly, you can't remap. Your mileage will vary as to how much you use it, depending on how much you've ever used Google Assistant.",
    "The main thing you'll be looking at is the 6.5-inch display. This sounds immediately attractive when you consider it offers a 90Hz refresh rate, but there's a catch, as its resolution is pretty low at 720 x 1600. In ordinary use this may well not bother you, but it's a clear example of a price cutting endeavor going on here.",
    "Similarly, the camera setup might sound promising on paper but it's not so successful in reality. The front-facing camera is fine at 13MP, and carefully placed in a small notch, avoiding stealing any focus. However, the rear camera setup is restricted to a 48MP main sensor, a 5MP macro, and 2MP depth sensor. There's no ultra-wide lens here, and picture results are distinctly fine. Just fine.",
    "Images come out looking reasonably pleasant but there are issues with a certain lack of depth and also the restrictions that come from a digital-only zoom. Surprising at this price? Not really, but that doesn't mean we can't hope for more. This won't be a budget camera to wow photographers, and we're left wondering how come the cheaper Moto G30 manages to squeeze in an ultra-wide lens.",
    "More pleasingly, the Moto G50 offers great battery life. With 5,000mAh to pack all the juice in and 15W charging, it does the job and you won't have to worry about recharging quite as often as with some other cheap phones.",
    "Performance-wise, the Moto G50 maintains its steady if unremarkable attitude. Negotiating menus and opening apps is reasonably swift, with the only slowdown noticeable when loading up games such as Call of Duty: Mobile. It catches up in the end but there are minor issues here when opening a new map, for instance.",
    "Bear in mind if you're a keen gamer, you've only got 64GB of storage to play with, so you may wish to take advantage of the ability to add a microSD card to bump up your storage space.",
    "Still, that's the thing about the Moto G50. It all works fairly well but never in a way that will wow you. The only thing that makes it truly stand out is the fact that it's such a cheap 5G phone, and we won't blame you if that's what swings it for you. After all, it's a great way of enjoying faster data speeds for far less money.",
    "The Moto G50 is available in the UK and select parts of Europe already. There's no word yet on a release date for the US or Australia.",
    "The phone is available in a choice of two color schemes - Aqua Green or Steel Grey - with the only storage option being 64GB in the UK, with a 128GB variant available elsewhere.",
    "The Moto G50 feels fairly cheap and chunky in your hands thanks to some extensive bezels and its plasticky finish. It's an understandable feeling given the price point and at least you won't have to worry about it struggling to take a few knocks along the way, but it's certainly thick.",
    "This does mean it can feel a bit excessive for those with small hands though, with a bit of stretching needed when reaching for the fingerprint sensor in particular.",
    "Elsewhere, it's business as usual for how the Moto G50 is designed. A USB-C port is at the bottom next to a 3.5mm jack. On the right-hand side there's the volume rocker, power button, and a dedicated Google Assistant button. Annoyingly, you can't remap this, so it may well end up being a button that's a bit pointless in the long run, depending on how you use Google services.",
    "On the back there's the Motorola logo, which also doubles up as the fingerprint sensor, and the three camera lenses are bundled up to the left hand side. All fairly standard and inoffensive then.",
    "The Moto G50 won't set the world on fire with its looks, but inoffensive sums it up well. It feels smooth in your hands thanks to some curved edges and it all feels simply fine if a little plasticky. As you'd expect, it's a fingerprint magnet too, but it's far from the only phone to have this minor flaw.",
    "The Moto G50 has a 6.5-inch IPS LCD display that's only disrupted ever so slightly by the notch for the selfie camera on the top-center of the screen.",
    "Impressively, it offers a 90Hz refresh rate, which isn't something we'd normally see on a phone at this price, but its resolution is a little low at 720 x 1600. Will that matter in everyday use? Not really, but it's a sign that this is still a distinctly budget phone.",
    "Like many aspects of the Moto G50, the display looks fine but there's not much to write home about other than marvelling at how the refresh rate makes things that bit smoother when scrolling through websites at speed.",
    "At least it doesn't have any issues when used in bright exteriors, but other than that, the colors and contrast levels are all fairly standard. Watching YouTube clips or streaming content is fine here, but far from being particularly vibrant.",
    "The Moto G50 has three rear cameras, encompassing one 48MP f/1.7 main camera, a 5MP f/2.4 macro camera, and a 2MP f/2.4 depth camera. There's no ultra-wide lens here and it's sorely missed.",
    "Confusingly, such an omission also makes it feel less capable than both the Moto G10 and Moto G30, which offer four rear cameras including an ultra-wide lens.",
    "Camera quality across the board is reasonably adequate but far from exciting. Colors look reasonable if unexceptional and there's no great depth to your images either. With no optical zoom you won't be able to zoom in particularly well, though the digital zoom will do in a bind, if you simply can't do without zooming.",
    "One thing we do like though is that the Moto G50 spots if you're trying to take a photo in less than ideal lighting and suggests switching over to night mode. Night mode works quite well too for the price of this phone, so it's worthwhile listening to the software recommendation. Just don't expect miracles in particularly low-light scenarios.",
    "To be fair to the Moto G50, its photo quality issues aren't exclusive to this phone. Plenty of others at this price will provide similar results, but we're still a bit disappointed by the lack of an ultra-wide lens, as it makes the whole camera setup less versatile than on some rival handsets.",
    "The selfie camera is a 13MP f/2.2 lens and again, don't expect great details here. However, a beautification slider does go some way to making you feel better.",
    "Video recording is a choice of 1080p at 30fps or 60fps with either front or back camera, and it's pretty speedy at getting going too.",
    "Those who pay attention to Snapdragon chipset numbers may worry that the Snapdragon 480 5G is pretty slow, as it's a lower model number than you might see elsewhere.",
    "However, it's actually fairly new, offering 5G support unlike other low-end Snapdragon chipsets. It also offers reasonable performance. The limited 4GB of RAM means it's rarely exceptional, but you won't be too bothered by switching between apps or loading up games.",
    "We like to test things out with Call of Duty: Mobile, and while it took a bit of time to load, once it gets going, it works pretty well. You won't be too bothered or feel too impatient by this phone's performance. Assuming you temper your expectations to tie in with the price, of course.",
    "During our Geekbench 5 tests, the phone returned a multi-core score of 1,628 and a single-core score of 504. Not bad at all for this price. That's similar to the 1,690 multi-core score of the Moto G9 Plus, and higher than the 1,267 of the Moto G30.",
    "Where you may need to consider buying an upgrade is when it comes to storage. The Moto G50 only has 64GB of space and that feels much smaller once you factor in Android 11's requirements. Fortunately, you can always expand your storage via the microSD card slot.",
    "Some regions are expected to have a 128GB version of the Moto G50, but we weren't able to get our hands on that.",
    "The Moto G50 has a 5,000mAh battery capacity, which coupled with its fairly efficient chipset means battery life is quite strong, and you won't find yourself having to watch the percentage dip throughout the day.",
    "While there's no wireless charging support here or the ability to use reverse charging, the Moto G50 does offer 15W charging, which is faster than some low-end phones. Although, weirdly, the charger it comes bundled with doesn't support it, so you'll need to buy a separate one to enjoy speedier recharges.",
    "However you recharge, expect a good day and a half between charges with certain days lasting even longer, depending on what you're doing.",
    "First reviewed: June 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "Moto G50 price and availability",
    "15": "Design",
    "20": "Display",
    "24": "Camera",
    "31": "Performance and specs",
    "37": "Battery life",
    "40": "Don't buy it if..."
  },
  "links": {
    "Moto G30": "https://www.techradar.com/reviews/moto-g30",
    "Moto G10": "https://www.techradar.com/reviews/moto-g10-review",
    "Moto G9 Plus": "https://www.techradar.com/reviews/moto-g9-plus-review"
  }
}