{
  "source": "https://www.techradar.com/reviews/redstation",
  "title": "Redstation review",
  "category": "computing",
  "updated": "2021-08-02T16:30:15Z",
  "author": "mirza-bahic",
  "summary": "Build your perfect hosting environment on a bare-metal server",
  "verdict": "Redstation is a UK-based web hosting provider offering a wide array of robust, reliable and completely customizable dedicated servers for critical businesses. Since it offers some budget-friendly options as well, it will allow you to set aside some money for the future. However, if you are looking for something dramatically simplified, you might as well keep looking.",
  "pros": [
    "24/7 customer support",
    "Completely customizable dedicated servers",
    "World-class network of data centers",
    "Both cPanel and Plesk are supported",
    "Customers can choose from several pre-packed operating systems"
  ],
  "cons": [
    "No live chat nor knowledgebase",
    "Not suitable for simpler sites"
  ],
  "article": [
    "Established in 1998, for more than two decades Redstation has been providing dedicated servers for mission-critical businesses for its countrymen and global audience alike. Today, Redstation manages thousands of servers, hosts thousands of websites, e-mail accounts and other applications for clients from more than 150 counties throughout the world. They exist as a part of iomart Group Plc (UK’s leading information technology and cloud computing company) and their main office is comfortably situated in Glasgow.",
    "They own all of their eight custom-built data centers that make use of N+1 design and the latest technology, including Free Cooling from GEA Denco, which is making their web hosting solutions a part of the race to make the Earth a greener place (that is, eco-friendly). Their data centers are scattered across the UK and are using on-net locations in the USA, Middle East and Far East.",
    "While emphasizing dedicated and bare metal hosting, Redstation also provides colocation services with several UK sites (London, Manchester, Maidenhead, Nottingham, Gosport, St. Asaph, Glasgow and Leicester), one in the United Arab Emirates (Dubai) and one in Singapore (Singapore).",
    "Redstation’s official site is easy-to-use and it contains a fair share of information about its network, computing services and hosting solutions. However, it doesn’t provide too many insights into the company itself nor its history.",
    "The site features a matching blog with a couple of well-written articles, however, the freshest one dates back to December of 2016, which left us somewhat disenchanted.",
    "You can also find them on LinkedIn, but not on any other popular social media sites.",
    "Redstation’s services include dedicated servers, bare metal cloud, hybrid cloud, GPU servers, as well as reseller, colocation, media streaming, big data and a wide array of similar services. In short, they can provide everything crucial for a mission-critical website running for medium to large businesses with the will to grow.",
    "One of the major advantages of using Redstation’s dedicated servers is an ability to completely customize pretty much everything about it. You can start with hard disc space, memory, RAID configuration, operating system, control panel, software and so forth. The price you’ll pay for this is fully influenced by decisions you made concerning the base configuration of your future server, so it can range from being quite a bargain (for the services you’ll get) to costing a small fortune. Since Redstation promises no minimum contract with its bare metal infrastructure pricing models, you can pay-as-you-go.",
    "As it is often the case with similar companies, Redstation provides no refund policy, but offers a variety of payment methods including most of the major credit/debit cards (with American Express being excluded), bank transfers and PayPal.",
    "Although minimalistic, Redstation’s official site manages to provide a decent deal of information about its key services: bare metal servers, dedicated servers, GPU servers and colocation hosting services. Here you can find out more about their infrastructure in general, data centers, networking solutions, storage options (Pure Storage, Dell and EMC), security solutions and industry certifications they have acquired (PCI, ISO, OHSAS, Cyber Essentials and Data Protection). However, to learn more about these and the options such as pricing, you’ll be required to pick out a solution, book a call (for a free consultation) or create an account with Redstation.",
    "When it comes to hardware, depending on what base system you decide on, you can choose between a few processors (Xeon 4 Core, Dual Xeon 10 Core or Dual Intel Xeon Silver 4114), an amount of memory (128GB, 256GB, 512GB or 1TB of RAM), quantity of hard disk space (anything above 4x500GB SSD will cost extra cash) and whether to include hardware RAID configuration or not.",
    "As for software, you are able to choose an operating system (between several versions of Windows, Linux, VMware ESXi, FreeNAS or your own OS), a control panel (there are a few versions of cPanel and Plesk) and decide if you want MS RDS license or MS SQL licenses.",
    "Some extras are available as well (for extra money) including remote management, a few server SLAs and IP addresses.",
    "Creating an account with Redstation means that you’ll have to provide a fair share of personal information (your full name, e-mail address, telephone number and so on), your billing address (street, town, county, post code, telephone and even fax), security details (create a password and a select a security question) and decide whether you want to provide some additional data or not.",
    "In a matter of seconds your account will be activated and you’ll proceed to Redstation’s dashboard from which you’ll be able to manage everything about your account, domains (register a new or add an existing one), and servers, contact customer support or consult their FAQ section. Despite the fact that Redstation’s UI looks and feels out-of-date, it is quite simple-to-use.",
    "It’s immensely important to point out that besides auto-installation of your OS, there are no additional auto-setup tools. Therefore, if you are not an extremely skillful webmaster, you may notice that you are not quite up to the challenges of hosting with Redstation and should find a more suitable solution.",
    "Among the numerous reasons given as to why you should choose them in the sea of similar web hosting providers, Redstation highlights their “superfast, highly secure, massively scalable, multi-data centers” and fiber network that is completely owned, managed, and maintained by their own network division.",
    "However, after putting Redstation’s official site to the test (provided by our trusty tool GTmetrix) we were confronted with an analysis error as a result of the page not redirecting properly, which is the first time around we were faced with this. When nothing changed after several ill-fated attempts, we decided to switch GTmetrix for another popular tool (Pingdom) and finally got the results. Fortunately (since nobody likes a slow site), Redstation’s website fully loaded in 1.84 seconds. However, there was a full list of recommendations on how to improve the site’s performance resulting in C (74%), which is awfully average.",
    "As for uptime, UptimeRobot (our other trusting tool, but the one that didn’t let us down) had a lot to say about Redstation, but nothing but good words. After monitoring Redstation’s official site for a whole month, not a single suggestion of downtime was recorded, thus justifying their 100% uptime guarantee.",
    "Redstation provides 24/7 (365 days a year) customer support via MyServers customer portal ticketing system and the telephone line. However, live chat is not an option.",
    "Given that live chat is one of the all-time-favorite support channels in general, being swift, efficient and convenient without the burden of real-time conversation or boredom of being put on hold, the lack of it is Redstation’s main weakness in terms of support.",
    "As for self-sufficient support options, Redstation offers a fairly extensive FAQ section covering all the general queries that are divided into nine main categories, but you can also seek the solution by using the search bar. Since they offer no knowledgebase nor how-to guides, if you need more than this, you’ll have to rely on Redstation’s support staff.",
    "However, the scope of support you’ll get seems limited to issues regarding the infrastructure. Therefore, if you have any software concerns or issues, you’ll most likely be left to figure it out on your own.",
    "Just like Redstation, RapidSwitch is a child of the same company (iomart Group plc) and one that shares interests with its sibling, mainly a dedication to highly-flexible bare metal server solutions. In terms of infrastructure, network, services, features and support, these hosts are almost a carbon copy of each other (besides RapidSwitch’s official site being more polished), so you can’t go wrong with either.",
    "Another sibling of Redstation (and RapidSwitch) is Easyspace. However, this sibling is more geared towards newcomers compared to the other two, offering shared hosting as an option, 24/7 live chat support, free domain for one year and user-friendly website builder. On the downside, just like its siblings, Easyspace provides no free trials nor a money-back guarantee.",
    "An excellent alternative to Redstation and its family members for rookies and webmasters alike, is a fan-favorite, beginner-friendly and US-based HostGator. This company is capable of covering everything from basic blogs to big business and all without breaking the bank. That being said, HostGator's dedicated server solutions are pre-built and not as customizable as the ones you can purchase with providers such as Redstation and RapidSwitch.",
    "However, if you are looking for a pocket-friendly shared hosting plan with plenty of attractive features, look no further. All of HostGator's shared hosting packages include free domain registration, free website transfers, free SSL certificate, a tidy sum of one-click installs, HostGator's own drag-and-drop website builder and (unlike all hosts mentioned above) a money-back guarantee and the one valid for a pleasingly long interval of 45 days.",
    "A similar set of features with shared hosting packages, and terrific choices for those searching for WordPress-oriented, VPS and dedicated server solutions are available with Bluehost. Its money-back guarantee might not be as generous as the one with HostGator, but it beats HostGator in terms of security since its complimentary website backups are more customizable and slightly less limited.",
    "If you're after a dedicated server assembled according to your needs and connected on the same day, a secure colocation facility or top-of-the-league hosting for a business-critical website, take a chance with Redstation. What's more, they are as inexpensive as a provider of this kind can get, and you can always start out with the cheapest plans and upgrade it later on.",
    "However, Redstation is by no means geared towards newcomers nor does it provide some simpler hosting solutions such as shared or managed WordPress hosting. This can be found with hosts such as Bluehost, HostGator and (if you want to live green, love green and host green) GreenGeeks."
  ],
  "headers": {
    "6": "Plans and pricing",
    "9": "Ease of use",
    "16": "Speed and experience",
    "19": "Support",
    "23": "The competition",
    "28": "Final verdict"
  },
  "links": {
    "Redstation": "https://www.redstation.com/",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "bare metal hosting": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "colocation services": "https://www.techradar.com/news/best-colocation-hosting",
    "RapidSwitch": "https://www.rapidswitch.com/",
    "Easyspace": "https://www.techradar.com/reviews/easyspace",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "GreenGeeks": "https://www.techradar.com/reviews/greengeeks"
  }
}