{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-buds",
  "title": "Samsung Galaxy Buds review",
  "category": "audio-visual",
  "updated": "2021-11-23T16:16:13Z",
  "author": "olivia-tambini",
  "summary": "We put the Samsung Galaxy Buds to the test",
  "verdict": "If you have a Samsung or other Android phone, the Galaxy Buds offer easy connectivity, a comfortable fit, and a warm, bassy sound. If you don’t, you may miss out on some cool extra features offered by the Samsung Galaxy wearables app.",
  "pros": [
    "Comfortable, secure fit",
    "Stylish design",
    "Easy to pair and use",
    "Powerful bass"
  ],
  "cons": [
    "Ambient sound can be irritating",
    "Touch controls not always accurate"
  ],
  "article": [
    "The Samsung Galaxy Buds are just one of the many models that sought to topple the Apple AirPods' monopoly on the true wireless earbuds market. Alongside their successors, the Samsung Galaxy Buds Plus, the Samsung Galaxy Buds Live, and the Samsung Galaxy Buds Pro, they make up a wider portfolio of Samsung true wireless earbuds, including two generations of the Gear IconX.",
    "As of now, they're some of the cheapest true wireless earbuds Samsung produces and they offer a solid alternative to more expensive options.",
    "Still, if you don't mind paying more, we'd recommend looking at the newer Samsung Galaxy Buds 2 that dropped in 2021. The second version of the earbuds offer noise cancellation, better sound quality, better battery life, wireless charging and are smaller and lighter than the original Samsung Galaxy Buds.",
    "If you're on the fence we recommend reading our Samsung Galaxy Buds 2 vs Galaxy Buds explainer for the full details, but there are some significant advantages by going with the newer (and slightly more expensive) model.",
    "The Samsung Galaxy Buds were released on March 8, 2019 for $149 / £139 / AU$249, making them slightly cheaper than Apple’s AirPods. However, now that they’ve been usurped by a newer model, you can find the original Galaxy Buds for much less than their RRP. In fact, we’ve seen prices drop as low as $80 / £65 / AU$120 recently, and you can bet they’ll drop lower over Black Friday and Cyber Monday.",
    "If you had pre-ordered a Samsung Galaxy S10, Galaxy S10 Plus, or Galaxy S10e, you might have also gotten a free pair of Galaxy Buds thrown in, but unfortunately this offer ended at launch.",
    "Overall, the Samsung Galaxy Buds look very attractive, with a slick all-white design comprising two earbuds and a charging case.",
    "The earbuds themselves look sleek and compact, with subtle rubber wingtips for a secure fit. You get small, medium, and large wingtips and eartips in the box, so you should be able to find a combination that fits your ear snugly.",
    "While the buds feel rather dainty when you first put them in, and at risk of falling out, they're surprisingly stable and comfortable to use.",
    "The lack of wires pulling them down means they stay in the ear through a surprising amount of head turning or bobbing, and we found they survived gym sessions and runs as well as a healthy amount of rocking out.",
    "One cool design feature is the use of a pearlescent material on the outer housing of the buds, which reflects the light beautifully and has an almost holographic effect.",
    "Aside from looking good, the housings act as touch controls, which can be used to play/pause your music, skip tracks, answer and end calls, and launch Samsung’s voice assistant Bixby on compatible devices.",
    "You can customize the long-press action for the Galaxy Buds via the Samsung Galaxy Wearable app (Android only), choose from volume (up on the right, down on the left) or launching Bixby (long press on either bud).",
    "Since our initial review, a Samsung Galaxy Buds update includes hands-free Bixby voice control, plus improved touch controls, and the ability to keep the ambient sound feature on at all times.",
    "The touch controls are convenient, but you have to be supremely precise with your taps, applying enough pressure on the flat part of the buds for them to register your action. On multiple occasions we missed the mark, or didn’t apply enough pressure, which lead us to having to try again (sometimes multiple times).",
    "While this is a mere inconvenience when you're sitting at a desk it becomes more of an issue when you’re on the move and your hand is less steady - like, say, when you're at the gym or out on a run. The good news is that you'll become better attuned to the system over time through use and will eventually get better – although we still don’t have a 100% success rate.",
    "Now onto the charging case; it’s extremely compact, and can easily slide into your pocket when you’re listening on the go.",
    "If you’ve used the Samsung Gear IconX, you’ll notice that the whole package here is much smaller than the last-gen earphones. In fact, it’s 30% smaller and that’s sure to make a difference when you’re keeping these in your pocket.",
    "The case generally feels quite sturdy, with a snap shut lid, and magnets that hold the earbuds in place when they’re not in use.",
    "On the outside of the case you’ll find a small LED that indicates how much battery the case has, whereas an LED inside the case tells you how much charge your earbuds have left.",
    "On the back of the case, there’s a USB-C charger port – the Galaxy Buds come with a USB cable so you can charge the case. The buds themselves have six hours battery life, while the charging case provides an additional seven – pretty good for true wireless buds.",
    "The Samsung Galaxy Wearable app tells you how much battery the buds have left when you pull them out of the case, but it doesn’t tell you how much charge the case has, unlike the Apple AirPods – instead you have to rely on the LED on the outside of the case to tell you how much battery you have left.",
    "One of the most interesting features here is the fact that you can wirelessly charge these headphones in their case. That means if you have a Qi compatible wireless charging pad – if you’ve got one for your phone, it’s probably exactly that – you can just place these on and they’ll charge up.",
    "It’s especially useful considering the new Galaxy S10 range comes with two-way wireless charging.",
    "That means you can set up the feature on your Galaxy S10 phone and place your headphones on the rear of the device to get them charged up as well. It’s smart, and we found it to work seamlessly in our brief testing time.",
    "If you have a Samsung Galaxy S10, Galaxy S10 Plus or Galaxy S10e, pairing the buds is a seamless experience, similar to how the Apple AirPods connect instantly to iPhones.",
    "Connectivity seems to vary between different users; multiple writers on the TechRadar team tested the buds, and while some experienced no connection dropouts, others experienced them regularly.",
    "Most of the issues with connectivity seems to have been addressed by software updates sent out by Samsung, but as with most true wireless buds, you may experience connection dropouts if you are using them nearby other Bluetooth devices.",
    "Since the most recent update, we haven't experienced any significant Bluetooth dropouts.",
    "Where Samsung’s previous true wireless buds, the Gear IconX, underwhelmed, the Galaxy Buds seem to shine; with warm, deep bass, and good separation, music sounds great when played through these little buds.",
    "That doesn’t come as a surprise, considering they have been tuned by audio experts AKG.",
    "We started off by listening to Radiohead’s ‘Daydreaming’ and we were impressed by the detail and clarity of the vocal parts, which were complemented by soft cascading piano arpeggios and smooth detuned synths.",
    "Grainy chopped and screwed vocals layered with digital interference pan from left to right coherently, while violin and cellos sweep above and below the mix.",
    "However, the Galaxy Buds really shine when it comes to bass frequencies, which becomes even more apparent when you listen to bassy tracks like Billie Eilish’s ‘Bury A Friend’. On tracks like this, the use of air-displacing dynamic drivers means that you can almost feel the sub bass thumping in your chest – unusual for true wireless earbuds.",
    "We also tested the true wireless buds on the soundtrack of indie puzzle-platformer game Fez, by composer Disasterpeace. When listening to ‘Puzzle’, we were impressed by the Galaxy Buds’ lively treatment of the sound, with distorted sine waves ebbing and flowing while shrieking synths pierced through the mix with clarity. Decaying organ-like arpeggios and bubbling chimes also felt vibrant within the generally warm soundstage.",
    "As a result of that warm and bassy soundstage, mid frequencies can sound slightly recessed; it’s not the most natural sound treatment, so if you’re an audiophile, you may find yourself craving a little more attack in the treble frequencies for a more accurate replication of your music.",
    "Saying that, if you like your music bassy you will probably like the way the Galaxy Buds sound. Of course, they won’t offer the same power or noise isolation as a pair of decent over-ear headphones, but for true wireless buds, the sound quality is very impressive.",
    "A few extra features can be found within the Galaxy Wearable app, including an equalizer, which allows you to switch between different presets, including ‘Bass Boost; we didn’t feel the different presets had a huge effect on the soundstage of these buds, but it’s a nice touch nonetheless.",
    "Through the app you can also turn on 'ambient sound' feature, which mixes in background noise to the music using built-in microphones on the buds – a handy feature if you use want to the use the Galaxy Buds when running and need to hear some external noise for safety reasons.",
    "It can also balance out noises like rumbling traffic, while boosting nearby voices, which allows you to stay alert to environmental noises without compromising the quality of your music.",
    "While this is a useful feature, we did encounter problems with ambient sound in windy weather. In these weather conditions, the sound of the wind was amplified, creating an uncomfortably shrill whistling sound.",
    "If you misplace your Galaxy Buds, you can also use the ‘Find My Earbuds’ feature to track them down. When you enable this feature, the Galaxy Buds play a constant tweeting noise so you can find them quickly.",
    "It feels as though Samsung has finally got it right with the Galaxy Buds, and they represent serious competition for the Apple AirPods in terms of design, sound, and ease of use. We loved the pearlescent effect on the buds outer housing and the sleek design of the case, and we found they felt comfortable and secure.",
    "The sound quality offered by these true wireless buds is also very good indeed, with deep bass, and a wide open soundstage; although, audiophiles may want to look elsewhere for a more natural sound treatment, as the Galaxy Buds do sound very warm.",
    "The stated battery life of six hours for the buds and seven hours for the case seemed about right to us, and while there were connectivity issues before Samsung’s latest software update, these issues seem to have been largely rectified.",
    "The downside here is that other features that are available on the app like ambient noise and the equalizer presets are useful to have, but didn’t always work as effectively as we hoped. These features are also pretty much out of bounds for iOS users, as you can only download the app on devices running Android 5.0 or later.",
    "That said, if you have a Samsung phone and don't want to shell out for the newer Samsung Galaxy Buds Pro, the Galaxy Buds are a fantastic pair of true wireless earbuds, with a few quality-of-life features that make them stand up confidently the competition. If not, you may miss out on these additional features but the high sound quality, comfortable fit, and attractive design means that these buds could be a smart purchase, even for the iOS crowd."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "16": "Samsung Galaxy Buds charging case",
    "25": "Features and performance",
    "37": "Samsung Galaxy Buds app",
    "42": "Final verdict"
  },
  "links": {
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review/reviews/apple-airpods-2019-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Samsung Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "Samsung Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Gear IconX": "https://www.techradar.com/reviews/samsung-gear-iconx-2018",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Samsung Galaxy Buds 2 vs Galaxy Buds": "https://www.techradar.com/news/samsung-galaxy-buds-2-vs-galaxy-buds-whats-new-with-samsungs-entry-level-wireless-earbuds",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Galaxy S10e": "https://www.techradar.com/reviews/samsung-galaxy-s10e",
    "Samsung Galaxy Buds update includes hands-free Bixby voice control": "https://www.techradar.com/news/samsung-galaxy-buds-update-includes-hands-free-bixby-voice-control"
  }
}