{
  "source": "https://www.techradar.com/reviews/oneplus-8-pro",
  "title": "OnePlus 8 Pro review",
  "category": "phones",
  "updated": "2020-10-21T16:33:34.110Z",
  "author": "john-mccann",
  "summary": "The best OnePlus phone ever – and the priciest",
  "verdict": "The OnePlus 8 Pro is a proper flagship phone. No more cutting corners. No more 'flagship killer' underdog mantra. OnePlus is now officially mixing it with the biggest names in mobile. It means the 8 Pro is also its most expensive handset to date, but there's plenty of bang for your buck to justify the cost - plus it's still a shade cheaper than rival Samsung, Apple and Huawei smartphones.",
  "pros": [
    "One of the best displays around",
    "5G and plenty of power",
    "Reverse & fast wireless charging"
  ],
  "cons": [
    "Most expensive OnePlus yet",
    "Sizable rear camera bump",
    "Less storage base model vs 7T Pro"
  ],
  "article": [
    "The OnePlus 8 Pro is a proper flagship phone. Forget previous generations of handsets from the firm, and its 'flagship killer' underdog mantra. OnePlus is now officially mixing it with the biggest names in mobile.",
    "Whereas handsets such as the OnePlus 7 Pro and 7T Pro cut a few corners in order to hit a slightly lower price tag than the competition, the OnePlus 8 Pro isn't pulling any punches – it’s now genuine competition for the likes of the Samsung Galaxy S20 Plus, iPhone 11 Pro and Huawei P40 Pro.",
    "The OnePlus 8 Pro is a true flagship specced to go toe-to-toe with the top phones on the market, while the mid-range OnePlus Nord offers a more affordable option. Since the OnePlus 8T will arrive without a Pro version, the OnePlus 8 Pro is the most advanced phone from the brand coming out this year, packing top-tier specs and features – as well as 5G connectivity.",
    "But we still might see discounts on the OnePlus 8 Pro during the deals seasons like the one leading up to Black Friday on November 27 and Cyber Monday after. Given the phone was released earlier in 2020, any price drop would be celebrated.",
    "OnePlus has slapped the best display it's ever made on the 8 Pro, and the Chinese company goes as far as to say it's the best screen you'll see on a phone all year.",
    "It's a bold claim, and one which may prove unfounded as the year goes on, but take nothing away from this handset: the 6.78-inch 'Fluid Display' with a 120Hz refresh rate, HDR10+ support and QHD resolution is fantastic.",
    "There's a quad camera setup on the rear providing a wealth of photography options through features such as an ultra-wide-angle lens, 30x zoom, powerful night mode, and the firm's new 'color filter' camera that’s designed to give your shots a unique look.",
    "While the cameras are a marked improvement over the snappers on the 7 Pro and 7T Pro, they don't quite hit the same heights as Samsung, Huawei or Google. They are still very good, though.",
    "OnePlus has also, finally, given its fans what they've been asking for by including their most-requested feature: wireless charging.",
    "Not only that, but it's fast wireless charging too, with the ability to get you from zero to 50% in just 30 minutes. The 8 Pro also features the biggest battery ever in a OnePlus phone, and it'll easily last you a day on a single charge.",
    "Add to that the flagship power under the hood that we're used to seeing from OnePlus, with the top-of-the-line Snapdragon 865 chipset teamed with either 8GB or 12GB of RAM, plus the addition of 5G connectivity to both the 8 Pro and its smaller sibling, the OnePlus 8, and it's clear the brand is no longer willing to take a backseat when it comes to any of its specs.",
    "In short, you've got a highly accomplished flagship smartphone on your hands that will even connect to next-gen 5G networks..",
    "The OnePlus 8 Pro was announced on April 14, 2020, and the phone is now on sale in the US and UK. We're still not clear whether the OnePlus 8 Pro will be released in Australia. In a statement, OnePlus told us: \"We are working hard to set up a seamless experience for our fans before we go on sale in Australia\".",
    "The OnePlus 8 Pro will be available in a number of other global markets, including Canada, India, China and a further 27 European countries.",
    "The OnePlus 8 Pro is the most expensive OnePlus smartphone to date. That's not a surprise, as the company has been increasing prices each year to keep pace (and arguably, catch up with bigger increases) with the rest of the market; however, it means the brand is losing the 'affordable flagship' pull which made it a breakthrough success back in the days of the OnePlus One and OnePlus 2.",
    "The OnePlus 8 Pro price starts at $899 / £799 (around AU$1,500) for the 8GB of RAM and 128GB of storage variant. That's £100 more than the OnePlus 7T Pro starting price, and you're getting half the amount of storage in the new 8 Pro (vs 256GB in it predecessor). On the plus side, though, the 7T Pro was only a 4G phone, while the 8 Pro has 5G connectivity.",
    "There are two variants of the OnePlus 8 Pro, with the pricier option setting you back $999 / £899 (around AU$1,700) and bagging you 12GB of RAM and 256GB of storage. That's £100 more than the 'McLaren Edition' of the 7T Pro, which also came with a 12GB+256GB configuration and was 5G enabled.",
    "While OnePlus fans may be a little alarmed by the OnePlus 8 Pro price, it remains cheaper than its top-tier competition: the Samsung Galaxy S20 Plus comes in at $1,199.99 / £999 for 128GB, while the iPhone 11 Pro starts at $999 / £1,049 for 64GB and jumps to $1,149 / £1,199 for 256GB.",
    "The biggest talking point from OnePlus around the OnePlus 8 Pro is its 'Fluid Display'. The firm is extremely proud of what it's equipped the handset with, so much so that it claims this is \"the best screen you'll see all year\".",
    "While that claim is a little premature, coming as it does just four months into 2020, it's fair to say that the OnePlus 8 Pro display is one of the best we've seen on a smartphone.",
    "Its 6.78-inch size, 1440 x 3168 QHD+ resolution, tall 19.8:9 aspect ratio and 513ppi pixel density are par for the course when it comes to flagship smartphones these days, but the OnePlus 8 Pro panel goes further.",
    "Refresh rate is quickly becoming a go-to spec for many phone manufacturers. In a trend that was kick-started by the Razer Phone and its 120Hz screen back in 2017, we've seen a number of manufacturers bring higher refresh rates to their handsets",
    "The benefits of a higher refresh rate include smooth scrolling in apps, and better graphical fluidity in games, which overall provide a more premium experience.",
    "Looking at recently released phones, the Huawei P40 Pro, Google Pixel 4 XL and OnePlus 7T Pro all pack 90Hz screens.",
    "The Samsung Galaxy S20 Plus meanwhile, has 120Hz max settings, although it's not set to this by default – enabling 120Hz on these devices will see resolution drop from QHD+ to Full HD+ in order to preserve power.",
    "Where the OnePlus 8 Pro differs is that 120Hz is switched on by default, although at 'only' Full HD+. However, dive into the settings and you can switch to 120Hz at the higher QHD+ resolution (this is also possible on the Oppo Find X2 Pro).",
    "OnePlus says it's done a lot of optimization work to try and ensure battery life is preserved while still offering the maximum resolution and refresh rate – and based on our time with the phone it appears that this has paid dividends. Battery drain at QHD+ and 120Hz is slightly faster than at the lower-resolution setting, but the difference is minimal from our experience of gaming and watching video.",
    "OnePlus isn't done there though. Independent screen tester DisplayMate has awarded the OnePlus 8 Pro an A+ grade, with the handset offering an industry-leading 1300 nits peak brightness and top-level color accuracy.",
    "What all of this means is everything looks great on screen. From photos and websites to videos and games, the OnePlus 8 Pro packs color and detail, and offers excellent viewing angles.",
    "When it comes to video playback, content can be enhanced further with two additional settings – you can switch on 'vibrant color effect pro' and 'motion graphics smoothing' for a richer viewing experience.",
    "'Vibrant color effect pro' optimizes the colors and contrast in videos to provide a more vibrant picture, which is noticeable in especially colorful shows and films, and will please those who like a little more 'pop' from their picture.",
    "Meanwhile, 'motion graphics smoothing' increases the frame rate of the video for clearer playback. This mode only works for select apps (including Gallery, YouTube, Netflix and Prime Video), and when the video in these apps is made full screen. By increasing the frame rate, movements become smoother, but whether or not you like the result will be a matter of personal taste.",
    "Some will enjoy the ultra-smooth playback, and it's impressive to see just what the technology is capable of, as it works well; for others, though, movements may appear a little unnatural and off-putting. We watched a variety of shows and movies with 'motion graphics smoothing' on, and in scenes where there’s a lot of crowd movement people can look like they're a little too fluid.",
    "Both of these settings are turned off by default, so if you're not a fan of how they adapt your viewing experience it's easy enough to leave them off.",
    "One slight issue we did have with the OnePlus 8 Pro display was false touches. Where some handsets have 'palm rejection' which detects when your hand is resting on the side of the display and not trying to interact with it, the 8 Pro doesn't and this means your palm is sometimes mistaken for a touch input.",
    "It doesn't happen all the time, but it can be frustrating when you're playing a game and the 8 Pro mistakes your palm or supporting finger for a touch command. We'll take any excuse we can when we lose.",
    "The OnePlus 8 Pro looks like most other high-end smartphones. The front is dominated by the large 6.78-inch display which curves over each vertical edge, with the front and rear glass sandwiching a metal frame that runs around the circumference of the body.",
    "Our review unit came in Glacial Green, and along with the Ultramarine Blue option, it boasts a matte-frosted Gorilla Glass on the rear, which is smooth and inviting to the touch.",
    "It feels more tactile than the glass on the rear of the Galaxy S20 Plus and iPhone 11 Pro, and enhances the feel of the phone in the hand. It doesn’t provide much in the way of grip though, and the 8 Pro can be a little slippy.",
    "Of course, that won’t be an issue if you opt to slip the OnePlus 8 Pro into the translucent silicone case that’s included in the box. This detracts from the premium aesthetic, as any generic case does, but you can at least still see the fetching green color – and it provides protection for the sizable camera bump protrusion.",
    "We’d recommend utilizing the case if you’re someone who isn’t overly careful with their smartphone. The camera bump is noticeable whether or not you have the case on, and we sometimes found ourselves catching our fingers on it.",
    "The vertical camera stack in this bump is par for the course design-wise – pretty much every manufacturer has enlarged its camera housing recently, so it’s difficult to mark the OnePlus 8 Pro down too much here.",
    "At 165.3 x 74.35 x 8.5mm the OnePlus 8 Pro is a large handset, and many users will find that two hands are required to hold it securely. It’s taller and wider than the Galaxy S20 Plus, P40 Pro and iPhone 11 Pro – although it does have a larger screen than all three – while weight-wise it sits in the middle of the pack at 199g.",
    "There’s just one port on the 8 Pro, and that’s the USB-C port on the base – there’s no 3.5mm headphone jack here. This is flanked by the dual-slot SIM tray and a speaker (one of two on the phone), the latter of which can be muffled by your hand when gaming or watching video when the phone is held in landscape orientation.",
    "The power/lock key is on the right of the handset – a double-press of this will launch the camera, while a long press will fire up Google Assistant. Above this is OnePlus’ handy alert slider, which enables you to quickly switch between silent, vibrate and sound-on modes; a textured finish makes it easy to locate and slide.",
    "On the left side are the volume keys, which are easy enough to reach when you’re holding the phone one-handed, although those with smaller palms may find themselves shuffling the 8 Pro slightly in order to hit volume up.",
    "One feature that was on the 7 Pro and 7T Pro, but which OnePlus has dropped here, is the pop-up selfie camera, with the OnePlus 8 Pro featuring a circular punch-hole camera cutout in the top-left corner of the screen instead.",
    "It’s the first time OnePlus adopted this design for the front-facing camera, and it says it’s made the switch because ditching the moving mechanism frees up space inside the phone and reduces the weight.",
    "The punch-hole measures just 3.8mm in diameter, which means it doesn’t take up too much space – notifications sit comfortably beside it, and in day-to-day use we generally forgot it was there.",
    "The OnePlus 8 Pro is the first handset from the brand to carry an official IP rating, which means it’s officially protected against dust and water. While previous generations have been dust- and water-resistant, OnePlus has never supplied an official rating.",
    "With a rating of IP68, the OnePlus 8 Pro is protected against total dust ingress, and against submersion in up to one meter of water for 30 minutes – which means you should be okay if your phone takes an accidental dunking in the bath.",
    "The OnePlus 8 Pro is available in three colors; Glacial Green, Onyx Black and Ultramarine Blue. In the UK you’ll only be able to pick the 8 Pro up in the green and black hues, while we’re still waiting to hear which colors will be available in other countries.",
    "The OnePlus 8 Pro comes with four rear cameras, the first time OnePlus has loaded a quad-camera setup on a handset. It means business, and that's shown first up by the fact it’s put not one, but two 48MP Sony sensors.",
    "When you fire up the camera on the 8 Pro you’ll be looking at the view from the 48MP main sensor - the biggest OnePlus has ever used, which sits in the middle of the vertical camera stack on the rear of the handset.",
    "It’s a Sony IMX689 sensor with a f/1.78 aperture with OIS (optical image stabilization) and EIS (electronic image stabilization) and offers up 4K video recording.",
    "Above this is another 48MP sensor in the form of the ultra-wide angle Sony IMX586 with a f/2.2 aperture and 119.7 degree field of view. That’s not the widest camera we’ve seen on a smartphone, but it provides a way of fitting in extra landscape into each shot.",
    "At the bottom of the stack there’s the new 5MP 'color filter' lens, with a f/2.4 aperture and with the sole purpose of bringing Instagram-like filters directly into the camera app.",
    "Finally, the fourth sensor on the rear of the OnePlus 8 Pro actually sits to the left of the main camera bump, and is the phone's 8MP telephoto sensor which enables the 3x optical and 30x digital zoom on the handset.",
    "We have seen handsets bring greater zoom levels than this - such as the 100x zoom on the Galaxy S20 Ultra - but OnePlus claims its audience isn’t asking for anything greater than 30x, for now.",
    "There's plenty of photography hardware at your fingertips, so how does it perform?",
    "The OnePlus 8 Pro cameras are a big improvement over the camera setups found on the 7 Pro and 7T Pro. The 8 Pro produces photos which far more closely resemble real-life in terms of colors.",
    "What it means is they lack the colorful 'pop' of rivals, such as the Samsung Galaxy S20 Plus, which enhance hues to make images look more visually alluring.",
    "The default shooting mode when you open up the app uses the main 48MP camera, but images are actually set to capture at 12MP. There's a toggle at the top of the screen which allows you to switch between 12MP and 48MP modes.",
    "You'll want to keep it at 12MP most of the time though, as this mode offers better dynamic range, for more colorful shots. You only really want to move to the 48MP mode when you're shooting in a well lit environment outdoors.",
    "48MP images do carry a lot more detail, but colors aren't as vibrant and the file size for each image shoots up from 4-6MB to 14-20MB. With at least 128GB under the hood, it's not like you're going to run out of space anytime soon, but it's worth bearing in mind, especially if you're planning on saving them to the cloud or uploading to social media.",
    "There are plenty of features built in, including 3x, 10x and 30x zoom, nightscape for low-light situations and the color filter lens provides four different, easily accessible effects to alter your images.",
    "They're not all that different to filters you'd find on Instagram, so their inclusion in the camera app of the OnePlus 8 Pro feels a little surplus to requirements - but they don't get in the way if you don't want to use them.",
    "Nightscape is the mode to use in low-light situations and, as the name suggests, at night. We've used a whole host of different smartphone night modes, and the OnePlus 8 Pro's effort sits somewhere in the middle.",
    "It does brighten up darker pictures, plus it only takes 2-3 seconds to snap a picture, whereas some night modes can take up to 10. The results aren't always a good though, with shots taken with very little light source struggling to pick out details and appearing muddy.",
    "We put the zoom of the OnePlus 8 Pro to the test, with the OnePlus 7T Pro and Samsung Galaxy S20 Plus joining in the fun. We snapped the same shot at ultrawide, 1x, 3x, 10x and 30x (not on the 7T Pro) on the three handsets to see how they stacked up.",
    "OnePlus 8 Pro vs Samsung Galaxy S20 Plus vs OnePlus 7T Pro: Ultrawide",
    "We can see from the sample images that the OnePlus 8 Pro captures consistently good detail at all zoom ranges versus the other phones, but shots don’t appear as colorful as the Samsung or even its predecessor.",
    "OnePlus 8 Pro vs S20 Plus vs 7T Pro: 1x zoom",
    "This may seem disappointing initially, but the OnePlus 8 Pro captured the most true-to-life colors. While the 7T Pro and S20 Plus capture bolder, eye-catching colors, it’s not representative of what we could see out of the window.",
    "OnePlus 8 Pro vs S20 Plus vs 7T Pro: 3x zoom",
    "For some people the mix of vibrant colors and detail of the Galaxy S20 Plus will be more appealing, but for those looking for a camera phone which generates shots closer to real life the OnePlus 8 Pro is the better option - even if its detail and clarity isn’t quite up to Samsung's level.",
    "OnePlus 8 Pro vs S20 Plus vs 7T Pro: 10x zoom",
    "At the maximum zoom level, image detail gets pretty grainy as the phone is relying on a digital zoom and software smarts to produce the image. The 7T Pro maxed out at 10x, so our final comparison is between the OnePlus 8 Pro and S20 Plus.",
    "We used a tripod for all our zoom capture shots, as camera shake gets pretty bad on any phone when you go beyond 10x. If you're going to be shooting handheld at 10x or 30x with the OnePlus 8 Pro we strongly recommend you find a surface to brace yourself against.",
    "OnePlus 8 Pro vs S20 Plus: 30x zoom",
    "The OnePlus 8 Pro comes with a sizable 4,510mAh battery, which is the biggest OnePlus has ever put in a handset, and larger than the power pack you'll find in the Samsung Galaxy S20 Plus, Huawei P40 Pro and iPhone 11 Pro.",
    "It should come as no surprise, then, that we found the OnePlus 8 Pro could comfortably last a full day on a single charge with typical usage including gaming, video playback, social media, messaging, video calls and photography.",
    "We often ended the day with double digits left in the tank, although if you're planning a few hours of video - especially with the enhancements on - you'll likely be reaching for a charger by the evening.",
    "We ran a 90-minute Full HD video test on the 8 Pro, with the screen brightness set to maximum and accounts syncing over Wi-Fi in the background, and the phone lost just 10% of juice in both Full HD+ and QHD+ resolutions.",
    "The battery drain does seem to be faster when you switch on the video enhancements (the aforementioned vibrant color effect pro and motion graphics smoothing), so you’ll want to keep an eye on battery life if you’re watching a movie with these settings enabled.",
    "OnePlus has upgraded its Warp Charge 30T charging, to get you from 0% to 50% in 23 minutes via a wired connection (and the bundled plug block in the box), but there's also a more exciting new addition.",
    "For the first time here, OnePlus has included wireless charging in one of its handsets. The technology is called Warp Charge 30 Wireless, and it takes you from 1% to 50% in 30 minutes – the only caveat is that you need to use the OnePlus Warp Charge 30 wireless charging pad to achieve these super wire-free speeds.",
    "The charging pad is an additional cost, sold separately for £69 (around $80, AU$130). It works, too. We found the 8 Pro was able to meet the quoted 50% in 30 minutes charge time, but it's not a silent process.",
    "There's a small fan built into the Warp Charge 30 wireless charger, to keep things cool during the intense charging process, and this makes an audible whirring noise.",
    "It's loud enough to be a distraction if you have the charger sitting on your desk while you work, but if you put on some light music it'll drown out the sound of the charger.",
    "This noise was a worry as we moved the charger to our nightstand, but thankfully OnePlus has thought about this. The 8 Pro will automatically detect when it's night time, and reduce the speed of the wireless charging. With a reduction of speed, less heat is generated and thus the cooling fan in the charging stand isn't required - so you get a silent top-up.",
    "Another trick the OnePlus 8 Pro has gained is reverse wireless charging. We've seen this technology already on other phones, including ones from Samsung and Huawei, but it’s good to see the tech being embraced by another manufacturer.",
    "It allows you to use your OnePlus 8 Pro as a wireless charging mat to charge other devices compatible with the Qi wireless standard, such as a set of wireless headphones, or even a friend’s handset if they’re hitting single battery life digits.",
    "We found this worked well, and we were able to charge our Apple AirPods and Samsung Galaxy Buds on the rear of the 8 Pro. The feature is easy to toggle on too – just pull the notification shade down and tap Reserve Charging in the quick settings, then place the handset screen-down and pop your device on the rear, just below the square OnePlus logo.",
    "The 8 Pro will automatically switch off reserve charging once its own battery hits 15%, to prevent the phone from being completely drained.",
    "There's plenty of power under the hood of the OnePlus 8 Pro, with the phone featuring Qualcomm's top-of-the-line Snapdragon 865 chipset, which comes with Qualcomm's X55 5G modem to enable super-fast internet speeds, where 5G is available.",
    "This is paired with either 8GB or 12GB of LPDDR5 RAM (depending on whether you opt for 128GB or 256GB of internal storage), which ensures that the OnePlus 8 Pro can handle anything you throw at it, from lengthy Fortnite and PUBG campaigns to box-set binges and movie marathons.",
    "The LPDDR5 RAM is 30% faster and consumes 20% less power than the RAM found in the OnePlus 7T series, which makes it another welcome upgrade in the 8 Pro.",
    "The OnePlus 8 Pro (with 12GB of RAM) recorded an average multi-core benchmark score of 3305 on Geekbench 5.1, which puts it comfortably above the OnePlus 7T Pro's average of 2564 and even sees it beat the Samsung Galaxy S20 Plus, which managed 3,034.",
    "This means the 8 Pro is a supremely powerful device, and one which should be suitably future-proofed in terms of power, as well as connectivity thanks to its 5G capabilities.",
    "Editor’s note: We were unable to test the 8 Pro’s 5G capabilities as we don’t live in an area which has access to the 5G network, and due to the coronavirus lockdown we were unable to travel to a 5G area.",
    "The dual-SIM tray allows you to run two SIM cards simultaneously in the OnePlus 8 Pro, although only one SIM card will be able to access 5G at a time. However, while there's space for two SIM cards, OnePlus continues to shun expandable storage, meaning you have to make do with the stock amount.",
    "Our review unit was the 12GB+256GB configuration, and we found the system took up around 20GB of that space, which means you'll have around 236GB of usable storage, and around 108GB in the 128GB model. If you find yourself running out of space you can make use of cloud storage, for example Google Photos, which enables you to upload all your pictures and videos to the cloud for free.",
    "With all that power inside, and a 120Hz screen, it's no surprise that Android 10 is fast and fluid under thumb. As usual, OnePlus has applied its Oxygen OS interface over the top of Google’s operating system, although for the most part it keeps things relatively stock Android.",
    "What Oxygen OS does offer is additional customization, including a range of quick gestures which can launch the camera, toggle the flashlight, or open an app of your choice. You can also easily tinker with the system’s accent color, icons, font and more from within the settings menu.",
    "There's a full dark mode too (listed under 'Tone' in the settings), for those of you who like the aesthetic, and its availability extends to all of OnePlus' pre-installed apps, including the dialler, messages, camera, gallery and files.",
    "As we mentioned earlier in the review, the OnePlus 8 Pro has a speaker on its bottom edge, and there’s a second speaker right at the top, just above the display, for stereo sound. These speakers have been enhanced with Dolby Atmos technology, providing richer, deeper sound.",
    "The 8 Pro is certainly capable of room-filling sound, and you can comfortably listen to music or watch a video with the volume up high without much in the way of distortion. Still, pairing the handset with a speaker or a decent set of headphones will provide better audio quality.",
    "There's also Wi-Fi 6 and Bluetooth 5.1 support, so if you have a router or accessories which support these technologies you'll be able to take advantage of faster internet speeds and more power-efficient Bluetooth connections."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "OnePlus 8 Pro release date and price",
    "18": "Display",
    "36": "Design",
    "52": "Camera",
    "80": "Battery life",
    "95": "Performance and software",
    "109": "Don't buy it if…"
  },
  "links": {
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "Samsung Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "Huawei P40 Pro": "https://www.techradar.com/reviews/huawei-p40-pro-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "OnePlus One": "https://www.techradar.com/reviews/phones/mobile-phones/oneplus-one-1244307/review",
    "OnePlus 2": "https://www.techradar.com/reviews/phones/mobile-phones/oneplus-2-1300253/review",
    "OnePlus 7T Pro": "https://www.techradar.com/reviews/oneplus-7t-pro-review",
    "Razer Phone": "https://www.techradar.com/reviews/razer-phone-review",
    "Google Pixel 4 XL": "https://www.techradar.com/reviews/google-pixel-4-xl-review",
    "Oppo Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "DisplayMate has awarded": "http://www.displaymate.com/OnePlus_8Pro_ShootOut_1L.htm#Conclusion",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}