{
  "source": "https://www.techradar.com/reviews/demons-souls-review",
  "title": "Demon's Souls review",
  "category": "gaming",
  "updated": "2020-11-19T09:23:19Z",
  "author": "adam-vjestica",
  "summary": "Delightfully devilish",
  "verdict": "Demon’s Souls is a brutal, frequently punishing affair, but the pure elation it offers for those who doggedly persevere is absolutely worth fighting for.",
  "pros": [
    "Next-gen visuals",
    "Super-fast load times",
    "Atmospheric locations"
  ],
  "cons": [
    "Extreme difficulty may deter many",
    "Clunky lock-on system",
    "Can feel overwhelming"
  ],
  "article": [
    "Demon’s Souls forcibly drives home one simple message from the outset: you will die. It doesn’t matter how patient, careful or skilled a player you might be, because sooner or later, you will die.",
    "Accepting this harsh truth is admittedly challenging, almost surprisingly so. And that’s because dying goes against every instinct that’s been instilled into us since video games were first created: we’ve been taught that dying equates to failure. We do everything we can to avoid it, and when it comes, it’s a sign that we’ve been bested.",
    "Cruelly, Demon’s Souls makes death even harder to stomach. Die once, and you’ll drop all the hard-earned souls you collected from slaying the vicious beasts and twisted monsters that litter the corridors of each corrupted world. Souls act as the game’s currency, and you’ll need as many as you can if you want to level up your character, upgrade your weapons and essentially progress in the game.",
    "You can retrieve your hard-earned souls if you’re able to return to the scene where you were ruthlessly vanquished, though. However, should you be felled before you get there (which can sometimes feel inevitable), you’ll lose your precious bounty forever. The sheer anguish that washes over you when that happens is nothing short of horrendous.",
    "Nevertheless, you’ll probably spend the first few hours of Demon’s Souls in denial, believing that somehow everything you’d heard about the game’s punishing difficulty level has been somewhat overblown – like how a crooning Baird embellishes the tales of ordinary men.",
    "Soon enough, though, you’ll be dealt a crushing reality check. Demon’s Souls will mercilessly hammer away at your resolve, drive you to the edge of frustration, and make you question whether the game was designed in conjunction with the demonic creatures it so vividly portrays.",
    "How you react to the immeasurable amount of setbacks you will face is critical, however, as Demon’s Souls won’t falter in its persistence to do you harm. There’s no doubt that some will find the game’s open-ended structure far too confusing, and its rage-inducing wall of difficulty might prove to be simply too much. It will certainly be divisive, and it’s not something you can easily recommend without this caveat in mind.",
    "Others, though, will revel in Demon’s Souls' almost sadistic nature, as the feeling that comes with finally besting a fearsome foe is utterly euphoric, especially if you’ve been on the end of countless beatings. Once you get a taste of victory, then, it’s hard not to want more.",
    "But you might know all of this already. After all, Demon’s Souls on PS5 is a remake of the 2006 action-RPG that became a cult classic on PlayStation 3, a game that single-handedly ushered in a new genre that was eventually dubbed \"Soulsborne\". It also spawned countless takes on the effective formula it so expertly established all those years ago, with some garnering more success than others.",
    "It’s an important, pivotal game in PlayStation’s history, then, but one that was thankfully entrusted to developer Bluepoint Games, who has a sterling track record of rebooting classic, beloved titles for a whole new generation, such as the wonderful Shadow of the Colossus remake on PS4.",
    "Bluepoint Games has completely remade Demon’s Souls from the ground up for PS5, and it's a phenomenal, often breathtaking achievement. Demon’s Souls is the first game that actually looks like it could only run on a next-gen machine, with spectacular lighting, convincing animations and super-fast load times some of the key highlights. If you’ve yet to be impressed by what PlayStation 5 can do in the graphics department, this is the showcase game you’ve been waiting for.",
    "Its sublime presentation values makes it easy to get lost in the splendor of the game’s unsettling environments and labyrinth-like levels. From dilapidated castle ruins to a cesspit of hideous mutants, every world is teeming with an unsettling atmosphere that fills every step you take with dread and trepidation. Knowing that your souls and progress is always on the line makes things even worse.",
    "Combat in Demon’s Souls is predominantly melee based, though projectile weapons and spells are equally as important. Depending on which class of character you choose at the start of the game greatly determines your strengths and weaknesses. Each class has its own set of base stats and characteristics to consider: a Knight is equipped with a comforting coat of armor, but your mobility is stunted, while a Thief is noticeably quicker, more agile, yet considerably weaker and far more susceptible to a killing blow.",
    "It’s this sort of granular level of detail that requires a methodical approach to every situation, and it’s why so many players will experience the game differently. The obstacle is always the same, but there’s a liberating freedom in how you choose to tackle it. Finding the best setup for your playstyle is crucial, then, but there’s really no right or wrong choice.",
    "Demon’s Souls demands your full attention at all times, and that’s what makes it so engaging. Its captivating visuals and excellent 3D audio certainly help in that respect, but it’s the unease that comes with knowing that behind every corner an enemy might be lurking, waiting to pounce, a trap is begging to be sprung, or a thinly-veiled pitfall will send you falling to your untimely demise.",
    "One mistimed swing or rush of blood to the head is swiftly punished in battle, too, and you’ll be unceremoniously sent back to where you started, left to bitterly rue where things went wrong.",
    "But then it’s time to dust yourself off and go again. And again, and again, until you get it right. Learning each enemy’s attack patterns is something that can only be mastered through trial and error, as even seemingly harmless foes can cause a litany of problems if you underestimate them. Is it better to be defensive and only attack at opportune moments? Should you try to isolate an enemy or risk being overwhelmed? Every encounter is a white-knuckled affair that requires strict concentration and a clear strategy in mind.",
    "You’ll also need to keep a keen eye on your stamina, as without it, attacking, dodging and fleeing will be unavailable until it replenishes. It’s all part of the deadly dance as you duel with a monster to the death.",
    "You’re free to tackle Demon’s Souls however you like. Each of the game’s five isolated worlds are open for you to explore, giving you the choice to tackle the game in whichever way you see fit.",
    "The challenges they pose are significantly different, though, with the environments providing just as much of a threat as the gruesome enemies that inhabit it. The volcanic, blistering heat of Stonefang tunnel is at odds with the suspended platforms found in the plague-riddled Valley of Defilement; while the more spacious halls in the Boletarian Palace are a stark contrast to the tight walkways in the Tower of Latria. Again, you’ll need to carefully chart out each step as you slowly learn the ins and outs of each area.",
    "Other human players also populate the world of Demon’s Souls, albeit in spirit form. You can relive the moment a player died in battle by checking the many bloodstains scattered throughout the world, or read and leave important messages on the ground. You can also help or hinder others by invading another player’s game, or help them defeat a troublesome boss.",
    "And speaking of bosses, this is where Demon’s Souls truly shines. You will face insurmountable odds in brutal, epic boss fights that can sometimes last mere seconds if you mess up. At times it can feel like you’re nothing but a harmless fly, buzzing around, barely leaving a dent as your formidable foe swats you away. But when you manage to emerge victorious, well, it’s what makes all the pain leading up to that moment worth it.",
    "To summarize everything that’s included in Demon’s Souls would be a fool’s errand, as there are so many facets and things to discover that are best reserved to one of the many wikis that thankfully grace the internet (don’t be ashamed to use them).",
    "Ultimately, what you need to know is this: Demon’s Souls is unrelentingly brutal at times, but the pay off cannot be understated. If you’re prepared to put in the hours it’ll take to progress, then you will be handsomely rewarded. If, however, you’re easily frustrated, or simply don’t have the time to sink into one game, it’s hard to openly recommend. The steep $70 price tag doesn’t help matters, but if you pay the price of admission, Demon’s Souls is absolutely worth a go. Just brace yourself for the fight of your life."
  ],
  "headers": {
    "4": "Keep on keeping on",
    "8": "The evil within",
    "11": "Time to die",
    "14": "Fight of your life",
    "18": "Wandering spirits",
    "22": "Verdict"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PlayStation 3": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps3-1099856/review",
    "Shadow of the Colossus": "https://www.techradar.com/news/shadow-of-the-colossus-review"
  }
}