{
  "source": "https://www.techradar.com/reviews/amazfit-t-rex-review",
  "title": "Amazfit T-Rex review",
  "category": "wearables",
  "updated": "2020-02-20T11:12:38Z",
  "author": "michael-sawh",
  "summary": "An almost amazing attempt",
  "verdict": "The Amazfit T-Rex offers a whole lot of outdoor watch for your money. Sports tracking is solid overall, and it delivers on the promise of big battery life. If you don’t want to spend big on something to go hiking with and can live with the slightly cheap-feeling build, there’s plenty to like about this watch with the dino name.",
  "pros": [
    "Decent battery life",
    "Solid sports tracking",
    "Good value"
  ],
  "cons": [
    "A bit chunky",
    "Screen can get smudgy",
    "No mapping"
  ],
  "article": [
    "The Amazfit T-Rex is the company’s first sports watch that’s built for the outdoors. With the promise of military-grade durability and big battery life, it can track activities like trail running and open water swimming. It will track those and more for a lot less than it costs to buy an outdoor watch from the likes of Garmin and Suunto.",
    "It joins a rapidly expanding family of Amazfit watches built by Huami, the Chinese brand also responsible for building Xiaomi’s Mi Band fitness trackers. With the T-Rex, the ambition is clear; Huami wants a piece of the outdoor watch action. At a sub-$140/£130 price point, it has every chance of doing that.",
    "Away from its sports watch skills, the T-Rex also serves up smartwatch staples, like viewing notifications and switching up watch faces, to make it useful to have on your wrist when you’re not climbing up the side of a mountain.",
    "There’s definitely room for an affordable outdoor watch, with the likes of the Garmin Instinct along with Suunto’s rugged options still coming in at a significantly higher price. The T-Rex - on paper - has the features to make it a pretty formidable adventure companion.",
    "The Amazfit T-Rex was announced in January 2020 at Amazfit’s CES press conference and went on sale on January 9.",
    "If you want this watch on your wrist, it’s priced at a very affordable $139.90 (around £110, AU$200), putting it above the Amazfit Bip S in pricing terms, but roughly in line with the Apple Watch look-alike the Amazfit GTS.",
    "That price tag also puts it well below the price of Garmin’s Instinct, the cheapest outdoor option in Garmin’s stable of watches. It’s also significantly cheaper than Suunto’s Traverse and Ambit outdoor watches, which have been serving outdoor lovers for a good few years now.",
    "The T-Rex is built to withstand some serious rough and tumble, and that’s exactly what it looks like when you get it out of the box.",
    "What you’ll find is a chunky 47mm watch that measures in at 13.5mm thick, but somehow just feels bulkier than that. Those dimensions suggest you’re getting a watch that matches the size and stature of a Garmin Fenix 6, though it’s clear the Garmin watch carries that heft in a much nicer way.",
    "The Garmin is of course in an entirely different price bracket, and while the T-Rex feels a little bit chunkier than we’d like, it certainly doesn’t weigh heavy on your wrist. At 58g (including the strap and polymer case) you’re getting something that’s very light to wear.",
    "We’re used to praising watches that keep the weight down, but we’d almost prefer a few more grams here. The Amazfit T-Rex is almost toy-like in its lightness with the absence of more high-grade materials.",
    "The look is clearly inspired by the Garmins and Suuntos of this world. There’s a big raised bezel that surrounds the touchscreen display, along with four textured physical buttons that make them easier to locate and press with a pair of gloves on, while those visible screws are a sign of its rugged build.",
    "Huami says the T-Rex is built to military standards, so it can withstand freezing temperatures and extremely humid ones. It has also been slapped with a waterproof rating that means you can take it swimming up to 50 meters deep.",
    "If you care about colors, you can snap the Amazfit T-Rex up in five different shades. There’s gun grey, rock black (the one we tested), camo green, khaki, and army green. All come with the same silicone watch strap, which is very soft and extremely stretchy, and felt fine to wear day and night and during sweaty workouts.",
    "At the heart of the T-Rex is a 1.3-inch, 360 x 360 resolution AMOLED touchscreen. The biggest Samsung Galaxy Watch model offers the same size and resolution, so you’re getting a similar quality display on a watch that costs around half the price.",
    "It’s also up there with Samsung’s in terms of vibrancy and offering a nice pop of color on those data screens. The viewing angles are strong as well, particularly when you just need to quickly glance down at it on a treadmill or out on a run.",
    "Brightness is strong too, even at auto brightness, which is invariably kinder on the battery life. If you want to go to the max though for those night-time adventures, there’s plenty of luminance for your activities.",
    "To up the durability stakes, you’re also getting added protection with Gorilla Glass 3, and the T-Rex has an anti-fingerprint coating, though we did find the screen still managed to get quite smudged up between workouts."
  ],
  "headers": {
    "4": "Amazfit T-Rex release date and price",
    "7": "Design",
    "14": "Display"
  },
  "links": {
    "Amazfit Bip S": "https://www.techradar.com/reviews/amazfit-bip-s-hands-on",
    "Amazfit GTS": "https://www.techradar.com/news/new-huami-amazfit-gts-smartwatch-is-here-and-it-looks-just-like-an-apple-watch",
    "Garmin Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-review"
  }
}