{
  "source": "https://www.techradar.com/reviews/gopro-hero-8-black",
  "title": "GoPro Hero 8 Black review",
  "category": "cameras",
  "updated": "2020-12-01T17:20:38Z",
  "author": "joel-burgess",
  "summary": "This former flagship is now the GoPro sweet spot",
  "verdict": "The Hero 8 Black may lack a couple of features that you can get on its successor (namely, a front-facing screen and 5K video), but it's still a fantastic all-rounder that's compatible with GoPro's Mod accessories. Its 4K video is just as impressive as the Hero 9 Black's, while the HyperSmooth stabilization is almost identical too. The Hero 8 Black improves on earlier GoPros with a higher max bit-rate and 1080p livestreaming too, making it a highly versatile action camera. If you just need a waterproof action cam for travel duty, then it's worth considering the even more affordable Hero 7 Black. But this is a fantastic all-rounder for its new, lower price.",
  "pros": [
    "Excellent image stabilization",
    "Time-saving Capture Presets",
    "Unique time-lapse modes",
    "New built-in mount",
    "Improved microphone",
    "New Media Mods"
  ],
  "cons": [
    "Sub-smartphone picture quality",
    "Poor low-light performance"
  ],
  "article": [
    "The GoPro Hero 8 Black is now the middle child in GoPro's action camera lineup, sitting below the flagship Hero 9 Black and just above the Hero 7 Black. For many people, it'll be the best choice, once you've factored in value – while you miss out on the new flagship's front-facing screen and 5K video powers, its performance is otherwise largely the equal of its pricier sibling.",
    "Why buy the Hero 8 Black over the even cheaper Hero 7 Black? If you want the cliff notes, this action camera has a slimmer form factor, double the shockproof rating, a foldable built-in mount, a new wind resistant microphone and some great new software features for making your videos look better in-action.",
    "It's also compatible with GoPro's Mod accessories – while these were slow coming to market, the Light Mod, Media Mod and Display Mod are all now available to buy, with the latter also helping to compensate for the Hero 8 Black's lack of a front-facing screen.",
    "Those 'Mods' also bring the possibility of a more professional setup, allowing you to improve lighting, sound and visibility.",
    "Under the hood, the Hero 8 Black uses the same GP1 chip and 12MP sensor as the Hero 7 Black, but the company says it's re-written the software for the camera to improve battery performance and squeeze a few more features out of the processor.",
    "This optimization has freed up processing power for new stabilization capabilities that notably improve GoPro’s HyperSmooth and TimeWarp functionalities compared to the Hero 7 Black, for smoother video and time-lapse shots.",
    "Wondering how the Hero 8 Black improved on its predecessor, the Hero 7 Black? Here were all of the big new features it introduced.",
    "HyperSmooth 2.0",
    "More often than not the activities that you want an action camera to capture don't really leave you much room to think about shot composition, so wide-angle lenses and on-camera stabilization are critical. This is why GoPro has focused on making its HyperSmooth video stabilization functionality even better here. HyperSmooth 2.0 is now available across all resolutions and frame rates and improves on what GoPro last year claimed was the best ‘on-camera’ video stabilization available.",
    "HyperSmooth 2.0 offers three modes of stabilization – On, High and Boost. The first two will crop 10% from the Wide lens angle to buffer any bumps, while the Boost mode crops even tighter to take the edge off the serious camera bounces when you’re doing something extreme. HyperSmooth 2.0 brings stabilization features to slow motion footage shot at 120fps and 240 fps, but the Boost mode is limited to framerates of 60fps and under.",
    "While it is exceptional at any forward moving shots, the HyperSmooth 2.0 algorithm does still create some jitteriness in shots that are supposed to pan smoothly. That said, stabilization is only really required for fast-paced, forward-moving shots, so as long as you remember to turn it off for anything indoors or overly cinematic, you shouldn’t have issues.",
    "TimeWarp 2.0",
    "GoPro’s interval photography feature, TimeWarp, has also been updated with the new stabilization software to make it look even better in time lapse clips where the camera is moving. This is an excellent effect if you want to show off an event’s entire sequence within a short period of time without needing a heap of editing. The updated feature has a new auto interval detection that uses an in-built accelerometer to add more frames when there is a lot going on and spread them out during lulls.",
    "Photo updates",
    "There are a handful of photography settings that do more to keep you from pulling your smartphone out to take photos. The first is a LiveBurst mode that captures a series of images 1.5 seconds either side of the point where you push the record button, giving you a burst of 90 frames to choose the best image from, which is great for difficult moving shots. The camera will also now allow you to save images in RAW and the Hero 8 Black software offers improved HDR images for scenes with a broad contrast range and better low-light processing for dark photos and night timelapse videos.",
    "Capture Presets",
    "The Hero range has long had resolution, framerate, lens angle and zoom settings easily accessible on the main interface, but the Hero 8 Black introduces Capture Presets. These customizable settings allow you to preset your favorite 10 image and color settings for various activities and easily switch between them, saving you a lot of time in the field.",
    "Once you’ve gotten used to the camera, though, you realize things like higher framerate shots aren’t great for low-light conditions, wide-angle lenses with high resolutions can’t do the HyperSmooth Boost, and some shots work better with different color settings. There are a lot of things to consider and while this all might be manageable when looking at it at home, it can be a little overwhelming trying to fix in the field. This is where the new Capture Presets really shine as they allow you to customize your camera settings for specific activities or shot types, and flick between them really easily when you need to.",
    "Video modes",
    "In addition to the SuperView, Wide and Linear digital lenses that were available on the Hero 7 Black there is also a new ‘Narrow’ lens perspective for taking footage or photos of people (or close-ups) on the Hero 8 Black. The maximum bitrate for 2.7K and 4K has been increased from 75Mbps to 100Mbps to make those high resolution shots even more professional-looking footage, for anyone willing to sacrifice the extra memory. And Livestream feeds can now be sent in Full HD 1080p resolution directly to Facebook, Youtube or your favorite streaming platform.",
    "GoPro has held on to the same rugged specs since the Hero 5 Black with the 33ft (10m) water resistance returning again this year. There has been some improvement to the shock resistance however, with a new Corning Gorilla Glass lens cover on the Hero 8 Black offering twice the impact resistance of previous models.",
    "Before the Hero 8 Black, GoPro cameras needed an additional frame in order to mount the snappers to, say, a tripod. But like the GoPro Hero 9 Black, this action cam boasts a pair of foldable hinges (which the company calls “fingers”) in the base of the chassis that can be used to mount the camera onto a broad range of GoPro mounts or, when not in use, tucked away for a flat bottom.",
    "This new in-built mount with magnetic clasping is a handy feature that will save you a lot of time in the long run. Because of the addition of the mounting arms, though, the battery door has been relocated from the bottom to the right edge of the unit and is fitted with a new mechanism that secures the unit with a tough compression latch.",
    "The GoPro Hero 8 Black is 0.35oz (10g) heavier than the Hero 7 Black, thanks to the addition of the mounting arms, but this integrated mounting system makes it lighter than its predecessor if you include the weight of the mounting frame. It’s also a few millimeters thinner and narrower than the Hero 7 Black, and a hair taller at 2.61 x 1.91 x 1.12in (66.3 x 48.6 x 28.4mm).",
    "There is a new forward-facing microphone that is better positioned to capture any audio in front of the camera. This new mic features bolstered wind resistance so you can capture more of the sound you actually want. There’s also an additional range of voice commands for the GoPro, allowing you to turn the device on with a wake word or customize command words, if you want.",
    "While the Hero 8 Black’s lithium-ion battery is technically a higher capacity than the one used in the Hero 7 Black, the new camera also draws slightly more power and so it ends up with an identical 1,220mAh lifespan. The new Hero 8 Black batteries are backwards compatible, but you actually won’t be able to get all of the features running on the Hero 8 Black without one of the latest higher discharge batteries, which is a little annoying for anyone hoping to use the Hero 7 Black battery as a spare.",
    "That said, the battery lasts around 50 minutes when continuously shooting in 2.7 or 4K at high frame rates, but you can stretch that out to more like 2 hours for lower resolution footage or TimeWarp videos. You can buy additional batteries to swap out if you need ongoing recording time, otherwise you’ll have to wait around 3 hours and 10 minutes to fully recharge the Hero 8 Black."
  ],
  "headers": {
    "6": "New Features",
    "20": "Build and handling"
  },
  "links": {
    "Hero 7 Black": "https://www.techradar.com/reviews/gopro-hero7-black-review",
    "Hero 5 Black": "https://www.techradar.com/reviews/gopro-hero5-black-review"
  }
}