{
  "source": "https://www.techradar.com/reviews/ticpods-2-pro",
  "title": "TicPods 2 Pro review",
  "category": "audio-visual",
  "updated": "2020-09-08T15:55:54Z",
  "author": "olivia-tambini",
  "summary": "AirPod dupes at a lower price",
  "verdict": "Mobvoi promises an awful lot with the TicPods 2 Pro, including noise cancellation, gesture controls, and built-in artificial intelligence. Unfortunately, these true wireless earbuds don’t quite deliver on these promises, but they could make a decent pair of buds for casual listeners who don’t want to fork out for a pair of Apple AirPods.",
  "pros": [
    "Comfortable fit",
    "Good touch controls",
    "Wide soundstage"
  ],
  "cons": [
    "Tinny sound",
    "Poor noise cancellation",
    "Gesture controls don’t always work"
  ],
  "article": [
    "Mobvoi may be best known for its TicWatch smartwatches, but the Chinese wearable company has branched out into the world of true wireless earbuds in recent years with the TicPods Free, and now, the TicPods Pro 2.",
    "The TicPods 2 Pro are part of a new consort of true wireless earbuds, that boast high-spec tech like noise cancellation, built-in artificial intelligence, and gesture controls – and at a lower price than the Apple AirPods, they’re affordable too.",
    "Can Mobvoi offer all of that at such a low price? Yes and no: we put the budget-friendly earbuds to the test, and they don’t quite deliver on all of their promises.",
    "[Update: There's now a new version of these true wireless earbuds; the TicPods 2 Pro+ come with the ability to listen with one earbud at a time, an upgraded charging case, and new voice command capabilities.]",
    "You can buy the TicPods 2 Pro for $99.99 / £119.99 / AU$209.99, which is a pretty competitive price for true wireless earbuds. That’s cheaper than the Apple AirPods, which start at $159 / £159 / AU$249 (unless you can find a great AirPods deal, that is).",
    "Similarly priced are the £99 (about $130 / AU$185) Lypertek Tevi, which blew us away with their neutral, audiophile-like sound and great battery life.",
    "It’s pretty clear to see where Mobvoi drew inspiration for the TicPods 2 Pro; these Apple AirPod-alikes feature long, protruding stems and fixed eartips, eschewing the silicone eartips seen in the TicPods Free.",
    "The latter’s an interesting move from Mobvoi; after all, the lack of adjustable eartips is a common criticism of the original AirPods, a feature that Apple changed for 2019’s AirPods Pro.",
    "Unlike the AirPods, these wireless earbuds come in a range of trendy colors, including navy, white, and light pink, and boast a far smaller charging case, which features a textured lid, two LEDs to indicate battery life, and a USB-C charging port. Magnets hold the TicPods 2 Pro safely in place while charging.",
    "An IPX4 water-resistance rating means these buds could be used while working out, with the ability to withstand a little sweat or adverse weather conditions.",
    "One of the calling cards of the TicPods 2 Pro is that they’re controllable via voice, gesture, and touch, using Mobvoi's own artificial intelligence technologies TicHear and TicMotion.",
    "TicHear allows you to control your audio playback with your voice, without needing to use a wake word to summon your voice assistant of choice, whether that's Alexa, Google Assistant, or Siri.",
    "For example, you can give commands like \"play music\", \"previous song\" or \"hang up\", giving you a quick way to manage your audio and phone calls. You also summon your voice assistant using a universal wake word if you prefer; simply say \"Hey Tico\" or long-press your earbud, and you're good to go.",
    "We found that this feature worked really well, and we liked having the ability to give commands without using our voice assistant’s wake word first.",
    "TicMotion, on the other hand, worked less well. The idea is that you can control voice calls by moving your head, thanks to built-in motion sensors – that means you can nod your head to accept a call, or shake to decline.",
    "But when trying to accept phone calls using these gestures, we found the tech frequently didn’t work, no matter how hard we shook or nodded our head.",
    "Fortunately, the touch controls worked much more seamlessly. Running your finger up and down the right stem changes the volume, while you can double tap to skip a track or hold your finger down for a few seconds to boot up your voice assistant and ask a question.",
    "With Bluetooth 5.0, pairing these buds with your phone is quick and easy, and we didn’t experience any annoying connection dropouts while using them.",
    "Battery life leaves something to be desired, with four hours in the buds themselves and an additional 23 hours provided by the charging case. The Cambridge Audio Melomania 1, which cost $30 more in the US (and surprisingly, are the same price as the TicPods 2 Pro in the UK) blow this out of the water with an outstanding 45 hours in total.",
    "If the TicPods 2 Pro have built-in noise cancellation, we’re yet to notice it; while using these buds, we were able to hear most of the outside world. Whether that’s down to the poor seal offered by non-silicone eartips or an issue with the active noise cancellation technology itself is unclear – either way, the noise cancellation is definitely sub-par.",
    "For the price, though, the sound quality on offer isn’t bad at all. These buds boast an extremely wide soundstage, with very noticeable left and right panning, which makes them sound very natural, almost as though you’re listening to speakers rather than closed-off headphones.",
    "In Wild Beasts’ A Simple Beautiful Truth, this wide soundstage reveals new details in the delayed guitar riffs and meandering bass lines.",
    "Generally, the TicPods 2 Pro are incredibly treble-heavy, which comes across as harsh at times. Using the Mobvoi app, we toggled through the different preset equalizer settings, including Classic, Pop, Heavy Metal, Bass, and Megabass, hoping to find something a little more rich and bass-friendly. Sadly, these settings didn’t offer a huge discernible difference, aside from increased volume.",
    "Listening to Venom by Little Simz, we found that her vocal came through with a good level of detail, but a lot of the mid and lower frequencies were extremely recessed, with the frenetic wasp-like cellos relegated to the background.",
    "Moving on to 101 FM, bounding synth melodies and fluttering flute gorgeously accented Little Simz’s youthful vocal delivery; however, the bass was still noticeably lacking.",
    "For their price, there’s a lot to like about the TicPods 2 Pro. They’re comfortable, the touch controls work well, and the use of TicHear technology means that you can easily control your music playback and summon your voice assistant of choice with your voice alone.",
    "However, the sound quality isn’t great; despite having an exceptionally wide soundstage for this form factor, the TicPods 2 Pro really lack in warmth and richness, particularly in the mid and bass frequencies. (For better sound we'd recommend the Lypertek Tevi or the Cambridge Audio Melomania 1, which sit at similar price points). Noise cancellation too, is almost non-existent, and we found that the TicMotion gesture controls rarely worked as they were supposed to.",
    "For that reason, we wouldn’t recommend them for audiophiles, or anyone whose specifically looking for noise-cancelling earbuds – however, if you need a cheap pair of true wireless earbuds for casual listening and you don’t want to shell out for a pair of AirPods, the TicPods 2 Pro should get the job done."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "10": "Features and battery life",
    "19": "Performance",
    "25": "Final verdict"
  },
  "links": {
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "TicPods Free": "https://www.techradar.com/reviews/ticpods-free-review",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "AirPods deal": "https://www.techradar.com/news/cheapest-airpods-prices",
    "Lypertek Tevi": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "wireless earbud": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Cambridge Audio Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1",
    "noise-cancelling earbuds": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490"
  }
}