{
  "source": "https://www.techradar.com/reviews/ringcentral-fax",
  "title": "RingCentral Fax review",
  "category": "computing",
  "updated": "2020-10-08T20:13:50Z",
  "author": "daniel-blechynden",
  "summary": "Secure high-volume faxing",
  "verdict": "RingCentral Fax is expensive, but it’s up there with the best online fax services we’ve used. Its interface is tidy and intuitive, and it comes with a great range of features.",
  "pros": [
    "Great for high-volume faxing",
    "Complete office suite available"
  ],
  "cons": [
    "No e-signature integrations",
    "Expensive for low-volume use"
  ],
  "article": [
    "In our RingCentral Fax online fax review, we’ve analyzed one of the best online fax services available. Faxes remain a key feature of the modern business world, and this program provides a simple, secure way to send and receive them from your computer or any other device.",
    "In short, RingCentral Fax provides users with a digital fax number and management interface, eliminating the need for a physical fax machine. At the same time, it emphasizes security and provides a selection of advanced integrated features.",
    "RingCentral Fax is one of the more expensive online fax services available, but it justifies its price with a range of excellent features. For starters, it supports multi-platform use and works equally well on desktops, smartphones, and tablets.",
    "On top of this, you can use it to send group faxes, set up filters to block incoming transmissions without a caller ID, and receive instant notifications when new documents arrive. RingCentral Fax also allows you to receive faxes while you’re on the phone (if you’re using a high-end subscription that supports phone use).",
    "Finally, you can select your number when you create a new RingCentral Fax account. In most cases, you will be able to keep an existing number. Toll-free and local numbers are also supported. Faxes can be routed directly to your email inbox, as well as cloud storage integrations such as for Google Drive, Dropbox, and Box.",
    "Getting started with RingCentral Fax is very straightforward and shouldn’t take you more than a few minutes. Simply select the plan you would like to sign up for and fill in the required information to start a 15-day free trial.",
    "You will be asked to select a number, and there are numerous country and local area codes, vanity, and toll-free options available. Team members can be added to your account if necessary, and then you will be required to add some basic personal and payment information.",
    "We tested the RingCentral Fax desktop app on a Windows 10 computer, and it impressed. The user interface is tidy and intuitive, and it contains the required tools.",
    "The menu on the left of the screen provides access to sent, received, and failed faxes. It will also include contacts, messaging, and video conferencing buttons if you’re signed up for a plan that includes these.",
    "All sent and received faxes are clearly logged with a user ID, date and time, fax number, and the relevant file. You can also search by number to find specific files. It was a little frustrating, though, that we couldn’t search by contact name.",
    "Sending a new fax is also extremely straightforward. Simply enter a contact number, select the cover page language from the 14 supported options, write a cover page note, and attach a file. You can then send it immediately, or schedule for a later date or time.",
    "RingCentral Fax’s security features are passable, but a few small things are lacking. For example, it doesn’t support electronic signatures, which means you can’t sign documents directly within your online fax interface. Received documents also can’t be signed or edited without first being downloaded.",
    "In saying that, though, the platform does provide encrypted, highly secure transmission. All faxes are sent and received through a fully encrypted connection. Along with this, inbound documents can be stored in your password-protected account.",
    "RingCentral offers a range of self-help and live support options. A very clever chatbot is available 24/7, and it will connect you with a live chat agent if you ask it to. The agent we spoke to answered our questions quickly and accurately. Online ticket submission and basic phone support are also available.",
    "On top of this, you will benefit from a suite of self-help resources. These include full technical documentation, an impressive selection of guides, and beginner-friendly video tutorials.",
    "There are four different ways to access RingCentral Fax, with prices starting from $17.99 per month, per user for an annual Fax 1500 subscription (month to month payments increase to $22.99). However, this only includes 1500 pages per month, with additional pages billed at $0.049 per page.",
    "Upgrading to a Standard office plan (from $34.99 per user per month) enables unlimited faxing and access to RingCentral’s business phone, conference call, texting, and team messaging tools. More features are available with a Premium ($44.99/month) and Ultimate ($59.99/month) plan. In addition, discounts are available with annual plans and additional users.",
    "RingCentral Fax is a powerful option, but it’s certainly on the expensive side. Those with a lower budget and limited faxing needs will like MyFax, which starts from $10 per month for 100 pages sent and 200 pages received. Faxage is even more affordable, with 300 pages sent and 300 received for just $7.95 per month. Note, though, that its user interface isn’t nearly as attractive as RingCentral’s.",
    "Overall, RingCentral Fax is up there with the best online fax providers available. It is one of the more expensive options, but its prices are backed by an impressive selection of advanced features and great customer support.",
    "On top of this, all RingCentral Fax transmissions are sent via a fully encrypted connection, and the user interface is simple and intuitive. It’s easy to set up, and a great 15-day free trial is available so you can try before you buy."
  ],
  "headers": {
    "2": "Features and utilities",
    "5": "Setup",
    "7": "Interface and performance",
    "11": "Security",
    "13": "Support",
    "15": "Plans and pricing",
    "17": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "best online fax services available": "https://www.techradar.com/best/best-online-fax-service",
    "RingCentral Fax": "https://www.prf.hn/click/camref:1011l4qw5/pubref:trd-us-6589058980116347000/destination:https%3A%2F%2Fwww.ringcentral.com%2Fplansandpricing%2Fringcentralfax.html",
    "desktops": "https://www.techradar.com/news/best-business-desktop-pcs",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "tablets": "https://www.techradar.com/news/best-business-tablets",
    "email inbox": "https://www.techradar.com/news/best-email-provider",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "documents": "https://www.techradar.com/best/best-document-editing-management-software",
    "MyFax": "https://www.techradar.com/reviews/myfax",
    "Faxage": "https://www.techradar.com/reviews/faxage"
  }
}