{
  "source": "https://www.techradar.com/reviews/samsung-nu8000-un55nu8000",
  "title": "Samsung NU8000 (UN55NU8000, UE55NU8000) review",
  "category": "televisions",
  "updated": "2021-11-10T01:14:16Z",
  "author": "nick-pino",
  "summary": "The Samsung NU8000 is a colorful mid-range TV",
  "verdict": "Samsung’s NU8000 Series offers seriously bright, colorful images – if you don't mind tweaking some settings. That said, while the set encroaches on must-buy territory, the edge-lit LED panel and motion issues keep it from breaking into this year’s best TVs.",
  "pros": [
    "Bright, beautiful colors",
    "Frame-less trim",
    "HDR+ Mode"
  ],
  "cons": [
    "Edge-lit LED",
    "Motion issues",
    "Bixby hurts more than helps"
  ],
  "article": [
    "The Samsung NU8000 (UN55NU8000, UE55NU8000) may not be the best TV money can buy right now, but this is a great mid-range set from Samsung if you need to stick to a budget. It's not exactly cheap, but it has a more affordable price tag than the truly high-end models.",
    "The good news is this screen from the Samsung NU8000 Series doesn't look like a budget TV. It's bright, colorful, and comes stocked with the latest version of Samsung’s Smart TV OS. We've also found it's great for gaming thanks to its wonderfully low input lag, and is capable of producing breathtaking HDR images to boot.",
    "[Update: Be sure to read our Samsung Q95T 4K QLED TV review – we awarded this stunning flagship 4K TV 4.5 out of 5 stars, thanks to its excellent picture quality, great sound, and cool gaming features.]",
    "But it isn't all good news. We have two problems with this screen.",
    "The first is that the Samsung NU8000 is an edge-lit LED-LCD panel. Because it's not full array, this means its control over where light is dispersed isn’t always spot-on.",
    "The second, is that its motion settings can be a challenge to configure. At full blast, you might be subject to the soap opera effect (this is when the image looks artificial and plastic-y like a bad soap opera set) but, turn them off, and you might get motion artifacting. There's a happy medium in the advanced settings, but ultimately these issues are what stops this screen from topping the midsize screen league.",
    "If you're looking for something a bit brighter with a few more control zones? Don't miss out on the excellent TCL 6-Series Roku TV (R617, R615). You can check out some new Samsung TVs in our relevant guide too.",
    "We have some qualms about the NU8000 series, but none of them concern the design itself: out of the box, this is an incredibly visually appealing TV.",
    "The shining design feature of the NU8000 – and the attribute that sets it apart from other TVs in its class – is its lack of a plastic frame around the top and sides of the screen. Without the frame, the TV is ultra-minimalist, clearly taking a page from Samsung’s mobile division.",
    "To prevent any damage to the screen while unboxing it, Samsung provides cardboard guards that stick to the sides and protect the screen – showing that the designers have thought through the setup process from start to finish.",
    "To further maximize this minimalist aesthetic is Samsung’s T-shaped stand with removable back cover that hides wires. It takes seconds to unclip the back covering, weave cables through the stand itself, and come out with a clean install each and every time.",
    "Around the back of the TV you’ll find a nice brushed aluminum finish, plus four HDMI ports, two USB ports, an ethernet port and an RF cable tuner jack - which is perfect if you use an indoor antenna and plan on using Samsung’s neat TV Plus channel directory.",
    "If there’s any nitpick to be made about the TV’s design, it’s that the screen uses a VA panel with edge-lit LED lighting. Despite its best efforts, local screen dimming isn’t excellent and nowhere near as good as OLED panels in a similar price range - but more on that in the performance sections down below.",
    "Design TL;DR: The NU8000 is a seriously gorgeous TV. The lack of a frame around the top and side, plus the elegant T-shape stand, all help to make the design aesthetic match the picture performance.",
    "One of Samsung’s big talking points for its 2018 TVs is how easy they are to setup. Download the Samsung SmartThings app, they say, and you’ll be up and running in no time.",
    "While this generally holds true, it does mean creating a login for Samsung’s SmartThings or remembering a password that you made ages ago. If it saves you time in the long run will ultimately depend how quickly you can sign up for the service or remember said password - any delay, and it might just be that Samsung’s new-and-improved setup takes longer than it did last year.",
    "That said, what you are treated to once you get past the login screen is a phenomenally robust, blazing fast interface. Navigating the nooks and crannies of Tizen feels like an exciting treasure hunt as you never quite know what goodie you’re going to uncover next.",
    "You might try your hand at using Samsung’s TV Plus mode that piles in free streaming channels on top of your existing line-up from your cable provider or OTA antenna. You might wander into the app store, shop around the universal guide or setup a new smart home device with Samsung SmartThings. There’s a gallery mode and a slow-but-tolerable web browser.",
    "Overall, there’s enough on offer here without feeling hopelessly overwhelming, all while providing the key essential streaming services like Netflix and Amazon Prime Video in 4K Ultra HD.",
    "Where the operating system falters is through its dependence on Samsung’s smart assistant, Bixby. While it’s imbued with the power to track down shows, control the smart home and answer queries it rarely does any of the above phenomenally well. Search for “Thor”, for example, and Bixby will insist it heard “Four” – no matter how emphatically you say the name of the god of thunder.",
    "Barring some issues with Bixby that will undoubtedly be fixed in the months to come, overall Tizen with Samsung SmartThings is a supremely smart, comprehensive operating system.",
    "Smart TV TL;DR: Tizen is perfectly packed with content - there’s not too much or too little. Now if only Samsung would’ve used Google Assistant instead of Bixby...",
    "When it comes to taking old HD and SD content and transforming it into fantastic-looking 4K, you need a great upscaling engine. Thankfully, Samsung is no slouch in that arena. To that end, Samsung’s NU8000 does surprisingly well with 1080p - even if it’s a tinge darker and a bit less detailed than similar content played in 4K/HDR.",
    "For example, we played the original Iron Man through FXNow and Chromecast, and it looked surprisingly good for a movie that came out 10-plus years ago. Even though dark scenes lacked a bit of detail they weren’t very grainy – which speaks volumes about the TV’s ability to clean up old content.",
    "Another scene, though, proves there’s still some room to improve: In Iron Man 2, Robert Downey Jr.’s Tony Stark interrogates Mickey Rourke’s Whiplash and the color gradation is super obvious – a problem that might be worse if you’re watching it via Apple TV as the NU8000 automatically changes it to Game Mode.",
    "Things are better when there is less motion and much more color on the screen, but realize that there might be moments where you’ll wonder where everything went wrong.",
    "Thankfully, the NU8000 does a spectacular job when it comes to color and contrast. The key weapon in the NU8000’s arsenal is Samsung’s HDR+ upconversion algorithm that takes SDR content and expands its colors and opens up the contrast of the screen. With it, HD/SDR content won’t look half its age and you’ll get more of a dramatic contrast when watching older films that weren’t shot in HDR.",
    "The issue with HDR+ (and something you’ll want to immediately correct in the settings) is that it automatically changes the color tone to warm - adding a sepia-like filter to the content. If you want to remove the warm hue, you'll need to go into the settings and set the Color Tone back to standard.",
    "Thankfully, Samsung allows a fair bit of customization to the image. You can change the color tone for each of the inputs, turn motion smoothing on/off and affect local contrast by altering how much local dimming the TV is doing.",
    "Without any tampering the images are fine – most times, they’re bright and beautiful. But if you don’t like motion smoothing or are inadvertently put into Game Mode by mistake while watching a movie, however, image quality can go downhill quickly.",
    "HD/SDR TL;DR: It’s not the best upscaling in the world, but the NU8000 definitely has the chops to turn old HD content into watchable faux-4K HDR.",
    "A lot of what was said above in the HD/SDR section applies here in the 4K/HDR section: Most times, images look outstanding with a few minor exceptions.",
    "One of the test pieces of content we used was Planet Earth II on Netflix. In beautiful 4K with HDR+ mode turned on, Planet Earth II looked simply astounding. The colors of the rainforest and the stark contrast-rich areas of the mountains will brighten any AV enthusiast’s day.",
    "Of course, Planet Earth II plays to the TV’s strengths. There’s more color in rainforests and oceans than your typical football stadium, and fast motion is relatively infrequent in the highest mountains in the world. Even when there is motion, it’s usually captured in broad shots with slow pans - rarely is it done by flipping back and forth between cameras.",
    "Take something that the Samsung NU8000 might not be built for - shaky cam footage shot while the cameraman is on foot - and you’ll start to see the screen’s real issues with motion.",
    "The best example of this can be found watching Fastest Car on Netflix. Many of the scenes shot at the racetrack near the end of each episode are all filmed without tripods creating a small problem for the NU8000 where it builds extra frames making the camera shake even harder. You can turn off motion when this happens, but should you switch over to sports you’ll see major artifacting. Sometimes it feels like you can’t win.",
    "Well, unless you’re playing games on it. Then you very much can win.",
    "One of the new features for 2018 was the Auto Game Mode and Game Motion Plus - two technologies that help consoles look and play even better. What happens here is that the NU8000 recognizes that a game console has been plugged in and will purposefully reduce input lag - i.e. the bane of gamers everywhere.",
    "Game Mode, in and of itself would make this TV a gamer’s best friend. But, tack on the brightness, color reproduction - and relatively low price - we talked about earlier, and you truly have one of the best gaming TVs you can buy, even two years later.",
    "4K HDR Performance TL;DR: While weird motion handling hurts the overall image quality, 4K HDR images are bright and beautiful, with good color reproduction.",
    "One might think that, with 40-watt speakers, the NU8000 would have some of the best sound on a flatpanel TV. Sadly, that isn’t the case.",
    "Bass rattles the screen, high volume sound crackles and pops, and mids and highs sound confined. And that’s just some of the issues here.",
    "Concerned that we were hearing something that didn’t exist, we invited friends to try the TV for themselves. Each time, around 50% volume they said they could hear audible crackling and rattling bass - issues that just couldn’t be ignored.",
    "If there’s a bright spot here its that Samsung is attempting to dovetail the great work that its sound labs have done in California with its TV manufacturing business in Korea.",
    "The result are modes like Sound Optimization that analyzes the type of audio content playing on screen and EQs it for you. TV shows will have their dialogue-centric mids enhanced while explosion-laden movies will have their bass emphasized. This software alone doesn’t help the TV overcome its issues with audio but it’s definitely a step in the right direction toward a solution.",
    "The NU8000’s overall score depends which screen size you’re after: many of the prices have changed since we first published this review, but right now the 55-inch TV is priced at $1,000 (£799 / AU$1460). At those prices, it's hard to give the NU8000 a glowing recommendation. The best deal, in our opinion is the 49-inch model, which has also changed since first publication and now comes in at just $850 / £679.",
    "What’s good here is that Samsung has made a colorful, competent mid-range set - it does decent upscaling with some help from HDR+ Mode, Tizen with Bixby is one of the best operating systems on the market and Game Mode is truly useful for that audience. But unfortunately, all that being said, its many downsides keep the NU8000 from becoming a truly stand-out TV in an increasingly crowded section."
  ],
  "headers": {
    "7": "Design",
    "14": "Smart TV (Tizen with Samsung SmartThings)",
    "22": "HD/SDR Performance",
    "31": "4K/HDR Performance",
    "40": "Sound",
    "45": "Verdict",
    "47": "Need a better alternative?"
  },
  "links": {
    "best TV": "https://www.techradar.com/news/best-tv-uk",
    "budget TV": "https://www.techradar.com/best/tvs-under-pound500",
    "Smart TV": "https://www.techradar.com/best/samsung-smart-tv-apps",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Samsung Q95T 4K QLED TV review": "https://www.techradar.com/reviews/samsung-q95t-4k-qled-tv",
    "TCL 6-Series Roku TV (R617, R615)": "https://www.techradar.com/reviews/tcl-6-series-r615-r617",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "indoor antenna": "https://www.techradar.com/news/best-indoor-tv-antennas",
    "smart home device": "https://www.techradar.com/news/smart-home-devices",
    "Samsung SmartThings": "https://www.techradar.com/news/samsung-smartthings-meet-the-center-of-your-future-smart-home",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Amazon Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Apple TV": "https://www.techradar.com/reviews/audio-visual/av-accessories/apple-tv-1269228/review"
  }
}