{
  "source": "https://www.techradar.com/reviews/razer-cortex",
  "title": "Razer Cortex review",
  "category": "computing",
  "updated": "2020-11-03T03:27:08Z",
  "author": "richard-sutherland",
  "summary": "Can Razer Cortex help improve your gaming rig’s performance?",
  "verdict": "Razer Cortex might net you a few more frames per second from your aging gaming rig, but its system optimization tools are limited in scope.",
  "pros": [
    "Useful Game Booster function",
    "Easily customize game quality settings"
  ],
  "cons": [
    "Basic system cleansing",
    "Specific focus on gaming rigs"
  ],
  "article": [
    "Razer Cortex is a free system optimization tool from gaming hardware manufacturer Razer. Its focus is on getting better performance in your games, though it includes a few system utilities for cleaning up your machine and defragging your hard drives.",
    "It may not be one of the best system utilities and repair software for business PCs, but in this Razer Cortex review, we show you how it's one of the top tools for squeezing a few more frames per second (fps) out of a low-specification gaming PC.",
    "Razer Cortex is free to download from the Razer website. It’s available for Windows 7, 8, and 10. Unlike some other free system optimization tools, it doesn’t have ad pop-ups or constantly request that you update to a premium edition. All features are available in the free software.",
    "When you engage Game Booster, it stops non-essential background services and processes that eat up precious memory and CPU time. When you’re finishing playing, you switch off Game Booster, and processes are started up again. You can set Game Booster to start automatically when you launch a game and return the system to normal when you close it.",
    "Razer Cortex’s System Booster works much like other system optimization tools in that it cleans out old files. It can also speed up your computer by performing optimization on disk caches, changing network settings, and disabling unused Windows services. Finally, it can be used to defrag the files used by your games, potentially reducing frame drops caused by excessive disk accesses.",
    "Razer Cortex includes a surprisingly good game deal aggregator that pools the best prices from over 15 game storefronts, including Steam, GOG.com, Humble Store, and Epic. It’s easy to compare prices between storefronts and find the best sales and giveaways. Unfortunately, it only works in a few select countries: the USA, the UK, China, Brazil, France, Germany, and Canada.",
    "Using Razer Cortex to launch and play your games rewards you with Razer Silver, a virtual currency that can be exchanged for Razer hardware and games. It requires 1,000 days of playing at least 10 minutes per day to earn enough Razer Silver for a Deathadder Essential, the cheapest Razer mouse available, so you’re going to need some patience.",
    "Razer Cortex has a bright user interface that’s plastered with the brand’s bright neon green. It’s split into Game Booster, System Booster, Deals, and Rewards.",
    "We found the Game Booster to be legitimately useful when playing games on a mid-spec PC. By carefully choosing which background processes and services to disable in Boost Mode, we were able to recover around 2 GB of RAM. This RAM, now freely available to memory-hungry games, helped reduce frame drops caused by constant disk access. However, on a PC with spare RAM, the effect will be minimal.",
    "The System Booster feature is also quite good. Though the System Clean didn’t clear out as many old files as some other system utilities we’ve tested, it did a better job at removing temporary files left by games and game platforms (GOG Galaxy, Battle.net, Origin, etc.).",
    "The Speed Up optimizer option disables many Windows services yet includes no information on what those services are for. Although there’s a Restore to Windows Default option, we would like to see a few tooltips explaining exactly what each change does.",
    "Razer offers a basic FAQ about Razer Cortex on its website. There’s a Master Guide too, but it was written in 2014 and is woefully out of date. There’s also a Razer Cortex section on the community forum, but it only sees a few posts each week.",
    "If you want support for Razer Cortex, those are your only options. Selecting Razer Software from the Contact Us dropdown just returns a page stating that direct support isn’t available right now due to COVID-19.",
    "If you’re not a gamer, IObit Advanced SystemCare Free is a more comprehensive PC optimization tool. It has a similar user interface to Razer Cortex but includes a much better assortment of file system, security, and registry tools.",
    "We also like AVG TuneUp. It has a smart, modern interface, and like Razer Cortex, it suggests background tasks to disable. However, AVG TuneUp does a better job of explaining what each task does, so you can be more confident about switching off the ones you don’t need.",
    "Razer Cortex is a great free tool that can help improve performance in games, particularly if you’re running titles that demand a large amount of RAM. Razer Cortex can help you recover 1 or 2 GB of memory from background processes, which can be enough to eradicate frame drops caused by disk reads.",
    "It also has serviceable system cleaning features, a game setting optimization tool, and a built-in game deal aggregator. Its focus on gaming and lack of customizability make it a weak choice for the office, but it’s one of the best system optimization tools for gaming PCs."
  ],
  "headers": {
    "2": "Plans and pricing",
    "3": "Features",
    "7": "Interface and in use",
    "11": "Support",
    "13": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "Razer Cortex": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-5251964376170938000&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fcortex",
    "best system utilities and repair software for business PCs": "https://www.techradar.com/best/best-system-utilities-and-repair-software-for-business-pcs",
    "IObit Advanced SystemCare Free": "https://www.techradar.com/reviews/iobit-advanced-systemcare-free",
    "AVG TuneUp": "https://www.techradar.com/reviews/avg-tuneup"
  }
}