{
  "source": "https://www.techradar.com/reviews/bigrock",
  "title": "BigRock review",
  "category": "computing",
  "updated": "2020-11-12T16:30:24Z",
  "author": "mirza-bahic",
  "summary": "Is this Indian web host the right choice for your website?",
  "verdict": "BigRock is a great choice for users on a budget who don't need all of the bells and whistles that other web hosts offer.",
  "pros": [
    "Extremely cheap",
    "Great choice of payment methods",
    "Free website builder included"
  ],
  "cons": [
    "Money-back guarantee only offers account credit",
    "Some features are too basic"
  ],
  "article": [
    "BigRock is an Indian web hosting provider that is part of the Endurance International Group (EIG), which also includes Bluehost, Hostgator, and a number of other hosting providers. They’re ICANN-accredited, and claim to offer prices up to 80% less than other domain registrars, as their focus is mostly on individuals and small businesses. According to their website, they currently power over 6 million domains.",
    "BigRock also has what they call a globally distributed data center, which is a collection of redundant server infrastructure hosting all their products and services. They don’t give any locations of their data centers on their website, however, only claiming that they are made up “of a complex mesh of global servers that interact with each other,” adding, “You are abstracted from worrying about variables such as scalability, uptime, network response etc.”",
    "The hosting provider offers a wide range of different services to suit almost everyone’s needs for extremely cheap. However, the options tend to be relatively basic, so small to medium-sized businesses are likely to find the best value for money here. Some extra charges apply, while getting your money back just means getting it credited to your account, which is not very useful when you intend to leave the provider completely.",
    "The cheapest BigRock hosting plan, Starter, starts at Rs. 99 ($1.59/mo), but they don’t hide that this is the price for a 5-year contract, and you can select the length in a drop-down menu which also shows you the price. This plan will get you 20 GB storage space, 100 GB transfer, 5 emails, and a free SSL certificate.",
    "The next plan, called Advanced, starts at Rs. 179 ($3.49/mo), does not restrict storage space or bandwidth, and adds a free .net domain for a year. The Pro plan (Rs. 319, or $5.39/mo) lets you host an unlimited number of websites, but for the best speed, you should be looking at their Cloud hosting, which starts at Rs. 549 ($5.69/mo) and offers double the speed and four times the scalable resources. Tax is not included in these prices.",
    "To pay, you can use cards, PayPal, cheque, direct deposit, and even your BigRock account balance. You can also get your money back within 30 days, but only as credit to your account.",
    "When you choose the plan you want (and select or deselect the options they automatically add to your cart), you’ll have to give them your name, billing address, and phone number before paying using one of their impressive range of payment methods that includes checks.",
    "The provider will send you your login details to your email address, including a unique Customer ID and a Support PIN that is used to identify you when requesting support. Their dashboard is relatively basic and lets you buy and manage products, follow all your transactions, and offers other account-related options. Every plan includes cPanel, meaning you get access to every feature you’d usually expect here. If you already have a website, feel free to upload it through the File Manager or even using FTP if you prefer that for any reason. Building a website is extremely easy, as Softaculous offers one-click installs for web applications such as WordPress, Joomla, Drupal, et",
    "Last but not least, every plan includes the SitePad website builder, which is especially friendly towards beginners with its drag-and-drop features. This, too, can be enabled through Softaculous and makes for quick and easy website building, as this approach is great for those who want to get their website up and running as soon as they can. Backups, however, are not part of their offer so you’ll have to pay extra for CodeGuard, but you can also make regular manual copies if you prefer.",
    "When it comes to speed, BigRock performed decently on our GTmetrix test, as it took 7.2 seconds to fully load the website, compared to the average 8.4 seconds. However, it also took a whopping 187 requests, more than double the usual 89. Still, this test shows that most customers are unlikely to be displeased with the hosting provider’s performance.",
    "On the other hand, BigRock does not make any uptime guarantees outright, as they claim their “globally distributed” data center is unlikely to fail. Our uptime test, which ran for over a month, showed no downtime at all, so their promise is holding up very well.",
    "BigRock has a wide range of articles and tutorials in their Help Center, including announcements for server maintenance, temporary issues and how to solve them, and everything regarding getting started with the provider. Each section within the knowledgebase has the number of articles in it written in parentheses, making everything neater and easier to follow. You can also simply type your question into the search bar and see what they come up with.",
    "If you’d rather contact a human being for help, you can call their customer service, but to submit a ticket or get access to live chat you’ll need to be an existing customer, logged into the account. You can also send them an email with your enquiry.",
    "Gandi is another affordable hosting provider that is extremely popular locally, in their case in France. BigRock is much cheaper than Gandi, but the latter offers a very generous free trial without any hidden fees. Their biggest difference, however, is location, so that may be the deciding factor for prospective customers.",
    "Aruba and BigRock are comparably cheap, with the former still slightly cheaper for the first year, but it lacks the number of helpful articles that BigRock offers, at least in English. For non-Italian customers, BigRock is the slightly better choice.",
    "When it comes to price, Bluehost is decidedly more expensive than BigRock, but it also offers better service overall. The biggest difference is still location, so US customers may choose Bluehost by default because of their data centers that are within the country.",
    "Customer support is an important factor for many, and even though BigRock offers great guides and tutorials, they are eclipsed by the quality of Hostgator. With video tutorials and detailed how-to guides, beginners will feel more at home at Hostgator, even though they are definitely more expensive than BigRock.",
    "BigRock offers incredibly cheap plans, and even though there are some hidden costs, they are not too exorbitant. Still, customers looking for more than the basic features of any hosting provider would be better off elsewhere. Bluehost and Hostgator are both great alternatives, but for those with simpler needs, BigRock is a great option."
  ],
  "headers": {
    "3": "Plans and pricing",
    "6": "Ease of use",
    "9": "Speed and experience",
    "11": "Support",
    "13": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "BigRock": "https://www.bigrock.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "domain registrars": "https://www.techradar.com/news/best-domain-registrars",
    "Starter": "https://www.bigrock.com/",
    "Advanced": "https://www.bigrock.com/",
    "Pro plan": "https://www.bigrock.com/web-hosting/linux-hosting",
    "Cloud hosting": "https://www.bigrock.com/cloudhosting.php",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Gandi": "https://www.techradar.com/reviews/gandi",
    "Aruba": "https://www.techradar.com/reviews/aruba",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Hostgator": "https://www.techradar.com/reviews/hostgator"
  }
}