{
  "source": "https://www.techradar.com/reviews/samsung-hw-q60r-soundbar",
  "title": "Samsung HW-Q60R Soundbar review",
  "category": "audio-visual",
  "updated": "2020-06-04T10:41:15Z",
  "author": "stephen-withers",
  "summary": "Solid sonic performance but limited on features",
  "verdict": "The Samsung HW-Q60R delivers a strong sonic performance with TV, movies and gaming, but the lack of Dolby Atmos, DTS:X and even Wi-Fi significantly reduces the features it has on offer. It’s a solid entry from Samsung, but there are better options further up the company’s range.",
  "pros": [
    "Solid sonic performance",
    "Powerful subwoofer",
    "Attractive and well made"
  ],
  "cons": [
    "No Atmos/DTS:X",
    "No built-in Wi-Fi"
  ],
  "article": [
    "The Samsung HW-Q60R is a soundbar and subwoofer combination with a 5.1-channel layout and Harman Kardon tuning. Which all sounds great... however it doesn’t support Dolby Atmos and DTS:X object-based audio, or even include built-in Wi-Fi, which might work against it at this price point.",
    "The Samsung HW-Q60R is clearly designed as a lower-priced alternative to the HW-Q70R, but in order to reduce the costs the company has jettisoned too many features. At $499 (£599) it’s still an expensive option compared to much of the competition, and the lack of built-in Wi-Fi puts it at a disadvantage.",
    "For comparison, the higher-end Samsung HW-Q70R Soundbar sells for $699 (£799, AU$1,099) while the ultra high-end Samsung HW-Q90R Soundbar with Dolby Atmos sells for a whopping $1,499 (£1,299 around AU$2,200).",
    "The Samsung HW-Q60R looks identical to the more expensive HW-Q70R with a sleek design and attractive styling. It has the same low profile and solid build quality with metal grilles at the top and front, and a brushed-metal finish to the edges and sides. The soundbar comes in black, and at a width of 1100mm it will complement most large-panel TVs. The discreet design shouldn’t block the screen, but there’s also the option of wall-mounting using provided brackets, screws, and a paper template.",
    "On the right hand side there’s a simple LED display showing basic information on the volume, inputs and sound modes. There are also some equally basic controls for power, input selection and volume on the far right end plate – just in case you misplace the remote.",
    "The zapper itself is the same one Samsung includes with all its soundbars, and it’s an effective controller. The design is ergonomic and includes all the necessary buttons intuitively laid out to make setting up and using the HW-Q60R as easy as possible.",
    "The connections are fairly basic, with an HDMI input, an HDMI output, and an optical digital audio input. There’s also a USB port for firmware updates, and Bluetooth for a wireless connection. However there’s no built-in Wi-Fi, which is unusual at this price.",
    "The Q60R comes with a wireless active subwoofer that packs quite a punch. It measures 205 x 353 x 303mm (WxHxD), weighs in at 6.2kg, has an 6.5-inch side-firing driver, and should pair automatically. You can also tweak the bass levels using the remote if necessary.",
    "Design TL;DR: The attractive styling and discreet design will look good in front of most TVs. Only a lack of built-in Wi-Fi disappoints.",
    "The Samsung HW-Q60R uses a 5.1-channel speaker configuration, with a claimed frequency response of 42Hz to 20kHz and a total claimed power of 360W (both of these figures include the subwoofer). The overall sound quality has been tuned by Harman Kardon in conjunction with Samsung’s Audio Lab in California, and the sub has been designed to integrate seamlessly.",
    "There are three forward-firing speakers, which means the soundbar has a dedicated centre channel for dialogue. The left and right forward-firing speakers are composed of a midrange driver and a tweeter, while the centre speaker and two side-firing speakers use midrange drivers. There are no surrounds, but you can buy wireless rear speakers (SWA-8500S) separately.",
    "While the connectivity is fairly basic, the good news is that the HDMI ports can handle 4K/60p, 4:4:4, HDCP 2.2, and high dynamic range (specifically HDR10, HLG, HDR10+, and Dolby Vision).",
    "Samsung’s decision to not include Wi-Fi is unfortunate, and severely curtails the HW-Q60R’s capabilities: You’re forced to use Bluetooth to stream music, and there’s no support for the SmartThings App, nor does the soundbar work with Alexa. There’s also no Bixby, Google Assistant, AirPlay, Chromecast or Spotify Connect.",
    "In terms of audio formats, the Samsung can decode Dolby and DTS, but unlike the HW-Q70R there’s no support for object-based immersive audio like Dolby Atmos and DTS:X. The lack of Wi-Fi means there’s also no support for high-resolution audio, with the Q60R restricted to AAC, MP3, WAV and OGG.",
    "Features TL;DR: The adaptive sound and gaming technologies are useful, but the lack of built-in Wi-Fi limits the features and there’s no support for Dolby Atmos or DTS:X.",
    "The soundbar does at least include four sound modes: Standard, Surround, Game Pro, and Adaptive Sound. The latter analyses the incoming audio and adapts the acoustics to give you the best sound performance on a scene-by-scene basis using all the available channels.",
    "The Standard mode leaves the audio as it was encoded; the Surround mode is adds a greater sense of envelopment to movies and TV dramas; while the Game Pro mode is designed to make you feel like you’re in the world of the game.",
    "Overall, the Samsung HW-Q60R is functional rather than flashy, but delivers a solid acoustic performance with TV shows, movies, music and gaming. The three front-firing speakers combine effectively with the side-firing drivers to create a wide soundstage, while the subwoofer is effectively integrated and does all the heavy lifting at the low-end.",
    "The result is a soundbar that can handle most types of audio with ease. The lack of high-resolution audio support is a shame, but the HW-Q60R delivers good stereo separation and some excellent imaging. The woofers and tweeters used in the speakers ensure that the mid-range and higher frequencies are well represented, and the sub gives the bass and drums plenty of impact.",
    "Listening to Shakespeare’s Sister’s new EP Ride Again, all the instruments have precise localisation, and the sub creates a solid foundation that gives the drums a deeper edge. The combination of Siobhan’s deeper vocals and Marcella’s falsetto is reproduced with clarity, while the uptempo numbers have plenty of driving rhythm.",
    "The performance with TV shows is equally as impressive, especially where the soundtrack uses a stereo or three-channel mix. News, documentaries and game shows all sound excellent, and the Rugby World Cup certainly benefits, thanks to the soundbar’s ability to create a wide front soundstage that keeps the commentary clear, while enveloping you in the crowd.",
    "The adaptive sound mode often proves highly effective when used in conjunction with normal TV programming. It’s particularly good at drawing out the vocals to ensure they remain clear, and the dedicated centre speaker helps in this regard. The processing is also effective at spreading any music across the front, while picking out sound effects to keep the delivery focused.",
    "Since all the speakers are at the front that’s where the audio is focused. As a result, a 5.1 soundtrack from a show like Mindhunter on Netflix lacks any surround presence. The sense of surround might be minimal, but this can be improved by engaging the Surround mode which up-mixes the audio to add greater width and depth to the soundstage.",
    "The overall sonic signature is often highly effective, thanks to dialogue that remains anchored to the screen and effects that are placed with precision on either side. The subwoofer also plays its part, giving the bass on a show like The Boys (Amazon) greater impact. It doesn’t dive as deep as the HW-Q70R, but it’s certainly good enough for most living rooms.",
    "Performance TL;DR: A solid front soundstage and some decent bass ensure TV shows, movies, music and gaming all sound better, but the lack of immersive audio support is disappointing.",
    "The obvious choice is the Samsung HW-Q70R Soundbar, and although it’s more expensive at $699/£799, it delivers a powerful Atmos and DTS:X performance thanks to upward-firing drivers and a bigger subwoofer. The connections are the same, but there’s also built-in Wi-Fi which means support for the SmartThings app, high-resolution audio, and Amazon Alexa.",
    "For UK readers, the Panasonic SC-HTB900 is also a good alternative at a similar price. This 3.1-channel soundbar can decode Dolby Atmos and DTS:X, using psychoacoustic processing, and has been tuned by Technics. There’s a decent set of features including two HDMI inputs, high-resolution audio support, Bluetooth, Chromecast and the ability to work with Google Assistant.",
    "The Samsung HW-Q60R is a solid entry in the company’s 2019 range of cinematic soundbars. It’s eye-catching and well-made, with a decent subwoofer that’s effectively integrated with the other speakers. Thanks to Harman Kardon’s involvement it performs well with music, and the various sound modes make watching TV shows and movies more fun, and gaming more seamless.",
    "However the lack of support for object-based immersive audio like Dolby Atmos and DTS:X is disappointing at this price. The absence of built-in Wi-Fi is also a shame and limits the playback of high resolution audio, as well as other features.",
    "Unfortunately Samsung has cut one too many corners trying to reach a lower price point, ultimately limiting this soundbar’s appeal."
  ],
  "headers": {
    "1": "Samsung HW-Q60R price",
    "3": "Design",
    "9": "Features",
    "15": "Performance",
    "25": "Other soundbars worth considering...",
    "27": "Final verdict"
  },
  "links": {
    "Samsung HW-Q70R Soundbar": "https://www.techradar.com/reviews/samsung-hw-q70r-soundbar",
    "Samsung HW-Q90R Soundbar with Dolby Atmos": "https://www.techradar.com/reviews/samsung-hw-q90r-soundbar"
  }
}