{
  "source": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
  "title": "Bose Noise Cancelling Headphones 700 review",
  "category": "audio-visual",
  "updated": "2020-08-21T06:29:25Z",
  "author": "olivia-tambini",
  "summary": "Class-leading noise cancellation",
  "verdict": "These brilliant Bose headphones offer class-leading noise cancellation and sound great, but they don't quite beat the Sony WH-1000XM3's in terms of battery life and price. Still, you can't go wrong with this fantastic pair of over-ear headphones.",
  "pros": [
    "Outstanding noise cancelation",
    "Fun, lively sound",
    "Stunning design"
  ],
  "cons": [
    "Battery life could be better",
    "More expensive than the Sony WH-1000XM3s"
  ],
  "article": [
    "If you're looking for the best noise-cancelling headphones, then Bose is a brand you know you can trust. That's largely because its hugely popular QuietComfort range has set the standard for noise cancellation technology since the release of the Bose QC25s way back in 2014.",
    "Fast-forward six years to the present day and, despite the popularity of the QuietComfort range, Bose is shaking things up by releasing a totally new wireless noise-cancelling headphones model. The focus here is on sleek design and “breakthrough” audio tech: meet the Bose Noise Cancelling Headphones 700.",
    "The Bose Noise Cancelling Headphones 700 are available to buy in the US for $399 / £349.95. They've taken a little longer to arrive in Australia (and the limited edition design is only available on the Bose website) where they're priced at $599.95.",
    "That price makes the new over-ear headphones around $50 / £20 / AU$99 more expensive than their predecessors, the highly-rated Bose QuietComfort 35 II headphones, which combined noise-cancellation technology with built-in voice assistance from Google Assistant.",
    "They're also pricier than the our current favorite noise-cancelling headphones, the Sony WH-1000XM3 Wireless Headphones. However, there are now plenty of Bose 700 deals to be found, so it's no longer likely you'll have to fork out the full RRP.",
    "So, what do you get in return for that additional $50? Well, one of the most striking differences between the Bose Noise Cancelling Headphones 700 and the QC 35 IIs, is the design.",
    "Gone are the pleated earcups, visible hinges, and bulky hardware; Bose has taken a completely different design approach with these wireless headphones, and overall, the one-piece aesthetic looks very sleek indeed.",
    "The headphones, which come in black and silver, are crafted around a stainless steel headband. Seamlessly transitioning from a flat to a cylindrical shape, the headphones can be adjusted by simply sliding the earcups up and down the headband, which avoids breaking the smooth lines of the design with clunky sliders.",
    "The earcups have also been streamlined; eschewing the pleated fabric used in the QuietComfort range further heightens that seamless transition from headband to earcup.",
    "While wearing the headphones, we were impressed by how lightweight they felt, with the soft earcups fully enclosing our ears to provide physical noise cancellation, as well as a comfortable fit.",
    "This, alongside the cushioned headband, makes them suitable for long listening sessions, and we can easily see ourselves drifting off on a long haul flight while wearing them.",
    "For some, that lightweight feel will be a welcome feature for tired heads, but it does mean that the headphones feel a little cheaper than their sturdier contemporaries like the Sony WH-1000XM3s.",
    "On the outside of the earcups, there are a few preset buttons (more on those later); however, the majority of the Headphones 700’s functionality can be controlled using the touch-sensitive outer housing on the right earcup.",
    "Unlike the headphones in the QuietComfort range, the Bose Noise-Cancelling Headphones 700 don’t collapse inwardly for safe storage; however, they do fold flat and come with a slick, zip-up carrying case, so they should be suitable for use while commuting or stowing away in your backpack.",
    "To set up the Bose Noise Cancelling Headphones 700, you need to install the Bose Music app to your device, which is free on the Google Play Store and the App Store.",
    "Once you’ve done this, just follow the on-screen instructions to complete the pairing process.",
    "The touch controls are pretty intuitive; swipe up and down on the right earcup to change the volume, tap twice to pause/play your music, and swipe backwards/forwards to skip back and forth through the track listing.",
    "The headphones come with Alexa built in, which means you can simply say ‘Alexa’ to summon Amazon’s virtual assistant.",
    "Google Assistant and Siri can also be summoned by pressing a dedicated button on the right earcup, after which you can use your voice to give commands.",
    "Bose says that the battery life comes in at 20 hours, which we found to be accurate, although you may find this number fluctuates slightly depending on how high you turn up the volume; listening at higher volumes usually results in the battery draining down more quickly.",
    "That battery life is significantly lower than the 30 hours offered by the Sony WH-1000XM3 noise Wireless Headphones, but it’s still more than enough to get you through a few commutes, or a long flight.",
    "Bose has really outdone itself with the Headphones 700 – and a big part of these cans’ appeal, is the sophistication of the noise cancellation they offer.",
    "Traditionally, noise-cancelling headphones have been designed to block out the environmental sounds around you, so that you can hear your music more clearly (or catch some shut-eye on a noisy flight).",
    "This can be really effective if you’re listening to music. If you’re making a phone call however, the person you’re speaking to can still hear everything that’s happening around you, whether you’re standing on a busy street or trying to speak on a rumbling train.",
    "The Bose Noise Cancelling Headphones 700 seek to remedy this, by applying noise-cancelation to phone calls as well as music.",
    "Bose says that this can be achieved thanks to an eight-microphone system; six of which enable traditional noise cancelation so you can hear your music uninterrupted.",
    "Two of these microphones are paired with two separate mics, which work together to isolate your voice and reject environmental noise during phone calls. This means that your voice sounds clearer to the person on the end of the line, with less background noise getting in the way of your conversation.",
    "When we used the headphones during phone calls, we found the call quality to be remarkably clear, even when walking on a busy London street.",
    "There are 11 noise cancellation settings (the QC35 II’s have three by comparison), which can be controlled via the Bose app; three of which can be selected as presets and toggled through using the physical button on the earcup.",
    "We tried toggling between 0 (very light noise cancelation), 5, and 10 (full noise cancelation), while builders in our neighbor’s garden drilled, spoke loudly, and blasted their radio.",
    "Using the headphones at 10, the highest setting, the noise was dampened considerably, and with our music playing too, we couldn’t hear them at all.",
    "If you’re sensitive to the sensation of pressure noise-cancelation can put on the ears, you may prefer these headphones to their predecessors; Bose has managed to avoid that suction-like feeling that’s the downfall of many other noise-canceling models.",
    "Full transparency, which is known by Bose as ‘Conversation Mode’, turns noise cancelation off completely and allows sound to pass through the earcups pretty much interrupted, which means you can have natural conversations without removing your headphones.",
    "There’s no doubt about it: these headphones sound fantastic, with a vibrant, lively character and well-balanced soundstage.",
    "We tested them out on Mark Ronson’s latest album, Late Night Feelings. In Truth (feat. Alicia Keys and The Last Artful, Dodgr), they forcefully conveyed the bubbling sub bass as smoky vocals soar above the clattering industrial drum beats.",
    "Moving on to Nothing Breaks Like a Heart, the bass booms as Miley Cyrus’ heavily reverberated vocal resonates around the soundstage. Towards the end of the track, the sweeping violins swirl amongst the heavy bass and punchy kick drums; these headphones don’t ever sound muddy, though,",
    "The Bose Noise Canceling Headphones 700 offer a great deal of detail and clarity – listening to Falls Creek Boys Choir we were blown away by textures and harmonies we hadn’t noticed when listening to the track in the past.",
    "While that detail is fantastic in most cases, if you’re listening to tracks with a lot of high frequency sound (like snares and hi-hats, for example), the top end can sound slightly harsh – over time, this can be quite fatiguing.",
    "The soundstage is pretty wide for a pair of noise canceling cans, which are notorious for imparting a ‘closed-off’ sound. You won’t get the expansive sound that a pair of luxury audiophile headphones like the Focal Stellia offer, but they don’t feel claustrophobic.",
    "Dutch Uncles’ Oh Yeah is a great track to showcase this wide soundstage; as the staccato verses launches into the 80s synth choruses, the headphones really open up for a truly immersive sound.",
    "Everything Everything’s No Reptiles, with its pulsating beats and heart-stopping piano cascades similarly sounds fantastic, and as the song reaches its climax, the vocal harmonies swell and melt into the chattering synths.",
    "Overall, the Bose Noise Cancelling Headphones sound bold and assertive, and they’re very enjoyable to listen with – we don’t think they quite beat the Sony WH-1000XM3s in this respect, but they’re still very capable .",
    "If you’re looking for a great pair of noise-cancelling headphones, then the Bose Noise Cancelling Headphones 700 are a really good choice.",
    "The noise cancellation technology on offer here is class-leading, which makes them ideal for using on noisy flights and busy commutes.",
    "The sound quality is also very good, and they’re undeniably enjoyable to listen to; however, we don’t think they quite achieve the same dexterity as the Sony WH-1000XM3s.",
    "The battery life is also 10 hours less than Sony headphones, despite costing $50 / £50 / AU$100 more – the Bose model does win out in terms of design though, with its sleek, modern build.",
    "If you’re trying to decide between buying the Sony WH-1000XM3s and the Bose Noise Cancelling Headphones 700, we’d recommend going for the former because of that lower price and better battery life.",
    "That being said, you wouldn’t be making a mistake if you opted for the Bose cans instead (and we wouldn’t blame you if you did) – they sound great, look stunning, and the noise-cancellation is out of this world."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "14": "Features and battery life",
    "21": "Noise cancellation",
    "33": "Sound performance",
    "42": "Final verdict"
  },
  "links": {
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Bose QC25": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/bose-quietcomfort-25-1271292/review",
    "Bose website": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-3752827368766047700/https://www.bose.com.au/en_au/products/headphones/noise_cancelling_headphones/noise-cancelling-headphones-700.html#v=noise_cancelling_headphones_700_soapstone",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Bose QuietComfort 35 II headphones": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "Google Assistant": "https://www.techradar.com/news/9-things-google-assistant-can-do-that-you-may-not-know-about",
    "Sony WH-1000XM3 Wireless Headphones": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Bose 700 deals": "https://www.techradar.com/black-friday/best-headphones-deals",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review"
  }
}