{
  "source": "https://www.techradar.com/reviews/msi-cubi-5-10m-thin-client-mini-pc",
  "title": "MSI Cubi 5 10M thin client mini PC review",
  "category": "computing",
  "updated": "2020-08-14T01:01:48Z",
  "author": "desire-athow",
  "summary": "From MSI comes a small computer with big ambitions",
  "verdict": "The MSI Cubi 5 10M mini PC is not a bad product, far from it, but it suffers from its market placement which pits it against far more aggressive rivals with established credentials and extensive after sales support.",
  "pros": [
    "2.5GbE port"
  ],
  "cons": [
    "No card reader",
    "Expensive for what it offers",
    "No option for onsite support",
    "USB 2.0 ports"
  ],
  "article": [
    "The current pandemic means that space will often be at a premium for “working from homers” and working on a proper keyboard with a large screen is far more comfortable than using a laptop all day long. All in one computers and Mini PC and monitor combos go a long way to make this possible.",
    "The Cubi 5 10M from MSI is a mini PC (sometimes called Nettop or thin client) that is based on Intel’s 10th generation Comet Lake CPU, which is still a 14nm process. This form factor is becoming increasingly popular because of the versatility it offers and manufacturers have been able to pack a lot of firepower in shoebox-sized products without the price premium small computers used to have.",
    "The MSI Cubi 5 10M retails for $700 at Newegg and carries a one-year return-to-base warranty.",
    "MSI designers have adopted a minimalist approach with the Cubi 5 10M with a combination of metal and plastic. There’s plenty of gaps in the chassis to help with cooling as the mini PC has an active heatsink fan. You can easily access the inside of the PC to swap or replace the SSD or the memory.",
    "At 4.41 x 4.57 x 1.75-inch for a weight of just over 1.2lbs, it is surprisingly compact and feels solid. The rear of the mini PC contains a HDMI port, a full-size DisplayPort connector, a 2.5Gbps Ethernet port courtesy of an Intel WGI219V, four USB ports and a proprietary power port.",
    "The front of the Cubi 5 10M houses the power switch, a Type-C USB connector, a LED indicator, two audio ports and another full size USB port. The box did not contain the optional power button switch cable but did come with a short SATA cable and a standard VESA mount.",
    "If you read our review of the Pro 24X 10M, MSI’s newest all-in-one PC, then you will notice that this mini PC packs the same hardware bar, one notable difference.",
    "So there’s the Intel Core i5-10210U CPU, a quad-core laptop processor with a 15W TDP and a base speed of 1.6GHz, 8GB of system memory (Samsung DDR4 SODIMM), a WD SN730 512GB PCIe NVMe solid state drive, an Intel Wireless-AC 9462 802.11ac Wi-Fi module and everything runs on Windows 10 Home. Note that there’s no microphone, external antenna or speakers.",
    "The whole device is powered by a standard 65W power supply unit. A Windows 10 Pro version of the Cubi 5 is also available which comes with twice the system memory for a bit more and, for some, might be the better option. Another one has a 256GB SSD but adds a 1TB hard disk drive, for the same price.",
    "The Cubi 5 10M shines by its average performance; it’s not meant to be a criticism bearing in mind that it uses a laptop CPU and shoves the memory in one slot thereby depriving the unit of any performance improvements due to a dual channel memory configuration.",
    "The embedded Intel UHD graphics subsystem can power two 4K monitors but don’t expect to run anything other than spreadsheets on them, it is far too rudimentary. The SSD is a far more capable unit compared to the SN520 in the Pro 24X AIO. It provides the mini PC with some zing which should prove useful when dealing with a lot of large files.",
    "Dell sells the Optiplex 3070 Micro for just over $610. Note that this price excludes an optional VESA mount. What you get though is a far more powerful Core i5 CPU (with six cores), Windows 10 Pro and three-year onsite warranty. There’s a bewildering array of enterprise-focused features but you only get 256GB storage and the Ethernet port is a 1GbE one.",
    "Even better, at the time of writing, Lenovo offered the Thinkcentre M920 Tiny with a similar configuration to the Dell for a staggeringly low $539. Like its rival, it comes with a smaller 256GB SSD, a slower Gigabit Ethernet port and without a VESA mount. Another notable difference is the lack of wireless capabilities in the base version.",
    "And now, for something different. The ProDesk 405 G4 from HP features an AMD Ryzen 5 2400GE which has “only” four cores but with a faster graphics subsystem. It is far cheaper than the Cubi 5 at only $549 but suffers from the same shortcomings as its Dell and Lenovo competitors.",
    "The standout feature is the 2.5Gb Ethernet port. It is refreshing to see the market finally moving to something better than just Gigabit, especially as faster-than-Gigabit switches and NASes are now widely available without a big price premium.",
    "Still, MSI faces an uphill battle to nibble market share away from the big three PC vendors. Like was the case for the AIO we reviewed from the same vendor a few days ago, the MSI Cubi 5 10M is simply too expensive for what it offers and, since its target is business companies, the lack of default 3-year onsite support is too big of a disadvantage to be ignored.",
    "How can MSI solve this situation? Well, unless they set up a complex and expensive after sales network that runs across multiple territories and slash the price of the Cubi 5, there’s little hope. They could also go after smaller niches or offer the sort of features - like dual Gb Ethernet LAN ports - that the big guys simply can’t afford. Until then, it is sadly a no, from us."
  ],
  "headers": {
    "3": "Design",
    "6": "Hardware",
    "9": "Performance",
    "11": "The competition",
    "14": "Final verdict"
  },
  "links": {
    "thin client": "https://www.techradar.com/best/best-thin-client",
    "Cubi 5 10M": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-1279476852268205000&murl=https%3A%2F%2Fwww.newegg.com%2Fmsi-cubi-5-10m-025us-nettop-computer%2Fp%2FN82E16883152599%3F%26quicklink%3Dtrue",
    "Pro 24X 10M": "https://www.techradar.com/reviews/msi-pro-24x-10m042eu-all-in-one-computer",
    "Optiplex 3070 Micro": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2168673556273279700/https://www.dell.com/en-us/work/shop/desktops-all-in-one-pcs/optiplex-3070-micro/spd/optiplex-3070-micro/s019o3070mffus?configurationid=e8237016-8913-4f29-b6d2-04e76ea9368e#features_section",
    "Thinkcentre M920 Tiny": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-1444334637154055000&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Fdesktops-and-all-in-ones%2Fthinkcentre%2Fm-series-tiny%2FThinkCentre-M920q%2Fp%2F10RRS4AY00",
    "ProDesk 405 G4": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1440611165986749400&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2Fpdp%2Fhp-prodesk-405-g4-desktop-mini-pc-p-6vc52ut-aba-1"
  }
}