{
  "source": "https://www.techradar.com/reviews/hot-vpn",
  "title": "Hot VPN review",
  "category": "computing",
  "updated": "2020-12-09T20:05:27.679Z",
  "author": "sead-fadilpasic",
  "summary": "Slow but user-friendly",
  "verdict": "Hot VPN is a small VPN provider that aims to provide its users with bullet-proof privacy and access to geographically blocked content. However, it cannot unblock the likes of Netflix and its poor speeds might make streaming anything else a challenge. On the positive side, the Windows app is very user-friendly and there's live chat support. Even though we haven’t received a response to our more general queries, the refund request was handled with exceptional speed.",
  "pros": [
    "User-friendly Windows client",
    "Lots of pricing options",
    "Several levels of privacy to choose from",
    "Live chat"
  ],
  "cons": [
    "Poor speeds",
    "Not cheap",
    "Doesn’t unblock Netflix, BBC iPlayer",
    "Lacks transparency",
    "Small server network"
  ],
  "article": [
    "Hot VPN is a virtual private network (VPN) provider that has been securing online privacy of its customers and getting them through (some) geo-blocks since 2006. It offers several VPN packages that depend on the level of privacy you want, allowing you to choose whether you want your connection to be directed through one, two, or four different VPN servers. That said, this provider is still a long way from being one of the best VPN providers, considering it needs to work on its download speeds and transparency.",
    "There are multiple pricing options to choose from. The basic package is called “Standard Anonymity” and can be purchased as a 1-month, 3-month, 6-month, 1-year, 2-year, or 3-year subscription. One month will cost you $11.99, three months $25.99 (equals to $8.66/month), six months $51.99 (or $8.67/month), one year $101.99 (or $8.50/month), two years $195.99 (or $8.17/month), and three years $280.99 (or $7.81/month). This package gets you connected via one server of your choice.",
    "This plan is followed by “Professional Anonymity” or “Double VPN” option which is more expensive but will get you connected via two VPN servers of your choice, through the 1024-bit encryption. The prices start at $25.99 for the 1-month, followed by $72.99 for the 3-month (or $24.33/month), $137.99 for the 6-month (or $23.00/month), $231.99 for the 1-year (or $19.33/month), $450.99 for the 2-year (or $18.79/month), and finally, $670.99 for the 3-year plan (or $18.64/month).",
    "The most expensive package is called “Crazy Anonymity” or “Quad VPN” and, as its name suggests, directs your connection through four different servers of your choice and envelops it in a 2048-bit encryption. Its pricing for the 1-month subscription amounts to a staggering $47.99/month. The 3-month option costs $139.99 (or $46.66/month), the 6-month $259.99 (or $43.33/month), the 1-year $499.99 (or $41.67/month), the 2-year $950.99 (or $39.62/month), and the 3-year $1450.99 (or $40.31/month).",
    "Hot VPN accepts more payment methods than many, and these include credit cards, PayPal, WebMoney, Perfect Money, Bitcoin, Western Union, and bank transfers. All new subscriptions are covered by a 7-day money-back guarantee, while the renewals carry a 3-day money-back guarantee. Your money will be refunded only if you haven’t used up 7GB or more of traffic. Our refund request was handled swiftly and without any issues or unnecessary questions.",
    "There is also a 1-day trial, but it’s not free. The trial for the cheapest package will cost you $2, for the middle plan $3, and for the most expensive option $4. Multiple VPN connections are supported, although we aren’t told how many exactly.",
    "Hot VPN may have some attractive features, but it lacks the finesse and rich native apps of, say, ExpressVPN or the extra features and exceptionally generous money-back guarantee of CyberGhost. It is also far from being the only VPN on the market with multiple VPN “hops”, as proven by the likes of Surfshark, which doesn’t even charge per server that your connection passes at the same time and includes the feature in all of its attractively priced packages. The same goes for NordVPN, which offers the so-called double VPN feature. In addition, all these providers unblock Netflix and BBC iPlayer (and many other services) with ease.",
    "Many of the top-tier VPNs proudly boast their capability to unblock certain popular streaming services, be it Netflix, BBC iPlayer, Hulu, Amazon Prime Video, and others. However, this doesn’t seem to be the case with Hot VPN. Even if it was capable of getting you through the geographical blocks preventing you from accessing them, you’d still have to struggle through poor speeds and significant buffering.",
    "We tried to find out in which country the company behind the VPN - Hot VPN Ltd - is located, but we had no luck, bringing us to the conclusion that Hot VPN is not the most transparent VPN of the bunch. The company never responded to our query about the exact number of servers it has either, but we counted 19 of them in the app, scattered across 13 countries, including in Estonia, Russia, Canada, Ukraine, and others.",
    "Hot VPN hides your online presence using OpenVPN, PPTP, and L2TP connection protocols. Depending on the chosen subscription package, your connection will be protected by either a 1024-bit or 2048-bit encryption key. Inside the app, you can choose whether you want a static or dynamic IP address. The company’s privacy policy is a truly short document which doesn’t unveil much details about what, if any, data is collected when one uses its VPN service. More transparency would certainly be welcome.",
    "This VPN vendor has only one native client - for Windows. It also supports Mac, iOS, Android, and Linux (Ubuntu) devices, but you’ll have to tinker a bit with your device’s settings to enable it. Hot VPN doesn’t have an abundance of useful material on the website, but it does offer detailed setup instructions for all the supported platforms.",
    "If you can’t find the information you were looking for on the website, then we recommend contacting the customer support as it is available 24/7 support via live chat on the website, contact form, Telegram, or via email. We tried asking a few questions via email but never got a response.",
    "After we paid for the service and received the confirmation email, we installed and started the Windows app, entered our credentials and pressed “Connect”. The app connected us randomly to a server in Montreal, Canada, after around 10 seconds of waiting. We tested the download speeds and got a very poor result - only 2.71Mbps on a 70Mbps testing connection.",
    "We then picked out a server location in Germany, expecting better results than with Canada. Indeed, they were better but still very poor, hailing only 7.05Mbps. Server switching doesn’t require ending the active VPN connection and there are useful additions in the app, including a built-in speed test and IP checker.",
    "We tried really hard to like Hot VPN as it has so many pricing options to choose from and its Windows client is convenient and exceptionally easy to get around in. However, the lack of any transparency or communication was just a cherry on top of a half-assed (excuse our French) effort at a solid VPN platform. The server network is tiny, download speeds are low, the capability to circumvent geo-blocks subpar, and it isn’t very budget-friendly, to begin with.",
    "In comparison, the boss-level VPNs such as ExpressVPN can provide exceptional privacy, thousands of servers all over the world, access to all the major geo-restricted VOD services, and highly responsive customer support for whom “24/7” communication isn’t just an empty promise."
  ],
  "headers": {
    "1": "Price",
    "6": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "10": "Support",
    "12": "Speed and experience",
    "14": "Verdict"
  },
  "links": {
    "Hot VPN": "https://www.hotvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "privacy policy": "https://www.hotvpn.com/privacy/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-4029022239365313000"
  }
}