{
  "source": "https://www.techradar.com/reviews/bob-mini-dishwasher-review",
  "title": "Bob Mini Dishwasher review",
  "category": "appliances",
  "updated": "2020-11-06T11:39:21Z",
  "author": "gerald-lynch",
  "summary": "Style and convenience in a small package",
  "verdict": "Compact, good-looking and surprisingly capable with small loads, the Bob Mini Dishwasher is a great alternative to a full size dishwasher for those without the room for a bigger appliance.",
  "pros": [
    "Looks great",
    "Small size easy to accommodate",
    "Installation is simple"
  ],
  "cons": [
    "Will struggle to house larger items",
    "Not quite as thorough as a full size washer"
  ],
  "article": [
    "We’re time-poor, space-limited people. Any gadget that offers a hand with the chores while not encroaching on our much needed living spaces is heartily welcomed. And so is the Bob Mini Dishwasher, an appliance that should fit comfortably into homes that haven’t been able to accommodate a dishwasher previously, and do so with some style.",
    "Compact in its tabletop nature, and simple enough in operation that anyone can set up and install it in minutes without specialist tools, the Bob Mini Dishwasher will be a great timesaver for those living in smaller homes or rented accommodation that doesn’t offer a full-size dishwasher.",
    "With a water tank that can be manually refilled without the need for complex plumbing, its design is stylish enough that you won’t mind having it on show in your kitchen. Relatively small water quantity requirements and compatibility with regular dishwasher tablets help push an eco-friendly message, and while the small capacity won’t be for larger families, it remains competitive against the relatively scant competition. Dishes and glasses wash well, even if grubbier items need a bit more cleaning work – but cleaning quality remains comparable to a full size appliance, which is extremely impressive. It’s a great addition to your line up of appliances.",
    "The Bob Mini Dishwasher is available at the time of writing at a pre-order early-bird advantage price of £299.90 (about $390 / AU$544), direct from its French manufacturers Daan Tech. This is set to rise to £349.90 eventually ($455 / AU$635) – when that will change is not yet clear. Pre-orders made now are expected to be fulfilled before the end of the year.",
    "At £349 RRP, it’s towards the top end of what you can expect to pay for a tabletop dishwasher. But its performance and good looks make it worth the extra expense.",
    "Can a dishwasher really look nice? The Bob Mini Dishwasher proves that it's possible. Made from recyclable materials, it’s a dinky little thing – as far as dishwashers go at least – measuring just 34 x 49 x 49 cm and weighing 10kg (22 lbs). As you’d expect, that makes for quite a compact capacity too – about enough room for two place settings (a few mugs, glasses, plates, bowls, cutlery and a cooking pot, roughly). But if you’ve only the room for a mini dishwasher such as this, you’re likely ready for that limitation.",
    "Back to its good looks, then. The Bob Mini Dishwasher has loads of options to pick from, with 12 colors for the front door and two colors (black or white) for the chassis. A curvy casing and bold colors make it stand out in your kitchen, with an LCD screen, three buttons and Wi-Fi connectivity for choosing and customising cycles (and re-ordering detergent), and a porthole to watch the cleaning process in action. You won’t mind having this appliance on show at all, with the overall design reminding us of the Smeg aesthetic.",
    "When ordering the Bob there are also engraving customisation options (if that’s something you’ve ever thought about for a dishwasher) and an anti-theft lock option – which isn’t as strange as it seems, given its relative portability. Another interesting option, given the ongoing pandemic, is the choice to have a UV light installed instead of the regular light inside. Though you’d want to keep the water off, the suggestion is you can, for instance, put your phone, face mask, wallet and keys in Bob with the light on to clean items.",
    "Setup is simple. The Bob Mini comes with two installation options: you can either have it fixed to the mains like a traditional machine, intaking and expelling water as you would like from a conventional dishwasher from your integrated plumbing. The alternative method, and by far the easier option, allows the user to fill the Bob Mini with a jug of water into an inlet grill on the top of the machine, and have a dirty water outlet tube simply leading from the rear to a sink or drain.",
    "Daan Tech’s intention is to be an eco-friendly product which only consumes 0.35kWh in energy, and less than 3 litres of water per cycle. That’s about five times less than washing by hand, by Daan Tech’s estimates. So you can fill it up quickly and easily this way before each cycle. The Bob Mini lets you know when it is full of water with a digital Game Boy-like bleep.",
    "Though it can be used with off-the-shelf cleaning tablets, Bob can accept two different types of ‘cassette’ full of detergent sold direct from Daan Tech – the ‘Pop’ cassette and the ‘Rock and Roll’ cassette. The Pop cassette is Bob’s equivalent to an all in one detergent and the ‘Rock and Roll’ cassette is what you should use every so often to put Bob through a self-clean maintenance cycle. Both cassettes respectively contain 120ml of cleaning product and are made from recycled plastic. Our sample shipped with the Pop cassette. We can’t comment much further on the Rock and Roll cassette yet, other than it only works for one cycle, and Dan Tech recommends you should run it at least once every 90 cycles – or approximately four times a year, based on daily use.",
    "These cassettes slot into a drawer on the bottom of the front side of Bob, just under the door of the machine, with a microchip on the cassette that interacts with the unit and counts down on the screen how many remaining cycles you have left. It’s a handy feature, and one you’d obviously lose if you stopped using the cassette.",
    "In keeping with Daan Tech’s environmentally conscious “throw in the sponge” approach to Bob’s design, the cassettes represent a plea for sustainable products without unnecessary plastic waste material, the idea being you can return and refill them. While usage of these Bob cassettes is not mandatory, Daan Tech states on its FAQ page that “to ensure optimal washing quality and higher Bob life durability we recommend using the Bob cassette”.",
    "Once you’ve got everything set up, and the water tank loaded or hooked up to your water supply, it's time to start loading up your dirty dishes. You’ve five cleaning cycles to choose from: Express, Daily, Intensive, Glasses, Eco, with their names indicative of what they should be used for.",
    "A cycle takes 20 mins on the Express setting, and about an hour and 50 minutes on the default daily cycle. Glasses makes an effort to ensure they come out sparkly clean, Intensive is better for baked-on grime and a more intense soak, while Eco is a little more energy conscious with lower temperatures. There’s plenty of options there, and well in line with the length of time a clean takes on a full-size washer.",
    "You might have to get creative with what goes in, though – plates larger than 29 cm aren’t going to fit in comfortably, and if you’re looking to fill beyond the daily usage of two people, you’re going to need to make use of multiple loads. A handful of plates, a couple of glasses, a few mugs, bowls and a saucepan will basically fill it up. So if you use lots of pans and baking trays when cooking, especially larger ones, you might have to keep a sponge and washing liquid to hand.",
    "That’s an accepted side effect of a compact appliance like the Bob Mini, though, and for the most part, cleaning performance is excellent. Glasses sparkle, tea stains come out of mugs, and plates are ready for use. Cooking pans sometimes need a little more work depending on what they were used to make and the intensity of the cleaning cycle that was used (grease and caramelization take extra work), but performance is generally on a par with my very capable full size Hotpoint model. Though this is purely a gut feeling, I have a sense that a stronger degreaser in the cassette solution could be needed. I was also impressed with how simple the whole process is, with visual cues as to when the cycle ended with the interior light, and how simple it was to simply let the dirty water run off into the sink with the supplied outlet hose."
  ],
  "headers": {
    "0": "One minute review",
    "3": "Price and availability",
    "5": "Design",
    "13": "Performance",
    "17": "Don't buy it if..."
  },
  "links": {}
}