{
  "source": "https://www.techradar.com/reviews/paypal-business-app",
  "title": "PayPal Business App review",
  "category": "computing",
  "updated": "2020-11-10T23:52:09Z",
  "author": "rob-clymo",
  "summary": "Use the PayPal Business App to stay on top of business from anywhere",
  "verdict": "There are many sides to PayPal and this business-focused app helps join up a lot of dots while you’re working on the move.",
  "pros": [
    "Strong feature set",
    "Very convenient",
    "User-friendly"
  ],
  "cons": [
    "Needs other PayPal services",
    "Mixed reviews on customer service"
  ],
  "article": [
    "PayPal Business App is another aspect of this company that is evolving all the time and now has numerous products and services aimed at making life for business owners that little bit easier. If you’re frequently on the move, or just prefer to have your business activities at your fingertips rather than being stuck at a desk then the PayPal Business App is a real boon. It allows you to do all manner of business related tasks, such as creating and sending invoices and keeping tabs on your business account activity along with issuing refunds to customers where necessary.",
    "Being able to do all that and more, from your mobile phone, offers your business that additional edge when you're away from a desktop or laptop machine. And, because this is PayPal you’re getting the benefit of a truly global operation, which is available in just about every part of the world.",
    "If you’re already a PayPal Business user then you’ll doubtless be well aware of the numerous different tiers of charges that are involved when you have an account with the company. PayPal has lots of different products and services, so for an accurate breakdown that matches your needs then you’re best off heading to the pricing page on their website. The other thing to remember is that prices are different depending on the way you pay, the currency you’re using and also your business location.",
    "The PayPal Business App comes with plenty of features to help make your workflow more efficient. You get a comprehensive overview of all your business activities for starters, and having a complete toolkit for issuing things like invoices on the go means that it’s easy to keep on top of finances even if you’re not at your desk. In fact, producing invoices is a doddle, even within the confines of a smaller mobile phone screen thanks to a dedicated invoice-making tool.",
    "Complimenting that is the way you can issue payment reminders to help ease cashflow. The app will also give you a detailed breakdown of sales and account activity, with a range of different views allowing you to get a snapshot of business turnover from monthly through to annual overviews.",
    "It’s possible to transfer money using the app as well as issue refunds when you need to. Rounding it all out is the ability to get detailed insights into all of your customer activity, which will reveal everything from invoicing histories through to processing ongoing payments.",
    "You can get the PayPal Business App for iOS or Android and it continues to be downloaded by many business account holders who want to have the added convenience of mobile productivity. As you’d expect from a large company, the app has been well put together, although there is a proportion of users who seem to have experienced operational difficulties with it.",
    "PayPal does have a lot of different products and services, which might also be the source of some customer woes as its portfolio can be a little bewildering. Bear in mind that, as the name suggests, this is a business-based app, so you’ll need to have the right setup with PayPal in order for it to work properly.",
    "Credit should go to PayPal for developing a business app that, while it does come packed to the hilt with features to aid productivity, is also easy to use. Considering the powerful feature set you can easily switch between tasks. Naturally, having most if not all of the tools you’d normally use on a desktop computer at your fingertips and on the move is hugely helpful.",
    "Just being able to ping a new invoice to a customer on the go is beneficial, but to also monitor payments as well as keep an eye on sales activity means there’s plenty here to help your business. It’s all easily mastered too. The interface is a nice balance of PayPal’s blue and easy-to-read white with black text overlaid, which makes the app all the more practical if you’re using it in less than ideal conditions.",
    "With so many products and services falling under the PayPal banner it’s quite easy to feel a little overwhelmed by your support options. PayPal does, of course, have the usual support hubs where you can find answers to lots of common queries, but the company has a raft of other options open to you if your enquiry is less straightforward.",
    "Similarly, because PayPal processes a lot of payments it’s only natural for the business to have a resolution center, in case of any issues with a transaction or a problem with your account. Lookout too for healthy community areas, which are often great places to find answers, as well as the Message Centre that will be the first place to check into if you’re expecting correspondence from PayPal.",
    "PayPal Business App is extremely useful, especially if you’re frequently tackling business tasks while you're on the go. Even though many of us are doing less mobile business due to coronavirus, PayPal’s Business App is still a boon for its convenience factor.",
    "You’ll obviously get more from it if you’re signed up for other PayPal services, and you’ll need a PayPal Here account if you want to process credit and debit card payments on your mobile too. However, being able to process payments, transfer funds along with issuing invoices on-the-fly makes the PayPal Business App a worthy addition to your arsenal of business-focused phone software."
  ],
  "headers": {
    "2": "Pricing",
    "3": "Features",
    "6": "Performance",
    "8": "Ease of use",
    "10": "Support",
    "12": "Final verdict"
  },
  "links": {
    "PayPal Business App": "https://www.paypal.com/us/webapps/mpp/mobile-apps/business-app",
    "creating and sending invoices": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "pricing page": "https://www.paypal.com/uk/webapps/mpp/merchant-fees"
  }
}