{
  "source": "https://www.techradar.com/reviews/hp-spectre-13",
  "title": "HP Spectre 13 review",
  "category": "computing",
  "updated": "2020-04-09T22:38:19Z",
  "author": "gabe-carey",
  "summary": "An Ultrabook dressed (and specced) to impress",
  "verdict": "Positioned to compete with the likes of the Dell XPS 13 and the MacBook Pro, the HP Spectre 13 is pricier than the former, more affordable than the latter and more attractive than both.",
  "pros": [
    "Impossibly thin and light",
    "Top-notch looks",
    "Powerful hardware",
    "Not a bad price"
  ],
  "cons": [
    "Light on ports",
    "Second-rate trackpad"
  ],
  "article": [
    "The HP Spectre 13 achieves levels of portability and aesthetics that makes Apple’s products look cheap in comparison. And, does all of this without compromising on performance or value.",
    "When the MacBook Air was initially released almost eight years ago, it inspired Intel to go on a quest to change what Windows laptops could do. But before it made its debut, Windows devices were infamous for being cheap, flimsy and un-cool. In other words, they were the antithesis of the HP Spectre 13.",
    "Lucky for Windows fans, Intel’s journey resulted in the development of the best Ultrabooks on the market, with laptops getting thinner, lighter and more powerful than ever, even achieving that level of near perfection that the MacBook Air hasn’t been able to reach for years. And, the HP Spectre 13 is proof of that.",
    "You’ll find the HP Spectre 13 for $1,499, which rivals the $1,299 (about £1,021, AU$1,875) Dell XPS 13. For that price, you’re getting a zippy Intel Core i7-8550U processor, 8GB of RAM, 256GB of PCIe-based SSD storage space and a 13.3-inch, 1,920 x 1,080-pixel touch display.",
    "Granted, the Dark Ash Silver Spectre 13 starts at $1,249 and comes with an Intel Core i5-8250U instead of an i7.",
    "The UK gets two different models of the HP Spectre 13, starting at £1,599. This model is mostly the same as the one to the right, but with a 4K touch display and a larger SSD. Additionally, the HP Spectre 13 is also available in Australia, starting at AU$2,699 for the model we reviewed here.",
    "It appears that the HP Spectre 13 has been discontinued in the US, UK and Australia, although come configurations are still available at third-party retailers. The newly-redesigned HP Spectre x360 is a terrific alternative, and considered one of the best Ultrabooks on the market.",
    "If there was ever a reason to shell out 120 clams over the best-in-class Dell XPS 13 in favor of the HP Spectre 13, it’s that the latter is a looker. In deservedly praising companies like Razer for their accomplishments in computing design, HP shouldn’t go overlooked.",
    "Over the last few years, the manufacturer has reevaluated its design approach, revolutionizing it to the point where it’s hard to find faults in its laptop design. And, today, the HP Spectre 13 is 12.03 inches wide and 8.83 inches deep. Bearing in mind that last year’s Spectre was already extremely light, this still is a welcome improvement over the 2016 model, which was 12.8 inches wide and 9.03 inches deep.",
    "HP took the phenomenal design we loved last year, and downsized the screen bezels so much that the HP Spectre 13’s predecessor looks like a relic in comparison.",
    "The beautiful gold trim that envelops the two-prong hinge and the edges of the HP Spectre 13 has become a signature element of every product in the HP Spectre family. These hinges stand out in the HP Spectre 13, just as it did in the previous model, but there’s more to admire this time around.",
    "Meanwhile, the keyboard feels like a full chiclet, akin to the Apple Magic Keyboard for iMacs rather than what we’ve experienced with the MacBook Pro’s dinky butterfly switches that are susceptible to getting stuck.",
    "One area where we would argue that MacBooks are still in the lead is the trackpad. On the Spectre 13, you can touch or, if you want to put some force behind it, click the touchpad. However, you are unable to personalize the amount of pressure it takes for a click to register or the sound it makes when it does.",
    "The comparisons to the Macbook Pro don’t end there, Apple’s flagship is 11.97 inches wide and 8.36 inches deep, but 0.59 inches high. Still, the HP Spectre 13 gives the impression that it occupies far less space than the 2017 Macbook Pro on which we wrote this review.",
    "The Dell XPS 13, on the other hand, comes in at 11.98 inches wide and 7.88 inches deep, making it the more compact notebook of the three – at least in those areas. In terms of thickness, the XPS 13 is generally fatter, thanks to its ascending height of up to 0.6 inches (again, compared to the 0.41-inch HP Spectre 13) with the lid closed.",
    "Still, there is a glaring difference in the screen resolution that gives Apple’s laptops the clear-cut advantage. In a world where our 5-inch phone screens are exceeding 400, sometimes 500, pixels-per-inch (PPI), the 166 PPI pixel density of the HP Spectre 13 is unacceptable for a laptop that costs over a grand.",
    "The good news is that, when ordering your configuration of the HP Spectre 13, you can get yourself a much sharper 4K Ultra HD screen for an additional charge of $150 in the US. As it stands, we highly recommend doing that, especially if you’re accustomed to flagship smartphone screens at it is.",
    "Like the MacBook Pro, the HP Spectre 13 doesn’t come with a lot of ports. This is probably the point in our review where you’ll decide whether you hate the device, or you’re willing to overlook the sparse ports because you understand that it’s a necessary compromise for the sake of mobility and investing in the future of inputs.",
    "In this case, Thunderbolt 3 is the future – an interface that leverages the amazing USB-C port for transferring data, displaying video and charging the device, on top of charging outside devices connected to it. It’s a reversible plug as well, so that you can use it in the dark easily. In other words, it’s meant to be the be-all and end-all of ports.",
    "The problem is, while Apple has been using USB-C exclusively on its MacBooks since 2015, there still aren’t a lot of accessories out there that use it natively.",
    "To make matters worse, since the HP Spectre 13 only has three USB-C ports and a headphone jack, the USB, HDMI and DisplayPort accessories you currently own will require a dongle. While two of these USB-C ports are Thunderbolt 3, promising data transfer rates of up to 40 Gigabits per second, power delivery and DisplayPort 1.2, the other is a slower and less versatile USB 3.1 Gen 1 port ideal only for charging.",
    "Luckily, HP thought of this when it sent us the Spectre 13 for review. Out of the box, we were given adapters for USB 3.0, HDMI and RJ45 Ethernet to USB Type-C. After contacting a customer service representative at HP, however, it turns out that, alas, none of these accessories are included in the retail version of the Spectre 13.",
    "But, enough about ports, Let’s talk performance.",
    "First reviewed November 2017",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "17": "A port in a storm"
  },
  "links": {
    "MacBook Air": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-air-1300233/review",
    "Windows": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "HP Spectre x360": "https://www.techradar.com/reviews/hp-spectre-x360-2020",
    "Macbook Pro": "https://www.techradar.com/reviews/macbook-pro"
  }
}