{
  "source": "https://www.techradar.com/reviews/tony-hawks-pro-skater-1-2-review-ps4-xbox-one-pc",
  "title": "Tony Hawk's Pro Skater 1 + 2 review",
  "category": "gaming",
  "updated": "2020-09-05T15:17:48.364Z",
  "author": "adam-vjestica",
  "summary": "Tony Hawk’s Pro Skater 1 + 2 is a nostalgia-filled return to form",
  "verdict": "Tony Hawk steps back on the board to deliver a faithful remake of two excellent games. This is the best skateboarding game in what feels like forever, and that's something well worth celebrating.",
  "pros": [
    "Great soundtrack",
    "Countless challenges to beat",
    "Gorgeous graphics"
  ],
  "cons": [
    "Sparse create-a-character options",
    "Some levels haven't aged well",
    "Online multiplayer is limited"
  ],
  "article": [
    "Unlike the kickflip most of us never came close to accomplishing in our youth, Tony Hawk’s Pro Skater 1 + 2 is a perfectly executed remake. It delivers in all the areas that fans of the original would expect, and sweetens the deal by adding all the modern necessities we demand of today’s video games: sumptuous graphics, great performance, and more in-game challenges than you can pop an Ollie over.",
    "After many failed attempts to revive a series that was all but dead, developer Vicarious Visions has proved that there’s life in the old Hawk yet. The collect-a-thon challenges, the ludicrously large combos and gravity-defying grinds are all present, and there are even instances when the game manages to transport you back to the halcyon days of 1999.",
    "From the moment you boot up Tony Hawk’s Pro Skater 1 + 2 you’re hit firmly in the feels with a wave of nostalgia. Guerilla Radio by Rage Against The Machine begins to play, and a considerably older-looking Tony Hawk proves that age is just a number as he pulls off his famous 900-degree spin. It remains quite the feat, and is a subtle reminder that, yes, skateboarding is still incredibly cool.",
    "Before long, skaters from a bygone era make an appearance – Bob Burnquist, Eric Koston and Kareem Campbell light up the asphalt with various tricks, flips and grabs that are made all the more impressive when you consider that most of them are now well into their 40s.",
    "And then the new blood comes in: the skating stars of the future. These days, it will be these skaters, rather than Tony, who will ultimately encourage greater numbers to pick up that plank of wood with wheels attached – skaters such as 18-year-old Aori Nishimura and 28-year-old Leo Baker. It’s a symbolic moment; a changing of the guard, where the baton is passed to the younger generation. The Tony Hawk games put pro skating and The Birdman on the map after all.",
    "The biggest obstacle that Tony Hawk’s Pro Skater 1 + 2 may have to overcome is whether the youth of today cares about skateboarding, or even Tony Hawk for that matter. For all the fogies who are “growing older all the time (but feeling younger in their minds)”, this game was always going to be a day-one purchase, particularly if it was any good (note: it’s excellent). But Tony Hawk’s games were very much a phenomena of the late 90s and early 00s, and the various failed attempts to resurrect the series only solidified that opinion.",
    "But here we are in 2020, and Tony Hawk’s Pro Skater 1 + 2 proves that these games were always great, no matter whether or not you have (or had) an affiliation for skateboarding. For anyone who feels like their best years are behind them – your reviewer included, Tony Hawk’s Pro Skater 1 + 2 will feel like comfort food, and it’s a dish that we’ll be happy to gorge on for many months to come.",
    "And that’s because, even after all these years, the simplistic arcade-style gameplay holds up remarkably well. Careering down a stupidly steep slope to catch some mad air is still an undeniable thrill, while trying to stop your skater from toppling over during a monumental grind continues to be a rewarding feat.",
    "If you’re new to the series, the face buttons and combination of directional inputs allow you to perform a variety of jumps, tricks, grabs and grinds. Most of the gameplay loop involves vaulting over (and onto) obstacles as you explore the map to find the best areas to score points. The more tricks you combine, the bigger your score will be, and the quicker you’ll be able to pull off risk/reward-style special moves that will really see you rack up the points.",
    "Each level is also broken down into a series of mini-challenges. You get two minutes to complete as many as you can, but unlimited attempts to do so. The majority of tasks require a bit of skill and technique to accomplish, such as scoring a set amount of points before the timer runs out, or reaching a specific area to collect or destroy certain items.",
    "So what does Tony Hawk’s Pro Skater 1 + 2 bring to the table that’s new? While everyone will undoubtedly have their own favorite entry in the series, the first two Tony Hawk’s games established many elements that we love. Levels such as the Warehouse, Hangar and Venice are as much fun to skate around now as they were all those years ago. The difference, however, is that everything looks and plays significantly better.",
    "The biggest improvement is the inclusion of mechanics introduced in later entries such as Tony Hawk’s Pro Skater 3. Tricks can now be strung together by pulling off reverts and manuals, and they have a transformative impact on the way the games play. You can now bring together monstrously large combos and tackle the game’s many intricate levels in entirely new ways.",
    "Also noticeable are the improvements to the game’s graphics. This is a beautiful-looking game, particularly on HDR-capable displays. It’s hard to imagine that we used to spend hours skating around largely empty levels, with bland textures and ugly geometry – although it obviously didn’t feel like it back then.",
    "The action feels satisfyingly smooth, too. The game now runs at 60 frames per second for a super-responsive experience – made all the more noticeable when the slightest mistake can cause your skater to bail into the pavement.",
    "Speaking of bails, Tony Hawk’s Pro Skater 1 + 2 also improves on this all-too-common occurrence. Previously, your skater would hit the deck after a failed trick and writhe around in pain for a period of time. Now, however, your skater is almost virtually rewound, making bails far less frustrating and disruptive overall. It’s pretty sick.",
    "Series veterans will likely blast through the game’s 17 levels relatively quickly, but the plethora of in-game challenges and online leaderboards have the potential to provide countless hours of extra entertainment. Purists will probably become obsessed with trying to top the competition and complete everything the game has to offer – and there’s a lot to get through.",
    "There’s a slew of customization options that you can unlock – such as new boards, clothing, logos and in-game extras – by completing various milestones. Pro tip: if you really want to maximize your chances of achieving the highest scores possible, collecting all the stat points for each skater is a must. These points can upgrade your skater’s balance, air time and top speed, which essentially gives you a greater chance of success when you’re on your board.",
    "But that’s not all. Tony Hawk’s Pro Skater 1 + 2 also includes a level editor and online multiplayer. You won’t find a huge suite of options here, but the ability to play with a friend – particularly during these challenging times – adds an extra layer of longevity to an already sweet package.",
    "A sublime remake that will feel like a grand homecoming for fans and an exciting revelation for newcomers, Tony Hawk’s Pro Skater 1 + 2 is a gnarly remake of two classic games. The Birdman kickflipped his way into the hearts of countless gamers back in 1999, and in 2020, his legacy has thankfully been restored. We only hope that Tony will step back on his board for further remakes or entirely new entries to the series – but if this is all we get, this one’s super, man."
  ],
  "headers": {
    "2": "Out with the old",
    "7": "C-C-C-combo maker",
    "10": "Bring on the Birdman",
    "15": "Bring Tha Noize",
    "18": "Verdict"
  },
  "links": {}
}