{
  "source": "https://www.techradar.com/reviews/huawei-p20-pro-review",
  "title": "Huawei P20 Pro review",
  "category": "phones",
  "updated": "2020-06-30T10:31:28Z",
  "author": "andrew-williams",
  "summary": "A real pro for photography",
  "verdict": "Paying this much for a Huawei phone may seem a tough sell. But great battery life, top specs and some of the most compelling use of computational photography seen in a phone make the Huawei P20 Pro one of the most interesting handsets available.",
  "pros": [
    "Great battery life",
    "Ultra-flexible camera",
    "Fast face unlock"
  ],
  "cons": [
    "No wireless charging",
    "No headphone jack",
    "Minor fizz to the OLED screen"
  ],
  "article": [
    "When it was released, the Huawei P20 Pro was the company's most powerful smartphone as well as its best for taking pictures. Sure, the Huawei P30 Pro and P40 Pro both now trump it (as well as their non-Pro equivalents), but it's still worth considering.",
    "The Huawei P20 Pro is now a lot more affordable, and it's no slouch at photography either. Plus, unlike the Huawei P40 and Mate 30 phones, it actually has Google apps.",
    "When it came out, the P20 Pro was able to go head-to-head with the likes of the Samsung Galaxy S9 Plus and the iPhone XS (though it's worth noting both are more powerful), and it was more affordable than either of those devices too.",
    "There are some quirks to the Huawei design and software to get used to, but the remarkable work done on the camera means the P20 Pro was, and still is, one of the most versatile camera phones out there, whether you're a happy snapper or an amateur enthusiast photographer.",
    "Watch the P20 Pro in action below as we review the phone's design and screen:",
    "Want to know just how good the Huawei P20 Pro is, to see if a slightly older yet more affordable smartphone is the right fit for you? Read on to find out our full thoughts.",
    "Note: if you're looking to buy a Huawei P20 Pro, the first thing you should know is that after Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "Although Huawei has confirmed the Huawei P20 Pro will receive the Android 10 update, along with most other pre-existing Huawei phones, there's no word on the future of Huawei phones in 2020 and beyond. That means we don't know if the Huawei P20 Pro could get future Android builds when they come along in the future.",
    "The Huawei P20 Pro price has jumped since its launch in April 2018, with the handset now available for around a third the price it initially launched for, if you buy it SIM-free.",
    "That means it's considerably more affordable than its £799, AU$1,099 (around $1,050) launch price, and it also means it's comfortably cheaper than the Huawei Mate 20 Pro and Huawei P30 Pro which have succeeded it.",
    "However, for the very latest prices and offers, check out our dedicated Huawei P20 Pro deals page to make sure you get it at its cheapest.",
    "The Huawei P20 Pro isn't available in the US as the Chinese firm continues to work at a way to officially sell its products in the country, so if you're in the USA you'll have to import the handset yourself.",
    "If you're interested in the Huawei P20 Pro, there's a good chance it’s because of the camera array. There are three cameras on the back, one 40MP main sensor, a 20MP black and white one and a 3x zoom 8MP camera.",
    "You can shoot at 3x without digital zoom, and even get good results at 5x. The real star here is low light performance, though. Standard night shooting just about matches the best, but a dedicated night mode lets you take low light shots with dynamic range to rival an APS-C DSLR.",
    "The Huawei P20 Pro also has a very high-resolution 24MP front camera for detailed selfies and reliable face unlocking.",
    "Other parts of the phone are a little more conventional. We get the Kirin 970 CPU used in the Huawei Mate 10, 6GB of RAM and 128GB of storage. Note that the Mate 20 Pro has since appeared boasting the Kirin 980 CPU.",
    "Like other recent higher-end Huawei phones, the P20 Pro makes quite an impact with its highly reflective glass finish. And it has a much larger battery than most, 4,000mAh, without any obvious added bulk to the shell.",
    "Huawei has clearly tried very hard with this phone. The result is a mobile more interesting than the Samsung Galaxy S9 or S9 Plus, particularly if you're going to make use of all the camera's high-end features.",
    "'Shiny' is the word that sums up the Huawei P20 Pro's design best. Yes, it's big. Yes, it has a notch. But sheer reflective spangliness makes this phone stand out.",
    "It's two big plates of rounded-off Gorilla Glass with a filling of metal finishing off its sides. This metal is aluminium, but it has a polished rather than anodized finish, and looks more like steel. Unlike the stainless steel iPhone X though, a month into using the P20 Pro, the frame is scratch-free, boding well for the phone's durability.",
    "For the most part you'll probably see the black and blue versions of the Huawei P20 Pro sold in the UK, but there's also the more eye-catching gradient version. Purple at the top turns smoothly to a greenish-turquoise at the bottom, the sort of finish you see more often on a supercar than a phone.",
    "This will be a bit of an audience-divider. If you find it a bit much, the other finishes are lower key. All are highly reflective, though. The Huawei P20 Pro is also a little prone to fingerprint smudges and the slightly raised camera housing picks up dust fairly quickly.",
    "The Huawei P20 Pro has a larger battery than its peers, but you can’t tell from its feel. This phone is actually slimmer and lighter than the Samsung Galaxy S9 Plus at just 7.8mm thick.",
    "However, the Samsung does a slightly better job of appearing to be 'all screen' front-on, because the Huawei's screen does not curve around at the sides. Only the glass does, and just the last millimeter or so at that.",
    "The Huawei P20 Pro – along with the standard Huawei P20 – was the first but not the last Huawei phone with a notch, the display cut-out made famous by the iPhone X.",
    "Apple's excuse for the notch is it is required for all the tech used for the phone's face unlock feature: a normal camera, an IR camera, a dot projector, a proximity sensor and more.",
    "Huawei doesn't have quite as good an excuse, as there's just a high-res camera and speaker on the Huawei P20 Pro's front. However, the notch is smaller. Notches may end up being a Crocs-grade \"what were we thinking\" move in hindsight, but they seem to be in fashion for now.",
    "You'll most likely forget the notch is there after a couple of days, particularly as when watching standard 16:9 video there are black bars where the notch sits anyway.",
    "Huawei has also followed another recent trend, as the Huawei P20 Pro doesn't have a headphone jack. You get a USB-C to 3.5mm adaptor in the box, or you can use wireless headphones. We would, obviously, prefer a real jack.",
    "The phone is water resistant to IP67, meaning it can handle submersion in one meter of fresh water for 30 minutes... but don't start dunking it for fun.",
    "There's a fingerprint scanner below the Huawei P20 Pro's display and, like those of every recent higher-end Huawei, it's extremely fast. It takes you to the home screen in a heartbeat.",
    "Its face unlock is exceptionally fast too. Rather than using clever IR techniques like the iPhone X, the Huawei P20 Pro simply reads the high-resolution feed from its front camera to recognize your face.",
    "It works, in our experience, every time. And even holds up well in lower light. This does suggest it is built for speed rather than security, though.",
    "You don’t even need to press the power button to make Face Unlock work. While there's no proximity sensor to tell when your face is in front of the screen, the Huawei P20 Pro's gyroscope senses when the phone has been picked up, or taken out of your pocket. It then immediately starts scanning for your face.",
    "As Huawei's phones still don't have the innate desirability of a Samsung or Apple, raw outer hardware was never going to be the top selling point of the Huawei P20 Pro. However, Huawei has done well here: the phone feels and looks expensive, and about as slim and light as we could hope for given its screen size.",
    "Like most other high-end Huawei phones, the P20 Pro does not have the highest display resolution in its class. This is a 1080 x 2244 AMOLED screen.",
    "The numbers sound unusual, but this is really just a Full HD screen stretched out to an 18.7:9 aspect ratio. That's right, it's even 'wider' (or longer) than most other 18:9 screen phones.",
    "Pixel density of 408ppi isn't even close to the 529ppi of the Samsung Galaxy S9 Plus. The only time you're likely to notice though is when using a phone-based VR headset – and if that fad isn't dead, it is at least dormant.",
    "Okay, if you look close you can see slight evidence of the PenTile fizz that affects Samsung OLEDs that don't have insane pixel density. This is caused by Samsung OLED's pixels sharing sub-pixels, reducing perceived resolution a bit.",
    "The Huawei P20 Pro’s display quality is excellent though. Blacks are perfect, and there's minimal blue cast when the phone is tilted, which affects some less advanced OLED displays.",
    "You also have a choice of color profiles. Standard color looks a little more saturated than old industry standard sRGB, but offers a fairly natural, relaxed look. Vivid color deepens tones a little, with a slight subtlety trade-off.",
    "Like other Huawei phones, you can also tune the color temperature to your liking, although the default setting is pleasant.",
    "The Huawei P20 Pro also has a few more unusual tweaks. Its display can change the color temperature on the fly to suit ambient light conditions, and the top part of the screen can be blacked out to completely hide the notch. This looks particularly neat as this little area can still be used for notification icons when blacked out.",
    "Also worth noting, the P20 Pro ships with a pre-fitted screen protector, giving it the best chance of avoiding scratches possible. That said, this plastic film does attract fingerprints pretty readily, so you may want to swap it for a tempered glass screen protector down the line."
  ],
  "headers": {
    "8": "Huawei P20 Pro price and availability",
    "12": "Key features",
    "18": "Design",
    "35": "Screen"
  },
  "links": {
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "P40 Pro": "https://www.techradar.com/reviews/huawei-p40-pro-review",
    "Huawei P40": "https://www.techradar.com/reviews/huawei-p40-review",
    "Mate 30 phones": "https://www.techradar.com/reviews/huawei-mate-30",
    "Samsung Galaxy S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "camera phones": "https://www.techradar.com/news/best-cameraphone",
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Android 10": "https://www.techradar.com/news/android-q",
    "Huawei Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review",
    "Huawei P20 Pro deals": "https://www.techradar.com/deals/mobile-phone-deals",
    "Huawei Mate 10": "https://www.techradar.com/reviews/huawei-mate-10-review",
    "Samsung Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Huawei P20": "https://www.techradar.com/reviews/huawei-p20-review"
  }
}