{
  "source": "https://www.techradar.com/reviews/lenovo-yoga-c940",
  "title": "Lenovo Yoga C940 review",
  "category": "computing",
  "updated": "2020-02-13T22:07:34.014Z",
  "author": "bill-thomas",
  "summary": "The Lenovo Yoga is back and it means business",
  "verdict": "The Lenovo Yoga C940 is an excellent 2-in-1 laptop with solid performance and a keyboard to die for. We just wish the battery lasted a bit longer.",
  "pros": [
    "Excellent design",
    "Great performance",
    "Comfy keyboard"
  ],
  "cons": [
    "Expensive",
    "Battery life",
    "Soundbar gave us hope"
  ],
  "article": [
    "The Lenovo Yoga C940 is the latest in a long line of flagships from one of the most well-known and beloved laptop manufacturers on the market. In many ways this laptop is just an iteration on last year's Lenovo Yoga C930, but with much a much more capable processor and graphics.",
    "The only thing that has noticeably taken a dive here is battery life, with the more powerful CPU and graphics leading to a drop of 3 hours of battery life – which we'll discuss more later on.",
    "But starting at just $1,299 (£1,099, AU$2,799), with an Intel Core i5 processor and 8GB of RAM, this is a pretty affordable 2-in-1 laptop, especially when you consider the pristine build quality and unique features that Lenovo has thrown in.",
    "Chief among these are the soundbar in the hinge and the pen garage on the back of the laptop. What's really cool about this pen garage, however, is that it charges the stylus whenever it's docked. So, unlike something like the HP Elite Dragonfly, where you have to actually keep track of your stylus and charge it with a USB-C cable, you should theoretically never have to worry about the Lenovo Yoga C940's stylus running out of battery.",
    "And of course, when you pair that with Lenovo's penchant for making excellent keyboards and including a wealth of ports, the Lenovo Yoga C940 could be one of the best Ultrabooks on the market right now, especially if you love the 2-in-1 functionality.",
    "If you want to get your hands on the Lenovo Yoga C940, you're looking at a starting price of $1,299 (£1,099, AU$2,799). In the US and UK, that entry model will net you a 10th-generation Intel Core i5 processor, 8GB of RAM and a 256GB SSD. Whereas in Australia, you're looking at an Intel Core i7 processor and a 256GB SSD. In fact, what's odd about the Australian pricing is that you actually save money by going with a bigger SSD – a model with a 256GB SSD bumps you up to AU$2,699 from AU$2,519.",
    "And of course you can get a more powerful version of the Lenovo Yoga C940 if you're willing to invest a bit more cash.",
    "If you customize the Lenovo Yoga C940 with the most powerful kit you can, you'll get to a price of $2,084 (£1,604, AU$4,867). That much higher price tag bumps you up to the Intel Core i7-1065G7, 16GB of RAM and a 2TB SSD. Though, it's important to note that in the UK, that SSD option is limited to 1TB.",
    "If you want the model listed in the box above, it's not available on Lenovo's website. However at the time of writing, you can find it at Best Buy in the US for $1,299 – the same as the list price of the entry model on Lenovo's website. If you're in the US, this is the model we'd go for if you can only afford the entry price.",
    "At the end of the day, when compared with the equivalent Dell XPS 13 2-in-1, the Lenovo Yoga C940 is cheaper when you configure the laptops with equivalent hardware. Dell's option does start cheaper at $999 (about £770, AU$1,480), but it inexplicably comes with an Intel Core i3 processor and just 4GB of RAM – the Lenovo Yoga C940 doesn't have such a configuration.",
    "Simply put, the Lenovo Yoga C940 is a beautiful laptop. While we would appreciate some more diverse color options, we have to admit that the Lenovo Yoga C940 does look good on our desk.",
    "The model we reviewed came in a gunmetal gray chassis with minimal detailing. The only branding on the laptop is the Yoga on the top left corner of the back of the lid, \"Yoga 9 Series\" etched into the top of the laptop and 'Lenovo' on the soundbar.",
    "You read that right, this 2-in-1 laptop has a soundbar. Built into the actual hinge of the laptop, there's one continuous speaker, rather than separate drivers on opposite sides of the chassis. It's not even the only speaker here: there are two more on the bottom of the laptop. This speaker configuration makes for sound that is far better than your average laptop, but we have to admit we were a bit disappointed.",
    "When opening the laptop and seeing a huge sound bar there, we were lowkey expecting sound that would rival the MacBook Pro – why would there be a soundbar if it didn't have amazing sound, right? And, while it's definitely good enough to listen to music and not immediately want it to stop, it's still not as good as it could be.",
    "We took a look at the Full HD version of the laptop, and it is a stunner even at that limited resolution. Colors pop and the display isn't big enough for a 1080p image to become blurry, making it ideal for getting work done without being too much of a drain on the battery.",
    "There's also a 4K version, which gets brightness bumped up to 500 nits, which will be ideal if you either do a lot of professional photo work or just want to watch Altered Carbon in 4K on Netflix.",
    "There are plenty of ports on offer, too, which is great if you do want to use this for your daily work. On the left side of the laptop, you'll find a USB 3.1 Type A, two Thunderbolt 3 ports and a headphone jack. Over on the right, there's a power button. We would have liked to see an HDMI port or an SD card slot – but these are the days we live in. We're just happy that Lenovo had the grace to leave the USB Type-A port, something Apple has abandoned even in the MacBook Air.",
    "And we can't talk about a Lenovo laptop without talking about input. The keyboard on this thing is simply phenomenal. We could write on this thing for hours. The spacing, the travel, the cushiony feel of the keys – it's all breathtaking. Even when we're passionately typing something out, the keyboard is comfortable, and this editor bottoms out whenever they're typing.",
    "The trackpad isn't quite on the same level as the keyboard – but it's a Windows trackpad so we have to forgive it. It's large enough to accomodate gestures and tracks effectively, but the clicking functionality varies a lot depending on where you click. Again, that's something we've come to expect from a Windows laptop, but it's 2020 and we're ready to see better trackpads.",
    "To the right of the trackpad, you'll find the fingerprint scanner – and it's phenomenal. Setting up your fingerprint is standard, of course, but wow does it unlock fast. In our experience laptops vary wildly in how fast they'll recognize your finger, but it's nigh-instantaneous most of the time here.",
    "Intel Ice Lake might just be the best thing that's happened to laptops in years. Not only is performance – especially in multi-core workloads – much faster than an 8th-gen Whiskey Lake chip, but graphics power takes off in a huge way.",
    "When compared to the HP Elite Dragonfly, which has an equivalent configuration beyond the processor, performance in 3DMark more than doubles. It's still not powerful enough to play the best PC games at max settings, but it's definitely good enough to get some creative work done, if that's a thing you do.",
    "As for the benchmarks, the Lenovo Yoga C940 gets a solid 1,385 points in Cinebench R20 and 18,029 in Geekbench 4.3. The Dragonfly scores 1,059 and 13,893, respectively, meaning that the Yoga C940 is a whopping 23% faster in Geekbench 4.3 – that's a massive improvement.",
    "One thing we did notice, however, is that the cooling system works in an odd way. Likely in an attempt to mitigate fan noise, the fans won't go full spin until the temperature hits the 90s. This means that the silicon in this laptop will get really hot under bursty workloads.",
    "However, after running Cinebench on a loop for 10 minutes, we found that the laptop will start to cool down after a couple of minutes, sitting at around 77C. This way, you don't have to worry about hardcore workloads melting your computer, but you won't get super annoyed by fan noise either.",
    "While the Lenovo Yoga C940 doesn't qualify as a workstation or a gaming laptop, it's still a powerhouse in its own right. If you're looking for a thin and light device that can also flip inside out into a Windows tablet, you can trust that this laptop will perform with the best of them.",
    "One thing that Ice Lake hasn't quite delivered on is the promise of out-of-this-world battery life. While battery life is by no means short, it does see a reduction from last year's model. In our battery test, where we play 1080p video on loop until the laptop dies, the Lenovo Yoga C940 lasts 7 hours and 47 minutes – down from the 13 hours and 10 minutes from the previous model.",
    "Year on year, that's a pretty massive drop in battery life, but it likely comes down to the more powerful graphics.",
    "Still, with nearly 8 hours of battery life, the laptop should have no problem lasting you through your work day – though maybe pack the charger just in case."
  ],
  "headers": {
    "0": "Two minute review",
    "5": "Price and availability",
    "10": "Design",
    "20": "Performance",
    "26": "Battery life",
    "29": "Don't buy it if"
  },
  "links": {
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "processor": "https://www.techradar.com/news/best-processors",
    "Dell XPS 13 2-in-1": "https://www.techradar.com/reviews/dell-xps-13-2-in-1-2019",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-2019",
    "Intel Ice Lake": "https://www.techradar.com/news/intel-ice-lake",
    "HP Elite Dragonfly": "https://www.techradar.com/reviews/hp-elite-dragonfly"
  }
}