{
  "source": "https://www.techradar.com/reviews/huawei-freelace-pro",
  "title": "Huawei FreeLace Pro review",
  "category": "audio-visual",
  "updated": "2020-10-02T15:12:33Z",
  "author": "lee-bell",
  "summary": "Solid audio and a sleek design",
  "verdict": "The Huawei FreeLace Pro offer a surprisingly impressive audio experience, along with active noise cancellation that you just can’t fault for the price. Add to this sleek design backed up by almost all-day battery life, and that means you won’t go far wrong if you’re looking for a great all-round set of wireless earbuds suitable for just about any occasion.",
  "pros": [
    "Intuitive charging",
    "Great sound for the price",
    "High-end design",
    "Decent noise cancellation"
  ],
  "cons": [
    "Touch controls can prove fiddly",
    "Color options not to everyone’s tastes"
  ],
  "article": [
    "Huawei returns with yet another pair of wireless earphones. An upgrade on the company’s last wireless neckband-style units, the FreeLace Pro are aimed at those who lead an active lifestyle, and are looking for good-quality audio with noise- cancelling abilities built-in.",
    "Available now, the FreeLace Pro feature a super-comfortable nickel-titanium alloy “memory metal” neckband, which comprises an inline remote with an inventive design. It detaches in the middle to reveal a Type-C USB port, which means you won’t need a separate charge cable; simply rejuice the earphones easily via your phone or laptop.",
    "Boasting a 14mm dynamic driver unit and 40dB noise cancellation, Huawei’s new buds provide impressive audio playback, displaying great clarity and vibrant bass, accompanied by excellent active noise cancellation (ANC) technology. The latter works brilliantly, especially considering these earphones won’t set you back much more than £100 (about $150 / AU$200).",
    "Considering all the tech at play, you’d expect the FreeLace Pro’s battery life to be sub-par. Well, you’d be wrong. Huawei excels in this area, too: on average, these wireless earbuds last for around 21 hours before needing a recharge.",
    "All-in-all, these are an outstanding pair of earphones for the price, and an excellent option for those looking for a decent set of all-rounders that perform well and are comfortable, no matter what you’re doing.",
    "The Huawei FreeLace Pro wireless earphones were unveiled globally on September 10, 2020 and are available to buy now in the UK from the Huawei Store and select retailers for £119.99. US and Australia release dates and prices are yet to be confirmed, but that works out at around $150 / AU$200.",
    "The earphones are an update to the FreeLace buds launched just over a year ago, bringing some extra features, such as active noise cancellation, for a slightly higher price. They’re available in three colors including Graphite Black, Spruce Green and Dawn White (a somewhat bizarre pastel pink/beige-like color).",
    "Similar to the FreeLace wireless buds that came before them, the FreeLace Pro feature a 'neckband' design, meaning the right and left earphones are connected by a nickel-titanium alloy “memory metal” band that loops around and conforms to the shape of your neck. This means the in-ear units hang down when they’re not in use. It’s a great design feature, particularly if you’re prone to losing buds, or not a fan of holding onto them if you remove them from your ears to listen to an external sound as you would with true wireless buds.",
    "For charging, the FreeLace Pro detach at the inline remote built into the neckband, splitting in two to reveal a Type-C USB connector that can be plugged into your smartphone or laptop. This is an ingenious piece of design, which makes charging on-the-go super-easy – you’ll never need to remember to bring along a charging cable with you ever again.",
    "Also neat is the fact that the backs of the earbuds are magnetic, so you can stick them together when they’re not in use. Not only does this prevent excessive swinging under your chin, but it automatically cuts the Bluetooth connection from your attached device, saving battery life.",
    "The earphones are finished in a smooth, matte-texture silicone that feels lovely against the skin. Weighing just 34g, the FreeLace Pro are also light enough to be worn for extended periods without irritation. An IP55 rating means they’re both water- and dust-resistant, so will be able to handle those sweaty gym sessions or long runs without issue.",
    "Overall, we’re fans of the FreeLace Pro design. These buds feel expensive, despite having a pretty accessible price point. They’re exceptionally comfortable in the ears and the physical touch controls work well, although they can be a touch fiddly as a result of their small size.",
    "Our only gripe with the design is the color options these buds are available in. While the Spruce Green and Dawn White finish are elegantly muted, in our opinion they’re an odd choice. A safer bet would have been something bolder, or straight-up such as plain white or grey. But we guess that’s just down to personal preference.",
    "The FreeLace Pro boast a 14mm dynamic driver unit, which Huawei claims offers more detailed sound, as well as 40dB noise cancellation – more on that later. And when it comes to audio quality, we were rather surprised.",
    "While they’re unlikely to please the pickiest of audiophiles, we were impressed with how well the FreeLace Pro deliver a very natural-sounding yet punchy audio, with clear tones and vibrant bass. And their sound only adds to their overall comfort when worn for extended periods, especially if you’re at the gym or sweating it out over a Zoom workout.",
    "The FreeLace Pro deliver premium-sounding audio for the price, offering excellent value for money.",
    "Note, too, that during our time with the FreeLace Pro, Bluetooth connectivity has been top-notch, with few disconnections and almost instant connection to our mobile device.",
    "On average, the FreeLace Pro last for around 21 hours before requiring a charge. At launch, Huawei stated an estimated battery life of 24 hours, but clearly, this will be dependent on the volume at which you’re listening. We like our music quite loud, and we assume Huawei calculated a full day of battery life based on a mid-level volume.",
    "Once plugged in, the FreeLace Pro’s 150mAh battery can be fully charged in around 15 minutes.",
    "One of the most notable additions to the FreeLace Pro earphones over their predecessors is 40dB active noise cancellation, which means that they can generate sound that overlaps and cancels out certain external noises.",
    "As a result of the FreeLace Pro’s in-ear design, the silicone earbuds provide excellent insulation. This, combined with the ANC tech, means external sounds are blocked out exceptionally well. For example, we were able to use the buds on the London Tube with many of the usual blaring sounds massively dulled and in-carriage conversations completely blocked out.",
    "In addition, the FreeLace Pro use three microphones for call noise reduction. This means, chatting to someone over the phone, you’ll hear the person on the line far more clearly, with background noises muted and their voice projected into your ears almost as though you’re in a room with only them."
  ],
  "headers": {
    "0": "One-minute review",
    "5": "Huawei FreeLace Pro price and release date",
    "7": "Design",
    "13": "Audio performance",
    "17": "Battery life",
    "19": "Noise cancellation performance",
    "22": "Don't buy them if..."
  },
  "links": {
    "wireless earphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Huawei Store": "https://tracker.tradedoubler.com/click?p=304857&a=2384897&g=32244&epi=trd-us-1123276076223080400&url=https%3A%2F%2Fconsumer.huawei.com%2Fen%2Faudio%2Ffreelace-pro%2F",
    "FreeLace buds": "https://www.techradar.com/reviews/huawei-freelace-earphones",
    "FreeLace wireless buds": "https://www.techradar.com/reviews/huawei-freelace-earphones"
  }
}