{
  "source": "https://www.techradar.com/reviews/midphase",
  "title": "Midphase review",
  "category": "computing",
  "updated": "2020-11-17T10:01:44Z",
  "author": "mirza-bahic",
  "summary": "All the features you need and more, but not for cheap",
  "verdict": "Midphase is a decent, trustworthy hosting provider with very few restrictions though prices do increase significantly upon renewal.",
  "pros": [
    "30-day money back guarantee",
    "Excellent customer service",
    "Very few restrictions"
  ],
  "cons": [
    "Relatively expensive, especially after the promo period",
    "Backups and site migrations cost extra",
    "Setting up an account can take longer than with most other providers"
  ],
  "article": [
    "Midphase is a UK-based web hosting service founded in 2003, currently part of the UK2 Group, which offers a variety of services including web hosting, virtual private servers, domain name registration and management, dedicated servers and a content delivery network. The company’s team has been together since 1998, according to their website, while nowadays they have teams and offices in Providence and Salt Lake City (Utah, USA), London (UK) and Lviv (Ukraine).",
    "Their main data center, the one used for web hosting, is located in Lindon, Utah, which they claim is a disaster-safe area. For dedicated hosting, there are a number of available locations in the UK and the US, so the choice is up to the customer. The Lindon data center is a Tier-3, meaning it should have at least 99.982% uptime and no more than 1.6 hours of downtime per year, as the uptime should be concurrently maintainable.",
    "Midphase’s biggest advantage is its price, but the effect of this is quickly mitigated by the fact that it is only available for the duration of your first contract. The rest of their offer is decent enough, specially geared towards individuals and small businesses, meaning you’re not likely to find anything out of the ordinary here.",
    "The cheapest web hosting package at Midphase is its Personal plan which starts at $3.95 a month for 12,24 and 36 month intervals, with renewals at $6.95/mo. It includes unlimited web space and bandwidth, a free domain (as long as your contract is annual or longer), a website, a database, and a subdomain.",
    "The next package is its Professional plan, their best seller according to the website, goes for $4.95/mo. ($8.95 upon renewal) and increases this number to three websites, three databases, and five subdomains, while all these features are unlimited with the most expensive plan, Business, at $5.95/mo. ($10.95 upon renewal).",
    "If you already own a website, you’ll have to pay an additional one-time fee of $11.50 to transfer it to Midphase. They offer a 30-day money-back guarantee that excludes the cost of the domain, and you can pay with credit/debit cards or PayPal.",
    "Once you’ve chosen the perfect plan for your needs, Midphase still tries to upsell you by offering more domain names and other features like SEO tools and site malware detectors, plus prompting you to choose a longer contract period. Contracts are available on a monthly and bimonthly basis, while the advertised price only works if you’re paying for a year or more in advance. To sign up with Midphase, you’ll have to leave your name, address, registrant type (from a drop menu), and phone number. The whole signup process is definitely less than instantaneous: while many providers will let you get to work immediately, Midphase lets you know your order has to be reviewed first, which can take up to a few days, and that you will receive a confirmation email once this is done.",
    "All shared hosting plans come with a cPanel, which is accessed through Midphase’s own control panel called CHI. This is simply a dashboard where you can access all your services, which is especially useful if you have several different plans on one account. For every individual service, you’ll be able to go through cPanel to upload your website through the File Manager or FTP, or install WordPress through Softaculous.",
    "A website builder does not come with a shared hosting plan, but you can always go the other way around: purchasing a website builder plan, which start from $4.46/mo (renews at $5.95/mo.) Signing up for one of these plans also gets you a free domain name, website hosting, and personalized email—more expensive plans though will get you unlimited storage and SEO management.",
    "Unfortunately, when it comes to Midphase’s own main website, our speed test results do not look promising. GTmetrix, our usual speed test tool, timed out before returning a result, while others show that it took between 35 and 40 seconds to fully load the website. While this may not be indicative of the performance of hosted websites, it is certainly not a good look.",
    "Meanwhile, Tier 3 uptime means that there should be no less than 0.018% of annual downtime. On a biweekly basis, this means they shouldn’t be offline for more than some 3.5 minutes on average, although there is no guarantee that the downtime will be equally distributed throughout the year. During our uptime test, which ran for over a month, Midphase did not register any downtime at all, meaning they’re very likely to keep that promise.",
    "No matter on which Midphase page you find yourself, you can access their live chat from a tab at the bottom of your screen for quick help. You can also submit a ticket, send an email, or call a phone number (each department has its own listed on the website). The quickest way to get the help you need, however, is to go through your CHI control panel - if you’re a registered customer, that is.",
    "The platform also offers a Knowledgebase, separated into four sections: Hosting, Billing - Account Management, Applications, and Other. Although this may seem far from exhaustive, it actually makes the whole navigation process significantly easier, even if it does a few extra steps. The guides are simple, easy to understand, and most have pictures accompanying each step for visual learners. There is no user forum. There is, however, a Services Status section which gives real-time information about the status of their services, so you know if an issue is on their end or yours.",
    "123 Reg plans go for similar prices to Midphase ones, but the latter offers slightly fewer restrictions, for example in terms of web space. 123 Reg has a 14-day money-back guarantee, whereas Midphase’s guarantee is double that length, meaning users have longer to decide if the service is truly for them.",
    "Although both Bluehost and Midphase have a price hike after the first promotional period, in the case of Bluehost, this is after three years, while Midphase lets you choose if you want to prepay for a year, two, or three. Both are extremely budget-friendly options with similar prices and features.",
    "Hostgator is perhaps best known as a budget option with excellent customer support, which is mostly due to their in-depth written and video guides for every feature they offer. A similar price means the choice is mostly a matter of personal preference.",
    "eUKhost is slightly more expensive than Midphase, but without the price hike after the promotional period, meaning what you see is what you get. Their offer is also slightly more restricted than that of Midphase. However, Midphase offers vastly superior customer service.",
    "Midphase is a decent option for clients on a budget, but the subsequent price hike can take that advantage away for many. On the other hand, the lack of restrictions on features like bandwidth and web storage space are a rare find in the web hosting space. Slightly cheaper in the long run but equally good options are Bluehost and Hostgator."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Ease of use",
    "9": "Speed and experience",
    "11": "Support",
    "13": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Midphase": "https://www.midphase.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Personal plan": "https://www.midphase.com/website-hosting/",
    "Professional plan": "https://www.midphase.com/website-hosting/",
    "Business": "https://www.midphase.com/website-hosting/",
    "SEO tools": "https://www.techradar.com/news/best-seo-tool",
    "website builder plan": "https://www.midphase.com/website-builder/",
    "123 Reg": "https://www.techradar.com/reviews/123-reg",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "eUKhost": "https://www.techradar.com/reviews/eukhost"
  }
}