{
  "source": "https://www.techradar.com/reviews/zendesk-support",
  "title": "Zendesk Support review",
  "category": "computing",
  "updated": "2021-01-21T15:29:08Z",
  "author": "mark-pickavance",
  "summary": "A comprehensive online helpdesk solution",
  "verdict": "Zendesk is easy to use with great features, but the user interface is lacking in some areas, and there is no free option.",
  "pros": [
    "Easy to use",
    "Works well on mobile"
  ],
  "cons": [
    "Some functionality needs to be installed, not included by default",
    "Ticket search needs work"
  ],
  "article": [
    "Zendesk is a software provider that produces solutions to help businesses with their support, sales, and customer engagement, as well as one of the best help desk software solutions. The company produces two different online help desk packages, Zendesk Support, a customer support ticketing system, and Zendesk Support Suite, which elevates the capabilities of Support with omnichannel functionality.",
    "In this Zendesk review, we focus on the Support product and give you the rundown of its pricing, features, support, and ease of use, so you can better understand whether it would be a good fit for your business.",
    "Zendesk Support comes in five different plans, starting with the Essential at $5/agent/month and going up to the Elite at $199/agent/month if paid annually. If you’re paying month-to-month, the price range goes from $9/agent/month up to $125/agent/month (there is no month-to-month pricing for the Elite plan).",
    "Each plan adds to the features that exist in the previous plan, and all the plans except Elite come with a 30-day free trial that can be purchased directly from the Zendesk website. For the Elite plan, you need to fill in a form to contact the company to have your plan customized to your needs.",
    "As it is a helpdesk management system, ticketing is the backbone of Zendesk Support, and it comes packed with features to make your support agents more productive. Tickets can be routed to agents based on their skills, with automations available to update tickets based on certain events or after periods of time have elapsed, or to send stock replies to common requests.",
    "Collaboration features mean that agents can easily communicate with other teams via email or Slack from within the Zendesk Support app.",
    "Integration is provided across a multitude of channels, including web, mobile, email, and social media, and you can create a variety of ticket forms to make sure you’re asking your customers the right questions. This can also include conditional questions based on previous responses.",
    "Zendesk has multilingual capabilities, with the admin interface that agents use available in more than 40 languages. Dynamic content also means that agents can communicate in the customer’s language without having to do the translations themselves.",
    "After you’ve created an account and logged in for the first time, you’re presented with a getting started wizard to guide you through the essential settings. With that done, you can move on to the dashboard, where you get an overview of all your tickets.",
    "Hovering over a ticket will give you a popup with a quick view of the latest replies. Clicking on a ticket adds a tab for it to the top of the window for quick access later, (until you manually remove the tab). Each ticket has a lot of fine-grained controls, like setting the ticket type, its priority, tags, who it’s assigned to, and others who should be following it.",
    "In general, Zendesk is intuitive and easy to use, but there were a couple of aspects we found could be improved. One is that a lot of functionality—like the ability to relate tickets, display the five most recent ones, and link tickets to others—has to be installed as separate apps. Installing these only takes a few seconds for each one, but a lot of this functionality seems like it should be included by default.",
    "Another thing was that reporting is part of a separate app called Zendesk Explore. It’s all part of the Zendesk suite of applications, but you have to launch Explore in a separate tab or window. It has its own navigation, so it doesn’t feel as tightly integrated with Support as some of the reporting tools from other helpdesk solutions.",
    "As a system designed to provide support to others, Zendesk itself features many of the support methods built into its own products, including a knowledge base, community forums, help widgets, and live chat (which is only available when you’re logged into your account).",
    "Zendesk has 23 offices in various locations around the world, with many of them having phone numbers or email addresses listed, but office hours aren’t mentioned.",
    "Zendesk helps its customers meet their industry compliance requirements by itself achieving compliance with security and privacy frameworks like HIPAA and PCI DSS.",
    "The company has a dedicated, globally distributed security team, and it uses AWS data centers, which have a number of on-site security measures in place like security guards and intrusion detection technology.",
    "All communications with Zendesk and its APIs are encrypted, and customers can enable Zendesk authentication or use social media or enterprise single sign-on (SSO) for end-user protection.",
    "Zendesk has a lot of competition in the online helpdesk space. Among the alternatives to consider are Zoho Desk and Freshdesk, which both offer free plans.",
    "Freshdesk also offers five plans, with its free plan available for unlimited agents but with a limited feature set. The paid plans go from $15/agent/month up to $99/agent/month, and all plans come with a 21-day free trial.",
    "Zoho Desk also has a comprehensive feature set, with four plans available, starting with the free plan for three agents and going up to $35/agent/month for unlimited agents. All paid plans come with a 15-day free trial.",
    "Zendesk is competitively priced, but it doesn’t have a free option like some competitors. It has a large feature set and an impressive approach to security. Its ticketing management system provides a lot of fine-grained control over tickets, but we found the separation of reporting into a separate app, and the fact that some functionality has to be installed rather than being included by default, detracted from the user experience."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "8": "Interface and in use",
    "12": "Support",
    "14": "Security",
    "17": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "Zendesk": "https://www.zendesk.co.uk/",
    "best help desk software": "https://www.techradar.com/best/best-helpdesk-software",
    "Essential": "https://www.zendesk.com/product/pricing/#support",
    "Elite": "https://www.zendesk.com/product/pricing/#support",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Freshdesk": "https://www.techradar.com/reviews/freshdesk-crm-review",
    "Zoho Desk": "https://www.techradar.com/reviews/zoho-desk"
  }
}