{
  "source": "https://www.techradar.com/reviews/anker-soundcore-flare-2",
  "title": "Anker Soundcore Flare 2 review",
  "category": "audio-visual",
  "updated": "2020-04-24T18:53:18Z",
  "author": "lewis-leong",
  "summary": "The Anker Soundcore Flare 2 is an affordable, portable and fun Bluetooth speaker",
  "verdict": "The Anker Soundcore Flare 2 is an excellent go anywhere, do anything Bluetooth speaker. The design fits well in the home and its rugged construction allows it to join you at the beach or poolside. While it lacks a built-in voice assistant, its sound, build quality and excellent app make it a great value.",
  "pros": [
    "Great sound quality",
    "Speakerphone feature",
    "IPX7 water-resistant"
  ],
  "cons": [
    "No 3.5mm aux jack",
    "Sound distorts at higher volumes"
  ],
  "article": [
    "The first generation Anker Soundcore Flare impressed us with its great sound, build quality, and surprisingly excellent app. For its second generation, Anker took the “if it ain’t broke, don’t fix it” approach, retaining everything we loved about the first generation speaker and adding a few extra niceties.",
    "Retailing for $80 (£64.99, AU$140), the Anker Soundcore Flare 2 is a good value compared to our other favorites like the UE Wonderboom 2 and JBL Flip 5. All three are great, and while the UE Wonderboom 2 may be more rugged and can float in a pool, the Anker Soundcore Flare 2’s understated design allows it to fit in better in the home without screaming “outdoor speaker.”",
    "Ultimately the Soundcore Flare 2 is simply a minor refresh of the already-great Flare, but for anyone in need of a Bluetooth speaker we highly recommend it for its balance of sound, build quality, understated design, and excellent mobile app.",
    "The Anker Soundcore Flare 2 is the latest addition to Anker’s line of portable Bluetooth speakers and is available now. The Flare 2 is Anker’s flagship portable Bluetooth speaker, coming in at $80 (£64.99, AU$140). The original Flare is still available at a slight discount, which is still a great choice if you want to save $15.",
    "In terms of the competition, the Anker Soundcore Flare 2 is mid-pack. It’s not the cheapest offering you can get, but it’s by far not the most expensive speaker you can buy, either. It sits in the mid-rage, sub-$100 category which is dominated by Ultimate Ears and JBL but manages to put up a great fight against the incumbents.",
    "The Anker Soundcore Flare 2 looks nearly identical to the first-generation model but adds a LED ring to the top, providing more RGB goodness.",
    "The speaker moves a couple of buttons around but users can still control music playback, volume, calls, pairing, and BassUp on the speaker itself. Additional lighting and EQ features can be accessed via Anker’s mobile app.",
    "In terms of overall aesthetics, the Soundcore Flare 2 features the same cloth exterior of its predecessor, giving it a modern yet rugged look. The speaker still sports an IPX7 rating, which means the speaker will survive under one meter of water for up to 30 minutes. Around the back, there’s a rubber flap covering the speaker’s USB-C port, ditching the microUSB port of the original. However, the Flare 2 drops support for 3.5mm devices, which is a bit inconvenient.",
    "One nice surprise is the excellent Soundcore app, which allows users to update the speaker and control additional features. Additional lighting features can be accessed in the app, allowing you to customize colors as well as reactive lighting. There are several modes to choose from or you can create your own.",
    "There’s also a basic equalizer within the app, but most users will most likely enjoy the speaker’s default sound or BassUp feature, which has a dedicated button around the back of the speaker.",
    "Sound quality is great, offering a nice balance across the frequency spectrum. Tonally, the Anker is slightly warm, making it relaxing to listen to at low to medium volume. The Anker Soundcore Flare 2 gets mighty loud but like the original, the louder the speaker gets, the more sound quality suffers.",
    "This is expected from small wireless speakers that lack the amperage of larger speakers and the Flare 2 sounds best below 70% volume, which is still plenty loud for a small to medium sized room.",
    "The BassUp feature is a nice way to get more bass out of the speaker quickly and it isn’t overwhelming. However, those looking for more bass response will want to step up to a larger speaker like the JBL Charge 4 or JBL Pulse 4.",
    "One nice feature of the Flare 2 that many of the competition lacks is speakerphone. This is a nice feature to have for users who travel with their portable Bluetooth speaker or for days by the pool or campfire when you don't want to hold your phone the entire time.",
    "The Anker Soundcore Flare 2 is a minor refresh of the already-great Flare. Everything that made the original great is still here, including sound quality, an excellent mobile app, and an understated yet durable design.",
    "Minor upgrades like the second LED ring at the top and USB-C charging are nice to have, but not necessary. Those who don’t care about the minor updates will be happy with the discounted original, which is still available for sale.",
    "Compared to the competition, the Flare 2 fits better in the home and sounds better than the UE Wonderboom 2. However, the UE is more rugged and smaller, making it easier to toss in a bag or backpack. Those wanting more bass but still want a party speaker with lights will want to check out the JBL Pulse 4, which gets louder, has more bass impact and a full-body lightshow but is over twice the price."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design and features",
    "10": "Performance",
    "14": "Final verdict"
  },
  "links": {
    "Anker Soundcore Flare": "https://www.techradar.com/reviews/anker-soundcore-flare",
    "UE Wonderboom 2": "https://www.techradar.com/reviews/ultimate-ears-wonderboom-2",
    "JBL Flip 5": "https://www.techradar.com/reviews/jbl-flip-5",
    "JBL Charge 4": "https://www.techradar.com/reviews/jbl-charge-4",
    "JBL Pulse 4": "https://www.techradar.com/reviews/jbl-pulse-4"
  }
}