{
  "source": "https://www.techradar.com/reviews/nordvpn-teams",
  "title": "NordVPN Teams review",
  "category": "computing",
  "updated": "2020-05-23T14:30:11Z",
  "author": "mike-williams",
  "summary": "Set up and manage all your business VPN needs from a central web dashboard",
  "verdict": "It's a little short on features, but NordVPN Teams is a very new service, with a lot of promise, and already provides an easy way to organize, manage and protect your employee's network access. Well worth a look.",
  "pros": [
    "Easy to use",
    "Centralized billing",
    "Effective kill switch",
    "Speedy and responsive support"
  ],
  "cons": [
    "'Only' 31 countries (consumer NordVPN has 59)",
    "Short on features",
    "No web support site"
  ],
  "article": [
    "NordVPN Teams is a powerful business-oriented VPN which enables easy and secure access to corporate data, wherever you might be.",
    "The service is based around the same network and technology as NordVPN's consumer product, but it's been reengineered and redesigned to better suit a business audience.",
    "This starts with NordVPN Teams control panel, a centralized web console where you're able to configure your service and manage every user.",
    "Enter one or more email addresses, for instance, and the system sends messages inviting your users to download and install whatever apps they need (Windows, Mac, iOS or Android.)",
    "Billing is centralized, conveniently. No matter how many users you have, you'll only get one invoice. Licenses are transferrable, too, so if one employee leaves, you can switch the license to someone else in seconds.",
    "Once the accounts are set up, you're able to organize your users into teams, mirroring your company structure (sales, development, whatever you need.)",
    "There are 'only' 31 countries supported (there's an interactive map of their locations here), notably less than the 59 countries you get with NordVPN's consumer service. But NordVPN Teams more than covers the key locations, and goes further, allowing you to add custom gateways, dedicate them to particular offices or branches, then define which teams are allowed to use them.",
    "Once you're up and running, you'll probably want to confirm that your colleagues are using the VPN when you expect. The website mentions an activity log and reports, but apparently these are 'coming soon.'",
    "Welcome extra touches include support for logging into NordVPN Teams using your existing Azure AD, GSuite, Okta, Sami, and OneLogin credentials.",
    "There's still some signup work to do. The website mentions two-factor authentication, and says you can access the app using Google Authenticator, Authy, or your phone, but like the activity logs, that's still flagged as 'coming soon.'",
    "NordVPN Teams is available via two main plans.",
    "NordVPN Teams Basic covers the core functions we've listed: user management from the web console, transferrable licenses, centralized billing, support for logging in via various third-party options, and whatever mobile or desktop apps your users need.",
    "Pricing starts at $9 per user billed monthly, dropping to $7 if you pay for a year up-front. (Unlike some of the competition, there's no minimum user count - you can start with just one.)",
    "NordVPN Teams Advanced adds priority 24/7 support, a dedicated account manager, the option to add dedicated servers with fixed IPs for an extra $40 a month, and support for custom gateways. Once the activity log and reports are ready, they'll also be included here.",
    "The Advanced plan is priced from $11 per user billed monthly, falling to $9 with the annual option.",
    "An Enterprise plan piles on the high-end features - LDAP Active Directory support, site-to-site VPN, support for dedicated servers on your premises, API access for automation - but, unsurprisingly, there's no fixed pricing scheme. You must contact NordVPN to discuss your needs and get a quote.",
    "Whatever option you choose, you're able to pay by card or bank transfer, and just as with the consumer service, you're protected by a 30-day money-back guarantee.",
    "For comparison, Perimeter 81 has more features, but it's a little more expensive (from $10 per user per month), and requires a minimum 5 users.",
    "Windscribe's ScribeForce is essentially just offering a business-oriented front end to its regular service - centralized billing, team management and shared IPs - but that's hugely useful all on its own, and it's priced from a tiny $3 per user.",
    "It looks to us like NordVPN Teams has a reasonable mid-range price, then, but it's worth checking out the competition, track down a service with the best feature set for you.",
    "NordVPN Teams is really all about its web dashboard, where you add users, manage your network, and monitor exactly what's going on.",
    "Sending invitations to employees can be as simple as pasting their email address into a text box and clicking a button. If you have a large number of users, and can generate a list of their addresses separated by a space, comma or carriage return, copy and paste that into the dashboard's text box and it can add all of them in a single action.",
    "Users can be assigned to Teams, maybe representing departments within your company, although you can structure these however you like.",
    "If you have the NordVPN Teams Advanced plan, you can use your Teams as a permissions system, creating custom gateways, assigning dedicated servers and deciding which teams can access what.",
    "NordVPN Teams Basic users can't do as much, and their Teams are little more than a handy way to group users and make it easier to find them, similar to creating a folder on your file system.",
    "Drill down to an individual team member and you're able to reset their password, suspend them (temporarily block access to the service) or delete them entirely.",
    "A 'Members Devices' section lists when the user last logged in, and the device they were using at the time. While that sounds useful as a minimal form of monitoring, it's referring to when the user logged in to the NordVPN Teams website, not when they last accessed the VPN. Real user monitoring, which allows you to confirm that your employees are using the VPN as you expect, is 'coming soon' as a part of the Advanced plan.",
    "This looks a little basic, especially when compared to some of the high-end competition.",
    "Perimeter 81 has two-factor authentication and detailed user logging right now, for instance. An enormously versatile Policies system enables controlling access to your system by user, user group, IP, location, date, time, browser, operating system and more. And user control doesn't stop when you send employees a download link; you're optionally able to enforce your preferred settings on every device, for example enabling the kill switch and not allowing inexperienced users to turn it off.",
    "NordVPN Teams is a relatively new service, though, so it's no surprise that it's a little short on the more advanced management features. That will change over time, but if your needs are simple, you'll appreciate NordVPN Teams ease of use; Perimeter 81 can sometimes be a complicated nightmare, by comparison.",
    "Although NordVPN Teams is based on the same technology as the company's consumer service, it has its own apps. These are simpler, more streamlined, just focused on the basics, minimizing the need for training or support.",
    "The Windows app, for instance, is just a sidebar with a list of countries (or whatever custom gateways you set up), along with Settings and Quit App buttons.",
    "The default list isn't sorted alphabetically, which seems odd, but otherwise it couldn't be much easier to use. Left-click a country, you're connected immediately; click another country to switch your location, or click the same country a second time to disconnect.",
    "Sensibly chosen settings see the app launched when Windows starts, and the kill switch turned on by default. You can also set up the app to automatically connect whenever it launches, or when you access untrusted wifi networks, or any other networks you specify.",
    "The only other low-level tweak on offer is a choice of protocol: IKEv2, OpenVPN UDP or TCP.",
    "The kill switch is the key feature here, so we spent some time stress-testing it, doing our very best to break the app and produce some kind of data leak. But, we're happy to say that we failed. There could be some occasional confusion, as the app doesn't alert users if the connection drops, or warn them that it's reconnecting, and all users might notice is their internet access had disappeared. But that had no real-world impact on our privacy, as the kill switch blocked our internet access whenever the VPN dropped, and we were never left unprotected.",
    "In a regular consumer VPN review we'd also test its website unblocking abilities, check out UK and US performance, and more. This article is all about NordVPN Teams' business features, though, so if you're interested in how the service performs more generally, check out our regular NordVPN review.",
    "(Okay, maybe some would say that unblocking US Netflix is a major plus for business users, too. So, we tested it, and good news: NordVPN Teams enabled streaming whatever US content we liked.)",
    "If you have any problems with the service, NordVPN Teams support is on hand to help. Though not with any web knowledgebase, unfortunately. Web-based documentation is limited to the very basic setup and usage guides on the Download page, with nothing to, say, explain what the kill switch is, when you might want to change protocols, or give basic troubleshooting advice.",
    "That's a surprise, and maybe a potential issue in some situations. If your employees can't find answers to simple questions on the NordVPN Teams site, they're much more likely to come asking you.",
    "Fortunately, NordVPN Teams' ticket support is easy to access; just click a Help icon in the app, a New Ticket page opens in your browser, and you're able to ask a question, describe your problem or otherwise explain what you need to do.",
    "When we tried this, we had an initial response within 20 minutes, and follow-up replies were faster still. That's a great performance, and a sign that even if your employees do run into some major service issues, they'll quickly be able to get help to resolve them.",
    "NordVPN Teams is an easy-to-use service, with quality apps, which makes it easy to secure all your employees internet activities. It doesn't have the features of some of the competition, though, and even some key options (user logging) are listed as 'coming soon', so test the service carefully before you sign up the entire company."
  ],
  "headers": {
    "10": "Pricing",
    "20": "Control panel",
    "30": "Apps",
    "38": "Support",
    "42": "Final verdict"
  },
  "links": {
    "NordVPN Teams": "https://go.nordvpnteams.net/aff_c?offer_id=563&aff_id=3013&source=trd&aff_click_id=trd-us-1079238020438164000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnordvpn-teams&url=https%3A%2F%2Fnordvpnteams.com%2F",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "here": "https://go.nordvpnteams.net/aff_c?offer_id=563&aff_id=3013&source=trd&aff_click_id=trd-us-1354247950013314600&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnordvpn-teams&url=https%3A%2F%2Fnordvpnteams.com%2Ffeatures",
    "NordVPN Teams Basic": "https://go.nordvpnteams.net/aff_c?offer_id=563&aff_id=3013&source=trd&aff_click_id=trd-us-1279538860720063000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnordvpn-teams&url=https%3A%2F%2Fnordvpnteams.com%2Fpricing%2F",
    "NordVPN Teams Advanced": "https://go.nordvpnteams.net/aff_c?offer_id=563&aff_id=3013&source=trd&aff_click_id=trd-us-1674314558218752500&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnordvpn-teams&url=https%3A%2F%2Fnordvpnteams.com%2Fpricing%2F",
    "Enterprise plan": "https://go.nordvpnteams.net/aff_c?offer_id=563&aff_id=3013&source=trd&aff_click_id=trd-us-5501603735376985000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnordvpn-teams&url=https%3A%2F%2Fnordvpnteams.com%2Fpricing%2F",
    "Perimeter 81": "https://www.techradar.com/reviews/perimeter-81-vpn",
    "ScribeForce": "https://windscribe.com/scribeforce?affid=fghzq9e1",
    "NordVPN review": "https://www.techradar.com/reviews/nordvpn",
    "Download page": "https://go.nordvpnteams.net/aff_c?offer_id=563&aff_id=3013&source=trd&aff_click_id=trd-us-1431485909374254000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnordvpn-teams&url=https%3A%2F%2Fnordvpnteams.com%2Fdownload"
  }
}