{
  "source": "https://www.techradar.com/reviews/avira-antivirus-for-endpoint",
  "title": "Avira Antivirus for Endpoint review",
  "category": "computing",
  "updated": "2020-07-21T08:46:15Z",
  "author": "mayank-sharma",
  "summary": "The ugly duckling",
  "verdict": "An odd offering that besides support for Windows Server platforms, tech support, and a smattering of other features, offers very little advantage over its Free version.",
  "pros": [
    "Support for Android and iOS devices",
    "Useful endpoint apps"
  ],
  "cons": [
    "No remote deployment",
    "No statistics",
    "No Linux support"
  ],
  "article": [
    "When it comes to internet security, Avira is one of the strongest brands on the market, with one of the highest malware detection rates alongside the lowest number of false positives.",
    "However, that's for its general antivirus software, so how does it's endpoint protection for business stack up?",
    "Here we review the Avira Antivirus for Endpoint paid-for product, and see how it stacks against the competition,",
    "Unlike some of its peers, Avira’s security and protection solution for business endpoints isn’t a standalone product in itself, but rather a bundle of two standalone products: Avira Antivirus Pro and Avira Antivirus Server.",
    "The Avira Antivirus Pro product supports the Windows and macOS platforms, while Avira Server can be installed atop Windows Server 2008 R2 and newer releases. Both products offer comprehensive protection against viruses and malware.",
    "Avira claims to protect against zero day attacks thanks to its AI-based behavior analytics that’ll help it detect previously unknown threats. It also analyses processes to look for suspicious behavior to protect against ransomware and will also send digital fingerprints of any suspicious files to Avira HQ for analysis.",
    "The Avira Antivirus Pro edition also includes the email protection and internet protection functions.",
    "The former comes in handy to protect all non-encrypted email traffic, while the latter will block malicious websites, harmful downloads, and thwart any attempts to hijack the web browser.",
    "In addition to protection against viruses and malware, Avira also safeguards you from adware, spyware, fraudulent software, possibly unwanted programs (PUPs), and more. On the other hand, if you are running a file server on your Windows Server installation, you can use the Avira Server product to secure the data it houses against malware.",
    "Also as part of the offering, you can also install various other Avira products for added protections. Some of these are available for free, while others offer feature-restricted free versions.",
    "For instance, while the two products in the endpoint bundle protect Windows and macOS machines, you can also install the client for Android and iOS devices from the dashboard. This is the free version of the smartphone client that not only includes the anti-virus scanner but also several useful features such as anti-theft features, and the ability to lock installed apps. Some features, however like the mobile VPN and camera protection are only available in the Pro version of the smartphone app.",
    "Other useful Avira apps that are accessible from the dashboard include a password manager, a privacy strengthening app, a performance enhancer, a software update, and more. There’s also a very useful though feature-restricted VPN service as well.",
    "The biggest letdown of Avira’s endpoint bundle is the lack of a useful interface. The browser-based dashboard is severely lacking in terms of functionality. Unlike the dashboard of its peers, you don’t get any statistics about infections or warnings about the health of the machines on the Avira dashboard, which won’t even enable you to run or schedule scans on the machines.",
    "In fact you can only use the dashboard to deploy endpoints and install additional apps and features. Even the ability to add endpoints is feature-restricted. So while you can use it to download or email agents for Windows, macOS, Android and iOS, it doesn’t support remote deployments and can’t be hooked up to a directory server on your network.",
    "You can however use the dashboard to install the other apps from Avira’s portfolio of security apps like we’ve mentioned earlier. It’ll also list some hardware information about the endpoint and also show you a timeline of alerts from the device, including when a scan was run or when a malware was detected along with its name, location, and action taken.",
    "The endpoint app for the core antivirus product enables you to run or schedule quick, full and custom scans with ease. You can also use it to enable or disable any of the included modules, such as the mail protection, or the web protection. However rather disappointingly, the customizations for these modules is rather restricted.",
    "Avira however suggests using a third-party console to manage the endpoints. It recommends the O&O Syspectr dashboard that is included in your Avira license. You can use the Syspectr dashboard to manage your devices remotely.",
    "The dashboard has a Avira Antivirus module that you can use to schedule scans and get notified as soon as a malware is found in one of your devices. However, to use Syspectr you’ll have to install its client on all your endpoints as well in addition to the Avira client, which adds an unnecessary extra step to the process.",
    "Avira’s Endpoint bundle costs $142 for 3 devices for 1 year, which comes to about $47 per device. You can subscribe to this plan for 2 years and get a discount of $70. It’ll cost $213.53 or about $35.50 per device.",
    "Additional licenses will cost you about $47 per device for a year, with an increasing amount of discount if you pay for a couple of years. For instance, a license for 5 devices for 2 years will get you a discount of $118.62.",
    "In all fairness, Avira Antivirus for Endpoints is not a product as such unlike its competition, but rather an aggregation of a couple of products. You can also flesh out this mix by adding other free and feature-restricted products from Avira’s portfolio, which is a definite plus.",
    "However, while there isn’t anything inherently wrong with Avira’s antivirus offering, it isn’t cut out to be an endpoint solution. The two main causes that hurt its chances in the corporate environment are the lack of a functional dashboard and its inability to deploy to multiple machines remotely.",
    "This is something that even Bitdefender GravityZone Advanced Business Security has got right, despite its other shortcomings. Bitdefender has a feature-rich dashboard that allows fine-grained control.",
    "Also, the ability to deploy remotely is an essential feature for endpoint solutions. This is something that virtually all of Avira’s peers support. Panda Adaptive Defense 360 in fact supports multiple remote deployment mechanisms including subnet detection, which makes it fairly straightforward to roll out to multiple machines.",
    "Even Avira’s support for extra endpoint apps isn’t unique. Avast Business Antivirus Pro Plus has quite a few useful endpoints apps including a sandbox environment and a fully functional VPN.",
    "Also, unlike some of its peers like Bitdefender, Avira doesn’t support Linux endpoints.",
    "The lack of a functional dashboard for remote management and no means for remote deployment prevents us from recommending Avira for companies. It also only supports Windows and macOS, which again makes it useless for setups that have Linux endpoints.",
    "However, the product is comparatively cheaper than its peers, which would make it an interesting option for small home office users, especially since the Endpoint bundle is cheaper than the standalone Server product. But that’s about the only use case we can think of for Avira’s bundle for endpoints."
  ],
  "headers": {
    "3": "Features",
    "12": "Interface and use",
    "18": "Plans and Pricing",
    "20": "The competition",
    "26": "Final Verdict"
  },
  "links": {
    "endpoint protection for business": "https://www.techradar.com/news/best-endpoint-security-software",
    "Avira Antivirus for Endpoint": "https://www.prf.hn/click/camref:1011ldAfo/pubref:trd-us-6376484093440045000/destination:https%3A%2F%2Fwww.avira.com%2Fen%2Favira-antivirus-for-endpoint",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "email": "https://www.techradar.com/best/best-email-clients",
    "Windows": "https://www.techradar.com/news/best-windows-10-pro-laptops",
    "macOS": "https://www.techradar.com/best/best-business-mac",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "VPN": "https://www.techradar.com/vpn/best-vpn-for-business",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Bitdefender GravityZone Advanced Business Security": "https://www.techradar.com/reviews/bitdefender-gravityzone-advanced-business-security",
    "Panda Adaptive Defense 360": "https://www.techradar.com/reviews/panda-adaptive-defense-360",
    "Avast Business Antivirus Pro Plus": "https://www.techradar.com/reviews/avast-business-antivirus-pro-plus"
  }
}