{
  "source": "https://www.techradar.com/reviews/thinktrader-review",
  "title": "ThinkTrader forex trading app review",
  "category": "computing",
  "updated": "2020-07-14T13:34:29Z",
  "author": "daniel-blechynden",
  "summary": "In our ThinkTrader review, we show why this forex trading app is among the most popular available.",
  "verdict": "Overall, ThinkTrader (formerly known as Trade Interceptor) provides one of the best mobile trading experiences we’ve seen. Backed by powerful tools and impressive charts, it’s a great choice for beginners and advanced users alike.",
  "pros": [
    "Powerful charting tools",
    "Beginner-friendly interface"
  ],
  "cons": [
    "Lacks a few advanced indicators",
    "Unavailable in the US and Japan"
  ],
  "article": [
    "Trade Interceptor, one of the world’s best forex trading apps, was taken over by ThinkMarkets and rebranded as ThinkTrader in 2017. In our ThinkTrader review, we’ve looked closely at the ThinkTrader mobile interface, its main features, and why it’s one of the leading mobile trading apps.",
    "Note that the app is available via both the Trade Interceptor and ThinkTrader websites, as well as in the Apple and Google Play stores under the ThinkTrader name.",
    "Since ThinkTrader took over Trade Interceptor, it has added a range of additional features, with the goal of becoming the leading mobile trading platform. It’s available on both Android and iOS devices, and in general, is suitable for everyone from complete beginners to seasoned traders.",
    "In addition, ThinkTrader offers trading in a range of areas, including forex, precious metals, indices, cryptocurrency, shares, commodities, and CFDs. Clients from over 180 countries are accepted (notable exceptions are the USA, Japan, and Iran), and the apps are available in all regions except the USA and Japan.",
    "Opening a new ThinkTrader account is straightforward and shouldn’t take more than five to ten minutes. You will have to provide a significant amount of personal information, including your name, date of birth, nationality, and address. Following this, you will be asked to work through a short questionnaire about your trading knowledge and experience.",
    "On top of this, you will need to select what trading platform, currency, and leverage you want to use. Available platforms include Meta Trader 4 and 5, as well as the native ThinkInvest and ThinkTrader interfaces. Choose from eight base currency options and leverage up to 500:1.",
    "Finally, account verification is usually required in accordance with your country’s regulations. We created an Australian account and were required to upload photo ID and proof of address. You may also have to pass a short knowledge-based test before your account is approved.",
    "There are six different ThinkTrader account types. For starters, a neat Demo account is available for you to test trading strategies and become familiar with the platform before risking real money. Standard and ThinkZero accounts are both great for getting started and come with slightly different fee structures and forex spreads.",
    "In addition, Islamic clients can apply for an Islamic account that complies with Sharia law. Two or more individuals can apply for a Joint account if they want to, and experienced traders can take advantage of exclusive benefits and advanced leverage by requesting a ThinkMarkets Pro account.",
    "As one of the world’s best mobile trading apps, ThinkTrader is naturally backed by an impressive range of advanced features. For starters, the entire trading experience is streamlined and beginner friendly. But, this ease of use doesn’t come at the cost of advanced capabilities.",
    "For example, users will be able to access a suite of technical analysis tools. Live charts are available for most forex pairs, precious metals, popular cryptocurrencies, and over 1000 stocks, among others. You can select from ten chart types, including bar, broken line, and Japanese candlestick. All charts can be zoomed, scrolled, and overlaid with any of 100 technical indicators and/or 40 analytical objects.",
    "On top of this, the ThinkTrader app supports cloud-based alerts, which means you will receive notifications even when it isn’t running. In-app deposits and withdrawals are also available once your account is approved, and you can keep up to date with the latest financial news through the built-in news portal.",
    "Another noteworthy tool is the one-click order option. This enables you to access near-instant order processing rather than wasting time confirming orders. Multiple positions can also be closed with one click. And finally, the Trend-Risk Scanner is a powerful native tool that provides information about recommended trades.",
    "ThinkTrader’s support team is knowledgeable, fast, and efficient. 24/5 live chat and email support are available worldwide, while phone support is available in selected countries (the UK and Australia, among others). We tested the live chat briefly and were connected with an agent almost immediately. They answered our questions fast and accurately, and you can’t ask for much more than that. An impressive range of self-help articles and other resources is also available.",
    "ThinkTrader (formerly known as Trade Interceptor) is up there with the best mobile trading apps, and for good reason. It’s a professionally designed platform that’s accessible across most of the world, and it provides a great trading experience.",
    "The native ThinkTrader mobile app is backed by advanced features and makes trading on the go easier than ever. On top of this, the charting tools that are built into the app are truly impressive, with candlestick support and great customizability.",
    "Overall, ThinkTrader is a viable option for both beginners and advanced traders. And on top of everything else, it’s worth noting that the native desktop interface is also very powerful.",
    "Mobile trading apps are becoming increasingly popular, and ThinkTrader no longer stands out as a clear industry leader. One popular alternative is Pocket Forex, which supports 24/7 trading on a wide range of markets with 50–1000 times leverage. Another major competitor is Oanda, which has the advantage of being available to US and Japanese clients."
  ],
  "headers": {
    "2": "ThinkTrader: What does it offer?",
    "4": "ThinkTrader: Opening an account",
    "7": "ThinkTrader: Account Types",
    "9": "ThinkTrader: Features",
    "13": "ThinkTrader: Support",
    "14": "ThinkTrader: Final verdict",
    "17": "ThinkTrader: The competition"
  },
  "links": {
    "best forex trading apps": "https://www.techradar.com/news/best-forex-trading-apps",
    "ThinkTrader": "https://www.thinkmarkets.com/trading-platforms/thinktrader/"
  }
}