{
  "source": "https://www.techradar.com/reviews/razer-blade-2019-review",
  "title": "Razer Blade 2019 review",
  "category": "computing",
  "updated": "2020-06-16T17:48:56Z",
  "author": "joe-osborne",
  "summary": "The sharpest Blade yet",
  "verdict": "The Razer Blade may be egregiously priced, but Razer fitted much more value into its high-power gaming laptop than ever before. If you do end up spending the money required, you’ll taking comfort in the fact that you’re taking home the whole gaming laptop package.",
  "pros": [
    "Excellent gaming performance",
    "Huge battery life improvement",
    "Windows Hello camera included"
  ],
  "cons": [
    "Awfully expensive",
    "Somewhat goofy keyboard layout"
  ],
  "article": [
    "The Razer Blade has taken things to a whole new level in 2019. With its well-rounded set of features and internal components that are more powerful than ever, Razer’s mobile workstation is sharper than ever, securing its lofty spot in our best gaming laptops list.",
    "The Razer Blade 2019 sports quite its share of updates here, considerably improving on the 2018 model. The most notable of these updates is the new Nvidia Turing graphics under the hood, giving this new model the sheer power that its Pascal predecessors never really had. A couple of other improvements worth mentioning is the significantly improved battery life and that long-awaited infrared camera for facial recognition login.",
    "Sadly, those improvements do come at a premium price - the Razer Blade is pricier than ever. That leaves us asking: is the Razer Blade 2019 worth having to scrimp a bit for the next few months? The short answer is yes. Without a doubt, this is the most improved Razer laptop in existence, and if you’re a fan, it’s definitely worth the upgrade.",
    "For the model packing Nvidia GeForce RTX graphics, the Razer Blade 15 will set you back an exorbitant $1,999 (£1,899, AU$3,549) to start. That will get you an RTX 2060 GPU driving a 144Hz 1080p display and paired with a 512GB SSD storage.",
    "If you’re looking for something less pricey, you can compromise with a GTX 1060 coupled with a 128GB SSD, 1TB of storage and a 60Hz display. This should slash $400/£400 off the price, bringing it down to US$1,599 (£1,499).",
    "This graphics card, however, isn’t available in Australia. However, you can opt for a configuration with a GTX 1060 Max-Q and the same amount of storage instead, which will cost you AU$2,499. Another option is configuration with a GTX 1060 Max-Q and a 256GB SSD plus 2TB dual storage for AU$2,799.",
    "On the other hand, if you’ve got deep pockets, you can also upgrade to one with RTX 2070 Max-Q graphics, paired with a 256GB SSD for $2,299 (£2,219, AU$4,099) or another with a 512GB SSD for $2,399 (£2,479, AU$4,399). Both configurations have the same 144Hz Full HD display.",
    "The Nvidia GeForce RTX 2080 Max-Q graphics option (our review configuration) is packing a 512GB of SSD storage for $2,999 (£2,849, AU$5,099) and the very same 1080p display. 4K display models are also available for the RTX 2070 and RTX 2080 configurations in the US and the UK, which are of course more expensive. However, this display is not available in Australia at the time of writing.",
    "No matter which configuration of the Razer Blade 15 you get, you’ll have 16GB of RAM – which can be upgraded to 64GB, though you do have your pick of an Intel Core i7-8750H or an i7-9750H. So, basically, the Razer Blade is once again one of the most high-priced gaming laptops you’ll find right now, especially taking the actual specs into consideration.",
    "For example, the Razer Blade model with RTX 2070 graphics and a 1080p display is only $100 cheaper than as a similarly-configured 15.6-inch Gigabyte Aero 15, which Gigabyte has very recently upgraded. However, Gigabyte’s offering has a far larger 512GB SSD and larger battery capacity. And of course, it’s newer.",
    "You also have the choice of an Asus ROG Zephyrus GX701 with the same graphics card, but an enormous 17.3-inch 1080p display, 1TB SSD and 9th-generation Intel Core i7.",
    "Since you can get similar gaming laptops with RTX 2060 graphics from MSI or Asus for literally half of Razer’s asking price for a laptop with an RTX 2080 (knowing it wouldn’t be nearly as premium a build), you really need to think about how important those beefier graphics are to you before pressing that ‘Buy’ button.",
    "Donning that same all-black, unibody aluminum case, the Razer Blade inherits the exact same angular shape for 2019 that’s in its 2018 predecessor. This time around, however, it’s furnished with a more stripped down RGB lighting from last year’s – down to just the keyboard and Razer logo on the lid.",
    "At 0.70 inches (17.8mm) thin, this year’s Razer Blade is marginally thicker than before, though it’s only just as heavy at 4.63 pounds (2.10kg). And, it, too, is a laptop just 14 inches wide with a 15-inch display, thanks to those thinner screen bezels.",
    "Par for the course, the Razer Blade keeps the webcam in its rightful position above the screen while using thin bezels. However, at just 720p, the image this webcam produces is low-res and feels antiquated. It’s adequate enough for video calls, just not good enough for broadcasting yourself while gaming.",
    "Luckily, the new keyboard feels just as comfortable and satisfying to use, and it continues to offer forceful enough feedback for an island-style keyboard. The downside is that the Razer Blade’s keyboard layout issue has not been fixed from previous generations – with the ‘up’ arrow key set between the ‘Shift’ and ‘?’ keys.",
    "This makes typing questions a bit of a nightmare, as you’re constantly accidentally pressing the up arrow and adding a question mark to the line above where typing. It happened to us all the time during our testing. We would certainly have preferred smaller arrow keys if it meant a more practical, less typo-prone layout.",
    "As for Razer’s trackpad, it still feels incredible to use, but much like the keyboard, it’s also held back by one tiny weakness. In this case, the tracking surface is a little too close to the laptop’s edge, triggering minor palm rejection issues when navigating the operating system. We haven’t seen this problem while typing specifically on this year’s model, which is a good thing. Still, for this much cash, the experience should practically be flawless.",
    "Finally, we’re glad to see Razer finally bring Windows Hello facial recognition to its Blade webcam array. It’s not the fastest or most elegant implementation of the feature, being a little sluggish than other flagship laptops we’ve reviewed while also blasting a garish red light in our faces during scans. However, it’s still a handy feature to have, even if it necessitates just a little more refining.",
    "Razer nailed it again with the Razer Blade’s display… well, mostly. It does keep the same display from last year, which is not necessarily a bad thing. With a matte coating that’s remarkably effective at minimizing glare, this screen is definitely making the most of what it can do. Even if it’s still only 1080p.",
    "Much of that dazzling display is thanks to its 144Hz refresh rate, which smooths out the animations and motion by outpacing the frame rates the GPU inside is capable of. This is the best-case scenario for Nvidia’s new ray tracing and deep learning supersampling (DLSS) techniques for rendering lighting in games. Drops in frame rates due to these intensive features were rather buoyed thanks to this refresh rate.",
    "Again, the 100% sRGB color gamut makes for quite a wide variety of colors supported at impressive precision and vibrancy. The screen calibration done by Razer on the assembly line helps a lot as well."
  ],
  "headers": {
    "3": "Price and availability",
    "12": "Design",
    "19": "Display"
  },
  "links": {
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "2018 model": "https://www.techradar.com/reviews/razer-blade-2018",
    "Nvidia Turing": "https://www.techradar.com/news/nvidia-turing",
    "Gigabyte Aero 15": "https://www.techradar.com/reviews/gigabyte-aero-15-2019",
    "Asus ROG Zephyrus GX701": "https://www.techradar.com/reviews/asus-rog-zephyrus-s-gx701"
  }
}