{
  "source": "https://www.techradar.com/reviews/google-stadia",
  "title": "Google Stadia review",
  "category": "gaming",
  "updated": "2020-12-03T18:56:53Z",
  "author": "nick-pino",
  "summary": "Google Stadia could become the be-all, end-all game-streaming platform",
  "verdict": "If you pay for 100Mbps internet speeds, Google Stadia will perform wonderfully and is the game-streaming service we’ve long waited for. That said, if you have a slower connection or you’re tied to a capped data plan, Stadia will still work, but it isn’t quite the ‘negative latency’ experience Google promised and chews through data quickly.",
  "pros": [
    "Surprisingly good performance",
    "4K HDR for Pro subscribers",
    "Transitions from mobile to PC"
  ],
  "cons": [
    "Confusion around Pro",
    "Missing features at launch"
  ],
  "article": [
    "Google Stadia is cloud gaming's first truly bright long-term forecast. After spending years tied to the console the upgrade cycle, gamers are about to get a welcome reprieve.",
    "Stadia grants you access to a growing digital game library that works anywhere you go. Ambitious as it sounds, we’ve finally tested it in our own home and we can firmly say that it’s a true console alternative and, in time, a potential platform killer.",
    "It's doing a lot of things right. Besides offering surprisingly enjoyable performance with little-to-no latency on our home network, the service offers on-the-go streaming via phones and tablets as well as at home on PCs and Chromecast. On top of that, Stadia does built-in YouTube Gaming live-streaming and, if you buy a Premiere Edition, comes with an ergonomic Wi-Fi controller that reduces latency showing Google has looked at Stadia from all angles.",
    "So how does it stack up to competitors like PlayStation Now and Geforce Now? Well, we found that Stadia significantly outperformed PlayStation Now in terms of stability and while Geforce Now promises a larger library, Stadia is streaming 4K HDR and continues to release bigger titles.",
    "So, does that mean Stadia is the perfect streaming service? Well, not quite.",
    "Like any other streaming service, your experience could be radically different based on your proximity to Google’s servers and your connection speed. Unlike consoles that, roughly speaking, perform exactly the same from one location to the next, there’s no guarantee when it comes to game-streaming that we will all have the same experience.",
    "There are a number of minor problems plaguing the service that will be fixed in time, but if Google can clear up the confusion around Pro and turn on all the features it promised, it really could be the be-all, end-all game-streaming platform.",
    "Google Stadia is available to folks who ordered a Founders Edition or Premiere Edition starting on November 19 in 14 different territories including the US, UK and Canada. Both the Founders Edition and Premiere Edition cost $130 / £119 (around AU$190), but the former sold out months ago and was replaced by the latter.",
    "There are very minor differences in terms of the packages - the Founders Edition comes with a Blue Stadia Controller, while Premiere Edition has a white one and the Founders Edition comes with a free 30-day trial for a friend - but both editions come with a controller, a Chromecast Ultra and a three-month subscription to Stadia Pro.",
    "After your three-month subscription runs out, you’ll pay $9.99 / £8.99 per month for your Stadia Pro subscription which will be automatically from whichever card you have on file with Google. (And yes, unfortunately Google Stadia requires a credit card when you sign up, so keep that in mind.)",
    "Should you ever need a new controller or decide to wait for 2020 when the free service comes out and buy a controller then, the Stadia Controller will cost you $69 / £59.",
    "Google Stadia is the name of both a new game-streaming service from Google as well as the name of the storefront from which you’ll buy games. Anything you buy is yours to keep, but you’ll likely be paying full price for all the games you’ll find on the Stadia store.",
    "What Stadia promises (and mostly delivers) is a game-streaming experience that only requires the most basic of equipment: a Chromecast Ultra or your phone or your laptop, plus a controller of your choosing - either Google’s own Stadia Controller, the Xbox One controller or the PS4’s DualShock4 gamepad.",
    "Last but not least you need a connection to the internet, something we thought would be an early nail in the platform’s coffin considering how few of us have fibre connections. That being said, Google Stadia works on 10Mbps connections and only requires 35Mbps for full 4K HDR/60fps.",
    "At one time, you could only access Stadia through a Stadia Pro subscription, but that requirement has since been lifted and you're now allowed to use Stadia for free. In fact there are even free demos periodically that you can try at no cost.",
    "That being said, if you do like the service, you will want Stadia Pro the monthly subscription that enables you to play games in 4K HDR quality, gets over a dozen free games as soon as you sign up and offers you a discount when buying some games. But, importantly, despite what its name implies, Stadia Pro isn’t Netflix and it’s not an all-you-can-eat buffet of games.",
    "Both the signup and streaming service are activated through the Google Stadia app on Android and iOS. Once you’re logged in, you can then either Cast a game from the app to your Chromecast Ultra that comes with either of the two editions or go to Stadia.com to start streaming to your PC.",
    "The third option, and the one that’s a bit trickier, is that you can connect a Stadia Controller to a Google Pixel 3, Google Pixel 3a or Google Pixel 4 phone, and stream directly to your phone. Try to stream on any other phone and the app will either ask you to connect to Chromecast Ultra or reinforce the three main entry points with a wall of explainer text.",
    "There are pros and cons to all three of the ways to access the streaming service which we’ll cover in the performance section below, but Google has done a phenomenal job of getting the controller to pair with all three access points, allowing you to jump between them pretty seamlessly. (But, as far as we know, you can’t be logged on and streaming to two devices at the same time, so you probably shouldn’t hand out your Stadia account info willy-nilly.)",
    "There’s some really good stuff - like Red Dead Redemption 2 and Mortal Kombat 11 - plus some games that are probably less appealing to folks like Just Dance 2020.",
    "Stadia has some exclusive in its collection so far, including a child’s first horror game called GYLT, and hosts some highly anticipated titles like Watch Dogs Legion, Baldur’s Gate 3, Marvel’s Avengers and Cyberpunk 2077.",
    "Originally Google Stadia was supposed to release with 12 games but, one day before launch, that number nearly doubled to 22 games with one extra game, Samurai Showdown, available for free for Stadia Pro subscribers.",
    "That last-minute addition is worth remembering because it goes to show you what Google can do - namely, it can, at a whim, optimize and launch a whole bunch of games for the service. It’s a bold move that shows us that the service can update itself regularly with new games. (You can find a whole list on Google Stadia's website.)",
    "Since launch, Google has added close to 100 new titles to the library and has no plans of slowing down. What that tells us is that Google has the power and budget to drop a whole bunch of new games in the same way that Microsoft does with Xbox Game Pass but, also like Game Pass, the well of content will always be limited when compared to other services like Steam that are much less of a walled garden and are entirely more community-driven.",
    "Long story short? Google’s game team have already proved themselves capable of delivering a slate of new games, but the service will always be limited by what Google and its team assemble and put up.",
    "Stadia’s design and interface are brilliant and drop-dead simple to use. On both mobile and desktop, your home screen is essentially all the games you have in your collection with the top-most game the game that you played last.",
    "On desktop you’ll have the option to find friends and add them to a party, as well as access your screenshot collection with photos of games you’ve taken. The mobile layout has a similar home screen, but also has tabs for the Stadia Store and a feed with videos, news and blog posts from the Stadia team.",
    "One argument you could make against the service is that there’s not a lot of depth here compared to, say, the Xbox One’s multi-faceted interface or even the Steam Store’s complex, curated and very robust app. The counter argument, though, is that Google didn’t overcomplicate something that should be simple, and can always add more complexity and depth to the apps as more content becomes available.",
    "We’ll dive deeper into the Controller in a separate review, but it’s worth spending a bit of time on it here - as it’s the only way you can play the service on mobile and Chromecast.",
    "The Stadia Controller feels a bit like a standard Xbox One gamepad in terms of heft and a familiar feel in the hands. The aligned sticks obviously bare some resemblance to the PS4’s DualShock 4, but they have a textured ridge like the Xbox One’s pad.",
    "In terms of face buttons, you’ve got a clicky D-Pad that feels moderately responsive, a set of four lettered buttons in the same layout as the Xbox One, and four special function buttons: menu (start), options (select), Google Assistant and the Capture button that saves screenshots to your account and, one day, will connect to YouTube Gaming. Last but not least, the front has a Stadia center button that turns the controller on and off.",
    "Under the Stadia button is a 3.5mm jack for a pair of headphones while on the back you’ll find a USB-C port for pairing and power, plus a pair of triggers and bumpers.",
    "The bumpers have a responsive click when depressed, but the triggers are fairly mushy and don’t have any sort of haptic feedback. That news will be kind of upsetting for folks who play racing or shooting games as force feedback really enhances the gameplay in those genres.",
    "While the Stadia Controller comes with both the Premiere and Founders Edition of Google Stadia and will primarily serve as the de facto controller for the next few months, Google has said that it will support the Xbox One and DualShock 4 gamepads but hasn’t given us an exact time frame for that to happen.",
    "Google Stadia is slowly adding in the features it promised at launch, and is now nearly feature-complete. We're still waiting on Google Assistant support but the service has rolled out direct streaming to YouTube via YouTube Gaming.",
    "For streamers, Stadia holds real potential as a way to unify the gaming and streaming platform - and that in itself is pretty exciting.",
    "Even if you're not a streamer, what Stadia does offer right out of the box is screen capture, a useful feature in the social media age, and a Friends List… which is nice if you want to party up with friends to play Destiny.",
    "Arguably the two most important features at launch are Controller support - which again, works wonderfully - and seamless transfer between platforms. The latter worked surprisingly well and while we couldn’t pick up exactly where we left off in most games, we were only back a minute or two or, in one case, a minute ahead of where we were.",
    "So how does Stadia actually perform out in the real-world? It’s a question we’ve wanted the answer to since Stadia was announced, and now we finally have an answer: it’s awesome.",
    "For our real-world testing, we tried Stadia on three different devices - PC in a browser, Casting to a Chromecast Ultra and on a Google Pixel phone - with three very different types of games. Here’s what we found.",
    "Performance (on a 150Mbps hard-wired connection in a browser window)",
    "On a 150Mbps hard-wired connection, Stadia is amazing - it’s like playing a game stored locally on your PC.",
    "For our PC test we played the first few hours of the Stadia-exclusive GYLT in a regular Chrome browser, and we didn’t notice a single dropped frame or artifacting of any sort throughout the entire, hour-long session. Sure, there was a brief buffer period when the game first launched, but after that it was entirely seamless all the way through.",
    "Admittedly, this is probably the way we’ll continue to play games on Stadia, especially those that require ultra-specific timing (shooters and fighting games, as you’ll see in a second) or games that simply work better with a keyboard and mouse.",
    "Performance (on a 50Mbps Wi-Fi connection with Chromecast Ultra)",
    "Stepping down from a hardwired connection to a dual-band 5GHz connection, Stadia still held up immensely well with only small issues in the audio impairing an otherwise flawless performance.",
    "For this test, we tried something that we knew would look good on a 4K HDR TV - Destiny 2 - Cast from the Stadia app on our phone to Chromecast Ultra in the living room.",
    "Despite our reservations, Destiny 2 ran in 4K/60 without any issues on a 50Mbps wireless connection with no noticeable delays or artifacting - even in particularly intense firefights.",
    "Again, there was a minor delay when the game is buffering at the very beginning and we did notice a small half-second delay between an on-screen action (like firing a gun) to the sound effect actually playing on the TV, but there was no impact on the gameplay.",
    "Performance (on a 15Mpbs Wi-Fi connection with Pixel 3a XL)",
    "For our last test, we tried Stadia on a new Wi-Fi network that, according to an Ookla speed test, maxed out around 15Mbps. Going into this test we expected the worst - that Stadia would basically be unplayable. Thankfully we were wrong.",
    "Using a Pixel 3a XL supplied by Google for our review, we put the streaming service to the test using the absolute minimum specs to see how it would perform with a lag-sensitive game like Mortal Kombat 11 and while there certainly were a number of slowdowns that we’ll describe in a second, most of the time we saw no noticeable issues.",
    "So what does a spike in the connection look like? What you’ll notice first is Stadia trying to drop the resolution from HD to sub-HD and, if that doesn’t fix the problem, the game itself will slow to a crawl and then quickly catch up on the action all at once. It’s exactly what we’ve seen happen on services like PlayStation Now, so it’s not entirely unexpected here.",
    "The silver lining is that a slowdown like this, while annoying and potentially destructive in any sort of player-versus-player environment, really wasn’t so awful that it made us want to outright quit like we’ve felt in the past with other services. In fact, once the spike happened we could usually go for another few minutes without another major spike occurring."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Google Stadia release date and price",
    "11": "Google Stadia: what is it?",
    "16": "Google Stadia app: which devices support it?",
    "19": "Stadia games: What's available to stream?",
    "25": "Google Stadia design and interface",
    "28": "Google Stadia Controller",
    "34": "Google Stadia features",
    "38": "Performance",
    "54": "Don't use it if..."
  },
  "links": {
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "Chromecast Ultra": "https://www.techradar.com/reviews/chromecast-ultra",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Google Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Google Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "Google Stadia's website": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-5097108897234999000/https://store.google.com/us/product/stadia_games"
  }
}