{
  "source": "https://www.techradar.com/reviews/mdlive",
  "title": "MDLIVE review",
  "category": "computing",
  "updated": "2020-02-18T19:00:19Z",
  "author": "jonas-p-demuro",
  "summary": "The always available virtual doctor",
  "verdict": "MDLIVE offers a comprehensive telemedicine solution, but some significant issues, like higher pricing give us pause in giving it a higher recommendation.",
  "pros": [
    "Available mobile apps",
    "Choice of support options",
    "Upfront pricing",
    "List of conditions not treated"
  ],
  "cons": [
    "Payment collected prior to appointment",
    "Expensive pricing",
    "No email or chat support options",
    "US only"
  ],
  "article": [
    "MDLIVE was founded in 2009 and has its headquarters in Sunrise, Florida. It provides telehealth services via its software, to offer a panel of board certified physicians and therapists that are available at all hours to provide care designed to substitute for your local emergency department, or urgent care center.",
    "MDLIVE is a serious player and the company partnered with Walgreen’s in December of 2014 to provide virtual doctor visits via the pharmacy’s smartphone app. The MDLIVE website indicates that it currently serves over 39 million members.",
    "Using MDLIVE is a fairly simple process. It starts with downloading the mobile app for your smartphone platform of choice. The user then registers for free, by entering their information, which creates the secure account in about fifteen minutes.",
    "MDLIVE is available for the treatment of many common conditions, including allergies, constipation, the flu and pink eye- over fifty medical problems. Also covered are behavioral issues, such as anxiety, depression and addictions, and dermatologic problems, such as acne, rashes, and insect bites.",
    "The next step is to choose a doctor. This can be done for an urgent visit, or scheduled for a later date and time that is more convenient. MDLIVE indicates that the physicians used are board certified in their specialties.",
    "The last step is to interact with the doctor for the visit. The patient gets the opportunity to indicate their medical complaint, the doctor will then interview the patient with additional questions to narrow down the problem and determine further treatment. If a prescription is indicated in the physician’s opinion, it can be transmitted to the patient’s local pharmacy via ePrescribe so it will be waiting for the patient to pick up at their convenience.",
    "Unlike some other services, MDLIVE is upfront about some conditions that their doctors do not treat. This does include the more obvious cases that need an emergency department, such as active bleeding, or a heart attack. Some other less intuitive, but more complex medical conditions also get listed, such as urinary tract infections in males, and females under 18 years old, children under the age of 3 with a fever, and suicidal patients. We can certainly agree that these more complex medical issues are better off with a direct medical exam, and appreciate that MDLIVE is upfront about the limitations of the service that it is providing.",
    "MDLIVE’s service appears to be hit or miss on user reviews, and on balance plenty of folks did receive medical care to their satisfaction, and on the company’s Facebook page, it has over 11K likes. That being said, some users had a less than positive, or even downright negative experience, such as the multiple posts that folks felt that MDLIVE was a “Rip off,” and that the physician ended the interaction abruptly, not taking the time to fully listen to the complaint.",
    "Another downside is that MDLIVE is restricted to use while only in the United States. For patients that have used the service, and then are traveling abroad, they will not be able to use it, nor is it for citizens of any other countries.",
    "Providing a medical diagnosis, without directly examining and laying hands on the patient for a physical examination can also be a challenge of any telehealth service. This also gets borne out with more than one patient complaining that they had a sinus infection that did not get fully treated. In one case, the patient ended up seeking further treatment from a local urgent care center, and in another case the MDLIVE physician only prescribed steroids, without antibiotics. In both cases, the patients eventually ended up on antibiotics, demonstrating that a telehealth approach may not be ideal for some medical problems.",
    "In case help is needed with MDLIVE, it is available via a variety of methods, after the requisite suggestion to contact 911 for a more serious emergency. The first is via telephone, through their toll free number. The second is through the online portal, and as you provide both your email and phone number, we assume the response could be through either. The company also lists their postal address, although we doubt many folks are sending letters via ‘snail mail’ these days.",
    "We do find it lacking that there is no option for a direct email exchange, or for contact via chat.",
    "MDLIVE has refreshingly transparent pricing, clearly found on the website. For an urgent care visit, such as for cough, allergies and the flu, the cost is $75 (£58). Mental health services are also available, such as for addiction, stress or a bipolar disorder, and this runs $259 (£200) for the initial psychiatric visit, and $99 (£76) for a follow-up visit; a session with a counselor costs $99 (£76) as well. Finally, a visit with a dermatologist, for a rash, acne or eczema, has a cost of $69 (£53).",
    "Furthermore, MDLIVE may be free for those with an insurance provider that provides this as a benefit, or else there may be a copay. Otherwise, once you choose a provider, with an appointment date and time, you will be charged for the visit via a major credit or debit card. Reportedly, the appointment can be canceled with at least 24 hours notice for a full refund.",
    "MDLIVE is a popular entry into the telemedicine space with millions of users. We take note of its advantages such as mobile apps, a choice of support options, and the range of services offered including dermatologic. We also pause at the issues of higher prices than competitors, folks getting charged prior to their visit, and that this is restricted to clients in the US only. In the final analysis, MDLIVE is truly a mixed bag compared to its peers."
  ],
  "headers": {
    "2": "Features",
    "7": "Drawbacks",
    "10": "Support",
    "12": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "MDLIVE": "https://www.mdlive.com/",
    "telemedicine": "https://www.techradar.com/best/best-telemedicine-software"
  }
}