{
  "source": "https://www.techradar.com/reviews/corsair-one-a100",
  "title": "Corsair One A100 review",
  "category": "computing",
  "updated": "2020-06-16T13:00:29Z",
  "author": "bill-thomas",
  "summary": "Tiny PC, big power",
  "verdict": "The Corsair One a100 is an incredibly powerful machine, though the lack of upgradeability and the high price tag will be enough to turn plenty of people off.",
  "pros": [
    "Extremely powerful",
    "Tiny",
    "Looks cool",
    "All liquid cooling"
  ],
  "cons": [
    "Hard to service",
    "Expensive"
  ],
  "article": [
    "The Corsair One lineup of gaming PCs has always been the kind of product that is super expensive, but super worth it if you have the cash to burn. They pack the most powerful hardware into a tiny chassis that would simply disappear into the background if not for the stylish RGB.",
    "The chassis measures just 14.96 inches tall and 7.87 inches wide, making it perfect for either gamers that want to play high-end 4K PC games in their living room without an obnoxious tower, or creative professionals that want a lot of power in a case that will fit on their desk.",
    "As far as ports go, there are a ton of them. On the bottom of the front of the tower, you'll get two USB-A ports, a headphone jack and an HDMI port, which is probably awesome for anyone doing VR with the Corsair One. And, because it's a desktop system, there are plenty of ports around back, too.",
    "There are, obviously, a ton of USB-A ports right off the motherboard – 7 in total – along with a USB Type-C. There is also Line-In and Line-Out ports, LAN and on-board Wi-Fi 6. What's really cool, however, is that the DisplayPort ports are right next to the power supply, which makes for incredibly easy cable management.",
    "And there is definitely a lot of power here. The Corsair One A100 that we got in for review is packed with an AMD Ryzen 9 3950X, 32GB of RAM, a 1TB SSD and an Nvidia GeForce RTX 2080 Ti. That's certainly a lot of power in that small chassis, which may raise some concerns for cooling – but because it's all liquid-cooled, that definitely won't be an issue.",
    "The Corsair One a100 doesn't start off with that configuration, though. Instead, for $2,999, you can get the AMD Ryzen 9 3900X with 32GB of RAM, a 500GB SSD and an Nvidia GeForce RTX 2080 Super. That's still one hell of a starting configuration, though, and should still easily be capable of both 4K gaming and some serious creative chops – especially since you're getting 2TB of archival storage no matter what.",
    "The configuration we reviewed here, however, will run you $3,999. That's a lot more expensive, but considering just how much of a jump it is in raw specs, however, it's really not that bad.",
    "You may be tempted, however, to just get the starting configuration and upgrade it afterwards – it is a gaming desktop, after all, but we would actually advise against that. There is a button on the back of the chassis that will allow you to pop it open, but if you want access to the motherboard, you're in for some serious deconstruction. This is definitely not a PC that anyone that loves tinkering with their hardware is going to be into.",
    "So, pretty much how you slice it, the Corsair One is an expensive machine, but at least you get some extremely solid performance out of it. The monster Ryzen 9 3950X leads to some extreme CPU performance, scoring 8,665 points in the Cinebench R20 benchmark. Similarly, it gets a Geekbench 5 multi-core score of 11,948.",
    "But it's not just the CPU performance that knocks it out of the park. Graphics performance is also amazing, thanks to that RTX 2080 Ti. For instance, even in Metro Exodus at 1080p Ultra, you'll get a rock-solid 94 fps in one of the hardest games to run. We ran the test again at 4K with RTX On, and we got 55 fps – it's pretty incredible.",
    "Even in the synthetic gaming benchmarks, the Corsair One a100 is a force to be reckoned with. This PC gets 13,620 in Time Spy and a whopping 27,978 points in Fire Strike. There won't be a single game that's either already out or will be in the near future that the Corsair One a100 won't be able to absolutely demolish.",
    "If you have the cash required to jump in on the Corsair One a100, there's a lot to love here. It's an absolute beast of a gaming PC, though the lack of upgradeability might justifiably rub some the wrong way. Of course, if that's something you're genuinely interested in, you could always build your own PC."
  ],
  "headers": {
    "0": "Two minute review",
    "12": "Don't buy it if..."
  },
  "links": {
    "Corsair One": "https://www.techradar.com/reviews/corsair-one-pro-i180",
    "gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "AMD Ryzen 9 3950X": "https://www.techradar.com/reviews/amd-ryzen-9-3950x",
    "Nvidia GeForce RTX 2080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-ti-review",
    "AMD Ryzen 9 3900X": "https://www.techradar.com/reviews/amd-ryzen-9-3900x",
    "Nvidia GeForce RTX 2080 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super"
  }
}