{
  "source": "https://www.techradar.com/reviews/nuraloop-headphones",
  "title": "NuraLoop headphones review",
  "category": "reviews",
  "updated": "2020-09-21T04:59:20Z",
  "author": "harry-domanski",
  "summary": "Improving on aural perfection",
  "verdict": "Promising many of the same features as its larger sibling, the NuraLoop offers up personalized audio in a more compact, rugged, portable, and affordable package while making barely any sacrifices in the process.",
  "pros": [
    "Rich, adaptive audio",
    "ANC and social mode",
    "Rugged, sweatproof design"
  ],
  "cons": [
    "Stiff neckband can get in the way",
    "Bulky earbuds"
  ],
  "article": [
    "Update: As anticipated, Nura has released new firmware for the NuraLoop that added a manual on/off setting (optional) and also introduced a number of quality of life improvements such as double tap functionality, enhanced voice call clarity, and improved fit and seal detection.",
    "NuraLoop boils down the essence of the company's first product, the Nuraphone, into a much more compact, rugged, and affordable package, and doesn't lose much in the process.",
    "The star of the show is its adaptive audio technology, which automatically determines a listening profile for the user and feeds them well-balanced, lush sound as a result.",
    "On top of this, features like active noise-cancelling, social mode, an IPX3 rating, Immersion mode, and the ability to attach an analog cable for 3.5mm headphone jacks makes this pair of headphones truly shine.",
    "While the physical rumblings of the bigger Nuraphone's Immersion mode are absent, little else is sacrificed in the transition from over-ear cans to these wireless in-ear neckband headphones, and considering the almost halved price, the NuraLoop is a total winner.",
    "As with every in-ear product, there are elements that won’t gel with everyone – the bulkier housings of the buds might not suit every ear, and the non-adjustable neckband could irritate some, but these complaints are certainly minor in the scheme of NuraLoop’s manifold successes.",
    "For the users that find the units comfortable (the majority, we suspect), they’ll be greeted with beautiful, tailored sound in a compact package that boasts solid battery life, noise-cancelling and weatherproofing for a very reasonable price.",
    "The Melbourne-based audio company Nura set loose their second product on the world in May 2020, carrying forward the torch first lit by the over-ear Nuraphone in 2017.",
    "Compared with the $399 (£349, AU$549) asking price of its older sibling, the NuraLoop offers a lot of the same magic at an impressively reduced cost of just $199 (£199, AU$299).",
    "As with the Nuraphone, these in-ears are only available in a single color, but the uniform black design is elegant enough to make up for this lack of choice.",
    "When worn, the only markings visible are the pair of white Nura logos on each earbud and, for the eagle-eyed, the word ‘nura’ on the connector that sits at the back of the neck.",
    "This pared-back aesthetic that Nura has established for itself is obviously not for those that like a bit more in the way of personalization and color in their tech, but for a singular look, it's certainly safe and stylish.",
    "Construction is predominantly plastic with certain components having a similar rubberized, silicone feel to elements of the Nuraphone. The ear hooks that loop up and over your ears are malleable but somewhat rigid, so you can bend them to better secure their fit around your ears.",
    "While these hooks are somewhat adjustable, the length of cable behind your neck isn’t. For the most part, this is fine and makes for a tidy aesthetic, but we found it to bump against collars and hoods of bulkier clothing, occasionally even dislodging the seal of the NuraLoop’s in-ear fit due to the relatively rigid cable.",
    "As for the earbuds themselves, their housings are definitely on the large and heavy side compared with much of the competition (even some true wireless 'buds), but we didn’t find this uncomfortable during extended listening sessions, and when you consider the tech within them, it’s easy to forgive.",
    "While not submergible, the NuraLoop is rated at IPX3, so it’ll certainly survive inclement weather and is a good companion when sweating it up. It ships with a nifty neoprene case which is nice and compact, although it gets a bit tight if you try packing in both the cables along with the unit itself.",
    "The cables in question allow you to connect to a USB-A port for topping up the impressive 16-hour battery, or a 3.5mm headphone port if you’d like to use your NuraLoop plugged in. These both attach magnetically via a proprietary connection in the centre of the neckband, meaning that the headphone cable runs down your back.",
    "While certainly not typical for consumer headphones, this design is standard for musicians using in-ear monitors when performing live (a market Nura caters to excellently), and considering how rare the ability to run audio to wireless in-ears via a cable is, any complaint on this design decision is moot.",
    "The NuraLoop’s user interface consists of two large, capacitive buttons that you can interact with by either tapping or ‘dialling’ up or down. We found ourselves accidentally activating these when adjusting the fit of the ‘buds fairly often, but more on this later.",
    "That latter 'dialling' control method calls for you to circle your finger around the edge of the button to turn up or down levels of certain features, such as volume or ANC.",
    "We found ourselves not using these dials too often as we preferred more precise control over each of the settings, but having the option there is nice.",
    "A more useful implementation of the dial, in our opinion, would be to use it for transport controls (skipping tracks forward and back), so hopefully that can be implemented in the future.",
    "Speaking with Nura CEO and co-founder Dr. Dragan Petrovic, we learned that the firmware updates that added ANC and social modes to the original Nuraphone were implemented due to customer feedback, and that the company will be taking much the same ongoing development approach with the NuraLoop.",
    "With that in mind, we don’t expect any of our minor gripes about the UI to be long-lasting – regarding the issue of accidentally activating the capacitive buttons, there’s already talk of a ‘safe mode’ that would temporarily disable them at will – useful during a workout session, for instance.",
    "In fact, at the time of writing, a firmware update slated for late August should introduce new double-tap functionality, better automatic on/off control, improved fit and seal detection, as well as a host of other quality of life improvements.",
    "Before even listening to your NuraLoop, you’ll need to download and set up the app, but it’s well worth it. Nura’s flagship trick (one that’s been imitated plenty, but never matched) is its adaptive hearing profiles which adjust the frequency response of audio to better suit the frequency sensitivities of your actual ears.",
    "Take a look at Nura’s website for a more detailed explanation of the fascinating science behind it, but for simplicity’s sake, all you need to know is that it’s very easy and works spectacularly.",
    "Creating a profile takes a minute or two and is completely automatic. Once you’ve made it, you’ll be able to hear a striking difference between vanilla audio and that which has been adapted.",
    "While it's hard to describe the quality of this audio in terms of frequency response (as everyone will experience it slightly differently), the take home is that the sound is incredibly well balanced with a great sense of clarity and space, even at higher volumes.",
    "Although the process is entirely automatic and works a treat, it would be nice to see an 'advanced' mode that allowed users to tweak the EQ settings of their profile further if they find themselves with particular preferences.",
    "The hearing profile you create here is distinct from that created if you own the Nuraphone, so you can’t share them across devices. This is due to the fact that entirely new drivers and processors are used for the NuraLoop, but (importantly) the same results are achieved.",
    "Immersion mode makes a return, allowing you to select a varying degree of enhanced bass impact with your music, and while it isn’t quite as powerful as the version found in the over-ear counterparts, the NuraLoop’s 8.6mm drivers are plenty capable of delivering on this front.",
    "Similarly, the active noise-cancelling and social mode are present in this device as well. The ANC isn’t quite up to competing with Sony and its intelligent cancelling, but it's still one of the better applications we’ve come across, and performed admirably in office, street and home environments."
  ],
  "headers": {
    "0": "One-minute review",
    "7": "NuraLoop price and release date",
    "9": "Design",
    "15": "Features",
    "25": "Performance",
    "33": "Don't buy if..."
  },
  "links": {
    "Nuraphone": "https://www.techradar.com/reviews/nuraphone-headphones"
  }
}