{
  "source": "https://www.techradar.com/reviews/hp-s430c-monitor",
  "title": "HP S430c monitor review",
  "category": "computing",
  "updated": "2020-10-29T15:43:34.098Z",
  "author": "jeremy-laird",
  "summary": "HP’s 43-inch ultrawide monster majors on productivity and clever connectivity",
  "verdict": "HP’s 43-inch ultrawide monster majors on productivity and clever connectivity, but falls short for image quality",
  "pros": [
    "Huge panel for running multiple apps",
    "Clever screen sharing software",
    "Dual USB-C connectivity with charging"
  ],
  "cons": [
    "Very expensive",
    "Relatively low resolution and DPI",
    "Mediocre VA panel quality"
  ],
  "article": [
    "Multi-monitor setups are the standard issue solution to the problem of maximizing productivity. In many offices, it’s now almost unusual to see a workstation composed of a single screen. Dual and even triple-screen installations abound.",
    "The alternative to that proliferation of panels, of course, is a single much larger display. Which is exactly the point of the new HP S430c. It’s a massive 43-inch ultrawide monitor with a curved panel designed to comfortably replace a dual-monitor setup and just maybe step in for a trio of screens controlled via a single keyboard and also supports simple drag-and-drop file sharing across those devices.",
    "Apart from the sheer size of its panel, the HP S430c has a number of other features that make it suitable for simplifying a multi-monitor setup. Highlights dual USB-C inputs, Windows Hello facial recognition support and HP’s Device Bridge, which allows two PCs to be controlled via a single keyboard and also supports simple drag-and-drop file sharing across those devices.",
    "If that all sounds impressive, the HP S430c does have some downsides, including certain aspects of image quality and pricing. But if you’re looking to simplify a messy multi-monitor workstation, this is an intriguing monitor.",
    "At £958 in the UK and $999 Stateside, the HP S430c isn’t exactly cheap as a business monitor. But for a screen of this scale and given the feature set, it is pretty good value.",
    "By way of example, HP’s own 38-inch ultrawide monitor, the Z38c, costs around the same money. Similar 38-inch panels from other brands, such as the Viewsonic VP3881, again weigh in around the same money.",
    "A trickier comparison involves the 49-inch class including the Philips 499P9H. That’s available for slightly less money, sports more pixels, a bigger panel and USB-C connectivity. It’s not quite as flexible and feature rich for overall connectivity, but it’s certainly hard to overlook.",
    "A number of competing 43-inch ultrawide monitors are available, such as the Samsung CJ89. They tend to be around £200 / $200, but can’t quite match the HP S430c for connectivity.",
    "The HP S430c is expensive as a matter of simple fact. But initial impressions imply it might just be worth the money. The sheer scale of the curved 43-inch panel, exaggerated by the extreme 32:10 aspect ratio, is certainly a big part of that. The slick styling, quality materials and solid build quality only add to the impression of cash well spent.",
    "The headline specs from that epic panel start with a native resolution of 3,840 by 1,200 pixels. Given the large panel size, that’s a relatively modest resolution and translates into a pixel pitch of just 92DPI. The panel type is VA and it’s a conventional SDR rather than HDR display, with peak brightness of 350 nits and static contrast of 3,000 to one.",
    "In terms of color coverage, HP only quotes 99 per cent coverage of the fairly undemanding sRGB space. That implies coverage of more demanding gamuts such as DCI-P3 will be less than stellar. Moreover, this is an 8-bit per channel panel. So, it’s not pitched at workflows that demand top drawer color accuracy.",
    "Instead, it’s productivity at which the S430c aims to excel. Partly, that’s a function of the large, ultrawide panel that lends itself to running multiple application windows in parallel. But this monitor has more tricks up its sleeves. For starters, there’s a pop-out 1080p webcam in the top bezel which supports Windows Hello facial recognition for easily accessible security.",
    "You also get both HDMI and Displayport connectivity. But the really clever bit involves the dual USB-C interfaces. Both support video input and device charging, allowing for a single-cable connection to drive the display and charge a laptop.",
    "As the dual ports imply, you can connect two laptops and charge them both, though the peak 65W charging capacity will be shared across both devices. The novel aspect is HP’s Device Bridge software. It allows you to use a single keyboard and mouse with both devices (Windows 10, Mac OS and Android 10 devices are supported). Even more unusual, you can drag and drop files from one device to another, on screen, reflecting the benefits of the multi-purpose nature of USB-C.",
    "If there is an obvious omission, it’s audio. The HP S430c lacks any speakers. An optional sound bar is available. But at this price point, it ought to have been included as standard.",
    "If you’re pondering an ultrawide panel like the HP S430c for productivity, the big question is how many app windows it can handle comfortably. The physical size of the S430c’s 43-inch panel suggests it could be as four. However, the relatively low DPI means that three windows, side-by-side, is a more realistic limit.",
    "If you’re wondering how suitable a curved panel is in a productivity context, meanwhile, the S430c’s gentle 1800R curve means that it’s unlikely to offend. There’s just enough curve to prevent the edges of the panel from feeling too oblique, but not so much that windows look distorted. It’s a nice compromise.",
    "As for image quality, it’s adequate but no more. The native color balance doesn’t immediately inspire confidence and the panel lacks overall punch, while the presets in the OSD menu conspicuously exclude common colour spaces such as sRGB, Adobe RGB and DCI-P3. In short, it’s a middling quality VA panel with OK colors, decent contrast and unimpressive pixel response. All of which are probably acceptable given the S430c’s remit.",
    "So, it’s connectivity where this monitor really scores. Plug in two laptops via the USB-C ports and the S430c automatically switches to picture-by-picture mode, with each laptop allocated half of the 43-inch panel.",
    "To access the HP Device Bridge functionality, you’ll need to install software on all connected devices. The installation instructions and procedure are pretty clunky, and the guide to using the software could be an awful lot better. But it’s actually very easy to use once installed.",
    "In short, you can mouse directly across the screen to switch from one device to another and simply select, drag and drop files from one device to another, using the mouse.",
    "What’s more, you can use either a mouse and keyboard plugged into one of the S430c’s USB-A hub ports, or the trackpad and keyboard of either laptop to control both laptops. It’s pretty nifty.",
    "We had no issues running the HP Device Bridge on a pair of Windows laptops, but couldn’t get the full functionality going when pairing a Windows laptop with a Macbook.",
    "The HP S430c is mediocre by some metrics of image quality. The pixel pitch is coarse, the 43-inch curved VA panel of only middling quality for color accuracy and response. It’s not a great prospect for demanding content creation workflows. That could be seen as quite a disappointment given the lofty price tag.",
    "However, when it comes to productivity, this is a very clever display. Apart from the obvious advantages of the large ultrawide panel, the HP S430c has excellent connectivity, Windows Hello support and the nifty HP Device Bridge which makes for a unique twist on the usual KVM switch functionality. It’s not perfect, the HP S430c, but it might just be exactly what you need to improve your productivity."
  ],
  "headers": {
    "4": "Price and availability",
    "8": "Design and features",
    "15": "Performance",
    "23": "Verdict"
  },
  "links": {
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "workstation": "https://www.techradar.com/best/best-workstations",
    "keyboard": "https://www.techradar.com/best/best-business-keyboards",
    "business monitor": "https://www.techradar.com/news/best-business-monitor",
    "Viewsonic VP3881": "https://www.techradar.com/reviews/viewsonic-vp3881-monitor",
    "Philips 499P9H": "https://www.techradar.com/reviews/philips-brilliance-499p9h",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "mouse": "https://www.techradar.com/news/best-wireless-mouse",
    "Windows laptops": "https://www.techradar.com/news/best-windows-laptop",
    "Macbook": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725"
  }
}