{
  "source": "https://www.techradar.com/reviews/skagen-falster-3",
  "title": "Skagen Falster 3 review",
  "category": "wearables",
  "updated": "2020-07-07T15:10:14Z",
  "author": "david-lumb",
  "summary": "The Skagen Falster 3 adds industrial looks to a middling watch",
  "verdict": "The Skagen Falster 3 is a breath of fresh air for smartwatches, but only in terms of looks: its industrial style is unique, but its software and features are very run-of-the-mill. If you like Wear OS watches, the Falster 3 won’t surprise you, but at least it packs enough power and display quality to meet your basic smartwatch needs.",
  "pros": [
    "Unique industrial look",
    "Respectable specs",
    "Useful Wear OS functionality"
  ],
  "cons": [
    "Pricey for its basic features",
    "Side buttons confusing to set up",
    "Overall lack of helpful setup tutorials"
  ],
  "article": [
    "The Skagen Falster 3’s external design hasn’t changed much from its predecessor, as it’s still a classy watch that eschews future-blob curves for a more industrial look. That sets it apart from both other digital wearables and traditional timepieces, and a more modern chipset addresses complaints that the Falster 2 was underpowered.",
    "It’s a small refinement, which characterizes this sequel to an already-stylish wearable. This version also packs a speaker that allows you to answer calls from your watch or hear Google Assistant responses - nice, but not supremely useful.",
    "On the other hand, the Falster 3’s boilerplate version of Wear OS doesn’t pack any surprises or major additional features. Nor does it harness the smartwatch’s multiple buttons well, which makes the whole package feel less cohesively designed than some other smartwatches.",
    "Ergo, it’s best to appreciate the Skagen Falster 3 as an aesthetic piece with smart connectivity rather than an advanced smartwatch. If you’re familiar with Wear OS, so much the better, as there’s no help beyond a fairly minimal tutorial - not even a guide in the box.",
    "These issues aside, the Falster 3 stands out with its burnished metal design and reliable Wear OS functionality. It’s rare we see smartwatches that can be dressed up or down, and with a few band choices, can accompany suits just as well as sweatpants.",
    "The Skagen Falster 3 is available now in select markets for $295 / £279 (around AU$425). It hit stores on January 7, 2020, in the US and Asia, with availability in Europe by the end of that month.",
    "That price makes it just a bit more expensive than the Falster 2, though the handful of additional features earn that bump. It’s no budget watch, though, and you’ll be able to get this functionality in more affordable wearables. You’re paying for the design, through and through.",
    "While not much has changed from its predecessor, the Skagen Falster 3’s physical design is far and away its best achievement. The circular metal body feels sturdy without tipping over into bulky, like the Samsung Galaxy Watch; the pipe-like wristband struts doubtless have a slimming effect on the watch’s look.",
    "It comes in a single 42mm size, which sits between the 44mm and 40mm sizes for most bigger smartwatches; its 11mm thickness is likewise not the most we’ve seen, but it certainly undeniably puts this in the traditionally masculine watch style.",
    "Our model came with a metal wristband (‘Gunmetal Gauge Mesh’) weaved of dense links, a bit like compact chainmail that predictably pinched errant hairs and added weight that took a day or two to get used to. But it contributes to an overall industrial style that grew on us as we grew accustomed to its heft. Just a note - the 22mm straps are easily swapped out, but that’s a larger size than the 20mm wristbands that typically come with smaller (38mm) smartwatches.",
    "The three right-mounted buttons are a bit more for look than function. The center has a crown with respectable resistance - twisting it to scroll felt natural, which is the most pleasant part of navigating around the watch. Pressing it will go back to the watch face, and pressing again will go to the main app menu. If you want to go back, you can swipe backward on the display – a gesture we found by accident, as it’s not introduced in the tutorial.",
    "This is frustrating given the perfectly suitable top and bottom buttons, which can only be mapped to app shortcuts – but being able to go back seems a much more common use case. On the opposite (left) side of the watch is the speaker slot.",
    "On the back of the watch are the heart rate sensor and power ring to clip on to the charger. Like its predecessors, the Falster 3 charges off a direct capacitive connection – no wireless charging here – so make sure you don’t jostle it free from its charge pad. Which happens often given how heavy the watch-and-watchband are. You’ve been warned.",
    "The 1.3-inch OLED display is another strength of the Skagen Falster 3. While the screen is not quite as large as some other smartwatches, especially with its noticeable bezel and thick inner lip, it’s notably crisp and bright.",
    "And yes, it’s a circular display, which isn’t a surprise given the use of Wear OS.",
    "The display sits nested in a noticeable metal ring, which should also serve to protect it from nicks and dings. Such accidents might happen as its flat cross section protrudes a bit more than the curved screens of smartwatches like the Apple Watch 5.",
    "Touch-wise, the display is responsive, and it’s often easier to swipe with a finger through the interface (like sorting through the extensive list of workouts) rather than spinning the crown and accidentally pressing its ‘back’ button.",
    "In keeping with the watch’s designer focus, the fourteen included digital watch faces are stylized to a fault, with several veering into silly (one is just a ring of the phrase “ITS ABOUT TIME” with each letter corresponding to an analog number position from 1 to 12). But they’re nearly all dark faces with light markings, which is apparently a battery-saving feature.",
    "This is a Wear OS watch through and through, and predictably, it’s loaded with Google Fit and its suite of workouts and features. If you liked them anywhere else, you’ll like the Falster 3’s fitness experience.",
    "But again, there’s not a lot of custom integration, which is disappointing. Want to switch from one workout to another? You’ll have to swipe backward and, if the exercise you want isn’t one of your three recent picks, you’ll need to scroll through the Fit Workout app’s entire catalogue in alphabetical order - which is fine for Australian Football, but horrible for Zumba.",
    "There are dozens more workouts, from curling to snowshoeing - and while we didn’t test out the more esoteric activities, the set-and-forget workouts (running, stair climbing machine) were fine, while others that require checking in after every set (strength training) were cumbersome.",
    "Likewise, you’ll have to manually start and stop each workout, unlike other smartwatches that detect motion and both ask if you’ve started an exercise and check in to see if you’ve finished. It’s not a particularly smart fitness experience.",
    "That said, the Falster 3 itself is more than capable of fitting in with your workouts despite its metal body, and we didn’t find it got in the way of any exercises. You’ll certainly notice its heft during your first few sessions, though, especially if you’re using the metal mesh wristband. It’s also water resistant down to 30 meters, so feel free to take it in the shower and do some light swimming, though its 3 ATM max pressure means it’s not great for diving.",
    "The Skagen Falster 3’s heart rate sensor works during workouts and breathing exercises (accessible through the app). You can also have it periodically take readings throughout the day, though that will drain the battery a little faster than normal.",
    "The Falster 3 performs adequately well for its minimal Wear OS functions, thanks to its use of the Snapdragon Wear 3100 chipset - the same as comes on the Samsung Galaxy Watch and the Samsung Galaxy Watch Active 2, a slightly dated processor that still hasn’t been succeeded. Paired with 1GB of RAM and the Falster 3 has the best specs possible for a Wear OS smartwatch.",
    "We barely noticed any slowdown while sorting through the interface, whether using touch controls or the crown to sift through apps. The watch does choke while attempting to hastily scroll through the ‘Tile’ app snapshots - swipe right from the home watch screen for those - though, which is disappointing. Curiously, it doesn’t skip a beat when spinning through the vertical app list, whether by touch or using the crown.",
    "There isn’t much to Wear OS bundled in aside from Google Fit and a few basic clock apps, though plenty more can be downloaded from the Google Play Store. You’ll have plenty of room to download extra software with the 8GB of on-device storage. It’s not nearly as ample as the 32GB on the Apple Watch 5, but it’s more than the 4GB on the Samsung Galaxy Watch Active 2.",
    "You can use the Skagen Falster 3’s NFC capabilities with Google Pay, though it’s unclear if the functionality can be used with any other pay system (like Samsung Pay, for instance).",
    "Thankfully, the Skagen Falster 3 is more generous in its battery options. It has four modes: three for high, medium, and minimal drain, along with a custom one to toggle a dozen different potentially-draining options like Wi-Fi, location, or always-on screen.",
    "The ‘high’ mode, ‘Daily’, keeps everything on, and generally lasts a full day, while the medium (‘Extended’) sacrifices some features to eke out close to two days, Skagen claims. ‘Time Only’ does exactly as it says, turning off connectivity and notifications to allegedly stay on for weeks.",
    "The watch will helpfully prompt you to switch down to a lower mode when it hits certain capacity thresholds to keep the Skagen Falster 3 on longer while preserving some functionality. Overall, it’s easy to keep this smartwatch alive for longer, just as long as you’re willing to manually tinker with battery modes.",
    "As previously stated, the watch’s heft may make charging on the included cord-and-puck a bit more difficult. Its weight in the body and the metal strap can drag it off ledges or shelves if you’re not careful.",
    "First reviewed: July 2020",
    "Fossil Gen 5",
    "In the realm of stylish smartwatches within the typical consumer’s price range, Fossil’s smartwatches have reigned supreme - and for good reason. The Fossil Gen 5 is a bit older, but with a more traditional circular look than the Falster 3’s burnished metal. It packs the same Snapdragon 3100 chipset, water resistance, and speaker as the Skagen model, with a bit more of a traditional smartwatch look - plus, at this point, it’s likely been discounted.",
    "Samsung Galaxy Watch Active 2",
    "The Samsung Galaxy Watch Active 2 is a good alternative to the Falster 3 if you’re looking for a more fleshed-out smartwatch experience. It’s lighter, yet manages a rounded-glass look without appearing too bulbous. Its connected features obviously work a bit better with a Samsung device, but can function with other Android and even iOS phones. Its haptic dial is also a bit more fun to play with than the Falster 3’s physical crown.",
    "Withings Steel HR",
    "Withings is one of the only other mainstream smartwatch makers that opts for style over extra functionality, and the Steel HR is the brand’s most prominent ‘hybrid’ smartwatch. That means the Steel HR relies on analogue watch timekeeping (hour/minute hands and all) with a small digital sub-dial inset in the watch face proper. It merges a traditional timepiece look with connected functionality, which, while much of the latter needs to be seen on a linked phone, manages to stretch its battery life to an entire month. Yep."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Skagen Falster 3 price and release date",
    "7": "Design",
    "13": "Display",
    "18": "Fitness",
    "24": "Performance",
    "28": "Battery",
    "32": "Don’t buy it if...",
    "33": "Competition"
  },
  "links": {
    "Falster 2": "https://www.techradar.com/reviews/skagen-falster-2-review",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
    "Withings Steel HR": "https://www.techradar.com/reviews/withings-steel-hr-review"
  }
}