{
  "source": "https://www.techradar.com/reviews/microsoft-surface-earbuds",
  "title": "Microsoft Surface Earbuds review",
  "category": "audio-visual",
  "updated": "2021-07-15T15:32:02Z",
  "author": "simon-lucas",
  "summary": "Anything Apple can do, Microsoft can do slightly differently",
  "verdict": "You’ll make your own mind up about the ‘distinctive’ looks - but Microsoft’s first stab at some true wireless in-ears has to be considered a success. The sound they make is balanced and enjoyable, and for dedicated Microsoft users they’re approaching ‘no-brainer’ status.",
  "pros": [
    "Eloquent, detailed sound",
    "Comfortable, secure fit",
    "Good app, touch- and voice-control"
  ],
  "cons": [
    "Design is... distinctive",
    "Battery life isn't class-leading",
    "Sound quality could be improved"
  ],
  "article": [
    "Despite having been announced in October of last year, Microsoft’s very first pair of true wireless in-ear headphones - the Surface Earbuds - are only just becoming available. The wait has been long, mind you, but at least in that time Microsoft has had a chance to consider its pricing policy - slashing the Surface Earbuds' sticker price by a chunky $50 off the originally announced $249 MSRP.",
    "In terms of features, the Surface Earbuds cover off most - but not all - of what we’ve come to expect from a premium pair of true wireless earbuds: they have app-based adjustable EQs, aptX Bluetooth connectivity, and responsive touch controls. Plus they play impeccably nicely with virtually the entirety of Microsoft’s hardware and software ranges. They don’t have active noise-cancellation, though, and the way they fit means they let ambient sound leak in.",
    "Sound is served up by relatively large full-range drivers. Of course, ‘relatively large’ could, in another life, be the Surface Earbuds’ official model name: a 25mm diameter is big by in-ear standards, 7.2g is heavy by in-ear standards and their charging case isn't exactly slim, either.",
    "Despite these big numbers, though, the Surface Earbuds prove comfortable and secure in situ, for hours on end. The ‘twist-to-fit’ arrangement keeps them nicely steady, even during mild exercise.",
    "Battery life is an alright 24 hours all-in (8 hours in the Earbuds themselves, plus two more full charges from the case). That's better than some of the Microsoft's competition in this space (Bang & Olufsen, we’re looking at you), but others (Sennheiser, Cambridge, Klipsch) go for quite a lot longer.",
    "Their price brings the Surface Earbuds into direct competition with some very capable alternatives from some big audio brands, but Microsoft's 'buds are a competitive listen. They’re not the last word in excitement, it’s true, but those who crave the finest details and the biggest soundstage will find lots to like here.",
    "Overall, the Surface Earbuds are a very welcome addition to the ever-increasing list of worthwhile true wireless in-ears, and while their distinctive looks won’t be for everyone, they deliver in the only two areas that count: functionality and sound quality.",
    "The Surface Earbuds are available to buy for $199 / £199 / AU$319.95.",
    "That price includes, of course, two Surface Earbuds along with a pretty substantial charging case and three different sizes of silicone ear tips.",
    "If you're keeping track, that price is around 50% higher than the Apple AirPods, 25% more than the Samsung Galaxy Buds Plus and 10% more than the Google Pixel Buds. So, do they live up to this marked price difference?",
    "Just as with Apple’s AirPods, you won’t mistake the Microsoft Surface Earbuds for any other true wireless in-ear design: at 25mm in diameter, the Surface Buds are undeniably big. Everyone and anyone will know what they are when you're wearing them.",
    "The weight (a touch over 7g) is considerable too. But despite their heft, the Surface Earbuds are easy to fit comfortably. They come with a choice of eartips (S/M/L), and position themselves using the Shure-style ‘twist-to-fit’ in-ear monitor action. They don’t form anything like as invasive a seal, though - so while they might initially feel slightly loose, in fact the fit proves secure and stable. The design allows just a hint of ambient sound through, so pausing music is enough to hold a conversation without taking the Earbuds out.",
    "Pausing (and also playing) music is done with a double-tap on the sizable capacitive touch area on the Surface’s sizable, well, surface. Swiping forwards or backwards will skip forwards or backwards, swiping up or down raises or lowers volume. Press and hold to answer or end calls, or to summon voice-assistance. Even Siri.",
    "Call quality and voice recognition is handled by a pair of microphones per Earbud. Sound quality - or, at least, customization of sound quality - is looked after by the Surface Audio app. It’s a tidy and stable app, and the five-band EQ adjustment offers a fair degree of flexibility. In the first instance, though, sound quality is governed by one big 13.6mm full-range driver per Earbud.",
    "A relatively big, relatively bulky true wireless in-ear needs a relatively big, relatively bulky charging case - and sure enough, at 75 x 33 x 25mm and 40g the Surface Earbud’s charging case is imposing. It’s certainly not going to slip into the pocket of your jeans unnoticed.",
    "Every in-ear headphone needs to fit your ear correctly if it’s going to sound as it should, but the Microsoft Surface Earbuds are fussier than most. Take the time to make sure you have the correct eartips in place (and, let’s not forget, each of your ears may be a different size) and the fit reasonably snug, though, and these are capable of being a pretty rewarding listen.",
    "In terms of tonal quality, the Earbuds certainly dig deep into the bass and hit with real purpose. The bass-line throughout Jurassic 5’s Without a Doubt has proper weight and momentum, but it doesn’t drone and it’s controlled enough to stay clear of all the frequency information above it. It’s detailed and textured, and has impressive solidity.",
    "Up in the midrange it’s a similar story, at least as far as information levels go. There’s plenty of vocal detail uncovered during Big Thief’s Shark Smile and as a consequence there’s a stack of character and personality revealed. Like the lower frequencies, midrange stuff is well-controlled - but unlike the lower frequencies, this level of midrange authority can rob music of just a little drive and attack. If there must be trade-offs, though, then this is a sensible compromise to make.",
    "The highest frequencies are similarly detailed and reasonably expressive, with some bite and shine to Anna Meredith’s Inhale Exhale. The really toppy stuff is rolled off just a fraction, though - which, again, is probably a pragmatic choice (and chimes with Microsoft’s decision to limit the Surface Earbuds’ maximum volume to 108dB). As you’d hope from a single driver design, the sweep from the highest frequencies down to the lowest is smooth and seamless, with nothing given undue emphasis. The tonal balance is good, and much more even-handed than some other, similarly priced alternatives can offer.",
    "Dynamically, the Earbuds are quite deep-breathing - despite the volume-limiter, they’re more than capable of dealing with the ‘quiet/LOUD/quiet’ rollercoaster ride of Yeah Yeah Yeahs’ Down Boy. And though their soundstage is plenty big enough to give every instrumental strand plenty of room in which to operate, nothing ever feels estranged. The different elements of a recording are presented as a convincingly unified whole, so despite the slightly ‘safety first’ overall attitude the Surface Earbuds give a good impression of ‘performance’.",
    "Considering how relatively burly both the Surface Earbuds and their charging case are, an all-in total of 24 hours battery life is underwhelming.",
    "The ‘buds themselves carry eight hours, and there’s two more eight-hour sessions stored in the case - that compares favourably with the Apple AirPods’ numbers, true, but it’s made to look pretty pedestrian by the likes of Sennheiser’s Momentum 2 (which are, admittedly, more expensive) and positively mediocre by Cambridge Audio’s much more affordable Melomania 1.",
    "Charging is via USB-C (there’s a cable included in the package), and a ten-minute burst is enough to give you an hour of playback.",
    "Connectivity is very decent. Naturally enough the Surface Earbuds are optimised for use with other Microsoft products - your Windows 10 PC can be paired with one click using Swift Pair, and from there they’re compatible with Microsoft 365, PowerPoint, Word, Outlook...",
    "Bluetooth 4.2 isn’t the most cutting-edge codec around, but here it’s aptX-enabled - which means it’s capable of getting an MQA-powered Tidal Masters or high-res FLAC file on board. Pairing is swift, and proves secure and stable in every reasonable circumstance. And there’s no discernible lag when streaming video content, despite the lack of aptX Low Latency.",
    "You’re a windows user ‘Optimised’ doesn’t really do justice to exactly how compatible with every aspect of Microsoft’s ecosystem the Surface Earbuds are.",
    "You like distinctive design One true wireless in-ear looks very much like another, you say? Microsoft would beg to differ.",
    "You like balanced, natural sound The Surface Earbuds may not be the last word in audio excitement, but they strike a decent balance between fidelity and enthusiasm.",
    "You want epic battery life 24 hours all-in isn’t a terrible battery life by any means. But any number of true wireless in-ear designs will go for longer, and few of them are as bulky as these.",
    "You want to be cocooned from the outside world The fit here is surprisingly stable and comfortable - but it’s not exactly watertight. Ambient sound leaks in, and there’s no active noise-cancelling to deal with it.",
    "You want the best sound quality your money can buy There’s a lot to admire in the sound the Surface Earbuds make - but where drive, attack and straightforward excitement are concerned, you can do better."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "10": "Design and feel",
    "15": "Performance",
    "20": "Battery life and connectivity",
    "25": "Buy them if...",
    "28": "Don't buy them if..."
  },
  "links": {
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "Samsung Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "Google Pixel Buds": "https://www.techradar.com/reviews/google-pixel-buds-2020"
  }
}