{
  "source": "https://www.techradar.com/reviews/vissles-m-portable-touchscreen-monitor",
  "title": "Vissles-M portable touchscreen monitor review",
  "category": "computing",
  "updated": "2020-09-18T10:18:57Z",
  "author": "jamie-carter",
  "summary": "Expand your workstation and make a ‘Zoom zone’ with this thin, light and easy to use USB screen",
  "verdict": "Need more screen real estate? Compatible with PC and Mac laptops, Android phones and gaming consoles galore this easy to use portable monitor impresses for working from home and travel.",
  "pros": [
    "Slim and light design",
    "Plug ’n’ play",
    "Useful as a video calling screen",
    "Dual USB-C ports for power",
    "Magnetic kickstand cover"
  ],
  "cons": [
    "Only 1080p resolution",
    "Uninspiring design",
    "Not compatible with iPhones"
  ],
  "article": [
    "Working from home? Whether you’re struggling to multi-task between spreadsheets, email and browsers, or you need to upsize your phone for watching movies, portable monitors are fast catching-on.",
    "However, to justify their place on a desktop or table a portable monitor has to get one-up on a standard PC monitor. Cue the Vissles-M, a 15.6-inch portable monitor with a touchscreen that’s among the slimmest and lightest available.",
    "Why do you need the best portable monitor? For anyone working from home it’s about expanding your workspace. Maybe you want an additional screen on your desk where you can drag your inbox or calendar, getting it out of the mess of windows open on your PC or Mac’s screen. Or maybe you want a dedicated video conferencing display. However, a portable monitor is also useful if you’re working while you travel. They also attach to Android phones to mirror their contents on a bigger screen, making them useful for working or watching video.",
    "The latter makes them ideal for use in the home for watching movie and for smartphone gaming, while most portable monitors – the Vissles-M included – can be hooked-up to the likes of the Nintendo Switch, PS5 and Xbox One S.",
    "Either way, portable monitors have never been more timely, and this one from Vissles comes to us as one of the lightest and slimmest around.",
    "Despite being in a smaller and lighter form factor, the Vissles-M is priced lower than most of its similarly-sized rivals. It sells for $199/£153.56/AU$272.76, which is nevertheless slightly more than the Asus MB168B+.",
    "However, its cheaper rival is slightly heavier, thicker, and lacks a second USB slot so can't be charged-up separately while it draws power from a laptop or phone. Given its versatility, we think the Vissles-M is good value.",
    "A good portable monitor is about getting more screen real estate without having to buy a full-sized monitor, and the Vissles-M makes a strong argument for that with its slim design.",
    "Weighing just 620g (about half as much as an ultrabook such as the MacBook Air), it measures 223x348mm, and its display has a mere 5.3mm depth. It’s only 55mm longer than a sheet of A4 paper, so it’s easy to slip into a backpack alongside a laptop.",
    "However, as well as having a small footprint on a desk or table, it’s also got a super-slim matte bezel around that 15.6-inch screen. On the tops and sides the bezel measures barely 2.5mm, while on the bottom there’s a larger 22mm bezel. However, the Vissles-M doesn’t look particularly flashy; this is business-like design that’s about productivity and nothing else– there’s not even a logo.",
    "It also comes with a textured kickstand case that doubles as a similarly slim, soft cover that protects the display during transport. Thanks to a magnetic design it also makes possible various built-in prop-up options for different viewing angles.",
    "In the box is a USB-C to USB-C cable, a Mini HDMI to HDMI cable, and a USB-C power cable.",
    "The Vissles-M has plenty of ins and outs all neatly and discreetly positioned low down on both sides of the 1080p display. On one side sit two USB-C slots and a mini HDMI, while on the other are a power switch, menu button for switching inputs, and a 3.5mm audio jack.",
    "There are some limitations; the Vissles-M doesn’t work with iOS, only Mac, PCs and Android devices. There are a few anomalies; the Vissles-M can be used to mirror the screen of an iPad Pro (and, incidentally, the iPad can already be used as a portable monitor). However, it does mean that the Vissles-M can’t be used with iPhones.",
    "Apple Mac users are excluded only from using the Vissles-M’s 10-point touchscreen, which only works with WindowsOS, Android, Chrome OS and Linux OS. The latter needs to support the TV-out function, which effectively means all flagship devices from the last few years (Samsung S8 onwards, Huawei Mate 10 and Pro30 onwards, Honor V20, and OnePlus 7 onwards).",
    "So check before you buy, but workers from home should know that the Vissles-M is fully-featured and plug ’n’ play with WindowsOS, and works great as a secondary screen with Macs.",
    "Despite the confusing array of exactly what feature works with what device, the Vissles-M is actually devilishly simple to use. Its most likeable feature is its easy to use plug ’n’ play nature.",
    "We used the USB-C cable in the box to attach it to the back of a Mac mini, and it immediately came to life as a secondary display. It was then just a case of jumping into the Mac’s settings to arrange exactly where the Vissles-M should be virtually positioned. Within seconds we had made the Vissles-M into an inbox screen that immediately gets rid of that nagging need to constantly check incoming emails.",
    "We then plugged it into a Huawei P40 Pro Plus smartphone, where that brands’ desktop mode quickly creates a PC-like experience with the Vissles-M as the display and the smartphone’s screen as a touchscreen mouse. Add a wireless keyboard and who needs a computer?",
    "At all times the IPS LCD display presents text crisply, with its slightly muted brightness making it comfortable to read. For video, the Vissles-M support 60 frames per second and t’s great for smooth pans and for gaming.",
    "The Vissles-M doesn't have a battery, instead supporting USB power supply. It’s powered purely by the device you connect it to, be that a laptop, PC, Mac, phone or games console. However, unless the master device is attached to the mains the Vissles-M will drain power fairly fast, so consider using this display’s second USB-C slot to connect-up a portable battery. Do that and the Vissles-M will charge the master device, too.",
    "A polished product that makes the virtual world easier to navigate while taking up so little space in the physical world, the thoroughly enjoyable Vissles-M does exactly what it says it will do with no fuss.",
    "Sure, you do need to make sure you know what it can’t do with your particular device before you buy, but if you’re just after a secondary display for a desktop, now that the Vissles-M is perfectly plug ’n’ play. Encased in a super-slim bezel, its full HD 1080p panel impresses and its brace of USB-C and sole mini HDMI creates a ton of versatility.",
    "Add that kickstand cover and this business-like portable monitor at once becomes the ideal secondary screen for a desktop and a great option when you return to travelling for work or play."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "7": "Design",
    "12": "Features",
    "16": "Performance",
    "20": "Battery life",
    "21": "Final verdict"
  },
  "links": {
    "portable monitors are fast catching-on": "https://www.techradar.com/news/getting-a-portable-monitor-was-the-best-move-i-made-all-lockdown",
    "best portable monitor": "https://www.techradar.com/news/best-portable-monitor",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "MacBook Air": "https://www.techradar.com/reviews/macbook-air-2020",
    "iPad can already be used as a portable monitor": "https://www.techradar.com/how-to/how-to-use-sidecar-in-macos-catalina",
    "Huawei P40 Pro Plus": "https://www.techradar.com/reviews/huawei-p40-pro-plus"
  }
}