{
  "source": "https://www.techradar.com/reviews/acer-swift-3-2019",
  "title": "Acer Swift 3 (2019) review",
  "category": "computing",
  "updated": "2020-02-18T22:24:43Z",
  "author": "michelle-rae-uy",
  "summary": "Ultrabook experience for under $1000",
  "verdict": "Finding a great Ultrabook for less than $1000 is a bit of a tall order, which makes the Acer Swift 3 (2019) an even better purchase with its MacBook-esque look, good thermal performance and decent performance.",
  "pros": [
    "Good price for an ultrabook",
    "Very light",
    "Good thermal performance"
  ],
  "cons": [
    "Cramped keyboard",
    "Sound is not very good",
    "Battery life is underwhelming"
  ],
  "article": [
    "If you’re taking price into consideration, the 2019 Acer Swift 3 might just be one of the best Ultrabooks you’ll find out there.",
    "While the 2019 model of this budget laptop has its own fair share of flaws, its portability and performance are more than enough for the price you’re paying. With its MacBook-esque aesthetic, 13-inch chassis and lightweight design, coupled with an 8th-generation Intel Core U-series processor, you’re not only getting a lot of value for your money – you’re also getting more for a lot less.",
    "In fact, our review configuration with an 8th-generation Intel Core i7 processor, 8GB of memory and 512GB SSD is only $899 (about £690, A$1,899). If that’s still out of your price range, the cheapest configuration of the Acer Swift 3 (2019) is $629 (about £485, A$999), making it appealing to budget buyers out there who don’t require as much power. This base configuration, available in US and Australia, touts an 8th-generation Intel Core i3 processor, 8GB of memory and 128GB of storage.",
    "In comparison, the Dell XPS 13 (2019), which has consistently secured a high spot on our list of the best 13-inch laptops, would have set you back $978 (about £755, A$1,450) for a similar processor as well as the same graphics card and storage, but with a measly 4GB of RAM.",
    "On the other hand, a 13-inch MacBook Pro 13-inch with an Intel Core i5 processor, and the same amount of memory and storage will cost you a whopping $1,299 (£1,299, A$1,999). For the same processor, Acer is only asking $749 (about £575, A$1,599) for its budget 13-inch laptop.",
    "Of course, these two contenders boast more premium features and are slightly thinner than the Acer Swift 3 (2019). However, if things like a Touch Bar, incredibly thin bezels, stunning display and a woven glass fiber interior aren’t as important to you, then you can’t go wrong with the Swift 3.",
    "That’s not to say there aren’t a few compromises, though – otherwise it wouldn’t be a budget laptop. The keyboard, for one, feels cramped and the keys are smaller than usual. In addition, the tiny page up/down keys are positioned directly above the equally tiny left/right keys in a way where accidental presses are next to impossible to avoid.",
    "The speakers are also a bit weak: they aren’t very loud and have a boxy sound with almost no low end. And, then there’s the battery, which only manages to get about 7 hours of battery life during our movie test. It scores even less with 4 hours in the more demanding PCMark 8 battery test, which simulates regular productivity usage.",
    "If you’re planning on using the 2019 Acer Swift 3 on-the-go, make sure to carry that charger with you wherever you go, and pack a nice set of cans too. As for that keyboard… well, it’s just something you’ll have to get used to.",
    "To be fair, the Acer Swift 3 (2019) does have a few aces up its sleeves. The keyboard provides some necessary hotkeys, including volume and brightness controls, on/off for wifi and a keyboard backlighting toggle.",
    "The screen has thin bezels around it except at the bottom, which isn’t a big deal. They may not be quite as thin as the Dell XPS, but they are slightly thinner than the MacBook Pro’s. And, the laptop itself is very light at 2.87lb (1.3kg) – lighter than the MacBook Pro 13-inch and only about 0.10lb heavier than the Dell XPS 13-inch.",
    "Thermal performance is also worth mentioning. During our tests, when the Acer Swift 3 (2019) was trying to do some heavy lifting, the laptop stayed relatively cool except at the bottom. You won’t feel the heat emanating from the keyboard, only at the bottom near the back. This means that when trying to push this laptop, you'll only really notice the heat when you’ve got it on your lap. That’s impressive thermal performance considering its size.",
    "Which leads us to actual performance. Productivity-wise, the Acer Swift 3 (2019) performed beautifully for a laptop at its price point. We had up to 15 tabs open at one time during our tests, with three of them streaming video, and there weren’t any issues. We only noticed some loading delay while opening the last tab, but that was minimal and hardly worth mentioning.",
    "In addition, we were also able to load, edit and convert 23 photos in Photoshop easily, as well as Auto Sync edits and batch process the same images in Lightroom Classic without a hitch. This laptop won’t be able to handle video editing properly, but when it comes to photo editing, it should be able to manage – though we do expect it to slow down a little the more photos you edit.",
    "While it isn’t a gaming laptop, we were curious to see how the Acer Swift 3 (2019) handled demanding games so we tested how it fared with a few AAA games.",
    "You should be able to play your favorite PC games on this laptop, as long as you’re not playing at the high settings. Civilization 6, for example, worked very well with graphics set to high, although the game did lock us at 768p. Sekiro: Shadows Die Twice, a AAA game that's a little less graphics-hungry, also ran ok on low settings at 1080p. Unfortunately, as noted in the benchmarks, the Acer wasn't able to run Shadow of the Tomb Raider on the highest settings.",
    "If you’ve been wanting an Ultrabook, but just cannot afford the expensive options out there, then you can’t go wrong with the Acer Swift 3 (2019). This budget laptop may compromise on one or two things, but not where it counts most.",
    "In short, the Acer Swift 3 (2019) delivers great performance for productivity and some creative tasks, as well as casual gaming. As an added bonus, it’s also got a few features that you’ll appreciate. All without burning a hole in your pocket."
  ],
  "headers": {
    "0": "Two-minute review",
    "18": "Don’t buy it if…"
  },
  "links": {
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Dell XPS 13 (2019)": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "best 13-inch laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-13-inch-laptops-which-is-right-for-you-901574",
    "13-inch MacBook Pro 13-inch": "https://www.techradar.com/reviews/macbook-pro-13-inch-2019",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Sekiro: Shadows Die Twice": "https://www.techradar.com/reviews/sekiro-shadows-die-twice"
  }
}