{
  "source": "https://www.techradar.com/reviews/avita-admiror-notebook",
  "title": "Avita Admiror Notebook review",
  "category": "computing",
  "updated": "2020-12-04T10:29:18Z",
  "author": "jess-weatherbed",
  "summary": "A very stunning laptop, but at the expense of battery life",
  "verdict": "The Avita Admiror is one of the most stunning Notebooks available on the market today. Sadly it appears to have traded some brains for its beauty, with a disappointing performance in a few areas",
  "pros": [
    "Uniquely stylish design",
    "Great keyboard",
    "The fingerprint scanner is a nice touch"
  ],
  "cons": [
    "Disappointing battery life",
    "Only 2 USB-C ports",
    "Takes forever to charge"
  ],
  "article": [
    "If laptop reviews were a beauty contest, the Avita Admiror would reduce the other contestants to tears. If you've heard of Avita before, you may know the company for its previous colorful laptop from 2019, the Avita Liber. It seems that Avita is determined to shake things up when it comes to laptop aesthetics, making waves with eye-catching designs.",
    "The bold choice of style and chassis has certainly previously worked in Avita's favor in the past, and its Avita Admiror range comes in a smattering of brushed metallic tones that emulate the fall season. Those good looks certainly help it stand out from its rivals in what is a very crowded market for thin-and-light laptops; but looks alone won’t cut it. Whether or not the Avita Admiror is for you will likely boil down to how much appearance matters to you when choosing a laptop. Performance aside, for UK customers, there are few laptops available for £799 that exude this much style and originality. Its US price tag of $999 makes it a trickier sell, as devices like the MacBook Air (M1 2020) and the HP Spectre x360 frequently match the Avita for price, and can give it a run for its money design-wise.",
    "The biggest drawbacks of the Avita Admiror are its battery life and lack of built-in ports, which makes it a poor choice for those of you who travel a lot or work in unpredictable environments. And that’s a shame, because one of the key selling points of this device is that it’s one you’d be proud to show off in public.",
    "If you're someone who’s already fallen for the allure of the Admiror, rest assured that there’s nothing inherently bad about the laptop. It's a perfectly suited work or study companion for daily tasks, as long as you don’t mind having to reach for the charger fairly regularly. If you’re in the market for something with a little more 'oomph' though, there are plenty of machines on the market that can outperform it, even if they can’t compete in the looks department.",
    "The Avita Admiror retails at $999 / £799 (around AU$1,460), and includes an AMD Ryzen 7 quad-core CPU, 8GB of DDR4 RAM, and integrated Radeon Vega 10 graphics.",
    "The $999 (about £785, AU$1,403) Huawei MateBook 13 ranks as a fairly good competitor in regards to specification and price, while if you're looking for something with a little more RAM you can opt for the HP Envy 13t with 16BG. The Envy is also priced at $999 in the US (it’s more expensive than the Admiror in the UK and Australia at £849 / AU$1,799) and offers slightly better specs, but neither of these laptops can match the physical beauty of the Admiror.",
    "Australian pricing has yet to be confirmed, but we expect it to be positioned similarly in those markets when (or if) it appears there.",
    "The looks department is truly where the Admiror immediately stands out from its competitors. The current laptop market has been awash with matte black plastic or brushed chrome devices for years, so the fiery autumnal shades of the Admiror are a welcome sight for sore eyes.",
    "Our review model, pictured throughout came in the Blazing Brown shade, but you can choose from other warm tones such as Flaming Copper or Delight Pink. While appearance doesn't, of course, have any bearing on how well a laptop performs, we haven't been this excited about a laptop chassis color since the introduction of the Sony Vaio E range in 2010.",
    "The chassis is made from aluminum and magnesium, and is supposedly inspired by gothic architecture. That claim feels like it shouldn't make sense when referencing a mid-ranged notebook, but you really do see it in the design. There's something classy and chic about it, like one of those otherworldly supermodels that do nonsensical things in perfumes adverts.",
    "The keyboard is a sheer delight to use. The keys are wonderfully poppy, with minimal wobble and even travel, though the satisfying tappy noises may bother your colleagues or fellow students. Pressing on the very edge of a key works as effectively as pressing on the center, making for a highly accurate typing experience that took us almost no time to adjust to coming from another laptop. The optional keyboard backlighting is soft and inoffensive, which makes for a pleasant experience when working in low light.",
    "The trackpad is wide, offering plenty of space. It has a nice smoothness to it that allows your finger to glide over it with ease, but it’s not without its issues. We found the sensitivity to be too high out of the box, and no amount of playing with the settings improved how skittish it actually felt to use initially, though we quickly became accustomed to it after a few days of use. The power button is located to the right of the trackpad, and doubles as a fingerprint scanner, which is a nice touch.",
    "The palm rejection on the trackpad is pretty reliable, but its size meant we were constantly grazing it whilst typing, which interfered with the flow of work at times. It also accepts both mechanical clicking, by pushing down on the lower edge, or gestures – that is, tapping and two-finger tapping for left- and right-clicking. If you're well versed in modern trackpads, this is easy to get on board with, but if this will be your first step into notebooks and ultrabooks you might find it to be a tad cumbersome. The Avita Admiror comes with a funky color-matched dongle that allows connections for standard USB-A, HDMI and 3.5mm audio connections as well as another USB-C port and Micro SD slot. This allows for the laptop to be as slim as it is, and provides extra utility when you need something other than the two USB-C ports actually built into the laptop. As adapters go, this is one of the better ones we've used, and it looks great to boot.",
    "If you like to use a mouse with your device, you'll have to connect the adapter. This is fine for anyone using a wireless connection, but if you need to connect a wired mouse you'll end up with a mess of cables and lose the benefits of what’s supposed to be an elegant, portable design. You'll also be taking up the only USB-A port on the device, so if you lose that adapter it's worth remembering the device only comes with two USB-C ports built-in.",
    "The Full HD IPS screen is fairly standard for a machine in this price bracket – it’s perfectly adequate, but nothing that will be knocking any socks off. The Avita Admiror doesn't quite pull off the sexy, slimline bevels that many other laptops are sporting, which means it feels a little outdated when compared to the rest of the design, but that isn't to say they're unsightly or too thick. The webcam is located at the top of the device where the bezel is thickest, and the overall look actually seems to fit with the 'gothic design' aesthetic.",
    "Speaking of the webcam, it’s fairly middle of the road stuff. At 720p the video quality is nothing to shout about, and there do appear to be some saturation issues, but it'll get you through those never-ending work meetings just fine.",
    "The Admiror’s twin speakers are located across the lower hinge and vertically along the keyboard, offering surprisingly good audio quality for a laptop this slim. They sound a little tinny when the volume is cranked up, but unless you're one of those people who blast their audio in public, you'd be using headphones with the device. It's worth remembering that you have to use the attachable dongle if you require a physical audio jack, and you're restricted to using Bluetooth 4.2 for any wireless devices. The lack of Bluetooth 5.0 shouldn't really be a problem unless you want to connect to multiple things at once though.",
    "In our testing the Avita Admiror proved to be a reliable workhorse. It can withstand the sort of intensive use a machine with these specifications is likely to be subjected to, with little issue running Zoom with an embarrassing amount of browser tabs open, even streaming video and Spotify at the same time.",
    "Overall, you can expect consistently smooth performance with few hiccups, but if you like to work in a deskless environment be warned: the slim build of the Notebook means it runs extremely hot when under heavy workloads, something we learned the hard way. What was slightly disappointing was the actual speed that the Admiror could perform these tasks. By using an older AMD Ryzen 7 3700U CPU, the Admiror isn't best equipped to deal with ultra-heavy workloads, but if you're not planning on throwing intensive tasks around then the performance output should suit you fine. The Avita Admiror isn't powerful enough to play games on, and nor should you want to. This machine isn't a gaming laptop and makes no effort to pretend it is, but you'll be able to edit images and video on it just fine. If you're set on a gaming-capable machine for a similar budget then try the Acer Nitro 5. The SSD read and write speeds come in at 435MB/s and 489MB/s respectively, which is tragically slow in comparison to rival products. The HP Envy 13 offers speeds at almost 2000MB/s, which trashes the similarly priced Avita laptop. This essentially means that anything stored or saved on the SSD will take longer to open, but this shouldn't be a deal-breaker for anyone using the Admiror for light personal tasks. All that said, $999 is a lot of money to be spending on a laptop that underperforms like this, so if you're looking for a speedy, powerful machine and don't want a Mac then we would opt for the Honor MagicBook Pro or the HP Spectre 360.",
    "Battery life is, sadly, an area where the Avita Admiror falls down – and spectacularly so. Avita claims that the battery can last up to 10 hours with typical usage, but we only ever got remotely close to that figure by leaving the machine unattended with no tasks – and even sitting idle with nothing to do, the notebook croaked at eight hours and 12 minutes. Flying may not be manageable for many of us right now, but these results aren’t likely to impress frequent long-haul travelers. Unfortunately, there isn't any rapid charging with the Admirror either, so when the power inevitably drains and you're forced to find a wall socket to sit beside and keep working, you'd best get comfortable. If you're going to be using the laptop plugged into the mains then this will be of little concern. A small blessing is that both USB-C ports allow for charging, so the device can be charged at the side of your preference, depending on your environment.",
    "In our looped video test, the Admiror managed to trundle on for six hours and 17 minutes, which does make us wonder if the stunning design of this laptop comes completely at the expense of battery life. Obviously your mileage will vary depending on usage, but six hours is fairly mediocre for a device in this price range and with these specs. In a world where remote working is becoming the new normal, we'd hate to be caught short using the Admirror without access to a plug socket. The battery life results from our PCMark 10 test was downright depressing at just 4 hours and 12 minutes under simulated office conditions. Whilst benchmarking doesn't always reflect real-world conditions, we found the overall results for battery life on the laptop unable to exceed the five-hour mark when putting the machine through various working requirements like meetings, spreadsheets and general web browsing."
  ],
  "headers": {
    "0": "Two minute review",
    "4": "Price and availability",
    "7": "Design",
    "14": "Display and Audio",
    "17": "Performance",
    "19": "Battery Life",
    "21": "Don't buy it if..."
  },
  "links": {
    "Avita Liber": "https://www.techradar.com/reviews/avita-liber-14",
    "MacBook Air (M1 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "HP Spectre x360": "https://www.techradar.com/reviews/hp-spectre-x360-2019-review",
    "Huawei MateBook 13": "https://www.techradar.com/reviews/huawei-matebook-13",
    "HP Envy 13t": "https://www.techradar.com/reviews/hp-envy-13t-2019",
    "Acer Nitro 5": "https://www.techradar.com/reviews/acer-nitro-5",
    "HP Envy 13": "https://www.techradar.com/reviews/hp-envy-13-2020",
    "Honor MagicBook Pro": "https://www.techradar.com/reviews/honor-magicbook-pro-2020-16-inch-laptop",
    "HP Spectre 360": "https://www.techradar.com/reviews/hp-spectre-x360-2019-review"
  }
}