{
  "source": "https://www.techradar.com/reviews/inshot-video-editor",
  "title": "InShot Video Editor review",
  "category": "computing",
  "updated": "2020-10-23T15:39:37Z",
  "author": "steve-paris",
  "summary": "Edit video, adjust images and create photo collages all in one app",
  "verdict": "InShot Video Editor is a nice, simple app which not only allows you to edit video, but also adjust photos and create collages. There’s enough there to enjoy using the app without paying a penny, and also loads of effects you can use should you wish to support the developers with either one-off payments or a subscription.",
  "pros": [
    "Easy to use",
    "Polished interface",
    "Numerous tools at your disposal",
    "Subscription model to be able to use all filters and effects"
  ],
  "cons": [
    "Watermark on exported videos (unless you pay to have it removed)",
    "No ability to zoom and pan across a photo",
    "Cannot save work in Photo and Collage mode",
    "Odd export process"
  ],
  "article": [
    "InShot Video Editor is one of a plethora of video editor mobile apps designed to make it easy for you to edit a short movie and share it with others on social media and elsewhere.",
    "With so many on the market, how does this one fare?",
    "Now although the app is free, you will see ads at the top of the screen while you’re editing, and the finished product will be watermarked with the InShot logo, lower right of the screen. If you’re ok with that, then there’s nothing else for you to do, but if you’d rather work with a cleaner interface and forgo the need for advertising your video editor with each project you create, you can remove both those limitation for $2.99 (£2.99).",
    "InShot also comes with animated stickers, fonts and filters, and many of those are free. Just browse through the store and download the ones you like. Some however come with a fee. Rather than purchase the odd addition here and there, you could choose to subscribe to the service instead. Subscribing gives you access to all additional content, removes ads and watermarks.",
    "You can select to pay $3.99 (£3.49) per month, $14.99 (£11.99) per year, or $34.99 (£33.99) for a one-time purchase. The latter feels a little steep for a mobile app, but at least you have options, including not paying anything at all.",
    "The whole interface only works in portrait mode, and InShot allows you to create video projects, work on a single photo, or create collages. We’ll look at each in turn.",
    "You start by choosing the footage you’d like to use in your project from your Camera Roll. You can select multiple clips in one go, but have no editing capabilities here - that comes later. You can add photos in your video project too, should you like.",
    "Once imported, it’s time to get to work.",
    "All the tools are easily within reach in a strip just above the timeline. If you can’t see the one you need, try scrolling left and right. All the usual ones you’d expect are present and correct: you can trim footage, split it, delete unwanted sections, alter the volume of each clip, duplicate some, rotate or flip others, create freeze frames, speed up a clip, play it in reverse, or move selected clips around. For a small mobile app, it’s got everything you’d expect.",
    "And yet there’s more: you can apply filters, or effects (those that aren’t free can be previewed, but you won’t be able to use them in your project until you pay the piper). You also have full control over visual adjustments, such as Contrast, Tint, Saturation, Shadows, Sharpen, it’s a pretty comprehensive set of tools.",
    "It’s also possible to add transitions between clips. Only a handful are free, but the rest, just like the effects, are free to preview.",
    "Should you be looking for something a little different, you could try using animated stickers which you can place anywhere on your canvas, and the same applies for text boxes. We were quite impressed by the amount of available options. Take those text boxes for instance. You can change the font, colour, position, and even choose different animations to make them appear on the screen and disappear off it - all within easy reach of your thumbs.",
    "When it comes to audio, you have a long list of sound effects you can add anywhere in your project. You also have access to numerous tracks which you can download and use. Some are free, others request a donation.",
    "By default, your canvas is set to 1:1, but you can alter that at any time with a choice of 11 others. Your footage can be set to fill the screen (ie, its edges will be cropped depending on the overall format) or to see the whole clip with any gaps in the canvas filled either with a blurred out version of the footage, coloured background or a gradient.",
    "Once your creation is complete, you’re able to either save it to your device’s Camera Roll, share it via email (if it’s not too big), or directly to various social media platforms such as Instagram, Whatsapp, YouTube, Messenger, Facebook (inc Facebook Stories), and Tangi.",
    "All in all, this is a very complete list of tools, which makes the whole editing process quite easy. The one thing we couldn’t find was the ability to pan and zoom across an image over time.",
    "InShot Video Editor can also be used to prepare photos for sharing online. You won’t have access to any of the video editing tools, but you’ll be able to crop the photo so it fits a specific canvas, apply a filter or effect, adjust its parameters, add a sticker or some text, rotate or crop your image. Pretty much everything you can do with video, you can do with that one image.",
    "There’s also a ‘Retouch’ option, but this is actually a promotion for another free app called ‘Peachy’ from within which you’d be able to perform retouch alterations on your image.",
    "Working with multiple photos doesn’t collate all your selected images into some kind of animated video project. No, when you’re ready to share them, they’ll be saved as individual files.",
    "Also, unlike Video projects which you can save as Drafts, you can’t save your work for later: you need to finish your modifications in a single session. If you haven’t finished, yet would like to go back to your video project, the only option open to you is to discard all the alterations you’ve done. This is a weird constraint which greatly limits the potential of this part of the app.",
    "And finally, we have Collage.",
    "You start by selecting between one and nine images from your Camera Roll. You have eight presets which you can choose from. Reordering photos is a simple matter of a long press and drag. Zooming in and out, and altering the crop is done using the usual multi-touch techniques.",
    "You even have the ability to add a border outside the collage, place one between all the photos, and even choose how rounded you’d like those borders to be. You’re stuck with white for the border though.",
    "Frustratingly, the same limitation applies with Collage as it did with Photo: you need to complete your work in one session.",
    "On the plus side, neither Collage nor Photo have a watermark added to the completed image when you’re working with the free version of the app.",
    "There is one limitation that is worth mentioning: exporting your work will, as you might expect, take some time, depending on the complexity and length of your project. However, while the app is busy exporting your project, you are advised to not switch the screen off nor go to another app.",
    "If you attempt to do either, and go back to InShot, you’ll be given a ‘Processing interrupted’ warning, and you’ll have to start the export again.",
    "This is a very weird constraint which feels out of place in a modern app.",
    "InShot Video Editor is actually a pretty good app. It’s pleasant to use, and the interface is well suited to let you edit simple videos, or edit images.",
    "A lot of features are offered for free, and you have a choice of one-off purchases or subscriptions should you wish to use this app on a regular basis.",
    "We do miss the ability to pan and zoom across an image, and are puzzled by its antiquated export procedure, but aside from that, it’s definitely worth a look if you’re in the market for a new video editing tool."
  ],
  "headers": {
    "2": "Prices and options",
    "5": "Getting started",
    "6": "Video",
    "16": "Photos",
    "20": "Collage",
    "25": "Exporting limitation",
    "28": "Final verdict"
  },
  "links": {
    "InShot Video Editor": "http://www.inshot.com/",
    "video editor": "https://www.techradar.com/best/free-video-editing-software"
  }
}