{
  "source": "https://www.techradar.com/reviews/amazfit-zepp-e",
  "title": "Zepp E review",
  "category": "wearables",
  "updated": "2020-10-12T13:54:06Z",
  "author": "tom-bedford",
  "summary": "Mostly great, but with some smaller issues",
  "verdict": "The first smartwatch under the Zepp branding is a big success - it looks great, lasts a long time between charges, and has plenty of lifestyle and fitness features that make it useful for lots of users. There are a few minor annoyances we’ve got with the device, and its price might put off a few potential buyers, but it’s certainly worth considering if you’re in the market for a new smartwatch.",
  "pros": [
    "Appealing design",
    "Long-lasting battery",
    "Diverse and in-depth fitness modes"
  ],
  "cons": [
    "Could be cheaper",
    "No night modes",
    "Notifications have limited usefulness"
  ],
  "article": [
    "You might not know the name ‘Zepp’, as the Zepp E is the first smartwatch with the branding, but you might recognize ‘Amazfit’, which the company was called before it rebranded. Amazfit was a popular maker of affordable and commendable smartwatches and fitness trackers, and its rebranding came alongside a push into a more mid-range and high-end market.",
    "Well, Amazfit still is a popular maker of smartwatches, and since the Zepp E launched, the company has put out more products under 'Amazfit' - we don't really understand what's happening, just that 'Zepp' is another name we can expect the company's watches from.",
    "So the Zepp E is a fairly mid-priced smartwatch, for people who don’t want the cheapest wearable available but don’t want to stretch to a truly premium wrist-mounted life companion, and it’s pretty great for what it is.",
    "The Zepp E looks fantastic - it has a subtle two-tone design (at least, the model we tested did), an understated body, and a very minimalist feel that makes it blend into your outfit. It’s lightweight too, enough for you to forget you’re wearing it, which is perfect for exercising or sleeping.",
    "We found the Zepp E great for exercising as it provides detailed feedback from activities, which helps you get insight into your fitness. It also shows you a little map of your workout if you go for a run or a walk, which is interesting if not necessarily game-changing.",
    "There are a few other health features here too - sleep tracking is included for example, and is detailed enough to chart the distinction in your different types of sleep and give feedback on how you can improve your napping.",
    "There’s also automatic heart rate charting and built-in Personal Activity Intelligence (PAI) tracking, which takes a bit of research to understand but can be useful once you do.",
    "In fact, most of the issues we had with the Zepp E smartwatch were just minor gripes that not everyone will care about. There’s only one band included in the box, leather or fluoroelastomer depending on which you opt for, and we’d have liked multiple so you can switch between them based on whether you're working out or using the watch normally.",
    "In addition the software is perhaps a little barebones, as there’s no dedicated night mode, so to avoid blinding yourself at night you have to fiddle with quite a few different modes to stop the watch auto-waking when you twitch, and the music handling was also tricky to get working.",
    "It’s worth pointing out that there are two versions of the Zepp E, one is circular and another is square, and we tested the former for this review. We’ll point out where the devices are different when it’s relevant.",
    "This smartwatch is a great first showing for Zepp, and we’re looking forward to where the brand can go from here.",
    "The Zepp E costs $249.99 / £209 (roughly AU$370). The smartwatch hasn’t been announced for Australia, but some Amazfit devices reached there, so it’s possible the Zepp E will too.",
    "At that price it’s definitely not the cheapest smartwatch worth considering, but it’s more affordable than the likes of the Apple Watch 6 or Samsung Galaxy Watch 3 which start at $399 / £379 / AU$599 and $399 / £399 / AU$649 respectively.",
    "The square and circle versions of the Zepp E both cost the same; likewise, you won’t pay more for the leather or fluoroelastomer versions, or any of the various color options that you can get for each type of strap (the straps come in different colors, but the body seems to always be the same).",
    "You can pick up the Zepp-E from the Zepp website, where you can also buy bands for the watch in a range of colors.",
    "The circular Zepp E has a 1.28-inch screen with a 416 x 416 resolution, while the square model has a 1.65-inch 348 x 442 screen. Both versions of the smartwatch have AMOLED screens, which looks bright and punchy - you can choose custom photos for the watch face if you want, and the screen did justice to the snaps we used for this.",
    "The Zepp E consists of the main body and a replaceable strap. The version we tested only came with a leather strap, which wasn’t ideal for exercising, and won’t be great for people who want cruelty-free watch straps, but you can also buy the watch with a fluoroelastomer band if you want.",
    "For what it’s worth, the band felt quite comfortable on the wrist, though the leather felt a bit weak - it started to show permanent creases the more we used it.",
    "Fluoroelastomer is grippy and breathable so it’s good for exercising, but it doesn't look as classy as leather. We would have liked to see the watch come with both type of bands, as many other smartwatches do, so you can switch between them easily. It’s possible Zepp will sell spare bands on its website though, and these are standard 20mm straps, so you can buy replacements elsewhere.",
    "The stainless steel body itself looks pretty minimalist. It has no physical bezel on the front, a display that curves slightly at the edges into the body, and a single button that doesn’t stick out too much from the side (though this makes it a touch hard to press). On the back there’s a heart rate monitor and charging pin.",
    "The circular Zepp E weighs 32g (without a strap), and the square one is 36g - the smartwatch is very lightweight, and we frequently forgot it was even on our wrist since it weighed so little. The watch is 9.1mm thick (or just 9mm if you opt for the square model) so it doesn’t stick out from the wrist too much, though there are thinner watches around.",
    "The watch body is silver and black - there are a wide range of colors available depending on which shape body you opt for, but this only affects the shade of the strap, not the body itself. We tested a version with a black leather band, and found the resulting two-tone design very attractive.",
    "The Zepp E is waterproof to 5ATM, which is pretty vital given there’s a swim-tracking mode, but if you want to use this you can't really buy a version with a leather strap, as leather shouldn’t get wet.",
    "The Zepp E runs on Zepp's (formerly Amazfit’s) wearable software. It has a small range of lifestyle features, though it’s lacking in a few areas and doesn’t support third-party apps.",
    "You can choose between a wide range of watch faces - the majority can be accessed from the tie-in Zepp app on your phone, but once you’ve chosen them on there you can easily switch between ones you’ve used on the watch itself. The options include custom faces, so you can choose your own photos.",
    "We found the Zepp E’s interface felt smooth and easy to navigate, whether that’s swiping through menus or viewing your various health charts.",
    "Notification handling is present here, though you can’t respond to messages, and if you have multiple notifications from the same app they get bunched together so you can’t see any of them. There’s also music controls - for our first week with the Zepp E these didn’t work, but after a while it started recognizing when Spotify was playing on our phone so we could skip tracks.",
    "There are some other useful features too. The Weather app gives you plenty of information for the day and the week ahead, and even tells you how high the sun is in the sky, letting you plan your day. There’s a compass, a timer, alarms, and a few other handy tools like these.",
    "Health and fitness is clearly the most important part of the Zepp E though - from the watch face you can swipe to the side to access your fitness circles (similar to on Apple Watches), your heart rate, and your PAI, while you have to press the physical button and access the app menu to find most other features.",
    "The Zepp E's sleep tracking is fairly useful - it’s not quite at Fitbit levels of depth, but it’s close. After a night of sleep you get a sleep score and a breakdown of the different types of sleep (deep, light, REM), a sleep breathing quality score, comparisons of the night compared to previous nights, and advice on how to improve your sleep.",
    "The advice could perhaps be a little better - it repeatedly told us to go to bed before 10pm, and frequently chastised us for not getting enough deep sleep, without giving any good advice on how for the latter, and not taking into account different schedules for the former. Also, once or twice the app decided we woke up way earlier than we actually did, which made the sleep stats inaccurate.",
    "We found sleeping with the Zepp E a little annoying for one big reason - there’s no actual night mode, so if you’ve got raise-to-wake enabled (which it is by default), every time you move in the night the watch will light up, blinding you and ruining your slumber.",
    "We got around this by turning screen brightness off automatic mode and bringing it all the way down, turning on theatre mode, and also turning on do-not-disturb mode, but that took quite a bit of fiddling and we’d like one easy button to press to deactivate the watch for the night.",
    "As mentioned, there’s a tie-in app for the Zepp E, and this gives you a longer list of settings to tweak and lets you view more historic data than you can on the watch itself. The app is also used in setting up the watch. We never felt the app experience was vital for using the smartwatch though, it was just a useful extra.",
    "There are eleven sports modes on the Zepp E, including ‘Free Training’ which you’d probably use if you’re doing an exercise that isn’t one of the other ten. These range from the expected, like outdoor running, to a few more niche ones, like skiing and trail running.",
    "The watch returns a few different useful metrics depending on the workout, including time, pace, calories burnt, average heart rate, cadence, stride, steps, and more, and there are graphs of most of the above available through the app too.",
    "None of the information will blow you away if you’re used to dedicated running watches, but if you’re only used to ‘standard’ smartwatches you’ll find the results fairly impressive.",
    "The watch even shows you a map of where you’ve been - this isn’t hugely useful when viewed after a workout, but on the app you can see this laid over Google Maps. It uses connected GPS from your phone, so you’ll need to bring your handset on a run to get this data.",
    "We found the information returned in workouts fairly accurate when compared to other wearables - we’ve seen some users on the web complain about inaccurate results, in particular distances that are below what was expected, but we didn’t find this issue ourselves (although that would likely be more an issue with the phone than the watch, due to the nature of connected GPS).",
    "There are a few fitness features outside specific workouts. For one thing there’s the aforementioned automatic PAI tracking, which basically boils everything you do in a day down to a single metric so you know how active you’ve been over the course of the day.",
    "PAI tracking is useful for people who aren’t naturally fitness-minded, but it’s not explained very well on the Zepp E, so to make the most of it we had to visit the PAI Health website to understand better.",
    "There’s also a built-in heart rate monitor on the smartwatch - it didn’t always exactly concur with what other devices told us during idle time and exercise, but it was never far enough away that we had cause to doubt it too much.",
    "There’s Sp02 tracking as well, to check your blood oxygen, which we’ve seen in a few smartwatches now. It’s a fairly niche feature but useful for some people.",
    "Finally, there are activity rings, similar to in the Apple Watch, so you can see if you’ve hit your step, active time and standing goals.",
    "The officially-stated Zepp E battery life is seven days - we found the smartwatch didn’t quite last this long, but that it didn’t fall too far short either.",
    "When we used the watch normally, it lasted five and a half days before needing to be recharged - not quite the seven days, but still admirable compared to the many smartwatches that only last around a day. The average drop was about 20% for every day, and that’s including sleep tracking at night, though when we took the watch for a long workout it drained more power.",
    "The Zepp E's battery life drop was considerable when we turned on the always-on display, though, as it only lasted just over three full days with this turned on. Since raise-to-wake is turned on by default in this watch, we don’t think you’d need the always-on display anyway.",
    "There’s also a battery-saving mode which takes the ‘smart’ from ‘smartwatch’, and turns the Zepp E into a regular old timepiece. Apparently this mode keeps the watch ticking for 15 days, and though we didn’t test it for this full amount of time, our partial testing seems to back that statement up.",
    "To charge the Zepp E back up, you’ll be using the charging cable that comes with the thing. It attaches to the watch magnetically, and takes about an hour and a half to power it to 100% - the official figure is two hours, but we didn’t find this to be the case.",
    "First reviewed: October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Zepp E release date and price",
    "15": "Design and display",
    "23": "Performance and software",
    "34": "Fitness",
    "44": "Battery life",
    "49": "Don't buy it if..."
  },
  "links": {
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Zepp website": "https://us.zepp.com/products/zepp-e-circle",
    "PAI Health": "https://www.paihealth.com/discover-pai.htm"
  }
}