{
  "source": "https://www.techradar.com/reviews/tbao-tbook-x9-laptop",
  "title": "Tbao Tbook X9 laptop review",
  "category": "computing",
  "updated": "2020-08-04T09:31:15Z",
  "author": "desire-athow",
  "summary": "Another Apple MacBook Air clone",
  "verdict": "The Tbao Tbook X9 laptop is good but not good enough to fend off the competition. Heated competition at this price point means that there are a lot of candidates that offer the same for less or offer far more for the same outlay, often with the same tired design.",
  "pros": [
    "Very well built",
    "Good performance",
    "Four USB ports",
    "Keyboard is well laid out"
  ],
  "cons": [
    "Expensive compared to the competition",
    "Screen frame quality",
    "128GB is just too small",
    "Average battery life"
  ],
  "article": [
    "We’ve only encountered Tbao once in the past at TechRadar and that was for a retropunk laptop with a vintage keyboard inherited from mechanical typewriters. The Tbook X9 which landed on our desk however is a bit less outlandish, a bit more traditional. A 15.6-inch display and an attractive price point are what caught our attention.",
    "The X9 is heavily influenced by the bigger Apple MacBook from a few generations ago. The lines are similar, the material and the touchpad are reminiscent of Apple’s best seller premium laptop and for the better part of a decade, many smaller laptop vendors have tried to jump on that bandwagon to increase their market share. There might also be the fact that retooling existing laptop manufacturing lines is cheaper and faster than getting something up from the ground.",
    "One thing you will not miss noticing is how thin it is; at 360 x 235 x 13.7mm for a weight of 1.6Kg, the X9 is surprisingly compact, matching the Dell XPS 15, our Editor’s choice for best laptop. The category champion is the LG Gram 15 with its 1.11Kg weight and its 18 hours battery life.",
    "There’s also three USB 3.0 ports, a headphone jack, a microSD card slot, a proprietary power port, two speakers, a Type-C connector and a full size HDMI port. A flap that hides the SSD can be found underneath. The keyboard is generously laid out as the designers opted for a wide keyboard that almost goes from edge to edge.",
    "Inside the Tbao Tbook X9 is a combination of hardware that is becoming increasingly common at the entry level of the market. A combination of Intel Celeron J4115 processor with 8GB of low power DDR4 memory and a SSD (in this case, a 128GB removable model) is a big step in the right direction.",
    "Despite being a Celeron, the J4115 is probably about as fast as an Intel Core i5-5200U, with a boost from DDR4 memory and SSD (rather than the inferior eMMC memory). The rest of the hardware include an Intel Wireless-AC 3165 chipset with a VGA camera and a 37WHr battery.",
    "The 15.6-inch full HD display is an IPS model with rather thin bezels (and a near 90% screen to body ratio). However, unlike most of its rivals, it does a shoddy job of gluing the frame to the display panel. Its semi-matte finish might put some users off but once you've got your viewing position sorted out, you'll be rewarded in an exceedingly sharp, clear display that does the job for viewing photos and video.",
    "A word on the power supply unit; it is a 12V, 3A (36W) model which is far smaller than what we usually get.",
    "The performance of the J4115 is on par with the other products based on that chip. Its four cores, four threads and 4MB cache are capable enough to handle most tasks and thanks to a faster base clock speed (which also means higher TDP) and thanks to the M2 SATA SSD, the storage performance is significantly better than any eMMC storage subsystem we’ve encountered to date.",
    "Tbao states that the battery lasts up to five hours, depending on usage. We think that nearer to four hours is a more realistic figure, which is about average. The laptop's larger footprint also results in a quieter system as the entire chassis acts as a metal heatsink; indeed, the system is silent when not under load. Just as importantly, it runs fairly coolly, too.",
    "The backlit keyboard was fairly standard with good feedback and above average travel while the touchpad measures a massive 15.6-cm diagonally, offering ample real estate for your input needs. Oh and don’t forget that there’s also a full size numeric keypad.",
    "If you’re reading this review thinking, is the X9 the right one for me, then maybe consider these other 15-inch, thin-and-light laptops with 8GB of RAM, a full HD display and a dedicated numeric keypad. Bear in mind that it costs $279 with the code BG01Tbook.",
    "First in line is the KUU A9S ($299 at Newegg). It uses the slightly slower Intel Celeron J3455 CPU and whilst it has fewer ports, it does include an Ethernet one; useful when you don’t have any Wi-Fi. The rest of the specification is remarkably similar (battery capacity, storage and system memory). There’s also the not-so-insignificant advantage that it is available from a US-retailer.",
    "We reviewed the Teclast F15 notebook earlier this year. At $370 at Banggood, It will appeal to those who want a laptop with a premium design with a decent performance and excellent battery life thanks to its bigger battery. The N4100 is also competitive with the J4115 and 256GB storage is twice that of the X9. Just be aware that the port placement is not ideal.",
    "If you are not fussed with driving to a nearby Office Depot store, then you can pick up the Asus VivoBook 15 notebook which has a tiny bezel, costs only $370 and comes with an AMD Ryzen 3 3200U CPU, a processor that’s about 70% more powerful than the J4115, with a far more superior GPU as well. The X9 hardly has any chance against this one.",
    "As it is often the case, the Tbook X19 is not intrinsically a bad product, in that there’s nothing fundamentally wrong about it. However, the market has become extremely competitive at the very low end of the market with the appearance of a plethora of AMD-powered, Ryzen-based laptops.",
    "Above $300, AMD seems to have the upper hand for every single market segment when it comes to sheer performance/value for money. AMD has yet to launch an entry level processor range that focuses on the very bottom of the market which, some might say, is the least of its priorities.",
    "So, no, the Asus VivoBook 15 and a few others stand between the Tbook X9 and your credit card. There’s hardly any reason why you should choose it ahead of others unless you like larger-than-average touchpad and more ports than most laptops.",
    "(ed: Shortly after the review was published, Banggood informed us that the price of the TBook X9 would be discounted by more than $100. This changes everything and we've bumped the score by another 1/2 point.)"
  ],
  "headers": {
    "1": "Design",
    "4": "Hardware",
    "8": "In use and performance",
    "11": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "retropunk laptop": "https://www.techradar.com/news/this-cheap-laptop-has-a-retro-keyboard-that-will-split-opinions",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "LG Gram 15": "https://www.techradar.com/reviews/lg-gram-15-2018",
    "$299 at Newegg": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-1171872101275813000&murl=https%3A%2F%2Fwww.newegg.com%2Fsilver-kuu-u-series-u2-workstation%2Fp%2F1TS-00BK-00021",
    "Teclast F15 notebook": "https://www.techradar.com/reviews/teclast-f15-laptop",
    "$370 at Banggood": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-2003009273033412000&ulp=https%3A%2F%2Fwww.banggood.com%2FTbook-X9-15_6-inch-Intel-J4115-1_8GHz-8GB-GB-128GB-SSD-89_5-pencent-Ratio-5mm-Narrow-Bezel-Backlit-Notebook-p-1677906.html%3Frmmds%3Dsearch%26cur_warehouse%3DCN",
    "only $370": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8978975147896185000/https://www.officedepot.com/a/products/9304611/ASUS-VivoBook-15-F512DA-DB34-Laptop/"
  }
}