{
  "source": "https://www.techradar.com/reviews/lenovo-ideapad-flex-5",
  "title": "Lenovo IdeaPad Flex 5 review",
  "category": "computing",
  "updated": "2020-10-09T10:47:28Z",
  "author": "jeremy-laird",
  "summary": "2-in-1 convertible versatility at a price you can afford",
  "verdict": "Lenovo’s latest 2-in-1 convertible laptop is hugely versatile and has good battery life, but it’s a little short on memory.",
  "pros": [
    "Great 2-in-1 feature set",
    "Strong battery life",
    "USB-C charging support"
  ],
  "cons": [
    "Screen is a bit dim",
    "Only 4GB RAM",
    "Portability is marginal"
  ],
  "article": [
    "Lenovo’s ‘Flex’ series of laptops are affordable 2-in-1 convertible systems that offer claimed all-day battery life. That’s a simple and appealing proposition.",
    "In practice, it’s all a bit more complicated. You see, the Lenovo IdeaPad Flex 5, to give it its full name, is available in both 14-inch and 15-inch variants and with both AMD and Intel CPUs. And with various iterations of those CPUs.",
    "It’s all a bit baffling if you’re buying, but the specific model showcased here is the 15-inch Lenovo IdeaPad Flex 5 powered by Intel’s latest 10th Gen processors, in this case an Intel Core i3-1005G1 chip.",
    "Arguably, AMD’s laptop CPUs offer both better value and more performance right now. But given the Lenovo IdeaPad Flex 5 remains pretty keenly priced and isn’t being pitched primarily on performance, that needn’t be an automatic deal-breaker.",
    "Indeed, this laptop offers a very compelling all-round proposition. Along with that Intel CPU, the highlights kick off with a 15.6-inch touchscreen. It offers a FullHD 1,920 by 1,080 pixel resolution and IPS panel technology. As a ‘Flex’ model, that screen is hooked up to the IdeaPad’s chassis via a full 360-degree hinge and thus supports operation in full Tablet mode. Next up is a 128GB SSD. OK, that’s not a huge amount of storage, but it is a M.2 drive supporting the latest NVMe control protocol.",
    "Other details include a decent 65 watt charger and claimed battery life of over 10 hours. That you get all this in an attractive chassis with a high quality feel from one of the biggest brands in the business for around $500 / £500 is impressive. But inevitably, it’s not the whole story.",
    "At this price point something inevitably has to give and as reviewed the most obvious weakness is the meagre 4GB of RAM. It doesn’t have a huge impact on your benchmark numbers. But if you're partial, say, to running loads of browser tabs while you edit images - or some other typical multitasking scenario - you’ll quickly run out of system memory with only 4GB at your disposal, especially as some of that is pinched by the integrated graphics.",
    "That’s a pity because in most other regards, this is a pretty nice portable. It’s good for that 10 hours-plus of claimed battery life, for instance. And the screen is accurate and pleasant to use, if a little dim. The keyboard is firm, crisp and pleasant to use and it mostly looks like a much more expensive laptop than it really is.",
    "Yes, there are a few tell tales of corning curing beyond the 4GB of RAM. The trackpad is a little small for this class of portable. The sound quality from the integrated speakers is fairly poor. The supplied charger is a barrel type rather than USB-C despite the fact that the Flex 5 has a USB-C port that supports charging (further connectivity includes two USB-A ports, HDMI and a full-size SD card reader). That’s sort of both a plus and a minus, but you get the broader point. This is a nice machine for the money.",
    "At around $500 (£499, AU$1,239), Lenovo is going for pretty punchy positioning for the IdeaPad Flex 5. You’ll struggle to find a similar laptop for less money.",
    "The HP Pavilion x360, for instance, costs around 15% more, but only offers a 14-inch panel, albeit aided by 8GB of RAM. Indeed, it’s the Flex 5’s 4GB of memory in this entry-level configuration that is our main reservation.",
    "The other snag is that if you’re willing to forgo the tablet convertible functionality, you can have a 15-inch laptop at around this price point with almost no serious compromises, such as the Asus VivoBook.",
    "Entry-level systems from the bigger brands have stepped up their game in design and quality terms in recent years and the Lenovo IdeaPad Flex 5 is no exception. Granted, it’s not going to put the frighteners on an Apple MacBook Pro for sheer material class. But it absolutely, positively doesn’t look or feel cheap.",
    "The 15.6-inch 1080p touch-enabled display, for instance, sports IPS panel technology and is housed in a high-quality metal enclosure with slim side bezels and a shuttered 720p webcam up top.",
    "OK, the main chassis is plastic. But it feels rigid and has an unusual and not at all unpleasant textured finish. The 360-degree hinge feels robust and the keyboard is stable and firm with only traces of flex and bounce.",
    "Ports wise, Lenovo likewise has you well covered. On the left side of the chassis, you’ll find a full-sized HDMI socket, a barrel-type power connector, headphone jack and a USB-C port. The latter supports charging the laptop itself, mitigating the slight disappointment of the barrel connector. While we’d prefer the Flex 5 came bundled with a USB-C charger, support for USB-C charging at least means you can carry a single charger to keep multiple devices juiced up.",
    "On the right, a pair of USB-A ports and situated next to a 4-in-1 card reader that supports full sized SD cards, plus MMC, SDHC and SDXC cards. That’s one less plug-in adapter you’ll need to carry, in other words. Other features worthy of mention are the 720p webcam located on the top bezel and complete with a physical shutter and support for an optional digital input pen.",
    "It’s also worth noting that the Flex 5 ships as standard configured with Windows 10 Home in S Mode. The sales pitch for S Mode is that it boosts performance and improves security. The latter is almost certainly true given it only allows software from the Microsoft app store to be installed. The downside, of course, is that it only allows software from the app store to be installed, excluding the vast majority of the huge ecosystem of Windows compatible apps and software that’s accrued over the years. That includes no Adobe software, no Apple apps, no non-Microsoft video conferencing apps, none of those handy little legacy apps.",
    "S Mode is also streamlined to reduce CPU and memory usage, the latter being especially relevant for a laptop with just 4GB. Long story short, S Mode can make a lot of sense for schools and businesses, but is probably too restrictive for more general home and business users. However, it is the work of around five minutes to turn S Mode off via the Microsoft Store, so it shouldn’t be an impediment to anyone considering this system.",
    "As a content consumption device, the Lenovo IdeaPad Flex 5 usually gets the job done. The combination of the dual-core Intel Core i3-1005G1 chip, 128GB M.2 SSD and 4GB of RAM delivers a responsive experience within certain confines. With a few tabs open in a browser and editing a text document, for instance, all is well.",
    "Up the tab count and run some image editing in parallel, however, and you can run out of memory and into relative trouble. Of course, having a modern M.2 SSD helps enormously when that happens and files are being swapped to main storage. But we’d still prefer to have 8GB in this class of device.",
    "By other metrics, performance is about as mixed as you might expect given the market positioning. The 15.6-inch 1080p IPS display has good colours and viewing angles, but lacks brightness. The dual 2 watt Dolby-powered speakers, meanwhile, deliver weak, thin audio lacking in much by way of dynamic range. And for the record, don’t expect to go gaming with the entry-level Intel integrated graphics.",
    "At this price point, battery life can often fall victim of cost cutting. Happily, the Flex 5 is configured with a fairly hefty 52.5Wh battery.",
    "That translates into nearly 12 hours of video playback and nearly 10 hours in the more demanding PCMark battery test. That’s enough for all-day operation at school or the office or plenty of movies on a long-haul flight. Support for charging via USB-C also makes it easy to ‘borrow’ some power should you find yourself running low."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Price and availability",
    "12": "Design and features",
    "19": "Performance",
    "22": "Battery life",
    "24": "Don't buy it if..."
  },
  "links": {
    "HP Pavilion x360": "https://www.techradar.com/reviews/pc-mac/tablets/hp-pavilion-x360-1227685/review",
    "Asus VivoBook": "https://www.techradar.com/reviews/asus-vivobook-s14-s433"
  }
}