{
  "source": "https://www.techradar.com/reviews/doteasy",
  "title": "Doteasy review",
  "category": "computing",
  "updated": "2020-11-17T09:28:17Z",
  "author": "mirza-bahic",
  "summary": "Feature-packed web hosting with a high renewal price",
  "verdict": "Doteasy's features are sure to meet your web hosting needs but the company charges more than the competition with a significant price increase upon renewal.",
  "pros": [
    "Excellent customer support",
    "30-day money back guarantee (limited)",
    "Decent website builder with every plan"
  ],
  "cons": [
    "Significant price hikes on renewal",
    "E-commerce site builder available only on business plans",
    "Too expensive for month-to-month plans"
  ],
  "article": [
    "Doteasy is a Canada-based web hosting provider that was founded in 2000, aiming to offer “quality, affordable, banner-free, domain-based web hosting solutions,” according to their website. They also claim that their robust security means they have never been compromised in their entire history, which they say is partly owed to the fact that they have never outsourced their technicians or support team. They currently serve over half a million customers.",
    "The provider has a Cisco-powered data center based in Vancouver, Canada. They don’t make any direct claims for uptime, but they do state that they do not rely on the local power grid, instead using diesel-powered generators and centralized Uninterruptible Power Systems (UPS) to keep everything online at all times. This means that even if the power goes out, the generators switch on and keep everything running.",
    "Doteasy offers a decent array of features: everything the most advanced plan has, you will also find on the cheapest plan, but significantly scaled down. This is still far better than not getting it at all and also makes choosing among the different plans easier, as you’re unlikely to miss out on any crucial features if you don’t want to break the bank.",
    "Doteasy’s Starter plan will set you back $3.75/mo. for the initial term (renews at $7.95). It includes free domain registration, 10 GB of disk space and data transfer each, a free SSL certificate, 10 email accounts, and a MySQL database.",
    "The next plan, Unlimited, is true to its word: there are no limits on any of these features, and it costs $4.75/mo. initially ($12.95 on renewal). The most expensive shared hosting plan is Unlimited SSD, and the only difference is that you get 100 GB of SSD storage space for $5.75/mo. (regularly $13.95/mo.)",
    "Doteasy offers a 30-day money-back guarantee and accepts credit/debit cards as payment methods.",
    "Once you’ve selected your hosting plan with Doteasy, you’ll need to create an account by leaving your name, address, and phone number with them. The provider will automatically generate your account login details for each domain account, password included, and you’ll have to choose the length of your contract.",
    "The advertised price is only available for a 3-year-long contract, while the shortest one (for one month) is much more expensive than the advertised one (for the cheapest plan, it’s $10.95/mo.) Doteasy will still try to upsell you by automatically adding daily site and email backup for $1.50/mo., while you can also add a pre-install of WordPress for free and Advanced Email Virus and Spam Protection for $6.95/mo. Important to note is that Doteasy’s Refund Policy states that they only offer money back for annual or longer plans.",
    "Every hosting plan with Doteasy comes with cPanel, meaning more experienced users will be able to jump right into working. As usual, cPanel will let you upload your website through their File Manager or even using FTP if you prefer, as well as install WordPress or a number of other apps through Softaculous, which is the same regardless of the plan you’ve chosen.",
    "What does change, however, is the variant of the pre-installed website builder that you get. The Starter pack gets the Starter version of the website builder as well, while the two Unlimited plans get the Professional version. However, to get an e-commerce website builder, you’ll need to choose the Business hosting plan which is, at $24/mo., significantly more expensive than their shared hosting plans.",
    "The speed of Doteasy’s main website is decent: a GTmetrix test tells us it takes 7.5 seconds for the page to fully load, which is very close to the average 8.4 seconds. The number of requests it took is also perfectly average at 89. This means that, while customers may not necessarily expect soaring speeds, very few will actually be disappointed with what the provider offers.",
    "Interestingly, the provider does not make any direct claims for uptime, whereas many others will go as far as to offer refunds in the event of a downtime. During our uptime test, which ran for two weeks, they registered a single outage which lasted for five minutes. In other words, even without promising anything outright, they seem to be on a great track to offer consistent quality and uptime.",
    "Doteasy takes customer support very seriously. If you need direct assistance, you can contact them either through a ticket, their live chat feature (available 24/7), or by giving them a phone call on workdays between 6 am and 6 pm PT. If you’ve already been in contact with support, you can track your ticket and everything both sides have written using your case number.",
    "Not sure what you’re looking for or trying to learn more? Not only does Doteasy offer an extensive FAQ section, they also have an incredible number of articles in their Knowledgebase that are perfect for taking your knowledge to the next level. A tutorial library serves as a great troubleshooting resource, while Getting Started articles are featured at the bottom of every page, so you’re always only a click away from getting the help you need.",
    "When it comes to customer support, neither Doteasy nor Hostgator ever settle for less than perfection. With tutorials, video guides, and incredibly detailed articles, both are a great choice for newbies and veterans alike.",
    "Bluehost is another similar provider, and both they and Doteasy have a price hike after the promotional period, with very similar features and restrictions, making the choice between them a personal one based on preference.",
    "OVH is a great hosting provider that runs for much cheaper than Doteasy—while they, too, have a price hike, it is not nearly as impactful as the one at Doteasy. However, OVH’s customer support is extremely subpar compared to Doteasy.",
    "Fasthosts is another provider offering cheaper services than Doteasy, but the latter offers the familiar cPanel interface that makes working with them significantly easier. However, Doteasy also offers an integrated, free website builder, while Fasthosts only lets you use one during a trial period, and then you have to pay up.",
    "By far the biggest advantage of Doteasy is the fact that every plan offers every feature. However, although their promotional prices are in line with what’s currently on the market, the regular prices, valid once the promotional period is over, are often more than double that and may make it too expensive for many in the long run. For cheaper alternatives, customers should check out Hostgator or Bluehost."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Ease of use",
    "10": "Speed and experience",
    "12": "Support",
    "14": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Doteasy": "https://www.doteasy.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Starter plan": "https://www.doteasy.com/web-hosting/",
    "Unlimited": "https://www.doteasy.com/web-hosting/",
    "Unlimited SSD": "https://www.doteasy.com/web-hosting/",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "OVH": "https://www.techradar.com/reviews/ovh",
    "Fasthosts": "https://www.techradar.com/reviews/fasthosts"
  }
}