{
  "source": "https://www.techradar.com/reviews/sennheiser-hd560s",
  "title": "Sennheiser HD 560S review",
  "category": "audio-visual",
  "updated": "2020-10-07T15:44:55Z",
  "author": "simon-lucas",
  "summary": "These 'analytical’ Sennheisers deliver the complete picture",
  "verdict": "If it’s insight you want, and absolutely crystal-clear understanding of a recording, the HD 560S make an awful lot of sense. If you’re just here to be entertained, though, you’ll need to look elsewhere.",
  "pros": [
    "Astute, revealing sound",
    "Light and comfortable",
    "Simple to use"
  ],
  "cons": [
    "Not the most entertaining (or tolerant) listen",
    "Plastics feel a bit unyielding",
    "Slightly leaky"
  ],
  "article": [
    "The Sennheiser HD 560S are a very specific pair of headphones seeking a very specific customer.",
    "At a glance, they’re an unremarkable (if slightly dated-looking) proposition. They’re almost entirely plastic, of the black and hard and rather shiny variety – there’s some nicely padded velour on the earcups and the inside of the headband, mind you, so comfort hasn’t been completely dismissed.",
    "Look a little closer, though, and the HD 560S reveal their true intentions. They’re an open-backed design, with all of the wide-open soundstage (for the listener) and the liberal sound-leakage (for those sitting near the listener) this configuration promises.",
    "They sport a wired design, using a 3m cable terminating in an all-business 6.3mm jack – and in case you’re still not getting the picture, the packaging states “for analytical listening sessions”. No wireless operation, no touch-controls, no app-based EQ adjustment. None of the niceties most over-ear headphones at this sort of price serve up as a matter of routine.",
    "The HD 560S are to be used as a tool, in the most literal sense. If you want to be able to look deep into the details of a mix, or to make A/B comparisons with absolute certainty, these are exactly the sort of headphones you need. If you want to be entertained, energized and invigorated by your music, though, they’re less than ideal.",
    "Sonically, the Sennheiser HD 560S are a ruthlessly revealing listen. Sure enough, the soundstage they describe is big in all directions, and individual elements of a recording appear on the stage in an absolutely solid area of space. Detail levels – whether concerning instrument timbre, vocal technique or any other aspect of a recording – are absolutely sky-high, and the HD 560S maintain an even, neutral balance from the very bottom of the frequency range to the very top.",
    "There’s nothing dull or inefficient about the sound the Sennheisers make – but in the flatness of their response, they’re very carefully tuned to assist in comparative listening, in mixing, in DJing or similarly work-orientated applications. As a consequence, there’s a relative lack of dynamism and animation to the sound they make – which renders them, yes, rather analytical.",
    "The Sennheiser HD 560S were released on September 29, 2020 and are available to buy now – they'll set you back $199.95 / £169 / AU$319.95.",
    "There’s no shortage of over-ear headphones at this sort of money, but very, very few of them are tuned to do the job the HD560S are intended to do.",
    "Over-ear headphones don’t get ‘designed’ all that much – and Sennheiser has never been the sort of company to get carried away where the ‘design’ of its products is concerned, anyhow. Consequently, the HD 560S are staunchly functional lookers.",
    "Naturally, this being Sennheiser, the build quality is well up to scratch. The plastics deployed here are on the hard and unyielding side, it’s true, and they’re not all that luxurious to the touch – but everything is fixed together with proper integrity . The HD 560S feel like they could survive many years of being chucked into a bag, or around a recording studio, without any ill-effects.",
    "And it’s not as though the HD 560S are in any way uncomfortable or unpleasant to wear. At a stripling 0.5lbs / 240g (which includes the extensive three-meter cable and its chunky 6.3mm plug) they’re light enough, and thanks to some judicious use of padding and soft velour on the earcups and inside the headband, they stay comfortable for hours on end.",
    "Behind the earcups are 38mm polymer-blend foil diaphragms to deliver the sound, and the open-backed rear of the earcups features a discreet ‘Sennheiser’ logo – just in case anyone was in any doubt as to your headphones’ provenance.",
    "All in all, then, the Sennheiser HD 560S look unfrivolous and business-like – which, one presumes, is exactly how prospective customers will like it.",
    "Getting a comfortable, secure fit from the HD 560S is easy – the headband has plenty of adjustment, and once adjusted stays in position robustly. From there, the Sennheisers waste little time in dishing out the sonic details.",
    "Yet despite their powers of analysis, the HD 560S strike a very workable balance between ‘scrutiny’ and ‘engagement’. They’re on the side of ‘scrutiny’, sure, but that doesn’t make them a dull listen.",
    "One play through the murky, complex The National Anthem by Radiohead is enough to let the Sennheisers explain what they’re all about. The multi-layered mix is opened up, separated, and rendered remarkably easy to follow. Individual elements emerge from the fog as complete, autonomous parts of the whole, their role in the overall make-up of the recording made more obvious than less ‘analytical’ headphones can describe.",
    "Tonally, the Sennheisers are as balanced as a tightrope walker. Bass is deep and textured, with scant overhang and reasonable momentum, while at the opposite end of the frequency range the treble sounds are absolutely loaded with detail and stop just short of being a little too bright.",
    "In between, the HD 560S deliver every scrap of midrange information as if their life depended on it. Detail levels across the board are very high, but where vocalists are concerned the Sennheisers don’t let them get away with anything – the attack and decay of individual notes is observed fanatically, and as a result the HD 560S make singers sound as natural, as characterful, and as convincing as can be.",
    "Downsides are relatively few, but also fairly obvious. The Sennheisers’ powers of insight and iron-fisted control can flatten recordings somewhat – dynamic peaks and troughs are smoothed out to mild bumps and dips. And the HD 560S deal with low-quality, low-bitrate recordings quite snobbily – they’re certainly not about to tart up an inferior recording simply to make it more palatable.",
    "Overall, the HD 560S presentation is not unlike the sort of thing served up by near-field monitors in a recording studio. If you’ve ever heard a pair of Yamaha NS-10, Tannoy Reveal or similar, you’ll know the sort of thing we mean. If you want to hear the small differences in different mixes of the same tune, the Sennheisers will let you know exactly what’s what. If you want to be transported by a piece of your favorite music, though, these might not be the headphones you’re looking for."
  ],
  "headers": {
    "0": "One-minute review",
    "7": "Sennheiser HD560S price and release date",
    "9": "Design",
    "14": "Audio performance",
    "21": "Don't buy them if..."
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342"
  }
}