{
  "source": "https://www.techradar.com/reviews/clickmeeting",
  "title": "ClickMeeting webinar software review",
  "category": "computing",
  "updated": "2020-07-20T15:11:21Z",
  "author": "michael-graw",
  "summary": "Flexible, customizable webinars",
  "verdict": "ClickMeeting offers an impressive suite of tools for webinars of any size. You get flexible scheduling, audience engagement tools, and integration with a variety of popular data analytics and cloud storage platforms.",
  "pros": [
    "Automatically follow up with attendees after webinars",
    "Create polls, surveys, and Q&A sessions during meetings"
  ],
  "cons": [
    "Presenter view can initially be overwhelming",
    "Can get pricey if you need a high attendee cap"
  ],
  "article": [
    "Looking for the best video conferencing software? Then ClickMeeting is worth a closer look. This powerful video chat platform is built to help you not just run webinars but also get powerful analytics out of them. On top of that, you can use ClickMeeting for day-to-day business meetings of up to 25 participants.",
    "So, is this the right tool for your business? Our ClickMeeting video conferencing review will help you decide.",
    "ClickMeeting offers two plans, but the pricing varies depending on how many attendees you expect to have at webinars. For up to 25 attendees, the Live plan costs $30 per month (or $300 per year), while the Automated plan costs $45 per month (or $480 per year). For 100 attendees, the Live plan costs $79 per month (or $720 per year), while the Automated plan costs $95 per month (or $900 per year). There’s also a free trial that offers most of the features of the Automated plan, but can only be used for up to seven days.",
    "The main difference between these plans is the level of automation you get. Both plans give you unlimited online meetings with HD-quality video and tons of presentation tools. But, with the Automated plan, you can pre-record webinars and videos and run them according to a schedule. You can also auto-publish webinars online and automatically send follow-up and thank-you emails.",
    "ClickMeeting offers an Enterprise plan as well, but you’ll need to contact the company for pricing options.",
    "ClickMeeting is absolutely loaded with features for webinar hosts. To start with, the software includes just about all the tools you could want during a presentation. You can share your screen, play slideshows and videos, and even let attendees take over your mouse to explore an interactive display. Better yet, ClickMeeting supports question-and-answer sessions and live polls, so you can get your audience participating and collect valuable data about attendees.",
    "What’s really exciting about ClickMeeting for data-driven businesses is how the software integrates with analytics and marketing tools. You can embed a Facebook pixel on your webinar’s landing page or connect that page to Google Analytics. Your webinar page is also fully customizable, enabling you to show off your brand.",
    "ClickMeeting even offers integrations with a number of popular business apps. You can link your Dropbox to have your webinar recordings automatically stored in the cloud, or use Zapier to integrate with an email marketing platform or CRM software.",
    "Getting started with ClickMeeting is straightforward. There’s no download, as the software is entirely browser-based. However, if you want to use ClickMeeting on a mobile device, you’ll need to download the app (iOS and Android).",
    "When you first log into the platform, it walks you through the process of setting up your first event. The first step is to create an event, which can either be an online video room that’s opened at a specific time or one that’s permanently open. You can fully customize the appearance of the webinar space and the waiting room.",
    "For small meetings, the easiest way to add attendees is by typing in emails. But, you can also import an address book in CSV format or add attendees in bulk from a CSV file.",
    "The ClickMeeting interface can feel a little overwhelming at times, but for the most part it’s seamless. Most of the administrative features are contained within a dashboard, from which you can schedule events, edit your address book, or access viewership analytics for any of your past webinars.",
    "When you first open a webinar room, the presentation view has a lot going on. All of your presenter options are contained in a menu down the left-hand side of the screen; the list of attendees and meeting chat is on the right-hand side; and your own video feed is floating in the middle of it all. Still, the organization is actually quite good. The only issue we had was that presenter options like surveys and call-to-action buttons open in new windows rather than inside the presentation screen.",
    "As for performance, we were very impressed. In a meeting with one presenter and two attendees, there was no lag and the audio was surprisingly clear. The video feeds, too, were in higher resolution than we expected going in, which was a nice surprise.",
    "ClickMeeting has a number of basic but important security features. Presenters have the option to remove attendees at any time, and you can decide to make meetings accessible by password only when you create them. When sharing files through ClickMeeting, all data is scanned for viruses and malware as it passes through the company’s servers.",
    "Importantly, ClickMeeting also takes data privacy seriously. The company is GDPR-compliant, and all video-chat recordings stored on the company’s servers are encrypted.",
    "ClickMeeting offers customer support via email and live chat seven days a week. On top of that, the company’s website has one of the most comprehensive documentation libraries we’ve seen. There are entire e-books on some popular software integrations, as well as dozens of videos walking you through frequently encountered issues.",
    "ClickMeeting isn’t the only high-powered webinar and video conferencing software. Zoho Meeting and Zoom are both close competitors.",
    "Zoho Meeting is slightly less expensive than ClickMeeting, with plans starting at $15 per month for webinars with up to 25 attendees. This platform features a lot of the same in-meeting tools as ClickMeeting, but there’s no automated scheduling and integration outside of the Zoho suite is a little more difficult.",
    "Zoom plans start at $40 per month for webinars with 100 attendees, so it’s only a worthwhile option if you routinely host large meetings. You can’t automate meetings, but it does offer live streaming on Facebook Live and YouTube.",
    "There’s a lot to like about ClickMeeting if your company relies on webinars to garner leads or stay in touch with employees. This video conferencing software has a number of tools for keeping audiences engaged during meetings, plus automated follow-ups so you can capitalize on a successful webinar. The integrations are also a huge plus for productivity. For everything this software offers, the price is fairly reasonable, too."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features and utilities",
    "8": "Setup",
    "11": "Interface and performance",
    "14": "Security",
    "16": "Support",
    "17": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "best video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "ClickMeeting": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4085802818970342000/https://clickmeeting.com/pricing",
    "presentation tools": "https://www.techradar.com/best/best-presentation-software",
    "webinars": "https://www.techradar.com/best/best-webinar-software",
    "question-and-answer sessions and live polls": "https://www.techradar.com/best/best-qanda-and-polling-platforms",
    "marketing tools": "https://www.techradar.com/best/best-content-marketing-tools",
    "business apps": "https://www.techradar.com/best/best-apps-for-small-business",
    "CRM software": "https://www.techradar.com/best/the-best-crm-software",
    "iOS": "https://www.techradar.com/best/best-business-ipad-apps",
    "Android": "https://www.techradar.com/best/best-android-antivirus-app",
    "emails": "https://www.techradar.com/best/best-email-clients",
    "": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "password": "https://www.techradar.com/best/password-manager",
    "viruses and malware": "https://www.techradar.com/best/best-malware-removal",
    "privacy": "https://www.techradar.com/best/anonymous-browsing",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "Zoho Meeting": "https://www.techradar.com/reviews/zoho-meeting",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "productivity": "https://www.techradar.com/best/best-productivity-apps"
  }
}