{
  "source": "https://www.techradar.com/reviews/hp-omen-vector-wireless-mouse",
  "title": "HP Omen Vector Wireless Mouse review",
  "category": "computing",
  "updated": "2021-03-31T19:10:18Z",
  "author": "michelle-rae-uy",
  "summary": "Great performance meets long battery life",
  "verdict": "The Omen Vector Wireless mouse packs a great performing mouse with more rechargeable battery life than you’ll find elsewhere. It’s also the only gaming mouse right now with fast charging tech. Anyone looking for a wireless gaming mouse should consider the Vector, as long as you can live without Bluetooth connectivity.",
  "pros": [
    "Incredibly fast response time",
    "Great battery life",
    "Fast charging"
  ],
  "cons": [
    "Lacks Bluetooth connectivity",
    "Can only cycle DPI in one direction",
    "Design is uninspiring"
  ],
  "article": [
    "The Omen Vector Wireless Mouse is part of that growing trend of wireless peripherals. And, it’s a welcome one as long as performance doesn’t take a hit just for that added convenience. In the past, wired connections have always provided a better and faster connection than wireless ones no matter the device. Luckily, that’s no longer the case",
    "This new entry from HP, whose name is almost completely absent from the packaging, sets out to prove that you can have a wireless mouse as fast and as accurate as any other mouse out there. And it more than lives up to its promises. But a great gaming mouse needs to do more than that. Can the Vector offer more to set it apart from the rest while still keeping on ticking with the best of them? The answer is, thankfully, yes.",
    "Programmable buttons, high DPI capability, incredibly low latency and most of the things you would want in a great wireless gaming mouse are all here. However, that’s not what sets the Omen Vector apart from other gaming mice. It’s not especially unique looking, after all, and, while its performance is very solid – especially for a wireless mouse – it’s on par with other similar options out there.",
    "What makes the Omen Vector Wireless Mouse special is the incredibly long battery life, the longest we’ve seen excluding competitors that rely on replaceable batteries. That and the fact that it’s, in HP’s words,” the world’s fastest USB-C charging” mouse.",
    "Gaming mice, for some reason, have not caught up to the rest of the tech world in building fast-charging devices. At least not when it comes to their wireless offerings. That’s what makes the Vector unique among its peers. If getting an hour of use from 30 seconds of charging perks up your ears, then this might be the mouse for you.",
    "At $99.99 (£89.99, about AU$TK165), it sits in the more premium portion of the mouse market. That’s when considering the fact that there are a lot of cheaper mice out there and quite a few gaming mice – wireless or otherwise – that come with more bells and whistles, and cost half of the Vector’s asking price.",
    "Getting long-lasting rechargeable battery life and fast-charging capability in a wireless mouse, therefore, needs to be at the top of your priority list for the Omen Vector Wireless Mouse to be on your radar.",
    "Of course, comparing it to other mice that cover the same ground, the price is fairly reasonable. The Razer DeathAdder v2 Pro, for instance, has similar capabilities and goes for $129.99 (£129.99, AU$224.95). That’s while offering some performance perks over the Vector like 20k DPI, though it also only gets 120 hours of battery. There’s also the Corsair’s Dark Core RGB Pro, which goes for $79.99 for similar functionality but adds Bluetooth connectivity. However, its 50 hours without RGB lighting on doesn’t even come close to the Vector’s battery life.",
    "If the price doesn’t set it apart from the pack, then neither does its design – at least at first glance. The Vector comes covered in a smooth, matte black hard plastic with textured sides to help with your grip, sleek rubber pads outlining the bottom for easier movement, and a compartment tucked underneath to hold the included wireless when not in use. And, in the front, you’ll find a USB-C port to charge and to use the mouse in wired mode.",
    "The Omen Vector Wireless Mouse looks like most gaming mice with its slightly right-hand leaning ergonomic design, 6 mappable buttons, and two programmable RGB zones to remind you of its gaming pedigree. Those 6 buttons, which include a DPI cycle button and two side buttons to go with the standard left, right, and middle wheel, do hide Omron switches which are good for 50 million presses.",
    "Its two RGB zones are located around the mouse wheel and on the diamond emblem in the palm wrest. And, they can be customized through the Omen Command Center software for a few different animations as well as to display just about any color you like. The RGB customization here is a bit light in comparison to some other brands, but it does offer an interesting preset where the mouse wheel will change to a predetermined color depending on the DPI setting you’ve cycled to via the DPI button. It’s definitely a handy way to know how fast your mouse is about to move.",
    "Going back to all of those buttons for a moment – they’re all reprogrammable through the same software. You can assign any button to any keystroke on the keyboard, as well as assign multi-key combinations, macros, media actions, and any of the other mouse buttons. The only thing you can’t assign is a ‘DPI down’ button, which would allow you to cycle through your DPI settings in the other direction. This is included in the list of options, but it’s greyed out with the word \"unavailable\" next to it.",
    "The Omen Vector Wireless Mouse comes with a wireless receiver that connects easily and offers a stable connection. However, unlike a lot of other premium wireless devices, you’re limited to just that wireless receiver. Unlike the Corsair Dark Core, this doesn’t have bluetooth, which means that if you lose that wireless receiver, you’ll be limited to using the mouse through the provided cable until you get a replacement.",
    "It’s battery life and fast charging that are the Omen Vector’s main selling points. HP advertises up to 180 hours of battery life from a full charge, which is about on par with our experience. Leaving the mouse on for 3 days straight only brings the battery life down only 40%. Using it constantly for a week with power-saving mode turned on (via the software) also only gets it down to 60%.",
    "Even better, it takes only 45 minutes of charging to get it back up to a full charge. That seems to track with HP claims that charging for 90 minutes should get you from 0 to 100% and 30 seconds of charging should give you an hour of use.",
    "One of the concerns for any wireless device is how it compares to its wired counterparts in terms of performance. The Omen Vector Wireless Mouse thankfully puts those concerns to rest. Not only does it offer an incredibly fast 16,000 DPI thanks to its PixArt PAW3335 sensor, but it also has a 1 ms polling or report rate.",
    "Because of the polling rate, we haven’t experienced any kind of lag or latency when using the mouse. Whether it is with more cinematic games like Metro Exodus and Red Dead Redemption 2 or games where speed is of the essence like Doom: Eternal, the mouse feels like an extension of our hand. When we want to do something, it is done immediately and accurately. Macros and remapped buttons also work like a charm when we need them to.",
    "Setting the DPI to 16,000 in Doom: Eternal let us experience head-spinning speed whenever we’re turning or moving around. Esports gamers will find that the Omen Vector Wireless Mouse will get the job done and do so without the leash. And, with its customizability, you can adjust for any game you’re playing. For example, we programmed one of the side buttons to act as a Sniper button, slowing the DPI way down.",
    "While it’s not a perfect mouse, the Omen Vector Wireless Mouse does a lot of things right to justify its price to the right users. It offers about as much battery life as you’ll find in a wireless mouse and faster charging than you’ll find anywhere else. And, that’s while delivering esports-level performance."
  ],
  "headers": {
    "0": "Two-minute review",
    "19": "Don’t buy it if…"
  },
  "links": {
    "wireless mouse": "https://www.techradar.com/news/best-wireless-mouse",
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "Razer DeathAdder v2 Pro": "https://www.techradar.com/reviews/razer-deathadder-v2-pro",
    "Corsair’s Dark Core RGB Pro": "https://www.techradar.com/reviews/corsair-dark-core-rgb-pro-wireless",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Doom: Eternal": "https://www.techradar.com/reviews/doom-eternal-review"
  }
}