{
  "source": "https://www.techradar.com/reviews/anker-soundcore-life-p2",
  "title": "Anker Soundcore Life P2 review",
  "category": "audio-visual",
  "updated": "2021-07-15T14:46:41Z",
  "author": "sean-cameron",
  "summary": "Great earbuds for commuters",
  "verdict": "The Anker Soundcore Life P2 true wireless earbuds sport a comfy design, strong Bluetooth performance, decent audio chops and enough quality-of-life features to make a good first impression. Make no mistake: these are great buds for commuters.",
  "pros": [
    "Comfortable fit",
    "Enjoyable sound",
    "Easy to use"
  ],
  "cons": [
    "Unambitious audio",
    "Limited in-line controls",
    "Uninspired design"
  ],
  "article": [
    "In 2016, when Apple became the first manufacturer to drop the 3.5mm headphone jack from its handsets, a revolution was promised. The first-generation Apple Airpods, released in the same year, were to be the first of a wave of new true wireless earbuds that would transform hearables forever.",
    "It’s only recently that this promise has really started to bear fruit, though – with a tidal wave of true wireless earbud models at affordable prices, rather than just the high-end versions we’d had to make do with before.",
    "Chinese manufacturer Anker is one of the more recent players to throw its hat into the ring. With established name recognition, through its popular Soundcore speakers and batteries, Anker has a cachet that many others do not. This is still a new area for the company, however, and as such all of its products are first tries – so are they worth a buy even at the budget price of $59.99 / £49.99 / AU$100?",
    "In the world of true wireless, there are only a few distinctive form factors, and of these the Soundcore Life P2 is firmly in the inspired-by-Airpods category – which is to say they quite blatantly copy Apple’s design.",
    "But whatever the Soundcore Life P2 earbuds lack in originality, they make up for with comfort and utility. Each of the wireless earbuds is feather-light and has a reassuringly snug fit, helped by the inclusion of several silicon tips in different sizes.",
    "The stalk from the earbuds is dark, meaning they don’t stand out as much as the white AirPods, aren’t overly long either. Each bud has a single button on it, with simple functionality (on/off, pairing and track skipping) which helps to keep things relatively straightforward.",
    "The carrying case is light too, and charges with the superior USB-C standard – a nice touch that we don’t always get at this price point. It houses a large battery which, with combined charging and usage on the go, enables up to 40 hours of use away from the charger. While using the buds for a standard commute across one week, we found that we never needed to recharge the case itself, having more than enough juice to top-up the buds every couple of days.",
    "In all, these earbuds are unobtrusive and comfortable, if a little utilitarian. The case fits well into a coat pocket on a commute, which is what it was designed for. The sole bit of flair is a little gold accent on the rim of each bud – otherwise they’re an austere affair, which is to be expected from the budget price point.",
    "There is a decent waterproof rating, though we would hesitate to use these Bluetooth earbuds in anything but light rainfall.",
    "As is common for audio products sold primarily through Amazon, the Soundcore Life P2 earbuds come with a litany of marketing speak attached. Their price is justified by “graphene drivers, beamforming noise reduction, cVc 8.0 technology, BassUp technology, PUSH AND GO technology” and more – but you can ignore most of this.",
    "What matters is the experience of using the buds themselves – which is largely a positive one.",
    "To begin with, Bluetooth connectivity is at the stronger end. Using an iPhone 11, we found reception stayed consistent across rooms and through various walls, with no skips or dropouts, and this proved to be the case while on the go too. Pairing is also easy, with the buds connecting immediately to the last device used when removed from their case.",
    "The sound profile makes a great first impression too, which mostly bears out too across extended usage. Bass is punchy and energetic, if not exactly spacious, but on the whole there’s a decently-sized soundstage with both buds in your ears.",
    "We found the bass line in Outkast’s Prototype funky and smooth, the warm jazzy notes of Kate Schilling’s Kite vocals well represented, and power to spare in the drums of Avenged Sevenfold’s track Crossroads. These earbuds are designed for the commute, and with an IPX7 rating, for workouts too – but they’re for consumers who use Spotify, not audiophiles armed to the teeth with FLAC files and Ohms (look it up).",
    "One powerful selling point of these earbuds is their call performance. With four microphones overall, we came in with high expectations – which were mostly met.",
    "The most positive praise that can be given here is that the Soundcore Life P2 buds are no worse than a typical phone speaker for calls. In some situations the sound was muffled on the receiving end of a call, but in general they work well for talking on the go, and should be subsequently better for conference calls in a quiet room.",
    "Given the price, we wouldn’t deign to expect Active Noise Cancellation, but we found that the passive noise cancellation was able to keep enough of the outside world at bay without removing one from it entirely. We found passing ambulances, for example, perfectly audible, but the rumble of nearby traffic difficult to make out.",
    "There are plenty of true wireless earbuds out there these days, flooding every price point, from budget buds to high-end portable audio – as established players and newcomers alike try to make a name for themselves in an increasingly competitive marketplace.",
    "And yet, the Anker Soundcore Life P2 buds manage to stand out from the crowd. They have a comfortable, fuss-free design, good sound, decent call quality, and endurance to spare. They can’t offer the highest grade of sound reproduction, but what they do produce does bely their price point and is certainly good enough for the average listener.",
    "Those who do plump up the asking price will find much to enjoy, as these represent a significant upgrade on what can be found at the £20 / $30 mark, where many will likely be upgrading from."
  ],
  "headers": {
    "3": "Design",
    "9": "Performance",
    "17": "Verdict"
  },
  "links": {
    "Apple Airpods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Bluetooth earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}