{
  "source": "https://www.techradar.com/reviews/zoho-cliq",
  "title": "Zoho Cliq review",
  "category": "computing",
  "updated": "2020-05-01T15:00:27Z",
  "author": "john-brandon",
  "summary": "One of the most efficient and reasonably priced team messaging apps around",
  "verdict": "Zoho Cliq doesn’t mess around with high-end features beyond what you might expect, but it helps organizations communicate quickly and efficiently. Once you wean them all off email, you can expect streamlined communication where decisions occur faster. All of this collaboration is available for free for most features or only $1 per user for added perks.",
  "pros": [
    "Simple and obvious interface",
    "Pin chats to remember them",
    "Integration with Zoho One"
  ],
  "cons": [
    "Can feel too much like Slack"
  ],
  "article": [
    "If we lived in a word where everything was fair, we’d all be using Zoho Cliq. The powerful collaborative messaging app doesn’t have the household name recognition of Slack or the power of Microsoft Teams (which some companies use as part of Microsoft 365). It does offer a solid feature set with a clean interface, a reasonable pricing model, and integration with the Zoho One platform. While Cliq can feel a bit like Slack with a few extra features, there is something amazing about discovering this app and all it has to offer -- at such a low price.",
    "Zoho Cliq is powerful and useful even without choosing the paid plan. Unlike many team messaging apps, you can use 100GB of shared storage for your company right off the bat without signing up for the paid plan. Advanced features like task management bots and video chats are also available right out of the gate. Even if you decide to do a webinar with your company, the free version lets you do a video stream where a presenter can share a video with up to 100 participants -- an unusual and powerful feature.",
    "It’s only when you choose the paid plan that Zoho Cliq reveals its true colors, and they are bright and vibrant to say the least. It offers an impressive array of extras, including an astounding 100GB of storage per user - for only $1 per user per month. With the paid plan, any limits imposed on the number of messages your team can send or the bots that can assist are increased tenfold. It would seem unlikely for an organization to choose the paid version and run up against any barriers in terms of messaging, bots, or storage.",
    "At first glance, Zoho Cliq looks and functions almost exactly like Slack. That’s even true at second and third glance. On the left you will find channels you can use for communicating about projects. Below the channels list you’ll see an area for direct messaging. So far so Slack. The color scheme is reminiscent of Slack, but instead of purples, greys and whites it’s more of a bluish green with grays and whites. Honestly, it doesn’t matter. Cliq uses a clean and efficient interface that you could argue also looks similar to Google products and matches up with interface design trends in general -- namely, to have a clean, white background.",
    "The one standout feature here is that you can pin chats to the top left of the screen, and that’s useful. (Slack also allows you to pin chats to a channel.) With Cliq, what you pin stays in that section for easy access to important conversations later.",
    "Cliq also provides easy access to video and voice chats. You can select anyone on your team and select a tiny drop-down menu to choose video or voice for the chat. You can also hover over anyone on the team and select an icon for a video or voice call. A calendar function is also easy to find in the upper right corner, along with all of the settings and the other Zoho One apps.",
    "Zoho Cliq is meant for quick and efficient team communication. It doesn’t try to be anything more than a way to discuss projects, share files, and hold video and voice chats. If you can’t communicate about it right in Cliq, then you probably aren’t working hard enough or you haven’t found the feature yet. Cliq supports extensions like Boz, Zendesk, and Trello, so if the feature is not already built-in you can extend the product easily enough.",
    "The question is why would you bother. The free plan alone offers 100GB of storage for your company; if you upgrade to the paid version, it’s 100GB per user. You can hold a webinar using Zoho Handshake even in the free version, streaming a video from one presenter to up to 100 participants. Cliq will surprise you, though, with some extras. For example, you can print a transcript for any chat for your records or as a back-up. There are security features to add SSL encryption to messages and a way to have internal or external channels.",
    "Perhaps the most powerful feature is related to Zoho One integration. Once you start using Zoho One to run your company, you can then start using Zoho Cliq with each employee without having to configure anything. And, all other Zoho One apps are a click away.",
    "Cliq is faced with a double-edged sword in this crowded market. On one side is Slack, which is already so dominant and well-known. New hires sometimes join a company and the first thing they want to know is when they can be added to Slack. This is before they ask about email. They know it is the common way to communicate. The other edge of the sword is Microsoft Teams, which has seen incredible adoption rates because it is already included as part of the Microsoft 365 package used by millions of companies.",
    "While Cliq competes with Slack almost feature for feature, it can’t compete on name recognition. And, Zoho Cliq can’t compete with the enterprise computing features in Microsoft Teams where the security features alone take up an entire page listing 20-25 security related features. It’s rare to find any collaborative messaging app that can compete with Teams with features like ensuring compliance and regulations with messaging to meet industry standards or encrypting all messages so that they are not accessible to outsiders.",
    "This puts Zoho Cliq in an interesting position. It’s powerful, affordable, and easy to use. As it stands, there are no real complaints about how it works or the features. The only issue is in convincing your team to use it if they already know and like Slack or if your company has settled on Microsoft 365 as the platform of choice -- and those two things are very real concerns.",
    "As it stands by itself, Cliq is an excellent choice. It’s affordable and powerful. It might convince you to ditch Slack -- if you can convince everyone to do that."
  ],
  "headers": {
    "1": "Plans and pricing",
    "3": "Interface and performance",
    "6": "Features",
    "9": "The competition",
    "11": "Final verdict"
  },
  "links": {
    "Zoho Cliq": "https://www.zoho.com/cliq/",
    "collaborative messaging app": "https://www.techradar.com/best/best-online-collaboration-tools",
    "paid plan": "https://www.zoho.com/cliq/pricing.html",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams"
  }
}