{
  "source": "https://www.techradar.com/reviews/jaybird-vista",
  "title": "Jaybird Vista review",
  "category": "audio-visual",
  "updated": "2021-07-15T15:22:33Z",
  "author": "henry-st-leger",
  "summary": "Near-perfect fitness earbuds",
  "verdict": "Jaybird has outdone itself with its latest true wireless earbuds, with incredible sound in a compact package – and an impossibly fast Bluetooth connection.",
  "pros": [
    "Compact charging case",
    "Instant connection",
    "Premium sound",
    "IPX7 water resistance"
  ],
  "cons": [
    "No heart rate monitor",
    "No ambient sound features",
    "Limited battery life"
  ],
  "article": [
    "The Jaybird Vista earbuds are some of the best true wireless headphones out there – and it's not hard to see why. With a sleek, compact design, and features squarely aimed at real and budding athletes – with the ability to appeal to the less committed fitness nuts among us too.",
    "Coming off the back of the Jaybird Run True – and waterproof Run XTs – the Jaybird Vista earbuds are highly compact wireless earbuds with the water and sweat resistance to deal with all levels of indoor and outdoor workouts. As true wireless earbuds, too, you won't find any cables getting in your way.",
    "With a huge boost to Bluetooth connectivity compared to previous models, and an incredibly compact charging case you can carry about on your runs, the Jaybird Vista earbuds are truly excellent running headphones, with only a couple of small caveats to temper that excitement.",
    "For a more tethered experience, you may want to check out the Jaybird Tarah or Jaybird Tarah Pro – but otherwise our Jaybird Vista review should have all the information you need.",
    "The Jaybird Vista earbuds are $179 / £159 / AU$299 at the Jaybird online store and other online retailers. They're currently available in Black, Mineral Blue, Nimbus Gray, and a new Planetary Green design to commemorate its 'earthproof' design. Each model comes with a two-year warranty and 14-day returns policy.",
    "They retail for the same launch price as the Jaybird Run XT true wireless buds, which have an even smaller four-hour battery life. If you're looking for a cheaper option, or something with a cable between the earbuds, you may want to check out the basic Jaybird Tarah ($99 / £89 / AU$149) or fancier Tarah Pro earphones ($159 / £139 / AU$229).",
    "The Vista earbuds are straightforward to look at, but their simplicity belies a brilliantly stripped-down design.",
    "Instead of just tacking a silicon ear tip onto the end of the earbud, the Vistas use a fully connected casing with ear tip and wing tip (for fitting into the inside and upper edge of your ear, respectively).",
    "That means you’re not fiddling with several different parts, while the connected design prevent either water or your own corrosive sweat from getting in to the drivers.",
    "The Vista earbuds are rated at IPX7 water resistance, meaning they can deal both with a downpour or a brief dip in up to one meter of water – though we wouldn’t really recommend them for swimming.",
    "You get three different sizes for the connected ear tips, with one removing the wing tip entirely: making for a less secure fit, but increasing the comfort for more casual listening sessions where you’re not sprinting around a track.",
    "The Jaybird Vista earbuds are also brilliantly compact – but that’s also nowhere near as impressive as the compact size of their carry case, which uses diagonally-slanted charging stations to minimize the case’s dimensions.",
    "While charging cases are often too bulky to carry around during a run or workout, the Jaybird Vista case should fit easily into a zip pocket or similar, while being lightweight enough that it doesn’t take any precious seconds off your personal best.",
    "The case carries an additional ten hours of charge, on top of the Vista’s six hours per earbud – which isn’t that much compared to some other models, like the UA True Wireless Flash, but it seems a fair trade off for the lightweight and portable case. There’s a charging port for the USB-C standard, thankfully, side-stepping the proprietary charger of its regular wireless earbuds.",
    "In a lovely touch, the case also uses the same woven rope from the Jaybird Tarah Pro as a lanyard to connect to a keyring or similar – giving a hardy feel that ties it in nicely to the rest of the Jaybird range, and making us even happier we have the whole set.",
    "We did however find that the battery for each earbud drains at slightly different speeds. They were never more than 5-10% out of sync, and still offer a full day’s charge regardless, but it was odd to see all the same.",
    "We were slightly stunned by the quality of the audio on these earbuds.",
    "There’s a pleasingly wide soundstage for such small 6mm drivers, with a warm and full sound across low, mid, and high frequencies, and the resonance to hear individual notes slowly fading out throughout the track.",
    "Both the thudding drums and falsetto vocals of Muse’s Plug In Baby are drawn out beautifully, with an audio performance more akin to over-ear cans than compact fitness earphones – and we found this across any number of pop, rock, or bassy techno tracks we played through them.",
    "Being able to play around in the Jaybird app helped, of course – with a selection of EQ options available online or offline from the moment you open the app, as well as suggested podcasts and playlists from other Jaybird users.",
    "You can create your own sound profile quite quickly, to tailor the frequencies of each song or podcast to your own unique sound print. But there’s also the option to jump in with pre-made options for warmer mids, boosting the bass, or just removing the higher frequencies likely to give you a headache over a long listening session.",
    "They don’t go very loud, so if you’re hoping to completely drown out the outside world, these aren’t the earbuds for it. Nonetheless, the firm fit provides great sound isolation, and the Vista earbuds manage to hold the audio detail together right up the loudest it can go.",
    "True wireless often means making do with the audio compression over Bluetooth, but Jaybird averts the worst of this by connecting directly to each earbud, instead of having them connect to each other. (This also means you can use the left or right earbud by itself, if you really need to draw out the battery life or hear incoming cars.)",
    "The earbuds connected to our smartphone instantaneously the moment we took them out of the case, and it’s clear Jaybird has worked hard in this department to make this a seamless experience.",
    "The 16-hour battery life always got us through a full day of use. While other pairs of earbuds may pack in more charge, you won’t get the same compact case with a bigger battery – and as it is the Vista’s case was a dream to carry around.",
    "You won’t find some noise-cancelling or ambient sound features here, like the Sennheiser Momentum True Wireless, which uses external microphones to play outside noise inside the drivers, keeping you more in tune to your surroundings. We’re told that Jaybird wouldn’t have been able to keep the dimensions down if it included these kinds of features, which holds true when we consider the bulkier earbuds of those other models.",
    "The Jaybird Vista true wireless earbuds are truly astonishing in what they achieve. Despite being fitness-first headphones, they still manage to offer incredible audio alongside water and sweat resistance like the best of them.",
    "These earbuds certainly aren’t cheap: at $179 / £159 / AU$299 they’re certainly at the premium end of the market. But the combination of stark coloring, compact and lightweight design, and premium sound makes them a no-brainer for your next true wireless earbuds – whether you’re training for a marathon or just walking briskly to the office."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "16": "Performance",
    "26": "Our verdict"
  },
  "links": {
    "best true wireless": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Jaybird Run True": "https://www.techradar.com/reviews/jaybird-run-true-wireless-sport",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "running headphones": "https://www.techradar.com/best/best-running-headphones",
    "Jaybird Tarah": "https://www.techradar.com/reviews/jaybird-tarah",
    "Jaybird Tarah Pro": "https://www.techradar.com/reviews/jaybird-tarah-pro-review",
    "online store": "https://www.techradar.com/techradar/articles/jaybirdsport.com",
    "Planetary Green": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1140345723490038500&xs=1&url=https%3A%2F%2Fwww.jaybirdsport.com%2Fen-gb%2Fvista.html%23985-000987&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fjaybird-vista",
    "Jaybird Run XT": "https://www.techradar.com/news/jaybird-launches-waterproof-run-xt-true-wireless-earbuds",
    "Tarah Pro": "https://www.techradar.com/reviews/jaybird-tarah-pro-review",
    "UA True Wireless Flash": "https://www.techradar.com/reviews/under-armour-true-wireless-flash",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "noise-cancelling": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Sennheiser Momentum True Wireless": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-review"
  }
}