{
  "source": "https://www.techradar.com/reviews/alienware-aurora-r9-review",
  "title": "Alienware Aurora R9 review",
  "category": "computing",
  "updated": "2020-12-11T03:11:49Z",
  "author": "benjamin-abbott",
  "summary": "A powerhouse that doesn't feel the need to overcompensate",
  "verdict": "The latest addition to the Aurora line is sleek, bold, and pleasantly unassuming - this isn't a machine that feels the need to shout about its gaming credentials. And it absolutely could have; many versions of the R9 are crammed with high-end components capable of impressive 1440p and 4K performance. Although it will set you back a fair amount, it's a worthwhile premium investment with an eye on the future.",
  "pros": [
    "A broad range of specifications available",
    "Classy yet subtle design",
    "The perfect blend of form and function"
  ],
  "cons": [
    "That design may not age well",
    "Expensive"
  ],
  "article": [
    "In a way, the Alienware Aurora R9 is the Mac of gaming PCs. At least, it feels and kinda looks like it, with its stunning yet elegantly understated chassis, proving once and for all that glass panels and gaudy RGB lighting aren’t the only way to make the best gaming PCs attractive looking.",
    "It’s not like the Alienware Aurora R9 should feel the need to overcompensate with flashy gaming aesthetics anyway. With the range of components you can fill it with, it’s a boon for gamers who want all the power and none of the hubris – and something you’d be happy to pay its steep price tag for. If you can afford it, that is.",
    "The Alienware Aurora gaming desktop line has always been among the best machines for gaming, and the Alienware Aurora R9 has continued that tradition.",
    "Naturally, you're paying a fair shake for that level of quality. Alienware Aurora R9s range in price from $747.99 / £899 / for basic i5 starter sets (in Australia the minimum configuration comes with a Core i7 CPU and costs AU$2,124) to $4,157 / £3,999 / AU$5,499 if you go for an extreme build.",
    "In other words, it picks up the baton from the previous model - the Aurora R8 - and runs with it (into the distance and over county lines, in the case of the i9-9900K Geforce 2080 TI version).",
    "This is a gaming machine that can be whatever you need, and it's also accommodating for a variety of budgets. That gives it plenty of versatility for the years to come.",
    "Even though it's almost always cheaper to build a PC yourself, the R9 is a great example of why doing so isn't the be-all and end-all; as is exemplified by its design, you're getting intelligent engineering combined with essential components and 100% less hassle.",
    "Alienware has always positioned itself as the premium gaming brand, and the R9 supports that notion with a classy yet restrained design.",
    "An elegantly simple matte case is reminiscent of old-school Macs with those bulbous curves, and the scooped-out front for better airflow creates an eye-catching statement piece.",
    "What's more, there's a lack of ostentatious features that don't do an awful lot other than shout loudly - you won't find distracting RGB light shows or unusual angles to make it look like a sci-fi hovercraft, thank you very much.",
    "Instead, the Aurora R9 opts for a more subtle approach. A single hoop of light at the front and lit-up logos are the only flourishes on display, and that's refreshing. It's confident in its simplicity.",
    "And although we personally would have preferred build materials that are a little more premium (the case itself feels somewhat 'plastic-y'), the smooth, oh-so-shiny front makes up for it. The latter is form complimenting function, too - that distinctive strip juts out from cooling vents used when overclocking.",
    "The R9 obviously won't be to everyone's taste (a colleague described the case at large as a 'vacuum cleaner', which is rather accurate considering those vents), but you've got to give Alienware credit for breaking the mold. In truth, our only concern would be this design's longevity - we have a suspicion it won't age gracefully, but time will tell.",
    "As you'd expect, every Aurora R9 has the same basic features; that memorable chassis, almost a dozen USB ports - many of which are SuperSpeed - and the usual connectivity gubbins like DP, HDMI, and more on the GeForce card (just remember to plug your chosen medium into the GeForce slots, as your device will default to much less powerful integrated graphics if you use the main DisplayPort at the top).",
    "Usefully, three USB slots and audio/microphone jacks sit at the front for easy access. The case also has sliding locks on the rear for easy access, although you'll need to unscrew the whole thing to get at the insides.",
    "In terms of its innards, that'll vary depending on the model you choose. Our review machine was fitted with a 9th-gen Intel i7-9700K CPU, 16GB Dual Channel HyperX Fury DDR4 RAM, a 512GB NVMe SSD, 2TB SATA HDD, and a powerful GPU in the form of a Nvidia Geforce RTX 2070 Super.",
    "Because the Super range is the latest addition to the best graphics cards, with access to next-gen tech like ray tracing and entry-level 4K, that's a good combo if you want to future-proof yourself. We're about to enter a new era of gaming thanks to the upcoming PS5 and Xbox Series X, so that's not a perk to be taken lightly.",
    "Yes, these features and Alienware's usual premium make for pricey machines. Nonetheless, you can at least be guaranteed that you're getting quality for your cash.",
    "In terms of everyday computing, the Alienware Aurora R9 handles like a dream. Even though I kept hurling weighty game downloads its way, it still performed admirably while handling other tasks at the same time.",
    "Because of that SSD, it also boots up exceptionally fast. This is a system that'll make light of both day-to-day tasks and more advanced pursuits like video editing.",
    "But what about games? Mileage will vary depending on the Alienware Aurora R9 version you go for, of course, but ours more than held up its end of the bargain when benchmarking and gaming.",
    "For example, it breezed through 1080p tests in 3DMark at an absurdly high frames per second without breaking a sweat. It also performed admirably in 1440p mode. Which isn't to say it's not good at 4K gaming - it is.",
    "Even though it didn't manage quite as well in 4K benchmarks, it was still pretty good nonetheless. That means it's not going to be outdated too soon (and even if you did plump for a less powerful system, there's no reason you can't buy new components to replace them down the line anyway - the R9 can be easily opened up).",
    "It's not going to break a sweat when handling today's biggest games, either. Our version of the R9 made short work of large, complex firefights in The Division 2 at Ultra settings, hitting between 56-60 FPS on average even when multiple foes were on-screen at once.",
    "What's more, Total War: Warhammer 2 battles averaged 50 FPS on max settings during in-game benchmarks, while large scripted battles were utterly gorgeous with realistic rays of light warming elven towers and bouncing off meticulously detailed armor.",
    "The camera was also silky-smooth when zoomed in despite furious melee combat between multiple units, and I never even needed to turn on the R9's overclocking at any point. And even if we had, the R9's overclocking systems are easy to customise, monitor, and tweak.",
    "This is the first time you'll start noticing those fans, by the way; engage overclocking and you'll be greeted by something of a ruckus at the front end of the unit. It's far from an offensive volume, though, and it's easy to ignore.",
    "Because overclocking is handled via the comprehensive Alienware Command Centre, we can forgive a lot as well - it's an attractive, approachable piece of software with the usual customisation options (including peripherals and RGB) that isn't nearly as intimidating as other overclocking software we've tried in the past.",
    "Indeed, the only issue we had with the Alienware Command Centre as a whole was a slight technical hiccup after reinstallation where certain options wouldn't activate, but that's easily fixed.",
    "So, is the Alienware Aurora R9 a worthy addition to the line? From what we've seen, absolutely. That distinctive case is a bold new chapter in the Aurora playbook, crammed with features and clever, practical flourishes like the scooped out vents at the front.",
    "There's also a tremendous amount of variety in the available builds, so you can pick up a version to suit your individual needs. Alright, so those models veer on the pricey side. But, as is clear from that thoughtful design, the Alienware Aurora R9 works hard to earn its price tag. This is a premium device, and it feels like one."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "13": "Features",
    "18": "Performance",
    "29": "Verdict"
  },
  "links": {
    "best gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Aurora R8": "https://www.techradar.com/reviews/alienware-aurora-r8",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}