{
  "source": "https://www.techradar.com/reviews/marshall-monitor-ii-anc-review",
  "title": "Marshall Monitor II ANC review",
  "category": "audio-visual",
  "updated": "2020-03-05T18:38:31Z",
  "author": "olivia-tambini",
  "summary": "The best Marshall headphones yet",
  "verdict": "If you want a rocking alternative to the Sony WH-1000XM3, the Marshall Monitor II ANCs are a great option. They sound great, come with good noise cancelation, and they boast tons of cool rock heritage – it’s just a shame that Marshall couldn't undercut Sony by a little bit more to provide a truly cheaper alternative.",
  "pros": [
    "Great sound",
    "Good noise cancelation",
    "Customizable EQ settings",
    "Comfortable, cool design"
  ],
  "cons": [
    "Soundstage could be wider",
    "Better-sounding competition",
    "Expensive"
  ],
  "article": [
    "Marshall may be best known for its iconic guitar amplifiers, but it’s a growing name in the world of headphones, too – particularly for those who don’t want to sacrifice modern conveniences like wireless connectivity and noise cancellation for retro-cool looks.",
    "The brand’s latest noise-cancelling headphones, the Marshall Monitor II ANCs, bring these worlds together in a neat over-ear package, in an update to its first-ever wireless headphones, which launched in 2017.",
    "Having spent some time getting to know them, we think the Marshall Monitor II ANC’s decent noise cancelation, impressive audio quality, and cool looks mak ke them a worthy alternative to the best noise-cancelling headphones of 2020, the Sony WH-1000XM3.",
    "The Marshall Monitor II ANCs are available to preorder now from the Marshall website, but won’t actually start shipping until March 17.",
    "At $319 / £269 (roughly AU$475), they're about $30 / £30 cheaper than our current favorite noise-cancelling headphones, the Sony WH-1000XM3, although they’re significantly more expensive than Marshall’s most recent on-ear headphones, the Major III Voice.",
    "The new over-ear headphones look very similar to their predecessors, the Marshall Monitor Bluetooth, with oval-shaped earcups and a leather-effect finish that harks back to Marshall’s renowned guitar amplifiers.",
    "Like Marshall’s previous headphones, the Monitor II ANCs are designed for those who want to wear the brand with pride, with the Marshall logo embossed in white script on the outer housing of each ear cup.",
    "On the right earcup you’ll find a golden control knob, which allows you to play, pause, shuffle, and adjust the volume of your music, as well as turn the Major III Voice on and off.",
    "This multi-functional button can also be used to answer, reject and end calls. We love how this small accent of gold contrasts with the utilitarian leather-look housings and exposed coiled cords, adding a touch of rock n roll elegance to the headphones.",
    "Just above this, there’s the ‘M’ button, which lets you switch between equalizer presets (more on these later), or summon Google Assistant on your device.",
    "On the left earcup, there’s an ‘ANC’ button that lets you toggle between regular active noise-cancelling, 'Monitoring Mode', and turning it off altogether. At the bottom of this earcup is a 3.5mm audio port should you want to listen with the included coiled wire, as well as a USB-C charging port.",
    "The Marshall Monitor II ANCs are fully collapsible, with a super-flexible headband that can withstand a little twisting if you want to pack them away. For extra peace of mind, they come with a denim carrying pouch; it won’t offer the protection of a hard case but it should save your cans from scratches, and it looks really cool, too.",
    "We found the Marshall Monitor II ANCs to be really comfortable, thanks to their soft ear cups and well-padded headband; they’re not too heavy and don’t clamp around your ears too tightly, like some of Marshall’s on-ear headphones.",
    "Like their predecessors, the Marshall Monitor II ANCs come with a 30-hour battery life, matching that of the Sony WH-1000XM3 and easily surpassing the Bose Noise Cancelling Headphones 700.",
    "That's with noise cancellation switched on, too – turn it off and Marshall says you'll get 45 hours of wireless playback.",
    "A 15-minute charge is enough to get you five hours of playback, while charging the battery to full power will take you about two hours.",
    "Pairing the headphones with our smartphone was seamless, thanks to their support for Bluetooth 5.0. We didn’t experience any annoying dropouts, though we did struggle to connect to our laptop in a very high traffic area – that’s not an issue unique to Marshall’s headphones, though.",
    "The Monitor II ANCs work with the Marshall Bluetooth app, which allows you to toggle through the different noise cancellation settings and try out different EQ presets (more on those later).",
    "The noise cancelation on offer here isn’t the best we’ve ever experienced, but it’s still pretty good. You’ll find that most background white noise is removed, like wind or the sound of a vacuum cleaner, but you might still be able to hear loud conversations in your immediate vicinity.",
    "Using the Marshall app, you can adjust the level of noise cancelling, as well as the transparency level (how much noise you allow to enter through the earcups), using sliders that go from 0 to 100%.",
    "This is a feature we really appreciated, as it gives you more control than what you’re afforded by the on-off button on the headphones themselves, without lumbering them with lots of hard-to-remember controls.",
    "Another way that the Marshall Monitor II ANCs can be customized is through the equalizer settings in the Marshall app. When you open up the equalizer you’ll find it’s pre-set to “the original Marshall sound”, which offers a balanced sound, with relative equity across the low, mid, and high frequencies.",
    "The app offers a number of presets based on musical genres, including Rock, Metal, Pop, Hip-Hop, Electronic, and Jazz, as well as Flat, which offers a totally flat frequency balance (as you may have guessed). We don’t hear a huge amount of difference between the latter and the Marshall preset, aside from a little more emphasis on the mid-range perhaps.",
    "You can also create a custom EQ setting by adjusting the sliders of a number of frequencies, ranging from 160 Hz to 6.25 kHz. If you don’t want to dive into the app, you can switch between three different presets by tapping the ‘M’ button on the headphones.",
    "It’s clear that Marshall has taken a lot of care in achieving a well-balanced sound with the Monitor II ANCs, and they’re certainly the best-sounding Marshall headphones to date. In Fleet Foxes’ Meadowlarks, gently-plucked guitar has plenty of detail, while sumptuously smooth folk vocals erupt into dissonant harmony.",
    "Harmonized vocals are just as impressive in Everything Everything’s Desire, in which pounding drums, cascading guitar riffs, and fuzzy synths obfuscate the melody; in spite of the chaos, the Marshall’s handle the track with ease.",
    "To put the bass to the test, we put on Billie Eilish’s bury a friend; the low frequencies felt controlled, even if they were thumpy enough to feel in our chest, while sub-bass drones had a suitable wobble to them without overpowering the other frequencies. Meanwhile background noise like chattering voices, screaming synths, and the trill of fingernails on glass came through with clarity.",
    "We couldn’t test a pair of Marshall headphones without treating them to some classic rock. We stuck on The Doors’ Touch Me, and while the top-end of those trumpets was bordering on harsh, the rest of the instrumentation sounded lush and rich – particularly Jim Morrssion’s dulcet vocals and the gorgeous orchestral flourishes that sweep through the chorus.",
    "We’d have liked the soundstage to feel wider – they don’t exactly feel closed off, but some tracks demand more space to let the instrumentation ‘breathe’. All in all, though, the Marshall Monitor II ANCs make a very enjoyable listen.",
    "The Marshall Monitor II ANC are undoubtedly the brand’s best headphones yet; the audio quality on offer here far surpasses any of its previous models, with a balanced presentation, smooth mids, and a generally powerful, rock-ready sound.",
    "They feel comfortable, and look more subdued than Marshall’s on-ear headphones, but don’t sacrifice that cool rock heritage.",
    "That, alongside their good noise cancellation, easy controls and accompanying app, makes the Marshall Monitor II ANCs a compelling alternative to the Sony WH-1000XM3 – it’s just a shame that Marshall couldn’t bring the price down to under $300 / £250 to offer a genuinely cheaper solution. We don’t think they win out in terms of audio fidelity or noise cancellation either, but there’s plenty to love about these rocking over-ears."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "13": "Battery life and connectivity",
    "18": "Noise cancelation",
    "21": "Audio quality",
    "29": "Final verdict"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "first-ever wireless headphones": "https://www.techradar.com/reviews/marshall-monitor-bluetooth",
    "on-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-on-ear-headphones-1304537",
    "Major III Voice": "https://www.techradar.com/reviews/marshall-major-iii-voice",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "smartphone": "https://www.techradar.com/news/best-phone"
  }
}