{
  "source": "https://www.techradar.com/reviews/greenway-health",
  "title": "Greenway Health review",
  "category": "computing",
  "updated": "2020-03-19T18:00:38Z",
  "author": "jonas-p-demuro",
  "summary": "Making possibilities for your practice",
  "verdict": "Greenway Health provides a robust solution for medical practice management.",
  "pros": [
    "Multiple support options",
    "Robust analytics",
    "Powerful scheduling functions"
  ],
  "cons": [
    "Opaque pricing",
    "Limited support hours",
    "No free trial"
  ],
  "article": [
    "Greenway Health is a US based company with multiple locations, led by its CEO, Richard Atkin. This company has grown from what started as Medical Manager, to a privately owned vendor of health information technology, including an integrated electronic health record, revenue cycle management solution, and practice management.",
    "Greenway Health’s Medical Practice Management Software is designed to reduce the burden of running a practice, while simplifying and automating the complex tasks.",
    "It starts with tools to enhance patient information management. For example, entering patient information can be time consuming for the front office staff that need to enter demographic and insurance information. Greenway Health has this covered with useful tools such as duplex scanning of insurance cards making traditional photocopying the front and back of the card, a thing of the past. Furthermore, there is image import for both photo ID and insurance cards. These cards can then get stored in card tabs to keep them organized in the software. Finally, as these cards expire, there is ‘Deactivated check-in’ for patients that are no longer current to remind office staff to get the patient credentials up to date.",
    "Billing also gets taken care of via Greenway’s automated approach. The features include centralized billing, searchable worklists, and the automated allocation of guarantor unapplied credit. Another useful feature is ad-hoc financial reporting capabilities to create financial reports as needed.",
    "Office efficiency is another target for Greenway Health, which has capabilities any busy clinician and front end staff will expect, such as electronic prescribing. There is also an emphasis on usability, with less mouse clicks to get the job done. Scheduling is designed to be simplified, to streamline processes, while still being able to handle the complexities encountered in a modern practice, such as scheduling appointments at more than one location. Also be assured that this product meets the criteria for the complex world of healthcare regulation, including HIPAA, is 2015 ONC Health IT-certified, and has functions to comply with the Electronic Prescribing of Controlled Substances (EPCS).",
    "Practice Analytics are also integrated into the Greenway health solution. Tracking a practice’s performance with value based care performance is critical, so the inclusion of dashboards is a welcome addition. Reports are quite robust, and can be generated by the group, or by EHR based measures. Data can be analyzed, with a focus on either saving costs or time. Financial analytics can be studied, with customization of fields so data can be displayed and analyzed at whatever level desired. The care can also be analyzed, to look for any gaps in care through a variety of metrics, including by the diagnosis, vital signs, laboratory test results, visits, or risk level. This solution is so flexible, that just about any data can be analyzed, no matter how obscure, or non-standard the measure.",
    "For starters, the interface is criticized as being too simplified, and with the comprehensive information presented, there is a bit of a learning curve to get up and running with it.",
    "Users criticize the integrated reports, both for the lack of more reports being available, and also some lower level users not being to run these reports. Another user also brings up that vaccines are not well done, with the important aspect of easily being able to see what each patient is due for on their next visit. Still other users complain of difficulties when getting up and running with the system, as even after watching the onboarding videos, the practice encountered trouble in using the product effectively.",
    "Support from Greenway Health is available via a variety of methods. The first is via telephone, via a toll free number. The second method is the My Greenway online support portal, where a trouble ticket can be created. The third method is via online chat, and when we tried this midday, we received answers to our queries in under a minute.",
    "While we appreciate that at least there are some options offered, be aware that there is no provision made for a direct email exchange, as the company indicates this is due to security concerns, and we will agree that email is not HIPAA compliant. Also, the hours of operation are restricted to 8 am to 5 pm EST.",
    "Education for staff on Greenway Health is better than most, with a variety of media available, including e-books, webinars, and podcasts on a variety of relevant topics.",
    "The pricing for Greenway Health is completely opaque, and requires company contact. While pricing a software solution for each practice is complex, we do wish that Greenway did provide some idea of the pricing on their website.",
    "Elsewhere, we found a price of $799 (£612) per month for each practitioner, which includes both the EHR with a secure patient portal, and the practice management component, making this a higher cost solution. Annoyingly, additional, but likely necessary, components are extra cost options, such as e-prescribing and online lab test ordering for $49 (£38) monthly per provider, and electronic claims submission for $93 (£71) per month for each provider. As it is hard to run a practice without the ability to e-prescribe and bill these days, we would prefer these to be integrated into the base price.",
    "Greenway Health should be on your short list when looking for a program for medical practice management. The high points to note include the powerful and flexible analytics, the choice of options to receive support including a toll free number, and the available ebooks and online webinars for education. The lows are notable for the limited hours of support, the opaque pricing with a higher price and a separate charge to e-prescribe, and the difficulties some users report in getting started. Overall, Greenway Health deserves its reputation as a venerable provider in the medical practice management space."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "8": "Support",
    "11": "Pricing",
    "13": "Final verdict"
  },
  "links": {
    "Greenway Health": "https://www.greenwayhealth.com/solutions/medical-practice-management-software",
    "practice management": "https://www.techradar.com/best/best-practice-management-software",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}