{
  "source": "https://www.techradar.com/reviews/webflow-website-builder",
  "title": "Webflow website builder review",
  "category": "computing",
  "updated": "2020-11-18T09:41:21Z",
  "author": "chyelle-dvorak",
  "summary": "Webflow offers hundreds of templates that you can easily browse by category",
  "verdict": "Webflow is a great website builder for people who want to learn. There are dozens of crash course videos on how to use Webflow for free in Webflow University. This website builder offers the most help to anyone looking to share their ideas online.",
  "pros": [
    "Crash course videos",
    "Unlimited-time free option",
    "Organized interface",
    "SSL Certificate included"
  ],
  "cons": [
    "Can’t transfer existing code",
    "Can’t export CMS content"
  ],
  "article": [
    "Webflow is one of the best website builder platforms for anyone who loves to learn. Instead of figuring out everything on your own, you can utilize the Webflow University with dozens of crash course videos. Now you can learn how to build a professional website and easily browse hundreds of free templates.",
    "Webflow even has a feature for building your own templates. It’s excellent for creative website builders who want more freedom in how they design their pages. It’s really easy to glance through the free templates on the Webflow website to get a feel for the designs. The great thing is you can use Webflow for free for an unlimited time. This is not super common among other web hosting companies.",
    "When you start using Webflow, you’ll have the option to choose between site plans and account plans. Site plans are for personal websites, blogs, and small businesses. With site plans you’ll have easy access to ecommerce and all plans come with an SSL Certificate. Account plans are more for designers, or anyone who wants to set up a portfolio and includes a free option.",
    "The Starter plan is free and includes everything you need to try Webflow. There’s no credit card required for setup and you can use it for an unlimited time. It includes access to over one hundred templates, up to two projects (websites), and includes an option to bill clients.",
    "The Lite plan costs $16.00 per month when you pay annually or $24.00 billed monthly. You can start up to 10 projects with up to 100 static pages and 50 CMS items. This plan includes an option to export your code to other members on your team. However, you cannot export CMS content.",
    "The Pro plan costs $35.00 per month when paid annually. It includes everything in the Lite plan, plus the option to remove Webflow branding from emails and other parts of your website. You’ll have extra security with the “site password” feature - it allows you to set a password for editing your website when you’re in the middle of working on it (and other team members have access).",
    "There are two team plans available to make it easier to collaborate on larger projects. The first is called the Team plan. It costs $35.00 per person for each month when paying annually. You need to have a minimum of two people in order to use this plan. It includes all the features from the Pro plan.",
    "The Enterprise plan is a collaborative package that includes all of the features in the Team plan. It’s more flexible than the other plans listed above. All you need to do is contact Webflow for custom pricing.",
    "The interface is very easy to navigate - you can access all of the free templates and start using them right away. It’s also easy to find any of the website building tools and features. Everything on Webflow is very well-organized. For example, if you’re looking at templates and want something for a photography portfolio, all you need to do is select free templates and then start searching by category, the style you want, or by features. Tons of examples will show up for you to look through. The organization and free easy access makes finding a template quick and easy.",
    "The best feature is the Webflow University 101 Crash Course videos. The videos are designed to teach you how to use Webflow and give you all the tricks to make website building a smooth process. The videos are organized into different lesson categories, and most of them range from 5 to 15 minutes in length. Anyone can enrol in Webflow University for free and access all of the videos. Even if you’re using the Webflow free version or just want to learn more about building a website, these videos are a great resource.",
    "Wix, Weebly, and Squarespace, are just a few of the top competitors to Webflow. Wix does offer a free trial for an unlimited time, however, it doesn’t even compare to Webflow’s free storage space - Wix includes 50 MB while Webflow offers 10 GB. Also, not many web hosts offer free videos to help you get started. Overall, Webflow does a great job against giant competitors such as Wix and Squarespace.",
    "No matter what stage you’re at with building a website, there’s a lot of options on Webflow that could take your website to the next level. The downside is how you can’t export CMS content, however, you will have access to plenty of free materials. Webflow comes with an entire library of video resources, hundreds of free templates, and you can use the free version for an unlimited time. The interface is also very organized - it doesn’t feel like you’re using a cheap web host. Templates look professional and everything is well organized. Overall, Webflow is a great web host, especially if you want to learn new tricks for making website building a lot easier.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "8": "Interface",
    "9": "Features",
    "10": "The competition",
    "11": "Final thoughts"
  },
  "links": {
    "Webflow": "https://webflow.com/",
    "best website builder": "https://www.techradar.com/news/the-best-website-builder",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "site plans": "https://webflow.com/pricing#site",
    "account plans": "https://webflow.com/pricing#account",
    "Starter plan": "https://webflow.com/pricing",
    "Lite plan": "https://webflow.com/pricing#account",
    "Pro plan": "https://webflow.com/pricing#account",
    "Team plan": "https://webflow.com/pricing#account",
    "Enterprise plan": "https://webflow.com/pricing#account",
    "free templates": "https://webflow.com/templates/free-website-templates",
    "Webflow University 101 Crash Course videos": "https://university.webflow.com/courses/webflow-101-crash-course",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Weebly": "https://www.techradar.com/reviews/weebly",
    "Squarespace": "https://www.techradar.com/reviews/squarespace"
  }
}