{
  "source": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
  "title": "Google Pixel 4a 5G review",
  "category": "phones",
  "updated": "2021-11-30T20:56:53Z",
  "author": "tom-bedford",
  "summary": "The middle child",
  "verdict": "It’s hard to get too excited about the Pixel 5’s cheaper sibling – or the Pixel 4a’s gangly cousin, depending on how you look at it. The Pixel 4a 5G has as many weaknesses as it does strengths: the phone’s slow performance detracts from the clean Android build, and the admirable battery life doesn’t cause you to forget that Google is losing its camera edge. For its price the Pixel 4a 5G is decidedly ‘fine’, but competing devices are far more exciting.",
  "pros": [
    "Clean Android experience",
    "3.5mm headphone jack",
    "Good battery for a Pixel phone"
  ],
  "cons": [
    "Slow performance",
    "Hit-and-miss camera experience",
    "Cheap-feeling"
  ],
  "article": [
    "The Google Pixel 4a 5G is essentially a ‘lite’ version of the Pixel 5, as it has much more in common with the company’s newest flagship than the affordable Pixel 4a that it’s purportedly related to.",
    "The Pixel 4a 5G and Pixel 5 have the same rear cameras, chipset, connectivity specs and appearance – in fact, there are very few differences between the two phones, while the Pixel 4a is different in almost all those respects.",
    "We have no idea why Google is mixing up its naming conventions like this, so our only recourse is to roll our eyes, sigh, and say “Oh Google”, in the tone of voice you’d use to gently admonish a misbehaving pet. We found it much easier to review this product when we forgot about the Pixel 4a, but it’s perhaps most accurately described as the awkward middle child of Google’s 2020 phone lineup.",
    "The Pixel 4a is a little uninspiring as smartphones go. There are no particular features or selling points that are particularly exciting here, at least none that we haven’t seen before, but equally there are no glaring flaws that might seriously put you off buying the phone.",
    "The camera performance was a little weak in our experience – pictures we took looked a little dim and dull, and specific modes didn’t always work as intended. We can’t help but feel that Google is losing its edge in the smartphone photography arena compared to some rivals.",
    "Talking of ‘dull’, the Pixel 4a 5G doesn’t bring anything new to the party in terms of design, with a plastic back, rear-mounted fingerprint sensor, and a ‘punch-hole’ cut-out in the screen, which it feels like we’ve seen in every single phone this year (though that might be a slight exaggeration).",
    "Perhaps our biggest issue with the phone, though, was its poor performance in general – it stuttered occasionally during use and wasn’t great for gaming, returning one of the lowest benchmark tests we’ve seen for a phone at its price point.",
    "The Google Pixel 4a 5G isn’t terrible: you get a nice, clean Android experience, with the stock operating system looking and running just as Google intended. The battery life is also impressive for a Pixel phone, as previous members of the family have struggled to last for a full day of use. There’s also a 3.5mm headphone jack, which you don’t see in too many mid-range or top-end smartphones these days.",
    "Despite this being an ‘a’ phone from Google, which is supposed to signify affordability, this certainly isn’t what we’d call a ‘cheap’ 5G phone – you can pick up handsets with next-gen connectivity for a lot cheaper in many markets.",
    "Overall then, the Pixel 4a 5G is a fine but unexciting mid-range phone – if you’re looking for a mid-range 5G phone from a proven brand, it could be a solid pick, but keep your expectations in check.",
    "The Google Pixel 4a 5G price is $499 / £499 / AU$799, for 6GB RAM and 128GB storage, so it’s a little too pricey to compete in the ‘cheap 5G phones’ category, although it’s more affordable than some other 5G phones on the market.",
    "For comparison the Google Pixel 4a costs $349 / £349 / AU$599, while the new Pixel 5 is $699 / £599 / AU$999, so the 4a 5G sits roughly between those devices in terms of price.",
    "The official Google Pixel 4a 5G release date was October 15 2020, although pre-orders started when the phone was announced on September 30, and lots of retailers announced their contract pricing then.",
    "The Google Pixel 4a 5G won’t win any awards for good looks, although it does bring back some features of older Pixel phones that we missed.",
    "The phone has a plastic back and sides, but these surfaces are textured, so the handset doesn’t feel cheap in the hand as many plastic phones do. It’s not quite the aluminum of the Pixel 5 though, or the glass of many more premium phones.",
    "The rear of the phone houses a fingerprint sensor, which isn’t too high up, so we found it easy to reach. This placement was popular in earlier Pixel phones, but it does make it impossible to unlock your phone while it’s face-up on a surface without picking it up, which some will see as an inconvenience. Overall though, we’re a fan of it here, especially since the Pixel 4 ditched the scanner in an attempt to make facial recognition its sole mode of unlocking (which few.",
    "Talking of previous Pixel handsets, as with the Pixel 4a and 5 there’s no Active Edge here, which is a shame, since that was one of the best features of earlier models. This let you squeeze the phone to summon Google Assistant, or mute incoming calls, notifications and alarms.",
    "On the rear of the phone there’s a camera bump at the top-left, which isn’t too prominent, so you won’t see that annoying ‘rocking’ when you lay the phone flat on a desk. It’s a square block, which will be familiar to people who’ve seen a Pixel phone since the 4.",
    "On the right edge of the phone are the power button and volume rocker, while the top edge houses the 3.5mm headphone jack, and there’s a USB-C port in the usual position on the bottom edge. Some people don’t like this placement of the headphone jack, as if you’ve got headphones plugged in at the same time as a charging cable your phone will be sprouting wires from both ends, potentially making it unwieldy.",
    "At 168g the Pixel 4a 5G is pretty lightweight, but it’s actually heavier than the Pixel 5 (151g) and Pixel 4a (143g), although the difference isn’t huge. The Pixel 4a 5G is bigger than its Pixel contemporaries, and we found it a little harder to use one-handed as a result, although you shouldn’t find it a problem if you have larger hands.",
    "Save for the Pixel 5, the 4a 5G is also the smallest 5G phone on the market as of its release, though with the imminent launch of the iPhone 12 mini Google won’t hold that title long.",
    "The Google Pixel 4a 5G’s two big differences from the Pixel 5 are in the screen department: its display is 6.2 inches across, a touch bigger than the 6-inch Pixel 5, and it only has a ‘standard’ 60Hz refresh rate, not 90Hz like the Pixel 5.",
    "Higher screen refresh rates make motion look smoother, improving the experience when you’re scrolling through your phone or watching content, and while all phones used to be 60Hz, many are now coming with 90Hz or 120Hz displays, with some even going up to 144Hz. Given that plenty of phones at and below the Pixel 4a 5G’s price point have 90Hz or 120Hz displays, don’t pick up this phone if refresh rate is a consideration for you.",
    "The display resolution is 1080 x 2340, which is fairly standard, although since the screen is smaller than on many other phones the pixel-per-inch count is fairly high. The display uses OLED tech, as Google tends to use for its phones, and as a result colors look vibrant, with good color accuracy and contrast, although we found the max brightness a little low.",
    "As on other Pixel phones there’s an always-on display which you can activate, and this is useful for displaying notifications and telling you what song is playing, among other things, though it does take a toll on the battery life.",
    "The Google Pixel 4a 5G has the same two rear cameras as the Pixel 5: a 12.2MP f/1.7 main camera with optical image stabilization, and a 16MP shooter with an ultra-wide f/2.2 lens. Pixel phones have typically held high spots in our list of the best camera phones, but we didn’t find ourselves particularly blown away by the Pixel 4a 5G’s performance – as with most other things on this phone, it’s not bad, but not incredible either.",
    "Pictures we took seemed a little desaturated and dim compared to those from other Pixel phones we’ve tested, and even though the quality and depth was there, we had to import photos into editing apps to make them look great. Google’s real strength cameras-wise lies in its software, so the lack of effective AI optimization here is hard to fathom.",
    "In low-light settings there’s a fair amount of noise – a finding backed up by our Pixel 5 review, which found the same thing – especially for ultra-wide snaps. Night Sight mode sometimes made a modest improvement to dark pictures, but other times had little impact.",
    "A particular issue was with key shooting modes. Portrait mode added nice background blur effects to some snaps, but at other times it just didn’t seem to pick up the subject. In addition it didn’t seem to tweak shadows or highlights much, making portrait snaps look a little flat compared to the same shot taken with a different phone.",
    "There isn’t much of a selection of shooting modes here either, beyond the standards you get on most devices, like Portrait, Night Sight and Panorama, so you’ll likely want to steer clear of the Pixel 4a 5G if you’re someone who likes to get creative with their smartphone photography.",
    "We did manage to take some fairly good-looking photos, so we’re not going to give the Pixel 4a 5G entirely bad marks in the camera department, but there are plenty of same-price smartphones on the market that perform much better.",
    "The front-facing camera is 8MP and f/2.0, and that’s pretty low-res for such a camera. Selfies looked a little better than pictures taken with the main camera, with more vibrancy, but due to the relatively low resolution, these snaps will only really be suitable for social media. We found Portrait mode on this camera sometimes had trouble distinguishing our face from backgrounds too.",
    "In terms of video recording there’s 1080p or 4K at 30fps or 60fps, and there are slow-mo and timelapse options as well, so you’ll get some versatility in terms of how you shoot. Videos actually seemed to look better than photos, with scenes appearing brighter with better contrast.",
    "The Google Pixel 4a 5G uses the same Snapdragon 765G chipset as the Pixel 5, and it’s one of the better mid-range mobile processors used in phones right now.",
    "The phone performed pretty poorly in our general testing, however, and we wouldn’t recommend it if you’re in need of a powerful smartphone. When we put the handset through the Geekbench 5 benchmark test, it returned a surprisingly low score of 1,565, one of the lowest scores we’ve seen since this newest version of Geekbench launched at the end of 2019.",
    "For context, top-end phones usually get scores of just over 3,000, while other Snapdragon 765 handsets hover around 1,800. The Pixel 4a 5G scored even worse than the MediaTek Helio G95-powered Realme 7 (1,625), and the Oppo Reno 2 (1,739), which packs the Snapdragon 730.",
    "As you’d imagine given such a low score, we had some performance issues with the phone, the most annoying of which we experienced when simply navigating the UI, as we encountered frequent stutters or slow loads when swiping between menus and through social media. We never found it too unresponsive, but it certainly feels like performance could be better optimized.",
    "The phone handled most games just fine, but when we started playing more intensive and demanding titles we encountered slow loading and occasional stuttering. This isn’t a phone for avid mobile gamers.",
    "Finally, let’s consider the Pixel 4a 5G speakers – or, rather, let’s buy some true wireless headphones instead, because the loudspeakers aren’t great. When playing music there was noticeable distortion, even at low volumes, while high pitches seemed compressed and bass was nonexistent.",
    "The Google Pixel 4a 5G runs Android 11 – along with the Pixel 5, this is the first phone you can buy with Google’s newest operating system pre-installed.",
    "Android 11 isn’t the most feature-laden update Google has put out, but there are a few improvements, like easy access to your Google Pay card and smart home settings, built-in screen recording, and improved typing and app prediction (whereby the phone recommends you apps based on your habits, your location, the time of day etc).",
    "This is ‘stock’ Android, as Google intended it, so it’s a clean experience with no bloatware or divisive design choices. Google typically brings new builds of Android to its own phones first, so if you buy the Pixel 4a 5G you’re likely to be first in line for Android 12.",
    "Lots of people prefer stock Android to the custom builds many smartphone manufacturers use; if you’re one of them, and if it’s a big enough selling point to get you to influence your choice of handset, then maybe the Pixel is for you.",
    "The battery here is 3,885mAh – that’s a little on the small side for a phone, and it’s enough to raise some red flags given Google’s iffy track record when it comes to battery life in its phones – however, we found the Google Pixel 4a 5G battery life to be admirable.",
    "With medium and even heavy use the phone always lasted a full day without running out of charge; sure, if we went out of our way to drain the battery, we could (4K video recording can topple even the mightiest of phone batteries) but in regular use it was just fine.",
    "So unless you’re an avid video-recorder, mobile gamer or photo-taker, you’ll find the Pixel 4a 5G battery life is pretty good – it’s likely that Google has deployed some canny software optimization to achieve this.",
    "We weren’t as impressed with the charging, though – there’s no wireless powering, and only 18W wired charging which, in 2020, is towards the slow end of the spectrum.",
    "Since the battery capacity isn’t huge it doesn’t take an inordinately long time to power the phone up, but it does take over an hour to go from zero to full, which some may find bordering on ‘too long’."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Google Pixel 4a 5G price and availability",
    "13": "Design",
    "21": "Display",
    "25": "Camera",
    "33": "Specs and performance",
    "39": "Software",
    "43": "Battery life",
    "48": "Don't buy it if..."
  },
  "links": {
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "5G phone": "https://www.techradar.com/best/best-5g-phones",
    "Google Pixel 4a": "https://www.techradar.com/deals/google-pixel-4a-deals",
    "Realme 7": "https://www.techradar.com/reviews/realme-7-review",
    "Oppo Reno 2": "https://www.techradar.com/reviews/oppo-reno-2"
  }
}