{
  "source": "https://www.techradar.com/reviews/homestead",
  "title": "Homestead website builder review",
  "category": "computing",
  "updated": "2020-12-10T03:35:00Z",
  "author": "mike-williams",
  "summary": "Create a website in three steps",
  "verdict": "Homestead is a website builder that works in three easy steps. First, you can choose a template for your website (there’s hundreds to pick from). Next, you can customize your website by choosing from over 250,000 images or uploading your own. All you need to do then is finish your website and watch it go live.",
  "pros": [
    "Fast and easy to use",
    "Free 30 day trial",
    "Instructions to help you get started"
  ],
  "cons": [
    "High prices",
    "Limited features"
  ],
  "article": [
    "Homestead is a website builder that’s been around for over 20 years. Signing up with Homestead starts by handing over your email address to create an account. The site then asks you to enter your payment details. Homestead offers a 30 day free trial so you can see if it’s the right website builder for you.",
    "After entering our information, Homestead prompted us for the purpose of our website (personal, business), and then asked us to select the plan we wanted to buy. Once you complete this process, you can start by choosing a template and creating your website.",
    "Homestead has three main plans you can choose from on the website. You can try any of these plans free for 30 days, and then you’ll need to either cancel your trial or choose one of the paid plans. All three plans include access to hundreds of templates for you to pick from. Here’s a summary of each plan:",
    "The Starter plan costs $7.99 per month. It comes with 25 MB of storage space, 5 GB of bandwidth per month, and up to five pages. You can build one website with this plan.",
    "The Business plan costs $22.99 per month and comes with 5 GB of storage space, 100 GB per month of bandwidth, up to 100 pages, and up to three websites. For any of the plans, you can purchase additional marketing tools to help boost your site’s SEO.",
    "The Business Plus plan is $62.99 per month. It includes 10 GB of storage, 500 GB of bandwidth per month, unlimited pages and an unlimited number of websites. This plan also includes WebListings (an SEO feature) - in all previous plans you have to purchase this feature as an add-on.",
    "The interface looks a bit out of date compared to other website builders out there. However, it’s still really easy to figure out where everything is and you can quickly look over the plans and pricing. Homestead's setup wizard next allowed us to choose the domain we'd like to use, or select our preferred subdomain (name.homesteadcloud.com.)",
    "We selected the subdomain option, tapped the Save button, and Homestead explained that our site would be activated and ready within minutes. Some web hosts take a while to get things set up, but this wasn't an issue with Homestead, and we were able to log in to our account console almost immediately.",
    "Heading off to the Support area of a hosting company will usually take you to a web knowledge base, but Homestead is a little different. Although there is a collection of articles and tutorials, most of its web-based support happens in the Homestead Community, a simple forum where customers can post their current problems and get a response from official support reps.",
    "Homestead offers a decent selection of more than 200 site templates, which can be filtered by industry or keyword. The templates are displayed via a large thumbnail of the home page, but unfortunately you can't preview the template full-screen before you select it.",
    "Choose a template and it opens an appealing editor. A left-hand sidebar has options to manage pages, add content sections or elements, add a blog, a web store (if your plan supports it) and more, and the toolbar has buttons to undo or redo actions, switch the page between desktop and mobile views, and preview or save your site. If you have any website builder experience, you'll feel at home immediately.",
    "Clicking any element on your template page displays toolbars and dialogs giving you settings to tweak and actions you can apply. Text boxes give you all the usual alignment and formatting options. Image galleries can be reordered and reformatted, and you can variously tweak borders, backgrounds, shadows and opacity for everything else, as well as applying fun animations in very few clicks.",
    "There’s a lot of website builders out there (Odoo, Dreamhost, and Voog, to name a few). So what’s so different about Homestead? Some website builders take more time to learn, while Homestead is very easy to understand (making it a breeze to choose a template and create your own site). On the downside, the most basic plan (the Starter plan) only includes 25 MB of storage which isn’t very much compared to other website builder plans.",
    "Homestead is a decent website builder if you're looking to build a website really quickly. The three-step process makes it easy to build a website, even if it’s your first time. However, the Business plan and the Business Plus plan are pretty pricey when it comes to website building. If you want something less-expensive, there’s definitely cheaper options.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Interface",
    "9": "Features",
    "12": "The competition",
    "13": "Final thoughts"
  },
  "links": {
    "Homestead": "https://www.homestead.com/index.html",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "three main plans": "https://www.homestead.com/pricing.html",
    "Starter plan": "https://www.homestead.com/pricing.html",
    "Business plan": "https://www.homestead.com/pricing.html",
    "Business Plus plan": "https://www.homestead.com/pricing.html",
    "Odoo": "https://www.techradar.com/reviews/odoo-website-builder",
    "Dreamhost": "https://www.techradar.com/reviews/dreamhost-website-builder",
    "Voog": "https://www.techradar.com/reviews/voog"
  }
}