{
  "source": "https://www.techradar.com/reviews/airtv-2",
  "title": "AirTV 2 review",
  "category": "televisions",
  "updated": "2020-01-13T20:15:42.548Z",
  "author": "tyler-hayes",
  "summary": "AirTV 2 sends free local TV channels straight to your phone or tablet... after an arduous setup process",
  "verdict": "AirTV 2 continues to provide a good value for local broadcast channels with no monthly fee however the software needs an overhaul and the setup can be overly complicated and too difficult for some folks.",
  "pros": [
    "OTA Channels on the go",
    "Refined design..."
  ],
  "cons": [
    "Difficult-to-use software",
    "But not a huge upgrade"
  ],
  "article": [
    "As the cost of having multiple streaming services mounts, the free option of using an antenna to get dozens of TV channels for free is looking mighty good. Having access to local channels in your area can provide you with sports, network sitcoms, and national events like The Grammys, all without having to spend a monthly fee.",
    "But what happens if you want to take shows on the go? Well, you could subscribe to YouTube TV — but, if you want to save money in the long run you're better off with the AirTV 2. Not only will an AirTV 2 box with connected antenna get you access to local broadcast channels, but it can put those channels on your phone or tablet, for on-the-go viewing.",
    "Like the original AirTV, the AirTV 2 connects an HD antenna to your home internet connection and lets you watch whatever local channels it finds through the Sling TV apps. While the AirTV 2 is ultimately aimed at complementing the paid Sling TV service with free local channels, you don't need to use it or pay for it to buy and use an AirTV 2.",
    "That said, the AirTV 2 device is an upgrade over the original in a few subtle ways... but it's not clear why the upgrade was needed. Beyond a change in design and it not giving off as much heat, there's no clear reason why the AirTV 2 is replacing the last one. If you're looking for a device to bring local TV channels to your phone or tablet for the first time, the AirTV 2 will suit you fine, but if you already have an AirTV set up and working fine, you shouldn't worry about upgrading.",
    "The biggest difference between the first and second generation AirTV is the design. Instead of remaining low and horizontal — looking like an angled bar of gold — the hardware now sits up vertically. To make up for the increased height, the box is now very thin and carries a matte finish instead of a glossy one.",
    "AirTV 2 looks more modern, mostly because of the matte finish, but it would be a stretch to call it attractive. It's too low-key and bland to really notice, which might sound like a dig, but really, this is a black box that will sit out of sight somewhere and doesn't need to be anything beyond utilitarian in nature.",
    "The front shows status lights for the antenna, internet, and power. The three status lights show up green instead of red like the last AirTV device.",
    "Standing vertical instead of laying horizontal may prevent some issues fitting in entertainment cabinets, but it's a design choice which shouldn't matter to most people. Hopefully it should help most people save a little space with a smaller overall footprint.",
    "On design and price, the AirTV 2 is a clear winner - it's a simple solution that could benefit most people.",
    "The problem with all the AirTV devices, including the new version, is that the software, which is the main point of interaction, feels like it's getting worse. Set up and viewing local channels happens through the SlingTV app, even if you don’t have a subscription to the service. (There’s also an AirTV app which worked for the original device, but doesn’t work with the AirTV 2.)",
    "Having used an AirTV and AirTV Mini and watched Sling TV on and off since it was originally released in 2015, we felt like we were adequately prepared for setup and yet, setting up an AirTV 2 was no easy task. There were connection issues and lots of unresponsive waiting, despite following the on-screening instructions precisely.",
    "And the troubles aren't limited just to the setup, either - the entire software experience feels rough. The software can be slow, buggy, and even superficially, it doesn't look great. Sure, most of what it borrows in this department is borrowed from the higher-reviewed AirTV 1, but it was easier to forgive some of the software's shortcomings because it worked the first time during setup.",
    "The silver lining here is that Sling TV app has added free movies and shows, paid for by the included ads. The additional content compliments free channels from the connected antenna, but what’s available can be a little confusing. Channels you need to pay for still get mixed in and create unnecessary scrolling to get to channels being brought in through your antenna.",
    "This probably goes without saying, but the performance of the AirTV 2 is largely depended on things like antenna direction and external factors such as location and weather. If you live somewhere that doesn't get clear reception, there will be delays in how long it takes to switch from one channel to another, plus sometimes others may not load.",
    "This is where the software could be much better to help the performance — or alleviate confusion between the two. Tapping on a channel that doesn't have enough signal strength takes a while and there a few visual indicators that the app hasn't stopped responding.",
    "The biggest difference between the original AirTV and the AirTV 2 is the heat coming off the hardware. On the first one, it was hot enough that I was concerned about leaving it on all the time. The new device barely got warm. I’m glad this was addressed, whether it was actually a fire risk or not.",
    "But when the reception is good, AirTV 2's performance is good as well.",
    "AirTV 2 connects over your internet to a mobile device, but if you want to watch local channels on your TV set, you’ll need to connect an AirTV Mini to your TV or have another way to get the SlingTV app on that screen.",
    "Performance-wise, SlingTV app is fine and passable, especially when the antenna direction and the location is ideal, it’s just not great or desirable. As of now though it gets hard to separate the antenna performance from the actual AirTV 2 hardware or software performance. That might be by design, but with some tweaks to the interactions people have with the software, like more visual indicators and cues, could make loading and changing channels much more enjoyable.",
    "The AirTV 2 is a bit of a mixed bag. Those looking for a cheap, or one time fee to get a dozen or more channels on your phone or tablet, the AirTV 2 with a long-range antenna is a solid solution. But, if you already have an AirTV or think you'd be easily deterred by the hard-to-setup software, it's probably best to keep looking for other options or subscribe to a live TV streaming service like YouTube TV."
  ],
  "headers": {
    "4": "Design",
    "8": "Setup",
    "13": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "YouTube TV": "https://www.techradar.com/news/youtube-tv-everything-you-need-to-know-about-the-new-tv-streaming-service"
  }
}