{
  "source": "https://www.techradar.com/reviews/huawei-matebook-x-pro-2020",
  "title": "Huawei MateBook X Pro (2020) review",
  "category": "computing",
  "updated": "2020-05-19T11:06:39Z",
  "author": "matt-hanson",
  "summary": "Newly upgraded for 2020",
  "verdict": "The Huawei MateBook X Pro (2020) features upgraded components and a seriously impressive battery life. However, it also comes with an increased price tag, meaning it's not quite the bargain previous versions were.",
  "pros": [
    "Good performance",
    "Excellent battery life",
    "Nice design"
  ],
  "cons": [
    "More expensive than previous models",
    "Not available in many countries",
    "One of its best features is exclusive to Huawei phones"
  ],
  "article": [
    "The Huawei MateBook X Pro (2020) is the latest flagship laptop from the Chinese manufacturer. Previous models of the Huawei MateBook X Pro have impressed us with their premium designs and decent specs, which have come with a price tag that undercuts its closest rivals by quite a bit.",
    "In fact, we’d be more willing to recommend the Huawei MateBook X Pro to more people if it wasn’t for the fact that, depending where you live, getting hold of a unit can be tricky.",
    "While Huawei is a huge brand that’s easy to buy in its native China, the fact that the US government has had a rather well publicized falling out with the company means it's difficult to get hold of a MateBook X Pro in North America.",
    "This is a shame, as the Huawei MateBook X Pro (2020) builds on what made previous MateBook X Pros so good.",
    "So, what’s the price and availability like for the new model? In the UK and Europe, it starts at €1,499 (around £1,300, $1,600, AU$2,500).",
    "This gets you an Intel Core i5-10210U processor, 16GB RAM and 512GB SSD. You can also get a model that adds Nvidia MX250 graphics for €1,699 (around £1,500, $1,900, AU$3,000).",
    "There’s also a high-end model with an Intel Core i7-10510U processor, 16GB RAM, a 1TB SSD and Nvidia MX250 GPU for €1,999 (around £1,800, $2,200, AU$3,5 00).",
    "The Huawei MateBook X Pro is now available in the UK, and is also available in mainland Europe, Asia, Russia, Latin America, Japan and the Middle East. Once again, it seems, US and Australian readers will miss out unless they import a machine, which will add considerably to the price.",
    "With a starting price of €1,499, the Huawei MateBook X Pro (2020) is a pretty expensive laptop. This means Huawei is under pressure to deliver the performance, features and build quality we’ve come to expect, and demand, from laptops at this price point.",
    "It also means the Huawei MateBook X Pro is going up against flagship laptops from well-known and trusted brands like Apple, Dell and HP.",
    "It's also more expensive than the original MateBook X Pro, which launched in 2018 for $1,199 (£1,299, about AU$1,650) for the entry-level model with an 8th-generation Intel Core i5 processor, 8GB of RAM and a 256GB SSD. Of course, the specs are better on the new model, but it also means it’s not quite as much of a bargain as previous models were.",
    "In fact, it’s now more expensive than the cheapest MacBook Pro 13-inch model, which starts at $1,299 / £1,299 / AU$1,999. Again, the MateBook X Pro (2020) wins out on specs – it has a newer 10th generation Intel CPU versus the 8th generation one found in the MacBook Pro 13-inch, and a lot more storage – but rather than the MateBook X Pro being a more affordable alternative to an Apple laptop, we’re in the strange position where the Apple laptop is the more affordable option.",
    "When it comes to design, not much has changed compared to the MateBook X Pros of recent years.",
    "It’s a nice design, to be sure, with a sleek look that feels sturdy when in use, but not heavy or bulky when carried around. With dimensions of 304 x 14.6 x 217mm and a weight of 1.33kg, this is a slightly lighter and more compact laptop than the 13-inch MacBook Pro.",
    "Meanwhile, the screen is a 13.9-inch touchscreen with a rather unusual 3000 x 2000 resolution. This is due to the Huawei MateBook X Pro’s screen having a 3:2 aspect ratio, which leads to a more square-looking screen than the more common widescreen displays, which have a 16:9 aspect ratio. This gives you more vertical space, and in theory should make working on documents a bit easier, as you shouldn’t need to scroll up and down as much.",
    "It’s also the same aspect ratio that many photos are captured at, which along with the high resolution, which makes images on the display look sharp and clear, and support for 100% of the sRGB color gamut for maximum color accuracy, means the Huawei MateBook X Pro should be an excellent laptop for photographers.",
    "However, while the screen would also be good for video editors and 3D animators and modelers, it’s worth noting that the Nvidia MX250 graphics card is an entry-level laptop GPU, and while it’s a step up from integrated graphics, it’s not going to be able to handle intensive graphical tasks – and you can forget about playing all but the most basic of 2D games.",
    "Ports-wise, the Huawei MateBook X Pro (2020) comes with two USB-C ports (which are also used for charging the laptop), along with a standard USB 3.0 port and a 3.5mm audio jack.",
    "We’re quite fond of the mix of old and new USB ports, which means you can make use of improved USB-C speeds and flexibility, while also plugging in older peripherals without the need for an adapter.",
    "The keyboard hasn’t been changed since the last model, and that’s no bad thing. It’s roomy and responsive, and takes more than its fair share of design cues from the keyboards found on MacBooks. It’s pretty much identical to the keyboard found on the much cheaper Huawei MateBook D 15.",
    "As before, the 1MP webcam built into a recess in the keyboard. A press of a key pops up the webcam, and it’s a feature that will likely divide opinion. On the one hand, it’s a handy way of ensuring that your webcam is turned off and inaccessible when not in use, and has allowed Huawei to make the bezels that surround the screen impressively thin.",
    "On the other hand, however, it means the webcam is angled upwards towards you when you're using it, something many people won’t like as it can create an unflattering perspective when you're on a video call.",
    "There’s also a fingerprint scanner built into the power button, and this does a good job of reading your fingerprint and logging you into Windows 10 fairly seamlessly.",
    "One noticeable change design-wise the introduction of a new color: Emerald Green. We’ve not had a chance to see what the new color looks like in the flesh, so to speak – the unit we were sent for review came in the attractive Space Gray finish – but a green laptop might not be to everyone’s tastes.",
    "When it comes to performance, the Huawei MateBook X Pro (2020) handles day-to-day tasks well, and the upgrade from 8th-gen Intel processors to 10th-generation is a welcome one. With a quad-core Intel Core i5 chip and 8GB of RAM, along with a solid state drive, it’s not surprising to find that Windows 10 feels fast and responsive.",
    "The MateBook X Pro runs most apps with ease, and manages multi-tasking well too; however, as we mentioned earlier, the MX250 GPU won’t be able to handle super-intensive tasks.",
    "As for the screen, it’s sharp and vibrant, although the unusual aspect ratio means there’s a lot of black bar at the top and bottom of the display if you watch widescreen movies or TV shows.",
    "When it comes to battery life the Huawei MateBook X Pro (2020) also performs well, making it to almost eight hours in our battery life test, for which we play a 1080p video on loop. This is a very respectable showing, and it means you can comfortably get through a work or school day without having to worry about charging.",
    "Meanwhile, in the PCMark 10 battery benchmark, which simulates typical high-intensity workloads, including web browsing and video calls, the MateBook X Pro also achieved impressive results, lasting 10 hours and 20 minutes.",
    "Overall, the Huawei MateBook X Pro (2020) is a refined update of the company’s flagship, offering performance improvements thanks to some modern components, and its battery life is excellent.",
    "However, this does mean it comes with a higher price tag, so it’s not quite the bargain it once was, and means it’s up against the likes of the Dell XPS 13 and HP Spectre x360, which manage to do everything just a little bit better for a similar price."
  ],
  "headers": {
    "5": "Price, availability and spec",
    "12": "Design",
    "24": "Performance",
    "31": "Don't buy it if..."
  },
  "links": {
    "a rather well publicized falling out": "https://www.techradar.com/news/huawei-ban",
    "original MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro",
    "MacBook Pro 13-inch": "https://www.techradar.com/reviews/macbook-pro-13-inch-2019",
    "Huawei MateBook D 15": "https://www.techradar.com/reviews/huawei-matebook-d-15-2020",
    "HP Spectre x360": "https://www.techradar.com/reviews/hp-spectre-x360-2020"
  }
}