{
  "source": "https://www.techradar.com/reviews/vivo-y20s",
  "title": "Vivo Y20s review",
  "category": "phones",
  "updated": "2020-12-17T17:30:24Z",
  "author": "tom-bedford",
  "summary": "Affordable and reliable",
  "verdict": "The Vivo Y20s is a dependable phone that runs pretty well considering its price. Though it’s slow at times, it was no worse than its same-price rivals, and excelled in terms of battery life. We particularly appreciate the design, as it has an easy-to-reach side fingerprint scanner and a sturdy plastic back that feels good to hold. The use of a micro USB slot could alienate some potential buyers, though, and there are no real stand-out features here.",
  "pros": [
    "Handy fingerprint sensor",
    "Low price",
    "Great battery life"
  ],
  "cons": [
    "Felt slow at times",
    "Micro USB port",
    "Two redundant rear cameras"
  ],
  "article": [
    "Vivo started selling its phones in the UK in late 2020, and alongside the Vivo Y70 and Vivo X51 5G came the Vivo Y20s, the brand’s attempt to get into the ‘cheap phone’ market with a super-low-price device.",
    "The Vivo Y20s costs just £149 / AU$297 (around $200), so it’s designed to pose some serious competition to similarly priced phones from Motorola, Xiaomi Redmi, and Nokia, the triumvirate which currently rules the ‘affordable phone’ lands.",
    "For the most part, the Vivo Y20s does a good job proving itself in the unforgiving affordable-phone arena; it’s a dependable all-rounder that’s fit for purpose on all fronts.",
    "The phone runs a little slow at times, but never more than most similarly priced phones, likewise the cameras won’t blow you away but they’re fine for social media posts and sharing snaps with loved ones.",
    "We’ve got to commend the Vivo Y20s battery life, as it lasted two days between charges. Affordable phones often have great battery lives and here the Vivo Y20s fits right in. Props must be given to the design too, as the Y20s’ plastic back doesn’t feel cheap at all, and the side-mounted fingerprint scanner is really easy to use.",
    "The biggest issue with the phone is its micro USB port, which makes it slow to charge, and also necessitates you having a separate charger if you have other gadgets that charge via USB-C like a tablet or headphones.",
    "The Vivo Y20s is a jack of all trades, but it’s a master of none, and though there are things we liked about the phone, it doesn’t do anything significantly better than its competition. That’s not necessarily a bad thing - phones at this price point are rarely full to the brim with new features - but it's why this is only a positive review, not a glowing one.",
    "The Vivo Y20s launched in late October 2020 and went on sale shortly after.",
    "You can pick the handset up for £149 / AU$297 (roughly $200) - Vivo doesn’t sell its phones in the US though, so don’t expect to be able to pick it up there.",
    "The ‘affordable phone’ market is a pretty busy one, but in the UK and Australia the handset’s biggest competitors are the Xiaomi Redmi Note 9 at £199 / AU$349 (about $270), the Moto G9 Play at £159 / AU$299 (around $215), and the Nokia 3.4 for $179 / £130 / AU$249. Each of those companies has many more phones for a similar price beyond the ones we’ve listed though, so competition is fierce.",
    "The Vivo Y20s has a plastic body, but the phone doesn’t feel as cheap as many other plastic phones we’ve tried. The handset weighs 192.3g and measures 164.4 x 76.3 x 8.4mm, so it’s big but not huge.",
    "On the right edge of the phone, below the volume rocker, there’s a fingerprint scanner embedded into the power button. It’s easily-reachable and very snappy to use, and we found it made waking up the phone super easy.",
    "There’s a micro USB port on the phone, which is a little outdated given many handsets, even at this price, have the newer USB-C, and the result is that the phone is slower to charge. Next to the port there’s a 3.5mm headphone jack.",
    "We tested the Nebula Blue model, but there’s Obsidian Black if you prefer. The back has a gradient-pattern design that reflects light in beams away from the rear camera bump, and we liked the resulting appearance.",
    "The Vivo Y20s has a 6.51-inch screen, which is on the big side for a phone of its price, and it’s an LCD panel with an HD (720 x 1600) resolution. It’s broken up at the top by a ‘teardrop’ notch housing the front-facing camera.",
    "This display is roughly on par with its rivals with those specs. HD is a little lower-res than most non-budget phones, and since many games and streaming services output FHD content, you might find images look a touch fuzzy, though some users may not mind.",
    "The LCD panel means the phone will be easier to use in sunlight than a cheap OLED screen would be, but also color accuracy isn’t great and the colors aren’t too vibrant. As with its use of an HD resolution, most budget phones use LCD screens, so the Vivo Y20s is fairly standard here.",
    "In general, we weren’t blown away by the Vivo Y20s’ screen, but it felt totally average for its price. If you’re not going to be playing loads of games or streaming lots of movies, you probably won’t mind the display’s shortcomings - the word ‘dependable’ in the introduction seems prescient now.",
    "The Vivo Y20s has three rear cameras - a 13MP f/2.2 main, a 2MP f/2.4 macro, and a 2MP f/2.4 depth-sensing snapper, with an 8MP f/1.8 shooter on the front for selfies.",
    "Generally we find 2MP auxiliary sensors don’t add much to phone cameras - that’s exactly the case here, and we’re not convinced a single rear camera would make for a worse photography experience. Plus, the cost could be even lower as a result.",
    "Photos we took on the phone looked fine, though they won’t win any competitions. Colors in well-lit shots look a little more washed out than they should, but they’re bright enough. Photos taken in low-light conditions looked rather grainy, but not unusably so.",
    "We liked how selfies looked, as the color accuracy was fair and we looked well-detailed in the shots. Portrait mode isn’t worth using though, on the rear or front cameras, as it seemed to have a hard time blurring the correct parts of the background.",
    "There are a few basic camera modes as well as Portrait, like panorama, video and slow-motion video. Video caps out at 1080p but only reaches 30fps. So videos, as with photos, will be fine to share straight on social media or messaging apps, but don’t expect to take professional-level footage.",
    "The Vivo Y20s uses the Snapdragon 460 chipset, paired with 4GB of RAM and 128GB of storage. That’s a pretty low-end processor, and it shows - the phone felt a little slow to use at times, especially on certain games.",
    "When we subjected the phone to the Geekbench 5 benchmark test, it returned a multi-core score of 1140, which is one of the lowest results we’ve seen. It’s similar to the Xiaomi Redmi Note 8T’s 1158, but sits below nearly every other phone we’ve tested.",
    "The slowness we mentioned is noticeable on the main interface - scrolling between menus and opening apps takes a little longer than it would on most other phones. However, it’s roughly as fast as its similar-price rivals, so we can't dock too many points off the handset’s rating.",
    "The phone doesn’t cut it for high-end games, with titles like Call of Duty: Mobile and PUBG Mobile struggling. We had better luck with low-end titles like Candy Crush and Angry Birds, so if that’s all you play on your phone, you won’t mind the lacking processing power.",
    "The Vivo Y20s’ speaker is… okay. Music was a touch tinny, and got distorted pretty easily when you turned the volume up, but the speaker was fine for calls and voice messages. Fans of wired audio will like the presence of a 3.5mm headphone jack though, and if you’re a music buff we’d recommend using wired or wireless headphones instead of the speakers.",
    "The software running on the Vivo Y20s is Android 10, with Vivo’s Funtouch 11 user interface laid over the top.",
    "More so than with most custom user interfaces made by phone companies, Funtouch feels similar to Google’s ‘stock’ Android. It uses Google’s own apps like Photos for viewing pictures you’ve taken and Messages for texting, and doesn’t come with many pre-installed apps beyond those.",
    "As such Funtouch feels pretty clean to use, and the clean and easy-to-use interface goes some way in mitigating the phone’s slowness when it comes to navigating the thing.",
    "You’ll find a 5,000mAh battery in the Vivo Y20s, which is pretty big for a smartphone (though budget phones tend to have bigger-than-average batteries).",
    "We were very impressed with the phone’s battery life, as with ‘standard’ use, it easily surpassed a day and usually got through two days before needing to be powered up. Heavy use could drain the power a bit quicker, but we never found the battery to run out within a day.",
    "Charging was less fun though. The 18W charging uses the phone’s micro USB port, an antiquated standard that doesn’t provide very snappy charging. It took several hours to power the phone from empty to full, so it’s fine for an overnight charge, but not for a quick refill now and then.",
    "First reviewed December 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Vivo Y20s price and availability",
    "10": "Design",
    "14": "Display",
    "18": "Cameras",
    "23": "Specs and performance",
    "28": "Software",
    "31": "Battery life",
    "34": "Don't buy it if..."
  },
  "links": {
    "Vivo Y70": "https://www.techradar.com/reviews/vivo-y70-review",
    "Vivo X51 5G": "https://www.techradar.com/reviews/vivo-x51-5g",
    "Xiaomi Redmi Note 9": "https://www.techradar.com/reviews/xiaomi-redmi-note-9-review",
    "Nokia 3.4": "https://www.techradar.com/reviews/nokia-34",
    "Xiaomi Redmi Note 8T": "https://www.techradar.com/reviews/xiaomi-redmi-note-8t-review"
  }
}