{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-chromebook",
  "title": "Hands on: Samsung Galaxy Chromebook review",
  "category": "computing",
  "updated": "2020-01-06T14:00:01Z",
  "author": "bill-thomas",
  "summary": "Is it time for a high-end Chromebook?",
  "verdict": "The Samsung Galaxy Chromebook is a gorgeous piece of kit with the best display in the Chromebook game, but does the high price justify it?",
  "pros": [
    "Gorgeous display",
    "Chassis is a work of art",
    "Two cameras"
  ],
  "cons": [
    "It's very expensive",
    "Very shallow keyboard"
  ],
  "article": [
    "The Samsung Galaxy Chromebook is an interesting device because it's sitting in a market that barely exists: the high-end Chromebook. Now, affordable Chromebooks get more popular every day among students and users that just need something to peruse the web, but because Chrome OS is famously restrictive on what you can install, expensive Chromebooks don't really make a lot of sense.",
    "However, we live in a post Pixelbook world, and if 2019's Google Pixelbook Go teaches us anything, it's that a high-end expensive Chromebook can make sense if it is truly fancy enough to justify the expense. So, the Samsung Galaxy Chromebook has one of the best (if not the best) displays in the Chromebook game and a truly gorgeous chassis, but does it do enough to justify the $999 (about ₤760, AU$1,440) entry-level price tag?",
    "The Samsung Galaxy Chromebook will be hitting the streets in Q1 2020, but what's more interesting is the price point. Starting at $999 (about ₤760, AU$1,440), the Samsung Galaxy Chromebook is an expensive Chromebook, slotting right in where the original Pixelbook did way back in 2017.",
    "Now, we haven't seen a lot of Chromebooks at this price point since the Pixelbook originally launched, probably because Chromebooks are a hard sell in this price range. As we'll explore later, the Galaxy Chromebook does justify the expense but if you need a more full featured OS like Windows 10 or macOS, you're probably going to want to look elsewhere.",
    "One thing we can definitively say is that the Samsung Galaxy Chromebook is an absolute work of art. The chassis has this vibrant red color that jumped out at us immediately, and it's so thin and light that it should be able to find a home in your backpack with no added back strain.",
    "Beyond that dazzling color, the one thing that sets the Samsung Galaxy Chromebook apart from the rest of the Chromebook pack is the display. Samsung is leveraging its screen muscles here by including a 4K AMOLED display in the entry model of the Galaxy Chromebook. This is simply the best display we've seen on a Chromebook yet and, if you're going to consume your Netflix on here, you'll be in for one hell of a treat, especially when you consider the HDR 400 certification.",
    "However, Samsung tells us that this panel has 99% coverage of the P3 color gamut, which is cool, but since Adobe Creative Cloud and other creative apps aren't available on Chrome OS, it's kind of pointless. Maybe this is a sign that more creative apps will eventually make their way to this operating system, but we wouldn't put our money on it.",
    "There's also two cameras on the Galaxy Chromebook, and it's not quite as bizarre as it sounds. Obviously, there's a webcam at the top of the display for taking video calls and such, but there's also another camera located above the keyboard that you can operate while the Chromebook is in tablet mode.",
    "The only thing that really holds it back is the keyboard. Travel is extremely shallow to the point where comparisons to the Butterfly keyboard make Apple look good. We doubt it'll run into the same technical difficulties, but it's not a very comfortable keyboard to type on, and we can only imagine that long typing sessions will be exhausting.",
    "The Samsung Galaxy Chromebook is the first of its kind to feature 10th-generation Intel Ice Lake processors, which should offer a nice little performance uplift over the 8th-generation parts found in devices like the Pixelbook Go.",
    "It does only have the Core i5 which, at this price point, is a bit middling, but that's still a ton of power for a Chromebook. Chrome OS devices typically run on Intel Pentium or Celeron processors, so this Ice Lake Core i5 should zoom in the lightweight OS.",
    "The Galaxy Chromebook does come with up to 16GB of RAM and a 256GB SSD to start, which is frankly overkill, but it does mean that you shouldn't run into any kind of roadblocks when you're working on this machine.",
    "The Samsung Galaxy Chromebook is flat out one of the most stylish Chromebooks on the market. The gorgeous color and the thin and light design combine to make for a laptop that you're going to want to show off. That 4K AMOLED display also helps make it an eye-catching piece of kit.",
    "However at $999 (about ₤760, AU$1,440), it's quite an expensive Chromebook. Samsung wants the Galaxy Chromebook to be there for folks that need to get work done on the move, but when it comes to getting work done, there are only a small number of people that can do it on a device that won't let you install whatever software you need to.",
    "But if you're just after a stylish Chromebook that you can parade around town, the Samsung Galaxy Chromebook might be just what you're looking for."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design",
    "9": "Performance",
    "12": "Early verdict"
  },
  "links": {
    "Pixelbook": "https://www.techradar.com/reviews/google-pixelbook",
    "Google Pixelbook Go": "https://www.techradar.com/reviews/google-pixelbook-go-review"
  }
}