{
  "source": "https://www.techradar.com/reviews/drip",
  "title": "Drip email marketing software review",
  "category": "computing",
  "updated": "2020-10-29T21:54:21Z",
  "author": "darcy-french",
  "summary": "A premium marketing automation solution",
  "verdict": "Drip is one of the best email marketing services available in 2020 and will drive e-commerce success in any business.",
  "pros": [
    "Market-leading features and customizations",
    "Easy-to-use interface"
  ],
  "cons": [
    "Expensive",
    "Ambiguous data security policy"
  ],
  "article": [
    "Drip is one of the best email marketing software platforms available, and its marketing automation tools are likely to drive customer engagement at all businesses. The platform’s intuitive design and code-free layout make it easy for business leaders to refresh their digital marketing strategy without hassle.",
    "However, Drip is one of the most expensive services, particularly for businesses with larger customer databases.",
    "In our Drip email marketing services review, we look at the platform’s strengths and weaknesses and help you decide whether it’s the right choice for your business.",
    "Drip divides its features into four categories: customer data, personalization, engagement, and optimization.",
    "One of the most important steps in email marketing is to know your customers. Without building a high-quality database, you won’t be able to make the most of other features such as automated workflows. Drip’s deep list segmentation features enable you to intimately understand how customers interact with your business and build insightful profiles based on that data.",
    "Once you’ve developed a high-quality database, Drip provides you with several features to increase customer engagement.",
    "For example, the platform’s behavior-based automations leverage artificial intelligence and enable business leaders to design custom-made journeys for customers and clients. This feature ensures you can engage with customers at precisely the right moment. For example, you might configure the platform to send a reminder email if a customer abandons their cart, or to send a discount code on a customer’s birthday.",
    "Drip’s drag-and-drop design studio also makes it easy to create engaging and personalized emails using one of the platform’s many templates.",
    "Optimization features enable business leaders to ensure they are getting the most from their email marketing strategy. One such feature is Drip’s automatic revenue attribution, which ensures that business leaders can easily see which campaigns are successful and which are not. Built-in split testing is another powerful feature that enables you to design two similar campaigns or email blasts and determine which one results in higher engagement.",
    "Drip is a browser-based platform, so there’s no need to download additional applications or software. Signing up is simple: it takes only two minutes to create an account, add subscribers, and begin making use of the platform’s functionalities.",
    "A critical step in setting up Drip is inserting a JavaScript snippet into the source code of every page of your website. This will allow you to identify visitors and track their behavior on your site. The data acquired will then enable you to personalize customer experiences using Drip’s other features. Fortunately, Drip provides step-by-step instructions on inserting the snippet.",
    "During our free trial, we also received regular support from Drip, who were highly responsive and helped ensure we were able to make the most of the software.",
    "As far as email marketing services go, Drip is one of the best performers. For businesses both large and small, it enables you to improve your digital marketing strategy and increase customer engagement.",
    "The advanced analytics dashboard provides information on campaign metrics such as opens, clicks, and unsubscribes as well as revenue and profitability statistics. When used alongside split-testing, analytics turns your email marketing into a precise activity whereby you continuously improve your digital strategy’s effectiveness.",
    "Data security is essential when managing your customer’s data. Unfortunately, Drip provides close to no information on how it protects business and customer data. Although Drip’s privacy policy provides some vague details on data management, it is not sufficient.",
    "For example, we were able to find only a passing mention of data encryption, and it is unclear whether this applies to some or all data managed on the platform. We were unable to determine whether data is stored locally or with a third-party data center, with a reference made only to “secure servers”. We also don’t know what security protocols protect the platform from cyberattacks, or what security training is provided to Drip employees.",
    "This lack of transparency was our most significant concern with the platform.",
    "Drip’s online support and education center is a fantastic resource. The platform features blog posts, webinars, online courses, and how-to guides. Each section makes it easy to find solutions to common problems or to further develop your proficiency with the platform.",
    "For more complicated issues, you can contact the Drip team via a contact form on their website. After two tests, the average response time was 12 hours. The customer service representatives helped troubleshoot our database import problem.",
    "However, we were disappointed that Drip doesn’t appear to offer phone support for businesses.",
    "No matter how many users in your database, Drip offers the same product. You will have access to the same features and the same level of customer service and account security.",
    "Like most email marketing services, Drip’s pricing model is dependent on the number of customers in your marketing database. A sliding pricing scale is available on its website.",
    "Prices begin at $49 per month, which is a flat rate for accounts of between 1 and 2000 customers. A database of 50,000 customers will cost $680 per month, while a database of 150,000 customers will cost $1850 per month. For larger databases, you will need to contact the Drip customer service team to discuss pricing.",
    "Drip is a superior product to freemium providers such as MailChimp and Sendinblue, but comes at a much higher cost.",
    "It is best compared to other premium email marketing services such as ConvertKit or Constant Contact. These providers are more affordable than Drip, yet still offer many of the same advanced features and customizations, such as split testing and list segmentation.",
    "Drip email marketing is a feature-rich platform and offers advanced marketing automation tools for businesses. The platform is easy to use and doesn’t require tech know-how, which is one of the things we like most about it. Although expensive, we think Drip’s email campaign tools will drive customer engagement with almost all businesses and are a worthy investment.",
    "One thing we would like to see, however, is a transparent security policy that makes it clear how Drip uses customer and business data and what data security protocols are in place to protect customer and business privacy."
  ],
  "headers": {
    "3": "Features",
    "9": "Setup",
    "12": "Performance",
    "14": "Security",
    "17": "Support",
    "20": "Plans and pricing",
    "23": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "Drip": "https://www.drip.com/pricing",
    "email marketing software": "https://www.techradar.com/best/best-email-marketing-software",
    "databases": "https://www.techradar.com/best/best-database-software",
    "workflows": "https://www.techradar.com/best/best-flowchart-software",
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "MailChimp": "https://www.techradar.com/reviews/mailchimp",
    "Sendinblue": "https://www.techradar.com/reviews/sendinblue"
  }
}