{
  "source": "https://www.techradar.com/reviews/campaign-monitor",
  "title": "Campaign Monitor review",
  "category": "computing",
  "updated": "2020-08-04T08:32:35.497Z",
  "author": "john-faulds",
  "summary": "Easy-to-use email marketing that produces great-looking results",
  "verdict": "Campaign Monitor is packed with features, easy to use, and produces great-looking results. However, the lack of direct support may be an issue for some.",
  "pros": [
    "Easy to use",
    "Great choice of templates"
  ],
  "cons": [
    "No direct support options",
    "Importing contacts initially can be tricky"
  ],
  "article": [
    "Campaign Monitor is one of the oldest and best email marketing software services around. With this service, you’ll be able to send professional, personalized email marketing campaigns to your audience. You’ll also be able to improve your online marketing strategy with the information provided by the service’s suite of analytics tools.",
    "More than 250,000 businesses around the world are already using it. But to help you decide whether it’s the right fit for your business, in our Campaign Monitor email marketing services review, we’ll be looking at its plans and pricing, features, security, ease of use, and support.",
    "Campaign Monitor comes in three plans—Basic, Unlimited, and Premier—with prices on a sliding scale depending on how many contacts you have. For up to 500 people, prices range from $9/month up to $149/month. If you’re sending to more than 50,000 people, the price range goes from $299/month to $989/month.",
    "All plans come with the drag-and-drop email builder, professionally-designed templates, and the Insights analytics suite.",
    "The basic plan has limits on how many campaign and automated emails that can be sent, while the Unlimited and Premier plans have no limits. The Unlimited and Premier plans also come with more advanced marketing automation features.",
    "Campaign Monitor is packed with features aimed at helping businesses grow. There are hundreds of professionally designed templates guaranteed to work on any device and that can be customized with a drag-and-drop interface.",
    "Marketing automation tools aim to help you engage with customers at the right time with the right message. Smart segmentation and detailed lists mean you can deliver more personalized content that is relevant to your customers and their individual interests.",
    "Signup forms can be added to websites and social media to grow your audience, and the Insights analytics suite provides valuable insights to help improve your marketing strategy.",
    "Campaign Monitor also integrates with a wide range of third-party apps so you can connect your CRM, e-commerce platform, or website. In addition, you can rest assured that your transactional emails look as good and work as well as your marketing ones.",
    "Getting set up with Campaign Monitor begins with signing up for an account. The first signup stage is like almost every other website: you enter your name, email address, and password.",
    "You’ll then be asked a short series of questions about your company and your role with it, and your company’s audience. A couple of minutes later you’ll be done and ready to start building your subscriber list and your first email campaign.",
    "Everything about Campaign Monitor is beginner friendly and easy to use. The interface is clean and guides you through each step, from setting up your subscriber list to creating your email campaigns. The app itself is very responsive, with pages loading quickly and clicks on buttons and links producing immediate responses.",
    "If you’ve never designed a marketing email before, you’ll be impressed with the large range of templates and the quality of the designs. Customizing the design and the content couldn’t be easier with the drag-and-drop editor, which is really well thought out. And before sending, you can preview what your design will look like for desktop and mobile users.",
    "Those already experienced with designing marketing emails are catered for too as you can import your own files, and Campaign Monitor will automatically inline your CSS for best cross-platform compatibility.",
    "Campaign Monitor has a range of security measures in place, including its own dedicated security team. On top of that, all staff and contractors are subject to background checks and must sign confidentiality agreements. The company’s security guidelines follow the ISO 27001 standard, and the NIST Cyber Security Framework is used to measure how the company deals with security events.",
    "Physical controls are implemented to prevent unauthorized access to customer data, and the company uses state-of-the-art data centers and cloud providers. The software for the app itself was developed with industry best practices and has stringent encryption and authentication measures in place.",
    "For support, Campaign Monitor has a help center with articles in various categories and a selection of training videos. There is also what looks like a chat widget where you first enter your question and you’re then presented with links to help articles with possible solutions. If they don’t answer your query, you can then continue on to contact support with your question by filling in a form.",
    "So there’s no actual direct chat available. There’s also no direct phone contact for support either. Campaign Monitor does have a phone number you can call, but it’s for sales inquiries, not technical support. If you have a question, filling in the form and waiting for a response is your only option.",
    "The email marketing services space is a busy one, and there are lots of competitors. Campaigner is a good choice if you need e-commerce integration, with prices starting at $19.99 for 1000 subscribers. Campaign Monitor’s Basic plan costs $29 for the same number.",
    "Sendinblue has a different pricing model, charging by the number of emails you send rather than contacts or subscribers, which may work out cheaper for some businesses. Its Lite plan costs $25/month and includes 40,000 emails and unlimited workflow automations.",
    "There’s a lot to like about Campaign Monitor. It’s packed with useful features, it’s easy to use, and the emails you can create look great, as does the Campaign Monitor app itself. The sliding scale pricing structure means that Campaign Monitor will suit businesses of all sizes and budgets.",
    "Even though the app is very beginner friendly, there are enough advanced features and customization options to keep experienced marketers happy too.",
    "The only downside is that there is no direct method of support available. You have to fill in a form and then wait for a reply."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "9": "Setup",
    "11": "Performance",
    "14": "Security",
    "16": "Support",
    "18": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "best email marketing software": "https://www.techradar.com/best/best-email-marketing-software",
    "online marketing": "https://www.techradar.com/best/best-online-marketing-services",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "CRM": "https://www.techradar.com/best/the-best-crm-software",
    "e-commerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "website": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "cloud providers": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "Campaigner": "https://www.techradar.com/reviews/campaigner",
    "Sendinblue": "https://www.techradar.com/reviews/sendinblue"
  }
}