{
  "source": "https://www.techradar.com/reviews/driver-reviver",
  "title": "Driver Reviver review",
  "category": "computing",
  "updated": "2020-10-29T00:58:39Z",
  "author": "richard-sutherland",
  "summary": "Keep your drivers up to date with this simple tool",
  "verdict": "Driver Reviver lacks the bells and whistles of the competition, but its core driver update function works well.",
  "pros": [
    "Finds most missing drivers",
    "Simple interface"
  ],
  "cons": [
    "Relatively expensive",
    "No offline driver installation"
  ],
  "article": [
    "Your computer is comprised of many components that were created by a long list of different manufacturers around the world. The programs that Windows uses to interface with these devices are called drivers. Long after a manufacturer first releases a device, it can update the device’s driver to add new features, fix bugs, and improve performance. It’s often difficult to keep up with all these updates, though, as they’re usually only released on each manufacturer’s website.",
    "A driver updater like Driver Reviver from ReviverSoft can help you keep your drivers up to date. Driver Reviver scans your computer and lists the devices that can be updated. After you click Update, the drivers will be downloaded and installed, without you needing to visit all the different manufacturer websites.",
    "In this Driver Reviver review, we evaluate the software to decide whether it’s the best driver update software available today.",
    "Driver Reviver is available as a free download from ReviverSoft, but unlocking all the features will cost you $29.99/year per computer. It’s also available as part of two software bundles that are priced at $34.99/year and $69.99/year.",
    "The free install of Driver Reviver gives you almost all the features of the full software. The notable difference is that you can’t update all drivers at once. Instead, you must click on the Update button for each driver in turn.",
    "Besides the driver scan, Driver Reviver includes a Backup Manager. You can create a complete backup of all your installed drivers or choose individual ones to back up. This can be useful if you’re not confident that a driver update will work and you want to be able to easily and quickly roll it back if something goes wrong.",
    "In addition, you have the freedom to choose when and how driver scans are performed. Your scheduled scans can be set to download drivers and even to install them automatically.",
    "Installing and using Driver Reviver is easy. It has a professional, if somewhat dated, interface, making it fit in well at the office. The interface does a good job of showing you information on your current drivers. If you click on the Information button, you get more detail on how outdated your drivers are and when the latest versions were released.",
    "When you first install Driver Reviver, it’s a bit too insistent on reminding you about your drivers. There are frequent pop-ups stating that your drivers are out of date or that updates are available. Thankfully, this voracity can be turned down in the software’s settings. Driver Reviver is, by default, set up to run on startup, show other product recommendations, and send usage tracking diagnostics back to the company. All these functions can be disabled.",
    "In our testing, Driver Reviver found 17 out-of-date drivers on our Windows 10 computer and 15 out-of-date drivers on our Windows 8.1 laptop. This is among the best results that we’ve seen from driver update software, so Driver Reviver is an excellent choice if you’re struggling to find the right driver updates for your obscure hardware.",
    "You can choose for Driver Reviver to create a System Restore point before installing any drivers. Any driver that you don’t want to be updated can be excluded from all further scans. The schedule settings are useful if, for example, you want your drivers to be updated once a week in the middle of the night.",
    "There’s a simple FAQ for Driver Reviver online. Most of the answers include useful screenshots that show you how the software works.",
    "If you prefer more direct support, you can contact ReviverSoft through a contact form. ReviverSoft states that it attempts to respond to support tickets within 24 hours.",
    "Another driver update program that performed well in our testing is Driver Booster 8 from IObit. It also has an automatic driver update function and the option to back up and restore drivers. It’s available as part of a package that includes other IObit performance tools for $24.95/month for three computers. If you’re tasked with administering multiple computers, it’s much cheaper than Driver Reviver.",
    "Driver Genius from Driver-Soft is another alternative to Driver Reviver. It has a more robust set of driver management tools and includes features such as the ability to back up a set of drivers to a self-installing executable. It’s a better tool for power users who need to administer driver updates to a set of networked computers, for example.",
    "Driver Reviver is a likable program. It did a good job of finding the latest drivers on our computers, and it’s easy to use. The $29.99/year/computer price tag is a little steep, though, especially since it doesn’t have any additional system utilities for cleaning, optimizing, or maintaining a computer. But if you don’t mind the cost, Driver Reviver is a driver update program that you can rely on."
  ],
  "headers": {
    "3": "Plans and pricing",
    "5": "Features",
    "7": "Interface and in use",
    "11": "Support",
    "13": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "Driver Reviver": "https://www.prf.hn/click/camref:1011ldbTe/pubref:trd-us-9538561944181189000/destination:https%3A%2F%2Fwww.reviversoft.com%2Fdriver-reviver%2F",
    "best driver update software": "https://www.techradar.com/best/best-driver-update-software",
    "free download": "https://www.prf.hn/click/camref:1011ldbTe/pubref:trd-us-6181676410033777000/destination:https%3A%2F%2Fwww.reviversoft.com%2Fdriver-reviver%2F",
    "two software bundles": "https://www.prf.hn/click/camref:1011ldbTe/pubref:trd-us-1126156280377747200/destination:https%3A%2F%2Fsecure.reviversoft.com%2F576%2Fpurl-order-driver-reviver%3Flanguage%3Den",
    "Driver Booster 8": "https://www.techradar.com/reviews/driver-booster-8",
    "Driver Genius": "https://www.techradar.com/reviews/driver-genius-20-platinum"
  }
}