{
  "source": "https://www.techradar.com/reviews/shopify-card-reader",
  "title": "Shopify card reader review",
  "category": "computing",
  "updated": "2021-06-23T11:32:38Z",
  "author": "rob-clymo",
  "summary": "The Shopify card reader combines the convenience of handy hardware with the power of its app",
  "verdict": "Shopify adds additional appeal to its ecommerce core by offering card readers that works wonderfully in tandem with its Shopify POS app for seamless transactions.",
  "pros": [
    "Impressive app",
    "Range of card readers",
    "Strong feature set",
    "POS works with companion apps"
  ],
  "cons": [
    "Less appeal for non-Shopify users",
    "Charges mount up"
  ],
  "article": [
    "Shopify will be instantly familiar if you've ever been considering an e-commerce platform for your business as that’s where it started out. However, aside from catering for all kinds of business on the selling front Shopify has also expanded its products and services and now includes mobile card reading.",
    "Back in 2017 the company unveiled its first card reader, allowing business owners to take payments and process transactions in much the same way as other players in the market, such as Square, SumUp, QuickBooks Payments, PayAnywhere and iZettle.",
    "So, as of now and despite the coronavirus pandemic, Shopify has an end-to-end solution for people who need a website, content to go in it and a subsequent means of processing customer payments. While there are geographical variations on the theme in terms of hardware, the core experience works around the Shopify POS app.",
    "Due to the fact that Shopify offers an array of services on what amounts to a global scale there are territorial and geographical differences when it comes to costs too aside from the basic WisePad 3 Reader device. Moving on from the hardware though and you’ll need to look at the backbone of the processing system, which is Shopify POS and there are three variants.",
    "First up, there’s Basic Shopify, which is suited to people who sell in person at pop-ups, markets and suchlike. That’s $29 a month. The mid-range Shopify costs $79 per month and that is suited to small to medium-sized businesses.",
    "Finally, there’s the Advanced Shopify option for well-established businesses that have store locations, plus the need for more complex software solutions. That costs $299 a month. You should also note that there are in-person card processing charges too, currently set at 1.7%, 1.6% and 1.5% respectively.",
    "Interestingly, for the UK Shopify has at its root a Bluetooth-enabled card reader design that is already used elsewhere, so it might look a little bit familiar. In fact, it follows the same build, features and functionality as the original one used by iZettle.",
    "That’s by no means a bad thing though as it clearly works, and has everything you need to process card transactions including tap, chip and swipe payments. But, because of its size, Shopify is able to supply a wider variety of card readers, depending on what kind of business you’re running.",
    "So, as an alternative in the US, Shopify has its Tap & Chip Reader, while mobile-based store holders in Canada might want to explore the Swipe, an audio-jack card reader.",
    "In the case of the Tap & Chip reader that’s available in the US you’ll find that it works with a compatible iPad, iPhone or Android device that supports Bluetooth 4.2 and up.",
    "You’ll need to check the Shopify website for specific model requirements to be sure the unit will be compatible with your mobile device, while you’ll also need a compatible version of Shopify POS, either 5.12.0 or higher for iOS and 3.4.0 or higher for Android.",
    "The same goes for compatibility in other geographical regions, so check first before committing.",
    "Once you’ve mastered its features and functions you’ll find the Shopify Tap & Chip reader can accept payments from Visa and Visa Debit cards, Mastercard and Mastercard and Mastercard Debit, American Express and Discover, plus Apple Pay and Google Pay.",
    "Using the reader is really straightforward as you simply need to press and release the power button, watch for the status lights to appear and then pair it with your device using Bluetooth. Once you’ve been through this procedure initially the unit should connect automatically when you next use it.",
    "There’s an auto sleep feature too, which helps to conserve power during non-payment-processing downtime. Recharging can be done using a supplied USB cable plugged into a phone charger or computer and takes 1 to 2 hours to charge fully.",
    "Considering that all users are paying for Shopify and its services in one shape or form it’s only reasonable to expect a decent standard of customer support. This comes in a variety of ways, such as email and phone, while the chat aspect proves a practical way of getting to the bottom of queries without being too long-winded about it.",
    "Shopify also has a huge website and many resources online, so you may be just as well having a look at those if you’re simply a newbie who’s looking to get up to speed with how the POS ticks.",
    "Shopify seems to have a solution for pretty much any market you’re in. The ability to offer sales on-the-go from pretty much anywhere means the Shopify POS app and card reader combination definitely appeals.",
    "While the app is definitely impressive allowing transactions to take place with a wide variety of cards, it has additional value by offering tracking, synchronization of orders with customers, inventory checks and lots more too. The other benefit is that it can also tie-in these transactions to your online or e-commerce site, meaning that content, customers and stock are managed much more effectively.",
    "If you’re an existing Shopify customer then it therefore seems like an obvious place to start on the card processing trail."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "9": "Performance",
    "12": "Ease of use",
    "15": "Support",
    "17": "Final verdict"
  },
  "links": {
    "Shopify": "https://www.shopify.com",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "mobile card reading": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "take payments": "https://www.techradar.com/how-to/how-to-take-card-payments-contactless-or-pin-based",
    "Square": "https://www.techradar.com/reviews/square-pos-system-review",
    "SumUp": "https://www.techradar.com/reviews/sumup-pos",
    "QuickBooks Payments": "https://www.techradar.com/reviews/quickbooks-gopayment",
    "PayAnywhere": "https://www.techradar.com/reviews/payanywhere",
    "iZettle": "https://www.techradar.com/reviews/izettle-2",
    "Shopify POS": "https://www.techradar.com/reviews/shopify-pos",
    "Basic Shopify": "https://www.shopify.com/pos/features#pos-plans",
    "Advanced Shopify": "https://www.shopify.com/pos/features#pos-plans",
    "e-commerce site": "https://www.techradar.com/news/best-ecommerce-hosting",
    "card processing": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}