{
  "source": "https://www.techradar.com/reviews/flashback-express",
  "title": "Flashback Express review",
  "category": "computing",
  "updated": "2020-08-19T06:43:23Z",
  "author": "cat-ellis",
  "summary": "A free screen recorder that's flexible and amazingly easy to use",
  "verdict": "If you're looking for a screen recorder, it's tough to choose between FlashBack Express and OBS Studio. If you're relatively new to making your own videos FlashBack is the better choice thanks to its more streamlined interface and straightforward settings.",
  "pros": [
    "Simple, clear interface",
    "Dedicated gaming settings",
    "No time limits or watermarks"
  ],
  "cons": [
    "Some features are paid-only"
  ],
  "article": [
    "FlashBack Express is a free screen recorder from the charmingly named Blueberry Software, and it’s a great tool for capturing footage from your desktop ready to share online. Unlike some free screen recorders, it won’t leave unsightly watermarks on your videos, and doesn’t impose time limits on recordings.",
    "FlashBack Express can record audio and sound from your desktop, or a webcam and microphone, making it an excellent choice for vlogs as well as software demonstrations, walkthroughs, let’s play videos and tutorials.",
    "Flashback Express lacks some of the Pro version’s more advanced features, including the ability to edit video and audio frame by frame, add picture-in-picture video and annotations. That’s certainly not a deal-breaker though, and if you want full control over your recordings you’ll get great results using a separate free video editor like Shotcut or Lightworks afterwards.",
    "Following a recent update, FlashBack Express can now export videos in MP4, AVI and WMV formats, so there's no need to use a separate video converter afterwards.",
    "Developer Blueberry Software also has a screen recorder designed specifically for games – FBX. This recorder captures HD in-game footage, with hardware acceleration for AMD and Nvidia graphics cards, and Intel CPUs.",
    "FlashBack Express used to require a license key for activation, but that's no longer the case – just download the software and you're ready to start recording.",
    "Although FlashBack Express isn’t as feature-packed as OBS Studio, its interface is much less intimidating for new users. For basic recordings, just decide whether you want to record from your screen (the full display, a specific window or a custon region) or your webcam, pick an audio source and hit the Record button.",
    "That might be all you need, but the real beauty of FlashBack Express is its scheduled recording, which lets you begin capturing your screen at a certain time and date, or when a particular program is run. This means you don’t capture footage of yourself starting the recorder and launching the game or other program that you want to record. You can also stop the recording automatically after a certain time, or when the program being recorded closes – a great way to avoid creating enormous, unwieldy video files.",
    "Additional options include the ability to use a custom resolution while recording, use a plain desktop background, hide icons, and limit the file size for recordings. You can even define the FPS for game recordings, choose the recording quality, or let FlashBack Express determine these settings itself.",
    "Although FlashBack Express is less powerful than its paid-for counterpart, it’s an outstanding screen recorder – and it’s free."
  ],
  "headers": {
    "5": "User experience",
    "10": "You might also like"
  },
  "links": {
    "FlashBack Express": "https://www.flashbackrecorder.com/express/",
    "free screen recorder": "https://www.techradar.com/news/the-best-free-screen-recorder",
    "Shotcut": "https://www.techradar.com/reviews/shotcut",
    "Lightworks": "https://www.techradar.com/reviews/lightworks",
    "FBX": "https://www.flashbackrecorder.com/fbx",
    "OBS Studio": "https://www.techradar.com/reviews/obs-studio"
  }
}