{
  "source": "https://www.techradar.com/reviews/officesuite-review",
  "title": "OfficeSuite review",
  "category": "computing",
  "updated": "2020-04-03T10:48:43Z",
  "author": "christian-rigg",
  "summary": "Read our OfficeSuite review to learn more about this affordable Office alternative.",
  "verdict": "OfficeSuite ticks all the most important boxes for text documents, spreadsheets, and slideshows. If you don’t need a citation manager or live collaboration features, this may be the right office software for you.",
  "pros": [
    "Familiar, intuitive interface",
    "Advanced spreadsheets"
  ],
  "cons": [
    "Word processor a bit basic",
    "No live collaboration features"
  ],
  "article": [
    "OfficeSuite is a great Microsoft Office alternative, especially for mobile devices. It’s fully compatible with Word, Excel, and Powerpoint, and includes powerful PDF creation tools to boot. Keep reading our OfficeSuite review to learn more about its main features and limitations.",
    "When you first open the app, you’ll be greeted with a Home view of your recent files. From here, you can choose to browse files on your device or any one of seven cloud systems (including Dropbox and Google Drive), search for files, manage your account, and, of course, create new documents. A light and dark mode make for comfortable editing in any environment.",
    "We'll break this down app by app.",
    "Text is easily customized in OfficeSuite, with all the features you’d expect: foreground and background color, indentation, alignment and justification, and vertical and horizontal spacing. A list of styles enables quick changing between headers and paragraph text, although it’s not possible to update or create styles. It is possible, however, to copy formatting from one bit of text to another with a convenient Format Painter.",
    "List building is supported, including multilevel lists (e.g. 1.2.1, 1.2.2, etc.), but could be improved. Starting a sentence with an asterisk or hyphen won’t automatically create a list, and there’s no way to create new list styles, so you’re stuck with the basic three: ○●■. Indents cycle through list styles, though, which is great.",
    "There are also a few major elements missing. There’s no citation manager, which is unfortunate for academics. The Find & Replace function is limited and doesn’t support searching styles or Replace All, a regrettable lacuna for an otherwise robust word processor. There’s no stylus integration, which is a real let-down, especially considering this functionality is present in Slides. Finally, it’s not possible to embed dynamic charts or graphs.",
    "We were happy to find a robust spreadsheets app. Adding formulas is simple, with a large library of functions in easy-to-navigate menus. Typing out functions was straightforward, and we were happy to see that error parsing directs you to the relevant part of the equation. It even auto-filled a missing closing parenthesis.",
    "You can sort rows and columns with advanced filtering, and group and validate data with ease. The only noticeable absences were for data consolidation and What-If analyses, both of which are present in MS Office. Inserting graphs and charts from data and customizing them was uncomplicated.",
    "Slides",
    "Creating and reorganizing slides, adding and customizing page elements, and setting transitions were all straightforward, and we had no trouble creating a quick and effective slideshow. Unlike the Documents component, stylus integration here is truly excellent: responsive, intuitive and enjoyable to use. Presenter mode was very functional, and even supported annotations with the stylus, which was great.",
    "OfficeSuite also features a PDF editor, which is a real advantage. You can convert PDFs to Word, Excel, or ePub, add advanced annotations, and sign documents. You can also annotate with a stylus, two types of pen, or a highlighter. Like almost all PDF annotators, written highlights show up in front of the text, but you can adjust transparency, which helps with readability.",
    "As we’ve said, OfficeSuite is available on Apple and Android mobile devices. Interestingly, it also supports Apple Watch, which can be used to control slideshows. We tested OfficeSuite on iPadOS and found it to be responsive, intuitive, and feature-rich. In addition to supporting several cloud drives, you can initiate a simple WiFi file transfer with any computer on your network by directing it to an IP address, which was a great feature. Subscriptions also come with 50GB cloud storage.",
    "Live collaboration tools are entirely absent, which is regrettable. Tracking changes, however, is supported, as is adding comments, and you can share documents with users through standard iOS, Android, and Windows channels (email, messages, the cloud, etc.), but there’s no way for more than one person to work on a given file at a time.",
    "OfficeSuite is available as free software, but with very limited capabilities. Documents can’t be printed without watermarks, and basic features like spellcheck and columns are unsupported. Sheets is missing pivot tables and data validation, while Slides is entirely absent. If you’re looking for a free word processor or office suite, this may be too limited for you.",
    "The Personal plan is competitively-priced at $29.99 per year for one user license, while the Group plan includes five user licenses for just $49.99 per year. Both include the complete apps for Windows, iOS, and Android, full PDF capabilities, and 50GB of cloud storage. A 30-day free trial is also available. Finally, lifetime access is available with a single payment of $99.99, for the complete Windows-only suite and 5GB of cloud storage.",
    "While better free options are out there, if you’re willing to pay for the very reasonably priced full version, you’ll be able to create great looking text documents and engaging slideshows, and perform quite advanced data analyses. If you can do without live collaboration tools and advanced word processing features like citation management, handwritten notes and embedded charts, this is an otherwise powerful office suite, and compatible with MS Office to boot.",
    "OfficeSuite is simple to use and has great price points. If you’re looking for greater control over your company’s data, or want to integrate a fully functional office suite into proprietary software, OnlyOffice offers a very robust server-based suite starting at $1200 for up to 50 simultaneous connections. If your company is Mac-based, iWork has the clear advantage of being free and boasts advanced collaborative tools.",
    "Find out more about OfficeSuite's competitors in our guide to the Best Microsoft Office alternatives."
  ],
  "headers": {
    "1": "OfficeSuite: Interface",
    "2": "OfficeSuite: Features",
    "11": "OfficeSuite: Mobile and web",
    "13": "OfficeSuite: Pricing",
    "15": "OfficeSuite: Final verdict",
    "16": "The competition"
  },
  "links": {
    "Microsoft Office alternative": "https://www.techradar.com/news/best-microsoft-office-alternative",
    "Best Microsoft Office alternatives": "https://www.techradar.com/news/best-microsoft-office-alternative"
  }
}