{
  "source": "https://www.techradar.com/reviews/nanoleaf-shapes",
  "title": "Nanoleaf Shapes review",
  "category": "smart-home",
  "updated": "2020-10-19T00:21:11Z",
  "author": "jennifer-allen",
  "summary": "The Nanoleaf Shapes are fun, but expensive",
  "verdict": "The Nanoleaf Shapes make a pleasant change from the usual bevy of smart light bulbs and light strips. It's far from a cheap kit but if you want a unique setup in your home, you can't go wrong.",
  "pros": [
    "Imaginative light designs",
    "Non-destructive installation",
    "Extensive smart home integration"
  ],
  "cons": [
    "Expensive for what it is",
    "Occasional pairing issues",
    "Flimsy linkers"
  ],
  "article": [
    "UPDATE: There now three different Nanoleaf Shapes to choose from – the Hexagons (that were originally reviewed here), with Triangles and Mini Triangles joining the eight-sided panels on October 16, 2020. We've added information on the new additions towards the end of the original review.",
    "There's something delightfully aspirational about everything to do with the Nanoleaf Shapes. The box looks a little like a toy set, but the moment you glance at images of what it can do to your home, you can't help but be a bit thrilled. It's the lighting equivalent of an IKEA showroom, transforming a dull wall into something rather special. As it should, given its premium price tag.",
    "This isn't the first Nanoleaf smart lighting product, (check out our Nanoleaf Canvas review) but the Nanoleaf Shapes is easily the best yet. While there are some minor issues afoot, it doesn't stop you adoring many of the major features here, as well as some of the finer details that you'll smile at the effectiveness of. At a time when we're all indoors more than we'd probably like to be, the Nanoleaf Shapes make things better.",
    "Made up of nine hexagonal (ish) flat panels, the Nanoleaf Shapes is a jigsaw puzzle of your own design. You can choose to create a snaking pattern of panels or to create a more sensible looking closely bunched arrangement. The included power supply supports up to 21 panels so you can buy extra packs and add to your heart’s content if you want, although obviously it'll cost you a fair amount at $179.99 / £179.99 / AU$229.99 per nine-panel pack.",
    "Setup is a matter of attaching the panels together with a series of plasticky linkers before sticking each panel to your wall with the included oversized double-sided foam fixing pads. That's where the Nanoleaf Shapes feel a little cheap given their price tag, but it does work pretty well, and you can opt to purchase a screw mount kit instead.",
    "Once physically set up, the app guides you through the simple steps to get started and it doesn't take long to see just how much the Nanoleaf Shapes can light a room up. Maximum brightness will be rarely needed here with a surprising amount of light pumped out from these lightweight looking panels. Being able to touch them to interact with certain features is great but it's poking around the app that will uncover just how much you can do with them. The Nanoleaf Shapes soon feel as expensive as they are and far more exciting to use than a regular smart light bulb.",
    "Overall, while you'll wish for a few minor changes to the system and occasionally grumble at the odd Wi-Fi drop out, it's hard not to love how much the Nanoleaf Shapes can transform a room.",
    "The Nanoleaf Shapes are currently available to buy for $179.99 / £199.99 / AU$229.99 – and they're in high demand, which is why at the time of writing, they're out of stock in the USA. For the price, you get a nine-panel starter kit that also includes the controller and power supply.",
    "For $69.99 / £49.99 / AU$119.99, you can buy a three-panel expansion pack if you want to extend your light display.",
    "We'd expect the kits to be available on Amazon in the near future as other Nanoleaf products are stocked there.",
    "Unpack the Nanoleaf Shapes starter kit box and you'll find yourself with a lot of plastic panels. Switched off, the panels look rather unremarkable. On the back of each is an oversized foam fixing pad and a swivel connector that makes it much easier to remove a panel from a wall once it's been stuck down. Alongside the panels are a set of plastic linkers, which you use to connect the panels together along with a power supply and controller which fits onto the panel of your choice.",
    "The controller unit has a series of buttons, including a power switch, pairing switch, and a plus and minus sign for adjusting brightness. There's no satisfying click when you press a button but the icons are raised so you can feel in the dark if need be. It's also a unit that blends in to the rest of the design so it doesn't stand out too significantly once wall mounted.",
    "Incorrectly, we thought a test run on the ground would be the easiest method of trying out a Nanoleaf Shapes design. We don't recommend it. It's far easier to use the Nanoleaf Shapes app to create a layout, then to follow it directly on the wall. Whichever method you pursue, the plastic linkers are simple to use to click the panels together but they do feel ever so slightly delicate. In practice, we didn't have any issues but the thought lingered especially as replacement linkers cost $9.99 / £9.99 / AU$17.99",
    "As you piece together your set of hexagonal shapes onto the wall, you need to take the foam fixing pads off as you go, before holding the panel firm to a wall. Nanoleaf recommends you avoid placing the panels on wallpapered areas or effectively anything that could disrupt the reliability of the sticking pads. If you require a more permanent solution, you can choose to buy a wall-mountable kit. As we assembled the pieces on our wall, things felt more sturdy than they did at the start.",
    "The first panel was slightly weighed down by the controller unit and the power supply cable, so it tilted slightly even once stuck to the wall, but once we attached more pieces, it corrected itself and we didn't have any other problems.",
    "Once you piece everything together, it takes seconds to set things up via the app thanks to an intuitive setup process. One delightful touch is that the app and hardware can detect the arrangement you've created, showing it on the app and helping you create a scene that works just right for you.",
    "The only real issue we found was that once in a while, the connection between the light panels and our smartphone app would drop, and we'd have to unplug the controller unit to get things started again. This only happened once or twice over an extended period of time though, and it's something we've experienced with other smart home devices.",
    "The Nanoleaf Shapes offers a near overwhelming array of options. At its simplest, you can set it up to display a solid set of lights, lighting up your living space in a way that's so much brighter than any smart light bulb system. Granted, the hexagon shapes aren't quite as perfect as they could be. They have somewhat soft edges rather than being sharp which could bug those looking for 'perfect' clean lines. We weren't too fussed as it still looked good, but if you're keen on a sharp look, it's something to consider.",
    "The solid light settings are just scratching the surface with the Nanoleaf Shapes, however. It also offers a music visualiser feature, in which the lights change and adapt according to the music you're listening to via a speaker in the same room. It works pretty well too providing the volume isn't too quiet on your chosen speaker, soon turning your room into your own private nightclub.",
    "For kids and those who simply love to poke things, you can also install games that take advantage of the touch controls on each panel. These are pretty simple titles like Whack-A-Mole or Simon, but Nanoleaf pushes the boat out a bit with a rudimentary version of Pac-Man too. Ultimately, they're a little gimmicky but something we can see kids being hooked on for a brief time. In terms of an effective sensory experience, it's sure to be a hit too.",
    "Like with other leading smart light bulbs such as Philips Hue, you can also pair up the Nanoleaf Shapes with your TV or other screen so that the lights reflect what occurs on screen. It's a particularly neat touch if you plan on placing the lights behind your TV setup.",
    "Completing the set of useful features, the Nanoleaf Shapes also supports plenty of other smart devices. Working well with Google Assistant and Amazon Alexa, along with Apple HomeKit, you can easily change things with the power of your voice. IFTTT support makes things all the more convenient as well as allows you to set up some useful shortcuts.",
    "There's a lot you can do with the Nanoleaf Shapes and the app reflects that. Fortunately, it's mostly simple to use. It includes a series of presets for different scenarios as well as encourages you to download other people's creations to get started. And, of course, you can create your own layouts to reflect your room's aesthetics and how you've laid out your hexagonal shapes.",
    "Being able to set up a schedule is a particularly nice thing to do. We set up a timer so that once we woke up in the morning, the Nanoleaf Shapes gradually turned on with the brightness increasing in time with waking up. It's fun to do and no doubt perfect in a child's room in particular if you're trying to rouse them in a more convenient fashion than doing it yourself.",
    "The app also takes the time to offer some comprehensive tutorials which are particularly useful when mastering more complex methods like creating layered scenes. Fortunately, you can always choose to make Nanoleaf Shapes as simple or as complicated as you want. The general principle is speedy enough after all.",
    "As mentioned at the start of this review, Nanoleaf has added two more Shapes to its growing line. These are Triangles and Mini Triangles. As the names suggest, they're just larger and smaller versions of the same design, and either – or both – can be combined into more intricate and creative designs with the Hexagons.",
    "Where the Triangles and Mini Triangles differ from the original Nanoleaf Light Panels (which are also triangular) is in the design. Where the latter's corners are cut off, the new panels are perfect triangles. However, like the Hexagons, the corners of the Triangles and Mini Triangles are also opaque.",
    "In every other respect, they Triangles and Mini Triangles are the same thing as the Hexagons, and designed to work either as individual setups or together in a variety of creative ways which the layout designer in the app can help with.",
    "[First reviewed August 2020]"
  ],
  "headers": {
    "7": "Nanoleaf Shapes price and availability",
    "10": "Design",
    "12": "Setup",
    "17": "Features",
    "22": "App performance",
    "25": "Other Shapes",
    "28": "Don't buy them if..."
  },
  "links": {
    "Nanoleaf Canvas review": "https://www.techradar.com/reviews/nanoleaf-canvas",
    "smart light bulb": "https://www.techradar.com/news/best-smart-lighting",
    "Philips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you"
  }
}