{
  "source": "https://www.techradar.com/reviews/emporio-armani-smartwatch-3",
  "title": "Emporio Armani Smartwatch 3 review",
  "category": "wearables",
  "updated": "2020-01-28T15:35:02Z",
  "author": "jennifer-allen",
  "summary": "Expensively stylish",
  "verdict": "The Emporio Armani Smartwatch 3 has a smart name, smart watch strap, and a smart case. However, underneath the classy exterior it's a little bit too much like so many other Wear OS smartwatches, albeit with a sizable price tag for what you get.",
  "pros": [
    "Very smart",
    "Built-in speaker",
    "Battery saving options"
  ],
  "cons": [
    "Very expensive for what it is",
    "Not a unisex design",
    "Built-in GPS doesn't work"
  ],
  "article": [
    "The third Armani smartwatch, the Emporio Armani Smartwatch 3, plays it safe. It's essentially a rebranded Fossil watch, like so many Wear OS watches have been of late.",
    "With some minor changes and improvements over the previous Armani smartwatch (the Emporio Armani Connected 2018), it does the job well but it sure is expensive for what it offers.",
    "Still, if you're nuts about the Armani name, you'll no doubt not care.",
    "The Emporio Armani Smartwatch 3 retails at $375 / £369 (around AU$550). Nowhere has it discounted at the time of writing, so expect to pay full price for a while to come.",
    "Color choices are reasonably varied with the option of black stainless steel, orange aluminum, blue aluminum, yellow aluminum, black aluminum, and green aluminum.",
    "All but the black stainless steel variant use a synthetic rubber strap, so it's surprising to see the smarter and more expensive looking stainless steel bracelet version retail at the same price as the more plasticky version.",
    "There's little doubt that the Emporio Armani Smartwatch 3 is stylish. We were sent the black stainless steel variety along with an extra blue rubber watch strap. The metal band in particular feels weighty and expensive, while the rubber one feels a fair bit cheaper and lighter.",
    "Essentially, the metal one is ideal for going out for the evening while the rubber strap serves better as a daily use kind of strap.",
    "Whichever you go with, the watch looks nice. It's the right level of thickness at 12mm, with a 44.5mm case that's big enough to easily glance at.",
    "The screen itself is a 1.28-inch AMOLED display offering a 390 x 390 resolution with 328 pixels-per-inch. It looks sharp, with the default watch face being as understated as the rest of the design.",
    "If you're keen about logos though, there's a tiny one on the crown and another on the back of the watch. Again, it's understated which may not suit those wanting to look flashy.",
    "The only downside? The Emporio Armani Smartwatch 3 doesn't feel like a unisex watch. On a female wrist, it feels too big and bulky, no matter which strap you choose.",
    "The Emporio Armani Smartwatch 3 uses similar hardware to the Fossil Gen 5, which is a very good thing indeed. That means the Qualcomm Snapdragon Wear 3100 chipset, 8GB of storage, and 1GB of RAM.",
    "The latter in particular makes a notable difference and is a welcome change compared to under-powered smartwatches elsewhere, like the Michael Kors Access MKGO or Puma Smartwatch.",
    "Continuing the good news, there's a built-in speaker so you can easily take calls from your watch if, for some reason, you don't feel like pulling your phone from your pocket. Google Assistant responses via this method are certainly handy though.",
    "Elsewhere, there’s built-in GPS (supposedly, more on that in the section below), heart rate monitoring, waterproofing up to 5 ATM, and you can use Google Pay with it. Typical stuff for a smartwatch in this age and most of it works well and efficiently.",
    "Also, there's mostly standard apps pre-installed here, with the exception being a Saved Faces app which gives you quick access to any watch faces you've customized.",
    "When it comes to fitness features, the Emporio Armani Smartwatch 3 has it covered, in theory.",
    "Put the silicone strap on and you won't have to worry about sweat, use the heart rate sensor to track how your heart is performing, and enjoy the fact that the Emporio Armani Smartwatch 3 is reasonably accurate when it comes to tracking this.",
    "And then cringe as the GPS utterly fails for a few minutes because you left your phone at home and made the mistake of assuming the GPS wasn't entirely dependent on it.",
    "The Emporio Armani Smartwatch 3 isn't the first Wear OS watch to have this issue recently, but it is an expensive one to have such a critical fitness related flaw. However, it's possible this is just a bug, as the watch supposedly has GPS built in.",
    "We've tested two units that had the same fault, and other publications have also spotted the same issue so we've raised it with Fossil and will update this review if we hear further. For now, don't buy this watch expecting the built-in GPS to work away from your phone.",
    "Battery life has never been great for any Wear OS watch but the introduction of the latest update and the Snapdragon Wear 3100 chipset means that the Emporio Armani Smartwatch 3 has options.",
    "Leave everything on full and your watch will only last just under a day, so you'll need to recharge it overnight. However, use one of the many battery modes to tweak things and pull back on the features you need (right down to only enabling Bluetooth during certain hours), and things get much better.",
    "It's not perfect as, ultimately, you want your watch to be able to do everything at all times, but it's convenient if you won't be able to charge it as often as you'd like.",
    "First reviewed: January 2020"
  ],
  "headers": {
    "3": "Emporio Armani Smartwatch 3 release date and price",
    "6": "Design and display",
    "12": "Specs and features",
    "17": "Fitness",
    "22": "Battery life",
    "25": "Don't buy it if..."
  },
  "links": {
    "Emporio Armani Connected 2018": "https://www.techradar.com/reviews/emporio-armani-connected-2018-review",
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
    "Michael Kors Access MKGO": "https://www.techradar.com/reviews/michael-kors-access-mkgo"
  }
}