{
  "source": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
  "title": "Nintendo Switch Lite review",
  "category": "gaming",
  "updated": "2020-10-19T09:34:53Z",
  "author": "vic-hood",
  "summary": "Time to lighten up?",
  "verdict": "The Nintendo Switch Lite is a great, compact device for those who aren't a fan of (or simply never use) the original Switch's docked mode. The design is more comfortable for portable gaming than the Switch, while boasting the same performance.",
  "pros": [
    "Lighter and smaller",
    "More portable",
    "Nice selection of colors",
    "Comfortable design"
  ],
  "cons": [
    "Limited to handheld games",
    "Still not as comfortable as 3DS"
  ],
  "article": [
    "Since its release in 2017, the Nintendo Switch has been raking in money for the House of Mario – but two years on, in classic Nintendo fashion, the company decided to change things up and provide a compact alternative to the hybrid console: the Nintendo Switch Lite.",
    "The Switch Lite is the smaller, lighter sibling of the Nintendo Switch, stepping into the shoes of the Nintendo 3DS as Nintendo's handheld dedicated device.",
    "If you're someone who enjoys the flexibility of playing the Switch on either the TV or as a handheld, then immediately the Switch Lite isn't for you – docked is not an option here.",
    "But, if you find yourself solely using the hybrid console's handheld mode, or find the Switch a bit clunky for on-the-go gaming, then the Switch Lite could be the lightweight alternative for you. But, as with any new device, there are some pros and cons you should weigh up before making the switch to the Nintendo Switch Lite.",
    "Update: With Black Friday 2020 coming in late November, it's likely we'll see discounts on the Nintendo Switch Lite this year, with savings on the console expected. Bundle deals seem likely, too, and most of those are expected to carry across to Cyber Monday 2020.",
    "The major difference between the Nintendo Switch Lite and the original Nintendo Switch is that the Switch Lite is solely a handheld device. Therefore, the Switch Lite is much more compact, and lighter, than its predecessor.",
    "The Switch Lite measures 91.1mm x 208mm x 13.9mm and weighs 275g, compared to the 102mm x 239mm x 13.9mm dimensions and 297g weight of the original Switch. This means the device comes with a smaller LCD touch screen too, measuring just 5.5 inches but still providing 1280 x 720 pixels.",
    "In other words, it's a smaller screen than the original Switch's 6.2 inches, but with the same resolution – so you're not losing anything in terms of picture quality. In fact, this gives the Switch Lite a pixel density of 267 pixels per inch (ppi), a bit sharper than the original Switch's 236 ppi.",
    "However, the trade-off is that it can sometimes be difficult to read small in-game writing on the smaller screen. We found ourselves having to hold the console closer to our face to read some text. It's a small issue, but slightly odd for onlookers on a morning commute.",
    "But where the Switch Lite truly shines is that it feels more comfortable as a handheld device. Due to its smaller size, it's more portable and convenient to use on-the-go than the original Switch: you need less elbow room, and it could probably fit in quite a large pocket.",
    "As someone with small hands, this writer is aware that the original Switch can be uncomfortable to use in handheld mode; while relatively compact, it's still large by handheld standards. By contrast, the Lite is considerably more portable, and fits snugly in your hands. However, it is still quite wide, and doesn't feel quite as comfortable as, say, the 3DS did.",
    "In addition, the Switch Lite comes with integrated controls rather than Joy-Cons. While you can connect up to four separate Joy-Cons wirelessly, you won't get an additional pair out of the box with the Lite.",
    "Despite the controllers being fixed, they offer mostly the same buttons as the original Switch – except the left, right, up, down buttons, which have been replaced by a D-Pad, or Plus Control Pad, as Nintendo calls it.",
    "The D-Pad replacement feels natural, like it's always been there – and is certainly more suited to handheld play.",
    "The ZL and ZR triggers feel the perfect size and help cement that snug fit. However, the L and R buttons are a bit thinner than on the original Switch. Arguably a bit too thin, as we sometimes found our fingers slipping off them.",
    "Both models also allow for wireless connectivity, Bluetooth (though not for wireless headphones) and the use of MicroSD cards to increase the 32GB of internal storage, so you aren't really losing out on many features aside from docked mode – which means no playing on the TV.",
    "Due to the Switch Lite only being a handheld device, the console doesn't come with a dock, HDMI cable or kickstand. All you get in the box is the device itself and a charger – simple. The Switch Lite isn't meant to connect to a TV – and while we tested it out with our own HDMI cable anyway, the console simply doesn't support the feature.",
    "The Switch Lite also comes in turquoise, gray and yellow models – shaking up the gray and neon Switch models we've been eyeballing for the past two years.",
    "The Nintendo Switch Lite has essentially the same performance as the Switch, except that the Lite has a slightly longer battery life of 3-7 hours, about 30 minutes more than the original Switch, and 1-2 hours less than the upgraded Switch model entering stores (although Nintendo warns that this depends on the games you play).",
    "However, it is definitely worth noting that the Switch Lite does not come with HD Rumble or an IR Motion Camera. The device is made to solely play handheld games, and will therefore only play Nintendo Switch games that support handheld mode.",
    "That's not to say you can't play games which don't support handheld mode, but you would have to wirelessly connect Joy-Cons for this to work (and buy them plus their charging grip separately). We found that connecting Joy-Cons allows you to use HD Rumble.",
    "At a hands-on preview event, a Nintendo representative explained that the console will be compatible with more devices than just the Joy-Cons, but what exactly would not be revealed until a later date.",
    "The following games are unsuitable for the Switch Lite: 1-2 Switch, Super Mario Party, and Nintendo Labo accessory kits. While games which require Rumble could be played with Joy-Cons attached, we found that trying to play with more than one person on the Lite's small screen isn't exactly practical - so we wouldn't advise trying to take on party games as the device wasn't built for this.",
    "Despite missing these two features, the Switch Lite still has an accelerometer, gyroscope, and brightness sensor. That means that you can still use gyro controls in games like Breath of the Wild – tilting the console to aim the bow for instance – and the screen's brightness adjusts depending on your surrounding.",
    "Wireless online play still means you can play with friends (just not necessarily couch co-op) as we were able to play Mario Kart 8 Deluxe online with ease. If anything, all the games we played felt less clunky due to the compact nature of the device.",
    "The Nintendo Switch Lite is the perfect console for those who prefer comfortable handheld gaming and have never been sold by the Nintendo Switch's docked mode.",
    "The compact and lighter device feels considerably better than its predecessor and is much less clunky. When it comes to portable gaming, the Switch Lite is easier to transport, takes up less elbow space on commutes and fits in your hands much more snugly. It's not quite as comfortable as the 3DS, but packing in the same performance as the Switch means we can let that slide.",
    "However, anyone thinking about picking up the Switch Lite needs to focus on the fact that it is intended to focus on solo, portable play and the number of games which are compatible with the device is slightly less than the original Switch. It is not simply a smaller Switch model.",
    "But if you're looking for a more comfortable, lighter and overall better looking handheld device (and a range of snazzy colors), and don't particularly care about losing the few games we've listed, then the Switch Lite is likely for you."
  ],
  "headers": {
    "5": "Nintendo Switch Lite: design",
    "18": "Nintendo Switch Lite: performance",
    "25": "Verdict"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo 3DS": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-3ds-xl-2014-1271189/review",
    "Black Friday 2020": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday 2020": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "connect to a TV": "https://www.techradar.com/how-to/how-to-connect-your-nintendo-switch-to-the-tv",
    "the upgraded Switch model entering stores": "https://www.techradar.com/news/new-nintendo-switch-promises-better-battery-life-while-looking-exactly-the-same",
    "Nintendo Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Super Mario Party": "https://www.techradar.com/news/super-mario-party-review-the-most-tactical-mario-party-game-yet",
    "Nintendo Labo": "https://www.techradar.com/reviews/nintendo-labo",
    "3DS": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-3ds-xl-2014-1271189/review"
  }
}