{
  "source": "https://www.techradar.com/reviews/corsair-scimitar-rgb-elite",
  "title": "Corsair Scimitar RGB Elite review",
  "category": "computing",
  "updated": "2020-05-12T19:43:43Z",
  "author": "michelle-rae-uy",
  "summary": "The macro monster",
  "verdict": "If you’re an MMO/MOBA gamer – or a content creator – the Corsair Scimitar RGB Elite Optical delivers an incredible advantage. However, if you’re not, you’re probably better off with a cheaper gaming mouse.",
  "pros": [
    "Excellent for MOBA/MMO gaming",
    "Great for content creation",
    "Quality construction"
  ],
  "cons": [
    "Unintuitive software",
    "Niche use",
    "Has a learning curve"
  ],
  "article": [
    "For its intended purpose, the Corsair Scimitar RGB Elite Optical is a terrific gaming mouse. Designed specifically to give MOBA/MMO gamers a greater advantage than before, it offers shortcuts for your keyboard hotkeys and takes the human error factor out of macros. It’s slew of extra programmable buttons – 17 of them to be exact – will let you trigger spells, take out potions and equipment, and open menus at a moment’s notice, allowing you to react faster. And, it is, without a doubt, among the very few mice we’ve tested that are perfect for macro and remapping junkies.",
    "Beyond that, the Scimitar RGB Elite Optical is excellent for content creation like video editing and music production. Those buttons are useful for assigning keyboard shortcuts, effects and tools so you cut through the non-creative aspects of your workflow. That’s whether you’re creating your beats on a digital audio workstation like Reason 11, editing your photos on Lightroom, or doing post on Premiere Pro.",
    "But, if it seems like this gaming mouse is the dream, you might want to take a second look. Outside of its 12 extra programmable buttons, it’s just as good as any gaming mouse, albeit with a missing dedicated sniper button and more subdued RGB lighting. In fact, we’d go as far as to say that those programmable buttons only get in the way, if you’re playing non-MMO/MOBA games where a more streamlined mouse with back and forward buttons are more beneficial.",
    "This mouse costs a hefty $79 (£75, about AU$125), so if you’re not going to use this mouse for MMO/MOBA gaming or for streamlining your creative process, you might be better off with something like the Corsair Dark Core RGB Pro Wireless, which might have more features you can utilize, or something cheaper like the Corsair Ironclaw RGB.",
    "The Corsair Scimitar RGB Elite Optical will set you back $79 (£75, about AU$125), and that’s a hefty price to pay if you aren’t milking its marquee feature – the 12 extra programmable buttons – for all its worth.",
    "If you’re not going to use this mouse for MMO/MOBA gaming, you might be better off with something like the Corsair Dark Core RGB Pro Wireless, which costs just as much and is incredibly feature-rich. You’d also want to consider the Razer Viper, which at the same price gives you an ambidextrous design and a superb performance worthy of high-speed gaming.",
    "If you’re looking for a gaming mouse that will truly give you an edge over your rivals in World of Warcraft or League of Legends, or if you need a mouse that will streamline your creative workflow, then you’ve got a winner here. In fact, $79 (£75, about AU$125) is more than a fair price to pay for all the benefits it brings to the table.",
    "The Corsair Scimitar RGB Elite Optical is available in the US, the UK and Australia. However, it might cost a bit more in Australia, depending on the third-party seller you’re buying from.",
    "Right off the bat, you’ll know that the Corsair Scimitar RGB Elite Optical based on its look. On its left side is a panel with a cluster of 12 numbered buttons. This is Corsair’s patented Key Slider, which is named as such because you can actually slide it forward or back – using an Allen key – based on your personal comfort and your thumb’s reach.",
    "This repositioning capability of the Corsair Scimitar RGB Elite Optical marquee feature actually contributes to the mouse’s ergonomics, which is already great to begin with. While some mice are designed for palm grip gamers and others for claw grippers, this mouse aims to please both and does so nicely. It has that little subtle bump towards the back that satisfies those who have a claw grip without alienating those with a palm grip. However you grip your mouse, you’ll find this one extremely comforting.",
    "Sadly for lefties, however, this has a dextral orientation. But, that’s understandable, as you couldn’t possibly design a mouse with this one’s key feature without making it overly complicated.",
    "If we had one gripe about this mouse, however, it would be the positioning of the 12 Key Slider buttons – all of which use Omron switches – themselves. No matter how you position the key slider whether it’s forward or back, some buttons become slightly inaccessible. And by that, we mean you might have to stretch your hand or even take your palm off the palm rest to press certain buttons. Positioning the Key Slider in the middle is somewhat of a compromise but it still takes a bit of getting used to, unless perhaps you have an unusually long thumb.",
    "That said, there couldn’t possibly be a better way to incorporate 12 additional buttons on a gaming mouse than what Corsair has done here. And for that, we give them props.",
    "Plus, there’s a whole lot of things that the company has done right here. The cable is braided and durable, yet extremely flexible. The matte finish on the top plate feels nice to touch. The textured ring and pinkie finger rest gives you a better grip. And, the 12 Key Slider buttons have enough resistance to prevent accidental presses, yet not too much that they require a lot of force to press.",
    "While we’re on the topic, 6 of these 12 buttons – those in the second and four columns – are textured as well, with button 5 also touting a ridge, so you can much easily identify them by touch. You wouldn’t want to be looking down at those buttons to find the right one when you’re in the middle of an intense battle in your game, after all.",
    "The Corsair Scimitar RGB Elite Optical may make your MMO gaming or your creative workflow more streamlined, but we wish Corsair had applied that same concept to its iCue software.",
    "Don’t get us wrong here – iCue is an extremely capable and versatile piece of software, and it allows customizations like no other software we’ve seen before, though that also has a lot to do with the Corsair Scimitar RGB Elite Optical itself. This software will let you not only remap and assign macros, hotkeys and shortcuts to your heart’s content, but also let you create and save sub-profiles within profiles for actions, lighting effects and DPI settings. And, it will definitely serve an extremely meticulous type of user well.",
    "Unfortunately, the program feels very clunky, even unnecessary. We feel, for example, that if you want a different lighting and lighting effect for each of the four RGB zones, there’s absolutely no need to create a subprofile for every zone. Especially because similar software from other companies allow you to click on every RGB zone and set the desired lighting effect for each, all in a single profile.",
    "Corsair mice have proven themselves to be more than capable gaming peripherals, and the Corsair Scimitar RGB Elite Optical is no different. With up to 18,000 DPI and a polling rate of up to 1,000MHz per 1ms, this gaming mouse can certainly keep up with the most intense, fast-paced games and encounters.",
    "It’s extremely responsive, accurate and fast. When you couple that with its 12 mechanical buttons, you have the potential to become an unstoppable force in MMO gaming – considering you also have the skills and talent, obviously.",
    "Testing the Corsair Scimitar RGB Elite Optical on a couple of games where its Key Slider feature comes in handy – Divinity: Original Sin 2, an MMO-like game, and Batman: Arkham Knight. With Divinity 2, we are able to easily map all the spells and potions to the mechanical side buttons.",
    "This makes our play more efficient because we don’t need to move our hand around the keyboard to access the harder to reach stuff. More importantly, all of those 12 buttons – as well as the five other buttons – are incredibly responsive, and the mouse itself slides easily even without a mouse pad under it.",
    "It’s the same situation with Batman: Arkham Knight where you have an assortment of gadgets that need to be on hand at a moments' notice. Thanks to these mechanical buttons and the mouse’s responsiveness, we are able to easily switch between gadgets in the middle of combat and immediately deploy them.",
    "We haven’t noticed any latency, missed presses or inaccurate tracking, although the mouse could have used a couple more sliding pads underneath for even smoother gliding.",
    "We have also tested the mouse in Premiere Pro and Reason 11, a popular music production software, though not extensively, to see just how advantageous it is for content creation. And, we find that with this mouse, we’re able to bring up an effect, use a keyboard shortcut, quickly find a tool, and even create a macro to perform several simple tasks with just a click of a button.",
    "This functionality not only delivers a more seamless workflow when you’re editing a video or creating a music track, but also makes your process more time-efficient, as it does away with things like browsing through a menu to find an effect, or clicking two or three things to apply a setting.",
    "For example, in Reason 11, we assigned a macro that selects Click (enables click during recording), selects Pre-Click (enables a count-off) and then hits the Record button to start recording to one button on the Key Slider. These are obviously very basic tasks, but we selected them because these are menial tasks that are a typical and essential part of a musician friend’s recording process.",
    "Instead of hitting three buttons – the Click, Pre-Click and Record – this macro allows us to only press a single button on the mouse, saving us time. Sure, it’s only saving us a second or a fraction of a second, but you do the same for the more time-consuming tasks, those seconds will add up. That’s especially if you’re doing music production every single day, and you use those macros multiple times a day.",
    "We were also curious how this mouse would fare with games where you wouldn’t really require the additional 12 mechanical buttons, so we have tested it with Far Cry 5 and Sherlock Holmes: Crimes and Punishment as well.",
    "The mouse works perfectly for these two games as well, even with Far Cry 5, which is a very demanding and fast-paced AAA game. The mouse holds up under pressure, and we haven’t experienced any accidental presses. However, the side mechanical buttons don't really add anything to the experience.",
    "It’s in games like these where the marquee feature is somewhat wasted. If you’re not really using a lot of macros and shortcuts, the Key Slider is reduced to a glorified thumb rest, which is why we would only recommend the Corsair Scimitar RGB Elite Optical to users who would be able to utilize its 12 extra buttons to their full extent."
  ],
  "headers": {
    "0": "Two-minute review",
    "31": "Don’t buy it if..."
  },
  "links": {
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "Corsair Dark Core RGB Pro Wireless": "https://www.techradar.com/reviews/corsair-dark-core-rgb-pro-wireless",
    "Razer Viper": "https://www.techradar.com/reviews/razer-viper"
  }
}