{
  "source": "https://www.techradar.com/reviews/surveymonkey",
  "title": "SurveyMonkey review",
  "category": "computing",
  "updated": "2020-07-21T14:41:24Z",
  "author": "michael-graw",
  "summary": "SurveyMonkey is an extremely capable survey designer with a lot of flexibility and strong data reporting tools.",
  "verdict": "If you can get over the expensive annual plans, there’s a lot to like about SurveyMonkey. The software is easy to use, with tons of templates, advanced customization, and built-in data analytics.",
  "pros": [
    "Extremely user-friendly design interface",
    "More than 230 survey templates",
    "Supports advanced survey logic"
  ],
  "cons": [
    "Pricing forces you into an annual plan",
    "Template-driven design can be annoying",
    "Free users cannot export data to Excel"
  ],
  "article": [
    "SurveyMonkey is one of the most popular online survey tools, and for good reason. The platform is extremely user friendly, with a wide variety of templates and several features that speed up the survey design process. The main downside to SurveyMonkey is its pricing structure, which is expensive and forces you into an annual plan.",
    "So, is this the best survey software for your needs? Let’s take a closer look at everything SurveyMonkey has to offer to find out.",
    "SurveyMonkey is so popular in large part thanks to its free Basic plan. With this, you can create an unlimited number of surveys as long as they have less than 10 questions each. You can only have 100 responses per survey, but you still get access to most of SurveyMonkey’s essential data analysis features.",
    "Pricing for paid personal plans is designed to force you into a one-year subscription. Only the Standard tier is available on a month-to-month basis, but it costs $99 per month. At an annual rate, the same plan costs $372 annually. Meanwhile, the Advantage plan, which adds file uploads, A/B testing, and question randomization, only costs an extra $12 per year. The Premier plan, at a staggering $1,188 per year, gives you more control over survey branching and allows you to pipe in answer choices customized to fit the respondent.",
    "Business plans require a minimum of 3 users and are paid annually. The Team Advantage plan, for $25 per user per month, allows you to integrate payments into your surveys and provides numerous tools for multi-user editing of surveys. The Team Premier plan, which costs $75 per user per month, is similar to the Premier plan, but with those same multi-user editing features added in. SurveyMonkey also offers an Enterprise plan that includes a user management dashboard, Salesforce integration, and audit logs. You’ll need to contact the company to get pricing options for this plan.",
    "SurveyMonkey has a lot to offer, although you can expect to pay for a higher-tier subscription to get access to the more advanced features.",
    "SurveyMonkey has more than 230 survey templates on hand, separated into a handful of categories. The nice thing about these templates is that they’re designed with beginners in mind. The questions and answers are framed to eliminate most common biases, while also leaving plenty of room for you to tailor the survey to your needs.",
    "The software strongly encourages you to use a template, forcing you to choose one before you can start building a new survey. However, you can skip through these and create a survey from scratch, or change templates after you’ve begun the design process.",
    "SurveyMonkey offers 13 different question types, which includes just about everything you could want. In addition to basics like short answers and multiple choice questions, there are rating scales, interactive sliders, hierarchical drop-down menus, and image-based questions. Bear in mind that you’ll need an Advantage plan or higher to allow respondents to upload files to your surveys.",
    "One of the nice things about the SurveyMonkey designer is that instead of simply letting you pick a question type, you can pick entire questions from a pre-populated bank. Alternatively, the software uses artificial intelligence to automatically decide what type a question should be based on the content. These features are minor, but they can save a significant amount of time when designing a long survey.",
    "The wealth of options available after you create a question is very helpful for advanced designers. You have total control over formatting individual answer choices, which is something that most other form builders don’t offer. In addition, SurveyMonkey supports logic functions, allowing you to show or hide questions based on a respondent’s previous answers. The logic tools are robust enough to take multiple previous answers into account.",
    "There are also plenty of possibilities for what to do at the end of your survey. The software’s logic tools can be used to send respondents to different redirect pages based on their answers. For quizzes, SurveyMonkey will automatically grade answers (including short answer questions) and can display or hide the score from participants.",
    "SurveyMonkey’s data reporting tools are as impressive as the rest of the platform. You have a lot of freedom to change chart displays to suit your needs, and it’s possible to comb through free-form responses by searching for individual words. You can also dig down into your results by looking at individual questions or only respondents who answered one or more questions in a specific way.",
    "While this functionality means that you won’t need to leave SurveyMonkey for analysis in many cases, exporting raw data is simple as well. You can export data to Excel or to a CSV, and Advantage and Premium users can export to SPSS.",
    "SurveyMonkey’s user interface is remarkably easy to use. The dashboard walks you through a five-step process for creating, distributing, and analyzing a survey. This organization makes the editing process in particular easier, as all of your design options are located in a single place in the software.",
    "The preview functionality in SurveyMonkey is also nice, especially for novice form builders. The software tells you how long it expects your survey to take and scores your form based on how likely users are to complete the questions.",
    "All of SurveyMonkey’s surveys are designed to work on mobile, although the platform doesn’t offer nearly as much support for creating forms on the go. Helpfully, you have the option to distribute surveys by SMS message if you’re primarily targeting users on mobile devices.",
    "For the price you pay for SurveyMonkey, it’s nice to know that you get impeccable technical support. Email support is available 24/7, while Advantage, Premier, and business subscribers can expect answers in under one hour. Premier and business users also get access to phone support.",
    "SurveyMonkey is a very strong software, but it’s also quite pricey. Surveygizmo offers a much cheaper mid-tier plan with many of the same features and highly customizable survey logic. Alternatively, Typeform matches SurveyMonkey on templates, integration, and ease of use, and has more options for paying month-to-month.",
    "If you’re willing to pay for an annual plan and don’t mind the price tag, SurveyMonkey is hard to beat. The platform offers a seamless survey design and distribution process, as well as strong built-in data analytics tools. Attention to details like automatic question categorization, answer randomization, and flexible formatting help this platform to stand out even more. It also doesn’t hurt that SurveyMonkey provides extremely fast support for paying customers."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "14": "Interface and in use",
    "17": "Support",
    "18": "The competition",
    "19": "Final verdict"
  },
  "links": {}
}