{
  "source": "https://www.techradar.com/reviews/ulefone-armor-9-flir-rugged-smartphone",
  "title": "Ulefone Armor 9 FLIR rugged smartphone review",
  "category": "phones",
  "updated": "2021-11-12T16:46:09Z",
  "author": "desire-athow",
  "summary": "One of the big three Chinese rugged smartphone vendors ups the ante",
  "verdict": "Once again, Ulefone redefines the upper boundaries of what constitutes an exceptionally good rugged smartphone. With FLIR and an endoscope, the Armor 9 has the potential to become an essential tool in the arsenal of many tradespeople.",
  "pros": [
    "Great price",
    "Good performance",
    "Endoscope camera",
    "FLIR camera",
    "Big battery"
  ],
  "cons": [
    "Only 128GB storage",
    "Slower storage",
    "No VOC sensor"
  ],
  "article": [
    "We have followed the rise of Ulefone as one of the most prominent rugged smartphone vendors, alongside Blackview and Doogee over the past four years. While the Armor 8 has yet to land - it will be a 5G rugged handset - Ulefone introduced us to its latest rugged smartphone, the Armor 9.",
    "The unique selling point of the latter is an endoscope feature that can prove mightily useful for DIYers, tradesperson, field operators and more. Oh and there’s also a thermal FLIR camera which is essentially a Lepton 2.5 heat sensing module.",
    "The Ulefone Armor 9 bundled with the endoscope module sells for around $581 from Gearbest. You can get the smartphone by itself for $537 and if you don’t fancy buying from Gearbest, you can grab it from Amazon.com for $630 and in the UK on Amazon.co.uk for £469.99, both without the endoscope module.",
    "No big surprise when it comes to the design philosophy adopted by the Armor 9. This is a classic example of a rugged smartphone, combining plastic (TPU and polycarbonate) and metal with glass. The resulting product is a behemoth; this is a relatively bulky smartphone at 168.2 x 82 x 15mm for a weight of 320g. That is partly due to the extra electronics used for the FLIR camera, the endoscope connector, the bigger battery and the extra padding and protection that comes with an IP68/IP69K-rated, MIL-STD-810G certified outdoor smartphone.",
    "A 3.5mm audio connector hidden behind a flap can be found on the top edge of the Armor 9. At the opposite end is a Type-C connector, again hidden behind a flap.",
    "On one side of the phone are a rocker volume, a customizable button and a proprietary connector for the endoscope while the other houses the power button, the fingerprint sensor and a nano SIM/microSD card stray.",
    "At the rear can be found four camera sensors - which includes the FLIR Lepton sensor - and a quad-LED flash located above the Ulefone logo. The front is a standard Corning Gorilla protected glass panel with a water drop selfie camera. The four edges of the smartphone have been trimmed at 45 degrees to the longer sides to improve resistance to drops.",
    "First, the relatively big disappointment has to be the fact that there’s no 5G. Ulefone has already confirmed that there will be a 5G phone coming later this year, the Ulefone 8 5G, which will use a Mediatek Dimensity SoC. For now, the Armor 9 sports a Helio P90 SoC which packs eight CPU cores and an IMG PowerVR GM9446 GPU cluster.",
    "That is paired with 8GB of RAM, 128GB storage, a big 6,600mAh battery, a 6.3-inch full HD display with a 2340 x 1080 pixel resolution, a triple rear camera setup (64-megapixel, 5-megapixel and 2-megapixel), a front 8-megapixel sensor, 802.11ac Wi-Fi and Bluetooth 5.0.",
    "We also received an 18W (9V,2A) charger with a tempered glass screen protector, an OTG cable and an adaptor inside the box. Optionally, you can purchase a back clip, a sling, an arm band or a holder to carry the Armor 9 around.",
    "The Armor 9 runs on a clean, stock version of Android 10. In general the overall performance of the device was on par with that of other P90-based smartphones (Ulefone Armor 7E, Blackview BV9900 Pro, Ulefone Armor 7 or Doogee S95) but was behind in storage tests, which impacted one of our main benchmarks, PC Mark; slower eMMC memory could be blamed.",
    "We found the usual app bundle located in the aptly named digital toolkit. There’s a speedometer, a compass, a protractor and even a heart rate monitor. Sadly, no VOC sensor, something which would make the Ulefone Armor 9, the most complete rugged smartphone on the market but also add to the cost and bulk.",
    "As for the endoscope, it has to be manually secured to the side of the smartphone via a screw. The peripheral itself is a long cable (about 2m) that is flexible and waterproof. There’s an inspection camera at the end with an LED light and a set of small accessories including a reflecting mirror, a hook and a magnet. Expect to pay around $70 for it.",
    "There’s no Android smartphone that we know that comes bundled with an endoscope. However, if you are looking for a rugged Android smartphone with a FLIR camera, then there’s at least three you should consider.",
    "The CAT S62 Pro also has a FLIR camera, one which uses the superior Lepton 3.5 sensor. It is far more expensive than the Armor 9, has less system memory and a worse camera. However, CAT has aftersales support in more than 50 countries and has already confirmed that the S62 Pro will come with Android 11.",
    "The Blackview BV9900 Pro uses the same Lepton 2.5 sensor as Ulefone’s flagship model. It matches the Armor 9, almost feature for feature but is lighter, cheaper and has a much smaller footprint (which might also explain the much smaller battery).",
    "For $110 less, you can get the Blackview BV9800 Pro which runs on Android 9, has a weaker processor but features the all-important FLIR camera. Its main rear camera has 25% fewer pixels while its selfie camera has twice as many pixels as the Armor 9. It even almost matches the latter when it comes to the battery capacity.",
    "The Ulefone Armor 9 is the most accomplished rugged smartphone on the market thanks to the addition of an endoscope feature that nicely complements the FLIR Lepton camera onboard. There are few improvements we’d think of at this stage; 5G would be nice as would a VOC sensor, a 2D scanner (like on the forthcoming Blackview BV10000) and more, faster onboard storage (256GB maybe) but none of all this take away the fact that Ulefone’s new flagship smartphone is nothing less than an exceptionally good outdoor smartphone."
  ],
  "headers": {
    "2": "Price",
    "3": "Design",
    "7": "Hardware",
    "10": "In use",
    "13": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "Armor 9 bundled with the endoscope module": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1109286976042011300&p=https%3A%2F%2Fwww.gearbest.com%2Fcell-phones%2Fpp_3004342329574583.html%3Fwid%3D2000001",
    "Amazon.com": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08BC4H7D4%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3913496475404440600-20",
    "Amazon.co.uk": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB08FRF5FMD%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-5422238410251170000-21",
    "Armor 9": "https://www.ulefone.com/armor-9.html",
    "Ulefone Armor 7E": "https://www.techradar.com/reviews/ulefone-armor-7e-rugged-smartphone",
    "BV9900 Pro": "https://www.techradar.com/reviews/blackview-bv9900-pro-rugged-flir-smartphone",
    "Ulefone Armor 7": "https://www.techradar.com/reviews/ulefone-armor-7-rugged-smartphone",
    "Doogee S95": "https://www.techradar.com/reviews/doogee-s95-pro-rugged-smartphone",
    "CAT S62 Pro": "https://www.techradar.com/reviews/cat-s62-pro-rugged-smartphone",
    "Blackview BV9900 Pro": "https://www.techradar.com/reviews/blackview-bv9900-pro-rugged-flir-smartphone",
    "Blackview BV9800 Pro": "https://www.techradar.com/reviews/blackview-bv9800-pro-rugged-smartphone",
    "Blackview BV10000": "https://www.techradar.com/news/this-rugged-5g-smartphone-has-a-feature-that-no-other-5g-handset-offers-today"
  }
}