{
  "source": "https://www.techradar.com/reviews/honor-watch-gs-pro-review",
  "title": "Honor Watch GS Pro review",
  "category": "wearables",
  "updated": "2020-11-23T11:09:07Z",
  "author": "tom-bedford",
  "summary": "A well-rounded rugged smartwatch",
  "verdict": "This is what we like to see in an upgrade: the Honor Watch GS Pro adds to the Magic Watch 2’s winning formula, and the result is a great fitness smartwatch. The addition of bespoke outdoors features, a super-long-lasting battery, and the new ruggedized design make it a particularly great choice for those looking for an adventure companion. A few aspects of the device may irk – it’s pretty big, it doesn’t have too many lifestyle features, and it costs more than its sibling and some competitors – but if you’re looking for a rugged smartwatch it’s certainly worth considering.",
  "pros": [
    "Plenty of features",
    "Withstands damage",
    "Incredible battery life"
  ],
  "cons": [
    "Relatively high price",
    "Large body",
    "Poor notification handling"
  ],
  "article": [
    "Honor is best known for its smartphones, but its watches and fitness trackers are all seriously impressive too, and the Honor Watch GS Pro is another fine offering from the brand.",
    "Instead of releasing iterative updates to its Magic Watch line of smartwatches, in 2020 Honor has decided to produce two new devices, the Honor Watch GS Pro and Honor Watch ES. The latter offers solid fitness features in a dainty body; the former goes the other direction design-wise with a chunky and ruggedized body, and its fitness smarts are supplemented with features aimed at those who prefer the great outdoors to the gym.",
    "So the Honor Watch GS Pro is a rugged smartwatch, but that description doesn’t just apply to its body, which has a more hardy and durable build than the 2019 Honor Magic Watch 2, the device it effectively supersedes. There are new fitness tracking modes designed for adventure activities, atmospheric monitoring tools, and other features aimed at outdoors types.",
    "These tools are in addition to Honor’s already-great suite of fitness-tracking modes, which are super-useful for budding fitness fans, even if they don’t quite match those on professional-tier trackers. There are also new features catering to users of all stripes, so this watch is great for those who like to track workouts of any kind.",
    "As the four-star rating at the top of this review suggests, the Honor Watch GS Pro is a pretty great watch all around, though there are a few minor annoyances that stop us recommending it unreservedly.",
    "In addition to its range of adventure tools, we’ve got to commend the design of the Honor Watch GS Pro. It’s built to last, with materials that ensure it’ll easily withstand drops, bumps and scratches. It’s also got a fairly minimalist design – at least, for a rugged watch – with side buttons instead of crowns and a relatively thin outer bezel.",
    "The battery life is possibly the best part of this smartwatch though, as it outlasts nearly every other major smartwatch we’ve tried. You can use it to track two straight days of exercising, and if you’re not making extensive use of the fitness features it can last up to a month between charges. Honor smartwatches tend to have great battery lives, but here it’s ridiculously good.",
    "So what about that missing star? Well, that’s mainly due to the usual complications (pun intended) of rugged devices. The Honor Watch GS Pro is big, and some may find it uncomfortably large, especially when wearing it while sleeping or for arm-based workouts. It’s also the most expensive Honor watch by quite some margin, and while it’s not outright expensive, people who like Honor wearables for their low prices might balk at the cost.",
    "A common issue with Honor smartwatches resurfaces here too, in that their lifestyle features are limited. Sure, notification handling is here, as well as music control and a few other things, but you can’t send messages, view images or access third-party apps, unlike on Wear OS or WatchOS devices, which might put off some people.",
    "Still, if you’re looking for a rugged watch this is certainly one to check out – and even if you don’t need an adventure-ready timepiece, you might find it useful for a range of other activities.",
    "The Honor Watch GS Pro was unveiled at IFA 2020 in September 2020, alongside the Watch ES, and went on sale shortly after. It’s available in the UK and Europe, but Honor doesn’t market its products in the US, so don’t hold your breath for a release there. Some of its products do appear in Australia, but at the time of writing we have no word on a release there.",
    "The Honor Watch GS Pro costs £219 (roughly $300 / AU$400), which is pricier than the Watch ES by quite a bit, as that device costs £99.99 (roughly $130, AU$175). For context, the Honor Magic Watch 2, which was the brand’s 2019 smartwatch, cost £159.99(roughly $210, AU$305), so the GS Pro is a new-high price for the brand’s watches.",
    "That said, it's probably more useful to compare the Watch GS Pro to other outdoors-focused devices like the Amazfit T-Rex, which costs $139.90 (around £110 / AU$200), or the $499 / £429 / AU$799 Suunto 7. So, rough conversions notwithstanding, it’s a roughly mid-range price tag for this kind of watch.",
    "The Honor Watch GS Pro comprises of the large body and two detachable straps – the straps are a little fiddly to get off, as the catches are rather small, but this does mean they’re unlikely to come loose when you’re wearing the watch.",
    "The straps are long, with plenty of holes, which gives you versatility with how tight or loose you want the watch and ensures the watch will fit most wrist sizes, and also makes the band slightly more breathable. They’re made of fluororubber, which we found smooth and comfortable to wear, and can be less of an irritant for people with skin conditions than other popular strap materials. The bands also have two loops, so you won’t have to worry about excess strap flapping about.",
    "As we’ve mentioned, the body is large – its height and width are both 48mm; we don’t have an official measurement for its thickness, but we’d put it at about 15mm. This size is matched by its weight, which at 45.5g (for just the body) makes this one of the heaviest watches we’ve tested.",
    "That makes the Honor Watch GS Pro a chunky device, and some people with smaller wrists might find the watch too big for them. When it was strapped to our wrist it protruded quite a bit, enough that we sometimes bumped it on our desk or other furniture; thankfully it’s protected enough to save it from damage if you do hit it on things.",
    "The GS Pro has passed the military-grade IL-STD-810G tests, is water-resistant to 50 meters, and has a stainless steel bezel – not surprisingly it feels appropriately rugged and well protected from the elements.",
    "The Honor Watch GS Pro doesn’t have crowns like its predecessor – instead, it has two rectangular buttons. These don’t stick out by much, but we found them easy to find and press without having to look at the watch.",
    "Around the screen is a raised stainless steel bezel – it’s not too big, but we found that it does protect the screen to an extent. This has compass markings on – although these are purely decorative as the bezel doesn’t actually move.",
    "So, given its large and rugged build, how comfortable is the Honor Watch GS Pro to wear? We didn’t find it as much a burden as its size suggests, and it doesn’t feel too heavy either, but we did find ourselves taking it off when we wanted to properly relax – and you’ll never completely forget that it’s on your wrist.",
    "The display here is a 1.39-inch AMOLED touchscreen with 454 x 454 pixels and 800 nits max brightness – this is one of the areas where the Watch GS Pro seems most related to the Magic Watch 2, as the display looks to be the same, though there are a few tweaks.",
    "When viewing watch faces, workout graphs and other complications, the colors look bright and vibrant, so you can easily tell what you’re looking at. The touchscreen is easy to use and intuitive, and we rarely had issues with our touches not being picked up.",
    "There’s an always-on display on the Watch GS Pro, and it’s pretty bright, which fixes an issue we had with the Magic Watch 2 – the always-on display on that device was rather dim. Always-on displays are a feature that can persuade people to buy a watch, so if that’s you, this could be the clincher. Another cool feature is that you can set your own watch faces using the Huawei Health tie-in app (more on that later), so you can use a photo of a loved one, a pet or yourself as your background. You might find yourself the subject of some judgement if you go for the latter though.",
    "The Honor Watch GS Pro runs Huawei’s LiteOS (Huawei is Honor’s parent company), and it’s not hugely changed here from the software on previous devices, save for the addition of new health and fitness features, which we’ll detail in the next section.",
    "The watch faces are set out in such a way as to strongly focus on health and fitness: swipe from the ‘main’ face and you’ll find a heart rate chart for the day, then your stress chart, then weather, then music handling, then sleep tracking. Press the bottom button and you jump straight to the workout menu; press the top one and you’re taken to the app list, which includes breathing exercises, remote phone shutter (for controlling your phone camera), a compass, notifications, all the features also found on the home menu, and a few more tools.",
    "Navigating all of this feels smooth and intuitive, with apps and menus feeling quick to open or close. Most of the lifestyle features are useful – music handling automatically detected Spotify playing on our smartphone and let us control the songs, and the weather app always provided predictions accurate to our location, for example.",
    "The remote shutter feature enables you to take pictures on your phone without having to touch the handset, which is perfect for your mountaintop selfies, for example. It worked well on the Huawei phone we paired the watch with, and you can even set the camera self-timer via the watch.",
    "Some may take issue with the lack of communication options though, especially anyone who’s used to WearOS or WatchOS devices. You can read most notifications on the watch, but you can’t view images you’re sent, multiple messages from the same app tend to get bunched up so you can’t read them individually, and you can’t reply to messages from the watch – that’s also the case on many other smartwatches, but some do give you the ability to communicate via your wrist, not just read messages.",
    "There are also some dedicated adventure features here that outdoors types are likely to find useful. These include air pressure and altitude monitors, both of which could be handy for people trekking in mountains or in high-altitude regions. There’s also a severe weather warning, which could prove vital, and sun, moon and tide monitors, telling you the time the sun and moon will rise and set and the timings of high and low tide (and were generally accurate in our testing).",
    "Also, unlike Honor’s previous watches, the GS Pro has built-in GPS, so you don’t need to have a Bluetooth-paired phone in order to get accurate location data.",
    "Finally in this section, let’s briefly look at the tie-in app – the Honor Watch GS Pro requires you to have the Huawei Health app on your phone in order to set up and run the watch. This app lets you change your watch face (and add your own pictures to it), view health records from the watch, and control some other features, such as which apps can send notifications to the smartwatch.",
    "Huawei Health is one of the best wearable tie-in apps you can get, and it’s a super-useful companion to the Watch GS Pro. Historical fitness data is presented on a graph, though you can view data on individual workouts if you prefer, and sleep tracking breaks down the different sleep phases you were in over the course of a night, and gives you advice on how to improve your sleep.",
    "There’s also a huge selection of watch faces to pick from, including an online store with paid or free options.",
    "Now we come to the reason why you’re likely considering the Honor Watch GS Pro: its fitness features.",
    "There are plenty of returning fitness features here from other Honor wearables. There’s a suite of roughly 100 fitness tracking modes, ranging from the normal ones like running and cycling to niche ones like belly dancing, kendo and laser tag. Each of these gives you plenty of metrics, from distance, duration and calories burnt to pace, cadence, altitude change, how well you’ve improved from prior workouts, and the suggested time until you should next work out.",
    "In our testing, all these metrics seemed pretty accurate, and we never felt confused by an odd-looking stat. Our only criticism of the fitness tracking would be the watch’s keenness on it – the GS Pro tries to auto-detect walking exercises, but this often means that a quick trip to the shops will trigger constant notifications from the device asking if you’d like to start a workout.",
    "Present in the Honor Watch GS Pro are a series of virtual running courses, which the Watch ES didn’t have, though the Watch 2 did. These guide you through specific runs, telling you how to pace yourself in order to build stamina or increase speed – for example, HIIT Run alternates sprinting and jogging, and the watch will tell you when to change. For people looking to get better at running, especially trail running (this is a rugged watch, after all) this could be very useful.",
    "Talking of rugged features, as we’ve mentioned there are a few new additions tailored for outdoors activities. First, there are some new fitness features that join the stable of existing ones, including Trail run, Hike and Mountain hike. There’s also a new skiing mode, which gives you useful data like distance climbed, data on runs you’ve completed, and calories burnt (so you can work out how many hot chocolates you’ve earned).",
    "Of all the potentially life-saving features in the Honor Watch GS Pro, perhaps the coolest is Route Back mode. This GPS feature allows you to track an outdoors adventure, and then helps you navigate your route back to your starting point, so you won’t end up lost in the hills.",
    "When you’re not working out the GS Pro has a few useful ambient trackers for heart rate, steps, stress and sleep. These all feel accurate, especially steps, as Honor’s smartwatches are more adept than most at distinguishing, and discounting, non-step motion. We weren’t too keen on using the watch to monitor sleep though, simply because its size makes it uncomfortable to wear at night.",
    "Honor’s smartwatches tend to be super-useful for fitness fans, especially people who aren’t hugely experienced runners but want to get better, and those with more niche exercise interests; and with the GS Pro Honor has added ‘outdoorsy people’ to its list of audiences. We’ve always been impressed with the fitness suite in the brand’s wearables, and it’s no different here.",
    "The Honor Watch GS Pro has incredibly impressive battery life, and people who are used to an Apple Watch or similar, which tend to only last a day or so, will be surprised that a watch can even last this long.",
    "Honor states that the Watch GS Pro lasts 28 days between charges, or a full month – in our testing, we’d put that figure at closer to three weeks, but we were using the watch pretty intensively, so four weeks certainly seems possible.",
    "Four weeks, three weeks… anything in this region is very impressive for a smartwatch, and it makes charging the device such a rarity that you’ll likely forget where you left the charger. With the GS Pro lasting this long you’ll never feel worried about it running out of charge when you’re out and about, and it also makes it great for longer expeditions where you’re not able to power up your devices frequently.",
    "We’d guess that such strong battery life is thanks to smart software optimizations at play, as Honor wearables tend to have great batteries.",
    "Charging is via a proprietary pad that clips magnetically to the watch and plugs into a USB port. Despite the battery’s obviously high capacity, charging didn’t take too long – we found it took about an hour to fully charge the watch from empty.",
    "First reviewed November 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Honor Watch GS Pro price and availability",
    "13": "Design",
    "21": "Display",
    "24": "Performance and software",
    "34": "Fitness",
    "42": "Battery life",
    "47": "Don't buy it if..."
  },
  "links": {
    "Honor Watch ES": "https://www.techradar.com/reviews/honor-watch-es-review",
    "Honor Magic Watch 2": "https://www.techradar.com/reviews/honor-magic-watch-2",
    "Amazfit T-Rex": "https://www.techradar.com/reviews/amazfit-t-rex-review",
    "Suunto 7": "https://www.techradar.com/reviews/suunto-7"
  }
}