{
  "source": "https://www.techradar.com/reviews/benq-sw321c-photovue",
  "title": "BenQ SW321C PhotoVue professional monitor review",
  "category": "computing",
  "updated": "2020-08-03T13:49:32Z",
  "author": "paul-burrows",
  "summary": "A pro-level 4K photo monitor at a very accessible price",
  "verdict": "A number of new technologies take BenQ’s latest 32-inch 4K photo monitor up a step or two in terms of both performance and usability, but it still offers hard-to-ignore affordability.",
  "pros": [
    "Improved brightness and colour uniformity",
    "USB-C connectivity",
    "Hardware calibration with 16-bit LUT precision",
    "Price won’t break the bank"
  ],
  "cons": [
    "Main connection bay is hard to reach",
    "‘Paper Color Sync’ needs refining to be truly useful"
  ],
  "article": [
    "An increasing number of photographers are recognizing the importance of a dedicated photo monitor for image editing and print preparation, but the expense of pro-level displays has put many off. BenQ has emerged as the champion of affordability in this category and the PhotoVue series SW321C is its new 32-inch, 4K UHD offering. This is an increasingly popular combination of display size and resolution, with the pixel density of 137 balancing enhanced detailing with comfortable viewing characteristics.",
    "With each new generation of its photo monitors, BenQ is delivering improvements in performance and the SW321C incorporates a number of significant upgrades. There’s a new micro-fine anti-reflection coating called ‘Advanced Reflectionless Technology’ (ART) and a reworking of the ‘Uniformity Technology’ to address earlier issues of color and brightness variations. Specifically aimed at photographers is ‘Paper Color Sync’ which is a piece of software that enables the creation of a dedicated color setting based on the printer model, paper type and the color space.",
    "The SW321C’s 10-bit IPS-type panel has a wide color gamut, reproducing 99% of the Adobe RGB color space (so, obviously, 100% of sRGB/Rec.709) and 95% of DCI-P3, which is the cinematographic color space that’s taking over from Rec.709 and has a wider color gamut. In addition to the new ‘Paper Color Sync’ setting, there are 13 others which cover all the main still and video color spaces along with ‘M Book’ (to replicate a MacBook Pro screen) B&W, HDR, a custom setting and provisions for loading up to three calibration settings.",
    "The SW321C arrives with factory calibration and then allows for hardware calibration – which is independent of the computer’s video card – with a 16-bit LUT to more precisely manage the subsequent color correction curves. For video-makers, the monitor has CalMAN support for LightSpace video calibration and also supports HDR10 and HLG video input for post-production color grading.",
    "In operational terms, the SW321C offers a useful set of connections (and comes with no fewer than four cables), including USB-C with 60W power, which also means you only need a one-cable connection to the computer when performing hardware calibration. You also get a modular hood and the ‘Hotkey Puck G2’, a wired remote controller that bypasses the on-panel menu buttons and has customizable keys. Probably the greatest convenience this offers is the easy toggling between pre-assigned color spaces. Similarly convenient is the ‘GamutDuo’ display which shows mirrored images in two different color spaces (i.e. via two different inputs).",
    "Most notably, the SW321C’s uniformity of both brightness and color are the best we’ve seen yet on a BenQ photo monitor and on par with what we’d expect from a much more expensive model. The new anti-reflection coating is very effective indeed and ensures excellent color accuracy and contrast are seen at their best. Physically, this is a very well-built monitor with a number of conveniences which translate into increased operational efficiencies. Moving up to a 32-inch display with 4K resolution will never be a cheap exercise, but BenQ has just made it a whole lot more affordable.",
    "BenQ announced the 32-inch SW321C photo monitor in January this year and the screen began to ship not long after. It's available in stores now in most regions and will you back $2,000 / £1,599 / AU$3,199.",
    "This price includes the Hotkey Puck G2, modular shading hood and a set of cables (USB-C, USB 3.1, HDMI and Display Port/mini Display Port).",
    "On the physical side, the SW321C is styled like all BenQ’s current SW series monitors with a dark grey finish, an ultra-thin bezel, and easy-to-assemble stand. For a 32-inch display, the base plate is actually quite small so it doesn’t take up much space on the desktop, but obviously the panel needs some room to move. You need viewing space too, but not as much as would have been the case without this screen’s very effective anti-reflection coating.",
    "Don’t worry, it doesn’t take long to get very comfortable with a 32-inch display if you’ve been using something smaller. And the 4K UHD resolution is arguably the ‘sweet spot’ in terms of the crisp reproduction of fine detailing and the legibility of smaller text.",
    "After unboxing, assembly takes only a matter of minutes and the unit is supplied with a seven-piece modular hood, a generous set of connection cables (including USB-C and HDMI), a two-page calibration report and the latest G2 version of BenQ’s Hotkey Puck. The beefy stand offers a height adjustment range of 15cm and allows for both tilting and swivelling plus a full 90-degree pivot for a portrait orientation. Overall stability is excellent.",
    "BenQ’s Hotkey Puck is a wired remote controller – circular-shaped, obviously – which bypasses the various mode buttons on the monitor’s bezel, allowing for easier navigation of the on-screen menus as well as – probably more conveniently– quicker switching between assigned color modes. It has its own recess at the base of the stand’s support arm, but can be positioned anywhere and works like a mouse except with a main rotary-type controller and a set three user-assignable function keys.",
    "Main connection bay is located along the underside of the monitor and includes dual HDMI 2.0 ports, USB Type C and Type B, and Display Port. This arrangement makes for tidier cable runs – there’s even an aperture in the lower section of the stand to keep everything together – but access isn’t quite so easy. In practice though, these are likely to be connections that aren’t going to be changed all that often.",
    "Easier to get to is the secondary set of ports inset on the side of the monitor – two USB 3.1 and an SD card reader – which you are much more likely to be accessing on a regular basis.",
    "BenQ built its reputation on affordable high-performance monitors for video and gaming, but a few years back it turned its hand to photo monitors and is now gaining a strong following in this sector. A few product design awards have helped, including the latest from TIPA (Technical Image Press Association) for Best Professional Photo Monitor for the SW321C. Given how hotly this category has been contested in the last couple of years, this is quite an achievement.",
    "But BenQ has been working hard to load its latest-generation with goodies specifically aimed at the photographer, such as ‘Paper Color Sync’, a useful bit of software that replicates the base tint of inkjet media to give a more accurate matching of screen to printer. This was a print-making factor that was previously pretty tricky to manage effectively.",
    "Furthermore, the SW321C arrives with factory calibration via BenQ’s ‘AQCOLOR’ – a color display technology designed to optimise color fidelity – with a 16-bit 3D LUT (look-up table) to manage input data accordingly and maintaining screen uniformity and consistency.",
    "Another bit of BenQ-developed technology is at work here and it’s called, logically, ‘Uniformity Technology’, although it’s the next-generation version on this model. It works by fine-tuning both the color and brightness of hundreds of sub-regions or areas across the panel to minimize any variations which would otherwise show up as color shifts. Likewise, there are no noticeable variations in brightness either.",
    "An important aspect of a dedicated photo monitor is the minimization of reflections and glare on the screen. The SW321C comes with a modular hood, but more important is its ‘Advanced Reflectionless Technology’ (ART), a special micro-fine matte surface coating designed to defuse reflected ambient light with far better efficiency than previously.",
    "As a result clarity, color and contrast are all more accurately displayed, which BenQ sees as being particularly necessary for Paper Color Sync to work effectively… given we’re talking such small and subtle variations in color and contrast here.",
    "In practice, we found ART to work so well we didn’t need to unpack the test monitor’s hood (although BenQ recommends that you do when using Paper Color Sync and we certainly would with longer-term use). Incidentally, a special screen cleaning roller also comes in the box, presumably better suited to the new surface coating.",
    "In a bit more detail, Paper Color Sync – which runs from free software downloaded to your computer – enables the input of the printer model, paper type (brand, surface finish, etc) and the color space which are then all configured into a color setting… so it’s essentially a soft proofing function.",
    "Since BenQ is creating these profiles itself (it has to, in order to take into account the monitor’s characteristics as well), the list of supported printers and papers is by no means exhaustive, but future software upgrades will add newly-released printers and media. Eizo’s ‘Quick Color Match’ function is a more sophisticated implementation, but this is still a good start on a photo monitor at this price point. The new Paper Color Sync setting is one of 14 available on the SW321C, which includes all the main still and video color spaces, B&W, HDR, one custom setting and provisions for loading up to three calibration settings.",
    "Another very useful feature is ‘GamutDuo’ which works in the monitor’s picture-by-picture (PBP) display and provides mirrored images in two different color spaces (i.e. via two different inputs). Each image is also fully adjustable independently, and this is a facility that would ordinarily need two monitors side-by-side.",
    "The SW321C has CalMAN support for LightSpace video calibration and Pantone certification for graphic designers. It supports HDR10 and also HLG video inputs and – thanks to a faster processor – will display native 24/25fps video without distortion or ‘pull down’ (also supporting uncompressed 10-bit 4:4:4, 4:2:2 or 4:2:0 color). Of course, it can handle native 4K UHD too.",
    "As with the other PhotoVue series monitors, SW321C’s display is an IPS panel with LED backlighting. It has a display area of 708.48mm x 398.52mm which, with the 4K UHD resolution of 3840 x 2160 pixels, gives 137ppi. It has 10-bit color processing delivers a palette of 1.07 billion, resulting in smoother shading, color transitions and tonal gradations. In-Plane Switching enables a fast response time of 5.0ms – a key spec for video-makers in particular – and a wide viewing angle of 178 degrees.",
    "In terms of reproducible colors, and as mentioned earlier, the SW321C delivers 99% of the Adobe RGB color space and 95% percent of DCI-P3 which is a cinematographic color space. It’s taking over from sRGB – or, rather, its video equivalent, Rec.709 – as the standard for color reproduction on transmissive displays, including tablets and smartphones.",
    "Each SW321C monitor is delivered to you individually calibrated and comes with a printed factory report, but the hardware calibration – via an external colorimeter – can be subsequently performed via BenQ’s proprietary Palette Master Element software (which is supplied on a CD-ROM). The value of hardware calibration on a photo monitor is that it bypasses the computer’s video card and color management with, in this instance, the much greater color precision of 16-bit processing (giving 65,536 levels per color). Consequently, hardware calibration is generally considered superior to software-based calibration (which also requires a colorimeter), but the latter will still ensure that the monitor is kept within specifications over time.",
    "The monitor’s connection bay includes a USB-C port which, among other things, provides the convenience of a one-cable connection to the computer when performing hardware calibration (and has 60 watts power available).",
    "To test this monitor’s performance we ran software-based calibration using the SpyderX Elite colorimeter from Datacolor (which is also supported for hardware calibration in the current version of the PME software). DisplayCal’s scores for color gamut, tone response, white point uniformity, contrast, luminance uniformity, color uniformity and color accuracy were excellent. Most notably, the uniformity of both brightness and color are the best we’ve seen yet on a BenQ photo monitor and on par with what we’d expect from a much more expensive model.",
    "There’s still some good arguments for using HD/QHD res monitors for photo editing, but 4K combined with an expanded color space reproduction represents a big step up in terms of more accurate rendering with finer tolerances and, in turn, access to more precise editing control.",
    "BenQ builds on this with the SW321C’s significantly improved uniformity of both color and brightness – and across a big display area too – plus the very effective ART anti-glare coating. It also offers excellent repeatability and reliability via hardware calibration, the convenience of USB-C connectivity and the potential for even more from the nascent Paper Color Sync function.",
    "BenQ has already indicated its intention to be a serious player in the photo monitor business, and the SW321C is the most convincing evidence of this so far. From the physical build quality to the display performance, it qualifies as a pro-level reference monitor on every level, except one… it’s still affordably priced.",
    "[First reviewed in July 2020]"
  ],
  "headers": {
    "0": "One-minute review",
    "6": "BenQ SW321C price and availability",
    "8": "Design",
    "14": "Features",
    "25": "Performance",
    "30": "Verdict",
    "33": "Don't buy if..."
  },
  "links": {}
}