{
  "source": "https://www.techradar.com/reviews/mindmeister",
  "title": "MindMeister mind mapping tool review",
  "category": "computing",
  "updated": "2020-07-23T14:33:56.524Z",
  "author": "katie-horne",
  "summary": "Great mind mapping tool with clean, modern user interface",
  "verdict": "Powerful mind mapping tool with clean, modern user interface",
  "pros": [
    "Includes well-designed templates to help you get started",
    "Has an easy-to-use, clean interface"
  ],
  "cons": [
    "Can be used for limited applications",
    "Support contact options limited"
  ],
  "article": [
    "In 2006, Michael Hollauf and Till Vollmer founded their company, Meister, launching MindMeister a year later. It’s a web-based, cross-platform app that helps you capture your ideas, develop them, and share them visually with others. MindMeister can be used for brainstorming, planning projects, taking notes, and more.",
    "Today, Meister is an international company that employs 50+ people in Munich, Vienna, and Seattle. Over 14 million people use MindMeister, and the company’s second product, MeisterTask, is a well-regarded collaborative task management platform.",
    "If you are new to MindMeister, you can use the Basic plan free of charge. Though limited (you can only create a maximum of three mind maps), you can still test out most of the functionality included in MindMeister and receive support from the Meister team via email.",
    "Users who want to create a larger number of mind maps should opt for one of the paid subscription plans. If you upgrade to the Personal plan, you get the ability to create as many mind maps as you would like, attach files and images, and print your mind map or export it as an image or PDF.",
    "Upgrading to the Pro plan gets you access to team accounts and management tools, more customization options, and additional export options. The Business plan comes with regulatory compliance features, a custom domain that your collaborators can use to access your projects, and priority support via email and telephone.",
    "Meister offers discounts to those affiliated with academic or nonprofit institutions. If you want both mind mapping software and task management tools, you can purchase both of Meister’s products at a 30% discount.",
    "When creating a mind map, you can get started with a blank document in the drag-and-drop editor. However, if that’s overwhelming, you can choose to begin with one of the templates provided by MindMeister instead. The map template library has many options from which you can choose, including ones for brainstorming, taking notes, and writing a business plan.",
    "MindMeister features collaboration tools that allow you to share your mind maps with as many people as you'd like. They can comment and edit in real-time, which makes sure that everyone is on the same page.",
    "The History Mode included with MindMeister lets you see all of the changes that have been made to your mind map over time. You can see when the changes were made as well as who made the change.",
    "MindMeister allows you to create various types of mind maps, and the app includes templates to help you get started. The drag-and-drop editor allows you to work on your mind maps with ease, and you can upload custom items, such as background images and logos, for use with your projects.",
    "If you need to present your ideas, MindMeister has features that help you turn your mind maps into presentations similar to those you would create with Microsoft Powerpoint or Google Slides.",
    "Meister also puts out MeisterTask, which is a task management suite. It integrates well with MindMeister if you are interested in placing mind maps into your task and planning notes.",
    "MindMeister’s clean, modern interface is appealing, and the various toolbars make it easy for you to find the features you want to use. There is a learning curve as you get used to where MindMeister has placed certain things, but for the most part, we found it easy to get started with a template and add, edit, or remove items.",
    "MindMeister also offers a mobile-friendly version so that you can view projects as well as create, edit, or comment on mind maps when you’re away from a laptop/desktop. The apps were fairly well designed, but as mind maps got bigger, we found it more challenging to work on the smaller screens.",
    "The searchable MindMeister Help Center includes step-by-step how-to articles as well as answers to some of the most frequently asked questions. MindMeister also offers tutorial videos and training courses.",
    "If you want to reach out to the MindMeister team, you can do so via email. Those with the enterprise-grade Business subscriptions receive priority email and telephone support.",
    "If you want to look at several options for mind mapping before making your final decision, there are several alternatives you should consider, including Lucidchart and Draw.io.",
    "Lucidchart is a web-based diagramming and flowchart creator tool that, while not strictly designed for mind mapping, can be used for such. It comes with some fairly advanced features, including built-in data/analytics tools. However, Lucidchart tries to make its product accessible despite its power feature set and functionality.",
    "If what you’re looking for is a simple, easy-to-use solution for quick drawings, consider Draw.io. It is free to use, and though it doesn’t pack a punch the way MindMeister and Lucidchart do, it may be sufficient for simple drawings.",
    "MindMeister is a powerful, feature-rich mind mapping tool that can be used to visually convey your ideas. Furthermore, MindMeister comes with useful tools that facilitate collaboration, track changes to mind maps over time, and more.",
    "Though the product’s applications are somewhat limited and the support team offers only email-based contact to most users, MindMeister is nevertheless a great option for its intended audience."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Features",
    "12": "Interface and in use",
    "14": "Support",
    "16": "The competition",
    "19": "Final Verdict"
  },
  "links": {}
}