{
  "source": "https://www.techradar.com/reviews/private-wifi-vpn",
  "title": "Private WiFi VPN review",
  "category": "computing",
  "updated": "2020-12-04T10:05:45Z",
  "author": "sead-fadilpasic",
  "summary": "Secure but very limited",
  "verdict": "Besides the essential online privacy and security, as well as some extras that come in handy when connecting to public WiFi networks, Private WiFi doesn’t really feature any qualities that make it stand out from the crowd. You can’t use it for watching Netflix or BBC iPlayer, torrenting, or pretty much anything else beyond browsing, while its location and poor speeds make its pricing less than reasonable. But at least it has a risk-free 10-day free trial.",
  "pros": [
    "A few useful features",
    "Simple apps",
    "10-day free trial",
    "Various pricing options"
  ],
  "cons": [
    "Poor speeds",
    "Doesn’t unblock Netflix or BBC iPlayer",
    "Doesn’t support torrenting",
    "Can be expensive",
    "Poor customer support"
  ],
  "article": [
    "Private WiFi is a VPN platform that has existed since 2010 and was created in response to the articles in The Wall Street Journal, Forbes, and The New York Times about the security vulnerabilities of WiFi hotspots. Since then, the provider has gathered the attention of VPN users and media alike, with The New York Times calling it the “VPN for the masses”.",
    "However, unless your one and only concern is being safe on public WiFi networks, you’ll find more suitable solutions among today’s best VPN providers.",
    "All new users will have the chance to test Private WiFi’s services during a free 10-day trial that gives you unrestricted use of the platform and you don’t even need to leave your financial details.",
    "As for its payment options, there’s a pay-as-you-go one that allows you to use any number of devices and pay $1.99 per 1GB of traffic you use or $7.99 per 10GB data chunk. Prepay subscriptions are monthly and annual and depend on how many devices you intend on using, while the allowed data traffic is unlimited. So under the monthly subscription, you’d be paying $2.99/month if you only want to cover 1 device, $9.99/month for up to 3 devices, and $12.99/month for up to 5 devices.",
    "The annual subscription provides more value for the money and is charged $29.99/year (equals to $2.50/month) for 1 device, $79.99/year (equals to $6.67/month) for up to 3 devices, and $99.99/year (equals to $8.33/month) for up to 5 devices. Private Wifi accepts payments made via credit/debit cards and PayPal.",
    "If you end up disappointed with the provider’s services for any reason, there’s a 30-day money-back guarantee during which you can ask for a refund of your unused VPN time.",
    "Private WiFi may be a good choice if you want to stay safe on public WiFi networks but if you want a complete VPN platform, you might want to get a closer look at some of the industry’s larger players, like ExpressVPN, NordVPN, Surfshark, or CyberGhost, all of which offer a lot more features and qualities at more appropriate rates.",
    "Being able to provide its users with access to major VOD services like Netflix, BBC iPlayer, Hulu, Amazon Prime Video, etc. that are often blocked in certain regions is one of the most sought-after qualities in a VPN. Unfortunately, Private WiFi fails in this department, so if having access to some of the geo-restricted streaming services is the main reason you’re seeking a VPN, you will have more luck with the competition.",
    "Private WiFi is the flagship product of Private Communications Corporation, a privately held company founded in 2010, in Sherman, Connecticut. It has servers in countries like Turkey, India, and Mexico, which can be seen on a map. Many of the server locations are clusters of multiple servers but we failed to find out how many servers there are exactly and no one from the company has responded to our email as of yet.",
    "Private WiFi uses the standard 256-bit SSL encryption, along with WEP and WPA protocols used for protecting wireless networks. We couldn’t find any information about whether torrenting was allowed, and customer support seemed to ignore us, so it’s safe to assume that it isn’t, especially considering Private WiFi is registered in the United States.",
    "Extra features include an ad blocker, as well as data compression that can reduce the amount of bandwidth your encrypted connection uses.",
    "Whereas many competitors detail all the information they do and don’t log when you’re connected to their services, Private WiFi only gives us only a few sentences: “We do maintain a set of logs necessary to manage our servers. However, the only information that is traceable to individual users is the time on and off our network and the number of the total bytes transmitted. We do not monitor or record the sites that you visit nor the contents of any Internet communication.”",
    "The provider hasn’t yet invited an independent auditor to check its platform for logging, so we only have its word for it, so considering this, the lack of detail in the privacy policy, and its location, we advise caution.",
    "Private WiFi has apps for Windows, Mac, Android, and iOS. The iOS app has a rating of 3.2 stars (out of 5), as judged by 31 people. It was last updated on May 9, 2018, with improvements in terms of faster activation and improved handling of server locations. As for its Android app, its rating is 3.5 as decided by the jury of 377 users (out of 10,000+ that installed it). The app was last updated on July 28, 2020.",
    "Customer service is available via email only, between 8:00 am and 12:00 am EST. However, before you reach out to them, try consulting the provider’s FAQ section on the website, because you’re going to have a hard time getting an answer. We still haven’t gotten one.",
    "We first measured download speeds of the server in Germany to which the app connected us automatically on the basis of our physical location but we only got 11.57Mbps on a 63Mbps testing connection. Then we tried a server in England, which also had below-average results - only 7.8Mbps. We then decided to give a server in New York a go and it performed expectedly poorer, hailing only 3.4Mbps. A server in India was even worse, reaching only 2.6Mpbs.",
    "The Private WiFi Windows app is very simplistic, in terms of use and look. There isn’t much to write home about in terms of features, except turning on/off the ad blocker and/or data compression, defining the app’s automatic behavior - automatically activating when you’re connecting to an unsecured WiFi connection, any Internet connection, or activating manually. The ‘advanced’ settings for some reason only include choosing the server location and whether you want the location to be set as default. This makes server switching a bit more inconvenient since you have to open the app’s settings each time you want to make the switch.",
    "Private WiFi may look nice from the outside but dig a bit deeper and you’ll discover that it really doesn’t have much to brag about, and that includes download speeds, support for torrenting, unblocking of popular geo-limited VOD content, or even decent customer support.",
    "It’s nice that it features simple native clients for major platforms and the industry-standard privacy tools, as well as allowing you to connect up to 5 devices at the same time but ultimately, this VPN solution doesn’t come anywhere near the big players such as ExpressVPN."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "13": "Support",
    "15": "Speed and experience",
    "17": "Verdict"
  },
  "links": {
    "Private WiFi": "https://www.privatewifi.com/",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Private Communications Corporation": "http://www.privatecommcorp.com/",
    "map": "https://www.privatewifi.com/server-map/map.html",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "iOS app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5552428378385987000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fprivate-wifi-personal-vpn%2Fid576420170",
    "Android app": "https://play.google.com/store/apps/details?id=com.privatewifi.pwf.hybrid&hl=en",
    "FAQ section": "https://www.privatewifi.com/faq/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-9160009902341732000"
  }
}