{
  "source": "https://www.techradar.com/reviews/lhmzniy-a9-141-inch-laptop",
  "title": "Lhmzniy A9 14.1-inch laptop review",
  "category": "computing",
  "updated": "2020-03-04T06:44:29Z",
  "author": "desire-athow",
  "summary": "A notebook with an unpronounceable name but will it deliver?",
  "verdict": "The Lhmzniy A9 is a split personality laptop; it delivers a rounded performance in a great package but the amount of noise it generates can be unbearable at times.",
  "pros": [
    "The finish",
    "The price",
    "Dual-channel memory",
    "Windows 10 Pro by default",
    "The specs",
    "The webcam cover",
    "Tiny charger"
  ],
  "cons": [
    "Screen doesn't hold",
    "Very very noisy",
    "SSD split into two",
    "A bit light on connectors"
  ],
  "article": [
    "One of the most recurrent criticisms about laptop vendors is that they tend to pair slow processors with absurdly low amounts of system memory and the worst sort of storage that money can buy.",
    "We have lost count of the number of laptops we’ve reviewed that pair an Atom CPU with 4GB of RAM and 64GB eMMC storage; essentially the perfect recipe for the worst possible Windows 10 experience. So it was very, very refreshing to see an obscure Chinese laptop vendor - Lhmzniy - buck the trend with a new laptop, the A9.",
    "Available in silver, the notebook comes with capacities ranging from 128GB to 1TB SSD. What makes it even more enticing is the 16GB system memory it has by default on two slots.",
    "The polished brushed gun metal finish of the A9 is reminiscent of the old Dell XPS 13, a favourite of ours. According to the vendor, the magnesium aluminum alloy used will make it more secure and, shall we add, a bit lighter while being a better heatsink as well.",
    "At 1.44kg for thickness of 16mm (excluding the four rubber feet) and a footprint of 317 x 208mm, it is actually very portable given that it carries a 14-inch display (rather than a 13.3-inch one). It has two USB 3.0 ports (full size), an inverted HDMI connector, a microSD card, an audio plug and a proprietary power port, all positioned on the right and left side of the device.",
    "We’d have loved to see at least one USB Type-C connector and perhaps another traditional USB port. Four speaker grills can be found below the device with a bank of narrow slits to allow air circulation. There’s a flap that hides a tiny SSD, which is user replaceable.",
    "Other than the distinctive Lhmzniy logo, that looks like a superhero one, there’s hardly anything that betrays its humble roots. Lift the lid and you will find a 14-inch IPS display with hardly any bezel (again a nudge at the XPS 13 range) and a glass overlay.",
    "Another feature inspired by Dell's premium laptop range is the placement of the 2-megapixel webcam, located on the screen hinge, due to the lack of space on the top bezel. Uniquely amongst entry level devices, this one comes with a privacy flap.",
    "The A9 is powered by a Kaby Lake R part, the Intel Celeron 3867U, which is actually a fairly new processor launched in 2019. It is still manufactured on a 14nm lithography and dissipates 15W on average which is a tidy amount of heat. More on that later.",
    "With two cores and two threads, don’t expect it to surpass any Core i3 CPU on the market although it should prove to be a worthy opponent to Gemini Lake parts (like the N4100) thanks to a 1.8GHz frequency. It features an Intel HD Graphics 610 GPU which should be adequate for most tasks. There’s two 8GB DDR3-1866 memory modules, allowing dual channel mode to be enabled for further performance gains. The SSD is a 1TB SATA model (N900) from an unknown vendor.",
    "Other features include a backlit keyboard, a 47Whr battery and a 47.5W (19, 2.5A) power adaptor that’s tiny, a welcomed change from the bricks we are used to.",
    "On paper, the A9 seems to be a runaway success but how did it perform in real life? Let’s start with the good things. Performance is great for a device in this price range especially on single core tests, the most common scenario. The fact that it has only two cores shows in multi-core benchmarks where it performed worse than the Celeron N4100 in the Teclast F6 Plus.",
    "Its storage subsystem however shone with above average read and write speeds, which means that the A9 will be speedy on data access, in other words, applications will open faster and so will files. We were also surprised to find that it had Windows 10 Pro rather than the usual Windows 10 Home a boon for businesses.",
    "As for issues we encountered, the level of noise seems to be the biggest issue. Under load, the device reached almost 50dB which is far more than what we’d expect from a non-gaming laptop. What makes it worse is the fact that the fan doesn’t stop spinning, it just does so at a lower RPM.",
    "At just over four hours, the battery life was more than adequate compared to its rivals. At full brightness, the display lacks a bit of definition partly because of the glare generated by the glass overlay. The colours appear to be a bit washed out, lacking contrast, a common complaint about touchscreens.",
    "The keyboard and touchpad are devoid of any major issues; the former is a bit noisy but has great feedback. The large footprint means that there is ample space for keys. Shift keys and arrow keys are single function and of generous dimensions.",
    "The big selling points of the Lhmzniy A9 are the 1TB SSD and the 16GB onboard storage; that’s the sort of specs you’d expect from a high-end machine. This also explains why none of the big vendors (Lenovo, Dell or HP) has anything that can match the A9.",
    "Dell’s cheapest laptop with 16GB and 1TB SSD costs a staggering $1,400. The Inspiron 15 7000 is an altogether different beast though with a touchscreen display, a 10th generation Intel Core i7 CPU and a dedicated Nvidia Geforce MX250 GPU.",
    "The other option is to use a third party like Newegg where the likes of Computer Nerd or Dealking customize laptops. The former sells the Lenovo IdeaPad 330 with 16GB and a 2TB SSD for $560. It does have a slower CPU and a lower-resolution screen plus is significantly heavier because of the onboard DVD-writer.",
    "Well the Lhmzniy A9 turned out to be quite a surprise; from the inclusion of Windows 10 Pro to the quality of the finish and smaller details like the privacy flap on the webcam, there’s plenty to be liked. But we can’t ignore the issues as well; this is a damn noisy laptop with a fan that doesn’t stop spinning, the drive is split into two for no reason and the screen tends not to stay in place."
  ],
  "headers": {
    "3": "Design",
    "8": "Hardware",
    "11": "In use and performance",
    "16": "The competition",
    "19": "The business take"
  },
  "links": {
    "Teclast F6 Plus": "https://www.techradar.com/reviews/teclast-f6-plus-convertible-laptop",
    "Inspiron 15 7000": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9508083685944943000/https://www.dell.com/en-us/shop/2-in-1-laptops/new-inspiron-15-7000-2-in-1-laptop/spd/inspiron-15-7591-2-in-1-laptop/n27591dshnh",
    "Lenovo IdeaPad 330": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-3751432902329536500&murl=https%3A%2F%2Fwww.newegg.com%2Fred-lenovo-ideapad-330%2Fp%2F1TS-000E-0FDV8"
  }
}