{
  "source": "https://www.techradar.com/reviews/samsung-odyssey-g9",
  "title": "Samsung Odyssey G9 review",
  "category": "computing",
  "updated": "2020-12-04T21:20:00Z",
  "author": "jackie-thomas",
  "summary": "Now this is ultrawide gaming",
  "verdict": "The Samsung Odyssey G9 is an exercise in luxurious PC gaming, with pretty much every feature under the sun thrown in for good measure. However with its high price, size and difficulty to drive, it's hard to make a universal recommendation.",
  "pros": [
    "Beautiful image",
    "Best HDR we've seen in a monitor",
    "Great design",
    "Good for multi-tasking"
  ],
  "cons": [
    "Very expensive",
    "Heavy",
    "Takes up a lot of space"
  ],
  "article": [
    "When you think of the best gaming monitors, the Samsung Odyssey G9 and monitors like it probably aren't the first thing that spring to mind. But in a space where fast refresh rates and 16:9 1080p and 1440p screens dominate, sometimes having something that is so all-out is a breath of fresh air.",
    "The Samsung Odyssey G9 is an absolute beast of gaming monitor, with a 49-inch display, a 5,120 x 1,440 resolution and 240Hz refresh rate – this is basically everything you could ever dream of in a monitor, all in one package. That's probably why it has an absolutely massive $1,479 (£1,289, AU$2,799) price tag.",
    "That's up there with some of the most luxurious gaming monitors on the market, like the $1,999 (£2,299, around AU$4,000) Asus ROG Swift PG27UQ, a monitor half the size with a lower refresh rate. We've certainly come a long way.",
    "A lot of the features in Asus' high-class gaming monitor are here too: the Samsung Odyssey G9 has G-Sync and HDR 1,000 compatibility, along with a wide 125% coverage of the sRGB color gamut. At its best, the Samsung Odyssey G9 is simply a stunning gaming monitor, with a stunning picture, so it's not hard to see why it's playing in this league.",
    "There is one potential annoyance, here, though. Because of the way the QLED display operates, the display is essentially separated into thirds. In, say, a loading screen, if there's a little icon present on the corner of the display, a whole third of the display will be illuminated, while the rest will remain dark. This is something that won't be present 99% of the time, but it is something to be aware of.",
    "Playing HDR-supported games like Destiny 2 is an absolute dream, with the colors simply popping off the screen, especially when exploring dark underground caverns, where the colors of guns and abilities stand in stark contrast to the background. That's where this monitor especially stands above the rest.",
    "We've also been playing a lot of World of Warcraft: Shadowlands on this monitor, and the sheer amount of screen real estate you have with a 32:9 monitor is so cool. In the past, we've been yelled at by raid leaders for having too many add-ons on our screen at any given time (we play a healer, sue us), as having a lot of stuff on a 16:9 screen can obscure your field of vision.",
    "With the Samsung Odyssey G9, all bets are off. You can put as much bullshit on your screen as you want, and you'll still be able to make out what's going on around you. In fact, that's what makes the Samsung Odyssey G9 so appealing to RPG players in general. The wide field of vision helps boost immersion in games like Assassins Creed Odyssey, while also providing a ton of utility in games like World of Warcraft.",
    "There is a caveat, though. This is not only a very expensive gaming monitor, but you're going to need a load of very expensive hardware to drive it to its full potential. The 5,120 x 1,440 display resolution isn't quite 4K, but it's close. Combine that with the 240Hz refresh rate, and you have a gaming monitor that graphics cards are going to be struggling to max out for years to come.",
    "To put that in perspective, even with an Intel Core i9-10900K and an Nvidia GeForce RTX 3090, we get around 190 to 200fps in World of Warcraft with ray tracing off and the graphics settings up to the \"10\" preset. So, even with the most powerful hardware in the world, this monitor is still incredibly difficult to drive. But, with something that costs as much as this monitor does, it's good that you'll still be pushing it in a few years once the next generation of hardware finally comes out.",
    "There's more than just gaming, though. This monitor is an absolute masterclass when it comes to productivity. Throughout the Black Friday and Cyber Monday deals season, we took advantage of the huge amount of real estate on offer, even having six browser windows open side by side at one point trying to get our hands on the PS5. That didn't work out – for other reasons. We would typically have two browser windows open, along with Slack, Discord, Spotify and a third small browser window with email open. All of this totally legible on a single screen.",
    "Samsung has also included built-in picture-in-picture and picture-by-picture support. This means you can treat this monitor as two displays, and we frequently did this. We're able to set up the Mac mini 2020 on one screen, and our gaming rig on the other. Another use-case is plugging two DisplayPort cables into a single PC, so you can treat the Samsung Odyssey G9 as two 27-inch 1440p displays. This helps a lot when you want to stream, and still have two displays.",
    "If you're a professional that needs to do a lot of multi-tasking all the time, and you do some gaming on the side, this monitor is something you need to experience for yourself.",
    "The Samsung Odyssey G9 is a gorgeous monitor too. The bottom bezel has this gunmetal gray textured finish with the Samsung label printed at the bottom. The sides and top aren't the thinnest bezels we've ever seen, but a screen this big and this curved, that's likely a limitation of the construction. They're pretty unobtrusive, though.",
    "On the bottom of the monitor, right below the status LED, you'll find the menu button, which you can use to mess with settings, adjust volume and enable features like picture-in-picture. The back of the monitor is made of white plastic with a futuristic pattern. There's a light ring in the back where the stand connects to the monitor itself that's RGB, and you can control the RGB through the monitor's own settings menu.",
    "Now, the Samsung Odyssey G9 is VESA-compatible, but we would actually advise against mounting it on most monitor stands. This is a heavy monitor, weighing 31.1lbs without the stand attached. That's as heavy as some TVs, so our advice is either to use Samsung's own stand or to make extra sure that whatever stand you're using can handle the vast weight of this thing."
  ],
  "headers": {
    "16": "Don't buy it if..."
  },
  "links": {
    "best gaming monitors": "https://www.techradar.com/news/best-gaming-monitor",
    "Asus ROG Swift PG27UQ": "https://www.techradar.com/reviews/asus-rog-swift-pg27uq",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "other reasons": "https://www.techradar.com/news/ps5-stock-sony-says-absolutely-everything-is-sold-as-supply-slows-to-a-trickle",
    "Mac mini 2020": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020"
  }
}