{
  "source": "https://www.techradar.com/reviews/optoma-cinemax-p2-4k-projector",
  "title": "Optoma CinemaX P2 4K projector review",
  "category": "audio-visual",
  "updated": "2020-11-09T17:00:34.705Z",
  "author": "steve-may",
  "summary": "Optoma drops the price, but keeps the good stuff",
  "verdict": "The beautifully-designed Optoma CinemaX P2 is proof that a projector doesn’t have to dominate your living space if you want to super-size your images. Picture quality is polished, and the onboard sound system is a blast.",
  "pros": [
    "Stylish Ultra Short Throw design",
    "Excellent onboard sound system",
    "Looks great with both 4K and HD sources"
  ],
  "cons": [
    "Less bright than its predecessor",
    "Doesn’t support HLG HDR over HDMI",
    "Smart app choice limited"
  ],
  "article": [
    "The Optoma CinemaX P2 is a second generation ultra short throw projector that offers big screen thrills without the need for a correspondingly big room. When placed close to a wall, it can cast an image in excess of 100 inches, and (thanks to a fully integrated sound system) it doesn’t need a great deal of floorspace either.",
    "While not as bright as its predecessor, Optoma’s original CinemaX P1, it’s bright enough to be used in rooms with some ambient light, although it’s at its best in dark room conditions.",
    "This projector may be 4K and HDR10 compatible, but HLG support is limited to USB sources, which means it doesn’t offer HDR with Sky Q. Given there is limited smart app support onboard, it’s best partnered with a media streaming stick, be it Fire TV or Roku, or an Ultra HD Blu-ray player.",
    "This isn’t a cinephile grade projector, but for most of us the convenient form factor should be ample compensation.",
    "The Optoma CinemaX P2 sells for £2,999 / $3,299. This represents a saving of around £300 / $300 on the original Cinema X, aka the UHZ65UST, a model which remains available. In terms of design, there’s nothing between the two, although this more affordable offering differs on some key parameters.",
    "Notably, contrast has been reduced from 2,500,000:1 to 2,000,000:1, and brightness is down to 3,000 lumens. The colour gamut has also diminished, with only 85 per cent of DCI-P3 now support, compared to 87 per cent on the original model.",
    "The P2 is clearly a cool looking piece of kit, and it’s not often you can say that about a projector. Stylishly finished in matte white, with complementary grey fabric grille and peekaboo lens up top, it looks suitably trendy.",
    "Connectivity is generous, with three HDMI inputs: two to the rear, one to the side. All are v2.0. There are also two USB ports, an optical digital audio output, Ethernet and a 3.5 mm audio jack output.",
    "As you might expect from an ultra short throw projector, installation is stress free. Unlike conventional projectors, the P2 can be positioned close to a white wall or screen – not quite flush, but as close as a standing TV would be. For many, this makes it a more achievable home cinema solution, not least because it doesn’t require intrusive ceiling fixings.",
    "With the P2 placed a metre away from a white wall, we could cast a massive image measuring 3m across. For the optimum possible brightness and contrast, the projector should be used with an ALR screen – Optoma has its own 100-inch ambient light-rejecting screen, the ALR101 for this purpose – but this rather undermines its unobtrusive appeal. Most buyers will simply sit it against a wall.",
    "This form factor makes it ideal for a small den or media room, when you might otherwise struggle to deliver such immersive visuals.",
    "The P2 plays the role of home entertainment hub well. It supports dual band Wi-Fi and has Bluetooth, so you can stream music from a smartphone to it when not binge watching telly, effectively using the projector as an over-specified Bluetooth loudspeaker. Remarkably, it sounds good enough to pull this off.",
    "It’s also smart in the connected sense: the main home screen offers access to a settings menu, input source and small selection of apps. We would avoid the app marketplace, though, as it's poorly organized and a bit overwhelming to navigate – while the likes of Netflix is limited to low-res (not even HD) streaming.",
    "The P2 loses points for the OS, then, but it's relatively easy to plug in a streaming stick to replace the apps and interface on offer.",
    "There is, however, support for Amazon Alexa and Google Assistant, so you can indulge in basic voice control, like powering up the projector and adjusting volume, and there’s also IFTTT (If This Then That) smart home interaction with connected IoT devices. Another smart application which could find some traction is Framed, a digital art showcasing platform which offers a curated collection of art from digital artists.",
    "Optoma is even promoting the CinemaX P2 as a tool for distance learning and working from home. Undoubtedly a timely wheeze, although the idea of doing a video conferencing call on a 120-inch screen seems a little like overkill.",
    "The projector is 3D compatible, using DLP’s own 3D Link system. No glasses are supplied in the box.",
    "While the P2 is largely plug-n-play, there’s some geometric picture correction on offer should you need it, and the internal speaker delay is incremental in 10 millisecond steps, should you notice lip sync errors.",
    "The supplied remote control is compact and largely button-free. It’s so subtly backlit you probably won’t even notice it illuminate.",
    "Knowing that Optoma has dialled back the spec, we felt some trepidation about the P2’s performance. As it happens, there’s still plenty of wow in the tank. Images are crisp, color-rich and delightfully impactful.",
    "The CinemaX P2 is built around a single chip DLP 4K device allied to a laser light engine, which translates to pin-sharp pictures (no chance of any panel alignment issues here) and excellent colour vibrancy.",
    "Animation is particularly ravishing, while nature documentaries feel far larger than life. The laser engine also has a long operating life, quoted at around 20,000 hours.",
    "The 4K P2 is also HDR compatible. Given that projectors can’t offer pixel precision when it comes to HDR, what we get here is something with a little more broad brush approach. Thankfully, it paints HDR well enough, avoiding that unwanted image darkening that some HDR projectors succumb to.",
    "The obvious HDR disappointment comes with HLG, which here is only applicable to files delivered via USB. The P2 doesn’t appear to be recognised as an HLG compatible display by a Sky Q box, so you’ll get UHD imagery, but with an SDR colour gamut.",
    "There’s a variety of display modes to choose from (Cinema, HDR simulation, Reference, Bright and User), but for most content, Cinema became our default. The Game mode has better latency than its predecessor, which is handy if you intend to hook up a console.",
    "Optoma has reduced the lumens on this model, compared to its more expensive stablemate, but the projector’s black level performance remains high. Shadow detail and darker portions of the screen don’t suffer from insipid greyness, which so often plagues low-light models.",
    "The overall image brightness is highly enjoyable, and brightness is still pretty good. You’ll be fine watching sports with some level of ambient light, although to really make contrast pop you might want to pull the curtains.",
    "The motion-smoothing Puremotion mode, with three distinct settings, proves highly effective for fast moving sports, ensuring minimal artifacts.",
    "Colour fringing, a traditional ailment of DLP projector tech, isn’t an issue. The unit uses an RGBRGB six segment colour wheel, and we weren't drawn to any colour flashing issues, even when watching high contrast content.",
    "The P2’s audio performance is top notch. Each driver has its own 10W digital amp module, so that’s a cumulative output of 40W. With the sonic chops of a large Bluetooth speaker, it’s more than loud enough to disguise its operating noise, which is a low 26dB.",
    "There’s a variety of audio sound presets, Movie, Music, Sport, Night and Game. As with the image presets, we would opt to leave this on Movie."
  ],
  "headers": {
    "0": "30 second review",
    "4": "Price and availability",
    "6": "Design and features",
    "19": "Performance",
    "31": "Don't buy it if..."
  },
  "links": {
    "CinemaX P1": "https://www.techradar.com/reviews/optoma-cinemax-p1",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Sky Q": "https://www.techradar.com/reviews/audio-visual/digital-tv-recorders/sky-q-1309215/review",
    "Ultra HD Blu-ray player": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "UHZ65UST": "https://www.techradar.com/reviews/optoma-cinemax-p1"
  }
}