{
  "source": "https://www.techradar.com/reviews/ring-indoor-cam-review",
  "title": "Ring Indoor Cam review",
  "category": "cameras",
  "updated": "2020-10-02T16:23:32Z",
  "author": "chris-price",
  "summary": "A great, affordable way to keep an eye on your home",
  "verdict": "An excellent, value for money indoor security camera that captures HD video as well as offering two-way audio.",
  "pros": [
    "Compact design",
    "Flexible mounting options",
    "Extremely customisable options"
  ],
  "cons": [
    "Mains powered",
    "Monthly subscription for more storage"
  ],
  "article": [
    "If you’re in the market to beef up your home security then Ring is a name that’s probably already familiar to you.",
    "Founded by US entrepreneur Jamie Siminoff back in 2012, its line-up of video doorbells has proved a hit with those who want to see, or even speak to, whoever comes to the door - whether they are in the house at the time or even the other side of the world. Now Ring has expanded its range with several new security products, including the Ring Indoor Cam, the budget indoor security camera that we're checking out here.",
    "If you're looking for a solid smart security camera that doesn't break the bank, well, this is it.",
    "Priced at just £49 ($59.99, AU$99), the Ring Indoor Cam is Ring’s cheapest camera to date. Mains, rather than battery-powered, it can be placed anywhere in your property, either on a flat surface such as table or bookshelf or mounted to the wall.",
    "Although it joins a very crowded market (with Hive, Nest and Blink just some of the big names offering similar products), Ring is hoping the Indoor Cam’s wealth of features and easy connectivity with its other products will make it a popular choice with consumers.",
    "The very first thing you notice about the Ring Indoor Cam when you take it out the box is its size. Or more precisely the lack of it. The Ring Indoor Cam is teeny-weeny, measuring 7.5cm in height. Circular in design, it features a reset button on top, a recessed power socket at the back and a clever base mount that can be removed using a Philips screwdriver for mounting to the wall should you choose. Ring even provides the necessary rawlplugs for this, along with a mounting plate, in order to make set up both simple and versatile.",
    "Once you’ve decided which part of your property you want the Ring Indoor Cam to keep a watchful eye on, the next step is to download the app – iOS or Android – and scan the QR code on the back of the product. This should then take you through the set-up procedure which involves you having to pair the device to the Ring Wi-Fi network before connecting the device to your home’s Wi-Fi network in a similar fashion to hooking up a product like the Amazon Alexa.",
    "To help the process, Ring offers various audio prompts such as ‘Say hello to Ring. Follow instructions in Ring app to continue.’ Nevertheless, the process did take me a little longer than expected as we initially installed the Ring Indoor Cam in a second-floor office, far away from the ground floor broadband router. As a result, we couldn’t initially get a strong enough signal to complete the set-up, although we did get it work after around ten to fifteen minutes.",
    "Given the budget price tag, the number of features on board the Ring Indoor Cam is mightily impressive. Not only is there a 1080p HD camera onboard (even some more expensive models such as the Blink indoor units only provide 720p resolution), the Ring device also offers an infrared option complete with color night vision for viewing clear footage in the dark. What’s more the camera has a nice wide viewing angle of 140 degrees, again a little wider than some of its competitors.",
    "But that’s not all. Using the software options via the app, it’s possible to completely customise the security camera. For example, you can choose to record motion only when people are detected as well as define ‘motion zones’ so that only certain portions of the frame are recorded. This is quite handy if, say, you have the camera focused on the outside of your property but don’t want it to record trees swaying or neighbors walking into their house. Similarly, you can also set up ‘rules’ so that you can switch off recording at certain times of the day when you know you are going to be in or use motion snooze to pause recording for a certain time period. This can be toggled between 30 minutes and 4 hours.",
    "As with the Ring video doorbell, a key feature of the Ring Indoor Cam is the two-way audio facility – useful if you want to calm down a distressed pet or tell a small child off for taking too many biscuits out of the cookie jar. You can even set different tones on your phone for receiving motion alert updates, although a surprising number of these seem to be Christmas related for some reason including Hark the Herald Angels Sing and God Rest Ye Merry Gentleman! There’s also a motion snapshot option which enables you to see what happens between detected events. This can be set to record every three minutes, one minute or 30 seconds.",
    "Given the incredibly modest price of the Ring Indoor Cam, we wouldn’t have been surprised if Ring has cut a few corners with this new security product. But really that doesn’t seem to be the case. Sure, maybe if it was battery powered it would give you a bit more flexibility about where in your house to place it, but it’s a very small gripe indeed.",
    "Captured images and sound are very good quality and can be sent via email, social media or downloaded to your device. It’s also possible to share your account with family members so they can see footage captured by the camera too.",
    "Up to 24 hours of video footage is captured as standard by the device which will probably be enough for most users. However, you can subscribe to Ring for more storage space. Costing £2.50, Protect Basic provides 30-day video history for a single device while Protect Plus offers 30 days of recording for an unlimited number of devices and costs £8.",
    "The Ring Indoor Cam is a great addition to the company’s growing suite of security products. It may be cheap, but the Ring device doesn’t disappoint when it comes to features or performance.",
    "We particularly like just how customisable the device is, making it suitable for placement in any room of the house. As well as being able to control the camera via your mobile device, it’s also useful to log into your Ring account via the web so you can keep an eye on your property from your office PC should you wish. Set-up is fairly straightforward too, helped by the flexible mounting options as well as video tutorials available via the app."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design and set up",
    "8": "Features",
    "11": "Performance",
    "14": "Final verdict"
  },
  "links": {
    "smart security camera": "https://www.techradar.com/news/best-home-security-camera"
  }
}