{
  "source": "https://www.techradar.com/reviews/mogo-cloud",
  "title": "Mogo Cloud review",
  "category": "computing",
  "updated": "2020-05-06T20:00:20Z",
  "author": "jonas-p-demuro",
  "summary": "Cloud based dental practice software hosted by Microsoft",
  "verdict": "Mogo Cloud offers a cloud based dental practice management solution hosted in the Microsoft Azure cloud.",
  "pros": [
    "Free trial",
    "Microsoft Azure Cloud based",
    "Billing statements can be emailed or printed",
    "Handles eClaims"
  ],
  "cons": [
    "Limited hours of support",
    "Lacks mobile apps",
    "Clunky workflow",
    "Crashes reported"
  ],
  "article": [
    "Mogo goes back to the 1980’s, making it one of the first dental software providers. The original founder for the product, Ming Wu, still owns the company, which is based in Willmont, Illinois.",
    "The original program has evolved to a cloud based solution, and Mogo Cloud claims to be the only major dental software that is secured with Microsoft Cloud hosting it. Mogo Cloud endeavors to be an all-in-one solution that can serve the various needs of not only general dentists, but also those of the full variety of dental specialists.",
    "First off, Mogo Cloud offers a free trial, which we prefer over a free demo, so the practice can really see how the software performs for them, before fully committing.",
    "Another feature, as the name suggests, is that Mogo Cloud is based on a cloud architecture, as a SaaS, which has inherent advantages, such as data redundancy by backing up directly to the cloud, and that updates are done centrally, and without user input. Of course, any cloud based service is only as good as the servers it is run on, and Mogo Cloud is run off of Microsoft Azure, and well respected and dependable cloud service, which also assures that it is HIPAA compliant.",
    "Mogo Cloud has plenty of features for the front desk. These include online patient forms, so patients can register, make appointment requests, and complete their medical history all online. The forms are all secured, with an online access code that gets supplied by the office.",
    "Patient engagement is another important aspect for a dental office to perform, and Mogo Cloud covers this need as well. This is seen in the options for eReminders, that can be sent via email, or text, for no additional charge and included in the package. These eReminders can be sent for a variety of reasons, such as to confirm appointments, as appointment reminders, and even to just send out birthday wishes.",
    "Billing is another important aspect for a dental practice management program. Mogo can make it a snap to keep track of the billing cycle, with built-in flexibility whether your practice bills on a daily, weekly, or monthly cycle. Through the Accounts Receivable Report, statements can be organized through a choice of parameters, such as the provider, the patient, or the aging period. When it comes time to send out the statements, from this same report, they can be either printed, or email for convenience.",
    "Electronic claims submission also gets handled by Mogo Cloud. Here, it gets partnered with Change Healthcare to enable eClaims submission. Furthermore, claims can be tracked for acceptance or rejection right from within Mogo Cloud.",
    "A significant shortcoming, particularly for cloud based software, is that Mogo Cloud does not offer any mobile apps.",
    "User reviews indicate some issues. One is the clunky workflow such as no less than four prompts to print a receipt, and how much time it takes to input data, such as a full series of x-rays, or a treatment plan. Another issue is that some users report program crashes throughout their day. Also, a practice reports difficulty with multiple users simultaneously trying to get into a chart, such as when the dental hygienist is trying to update the treatment plan, and the front office is trying to close out the visit, they both can’t be in the same chart at the same time.",
    "Mogo Cloud offers only limited support options. The first is via phone, and a toll free number is provided. It’s too bad that the hours of support are limited to weekdays only, from 8 AM to 5:30 PM Central Standard Time.",
    "Questions can also be submitted via an online portal. The query gets entered, along with name, practice’s name, email address and phone number.",
    "An email address is provided for a submission via that router, but the address, mogo@mogo.com is a more general address, and not specifically for technical support inquiries.",
    "Another option is lacking, namely chat. We also did not find any webinars, whitepapers nor ebooks. However, after some additional searching, we did locate on demand video education, with titles including “Adding new patients,” and “Patient lookup list overview” among the several options.",
    "Despite our criticisms, the Mogo technical support team was rated “Highest in customer support in the dental support industry” in a recent Clinician’s Report survey.",
    "Pricing for Mogo Cloud is based around a single affordable package, rather than multiple tiers that try to upsell you to the next feature package. This is a simplified plan approach, and we can certainly appreciate that it includes such essential features integrated in already, such as unlimited tech support, upgrades to the latest version of the software, and access to the training videos. The cost for the package is $250 per month (£202).",
    "Unfortunately, the pricing goes opaque hereafter, as it is unclear how many users and practitioners that this plan covers. Additionally, for practices with multiple office locations, Mogo Cloud offers “Special pricing.”",
    "Mogo Cloud, as the name suggests, takes a cloud based approach to dental practice management software. The strengths include the simplicity of a single available package, the toll free support that is included, and the handling of electronic claims. The weaknesses encompass the limited hours of support, the minimal pricing information, and the lack of mobile apps to enable easy access to the practice’s data when out of the office. While no dental practice management software is perfect, Mogo Cloud has created an attractive offering for the busier dental practice."
  ],
  "headers": {
    "2": "Features",
    "8": "Drawbacks",
    "10": "Support",
    "15": "Pricing",
    "17": "Final verdict"
  },
  "links": {
    "dental software": "https://www.techradar.com/best/best-dental-practice-management-software",
    "Mogo Cloud": "https://www.mogo.com/cloud-based",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "Microsoft Azure": "https://www.techradar.com/reviews/microsoft-azure"
  }
}