{
  "source": "https://www.techradar.com/reviews/dell-inspiron-13-7000-2-in-1",
  "title": "Dell Inspiron 13 7000 2-in-1 review",
  "category": "computing",
  "updated": "2020-01-01T22:00:00Z",
  "author": "mark-knapp",
  "summary": "A step up for Inspiron",
  "verdict": "The Dell Inspiron 13 7000 2-in-1 Black Edition is a versatile 2-in-1 with plenty going on under the hood. Its design is premium, and it can compete with the XPS 13. Though this model is discontinued, the new generation takes the best from this and appears to improve on it.",
  "pros": [
    "Competent performance",
    "Highly versatile",
    "Premium design"
  ],
  "cons": [
    "Quirky display",
    "4K battery drain",
    "Bunk speakers"
  ],
  "article": [
    "Dell’s Inspiron line of laptops may not be its most premium family, but that hasn’t kept some of the best features and performance hardware from showing up here.",
    "The Dell Inspiron 13 7000 2-in-1 Black Edition (or Dell Inspiron 7390) is a testament to that, with exclusively high-end internals, a premium design, a 4K display, and a clever stylus slot that makes us wonder whether they actually beat Microsoft to the idea.",
    "The Dell Inspiron 13 7000 2-in-1 serves as a launching point for Dell’s latest Inspiron 13 7000-series laptops. That’s because Dell was quick to move on from this model. It was effectively the ultimate version of the Inspiron 13 7000-series just before Dell took the leap into 10th-Gen Intel Core processors.",
    "As a result, Dell has already ended sales of this model, but much of what Dell has put into this Black Edition model shows up in the newest Inspiron 13 7000 2-in-1 (7391), with the closest configuration costing $1,299 (about £985, AU$1,905). That new model offers an 10th-Gen Intel Core i7-10510U processor (a decent upgrade), the same 16GB of RAM, an equivalent 512GB SSD with 32GB of Intel Optane Memory, and 4K touch screen with Dell Active Pen support, and an upgraded Wi-Fi 6 connection. The design remains nearly unchanged, but Dell has upgraded the USB-C port to Thunderbolt 3.",
    "The pricing runs the Dell Inspiron 13 7000 2-in-1 against a lot of devices in the ultrabook category. The HP Envy 13t starts at $999 (£849, AU$1,799) but is often available with considerable discounts, though the price would go up to offer similar specs to the Inspiron we’ve listed. Meanwhile an HP Envy x360 15 with comparable specs (but a Full HD display) starts at just $1,199 (about £910, AU$1,760).",
    "The price even runs the Inspiron up against Dell’s XPS lineup. The Dell XPS 13 we reviewed had near equal internals to the Inspiron model we have on hand, but cost a staggering $2,279 (about £1,730, AU$3,345) at the time. And, while Dell has also updated the XPS line to include 10th-Gen Intel Core processors, the prices have remained relatively stable.",
    "The Dell Inspiron 13 7000 2-in-1 certainly qualifies as a thin-and-light ultrabook, but it’s not the thinnest, lightest, or most ultra. The 2-in-1 form factor often comes with a tradeoff in weight and thickness, and that shows up here. The Dell Inspiron 13 7000 2-in-1 Black Edition measures 0.63 inches (15.9mm) at its thickest point and weighs 3.1 pounds (1.39kg). That’s well above the 2.7-pound XPS 13 and 2.59-pound HP Envy 13t.",
    "That said, the Dell Inspiron 13 7000 2-in-1 Black Edition is plenty easy to carry around. It fits well into the laptop slot in our backpack, and does little to weigh us down. We’ve definitely borne heavier laptops.",
    "One thing likely contributing a bit to the weight is the metal chassis. While some laptops opt for a lighter magnesium, Dell has gone with stamped aluminum. It feels sturdy to the touch, with minimal flex when we apply pressure. That aluminum covers the bottom, display cover, keyboard deck and outside of the hinge, but the inside of the hinge is plastic.",
    "There’s a good excuse for the inside of the hinge being plastic: that’s where the Dell Active Pen lives. It has a handy slot carved out for it, and is held firmly in place by magnets. The magnets are strong enough that we’re able to roll the pen across the keyboard and have the magnets pull it right into the slot. It’s a clever solution that makes losing the pen difficult while also making it easy to access the pen in any position.",
    "That’s important because the laptop can be in several positions. It can fold open into a tablet, sit upright like a typical laptop, or flip over into a tent position. In all of those orientations, the pen is readily available.",
    "This design positions the barrel charging port on the left side along with an HDMI and USB-C port, making the ports nice and balanced. The right side houses a USB-A port, 3.5mm headphone jack (something we firmly believe belongs on the left side of laptops but is more excusable in a 2-in-1 where the left and ride side can flip), and a microSD card slot.",
    "Dell has positioned large speaker grilles on the underside of the chassis, near the front, but they may not have very big speakers inside. The audio is wimpy, with the low-end almost absent, and higher volumes leading to an irritating buzzing.",
    "The display helps make up for the speakers somewhat. It’s impressively clear at 4K, though it could stand to be brighter. The maximum brightness is strong enough for a lot of situations, but the glossy display sets it up to fail against sunlight. The bezels on the sides and top are fairly thin, though the top bezel makes a bit more room for the 720p webcam. The lower bezel is easily an inch wide. It’s not bad, but it’s not winning any screen-to-body ratio competitions.",
    "Playing a Blu-ray copy of Guardians of the Galaxy, the visuals look excellent on this display. It holds up for video consumption. We do notice a quirk when running into high-contrast situations. In our usual work setup, we have two windows open side by side, often articles (i.e., a lot of text and white space). When one of those windows has a dark image, we notice all of the whole display dim slightly. We can see this at max brightness and lower brightnesses as well.",
    "The input devices on the Dell Inspiron 13 7000 2-in-1 Black Edition are a strong side of the experience. The trackpad is smooth and responsive, and has plenty of space for navigation and even four-finger gestures. As for the keyboard, the keys could benefit from some contour, but otherwise feel good and poppy to type on. Dell avoids any buffoonery around the arrow keys, keeping a full-size Shift key and positioning narrow arrow keys below it. The only nuisance from the keyboard is the fingerprint scanner/power button. It’s in the top right corner of the keyboard, inconveniently pushing the Delete key out of the way.",
    "Thanks to some pressure sensitivity, the pen is capable of a lot, and the only downside we notice is that when pressing very lightly against the display, it can fail to register, as can very quick movements across the screen (though this varied by which app we drew on).",
    "The Dell Inspiron 13 7000 2-in-1 Black Edition isn’t a performance monster with the Intel Core i7-8565U processor and integrated graphics on offer, but it’s perfectly sufficient for the type of work it’s expected to handle. The processor zips through simple tasks, booting, and program launches quickly.",
    "In our Benchmarks, we see the processor running neck and neck with the same chip in more expensive laptops like the Dell XPS 13 and cheaper HP Envy 13t, and considering the 16GB of RAM, this is a multi-tasker worth looking at. We don’t run into any issues working on projects with dozens of tabs open in Chrome, the occasional YouTube video, and Slack in the background all at the same time.",
    "Through all of our work with the Dell Inspiron 13 7000 2-in-1 Black Edition, we haven’t noticed it get very warm either. The fans kick up to a modest level when it’s under load, but they’re not obnoxiously loud.",
    "Graphics are one shortcoming for the Dell Inspiron 13 7000 2-in-1 Black Edition. The use of integrated graphics limits its potential for any graphical workloads. Compared to our HP Envy 13t running the same CPU but paired with an Nvidia MX250 2GB graphics processor, the Dell Inspiron 13 7000 2-in-1 Black Edition simply gets smoked in graphics related benchmarks like our suite of 3DMark tests. It does manage to perform mostly in line with the similarly configured Dell XPS 13, showing how narrow the line between products can get",
    "While normally the use of integrated graphics might seem like a smart consideration for battery life, our benchmarks showed a different story here. The Dell Inspiron 13 7000 2-in-1 Black Edition earned a respectable PCMark 8 Battery Life score of 5 hours and 32 minutes, exceeding the Dell XPS 13’s and nearly tying the HP Envy 13t’s scores.",
    "That’s good news for workers, as that test simulates working and browsing. In our experience using the Dell Inspiron 13 7000 2-in-1 Black Edition for work, it holds up well for most of a day when keeping the power settings lower and leaving the display at 50% brightness. A full 8-hour work day would be a bit of a stretch, but could likely be managed with further reduced brightness and battery-saver mode.",
    "When the battery is low, the laptop supports fast charging to top it back up quickly. We managed to get the battery from empty up to 86% in a little over 90 minutes while working with the screen brightness at max and the power mode set to best performance..",
    "Media lovers have a little less to love about the computer. In our video test, which loops a 1080p video with the display at 50% brightness until the battery dies, we only got 5 hours and 42 minutes of playback – likely thanks to the 4K display. The Dell XPS 13 with a 4K display does manage a bit longer at 8 hours and 12 minutes, but the HP Envy 13t with its Full HD display doubles the Dell Inspiron 13 7000 2-in-1 Black Edition’s playback time, showing that the MX250 graphics don’t have much of a downside.",
    "The Dell Inspiron 13 7000 2-in-1 Black Edition is a versatile machine that will make a reliable partner for workers of all types. The ability to multitask, take notes with the stylus, and enjoy sharp content on the display add up to a strong experience. A Full HD display option would likely improve the offering, but the introduction of new 10th-Gen Intel Core processors to the Dell Inspiron 13 7000 2-in-1 line might improve the battery shortcomings while offering more configurations."
  ],
  "headers": {
    "2": "Price and availability",
    "6": "Design and display",
    "17": "Performance",
    "21": "Battery life",
    "25": "Final verdict"
  },
  "links": {
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "HP Envy 13t": "https://www.techradar.com/reviews/hp-envy-13t-2019",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review"
  }
}