{
  "source": "https://www.techradar.com/reviews/showmypc-review",
  "title": "ShowMyPC review",
  "category": "computing",
  "updated": "2021-01-21T11:29:55Z",
  "author": "michael-graw",
  "summary": "Read our ShowMyPC review to find out if this is the best remote desktop for Windows",
  "verdict": "ShowMyPC is inexpensive and can get the job done when it comes to remote PC access and screen sharing. But, its stripped-down feature set certainly doesn’t blow us away.",
  "pros": [
    "Inexpensive pricing for remote desktop access",
    "Screen sharing tools support online meetings and remote helpdesk"
  ],
  "cons": [
    "No file transfer tools or voice over IP when screen sharing",
    "User interface looks extremely outdated"
  ],
  "article": [
    "If you want the best remote desktop software at a budget price, it’s worth taking a close look at ShowMyPC. This inexpensive software enables you to easily share your screen with any number of remote users or to access a remote computer yourself. However, it is relatively light on features.",
    "So, is this the right screen share and remote desktop software for you? Our ShowMyPC review will help you decide.",
    "ShowMyPC offers two different pricing structures: one for setting up online meetings with screen sharing, and one for remote desktop access.",
    "Creating an online meeting and sharing your screen is free. But, if you want to run two concurrent meetings, offer participants web access to join a meeting, or add a chatbox to your meeting, you’ll need a Premium subscription for $14 per month. The Professional ($19 per month) and Business ($26 per month) plans add custom branding and enable you to host three to six concurrent meetings.",
    "If you want to use ShowMyPC as a remote desktop on Windows, plans start at $5 per month for one remote PC. You can license three PCs for $9 per month or 10 PCs for $20 per month. Only Windows computers can be used as remote hosts, but you can control a remote Windows desktop from Mac and Linux devices.",
    "The main feature ShowMyPC offers for free is the ability to share your screen with others. You can use this as a visual aid for meetings, since there is no limit to the number of remote users you can share your screen with. Alternatively, you can give mouse and keyboard control to a remote user, which makes this software useful for live chat.",
    "Keep in mind that ShowMyPC doesn’t support audio, and running a chat through the program requires a paid Premium plan. In addition, helpdesk users will find that ShowMyPC doesn’t have any file sharing tools built into the screen sharing side of the software.",
    "On the remote desktop side, ShowMyPC is a little more functional. You can create a shared folder that’s mirrored on the host and control computers to transfer files. The software also enables you to print remotely. But, there’s still no voice over IP, and the remote desktop package doesn’t include text chat.",
    "ShowMyPC is easy to set up for screen sharing—simply download and install, and you’re good to go. However, if you want to use the platform for screen sharing, beware that every meeting participant will need to install the software just to see your screen. To send simple web links rather than require a software download, you’ll need to pay for a Premium subscription.",
    "Installation for remote desktop use requires that you set up an access key for the host computer in person. You can only remotely access Windows computers with ShowMyPC. But, you can control a remote Windows host from a Mac or Linux computer or Android or iOS mobile device.",
    "The ShowMyPC interface is simple, if a little outdated. To set up a screen share, simply click the Start a Meeting button and decide whether or not to allow remote access to your mouse, keyboard, and files. You’ll then receive a meeting password that can be shared with an IT helpdesk manager or a group of meeting participants.",
    "The remote desktop interface shows you a list of your registered remote desktops. You just need to enter your access password to connect. Once you’re connected, you’ll see a toolbar across the top of the desktop to adjust your session settings.",
    "We tested ShowMyPC as both a helpdesk tool and for remote management of a PC. The software was initially a little slow, but the lag disappeared after we changed the display resolution settings.",
    "ShowMyPC is about as secure as other remote desktop platforms. It uses 256-bit encryption for remote desktop access, and your access password is never stored on ShowMyPC’s servers. For screen sharing, a new password is auto-generated for each session.",
    "One extra security feature that ShowMyPC includes is the ability to track a lost or stolen remote computer. Your computer will already need to have been set up for remote access, but you can track the IP address it’s using when you connect.",
    "ShowMyPC technical support is available by live chat or phone from 8 AM to 5 PM Pacific, Monday to Friday. The company’s website has answers to some common questions, but the documentation is pretty limited overall.",
    "ShowMyPC is a good option if you need a single platform that can handle screen sharing, helpdesk tasks, and remote desktop access. However, the software doesn’t particularly excel at any of these functions. We liked that ShowMyPC enables remote desktop control from mobile devices, but we wished for voice over IP integration. If you’re on a tight budget, ShowMyPC is an inexpensive solution with just enough tools to make it worthwhile.",
    "ShowMyPC pulls together a few different use cases into a single piece of software. However, if your primary goal is to set up an IT helpdesk, take a look at TeamViewer. It’s much more expensive (plans start at $49 per month for one technician), but it includes features like drag-and-drop file sharing, voice over IP, and more.",
    "For screen sharing during meetings, Join.Me offers a more modern interface and tools. Plans are also inexpensive, starting at just $10 per month.",
    "Finally, for remote desktop access, LogMeIn offers far more control than ShowMyPC. But, it’s pricey, with plans starting at $349 per year.",
    "Find out more about ShowMyPC's competitors in our Best remote desktop software guide."
  ],
  "headers": {
    "2": "ShowMyPC: Plans and pricing",
    "5": "ShowMyPC: Features and utilities",
    "8": "ShowMyPC: Setup",
    "10": "ShowMyPC: Interface and performance",
    "13": "ShowMyPC: Security",
    "15": "ShowMyPC: Support",
    "16": "ShowMyPC: Final verdict",
    "17": "The competition"
  },
  "links": {
    "best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "TeamViewer": "https://www.techradar.com/reviews/teamviewer",
    "Join.Me": "https://www.techradar.com/reviews/joinme",
    "LogMeIn": "https://www.techradar.com/reviews/logmein-pro-review",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}