{
  "source": "https://www.techradar.com/reviews/nokia-83-5g-review",
  "title": "Nokia 8.3 5G review",
  "category": "phones",
  "updated": "2020-10-08T10:57:32.873Z",
  "author": "james-peckham",
  "summary": "Nokia’s first big step into the world of 5G",
  "verdict": "The Nokia 8.3 5G isn’t the most exciting phone you’ll read about this year, but with strong specs and a large screen there’s plenty here to appeal to those looking to upgrade to 5G with a handset that won’t break the bank. That said, a meager storage offering and an annoying Google Assistant button mean it’s not a device without its frustrations.",
  "pros": [
    "Good display",
    "3.5mm headphone jack",
    "Impressive battery life"
  ],
  "cons": [
    "Annoying Google Assistant button",
    "Small storage size for some",
    "Mediocre camera"
  ],
  "article": [
    "Looking for a 5G phone with a respectable price tag? We’re starting to see them emerge, and the Nokia 8.3 5G is one of the latest handsets to offer the super-fast connectivity tech, alongside some pretty impressive mid-range specs.",
    "Released by HMD Global – the company that owns the Nokia brand – the Nokia 8.3 5G is a mid-range phone offering strong power and performance, although it isn’t going to compete with the very best 5G phones on the market.",
    "Instead, this is designed to be an affordable option that gives you 5G connectivity and a solid feature-set, all for a price that won’t make you wonder if you couldn’t just live with 4G for a little longer.",
    "It boasts a large 6.81-inch Full HD+ display, a Qualcomm Snapdragon 765G mobile chipset, and a strong rear camera array – as with other features and specs, the cameras aren’t going to compete with the very smartphone snappers, but in our testing we were able to capture some impressive-looking shots.",
    "There’s a 4,500mAh battery inside, which we found saw us through a whole day on a single charge without any issues, and it arrives packing the latest Android 10 software out of the box.",
    "All of this said, it’s difficult to get too excited about the Nokia 8.3 5G. There are other options for your next phone that offer similar features for less money, such as the OnePlus Nord or the Google Pixel 4a.",
    "But the Nokia 8.3 5G is a strong handset overall, and it’s certainly worth considering if you’re looking for a phone that offers strong battery life, a large display and 5G connectivity.",
    "The Nokia 8.3 5G was unveiled at the beginning of 2020, but the phone was delayed, and didn’t come out until much later in the year. It's out now in the UK, so you're able to buy it right away.",
    "Pre-orders are open in the US and Australia, but the release date differs in those two markets. It'll be released in the US on October 26, while in Australia it's out on October 15.",
    "In the UK the Nokia 8.3 5G costs £499.99 for a model with 6GB of RAM and 64GB of storage, while in the US and Australia respectively you’ll be paying $699 or AU$899 for a version with 8GB of RAM and 128GB of storage.",
    "It’s currently unclear whether any or all of those regions will get the other variant, but HMD Global hasn’t ruled out the possibility.",
    "The design of the Nokia 8.3 5G is similar to what we’ve seen from HMD Global’s Nokia handsets in previous years, with a metal central band and Gorilla Glass on the rear of the phone. It comes with a ‘refracted light’ design that gives it a unique look rather than just a solid color.",
    "It’s only available in one color – a blue shade which HMD Global calls Polar Night. It's a unique finish that we found gave the phone an eye-catching look.",
    "The phone itself is big, thanks to its large 6.81-inch display, which we’ll talk about in more detail shortly. We didn’t find it to be too large in the hand, but if you’re used to a phone with a smaller display you may struggle to use it comfortably.",
    "The exact dimensions are 171.90 x 78.56 x 8.99mm, with the handset weighing in at 227 grams. It's not a light device, but the heft feels about right given its size.",
    "The fingerprint sensor is housed in the power button on the right side of the handset, allowing you to wake the phone and unlock it with one press. We found the sensor to work well, enabling us to unlock the phone with minimal effort.",
    "Above the power button is the volume rocker, which we found easy to reach, and on the left edge of the phone is a dedicated Google Assistant button. This is directly opposite the power button, and its sole purpose is to initiate Google Assistant so you can issue commands to launch apps and perform various tasks.",
    "We found this button to be an annoyance, and we lost track of the amount of times we accidentally pressed it when we were holding the phone in our natural way. The button often got pressed when the phone was in our pocket too, meaning the handset would stop playing music to launch Google Assistant when we didn’t want it to.",
    "You can turn off this feature in the settings, but you can’t reprogram it to do anything else, meaning you’re left with a completely superfluous button. It seems like an odd choice by HMD Global to introduce this on the Nokia 8.3 5G, and we can’t see many people finding it useful.",
    "On the bottom edge of the handset is a 3.5mm headphone jack, which you’ll appreciate if you’re someone who likes to use wired headsets with your phone. There’s a small lip at the bottom of the screen too, but otherwise most of the front of the device is taken up by the display.",
    "The Nokia 8.3 5G features a 6.81-inch Full HD+ screen with an aspect ratio of 20:9. That means the screen is taller than those on most handsets, which means you get a larger screen without the phone feeling too large in the hand.",
    "The screen’s FHD+ resolution is 1080 x 2400, which equates to a pixel density of 386 pixels per inch. That means the picture won’t look as sharp or detailed as you’d see on a QHD device, but we found it was fine for day-to-day tasks and viewing.",
    "If you put this phone alongside a top-end device from the likes of Samsung or Apple you’d likely notice the difference, but we found this to be a nice-looking screen, with vibrant colors and good contrast.",
    "It’s a bit of a shame that HMD Global has stuck with a 60Hz display refresh rate for the Nokia 8.3 5G, when even some mid-range phones are getting smoother-looking displays of 90Hz or above, but if this isn’t a feature you’ve experienced before you likely won’t miss it here.",
    "There’s a punch-hole for the selfie camera in the top-left corner of the display, but it’s fairly unobtrusive, and we didn’t get distracted by it too often.",
    "The rear camera array on the Nokia 8.3 5G comprises a 64MP f/1.89 main camera, a 12MP ultra-wide camera with an aperture of f/2.2, a 2MP macro snapper and a 2MP depth sensor.",
    "This setup doesn't quite match the penta-lens array on the Nokia 9 PureView, but all the cameras will let you take shots that look good enough for sharing on social media. We found the main camera to take sharp and colorful images, but it never truly blew us away.",
    "It’s a stretch to call this a truly quad-camera setup, as the 2MP macro sensor proved to be mediocre throughout our usage and we also found the depth sensor didn’t make a huge difference to shots.",
    "You’ll be shooting 16MP shots with the main camera by default, and to make the most of the 64MP capabilities you need to switch to the Pro mode. That’s easy enough to find, but it’s not entirely clear that you’re only shooting in 16MP if you don’t select Pro mode.",
    "We found the auto mode was capable of capturing nice-looking daytime shots in good lighting – you can see a variety of images in the camera samples section below. It’s easy to switch to the ultra-wide mode when you want to cram more into the frame, and image quality is similar to the main camera.",
    "There’s also a night mode at your disposal, but it’s not as impressive as similar modes on many other phones like the Google Pixel 4a. It allows you to capture shots that look a little brighter than would otherwise be the case, but it never truly impressed us.",
    "For selfies, you’ll be using the 24MP shooter on the front of the Nokia 8.3 5G. We were able to get some impressive-looking snaps with this camera, and it performed well for video calls too.",
    "The company has clearly put a focus on video here, with a few extra features such as 4K 24fps and a 21:1 cinematic mode, while there’s also a new Action Cam mode that’s specifically designed to capture smooth video, which uses a higher frame rate of 60fps to improve footage of fast-moving subjects.",
    "As with stills shooting, we found video recording on the Nokia 8.3 5G to be good, but nothing that’s going to trouble top-end handsets.",
    "The Nokia 8.3 5G is the first phone from HMD Global to support 5G, and the company is making a big deal of this fact, referring to this as the world’s first “global 5G smartphone”.",
    "What does that mean? At launch, HMD Global believed the Nokia 8.3 5G supported more 5G bands than any other handset, although while that may have been true at launch, it’s unclear it it’s still the case",
    "That said, the phone is able to use a wide range of high-, mid- and low-frequency 5G bands.",
    "Some rival 5G phones don't feature compatibility for bands such as n71 or n5, for example, which are used in more remote areas, but the Nokia 8.3 5G does. That should mean you get the best possible 5G signal from this phone, wherever you are.",
    "We’ve used 5G on the device in a couple of scenarios, and we found it to work well. We haven’t been able to properly put the 5G connectivity through its paces, but if you’re excited about the next-gen connectivity standard you should be well catered for by this phone.",
    "You’re not getting a top-end chipset inside this phone, with HMD Global employing Qualcomm’s Snapdragon 765 chipset. That allows for 5G connectivity, but you won’t see the same performance levels as in handsets that use the flagship Snapdragon 865 Plus.",
    "We found the phone had enough power for everything we wanted to do , though, with apps loading relatively quickly. Again, the Nokia 8.3 5G won’t compete with top-end flagships when it comes to performance, but neither should it feel sluggish in day-to-day use.",
    "This phone is running Android 10 out of the box, and it’s the stock version, so it looks and feels as Google intended it to, without any bloatware.",
    "The Nokia 8.3 comes in either a 6GB of RAM with 64GB of storage variant or 8GB of RAM with 128GB of storage. We’ve tested the 6GB of RAM version, and found it to work well but we’d recommend trying to go for the 128GB for that extra space if you can find it.",
    "That said, some regions are only getting specific devices. For example, those in the UK will only have access to 64GB while those in the US will have 128GB as an option.",
    "64GB of space isn’t much once you load up your apps, download some media and start taking photos and videos. There is at least microSD support for cards up to 400GB, but we’d recommend getting the higher-storage variant if it’s an option and your budget can stretch to it.",
    "With a large display and 5G capabilities to power, battery life is a potential issue for the Nokia 8.3 5G, but the good news is that we experienced impressive battery performance during our testing, with the phone never failing to make it through a full day on a full charge.",
    "The battery is 4,500mAh, which is on the large size as power packs go. It’s quick to recharge, but you don’t get any extra features such as wireless or reverse charging – and while you can’t expect to get all the bells and whistles of top-end handsets, some mid-range phones do offer the former.",
    "The battery is certainly dependable though, and we found that we’d often get to the end of the day with 10-30% left in the tank, depending on how hard we’d pushed the phone – and after one day of particularly light usage we were at 40%.",
    "First reviewed: September 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Nokia 8.3 5G release date and price",
    "11": "Design",
    "20": "Display",
    "25": "Camera",
    "34": "Specs and performance",
    "45": "Battery life",
    "48": "Don’t buy it if"
  },
  "links": {
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Nokia 9 PureView": "https://www.techradar.com/reviews/nokia-9-pureview"
  }
}