{
  "source": "https://www.techradar.com/reviews/tp-link-re650-ac2600-wi-fi-range-extender",
  "title": "TP-Link RE650 AC2600 Wi-Fi range extender review",
  "category": "computing",
  "updated": "2021-04-06T18:11:58Z",
  "author": "cliff-joseph",
  "summary": "Affordable range extender that’s ideal for boosting your home Wi-Fi.",
  "verdict": "If you need to improve the Wi-Fi in a far-away bedroom or garden then the RE650 provides good Wi-Fi performance at a competitive price, and its extra Ethernet port is really handy for older PCs and games consoles too.",
  "pros": [
    "Good Wi-Fi performance",
    "Competitive price",
    "Helpful app"
  ],
  "cons": [
    "Set-up takes a little while",
    "No automatic roaming"
  ],
  "article": [
    "TP-Link’s new RE650 is a neatly designed and affordable model that provides good performance for people who might have tricky ‘deadspots’ with poor Wi-Fi in their home. And, it's among the best Wi-Fi extenders out there.",
    "It’s worth shopping around, though, as you can’t buy the RE650 direct from TP-Link and online prices seem to vary quite a lot, with the average price being around $120/£90/AU $180. You don’t need a TP-Link router to use it either, as TP-Link states that it ‘works with any router’ - and we had no trouble at all using the RE650 with the standard router provided by our broadband supplier.",
    "The TP-Link RE650 is a plug-in range extender, designed to be inserted directly into a mains power socket in any convenient location. It’s bigger than many plug-in extenders, but that’s because of its four, large external antennae.",
    "These might look a little unsightly, but our tests showed that they help to provide really good performance in our home office where the Wi-Fi is highly erratic. There’s a large WPS security button prominently displayed on the front panel, to help you with the set-up process, along with status lights to let you know when the range extender has successfully connected to your existing router’s Wi-Fi network on both the 2.4GHz and 5.0GHz bands.",
    "As the name suggests, the RE650 uses dual-band 802.11ac Wi-Fi on the 2.4GHz and 5.0GHz bands, with a top-speed of 2600Mbps.",
    "That’s more than fast enough to cope with Zoom video calls, Netflix or a spot of online gaming, and we were pleased to see that the TP-Link RE650 also includes a Gigabit Ethernet port too, which is handy for older devices that don’t support 5GHz Wi-Fi (such as the old PC that I still use for watching Netflix).",
    "Range extenders can be a little tricky to set up, as they generally create their own Wi-Fi network that is separate from the Wi-Fi network created by your existing router. This means that you have to spend some time connecting the range extender to your router on both the 2.4GHz and 5.0GHz bands, which can be quite time-consuming.",
    "Fortunately, TP-Link’s Tether app keeps things nice and simple and guides you through the set-up process one step at a time.",
    "We’ve seen more expensive range extenders that provide more sophisticated ‘roaming’ features - that automatically switch your devices back and forth between your router and range extender as you ‘roam’ from room to room at home - but the RE650 strikes a good balance between ease of use and affordable pricing.",
    "It delivers the goods on Wi-Fi performance too. Our home office has very erratic Wi-Fi, which sometimes cuts out altogether. But, with the RE650 plugged into a power socket just outside the office we found that our Wi-Fi speed on the slower 2.4GHz band jumped from its normal 18Mbps to a healthy (and more Netflix-friendly) 78Mbps.",
    "The 5GHz band improved even more, soaring from 60Mbps to 283Mbps. And, as well as being faster, the Wi-Fi speed remained smooth and consistent too, which is just as important if you’re playing games online, or streaming music and video.",
    "That sort of performance is quite impressive for a range extender in this price range, so the RE650 will be a good, affordable option for anyone that needs to improve their Wi-Fi in hard-to-reach areas such as an upstairs bedroom or out in the garden."
  ],
  "headers": {
    "0": "Two-minute review",
    "2": "Design and features",
    "6": "Set-up and performance",
    "12": "Don't buy it if..."
  },
  "links": {
    "best Wi-Fi extenders": "https://www.techradar.com/news/the-best-wi-fi-extenders"
  }
}