{
  "source": "https://www.techradar.com/reviews/driver-genius-20-platinum",
  "title": "Driver Genius 20 Platinum review",
  "category": "computing",
  "updated": "2020-10-28T03:58:24.719Z",
  "author": "richard-sutherland",
  "summary": "The popular driver update tool gets an update",
  "verdict": "Driver Genius 20 Platinum has a few useful features, but it doesn’t find as many outdated drivers as some of the competition.",
  "pros": [
    "Full feature trial",
    "Useful system maintenance tools"
  ],
  "cons": [
    "Doesn’t find all missing drivers",
    "Pricey"
  ],
  "article": [
    "All the various components of a PC need their own driver software. The graphics card, motherboard, sound card, and network card are all examples of components that need drivers. They are the software links between the Windows operating system and devices. Without the right driver, your operating system can’t use a device.",
    "Component manufacturers often publish driver updates long after the components have been released. These can quash bugs, patch security holes, introduce new features, and improve performance.",
    "If you’re in charge of keeping several computers up to date, you know how difficult it can be to ensure that they’re always running the latest drivers for all components and devices. Driver Genius 20 Platinum is a driver updater that scans your computer and tells you if you need to download new drivers for any component or device. In our Driver Genius 20 Platinum review, we evaluate whether it’s the best driver update software for small businesses.",
    "Driver Genius is available in three versions. The time-limited Driver Genius Free is a trial, but it includes all the features of the full software, apart from the ability to back up drivers to a ZIP file or auto-installing EXE files.",
    "Driver Genius 20 Professional costs $22.95/year for three PCs. It’s a full version of the software, but it doesn’t include the System Booster and System Cleanup tools, which are reserved for the $32.95/year Driver Genius Platinum.",
    "All purchases have a 60-day money-back guarantee. If you want software updates to Driver Genius, you must pay an extra $9.90. This gives you free upgrades and updates for two years.",
    "The core of Driver Genius 20 Platinum is the Driver Update utility, but it has a few other features too. You can back up and restore your drivers with the Driver Backup utility. You can choose to back up all currently used drivers, the original Windows drivers, or individual drivers, among other options.",
    "A Driver Cleanup feature enables you to remove invalid driver packages from your system. This can help save space on your hard drive. Clean Invalid Devices can remove from the registry devices that no longer exist on your computer. The System Transfer Assistant can be used to transfer network drivers to a new computer, ensuring that you have internet access after installing a new operating system.",
    "Driver Genius 20 Platinum also includes three tools for optimizing your PC. The SSD Speeder improves the performance of your solid-state drives with recommended settings in the registry. The System Cleanup is a basic temporary file remover that you can find in many free PC cleanup tools.",
    "The System Booster tool aims to optimize your computer with optimized settings in the registry. It includes around 60 tweaks that aid performance, such as turning off Windows error reporting and speeding up DNS parsing.",
    "Driver Genius 20 Platinum has a professional, unassuming interface, foregoing the driver update software trend of garish pop-ups and fancy skins. We tested it on two computers: a Windows 10 desktop PC and a Windows 8.1 laptop. In total, it found 21 required driver updates, which is below average.",
    "The settings menu hides a few useful configuration choices. You can choose whether to check for drivers automatically, whether to install the drivers without user intervention, and if a system restore point should be taken before each driver installation. There’s even the surprising addition of a hardware monitor that will warn you when your CPU, GPU, or hard drive temperature gets too high.",
    "Driver Genius has free 24/7 technical support if you pay for the software. The Free version doesn’t have technical support. Avanquest Software says that it aims to reply to queries within 12 hours.",
    "There is a one-page FAQ and a one-page user’s guide on the Avanquest website. However, these don’t do enough to explain all the software’s features. Since the System Booster tool can make sweeping changes to how Windows runs, there’s a danger of doing something that you don’t completely understand, so more documentation here would be useful.",
    "IObit Driver Booster 8 is significantly cheaper than Driver Genius 20 Platinum, and in our testing, it found 50% more missing drivers. It also can scan for outdated game components.",
    "Driver Reviver from ReviverSoft is a simpler solution that focuses solely on driver update duties. If you don’t need Driver Genius 20 Platinum’s system maintenance tools, it might be a better choice. It was also able to find more outdated drivers than Driver Genius in our testing.",
    "Driver Genius 20 Platinum’s Driver Update, Driver Backup, Driver Restore, and Driver Cleanup tools are functionally some of the best we’ve tested, with configurable options that make it ideal for power users.",
    "It’s a shame, then, that the software didn’t find as many drivers to update as some of the competition. The System Booster tool included in the Platinum version of the product can make nifty changes to how your Windows installation runs, but it’s an extra $10 per year for a feature that you’ll only ever run once. Ultimately, we give Driver Genius a lukewarm thumbs up. We hope that Avanquest Software can expand its library of drivers so more outdated device drivers will be recognized."
  ],
  "headers": {
    "3": "Plans and pricing",
    "6": "Features",
    "10": "Interface and in use",
    "12": "Support",
    "14": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "Driver Genius 20 Platinum": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3488315901516392000&xs=1&url=https%3A%2F%2Fwww.driver-soft.com%2Forder.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdriver-genius-20-platinum",
    "best driver update software": "https://www.techradar.com/best/best-driver-update-software",
    "IObit Driver Booster 8": "https://www.techradar.com/reviews/driver-booster-8",
    "Driver Reviver": "https://www.prf.hn/click/camref:1011ldbTe/pubref:trd-us-1989124641313880600/destination:https%3A%2F%2Fwww.reviversoft.com%2Fdriver-reviver%2F"
  }
}