{
  "source": "https://www.techradar.com/reviews/dell-latitude-7490",
  "title": "Dell Latitude 7490 review",
  "category": "computing",
  "updated": "2020-08-06T13:37:21Z",
  "author": "mark-pickavance",
  "summary": "Intel’s new silicon and a honed design make a great combo",
  "verdict": "Dell has taken the clean lines of the 7480 series, injected some go-faster silicon, and given this laptop a price tag that most business users will find hard to resist.",
  "pros": [
    "Reasonable price",
    "Excellent performance",
    "Great battery life"
  ],
  "cons": [
    "Dell proprietary PSU"
  ],
  "article": [
    "Dell uses the Latitude brand for a wide range of computing products, including laptops, tablets and Ultrabooks. They’re primarily aimed at business users, though potentially some of the cheaper Dell devices might be of interest to students too.",
    "Of these, the 7000 Series is an Ultrabook range and contains machines that have 12, 13 or 14-inch displays, and either 7th-gen Intel hardware, or, as with the new Latitude 7490 model reviewed here, 8th-gen processors and chipsets.",
    "If you are willing to accept previous generation Intel technology and relatively little storage space, a Dell Latitude 7490 can be bought for as little £1,119 ($1,049).",
    "However, if you’d like something with more current silicon inside and SSD storage, then the cost is £1,219 ($1,209). A flagship model, with a Core i7 CPU, 16GB of RAM and 512GB of storage is £1,529 ($2,039). Compared with what Lenovo, HP and Toshiba ask for similarly specified hardware, that price seems, like the whole 7490 series, very competitive.",
    "Lenovo has the ThinkPad T480, although it doesn’t offer the same processor on that model (yet). It isn’t on the Lenovo X1 Carbon either, and that costs more for a lower spec.",
    "On price, the HP EliteBook 1040 G4 is a good fit, even if it is still using Intel 7th-gen silicon on that model.",
    "Asus has the excellent ZenBook 3 Deluxe UX490UA that can be found for a little more, but comes with a Core i7 class CPU, 16GB of RAM and double the storage of this review model.",
    "As with most of the Dell range, customization options are available at the point of purchase, but with this series, the amount of RAM and storage is fixed for each model.",
    "If you don’t like the combinations on offer, some memory and storage enhancements are possible by the end user.",
    "For good or bad, the Latitude 7490 is made mostly of plastic.",
    "Where others obfuscate the exact nature of their devices with paint and thin metal facings, Dell embraces plastic as its material of choice, and the surface finish achieved with it is admirable.",
    "Poorly designed plastic machines flex and buckle, but the Latitude 7490 feels ridged and robust in all the critical areas, like the hinge, and where you place your palms to type.",
    "The screen hinge is strong and allows the display to lie entirely flat. What value this might have on a machine that doesn’t have a touch display we’re unsure, but there might be some advantage we’ve overlooked. Some 7490 models do have touch displays, we’re told, although at the time of writing we couldn’t find any on the UK or US Dell sites.",
    "Because of the 180-degree hinge travel, Dell kept the rear of the 7490 entirely clean, with no ports or vents whatsoever at the back. All the ports are on the sides, and the vents are underneath. Therefore, it’s worth bearing in mind that you should never place the machine on a soft surface where the vents could become blocked, as it would undoubtedly overheat.",
    "The ports haven’t changed at all from the 7480 series, with triple USB 3.1 (Gen 1) Type-A ports and a single Thunderbolt 3 USB Type-C. There is also an RJ-45 Ethernet port, Smart Card slot, microSD card and SIM card receptacles.",
    "The review machine didn’t have the LTE module to make use of the SIM slot, and as the standard for these isn’t a global one, the options for the LTE hardware will be different around the world.",
    "Not providing a full-size SD card slot is mildly annoying, but adapters for Type-A USB ports don’t cost much.",
    "The keyboard and trackpad are both better than we’d anticipated and exude the quality we’d expect from a more expensive brand. We especially liked the trackpad, which has keys at both top and bottom instead of using a flexible lower edge.",
    "Given the amount of gutter space to the left and right of the keyboard, maybe a wider design could have been employed. That said, the keyboard design works well enough for typing, even with large hands.",
    "Another strong point is the AU Optronics 14-inch IPS panel that’s a decent brightness and has a healthy color gamut. It also doesn’t use pulse-width modulation (PWM) to adjust brightness, with the negative impact that can have on eyesight.",
    "Ergonomically, this is one of the smaller machines in this category, if only by a few millimeters. There are smaller machines, like the Lenovo X1 Carbon, but this device is certainly very portable.",
    "As a replacement for the previous 7480 models, the new 7490 looks much the same from the outside, but has had a complete overhaul internally.",
    "New Intel Kaby Lake R processors have gone beyond what designers could previously imagine with a 15W budget, and the review model had an Intel Core i5-8350U quad-core 1.7GHz (Turbo 3.6GHz) processor under the hood, which is the equal of many desktop CPUs.",
    "Technically this chip can take 25W in a sprint, but also gear down to 10W should longevity be the primary objective.",
    "The processor isn’t user upgradable, but it is possible to remove the base by undoing eight screws – then you can increase the amount of RAM and change the storage options.",
    "Business machines are more focused on security than consumer notebooks, and the Dell Latitude 7490 is well endowed to keep its contents safe.",
    "The three main pieces of the security puzzle are a Smart Card reader, NFC sensor and fingerprint reader. Those who also want face recognition can add it as an option, but the review machine just had a simple 720p 2D camera.",
    "Those who are inherently paranoid, and we all should be by now, will be concerned that the camera doesn’t have a privacy cover.",
    "The fingerprint reader is a high-quality device that rarely misread in our tests. As this is likely to be the security mechanism most people will use, it’s a big plus point that it works reliably.",
    "The Intel Core i5-8350U quad-core CPU is rapidly becoming the darling of laptop designers. It delivers much of the power that the Intel Core i7-8550U offers but has a lower unit cost and a less detrimental impact on battery life.",
    "The 8GB of DDR4 system memory and 256GB of storage is enough to run, but heavy users might find that storage gets somewhat snug after a few months use.",
    "The Dell policy on memory and storage is that these things aren’t generally adjustable in the customization part of the purchase path, and therefore if you want more, then you need to choose a different model. Or, get a screwdriver out and source the parts for a user upgrade."
  ],
  "headers": {
    "2": "Price, availability and value",
    "9": "Design",
    "25": "Security",
    "29": "Specifications"
  },
  "links": {
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "cheaper Dell devices": "https://www.techradar.com/news/dell-laptop-deals",
    "Ultrabook": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Lenovo X1 Carbon": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/lenovo-thinkpad-x1-carbon-review-1207904/review",
    "HP EliteBook 1040 G4": "https://www.techradar.com/news/hp-takes-work-beyond-the-office-with-new-elite-1000-series",
    "ZenBook 3 Deluxe UX490UA": "https://www.techradar.com/reviews/asus-zenbook-3-deluxe-ux490ua"
  }
}