{
  "source": "https://www.techradar.com/reviews/plushcare",
  "title": "PlushCare review",
  "category": "computing",
  "updated": "2020-02-24T19:00:06Z",
  "author": "jonas-p-demuro",
  "summary": "The doctor’s office on your phone or computer",
  "verdict": "PlushCare is a growing telemedicine platform, bolstered that they are in network with many insurance providers.",
  "pros": [
    "Money back guarantee",
    "In network with major insurance plans",
    "Options for support",
    "Mobile apps"
  ],
  "cons": [
    "Higher cost",
    "Delays in test results",
    "No online chat support option",
    "US only"
  ],
  "article": [
    "After Ryan McQuaid had spent too much time waiting around to see the doctor, and Dr. James Wantuck as a physician realized how overloaded healthcare was, they set out to start PlushCare. Their vision was to be able to get folks healthcare as easy as they could use an app to order their next meal or taxi.",
    "The beginnings were certainly humble, with Dr Wantuk seeing patients at his San Francisco office, and Ryan working out of a room at the back to answer phones and make appointment bookings. Today, they have over 100 physicians and employees working for PlushCare, with an excess of 100,000 folks having used this service.",
    "PlushCare certainly emphasizes that it is simple, and easy to use. It starts with downloading their mobile app to your smartphone, and both Android and iOS apps are available. Through this app, appointments with a provider of the patient’s choice can be scheduled. The appointment takes place though the smartphone, through their secure video platform. This app is totally integrated with the patient’s insurer, labs and pharmacy to streamline care and make it painless and efficient.",
    "PlushCare physicians are located in all 50 states, but the service is not available outside the US. Doctors, according to PlushCare are “Highly-skilled,” and “Trained at the top 50 U.S. Medical schools,” although it is unclear which ranking of schools was used (The US News & World Report is a more popular ranking of medical schools but it was not specified that this was the one). While it is not specified if the doctors are all Board Certified, or Board Eligible, they do reportedly have an average of over fifteen years of experience, which is reassuring they have seen your problem many times previously.",
    "The PlushCare service covers a wide gamut of patient problems, with many listed on the website. These include routine primary care problems, like sinus infections, sore throat, and pink eye, to management of ongoing chronic conditions, like diabetes, hypertension, and thyroid disorders. PlushCare also lists that they handle prescription renewals, and indicate that appointments take less than 15 minutes. A Doctor’s note can also be written for a school or work excuse of up to three days.",
    "User reviews for Plushcare are generally favorable, and truth be told we had to pick through them to find the complaints among the Yelp reviews of the service. An issue we found was that while their doctors do provide prescriptions as indicated, they will not provide them for addictive substances. While we certainly think that this is good practice, as it is necessary to monitor the patient and provide follow up after an online visit with these types of drugs, some users were irked, and wish that they had known of this issue upfront.",
    "Other recent reviews from this year point out that the care can be less than timely via the PlushCare telemedicine approach. In one case, a patient had symptoms of a possible pneumonia, and while PlushCare did order a chest X-ray (and on balance we feel obligated to point out that some other virtual providers do not even order imaging or lab tests), but was dissatisfied to find out the results were going to take five days, and sought care elsewhere. Another patient complained that in fact their skin issue was improving with the treatment prescribed by the PlushCare doctor, but after the third visit was told to seek more direct medical care.",
    "These types of cases aside, PlushCare does indicate that it has a 97% patient satisfaction rate, which we can believe from the vast majority of positive reviews.",
    "The support that PlushCare offers is nothing fancy, but we appreciate that it is quite direct. There are two choices, the first being a toll free number, and the second, an email address. There is no online portal or chat options, but there is an appropriate disclaimer that for an emergency or crisis “Please don’t use PlushCare. Dial 911 or go to your nearest emergency room,” which sounds like good advice.",
    "The PlushCare pricing is fairly simple, and refreshingly transparent. Without insurance, the price is higher than some competitors at $99 (£76), and there is also a $199 (£153) that gets crossed out next to it, leading us to wonder if they plan to go back to the higher price in the future.",
    "Additional details include that there is a 100% money back guarantee if not fully satisfied. Furthermore, PlushCare is in network with most major insurance providers, including United Healthcare, Cigna, Aetna and Anthem Blue Cross, so this can cost the member just the co-pay for the visit.",
    "Elsewhere, in a response from a patient complaint, PlushCare indicated that it was moving towards a subscription model. The plan is for the first 30 days to be free, and thereafter, the charge will be $9.99 (£7.68) monthly to continue to use the service. It is unclear when this will be starting.",
    "Choosing a telemedicine platform is certainly a challenge, and PlushCare provides a compelling choice. The pros to highlight include the multiple support options, that it is in network with many insurers, the wide variety of medical issues covered, that the doctors are willing to order tests, and write doctor’s notes as needed. The cons to mention are the higher pricing if paying cash, the concern that this is going to a monthly subscription model, and that this service is only available in the US. Putting this all together leads us to conclude that PlushCare is worth trying for users that are in network."
  ],
  "headers": {
    "2": "Features",
    "5": "Drawbacks",
    "8": "Support",
    "9": "Pricing",
    "12": "Final verdict"
  },
  "links": {
    "PlushCare": "https://plushcare.com/",
    "US News & World Report": "https://www.usnews.com/best-graduate-schools/top-medical-schools/research-rankings",
    "telemedicine": "https://www.techradar.com/best/best-telemedicine-software"
  }
}