{
  "source": "https://www.techradar.com/reviews/pc-mac/peripherals/aoc-u2879vf-1325886/review",
  "title": "AOC U2879VF 4K monitor review",
  "category": "computing",
  "updated": "2020-10-01T14:30:57Z",
  "author": "desire-athow",
  "summary": "This 28-inch 4K monitor is seriously affordable",
  "verdict": "You can't go wrong with this display. 4K has come of age and the AOC U2879VF is probably its best exponent right now.",
  "pros": [
    "Very low price for a 28-inch monitor",
    "FreeSync technology",
    "Impressive colour accuracy",
    "Picture-in-Picture"
  ],
  "cons": [
    "No speakers",
    "No VESA mount",
    "No portrait mode"
  ],
  "article": [
    "Medium-sized 4K monitors have thankfully dropped in price a little since they first hit the scene, dipping below £300 (around $400/AU$520) - a price point that makes them competitive with ultra-wide 21:9 monitors.",
    "The AOC U2879VF is up there with the cheapest 4K 28-inch monitors in the UK right now, with a price of less than £220 at Amazon.",
    "At that price and given our past experience with first-generation 4K monitors of that size, we'd expect a few corners to be cut to bring the price down.",
    "The only real let-down is the fact that AOC opted for a TN panel rather than an IPS one, but that's understandable given the target price.",
    "Can it be inferred then that the overall performance will be subpar? Absolutely not. In fact, quite the opposite – AOC is the first vendor we know of that has shipped a 'colour uniformity data sheet' with a sub-£300/entry-level monitor.",
    "That A4 document provides details of the luminance uniformity of the screen and the sRGB average Delta E colour temperature. Both values for the monitor (luminance varied between 100% and 101%, and Delta E was 2.29) fall well within the acceptable range dictated by AOC.",
    "That's not the only notable feature of this monitor. It is also the most affordable we know of that comes with FreeSync, AMD's adaptive refresh technology, which reduces tearing, stuttering or ghosting, making it ideal for gaming with AMD-equipped systems.",
    "Out of the box, the monitor sports a glossy piano bezel with a matte display and a metal plate that is screwed to the stand. The power supply is external which may irk some of you looking for an integrated design.",
    "Three cables (HDMI, VGA and DP) are included, a welcome change from other vendors that tend to bundle just one. The control buttons are located on the lower edge of the monitor, on the right of the AOC logo; they produce a reassuring, audible click when pressed.",
    "Sadly, there is no VESA mount so you will have to stick with the stand. You can't rotate the display either, it only tilts slightly (-5/+24 degrees).",
    "The U2879VF boosts a 1ms response time with AOC's proprietary flicker-free technology smoothing over the viewing experience. That's further improved by the Innolux-sourced 10-bit 'Deep Color' RGB display panel, one which allows for a much wider colour range.",
    "The monitor's rear-facing connectors include MHL-compatible HDMI (v2.0), DisplayPort, VGA and DL-DVI. You will be able to combine two or more of them in PiP (Picture-in-Picture) or PbP (Picture-by-Picture) modes.",
    "There's a headphone output but no speakers. The monitor is, overall, rather thin for a screen of its size and weighs about 8kg which makes it easy to move around.",
    "Brightness and contrast ratio are rated at 300cd/m2 and 1000:1 respectively. In the real world, we were more than happy with the viewing experience. Colours were vibrant without being harsh and the picture quality was more than adequate for casual office usage. The viewing angles were adequate, bearing in mind that this is a TN panel.",
    "You can always play around with the OSD settings which provide an impressive level of granularity. More details are provided in the monitor's online manual.",
    "Note that you can bypass the OSD and use AOC's own i-menu instead – this is a software-based display control panel. Another interesting tool is Screen+ which can split your desktop into different panels and is essentially an improved version of Windows Snap.",
    "This monitor delivers a punchy performance, offering excellent value-for-money, superb colour accuracy and great features like PiP and uniformity compensation. There are a few minor niggles but none of them really outweigh this monitor's big selling points.",
    "Businesses will love it because of the PiP ability, its affordability and that flicker-free feature which may reduce the chance of suffering from headaches. Add in a great design, a three-year warranty and some nifty tools, and you get very close to perfection, at least for a business monitor.",
    "(At techradar pro, we're adamant that moving to a 4K monitor is one of the best upgrades that any business or professional can make to improve their workflow).",
    "Hannspree's HU282PPS is the only other monitor we've recently tested that is in this price range. The only way to go cheaper is to look for a 23.6-inch 4K monitor (some cost less than £200 – around $265, AU$350), or shoot for a 40-inch 4K television (for as little as £220 – around $290, AU$385), and both those options lack the finesse of a 28-inch solution."
  ],
  "headers": {
    "16": "Early verdict"
  },
  "links": {
    "AOC U2879VF": "https://www.techradar.com/news/computing-components/peripherals/aoc-s-speedy-28-inch-4k-freesync-monitor-targets-gamers-and-photo-editors-1314593",
    "£220 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FAOC-U2879VF-Inches-LED-Monitor%2Fdp%2FB0163JLIWU%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-6662222313028493000-21",
    "monitor's online manual": "http://aocmonitorap.com/v2015/au/user_manual.php?pid=5155",
    "4K monitor": "https://www.techradar.com/news/computing-components/peripherals/here-s-why-every-office-worker-deserves-a-4k-monitor-1321843",
    "Hannspree's HU282PPS": "https://www.techradar.com/reviews/pc-mac/monitors-and-projectors/monitors/hannspree-hannsg-hu282pps-1325332/review?"
  }
}