{
  "source": "https://www.techradar.com/reviews/ravpower-pd-pioneer-70200mah-250w-portable-power-station",
  "title": "RAVPower PD Pioneer 70200mAh 250W portable power station review",
  "category": "computing",
  "updated": "2020-09-08T20:30:42.515Z",
  "author": "desire-athow",
  "summary": "And now for something slightly different",
  "verdict": "The PD Pioneer 70200mAh will appeal to a niche audience that wants to strike a balance between price, performance and form factor. A very difficult one but RAVPower comes very close to a perfect product.",
  "pros": [
    "30 month warranty",
    "Good price (with promotions)",
    "Great design",
    "Two AC outlets"
  ],
  "cons": [
    "No wireless charger",
    "No vehicle lighter port",
    "No LCD screen"
  ],
  "article": [
    "From time to time, something spectacular lands on our doorsteps, this time around, it is a rather unexpected parcel that we got from RAVPower, the popular electronics manufacturer that specializes in portable battery chargers/emergency laptop power banks.",
    "What was sent to us is the PD Pioneer 70200mAh (70.2Ah) 252.7W battery pack, an accessory that could help remote workers take the whole work-from-home paradigm to new heights, figuratively rather than literally as you can’t technically take this device with you on flights as it exceeds the maximum allowed battery capacity.",
    "It offers seven connectors that can deliver power in AC or DC mode, to almost all small electronics available on the market. If you are unsure, check the small prints on the power adaptor of your device.",
    "RAVPower has put the suggested retail price of the PD Pioneer 70200mAh (also known as the RP-PB187 power station) at a rather steep $280 however, regular promotional codes exist. The one at the time of writing was POWER187 which shaved the price of the device to a much more palatable $188 including delivery.",
    "The battery comes with its own carrying bag for good reason; it makes it easier to carry such a hefty power bank as well as the USB cable, the removable strap and the power adaptor needed to charge it. You could easily mistake it for a portable Bluetooth speaker because it shares a lot of design elements with the latter category, the boxy shape and the handle between the two obvious ones.",
    "At 130 x 130 x 189mm, it is more compact than you’d think but its weight - more than 2.4Kg - betrays its true nature. The handle is firm and solidly anchored to the body of the power station.",
    "The designers have kept the details to a minimum; the top houses two 110V 2-pin power outlets, both covered by rubber flaps. Next to them are an LED status light and a circular button which, if pressed for more than five seconds, activates the AC output.",
    "On one side are three full size Type-A USB ports that can deliver between 12W and 18W. Next to the trio is a Type-C port which can be used for charging the PD Pioneer itself or a device that supports Power Delivery like the Dell Latitude 7490.",
    "The other sides contain (a) five blue LED lights that indicate how much battery juice is left (b) separate DC power input and output proprietary barrel-style connectors (c) a power button and a tri-mode emergency LED light. Note that there’s no LCD screen, no wireless charger functionality or cigar-lighter charger.",
    "The bottom of the PD Pioneer contains four rubber feet that elevate it just enough to allow air to circulate through the vents underneath to cool the electronics inside.",
    "The two 110V ports can deliver up to 250W when using one port or up to a total of 300W when using both of them. That should be enough for most small appliances and laptops (excluding the beefier gaming laptops). Power, RAVPower tells us, is stored in premium LG-branded 18650 batteries, dozens of them.",
    "It takes between five and six hours to charge the PD Pioneer depending on whether you use the USB PD Type-C or DC input with the option of using a solar panel. When charging, a fan occasionally kicks in depending on whether the unit reaches 50 degrees centigrade or not. It is slightly distracting but something that is mildly irritating rather than a deal breaker.",
    "You will need to read through the manual before operating the portable power station as its two physical buttons serve more than one purpose each.",
    "There’s an increasing number of manufacturers that have identified mega power banks as a growth opportunity; having a high wattage combined with the ability to support both AC and DC output being a must.",
    "First up is the Baldr portable power station which can cost as little as $250 which can be either more or less expensive than the PD Pioneer depending on those pesky promotions. That one though is a bit of a beast as it is a bit bulkier but also far more powerful than RAVPower’s model, rated at 330W with a 91.2Ah capacity. While it has only one AC outlet and no USB Type-C Power delivery port, it does offer wireless charging, an LCD screen and a 120W vehicle lighter port.",
    "Tacklife costs the same as the Baldr portable power station and offers a lower 300W rated power output with the rest of the feature set being rigorously similar except for one. It offers two AC outlets rather than one. Its design is also probably a bit more enticing than its rival.",
    "The RAVPower PD Pioneer will be useful to those who want to power a low-power AC device or for directly charging laptops (via Power Delivery) or charging multiple USB-powered devices (or a combination of all three use cases). Just don’t expect it to be a replacement for a power generator, this is well beyond its capacity.",
    "It is well built and has most of the features you’d require from a battery charger (or power station as it is called). There are other rivals available but RAVPower is a better known brand and with a 30-month warranty, it deserves a spot on your short list as long as you are not fussed about living without wireless charging, an LCD screen and a vehicle lighter port."
  ],
  "headers": {
    "3": "Price",
    "4": "Design",
    "10": "Performance and in use",
    "13": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "portable battery chargers": "https://www.techradar.com/news/top-portable-chargers",
    "emergency laptop power banks": "https://www.techradar.com/news/best-portable-laptop-battery-chargers-and-power-banks",
    "PD Pioneer 70200mAh": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1116139954396450200&xs=1&url=https%3A%2F%2Fwww.ravpower.com%2Fproducts%2Frp-pb187-portable-power-station&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fravpower-pd-pioneer-70200mah-250w-portable-power-station",
    "portable Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Dell Latitude 7490": "https://www.techradar.com/reviews/dell-latitude-7490"
  }
}