{
  "source": "https://www.techradar.com/reviews/avg-antivirus",
  "title": "AVG Antivirus review",
  "category": "computing",
  "updated": "2020-08-06T13:41:49Z",
  "author": "jacob-parker",
  "summary": "The right antivirus tool for you?",
  "verdict": "AVG AntiVirus is one of the better security products on the market but due to a few flaws, such as an unusually heavy system impact during scans, it’s not quite the best.",
  "pros": [
    "Great scan customization options",
    "High threat detection rates",
    "Can be used for free"
  ],
  "cons": [
    "Premium version is pricey",
    "Noticeable system impact",
    "Throws up more false-positive alerts than competitors"
  ],
  "article": [
    "With over 200 million users, AVG Antivirus is easily one of the most popular antivirus software platforms in the world. It’s part of the Avast family of security products which includes the similarly well-known Avast Antivirus package.",
    "AVG Antivirus shares the same core technology as other Avast programs but has its own unique user-interface design. With the free version of this software, you’ll get access to important features such as virus-detection, PC performance checks, and rapid security updates.",
    "However, some useful antivirus tools can only be accessed by upgrading to a paid AVG product. For example, you’ll need to purchase AVG Internet Security to block web-cam snoopers, get enhanced firewalls, or block fake eCommerce websites.",
    "AVG Antivirus Free is the most basic version of this platform and can run on modern Windows, Os X, and Android devices. Because it uses the same AVG threat database as premium AVG programs to uncover dangerous viruses before they do damage to your devices, for most users it will provide plenty of protection.",
    "At $69.99 per year for a single device or $89.99 for up to 10 devices, AVG Internet Security is an expensive antivirus solution. For the sake of comparison, the comparable Bit Defender Internet Security package costs $40 per year for a three-device license. Despite the cost, AVG Internet Security is still worthy of consideration thanks to its AI-powered real-time threat detection feature.",
    "If you want to take things to another level, you can go for AVG Ultimate instead. This is essentially the AVG Internet Security package combined with AVG TuneUp, a robust tool that wipes unneeded data off your PC, improves battery life, and reduces processing lag.",
    "At the core of the AVG Antivirus system are scanning tools that will search your device and compare your files against a vast database containing thousands of malware signatures. If a suspicious file is encountered that doesn’t match a known virus, AVG will analyze it and use heuristic monitoring to work out whether it poses a threat to your system.",
    "After installing AVG Antivirus Free, you’ll also be automatically defended from spyware and malware hidden in email attachments. If you’ve been following the news, you’ll know that ransomware attacks have been on the rise for the past few years. Unfortunately, you’ll have to purchase AVG Internet Security to get targeted protection from any ransomware-style viruses.",
    "When you install AVG Antivirus, you’ll get immediate free access to the AVG Secure Browser. This basically looks and operates like a more secure version of Google Chrome, protecting you from dangerous websites by forcing HTTPS encryption, masking your digital fingerprints, and blocking tracking scripts.",
    "Thanks to the combination of Avast and AVG’s previously distinct antivirus engines, AVG Antivirus does well when it comes to detecting both known and novel security threats. It’s not leading the market though, so you may want to look elsewhere for top-tier protection.",
    "In the December 2019 Report of German comparison lab, AV-Test, AVG Antivirus was able to block 100% of prevalent malware samples thrown at it. More impressively, it also detected and neutralized 100% of 0-day malware attacks, easily exceeding the industry average of 99.1%.",
    "The latest antivirus performance report released by AV-Comparatives wasn’t quite as positive, however. This unbiased service found that AVG Antivirus missed 0.7% of threats and produced 8 false-positive results, falling short of the high bar set by Symantec, Bitdefender, and Panda antivirus tools.",
    "Although it’s one of the most secure platforms on the market, AVG Antivirus certainly loses points when it comes to slowing down your device during scans. During our testing, processing times increased by about a third on our medium-specced test rig.",
    "Reports from impartial antivirus comparison services back up our experience. AV-Test found that popular websites took about between 31% and 34% longer to load while AVG Antivirus running, almost double the industry average of 18%.",
    "Navigating around the AVG Antivirus user interface could hardly be easier. The basic menu lets you choose between starting a free scan or opening a paid-tool such as the hacking attack protection suite. There are six different scan types to choose from, including a basic file system Computer and more advanced options like Boot-Time Scan that will notify you of any malicious applications loading before Windows starts.",
    "There’s also a Schedule Scan option that’s far more advanced than you might guess at first glance. It lets you set a time to carry out multiple device scans and you can decide exactly which folders and areas of your system are checked.",
    "It’s even possible to determine how potential threats are dealt with in advance and to save your custom scan to be started manually in the future. Once saved, your scan will appear alongside traditional scan types on the menu. In short, this an excellent option for power users who want total control over their system security.",
    "Getting AVG Antivirus setup on your computer could hardly be easier. There’s no need to sign up with your email, though registering for a My AVG account will allow you to monitor different devices from one place.",
    "After downloading the software from the AVG site, you’ll be given a quick choice of whether or not to install AVG Secure Browser and, after a few minutes, everything should be loaded up. During installation, if AVG detects another antivirus tool on your system, it’ll activate in Passive Mode with real-time protection switched off. Through this clever trick, AVG prevents potential threat-detection conflicts.",
    "AVG Antivirus is likely to throw up more false-positive threat-detection results than competitors such as Bitdefender and loses points in other key areas like system impact. All the same, this antivirus suite has one of the cleanest user interfaces on the market today and remains an excellent choice for advanced users who wish to fully customize their threat monitoring system."
  ],
  "headers": {
    "3": "Costs and What’s Covered",
    "6": "Antivirus Protection",
    "9": "Antivirus Performance",
    "12": "System Impact",
    "14": "Interface",
    "17": "Installation and Support",
    "19": "Final Verdict"
  },
  "links": {
    "AVG Antivirus": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3767022408986575400/https://www.avg.com/",
    "antivirus software": "https://www.techradar.com/best/best-antivirus",
    "Bit Defender Internet Security": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "December 2019 Report": "https://www.av-test.org/en/antivirus/home-windows/manufacturer/avg/",
    "AV-Comparatives": "https://www.av-comparatives.org/comparison/",
    "AV-Test": "https://www.av-test.org/en/antivirus/home-windows/windows-10/december-2019/avg-internet-security-19.8-194903/"
  }
}