{
  "source": "https://www.techradar.com/reviews/apple-macbook-air-2019",
  "title": "Apple MacBook Air (2019) review",
  "category": "computing",
  "updated": "2020-12-11T02:46:10.559Z",
  "author": "matt-hanson",
  "summary": "How does 2019’s MacBook Air model fare?",
  "verdict": "While an excellent entry with a stunning new display, the 2019 MacBook Air's dual-core processor still feels underwhelming. Even with a lower price of admission, it’s still pretty expensive considering its light starting specification and pricey upgrades.",
  "pros": [
    "Lovely design",
    "Screen is great",
    "Fantastic battery life",
    "New lower price"
  ],
  "cons": [
    "Underpowered",
    "Lack of storage space",
    "Pricey to upgrade",
    "Only two Thunderbolt 3 ports",
    "Expensive"
  ],
  "article": [
    "The Apple MacBook Air (2019) brings the line back to where it belongs, as Apple’s thinnest and lightest, albeit due in large part to the 12-inch MacBook line getting axed. Still, the Air is deserving of the title, and even more now than ever.",
    "Coming with Apple’s typical almost tank-like construction as well as top-notch features, all of which have been inherited by the MacBook Air (2020), the Apple MacBook Air (2019) has also dropped its price. It’s more affordable than its predecessor while touting much-needed improvements over the 2018 version. That makes it an even more enticing proposition to anyone who needs a student laptop or wants to stick with that seamless Apple environment.",
    "In comparison to some other ultrabooks out there, the Apple Macbook Air (2019) might not seem to measure up on paper. However, the Air has been refined over the years, and, as a much cheaper option compared to the MacBook Pros, it can be a solid choice for some.",
    "When Apple first announced the new Apple MacBook Air 2019, it was great news for many reasons. First of all, we weren’t really anticipating a refresh. And second of all, the entry-level MacBook Air (2019) not only got a refresh, but it also received a price drop – it’s now down to $1,099 (£1,099, AU$1,699).",
    "That’s hardly budget territory, but this move does make the MacBook Air more affordably priced than ever before, and seeing prices go down with updates – rather than up – is always a lovely welcome. For comparison’s sake, the MacBook Air (2018) started at $1,199 (£1,199, AU$1,849) when it hit the streets.",
    "The base configuration of the Apple MacBook Air 2019 gives you a 1.6GHz dual-core 8th-generation Intel Core i5 processor with Turbo Boost up to 3.6GHz, 8GB of LPDDR3 RAM, 128GB storage and Intel UHD Graphics 617.",
    "You can also purchase a configuration with similar specs, but double the storage at 256GB, which will cost you $1,299 (£1,299, AU$1,999).",
    "That essentially means you’re paying $200/£200/AU$300 more for a 128GB storage increase, which is a pretty pricey upgrade. It’s a bit frustrating that Apple has kept that large jump in price for a fairly small amount of extra storage space. Meanwhile, you can double your iPhone XR storage for just another $50/£50.",
    "It makes much more financial sense to get the 128GB version, and then either buy an external hard drive (check out our piece on the best external hard drives for Macs for options) separately, or use cloud storage like iCloud to save your files.",
    "As is unfortunately typical with Apple’s hardware, there’s no simple way to open up the MacBook Air and upgrade the SSD yourself.",
    "Consequently, while we’re glad to see the price drop for the MacBook Air, shipping a premium – and while the Air is the most affordable MacBook, at this price it’s still premium – laptop with just 128GB of storage seems pretty stingy in 2019 – especially since Apple charges so much more for a slight upgrade in storage space.",
    "One of the main threats to the Apple MacBook Air 2019 is that Windows laptops are now even slimmer and more powerful than ever. Apple no longer has the monopoly on thin and light laptops, as there are a number of Windows-based Ultrabooks that come with similar (or even better) specifications for the same price. And, you can be sure that they all have bigger hard drives than just 128GB. For example, the HP Spectre x360 (2019) is around the same price, but with 256GB storage and an even much faster processor.",
    "The lower entry price of the Apple MacBook Air 2019 is positively welcome, that is if you’re set on owning a MacBook. However, due to some of Apple’s not so pleasing habits are still obvious, and because of increased competition from Windows laptops, there are better value options worth considering.",
    "With a new model now out, you may find the price of the MacBook Air (2019) falling, so check out our pick of the best laptop deals regularly to catch any big discounts.",
    "Just like with the MacBook Pro (2019), Apple didn’t change the external design of the MacBook Air (2019) from its predecessor.",
    "This is good news if you’re already a fan of the design of the MacBook Air. However, it’s not so if you want a more substantial update.",
    "This also means that you end up with the same slim laptop with dimensions of 11.97 x 8.36 x 0.61 inches (30.41 x 21.24 x 1.56cm) and a weight of 2.75 pounds (1.25kg). It remains incredibly lightweight, and though it’s not as mind-blowingly light as rivals like the Acer Swift 7, the Apple MacBook Air (2019) is a laptop you can easily lug around in a bag or backpack.",
    "Despite being thin and light, it also manages to feel solid and durable, so you don’t have to fuss over it and be worried about bends and dents. This is thanks to the MacBook Air being made out of an aluminum alloy that looks great and feels robust. By keeping the same design as last year’s model, the new MacBook Air (2019) is once again crafted out of 100% recycled aluminum, which means that no new metal has been mined to build this device. That’s an excellent selling point for anyone who is concerned about the environment, and something we applaud Apple for.",
    "Still, by staying with the same design, it means this year’s model has the same features as the 2018 model, which fall short of our expectations.",
    "The fact that the MacBook Air is only equipped with two Thunderbolt 3 ports is disappointing though understandable, considering the slim design of the laptop. However, Apple’s choice to place both ports on the left-hand side puzzled and frustrated us – and it continues to do so in the 2019 model.",
    "If one port had been put on each side, it would have allowed people a bit more versatility when charging the MacBook Air. Instead, you always need to sit in a particular position with the power adapter plugged into the left of the laptop.",
    "It also makes the MacBook Air feel a little cluttered – and slightly uneven – if you plug in two (or more if you have an adapter) devices into the Thunderbolt 3 ports.",
    "One area where Apple has made a change – and a welcome one at that – is in regards to the keyboard. The new MacBook Air (2019) now uses the refined third-generation Butterfly keyboard that came with this year’s MacBook Pros.",
    "Earlier versions of the MacBook keyboards using older Butterfly switches were vulnerable to issues such as sticky and unresponsive keys. Apple has gotten a lot of flack for this – not surprisingly, as when you’re dropping a lot of money on a laptop, you’d expect the keyboard to last you a long time without falling apart.",
    "The controversy has been a stain on Apple’s otherwise sterling reputation for quality control and reliability. The updated keyboard is aimed at making it less likely to have issues – however, some people will unsurprisingly think that this doesn’t go far enough. When spending this kind of cash, ‘less likely to go wrong’ just isn’t good enough.",
    "While Apple’s Keyboard Service Program, which will replace a faulty keyboard free of charge, extends to this year’s MacBook Air, it also suggests that the problem might still be prevalent. At this point, we hope that the next MacBook Air (and other MacBook models) ditch the clearly troubled Butterfly switch altogether.",
    "As with the previous model, Touch ID is also present, allowing you to log into the MacBook Air with your fingerprint or pay for stuff using Apple Pay. The bigger Force Touch trackpad is also there, and as with last year’s model, it feels comfortable to use and works extremely well.",
    "Generally, the MacBook Air (2019)’s design hasn’t changed all that much. In some ways, it’s a good thing – but it’s also disappointing as well. Hopefully, the next version of the MacBook Air will try something as ground-breaking as the original MacBook Air.",
    "Possibly the most notable change in the MacBook Air (2019) is the screen, which now touts Apple’s True Tone technology.",
    "The True Tone feature automatically fine-tunes the color temperature – usually whites – shown on the display, depending on the ambient light you’re MacBook Air is in. It can have a pleasing effect, particularly on your eyes – when you first start the MacBook Air (2019), you can toggle the setting on and off to experience the difference. And, while this setting may not be for everyone, we have found it does quite an effective job of making colors look more natural.",
    "True Tone has been included in MacBook Pros for some time now, and we’ve often thought that it wasn’t for everyone. MacBook Pros are often used by photographers, video editors and digital creatives who need accurate colors – something that True Tone messes with. However, with the MacBook Air, which is aimed at more casual laptop users who aren’t as concerned about color accuracy, using this feature makes much more sense.",
    "It’s a nice addition, but probably not one that will convince you to want to swap your 2018 model for this year’s.",
    "Elsewhere, the screen is the same – a 13.3-inch Retina display with 2,560 x 1,600 resolution that delivers detailed and vibrant colors. Last year’s model introduced remarkably thin bezels around the display, making the screen span almost the entire width of the MacBook Air. The display has long been one of the MacBook Air’s best qualities, so we’re pleased that – True Tone aside – Apple stuck with that winning formula."
  ],
  "headers": {
    "3": "Price and availability",
    "14": "Design",
    "28": "True Tone screen"
  },
  "links": {
    "12-inch MacBook": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-1287806/review",
    "MacBook Air (2020)": "https://www.techradar.com/reviews/macbook-air-2020",
    "student laptop": "https://www.techradar.com/news/mobile-computing/laptops/10-best-laptops-for-students-983385",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "best external hard drives for Macs": "https://www.techradar.com/news/best-external-hard-drives-for-mac",
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "HP Spectre x360 (2019)": "https://www.techradar.com/reviews/hp-spectre-x360-2020",
    "laptop deals": "https://www.techradar.com/news/the-best-laptop-deals",
    "MacBook Pro (2019)": "https://www.techradar.com/reviews/macbook-pro",
    "Acer Swift 7": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/acer-swift-7-1327419/review",
    "Keyboard Service Program": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1087631711325653800&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fkeyboard-service-program-for-mac-notebooks"
  }
}