{
  "source": "https://www.techradar.com/reviews/chargify",
  "title": "Chargify review",
  "category": "computing",
  "updated": "2020-12-14T23:54:47Z",
  "author": "rob-clymo",
  "summary": "Use Chargify to handle your billing and revenue management for SaaS needs",
  "verdict": "Chargify is easy-to-use software that lets you manage all levels of subscriptions for businesses of any size with a great line in innovative features backed by solid support.",
  "pros": [
    "Great for automating processes",
    "Easily scaled up",
    "Meets PCI standards"
  ],
  "cons": [
    "Some less user-friendly aspects",
    "Reporting could be better"
  ],
  "article": [
    "Chargify is a billing and revenue management platform for subscription payments. This is an area that is becoming increasingly useful to businesses in the wake of the coronavirus pandemic. Being flexible and adaptable to the needs of customers and clients is vital, so Chargify will prove useful to companies that need to frequently change aspects of a subscription-based setup, especially when it comes to B2B SaaS requirements.",
    "Businesses that offers subscriptions can use the platform to not only create package options, but also ensure they're working to optimal performance levels as well as being adaptable for offers, such as discounts or other sales incentives. The Texas-based company works with some of the biggest names in the SaaS business, and continues to develop Chargify to meet the needs of its varied client base.",
    "If you're managing billing and revenue then it’s entirely likely that your requirements might be less than straightforward. In that respect Chargify has developed different packages to suit varying requirements.",
    "Currently, its cheapest package is Scaling, which costs $299 per month. The option allows for 50k of revenue per month, plus +1.0% of revenue on overages. In the middle of the product range is Success, which offers plenty of scalability for businesses that need to adapt quickly. That comes in at $599 per month and includes 75k a month of revenue, with +0.9% of revenue on overages.",
    "The third package option is Custom, which is a specialized creation that requires consultation with Chargify sales staff. It doesn't have a fixed price for obvious reasons as it’s aimed at building a bespoke package for customers.",
    "There are countless feature options to choose from within Chargify, even if you’re signed up for the slightly more slimline Scaling edition. Chargify is all about optimizing revenue collection, so there are plenty of tools for ensuring that the customers in your database are being looked after as best as possible, with many automated features.",
    "The system allows you to set up and manage payments by creating a whole array of different repeat prices, fixing setup fees, choosing trial periods and so on, offering maximum flexibility. In the current climate many customers are looking for increased flexibility, so it's possible to charge amounts in a manner that reflects this need.",
    "Payments can also be processed in a range of different ways, using integration with popular payment providers and offering the convenience of billing by credit and debit card, PayPal, ACH and eCheck.",
    "There is also the provision for offline payments where needed, while dunning is also catered for, ensuring that any overdue subscriptions can still be collected as tactfully as possible.",
    "Considering that Chargify might have to deal with thousands of customers meaning a bulging database the cloud-based setup means it’s easily able to handle large volumes of customers.",
    "Naturally, if your business is processing payments from customers then security is going to be key, so Chargify meets current PCI standards and also underlines that it carries out ongoing security checks and procedures to ensure that its systems are as robust as possible.",
    "Even the basic package delivers intelligent dunning, which is the process of collecting subscription renewals when they’re past due for payment. Using this as just one example Chargify does a decent job of automating this process very efficiently indeed.",
    "You’ll obviously need to configure Chargify in order to get it working properly, which if your company is dealing with large volumes of subscriptions will be a sizeable undertaking. However, Chargify has been well engineered to help automate many of the procedures via a central dashboard area.",
    "It can be used in tandem with many different payment providers from Authorize.Net to Stripe, which means that once you’ve got the component parts in place then the billing and repeat billing of customers is pretty straightforward. This is largely down to the way that Chargify automates a lot of the processing work, with administrators being easily able to make changes and add in sales incentives such as discounts and other special offers as and when they’re needed.",
    "The easily mastered Dashboard area of the system lets you quickly get around the core features of Chargify, supplying an instant overview of key areas of your business activity. Data can also be exported in CSV format for use in other applications, like accounting, bookkeeping and stock management purposes by way of three examples.",
    "The support aspect of Chargify gets regular praise from its users, and looking at the options its good to see a full array of options to choose from. The Chargify help area has a whole online hub dedicated to documentation, which ranges from a basic overview through to detailed breakdowns of specific areas of the software.",
    "As you’d expect, there are also direct contact options, which include support via a ticket system, email and Twitter. There’s a dedicated support line for users inside the USA and outside too. Staff members are available 12am to 12am CT Monday to Friday, excluding holidays.",
    "Chargify is already used by many different companies that require a versatile subscription management package and that’s probably because of its versatility. While the system is relatively easy to setup and manage, it’s definitely powerful allowing finite control over recurring plans and subscriptions.",
    "There’s also the ability to include provide add-ons, on-demand and metered usage options as well as the setting up of intelligent pricing that can be tailored to match the behavior of different customers.",
    "With lots of option for using Chargify with different payment providers, plus a host of integrations with third-party app including the likes of Salesforce, Xero, Shopify, Zendesk the software opens up all sort of possibilities for businesses needing to meet their subscription-based obligations.",
    "Other business software options worth looking at include Sage Business Cloud Accounting, QuickBooks, Xero, FreshBooks, Freeagent, GoSimpleTax, TaxCalc, Nomisma, ABC Self-Assessment or Crunch."
  ],
  "headers": {
    "2": "Pricing",
    "5": "Features",
    "9": "Performance",
    "12": "Ease of use",
    "15": "Support",
    "17": "Final verdict"
  },
  "links": {
    "Chargify": "https://www.chargify.com",
    "subscription payments": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "B2B SaaS": "https://www.techradar.com/news/what-is-saas",
    "Scaling": "https://www.chargify.com/pricing/",
    "Success": "https://www.chargify.com/pricing/",
    "Custom": "https://www.chargify.com/pricing/",
    "Authorize.Net": "https://www.techradar.com/reviews/authorizenet",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "accounting": "https://www.techradar.com/best/accounting-software-small-business",
    "bookkeeping": "https://www.techradar.com/best/best-accounting-software/best/best-bookkeeping-software",
    "stock management": "https://www.techradar.com/news/software/business-software/inventory-management-software-top-six-on-the-market-1255932",
    "Salesforce": "https://www.techradar.com/reviews/salesforce-service-cloud",
    "Xero": "https://www.techradar.com/reviews/xero",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "Zendesk": "https://www.techradar.com/reviews/zendesk",
    "Sage Business Cloud Accounting": "https://www.techradar.com/reviews/sage-business-cloud-accounting",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-online",
    "FreshBooks": "https://www.techradar.com/reviews/freshbooks-2020",
    "Freeagent": "https://www.techradar.com/reviews/freeagent",
    "GoSimpleTax": "https://www.techradar.com/reviews/gosimpletax",
    "TaxCalc": "https://www.techradar.com/reviews/taxcalc",
    "Nomisma": "https://www.techradar.com/reviews/nomisma",
    "ABC Self-Assessment": "https://www.techradar.com/reviews/abc-self-assessment",
    "Crunch": "https://www.techradar.com/reviews/crunch"
  }
}