{
  "source": "https://www.techradar.com/reviews/sharex",
  "title": "ShareX review",
  "category": "computing",
  "updated": "2020-01-31T09:41:03.280Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Try a screen capture tool that goes beyond the basics",
  "verdict": "A superb alternative to Windows' Snipping Tool, going far beyond the basics of screen grabbing and offering enough extras to really make it stand out from the crowd.",
  "pros": [
    "Offers screen capture and recording",
    "Lots of sharing options",
    "Scrolling page capture"
  ],
  "cons": [
    "Can be fiddly to configure",
    "No game capturing or recording",
    "Unappealing interface"
  ],
  "article": [
    "Taking a screenshot in Windows can be as simple as hitting the Prt Scr key and pasting the contents of your clipboard into an image editor. But there will be occasions when you want to do something a little more involved – such as capturing just a portion of your screen, or sharing your captures to the web – and this is when a third-party screen recorder comes in handy.",
    "One such tool is ShareX, and it's is available as a standard application or from the Microsoft Store – and it's free of charge in either case.",
    "ShareX offers a range of screen capture options: full screen, window, region, scrolling capture, and more. You can choose whether or not to include the cursor in screenshots, set up a timer to delay capture, and even perform OCR on text. You can also record onscreen activity as a video or animated GIF.",
    "But where ShareX really comes into its own – and where it gets its name from – is in the sharing options available. Screen captures and recordings can be uploaded to a range of cloud services including image hosting and general online storage, and even social media. There's a lot on offer in with ShareX, including a pretty impressive image editor to tweak your screengrabs before you use them.",
    "If you plan on using the ShareX interface, your experience will not be great. The program is cramped, and far from attractive, so you would much better off spending a little time configuring and learning keyboard shortcuts. There will be times when it is impossible to avoid using the main interface, but ShareX is best experienced when it blends into the background and you don’t really have to think about it.",
    "The beauty of ShareX is that it is much more powerful than it first seems, and its Workflow feature makes it highly customisable, giving you the ability to automated common tasks. For newcomers the process of getting this all set up may seem intimidating, but it's well worth sticking with.",
    "Being able to use a single keyboard shortcut to start a delayed screen capture, specify a region, save the image automatically, upload it to cloud storage and share it online is a fantastic time-saver!"
  ],
  "headers": {
    "4": "User experience",
    "7": "You might also like"
  },
  "links": {
    "image editor": "https://www.techradar.com/best/free-photo-editor",
    "screen recorder": "https://www.techradar.com/news/the-best-free-screen-recorder",
    "ShareX": "https://getsharex.com/",
    "screen capture": "https://www.techradar.com/news/the-best-free-screen-recorder"
  }
}