{
  "source": "https://www.techradar.com/reviews/faxbetter",
  "title": "FaxBetter review",
  "category": "computing",
  "updated": "2020-04-21T10:50:25Z",
  "author": "michael-graw",
  "summary": "Receive faxes for free online",
  "verdict": "FaxBetter is one of the only online fax providers that lets you receive faxes for free. Paid plans are very affordable, but watch out for lax security features.",
  "pros": [
    "Get a free fax number for receiving documents",
    "Inbox displays previews of your documents"
  ],
  "cons": [
    "Not a very secure platform",
    "No option to port an existing fax number"
  ],
  "article": [
    "FaxBetter is an online fax service provider that offers a free fax number for receiving documents, whereas most other free online fax providers only enable you to send documents for free. Plans for sending faxes are also quite inexpensive.",
    "So, is this the right online fax service for your needs? Our FaxBetter online fax review will help you decide.",
    "FaxBetter includes a dedicated fax number and enables you to receive up to 50 pages per month at no charge. The only catch to this is that you need to receive a fax at least once every seven days to keep your free number.",
    "Paid FaxBetter plans start at $5.95 per month to send or receive up to 500 pages per month. With a paid plan, you keep your number for life no matter how frequently you receive faxes. You also get unlimited document storage with your FaxBetter online account.",
    "The main feature that FaxBetter includes is an online dashboard where you can search your entire history of sent and received faxes. Documents are displayed as previews of the first page, which makes it easier to find what you’re looking for, and you can categorize faxes with custom labels. Even better, you can search for a specific document, and FaxBetter will ‘read’ the text inside each document to surface results.",
    "Beyond that, though, FaxBetter lacks the bells and whistles that other paid electronic fax providers offer. There’s no integration with cloud storage services, and notifications are limited to brief emails letting you know that there’s a new fax in your online dashboard.",
    "Getting started with FaxBetter is extremely simple. To create a free account, all you need to do is enter your email and the service will automatically assign you a fax number. The only setting to worry about is one controlling whether or not you receive email notifications when you receive a new fax. Depending on how you like to stay organized, you may also want to set up some label categories to tag incoming documents.",
    "Unfortunately, you don’t have any control over what your new fax number will be with either a free or paid account. You also can’t port an existing fax number to FaxBetter, even if you upgrade to a paid account.",
    "The FaxBetter interface is simple but functional. You can’t drag and drop faxes to categorize them, but you can select multiple documents at once to tag them with a label or delete them from your inbox. The settings page for your account is extremely simple to navigate as there are only a couple basic options available.",
    "We gave FaxBetter a test by sending a fax to our new number from another free online fax service. The service worked about as well as we expected, with the document arriving within about two minutes of sending. It was able to be opened as a PDF in our browser window, and we had an email notification arrive in our inbox just seconds after the document appeared in FaxBetter.",
    "FaxBetter is surprisingly lax about security. First, the provider routinely reuses fax numbers that have been abandoned by free users. The only precaution FaxBetter takes is to keep those numbers out of circulation for several weeks after they’re abandoned.",
    "In addition, FaxBetter accounts aren’t all that hard to break into. Passwords aren’t case sensitive, and there’s no two-factor authentication or other multi-layer security to prevent unauthorized account access.",
    "It’s noteworthy that FaxBetter claims to be fully HIPAA-compliant. However, we wouldn’t recommend this service for sending and receiving sensitive documents.",
    "FaxBetter offers support by phone and email from 8 AM to 8 PM Monday to Friday and 9 AM to 5 PM Saturday (Eastern Standard Time). For help by email, FaxBetter uses a simple support ticket system that enables you to document your support requests.",
    "Helpfully, the company’s website includes a detailed FAQs page that covers most of the common issues that users encounter with this online fax platform.",
    "FaxBetter isn’t the most exciting online fax service in terms of features, but it’s one of the cheapest options if you want to send and receive faxes with relatively few limits. HelloFax arguably sits on the other end of the spectrum, offering an impressive array of features at a premium cost. HelloFax plans start at $9.99 per month to send and receive 300 pages per month. But, you get integration with cloud storage platforms like Google Drive and Dropbox, as well as the ability to send a fax to multiple recipients. HelloFax accounts also support multiple sender accounts, so this service may be a better option for teams.",
    "FaxBetter is one of the few online fax providers that enables you to receive free faxes. This in itself is a major plus, since there are numerous other services that let you send online faxes for free. If you want to pay for FaxBetter to avoid losing your fax number, a paid plan is extremely inexpensive. Just don’t expect a huge trove of high-tech features with your FaxBetter account and be cautious when sending or receiving sensitive documents."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features and utilities",
    "6": "Setup",
    "8": "Interface and performance",
    "10": "Security",
    "13": "Support",
    "15": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "online fax service": "https://www.techradar.com/best/best-online-fax-service",
    "FaxBetter": "https://www.faxbetter.com/",
    "document storage": "https://www.techradar.com/best/best-cloud-document-storage",
    "cloud storage services": "https://www.techradar.com/news/the-best-cloud-storage",
    "email": "https://www.techradar.com/best/best-email-clients",
    "PDF": "https://www.techradar.com/best/best-pdf-readers-for-windows",
    "Passwords": "https://www.techradar.com/best/password-manager",
    "HelloFax": "https://www.techradar.com/reviews/hellofax"
  }
}