{
  "source": "https://www.techradar.com/reviews/redmi-note-8-pro",
  "title": "Hands on: Xiaomi Redmi Note 8 Pro review",
  "category": "phones",
  "updated": "2020-03-23T15:41:23.676Z",
  "author": "tom-bedford",
  "summary": "No, the price isn’t an error",
  "verdict": "The Xiaomi Redmi Note 8 Pro has a price tag that places it in the ‘budget phone’ category, but lots of its features like the 64MP main camera, big battery, and FHD+ display, make it feel like a decent mid-ranger instead. The 3.5mm headphone jack and microSD card support are important additions too, enough perhaps to make up for a few shortcomings like its bloatware, the addition of some unnecessary cameras, and a design that's a bit chunky.",
  "pros": [
    "Low price",
    "64MP main camera"
  ],
  "cons": [
    "Fingerprint sensor rather high",
    "Some bloatware"
  ],
  "article": [
    "Redmi is Xiaomi’s budget phone brand, but while its phones always have impressively low prices, they bring some decent features to the party too, and the Xiaomi Redmi Note 8 Pro is perhaps the best example of this.",
    "The Redmi Note 8 Pro represents the most top-end of the Redmi Note 8 series, although there’s not too much in common between the phones beyond the user interface. And despite being more advanced than a few other Redmi phones, the Note 8 Pro is still decidedly affordable.",
    "The Redmi Note 8 Pro has a collection of features you wouldn’t expect in a phone this affordable – there’s a 64MP main camera with three other snappers, a large Full HD+ display, a big battery, and a decent chipset. So the phone has plenty of aspects you wouldn’t expect given its price tag, but does that mean there’s a catch?",
    "The Redmi Note 8 Pro is available online, via Mi.com, Amazon or certain phone retailers depending on your region.",
    "You can pick the phone up for $399 / £229 (roughly AU$600) if you want 6GB of RAM and 128GB of storage, but if you want to downgrade the storage to 64GB it will cost you $349 / £209 (around AU$500).",
    "The cost in both cases is a lot higher in the US, so it’s likely you’re paying for import costs too. In the UK, though, it’s a pretty affordable price.",
    "The Xiaomi Redmi Note 8 Pro looks surprisingly like the the Realme X2 Pro, so if you’ve seen that phone you’ve basically seen this one. It’s a big, fairly heavy phone, that’s also pretty thick.",
    "On the back there’s a vertical camera bump in the top center, one which also houses a fingerprint sensor (which looks like one of the lenses at first glance). There’s also another lens to the side. A volume rocker and power button sit on the right-hand edge of the device, and on the bottom there's a USB-C port and a 3.5mm headphone jack.",
    "This back is glass, which is fairly rare at this price tag where most phones have plastic rears.",
    "The Redmi Note 8 Pro is rather chunky, thanks partly to the 6.53-inch screen, which is broken up by a teardrop notch at the top. This is a 1080 x 2340 LCD display, which is the display tech we’d expect in a phone of this price, and while the colors are perhaps a little sub-par, the reasonably high resolution partly makes up for it.",
    "While a big display is good for viewing content, social media and more, the phone is arguably too big – we had trouble reaching the fingerprint scanner at times, so some users might find it prohibitively large.",
    "The Xiaomi Redmi Note 8 Pro has a 64MP main camera, which is one of its big draws, but there’s also an 8MP ultra-wide, 2MP macro and 2MP depth sensor present.",
    "The 64MP camera takes pretty decent-looking pictures when you use it in a well-lit environment, so if you like taking pictures of natural settings, or outdoors in any way, this could be a really good tool for you. Saying that, the pixel size is pretty small, so low-light shooting (and night mode) takes snaps that are quite noisy.",
    "The ultra-wide snapper takes pictures that are… well, very wide, as the name suggests. Pictures look reasonable, but there does seem to be a little distortion at the edges of images, more than perhaps in other handsets which have distortion-cancelling software.",
    "As you can expect from 2MP sensors, the macro and depth-sensing cameras don’t seem super useful. Macro pictures are pretty low-res, although they are fairly bright, and we didn’t notice the depth sensor having an impact on picture quality when we shot with or without it (the latter of which was achieved by putting a finger in the way).",
    "On the front there's a 20MP selfie camera, which is a pretty high-res snapper for a budget phone, and we did think the pictures taken on this looked quite good. If you’re a prolific selfie taker, this could be a decent phone for you if you’re on a budget.",
    "The battery in the Redmi Note 8 Pro is 4,500mAh, which is a good size, but then lots of budget phones have big batteries.",
    "We didn’t test the Note 8 Pro enough to draw a final verdict on the battery life, but our initial impression is that it’s quite good. We’d expect the phone to last at least a day from a full battery, perhaps even getting you part way through the second day before you need to power it up again.",
    "Speaking of which, the Redmi Note 8 Pro supports 18W fast charging, which is roughly average for a phone at this price, and while charging it didn’t take too long, it wasn’t lightning-fast either.",
    "The Xiaomi Redmi Note 8 Pro runs Android 9 Pie out of the box, but it can be upgraded to Android 10, and Xiaomi’s MIUI 11 is laid over the top.",
    "This is mainly an aesthetic change, but it’s worth noting the phone comes with a fair few bloatware apps that you might find yourself deleting straight away, like Opera, a web browser app that’s redundant when you’ve got Chrome, and the Mi Community and Mi Store apps, which few people will likely use.",
    "The chipset here is a MediaTek Helio G90T, which isn’t exactly the most premium piece of kit (MediaTek typically makes mid-range and budget phone internals), but for this low price you could do a lot worse, especially since this is one of the company’s better chipsets.",
    "A surprising spec given the low price point is the fact that there’s 6GB of RAM here, as many other phones at this price tag would have just 4GB.",
    "When swiping between home screens and menus the phone didn’t feel sluggish or slow, which is a big difference between this and the Redmi Note 8T. Gaming felt pretty snappy too, if we didn’t boost the graphics too high, so if you’re a mobile gamer this might be one of the best phones at its price.",
    "It’s also worth noting that the Redmi Note 8 Pro could take multiple 64MP pictures in quick succession without slowing down, freezing or crashing, which is a sign that there’s some decent optimization at play here.",
    "The Xiaomi Redmi Note 8 Pro could be one of the best phones at its price, as it would very easily pass as a mid-ranger in quite a few ways. In fact, as we stated earlier in this review, it has a lot in common with the Realme X2 Pro, which goes for quite a bit more.",
    "Sure, the phone is a little larger than we’d like, which may put off some users. There’s a little more bloatware than we’d like too, although a quick deletion spree should see off those offenders.",
    "The screen quality, main camera specs and battery life though are all impressive for the price, so when we’ve conducted our full review we’d expect to see this rank quite well in our list of the best cheap phones, and best Xiaomi phones."
  ],
  "headers": {
    "3": "Xiaomi Redmi Note 8 Pro price and availability",
    "6": "Design and display",
    "11": "Camera and battery life",
    "19": "Features and specs",
    "25": "Early verdict"
  },
  "links": {
    "Mi.com": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2682499383188267000&xs=1&url=https%3A%2F%2Fwww.mi.com%2Fuk%2Fbuy%2Fproduct%2Fredmi-note-8-pro&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fredmi-note-8-pro",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FXiaomi-Redmi-128GB-Blue%25EF%25BC%2588UK-VERSION%25EF%25BC%2589%2Fdp%2FB07ZK52FQ3%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-3633896547391426000-21",
    "Realme X2 Pro": "https://www.techradar.com/reviews/realme-x2-pro",
    "Redmi Note 8T": "https://www.techradar.com/reviews/xiaomi-redmi-note-8t",
    "best cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "best Xiaomi phones": "https://www.techradar.com/news/best-xiaomi-phones"
  }
}