{
  "source": "https://www.techradar.com/reviews/metrofax",
  "title": "MetroFax review",
  "category": "computing",
  "updated": "2020-04-20T09:15:13Z",
  "author": "michael-graw",
  "summary": "Simple, affordable online faxing",
  "verdict": "MetroFax is a good online fax provider if having a mobile app and 24/7 support is important to you. But, it doesn’t emphasize security and the features could be more robust.",
  "pros": [
    "Includes a mobile app for iOS and Android",
    "24/7 support via phone, email, and live chat"
  ],
  "cons": [
    "Only five users included with each account",
    "Very few details about security"
  ],
  "article": [
    "On the hunt for the best online fax services? Then it’s worth taking a closer look at MetroFax. This electronic fax provider offers inexpensive plans and a straightforward user interface. It also comes with a mobile app for sending faxes on the go. Our MetroFax review will help you decide if this is the right online fax provider for you.",
    "MetroFax offers three plan tiers. The Essential plan offers 500 pages sent and received per month for $9.95 per month. The Best Value plan bumps you to 1,000 pages per month for $12.95 per month. The Professional plan includes 2,500 pages each month for $35.95 per month.",
    "All MetroFax plans come with a local or toll-free number. Or, you have the option to port your existing fax number for free. Each extra page above your plan limit costs $0.03.",
    "MetroFax offers several different ways to send faxes. First, you can use the browser-based client to set up a new fax. MetroFax enables you to import contacts directly from Google or from a CSV file, which is extremely helpful for staying organized. The web client also lets you create folders and tags to sort your received faxes, just like you would with many email clients.",
    "The second way to send faxes is directly from your email. Just send an email to the recipient’s number @metrofax.com, and the attachments will be converted into a fax. The subject line and any body text will be included as a cover page for your fax.",
    "Finally, MetroFax stands out for offering a mobile app for iOS and Android smartphones. The mobile app includes the same functionality as the MetroFax web client. But, it can be much easier to navigate your inbox through the app than through your Internet browser on a small screen.",
    "Setting up MetroFax is fairly straightforward, as there isn’t much to set up. To start out, you’ll choose whether you want a local or toll-free number for sending and receiving faxes. If you want to port an existing fax number, you’ll need to contact MetroFax’s support team.",
    "With every MetroFax account, you are able to add up to five users by email address. However, this platform doesn’t offer much in the way of account management or permission features. The most important change you can make during setup is whether all users or only select users are notified of incoming faxes.",
    "The MetroFax user interface feels in many ways like a slightly outdated email client. You can’t drag and drop messages or file attachments, and we would have liked the ability to rename faxes to make future searches easier. It would also be nice to have image previews of faxed documents that show up in the inbox. But, these are minor gripes, and the browser-based interface is otherwise very user-friendly.",
    "The mobile app was similarly antiquated in appearance, but we were pretty happy with its functionality. One tab in the app gives you control over the cover page and recipient information, while another tab lets you browse your device’s files or access the camera to fax a photo on the spot.",
    "We tested out MetroFax’s performance for both sending and receiving. A photo sent from the mobile app to another online fax account arrived in about 90 seconds. MetroFax registered a new fax sent from another provider within the same amount of time, and an email notification appeared just one minute later.",
    "However, note that the service is not available worldwide, so you may have problems if you try using Metrofax from overseas in places such as Europe.",
    "MetroFax doesn’t mention security anywhere on its website, which isn’t a great sign if you need to fax sensitive documents. The platform also does not support two-factor authentication when logging into your online account or the mobile app.",
    "MetroFax offers support via phone, email, and live chat 24/7, which is pretty impressive. The provider’s website also includes a handful of video tutorials that walk you through the process of setting up and using your MetroFax account. For example, there are video tutorials demonstrating how to add contacts, how to send faxes by email, and how to organize your inbox with folders and tags.",
    "One of the best alternatives to MetroFax is Faxage. This online fax provider offers a wide range of plans, with a comparable option to MetroFax’s Essential plan for $7.95 per month plus a $5 setup fee.",
    "In contrast to MetroFax, Faxage enables you to add an unlimited number of users to a single account and offers HIPAA-compliant security measures. This provider doesn’t have a mobile app, but it does have a powerful API for creating custom workflows around your faxes.",
    "MetroFax is an affordable option for sending and receiving faxes online. The platform feels a little bit outdated, but we appreciated that you can easily organize your fax inbox. Having a mobile app to send and check faxes on the go is also a major plus for this electronic fax service. Still, MetroFax probably won’t work for businesses that need to send and receive sensitive documents since it doesn’t offer much information about its security practices."
  ],
  "headers": {
    "1": "Plans and pricing",
    "3": "Features and utilities",
    "6": "Setup",
    "8": "Interface and performance",
    "12": "Security",
    "13": "Support",
    "14": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "best online fax services": "https://www.techradar.com/best/best-online-fax-service",
    "MetroFax": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9387862682918099000/https://www.metrofax.com/",
    "email clients": "https://www.techradar.com/best/best-email-clients",
    "mobile app for iOS": "https://www.techradar.com/best/best-business-ipad-apps",
    "Android smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "logging": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Faxage": "https://www.techradar.com/reviews/faxage"
  }
}