{
  "source": "https://www.techradar.com/reviews/loupedeck-live",
  "title": "Loupedeck Live review",
  "category": "appliances",
  "updated": "2020-12-10T13:24:59Z",
  "author": "nick-rego",
  "summary": "Going loopy",
  "verdict": "The Loupedeck Live is a well-built, and infinitely customizable piece of kit. It streamlines shortcuts, macros, and common tasks into simpler buttons and dials, and you can spend a lot of time tailoring everything to your specific needs. The only drawback is its software, which needs a fair bit of time to get used to, especially when used for live streaming.",
  "pros": [
    "Good build quality",
    "Endless customization"
  ],
  "cons": [
    "Software needs a lot of learning",
    "Streaming integration needs work"
  ],
  "article": [
    "Update 10th Dec: Loupedeck have clarified that while the company previously stated that only two application plugins would be associated per account with the Loupedeck Live, they have since changed this to allow access to all plugins for new and existing customers. A future firmware update will also address issues raised in this review, and we will update this piece accordingly once it has been released.",
    "For anyone whose daily workload involves editing media – be it photos, videos, or any other form – application shortcuts can be a bit of a nightmare to memorize.",
    "Sure, you can be fancy and get a physical keyboard overlay, but imagine having one for each program you use? Devices like the Loupedeck Live are here to remedy that, making it brutally easy to access quick tools and shortcuts no matter which program you’re in.",
    "Think of it as a souped-up version of Elgato's popular Stream Deck, though Loupedeck Live is far from just a fancy row of buttons. Along with the ability to automatically switch between profiles depending on what program is active, it also offers a row of dials to for finer control such as a brush size or even scrolling a document.",
    "The extra buttons and dials certainly comes in handy for even more customizing, but there are of course a few caveats compared to the Elgato Stream Deck. For one, Loupedeck Live's software can be quite confusing at first, mostly due to its naming conventions for the software's various features. The other setback is its price tag, which will make it appeal really only to professional users.",
    "The Loupedeck Live is available directly from Loupedeck’s website, and retails such at Amazon for $269 / £229 / AU$404.",
    "Given that the largest Elgato Stream Deck comes in at $249 / £229 / AU$377, price-wise then, the Loupedeck Live really isn't that much more expensive to consider for anyone who’s just getting into live streaming or production.",
    "The Loupedeck Live is certainly a compact piece of equipment, and can be placed anywhere on your workspace. Whether you want to have it directly under your monitor while live streaming, or positioned right above your keyboard when doing video editing, the choice is yours.",
    "You can use it in both horizontal or vertical orientation, though the included kickstand only supports horizontal use.",
    "In the middle of the Loupedeck Live are twelve customizable buttons, but they're actually not physical buttons. It's one big touchscreen that's been divided into twelve sections, along with two thinner sections on either side that work as labels for the dial controls.",
    "It's a system that works fine when you're pressing a button, though the tactile feeling of a physical button is missed. There is a gentle vibration when you press a button, but it's just not the same.",
    "Right below this are some more buttons, which again can be assigned to whatever you like.",
    "It's most common to assign a button to a specific 'page' of applications that you'd like to launch, or even to a page of commands in a particular application. A cool trick with the Loupedeck Live is that you can actually swipe across the buttons to swap pages. It's a bit unwieldy at first, but a nice touch to have.",
    "Included in the box is a braided USB Type-C cable to connect to your PC or Mac, as well as a Type-C to Type-A dongle if you prefer. It's good that Type-C port that connect to the Loupedeck Live is at a 90-degree angle, so that cables don't come in the way of your work.",
    "Once you've physically plugged in your Loupedeck Live and positioned it where you want it to be, you next have to spend some time with the Loupedeck software. This is the heart of your Loupedeck Live, and it will always run in the background.",
    "The interface shows your Loupedeck Live in the center, with a list of actions on the left and a list of your workspaces on the right. Think of a workspace as your custom list of icons and commands for a particular task.",
    "Say you want to group all of your Adobe and photo editing applications into one workspace for easy launching. Or you want a workspace that lists your favorite games, so you can launch them quicker.",
    "Each workspace can then have multiple pages to swipe through, so your workflow can really be customized to what you need. If that sounds a bit confusing, you'd be forgiven. It takes a bit of time to wrap your head around the terminology used in the app, and differentiating between a 'workspace' and a 'profile'.",
    "On the left hand side you have a list of general actions that you can drag across to any of the buttons or dials on the Loupedeck Live. These could be common keyboard shortcuts, Windows settings, or the ability to launch a specific application.",
    "The downside to these pre-made actions is that they can't be customized with icons, so you'll only get text on a button. For example, we had OBS Studio installed on our PC, but the default 'Activate OBS Studio' action doesn't come with an icon, only text.",
    "In order to properly customize an action (be it a shortcut or an app launch), you have to create a custom action command. So we had to add a new action, name it 'Launch OBS', point to the file path of the exe file, choose an icon, and then add it to the Loupedeck Live.",
    "You'll want to make sure that you have a suitable icon (in image format) for any action you create, otherwise you'll have to make do with just having the text of the action visible instead.",
    "In order to customize the Loupedeck Live to a specific application, you can select it from the Application list within the Loupedeck software. There are already presets for most of Adobe's software, as well as for Windows, Spotify, and OBS Studio.",
    "Clicking on an application then provides you with a new list of commands on the left, which you can then drag over to the Loupedeck Live to begin customizing.",
    "This is where the true power of the Loupedeck Live comes into play, as you can assign complex shortcuts and macros with just a few clicks.",
    "Tired of holding down three keys in order to export a file in Photoshop? Map them to a keyboard macro and then assign that to a button in no time at all. The more you use the software, the easier it gets to understand, so practice is key here.",
    "Loupedeck kindly includes a lot of handy functions already in each preset, so you can get started with your favorite applications straight away.",
    "If there's a specific application you'd like to design a layout for, that too can be accomplished. Just point to the exe file of the app, and then start adding your custom commands to the Loupedeck Live. Every time the application is then launched, Loupedeck Live will load the correct commands and you'll be ready to go.",
    "Where the Loupedeck Live really hopes to excel in is with live streaming. In order to get it to work properly, you first have to download a plugin from Loupedeck's website so that it can talk properly to OBS / Streamlabs.",
    "Once installed, just fire up OBS and you'll see a specific set of OBS actions in the Loupedeck that you can play around with. You'll be able to assign specific scenes, transitions, and even control individual audio sources.",
    "Unfortunately, the overall streaming experience has a number of issues that sadly can only be fixed through future software update. Firstly, the largest problem – the Loupedeck Live doesn't always stay in OBS mode when you're playing a game.",
    "As soon as we launched Overwatch, the Loupedeck Live changed from OBS Studio's panels to the standard Windows one we had set up, meaning that the software had lost focus of OBS, and was switching to its default layout.",
    "To get around this, we had to fire up OBS, launch Overwatch, Alt+Tab back to OBS, and then click on Overwatch again. That's a lot of clicking around to do, and really one that is going to absolutely infuriate streamers.",
    "Another issue with the Loupedeck Live is there's no way at all to customize the icons for the actions. If you'd prefer to use a 'BRB' icon for your waiting scene on the Loupedeck Live, it can't be done. You'll have to make do with just seeing the text instead, which is hard to read if you want to quickly swap between scenes. At least if it was an icon, you could instantly recognize it and click the button.",
    "Another frustration is with audio control. Streamers like to play audio sounds or clips on stream, and with the Loupedeck Live this becomes another struggle. You can technically assign an mp3 or wav file as a custom action, but when you press the button it launches your default music player to play that audio file, rather than instantly playing the audio.",
    "The problem with this is it will instantly throw you out of any fullscreen game you're playing, and show your music player on screen. That again, is a serious no-no for streamers, so this is another thing that Loupedeck needs to figure out.",
    "Lastly, you can only mute or unmute an audio source using the Loupedeck Live – we tried to assign the game audio input to one of the dials to adjust the volume, but it wouldn't let us drag the action there.",
    "So if you want to manually adjust your game or mic volume, there doesn't seem to be a way to do that directly. There's also no way to tell when a source is muted or not on the Loupedeck Live – the icon or text doesn't change to red to indicate a source is on mute, so you could have muted something a while back and not seen that you had forgotten to take it off mute.",
    "There is at least the ability to attach your Twitch account to the Loupedeck Live software which then lets you create a stream clip, run ads, adjust chat settings, or even send a pre-typed message to chat.",
    "When you purchase a Loupedeck Live, you'll get the ability to make custom profiles for any app, as well as integration into Windows/Mac and support for live-streaming software.",
    "While previously Loupedeck announced that you would only get access to two creative applications to integrate into your Loupedeck account, the company has since retracted this decision based on customer feedback. So right out of the box you get integration with popular Adobe software, as well as other applications such as Final Cut Pro X."
  ],
  "headers": {
    "1": "Two-minute review",
    "5": "Price and availability",
    "7": "Design",
    "14": "Setup and features",
    "41": "Don’t buy it if…"
  },
  "links": {}
}