{
  "source": "https://www.techradar.com/reviews/razer-deathadder-v2",
  "title": "Razer Deathadder V2 review",
  "category": "computing",
  "updated": "2020-02-11T18:23:54Z",
  "author": "taylor-clemons",
  "summary": "The Razer Deathadder V2 is a great mouse for work and play",
  "verdict": "The Deathadder V2 is a simple gaming mouse that works as hard as it plays",
  "pros": [
    "Customizable buttons",
    "Comfortable design"
  ],
  "cons": [
    "Feels large in small hands",
    "No scroll wheel tension adjuster"
  ],
  "article": [
    "If you're in the market for a simplified mouse that can comfortably handle office work as well as gaming, the Razer Deathadder V2 is a standout choice. With a price tag of $69.99 (£54, AU$104), it's on track with some of the best gaming mice like the $99 (£99, AU$140) Steelseries Rival 710, though a bit more stylish.",
    "The plain and simple design of this mouse makes it fit right in on both an office desk and in a hardcore gaming space. The angled body makes your hand and wrist rest at a more natural angle, making it comfortable to use for long periods of time. Like it's cousin the Razer Basilisk V2, the DPI sensitivity selector buttons sit below the scroll wheel and are flush with the body so you won't accidentally click them when shifting your hand or moving the mouse.",
    "The bottom of the mouse features two plastic feet that makes the whole unit glide silky smooth across just about any mousepad, woven cloth or hard plastic. The mouse is pretty lightweight as well, making it possible to reduce hand and wrist fatigue if you're working long hours on a project or marathoning Apex Legends rounds.",
    "If you're interested in introducing some RGB elements into your gaming setup, the Deathadder V2 has two different lighting zones: the scroll wheel and Razer logo. You can choose from a staggering 16.8 million colors and customize lighting themes in Razer's Synapse 3 desktop app. There are five different effects you can choose from in the Quick Settings: Breathe, Static, Reactive, Spectrum Cycle, and Audio Meter. If you want more customization options, you have to download the Chroma Effects module separately. However, this is more time and effort than is needed for a mouse with only two lighting zones, and the Quick Settings (while basic) still give you plenty of cool options to play with.",
    "Along with color and lighting, you can customize up to five different DPI settings, including different sensitivities for X and Y axis movement. This is helpful for anyone who uses a mouse and keyboard for CAD programs or digital art as well as long range in-game sniping. You also have the ability to create and store up to five different layout profiles, making it easy to switch from work to play at the press of a button.",
    "The two side buttons can be remapped with either mouse or keyboard inputs. This makes choosing weapons or abilities in games as well as reloading and crouching much easier. In Dead by Daylight, it was easier to have the run and crouch buttons operated by the mouse-hand thumb than the keyboard hand; it allowed freer camera and character movement when forcing a killer chase or maneuvering to heal teammates. It also drastically cut down on accidental key presses: when a Ghostface pops up from around a corner, crouching when you mean to sprint always ends in a sacrificial hook. In Apex Legends, remapping the reload button to the mouse made firefights slightly easier to both start and break off.",
    "It's worth stating that the Deathadder V2 very much feels like an entry level mouse: its limited button layout and design won't be suited to MMO players or games that heavily rely on ability attacks. However, for those who work as hard as they play, this mouse is the perfect choice."
  ],
  "headers": {
    "0": "Two minute review",
    "7": "Don't buy it if:"
  },
  "links": {
    "best gaming mice": "https://www.techradar.com/news/best-gaming-mouse",
    "Razer Basilisk V2": "https://www.techradar.com/reviews/razer-basilisk-v2"
  }
}