{
  "source": "https://www.techradar.com/reviews/netgear-nighthawk-ax8-eax80",
  "title": "Netgear Nighthawk AX8 (EAX80) review",
  "category": "computing",
  "updated": "2020-12-21T15:30:12Z",
  "author": "cliff-joseph",
  "summary": "A next-gen Wi-Fi 6 range extender that is ideal for larger homes",
  "verdict": "This expensive, state-of-the-art range extender is overkill for most smaller and medium-size homes - especially if you don’t already have a Wi-Fi 6 router. However, it offers impressive performance and coverage for larger homes, as well as additional Ethernet ports and other useful features.",
  "pros": [
    "Impressive Wi-Fi performance and range",
    "Simple set-up, with single network name",
    "Browser interface for advanced users"
  ],
  "cons": [
    "Seriously expensive",
    "Works best with a Wi-Fi 6 router"
  ],
  "article": [
    "Netgear offers a wide selection of range extenders, using both desktop and plug-in designs at a variety of different prices. The new - and somewhat confusingly named - Nighthawk AX8 (EAX80) is its latest top-of-the-range model, with Netgear claiming that it is the first extender to support the new Wi-Fi 6 standard (also known as 802.1ax).",
    "Leading edge features don’t come cheap, though, and the EAX80 weighs in at a hefty $250.00/£280.00/AU$425.00. If you’re shopping around online then just look for ‘EAX80’, as that’s the actual model number (the AX8 bit is just gratuitous techno-babble).",
    "There aren’t, admittedly, many homes that already have a new Wi-Fi 6 router at the moment (Wi-Fi 6 is also known as 802.11ax), so the Nighthawk AX8 will be overkill for people who are still using a current generation 802.11ac router. But, if you do have a super-fast Wi-Fi 6 router then the impressive performance of the Nighthawk AX8 could be the ideal solution for reaching that tricky spot that struggles to get good Wi-Fi.",
    "The Nighthawk AX8 (EAX80) costs more than many routers, but it works hard to earn its keep with impressive performance and features.",
    "It’s as big as many routers too, and requires a separate power supply, but at least that gives you the option of moving it around to make sure you get the best Wi-Fi signal - which you can’t do with smaller range extenders that plug directly into a power socket.",
    "And, like many routers, it includes additional features such as four Gigabit Ethernet ports for connecting a games console or other devices that work best with a wired network connection. It even has a USB 3.0 port for connecting a hard drive to provide network storage that you can share with everyone else in your home.",
    "And, of course, there’s the state-of-the-art Wi-Fi 6, with the EAX80 providing dual-band Wi-Fi 6 on the 2.4GHz and 5.0Ghz bands with a top speed of 6000Mbps (6Gbps), which is far faster than a conventional 802.11ac router or range extender.",
    "And, rather than acting as a simple range extender, Netgear also refers to the EAX80 as a ‘mesh extender’, which means that people who live in enormous mansions can buy additional EAX80 extenders and link them together to create an enormous mesh network that covers several thousand square feet.",
    "Getting started with the Nighthawk AX8 (EAX80) is very straightforward, as the Nighthawk app guides you through the process quickly and easily.",
    "You don’t need to use it with an existing Netgear router either - Netgear states that the EAX80 can “use the Wi-Fi you already have”, and we had no trouble connecting it to the standard router provided by our broadband supplier.",
    "We were also pleased to see that - unlike some range extenders - the Nighthawk app assumes that you’ll want the EAX80 to use the same network name and password as your existing router, and sets everything up for you automatically.",
    "This allows you to wander from room to room with your mobile devices, and automatically switch between your main router and the EAX80, depending on which one is closer and provides the strongest Wi-Fi signal. More experienced users who prefer to fine-tune their network set-up can log in to the EAX80 using a web browser interface, which allows you to assign different network names and passwords to both Wi-Fi bands, as well as adjusting other settings.",
    "Performance is impressive too, making a real difference to the erratic Wi-Fi signal in our home office. Performance on the slower 2.4GHz band jumps from 18Mbps to 21Mbps, but it’s the faster 5.0GHz band that really gets a shake-up, leaping from just 60Mbps to 342Mbps. Just remember, though, that you’ll need a router that also supports Wi-Fi 6 in order to get the full performance that the EAX80 is capable of."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Design and feature",
    "8": "Set-up and performance",
    "13": "Don't buy it if..."
  },
  "links": {
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Wi-Fi 6 router": "https://www.techradar.com/news/wi-fi-6-routers-the-best-wi-fi-6-routers-you-can-buy-in-2019"
  }
}