{
  "source": "https://www.techradar.com/reviews/livechat",
  "title": "LiveChat review",
  "category": "computing",
  "updated": "2021-01-21T09:53:33Z",
  "author": "michael-graw",
  "summary": "AI-powered helpdesk software trusted by some of the world's largest brands",
  "verdict": "LiveChat does almost everything right. This chat software is extremely flexible, integrates with most major online channels, comes with advanced reporting tools, and offers 24/7 support.",
  "pros": [
    "SMS to live chat",
    "Advanced reports"
  ],
  "cons": [
    "Pricey subscription",
    "Two-factor authentication isn’t standard"
  ],
  "article": [
    "LiveChat offers the best live chat software to enable you to instantly connect customers on your website with support staff through an online chat box. While a lot of helpdesk platforms include live chat solutions, LiveChat stands out by going all-in on this feature. It boasts tons of customization options, plus the ability to integrate messages from across your online channels in a single dashboard. However, it can be very expensive if you have multiple support agents.",
    "So, can LiveChat help your business connect with customers? In our LiveChat review, we’ll cover everything you need to know to decide.",
    "LiveChat offers three basic plans, each of which is available through a month-to-month or annual subscription. The Starter plan costs $16 per agent per month (paid annually) and is impressively full-featured. The biggest limitation is that you can only keep 60 days' worth of chat history. You also miss out on some customization and reporting features.",
    "The Team plan costs $33 per agent per month and unlocks unlimited chat archiving, chat tagging, and file sharing through your chat box. You can also create reports to monitor your support activity and identify pain points for customers.",
    "The Business plan costs $50 per agent per month and offers SMS messaging from your chat box along with more advanced reporting. You can also add single sign-on to the Business plan for an additional $20 per agent. For larger businesses, LiveChat also offers an Enterprise plan with custom pricing.",
    "You can test out the Team plan for 14 days for free before committing to LiveChat.",
    "LiveChat boasts a huge array of features to help you connect with customers seamlessly and monitor your support experience over time.",
    "To start, the chat box itself is very versatile. You can share files back and forth with customers, send link buttons or a calendar to schedule a meeting, or set up canned responses to quickly answer common questions. LiveChat also enables you to easily transfer chats between support agents, which is helpful if your business has multiple departments with different specialties.",
    "Even better, LiveChat seamlessly integrates messages from across all the platforms your business is using. You can use LiveChat on multiple websites and mobile apps, even with a Starter subscription. You can also import Facebook Messenger, email, SMS, and Apple Business Chat messages into your LiveChat system to make managing support requests easier.",
    "Another thing we liked about LiveChat is that it helps you ensure that your customer support is high-quality and consistent over time. The software comes with several premade surveys that you can send to customers after a chat, and Team and Business users can create custom surveys as well. There are numerous reports available to show how long it takes for agents to respond to new chat requests and whether chat support is leading to more conversions.",
    "Business users also get access to a handy scheduling prediction feature, which uses past chat data to estimate how many agents you will need on hand for an upcoming surge in web traffic.",
    "The LiveChat web app was, for the most part, seamless. The most important aspect, the messaging interface, uses a similar layout to Facebook Messenger. You can easily see all of your current chats and queued chats in a column on the left-hand side of the window, and then focus in on a single chat in a center column. On the right, you’ll get a detailed overview of the customer you’re messaging that includes what platform they’re messaging from, what pages of your site they’ve visited, and whether they’re a returning customer.",
    "LiveChat also enables you to track hundreds of visitors on your website in real-time. You can initiate a chat with any individual visitor and personalize your message based on the pages they’re currently exploring.",
    "We found that LiveChat paid attention to a few details that make the support system easier to use. Canned responses can be accessed instantly using a predefined tag, for example. You can also add tags to a chat for archiving purposes at any time, rather than having to remember the details of a chat and tag it at the time it’s archived.",
    "As you might expect from a company focused on customer support, LiveChat’s help is excellent. The company uses its own product to provide live chat support 24/7. We were also impressed with the amount of information offered in the platform’s online help center. The tutorials are extremely detailed and include screenshots for every step when explaining how to do something with LiveChat.",
    "LiveChat takes the security of your account very seriously, and all chats are protected by 256-bit encryption. Team and Business users can enable two-factor authentication, although we’d like to see this feature made standard for all users. Administrators can also limit the number of IP addresses that can log into LiveChat at once to prevent unauthorized use of your support line.",
    "To protect your customers, credit card numbers are automatically masked in chats and aren’t archived along with the rest of your chat history.",
    "While many helpdesk tools offer live chat, one of the closest competitors to LiveChat is SnapEngage. SnapEngage is dedicated to live chat and offers the same multi-channel support as LiveChat. It also offers HIPAA-compliance as an add-on feature (this is only available with a LiveChat Enterprise plan). However, we think LiveChat offers better value for most users since SnapEngage charges extra for many features, including SMS messaging, and doesn’t offer 24/7 support.",
    "LiveChat is an extremely powerful and flexible tool for messaging with your customers across all of your online channels. The platform integrates chats from multiple services, makes it easy to work within teams of support agents or across departments, and takes a proactive approach to support and security. The only thing we don’t love about LiveChat is the price tag, but given the quality of this software, we think it’s still solid value for your money."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Features",
    "11": "Interface and in use",
    "14": "Support",
    "15": "Security",
    "17": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "LiveChat": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6445341853961199000&xs=1&url=https%3A%2F%2Fwww.livechat.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Flivechat",
    "best live chat software": "https://www.techradar.com/best/best-live-chat-software",
    "Starter plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1205621550660551200&xs=1&url=https%3A%2F%2Fwww.livechat.com%2Fpricing%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Flivechat",
    "Team plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8197836207863914000&xs=1&url=https%3A%2F%2Fwww.livechat.com%2Fpricing%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Flivechat",
    "Business plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7193379310651807000&xs=1&url=https%3A%2F%2Fwww.livechat.com%2Fpricing%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Flivechat"
  }
}