{
  "source": "https://www.techradar.com/reviews/nextiva-vfax",
  "title": "Nextiva vFax review",
  "category": "computing",
  "updated": "2020-04-21T11:14:34Z",
  "author": "michael-graw",
  "summary": "Modern online faxing",
  "verdict": "Nextiva vFax review is an affordable and modern online fax provider for small businesses. But, it doesn’t support toll-free fax numbers and can only send documents within the US and Canada.",
  "pros": [
    "Supports a wide range of file types",
    "Modern online user interface for sending faxes"
  ],
  "cons": [
    "Interface requires five steps to send a fax",
    "Doesn’t support toll-free or international numbers"
  ],
  "article": [
    "Nextiva vFax is part of the broader Nextiva business communications suite. Pricing for vFax as a standalone online fax service is reasonable and the service boasts a user-friendly online interface. However, the platform has a number of shortcomings that hold this electronic fax service back. In our Nextiva vFax review, we’ll cover everything you need to know about this online fax provider to decide if it’s right for you.",
    "Nextiva vFax is available in three plans: Basic, Pro, and Enterprise. The features are the same for all plans—the only thing that changes is your monthly page limit for sent and received faxes.",
    "The Basic plan costs $8 per month or $48 per year for 500 pages per month. The Pro plan costs $17 per month or $144 per year for 1,000 pages per month. The Enterprise plan costs $34 per month or $348 per year for 3,000 pages per month. Each extra page over your limit costs an additional $0.03.",
    "Nextiva vFax has several helpful features for online faxing. You can send faxes right from your email. The platform enables you to send a wide variety of file types, including images, spreadsheets, and XML documents, which saves work converting everything to PDFs. We also liked that you can schedule faxes with this platform, up to 90 days in advance.",
    "On the receiving side, Nextiva vFax stands out for enabling SMS alerts when a next fax arrives. That’s a relatively unusual feature, and it can be very helpful if you typically work on the go.",
    "However, Nextiva vFax stands out more for the features it lacks compared to competitors. The platform only supports attachments up to 5 MB, which is fairly small. It’s also not possible to receive your faxes as email attachments, even if you adjust your settings to receive email alerts for new documents.",
    "Perhaps most problematic, Nextiva vFax only supports online faxing in the US and Canada. While many other online fax services charge extra to send international faxes, Nextiva simply won’t send documents to numbers abroad.",
    "As soon as you create an account with Nextiva, you’ll be prompted to choose a fax number. You can port an existing number, but it’s worth noting that Nextiva only offers local and not toll-free numbers when creating a new fax line.",
    "We found that Nextiva vFax makes adjusting your settings significantly easier than some other online fax providers. The settings menu is cleanly divided into tabs for ‘Profile,’ ‘Notifications,’ and ‘Permissions,’ among other categories. These options make it simple to keep the information that goes into your cover page up to date and to adjust your notifications as needed.",
    "The online interface for Nextiva vFax is refreshingly modern, especially compared to the many antiquated interfaces that we’ve seen from competitors. While appearance isn’t everything, we found that the platform is extremely well organized and this makes using it a much nicer experience.",
    "That said, there is one major issue with Nextiva vFax’s design. Sending a fax is a five step process, in which entering your recipient’s information and adding attachments are separated into two different pages. Considering that the interface otherwise feels like writing an email, this separation makes the platform a lot clunkier to use. It also seems silly to separate the preview, send button, and sending status into three pages.",
    "We sent a fax from vFax to another online fax line to test out its performance. Aside from having to click through several steps, the process went smoothly and quickly. A two-page Word document went through, with a cover sheet, in about three minutes from when we hit send.",
    "Nextiva vFax takes security around sending and receiving faxes seriously, using 256-bit AES encryption for all files in transit.",
    "However, there’s a huge hole in Nextiva’s security on the account side of things. The platform doesn’t support two-factor authentication, and when we signed up for an account the password was sent to our email in plain text. It’s up to users to manage their passwords before starting to use the platform to eliminate this security flaw.",
    "Nextiva offers support for vFax by phone, email, and live chat. The support team is available from 5 AM to 6 PM Monday to Friday (Pacific Time).",
    "In addition, Nextiva has a useful online knowledgebase specifically for the vFax product. We were happy to find that this includes a ‘Troubleshooting’ section, rather than simply answering basic questions about the setup and features. Many of the help articles provide full walk-throughs rather than a cursory answer, too.",
    "If you’re willing to spend a bit more money for a modern online fax software, it’s worth taking a look at HelloFax. This provider isn’t cheap—plans start at $9.99 per month for 300 pages—but you get a very well-designed user interface. HelloFax integrates with most major cloud storage providers, including DropBox and Google Drive, which makes it extremely fast to send faxes. We also appreciate that HelloFax lets you create multiple sender accounts, which Nextiva vFax does not.",
    "Nextiva vFax is a capable online fax solution with a couple handy features like SMS alerts and fax scheduling. However, the fact that this provider doesn’t offer toll-free numbers and won’t send faxes to international numbers may be a significant issue for some businesses. In addition, while we liked the modern user interface, requiring five steps to send a fax simply takes too long."
  ],
  "headers": {
    "1": "Plans and pricing",
    "3": "Features and utilities",
    "7": "Setup",
    "9": "Interface and performance",
    "12": "Security",
    "14": "Support",
    "16": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "online fax service": "https://www.techradar.com/best/best-online-fax-service",
    "Nextiva vFax": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8404713223227217000&xs=1&url=https%3A%2F%2Fvfax.nextiva.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fnextiva-vfax",
    "email": "https://www.techradar.com/best/best-email-clients",
    "spreadsheets": "https://www.techradar.com/best/free-office-software",
    "PDFs": "https://www.techradar.com/best/best-pdf-readers-for-windows",
    "documents": "https://www.techradar.com/best/best-document-editing-management-software",
    "manage their passwords": "https://www.techradar.com/best/password-manager",
    "HelloFax": "https://www.techradar.com/reviews/hellofax",
    "cloud storage providers": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}