{
  "source": "https://www.techradar.com/reviews/wave-2020",
  "title": "Wave review",
  "category": "computing",
  "updated": "2020-09-23T09:24:06Z",
  "author": "rob-clymo",
  "summary": "Wave 2020 is a comprehensive and highly versatile accountancy solution",
  "verdict": "Wave offers amazing functionality for something that is free and, while it does have one or two weak areas, still represents one of the best options if you’re looking for a raft of finance management tools within one fine interface.",
  "pros": [
    "Free to use",
    "Easy to master",
    "Super apps",
    "Extra paid-for options"
  ],
  "cons": [
    "Still no time-tracking",
    "Lack of inventory tracking",
    "Runs slowly on occasions"
  ],
  "article": [
    "The Wave 2020 edition is a free-to-use online service that combines core functions of accounting, invoicing, payments and receipts to deliver a well-rounded financial solution for all. Working from within your browser you can subsequently track your income and expenditure as well as improving efficiency overall. It’s aimed at everyone from freelancers and sole traders through to small businesses and those with an eye on expansion.",
    "Wave was started by tech people who’ve had to do battle with their own figures in the past and, as a result, has been nicely tailored to get things done. But, crucially, without the stress. Based on our experience of Wave so far it seems to be a philosophy that’s working really well.",
    "Competitors to Wave include FreshBooks, QuickBooks, Xero, Sage Business Cloud Accounting, Kashoo, Zoho Books and Kashflow.",
    "In its most basic incarnation Wave comes completely free to use, which considering the amount of features and functionality that are included makes it very appealing. The gratis version of Wave therefore delivers comprehensive tools for dealing with invoicing, accounting and receipts.",
    "However, one aspect of the site service does have a cost attached and that is the Payments area. This works on a pay-per-use basis and adds in the extra functionality of being able to accept credit cards on your invoices. This can be accessed via a large button inside the interface and will let you accept Visa credit and debit, Mastercard credit and debit plus American Express payments too.",
    "There’s no setup or monthly fee and no hidden fees either. Pricing is currently 1.4% plus 30 cents or 20p for European issued cards, while it’s 2.9% plus 30 cents or 20p for non-European cards.",
    "Wave has been around for a while and so if you’ve ever used it before it will still look pretty familiar. However, if you’re new to it then you’ll find it’s got everything you’ll need. What’s more, the newest addition adds in some extra features in and around the Accounting area in particular.",
    "This includes a new set of reconciliation tools as well as practical tweaks, such as the ability to search by amount and an instant payment option. Little things maybe; but no less useful. It’s also possible to change account types and, in terms of managing your time more efficiently, the ability to bulk edit accounts is also a boon.",
    "Combine this with the existing suite of menu options and Wave makes for an impressive package. Wave’s Payroll feature is cool, but can currently only be used by US and Canadian users only.",
    "Like many services of its ilk, Wave works by allowing you to log in to your pre-registered account and taking on your financial chores through a web browser. While it works absolutely fine and ticks over for most tasks we did find it was a little sluggish to load on occasions. Presumably as you build up a more comprehensive collection of data this might be exacerbated.",
    "Nevertheless, the lag is generally barely noticeable and the trade-off for this is the enjoyable user experience that you get along the way. Wave’s apps, for iOS and Android, meanwhile, are super slick and work very well. They're the perfect compliment if you’re on the move and don't or can’t access the desktop setup.",
    "Wave is one of the easiest to use services of its kind you can currently find. The interface and user experience is very good indeed and we also like the way it’s possible to add in additional users. So you can hand over the reigns to others in your business, or indeed your accountant if the need arises.",
    "Even the process of importing financial data you might have in CSV files to populate the system is reassuringly straightforward. This is also a great way of removing much of the legwork involved in getting your accounting area of the Wave service set up and running.",
    "On top of that it’s also wonderfully easy to integrate other features, such as Google Sheets or Etsy, while we’re also keen on the option for using Wave financial services for bookkeeping and tax work. You have to pay for those as added extras obviously.",
    "Wave offers much of its support on dedicated pages within the company website. There’s a page that allows you to search the Wave help database in order to locate the answer to your query. That’s surprisingly well laid-out and frequently delivers a solution to any technical or user woes you might be experiencing.",
    "It also has plenty of advice if you’re using either the iOS or Android apps for Wave too. You’ll find another handy Help option that can be accessed from within the interface, and that’s mighty handy too.",
    "Less useful on the support front, but worth investigating for its overall interest factor, is the community aspect of Wave. A healthy Blog section of the site provides you with more of an insight into the way the service and wider company works. Finally, there’s the capacity for submitting a help request if none of the above options solve your problem.",
    "Wave has to be one of the most enjoyable packages of its kind on the market. For no fee you have access to a powerful suite of tools, which help you navigate any and all of the facets of your business. Anyone who breaks into a sweat when it comes to tax time, or keeping accounts up to date, will find that Wave removes a lot of the mystery and hard work associated with these chores.",
    "There are some shortcomings and missing features that prevent Wave from getting top marks. But, with the gradual evolution of this service from good to great already happening it seems reasonable to imagine the next edition of Wave will be nothing short of awesome."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "9": "Performance",
    "11": "Ease of use",
    "14": "Support",
    "17": "Final verdict"
  },
  "links": {
    "Wave": "https://www.waveapps.com",
    "accounting": "https://www.techradar.com/best/accounting-software-small-business",
    "invoicing": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "freelancers": "https://www.techradar.com/how-to/how-to-become-a-freelancer",
    "small businesses": "https://www.techradar.com/best/best-apps-for-small-business",
    "FreshBooks": "https://www.techradar.com/reviews/freshbooks-2020",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks",
    "Xero": "https://www.techradar.com/reviews/xero",
    "Sage Business Cloud Accounting": "https://www.techradar.com/reviews/sage-business-cloud-accounting",
    "Kashoo": "https://www.techradar.com/reviews/kashoo",
    "Zoho Books": "https://www.techradar.com/reviews/zoho-books",
    "Kashflow": "https://www.techradar.com/reviews/kashflow-accounting-service",
    "free to use": "https://my.waveapps.com/register_external/",
    "business": "https://www.techradar.com/best/business-password-management-software",
    "tax time": "https://www.techradar.com/best/small-business-tax-software",
    "accounts": "https://www.techradar.com/best/accounting-software-small-business"
  }
}