{
  "source": "https://www.techradar.com/reviews/4shared",
  "title": "4shared file sharing review",
  "category": "computing",
  "updated": "2020-06-17T11:53:21Z",
  "author": "mayank-sharma",
  "summary": "The File sharing social network",
  "verdict": "With a host of unique sharing features, 4shared more than justifies its name. The service offers more features than it lacks, which makes it a must-try option for all users.",
  "pros": [
    "Preview and stream multimedia files",
    "WebDAV and SFTP access",
    "Virus Scanner",
    "Desktop and Mobile apps",
    "Collaboration features"
  ],
  "cons": [
    "Wait time for Free users",
    "No end-to-end encryption",
    "No version control"
  ],
  "article": [
    "4shared is a Kiev-based online storage and file sharing service that’s been operational since 2005. If you believe the service, it serves about 11 million users daily who use it to transfer over 300 TB of files every single day.",
    "Unlike most of its peers, 4shared offers more than just a platform for hosting and sharing files. The service has baked in some social networking features into its offering to give its users a couple of ways to collaborate and interact with their content.",
    "4shared offers 100 GB of storage along with a similar amount of monthly transfer bandwidth. You can share single files that are a whopping 100 GB in size.",
    "The service backs these features with several conveniences, including an intuitive web interface. If you want to transfer a large number of files, you’d appreciate the fact that 4shared supports FTP and even Secure FTP (SFTP) connections as well. Also, unlike most of its peers, you can also access your 4shared account like a regular folder from your file manager thanks to its support for the WebDav protocol.",
    "4Shared doesn't disappoint in terms of security as well. While there’s no end-to-end encryption, you can safely transfer your files using SFTP. Furthermore, you can lock sensitive files with a password to restrict access.",
    "When it comes to downloading the shared content, 4shared justifies its name by offering all the features you’d expect from an online file sharing service. You can share direct download links and use download managers to fetch multiple files at the same time. The service can resume interrupted downloads and you can pause and resume them as well.",
    "Another positive feature of the service is its ability to preview files. With 4shared you can preview virtually all common media file types including images, audio, and videos. You can even edit text files without downloading them. Best of all, you can give your friends access to your files, and in essence edit your text files collaboratively, which is a fairly unique ability.",
    "4shared’s web interface is straightforward to use. While you can only upload single or multiple files from the web interface, the 4shared desktop app, available for Windows and Mac, allows you to upload complete folders as well.",
    "It’s also fairly simple to manage your account as well. Besides the usual file management features, such as the ability to create folders, copy and move files, and such, 4shared also offers some interesting options. One such useful option is the ability to compress files directly within the account. All you have to do is select a bunch of files and use the ‘Zip selected’ option to roll them into a compressed archive. This feature is designed to help you make better use of your storage space.",
    "4shared also has useful options to search for files within your account, since cataloging 100 GB worth of data can be quite a chore. You can search for files by their type, as well as by their date of upload. To further narrow down the results you can even specify the size of the files you are hunting. 4shared allows you to tag files and folders and you can even search for files by their tags.",
    "Once you have uploaded files in your 4shared account you can easily share them. You can either share the link as is or ask 4shared to shorten the URL by removing its filename. You can also create a direct link to a file that you can then email to your contacts from within 4shared along with a custom message.",
    "Similarly, besides files you can also share complete folders as well. By default when shared, folders are publicly accessible and their content can be viewed by anyone with the URL. You can modify this behavior to even allow others to upload and edit content inside your shared folders. On the other hand, you can also restrict access to the folder to a selected list of users, or simply keep the folders Private to yourself.",
    "One interesting and unique sharing feature is the ability to create sub-domains. Using this feature, instead of the usual link, 4shared allows you to map a folder to a publicly accessible subdomain such as geekybodhi.4shared.com. To restrict access, you can optionally protect this folder with a password.",
    "4shared allows two types of plans. Like most of its peers, the service has a feature restricted Free account that’s useful for exploring the service. Free users get 15 GB of storage space and can upload single files of up to 2 GB each. The service will delete Free accounts if they haven’t been accessed in the last 180 days.",
    "In terms of downloads, Free users are required to wait before downloading a file and get a daily download traffic limit of 3 GB. While Free users can share their files and folders, they don’t get the ability to create direct download links. Free users also can’t download multiple files simultaneously, neither can they use download accelerators. Finally, while Free users don’t get the ability to connect to their 4shared account via FTP or SFTP, they can however mount their accounts using WebDAV.",
    "The service offers four tiers of Premium accounts based on the duration of their validity. While a single month costs $9.95, if you subscribe for 3 months, the service will cost $7.98/month. Similarly, the six month subscription costs $7.16/month, while the yearly subscription costs $6.50/month. All Premium accounts get the same amount of storage space and bandwidth and offer the full set of 4shared’s features.",
    "While the validity of the Premium accounts depends upon the subscription plan, the service requires users to log into their account at least once a month, or ensure that at least one of their shared files is downloaded in a month. While this might seem like an odd requirement it isn’t very unreasonable and can’t be held against the service.",
    "4shared has added some unique features to its file sharing abilities in essence creating a social network for everyone to discover and download content shared publicly by its members. The service can also preview and stream all types of multimedia content which is a definite plus. The ability to collaboratively edit text files is a wonderful addition as well.",
    "4shared also has some interesting sharing abilities that make it stand out from its peers. For instance, the ability to invite users to add to shared folders opens up the service to a wide range of collaboration-centric use-cases. We are also quite fond of its skill to map folders to sub-domains, which is a praiseworthy feature.",
    "That said, the service does lack in some areas. While it supports SFTP transfers, it doesn’t support end-to-end encryption. There’s also no version control, so you can’t keep multiple versions of the same file. All things considered though, if these limitations aren’t crucial to your use case, and you don’t have more than 100 GB of data to host, you'l find 4shared to be a very interesting and capable file sharing service."
  ],
  "headers": {
    "2": "Features",
    "7": "Interface and apps",
    "13": "Plans and Pricing",
    "17": "Final Verdict"
  },
  "links": {
    "4shared": "https://www.4shared.com/",
    "online storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "file sharing service": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "collaborate": "https://www.techradar.com/best/best-online-collaboration-tools",
    "file manager": "https://www.techradar.com/best/the-best-file-manager",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "download managers": "https://www.techradar.com/best/free-download-manager",
    "Windows": "https://www.techradar.com/news/best-windows-10-pro-laptops",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "compress files": "https://www.techradar.com/news/the-best-file-compression-software",
    "email": "https://www.techradar.com/best/best-email-clients"
  }
}