{
  "source": "https://www.techradar.com/reviews/fastestvpn",
  "title": "FastestVPN review",
  "category": "computing",
  "updated": "2020-07-20T11:16:38Z",
  "author": "mike-williams",
  "summary": "Is this really the fastest VPN? Take a guess...",
  "verdict": "FastestVPN gives you a lot for your cash, but the Windows app needs work before we would trust it fully. Try it, but carefully, and run your own leak and other tests to see how it works for you.",
  "pros": [
    "Very low prices on the 3 and 5-year plans",
    "Unblocks US Netflix",
    "Ad and malware blocking",
    "Up to ten simultaneous connections"
  ],
  "cons": [
    "Didn't unblock BBC iPlayer, Amazon",
    "Not very configurable",
    "Windows app has some big issues",
    "Privacy policy lacks detail and there's no security audit"
  ],
  "article": [
    "FastestVPN is a Cayman Island-based VPN which offers a lengthy list of appealing features for one of the lowest prices around.",
    "There are P2P-friendly servers in 39 locations across 31 countries, for instance. Ad and malware blocking. Custom apps for Windows, Mac, Android, iOS Roku and Kodi, along with Chrome and Firefox extensions, OpenVPN compatibility to enable installing it everywhere else, and support for connecting up to ten devices simultaneously, twice the industry average.",
    "The list goes on, with DNS leak protection and kill switches to protect your identity, website claims to unblock 'Netflix, Amazon Prime, Disney+ & more' and 24/7 support via live chat.",
    "FastestVPN's 1-month plan is an average $10, but this drops to a low $2.49 on the annual plan, a tiny $1.11 a month if you pay for three years up-front, and a tiny $0.83 on the 5-year plan.",
    "We tend to avoid long-term contracts, but when prices are this low, there's very little risk. That five years of protection costs only $49.95, for instance; you could opt for a 'sensible' short-term monthly-billed account at CyberGhost, but you'll have spent $51.96 in just four months.",
    "Whatever your preference, you can pay via card or PayPal, and there's a 15-day money-back guarantee if something goes horribly wrong. Some providers allow 30 days, but that's still plenty of time to understand if the service works for you; just make sure you test speed, unblocking and every else you need as soon as sign up.",
    "The FastestVPN website has a clear headline stating that the service has 'No Logs whatsoever!', going on to say 'We never log your internet activities. Nobody can track you back after you’ve visited a particular website, while connected to our server.'",
    "Heading off to the Privacy Policy, we found much the same message, with a little extra detail: 'We do not store your logs in anyway. Any information or logs related to your browsing history - the websites you visit, the content you download or stream, your traffic destinations, or your DNS queries - stays with you and you alone.'",
    "While this sounds great, there's no way to know whether the company is living up to these no-logging claims. It's much the same story with most VPNs, but some (TunnelBear, NordVPN, ExpressVPN, more) have put themselves through public audits, giving real evidence that they're doing what they promise. That's a big improvement on the usual 'you can trust us, no, really' approach, and we hope more providers will do the same over the next few years.",
    "We already had a FastestVPN account, so expected buying a new plan to be very quick and easy.",
    "How wrong we were.",
    "The issues began after resetting our password. The website emailed us a link to our registered email, we clicked it, chose a new password, and... A blank page said only: {\"error\":1,\"message\":\"User Not Found\"}. Uh, okay.",
    "It turned out that we were logged in correctly, despite the error, so we browsed our web console, looking for an option to buy a new plan, but couldn't find anything.",
    "Okay, we thought-- back to the main Pricing page, we'll buy from there. Except we couldn't, because when we entered our email address, the site warned that 'you are already using our service.' The page required us to create a new account, and didn't provide any way to add a new plan to an existing account.",
    "We've don't remember ever having to contact a VPN provider's support team because we couldn't even buy a plan, but if nothing else, it was a good opportunity to test that side of the service.",
    "FastestVPN has a conventional live chat icon bottom-right of the website page, so we tapped it, entered our name, email address and a summary of our issue.",
    "An agent responded in less than a minute, and warned that we couldn't use the same email for two subscriptions. When we pointed out the first had expired, the agent went away to check, came back some five minutes later, asked us to try again, and-- at last, the site allowed us to buy a new plan.",
    "FastestVPN hadn't impressed us with its website, then, but maybe we were just unlucky. And whatever the cause, having the support team resolve it in less than 10 minutes left us with a positive impression, overall.",
    "FastestVPN's Windows client looks good, with a bright and cheerful interface that works more or less as you'd expect. Your preferred server is clearly displayed, you can quickly browse the others on a list, and a big Connect button protects you on demand.",
    "Settings are kept to a minimum, with a handful of options to choose your protocol (OpenVPN TCP or UDP, IKEv2, L2TP, PPTP), launch the client with Windows, auto-reconnect if the connection drops, and enable or disable a kill switch.",
    "FastestVPN has fixed some of the usability issues we noticed last time. It's good to see a notification now tells you when you're protected, for instance, and we're happy to see the annoying 'Are you sure?' prompt, which appeared every time you hit Disconnect, has been dumped.",
    "There's plenty left to do, though. The client had a 'Smart Connect' button which we hoped would connect us to our nearest location, for instance, but, well... When we tried this from the UK, first it connected us to Spain, then Turkey, then Italy. Not that 'smart', then.",
    "Connection times were longer than average, sometimes the client wouldn't connect at all. We wondered if this was an issue with the remote servers, then realized the problem seemed to be fixed if we logged out of the client, and back in again. Whatever the cause, it was irritating, not least because the connection didn't have a timeout; the client just hung at the connection screen until we hit Cancel out of sheer boredom.",
    "There are more significant problems, too. We tried forcibly closing an IVEv2 connection with the kill switch turned off, and the client also failed to raise any alert, instead showing it was still connected. Our internet access was blocked, so there was no privacy risk, but it would certainly confuse the user.",
    "Testing the kill switch revealed another issue. When we manually closed our connection, the client successfully blocked internet access, but not immediately. Our test software showed that for a brief period of time, perhaps just a fraction of a second, our real IP address was exposed to the outside world. We've seen far worse client problems - many don't have kill switches at all - but they have to be a concern.",
    "We took a low-level look at what else might be going on under the hood, and spotted another problem: the client saved our server login credentials to a plain text file, every time we connected, and didn't delete this when the session was over. If you were infected by malware, it's possible this could harvest your credentials, allowing hackers to connect to FastestVPN via your account. That's extremely unlikely to happen - and we informed FastestVPN of our findings before publishing this review, so hopefully the issue is now fixed - but our concern is that it was possible at all. You surely don't need a lifetime of experience in internet security to realize that saving user logins in plain text is probably a bad idea.",
    "FastestVPN's mobile apps look a little different to the Windows edition, with the interface rearranged a little to suit the new form factor.",
    "They're also short on configurability. The Android app's settings offer a limited choice of protocols (OpenVPN TCP/ UDP and IKEv2), a kill switch, and simple split tunneling to decide which apps use the tunnel, and which don't. If you're hoping for, say, an option to automatically connect whenever you access insecure networks which aren't on your whitelist, for instance, you're going to be disappointed.",
    "Still, the mobile apps cover the VPN basics, and are simple and straightforward to use. They may not satisfy demanding users, but otherwise they're good enough to get by.",
    "The FastestVPN website isn't shy about its website unblocking credentials, boasting that the service allows you to 'stream, buffer, watch and listen content that is censored and geo-restricted – from anywhere around the world.'",
    "Our real-world experience was a little different. When we connected to FastestVPN's UK server, for example, it couldn't get us into BBC iPlayer, with the site displaying its usual 'this content is not available in your location' error.",
    "Amazon Prime Video blocked us, too, but we did manage to access US Netflix, and had some limited success with Disney+ (the US servers didn't work, but we could stream content via the UK and some other countries.) Not great, at all, but maybe good enough for some.",
    "Our privacy tests gave more positive results, with multiple sites unable to detect any IP or DNS leaks.",
    "FastestVPN also includes ad blocking, at least according to the website. We're skeptical of the type of ad blocking included with many VPNs, as it often makes no apparent difference at all, but FastestVPN was a surprise: it made even the most ad-packed pages readable again. The system isn't as effective as free tools like uBlock Origin, but it's good enough to be useful, especially as blocking at the VPN level means it automatically works on every device you connect to it, without having to install any further software.",
    "Our speed tests found FastestVPN delivering 35-50Mbps in the UK on our 75Mbps test line. Forget the name, that's far from the fastest VPN-- most of the quality competition manages 65Mbps+ on the same connection.",
    "(We found FastestVPN averaged around 50Mbps during our last review, too, so this looks to be more than some temporary issue, like a busy server.)",
    "35-50Mbps is perfectly adequate for many situations, though, and we found FastestVPN scored for delivering similarly capable speeds all across its network. Even switching to the more distant servers made little difference, with connections from the UK to Brazil, Australia, India and Hong Kong all returning capable download speeds of 20 to 40Mbps.",
    "FastestVPN isn't the fastest VPN we've seen, or the most powerful, and its Windows app has some worrying technical issues - ExpressVPN would make a far better choice. But it's also easy to use, and can be seriously cheap, and the service is worth a look for experienced users who are happy to run their own tests."
  ],
  "headers": {
    "6": "Privacy and logging",
    "9": "Setup",
    "18": "Apps",
    "29": "Performance",
    "37": "Final verdict"
  },
  "links": {
    "FastestVPN": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1431641617209403600&xs=1&url=https%3A%2F%2Ffastestvpn.com%2Fbuy-vpn&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffastestvpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "1-month plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1539130078645668400&xs=1&url=https%3A%2F%2Ffastestvpn.com%2Fbuy-vpn&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffastestvpn",
    "annual plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1239771342528482600&xs=1&url=https%3A%2F%2Ffastestvpn.com%2Fbuy-vpn&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffastestvpn",
    "three years up-front": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1080710344294142700&xs=1&url=https%3A%2F%2Ffastestvpn.com%2Fbuy-vpn&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffastestvpn",
    "5-year plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6025795058507022000&xs=1&url=https%3A%2F%2Ffastestvpn.com%2Fbuy-vpn&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffastestvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5221471968269383000&xs=1&url=https%3A%2F%2Ffastestvpn.com%2Fprivacy-policy&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffastestvpn",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn"
  }
}