{
  "source": "https://www.techradar.com/reviews/nokia-34",
  "title": "Nokia 3.4 review",
  "category": "phones",
  "updated": "2020-12-05T07:00:10Z",
  "author": "andrew-williams",
  "summary": "Low price. Long battery Life. One big problem.",
  "verdict": "The Nokia 3.4 is a cheap phone with a battery that should last two days for many, along with clean software and the promise of updates. But limited RAM makes it run slower than we’d like, and as such it's hard to fully recommend even at its low price.",
  "pros": [
    "Long battery life",
    "Low price",
    "Clean Android One software"
  ],
  "cons": [
    "Poor performance",
    "Weak speaker",
    "Mediocre cameras"
  ],
  "article": [
    "The Nokia 3.4 is a low-cost phone sure to appeal to those looking for something they can buy outright without spending a fortune.",
    "First impressions are good. Sure, it feels a bit cheap, but the screen is perfectly solid and the Android One interface has a clean look similar to what you’d see with the Google Pixel 4a.",
    "You’ll realize the Nokia 3.4 is more of a mixed bag within a day or two. Some of you will eat up the 32GB of storage almost instantly, particularly if you want to install a couple of big games and have a large WhatsApp image library to import.",
    "The phone becomes unreliable when storage gets low too. Free up some more space and things improve, but the Nokia 3.4 is still slow. There’s regular lag before the keyboard pops up, as app interfaces load, and as you move between apps.",
    "It’s not smash-your-head-through-a-window slow, but Motorola, Realme, Oppo and Xiaomi phones for similar money run much better. Don’t even think about trying Fortnite. It runs, but spends a significant amount of time at 0fps.",
    "The cameras are fairly poor too.",
    "We shouldn’t expect too much from the Nokia 3.4, and its long battery life might make up for these performance problems if you only want to ‘do the basics’. But these are affected by the phone’s slow feel too. We recommend a Moto G8, Realme 6 or Oppo A5 2020 instead.",
    "The Nokia 3.4 is out now in the US, the UK, and Australia with a price of $179 / £130 / AU$249.",
    "That puts it at the low end of smartphone pricing, in line with the likes of the Alcatel 3L (2020).",
    "If your budget only stretches to something like the Nokia 3.4, you have to accept a few things. You’re not going to get a phone made of glass and metal, or one with a fancy in-screen fingerprint scanner.",
    "But that does not mean it needs to seem cheap all-round.",
    "The Nokia 3.4 still has some nice touches. Its punch-hole screen was considered a sign of a higher-end phone just a year or so ago. The screen borders are similar to those of a much pricier mid-range phone. And the display is large enough for comfy video watching. It even has a reasonably attractive circular camera housing on the back.",
    "Still, “this feels kind of cheap” was the first thought we had on picking the Nokia 3.4 up. Most manufacturers use smooth curved plastic on the backs of their budget phones. It’s meant to look and feel like glass, even though it isn’t.",
    "Nokia uses embossed plastic on the 3.4. Much as we want to applaud Nokia for not faking it by mocking up aluminum or glass, some smooth-backed rivals feel better.",
    "This isn’t something most will dwell over for too long, though, and the Nokia 3.4’s back doesn’t flex as it sits right on the subframe and components inside.",
    "The phone has a rear fingerprint scanner rather than a more on-trend side or in-screen one. It’s slower than some, taking around a second to unlock the Nokia 3.4. But in use it is perfectly fine, with no reliability issues. A slightly relaxed unlock is better than one that refuses to recognize your finger half the time.",
    "There’s a Google Assistant button on the side, but you are far more likely to press it accidentally than deliberately. We can’t count the number of times the guy has piped up in our pocket.",
    "You get a 3.5mm headphone jack, common in cheap phones like the Nokia 3.4 but not in higher-end ones. However, the speaker is weak. It’s thin, not very loud and uses just the one mono driver. Motorola’s G-series phones sound significantly better.",
    "The Nokia 3.4 has a 6.39-inch LCD screen, and it is one of the phone’s highlights.",
    "Color is perfectly fine, contrast is good and maximum brightness is powerful enough to make the screen fairly clear outdoors. That is all we really ask for at this level.",
    "It's also large enough to watch Netflix or YouTube videos on, without it seeming a desperate compromise.",
    "You can get better if you spend a little more, of course. This is a 720 x 1560 display, a big step below the Full HD screen of a phone like the Realme 6. However, it is honestly not that glaring. Use the ‘Desktop’ mode in Chrome and small fonts will appear a little pixelated, but the rest of the interface looks reasonably sharp.",
    "There is one more obvious sign this is not a top-quality screen. The very bottom of the Nokia 3.4's display is brighter than the rest, because it’s where the backlight LEDs sit. You can’t tell where these are in a truly great LCD phone screen.",
    "A few of the Nokia 3.4’s elements bothered us, but display is not one of them. As you might guess, the phone does not support HDR, but again this is not a big issue at the price.",
    "The Nokia 3.4 has three rear cameras. There’s a 13MP primary, a 5MP ultra-wide and a 2MP depth aid. This is used in the Portrait mode, which blurs out the background.",
    "Our favorite sub-$200/£200 phones can get surprisingly close to a high-end one when shooting an easy well-lit scene. The Nokia 3.4 is a league or two below these.",
    "Even in perfect lighting, shots look a little fizzy and vague up close. Dynamic range is only okay even with the help of good baked-in HDR processing, and shots that use dynamic range optimization often have ‘ghosting’. This is where you see dual exposure of moving objects, caused by the delay between the multiple shots used to compose the image.",
    "The Nokia 3.4’s low light images are poor, and while there is a Night mode, which attempts to brighten up the scene, we actually tend to prefer the photos taken using the standard Auto mode. Night tries to lift the shadows a little, but they end up so noisy the images look better without.",
    "You can’t fix every face with better lighting.",
    "Shooting images feels slow, particularly if you, for example, take an image from within WhatsApp rather than the camera app. Focusing is iffy as well. On reviewing the stack of images we took with the Nokia 3.4, a handful were not properly focused.",
    "The Nokia 3.4’s camera performs at about the base level we’d expect at the price. Just. You can do better. Still, this does not mean the phone can’t take images worthy of Instagram. Shoot against a nice clean, blue sky and photos can look colorful and punchy.",
    "A second field of view, the ultra-wide, is welcome too, even if its 5MP images are mediocre.",
    "The Nokia 3.4’s video is extremely basic. It can shoot at up to 1080p, 30 frames per second. There’s no 60fps, no 4K. And, far more important, there is no stabilization. This means your handheld footage will look amateurish and shaky.",
    "We get an 8MP selfie camera, and it’s perfectly respectable. Images get soft in lower light - no surprise there - but this is not an afterthought selfie shooter.",
    "The Nokia 3.4 has a Snapdragon 460 chipset and 3GB of RAM. This is an entry-level CPU with only just enough RAM to scrape by in Android 10, and you can feel it.",
    "The Nokia 3.4 is quite slow. We can write off poor performance in 3D games or very demanding apps in cheap phones, but here it affects every interaction. The virtual keyboard often takes a beat to appear, and elements of apps pop up more slowly than other phones.",
    "Things get worse if you multitask by, for example, streaming a podcast or radio station while using the Nokia 3.4.",
    "There’s a low-level lethargy to everything here once you go beyond the basics of swiping between the home screens and app drawer. Apps may also crash if you let the Nokia 3.4 run low on space, suggesting the limited amount of RAM here forces Android to use the 32GB of storage for jobs that might otherwise be done using system memory.",
    "Let’s put this in some context. Truly bad performance in an Android phone can make using a device a nightmare. The Nokia 3.4 isn’t that bad most of the time, but it is notably slower than the Oppo A5 2020, Moto G8 and Moto G8 Power.",
    "Gaming is restricted too. By the time we had installed Fortnite and ARK: Survival Evolved, the Nokia 3.4 was already out of space - although this was exacerbated by WhatsApp’s image library taking up a few gigabytes.",
    "Even after freeing up some room, Fortnite was completely unplayable. After a few seconds at reasonable (but low) frame rates, it effectively brought the phone to a halt, reading ‘0fps’. Our assumption is the Nokia 3.4’s 3GB of RAM just isn’t enough to run the game, because the Snapdragon 460 isn’t that weak.",
    "This theory is confirmed by ARK: Survival Evolved. You can only run the game at ‘low’ graphics, but it runs perfectly well. And even looks good, despite the low-end graphics setting.",
    "The Nokia 3.4 scores 1,188 (255 per core) in Geekbench 5, which is around 250 points less than a Snapdragon 665 phone like the Moto G8.",
    "Reasonably good scores like this suggest, again, that the Nokia 3.4’s lethargy is caused by limited RAM. There is, after all, no extra layer of software to blame. The phone is part of the Android One program, which rules out the use of a third-party interface.",
    "It also means the Nokia 3.4 is guaranteed an update to Android 11, and security updates for at least three years. This is a real selling point, particularly up against relatively little-known manufacturers that sometimes release phones and then leave them to wilt, update-free.",
    "Note: we don’t mean Oppo, Realme or Xiaomi, but the more obscure names like Elephone.",
    "The Nokia 3.4 has a few issues, but battery life is not one of them. This phone has a fairly ordinary-sounding 4,000mAh battery, but we found it outlasts most phones with this capacity.",
    "It’s likely helped here by the lower-resolution screen and lower-power chipset. Even on heavy days that included several hours of audio streaming, far too much browsing of eBay for bargain buys, and many WhatsApp checks, the Nokia 3.4 ended up with at least 30% charge left.",
    "Light users should find it lasts the two days Nokia claims. Battery life is the Nokia 3.4’s strongest aspect, alongside the decent screen. This phone is far from alone as a long-lasting cheap mobile, though, as the budget sector is where you find some of the largest batteries.",
    "Battery charging is not so hot. The Nokia 3.4 has a puny 5W charger. It gets you from flat to 16% in 30 minutes. Rubbish.",
    "First reviewed: December 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Nokia 3.4 price and release date",
    "9": "Design",
    "18": "Display",
    "24": "Camera",
    "34": "Specs and performance",
    "46": "Battery life",
    "50": "Don't buy it if..."
  },
  "links": {
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Moto G8": "https://www.techradar.com/reviews/moto-g8-review",
    "Realme 6": "https://www.techradar.com/news/realme-6-arrives-this-week-boasts-90hz-display-and-quad-camera-for-only-audollar469",
    "Oppo A5 2020": "https://www.techradar.com/reviews/oppo-a5-2020-review",
    "Alcatel 3L (2020)": "https://www.techradar.com/reviews/alcatel-3l-2020",
    "Moto G8 Power": "https://www.techradar.com/reviews/moto-g8-power",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}