{
  "source": "https://www.techradar.com/reviews/roku-ultra",
  "title": "Roku Ultra (2019) review",
  "category": "audio-visual",
  "updated": "2021-06-29T21:43:57Z",
  "author": "nick-pino",
  "summary": "Roku’s top-tier player handles 4K HDR with gusto, but doesn’t deliver Dolby Vision",
  "verdict": "The new Roku Ultra launches channels 17% faster than its predecessor and comes with a programmable remote, but it doesn’t support Dolby Vision, has slower buffering speeds than the competition and doesn’t always make HDR content look its best. It’s still simple to use and setup, sure, but it’s starting to feel a bit underpowered compared to its rivals.",
  "pros": [
    "Solid 4K HDR performance",
    "Easy to setup and use",
    "Voice remote with headphone jack",
    "New programmable buttons"
  ],
  "cons": [
    "No Dolby Vision support",
    "Very similar to the Premiere+",
    "Doesn’t include HDMI cable",
    "Very limited voice assistant"
  ],
  "article": [
    "For two years now, the Roku Ultra has ruled the world of streaming. It's offered 4K and HDR support, as well as thousands of channels' worth of content and one of the most egalitarian operating systems around - and in 2019 that excellent player received an update.",
    "The latest version of Roku’s top-tier player offers faster loading and a new remote with two programmable buttons that can store any command you want. These buttons can be shortcuts to your favorite streaming services, a repeatable search query or, well, almost anything you could get the player to do using a voice command.",
    "Of course you’re buying a Roku Ultra for more than just a smart remote - what you’re buying is a capable 4K HDR streaming player that does voice search better than anyone in the business and comes with several options for finding free content, including The Roku Channel and the Featured Free section of the homescreen.",
    "And yet, despite its advantageous operating platform and streaming chops, it’s facing some really steep competition, most of whom support higher-end formats and offer better performance both in terms of picture quality and buffering speeds. With that in mind, it's not that the Roku Ultra has dropped in quality this year, it's simply facing better competition than ever, which makes Roku less of an obvious choice than it was in 2018.",
    "[Update: Roku has announced a big update to its free, ad-supported platform, the Roku Channel, bringing the experience of watching linear TV to its popular streaming devices.]",
    "Recently revamped for 2019, the new Roku Ultra is available now in the US for $99.99. (It’s currently not for sale in the UK, but you can pick up the Roku Streaming Stick+ that offers similar performance for just £49.99.)",
    "For just a bit more you can pick up the new Amazon Fire TV Cube - which costs just $119.99 (£109, around AU$160) and was also just updated for 2019 - or drop a lot more money to pick up the Apple TV 4K that costs $179 (£179).",
    "All three players are great, but right now we feel the Amazon Fire TV Cube provides the best value for the money, especially for folks who subscribe to Amazon Prime.",
    "Just as it was in previous years, the Roku Ultra is a flat, disc-shaped streaming video box that inconspicuously blends in with all your other AV equipment. Compared to the old Roku 4 and newer Premiere+, the Ultra is substantially smaller... but don’t let its diminutive stature fool you – this is still a super-powered machine.",
    "Inside, the Roku Ultra packs a quad-core processor and 802.11ac dual-band wireless antenna. What sets the Ultra apart from other models in Roku’s lineup is that it comes with the new-and-improved remote with two programmable buttons, an ethernet port on the back and the remote finder button located on top of the player.",
    "Besides the ethernet port, the back of the Roku has an HDCP 2.2 HDMI 2.0a port for video out, a 12V – 1A power adapter and a MicroSD card slot that can be used to store additional channels. There’s also a USB port located on the side of the player that can be used as a connector for a USB drive. More likely than not, you should be OK with Roku Ultra’s default storage capacity - of which there’s plenty. But for folks who like to have every streaming app downloaded at all times, the extra storage options are nice to have.",
    "Inside the box, all you get is the remote, some batteries and the player itself. That means you have to supply your own HDMI cable... which feels a little cheap for a device that costs $100. Heck, it's not very long, but even the entry-level $35 Roku Express comes with an HDMI cable, so for it to be missing here feels like a pretty big misstep.",
    "The good news is that the player can control your TV via HDMI CEC, allowing you to use a single remote to turn on and off your TV, and control the volume. This is a nice touch, especially for cord-cutters who can then safely put away the TV remote.",
    "Last but not least, it’s worth pointing out that the Ultra’s remote still has the auxiliary audio jack on the side for private listening and even comes with a pair of JBL headphones. Both of these are great features if your family goes to bed early and you still want to watch something.",
    "If there’s a more fully featured app store on a set-top box, we’d like to see it. Roku may not have literally everything, but this is as close as it’s going to get. Roku boasts more than 4,500 channels ranging from the streaming mainstays, like Netflix, HBO and Vudu, to the obscure – there's actually a station called \"Firewood Hoarders\" – so finding something to watch is rarely a problem.",
    "For US viewers, all the big names are here: Netflix, Amazon, Hulu, HBO and Youtube and Crunchyroll, Plex and Pandora and Spotify. You can rent and buy individual movies and TV through Vudu and Fandango, the latter of which is the de facto rental service on the streamer. If you're in the UK and decide to obtain a Roku Streaming Stick from overseas, check out Sky's Now TV platform (Sky being a shareholder in Roku), Netflix and Demand 5.",
    "The newest addition to Roku’s channel lineup is Apple TV, which finally made its appearance before the launch of Apple TV+ in November. To download the app, go into the 'Featured' section of the channel store or search for 'Apple TV' through the Roku voice remote or Roku app on your mobile device. Once it’s downloaded, you can log into the app by either entering your information on your Roku or by using a QR code to log in through your mobile device, and then access any shows or movies you have in your collection.",
    "Cord cutters who live in the US will also have access to Sling TV, YouTube TV and PlayStation Vue, plus the Featured Free section of the homepage that shows you what's available for free on the different services. These are invaluable resources for cord-cutters, and a great alternative to channel surfing for folks who still have a box.",
    "What’s missing here, however, is a competent, built-in smart assistant like Alexa or Google Assistant. What Roku does offer is its new Roku Assistant which can understand and answer basic queries like ‘what time is it?’ or ‘what’s today’s date?’ but can’t interact with your smart home or any of your smart gadgets in a meaningful way. Both the Amazon Fire TV Cube and Nvidia Shield come with Alexa and Google Assistant, respectively, so for both to be missing here on Roku’s high-end player feels like another misstep.",
    "Where we’re willing to give Roku some credit, though, is for its integration with Amazon and Google smart devices. While Roku can’t control either platform, both platforms can be used to control your Roku - which is handy if you don’t want to walk over and grab the remote. (Though, admittedly, we often just opt to use Roku’s mobile app in that case.)",
    "When it comes to performance, the Roku Ultra is one of the better players on the market. We’re emphasizing the word better in that sentence because, well, despite being very good... it’s not quite the best. So let’s break it down.",
    "The Roku Ultra excels at streaming 4K HDR video from places like Netflix, Amazon Prime, Vudu and a few others. But all that video is going to come in the HDR10 format that’s optimized for 1,000-nit, 10-bit TVs and uses static metadata that sets a range of brightness for the entire film or TV show at the very beginning and doesn’t ever update it to match what’s happening at a given point in time.",
    "What does all of that technical jargon really mean? Well, for most 4K HDR TVs out there today, HDR10 content on Roku Ultra is going very good. It’s pretty much a perfect match for any TV that you’d buy for under $1,000 during a big sales event, and can carry you through the next two years as more HDR content becomes available.",
    "What Roku Ultra can’t do, however, is play Dolby Vision content, which is mastered for much higher standards and is basically bullet-proof for the next five years. It’s the standard that the new Amazon Fire TV Cube and Apple TV 4K use, and will likely be available on more streaming players and TVs in the year to come. Why? Dolby Vision supports 12-bit color with headroom for up to 10,000 nits of peak brightness. It also uses dynamic metadata, which is really important to making HDR content look its best.",
    "Don’t forget, though, you need a Dolby Vision-capable TV to watch Dolby Vision content. If your TV doesn’t have that capability, then don’t sweat it - HDR10 content will look fine. In our tests we’ve watched a ton of 4K HDR content, all of which looked very good streaming through the Roku Ultra. Whether we watched Stranger Things, Our Planet, All or Nothing or The Grand Tour, each show popped more because of its HDR support.",
    "Even when shows and movies didn’t stream in 4K, they still looked quite good. Admittedly, the Roku Ultra doesn’t do much in the way of upscaling in the same way that an Apple TV does, but it doesn’t make content look any worse either. But that means if you’re looking for real high-end upscaling, you’ll have to look elsewhere.",
    "Thankfully jumping from one streaming service to the next happened even faster this year than last year thanks to the Ultra’s 17% speed increase... though it felt like content in the My Feed section did take a second or two longer to load than before. Regardless, as long as you have a decent internet connection (15mbps or better, ideally) you won’t be waiting for more than a few seconds to load content anywhere on the player.",
    "In terms of additional codecs, the Roku Ultra supports H.264/AVC, H.265/HEVC, VP9 video codecs and AAC, MP3, WMA, FLAC, PCM, AC3/EAC3, DTS, ALAC audio codecs. That’s not an exhaustive list of everything out there, obviously, but the most popular codecs are all present and accounted for. The Roku Ultra also supports screen casting – not a codec per se, but definitely a useful feature when you have a roomful of friends who all want to share their favorite YouTube clip.",
    "Previously we reported that last year’s Roku Ultra had issues dissipating heat. We can now confidently say that the issue has been resolved with this year’s box.",
    "The biggest advantage of the Roku Ultra is its premium remote. This year’s iteration not only comes with a 3.5mm jack for headphones, volume buttons and quick access buttons for the most popular streaming services, but it also includes the two programmable buttons we mentioned above.",
    "Roku’s decision to include a remote continues to pay off - it’s one of the simplest streaming devices to setup and use, bar none. The remote makes navigating the interface incredibly intuitive and a short tutorial video explains everything you need to know about the Ultra.",
    "Should you lose your remote, the Ultra is the only player in the lineup that has the remote finder button on the top of the player itself that, when pressed, sends a signal to the remote to make a chime noise. (For it to work, however, the batteries need to have some charge and can’t be completely dead.)",
    "Should your remote break or become totally lost to the aether, you can always download the Roku app which allows for private listening, faster search and the ability to control your Roku Feed. It’s an absolutely excellent app and has actually been our preferred way to control Roku devices for the last year.",
    "The Roku Ultra is a premium streaming device – the best in Roku’s arsenal. It has a few minor issues (see: lack of Dolby Vision support) but it’s still a very good 4K HDR player. Unfortunately, however, it’s now a pretty crowded market with some really intense competition from Amazon and Apple. Heck, even the Roku Premiere+ and Streaming Stick+, both of which cost around half of what the Roku Ultra does, offer something similar.",
    "If you don't mind paying a premium for the top-tier hardware and are committed to Roku’s open platform, the Roku Ultra is for you. That said, if you're looking to save a bit without losing out on performance, your money is better spent elsewhere in the Roku lineup. The third and final option is to spend a bit more to get something that will support Dolby Vision like the Amazon Fire TV Cube or Apple TV 4K. You can’t go wrong with any of them, but each is well-suited for different types of streamers."
  ],
  "headers": {
    "5": "Price and release date",
    "8": "Design",
    "14": "Roku OS and content",
    "20": "Performance",
    "29": "Remote",
    "33": "Final verdict"
  },
  "links": {
    "Roku has announced a big update": "https://www.techradar.com/news/roku-update-big-addition-brings-live-on-screen-program-guide-30-extra-channels",
    "Roku Channel": "https://www.techradar.com/news/rokus-free-streaming-service-is-now-available-on-ios-devices",
    "streaming devices": "https://www.techradar.com/best/streaming-device",
    "Roku Streaming Stick+": "https://www.techradar.com/reviews/roku-streaming-stick",
    "Amazon Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Sling TV": "https://www.techradar.com/reviews/audio-visual/av-accessories/sling-tv-1279011/review",
    "YouTube TV": "https://www.techradar.com/news/youtube-tv-everything-you-need-to-know-about-the-new-tv-streaming-service",
    "PlayStation Vue": "https://www.techradar.com/reviews/gaming/playstation-vue-1292722/review",
    "Nvidia Shield": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Roku Premiere+": "https://www.techradar.com/reviews/roku-premiere-2018"
  }
}