{
  "source": "https://www.techradar.com/reviews/crowdsignal",
  "title": "Crowdsignal review",
  "category": "computing",
  "updated": "2020-07-13T15:55:03Z",
  "author": null,
  "summary": "Create surveys and polls for free or upgrade to unlock more features",
  "verdict": "Crowdsignal is a reasonably priced online service for creating surveys and polls, but could use some attention in the user interface department.",
  "pros": [
    "Drag-and-drop simplicity",
    "Free plan offers a reasonable selection of features"
  ],
  "cons": [
    "UI isn’t as polished as some",
    "UI a bit confusing in places",
    "Previewing ratings doesn’t work"
  ],
  "article": [
    "Crowdsignal, which used to be known as PollDaddy, is an online service for creating polls, surveys and quizzes brought to you by Automattic, the people behind WordPress, WooCommerce, and Tumblr.",
    "Crowdsignal aims to help you get things done quickly while still giving you the scope to use your own creativity if you want to modify the supplied themes and match the design of your site.",
    "With Crowdsignal you can create surveys, polls, quizzes, or forms. There are 14 different types of question and form to choose from, including multiple choice, free type, and Likert scales.",
    "There is no limit on how many of these modes of gathering feedback you create, and they can all be managed from the same place in your Crowdsignal dashboard.",
    "Surveys can be shared with a link or embedded in websites, and can even be embedded in marketing emails. If you are heading to an event to take responses in person, but don’t have access to the internet, you can sync surveys to your device first and use it to collect responses.",
    "Crowdsignal will enable you to ask quite complex questions with conditional branching, where people can take different paths through the survey depending on their responses.",
    "Crowdsignal is also suited to learning platforms where you can use quizzes for teaching and testing. You’ll be able to ask multiple-choice questions and add imagery, audio, and video to make the quizzes more appealing to use.",
    "There are several themes to get you started. You can tweak colors and fonts to achieve the style you’re after, or if you’re experienced with code, you customize the output with CSS.",
    "After publishing, you’ll be able to watch results in real time and create filters to see where responses are originating from. Results can be exported to PDF, Excel, CSV, Google Docs, or XML.",
    "The data you collect with Crowdsignal can also be connected with Google Sheets if that’s your preferred way to store and manage data.",
    "To prevent double voting and spam, Crowdsignal uses captchas and restrictions on passwords, IP addresses, and email addresses to protect against automated bots.",
    "You’ll need to create an account with WordPress.com to be able to use Crowdsignal. Once you’ve registered and logged into the dashboard, you’ll be able to create either a survey, poll, quiz or rating.",
    "Surveys and quizzes give you a drag-and-drop interface for adding questions, form fields, and other page elements. You can also add and duplicate pages, and with surveys, after adding additional pages, you’ll be able to ‘branch’ your questions.",
    "With surveys you can choose from free text, multiple choice, matrix/Likert, or ranking questions. Quizzes only allow for multiple-choice questions. Both allow fields for capturing personal information such as name, email, address, and phone number.",
    "The editor interface for ratings gives you options to change the rating type—either 5-star or Nero—layout, fonts, and text. There is a section of the page that says Preview Rating Widget, but most of the option changes I made didn’t seem to register in the preview. There’s also a Preview tab, but there was no content in it for the tests that I created.",
    "The editor interface for Polls lets you add answers to the poll, and with each answer you can also upload an image or audio file, or embed a video. Again, the interface isn’t as straightforward as you might like. You enter your answers under the Editor tab, but to preview the output, you switch to the Style tab, which doubles as style-switcher and preview.",
    "Crowdsignal offers support through their support center, which has a series of searchable guides and articles, or you can fill in a form to send them an email message.",
    "Pricing for Crowdsignal is simple and straightforward. There are three plans: one free and two paid. The paid plans can be paid monthly or annually, and both come with a 30-day money-back guarantee.",
    "Aside from having fewer features than the paid plans, the free plan also has limits on how many responses, or ‘signals’, you can collect, the poll voting rate, and report filtering options. The free plan also includes Crowdsignal branding.",
    "The Pro plan is $29/month if you pay monthly, or you can save 43% by paying annually, with the price working out at $17/month. Like the free plan, it only allows one user account but has advanced reporting, no Crowdsignal branding, and no limits on signals or poll voting rate.",
    "It also adds several features like priority email support, custom poll restrictions, exports for responses and reports, sharing of results, and the ability to customize designs with CSS.",
    "You can send 10,000 email invites per month with the Pro plan as well as whitelist up to two polls.",
    "The Corporate plan is $99/month billed monthly or $75/month billed annually. It gives you 10 user accounts, 50,000 email invites per month, whitelists for up to 10 polls, advanced API access, and the ability to use your own domain name.",
    "If you need greater limits than what the Corporate plan offers, you can contact Crowdsignal to discuss your requirements.",
    "There are some well-known names in the online survey space, including SurveyMonkey, SurveyGizmo, Typeform, Wufoo, Qualtrics, and Google Forms. Crowdsignal is competitively priced but doesn’t have as many features and isn’t as user-friendly as some. Others like Qualtrics also offer more detailed analytics.",
    "Crowdsignal is reasonably priced, and it accomplishes most tasks fairly. However, it’s not the most well-designed web app out there, parts of the user interface (UI) are a bit confusing or don’t seem to work as intended, and support can be patchy."
  ],
  "headers": {
    "2": "Features",
    "11": "Interface and In Use",
    "16": "Support",
    "17": "Plans and Pricing",
    "24": "The Competition",
    "25": "Final Verdict"
  },
  "links": {
    "Crowdsignal": "https://crowdsignal.com/",
    "creating polls, surveys and quizzes": "https://www.techradar.com/best/best-qanda-and-polling-platforms",
    "marketing emails": "https://www.techradar.com/best/best-email-marketing-software",
    "learning platforms": "https://www.techradar.com/best/best-online-learning-platforms",
    "audio": "https://www.techradar.com/news/the-best-free-audio-editor",
    "video": "https://www.techradar.com/best/free-video-editing-software",
    "CSS": "https://www.techradar.com/best/html-online-courses",
    "passwords": "https://www.techradar.com/best/password-manager",
    "email addresses": "https://www.techradar.com/best/best-email-clients",
    "SurveyMonkey": "https://www.techradar.com/reviews/surveymonkey",
    "SurveyGizmo": "https://www.techradar.com/reviews/surveygizmo",
    "Typeform": "https://www.techradar.com/reviews/typeform"
  }
}