{
  "source": "https://www.techradar.com/reviews/google-currents",
  "title": "Google Currents review",
  "category": "computing",
  "updated": "2020-11-10T11:34:56Z",
  "author": "john-faulds",
  "summary": "Enterprise-level collaboration and communication tool from Google",
  "verdict": "Google Currents makes Google Workspace even better, but it’s doubtful Currents would be your primary reason for becoming a customer.",
  "pros": [
    "Easy to use",
    "Familiar user interface",
    "Part of a much larger software suite"
  ],
  "cons": [
    "No desktop apps",
    "Not available separately"
  ],
  "article": [
    "Google Currents is one of a suite of software products called Google Workspace, which is the recently rebranded G Suite. Currents, which was also formerly known as Google+, is designed to help with communication within organizations.",
    "Google is well known for its software products across different categories, but does that reputation necessarily mean that Currents can be considered as one of the best online collaboration tools? That’s what we’re going to find out in this Google Currents review as we explore its pricing, features, interface, and support.",
    "Because Google Currents is part of the Google Workspace software suite, you can’t actually buy it as an individual product. It comes as part of a large array of software products for a very reasonable price.",
    "Prices start at $6/user/month for the Business Starter plan and go up to $18/user/month for the Business Plus plan. There is also enterprise pricing for which you have to contact Google’s sales department.",
    "All plans include Currents as well as Gmail, Drive, Meet, Calendar, Chat, Docs, Sheets, Slides, Keep, Sites, and Forms. The features for Currents itself don’t change between pricing levels. What does change is the amount of storage available to your Workspace account and the number of participants allowed in video meetings. The Business Plus and Enterprise plans also come with enhanced security and management controls.",
    "Google Currents’ primary purpose is to enable organizations to exchange ideas at scale. With Currents, leaders and employees across the organization will be able to exchange ideas and gather feedback from others without flooding everyone’s email inboxes.",
    "Streamlined content composition is a feature of Currents, with users able to tag posts and add attachments or images. Others can then comment, provide feedback, or ask questions in the same place.",
    "Posts are presented in what’s known as the “home stream” and are ordered by what’s relevant and important to each individual. Or users can choose to sort posts in chronological order instead. Posts by organization leaders can be given priority to improve their visibility.",
    "Organization admins can target specific sets of employees or the whole organization with custom streams that they can create. And they’ll be able to understand how content is performing with metrics that track how the content is being consumed and used.",
    "Google Currents must first be enabled by the Workspace administrator in Google Admin. Then, content administrators—who can manage streams, tags, and leaders—must be added.",
    "Once that has been done, Currents is accessed in a web browser at currents.google.com. If you’ve used any social network before, working out how to use Currents shouldn’t be a problem as it employs user interface elements common to most platforms.",
    "You can create posts that people can comment on, add tags, and @ people to bring them into the conversation. Administrators will be able to click on a graph icon to view analytics about individual posts. When creating posts you can attach or link to files in your Google Drive, upload images, or add polls.",
    "Posts can be sorted by tags, and you can create communities and add people as followers or follow others, concepts familiar from other social media networks.",
    "Support for Google Workspace products comes in the form of dedicated technical support, self-help articles, and community forums.",
    "There are three priority levels for support cases, with 1 being the lowest. All Workspace plans come with Standard Support, which means you can expect to wait up to four hours for responses to priority 1 cases. Support is available 24/7 and is also available by phone.",
    "If you want speedier and more efficient support, you’ll need to be on one of the higher plans, which offer Enhanced Support. This will give you one-hour response times and 24/7 availability for P1 (priority 1) and P2 cases. You’ll also have access to support for third-party technology.",
    "For even faster response times of just 15 minutes, you’ll need to upgrade to Premium Support, which will give you access to 24/7 support for P1, P2, and P3 cases, a technical account manager, health reviews of your operation, training, and previews of new products.",
    "For both Enhanced and Premium Support, you’ll need to contact sales for pricing.",
    "As you would expect from the world’s best-known provider of cloud services, security is taken very seriously at Google. All of Google’s data centers are protected with custom electronic access cards and metal detectors. Biometrics and lasers to detect intruders make physical breaches almost impossible.",
    "Google’s network is designed so that your data will be constantly available even if certain machines fail. And the network runs on custom-designed hardware with hardened operating systems. Customer data is encrypted when it’s stored on disk and removable media, and when it’s in transit between data centers.",
    "There aren’t many software providers who offer similar wide-ranging suites of tools like Google. Microsoft 365 is the most notable rival, with its Microsoft Teams app functioning as an equivalent to Currents. Unlike Google Workspace, however, Teams can actually be obtained for free separately. If you want it as part of the full 365 package, prices start at $5/user/month and go up to $20/user/month.",
    "Slack is another option that provides software for communication and collaboration, and it’s also available for free or as part of paid plans starting at $6.67/user/month and going up to $12.50/user/month. There is also enterprise pricing for which you have to contact sales. Unlike Currents and Teams, Slack doesn’t include all the other software tools but does have integrations with many of them.",
    "If you’re already a Google Workspace customer, Currents will be a welcome addition to an already impressive business software package. It’s easy to use, has a familiar interface, and provides a good level of control for organization admins.",
    "If you’re already using a similar software tool from other providers, like those offered by Microsoft or Slack, the feature list probably isn’t impressive enough for you to make the switch based on Currents alone. And it’s doubtful you would choose to use Google Workspace just to get access to Currents.",
    "Ultimately, it’s more of a deal sweetener to help broaden the appeal of what’s already an increasingly popular software package."
  ],
  "headers": {
    "2": "Google Currents: Plans and pricing",
    "5": "Google Currents: Features",
    "9": "Google Currents: Interface and in use",
    "13": "Google Currents: Support",
    "18": "Google Currents: Security",
    "20": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Google Currents": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-1138663582499252000/https://workspace.google.com/products/currents/",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "video meetings": "https://www.techradar.com/best/best-video-conferencing-software",
    "email": "https://www.techradar.com/best/best-email-clients",
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "currents.google.com": "https://currents.google.com/",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "cloud services": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Slack": "https://www.techradar.com/reviews/slack"
  }
}