{
  "source": "https://www.techradar.com/reviews/identity-cloaker-vpn",
  "title": "Identity Cloaker VPN review",
  "category": "computing",
  "updated": "2020-12-15T15:17:21Z",
  "author": "sead-fadilpasic",
  "summary": "Another one on the average list",
  "verdict": "If you need access to US Netflix and BBC iPlayer, but don’t mind average speeds and above-average prices, then Identity Cloaker is perfect for you. However, do note that there are better options on the market at a much lower price.",
  "pros": [
    "Quite a few extras",
    "Unblocks Netflix US, BBC iPlayer",
    "No-questions-asked 14-day money-back guarantee",
    "Allows torrenting"
  ],
  "cons": [
    "Expensive",
    "Modest speeds",
    "Not many servers"
  ],
  "article": [
    "Identity Cloaker is a small EU-based veteran in the Internet anonymity field that has been active since 2008. It provides a combination of a proxy and VPN service that works well with various user types.",
    "This provider offers a 100% free demo mode for its potential customers and this free service is entirely functional and isn’t restricted in duration. It is, however, restricted to a number of select domains and websites, among which are facebook.com, wikipedia.org, eff.org, yahoo.com, twitter.com, badoo.com, identitycloaker.com, and a few others.",
    "There’s also a 10-day “trial” access that isn’t free and will cost you $5.87, which isn’t a really cheap deal or “next to nothing” as the vendor calls it. Other subscription options include a 30-day plan at $15.31 ($0.51/day), a 3-month option at $35.39 ($11.76/month), a 6-month subscription at $59 ($9.80/month), and a 12-month plan at $94.43 ($7.85/month), which is far from cheap.",
    "If you purchase the service and realize you don’t like it in the first two weeks of its use, don’t worry - you’re protected by a 14-day money-back guarantee, no questions asked.",
    "You can pay using several credit/debit card options or PayPal.",
    "The provider allows its service to be used “on any and all computers you operate”, suggesting there’s no limitation to the number of simultaneous connections. We asked for clarification but were only told that Identity Cloaker has a “per user” license, which means “you can use it on multiple PCs (and other devices) as long as you or your family members sharing the same household are the users”. This isn’t exactly the precise answer we were hoping for.",
    "While Identity Cloaker is a decent enough option, it’s still too basic for the price it is asking. If the money isn’t a problem, then you’ll find that investing it in, say, ExpressVPN is a much better idea due to the platform’s overall advanced feel and performance.",
    "NordVPN isn’t far behind, with its simple apps, blazing speeds, large server network, and lower rates. The same goes for Surfshark and CyberGhost, both of which cost much less than Identity Cloaker while providing a more advanced service.",
    "Many VPN users seek an option that would not only keep their online activities private but also unlock some of the popular streaming giants like Netflix US and BBC iPlayer that are often blocked in some regions, and Identity Cloaker can fulfill this request. It may even be able to unblock Netflix UK but the related server is currently down. That said, due to the provider’s average download speeds, you may not be able to stream this content at the best possible quality.",
    "The company behind this VPN is called TFR Technology and is registered in Prague, Czech Republic. It provides its services on 34 servers with 550 IPs in 18 countries, including Russia, Singapore, Ireland, Poland, Hong Kong, Australia, and others.",
    "Identity Cloaker “cloaks” your identity using SSH tunneling and VPN backed by 256-bit military class encryption, as well as the OpenVPN, PPTP, and L2TP/IPSec protocols.",
    "Torrenting and P2P content sharing is allowed, as long as you’re not using the US servers, in which case it is strictly forbidden, and “anyone found using the US servers for such traffic will have their accounts terminated as per our TOS”.",
    "Extra features include an option to receive an audible alert when the VPN connection fails, as well as a kill switch - a mechanism that blocks your Internet access if the VPN is down. Users can even choose which applications they want cloaked or excluded from the VPN protection.",
    "Identity Cloaker’s privacy policy states that the company doesn’t store “the addresses of the visited websites or other resources”, nor does it “store no transported data for a period longer than necessary to finish the Internet data transfer handover. No caching on permanent record media (for example hard drives) is being utilized”.",
    "The company also complies with the General Data Protection Regulation (GDPR) that covers the area of the European Union (EU).",
    "While this all sounds good, we don’t really know if anything else is being collected and we have no other choice but to trust the company unless an independent auditor is brought in to evaluate these claims. Some of the best VPN providers have already started doing exactly this, making them more trustworthy than others.",
    "Identity Cloaker has native apps but only for Windows and Mac. It can also be enabled on iOS and Android devices via their built-in VPN settings. You can also get it to work with Linux, “but some effort may be necessary based on your Linux distro”.",
    "If you use any standard web browser on a desktop machine, like Microsoft Edge, Firefox, Google Chrome, or Safari, you only need to download and install the apps, and you’re good to go.",
    "There’s a solid amount of information available on the website, although it seems a bit scattered and disorganized. For instance, there’s no information in the knowledgebase or the troubleshooting page, but there is everywhere else on the website, which is a bit odd.",
    "However, we did locate an FAQ section with 14 answered questions, as well as a How it works page, where you can read about the most common situations on the Internet and how Identity Cloaker can help you minimize the risks connected with them.",
    "If the information on the website isn’t enough to answer all your questions, you can direct them to the provider’s customer support, via email or ticket. There’s no live chat or phone option available at this time, but we received a response via email fairly quickly - in four hours.",
    "The apps are quickly installed and easily used, and hide some interesting options, such as a speed test that lets you see which servers are the best for your connection. This speed test was exceptionally useful for us as we tested the download speeds of various servers against a 76Mbps testing connection.",
    "We first wanted to check a server in Rome as it was relatively near our physical location and it gave us a rather poor 5.2Mbps. Other servers didn’t perform much better either, with London delivering only 5.3Mbps. We also tested servers in the US, with Missouri hailing only 0.8Mbps and New Jersey performing slightly better but still low - 1.4Mbps.",
    "Finally, we gave Singapore a chance and it performed similarly to the US - 1.3Mbps. Although this is pretty low in itself, we expected even worse.",
    "Identity Cloaker is certainly not among the industry giants such as ExpressVPN, primarily in terms of its server count, prices, and below-average speeds. However, it does have its value, evident in its native apps that have more features and options than many, its unblocking capabilities for some of the more popular streaming content, as well as support for torrenting."
  ],
  "headers": {
    "1": "Price",
    "6": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "10": "Privacy and encryption",
    "16": "Support",
    "21": "Speed and experience",
    "24": "Verdict"
  },
  "links": {
    "Identity Cloaker": "http://www.identitycloaker.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "TOS": "https://www.identitycloaker.com/cms/terms-of-service",
    "privacy policy": "https://www.identitycloaker.com/cms/privacy-policy",
    "Linux distro": "https://www.techradar.com/best/best-linux-distros",
    "FAQ section": "https://www.identitycloaker.com/cms/faq",
    "How it works page": "https://www.identitycloaker.com/cms/how-it-works",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-4997739528525263000"
  }
}