{
  "source": "https://www.techradar.com/reviews/sony-xperia-l4",
  "title": "Sony Xperia L4 review",
  "category": "phones",
  "updated": "2020-06-13T05:00:42Z",
  "author": "andrew-williams",
  "summary": "The Sony Xperia L4 keeps you away from high-cost contracts",
  "verdict": "Sony updates its budget L line with an ultra-wide camera and 21:9 aspect ratio screen. However, the Xperia L4 is still an also-ran. It handles the basics perfectly fine and does not make Android feel too slow. But you can get more power and longer battery life elsewhere.",
  "pros": [
    "Two camera fields of view, normal and wide",
    "Decent display quality",
    "Ultra-clean Android interface"
  ],
  "cons": [
    "Dated chipset",
    "Slow-charging, small battery",
    "Basic camera sensors"
  ],
  "article": [
    "The Sony Xperia L4 is a solid budget phone. It’s a decent choice if you want a phone for the basics and like Sony’s monolithic style.",
    "This style is emphasized by the ultra-long 21:9 aspect ratio screen, which lets Sony fit a 6.2-inch display into a reasonably narrow frame. We wouldn’t call the Sony Xperia L4 a small phone, but it is less wide than the rival Moto G8 Power Lite. When a phone feels too large for your hands, it’s usually because it is wide.",
    "But can you get more for your money? Sure. The Moto G8 Power Lite has a better primary camera, a much larger battery, and a better chipset.",
    "Delve into the unfamiliar-to-some world of Chinese phones from Xiaomi and Oppo and you can get even more. The Oppo A5 2020 is a particular highlight if you want your phone to last a long time.",
    "You’ll need to charge the Sony Xperia L4 every day, it struggles with some very demanding games, and the design may seem plain if you don’t buy into Sony’s style.",
    "The cameras are no better than we expect at the price too, even if there are three of them. You can shoot pleasant images on bright days, but night photos are poor, and the ultra-wide camera’s images are basic.",
    "Still, at this price any ultra-wide camera is a bonus.",
    "Few aspects of the phone stand out once you become accustomed to the taller-than-average screen. However, its general performance is perfectly fine, with very little of the fundamental system lag that can make a cheap phone irritating to use.",
    "The Sony Xperia L4 is a budget phone, the kind you might buy to get away from expensive contracts whose costs become dizzying when you work out how much they add up to over 24 months.",
    "It is the follow-up to the Sony Xperia L3, and was released in April/May 2020.",
    "Pricing has not changed this year. The Xperia L4 costs £169 (around $210 / AU$335), so key alternatives are phones like the Moto G8 Power Lite, Samsung Galaxy A20e and Xiaomi Remi Note 8.",
    "You’ll likely notice two elements of the Sony Xperia L4’s design first. It’s a plastic phone and has a very long screen.",
    "The first is typical of mobiles in this class, but Sony makes no attempt to disguise plastic as glass. Its back has a slightly sparkly finish but is matte and does not reflect your face in the way plastic masquerading as glass often does.",
    "The second Sony Xperia L4 trait, that long screen, is a Sony characteristic. It means the phone is relatively narrow for one with a 6.2-inch display. This is good news if you don’t want a phone that feels excessively large.",
    "Apple’s iPhone SE is much smaller still, and the Xperia L4's chunky 8.7mm thickness means it is not the outright small phone some of you may be after. But the Sony Xperia L4 feels manageable, not massive.",
    "It is also a good example of design features of previous flagships gradually dripping down to budget phones. The Sony Xperia L4 has slim-enough screen borders, far smaller than the iPhone SE’s, and a tidy-looking teardrop screen notch. Front-on at least, this does not look like a ‘cheap’ phone.",
    "More expensive hardware features are absent. The Sony Xperia L4 has a side-mounted fingerprint scanner rather than an in-screen one. It’s separate from the power button too. Some previous Sony phones have scanner/button combos. You can use the pad from standby, and it gets you to the home screen in little under a second.",
    "There are certainly faster pads, though, and a generous handful of times during testing the Sony Xperia L4 has refused to even recognize the presence of our thumb. It’s the sort of behavior you usually see after too many failed attempts, but there is no on-screen prompt to suggest this has happened. This is an acceptable finger scanner, one that could be improved in a software update.",
    "There’s no official water resistance either, but the Sony Xperia L4 does have NFC, which is missing from some cheap phones, and a headphone jack.",
    "Sony’s design style has a specific character, an unlikely sounding combination of the slick and the boxy. It rarely results in particularly striking high-end phones, but means the Sony Xperia L4 looks serious. And perhaps that’s not a bad approach when the aim here is not to look too cheap.",
    "The Sony Xperia L4 has a 6.2-inch LCD screen whose only stand-out part is shape. This is a 21:9 aspect ratio display, longer and narrower than that of any other big-name phone in its class.",
    "But is this actually a good shape? It’s useful in two main scenarios.",
    "Watch a movie shot in a similar aspect ratio, such as a big-budget blockbuster, and the footage will fill the screen without big black bars wasting the screen space. It can also be handy when playing games with virtual stick controls, as there’s more space to each side of the screen, relatively speaking.",
    "The Sony Xperia L4 is less than ideal if you watch 16:9 videos. You can either put up with black horizontal bars, or crop into the image and risk chopping someone’s head off.",
    "21:9 screens also offer lower perceived screen size per inch than the more common ~19:9 ratio. Why other manufacturers don’t use 21:9 displays starts to become obvious. Other shapes are a middle ground between ratios used by movies and TV shows. So, while very little content is actually shot at their exact aspect ratio, it’s usually not miles off.",
    "Other areas of the Sony Xperia L4 are just what we expect from a cheaper phone. Its color is good, but there’s no wide color gamut support for an ultra-saturated look. Contrast is solid if not near the level of an OLED phone.",
    "Maximum brightness is not quite high enough for ideal visibility on a bright day. This screen could certainly be brighter, but the backlight is at least powerful enough to let you type out a message comfortably no matter the light level.",
    "All advanced movie-watching extras are out. The Sony Xperia L4 does not support HDR, which is not a surprise. It also does not support Netflix HD at launch. 540p is the maximum streaming resolution, which we hope to see remedied before too long.",
    "This is a 720 x 1680 display, capable of lower-end HD streams. This resolution does not make interface text look as sharp as, for example, the slightly more expensive Moto G8 Power. However, it is normal for affordable phones like this to use a lower spec. We are happy with its sharpness at the price. Pixelation is not distracting and obvious.",
    "Take a look at the Sony Xperia L4’s trio of rear cameras and it doesn’t necessarily look all that different to those of a phone four times the price. The similarity ends there.",
    "This phone has a fairly basic camera arrangement made up to seem like a more advanced one. There’s a standard camera, an ultra-wide, and a depth assist for background blur images. But none of the sensors are particularly impressive.",
    "Its standard camera is, of course, the best. This has a 13MP sensor and an f/2.0 lens. It’s a small 1/3-inch sensor and is a step below that of the Moto G8 Power Lite. Even in good lighting there’s a noticeable step down in fine detail and texture fidelity.",
    "The Sony Xperia L4 can still take pretty day-lit photos, but night and low-light images are poor. Sony doesn’t have as clever dynamic range optimization as some either, leading to slightly duller shadows and the occasional bit of overexposure.",
    "Ultra-wide shots are best experienced on the phone’s screen too, because the low-resolution 5MP sensor just doesn’t capture the information needed to make them shine on a larger display.",
    "We are not particularly impressed by Xperia L4’s final camera either, a 2MP sensor that helps in the creation of depth maps for ‘portrait’ images, where the background is blurred.",
    "These don’t have to be of a person. Any subject will do. But on too many occasions the phone has blurred out the subject as well as the background when that subject is a little further away.",
    "Want video? The Sony Xperia L4 can only shoot at up to 1080p. There’s no 4K mode. It does offer electronic (software) image stabilization, but it is not particularly effective. Handheld footage is smoother than it might otherwise be, not genuinely smooth.",
    "Since 2019’s Xperia L3, Sony added this phone’s ultra-wide camera. It’s a big improvement in the kinds of images you can take, but you may be disappointed by their quality level if you look too closely.",
    "The front camera has an 8MP sensor and, just like the previous year in the Xperia L3, it can take solid well-lit selfies, but does not handle lower lighting as well as most more expensive phones.",
    "The Sony Xperia L4 is not a powerful phone. It has a MediaTek Helio P22 chipset, a relatively old processor announced in 2018. The previous model, the Xperia L3, used the very same chipset.",
    "We do not expect miracles at the price, but Motorola offers marginally more power for less money. The Moto G8 Power Lite has a Helio P35 processor, which while technically quite similar is newer and has a faster-clocked GPU for better performance. This one earns just 869 points in Geekbench 5 (150 per core), a poor score in 2020.",
    "The phone also has just 3GB of RAM, which is the least its Android 9 software can scrape by with while avoiding grating performance issues.",
    "Is it a nightmare to use? No.",
    "The Sony Xperia L4’s general performance is acceptable. There are occasional momentary pauses as you tap to head back to the home screen, but switching between recently used apps is fast enough and there’s minimal typing lag.",
    "However, loading of non-cached apps (recently used ones) is slow. Games like PUBG can seem to take a small eternity to reach the main menu, and even much less demanding apps like Twitter and Chrome are affected to a lesser extent.",
    "To get nearer to the kind of responsiveness of a top-end phone, consider spending a little more on a model from one level up, like the Moto G8 Power or Oppo A5 2020.",
    "There are significant effects for gaming too. PUBG will only run at the lowest graphics setting, which features low-res assets and glaring texture pop-in. You can’t play Ark: Survival Evolved at all because the Sony Xperia L4 does not support the Vulkan graphics API.",
    "Not all games run poorly on the Sony Xperia L4. Far from it. But if mobile gaming is your thing, this is not the right phone for you.",
    "Its speaker does not help either. The Sony Xperia L4 has a single mono driver on its bottom. It is not loud, and sounds thin.",
    "This phone is better at the simple stuff, but at least the software looks the part. The Sony Xperia L4 has a vanilla Google interface, so looks similar to a Google Pixel 3a XL in action. There are no attention-grabbing extras, and despite little performance issues, the way this software moves is deliberately designed to feel fluid.",
    "We do not get the latest version of Android here, though. The Sony Xperia L4 runs Android 9 rather than Android 10. However, Dark Mode is one of the key features of Android 10 you’d actually notice, and a version of it is already patched in. You can also make the phone choose light or dark interface panels based on the wallpaper design.",
    "This is not full ‘Dark Mode’ as it only really affects the app drawer, not your Google apps or even the settings menu. But we’re frankly not convinced Dark Mode is the best way to use Google apps anyway.",
    "The Sony Xperia L4 has a 3,580mAh battery. It seems small next to the 4,000mAh of the Redmi Note 8 or the 5,000mAh of the Motorola Moto G8 Power Lite and Oppo A5 2020.",
    "The budget category is a surprisingly good place to find a phone that can realistically last two days, or close to it. That was not Sony’s aim for the Xperia L4.",
    "This is a one-day battery life phone, but given its relatively small cell its real-world stamina could have been significantly worse. We tend to see the phone left with under 10% charge by bedtime, after a day that includes some YouTube streaming, a few hours of audio streaming, and many messages sent.",
    "The Sony Xperia L4 can weather through a day of moderate use perfectly well. But next to the Oppo A5 2020? It does not come off very well.",
    "90 minutes of locally stored video played at maximum brightness takes 19% off the battery, slightly more than the 17% we saw from 2019’s Xperia L3.",
    "Last year we complained about the L3’s slow charging, and that has not changed. The Xperia L4 comes with a very slow 7.5W charger, with half the power output of the humblest fast charger.",
    "First reviewed: June 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Sony Xperia L4 price and release date",
    "11": "Design",
    "20": "Display",
    "29": "Camera",
    "39": "Specs and performance",
    "52": "Battery life",
    "58": "Don't buy it if..."
  },
  "links": {
    "Moto G8 Power Lite": "https://www.techradar.com/news/moto-g8-power-lite-packs-a-colossal-5000mah-battery-for-a-cheap-price",
    "Oppo A5 2020": "https://www.techradar.com/reviews/oppo-a5-2020-review",
    "Sony Xperia L3": "https://www.techradar.com/reviews/sony-xperia-l3-review",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "Moto G8 Power": "https://www.techradar.com/reviews/moto-g8-power",
    "Google Pixel 3a XL": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}