{
  "source": "https://www.techradar.com/reviews/clearvpn",
  "title": "ClearVPN review",
  "category": "computing",
  "updated": "2020-12-30T18:16:03Z",
  "author": "sead-fadilpasic",
  "summary": "A decent VPN with plenty of room for improvement",
  "verdict": "ClearVPN is expensive, glitchy, and its customer support is next to non-existent. However, it does provide excellent speeds and access to certain geo-blocked streaming content, so it's not all bad.",
  "pros": [
    "Unblocks Netflix US",
    "Good speeds",
    "Supports torrenting"
  ],
  "cons": [
    "Windows app doesn’t work",
    "Doesn’t unblock BBC iPlayer",
    "No response from customer support",
    "Expensive"
  ],
  "article": [
    "ClearVPN is a VPN service from MacPaw, a software company focused primarily on developing solutions for Mac and iOS devices.",
    "MacPaw’s other creations include a PC optimizer, drive manager, duplicate file finder, photo organizer, RAR opener, file encryption, and more. We’ve tested the VPN product to see if it’s worthy of your attention.",
    "This VPN is available for purchase under only two subscription lengths: 1-month at $12.95 and 1-year at $92.95 (equal to $7.75/month), placing this VPN solution up there with the most expensive on the market. Under one account, you can connect up to 6 devices at the same time.",
    "There’s a 30-day money-back guarantee, so you can nab a refund if you’re less than satisfied with this provider’s performance. ClearVPN accepts payments made via credit/debit cards, PayPal and UnionPay.",
    "ClearVPN may be a decent enough VPN solution for modest users. However, it costs more than some of best VPN services around like NordVPN, Surfshark and CyberGhost. All of these services provide superior platforms, apps for all major platforms (as well as support for a few minor ones) and thousands of different servers.",
    "ClearVPN does cost slightly less than ExpressVPN, but considering it lags behind in terms of overall quality, the latter is likely to be the better buy - especially if you’re prepared to spend this much on online privacy.",
    "This VPN platform states that it can unblock geo-restricted content provided by streaming services like BBC iPlayer, Netflix, Amazon Prime, HBO Max, and Hulu, but when we tried to access content via BBC iPlayer, the streaming platform recognized we weren’t connecting from the UK (even though we used the specialized BBC iPlayer option in the app).",
    "ClearVPN is run by Ukrainian software company MacPaw. However, as noted in MacPaw’s Privacy Policy, “[data] will be transferred to, processed, and stored in the United States. We also process your Personal Data in the UK, Republic of Ireland.”",
    "The VPN provider offers access to an undisclosed number of servers in the UK, US, Singapore, The Netherlands, Austria, Greece, Germany, Ireland, Ukraine, Belgium, Sweden, Norway, Denmark, Canada, Australia, France, Switzerland, Spain, and the United Arab Emirates.",
    "To keep all your online activities private and safe from prying eyes, ClearVPN deploys the unbreakable AES-256 encryption and an innovative VPN technology called DynamicFlow, which “instantly analyzes the user’s current network status (servers, local restrictions, actual regional content limitations, etc.) and connects to the fastest idle server to enable secure, low-ping and effortless UX”.",
    "In addition to IPSec, IKEv2, and OpenVPN, it also uses its own custom protocol, “to eliminate any security vulnerabilities and achieve a high-speed connection”.",
    "The apps have some extras too. For instance, you can prevent those pesky ads from ruining your online experience if you activate the ad blocker, protect yourself from malware with a specialized blocker, and safeguard the privacy of your emails via safe chats.",
    "If you were wondering about logging, MacPaw’s Privacy Policy explains the company's servers “automatically collect data when you access or use our Site and/or Product and record it in log files. This log data may include the IP address, browser type and settings, the date and time of use, information about browser configuration, language preferences, and cookie data.”",
    "The company may also collect device-specific information such as “the type of hardware and software you are using, as well as unique device identifiers for devices that are using MacPaw Product”, so caution is advised.",
    "Torrenting or P2P traffic is allowed, and there’s even a shortcut for this option inside the app.",
    "ClearVPN has beautiful and user-friendly apps for Mac, iOS, Android, and Windows. The Android app has been rated by 40 users so far and they gave it 3.7 stars (out of 5). Its iOS counterpart has been rated by only one person, who gave it 3.0 stars.",
    "If you require assistance, it is available via the product-specific Support Center, from where you can access the Zendesk-based Help Desk and a contact form.",
    "The searchable Help Desk is divided into four categories with self-explanatory titles - FAQ, About ClearVPN, Apps and connectivity, and Manage your ClearVPN account and subscription.",
    "The contact form provides a way to access customer support directly and describe your problem, as an alternative to sending an email. However, we’ve had no luck so far in trying to reach customer support directly.",
    "The apps are very easy to use and server switching is simple, but requires more than one step. You first need to select your purpose for the VPN, choose the location, and then click/tap ‘Activate’.",
    "We had huge problems getting the Windows app to run, and even the Android app was slow and glitchy at times, which could be the result of the provider's focus on iOS and Mac devices.",
    "We decided to begin our speed testing with a location in Germany. The results were solid, giving us 11Mbps on a 37Mbps testing connection.",
    "Then we went to a server located a little further away, in the US. This time around, ClearVPN delivered only 3.6Mbps. Not expecting much, we also tested a server in India, where we got almost the same results as in the US: 3.7Mbps. This is, however, a solid result for a location so far away from our own that often delivers less than 1Mbps.",
    "ClearVPN appears to be a VPN platform with potential thanks to solid download speeds and the fact that it can unblock localized content on US Netflix.",
    "However, it lacks a lot of the characteristics that define the best VPN services on the market: thousands of servers, working apps for various devices and swift responses from customer support."
  ],
  "headers": {
    "2": "Price",
    "4": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "9": "Privacy and encryption",
    "15": "Support",
    "19": "Speed and experience",
    "23": "Verdict"
  },
  "links": {
    "ClearVPN": "https://macpaw.audw.net/c/221109/66209/1733?subId1=trd-us-7817033381775895000&sharedId=trd-us&u=https%3A%2F%2Fmacpaw.com%2Fclearvpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "MacPaw": "https://www.techradar.com/news/popular-mac-developer-launches-vpn-service",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Privacy Policy": "https://macpaw.audw.net/c/221109/66209/1733?subId1=trd-us-2127230799190015200&sharedId=trd-us&u=https%3A%2F%2Fmacpaw.com%2Fpolicy",
    "Android app": "https://play.google.com/store/apps/details?id=com.macpaw.clearvpn.android&hl=en&gl=US",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9443438768057311000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fclear-vpn-unlimited-security%2Fid1532377665%3Fcid%3D1097570376.1606839356%26shortlink%3Dfa377d71%26pid%3Dmacpaw.com%26c%3Dproduct_landing_ios",
    "Support Center": "https://macpaw.audw.net/c/221109/66209/1733?subId1=trd-us-6043452303482941000&sharedId=trd-us&u=https%3A%2F%2Fmacpaw.com%2Fsupport%2Fclearvpn",
    "Help Desk": "https://support.clearvpn.com/hc/en-us",
    "contact form": "https://macpaw.audw.net/c/221109/66209/1733?subId1=trd-us-7290850413679500000&sharedId=trd-us&u=https%3A%2F%2Fmacpaw.com%2Fsupport%2Fcontact",
    "email": "mailto:support@macpaw.com"
  }
}