{
  "source": "https://www.techradar.com/reviews/aoc-cu34g2x",
  "title": "AOC CU34G2X review",
  "category": "computing",
  "updated": "2020-02-12T16:40:21Z",
  "author": "benjamin-abbott",
  "summary": "AOC has another winner",
  "verdict": "Although you may either love or be unimpressed by that subtle black and red design, there's no arguing with this monitor's performance - it's exceptional.",
  "pros": [
    "Superb performance",
    "Immersive",
    "Subtle design..."
  ],
  "cons": [
    "...but it looks forgettable",
    "Menu is hard to navigate",
    "No G-Sync"
  ],
  "article": [
    "If anything faces an uphill battle to stand out, it's the AOC CU34G2X from the G2 series. The battle to be the best ultrawide monitor is an ironically crowded market, so how do you make your mark when black and red gaming displays are practically the norm? By showing, not telling.",
    "Rather than advertising its gamer-centric nature via sharp angles and aggressive RGB lighting, this 'frameless' monitor works hard to provide a best-in-class performance, instead.",
    "Although it may not look like much from the outside, this display packs a punch.",
    "You'll have no trouble at all if you're hunting down the AOC CU34G2X in the US or UK; it's widely available in both territories. What's more, it's not offensively priced in either of them. Getting it stateside will set you back around $450, while the UK version is similarly priced at £450.",
    "Unfortunately, the monitor doesn't seem to be available in Australia – at least not as it appears everywhere else. The closest equivalent appears to be the C32G2E.",
    "The latter is smaller at 31.5 inches, but it still offers a curved QHD screen, a 1ms response time, and 144Hz (unfortunately, we couldn't find pricing information for that one at the time of writing).",
    "In a world of over-the-top screens that practically shriek \"witness me\", the AOC CU34G2X is refreshingly subtle. It opts for a more subdued approach thanks to sleek black with red accents along a chassis that looks like it could take more than a few knocks.",
    "Because the base is constructed from sturdy metal, it's also not going anywhere fast - you don't have to worry about it toppling over if your desk is knocked.",
    "However, the CU34G2X's modesty won't be to everyone's taste. Although it's a handsome bit of tech, you could also argue that it's dull. This is a workmanlike piece of kit without much flair, for better or worse.",
    "It's also very similar to the ASUS ROG range, further lessening its impact - every monitor we test these days seems to be constructed from angular black plastic with red trimming, so this one arguably disappears into the crowd as a result.",
    "However, the AOC CU34G2X has plenty going for it under the hood. To begin with, it's an ultrawide 34-inch QHD screen with 21:9 widescreen resolution (3440x1440), 144Hz, and a 1ms response time to go with it.",
    "It offers AMD FreeSync as well, not to mention half-a-dozen SS USB ports and the usual display accoutrements. In other words, it's stacked with all the features you need for modern gaming.",
    "Happily, the AOC CU34G2X's performance is also much better than any of our earlier quibbles above would suggest. The curve doesn't feel too overwhelming when leaning in close over your keyboard, and it's one of the most immersive experiences you can have when you slap on a gaming headset as well.",
    "What's more, it's devastatingly responsive thanks to that 144Hz refresh and 1ms response time - there's no perceptible screen-tearing even during the intense, busy firefights of The Division 2, for example.",
    "It also needed no adjustments for great color-balance; the hues and shades of Ubisoft's shooter and Total War: Warhammer 2 were gorgeous right off the bat.",
    "As for range, the CU34G2X is no slouch either. Metro Exodus is always a good show of shadow or light, and AOC's latest does a superb job.",
    "Although it verges on the darker end of the spectrum (our gamma tests almost entirely removed the left-most icon you're barely supposed to see), this is to the game's benefit.",
    "Skulking around the Moscow underground reveals gloomy tunnels that fall away into a pitch blackness that's claustrophobic, disorienting, and almost absolute without your torch.",
    "The screen's HDR features are pretty good as well despite the CU34G2X not being an actual HDR monitor. They still result in rich, vivid, and deep shades, even though you shouldn't expect anything mind-blowing (it should also be noted that we went with the standard DisplayHDR mode - the game-specific one was a bit grainier than we liked).",
    "The one downside? Getting to those settings is a bit of a faff. That's because you need to press the menu button to bring it up, press again to activate the setting you want, make any changes with the left or right buttons, and then press again to lock your choice into place.",
    "The buttons themselves also feel small and somewhat tacky. But hey: when the performance elsewhere is this good, we can forgive that. And does it matter all that much? Not particularly.",
    "Despite a subtle but potentially plain design, the AOC CU34G2X is the Millennium Falcon of monitors - it has it where it counts. Superb performance and impressive technical stats make it a worthy purchase, particularly at that sub-$500/£500 price.",
    "This is also a screen that'll serve you well going forward. A 144Hz refresh rate and 1ms response time ensure that the demanding games on our horizon - like Cyberpunk 2077 - will look their best.",
    "And even though it's not a 4K device, that's not a huge issue right now; 4K gaming is an expensive business requiring nothing but the best hardware, so the CU34G2X is a fine choice for now and the next few years."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "12": "Performance",
    "21": "Final verdict"
  },
  "links": {
    "best ultrawide monitor": "https://www.techradar.com/news/ultrawide-monitor",
    "The Division 2": "https://www.techradar.com/news/tom-clancys-the-division-2-isnt-coming-to-steam",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}