{
  "source": "https://www.techradar.com/reviews/mullvad",
  "title": "Mullvad VPN review",
  "category": "computing",
  "updated": "2020-06-23T13:44:43Z",
  "author": "mike-williams",
  "summary": "Want to be truly anonymous online? Take a look at this VPN",
  "verdict": "Mullvad's apps aren't the best, and there are much cheaper services around, but this VPN's anonymity and technology are major plus points, and you get great speeds, too.",
  "pros": [
    "Truly anonymous accounts",
    "Excellent speeds",
    "Solid kill switch and leak protection",
    "Unblocks Netflix"
  ],
  "cons": [
    "Apps lack features",
    "Doesn't unblock iPlayer, Amazon, Disney+",
    "No discount for long-term subscriptions",
    "Last security audit was 2018"
  ],
  "article": [
    "Mullvad is a Swedish-based VPN which doesn't just talk about protecting your privacy – it actually does something about it.",
    "Signing up, for instance, is as simple as clicking a button to generate an account number. The website creates a unique account number for you, and you're done. Mullvad doesn't need your email address, your name, country, or any personal details – the account ID is enough.",
    "The company goes on to recommend that you pay via cash, Bitcoin or Bitcoin cash, which ensures it will know almost nothing about you. If that's a step too far, you can pay as usual via card, PayPal, bank transfer or Swish.",
    "Mullvad's core service is powerful, up-to-date, and absolutely stuffed with high-end technologies. It only uses OpenVPN and WireGuard protocols, for instance. There's industrial strength encryption (AES-256 GCM, 4096-bit RSA certificates with SHA512, perfect forward secrecy). There are multiple layers of DNS and IPv6 leak protection, you get multiple stealth options to bypass VPN blocking, port forwarding support is built in, and the list goes on.",
    "The network is a reasonable size. Mullvad may 'only' have 606 servers (NordVPN has a massive 5,500+) , but they're well spread across 58 locations and 36 countries.",
    "The company has its own client for desktops: Windows, Linux, and Mac. Unusually, this is open source, so developers who are suspicious about Mullvad's motives, or just curious about the quality of the code, can check it out for themselves.",
    "Mullvad took a long time to develop mobile apps, but there are now Android and iOS builds to try (these don't quite have as many features as the desktop clients, but cover all the essentials). Whatever you're using, there's support for connecting up to five devices simultaneously.",
    "Pricing is extremely simple at €5 ($5.40) a month, no long-term contracts required. That's half the price you'll pay for monthly billing with some providers, and cheaper than many annual plans, but sign up for longer elsewhere and there's a lot of money to be saved. Surfshark is only $1.99 a month on its two-year plan, for instance, a fraction of the price.",
    "Still, the fact that Mullvad isn't trying to tie users into long-term contracts seems a very positive sign. If the company knows that many of its customers can leave at any time, you can be sure it will make real efforts to keep them happy.",
    "Figuring out a VPN's logging policy is often a real challenge, but again, Mullvad is different, spelling out the fine detail in an excellent policy page.",
    "The key point is that nothing is logged that can be connected to a specific account. No traffic, DNS requests, IP addresses, not even connection times, dates or bandwidth used.",
    "Mullvad explains that it monitors the current number of connections to each account, to ensure no-one can use more than the five allowed. But this isn't saved, so there's no way to tell how many you were using five months, weeks, or even minutes ago.",
    "The end result of all this is you don't have to worry about how Mullvad handles court requests to access your usage data, because, well, there isn't any.",
    "Mullvad hasn't put itself through a public audit of its infrastructure to confirm it's following these procedures, unlike some competitors. That said, the company did have its desktop client audited back in 2018, and that's a welcome step. But others have gone further, and for example TunnelBear now has annual audits of its apps, backend systems and even its website.",
    "Still, when a company gives us this level of detail on its procedures, and provides very real privacy advantages elsewhere (no need to hand over your email address, open source desktop client), these are very positive signs. Audit, or no audit, we think Mullvad looks far more trustworthy than most of the competition.",
    "Getting started with Mullvad is as easy as generating an account number and buying some time (cards, PayPal, Bitcoin and others are supported, as mentioned). The website presents this clearly, and gives you far more control than is normally seen. You're not signed up to a PayPal subscription without realizing, for instance – there are separate options to make a one-off payment, subscribe, or end an existing subscription.",
    "A comprehensive Download page prompted us to download the Windows client, but also included links to the Mac, Linux, iOS and Android apps, along with options to download OpenVPN and WireGuard configuration files.",
    "We grabbed and installed the Windows client in a few seconds. We activated it by entering our account number (Mullvad doesn't require usernames or passwords) and it was ready to go.",
    "While some VPN's apps look and feel very different across all platforms, Mullvad takes a more unified approach. Whether you're using Windows or Android, Mac or iOS, or indeed Linux, each app is almost identical, with little more than a few settings varying between versions.",
    "(This magic is possible because Mullvad develops its software using Electron, a powerful tool which enables building an app using standard web technologies such as JavaScript and CSS, then easily converts them to a Chromium-powered native application.)",
    "The app looks good, with a colorful panel, a map highlighting your current location, and a 'Secure my connection' button.",
    "Tapping the location name lets you choose another from a list. There's no 'Fastest' or 'Automatic' option to select the best server for your current location, no search box, filters, Favorites system or server load indicators; it's just a simple menu with country and city options.",
    "Connection times are only average, but within a few seconds the app displays your new virtual location and protocol (WireGuard or OpenVPN).",
    "Once you're connected, a new Switch Location button appears. Tap this and you're able to choose and connect to a new location, without having to close the current connection first (a common annoyance with many VPN apps). But this isn't just a timesaver; what is really interesting is what's happening underneath.",
    "With most VPN apps, if you choose a new server while you're connected to another, the app simply closes the existing connection and opens a new one. Sounds obvious, right? But it means that in the time between disconnecting from server #1 and connecting to server #2, you're exposing your real IP address.",
    "When we switched servers with Mullvad, that didn't happen. We saw no sign of any IP leaks when switching from one location to another. That's very good news, as it suggests Mullvad understands and is addressing common VPN app issues that many providers don't even realize exist.",
    "The app has a scattering of settings, including basic protocol choices (WireGuard, OpenVPN UDP or TCP), the ability to launch with Windows, a kill switch, the ability to enable or disable IPv6, and assorted advanced connection tweaks (OpenVPN MSS value, WireGuard key and MTU, plus more besides).",
    "It's missing some handy features we regularly see elsewhere – such as the ability to automatically connect when you access particular networks or network types, for instance – but there's enough to get by.",
    "The app has one other unusual expert-level extra in a very flexible command line interface, which enables building scripts to tweak settings, connect to your chosen locations, view status or disconnect automatically. That'll be way too much hassle for most people, but if you want to do something advanced – perhaps create a script which automatically connects to Mullvad before launching a specific app – it could be very helpful.",
    "Our performance testing began with a close look at Mullvad's kill switch. We forcibly closed both OpenVPN and WireGuard connections in various ways, but the app handled each situation perfectly: it immediately displayed a 'Reconnecting' message alerting us to the problem, blocked our internet connection to prevent any IP leaks, and followed up with a 'Secured' notification, seconds later, when the connection was re-established.",
    "Mullvad is more focused on privacy and security than unblocking every website in the world, but our tests revealed a little good news. Sure, it didn't get us into BBC iPlayer, Amazon Prime Video or Disney+, but Mullvad did unblock US Netflix, along with YouTube and the less well defended sites.",
    "The service scored full marks in our privacy tests, with the Windows client successfully blocking DNS and WebRTC leaks.",
    "The positivity was maintained to the end, with our performance tests showing excellent download speeds of 68-69Mbps on our 75Mbps UK test line, and up to 270-310Mbps on an ultra-fast US connection. That's trailing behind speed champion Hotspot Shield (450-580Mbps), but it's a great result, and puts Mullvad well ahead of most VPNs in the performance stakes.",
    "Mullvad's app has few features, it's not especially configurable, and prices are above average for long-term users, but otherwise there's a lot to like here. You can open an account without handing over any personal data, speeds are excellent, and a top-quality VPN engine protects your privacy at all times. So while not up there with the likes of ExpressVPN, it's still well worth a look."
  ],
  "headers": {
    "9": "Privacy",
    "15": "Setup",
    "18": "Apps",
    "29": "Performance",
    "33": "Final verdict"
  },
  "links": {
    "Mullvad": "https://www.mullvad.net/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "€5 ($5.40) a month": "https://www.mullvad.net/",
    "audited": "https://mullvad.net/en/blog/2018/9/24/read-results-security-audit-mullvad-app",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn",
    "Download page": "https://mullvad.net/en/download",
    "command line interface": "https://mullvad.net/en/help/how-use-mullvad-cli",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn"
  }
}