{
  "source": "https://www.techradar.com/reviews/jbl-boombox-2",
  "title": "JBL Boombox 2 review",
  "category": "audio-visual",
  "updated": "2020-06-23T19:37:03Z",
  "author": "ted-kritsonis",
  "summary": "JBL comes back for a loud encore with the JBL Boombox 2",
  "verdict": "JBL doesn’t reinvent all that much with this newer iteration of the Boombox, though did manage to change its multi-speaker connectivity and keep it friendly to water. A speaker like this was made for everything to do with being outside and makes for a perfect companion at outdoor parties.",
  "pros": [
    "Loud, distortion-free sound",
    "IPX7 water-resistant",
    "24-hour battery life"
  ],
  "cons": [
    "Expensive",
    "Missing the best Bluetooth codecs",
    "Won’t work with original"
  ],
  "article": [
    "Back in the day, the boombox was the iconic symbol for music that went with you. It was the boombox that got people dancing in the streets, and serenaded a barbecue or campsite in every backyard or park.",
    "JBL is after that kind of social outing with the JBL Boombox 2, a portable Bluetooth speaker whose primary mission is to get loud.",
    "And loud it gets — even more so than its predecessor, which is saying something, considering how bombastic the previous JBL Boombox was.",
    "The similarities between them are more numerous than the differences, and the price is still expensive. It’s a hefty tag to pay for a pretty one-dimensional product, but if you need an outdoor-ready speaker for a family gathering and don't care about Hi-Res Audio, the JBL Boombox 2 has you covered.",
    "The JBL Boombox 2 was unveiled at CES 2020 and was released in April. In terms of price, the Boombox 2 retails for $449.99 / £399.99 (around AU$650).",
    "That's a fair bit more expensive than our favorite water-resistant speaker, the UE Wonderboom 2, that only costs around $69.99 / £89.99 / AU$129, but the Boombox 2 certainly has the Wonderboom beat in terms of max volume. If you want to split the difference there's the larger, more powerful UE Megaboom 3 that comes in at $200 / £170 / AU$300, and can be paired up with other Ultimate Ears speakers.",
    "This design of the JBL Boombox 2 is almost a carbon copy of the previous model. In fact, had we put the two together next to each other, it would’ve been hard to pick them out, though JBL wisely changed a few accents to make them less identical.",
    "For instance, the JBL logo on one side now has an exclamation mark, while the underside of the handle has a little extra color to it.These are definitely subtle cues, especially when you throw in the fact JBL is sticking to both the black and camo variants, leaving no room for any other funky color options.",
    "The Boombox 2 is also almost exactly the same in size and weight. It’s slightly heavier at 13 lbs. and a smidgen bigger at 10.1 x 19.5 x 7.9. The handle is of the same sturdy material, holding together the big cylindrical design.",
    "The guts inside are equally familiar. You get two passive radiators on the ends with dual 20mm tweeters and two 4-inch woofers under the hood to pump out the big sound. It doesn’t look JBL used different components beyond the newer Bluetooth transmitter that we’ll get to later.",
    "Buttons are laid out in much the same way, except for a couple of minor shifts. JBL moved the Bluetooth button to share with power, while it’s old spot is taken up by the PartyBoost button. You also get play/pause and volume up/down buttons, along with LED indicators at the bottom to show battery life. Double-clicking play/pause skips a track, but for some reason, JBL didn’t map it to repeat a track with a triple-press after failing to do so with the previous Boombox.",
    "The back ports retain the same layout, too. You get the power adapter, 3.5mm Aux-In, a USB port to charge phones and other small gadgets, along with a microUSB port for servicing. Other than the power adapter, you get no cables in the box. Not even an Aux-In.",
    "Using a different Bluetooth transmitter means JBL had to cut loose some of the original Boombox’s compatibility. That model had a button called Connect+ that paired with other JBL speakers to play the same music simultaneously — or in stereo as left and right channels. It’s gone now, and so is any connection with the Connect+ app, putting the Boombox 2 into a different ecosystem of connectivity.",
    "Basically, if you had the Boombox 2, while a friend had the original Boombox, you would have no way of pairing them together because PartyBoost uses different protocols. While you could do the same type of speaker pairing like you could with Connect+, this speaker can only do it with those also supporting PartyBoost.",
    "JBL also ditched the separate Indoor and Outdoor modes the previous model had. The company thinks its tuning and audio engineering makes it sound great in both environments, negating the need to toggle between them. Unfortunately, there’s no equalizer or any way of tweaking the audio output to adjust how the speaker sounds. What you hear is what you get.",
    "And that leads us to an odd omission. While the Boombox 2 is a Bluetooth speaker, it doesn’t support the two best codecs using it: aptX and AAC. We can understand that most Bluetooth speakers won’t support both, yet charging north of $400 means it’s something that should probably be there. It’s true that this is hardly aimed at audiophiles, but a higher price point should come with extra functionality, particularly when it affects sound quality.",
    "JBL maintained the IPX7 rating, so the Boombox 2 is well suited to being around splashing water and rain. You could submerge it in clear water for up to 30 minutes, and it can even float, except it tilts forward, muffling the music into the water. Bluetooth also doesn’t travel well when submerged, so best to keep its water exposure to solid ground.",
    "Did we mention this thing is loud? It’s a beast for its size, and we appreciated that it shrugged off distortion when we turned up the volume. Bass figures prominently here, no matter what you’re playing, but we came away impressed with how good it was at background tunes when we played some late night jazz at lower volumes while sitting outside at night.",
    "When we rocked out, we tried all kinds of different tracks that probably made neighbors wonder what we were trying to do. Motley Crue’s Kickstart My Heart is a crowd-pleaser, but the head-banging guitar riffs came through nicely with the emphatic vocals. We felt a similar way when blasting Killer Mike’s Don’t Die, which could’ve doubled as making a statement through a megaphone for how loud it all was.",
    "Like any speaker, the Boombox 2 has its tipping point, and we found distortion start to set in around the 80-90% mark. Bear in mind, though, it’s really loud at those volumes, so you probably only need to go that high if you’ve got a lot of people congregating over a larger area.",
    "The only thing was, we didn’t really find this speaker to sound all that different from its predecessor. We played music on it relentlessly for weeks indoors and out, and while it wasn’t with a large group due to Covid-related restrictions, we recognized the familiarity throughout.",
    "It makes sense, since JBL didn’t re-engineer much here. The soundstage is essentially the same, and it does the job of filling more than a room. We also liked using it with tablets to watch content on YouTube and other streaming apps. With little to no lag taking things out of sync, we grew to appreciate how the sound could feel so much bigger than the action on the screen we were watching.",
    "Battery life was pretty much the same throughout. JBL’s 24-hour estimate is only accurate if you stick to default volume, but even at 60%, we hit 20 hours easily. The buzzing sound we experienced with the previous Boombox when it went low on battery never appeared with this unit, so looks like JBL solved that issue.",
    "The Boombox 2 is like the movie sequel that rehashes 90% of the original’s plot and scenes. That doesn’t make the speaker bad — far from it — but it does mean that this is better for newcomers to the Boombox, not existing users.",
    "Like the original, this is largely a social speaker. It’s fine indoors, but really shines when playing music for a small crowd outdoors. And for $450, its narrowed focus is a high price to pay to make parties lively but ultimately if you need ample audio at your next outdoor party or camping trip, this is the speaker to get."
  ],
  "headers": {
    "4": "Price and release date",
    "6": "Design",
    "12": "Connectivity and features",
    "16": "Performance",
    "23": "Final verdict"
  },
  "links": {
    "JBL Boombox": "https://www.techradar.com/reviews/jbl-boombox",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "UE Wonderboom 2": "https://www.techradar.com/reviews/ultimate-ears-wonderboom-2",
    "UE Megaboom 3": "https://www.techradar.com/reviews/ue-megaboom-3"
  }
}