{
  "source": "https://www.techradar.com/reviews/viewsonic-vg3448",
  "title": "Viewsonic VG3448 ultrawide monitor review",
  "category": "components",
  "updated": "2020-06-15T06:43:16Z",
  "author": "jeremy-laird",
  "summary": "Proof that ultrawide monitors make for good productivity panels",
  "verdict": "Proof that ultrawide monitors are about much more than merely having fun. Lack of USB-C connectivity might spoil the party, however.",
  "pros": [
    "Great screen format for productivity",
    "Good build quality"
  ],
  "cons": [
    "Quite expensive",
    "No USB-C connectivity",
    "Adequate rather than excellent image quality"
  ],
  "article": [
    "Ultrawide 21:9 aspect ratio monitors are typically associated with gaming and media consumption. Having fun and other frivolous activities, you could argue. But Viewsonic’s VG series of screens are unambiguous workhorses designed for optimal productivity. That applies even to the Viewsonic VG3448, an ultrawide 34 incher for office and home office applications.",
    "In many regards,the VG3448 is similar to more familiar leisure orientated ultrawide screens. It sports 3,440 by 1,440 pixels, for instance. But it’s flat rather than curved, runs at just 60Hz and conspicuously lacks frills such as HDR support or LED mood lighting.",
    "So far, so sensible. However, the VG3448 lacks some features that would be desirable in a professional environment, the most obvious of which is USB Type-C connectivity. Whether those omissions are enough to undermine its overall proposition as a productivity tool is what we’re here to find out.",
    "With current pricing around $499 in the US and £520 in the UK, there are some unflattering comparisons that can be made with largely similar monitors like the Philips 346B1C. The Philips matches the Viewsonic VG3448 in many regards but adds USB-C. And all for about the same price. That said, if you don’t want USB-C then the contest becomes much more finely balanced.",
    "In line with Viewsonic’s broader VG family of displays, the VG3448 is distinctly sober suited. The all-black aesthetic even extends to the “Viewsonic” branding on the lower bezel, making this a particularly anonymous monitor.",
    "Which isn’t to say this is an ugly or low rent option. With fairly slim bezels and an air of quality and precision which recalls IBM products of yore, the VG3448 certainly doesn’t feel cheap.",
    "As for features, the proposition is rather more mixed. The 3,440 by 1,440 resolution of the flat 34-inch panel meets expectations. However, the VA panel technology is a little unusual in this segment, especially given the productivity remit. IPS is the norm.",
    "The VG3448 likewise lacks some image quality extras that would deliver a fuller content creation remit. It does offer 10-bit color (albeit 8-bit plus FRC dithering). But little is claimed by way of color space support. Wide coverage of the likes of Adobe RGB or DCI-P3 is not part of the VG3448’s sales pitch. HDR capabilities of any kind are likewise not part of the package.",
    "Nor do you get USB Type-C support for single cable connectivity for driving the display, charging a laptop and connecting peripherals. That is a conspicuous omission, particularly as this price point.",
    "That said, Viewsonic has provided a USB 3.1 hub with two ports on the rear and a further pair on the right hand bezel. Vesa mount support is also included, though the robust stand will offer enough swivel, tilt and height adjustment to satisfy most applications.",
    "Arguably, it’s the Viewsonic VG3448’s VA panel that defines it. Where IPS has increasingly become the norm for most productivity panels at this price point, VA makes for an intriguing alternative.",
    "For the most part, it’s reasonably successful. Viewsonic claims static contrast performance of 3,000 to one, which is superior to even the very latest IPS panels, save for those with local dimming. Consequently, this is a monitor that bears comparison to many screens with low-end HDR certification - from a contrast perspective, at least.",
    "What it doesn’t offer is quite the same punch and vibrancy as the best of the IPS breed. White tones aren’t quite as clean and bright, colors not as rich or convincing. Moreover, outright brightness could be an issue depending on application. The 300cd/m2 rating will be enough for most normal office settings, but as a display for presentations and similar, it’s a little short on impact.",
    "The lack of color space profiles likewise presents limitations. There are no sRGB, Adobe RGB or DCI-P3 presets available. As a productivity display, it’s perhaps no surprise to find options like overdrive settings do not appear in the VG3448’s OSD menu, either. But it does add to an overall impression of limited configurability.",
    "That said, the default factory calibration is pretty good. Both black and white scales show no obvious signs of compression, overdrive-induced ghosting is absent, pixel response is decent and there’s no discernible input lag.",
    "The inherent utility of the 34-inch 21:9 aspect panel should also not be overlooked. If viewing and editing multiple documents, files or websites in parallel is core to your remit, then an ultrawide panel could be a huge benefit. Likewise, the VG3448’s modest 110DPI pixel pitch can work in your favor if running Windows at default DPI settings is preferable.",
    "On the other hand, if you’re looking for a high-DPI experience, this is not the monitor for you. At this price point, a wide range of 27-inch 4K models are available that get much closer to something resembling high-DPI image quality. Indeed, a decent IPS 4K monitor can be had for less money.",
    "Viewsonic’s VG3448 takes a form factor more often associated with fun and shows that it makes just as much sense for productivity. In simple terms, the VG3448 makes an interesting alternative to a dual-screen setup.",
    "For the most part, the feature set is fit for purpose. The 21:9 aspect ratio is genuinely useful for many workflows, the stand offers excellent adjustability and the USB 3 hub reasonable connectivity for desktop systems.",
    "In image quality terms, meanwhile, it’s adequate rather than excellent. Where the proposition falls down somewhat, is in the combination of price and the lack of USB-C connectivity. Shave £100 / $100 off and the absent USB-C wouldn’t be an issue.",
    "As it is, there are alternatives, such as Philips’ 346B1C, that offer an otherwise similar package for similar money, but add USB-C to the equation. All of which means the Viewsonic VG3448 remains a decent all round option, provided you can find it at a discount or if USB-C is of no benefit."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design and features",
    "10": "Performance",
    "17": "Verdict"
  },
  "links": {
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "Philips 346B1C": "https://www.techradar.com/reviews/philips-346b1c",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "applications": "https://www.techradar.com/best/best-apps-for-small-business",
    "presentations": "https://www.techradar.com/best/best-presentation-software",
    "websites": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "4K models": "https://www.techradar.com/news/best-4k-monitors",
    "workflows": "https://www.techradar.com/best/best-flowchart-software",
    "desktop": "https://www.techradar.com/news/best-business-desktop-pcs"
  }
}