{
  "source": "https://www.techradar.com/reviews/disney-plus-review",
  "title": "Disney Plus review",
  "category": "audio-visual",
  "updated": "2021-06-29T21:34:03Z",
  "author": "nick-pino",
  "summary": "The House of Mouse takes on Netflix, Amazon and Hulu",
  "verdict": "After almost a year of Disney Plus, we're pretty impressed with how it's growing, even if it's still in dire need of more adult-friendly originals. The base offering of movies is strong, though, as is the offering of 4K-ready content. How Disney Plus does long-term will largely be determined by how quickly more content comes to the service, but the good news is that the service is built on a very solid platform and, at for its paltry subscription price, is well-worth trying for yourself.",
  "pros": [
    "4K HDR with Dolby Vision",
    "Downloads available immediately",
    "Diverse original content"
  ],
  "cons": [
    "No licensed content",
    "Unknown update schedule",
    "Library could be more varied"
  ],
  "article": [
    "Disney Plus is a force to be reckoned with. Since its release last year, Disney’s streaming service offers 4K HDR streaming with dozens of shows and movies for a scant $6.99 per month (AU$8.99 / £5.99) with the ability to setup multiple profiles and download shows for offline viewing.",
    "There still isn’t quite as much content as we’d like but what’s there is enough to fill a few weeks worth of movie nights, especially if you’re a fan of Marvel movies and Pixar films. It’s fair to say Disney could've been faster with the turnaround on its bigger originals – The Mandalorian is still its biggest draw, a year later, though the live musical recording of Hamilton is a close second – but the groundwork of the platform is rock-solid.",
    "So what, exactly, can you expect in terms of content? Well, The Mandalorian aside, originals include the new series Muppets Now, the last season of animated series The Clone Wars, plus The Lady and the Tramp live-action film. You'll also find dozens of classics from The Disney Vault, and newer movies like the live-action Aladdin and The Lion King films from 2019.",
    "There’s every Star Wars film in 4K HDR, a vast majority of the Marvel movies and most every Pixar film you’d want to watch. But for every Up, Monsters Inc and The Lion King there’s a Lion King One and a Half, Davy Crockett and The River Pirates and Twitches 2. When Disney said it was going to put up its catalog, it really committed to putting up the catalog, and that means there’s a lot of filler.",
    "What we like most is that, for a single monthly fee, you watch on four simultaneous screens and save up to seven profiles on the service, making it a great plan for families looking to stretch their entertainment budgets. Moreover, re-watchable kids movies like Frozen and Moana ensure that your little one always has something to watch in a pinch, while shows like The Mandalorian and The World According to Jeff Goldblum give mom and dad something to watch, too.",
    "If you can overlook the filler and pace yourself with the great content that’s there, you’ll find the very budget-friendly Disney Plus to be a solid alternative to Amazon Prime, Netflix, Hulu, and now Apple TV Plus that will only improve as more content comes online.",
    "Disney Plus did see a Black Friday and Cyber Monday discount in November 2019 that we might see again in 2020. Stay tuned and see.",
    "Disney Plus officially released on November 12 in the US and Canada, and November 19 in Australia and New Zealand. We got Disney Plus UK on March 31, 2020, alongside versions of the service for France, Germany, Spain, and Italy. Further international launches have been rolling out across 2020.",
    "To subscribe to Disney Plus, you'll be paying $6.99/month in the US, £5.99 per month in the UK, AU$8.99 in Australia and CA$8.99 in Canada and NZ$9.99 in New Zealand.",
    "US customers have the option of a joint Hulu / ESPN+ / Disney Plus bundle for a mere $12.99 per month – the same cost as Netflix's Standard subscription – and Disney is clearly gunning for those wanting a good deal.",
    "If you need more Disney Plus pricing information make sure you check out our dedicated Disney Plus prices and sign up guide.",
    "Disney Plus is available on multiple devices and operating systems.",
    "Chrome, Firefox and even Microsoft Edge have no problem running the service, while you can get the smartphone app from the Google Play Store and the Apple App Store. Console folks aren't missing out either, with both the PS4 and Xbox One supporting the app. However, the app is not on Nintendo Switch, despite murmurs of support coming eventually.",
    "And what about TVs? The webOS platform for LG TVs has the Disney app already, while Android TVs (Nvidia Shield TV, Sony TVs, Hisense TVs) will be able to run Disney Plus too. Google Chromecast, Roku streaming devices, and Apple TV also support the app.",
    "In the UK, you can also get Disney Plus on Sky Q.",
    "As we mentioned earlier, one subscription gives you access to four simultaneous streams with seven profiles on a maximum of ten devices. During our tests we managed to use one account on multiple platforms to watch a different movie on each account at the same time, which worked exactly as you'd expect.",
    "If you've used Netflix or Amazon Prime Video before, you'll know what to expect from Disney Plus in terms of design and user interface. It's basically row after row of content, sorted by origin, streaming quality and other miscellaneous categories.",
    "The logos of Disney's five big brands can be found in a dynamic banner that directly link to movies and shows from those brands, while featured content - like The Mandalorian, The Simpsons and Avatar - all take up the top row.",
    "Under the brand banners you'll find the Originals section that highlights content exclusive to the service and, underneath that, a familiar-looking recommended row that you've probably seen on a streaming service like Netflix.",
    "As you scroll down the homepage you'll find more categories and groupings that appear to have been editorially curated by Disney - a nice touch compared to the largely programmatic catalog on Netflix. It's here you'll find shows and movies you wouldn't normally opt for and has been compared by one of our editors to opening a present on Christmas not knowing which surprise you're going to get.",
    "Should you want a tad bit more predictability, there are entire sections just for movies and shows, plus a search function to find exactly what you're looking for.",
    "It's pretty buried, but in the movies or TV show section there's a drop-down menu to select content by genre with options for Action/Adventure, Animation, Comedy, Documentary, Drama, Kids, Shorts and 4K Ultra HD.",
    "All-in-all, while nothing here is ground-breaking, the design is easily navigable and allows you to find surprises that you wouldn't have found otherwise in the smart, editorially curated rows.",
    "So what do you get in terms of content? Well, the big tent poles of the service are classic Disney films, classic animated films, throwback shows from the Disney Channel, original content (which we'll talk about next) plus shows and movies from Marvel, Star Wars, Pixar and National Geographic.",
    "The most interesting bit, obviously, is the original content as that's part of Disney's strategy to eventually overtake Netflix. At launch, there wasn't too much of the way of original content with the real standout title being The Mandalorian that's directed from former Marvel pioneer, director Jon Favreau. Other originals include the live action Lady and the Tramp re-make, High School Musical - The Musical - The Series, Encore, The World According to Jeff Goldblum, Noelle and a bunch of documentaries. There's the Pixar Spark Shorts, basically a collection of mini movies that typically air before the latest Pixar film, but only four of which weren't available elsewhere.",
    "Since launch, that's expanded to include the musical sensation Hamilton, the final season of The Clone Wars animated series and Muppets Now.",
    "Weirdly, Disney Plus also has 30 seasons of The Simpsons here, too, which could mean that Disney will use Fox's catalog of movies and shows to fill in any gaps in its programming schedule... a very good thing as the original content is still lacking big hitters right now. MCU shows like WandaVision and The Falcon and the Winter Soldier will eventually change all that, but they've been a long time coming.",
    "It's not just limited to TV shows, however, and one of the bigger draws is the monstrous movie catalog that goes as far back as the 1930s, with classics like Robin Hood or Cinderella as well as some of the modern remakes Disney's produced over the last two decades.",
    "So where's the cutoff point in terms of new shows and movies? Well, you'll find most things that are over six months old here. In 2020, movies like Star Wars: The Rise of Skywalker, Maleficent: Mistress of Evil and Pixar's Onward have helped bulk things out.",
    "Some experimentation has also occurred with big releases – the live-action Mulan skipped theaters and is available as a $29.99/£19.99 Premier Access purchase, which unlocks the movie for as long as you're subscribed to Disney Plus.",
    "As year one of Disney Plus wraps up, The Mandalorian season 2 will help keep subscribers interested ahead of those Marvel shows dropping on the service. It's fair to say, though, that originals have been a little slow in year one generally – and the service is a little too kid-focused for Disney Plus to feel like a go-to streaming destination.",
    "Potentially that's because we've been spoiled by streaming services like Netflix that have new shows and films every single week, either ones that they've made in-house or licensed from another content provider. Without adding content from additional partners, Disney Plus' content well has ran dry a few times this year, despite the addition of more and more archive content like Fox's X-Men movies.",
    "For most folks, Disney Plus will stream in HD/SDR that looks great on both big-screen TVs and smartphones alike. While that's par for the course for other streaming services, it's actually rather impressive that Disney Plus was able to pull it off considering how old some of these films and shows are, and proves that Disney has given a lot of thought to the overall picture quality of the content.",
    "Even better, a small slice of the content pie is available in 4K/HDR and Dolby Vision and is included at no extra cost. That currently includes the entire Skywalker Saga (Episodes 1, 2 and 3, included), modern animated films like Frozen and Moana, plus remastered classics like Aladdin and The Little Mermaid. Don't go in expecting over 100 titles like you'd find on Netflix, but it's a good start and shows that Disney is giving some serious thought to expanding its 4K HDR collection.",
    "The obvious caveat to the above statements are that you have a stable internet connection of around 10Mbps or more and, in the case of watching 4K content, a 4K TV that has HDR support.",
    "Unfortunately there's no way to intentionally throttle yourself if you want to save on bandwidth usage, but Disney Plus does offer offline viewing right out of the gate. That means, if you're on public Wi-Fi or at a friend's with unlimited data, you can very easily stock up on shows and movies to watch when you're back home or on a flight.",
    "The Disney Plus app lets you indicate whether you're using mobile data to stream or not. If you do, you'll have the option to stream in lower quality so your precious data doesn't instantly disappear. You'll also get the option to download movies so you can watch them on the go without wasting data. (In this case you do get different download resolutions to choose from: Standard, Average and High. A precise resolution isn't shown here either.)",
    "One small bug we've found is that the resume function isn't as reliable on Disney Plus as it is on, say, Netflix, which perfectly saves your spot in a show or film down to the second. On more than one occasion we briefly stopped watching Lady and The Tramp to take a break only for the film to start from the beginning the next time we went to play it.",
    "We'll keep an eye on this bug as we continue to use the service but it's worth noting that Disney Plus might not quite be up to par in the technology department as leading services like Netflix, which has zero issues saving your spot.",
    "Calling Disney Plus an essential streaming service feels a bit preemptive at this point – a lot of its big originals are still awaiting release, and they'll ultimately define the prospects of the services. That said, what's available here is a good opening salvo against long-standing streaming titans like Netflix and Amazon Prime, and the low price tag makes it one of the most affordable of all the services available.",
    "Because it's available at such a low price, we absolutely, wholeheartedly recommend trying the service for at least a few weeks. Between the Marvel films, Skywalker Saga in 4K and dozens of Disney classics that will personally appeal to your age group, there's enough here to keep you busy.",
    "We wish there were a few newer films, more original content and a set content schedule that includes syndicated content from other places, but for fans of the House of Mouse and cord cutters looking for their next big binge, Disney Plus provides a rock-solid foundation for a service that could one day rival Netflix.",
    "Disney Diehards: Look, if you've loved Disney your entire life, you'll probably want to subscribe to Disney Plus. It is the definitive repository for the company's work over the last 80(!) years. Going forward it will likely be the only place for Disney exclusives and originals that you won't anywhere else.",
    "Sci-Fi Fanboys: Surprising audiences with the Skywalker Saga in 4K on launch day shows that Disney is taking its Sci-Fi brands seriously. If you consider yourself a Star Wars or Marvel fan, this service will basically be the well-spring of all those franchises moving forward and is well worth your subscription dollars.",
    "Big Time Bingers: If you know that you're a BIG binge-watcher capable of chewing through Netflix series in a few days, Disney Plus probably won't keep you entertained for very long. The catalog, while certainly vast, only has a few dozen really great shows and movies for each age group. With no way of telling how soon more content will be added, you could very easily find yourself without something to watch in the next two weeks.",
    "Talk Show, Sitcom and Sports Lovers: The Disney Vault is wide and deep, but it doesn't contain many talk shows, sitcoms or sports documentaries. It's good, then, that Disney can be bundled with Hulu and ESPN+ in the US to fill that gap, but for other countries, this lack of specialized content could be a real deal-breaker.",
    "Jarno Stinissen, Bram Lodewijks and Henry St. Leger all contributed to this review."
  ],
  "headers": {
    "0": "The Two Minute Review",
    "7": "Disney Plus release date and cost",
    "11": "Disney Plus app: which devices support it?",
    "16": "Design and user interface",
    "23": "Content library",
    "32": "Quality and viewing experience",
    "39": "Verdict",
    "42": "Who's it for?",
    "44": "Who's it not for?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Marvel movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Star Wars": "https://www.techradar.com/news/star-wars-on-disney-plus-all-the-shows-movies-and-lightsabers-youll-need",
    "Amazon Prime": "https://www.techradar.com/reviews/amazon-prime-review",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Hulu": "https://www.techradar.com/reviews/hulu",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Disney Plus UK": "https://www.techradar.com",
    "AU$8.99 in Australia": "https://disneyplus.bn5x.net/OJNar",
    "NZ$9.99 in New Zealand": "https://disneyplus.bn5x.net/OJNar",
    "$12.99 per month": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-6761782674651893000&sharedId=trd-us&u=http%3A%2F%2Fwww.disneyplus.com%2Fwelcome%2Fbundle",
    "Disney Plus prices and sign up": "https://www.techradar.com/deals/disney-plus-price",
    "available on multiple devices and operating systems": "https://www.techradar.com/news/disney-plus-will-land-on-apple-tv-xbox-one-and-everything-else-you-can-think-of",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "murmurs of support coming eventually": "https://www.techradar.com/news/disney-set-to-come-to-nintendo-switch",
    "LG TVs": "https://www.techradar.com/news/lg-tv-2021",
    "Nvidia Shield TV": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "Sony TVs": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "Hisense TVs": "https://www.techradar.com/news/should-i-buy-a-hisense-television",
    "Google Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "The Mandalorian season 2": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far"
  }
}