{
  "source": "https://www.techradar.com/reviews/eweka",
  "title": "Eweka review",
  "category": "computing",
  "updated": "2021-01-21T16:05:16Z",
  "author": "desire-athow",
  "summary": "Independent server farms with excellent retention and completion rates",
  "verdict": "A refined Usenet provider with impeccable experience in the sector, Eweka performs well but doesn't offer anonymous registration or payment options.",
  "pros": [
    "Unlimited GB Free Trial",
    "High-completion servers",
    "Lengthy 4,532+ days retention",
    "Fast download speeds",
    "SSL included at no additional cost",
    "Free newsreader with search"
  ],
  "cons": [
    "No Bitcoin support",
    "No VPN"
  ],
  "article": [
    "Getting started with Usenet newsgroups can be a bit daunting for newcomers. One option is to find a selection that gives you everything you need, including a newsreader app, with simple payment options. Eweka has a good reputation, so let's see how it delivers.",
    "Despite Usenet being popularly considered part of the \"old internet\" predating the Web 2.0 era, there are enough providers of newsgroup access to make it a crowded market.",
    "Registered in 2000, Eweka is one of the oldest Usenet providers still around. It claims to have been the \"number one Usenet provider in the Netherlands since 2001.\"",
    "Eweka's experience shows, with sign up via a polished website providing access to a complete set of options in the members' area.",
    "Like many others, this provider is based in the Netherlands. It provides a newsreader, NewsLazer, which is almost identical to the NewsHosting Newsreader app.",
    "Eweka promises secure, unlimited downloads. All plans provide unlimited access with 256-bit SSL connections. Eweka also recently upgraded to 50 connections (previously 20) and unlimited download speeds (previously 300 Mbps), so any user should be able to fully max out their ISP bandwidth speed from Eweka’s Usenet archive dating back 4,532+ days.",
    "Features are limited for some price plans, so you'll need to choose the right package for your requirements. However, you can pay monthly, annually, six monthly, or quarterly with the subscription package, and numerous payment methods are available.",
    "The NewsLazer app is recommended by Eweka, although you can use other newsreaders. This is simple enough to use and offers the ability to add backup Usenet providers. Note that the app will not work without NewsLazer credentials, however.",
    "If you run into difficulty using the service, Eweka offers a 24/7 professional support. Agents fluent in Dutch, English, German, and French are available for assistance. There is also a detailed support section with an FAQ, a service status page, and contact details.",
    "Do you want a Usenet service who only provides five or six years' worth of newsgroup data? Or one that reaches far into the past, providing binary uploads and text discussions dating back two decades?",
    "Retention is the key factor for a complete Usenet experience, and Eweka provides a stated 4532 days retention. Additional storage is also regularly added to grow retention day by day so no articles are expired from their servers. Eweka’s current retention period is equivalent to over 12 years' worth of activity. That means that you can view text conversations that took place back in 2008 and download binaries that were posted since that time. This is an incredible volume of data, making Eweka one of the largest archives of Usenet data available.",
    "Usenet providers offer 256-bit SSL connections via newsreaders to their servers. Eweka follows this trend, which ensures data downloaded or uploaded is sent over an encrypted and trusted connection.",
    "However, privacy options with this Usenet provider are limited. While you can sign up with just an email address and country location, there is no option to pay for the service using Bitcoin or another crypto currency.",
    "Happily, the Eweka Privacy Policy is clear when it comes to logging your activity. This states: \"We do not monitor which newsgroups you post to or download from or what you put in news articles that you post.\"",
    "Other logging is stored, however, such as access to your account, and metering based on the chosen package. The full privacy policy is worth reading so that you understand how your data is used. Full GDPR adherence policy is also listed.",
    "Speed is another key aspect of Usenet services; the faster, the better. Less time is spent downloading binaries, more time enjoying the unpacked media files.",
    "Eweak was tested following a speed confirmation using Ookla’s Speedtest. This rated the connection (via a Dutch VPN) at 58.10Mbps. Two files were tested: one a 540MB audio collection uploaded the previous day; the other a 700-day old video file of 1.4GB.",
    "Both binaries downloaded at around 5.2Mbps, peaking at 6Mbps. For clarity, that means the video file downloaded in just over 3 minutes.",
    "As such, Eweka provides an incredibly fast Usenet experience.",
    "Eweka offers subscription and pre-payment packages with one, three, six, and 12-month deals. There is no contract, so you can cancel at any time. Payment is via credit card, PayPal, iDEAL, Mistercash, Giropay, and bank transfer. Netherlands residents can also buy a day's access via SMS.",
    "The Standard prepaid package is just €7.50 a month (around £6.77 or $8.82) with 200Mbps speed limit, 20 simultaneous connections, SSL, and the full 4532 days retention.",
    "Eweka also lists a faster prepaid option, High-Speed prepaid, at €9.60 a month (equivalent to £8.67 or $11.29). This offers 300Mbps downloads, 20 connections, as well as SSL and full retention.",
    "A standard subscription is available from as little as €7.00 a month (£6.32 or $8.23) for a 12-month subscription (€7.50 a month if paying monthly). This has unlimited downloads, unlimited download speeds, 50 connections, SSL, full retention, and comes with a 7-day free trial with unlimited downloads and unlimited speeds.",
    "Given the unlimited download speeds, retention and completion rates, Eweka offers one of the best value Usenet subscriptions around.",
    "It is difficult to find a Usenet provider that ticks all the boxes. Some offer a low price with low retention; others have a great price but poor service, sluggish speeds, and a general feeling of \"we'll take your money.\"",
    "Eweka, as its legacy suggests, is one of the better services. With lightning fast downloads, impressive retention and completion, and a stringent privacy policy, it also offers a status page so you can check if the service is offline. While it doesn't offer Bitcoin payment, Eweka gives you everything you need for fast and reliable newsgroup access.",
    "The cookie cutter nature of the recommended newsreader client is something of a surprise, but otherwise Eweka is worth considering as your primary Usenet service.",
    "(Official Promotion) Get unlimited GB free trial + 27% lifetime discount"
  ],
  "headers": {
    "5": "Features",
    "9": "Retention",
    "11": "Security and privacy",
    "15": "Performance",
    "19": "Pricing",
    "24": "Final verdict"
  },
  "links": {
    "Usenet": "https://www.techradar.com/best/best-usenet-providers",
    "Eweka": "https://www.eweka.nl/en/best-usenet-provider/?a_aid=58ac3d49df14c&a_bid=79a4f7d0&chan=ewr",
    "Privacy Policy": "https://www.eweka.nl/en/privacy-policy",
    "Speedtest": "http://www.speedtest.net/",
    "Standard prepaid package": "https://eweka.nl/en/best-usenet-provider/?a_aid=58ac3d49df14c&a_bid=79a4f7d0&chan=ewr",
    "High-Speed prepaid": "https://eweka.nl/en/best-usenet-provider/?a_aid=58ac3d49df14c&a_bid=79a4f7d0&chan=ewr",
    "standard subscription": "https://eweka.nl/en/best-usenet-provider/?a_aid=58ac3d49df14c&a_bid=79a4f7d0&chan=ewr",
    "(Official Promotion) Get unlimited GB free trial + 27% lifetime discount": "https://eweka.nl/en/best-usenet-provider/?a_aid=58ac3d49df14c&a_bid=79a4f7d0&chan=ewr"
  }
}