{
  "source": "https://www.techradar.com/reviews/steelseries-rival-3",
  "title": "SteelSeries Rival 3 review",
  "category": "computing",
  "updated": "2020-02-28T22:27:00Z",
  "author": "sam-desatoff",
  "summary": "Cheap, but still good",
  "verdict": "SteelSeries has built a new budget-friendly sensor for the Rival 3, and packed the peripheral with a feature set normally reserved for higher-end devices. The result is an impressive device and comes with a handful of minor flaws.",
  "pros": [
    "Great price/feature ratio",
    "Awesome lighting options",
    "Satisfyingly hefty click"
  ],
  "cons": [
    "Lift-off can result in cursor jiggle",
    "A bit small",
    "Not ambidextrous despite symmetrical design"
  ],
  "article": [
    "The Steelseries Rival 3 enters the crowded budget gaming mouse market. The newest entry in the Rival line of mice--which ranges from the competitively priced 310 to the luxury-forward 710 – the Rival 3 is by far the least expensive of the bunch, priced at just $30 (£23.50, AUS$46). That doesn’t mean it falters on design and performance, though. In fact, the Steelseries Rival 3 may just be one of the best budget gaming mice we’ve used in some time.",
    "The Steelseries Rival 3 sports a six-button configuration on an ambidextrous body. Unfortunately, lefties will be disappointed, as only the left side of the unit has buttons on it. This is a bit confusing as the mouse is already symmetrical--adding thumb buttons on only one side feels like SteelSeries went out of its way to alienate left-handers here.",
    "Aside from that disappointment, the mouse feels decent in the hand, if a tad small. The claw and fingertip grips are the most comfortable here; the body is probably a bit too cramped for users of the palm grip and those with bigger hands.",
    "That said, the placement of the side buttons is ergonomically comfortable--perfectly in range of the thumb while using the claw grip, but easy to avoid accidentally clicking them. The DPI switch on top is also small enough to be out of the way without having to fumble for it.",
    "Weighing in at only 77g, the Steelseries Rival 3 is rather lightweight. Weight is most definitely a matter of preference when it comes to gaming mice, but we wish there was a bit more heft here. The scroll wheel is low profile and rubberized, but it could stand to have a bit more resistance in the scroll step. This is admittedly a very minor quibble, but it can be noticeable during particularly heated gaming, like when you’re switching weapons and you accidentally scroll past your target. Elsewhere, clicks feel substantial and hefty, which speaks to SteelSeries’ focus on durability.",
    "The matte finish is nice, and feels good in the hand. We did notice some fingerprint smudging pretty early on, though. It was fairly light, but we could see this becoming an issue over time as the device sees more use. Elsewhere, SteelSeries has made some great ergonomic design choices, with nice concave sides that guide your thumb to its most comfortable resting place.",
    "Bar none, the standout feature of the Steelseries Rival 3 design is the lighting. Where other similarly-priced mice might exclude RGB lighting for the sake of hitting a budget price point, SteelSeries has doubled down on it. The logo on the palm of the mouse lights up, but the real star of the show is the light bar lining the bottom edge of the mouse. The whole display lends a sort of floating effect that is rather striking, especially in dimmer lighting. After setting the illumination options to ColorShift in the SteelSeries Engine software, we often found ourselves outright distracted by the show.",
    "The Steelseries Rival 3 is built around SteelSeries’ TrueMove Core, which is a low-tier optical sensor designed specifically for this mouse. The DPI range of 10 to 8,500 is not as substantial as some of the more high-end mice out there, but it’s hard to complain about that considering the price point here. Besides, the TrueMove Core still sports 1-to-1 tracking.",
    "While the sensor performs admirably, we did experience some issues regarding lift-off distance during some matches of Apex Legends. The cursor jiggle that accompanies lifting the unit to shift its position on the mousepad was a bit more pronounced than we anticipated, which resulted in a few missed shots.",
    "The bottom of the mouse contains a few smooth-gliding feet, which allow the device to slide across the mousepad with ease. The Rival 3’s glide is incredibly satisfying, made even more so thanks to the 1-to-1 tracking of the sensor.",
    "In the SteelSeries Engine 3 software, you can adjust the Rival 3’s polling rate and set the DPI stages available for you to click through via the switch button on the face. The lighting options are surprisingly robust as well, allowing you to set your preferred colors and transitions across three separate lighting zones. In all, the customization is surprisingly robust for a mouse in this price range.",
    "It’s disappointing that the Steelseries Rival 3 isn’t truly ambidextrous, especially when SteelSeries has already done most of the legwork in building a symmetrical design. The Steelseries Rival 3 was already most of the way there; why not add a couple more thumb buttons on the right side?",
    "In all, though, the SteelSeries Rival 3 is an impressively full-featured mouse with a few minor caveats that were made in the name of hitting a low price point. It’s hard to complain about some of the shortcomings when you stop to consider the overall package: good ergonomics, a satisfying click, and some truly-impressive lighting, all offered at a great price of $30 (£23.50, AUS$46). The Rival 3 is definitely worth a look if you’re after a budget gaming mouse."
  ],
  "headers": {
    "1": "Design",
    "7": "Performance",
    "11": "Final verdict"
  },
  "links": {
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "competitively priced 310": "https://www.techradar.com/reviews/steelseries-rival-310",
    "luxury-forward 710": "https://www.techradar.com/reviews/steelseries-rival-710"
  }
}