{
  "source": "https://www.techradar.com/reviews/viewsonic-m2-full-hd-portable-projector",
  "title": "ViewSonic M2 Full HD LED Portable projector review",
  "category": "pro",
  "updated": "2020-06-15T09:06:00Z",
  "author": "nick-rego",
  "summary": "Projection made easy",
  "verdict": "What holds the ViewSonic M2 projector back is its annoying motion smoothing and middling software. Yes, it’s easy to setup and get running, but if the viewing experience isn’t worth it, then why bother?",
  "pros": [
    "Loud speakers",
    "Easy to set up",
    "Good connectivity options"
  ],
  "cons": [
    "Permanent motion smoothing",
    "Fiddly UI",
    "Questionable app store"
  ],
  "article": [
    "Projectors are certainly a handy way to enjoy movies or gaming from a whole new angle. Whether you’re looking to set one up permanently in your living room or just want something portable to move around a business location (pandemic permitting of course), there are a number of options available depending on your requirements and budget.",
    "The ViewSonic M2 Full HD Portable projector is certainly in the latter, allowing you to easily set up a projection space wherever you please. It’s compact enough to carry around where you need it, and automatically adjusts itself in a few seconds once it’s booted up.",
    "The M2 is available now, and is priced at $720 (£576.10, AU$1,058).",
    "While most projectors are massive white boxes, the M2 takes on a more subtle approach. A black and dark brown plastic square is what you’ll get here, measuring just an inch wider and taller than a Mac Mini.",
    "At the front you have the projection lens, which unfortunately isn’t protected by a lens cover in any way, so you’ll have to be extra careful when moving this projector around (thankfully there’s a soft carry case included). There are also a number of hidden sensors here that help the projector to focus, as well as a nifty feature called ‘Eye Protect’. If for some awkward reason someone decides to try and stare into the projector lens or an object comes too close, the image will temporarily shut off.",
    "There’s also an adjustable foot at the front which lets you easily set the angle of projection if the M2 is set up on a flat surface. It’s fairly stable, however we noticed that when we were trying to plug a cable into the M2 while trying to keep it steady, we inadvertently would press down on the unit and collapse the foot.",
    "The M2 offers connectivity via Wi-Fi, but it’s through an external USB dongle. Thankfully, this dongle has a dedicated compartment located underneath the projector, so you can simply plug it in and forget about it. It’s odd that ViewSonic didn’t just build the Wi-Fi directly into the device, but it’s a small point to worry about when they provide the dongle in the box as well as a dedicated compartment to house it in.",
    "You’ll be pleased to know that once connected to Wi-Fi, you can quickly stream directly to the projector from your Android, Windows, Mac, or iOS device. The M2 supports both Chromecast and AirPlay technologies, with the only observation is that certain Android smartphones can natively cast to the M2, while others have to do so via the Google Home app.",
    "Apart from wireless projection, there are some standard connectivity options available at the back. There’s a full-sized HDMI port to connect a laptop or games console, as well as a USB-C port for connecting to newer laptops or smartphones. You can also use the USB-C port to connect a power bank and power the projector that way as well.",
    "A USB Type-A port is also available to browse a USB drive for content, along with a 3.5mm audio port to connect headphones or an external speaker. Finally, there’s also a microSD card port, but we ran into a few issues with the projector reading certain high-capacity cards, as well as those formatted as NTFS. Finally, there’s a tripod mounting screw at the base if you’d like to set this up on a sturdy tripod, as well as the ability to use a standard projector mount if you’re hanging this from the ceiling.",
    "Bundled with the M2 is a slim remote which feels a bit cheap in your hand. There are no labels for any of the buttons, and the controller doesn’t light up in the dark, so expect plenty of fumbling when trying to locate this. There are sadly no controls on the projector itself, so you’ll always have to carry the remote with you in order to use the projector properly.",
    "One of the great features of the M2 is its quick ability to auto focus once it’s been turned on. Just wait for a few seconds for the test image to come into focus, and you can start enjoying your content. You can get an 80” screen at a projection distance of about 2 meters, which is a decent size – of course going even bigger with this will start to degrade the image brightness and quality a bit.",
    "Keystone correction is also automatic, so even if you’re placing the M2 at an awkward angle, you can make enough adjustments to make the image look decent. Of course, for optimal viewing you’ll want to keep the projector facing straight ahead, but it’s understandable that this isn’t always possible.",
    "Because this is an LED projector, don’t expect very stunning images, especially if there’s plenty of ambient light around. You’ll get the best quality in a very dark room, as otherwise images can appear fairly washed out, and colors don’t quite come though very clearly.",
    "In the right conditions however, the M2 does a fairly acceptable job of being a good projector for enjoying movies at home. While you’ll occasionally struggle with scenes with lots of blacks, overall there’s not much here to complain about, given the specifications of this projector.",
    "A very odd feature that we have to point out is that the M2 seems to have a permanent motion smoothing, and there doesn’t seem to be any way to turn this off in the settings. So no matter if you’ve connected a source directly, watching content off a USB, or wirelessly casting, the motion smoothing is always turned on.",
    "For some people, this won’t be too much of a bother, but when you’re watching cartoons or older classic films, the sped-up frames look very awkward and unnatural.",
    "For those still watching 3D content in 2020, the projector does offer the ability to view 3D Blu-rays or other content when paired with either ViewSonic or other third-party compatible 3D glasses.",
    "Gaming on the M2 was quite decent, but the motion smoothing will certainly irritate you in games that rely heavily on soft animations and bloom effects to convey atmosphere. Overwatch played absolutely fine, but playing Tomb Raider was a bit more broken as the projector sought to overcompensate for some animations.",
    "The UI is another area where the M2 is a mixed bag. The OS is a variant of Android, so it’s not quite as polished. As a result, navigating around menus can be a bit of a pain, and the main interface isn’t evenly organized either.",
    "Since it’s not a proper version of Android, there’s no access to the official Google Play store for apps, but you do have access to the Aptoide store instead. There’s a mix of things available here such as Netflix, Amazon Prime, and other apps, but again it’s not always a smooth experience. YouTube for example isn’t available – you have to download an app from the store that then side-loads the YouTube app instead, so it’s all really long-winded.",
    "The apps also quite regularly freeze up or fail to launch properly, so if you’re attempting to watch content directly thru any of the apps, you won’t always have a great experience.",
    "Another niggling fact about the M2 is that it doesn’t automatically detect when a source is plugged in. You have to manually select which source you want using the remote – we wish that the projector would at least automatically offer a prompt that a new source was detected, but perhaps we’ll see this in a future update.",
    "Apart from controlling the projector with the included remote, you can also download an app to control the projector via your smartphone, provided both devices are on the same Wi-Fi network. There are also skills available for Google Home and Amazon Echo to control the projector via your voice, if you fancy.",
    "Audio is powered by two 3W speakers customized by harman/kardon. The volume is quite loud, but as with a projector of this size, the audio quality itself is not that great. Thankfully you can connect a speaker or headphones via cable or Bluetooth for a more immersive audio experience, but if you’re not too stressed over the audio sounding a little bit tinny, then the built-in speakers will work just fine.",
    "The ViewSonic M2 Full HD Portable projector is a handy one to set up almost anywhere you like, and as long as lighting conditions are good, you’re in for a decent viewing experience. Movies, presentations or TV shows are easy to enjoy with the built-in speakers and apps, and the ease of setup is a definite bonus.",
    "Two of our biggest complaints come from the permanent motion smoothing and the dreary UI. The motion smoothing will really irritate you if you’re watching content that isn’t made to run at high frame rates, while the UI and finicky apps (and app store) make it easier to just permanently connect your laptop to the projector instead."
  ],
  "headers": {
    "2": "Price and availability",
    "3": "Design",
    "11": "Projection Quality",
    "19": "UI and Audio",
    "25": "Final verdict"
  },
  "links": {
    "Projectors": "https://www.techradar.com/best/4k-projector",
    "portable to move around": "https://www.techradar.com/news/best-portable-projectors"
  }
}