{
  "source": "https://www.techradar.com/reviews/hostnoc",
  "title": "HostNoc review",
  "category": "computing",
  "updated": "2020-11-13T20:30:03Z",
  "author": "mirza-bahic",
  "summary": "Is this young Canadian web host the right choice for your website?",
  "verdict": "HostNoc offers various well-rounded and customizable hosting solutions to customers throughout the world at attractive prices.",
  "pros": [
    "24/7 security monitoring",
    "Customizable plans and options",
    "Daily backups and free migrations",
    "No setup fees",
    "Pretty helpful knowledgebase"
  ],
  "cons": [
    "No free domain name",
    "Main website needs a little improvement",
    "There is no information on data center locations"
  ],
  "article": [
    "HostNoc is headquartered in Ontario, Canada, but has offices in the US, the UK and the UAE as well. It has been serving individual customers and businesses of various sizes all over the world. Being founded in 2016, HostNoc is a rather young company, and yet it managed to become one of the more popular web hosting options out there. Next to basic shared hosting, they offer cloud hosting, VPS and dedicated servers, all packed with numerous features and first-rate cyber security.",
    "HostNoc’s main website features a nice-looking intuitive interface and feels user-friendly at first, but fails to provide more relevant information about the host itself. In addition, information on locations of HostNoc’s data centers are not available at the moment. There are a decent number of languages to choose from, but the translation is only partial, so the users who are not familiar with the basics of English language at least may feel slightly deceived.",
    "On the other hand, HostNoc has an official blog and a pretty good one to boot. You’ll be able to search the blog using the search box, or browse articles sorted by date of publication or by topics. In addition, the archive is also available, in which all the articles are classified by the month of their publication. The oldest one dates back to August of 2018, so we can safely conclude that’s the time the blog was created. These articles appear to be informative enough and the blog seems to be updated on a weekly or biweekly basis at the very least.",
    "When it comes to social networks, HostNoc is present on Facebook and Twitter and both accounts appear to be active.",
    "HostNoc’s pricing system appears to be pleasingly transparent. Users are able to choose between a few pre-made plans (their number depending on a hosting type) or create a custom plan, whichever suits their needs. With shared hosting plans, as an example, the price will vary depending on whether you choose Windows or Linux as an operating system. The Windows Essential shared hosting plan packs more extra features, so it will cost you a bit more.",
    "It is important to note that HostNoc frequently offers hosting at discount prices that go up to 50% of the original price. Even though there is no free trial, the money-back guarantee is valid for 30 days after the purchase, so you’ll have enough time to make a final decision.",
    "As for paying methods, HostNoc accepts credit cards and PayPal.",
    "The plan you choose will appear in the View Cart section, where you’ll be able to go through all the specifications and details before proceeding to checkout. Before that, if you want a new domain name, you can check its availability and add it to the cart as well. It’s necessary to note that the price for a new domain, although reasonable, will be calculated for the whole year.",
    "Before finalizing the purchase you’ll be required to add your personal information (albeit pretty regular ones), generate a password and select a paying method. In addition, you may leave any further notes related to your purchase and choose if you want to join HostNoc’s mailing list.",
    "The shared hosting plan will provide its users with a standardized control panel: Plesk for the Windows users and cPanel for Linux. If you have any prior experience with either of these, you’ll have no trouble finding your way around. Even with unmanaged plans, the script installation is automated, and by using Softaculous, you’ll be able to install software like WordPress, Joomla, Magento, Drupal and Prestashop, among others, with a single click.",
    "Websites you need to host are run on SSD storage which is supposed to offer top-notch performance. Failures and breaches involving data stored on disks should be prevented by the provided RAID configuration. To offer additional safety, the provider will give you around-the-clock infrastructure for monitoring paired with security mechanisms that feature antivirus protection and a shield against DDoS attacks.",
    "As reported by the speed test run through GTmetrix, HostNoc should offer a reasonably good service, at least judging by their main website. It took 10.2 seconds to fully load the page which doesn’t look too good in comparison to an average of 8.1, but it’s nothing too extreme. Additionally, the loading of the site required mere 39 requests which looks outstanding compared to an average of 89. In conclusion, GTmetrix rated the speed of HostNoc’s official website with an A (93%) which is an excellent result, especially when compared to the average grade, which is C (77%).",
    "As expected, HostNoc offers an uptime guarantee of 99.9%. During our uptime test of their main website which ran for two weeks, we did not manage to record any downtime at all. However, there were a few oscillations in response time, but nothing worth worrying about.",
    "If you get stuck somewhere along the way, you can always consult HostNoc’s first-class and well-documented knowledgebase which will provide you with thorough step-by-step guides and solutions for issues you may encounter, pictures included. From there, you are able to search the knowledgebase with the help of the search box, by one of the categories, or by selecting one of the most popular articles (if the issue you have is a common one).",
    "However, to enter HostNoc’s knowledgebase you need to be a registered user, which may be a reasonable decision on their part, but doesn't seem to be a necessary one.",
    "As an alternative, you are able to contact HostNoc’s customer support via telephone, live chat, ticket, e-mail or online contact form. The support is available round-the-clock and is responsive once you are registered on the website.",
    "At the moment, HostNoc doesn’t appear to have a support forum.",
    "When comparing the two, the first difference you’ll notice is that Tsohost is a UK-based provider while HostNoc’s main office is in Canada. Both offer a whole variety of options and customizations at budget-friendly prices, with plans often offered at a significant discount. However, Tsohost throws a free domain name in the bundle, while HostNoc doesn't.",
    "When it comes to being beginner-friendly, both HostNoc and Hostgator both pass the test without any doubt. They offer good value for a quite affordable price and have enough hosting options for most customers. At the same time, each Hostgator’s plan includes a free website builder which might be decisive for some users.",
    "Similar to HostNoc, Certa Hosting provides relatively cheap hosting options with a wide range of features and a 30-day money-back guarantee. Another similarity they share, and not a good one, is not providing any information regarding the location of their data centers.",
    "Bluehost is another big competitor to HostNoc, offering everything HostNoc does and even more at pretty much the same prices. In addition, Bluehost offers a free SSL certificate with all of its plans to ensure the safety of visitors to your site, which is a good thing to have.",
    "HostNoc claims their goal is to lower the burden on their customers while providing them with maximum service at a budget-friendly cost. Based on what we saw, we can conclude with certainty that they are well on their way to achieving that. Although they offer a good value for money (particularly for small to medium-sized businesses), some aspects of their offer as well as their main website could be improved. If you are not sure if HostNoc is the right choice for you, you can’t go wrong with Hostgator or Bluehost as more than suitable alternatives."
  ],
  "headers": {
    "4": "Plans and pricing",
    "7": "Ease of use",
    "11": "Speed and experience",
    "13": "Support",
    "17": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "HostNoc": "https://shareasale.com/r.cfm?b=1288247&u=1338591&m=84571&afftrack=trd-us-1116254371391086000&urllink=https%3A%2F%2Fhostnoc.com%2F",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Essential": "https://shareasale.com/r.cfm?b=1288247&u=1338591&m=84571&afftrack=trd-us-9805571975804146000&urllink=https%3A%2F%2Fhostnoc.com%2Fweb-hosting%2F",
    "Tsohost": "https://www.techradar.com/reviews/tsohost",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Certa Hosting": "https://www.techradar.com/reviews/certa-hosting",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}