{
  "source": "https://www.techradar.com/reviews/amazon-echo-link-amp",
  "title": "Amazon Echo Link Amp review",
  "category": "audio-visual",
  "updated": "2020-09-25T11:07:59Z",
  "author": "steve-may",
  "summary": "An ultra-basic Hi-Fi product that will disappoint the audiophile crowd",
  "verdict": "Amazon wants to reinvent streaming audio with its stripped-back Echo Link Amp music system, but it's all form and little function. Music sounds woefully un-dynamic and the system can only support one component at a time. For now, Amazon’s Echo Link Amp comes off as more of a lifestyle solution than a credible Hi-Fi product.",
  "pros": [
    "Minimalist design",
    "Works with the Alexa ecosystem"
  ],
  "cons": [
    "Limited power output",
    "Woefully un-dynamic",
    "No Bluetooth aptX",
    "No Alexa onboard"
  ],
  "article": [
    "Having revolutionized the world of wireless speakers with its personal assistant, Amazon is widening its audio ambitions to include stereo Hi-Fi systems. It’s a logical development, given the shift to subscription music services, and makes perfect sense as part of a larger game plan for its Amazon Music platform.",
    "The Echo Link Amp heads a tentative two part line, supported by the standalone Echo Link - a downsized iteration sans amplification, for those looking to augment their existing sound system with a media streamer.",
    "But does Amazon have the audio chops to succeed in the brutally competitive arena of Hi-Fi amplifiers? Here's what we found.",
    "[Update: The Amazon Echo range of smart speakers have been given a huge aesthetic upgrade as part of Amazon's 2020 event – the all-new Echo speakers sport a strange, spherical design that look quite unlike any Echo speakers we've seen before.",
    "There was no mention of a new Amazon amplifier, but there was plenty to get excited about at the Amazon event, with everything from flying drones to a new games streaming service called Amazon Luna. Check out our guide to everything that was announced at the Amazon 2020 event for the lowdown on all the new tech.]",
    "In spite of its audiophile-grade ambitions, the Amp looks like an Amazon product. It ships in a characteristically neat product box, all-black compartments and moulded cardboard and the instructions are predictably sparse.",
    "While other companies might opt for a grandiose exterior, the Echo Link Amp's facade is unrepentantly minimalist, offering only the bare essentials: a central volume knob and offset 3.5mm headphone jack. And while you might expect Amazon to mark up this product, there’s no corporate branding at all.",
    "Barely bigger than a games console, at 217 x 242 x 86mm, it’s really easy to accommodate in or on your entertainment console. As it doesn’t have a large footprint, it certainly won’t dominate a room, which could win it fans. The top lid is perforated, while top edges are rolled for a fashionable curve.",
    "The rear panel is rather busier. In addition to a pair of substantial loudspeaker binding posts suitable for banana plugs or bare wire, there are coaxial and optical digital inputs, stereo analogue phonos and a subwoofer output.",
    "It’s worth noting that while this is a reasonable selection of inputs, the Echo Link Amp can only support one component at a time, and will switch automatically. The hierarchy of input choice goes: Streaming, Bluetooth, Optical, Coaxial and analogue phono. What that means is that if you're looking to keep multiple sources connected simultaneously with plans to freely switch between them, this isn’t a system we’d recommend.",
    "Dual band Wi-Fi is on board, but there’s also Ethernet support. Trying not to be noticed is the Alexa Action button (pictured further below).",
    "You could conceivably hook up a CD or Blu-ray player, but that rather rails against the overall raison d'être of the system. More likely you’d pop the Echo Link Amp beneath a TV and run an optical lead from the screen, allowing the system to double as a TV upgrade when paired with a decent system.",
    "No speakers are supplied, but you’d typically partner it with a modest pair of bookshelf speakers. That said, Amazon’s setup video suggests a variety of loudspeaker designs would be suitable, including in-wall. (Power output is rated as 2x 60w into 8 Ohms.)",
    "Setup will be familiar to anyone that’s installed an Amazon Alexa product, although usability is actually quite different.",
    "The amp itself invites you to download the Alexa app, but if you’re already in the club it’s just a matter of adding the device.",
    "As the Echo Link Amp doesn’t have a built-in microphone, it needs partnering with a voice enabled Echo device to respond to commands. Alternatively, you can use the app. Neither are wholly satisfactory.",
    "To make matters worse, there’s no remote control either, obviously because Amazon thinks we’re all about voice and apps these days - although, as it transpires, a little zapper wouldn’t go amiss. Hands down the simplest way to use the system is by Bluetooth streaming from a mobile device.",
    "OK, so here’s what we like about the Amazon Echo Link Amp: it’s properly stereophonic. It presents a wide soundstage and does a reasonable job keeping musical instruments spatially apart.",
    "If you’ve spent the last few years listening to music from monophonic active speakers or over headphones, you’re in for a nice surprise... but, if you already have a stereo music system, you’ll doubtless be less impressed.",
    "While the system has clarity, it’s not a gutsy performer. Indeed, that 2x60W power rating seems a little optimistic. There’s scant sense of extended dynamics (Bob Marley’s ‘Turn your lights down low’ rewards more than it would on an Echo, but there’s no substantial depth) and the system is bass-light.",
    "Speaking of bass, in a strange twist of events, you can't even pair this with the Amazon Echo Subwoofer as they're not compatible.",
    "Speaking technically, when it comes to componentry, Amazon will only say that the DAC in play here is a 24bit/192kHz improvement over that typically found in its Dot, while optical inputs are limited to 96kHz.",
    "On the wireless side, the Amp doesn’t support Bluetooth aptX, and in terms of performance sounds at its best with Wi-Fi delivered streams. Listening to some raucous rock ‘n’ roll courtesy of The Struts sounds muddled over Bluetooth, compared to audio over Wi-Fi which has greater clarity and far more energy.",
    "The catch is that the slightly convoluted relationship between the amplifier and the Alexa ecosystem means that many users will simply opt for Bluetooth as a default... which, again, really isn't the best way to listen to your music.",
    "This shortfall in punch and liveliness becomes all too evident when connecting an optical feed from a TV. It’s fine for game shows and general conversation, but an action movie will quickly confirm the Echo Link Amp’s lack of attack and monotonous tone.",
    "Spin through Solo: a Star Wars Story and you can’t escape the lack of slam in the action scenes. While the delineation of dialogue and soundtrack detail is certainly good, the Echo amp really doesn't have the muscle to power Han's various space jalopies.",
    "The basic simplicity of a streaming audio system clearly has broad appeal, but Amazon’s Echo Link Amp comes off as more of a lifestyle solution than a credible Hi-Fi product. It also lacks the core smart appeal of the Alexa family as it requires a separate Alexa speaker and is hampered by a limited feature set.",
    "If you want a stripped back stereo music system, an Onkyo A-9010 stereo amp coupled to an Amazon Echo Dot would be a much more rewarding musical proposition and significantly cheaper, too."
  ],
  "headers": {
    "5": "Design",
    "11": "Setup",
    "17": "Performance",
    "26": "Final verdict"
  },
  "links": {
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "all-new Echo speakers sport a strange, spherical design": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Amazon Luna": "https://www.techradar.com/news/amazon-luna",
    "everything that was announced at the Amazon 2020 event": "https://www.techradar.com/news/everything-from-the-amazon-2020-event-new-echo-speakers-flying-ring-security-cameras-and-amazon-luna",
    "bookshelf speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "Amazon Echo Subwoofer": "https://www.techradar.com/news/amazon-echo-sub-release-date-price-news-and-features",
    "Amazon Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review"
  }
}