{
  "source": "https://www.techradar.com/reviews/smeg-blf01pbuk-blender-review",
  "title": "Smeg BLF01PBUK review",
  "category": "appliances",
  "updated": "2021-05-25T11:29:15Z",
  "author": "emily-peck",
  "summary": "This 50s retro-style blender is a handy kitchen companion",
  "verdict": "With a 1.5-litre Tritan BPA-free jug and compact design, the BLF01PBUK blender will sit neatly on your worktop and boasts statement style.",
  "pros": [
    "+ Compact",
    "+ Attractive design",
    "+ Matching appliances"
  ],
  "cons": [
    "- Basic features",
    "- Small capacity jug",
    "- Can get loud"
  ],
  "article": [
    "Available in a selection of signature high-gloss colors with a die-cast aluminium frame, Smeg appliances are unmistakable in style.",
    "The brand sells a luxurious range of small appliances that includes kettles, toasters, juicers and blenders, such as the Smeg BLF01PBUK.",
    "There’s also a range of large appliances to match too in the way of fridges, washing machines and more.",
    "But are good looks enough to keep things smooth sailing in the kitchen? Read on to find out if we rate the Smeg BLF01PBUK as one of the best blenders around.",
    "While it’s not the cheapest blender we have reviewed, it’s not the most expensive either. You can currently find the Smeg BLF01PBUK blender priced at £179.95 / $222 / AUS $362 over on Amazon.co.uk.",
    "With a capacity of 1.5 litres, the Smeg BLF01PBUK offers a smaller than the average plastic Tritan BPA-free jug.",
    "While the die-cast aluminium body looks good, on close inspection the blade and finishing touches in the control dial and handle don’t look and feel as luxurious as competitor models we have trialled.",
    "At 800 watts and with a 1,800 rpm, it’s not the most powerful blender on the market either, but nudging the £200 mark the Smeg is priced a little above average.",
    "Anti-slip feet ensure the design sits neatly on the worktop, and with a weight of 3.65kg and base width of 24cm, it’s easy to store and house on the countertop.",
    "While we give the blender top marks for its style, we weren’t as impressed by its performance.",
    "Its basic dial includes simple blending features with two pre-set buttons for ice crushing and smoothies and these are very subtly marked on the top of the dial. While the design does ramp up to speeds of 1,800 rpm, the dial does have a limited inclination range from 1 – 4 - competitor models will take you from 1 to 10 at a more slow and steady pace, for example.",
    "You will need a fair amount of liquid inside the jug before you start blending as we discovered when we made our Banana, Avocado and Spinach smoothie as it gets very noisy without enough liquid.",
    "Once sufficient liquid was inserted – in this case, oat milk – the pre-set smoothie feature ensured that the blade ramped up a suitable speed slowly for whizzing the ingredients to a silky texture. The mixture didn’t seem to get as velvety as other blenders we have tested - such as the Philips HR3752/01 [LINK], which has vacuum technology, for example – but it did taste good.",
    "There’s also a measuring cap at the top of the blender, which lets you insert ingredients as you blend. The design doesn’t have a pre-set cleaning mode, but the cap can also be used as a key to unlock the blade for cleaning by hand, which is rather clever.",
    "Smeg’s 50s retro-style aesthetic is hard to resist – particularly if you’ve already got matching appliances in the way of a kettle, toaster and fridge. But looks aren’t everything - if you want a blender that can carry out simple tasks, then the Smeg BLF01PBUK will work its magic, but if you want more pre-set options and a design that can finely mill nuts and seeds or make hot soups, then you should look further afield."
  ],
  "headers": {
    "4": "Price and availability",
    "5": "Design",
    "9": "Performance",
    "14": "Verdict"
  },
  "links": {
    "best blenders": "https://www.techradar.com/best/best-blenders"
  }
}