{
  "source": "https://www.techradar.com/reviews/vpnjack",
  "title": "VPNJack review",
  "category": "computing",
  "updated": "2020-11-10T19:07:09Z",
  "author": "sead-fadilpasic",
  "summary": "A US-based VPN service that provides access to Netflix, but has some severe limitations",
  "verdict": "If you can look past VPNJack’s evident and severe limitations - e.g. low download speeds, small server network, lack of support for torrenting/P2P and missing native apps - it has some good qualities. It provides access to US streaming services like Netflix and Hulu, offers a decent free trial, and its prices are low in comparison to the competition. However, the low speeds may render it unusable for anything other than browsing.",
  "pros": [
    "Reasonable pricing",
    "Unblocks Netflix",
    "Has a free trial"
  ],
  "cons": [
    "Doesn’t allow P2P/torrenting",
    "Slow",
    "No native clients",
    "No money-back guarantee",
    "Customer support only via email"
  ],
  "article": [
    "VPNJack is a basic anonymity service that focuses on providing access to VPN servers in the United States, through which it allows its users to hide their IP addresses, protect their passwords when using public WiFi hotspots, unblock US content unavailable in their region, and encrypt all their internet traffic.",
    "It strictly forbids torrenting, doesn’t have any native clients, doesn’t offer a money-back guarantee and its speeds are low, but it does have a solid free trial you can use to see how it performs.",
    "If, after reading this review and testing the service out yourself, you don’t feel like VPNJack is the best solution for you, there are plenty of other options in our best VPN guide.",
    "VPNJack has as many as six pricing packages. The cheapest (and shortest) option is for users who only require the VPN for 24 hours and costs $0.99, followed by the seven-day plan at $1.99 and the one-month subscription at $5.49.",
    "There’s also a three-month package available at $11.99 (one-time payment, equates to $4/month), a six-month option charged at $19.99 ($3.33/month), and finally the 1-year package billed at $29.99 (equal to $2.49/month).",
    "All these options are non-recurring and very affordable, regardless of which one you opt for. You can pay using credit/debit cards, PayPal, or bitcoin.",
    "To make sure its VPN isn’t blocked by your internet service, the provider strongly recommends you sample its free trial, which is valid for 24 hours, but the total VPN time is limited to 60 connections (you can connect multiple times). This is also a good chance to see if you like the platform enough to purchase a paid plan.",
    "Under one account, users can install the service on as many devices as they like but they can only connect from one at a time. If you need more than one simultaneous connection, you’ll have to purchase additional VPN packages.",
    "Despite its low prices, VPNJack is inferior to today’s major VPN services, such as ExpressVPN, NordVPN, Surfshark and CyberGhost. Not only are they all a lot faster than the service we’ve reviewed (and by a significant margin) but they also provide user-friendly native apps, support torrenting, and have readily available customer support, even if some of them cost more.",
    "It's not made immediately clear but the provider does provide access to some geo-restricted streaming services that may not be available in your country. Considering VPNJack only has servers in the US, this refers only to the US-based services, like Netflix and Hulu, so you shouldn’t expect to have access to, say, BBC iPlayer.",
    "However, keep in mind that the provider imposes a “fair usage” policy on its services, so if you use media streaming apps or any other traffic-intensive apps for a prolonged period of time, it may limit your connection speed.",
    "The provider deploys PPTP and L2TP transfer protocols and that’s as much as we are told on the website’s support section and FAQs. There are no details about the encryption or any additional mechanisms it uses to protect your privacy. Unfortunately, sharing large files via P2P or torrenting clients is strictly forbidden.",
    "We tried to find privacy and no-logging policies, but only found brief mention of the topics in the FAQ section. Here, the provider states it only tracks “the minimal information needed for proper accounting and system health monitoring, like the duration of your VPN connection and average bandwidth. We do NOT keep the [sic] the track of web-sites [sic] you visit or the content of the data being transferred through your VPN connection”.",
    "No firm proof is offered (such as an independent audit) to substantiate these claims, so we have no choice but to trust VPNJack that it won’t deliver our private data to its government or other organizations.",
    "VPNJack doesn’t offer any native apps, but it can be enabled manually on Windows, Mac, iOS, Android, “and other devices\", using the instructions on its website.",
    "If you get stuck anywhere and you don’t manage to find an answer, your only choice is to try and contact the customer support directly and you can do so only via email. There’s no ticketing system, live chat, or telephone number you can use, so arm yourself with patience.",
    "This provider’s services may not be the easiest to use if you’re a beginner or are used to user-friendly apps with a list of servers and extras to play around with. However, using the help provided on the website, we managed to enable the service and it was time to test its download speeds.",
    "Unfortunately, when we tried connecting via the PPTP connection, the VPN failed each time. The slower L2TP connection worked like a charm, but the speed test, not so much.",
    "As a matter of fact, we had trouble even starting it, and when it did start, it only showed a pathetic 680Kbps on a 70Mbps testing connection.",
    "VPNJack is a VPN service that doesn’t boast any interesting features, fancy apps, mind-numbing speeds, or even P2P support. We’d also like to have seen more information about the service on the website.",
    "However, it has low prices and unblocks Netflix, if you manage to reach a decent speed (which we couldn’t).",
    "Given the temperamental nature of the service, you might want to cough out a little more for a top-tier VPN service, such as ExpressVPN."
  ],
  "headers": {
    "3": "Price",
    "8": "Alternatives",
    "9": "Streaming",
    "11": "Privacy and encryption",
    "14": "Support",
    "16": "Speed and experience",
    "19": "Verdict"
  },
  "links": {
    "VPNJack": "https://vpnjack.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "FAQ section": "https://vpnjack.com/FAQ",
    "email": "mailto:info@vpnjack.com",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-2050196787932158500"
  }
}