{
  "source": "https://www.techradar.com/reviews/helcim-credit-card-processing",
  "title": "Helcim credit card processing review",
  "category": "computing",
  "updated": "2021-09-03T14:25:30Z",
  "author": "rob-clymo",
  "summary": "Helcim credit card processing provides businesses with an all-in-one merchant platform",
  "verdict": "Helcim is a very well-rounded package that combines an excellent choice of hardware with an easy-to-grasp cloud-based software system. If you're a small to medium-sized business then it ticks many must-have feature boxes.",
  "pros": [
    "Super easy to use",
    "Transparent pricing",
    "Good hardware",
    "Now offers QR codes"
  ],
  "cons": [
    "Not so good for larger volume business"
  ],
  "article": [
    "Helcim is a Canadian credit card processing company and merchant services provider to small businesses. It also offers a Helcim point of sale (POS) service.",
    "The company has grown a lot and now, despite coronavirus, boasts $2.5 billion in annual processing, handles 15 million transactions per year and keeps no less than 6000 merchants ticking over nicely.",
    "Helcim has continued with its expansion and in 2013 the company started offering its services in the US.",
    "Business users can take advantage of multiple products and services from Helcim, including:",
    "✔ Affordable payment processing via credit and debit terminals",
    "✔ Mobile phone payments",
    "✔ Virtual terminal transactions",
    "✔ Merchant QR codes for online store and payment pages",
    "Competitors to Helcim include Sage Pay, PaySimple, Authorize.net, Worldpay, PayPal, Stripe and Clover all of which are worth looking at.",
    "On its website Helcim points out that its credit card processing features transparent pricing and there are no hidden fees. In fact, Helcim has streamlined its payment systems so you can enjoy month-to-month processing power irrespective of how many cards you end up processing.",
    "On signing up for an account you’ll be able to start a new merchant account application. This currently costs $15 per month Retail, $35 per month Online and $50 per month for a Retail+Online combination package. Another bonus with the Helcim setup is that you can rent equipment on a month-to-month basis, or if you prefer just purchase everything you need outright.",
    "All in all Helcim is to be commended for offering such a flexible range of options and it’s clear that the company realises that the needs of businesses are many and varied. This is certainly better than a one-size-fits-all approach.",
    "If you’re looking to accept major credit cards then Helcim offers a range of options for completing transactions, including in-person payments and those done on the go. This comes in the shape of chip and PIN, tap and pay or swiping.",
    "Helcim also offers the capacity for processing payments using a manual keying-in method for both online and over-the-phone purchases.",
    "In addition, Helcim has a range of hardware, which includes virtual terminals, point-of-sale devices, mobile apps plus credit and debit card machines along with a payment gateway. You can also mix and match these options, depending on your business and its requirements.",
    "For added flexibility, Helcim delivers a comprehensive payment processing solution with a built-in merchant account for Visa, MasterCard, Discover, China UnionPay, American Express OptBlue, JCB and Visa Debit cards.",
    "On top of all that, Helcim has now added QR code functionality for merchants who are using its Online Store, Hosted Payment Pages and Online Food Ordering features.",
    "In the wake of the coronavirus pandemic this offers businesses more options for accepting payments whilst also ensuring social distancing requirements are met.",
    "Helcim has been nicely honed in order to work fast and efficiently, whether you’re using one of its hardware terminals, its app-based card processing arrangements or navigating the cloud-based website.",
    "The latter has been very well put together and with a bumper collection of features and functions it performs very impressively on initial setup.",
    "Quite how it fares with larger amounts of data remains to be seen, but the Helcim system certainly seems more than capable of dealing with the sort of activity generated by most small to medium-sized business operations.",
    "Alongside its hardware offerings Helcim also has its cloud-based web side of things to get to grips with. You’ll find that this is really straightforward with a clean and simple layout that takes little time and even less skill to become familiar with.",
    "While it soon becomes apparent that the online system might not be quite so good for larger businesses that would have to deal with huge volumes of products, it seems ideally suited for small to medium ventures.",
    "And, even if you happen to get stuck, there’s a plentiful supply of support files and documentation that should help you sail through the initial setup.",
    "Helcim’s decision to implement QR code functionality for merchants also boosts its appeal, not only for business owners but for customers too.",
    "As with other aspects of the Helcim credit card processing setup you’ll find that the Canadian operation has a rock-solid support network too. Online-wise you’ll find that its support center has an extensive collection of information that covers anything and everything to do with the operation.",
    "Alongside the excellent array of online articles you’ll find quick and easy links for either emailing the company with a query or simply calling them directly.",
    "Indeed, in the top right-hand corner of the website there’s an easily spotted phone number for quick reference should you not find the answer to your question from those internet help files.",
    "Helcim really is a pretty comprehensive solution for small to medium-sized businesses that might have a variety of requirements when it comes to accepting payments.",
    "With a built-in merchant account and those transparent processing rates Helcim gets off to a great start, but the system is also wonderfully easy to use.",
    "The Canadian company has done a super job in joining up the dots between physical hardware, with terminals that can be bought or kept on an as-needed basis through to the online aspect with a simple but effective web dashboard that’s a pleasure to use.",
    "Helcim tops it off with options for integrating QuickBooks, third-party cards and there are developer API opportunities too. Now that the company has added QR code functionality for its merchants the service is built to take on all manner of challenges, including those posed by the coronavirus pandemic."
  ],
  "headers": {
    "9": "Pricing",
    "12": "Features",
    "18": "Performance",
    "21": "Ease of use",
    "25": "Support",
    "28": "Final verdict"
  },
  "links": {
    "Helcim": "https://www.helcim.com/ca/",
    "credit card processing": "https://www.techradar.com/best/best-credit-card-processing-service",
    "small businesses": "https://www.techradar.com/best/accounting-software-small-business",
    "Helcim point of sale (POS)": "https://www.techradar.com/reviews/helcim-point-of-sale-pos-review",
    "Mobile phone payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "QR codes": "https://www.techradar.com/news/qr-codes-finally-find-their-groove-during-the-pandemic",
    "Sage Pay": "https://www.techradar.com/reviews/sage-pay-credit-card-processing",
    "PaySimple": "https://www.techradar.com/reviews/paysimple-credit-card-processing",
    "Authorize.net": "https://www.techradar.com/reviews/authorizenet",
    "Worldpay": "https://www.techradar.com/reviews/worldpay",
    "PayPal": "https://www.techradar.com/reviews/paypal-credit-card-processing",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "Clover": "https://www.techradar.com/reviews/clover-pos-point-of-sale-review",
    "website": "https://www.helcim.com/ca/pricing/",
    "accepting payments": "https://www.techradar.com/how-to/how-to-take-card-payments-contactless-or-pin-based",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-online"
  }
}