{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-a90-5g-review",
  "title": "Samsung Galaxy A90 5G review",
  "category": "phones",
  "updated": "2020-01-08T17:29:43Z",
  "author": "andrew-williams",
  "summary": "Choosing 5G over photography",
  "verdict": "The Samsung Galaxy A90 5G is one of the most affordable 5G phones. It also has a decent amount of power, but its camera is enormously disappointing for the price, so only buy this if you value 5G over photography.",
  "pros": [
    "Has 5G",
    "High-end chipset",
    "Big, bold screen"
  ],
  "cons": [
    "Not good for night photography",
    "Poor wide camera for the money",
    "No zoom"
  ],
  "article": [
    "The Samsung Galaxy A90 5G is Samsung’s first attempt at a sort-of affordable 5G phone. But it has arrived before 5G tech itself is all that affordable.",
    "That means you still have to pay £669 / AU$1,049 (around $880 but with no US availability currently), which is similar to the cost of a Samsung Galaxy S10. But you do get a top chipset as part of the deal, as well as 5G.",
    "Not every part is similarly impressive, though. The Samsung Galaxy A90 5G's cameras don’t stack up well against almost any other phone at the price, which makes you seriously question whether 5G is worth it.",
    "Being an early adopter can be great, but this isn’t quite the complete package. The lesser parts stick out, particularly as we expect 5G phones to come down in price fairly rapidly.",
    "But if you don’t care too much about camera quality, the Samsung Galaxy A90 5G should see you right for several years to come.",
    "The Samsung Galaxy A90 5G is a big phone, like almost all the early 5G brigade. This choice makes sense. If you are keen on 5G, you may want it for faster video streaming, which just doesn’t fit well with a little screen.",
    "There’s an obvious downside to this too. The Samsung Galaxy A90 5G is a handful, and we found it tends to poke out of the top of a normal jeans pocket slightly. It makes you more paranoid about public transport pickpockets. And we can’t count the number of times it has tried to slip out of pockets.",
    "Almost all high-end phones are made of glass and metal, but for some reason the Galaxy A90 5G seems particularly slippery.",
    "The Samsung Galaxy A90 5G is made to similar standards as the Galaxy S10 family, with one important difference. The front isn’t curved at the sides like the Galaxy Note 10 or Galaxy S10, and it doesn’t have the border-free look of those phones.",
    "However, the back is curved, both the front and back are tough Gorilla Glass, and the bit in the middle is metal. There’s also no visible plastic border between the two, often used as an impact buffer that likely makes the phones easier to produce.",
    "Samsung has also done something a little unusual with the Samsung Galaxy A90 5G’s finish. Rather than a funky gradient or a common light-reactive finish, the back is split into four rectangles, each with a slightly different style. The effect is a bit like a piece of generic artwork you might pick up at IKEA, but it works well on the backside of a phone.",
    "Water resistance is the bit it lacks. We would not be surprised if the Samsung Galaxy A90 5G holds up perfectly well in a rainstorm, or would survive a dunk, but there’s no official protection here. You also don’t get a headphone jack, which is no surprise when Samsung left one out of the Note 10.",
    "The Samsung Galaxy A90 5G may not represent the very best of dynamic Samsung design, but it is better than all the other phones in the A series. Most cost a lot less than this one too, though.",
    "An in-screen fingerprint scanner is one of the phone’s little higher-end pieces of hardware. At first it seemed really quite bad, cycling between refusing to recognize the finger at all, or taking several attempts to let us onto the home screen.",
    "Samsung has since given the phone a firmware update that improved its reliability dramatically, although it is still slightly slower and a lot less reliable than some. It has gone from an E-grade scanner to a C- one.",
    "The Samsung Galaxy A90 5G has a very large 6.7-inch screen. And just like the outer design, there are some similarities with Samsung’s top models, without quite going all the way to the signature flagship style.",
    "It’s an OLED panel with the same ‘Vivid’ and standard color modes as the Note 10, excellent contrast and good top brightness. However, a resolution of 1080 x 2400 rather than 1440p means you can see ever-so-slight OLED fizz if you go looking for it. Anyone who spends more than two minutes complaining about this is wasting their time, though. The perceptual difference is not huge.",
    "The Samsung Galaxy A90 5G also has a teardrop notch rather than a punch-hole, a smoothed-off semi-circle that bites into the middle of the top of the display. Samsung trimmed down the punch-hole pretty successfully in the Galaxy Note 10 Plus, but you have to wonder whether such a hole is really less distracting than a notchy lump when watching a movie.",
    "A punch-hole’s real function is to tell you a phone is more expensive, more ‘high-end’, than this one, much like the curvy front of Samsung’s higher-end mobiles.",
    "High refresh rate is the obvious display feature substance the Samsung Galaxy A90 5G lacks. This is a standard 60Hz screen, not the 90Hz kind you can get in the OnePlus 7T.",
    "The difference? A higher refresh makes scrolling through menus seem smoother and more responsive, but it doesn’t really have such an effect on games and movies. 60fps/Hz is already ‘high frame rate’ in the context of films, and console-style mobile games don’t tend to run at such high frame rates on phones anyway.",
    "The screen does have HDR support. It’s less flashy than 90Hz, but may be more important.",
    "Vodafone UK lent us the Samsung Galaxy A90 5G for this review"
  ],
  "headers": {
    "5": "Design",
    "15": "Screen"
  },
  "links": {
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Galaxy Note 10": "https://www.techradar.com/reviews/samsung-galaxy-note-10-review-and-specs",
    "Galaxy Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs",
    "OnePlus 7T": "https://www.techradar.com/reviews/oneplus-7t"
  }
}