{
  "source": "https://www.techradar.com/reviews/hp-spectre-x360-15t-2019",
  "title": "HP Spectre x360 15T (2019) review",
  "category": "computing",
  "updated": "2020-12-11T03:15:45.318Z",
  "author": "michelle-rae-uy",
  "summary": "Powerful performance in a head-turning design",
  "verdict": "The HP Spectre x360 15T is, undoubtedly, one of the best laptops we’ve ever reviewed, a powerhouse machine with an appealing aesthetic, a sleek yet sturdy design, and a price tag that’s reasonable. From the moment you lay your hands on this stunning laptop, you’ll never want to use anything else.",
  "pros": [
    "Beautiful design",
    "Sharp 4K display",
    "Versatility",
    "Excellent performance"
  ],
  "cons": [
    "Problematic vent placement",
    "Awkward trackpad position"
  ],
  "article": [
    "The HP Spectre x360 15T (2019) isn’t just HP’s stab at a stunning and powerful high-end laptop; it’s an attempt to rival the MacBook Pro and convert Apple users to Windows 10. And, what a valiant attempt it is, packing impressive specs alongside a high-quality keyboard, responsive trackpad, and an exquisite touch display in an elegant gem-cut design that’s guaranteed to turn heads.",
    "Taking what the MacBook Pros do so well – though the 16-inch MacBook Pro has raised the bar a bit – while keeping its price tag more accessible for us mere mortals, the HP Spectre x360 15T (2019) is certainly a compelling and well-rounded package. It’s certainly giving many a few compelling reasons to make the switch.",
    "With its awesome specs, beautiful design, and collection of useful features, the HP Spectre x360 15T (2019) this is an excellent laptop even for those already in the Windows world.",
    "The HP Spectre x360 15T’s performance is great enough to make its price tag practically a non-factor. However, if you’re in the market for a budget laptop, consider this: the souped up 15-inch configuration we tested for our review will set you back $1,849 (£1,899, AU$4,199). Though with that, you get 1TB SSD storage, 16GB of memory (RAM), an 8th Generation Intel Core i7 processor (CPU), a 4K display and NVIDIA GeForce GTX 1050 Ti graphics card.",
    "To further put that into perspective, a 15-inch Macbook Pro touting the same processor and amount of RAM, but with a Radeon Pro 560X graphics card, Retina display with True Tone and only 256GB SSD costs an exorbitant $2,399 (about £1,840, AU$3,410). That’s a significant $550 price difference.",
    "This souped-up configuration we reviewed is on hand in both the UK (£1,899) and Australian ($3,899) markets. However, the HP Spectre x360 15T (2019)’s entry level models do differ depending on the country.",
    "In the UK, there are only two entry level configurations on hand, with the cheaper one – with 8GB RAM and a 512GB SSD – coming in at £1,599.",
    "In Australia, the cheapest configuration will set you back AU$3,699 and is a similarly configured model, only with an older quad-core chip, the Intel Core i7-8705G, and a Radeon RX Vega GL graphics card (GPU).",
    "If you’re considering the base configuration for the Spectre x360 15T in the US, it’ll set you back $450 less than our review model at $1,399. This configuration will get you the same CPU and GPU, only with less storage (256GB SSD) and memory (8GB).",
    "Whoever says first impressions don’t last, obviously hasn’t gotten their hands on the HP Spectre x360 15T. This laptop’s design is as superior and smart as its performance, with a sophisticated matte “Poseidon Blue” chassis fringed with gold trimming running around its edges.",
    "While it is a bit heavier than other premium laptops like the Macbook Pro, it doesn’t feel any less portable sitting at 0.76 inches thick, so much so that you’ll hardly even notice its weight when using it.",
    "The chassis is made of a high-quality aluminum that feels solid and looks elegant at the same time. The only downside is it does collect fingerprints and track dust quite easily, so if you’re a bit obsessive-compulsive with how clean your laptop is, expect to be constantly wiping this chassis clean.",
    "The inclusion of Gorilla Glass for the screen and Bang & Olufsen speakers attest to HP’s careful attention to detail, and those are just to start.",
    "In addition, the two back corners are angled – with the right one hiding the power button and the left keeping a USB-C port – with vents positioned near the back on each side. For a 15-inch laptop with such a thin form factor, it comes with a decent amount of ports, which is a welcome detail. The two USB-C ports help keep this computer future proof while the HDMI, USB 3.1, microSD reader, and audio jack cover any other existing connections one might need, especially for creative professionals looking to move away from Apple’s minimalist Thunderbolt campaign.",
    "One frustrating thing about the design is the placement of the air vents on either side of the laptop. If you plan on using an external mouse, fair warning: your mouse hand will get hot.",
    "Other than that, the keyboard on the HP Spectre is a delight to use, with more bounce and travel than one would expect on a computer this thin – better than Apple’s butterfly keyboard, in our humble opinion. We do not find it fatiguing and are able to use it for long stretches, whether we’re responding to emails, writing articles or entering cheats on Sims 4. The keyboard also boasts a dedicated number pad – good for lefties – and shortcuts lining the top for media functions, keyboard backlighting and airplane mode.",
    "While the trackpad is flush with the enclosure, offering a smooth and responsive performance, its left-of-center placement is a little strange. If you’re used to properly centered trackpads, this might affect your workflow, as you would end up repeatedly, accidentally right-clicking when you mean to left-click.",
    "It doesn’t help that it’s fairly wide for a trackpad, which means that any time you’re left clicking, your hands will crowd on the left side. We would suggest going with an external mouse with this laptop, even if you’re not gaming. Or, at the very least, give yourself some time to get used to it.",
    "The stunning 4K, IPS display is one of the Spectre’s best features. The image quality is incredible, with videos and games popping from the screen, while the 60Hz refresh rate ensures smooth and accurate tracking. Color representation is gorgeous as well, even though it errs a bit on the cooler side with some blue and magenta hues. Personally, we like that, but some people might prefer warmer hues, which is why we’re mentioning it.",
    "As we mentioned earlier in the review, this display is coated in Gorilla Glass, so it has a high-quality, sturdy look and feel, with a touchscreen that is both accurate and responsive.",
    "The laptop is also equipped with the HP TrueVision FHD IR webcam and a dual array digital microphone, perfect tools for video conferencing. In addition, the IR camera can use facial recognition via Windows Hello to unlock the computer, which makes login easier yet more secure than ever.",
    "The sound, while lacking a little in the low end, is well-balanced overall, thanks to the Bang & Olufsen speakers. There’s plenty of volume on tap as well. What is a bit more impressive here thought is its sound stage. It seems to be a little wider than most laptops, which is good for entertainment and gaming. When playing the game Hellblade: Senua’s Sacrifice, for example, the voices that the protagonist Senua hears in her head seem to come out of thin air, not just the left or right of the computer.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "9": "Design",
    "18": "Display, camera and sound"
  },
  "links": {
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro",
    "16-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "cheats on Sims 4": "https://www.techradar.com/how-to/how-to-cheat-in-the-sims-4"
  }
}