{
  "source": "https://www.techradar.com/reviews/kami-wire-free-outdoor-camera",
  "title": "Kami Wire-Free Outdoor Camera review",
  "category": "appliances",
  "updated": "2020-06-30T10:27:14Z",
  "author": "cliff-joseph",
  "summary": "A camera for all seasons",
  "verdict": "There are more expensive security cameras that provide higher resolution, but the real strength of the Kami Wire-Free Outdoor Camera is its value for money. Its sturdy design, wall-mount kit and rechargeable batteries make it ideal for outdoor use, and the option to use your own memory card can save you money too.",
  "pros": [
    "Affordable 1080p security camera",
    "Sturdy, weather-proof design",
    "Includes SD memory card slot"
  ],
  "cons": [
    "Uses 18650 rechargeable batteries",
    "Poor zoom",
    "Online storage requires subscription"
  ],
  "article": [
    "Outdoor security cameras are generally more expensive than their indoor counterparts, but Yi Technology has managed to build a tough, weather-proof camera in the Kami Wire-Free Outdoor Camera. The 1080p resolution is perfectly adequate for monitoring smaller areas such as gardens or the outside of a small office, and the ability to record video onto your own memory card is a good alternative to paying for online storage. The zoom feature is limited, though, and the odd battery size means you might have to buy a new battery charger.",
    "Yi Technology is still a new name in the western world, but it made a good impression with its Kami Indoor Camera recently, which provided useful security features at a very competitive price. Yi has now followed up with an outdoor camera that also offers good value for money at just £79.99 ($89.99). We reviewed the battery-powered Wire-Free Outdoor Camera, but there’s a wired version as well, that relies on mains power supply, for £64.99 ($60.00).",
    "You’re not going to get a top-of-the-range camera for that price, but the Outdoor Camera gets the basics right, with 1080p resolution (1920x1080), 140-degree wide-angle lens and infra-red sensor that provides night vision for low-light conditions. The camera only records video at 20fps, and it’s not the sharpest lens we’ve come across, but the video quality is still perfectly adequate for keeping an eye on people coming and going in the area outside your home or office.",
    "The night-vision mode also works well for such an affordable camera. Our only minor complaint is that the zoom option is fairly limited, but that’s a lot to ask from a camera in this price range, and the Wire-Free Outdoor Camera should be fine for monitoring areas such as gardens or the outside of an office.",
    "The camera casing feels sturdy and well built, and has an IP65 rating for water- and dust-resistance. It can also operate at temperatures between -10°C and 50°C, which just about covers a typical year in a temperate climate. There’s a wall-mount kit included with the camera, and the head of the camera can tilt and rotate so that you can further adjust the viewing angle once it’s been fixed into place on a wall. Kami also includes a little rubber support that will allow you to simply rest the camera on a window ledge or other flat surface where the wall-mount might not be suitable.",
    "Kami is a bit vague about battery life, though, merely saying that the batteries provided with the camera should last for 3 - 6 months. The batteries are rechargeable, but they’re an unusual size - Kami says they’re 18650 batteries if you want to check on Google - and were far too big to fit into my normal AA battery charger, so you might need to pay for a new charger as well. But, of course, the wire-free design does mean that you can also bring the camera indoors every now and then if you need to.",
    "Setting up the Wire-Free Outdoor Camera is admirably straightforward. All you have to do is provide an email address and password to create an account within the Kami Home app for iOS or Android, and then enter your Wi-Fi password so that the camera can connect to your Wi-Fi network (although the low cost of the camera means that it only supports Wi-Fi on the 2.4GHz bandwidth). Once that’s done you can use the camera itself to scan the QR code printed on the box, and the app automatically completes the set-up process and network connection for you.",
    "The app provides two simple buttons that allow you to switch the camera between ‘Home’ and ‘Away’ modes - with ‘Away’ turning on motion-detection alerts when you leave, while ‘Home’ lets the camera know that you’ve returned and that it can take a rest. There’s also an option to create a customized schedule for the camera’s motion-sensor, perhaps to turn it on during the night-time or at weekends, and you also have a remote control option that lets you view live video on the app, and to take still photos and record videos on your smartphone wherever you may be.",
    "The sting in the tail with many security cameras is the need to pay for online cloud storage for the video clips that the camera records. Like the Indoor Camera that we reviewed from Yi, the Wire-Free Outdoor Camera will record short video clips - just 6 seconds long - free of charge, which it stores and uses to notify you of any activity that it detects. But, unlike the indoor camera, the Wire-Free Outdoor camera also includes a slot for an SD memory card - up to 64GB - so you can store longer video clips directly onto the card.",
    "That always leaves a slight risk that thieves could steal or damage the camera itself - along with the memory card - so you can also pay for a Kami Cloud subscription that provides more secure online storage for your video recordings. This is where things get a bit confusing, as we found that the plans listed within the Kami app on our smartphone were different from those available on Yi’s web site.",
    "When we spoke to Yi, they recommended that you choose a subscription by logging into your account on the web site instead. The subscriptions available on the web site offer a month’s free trial, with prices starting at £5.00 per month (about $6), which allows you to record all motion detected by a single camera, and to store those clips for one week. Other subscriptions provide 15 or 30 days of storage for up to five cameras, and there are discounts if you pay for a whole year in advance. There’s also a more expensive ‘CVR’ option - continuous video recording - that works like CCTV and records video non-stop for 24 hours, one week at a time.",
    "The image quality provided by the Kami Wire-Free Outdoor Camera is good, rather than exceptional, and there are certainly more expensive security cameras that provide better image quality and more powerful zoom controls. However, the Wire-Free Camera is still very good value for a camera that costs so little. Its rechargeable batteries, sturdy design and wall-mount kit make it suitable for a wide range of outdoor locations, and the ability to install your own memory card means that most people won’t need to worry about subscription fees either."
  ],
  "headers": {
    "0": "Two-minute review",
    "1": "Price and availability",
    "2": "Design and features",
    "6": "Getting started",
    "8": "Subscription charges",
    "11": "Verdict",
    "12": "Don't buy it if..."
  },
  "links": {
    "Kami Indoor Camera": "https://www.techradar.com/reviews/kami-indoor-camera"
  }
}