{
  "source": "https://www.techradar.com/reviews/fanduel",
  "title": "FanDuel review",
  "category": "computing",
  "updated": "2020-03-26T21:28:48Z",
  "author": "michael-graw",
  "summary": "FanDuel is easy to recommend",
  "verdict": "FanDuel’s daily fantasy stands out for offering innovative contests that break out of the mold of traditional fantasy sports and although it doesn’t offer the same range of sports forsports betting, what FanDuel does, it does extremely well.",
  "pros": [
    "Incredibly designed Sportsbook user interface",
    "Huge array of prop bets",
    "Free games available offering cash prizes",
    "Innovative fantasy contests"
  ],
  "cons": [
    "Limited sports options",
    "Drafting teams on app can be cumbersome"
  ],
  "article": [
    "FanDuel, founded in 2009, is one of the largest daily fantasy sports platforms in the world. The platform offers fantasy competitions across most of the big-name US sporting leagues and has paid out more than $4.5 billion over the last decade.",
    "The range of fantasy leagues in FanDuel isn’t quite as impressive as what major competitors like DraftKings support. However, FanDuel’s point system and salary caps for its games help to set the platform apart.",
    "In 2018, FanDuel also opened an online sportsbook that covers betting on most major US sporting leagues. The sportsbook is very impressive, with an extremely large number of prop bets available for every competition. The user interface, both on desktop and mobile devices, also helps to propel FanDuel’s sportsbook to the front of the online betting pack.",
    "So, is FanDuel the best option for daily fantasy sports or online sports wagers? Let’s take a closer look at this platform to find out.",
    "Signing up for FanDuel is extremely simple. Just head to the website and enter your name and email address to get started. You can also use your Facebook account to connect to FanDuel.",
    "The company accepts payment through any major credit card, a PayPal account, or ACH bank transfer. You can even mail FanDuel a check if that works best for you.",
    "However, you can also choose to forego the bonus and explore the site before making a deposit. FanDuel offers a large number of games for free, many of which come with cash prizes.",
    "FanDuel’s sportsbook carries most major American leagues, including the NFL, NHL, NBA, MLB, NASCAR, and more. The company has also been expanding into leagues that are more popular abroad, and now includes betting on cricket, rugby, golf, and UPL and UEFA soccer leagues.",
    "What really sets the FanDuel sportsbook apart is its user interface. This is hands down one of the most attractive and friendly online betting platforms we’ve seen.",
    "From the main page, you can quickly see which upcoming matches are attracting the most betting attention and bet on the outcome. Your betslip is overlaid on the same window, so you can review your current wagers, make changes, and set up parlays all while browsing the list of available bets.",
    "The range of available bets is enormous as well. For a single NBA game, we counted more than 50 different prop bets to choose from. You can bet on individual players or the outcome of specific quarters, as well as set up custom parlays or round robin bets in your betslip.",
    "The only thing that was noticeably missing from FanDuel’s sportsbook was detailed research that you could use to inform your wagers. The platform doesn’t provide any team or player stats, let alone recent wager-specific stats, so you’re somewhat left on your own to find this information. To be fair, this isn’t a huge drawback since most users are going to FanDuel for placing bets, not figuring out what to bet on.",
    "FanDuel’s league offerings for daily fantasy sports are notably limited compared to both the sportsbook and to its main competitor, DraftKings. The platform offers daily fantasy around only the NFL, NBA, NHL, MLB, PGA, and UPL, plus NCAA basketball and football. Still, that fully covers the most popular US leagues.",
    "One of the unique aspects of how FanDuel approaches fantasy is that every fantasy game, regardless of sport, comes with a $60,000 salary cap. This consistency is a major attraction for the platform, since users have a pretty good idea of what to expect going into different tournaments.",
    "There are a handful of different leagues and games available on the platform. To start, FanDuel offers a beginners’ category, in which only users below a specific point threshold are allowed to play. This gives newcomers a fair chance to learn the platform in a friendly environment where most of the tournaments don’t have an entry fee.",
    "For more advanced players, contest types include tournaments, head-to-head competitions, and 3-100-player multiplayer leagues. FanDuel also experiments with some unusual contest formats from time to time. For example, the platform had a home run challenge for the 2019 MLB season and a positionless NBA fantasy league for the 2019–20 NBA season. These contests are a nice option for anyone who wants to try something different from the traditional fantasy league.",
    "Regardless of sport, FanDuel’s drafting interface is pretty seamless. You can filter players by position or search by name, then add them to your roster with a single click. The consistent $60,000 salary cap simplifies the process, and the platform clearly shows your remaining salary payout as you’re choosing players.",
    "FanDuel offers different mobile apps for daily fantasy and sports betting. For the FanDuel sportsbook, there are also different apps depending on which state you live in.",
    "Beyond the initial confusion of getting the right app for your needs, FanDuel’s mobile platforms are extremely clean. The sportsbook app looks almost exactly like the desktop client. The main change is that your betslip is on its own screen, which you can access from a simple menu at the bottom of the app. Otherwise, it’s still extremely easy to find prop bets and set up parlays.",
    "The daily fantasy app simplifies your display by presenting you with a choice of sports as soon as you log in. From there, you can easily browse or search sport-specific contests. Most are categorized by contest type or start time to help you find what you’re looking for on a small screen.",
    "Drafting players is a little bit more cumbersome, since you can’t view your entire lineup while selecting additional players. The app will display your salary cap, but it takes a few taps to swap out a player midway through your draft.",
    "FanDuel offers customer support around the clock by phone, email, or live chat. That’s a big improvement over DraftKings, which only offers live chat. The company also has a very comprehensive online knowledge base, which answers most common questions about how to use the platform or collect your winnings.",
    "FanDuel operates daily fantasy sports in 43 US states and Canada. Currently, you can’t use the service if you live in Arizona, Hawaii, Idaho, Montana, Nevada, or Washington.",
    "FanDuel’s sportsbook is much more limited in territory. Currently, it’s only open for betting in New Jersey, Pennsylvania, Indiana, and West Virginia.",
    "FanDuel doesn’t offer the same range of sports for daily fantasy or sports betting as its main competitor, DraftKings. But, what FanDuel does, it does extremely well.",
    "FanDuel’s daily fantasy stands out for offering innovative contests that break out of the mold of traditional fantasy sports. The sportsbook, meanwhile, offers an incredibly large assortment of prop bets for every game and makes it easy to set up parlays. The user interfaces for both branches of FanDuel are very well designed, which only makes the platform more attractive.",
    "Read more:",
    "Gambling responsibly",
    "You probably don't need us to tell you that any form of gambling comes with serious risks and should never be undertaken as a silver bullet to solve your financial troubles. It's worth remembering the phrase...the house always wins!",
    "If you suffer from a gambing problem or suspect somebody you know does, then we strongly suggest that you give the National Problem Gambling Hotline a call on 1-800-522-4700 to discuss it with a professional. It’s so important to make gambling safer for yourself and loved ones."
  ],
  "headers": {
    "4": "Sign Up and Deposit",
    "7": "FanDuel's Sportsbook",
    "12": "FanDuel Fantasy Sports",
    "17": "Mobile App",
    "21": "Support",
    "22": "Territories",
    "24": "Verdict"
  },
  "links": {
    "FanDuel": "https://fanduel.pxf.io/c/221109/516496/8691?subId1=trd",
    "DraftKings": "https://www.techradar.com/reviews/draftkings",
    "2019–20 NBA season": "https://www.techradar.com/news/nba-playoffs-2021-live-stream-how-to-watch-every-post-season-game-online-from-anywhere",
    "what FanDuel does, it does extremely well": "https://fanduel.pxf.io/c/221109/516496/8691?subId1=trd"
  }
}