{
  "source": "https://www.techradar.com/reviews/alienware-aurora-r11",
  "title": "Alienware Aurora R11 review",
  "category": "computing",
  "updated": "2020-12-09T22:56:59.565Z",
  "author": "bill-thomas",
  "summary": "Meet the 'benchmark bruiser'",
  "verdict": "The Alienware Aurora R11 is one of the fastest gaming PCs we've tested and has a stunning aesthetic, too. However, the high price of entry means that we can only recommend it to folks that can afford more than just the entry-level version.",
  "pros": [
    "Stunning aesthetic",
    "Great performance",
    "Easy to upgrade"
  ],
  "cons": [
    "Expensive",
    "Entry model comes with just a HDD"
  ],
  "article": [
    "The Alienware Aurora R11, for a lot of people, is probably going to be what defines a prebuilt gaming PC in 2020. Because, for years, Alienware has become synonymous with \"gaming PC\" for a lot of people that don't generally pay attention to the hardware scene.",
    "This of course leads to the brand being able to charge some pretty high prices for its computers, and the Aurora R11 is certainly no different. To start with, the Alienware Aurora R11 with an Intel Core i5-10400F, an Nvidia GeForce GTX 1650, 8GB of RAM and a 1TB spinning hard drive will cost $909 (£899, about AU$1,222) – a configuration that in no way will feel as premium as other gaming desktops in its price range. We seriously don't understand why anyone would provide a desktop tower for nearly a thousand bucks without at least a 128GB SSD for the OS, but that's another discussion.",
    "The configuration we reviewed here, however, absolutely blows that entry model out of the water, coming with an Intel Core i9-10900K, 64GB of RAM, a 2TB SSD with 2TB HDD space for archival, and most importantly, the Nvidia GeForce RTX 3090, the most powerful graphics card on the market. This configuration has an eye-watering price of $4,419 (£3,949, AU$9,049). But unlike the entry-level model, this configuration makes you feel like you're getting your money's worth, even though you can build an equivalent rig for less cash, assuming you can actually get your hands on an RTX 3090 – right now you can't.",
    "This price point, however, happens to put it in some pretty heated competition. You could spend less than $1,000 more and get a gorgeous Falcon Northwest Talon, or you could go for the Maingear Vybe for $200 less for the same hardware as the Alienware R11. Both of these systems are custom built and use off-the-shelf hardware, which means all of it will be upgradable and replaceable throughout the years – including the motherboard and power supply.",
    "But there's one thing that you have to keep in mind here: because of the scale of Dell, it will be quicker to get service if anything goes wrong, especially if you don't know much about PC hardware to begin with.",
    "Either way, though, none of those other gaming PCs will have the downright futuristic design that the Alienware Aurora R11 sports. This gaming PC seems to completely ignore what's trendy in the world of gaming PCs, eschewing glass side panels in favor of the out-of-this-world Legend design language that the company has been using on everything for the last couple of years.",
    "The chassis comes in two color options, Dark Side of the Moon and Lunar Light. We got the latter, and it's all white with black accents at the back and on the front where the air intake is. In the middle of the front panel, there's a strip, surrounded by an RGB light bar, where you get a power button, three USB-A ports, a USB-C 3.2 Gen 2 port, and a headphone and mic jack. The front of the case is the only place you'll find RGB lighting, and it's a lot more subdued than other gaming PCs in this price range, and actually feels all the more elegant for it.",
    "Around the back, you get way more ports, with 10 USB-A ports, 1 USB-C, 1 Ethernet, optical audio and the standard 6 audio jacks that come on most modern motherboards. And, of course, for video output, you have what you'd expect on an RTX 3090, three DisplayPorts and an HDMI 2.1 output. If you have a ton of stuff you need to plug into your PC, the Alienware R11 should be able to accommodate.",
    "For the most part, it's easy to open the Alienware Aurora R11 to service it, too. There's a rectangular protrusion on the back of the case above the power supply, with one little screw in there. Take that screw out, and pull on the protrusion to pop the side panel off. Once that's done, you'll be greeted by a giant wall of metal, to get down to the actual components, find the two latches to the left of the power supply and at the bottom of the power supply and slide them to the unlocked position to open it up. You can then pull on the power supply to open the case up to service.",
    "It's a little bit of a hassle to get it open, but it does keep everything secure when moving the PC around, so we can see why Alienware did it this way. From what it looks like pretty much everything is user-upgradeable, too, though it doesn't look like the rear I/O shield is replaceable, and the power supply looks like it'll need a professional to service.",
    "This is good, because going back to that entry model, you should be able to upgrade the RAM, CPU, and storage to make it a more efficient system in the future when you have the cash for it.",
    "If you get the configuration we reviewed here, however, you won't need to do any upgrading for a while. We used this gaming PC while testing the Samsung Odyssey G9 monitor over the course of a few weeks, and no matter what game we threw at it, we were able to get great performance, even at the high 5,120 x 1,440 resolution.",
    "When playing hours upon hours of Assassin's Creed Valhalla, we're averaging around 70 fps with everything completely maxed out. In World of Warcraft: Shadowlands, we're able to turn on ray tracing and turn the settings up to 10 and still get 150 fps+ in dungeons. Keep in mind that this resolution is just a sliver below 4K, and you can get the idea of how this gaming PC will do at 4K max settings.",
    "When it comes to playing the latest and best PC games, the Alienware R11 will let you turn on all the pretty lights without having to worry about your frame rate turning into a slideshow.",
    "Because we're talking about a gaming PC with such high-end components, this will also be a great companion for creative professionals that need the brute force that this gaming PC brings to the tables. After all, the Nvidia GeForce RTX 3090 is more of a Titan than a GeForce anyway, so creatives are going to get a greater return on their investment than someone that just plays games. After all, the RTX 3080 is nearly as good for half the price.",
    "But for the type of person that just wants the most luxurious product, with little care for how much it costs, the Alienware Aurora R11 will definitely fit the bill."
  ],
  "headers": {
    "0": "Two-minute review",
    "16": "Don't buy it if..."
  },
  "links": {
    "prebuilt gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Intel Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "Nvidia GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Falcon Northwest Talon": "https://www.techradar.com/reviews/falcon-northwest-talon",
    "Samsung Odyssey G9": "https://www.techradar.com/reviews/samsung-odyssey-g9",
    "Assassin's Creed Valhalla": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "World of Warcraft: Shadowlands": "https://www.techradar.com/reviews/world-of-warcraft",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}