{
  "source": "https://www.techradar.com/reviews/brother-dcp-j1100dw-all-in-box",
  "title": "Brother DCP-J1100DW All-in-box review",
  "category": "computing",
  "updated": "2020-01-02T21:06:44Z",
  "author": "jim-hill",
  "summary": "The first inkjet with cartridges that last three years",
  "verdict": "This fully featured three-in-one has everything you could ask of a home office printer, including enough ink to keep you printing for the next 5,000 colour pages.",
  "pros": [
    "3-yr supply of ink",
    "3-yr warranty",
    "20-sheet ADF",
    "USB and SD card slots"
  ],
  "cons": [
    "Bulky design",
    "High purchase cost",
    "Limited media options",
    "No NFC or fax"
  ],
  "article": [
    "At around £323 (US$418, AU$604), the Brother DCP-J1100DW All-in-box might seem expensive, but with a claimed three-year ink supply and a three-year guarantee included in the price, it’s actually very good value. It’s also a unique proposition for a cartridge-based inkjet printer. From Brother’s point of view, bundling this much ink keeps customers from buying third party cartridges, but with the ability to print 6,000 mono pages, or 5,000 in colour, the customer benefits too. The three-year guarantee is also worth having because printers, with all their moving parts, do have an unfortunate habit of going wrong.",
    "The marketing gives the impression that the box is full of spare ink cartridges, whereas in fact you only get a single set of four.",
    "The difference is that these cartridges are huge and filled to the brim, hence the slightly bulbous design of the printer. The printer itself is a mid-priced model with key features such as duplex printing and Wi-Fi covered and a few extras such as an SD card slot and a touchscreen interface thrown in. It’s aimed at the home office with moderate print demands. If you really need a fax facility and NFC connectivity, the slightly more expensive, but otherwise identical Brother MFC-J1300DW is the model you need.",
    "The two-tone grey livery helps this unassuming all-in-one blend into the background, but there’s no denying that it looks a little misshapen. That’s because it juts out at the right hand side to accommodate the oversized ink cartridges. Cartridge-free printers by Epson and Canon bulge in a similar way because of their ink reservoirs, but Brother has decided not to go the bottled ink route. The advantage, of course, is that you don’t need to store and pour bottles of ink.",
    "In other respects, the design is conventional with an ADF (automatic document feeder) mounted on top of the printer which hinges open to reveal an A4-sized scanner bed. Paper is loaded into a 150-sheet tray at the front and the pages are passed out through the gap just above it. A thin plastic arm extends outwards to catch them. The only disadvantage with this design is that the paper path rolls tightly through 180-degrees and is therefore not suitable for stiff card.",
    "There’s an Ethernet port at the back, but no USB port because it’s actually hidden inside the machine. Lift the scanner section and you’ll see it with neat cable management guiding the cable out the back. It means you’re less likely to unplug it by mistake.",
    "There’s another USB port at the front for walk-up printing from a flash memory stick and beside it is an SD card slot.",
    "The price of this printer is relatively high because Brother has included more ink than usual. It’s not a high-end printer, so there’s no NFC connectivity, or A3 printing. It is well featured though, with auto duplex printing, a 20-sheet ADF, a touchscreen display and Wi-Fi with Wi-Fi Direct.",
    "It can print on almost any kind of media up to A4 in size, except stiff card, and it prints at a reasonable rate of 12ppm (pages per minute) in black and white, or 10ppm in colour and there’s room for 150 sheets of A4 in the main paper tray. It scans and prints at a similar resolution, producing copies at 1,200 x 600dpi, which is pretty good.",
    "Setting up the Brother DCP-J1100DW is a case of turning it on and following either the paper instructions, or the prompts given by the touchscreen display.",
    "The four large ink cartridges click into position easily and and once you have loaded your paper, the printer will produce a test page so you can check that the inkjets are aligned. Ours were spot on. Getting the printer to join a local Wi-Fi network was simplified by the touchscreen display which makes entering passwords a painless process.",
    "There’s no auto paper select feature, but the display asks you to confirm the size and type of paper loaded each time you open and close the paper tray. The choice of media available via the on-screen menu is limited to just six kinds, so you have to choose ‘Other Glossy’ for any kind of photo paper. That suggests that it’s not really geared up for photo printing, even though the results are actually rather good.",
    "This is by no means the fastest inkjet printer in Brother’s line-up, but it is considerably faster than most budget models and duplex printing speeds are quite impressive. It also proved consistent during the test with no creases or paper jams and very uniformly printed pages.",
    "Black and white always appears dark and well-defined at small point sizes. It lacks the light touch of a laser printer, but that’s not say the letters were over inked. Monochrome pictures appear quite well detailed and evenly shaded. When printing colour test pages, the pallet looked quite subdued and with perhaps a tad too much green in dark images. Overall, the colour results on plain paper were about what you would expect from a mid-priced inkjet.",
    "Switching to glossy photo paper made the Innobella ink appear significantly brighter giving photographs an appealing boldness. Brother actually developed this ink in conjunction with its own photo paper and claims that the images are also more durable too. We found that it worked well with any glossy media but looked a little flat on plain paper.",
    "The Brother DCP-J1100DW printed successfully on envelopes and parcel labels, but had trouble with feeding stiff card through the tight paper path. Brother says the maximum paper weight recommended is 220g or just 105g if you are duplex printing. As a photocopier, it performed very well, turning out duplicates that were hard to distinguish from the original.",
    "The Brother DCP-J1100DW has a lot to offer. With both an SD card slot and a front USB port available alongside the concealed rear USB port and inbuilt Wi-Fi, it is certainly well connected, while the twenty-sheet ADF means you can schedule accurate photo copies. The print quality is consistent and particularly impressive when it comes to turning out photos on glossy photo paper. But what really sets this printer apart from your average inkjet printer are the four extra-large cartridges included in the box. It means you won’t need to spend anything on consumables, or even think about them for the next 5,000 or 6,000 pages."
  ],
  "headers": {
    "3": "Design and build",
    "7": "Features and specifications",
    "9": "Setup and operation",
    "12": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "Brother DCP-J1100DW All-in-box": "https://www.brother.co.nz/printers/inkjet-printers/dcpj1100dw"
  }
}