{
  "source": "https://www.techradar.com/reviews/usenetserver",
  "title": "UsenetServer review",
  "category": "computing",
  "updated": "2020-11-30T03:19:27Z",
  "author": "desire-athow",
  "summary": "Great value for fast, unlimited Usenet access with high-retention",
  "verdict": "A high speed Usenet service with server clusters worldwide and some of the best retention anywhere. It’s also surprisingly cheap and includes unlimited access to a Usenet search engine.",
  "pros": [
    "Low-priced unlimited packages",
    "4,489 days retention on all newsgroups",
    "US and EU servers",
    "Free unlimited Usenet search",
    "Speedy VPN"
  ],
  "cons": [
    "Maximum 20 connections",
    "No Bitcoin support"
  ],
  "article": [
    "A Usenet service provider with the name \"Usenet Server\" carries with it an implicit promise of a smart Usenet experience. Does UsenetServer deliver on that promise?",
    "UsenetServer is one of the granddaddies of the modern internet, having first been registered in 1998. Since then it has provided fast and reliable Usenet access to customers every year, building on its service with increased retention, superior server speeds, and embracing SSL.",
    "UsenetServer boasts a nice collection of features. Unlimited downloads and searches, SSL connections, and massive retention are all available. While UsenetServer states that a \"large number of concurrent connections offered with all plans,\" it doesn't state the exact figure on a plan-by-plan basis. The only details on the site concerning this state \"UsenetServer delivers unlimited data access with 20 concurrent SSL connections.\"",
    "The Global Search 2.0 feature provides quick access to NZB files, ensuring you find the most optimised binaries.",
    "UsenetServer also claims \"some of the lowest prices for premium Usenet access,\" and in terms of retention and the discounts available for 12-month subscriptions, this is certainly true.",
    "In addition, UsenetServer offers an optional zero-log VPN with 35 additional connections for an add-on price, along with a 14-day free trial.",
    "If you run into trouble configuring or using UsenetServer, it provides one of the most detailed support sections of all Usenet service providers. Here you'll find answers to all but the most unusual queries, and if your problem isn't listed you can raise a support ticket via the web form.",
    "A key requirement for most Usenet users, retention is the term that describes the age of the Usenet archive. While the service launched in 1985 (and most of the original Usenet remains available via various online archives like Google Groups) Usenet providers are unable to serve 35 years or more of data.",
    "Most providers offer between 8 and 10 years' worth of data. However, UsenetServer boasts an amazing 4427 days retention, which amounts to just over 12 years' worth of binaries and text. They think it's the best retention around, and we're inclined to agree.",
    "That massive retention covers over 110,000 discussion groups globally, with over 99% completion promised. This means that almost every article and binary upload to Usenet posted anywhere in the world in the past 4427 days should be available.",
    "Like other Usenet providers, UsenetServer offers 256-bit SSL encryption as a connection option. Secure Socket Layer and Transport Layer Security (TLS) are typically grouped into the \"SSL\" name and this encryption standard is widely used across the internet. HTTPS sites rely on SSL/TLS for increased security, email servers prefer SSL/TLS, and increasingly newsgroups (using the NNTPS connection) also demand private connections with SSL/TLS.",
    "Selecting SSL is merely a case of enabling the option in your newsreader and ensuring UsenetServer's SSL ports are specified in the settings.",
    "In addition to current encryption standards, UsenetServer also offers a VPN. Available for a further $4.99 per month, PrivadoVPN keeps your entire internet activity private. Particularly useful for public connections (cafes, airports, etc.), a VPN also stops your ISP from managing your traffic. If you're looking to maintain high internet speeds for downloading via UsenetServer, concealing activity via a VPN makes sense. If you're not already using one, PrivadoVPN is at least a convenient, easy addition to UsenetServer.",
    "UsenetServer boasts awesome levels of performance. But how does it measure up?",
    "The Global Search system has been overhauled to effectively list the 4427+ days of retention, covering binaries (media files) and text newsgroups. UsenetServer boasts of a \"network backbone,\" connections with \"800 broadband access providers,\" and \"Multiple Tier 1 bandwidth providers\" which they claim, \"translates to blazing download speeds.\"",
    "Obviously, this is little more than PR fluff, but it is true that the service appears to be extremely quick.",
    "UsenetServer boasts of unlimited data transfer and low prices. It also claims that the 20 concurrent SSL connections it limits users to is available for up to 75% less than competitors, although this seems to be measured against the 12-month subscription option (see below).",
    "In testing, UsenetServer appears reliable with constant up time. The search feature is fast, and retention considerable. Among the downloaded files was a 1.7GB, 621-day old binary. On a 55Mbps connection, this downloaded in under 5 minutes, with an average speed of just over 3000Kbps",
    "Three subscription bundles are available from UsenetServer. They all offer the same set of features, but have different prices based on how you subscribe.",
    "So, for a one-month subscription, you'll pay €12.85 ($14.95 or £11.75).",
    "Alternatively, subscribe for 3 months to pay just €7.69 ($8.95 or £7.00).",
    "For the best saving - a massive 60% discount on the monthly option - the 12 months subscription is just €82.00 compared to the full price of €205.00 ($95.40, knocked down from $239.28 or £64.36 down from £187.79). UsenetServer claims that 78% of people choose this option, and it's easy to see why. The annual plan also bundles PrivadoVPN and its extra 35 connections for free.",
    "Payment is by credit card or PayPal. There is no anonymous option (such as Bitcoin) for paying for access to UsenetServer.",
    "We should note there are 2 lifetime discounts available exclusively through TechRadar. You can get 60% off the yearly unlimited plan option, which brings your per month price down to $7.95 and includes the VPN for free, or if you prefer the monthly option, you can get 33% off, bringing your monthly price down to $10 (VPN available as a $4.99 monthly service add-on). Both discounts apply for the lifetime of your account.",
    "You cannot help but be impressed by UsenetServer. As the name suggests, it serves everything you need from Usenet, from text newsgroups to binaries, perhaps the biggest level of retention available, superior search, and superfast speeds. While the number of bundled simultaneous connections is disappointing, the price is this side of unbeatable.",
    "While even the 60% saving on the 12-month option isn't the cheapest around, the level of retention makes up for it.",
    "If you're in the market for a VPN, PrivadoVPN is an affordable extra that can be included free on the 12-month subscription. But if you're only adding that option in order to gain the additional 35 connections, it might be smarter to reappraise how much retention you really need and select an alternative Usenet service provider.",
    "UsenetServer is offering an exclusive 65% discount on annual plans for TechRadar readers. Get it here for $7.95 per month."
  ],
  "headers": {
    "2": "Features",
    "7": "Retention",
    "10": "Security and privacy",
    "13": "Performance",
    "18": "Pricing",
    "24": "Final verdict"
  },
  "links": {
    "UsenetServer": "https://accounts.usenetserver.com/register/chooseplan?rate=50&landing=Techradar&a_aid=58ac3d49df14c&a_bid=a14bd28e&chan=unsr",
    "Usenet": "https://www.techradar.com/best/best-usenet-providers",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "one-month subscription": "https://accounts.usenetserver.com/register/chooseplan?rate=50&landing=Techradar&a_aid=58ac3d49df14c&a_bid=a14bd28e&chan=unsr",
    "3 months": "https://accounts.usenetserver.com/register/chooseplan?rate=50&landing=Techradar&a_aid=58ac3d49df14c&a_bid=a14bd28e&chan=unsr",
    "12 months subscription": "https://accounts.usenetserver.com/register/chooseplan?rate=50&landing=Techradar&a_aid=58ac3d49df14c&a_bid=a14bd28e&chan=unsr",
    "2 lifetime discounts available exclusively through TechRadar": "https://usenetserver.com/best-usenet-service/?a_aid=58ac3d49df14c&a_bid=a14bd28e&chan=unsr",
    "Get it here for $7.95 per month.": "https://usenetserver.com/best-usenet-service/?a_aid=58ac3d49df14c&a_bid=a14bd28e&chan=unsr"
  }
}