{
  "source": "https://www.techradar.com/reviews/kioxia-1tb-exceria-plus-sd-card",
  "title": "Kioxia 1TB Exceria Plus SD card review",
  "category": "computing",
  "updated": "2020-11-20T06:47:30Z",
  "author": "desire-athow",
  "summary": "Finally, some more competition in the highest memory card capacity range",
  "verdict": "The Kioxia 1TB Exceria Plus 1TB SD card faces some stiff competition from established players like Sandisk or Lexar. With microSD taking centre stage amidst an explosion in the number of compatible devices, one can only question the wisdom of launching a 1TB SD card rather than a microSD one.",
  "pros": [
    "5-year warranty",
    "Good performance"
  ],
  "cons": [
    "Not widely available yet",
    "Too expensive",
    "SD form factor is niche, has a limited appeal"
  ],
  "article": [
    "To say that the market for the highest capacity memory cards has been stale would be an understatement. It’s been nearly two years since the first 1TB microSD card has been announced and since then, only two other vendors have come forward, with the original party - Micron - having all but given up. SD cards fare a bit better with five models available at the time of writing. The latest to join the fray is Kioxia with the 1TB Exceria Plus SD card.",
    "At the time of writing, the Kioxia 1TB Exceria Plus SD card (LNPL1M001TG4) is only available from Amazon UAE (United Arab Emirates) for AED 1044.5 (after a 5% discount) or about $284.",
    "With a pink and white color scheme, the Exceria Plus SD card is very different from most of the cards we’ve seen. Like many other vendors, Kioxia, formerly known as Toshiba Memory, has adopted a simplified color-coded categorization system for its memory cards: blue for entry level, pink for superior, yellow for ultimate and green for high endurance, the sort of card you’d use in security systems, to run operating systems or dash cams.",
    "The card carries the labels V30, U3 and C10, which corresponds to a video speed class 30, UHS speed class 3 and legacy speed class 3. All this to say that the card is a fairly speedy one.",
    "Kioxia partners with Western Digital to produce NAND chips, the basic building blocks for memory cards and solid state drives amongst other things. We can posit that the Exceria Plus and other 1TB microSD/SD cards from SanDisk, a division of Western Digital use a common platform, likely to be 96-layer BiCS4 or a 112-layer BiCS5 512Gb QLC chips.",
    "The drive can survive temperatures between -25 and 85 degrees centigrade and is X-ray proof. Add in a 5-year warranty and you get what looks like a very decent storage device.",
    "Note that the drive comes without any software; we recommend backing up any large capacity drives using a cloud storage solution like iDrive using the 3-2-1 system; triple backups, two different media types, one copy offsite.",
    "It is quite telling that none of the running (powered on) devices we have in our lab at the moment have a full size SD card slot. All of them have a microSD in fact, which makes sense given that its form factor is far smaller than the former, about a third of the size. To test the Kioxia Exceria Plus card therefore required us to use a SD/microSD card adaptor, the Startech SDMSDRWU3AC, which uses a Type-C connector.",
    "Kioxia claims that the read/write speed of the Exceria Plus can reach up to 100MBps/85MBps which is to put it mildly, slightly disappointing especially as real life numbers are likely to be lower. Bear in mind as well that the approximate usable capacity of the drive is only 921.6GB (out of the 1024GB/1TB native capacity).",
    "The best read/write performance we got from it was on CrystalDiskMark where it nudged 84MBps and 92MBps read/write speeds respectively. Transferring a single 10GB file took 126 seconds which translates into a transfer rate of just under 80MBps.",
    "These numbers are marginally higher than the Sandisk Ultra 1TB and well ahead the Micron 1TB C200, two microSD cards that we have tested recently.",
    "There’s two types of rivals that the Kioxia Exceria Plus will face. MicroSD card slots that come with an adaptor and full size SD cards. At the time of writing, the competition varies in price between $180 and $314 for a 1TB model. The most expensive model comes with a rated 180MBps read/write speed, about twice that of the Kioxia card.",
    "The Kioxia 1TB Exceria Plus 1TB is not a bad product, but it is badly positioned with a price tag that is significantly higher than the competition. Sure, it is closer to the suggested retail price, a normal thing for a newly launched product but at this stage, pricing is probably the only real differentiator and Kioxia will have to slash prices in order to compete.",
    "The other noteworthy attribute lacking is that an SD card restricts the use case of the Exceria Plus as it cannot be used in smartphones, tablets, dash cams and a host of other products that require a much smaller removable memory card."
  ],
  "headers": {
    "1": "Price and availability",
    "2": "Design",
    "4": "Hardware",
    "7": "Performance",
    "11": "The competition",
    "12": "Final verdict"
  },
  "links": {
    "memory cards": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards",
    "1TB Exceria Plus SD card": "https://personal.kioxia.com/en-apac/sd-card/exceria-plus.html#:~:text=KIOXIA%20EXCERIA%20PLUS%20SD%20memory,on%20your%20next%20big%20project.",
    "Amazon UAE": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.ae%2FKIOXIA-EXCERIA-Memory-Class10-photography%2Fdp%2FB08C5JWCYZ%2Fref%3Dsr_1_1%3Fdchild%3D1%26keywords%3DKioxia%2B1TB%2BExceria%2BPlus%2BSD%2Bcard%26qid%3D1605853938%26sr%3D8-1%26tag%3Dhawkuae-21%26ascsubtag%3Dtrd-us-9998020672261840000-21",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "iDrive": "https://www.techradar.com/reviews/idrive",
    "Sandisk Ultra 1TB": "https://www.techradar.com/reviews/sandisk-extreme-1tb-microsdxc-card",
    "Micron 1TB C200": "https://www.techradar.com/reviews/micron-1tb-c200-microsd-uhs-i-card"
  }
}