{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-9t-pro",
  "title": "Xiaomi Mi 9T Pro review",
  "category": "phones",
  "updated": "2020-10-15T10:20:45Z",
  "author": "basil-kronfli",
  "summary": "All-screen all-rounder",
  "verdict": "There’s very little to complain about when it comes to the Mi 9T Pro; its killer design and screen are paired with excellent across-the-board specs. The fact it clings onto the headphone jack will please many, and while there’s no wireless charging, water resistance or stereo sound, given the phone’s price, you’re still getting excellent value across-the-board.",
  "pros": [
    "Premium design",
    "Great battery life",
    "Flagship specs"
  ],
  "cons": [
    "No waterproofing",
    "UI won’t be for everyone",
    "Mono speaker"
  ],
  "article": [
    "If you aren’t quite ready to get a 5G phone and want something more affordable than a Samsung Galaxy Note 10 Plus or Huawei P30 Pro to tide you over until 5G coverage improves, then the Xiaomi Mi 9T Pro could be it.",
    "Xiaomi's 2019 handset delivers similar specs to a top-tier phone, despite costing what you would expect to pay for a mid-ranger. There's a follow-up in the form of the Mi 10T Pro, but it's a pricier phone.",
    "With a 6.39-inch Full HD+ Super AMOLED display, it’s similar in size, spec, and screen appeal to pricier phones like the Oppo Reno 10x Zoom, and thanks to a Snapdragon 855 chipset under the hood, it’s also powerful.",
    "Costing just £399 (around $480/AU$720) though, the Mi 9T Pro is nothing short of a steal when you look at its specs. But does it fare as well in the real world?",
    "It's possible we could see the Xiaomi Mi 9T Pro get a price cut for Black Friday or Cyber Monday, but it's not all that likely - Xiaomi has plenty of newer phones it's more likely to reduce instead. During Amazon Prime Day only the company's 2020 smartphones were reduced, nothing older like the 9T Pro. So if you're interested in buying the Mi 9T Pro, we'd recommend just going for it.",
    "The Xiaomi Mi 9T Pro is available in two flavors, with either 64GB or 128GB of storage, and can be bought across Europe. Available for £399 (around $480/AU$720), only the 128GB version is available in the UK, and it can be had in either black or blue.",
    "While there’s been no word on a US release, a variation of the phone, the Redmi K20 Pro, is available in other regions. Additionally, Xiaomi has launched a number of devices in Australia, so while no release has been confirmed at the time of writing, Xiaomi may well add the Mi 9T Pro to its Australian line-up.",
    "The Xiaomi Mi 9T Pro is a great looking phone. From the front, it’s all screen thanks to the fact the pop-up selfie-camera is hidden from sight. Its curved body feels slick, even though it isn’t a thin phone as such at 8.8mm.",
    "The buffed aluminum frame melds smoothly into the phone’s front and rear glass panels, and a couple of red accents pop nicely, one on the power button and the other on the rear camera surround.",
    "The phone’s back panel also features a Kevlar-like striated pattern under the glass, which looks premium, and while it does hold onto fingerprints, it isn’t as bad as the worst offenders - Samsung’s Galaxy S10 series.",
    "In the box, you get a case to protect the back, and the front is Gorilla Glass 5, though unlike some of the competition, the Xiaomi Mi 9T Pro doesn’t include a pre-fitted screen protector.",
    "A design highlight has got to be that headphone jack; we didn’t expect to see it on a phone with top-tier specs, and it’s a welcome break from tradition. There’s also a USB-C port and a mono speaker at the bottom of the phone, and volume and power buttons on the right side.",
    "While there is a very slight camera bump, the Mi 9T Pro’s camera surround is much less protruding and sharp than that of the OnePlus 7 or Honor 20, for example - two direct competitors.",
    "As for the display, it looks glorious. 6.39 inches and a 1080 x 2340 resolution combines with Super AMOLED tech and over 400 pixels-per-inch to deliver a premium experience at a very fair price.",
    "The fact there’s no notch in sight is a boon for the Mi 9T Pro; it makes it feel like a real flagship, showing up much pricier options like the iPhone XR. Viewing angles and brightness are strong and max brightness suffices for comfortable outdoor use.",
    "While we’re not saying the Xiaomi Mi 9T Pro can stack up to the likes of the Samsung Galaxy S10 Plus or Galaxy Note 10 Plus from a screen quality point of view, it’s still best-in-class for the price."
  ],
  "headers": {
    "5": "Xiaomi Mi 9T Pro price and availability",
    "7": "Design and screen"
  },
  "links": {
    "Samsung Galaxy Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Mi 10T Pro": "https://www.techradar.com/news/xiaomi-mi-10t-release-date",
    "Oppo Reno 10x Zoom": "https://www.techradar.com/reviews/oppo-reno-10x-zoom-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Samsung’s Galaxy S10 series": "https://www.techradar.com/news/samsung-galaxy-s10-vs-s10-plus-vs-s10e-which-samsung-flagship-will-suit-your-needs",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "Honor 20": "https://www.techradar.com/reviews/honor-20-review",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "Samsung Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus"
  }
}