{
  "source": "https://www.techradar.com/reviews/benq-ew2780u",
  "title": "BenQ EW2780U professional monitor review",
  "category": "components",
  "updated": "2020-05-18T08:44:55Z",
  "author": "jeremy-laird",
  "summary": "Is smaller smarter when it comes to 4K displays?",
  "verdict": "BenQ’s new premium 27-inch 4K monitor shows smaller can sometimes be smarter thanks to a compact footprint and USB-C connectivity.",
  "pros": [
    "Gorgeous 4K IPS panel",
    "Premium design",
    "Mostly strong feature set"
  ],
  "cons": [
    "USB-C connectivity lacks a hub",
    "Tilt-only stand"
  ],
  "article": [
    "When it comes to premium business monitors, bigger isn’t always better. That’s especially true in a context where 4K or UHD is increasingly the standard resolution for middle and higher tier productivity and content creation displays.",
    "Maintaining rather than increasing that 4K resolution with larger panels, of course, results in lower pixel densities and less visual precision. Bigger displays also eat up more desk space, of course. Enter, therefore, BenQ’s new EW2780U. Similar in many regards to its larger and more expensive 32-inch EW3280U sibling, at 27 inches the EW2780U casts a significantly smaller shadow.",
    "For the most part, however, it shares the same features. That begins with the aforementioned 4K native resolution. But it extends to capabilities such as HDR support, USB-C connectivity, various multimedia features and more. The smaller panel also makes for a lower price. All of which could make this more compact iteration of BenQ’s premium 4K class of monitors the smarter choice.",
    "At $529 and £475 in the UK, the BenQ EW2780U isn’t exactly cheap. But it is competitive for a 27-inch 4K monitor with an IPS panel and, crucially, USB-C connectivity. For now, it’s an unfortunate reality that USB-C adds a significant premium to the price of any PC display.",
    "In terms of industrial design, the BenQ EW2780U is very much a 27-inch Mini Me to the EW3280U’s 32-inch Dr Evil. It sports essentially the same contemporary aesthetic, with slim bezels on three sides of the panel, the lower border forming something of a more prominent chin.",
    "All of that is welcome enough. However, sharing the larger model’s tilt-only stand similarly limits the EW2780U’s flexibility of installation. A monitor of this class really deserves a greater range of articulation. That said, 100mm by 100mm VESA mount compatibility is included. So, if the only thing putting you off the BenQ EW2780U is the tilt-only stand, it can be mitigated.",
    "If the stand falls short of expectations, however, the EW2780U still has an awful lot going for it, starting with its 27-inch panel. Based on IPS technology, it’s the real 4K deal with 3,840 by 2,160 pixels. BenQ claims 99 per cent coverage of the sRGB color space and 95 per cent of DCI-P3, which is good enough for moderately demanding content creation, but arguably short of what’s required for true professional workflows.",
    "The EW2780U also sports BenQ’s HDRi technology. Long story short, it’s a kind of HDR emulation mode that increases contrast and allows the processing of HDR content. It’s similar to the entry-level VESA DisplayHDR400 standard in that it doesn’t involve local backlight dimming or imply true HDR capabilities.",
    "The latter point is obvious enough from the EW2780U’s peak brightness specification of 350cd/m2. Still, with a static contrast rating of 1,300:1 - a cut above the 1,000:1 norm for IPS panels - expectations remain high for overall image quality.",
    "The other major highlight in terms of features is USB-C connectivity complete with up to 60 watts of charging power. As ever, that means a single cable can be used to both drive this display and charge a laptop. It’s a real disappointment, however, to find the EW2780U lacks a USB hub. Consequently, it’s not possible to connect peripherals like a keyboard and mouse to this monitor and use the USB-C interface as a complete docking solution.",
    "Rounding out the headline features is an integrated sound system. Comprising a pair of five watt speakers, it lacks the subwoofer of the larger EW3280U audio solution. But it still promises a cut above the usual display audio thanks to BenQ’s treVolo electrostatic drivers. The idea here is that you can simplify your workspace by deleting the need for dedicated speakers.",
    "Immediate impressions are of an acutely vibrant, punchy display. No doubt the relatively elevated static contrast of 1,300:1 contributes to that impressive performance. Factor in the slim bezels and the result is a very fine looking monitor, both in terms of design and the viewing experience. The default factory calibration is nicely judged too, avoiding excessive saturation. The BenQ EW2780U is very usable right out of the box.",
    "Just as pleasing is the tight pixel pitch, thanks to the combination of 27-inch proportions and 4K native resolution. At 166 pixels per inch, it’s perhaps not a true high DPI display. Apple’s Retina displays for laptops and business Macs, for instance, typically exceed 200DPI. However, it’s significantly higher than the 137DPI of a 32-inch 4K monitor and enough to allow very nice font rendering in Windows and copious detail when viewing still images or 4K video content.",
    "For the record, scaling in MacOS isn’t quite as successful, with fonts looking a little jagged at all but the highest scaling settings. But that’s a function of how MacOS renders its interface, rather than any failing on behalf of the BenQ EW2780U.",
    "As for HDR performance, expectations need to be kept in check. This isn’t a true HDR monitor. Think of it more as an SDR monitor that can support HDR content and you’ll have a more accurate idea. That applies to both the standard HDR mode and BenQ’s HDRi modes, which can be rapidly selected via a quick-jump button and the right hand side of the lower bezel. None offer genuine HDR performance",
    "As for the integrated sound system, it’s above average but still lacks any real dynamic range. The larger BenQ EW3280U, with its rear-mounted subwoofer, puts on a much better audio performance. Still, as a productivity display with a sideline in media consumption, the EW2780U has plenty going for it.",
    "It’s a little less convincing as a content creation panel, which makes sense given BenQ isn’t pitching the EW2780U at content creation pros.The range of color space presets is limited, for instance, and doesn’t include the likes of Adobe RGB or DCI-P3 modes. The quality of the IPS panel is high, of course, and manual calibration would likely yield reasonable results. If that’s the remit, however, a more unambiguously color-accuracy-orientated monitor would be a better choice.",
    "BenQ has achieved an impressive all-round 4K monitor in the new EW2780U. The IPS panel is a peach and, for the most part, the feature set is sound. It does, however, suffer from a few flaws which limit its appeal in a workplace context.",
    "Most obvious is the lack of a USB hub. That’s a particular pity given USB-C functionality with charging support is included. The tilt-only stand undermines flexibility, too. Meanwhile, the limited range of color space presets narrow the EW2780U’s remit and its advertised HDR support doesn’t translate into a true HDR experience.",
    "All that said, given current pricing for 4K USB-C monitors, generally, if none of those limitations are deal breakers, the BenQ EW2780U is quite competitively positioned and still worthy of shortlisting."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design and features",
    "11": "Performance",
    "17": "Verdict"
  },
  "links": {
    "business monitors": "https://www.techradar.com/news/best-business-monitor",
    "4K or UHD": "https://www.techradar.com/news/best-4k-monitors",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "workflows": "https://www.techradar.com/best/best-flowchart-software",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "keyboard and mouse": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "business Macs": "https://www.techradar.com/best/best-business-mac"
  }
}