{
  "source": "https://www.techradar.com/reviews/activecampaign",
  "title": "ActiveCampaign review",
  "category": "computing",
  "updated": "2020-07-15T10:43:18Z",
  "author": "michael-graw",
  "summary": "Smart automation for your email marketing",
  "verdict": "ActiveCampaign is a versatile email marketing platform and CRM with features like smart scheduling and SMS marketing. But, the platform can be very pricey if you have a large number of contacts.",
  "pros": [
    "Predictive email scheduling",
    "SMS marketing campaigns",
    "CRM feature"
  ],
  "cons": [
    "Contact volume expensive",
    "No phone support for Lite or Plus plans"
  ],
  "article": [
    "If you’re looking for the best email marketing software, it’s worth taking a peek at ActiveCampaign. This platform offers a range of advanced features like automation, lead scoring, and machine learning-based email scheduling. Unfortunately, the service can be very pricey if you have a large number of contacts. In our ActiveCampaign email marketing services review, we’ll explain everything you need to know about this platform.",
    "ActiveCampaign stands out for providing users with features that many other email marketing services simply don’t have. One example of this is SMS marketing, which you can use to reach contacts by text rather than by email.",
    "The platform’s machine learning-based features are also somewhat unique. You can use predictive sending to track when your contacts open your marketing emails. During future campaigns, the software will automatically send out your emails at the optimal time to boost engagement.",
    "You can also track the probability of converting a lead into a customer using ActiveCampaign. The software assigns positive or negative scores based on how contacts interact with your content, such as signing up for a webinar or ignoring your emails. For businesses with a lot of subscribers, this can make it easier to focus efforts on the contacts that are most likely to generate revenue.",
    "Getting started with ActiveCampaign is easy thanks to the checklist that launches the first time you log into the service. This helps walk you through basic tasks like importing contacts, adding integrations, and creating campaigns.",
    "To import contacts, you can either upload a CSV database or connect to dozens of other popular email marketing and CRM software platforms. You can also create as many custom tags as you want or build scoring models for leads and contacts to stay organized.",
    "For all the tools that ActiveCampaign includes, the software is well-organized and easy to navigate.",
    "When creating campaigns, you can filter and segment lists to include only contacts. Plus, the platform includes one of the most versatile drag-and-drop email designers that we’ve seen. You have a significant amount of control over how every content element displays, down to deciding whether a block should appear only for contacts that meet certain conditions.",
    "If you want to set up a marketing automation, you have hundreds of templates from which to choose. The visual designer is intuitive and offers highly flexible triggers and responses. For example, you can connect ActiveCampaign to a third-party software like Slack and trigger a message when a contact tag is updated.",
    "One thing that ActiveCampaign is notably missing is a tool for creating landing pages. The software supports highly customizable forms, but you’re left to create your own landing pages through your website design software.",
    "ActiveCampaign takes security seriously and offers a couple layers of protection. On the user end, you can enable two-factor authentication for every account. On the back end, ActiveCampaign has an in-house cybersecurity team that actively searches for points of weakness in the company’s digital infrastructure. The company is HIPAA-compliant and makes its SOC 2 report public to assuage any security fears.",
    "You can get help with ActiveCampaign at any time by email or live chat. All accounts come with free migration if you’re switching over from another CRM or email marketing service. In addition, Professional users get access to one-on-one training sessions and Enterprise users receive free phone support.",
    "The company also has a very robust online knowledgebase, complete with video tutorials and a community forum. We found the help articles to be extremely detailed.",
    "ActiveCampaign plans vary in price according to how many contacts you have. The Lite plan starts at $9 per month when paid yearly (or $15 monthly) for 500 contacts and includes unlimited emails, marketing automation tools, and three user accounts.",
    "On a yearly contract, the Plus plan costs $49 per month for up to 500 contacts, or $70 a month on a rolling basis. It adds lead and contact scoring, SMS marketing, and integrations. You also get up to 25 user accounts with a Plus subscription.",
    "The Professional plan starts at $129 per month when paid annually, or $159 when paid month to month. This plan adds machine learning-based features including automated email scheduling and win prediction. It also comes with three training sessions per month and up to 50 user accounts. If you need unlimited user accounts or more support, Enterprise plans start from $229 per month.",
    "If you’re looking for a cheaper alternative to ActiveCampaign, consider Sendinblue. It offers all the essentials for email marketing at a fraction of the price of ActiveCampaign. You can send 300 emails per day for free or 40,000 per month for just $25, and there are no limits on the number of contacts in your database. That said, Sendinblue lacks SMS marketing and automated scheduling, and its CRM features are much weaker than those ActiveCampaign offers.",
    "ActiveCampaign is a powerful platform that combines the best aspects of email marketing with a CRM. It boasts unique features like automated email scheduling and SMS marketing while also doing a nice job with standard tools like marketing automation and email design.",
    "The biggest downside to this platform is the price. A Plus or Professional plan can cost hundreds of dollars per month even if you only have a small number of contacts."
  ],
  "headers": {
    "1": "Features",
    "4": "Setup",
    "6": "Performance",
    "10": "Security",
    "11": "Support",
    "13": "Plans and pricing",
    "16": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "best email marketing software": "https://www.techradar.com/best/best-email-marketing-software",
    "ActiveCampaign": "https://www.activecampaign.com/pricing/",
    "email": "https://www.techradar.com/best/best-email-clients",
    "webinar": "https://www.techradar.com/best/best-webinar-software",
    "CRM software": "https://www.techradar.com/best/the-best-crm-software",
    "Slack": "https://www.techradar.com/reviews/slack",
    "landing pages": "https://www.techradar.com/best/landing-page-creator",
    "website design software": "https://www.techradar.com/news/best-web-design-software",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "cybersecurity": "https://www.techradar.com/news/cybersecurity-what-is-it",
    "Sendinblue": "https://www.techradar.com/reviews/sendinblue"
  }
}