{
  "source": "https://www.techradar.com/reviews/sony-z8hzh8-8k-tv",
  "title": "Sony Z8H/ZH8 8K TV review",
  "category": "televisions",
  "updated": "2021-02-01T10:50:07Z",
  "author": "john-archer",
  "summary": "So good that its 8K resolution is just a bonus",
  "verdict": "The Sony Z8H / ZH8 combines rich contrast, gorgeously saturated colors, outstanding video processing and, best of all, extreme HDR-friendly brightness, it produce the best LCD TV pictures of 2020, but its 8K support is more limited than it ought to be, arguably making it look expensive for a TV that is essentially a 4K TV \"plus\".",
  "pros": [
    "Bright, colorful pictures",
    "Powerful, detailed sound",
    "Content-rich Android TV"
  ],
  "cons": [
    "Limited 8K support",
    "Android TV can be fussy"
  ],
  "article": [
    "While undoubtedly ground-breaking and spectacular, Sony’s debut 8K TV, the Sony Z9G (called the ZG9 in the UK) wasn’t exactly mainstream. It was only available in 85-inch and 98-inch sizes, priced at $13,000/£14,000 and $70,000/£85,000 respectively.",
    "But the new Sony Z8H/ZH8 8K LED-LCD looks to change things. At $5,999/£5,999, the Z8H/ZH8 is vastly more affordable than anything in Sony’s previous 8K range... though it would have looked better value if it had provided more 8K input options.",
    "As you’d hope of a TV boasting 8K resolution, the Z8H’s connections include an HDMI input capable of receiving 8K/60Hz sources, as well as 4K/120Hz, which could be handy for the next generation of gaming systems. With that in mind, though, it’s a shame only one of the HDMIs supports this level of specification. There will, after all, be two next-gen gaming consoles, as well as a new generation of PCs.",
    "It's a pity, too, that the ZH8 / ZH8 doesn’t support 8K playback via USB or YouTube streaming. We were disappointed to see that the 8K HDMI inputs didn't support variable refresh rates – though this last point has since changed, thanks to an over-the-air update in October. And in spite of any small gripes, the Z8H feels like our best hope yet for 8K.",
    "For starters, its huge 2500 nits of brightness does a spectacular job of unlocking the potential of HDR. Especially as Sony’s approach to backlighting means that the brightness is retained with peerless consistency.",
    "It has more than enough color range to keep up with all that brightness too, ensuring that the picture never looks washed out, and thanks to Sony’s inspired backlight management, the extreme brightness doesn’t come at the expense of impressive black levels or shadow detailing.",
    "Wrapping up a stellar all-round performance is some of the most detailed, powerful and clean sound we’ve heard from a built-in TV audio system.",
    "Is it worth all that money? Well, mostly, yeah.",
    "UPDATE: This Sony TV got something of an upgrade in October 2020, with an over-the-air update adding in support for Variable Refresh Rate and Auto Low Latency Mode – ostensibly to prepare for the launch of the PS5.",
    "Sony’s debut Z9G/ZG9 8K TVs were about as far from mainstream as it’s possible to get. As well as being way too big for most consumers to handle (they started at 85 inches), they cost an absolute fortune.",
    "The Z8H/ZH8, new for 2020, are a whole lot more mainstream: the 75-inch screen size is more manageable for most UK homes, and its £5,999 price tag is far more approachable than the £14,000 starting point of the ZG9.",
    "Over in the US, the 75-inch Sony XBR-75Z8H will only set you back around $5,999 while in Australia your only option is the 85-inch model that costs AU$18,999. None of those sticker prices are cheap, they put Sony in similar territory to Samsung’s latest mid-range 8K models like the Samsung Q950TS, finally introducing some genuine competition for the Korean brand in this niche but growing TV market.",
    "Sony’s current flagship 75-inch 4K model, the Sony X950H/XH95, only costs $2,799/£2,699 but before you decide that you’re happy to sacrifice a few tens of millions of pixels to save more than three grand, bear in mind that the Z8H’s improvements over the X950H aren’t limited to pixels.",
    "The Z8H/ZH8 doesn’t look especially cutting edge. The frame is reasonably slim, but nothing like as narrow as the barely-there bezel of Samsung’s flagship Q950TS 8K TVs. The bezel feels a touch untidy, too, thanks to its mixture of different finishes.",
    "That said, while the silvery metal outer trim that runs right around the screen maybe looks a bit much when viewing the TV head on, it does add a nice premium feel when you’re looking at the screen from any other angle.",
    "The two metal feet Sony provides with the 75ZH8 can be attached either flat towards the screen’s center, or on their edges under the screen’s bottom corners. The latter fit is much more elegant, but the more central mounting option is welcome for people looking to mount the TV on a narrow piece of furniture.",
    "Unlike the Sony A8 OLED, you can’t adjust the feet so that they lift the screen up to make room for a sound bar. As we’ll see, though, Sony might well argue that the TV’s sound is so good you won’t feel the need to add a soundbar anyway. Not least because one of the most unusual aspects of its design finds a narrow forward-firing speaker system sitting below the screen.",
    "The whole TV is extravagantly well built (and injuriously heavy), and its unusually deep, two-tiered rear panel has all sorts of removable plastic covers so that it can still present a clean face - or rather, butt - to the world once you’ve hooked all your sources up.",
    "The Z8H/ZH8 is accompanied by one of Sony’s more premium remote control designs. This boasts a metallic finish that’s easy on the eye and hand, and its buttons are both prominent and, for the most part, well organised. Even better, the buttons are backlit.",
    "Connectivity includes four HDMI and three USB ports, as you would expect of a flagship TV in 2020, as well as Wi-Fi and Bluetooth wireless multimedia playback support, Apple AirPlay 2 and HomeKit support, and Google Chromecast support. Also, much more unusually, there are a pair of gold-plated audio terminals so that you can use the TV’s built-in speakers as the center speaker in a wider sound system.",
    "A firmware update in October upgraded one of the TV's HDMIs (set apart from the others, and clearly labelled as the 8K input) to support 8K at 60Hz and 4K at 120Hz, as well as adding in support for VRR (variable refresh rates) and ALLM (auto low latency mode). It's a pity, though, that there aren’t at least two HDMIs that are compatible with such data rates. After all, we’re about to get two new games consoles potentially offering such features. (I guess Sony wants you to only buy the PS5…)",
    "The other strange quirk of the TV’s 8K input is that you have to choose whether you want it to play Dolby Vision or 8K at 60Hz. So I guess 8K Dolby Vision is off the table.",
    "Not even the Z8H’s ‘special’ HDMI supports variable refresh rates of the AMD Freesync, Nvidia G-Sync or even basic HDMI 2.1 types. Nor is there ‘true’ support for HDMI 2.1’s Auto Low Latency Mode for automatically activating the TV’s Game preset when game sources are detected. Though an Auto Picture Mode actually delivers the same effect when using a PlayStation.",
    "It’s easy to understand why Sony has adopted Android TV for its TV smart features. After all, it gives Sony TVs instant access to a vast amount of content and apps without the brand having to do all of its own negotiations with the myriad app and streaming service providers.",
    "Android does have a few issues, though. It still doesn’t provide all of the key UK catchup apps, for instance - an issue Sony has solved by adding separate support for YouView, which brings the likes of the BBC iPlayer and ITV Hub under one umbrella app.",
    "The Android home page still takes over the entire screen rather than letting you continue watching TV while you browse, and the ‘shelf’ approach to presenting content can look cluttered. Especially as for many people the sheer volume of apps Android TV supports could actually be a bit overwhelming. And unnecessary, really, given that for many people video streaming services are pretty much the only thing they need on a smart TV platform.",
    "Android does run more stably and slickly than it used to, though, despite the range actually using an older processing platform than the cheaper Sony X900H. And while there’s still no support for Apple TV (unsurprisingly), Android TV does offer the likes of Netflix, Amazon Prime Video, YouTube, Google Play Movies, Rakuten, BT Sport and Disney+.",
    "The Android TV support also opens up some useful wider Android-related features, such as built-in Google Assistant voice control, initial set up assistance if you have an Android phone, and Chromecast Built-in support.",
    "In short, the Z8H/ZH8’s picture quality is outstanding, clearly establishing it as Sony’s premium LCD performer for 2020 in more ways than just resolution.",
    "In fact, the first thing that strikes you about it isn’t the benefit of its 8K pixel count, but its dazzling brightness. HDR images blaze off the screen with fearsome intensity, selling the HDR dream of life-like brightness and levels of contrast spectacularly well: measuring the TV’s brightness on a 10% white HDR window confirms that in Vivid mode it pumps out a mighty 2,500 nits, which only drops to around 2220 nits in Cinema mode and around 2,150 in the most ‘accurate’ Custom mode.",
    "The extreme brightness doesn’t just ‘sell’ bright, uniform daylight scenes phenomenally well, either. It also enables the Z8H/ZH8 to achieve remarkable levels of sparkle and intensity with small bright highlights. So, for instance, the ripples on a river on a sunny day glimmer and gleam with an almost ethereal beauty, while streetlights and reflections in eyes or metal during night-time scenes shine forth with levels of local-contrast intensity that have no right to appear on an LCD TV.",
    "As with Sony’s flagship 4K range, its affordable 8K opts not to dim bright HDR objects heavily when they appear against dark backdrops. Crucially, though, whereas the X950H tested previously only had 60 independently controllable local dimming zones, the 75-inch Z8H has 320. So the amount of backlight blooming it reveals around stand-out bright objects is far less widespread and noticeable. Even though black levels are consistently impressive by LCD TV standards.",
    "Not opting to dim the backlight in areas of extreme contrast as much as Samsung TVs do also helps the 75ZH8 retain more shadow detail in very dark picture areas.",
    "Even the most notoriously difficult dark scenes in my 4K Blu-ray movie collection represent zero problems to the Sony ZH8. There’s no bottoming out of black levels into greyness, no crushing of shadow detail, no instablity in either bright highlights or dark areas, no discoloration or color shifting, no compression of dark color shades to the point they start to look noisy.",
    "The Z8H/ZH8’s outstanding combination of brightness, contrast and light consistency feeds into its color performance, too. Every tone in the vast volume of colors its brightness and contrast opens up is portrayed beautifully, combining richness and fullness with immaculate subtlety and admirable consistency.",
    "The X1 Ultimate processor meanwhile, is at its most effective when upscaling 4K and HD content. These sub-8K sources are remapped to the ZH8’s native pixel count without looking in the slightest bit processed or unnatural. On the contrary, they tend to look slightly more precise and pure than they do even on top quality 4K screens. Partly because of the ZH8’s other, non detail-related qualities, and partly because every added pixel is calculated so seemingly perfectly that you can never ‘see the joins’.",
    "As usual, moreover, Sony’s consistently excellent motion processing is once again on hand to ensure that sharpness and detail don’t disappear when there’s motion in the frame. Without, on its most effective settings, causing either the soap opera effect or unwanted processing side effects.",
    "Sony’s processing mastery extends to converting standard dynamic range images to HDR, too. The ZH8’s HDR Remastering actually kicks in automatically with many of the TV’s picture presets without you being able to switch it off. Normally this wouldn’t be a welcome situation. Especially as many TVs struggle to make HDR conversions look credible. Sony’s HDR Remastering is so effective, intelligent and realistic, though, that I struggled to find any issues with it - other than the purist argument, of course, that you shouldn’t mess with the original look of any content.",
    "While its lack of variable refresh rate support is unfortunate, the 75ZH8 is still a deliriously fun screen for gaming on. Its input lag of 21.1ms in Game mode is slightly higher than the 10ms or so achieved by Samsung’s latest 8K TVs. But crucially the 75ZH8 doesn’t trade as much picture quality - in particular, backlight control - as the Samsung sets do. So unless you’re so competitive that 10ms is literally life and death to you, the 75ZH8’s Game mode delivers a more enjoyable all-round experience.",
    "Given that the ZH8’s big story is its 8K resolution, it might seem perverse that we haven't talked much about 8K content. There are, though, two good reasons for this: First, with native 8K sources still so rare, anyone who buys a 75ZH8 will for the forseeable future spend pretty much all their time watching 4K and HD sources on it, not native 8K.",
    "Second, the 75ZH8 isn’t actually very keen on playing 8K sources. It can’t play 8K via USB or streaming sources (including YouTube). Your only 8K option is, therefore, the single HDMI port. So unless you already have a high-end PC or expensive test signal generator, you’ll have to hope the new consoles dabble with 8K, or sort yourself out with one of the ultra-expensive, 8K-capable Nvidia RTX 30 series GPUs.",
    "Even when we did finally get an 8K signal to appear on the 75ZH8, it didn’t look quite as 8K as we expected, raising questions of whether the data management limitations that prevent the 75ZH8 supporting 8K over USB or streaming are also impacting native 8K HDMI delivery too.",
    "While the Sony 75ZH8’s pictures are consistently a joy to behold, its 8K issues aren’t its only picture quality flaws. Black levels in dark scenes look darker on OLED TVs and Samsung’s rival high-end 8K TVs, for instance. And while backlight blooming is much less consistently noticeable than it is on Sony’s XH9505 4K series, it does occasionally crop up. Especially when it seeps into the black bars you get with ultra wide aspect ratio films.",
    "Sony takes what might be called a literal approach to HDR, tracking its luminance values accurately as far as each TV’s brightness can manage. While this ‘no tone mapping’ approach results in more consistent HDR brightness than you get with other brands, it can mean that you lose some subtle detailing in the very brightest HDR areas,",
    "Mind you, thanks to the 75ZH8’s exceptional native brightness, it’s typically only with content that’s been mastered to 4000 nit peaks (most content is rendered much less brightly than that) that the very brightest image elements can occasionally ‘flare out’. And you’ll probably be so busy basking in the brightness and rich colours elsewhere in the picture that you won’t even notice.",
    "The 75ZH8’s upscaling of 4K and HD sources also doesn’t produce quite such sharp and aggressively 8K-looking results as Samsung’s AI-driven upscaling engine. While, though, this may turn the head of people wanting to get as much visible benefit as possible from all those pixels they’ve invested in, there’s also a beautifully and consistently refined feel to the 75ZH8’s upscaling in keeping with the focus on naturalism that’s at the heart of its picture philosophy.",
    "Overall, though, considering how bright the screen gets and how consistently it retains that brightness with HDR content, fractionally shallower blacks and the occasional momentary bloom seem like small prices to pay for such a spectacular HDR experience.",
    "The Z8H/ZH8’s so-called Acoustic Multi-Audio set up is almost as much of a feature as its 8K pictures: tweeters tucked behind the top left and right corners both give sound details a forward ‘push’ and ensure that the sound seems to come from the whole screen area, rather than just from the bottom.",
    "As noted in the design section, two front-firing drivers also sit below the screen, and the rear panel plays host to a couple of bass woofers. There’s built-in Dolby Atmos support too, as well as a Dolby processing mode for adding more ‘scale’ to non-Atmos sources. Sony is so confident of the 75ZH8’s audio capabilities, in fact, that it even provides the option to use its speakers together as the centre speaker in a separates system.",
    "The speaker system rises brilliantly to the challenge of even the most dynamic and raucous soundtracks - Dolby Atmos or otherwise. The Frame Tweeters prove particularly effective on a screen as large as this, ensuring that the common big TV problem of sound only seeming to come from behind or beneath the screen isn’t an issue at all. In fact, together with the surprisingly widely dispersed sound of the front-firing drivers under the screen, the sense of sound effects seeming to come from the parts of the image they’re supposed to be coming from is superb, building on the immersion created by the supremely natural and refined pictures.",
    "In an ideal world the bass from the TV’s woofers might be a little more ready to come out to play but it’s not short of power when it does decide to kick in."
  ],
  "headers": {
    "9": "Price and availability",
    "13": "Design",
    "23": "Smart TV (Android TV 9.0)",
    "28": "Picture quality",
    "39": "8K performance",
    "47": "Audio performance",
    "51": "Don't buy it if..."
  },
  "links": {
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "Sony Z9G": "https://www.techradar.com/reviews/sony-bravia-master-series-z9g-8k-hdr-tv",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "variable refresh rates": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "over-the-air update in October": "https://www.techradar.com/news/ps5-update-brings-next-gen-tech-to-sony-tvs-heres-why-that-matters",
    "got something of an upgrade in October 2020, with an over-the-air update": "https://www.techradar.com/news/ps5-update-brings-next-gen-tech-to-sony-tvs-heres-why-that-matters",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Samsung Q950TS": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "75-inch 4K": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "Sony X950H/XH95": "https://www.techradar.com/reviews/sony-bravia-x950hxh95-4k-led-lcd-tv",
    "Sony A8 OLED": "https://www.techradar.com/reviews/sony-bravia-a8h-oled-tv",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Sony X900H": "https://www.techradar.com/reviews/sony-xh90-kd-75xh9005-4k-tv",
    "Disney+": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}