{
  "source": "https://www.techradar.com/reviews/crashplan-review",
  "title": "CrashPlan review",
  "category": "computing",
  "updated": "2020-07-22T10:03:57Z",
  "author": "michael-graw",
  "summary": "Our CrashPlan review asks if it can be relied on to restore files.",
  "verdict": "CrashPlan is a hybrid cloud storage and data recovery tool that makes it easy to keep full, versioned catalogs of all your files ready for restore.",
  "pros": [
    "No limits on how much data you can store",
    "Create backups to cloud and physical hard drives"
  ],
  "cons": [
    "Upload speeds are surprisingly slow",
    "No mobile app available"
  ],
  "article": [
    "If you’re looking for the best data recovery software, it’s worth taking a close look at CrashPlan. This data recovery and backup platform is one of the simplest options for small businesses. There’s no limit on the number of computers or servers you can have on your account, and no storage limits for individual devices.",
    "So, is this the best option for saving your small business from data losses? Let’s dive into our comprehensive CrashPlan review to find out.",
    "CrashPlan’s pricing is about as simple as it gets. After a one-month free trial, just pay $10 per month per computer you want to back up.",
    "There are no data storage limits on the connected devices and no limit on the number of computers you can add. That makes CrashPlan a lot cheaper than many cloud storage providers, including iDrive, pCloud, and Box, that charge by capacity. But, paying monthly can make this software pricey as a data recovery solution.",
    "CrashPlan is a little different to most data recovery platforms. In fact, it’s a file backup tool first and foremost. But, thanks to the fact that backups are unlimited, it’s easy to use it as a way to recover deleted or corrupted files as well.",
    "CrashPlan comes with its own unlimited cloud storage space, which serves as the default launch point for file recovery. But, you can also back up files to multiple storage locations at the same time. That means you can create one or more physical recovery hard drives as well as keep a catalog of files for recovery in the cloud.",
    "File versioning, a feature usually associated with backup tools, is another strength for CrashPlan. You’re able to keep old versions of files indefinitely, and you have a significant amount of control over how file versions are kept with CrashPlan. That’s extremely important when recovering from file corruptions or ransomware, since you may need to go back a few versions to find a clean copy of your damaged files.",
    "Importantly, the software doesn’t automatically remove deleted files from your cloud storage without permission. That means you can keep a catalog of file versions that extends for years rather than months.",
    "CrashPlan is available as a desktop platform for macOS, Windows, and Linux computers, or it can be installed on Linux servers. There’s also a web client that enables you to schedule backups. Surprisingly, CrashPlan doesn’t offer a mobile app.",
    "The software tags files by folder location rather than file type, which can be both good and bad. On the one hand, it’s quick and simple to make sure you’re backing up all your files to a recovery drive or your cloud space. On the other hand, it’s easy to forget to tag a folder for backup.",
    "When it comes to file recovery, restoring data can be somewhat cumbersome. CrashPlan’s cloud interface doesn’t allow you to easily tag an entire directory for download in one click. So, if an entire hard drive goes down, restoring everything from the cloud requires some patience.",
    "One of the areas in which CrashPlan falls most short is performance. The software took a full 20 minutes to upload a 1 GB file to the cloud on a 25 Mbps connection—about four times as long as we would have expected. But, turning off data deduplication in the program’s advanced settings made a huge difference. That same 1 GB file uploaded in under five minutes.",
    "Downloading, which isn’t subject to deduplication, was much better from the start. We were able to download the 1 GB file in just under four minutes with a 44 Mbps connection.",
    "Since CrashPlan mostly operates in the background, the occasional lengthy upload won’t be a huge issue for many users. On top of that, CrashPlan offers incremental transfers and block-level sync, so most file uploads shouldn’t be particularly large after your initial backup. Unfortunately, multi-threaded backup and recovery isn’t supported, so large recoveries may take a while.",
    "One of the biggest advantages to CrashPlan is that you can set the software to continuously back up files from your computer to the cloud. Thanks to this, it’s pretty simple to set and forget your data recovery plan with CrashPlan. You can also take greater control over your backups with scheduled transfers.",
    "It’s also worth noting that CrashPlan gives you the option to throttle your file transfers to save bandwidth. This setting is sensitive to when your computer is idle, so it’s easy to have the bulk of your uploads take place overnight.",
    "If you’re having trouble figuring out how to recover deleted files, you can get in touch with CrashPlan’s support team by live chat, email, or phone. Phone and chat support are only available during normal US business hours Monday to Friday. Email help is available 24/7, although you may wait several hours for an answer if you send a request during the middle of the night in the US.",
    "For questions about the software and data restoration, CrashPlan also has an extensive online documentation library. Most of the help articles come with walkthrough videos, which is helpful when you’re first learning the software.",
    "While CrashPlan is backup software first, it doubles nicely as a solution for recovering lost files. It’s incredibly easy to use and works great for small businesses. Importantly, the platform allows you to create physical and cloud backups and to keep as many versions of your files as you want. There’s not much to dislike about this software, except that the interface requires you to tag specific folders for storage and recovery.",
    "CrashPlan is designed as backup software with recovery capabilities rather than as a true data recovery tool. It won’t help you get files off a reformatted drive or recover files that have been deleted without a backup. If that’s what you need, check out Data Rescue 5 or OnTrack EasyRecovery.",
    "As for hybrid backup and recovery solutions, Backblaze is the closest competitor to CrashPlan. It’s a bit cheaper, starting at just $5 per computer per month. But, you lose out on advanced file versioning options and the ability to back up to physical drives as well as the cloud.",
    "To see how CrashPlan performs against other data recovery software, read our Best data recovery software buying guide."
  ],
  "headers": {
    "2": "CrashPlan: Plans and pricing",
    "4": "CrashPlan: Features",
    "8": "CrashPlan: Client and client setup",
    "11": "CrashPlan: Performance",
    "14": "CrashPlan: Efficiency",
    "16": "CrashPlan: Support",
    "18": "CrashPlan: Final Verdict",
    "19": "CrashPlan: The Competition"
  },
  "links": {
    "best data recovery software": "https://www.techradar.com/best/best-data-recovery-software",
    "iDrive": "https://www.techradar.com/reviews/idrive",
    "pCloud": "https://www.techradar.com/reviews/pcloud",
    "Box": "https://www.techradar.com/reviews/box",
    "Data Rescue 5": "https://www.techradar.com/reviews/data-rescue-5-review",
    "OnTrack EasyRecovery": "https://www.techradar.com/reviews/ontrack-easyrecovery-review",
    "Best data recovery software": "https://www.techradar.com/best/best-data-recovery-software"
  }
}