{
  "source": "https://www.techradar.com/reviews/xiaomi-redmi-note-9-review",
  "title": "Xiaomi Redmi Note 9 review",
  "category": "phones",
  "updated": "2021-07-23T13:53:35Z",
  "author": "jon-mundy",
  "summary": "Exemplary stamina and top snaps for £200",
  "verdict": "With the Redmi Note 9, Xiaomi zeroes in on battery life and photography as its twin priorities, resulting in a budget phone that occasionally punches above its weight. Performance and design compromises mean that it’s not an outright winner, but showing strength in a number of areas where the Moto G8 fails makes it a viable alternative.",
  "pros": [
    "Great battery life",
    "Strong camera for the price",
    "Screen is LCD but large and bright"
  ],
  "cons": [
    "Plasticky yet hefty design",
    "Mediocre performance",
    "MIUI 12 much improved, but still not perfect"
  ],
  "article": [
    "The Xiaomi Redmi Note 9 is a £200 phone that packs in stellar battery life, a large FHD+ display, and an uncommonly decent camera.",
    "While it doesn’t sport the most attractive design, with an all-plastic body and some rather hefty dimensions, the Redmi Note 9 proves easy enough to wield. And where it really matters, on the front of the phone, you get the benefit of thin(ish) bezels and a tidy hole-punch notch.",
    "The display is a 6.53-inch LCD that gets pretty bright and, courtesy of an FHD+ resolution, is plenty crisp. No, it’s not an OLED, but remember we’re talking about a sub-£200 phone here.",
    "If we’re honest, performance is slightly underwhelming, as a result of a cut-price MediaTek Helio G85 CPU that doesn’t always deliver the most fluid experience. Still, it’s capable of running the latest games reasonably well.",
    "If we’re a little disappointed in how well the Redmi Note 9 runs, we’re very happy with its camera. While calling it a quad-camera setup is a little generous, its 48-megapixel main sensor captures some genuinely decent shots in good lighting.",
    "Even more impressive is the Redmi Note 9’s stamina. It’s good for a full two days of use, thanks in no small part to a positively huge 5,020mAh battery. It’s a brute-force approach that results in the phone’s rather chunky dimensions, but it pays off handsomely.",
    "Xiaomi has taken some steps forward with its latest Android skin, MIUI 12, which is available as an update straight out of the box. It’s a sharper, more flexible, and better-looking UI than before, even if it does continue to suffer from a little too much bloat and app duplication.",
    "All in all, it’s another fine budget effort from Xiaomi. If your priorities for a new phone include great battery life and a decent camera, and you don’t want to pay more than £200 for the privilege, then there aren’t many better picks than the Redmi Note 9.",
    "It may not be our favorite budget phone – it’s hard to look past the benefits of the Moto G8’s classy build and slick software experience in day to day usage – but depending on your specific needs, it might just prove to be yours.",
    "The Xiaomi Redmi Note 9 first hit shops on May 12, 2020. UK prices officially start from £179 for the 64GB model, moving up to £199 for the 128GB model.",
    "At the time of writing, however, Xiaomi was running a 10th anniversary sale whereby the top-spec model could be picked up for just £159, along with a free 10,000mAh Redmi Power Bank. We’ve also seen the lower-capacity model going for the same low price on Amazon.",
    "While we’ll be treating those original prices as the norm here, we’d encourage you to keep your eyes peeled for deals. You can clearly expect to get yourself a hefty saving on Xiaomi’s new affordable contender.",
    "When it comes to design, the Redmi Note 9 sits at the ‘functional plastic’ end of the spectrum. There isn’t so much as a hint of metal here, and the only glass you’ll find is the Gorilla Glass 5 panel that covers the front.",
    "You wouldn’t expect premium materials in the sub-£200 price category, of course. And to Xiaomi’s credit, it delivers the plastic aesthetic in the form of a striking eggshell blue frame finish and a rear panel that shifts from sky blue at the top to lavender at the bottom. That’s the Polar White model we were sent, anyway. The Forest Green and Midnight Grey models don’t look quite as snazzy.",
    "This is a pretty large phone for the price. It’s rather tall at 162.3mm, particularly thick at 8.9mm, and really quite heavy at 199g. You can probably thank the phone’s huge battery for those last two stats.",
    "Xiaomi has eschewed the use of an in-display fingerprint sensor with the Redmi Note 9, which is a clear money-saving measure. That’s not necessarily a bad thing in our book, as in-display technology remains a beat slower than equivalent stand-alone sensors.",
    "What we don’t like so much is that the fingerprint sensor here is rather hard to locate. Not only does it lack edge definition, making it hard to feel out, but it sits rather anonymously as part of the extended camera module, so it’s also visually indistinct.",
    "Around the front, the Redmi Note 9 has the kind of minimal bezels and punch-hole selfie camera that you’d associate with a slightly pricier phone. We’re accustomed to cheaper handsets going with a central teardrop notch, so it’s a classy touch.",
    "The bottom edge houses a mono speaker, a USB-C port, and a 3.5mm headphone jack for all you sworn never-Bluetoothers. But it’s the top edge that contains the biggest curiosity – an IR blaster that can be put to use as a back-up remote control for all your living room gear.",
    "A sub-£200 price tag guarantees one thing when it comes to the Xiaomi Redmi Note 9’s screen: it’s no OLED. That’s the bad news.",
    "The good news comes in the form of a large 6.53-inch IPS LCD that typically hits a reasonably bright 450 nits. It outputs a Full HD+ resolution, too, which still isn’t a guarantee at this price point (hello Moto G8).",
    "For a cheap LCD, this is pleasingly colour-accurate. You’re never going to get those deep inky blacks, of course, but viewing images and videos on it remained a thoroughly pleasant experience throughout our test period.",
    "Opting for the Saturated display mode gives colours a little more pop, although the difference isn’t anywhere near as pronounced as on Xiaomi’s OLED-packing devices such as the Poco F2 Pro. As it was, we were happy with the default Auto mode.",
    "You won’t see any higher refresh-rate wizardry with the Redmi Note 9, which largely remains the preserve of pricier phones. But in general, Xiaomi has focused on the right things with this budget display.",
    "We’ve tended to be mightily impressed with the camera technology Xiaomi packs into its Redmi Note range. Last year’s Redmi Note 8T punched well above its weight with a largely impressive quad-camera setup, and the Redmi Note 9 appears to be very similar indeed.",
    "Once again, you get a 48-megapixel main sensor, an 8-megapixel ultrawide, a 2-megapixel macro and a 2-megapixel dedicated depth sensor. We feel like a stuck record here, but the 2-megapixel macro really isn’t worthy of the space it takes up, and the depth sensor feels rather superfluous.",
    "The lingering suspicion is that budget phone manufacturers simply throw such components into the mix because they’re a cost-effective way of hitting ‘quad-camera’ status. Call us cynical, but we can’t see how either of these 2-megapixel sensors add anything meaningful to day-to-day shooting.",
    "Grumbles aside, we’re largely impressed by the pictures the Redmi Note 9 captures. So long as the lighting is good, you’ll get the kind of crisp, well-balanced shots that you’d have expected to pay £400 or more to achieve not so long ago. We did pick up the odd hint of overexposure – but, by and large, the phone handled high dynamic range scenarios admirably well for its price.",
    "The 8-megapixel ultrawide angle sensor matches the tone of the main camera quite well, although looking closely reveals plenty of noise – especially as your attention moves out to the edges of the frame. Still, it’s always a welcome option.",
    "Standard 1X shots take the visual information from four pixels to create one decent one, thus churning out sharper 12-megapixel snaps. Even without a dedicated telephoto lens included, it’s possible to secure usable 2X shots using that pixel-packed main sensor in conjunction with some smart Xiaomi software. Any higher on the zoom front and you’ll start to notice some serious noise.",
    "We did achieve usable results in a well-lit restaurant at lunchtime, where the food shots looked appropriately vibrant. Xiaomi’s AI assistant, as ever, proves pretty savvy at picking out such scenes and making the appropriate adjustments to the camera’s tone and focus.",
    "That said, the Redmi Note 9 doesn’t handle very low-light or night-time scenarios well, which is where its budget nature truly betrays itself. There’s a dedicated Night mode here, which will brighten such shots significantly, but it produces shots that are full of grainy artefacts and therefore distracting.",
    "Video capture isn’t up to the standard of the Xiaomi Redmi Note 8T, with a mere 1080p 30fps on offer rather than the 4K 30fps/1080p 60fps of its predecessor. But it does a basic job.",
    "There’s A 13-megapixel front camera here, too, which is fine for selfies once you’ve reset the ghastly ‘beauty’ effects.",
    "Oh, and one final note to Xiaomi and every other manufacturer that chooses to slap a branded watermark on every photo by default: stop. Please. Just stop. Yes, you can fish around in the settings menu to switch off this annoying feature, but we really shouldn’t have to.",
    "The Xiaomi Redmi Note 9 isn’t a particularly hot performer. You don’t get the Snapdragon 665 CPU that key rivals such as the Moto G8 do, or even last year’s Redmi Note 8T for that matter, which is a bit of a downer.",
    "Instead, this phone is fitted out with the cheaper MediaTek Helio G85. Look at the benchmarks and you won’t notice much of a difference between these two chips in terms of raw performance. An average Geekbench 5 multicore score of 1,273 is pretty comparable to Qualcomm’s more popular budget chip.",
    "In the hand we noticed small but fairly frequent stutters when navigating between home screens, moving between menus, and simply unlocking the Redmi Note 9. That’s all pretty standard, non-intensive stuff we’re talking about, which meant we were never in any doubt that we were using a cheap phone.",
    "For gaming, though, the Redmi Note 9 holds its own. Grimvalor looks and moves great, as does Dead Cells – two slick action-platformers where you really notice those dropped frames.",
    "Conversely, while The Gardens Between runs reasonably smoothly, it does so with the odd stutter and a drastically reduced level of visual fidelity. Its Tenet-style time-warping puzzles seem to tax the chip into a Low settings state, or else the developer simply hasn’t properly optimised the game for this less mainstream silicon.",
    "The choice of internal storage capacities is ample at either 64GB or 128GB. You can’t really ask for more at this price.",
    "We also appreciate that the handset features NFC for full Android Pay compatibility, which is important in these increasingly cashless times. While this isn’t an unusual inclusion, it’s worth remembering that the Moto G8 omits NFC.",
    "While the Xiaomi Redmi Note 9 ships with Android 10 and MIUI 11, we found that there was an update to MIUI 12 available from the get-go. It’s a considerable improvement, once you’ve spent some time tinkering with its many customisation options in the Settings menu to get it just so.",
    "You’ll need to manually activate the gesture navigation system, for example, and it doesn’t turn on the new split Notification Shade/Control Center menu by default. When activated, we found that this latter iOS-aping provision successfully declutters the somewhat overstuffed Android default.",
    "You don’t get the fancy new live wallpapers of more capable Xiaomi/Poco phones with MIUI 12, but that’s a small sacrifice. It’s likely that these wouldn’t have run too well on the Note 9’s limited hardware, judging from our experience.",
    "Elsewhere, MIUI 12 has sharpened up the spacing and shaping of its icons, and it doesn’t feel quite as ‘Fisher Price’ as it once did. It’s still far from the best Android skin, failing to approach OxygenOS levels of sharpness and slickness, not to mention Motorola’s feather-light approach. And it still, rather maddeningly, scans apps you’ve just downloaded from the Google Play Store and uses this so-called ‘Security’ system to serve up unwanted ads.",
    "Bloatware remains a bit of an issue, too, with an extra web browser, a bespoke Notes app, Xiaomi’s usual Themes app and a folder filled with at least half-a-dozen pre-installed third-party apps. Yes, we probably would have installed Netflix and Facebook at some point, but that’s a choice we’d like to make for ourselves.",
    "Elsewhere, MIUI 12 at least has the decency to leave the Google Feed well alone to the left of the main home screen, and it’s generally quite customisable without being too in-your-face or cluttered.",
    "The Xiaomi Redmi Note 9 has a 5,020mAh battery. That would be considered pretty huge in a top-end phone with a 4K 120Hz display, let alone in a budget phone with much less demanding hardware.",
    "However, size isn’t everything when it comes to battery life; software smarts are also necessary if you want decent stamina. Nevertheless, it counts plenty. And the result is that this is a proper two-day phone.",
    "Unless you’re an out-and-out power user or a total media hound (and if you are then this probably isn’t the phone for you anyway), you’ll get through two full days of use in between charges.",
    "When you do hit the streaming services, the Xiaomi Redmi Note 9 has good if not outstanding stamina. We watched an hour of Netflix with the screen brightness set to half, and it sapped 7% of a charge – a good, but not freakishly good, result.",
    "Also notable is the fact that the Redmi Note 9 supports 18W fast charging. No, it’s not the fastest standard on the market, but it’s still noteworthy in such a cheap phone.",
    "First reviewed: August 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Xiaomi Redmi Note 9 price and availability",
    "12": "Design",
    "19": "Display",
    "24": "Cameras",
    "35": "Specs and performance",
    "48": "Battery life",
    "53": "Don't buy it if..."
  },
  "links": {
    "Moto G8": "https://www.techradar.com/reviews/moto-g8-review",
    "Power Bank": "https://www.techradar.com/news/top-portable-chargers",
    "Poco F2 Pro.": "https://www.techradar.com/reviews/xiaomi-poco-f2-pro-review",
    "Redmi Note 8T": "https://www.techradar.com/reviews/xiaomi-redmi-note-8t-review"
  }
}