{
  "source": "https://www.techradar.com/reviews/utorrent",
  "title": "uTorrent torrent client review",
  "category": "computing",
  "updated": "2021-08-09T13:16:01Z",
  "author": "jitendra-soni",
  "summary": "The popular torrent client has some caveats attached these days...",
  "verdict": "A very lightweight and slick torrent client that comes with loads of features, but there are serious concerns on the security front here, sadly.",
  "pros": [
    "Lightweight app",
    "Free and paid versions",
    "Easy to use",
    "Plenty of features"
  ],
  "cons": [
    "Closed source nature",
    "Worries over safety"
  ],
  "article": [
    "Among all the torrent clients, uTorrent is one of the most popular. This application is miles ahead of its competitors when it comes to the user base size, usability, speed, features, and paid variants.",
    "Unlike most other torrent clients, uTorrent focuses on performance. The installer application is just over 4MB in size which is tiny compared to other torrent clients. It also avoids being a memory hog that slows down your devices by using up too many resources.",
    "While this BitTorrent-based client is extremely popular for the reasons mentioned above, it still has issues, which we will cover later.",
    "Unlike most rivals, uTorrent offers multiple variants of its client, as follows:",
    "Basic/Classic: As the name suggests, this is the most basic version of uTorrent and can be downloaded for free. However, it comes laden with adverts in the interface, and the free version doesn’t offer additional features that pro users get.",
    "Ad-Free: This is the basic version without all the distracting advertisements. It claims to use less bandwidth and comes with premium support. The ad-free version of uTorrent is available for $4.95 per year, so it is not expensive.",
    "Pro: The Pro version of uTorrent is aimed at serious users who prefer a secure torrenting experience. Like the Ad-Free version, Pro also comes with no ads, and further benefits from advanced security that helps in blocking possible threats. Pro is available at $19.95 per year.",
    "Pro+VPN: This variant adds a paid version of CyberGhost Premium VPN over and above the Pro version. This helps to keep the user anonymous while downloading content from the internet, and uTorrent Pro retails at $69.95 per year.",
    "Apart from these different versions, uTorrent also offers other products like an Android app with free and pro versions. There is also a remote app available for Android users, and another utility called uTorrent Web. Both uTorrent Web and the remote app are available to download for free.",
    "The website accepts payment in the form of cryptocurrencies, as well as regular payment via cards.",
    "uTorrent is available on all the main desktop platforms like Windows, Mac, and Linux, and as mentioned above, it has a couple of Android applications too. The current stable version is 3.5.5 build 45660 for Windows that was released on May 20, 2020. macOS is on version 1.8.7 build 45548, which was also released on May 20.",
    "In the case of Linux, uTorrent is available for Debian 6 and 7, Ubuntu 12.04 and 13.04, with the latest build again released on May 20.",
    "uTorrent is certainly feature-rich, and there are a number of really useful pieces of functionality that are available across all variants of the client.",
    "For starters, uTorrent allows users to schedule a speed cap for different times of the day. For example, if a user wants the torrent client to use the maximum bandwidth for automatic downloads during the night, this can be done right from the settings.",
    "It’s also possible to set a cap on the maximum bandwidth that can be used by the torrent client for downloads (thus ensuring that other more important online tasks don’t have all their bandwidth stolen).",
    "Like most of the other torrent clients out there, uTorrent also allows users to manage downloads remotely. It has a dedicated Android application that allows you to trigger (or stop) downloads on your home PC while you’re away.",
    "Another neat touch is the ability to add RSS feeds within the client, and while that’s not a unique feature to uTorrent, it’s very useful for automatically firing up downloads whenever there’s new content added to the feed.",
    "Users also benefit from proxy settings which are helpful for those who are privacy-focused and use a VPN while torrenting. It allows users to set proxy profiles based on their VPN’s requirements.",
    "Finally, another noteworthy point is that uTorrent allows you to turn off, restart, or hibernate the PC once a download is finished.",
    "uTorrent has a smartly laid out interface that is easy to use. It has a menu bar on the top, while some quick access settings are present on the left. The central panel shows the downloads that are completed or are in progress. Overall, uTorrent has an uncluttered UI with most settings gathered under just a couple of drop-down menus, making it easy to navigate.",
    "Unlike some other torrent clients, uTorrent does not support external plugins, and since the software is not open source, the creation of third-party plugins is impossible.",
    "The user experience really sets uTorrent apart from all other torrent clients. The entire interface is very intuitive and easy to use. Even a first-timer to the torrenting world will be able to use the software and initiate downloads without any help.",
    "Using a torrent client may well be safe enough, providing you’re sensible, although it’s always advisable to employ a good VPN client while downloading content via torrents; better safer, than sorry, as it were.",
    "However, some torrent software is cause for concern on the security front, and sadly this appears to be the case with uTorrent. The program’s EXE is flagged up by 18 of 72 antivirus applications on VirusTotal, and that’s a worryingly high amount of warnings.",
    "While this does not necessarily mean terrible things will happen to your PC, it definitely injects a serious note of caution when it comes to downloading and installing uTorrent, sadly; and could be wrapped up in the amount of advertising pushed by the basic app (or of course worse problems still).",
    "While torrents allow users to download their favorite content off the internet, and these clients make the process easier, remember that there is, of course, copyrighted material online, and downloading that is breaking the law. Of course, TechRadar does not support or endorse piracy or illegal downloads.",
    "This is an impressively well-featured torrent client which benefits from an intuitive interface, but those positive points are rather marred by the results from VirusTotal, which certainly cast a shadow of doubt over uTorrent."
  ],
  "headers": {
    "3": "Pricing",
    "10": "Versions",
    "12": "Features",
    "19": "Interface",
    "21": "User experience",
    "22": "Security",
    "25": "Piracy",
    "26": "Final verdict",
    "27": "You might also like"
  },
  "links": {
    "uTorrent": "https://www.utorrent.com/",
    "torrent clients": "https://www.techradar.com/best/torrent-client",
    "VPN client": "https://www.techradar.com/vpn/best-vpn",
    "antivirus": "https://www.techradar.com/best/best-antivirus"
  }
}