{
  "source": "https://www.techradar.com/reviews/adobe-creative-cloud",
  "title": "Adobe Creative Cloud review",
  "category": "computing",
  "updated": "2020-08-18T15:24:43Z",
  "author": "steve-paris",
  "summary": "Is getting creative on the cloud a sensible option?",
  "verdict": "Creative Cloud may seem expensive at first glance, but delve into it a little and you’ll realise just how much is on offer here.",
  "pros": [
    "Cheap subscription considering what’s on offer",
    "Free trial available",
    "Access to all of Adobe’s apps"
  ],
  "cons": [
    "Subscription for a single app isn’t cost-effective",
    "No option to outright buy standalone apps",
    "Expensive for non-professionals",
    "Over reliance of your web browser is frustrating"
  ],
  "article": [
    "When it comes to creative apps, Adobe is the undisputed 400lb gorilla in the room. Aside from a handful of consumer products, nearly all its software for Windows and Macs is available via Creative Cloud, on a subscription basis.",
    "Subscriptions mean you don’t own the software you’re spending money on, you have to keep forking out every month, and if you cancel the payments, you no longer have access to those apps.",
    "There are however a lot of advantages to this scheme. The most obvious one is being able to always have access to the latest version, and Adobe don’t rest on their laurels: they regularly update their apps, with fixes and major revisions.",
    "Adobe offers its portfolio either as an all inclusive price, or if you prefer, you can choose which apps you wish to pay for and leave the rest. There is however a huge financial and creative incentive to go for the all inclusive option.",
    "There are also different prices whether you’re an individual, in education, or part of a team or business.",
    "Single users will opt for the Individuals option, and they can get all apps and 100GB of online storage for $52.99 (£49.94) per month. If you’d rather pay for only the apps you need, all of the big software packages like InDesign, illustrator, After Effects, Premiere Pro, etc, will set you back $25.49 (£19.97) per month, each. If you pay for three of them, you might as well get them all.",
    "Students and teachers get the whole lot for only $19.99 (£16.24) per month for the first year (the price goes up to $31.86 (£25.28) after that, but that’s still nearly half the price of what Individuals pay).",
    "Teams are more expensive - $33.99 (£25.28) per month excluding VAT for a single app, or $79.99 (£59) for all of them, per licence. The more people are on your team, the more expensive this can get. However, there are many advantages to going for the Teams option. For one thing, it offers 1TB of online storage; it enables collaborative video editing (see our Adobe Premiere Pro review for a glimpse of what that offers); you can reassign licences at will should you go for the single app route and have more team members than licences, because not all of them will use the same app at the same time; you can control this via a centralised deployment system; you have access to volume discounts (should you order 10 or more licences), 24/7 tech support, 1:1 sessions with design experts, a shared Adobe Stock plans, and unlimited job postings on Adobe Talent.",
    "If this may still seem like a lot of money, let’s take a quick look at a competitor of Adobe’s in the video market: Avid Media Composer, a powerful video editing tool. You can buy it outright for $1,499 (£1,299) or, like Adobe, subscribe to the service for between $23.99 (£21) per month or $34.99 (£31), depending on whether you agree to subscribe for one year or just pay each month as you go.",
    "Yes, Adobe’s plans are more expensive, but the range of tools they offer is head and shoulders above the competition. Adobe’s apps are also perfectly integrated with one another, enabling you to effortlessly move your work between them. You have a wealth of technology at your disposal to bring out the best in your creative work. With that in mind, Adobe’s pricing is pretty hard to beat.",
    "When participating with a team project, rather than saving it locally, it’s saved online. The media isn’t sent to the cloud necessarily, that’s based on your need and preference, but if you’re working on a video project for example, you can have one person ingesting, another editing captions, and yet another editing sequences.",
    "Subscribing to Creative Cloud also means gaining access to Adobe Stock photography, footage, website building templates and other assets. If you’re looking for video, you can hover the cursor over its thumbnail to get a preview of the footage over time, without having to download the clip in the first place. This enables you to get a good idea of what you’ll be using.",
    "If suitable, you can then download it free of charge and use it in your project. It’ll be watermarked and of a lower quality, but once you’re ready to complete your work, if you haven’t shot any other footage that’s better, you can licence and purchase it. The watermarked clip will be automatically replaced with the full resolution version, and any changes or effects you applied to it in the meantime will be fully preserved.",
    "Any asset you upload to Creative Cloud will be accessible from whichever computer, tablet or phone you’re working on. You can have shared libraries which other users can access and contribute to, and the motion graphic templates from Premiere Pro and After Effects can be stored there as well.",
    "Creative Cloud also offers you the ability to contribute to Adobe Stock. There are obviously legal hoops you have to jump through, such as making sure you have written permission from everyone in the shot you’re submitting, but once your footage has been cleared, you’ll be able to earn royalties when anyone uses your work in their final projects.",
    "All of this is controlled via Adobe Creative Cloud. This is an app that mostly works in the background, lets you see which software you have access to, and which products you’ve downloaded.",
    "Once installed, Creative Cloud resides on your computer in the apps folder. This is where you can control everything to do with the service. You can see which apps have updates, and reassuringly, Adobe doesn’t automatically download them for you, so you can work using your current version, at least until you’ve finished your latest project, and checked out what the new features are all about.",
    "The Your Work section is where you can monitor which of your files are stored in Creative Cloud.",
    "You can use the app to discover other parts of Adobe’s vast empire, such as its collection of fonts. The interface is a little odd at that point as you only see the fonts you’ve already downloaded and if you want to browse for more, the app sends you to your web browser to search for the ones you need. Once you’ve downloaded them they appear instantly in Creative Cloud’s font section.",
    "Discover is a section devoted to offering you tutorials, or showcases the work of others in fields that interest you, such as Photography, Design and Layout, Video and Motion, Illustration, UI and UX, 3D and AR. Select some or all of them to see what’s available.",
    "You have a handful on display, and clicking on ‘view more’ will, again, take you to your web browser to check out additional ones.",
    "Thankfully, the search field displays results right inside the Creative Cloud app, but clicking on any results, be it promoted or found through a search query, will, yes, again, send you to your browser to read or watch it.",
    "Stock is Adobe’s entire library of photos and videos. You’re offered 10 freebies to get you started with a free 30-day trial. Clicking on the ‘Launch’ button will take you to, you guessed it, your web browser where you’re likely to find any image or footage you can possibly imagine. You can also access Stock from within Adobe’s apps themselves, so you can edit a video, for instance, search Stock and add something straight to your project without ever leaving Premiere Pro.",
    "You get a lot for your money with Adobe Creative Cloud, from online storage to collaborative features, and of course all the apps you could possibly want in order to generate content. The combined weight of all this, plus the fact Adobe regularly updates all of its apps, means you might see immense value in this subscription option, and to seal the deal, they offer you a free 7-day trial, so you really have nothing to lose by checking it out."
  ],
  "headers": {
    "3": "App options and prices",
    "10": "Online teams",
    "13": "Cloud control",
    "23": "Final verdict"
  },
  "links": {
    "Creative Cloud": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-1457470373592491800&url=https%3A%2F%2Fcreative.adobe.com%2Fpromo%2FTechradarCCI%3Fsdid%3D55KD8WD3%26mv%3Daffiliate",
    "Individuals option": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-1422502740364380400&url=https%3A%2F%2Fcommerce.adobe.com%2Fcheckout%2Femail%2F%3Fcli%3Dadobe_com%26co%3DUS%26ctx%3Dacom%26items%255B0%255D%255Bcs%255D%3D0%26items%255B0%255D%255Bid%255D%3D632B3ADD940A7FBB7864AA5AD19B8D28%26lang%3Den",
    "Students and teachers": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-1078719287226696700&url=https%3A%2F%2Fcommerce.adobe.com%2Fcheckout%2Femail%2F%3Fcli%3Dadobe_com%26co%3DUS%26ctx%3Dacom%26items%255B0%255D%255Bcs%255D%3D0%26items%255B0%255D%255Bid%255D%3D29A572E433E1EBD4E4AF659D8F34C3CD%26lang%3Den",
    "Teams": "https://tracker.tradedoubler.com/click?p=265883&a=3009146&g=22913796&epi=trd-us-2748559607218361300&url=https%3A%2F%2Fwww.adobe.com%2Fcreativecloud%2Fplans.html%3Fplan%3Dteam",
    "Avid Media Composer": "https://www.techradar.com/reviews/avid-media-composer-ultimate-201812"
  }
}