{
  "source": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
  "title": "Xbox One S review",
  "category": "gaming",
  "updated": "2021-11-09T14:51:21Z",
  "author": "nick-pino",
  "summary": "Xbox One S balances power and price",
  "verdict": "Xbox One S is the pinnacle of what Microsoft set out to create with the original Xbox One. Despite releasing more than three years ago, the One S is everything a game console should be: sleek, powerful and well-stocked. It's not quite at Xbox One X's level in terms of performance, but the Xbox One S makes a compelling argument in how it balances power and price point.",
  "pros": [
    "Vastly reduced physical footprint",
    "4K & HDR streaming",
    "HDR gaming"
  ],
  "cons": [
    "Needs adapter for Kinect",
    "4K gaming limited to upscaling"
  ],
  "article": [
    "The Xbox One S launched three years after the original Xbox One. At the time it captured our attention as a quieter, smaller, higher-quality gaming machine that showed-off the capabilities of the current-gen console.",
    "But the question is: can we still recommend it even though Microsoft has since released the more powerful Xbox One X? With the Xbox One X now discontinued and the Xbox Series X/S on the horizon, that's now become a complicated question.",
    "In the seven years that have passed since the Xbox One S was first launched, the console is still a firm favorite for those that want a high-quality Xbox experience but without the higher price of the outgoing, top-tier Xbox One X.",
    "With the Xbox One S, you get Xbox One games that are upscaled to Ultra HD (aka 4K) with HDR. It’s worth pointing out that this isn't the 'native' 4K that's offered by the more powerful Xbox One X, but movies and TV shows still take advantage of the room to improve, whether you're playing an Ultra HD Blu-ray or streaming 4K Netflix.",
    "Since it was first released, Microsoft has streamlined the console even further by releasing the (now discontinued) Xbox One S All-Digital Edition. This is a system without a disc tray that can only play downloaded games from the Xbox Live Store. The good news is it comes in even cheaper than the standard Xbox One S.",
    "This is especially impressive when you consider the reasonable launch price of the original One S 1TB console, which was: $349 (£299 / AU$499).",
    "The One S remains a fantastic and affordable option. In fact, thanks to Microsoft's Smart Delivery system it could remain a viable option for some time. However, if you're looking for a more powerful, but still affordable, alternative and don't want to be left out of the next generation of Xbox then it's worth checking out the all-digital Xbox Series S. Luckily for you, we have a handy Xbox One S vs Xbox Series S guide to answer all your questions.",
    "Our original review of the Xbox One S below details everything you need to know about Microsoft's upscaling console including its performance, design and capabilities.",
    "If you're interested in Xbox's competition, you're probably wondering how the Xbox One S stacks up against the PS4 Slim that was released around the same time. For you guys and girls we put together a special guide that should answer all your questions: Xbox One vs PS4.",
    "More interested in how it stacks up against the PS4 Pro? Watch this video to find out!"
  ],
  "headers": {
    "10": "Xbox One S FAQ: quick questions answered"
  },
  "links": {
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "now discontinued": "https://www.techradar.com/news/xbox-one-x-discontinued-ahead-of-xbox-series-x-release-reports-claim",
    "Xbox One games": "https://www.techradar.com/best/best-xbox-one-games",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Xbox One S All-Digital Edition": "https://www.techradar.com/reviews/xbox-one-s-all-digital-edition",
    "Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One S vs Xbox Series S": "https://www.techradar.com/news/xbox-series-s-vs-xbox-one-s-the-cheapest-xbox-consoles-compared",
    "Xbox One vs PS4": "https://www.techradar.com/news/gaming/consoles/ps4-vs-xbox-720-which-is-better-1127315",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro"
  }
}