{
  "source": "https://www.techradar.com/reviews/hyperx-cloud-alpha-s-2020",
  "title": "HyperX Cloud Alpha S review",
  "category": "computing",
  "updated": "2020-06-23T19:55:17Z",
  "author": "taylor-clemons",
  "summary": "High-end headset, high-end sound",
  "verdict": "The HyperX Cloud Alpha S is an excellent headset for both PC gaming and with the Xbox One X. If you mainly use a PS4 or Nintendo Switch, you'll still get great audio, but you won't be able to take advantage of the 7.1 CH virtual surround sound.",
  "pros": [
    "7.1 ch surround sound",
    "Durable construction",
    "Comfortable"
  ],
  "cons": [
    "Expensive",
    "Limited surround sound use with consoles"
  ],
  "article": [
    "Finding a high-end gaming headset that strikes a balance between PC and console gaming compatibility can be tricky. Connectivity and compatibility are top priority, and a lot of premium headsets are made to be used with just one type of console or only PCs. However, the HyperX Cloud Alpha S is designed for gamers who are just as comfortable on the couch as they are in a gaming chair. The robust build and multiple connection options make it an excellent choice for anyone looking to invest in a quality, high-priced headset that will last for years.",
    "The Cloud Alpha S sells for around $129.99 (£105, U$190), placing it on even ground with the Razer Kraken Ultimate which sells for the same price and just under other high end competitors like the $179.99 (£145/AU$263) Corsair Virtuoso and the $149.99 (£121, AU$219) SteelSeries Arctis 7.",
    "The headset features a solid aluminum frame and ear cup support forks to resist corrosion and provide durability while remaining lightweight. Both the headband and ear cups are made with memory foam cores and faux leather covers for added style – the headset comes packaged with a secondary set of cloth-covered ear cups for breathability. Anyone with a larger head will appreciate the memory foam construction as it eases the clamping pressure. While not exactly painful, the headset is a bit on the heavy side and the clamping pressure can cause some discomfort during long gaming sessions.",
    "Each ear cup is built with dual chamber drivers that separate bass notes from mid and high range sounds for enhanced audio distinction. They also have bass adjustment sliders which let you select three different levels of bass for each ear for custom equalization. The microphone has a bi-directional pickup with noise cancelling technology and Discord certification so that your team chat is always crystal clear. The mic also detaches in a flash for playing solo missions or using the headset to listen to music.",
    "The headset uses a 7.1 channel virtual surround sound mixer that is built into the connection lines to give you deep, rich audio, and the ability to pinpoint sound cues like enemy footsteps and gunfire. You can activate the surround sound or turn it off with the push of a button – though once you use it, you won't ever want to turn it back off.",
    "The module also features buttons for quickly adjusting volume, balancing game audio with chat, and quick muting your microphone. It uses both a USB dongle and 3.5mm audio jack to power the headset when used with a PC or Xbox One X. The headset attaches to the module with a hardwired 3.5mm audio jack and can be quickly removed for use with mobile devices for listening to music or using with a PS4 or Nintendo Switch console. However, if you primarily play games on either of these consoles, you won't be able to use the 7.1 channel surround sound module; you'll still get excellent audio quality and an incredibly immersive listening experience, but half of the headset's features will be unusable.",
    "We tested the headset with The Last of Us Remastered on PS4 and were quickly reminded of how terrifying a zombie apocalypse should be. Each haunting groan and rapid series of clicks from the Clickers created a growing sense of dread and highlighted the need for caution as Joel and Ellie made their way across the devastated landscape. The over-ear design of the ear cups do a decent job of blocking out ambient sound so we can focus entirely on in-game audio, though very loud noises can be heard over gunfire and in-game music.",
    "For Animal Crossing New Horizons for the Switch and it’s a stark contrast. While there aren't a lot of audio cues for gameplay or any real need for high-quality headset audio, it’s relaxing to hear the breeze in the trees and soft music as we dive into designing our perfect island escape.",
    "To test the 7.1 CH surround sound, we used it when Watching YouTube videos and Netflix shows on a PC with the 7.1 Surround Sound provides a more clear, cinematic and immersive audio experience. Likewise, it does the same with PC games like Sayonara Wild Hearts. With its dance pop-heavy soundtrack, it’s easy to get lost in the brilliant orchestrations and heartfelt lyrics as we fly through dozens of neon-lit levels, collecting items and avoiding being eaten by robotic wolves or shot by skull bats.",
    "The HyperX Cloud Alpha S is definitely a headset that was designed with gaming in mind, but also makes a great pair of headphones for listening to music while you work or on your commute to work or school. The price may be a bit steep for some, but it's an excellent investment if you're looking for a headset that is built with quality materials and is meant to last for several years."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Don't buy it if..."
  },
  "links": {
    "gaming headset": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "gaming chair.": "https://www.techradar.com/news/best-pc-gaming-chair-5-best-chairs-to-game-in-comfort",
    "SteelSeries Arctis 7": "https://www.techradar.com/reviews/steelseries-arctis-7-gaming-headset",
    "Animal Crossing New Horizons": "https://www.techradar.com/reviews/animal-crossing-new-horizons"
  }
}