{
  "source": "https://www.techradar.com/reviews/iwork-review",
  "title": "iWork review",
  "category": "computing",
  "updated": "2020-04-06T08:54:33Z",
  "author": "christian-rigg",
  "summary": "Is this the best free office suite available? Find out in our iWork review",
  "verdict": "iWork is a free office suite for creating well-structured text documents, eye-catching spreadsheets, and engaging presentations. Despite a few missing features, both macOS and iOS versions are intuitive and powerful.",
  "pros": [
    "Fantastic iPadOS version with full Pencil integration",
    "Intuitive, minimalist design"
  ],
  "cons": [
    "Lacks some key features that its competitors have (e.g., citation manager, advanced find & replace)",
    "Web app could use some real improvement"
  ],
  "article": [
    "Apple’s iWork is one of the best Microsoft Office alternatives out there. Available for macOS, iOS and as a web app, the iWork suite comprises a word processor—Pages, spreadsheet app—Numbers, and presentation builder—Keynote. Keep reading our iWork review to learn what makes this one of the best office suites.",
    "iWork is available as an app for macOS and iOS devices, and as a web app. One of Apple’s great software claims has been, “You already know how to use it.” For the most part, that’s true of iWork. It has a minimalist interface that hides a surprisingly rich set of customizations and settings.",
    "In each app, a row of buttons at the top enables you to show and hide visual elements like rulers or comments, access a collaboration menu, and add objects like charts, text, and shapes. Once on the page, personalizing those objects is quite intuitive. You can click on any chart, shape, or object to bring up a menu for changing its style and layout. Adding colors and gradients, adjusting text wrapping, and changing borders is also straightforward.",
    "We'll run through each app's features one-by-one.",
    "Pages",
    "Pages is a great free word processor. Text formatting is straightforward, enabling you to choose from predefined styles or create your own. We particularly liked how easy it was to create and adjust columns, tabs, and indents, which we found more intuitive than in MS Office. We also liked the wide range of clip art available, all of which can be customized by color, shadow, reflection, and opacity.",
    "Lists are easy to create, but the fact that style changes aren’t carried through to elements of the same level is regrettable, as is the fact that progressive levels don’t cycle through bullet styles. Furthermore, citation management isn’t a built-in feature, which is a big let-down for academics and professionals who need to manage and insert bibliographic elements. Finally, Find & Replace is very basic, and it’s not possible to find and replace special characters or styles.",
    "Numbers",
    "Numbers provides basic spreadsheet functionality, with some features we appreciated. For example, entering formulas is straightforward and made much simpler by the presence of a function glossary with definitions and use examples. Visually, we found the formula brackets style a little unusual, but liked that you could click on values within the formula to preserve the row or column (accomplished with $A$1 in Excel).",
    "Numbers is built to display data, not manipulate it, so data analysis functions were severely limited. Advanced filtering, What-If scenarios, and data validation are all absent. Graphs and charts, however, are simple to create and personalize, as is conditional highlighting.",
    "Keynote",
    "Keynote comes with some great templates, slide styles, and transitions that are easily customizable. Adding slides and elements is easy and intuitive, as is customizing them. Presentation mode was straightforward, and we especially loved that you can personalize the presenter display.",
    "Collaboration features",
    "Invites to collaborate can be sent by mail, iMessage, a pastable link, or AirDrop, with customizable permissions. These are limited to Edit and View Only, with a comments-only setting regrettably absent. Some features are disabled when collaborating, such as editing styles. Overall, however, collaborations are smooth and responsive. Changes appear in real-time, and iWork supports up to 100 collaborators on a single document, which is the same number as Google Docs. Document collaboration in Office 365 is determined by a specified Microsoft Team size, which can be up to 5,000 people.",
    "Unsurprisingly, iWork has some great apps for iOS and iPadOS. With the multitasking improvements made to iPadOS in recent years, the iWork apps help you take full advantage of your iPad or iPhone’s capabilities. The iPhone app is necessarily less ergonomic, but the iPad app is intuitive and reproduces remarkably well the interface and capabilities of its macOS counterpart. In fact, we failed to find any noteworthy discrepancies.",
    "We were impressed by how easily objects could be added, both advanced ones like dynamic charts and graphs, and simple images and shapes. iWork takes full advantage of your iOS device’s camera and microphone, so adding images, audio, and video is easy.",
    "Finally, we were thrilled—though not surprised—to find excellent Apple Pencil integration. Annotating documents and adding drawings is intuitive and enjoyable. The whole range of Pencil capabilities is expressed, including shading with the pencil lain flat, pressure sensitivity, and double-tap to erase. The whole experience was, in our experience, much more responsive and immersive than with the Office 365 mobile apps.",
    "Since 2013, iWork is also available online, so anybody with an iCloud account can access it. The web app works on Safari, Chrome, and Edge (Windows), and is useful in a pinch, but a bit limited overall. First, we were surprised to find that, because we had activated Tracked Changes on the iOS version, changes on iCloud were prohibited, which seems remarkably restrictive for a “collaborative” app.",
    "In fact, a wide range of features don’t work in the online version, notably equations, copying or pasting pages, editing master pages or slides, and many visual elements like gradients or shadows.",
    "iWork has been free since 2013. Anybody with an Mac, iPad, or iPhone can download and use the full software suite, and anybody with an iCloud account can access the web version. It can be installed on an unlimited number of devices.",
    "Overall, we found iWork to be an intuitive office suite. The suite features advanced word processing, dynamic and engaging slideshows, and eye-catching though analytically basic spreadsheets. There are some regrettable lacunae, notably that of a citation manager or an advanced find & replace function. The web app could benefit from improvement, but is acceptable in a pinch.",
    "Nonetheless, for both Mac users and iPad users, who will love the Pencil integration, this is some of the best office software out there, and it’s totally free.",
    "iWork is a feature-rich suite with deep collaborative functionality. If your business is Mac-based, it’s hard to do better, especially since it’s free. If you’re looking for greater customizability and more control over your data, OnlyOffice’s server-based suite is a good option. Price plans are variable, but a lifetime license for one server with 50 simultaneous connections costs just $1200. For a simpler solution that works well on Windows computers, OfficeSuite has a 5-user Group plan for $49.99/month, with spreadsheets that beat out iWork in both usability and power.",
    "FInd out more about iWork's competition in our guide to the Best Microsoft Office alternatives."
  ],
  "headers": {
    "1": "iWork: Interface",
    "3": "iWork: Features",
    "14": "iWork: Mobile and web",
    "19": "iWork: Pricing",
    "20": "iWork: Final verdict",
    "22": "iWork: The competition"
  },
  "links": {
    "iWork": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1045027694726167300&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fuk%2Fiwork%2F",
    "Microsoft Office alternatives": "https://www.techradar.com/news/best-microsoft-office-alternative",
    "OnlyOffice": "https://www.techradar.com/reviews/onlyoffice-review",
    "OfficeSuite": "https://www.techradar.com/reviews/officesuite-review",
    "Best Microsoft Office alternatives": "https://www.techradar.com/news/best-microsoft-office-alternative"
  }
}