{
  "source": "https://www.techradar.com/reviews/winx-dvd-ripper-free-edition",
  "title": "WinX DVD Ripper Free Edition review",
  "category": "computing",
  "updated": "2020-02-18T15:07:12Z",
  "author": "sofia-wycislik-wilson",
  "summary": "A free tool that makes DVD ripping as easy as pie",
  "verdict": "Get past the initial confusion about versions, and this is a marvellous ripping tool that would be easy to overlook due to unclear marketing.",
  "pros": [
    "Decent range of output formats",
    "Adjustable video quality",
    "Ready-made profiles for various devices"
  ],
  "cons": [
    "No Blu-ray support",
    "Doesn't bypass all protections",
    "Confusing licensing"
  ],
  "article": [
    "You will guess from the name that this is a DVD ripping tool, and it's free. But it's not quite that simple. It is worth pointing something out about it: there is no standalone version of WinX DVD Ripper Free Edition.",
    "Instead, when you download and install the program, you will actually install WinX DVD Ripper Platinum – the free version is integrated and includes just a subset of the options available in the full, paid-for Platinum version.",
    "You'll quickly notice that there appears to be a five-minute limit on ripping, but you can easily get around this by obtaining a free license code from the download page, or by downloading the 'giveaway' version of the software.",
    "The confusing marketing for the software has led to numerous reviews appearing online that suggest the free version does indeed have a five-minute limit. We can confirm – after quite some research – that it has no such limitation.",
    "You should note, however, that even with the free license code, it will appear as though you have WinX DVD Ripper Platinum installed, and you will see nag screens inviting you to upgrade to the full version of the software. Ignore this, and you have a highly capable tool on your hands.",
    "Once activated, WinX DVD Ripper Free Edition is an utter delight. You can use physical DVDs, ISO images or DVD folders as a source and you'll be offered the choice to ripping just the main movie, or backing up the entire contents.",
    "There are lots of ready made profiles for you to work with, and these let you quickly rip a disc to a video file in your preferred format, perfectly tailored for playback on specific types of device – so there are different settings for phones, tablets and desktop computers, or if you intend to use the content online.",
    "You can also crop and trim videos, choose which audio and subtitle streams should be included when ripping, and adjust settings such as resolution and frame rate. It's all presented in an incredibly easy-to-understand interface that should not appear intimidating to anyone."
  ],
  "headers": {
    "5": "User experience",
    "8": "You might also like"
  },
  "links": {
    "DVD ripping": "https://www.techradar.com/news/the-best-free-dvd-ripper",
    "WinX DVD Ripper Free Edition": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3922621302651646500&xs=1&url=https%3A%2F%2Fwww.winxdvd.com%2Fdvd-ripper%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwinx-dvd-ripper-free-edition",
    "download page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9909660754576974000&xs=1&url=https%3A%2F%2Fwww.winxdvd.com%2Fdvd-ripper%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwinx-dvd-ripper-free-edition",
    "the 'giveaway' version of the software": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1308396889637767700&xs=1&url=https%3A%2F%2Fwww.winxdvd.com%2Fdownload%2Ffree%2Fwinx-dvd-ripper-platinum-giveaway-file-direct.zip&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwinx-dvd-ripper-free-edition"
  }
}