{
  "source": "https://www.techradar.com/reviews/chartlogic",
  "title": "ChartLogic review",
  "category": "computing",
  "updated": "2020-04-07T18:00:00Z",
  "author": "jonas-p-demuro",
  "summary": "The more efficient path for a medical practice",
  "verdict": "ChartLogic offers a compelling Practice Management solution that integrates well with their EHR, but the lack of any upfront pricing is quite frustrating.",
  "pros": [
    "Toll free phone support",
    "Reduces claims rejections",
    "Choice of support options",
    "Flexible appointment scheduling"
  ],
  "cons": [
    "Opaque pricing",
    "Limited hours and only weekdays for support",
    "Lacks free trial",
    "Patient portal lacks some expected features"
  ],
  "article": [
    "ChartLogic originated in 1994, and has its headquarters in Salt Lake City, Utah. It was the first EMR in the US to be Meaningful Use Certified, and comprises a totally integrated ambulatory EHR suite that includes medical practice management, a patient portal, revenue cycle management, the electronic health record, e-prescribing and more. The company also offers services including Managed IT and MIPS consulting.",
    "ChartLogic indicates that their Practice Management product gets used by “Thousands of practices both large and small.” It also fits into the larger universe of ChartLogic products that includes the Electronic Health Record, and the Patient Portal.",
    "An important function of any practice management software is appointment scheduling. ChartLogic’s Practice Management features a dedicated Appointment Scheduler module. It is designed for a high degree of flexibility, that includes the ability to set up both new and recurring appointments, while accommodating the nuances of each doctor’s schedule. Patient Registration is another module, and it includes all relevant patient demographics such as insurance information, and goes beyond the usual to track physician referrals.",
    "The next modules focus on billing, and with a national rejection rate on claims of 30%, the stakes are high on a practice to ‘Get it right,’ and maintain cash flow. With the ChartLogic PM, the rate of claims rejection can go down to under 5% as the goal is to fix the billing issues before they get submitted. In fact, the intelligent claims scrubbing from ChartLogic indicates that 99% of the submitted claims are accurate to foster timely payments. Also, the billing staff can be managed via the dashboard that can be fully customized.",
    "There is also a module that is dubbed the Collection Center. This is dedicated to the automation of many tasks, to reduce the workload on the office staff, with the goal of an improvement in the collection process.",
    "Another useful feature of ChartLogic is the reporting function. After all, a great benefit of any electronic platform is not only to keep all the data organized, but to be able to transform it into actionable intelligence. Now, you no longer have to guess how the practice is really doing financially, but instead reports can be generated via the data analysis tools for categories like billing, and workflow analysis, for example, to generate an instant snapshot into the financial health of the practice.",
    "The drawbacks start with only a single platform supported- Windows, for the installed version of the software. The ChartLogic EHR is also available as a SaaS architecture, and can be used on a web browser on a variety of different devices, and platforms. It is also indicated that it should run in the Chrome, Firefox or Edge browser on Windows, and it can run on Chrome, Firefox and Safari on a MacOS machine. Unfortunately, there is a lack of apps for all mobile devices, including tablets and smartphones that are popular with busy clinicians when out of their offices.",
    "Another shortcoming is that while there is a free demo offered, there is no free trial. Obviously, the latter is preferred so a more thorough test drive can be done of the product before making the commitment to it.",
    "In addition, user reviews indicate that the patient portal is not user friendly, and is lacking in the functions that would make it more useful, including the scheduling of appointments, and to be able to request refills. Also, the load times for each page are slower than what would be expected slowing down the workflow.",
    "Support for ChartLogic is quite straightforward. The first choice is over the phone, via a toll free phone number. The second option is through email. Be aware that while a phone is HIPAA compliant, email most certainly is not, and no Protect Health Information (PHI) should be sent via this method. Also, the hours of operation are limited to 6 AM to 6 PM, Mountain Standard Time, and weekdays only.",
    "There is no option for chat, or an online portal for direct creation of a trouble ticket.",
    "Additional resources include whitepapers such as “How To Promote Your Patient Portal,” webinars and videos in the ChartLogic Resource Library.",
    "Pricing for ChartLogic is unfortunately not available on their website. The process requires the buyer to contact sales, and provide their contact information so that a custom quote can be provided. While this is fairly standard for this product segment, it can be a barrier to a busy practice eager to find a solution by rapidly pricing out multiple solutions. At least there is a choice of contact methods provided, including a toll free phone number, email, chat and an online portal.",
    "In addition, the pricing is very opaque, and searching for it did not produce any hint of the price. What was gleaned, from the ChartLogic site, is that the product is subscribed to by the module, including Practice Management, Patient Portal and EHR, with the benefit of discounts for bundling the products together.",
    "ChartLogic offers a neat solution for Practice Management that works hand in hand with their EHR. The pros include toll free support, the intelligent claims scrubbing to submit clean claims that get paid faster, and the robust appointment scheduling to accommodate the various needs of providers. The drawbacks give us pause for concern, such as the offer of only a free demo and not a true trial, the restricted hours and only weekdays to receive support, and the completely opaque pricing. Balancing this out leads us to conclude that ChartLogic is worth a look."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "9": "Support",
    "12": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "ChartLogic": "https://www.chartlogic.com/solutions/practice-management/",
    "EMR": "https://www.techradar.com/best/best-electronic-medical-record-emr-software",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software",
    "Practice Management": "https://www.techradar.com/best/best-practice-management-software",
    "How To Promote Your Patient Portal": "https://www.chartlogic.com/resources/promote-patient-portal/",
    "ChartLogic Resource Library": "https://www.chartlogic.com/resource-type/videos/"
  }
}