{
  "source": "https://www.techradar.com/reviews/dell-xps-17-2020",
  "title": "Dell XPS 17 (2020) review",
  "category": "computing",
  "updated": "2020-09-29T17:03:07Z",
  "author": "matt-hanson",
  "summary": "Can Dell’s supersized laptop compete?",
  "verdict": "The Dell XPS 17 (2020) is a brilliant 17-inch Ultrabook that is impressively thin and light for such a big laptop. Excellent performance, a gorgeous screen and fantastic battery life are all standout features.",
  "pros": [
    "Nice design",
    "Great screen",
    "Long battery life",
    "Powerful"
  ],
  "cons": [
    "Won't be for everyone",
    "Not the most portable",
    "Lack of ports"
  ],
  "article": [
    "The Dell XPS 17 (2020) is the latest big-screen entry in the company’s successful XPS lineup, which includes the XPS 13 and XPS 15 – both laptops that sit at, or near, the top of our best laptops list.",
    "As the name suggests, this is an XPS laptop with a large 17-inch screen, which along with new 10th generation Intel processors, and Nvidia RTX GPUs, plus up to 32GB of RAM, means this is a serious productivity machine that’s ideal for content creators.",
    "The Dell XPS 17 (2020) comes in a range of specifications and prices, which is great for people who want flexibility to choose a laptop that best suits their needs and budget. It means you can get a version that offers you the power you need without charging you extra for a level of performance you won’t make use of. By that same token, you could also up certain components, such as adding more RAM, to ensure it will keep up with the tasks you require it to perform.",
    "The price starts at $1,399.99 / £1,619 / AU$3,399 for the entry level model, and goes up to $3,799.99 / £3,364 / AU$5,354. Not a cheap laptop, then.",
    "However, you’re getting a supremely stylish device for your money, and Dell has done a great job of fitting a 17-inch screen (more on that in a moment) into a laptop size that’s not much larger than many 15-inch devices.",
    "While this isn’t the most portable of laptops, for a 17-incher, it’s impressively thin and easy to carry around, with Dell’s renowned style and build quality.",
    "The real star of the show, though, is the stunning 4K screen. It looks fantastic, and offers accurate colors for photographers and other digital creatives.",
    "Overall performance is excellent, as you’d expect from a laptop that features 10th generation Intel processors, bags of RAM and even an Nvidia RTX 2060 graphics card. While this isn’t a gaming laptop, it is a fantastic choice for content creators who want something a little larger to work on. Oh, and its battery life goes well beyond 10 hours, even when performing pretty strenuous task, which is great to see.",
    "As with other Dell laptops, the XPS 17 (2020), also known as the Dell XPS 17 9700, comes in a number of configurations and prices. Its starting configuration comes with a 10th-generation Intel Core i5-10300H CPU, 8GB of RAM and 256GB of SSD storage for $1,399.99 / £1,619 / AU$3,399.",
    "There’s then a whole range of configurations up to the highest-end model, which features an Intel Core i9-10885H CPU, 32GB of RAM, 1TB of SSD storage and an Nvidia GeForce RTX 2060 with Max-Q graphics card for £3,364 / AU$5,354.",
    "That model doesn’t seem to be available in the US. Instead, there’s a model with double the RAM and storage (but the same CPU and GPU) for $3,799.99. There’s also a model with 16GB RAM and 512GB SSD (and the same CPU and GPU) for $2,499.99.",
    "The model we’ve been sent to review features an Intel Core i7-10875H processor, 16GB of RAM, 1TB SSD and the Nvidia RTX 2060, which sells for $2,849.99 / £2,599. This model, however, isn’t available in Australia.",
    "The amount of configuration options is in many ways a good thing, as it means you should be able to find a Dell XPS 17 that suits both your needs and your budget. However, as you can see, there are inconsistencies with what exactly you can get, depending where you live, and that can be frustrating.",
    "Meanwhile, the Dell XPS 15 (2020) starts at $1,299 / £1,599 / AU$3,698, and can also be configured in a variety of ways, though it doesn’t benefit from the RTX 2060 GPU – the highest end XPS 15 gets by with the GTX 1650 Ti, a less powerful GPU.",
    "Unsurprisingly, the design of the Dell XPS 17 (2020) is very similar to that of the XPS 13 and XPS 15 – just on a bigger scale. That's no bad thing, of course, as those are two of the nicest looking laptops on the market right now.",
    "Making a thin and light laptop with a 17-inch screen is no mean feat, but Dell does a good job here, with dimensions of 9.76 x 14.74 x 0.77 inches (248.05 x 374.45 x 19.5 mm) and a weight of 4.65 pounds (2.11 kg).",
    "If you compare that to the dimensions of the XPS 15 - 9.06 x 13.57 x 0.71 inches (230.14 x 344.72 x 18 mm), with a weight of 4.5 pounds (2.05 kg), you can see what a good job Dell has done of producing a 17-inch laptop that isn't much larger and heavier than the 15-inch model.",
    "Part of this is thanks to the four-sided InfinityEdge display, which in plain English means there are impressively thin bezels surrounding the actual display. This means you’re getting as big a screen as possible without making the rest of the laptop too big.",
    "Dell states the XPS 17 has a screen to body ratio of 93.7%, and it shows. Not only do the thin bezels keep the overall size of the XPS 17 (2020) down, but it looks nice and modern as well. Laptops with thick bezels are beginning to feel decidedly old fashioned. Unlike some laptops, the Dell XPS 17 doesn’t sacrifice a webcam just for thin bezels. The XPS 17 has a 720p webcam, and dual-array microphones, situated at the top of the screen. We’re glad to see it there, rather than positioned at the bottom of the screen, like Dell used to position it",
    "While Dell has done a good job of putting, in its words, “a 17-inch screen in a 15-inch size form factor,” and claims it is “smaller than 48% of 15-inch laptops,” this is still a large and heavy laptop. If portability is your main objective, you’re better off going for a 13-inch laptop.",
    "And, while it’s lighter and thinner than many other 17-inch laptops, like the Razer Blade Pro 17, the MacBook Pro 16-inch is thinner and lighter – though admittedly with a slightly smaller screen.",
    "So, the Dell XPS 17 (2020) isn’t a laptop for people who want something to carry around easily, but then no 17-inch laptop really is. However, if you want the extra screen size and want something as portable as possible, the XPS 17 is an excellent choice.",
    "This is a well-built laptop, which you’d expect from a premium Dell laptop. However, if you were hoping the extra size would mean a wider selection of ports, then you’ll be disappointed, as it only comes with four Thunderbolt 3 ports and a headphone and microphone port – the same found on the MacBook Pro 16-inch.",
    "Although the Dell XPS 17 isn’t as overtly pitched at professionals as the MacBook Pro, it is still a laptop that will predominantly be bought by professionals due to the price and power on offer. So, having to live with just USB-C ports may be an issue for people who need to plug in legacy USB devices. It’s something we’ve criticized the MacBook Pro for, but to be fair, the XPS 17 at least also offers a built-in memory card reader, which will be great news for photographers. Dell also includes an adaptor in the box for plugging older USB devices into USB-C, a nice touch that Apple doesn’t bother with.",
    "Returning to the screen, this really is a gorgeous display for a laptop. With a 16:10 aspect ratio, it means it’s slightly taller than standard widescreen (16:9) screens, and that extra bit of screen real estate will help with apps you usually use in portrait mode – such as Microsoft Word. It also means it’s got (on certain models, at least) a 4K Ultra HD+ resolution of 3,840 x 2,400, which handily beats the MacBook Pro 16-inch resolution of 3,072 x 1,920. Even with the larger screen size, that means there’s a higher pixel density with the Dell XPS 17, which results in a sharper, and more detailed, image.",
    "The screen also supports 100% Adobe RGB and 94% DCI-P3 color gamut, so it does an excellent job of accurately displaying colors, which is great news for photographers.",
    "Overall, the Dell XPS 17 is one of the nicest looking 17-inch laptops we’ve seen, successfully taking a lot of what we love about the XPS 13 and XPS 15, and successfully applying it to a larger laptop.",
    "With the XPS 17, Dell has proved if you want a bigger screen on your laptop, you don’t have to put up with a bulky and cumbersome device.",
    "As we mentioned earlier, the model we’ve got in for review comes with an Intel Core i7-10875H processor, 16GB of RAM, 1TB SSD and the Nvidia RTX 2060 graphics card.",
    "That processor is a new 10th generation Comet Lake part with eight cores and 16 threads, with a base clock of 2.3GHz and a max clock of 5.1GHz. In short, it’s an excellent mobile processor that offers very good performance, especially when multitasking, without being too power-hungry.",
    "Coupled with a large and fast 1TB SSD and 16GB of RAM, and you’ve got a laptop that runs Windows 10 and demanding apps with ease. In day-to-day use, the Dell XPS 17 (2020) doesn’t put a foot wrong, and when it comes to photo and video editing, it also did a great job.",
    "The Nvidia RTX 2060 GPU is a powerful enough card to handle video editing and 3D modelling, and even a spot of gaming – even though the Dell XPS 17 is definitely not a gaming laptop. Still, to get an idea of its prowess we ran some gaming benchmarks, and it put in a decent showing – managing 43FPS (frames per second) on Metro Exodus at Ultra settings – a graphically intensive game.",
    "Still, as we said, this is not a gaming laptop primarily. The choice, then of an RTX 2060 is a good one, we think. This is Nvidia’s current entry level RTX graphics card, so you get the benefits of features such as realistic ray tracing lighting effects (both in games and in 3D modelling and design applications), and with 6GB of GDDR6 memory, this will be plenty powerful for most video editing needs – however when handling 4K graphics it’s going to struggle.",
    "The fact that Dell has packed some very powerful components into a thin and light laptop is to be commended, and the XPS 17 (2020) doesn’t get hot to touch, nor do the fans get too loud, when in use.",
    "The built-in speakers are also decent, with ‘Waves Nx’ 3D audio that have been professionally tuned. The sound they produce is still a bit thin – I don’t think built-in laptop speakers are ever going to truly impress – but they do a fine job if you want to watch or listen to media every now and again.",
    "The Dell XPS 17 (2020) offers an excellent level of performance that you’d hope for with a laptop of this price. For content creators, and even people dabbling in a bit of 3D modelling, this is an excellent choice.",
    "While the overall performance of the Dell XPS 17 (2020) impressed us, what really impressed us was the battery life, with the laptop lasting 12 hours and 43 minutes in our battery benchmark, which loops a 1080p video at 50% brightness.",
    "The PC Mark 10 battery benchmark, which tests how long the device will last when performing more intensive tasks, such as video conferencing, the Dell XPS 17 (2020) again did very well, lasting 10 hours and 44 minutes. This means even with the powerful components and high-resolution screen, the Dell XPS 17 will last you a whole work or school day without needing a charge. Of course, for very intensive stuff, like 3D rendering, the battery will deplete faster.",
    "Still, this is an excellent result for a powerful and large Ultrabook, and challenges Apple in the battery stakes – as its MacBooks have long beaten Windows 10 competitors when it comes to battery life. Until now.",
    "Dell claims that the model with a full HD+ resolution, rather than the 4K+ one we tested, goes even further, with up to 23 hours of battery life. That’s quite a claim, but maybe not out of the question, considering how well the 4K model does."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and availability",
    "14": "Design",
    "28": "Performance",
    "36": "Battery life",
    "40": "Don't buy it if..."
  },
  "links": {
    "XPS 13": "https://www.techradar.com/reviews/dell-xps-13-2020",
    "XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Razer Blade Pro 17": "https://www.techradar.com/reviews/razer-blade-pro-17-2020",
    "MacBook Pro 16-inch": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "Comet Lake": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features"
  }
}