{
  "source": "https://www.techradar.com/reviews/huawei-mate-xs",
  "title": "Huawei Mate Xs review",
  "category": "phones",
  "updated": "2020-03-26T15:18:10Z",
  "author": "abbas-jaffar-ali",
  "summary": "The foldable phone done right",
  "verdict": "A foldable phone that expands into a tablet has been thought of as the next form factor for mobile devices. Huawei has thrown conventional design out of the window with Mate Xs by placing the foldable screen on the outside and we think this design makes great sense as you're not stuck with a secondary smaller display. What remains to be seen is if the Mate Xs can prove to be durable enough for the long run. It's a pricey proposition and without Google's framework, it requires you place your faith in Huawei.",
  "pros": [
    "The best foldable phone design",
    "Flagship level performance and features",
    "Excellent camera"
  ],
  "cons": [
    "No access to Google Apps",
    "Very expensive",
    "Uncertainty about the longevity of the screen"
  ],
  "article": [
    "The Mate Xs is the latest foldable phone from Huawei and improves upon the original Huawei Mate X in a number of ways. It features an improved Falcon Wing hinge design that is stronger and makes it easier to unfold the Mate Xs.",
    "Huawei has also improved the durability of the phone with a quad layer construction using polyamide film.",
    "Unlike every other foldable phone that we have seen where the foldable screen is protected inside a clam shell and complemented by an external screen, Huawei sticks the screen on the outside perimeter of its Mate X devices.",
    "The advantage to this design is that you have the primary screen readily available and it's all part of one big display, but this also may make it more susceptible to damage.",
    "We found the use case of the Mate Xs very different to the Galaxy Fold, even though both these foldable phones unfold to provide you a larger screen. With the Galaxy Fold, the external 4.6–inch external screen felt too small for regular usage and the device needed to be unfolded almost every time we wanted to do more than a call or answer a quick text.",
    "That's not the case with the Mate Xs where we used the display more frequently in its folded state than the unfolded state.",
    "In its folded state, the screen is sized at 6.6-inches which is large enough to compete with non-foldable flagship phones. When unfolded, the 8-inch screen on the Mate Xs is a sight to behold, and that's especially the case as there's no notch. It’s a great replacement to a small sized tablet and that’s exactly how we used it- sitting on a couch with a cup of coffee or in bed before turning the lights out.",
    "The Mate Xs features Huawei’s latest Kirin 990 5G chipset which is built on 7nm+ technology and is the only chipset with an integrated 5G modem. Huawei also provided a very generous 512GB of storage on the Mate Xs and while 8GB of RAM handled all the apps we threw at it without any issues, we would have liked to see Huawei equip it with 12GB to make it a bit more future proof.",
    "The primary camera on the Mate Xs is a Leica branded 40 MP, f/1.8 primary camera with an RYYB sensor that’s capable of taking great low light shots. Also present is an 8 MP, f/2.4 telephoto lens fixed at 52mm or 3X zoom and a 16 MP, f/2.2, 17mm ultra-wide module.",
    "Huawei has pretty much been at or around the top when it comes to phone cameras and the Mate Xs keeps that going with a versatile camera system that sports AI capabilities for impressive shots. An advantage on the Mate Xs is that the primary camera system also works as the selfie camera with the screen folding around the back allowing you to take as impressive selfies.",
    "All of this tech is powered by a 4,500mAh battery that lasts you all day and can be charged quickly using the included 45W charger. The phone lacks wireless charging which is a tradeoff we are willing to accept considering that the screen wraps around back.",
    "What is harder to swallow is the lack of Google Apps and the price tag - the Mate Xs is an expensive phone at £2,299 / AED 9,999 (around $2,746 / AU$4,205). Then again, this phone isn’t targeted towards the average consumer and considering that all foldable phones are expensive, it isn’t surprising.",
    "Want to find out more about how we found the Huawei Mate Xs? Read on below:",
    "Huawei announced the Mate Xs at the end of February 2020, and you can now buy it in the UK and UAE. Orders in the UAE are shipping by March 29, but those in the UK are able to get it immediately from Carphone Warehouse.",
    "If you thought smartphones had reached their pinnacle with pricing, think again. The Huawei Mate Xs is priced at £2,299 / AED 9,999 (around $2,746 / AU$4,205). and there is only one configuration available for it which is with 8GB RAM and 512GB storage.",
    "Foldable phones are all expensive and the Mate Xs is no exception though it is pushing boundaries with its pricing. That being said, there is no foldable phone like it in terms of design and with the lack of GMS, the Mate Xs is definitely not for everyone. By pricing it on the higher side, Huawei is playing the exclusivity game.",
    "All the foldable phones that we’ve seem so far hide the foldable screen inside the device, whether that’s the Galaxy Fold, Galaxy Z Flip or the Motorola Razr. What this leads to is a primary display that’s hidden most of the time and complimented by a secondary display. Huawei throws that notion out of the window by bending the main screen outwards, so that the same screen can be used in both a folded and unfolded state.",
    "There's a button on the back that springs the display up about 60 degrees. Then, you raise it further to a fully flat state where it snaps into place. The reverse of this process locks the screen back onto the phone and that's how it manages to keep the screen flat when the Mate Xs is in folded state.",
    "In a folded state, the OLED screen size is 6.6-inches in size which is about the size of a screen you find on most large phones. It has a resolution of 2480 x 1148 and is bright enough to be used outdoors in the sun with ease.",
    "The bezels around the screen are slightly thicker than other recent phones, but there's no notch or punch-hole camera taking up space within the screen.",
    "Unfolding the display results in a gigantic 8-inch screen with a 2480 x 2200 resolution. The unfurled display is a joy to use and we can comfortably say it's the best foldable display we’ve seen so far.",
    "There is a crease in the middle that’s only visible at certain angles. You don’t feel it as much as you may expect because you’re mostly interacting with the sides of the screen due to its large size. Think of it as a tablet in your hand when unfolded.",
    "Obviously the biggest question about the foldable display on the Mate Xs is about its durability. Considering that the screen is always exposed, would it hold up over time? That is something that we can’t answer yet as we’ve only had the phone for a short amount of time.",
    "What we can tell you is that we used the Mate Xs like any other phone (and it wasn't in a case) which means it slid across the desk and rested in cup holders while driving. So far, the screen has held up well. A little care would definitely go a long way with any foldable phone though, and it's something you should think about when considering the Mate Xs.",
    "The Huawei Mate Xs is a sturdily built phone that feels dense and heavy. At 300 grams, it’s definitely on the weighty side that is felt when using it one-handed for an extended period.",
    "The bulk of components sit along the left edge of the Mate Xs, which is thicker than the rest of the phone. Huawei has implemented a smart design as this thicker edge not only houses all the components and the camera but allows you to grip the unit when unfolded in a similar way to the design on the Kindle Oasis.",
    "Past this strip, the phone is very thin at just 5.5mm, which allows it to fold into something that’s around 11mm thick.",
    "The right side of the device holds the volume buttons and the power key, which also has a fingerprint sensor embedded. The position of the power button is just a tad bit higher than the middle making it easy to reach, plus our testing found the fingerprint sensor to be fast and accurate.",
    "At the bottom sits the USB Type-C connector placed towards the right. There is no 3.5mm jack on the Mate Xs though, so instead Huawei has bundled USB Type-C headphones in the box.",
    "On the top edge of the phone sits the hybrid dual SIM tray that can either accept two nano-sized SIM cards or one SIM card and one NM type of memory card.",
    "Since the Mate Xs has its display on its outside, you are holding a plastic screen which has a much different feel to it than glass and metal. It not necessarily good or bad - it just feels different, though it does attract a lot of fingerprints which show when the screen is off.",
    "New Huawei phones aren’t equipped with Google Mobile Services (GMS) due to the US Government restrictions of what many publications are calling the Huawei ban. Huawei has started building its own framework (Huawei Mobile Services) and it attempting to replace the Google Play Store with its new App Gallery. That’s what you get on the Mate Xs.",
    "While there are third-party apps available on App Gallery such as TikTok and Microsoft Office, it still has a lot of catching up to do.",
    "You won’t find any of the Google Apps on it (that's things like YouTube, Gmail or Chrome) and, at the time of this review, there aren't other popular apps such as Snapchat, Facebook, Instagram or WhatsApp.",
    "Huawei is expected to make some big announcements over the next few months for the App Gallery and we wouldn't be surprised if some of these services end up porting over to its store. There's no gurantee that'll be the case though, and you're severely limited with alternatives to Google's services.",
    "That being said, we had both Instagram and WhatsApp running fine on the Mate Xs by downloading their respective APK files. As long as you know what you’re getting into, the Mate Xs can handle most Android apps but there's a lot of hassle to get them.",
    "You will also run across apps will might install but rely on Google's framework to function as they're supposed to. That makes them essentially unusable on the Huawei Mate Xs.",
    "Coming to the built-in apps by Huawei, some of them make use of the advantages of the unfolded display state. For example, the Mail and Notes app from Huawei have two panes giving them a desktop-like experience.",
    "Even the internet browser app displays tabs on top making it easier to switch between them like you do on a computer.",
    "Third party apps, especially ones designed for tablets scale well on the Mate Xs. Apps such as the Palabre RSS reader and Reddit provide a solid experience in our testing. Games also look fantastic on the large screen, while some 16:9 videos don't scale well on the Mate Xs' squarish aspect ratio.",
    "Multi-tasking is handed quite well on the Mate Xs where you can drag apps from a side panel and have two displayed side-by-side with each app taking about the same size as it would on a regular smartphone display. A third app can also be included as a floating window letting you work on three things at one time.",
    "Huawei has pretty much been at, or at least around, the top of the game when it comes to phone cameras for the last couple of years. The Mate Xs has a versatile camera system that we found could take some very impressive shots and featured a fantastic zoom mode.",
    "The camera system is made up of three cameras. The Mate Xs features a Leica branded 40MP, f/1.8 primary camera with an RYYB sensor that’s capable of taking great low light shots.",
    "The primary camera is then paired with an 8MP f/2.4 telephoto fixed at 52mm and a 16MP f/2.2 17mm ultra-wide module. That's a largely similar camera to what we've seen on flagships like the Huawei P30 Pro but it isn't quite as good on the Mate Xs.",
    "Using a combination of hardware and software, the Mate Xs can take photos up to 30x zoom and videos up to 10x zoom. We recommend sticking to a max of 10x on photos and 5x on videos for better quality footage,",
    "An advantage on the Mate Xs is that the primary camera system also works as the selfie camera.",
    "You can simply rotate the phone and the screen on the back shows you what the camera is looking at, effectively making it one of the best selfie cameras on a phone right now.",
    "Besides taking a selfie, you can also show the subject their framing using the back screen on the phone. Here are some sample shots from the Mate Xs camera:",
    "Huawei has equipped the Mate Xs with its latest chipset which is the 7nm+ based Kirin 990 along with 8GB RAM and 512GB of storage. While we had no complains on the performance of this device, we were surprised to not see it equipped with 12GB RAM like the Samsung Galaxy S20 Ultra.",
    "The Kirin 990 chipset has an integrated 5G modem that supports some but not all 5G networks. That may mean your network or carrier will be able to support the Huawei Mate Xs, but this is something you'll want to check with your service provider before buying the Mate Xs.",
    "The Mate Xs is equipped with two batteries packs that combined offer a capacity of 4,500mAh. We found it held up quite well during our testing, and it always lasted a full day from a single charge.",
    "Most of the days in our testing had over 35% charge left by the end of the day and only during one instance where we used Waze for 3 hours of driving and extensively used the camera were we left with less than 5% by the end.",
    "For a quick recharge, Huawei bundles a 55W charger in the box. We’re disappointed that the Mate Xs doesn’t support wireless charging, but the design of the phone with the screen wrapping around the back doesn’t really allow for wireless charging with current tech.",
    "First reviewed: March 2020"
  ],
  "headers": {
    "0": "Huawei Mate Xs two-minute review",
    "13": "Huawei Mate Xs release date and price",
    "16": "Design and display",
    "24": "Design",
    "31": "Software",
    "41": "Camera",
    "48": "Performance and battery life",
    "53": "Don't buy it if..."
  },
  "links": {
    "Huawei Mate X": "https://www.techradar.com/reviews/huawei-mate-x",
    "Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "Motorola Razr": "https://www.techradar.com/reviews/motorola-razr",
    "Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2019-review",
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review"
  }
}